{
    "case_title": "Crescendas Bionics Pte Ltd vJurong Primewide Pte Ltd",
    "ncitation": "[2019] SGHC 04",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1 The plaintiff is Crescendas Bionics Pte Ltd, a Singapore registered entity that was incorporated as a property developer.1Foot Note 1×Statement of Claim (Amendment No. 3) at para 1.The plaintiff is part of the Crescendas Group. Mr Lawrence Leow Chin Hin (“PW1”), a key witness for the plaintiff, is the Chief Executive Officer of the Crescendas Group and a director of the plaintiff.2Foot Note 2×Affidavit of Evidence in Chief of Lawrence Leow Chin Hin dated 25 July 2018 (“Mr Leow’s AEIC”) at paras 1 and 4. 2 The defendant is Jurong Primewide Pte Ltd, a general building contractor, registered as a Grade A1 contractor with the Building and Construction Authority (“BCA”).3Foot Note 3×Statement of Claim (Amendment No 3) at para 4.The defendant is a wholly owned subsidiary of Jurong International Holdings Pte Ltd (“JIHPL”).4Foot Note 4×Statement of Claim (Amendment No 3) at para 4.On 30 June 2008, the plaintiff and the defendant signed the Letter of Intent dated 26 June 2008 (“the LOI”). This four-page document was the only written contract signed by the plaintiff and the defendant. The parties agree that the LOI is binding on them. In the LOI, the plaintiff engaged the defendant as the management contractor to build a seven-storey multi-user business park development with two levels of basement carpark at Biopolis Drive/Biomedical Groove (“the Project”).5Foot Note 5×Affidavit of Evidence in Chief of Tang Tat Kwong dated 25 July 2018 (“Mr Tang’s AEIC”) at para 4. See also Mr Leow’s AEIC at paras 2 and 25 and 2JCB00786 – 2JCB00790.The LOI stated that the contract sum for the Project was $95,870,000 (the “Contract Sum”).6Foot Note 6×2JCB00786. 3 The LOI was not the typical conventional construction contract. It was based on the model of a Guaranteed Maximum Price (“GMP”) contract that was proposed by the defendant. Under the GMP contract, the defendant guaranteed a maximum price that the plaintiff would be required to pay for the Project, subject to any legitimate adjustments to the GMP due to additional scope of works which were outside what the parties had contracted under the LOI. Based on the GMP contract, the “out-turn cost” is the cost actually incurred for the Project. Under the LOI, the out-turn cost is calculated by adding all the costs incurred for the work done by the trade contractors engaged by the defendant for the Project. Should the out-turn cost exceed the GMP, the plaintiff would only be liable up to the GMP and the defendant would have to bear the costs exceeding the GMP.7Foot Note 7×Mr Tang’s AEIC at para 7. See also Mr Leow’s AEIC at paras 11 – 18. 4 However, if the GMP exceeds the out-turn cost, the parties agreed to share the difference or savings equally.8Foot Note 8×2JCB00787.I shall refer to the difference between the GMP and the out-turn cost (if it is a positive figure) as the “shared savings”. In other words, under the LOI, the plaintiff was required to pay 50% of the shared savings (if any) to the defendant. 5  The LOI further stipulated that the plaintiff would pay the defendant for the provision of preliminaries (“Preliminaries Sum”).9Foot Note 9×2JCB00786.“Preliminaries” refer to all the groundworks done by the defendant that do not typically form the permanent structure of the building and do not come within the scope of work of the various trade contractors and their trade preliminaries for the Project. The preliminaries works that the defendant were to provide typically included the provision of a site office, vehicle washing point, preparation of the progress reports, provision of plant and equipment (eg, tower cranes) and employment of site staff to manage the whole work site of the Project.10Foot Note 10×Mr Tang’s AEIC at para 10.In other words, the defendant, being a management contractor, provided the management contractor’s preliminaries for the Project. 6 The LOI also required the plaintiff to pay the defendant a management fee (“Management Contractor’s Fees) and the “Profit and Attendance” for the Provisional Items provided by the defendant. “Provisional Items” are works which are not included in the calculation of the GMP. However, the LOI stipulated that the defendant was nonetheless entitled to make a profit from the appointment of sub-contractors for the Provisional Items and for the costs associated with the provision of attendance (ie,the provision of water, power and other main contractor’s preliminaries to enable the sub-contractor for Provisional Items to carry out its work). Finally, the LOI stipulated the start date of the Project, and that it had to be completed within 18 months. There was also a provision on liquidated damages.11Foot Note 11×2JCB00787 and 2JCB00788. 7 After the LOI was executed, the relationship between the parties began to deteriorate as the parties disagreed on their respective obligations and the scope of their responsibilities under the LOI. This was partly because the parties did not execute a detailed contract. Their effort to agree on a detailed contract was hampered by their disagreement on the scope, duties, responsibilities and the cost breakdown of the defendant’s preliminaries works. In fact, the parties had commenced the piling works on the Project even before the LOI was signed. As a result, there were numerous disagreements between the parties. Particularly, the plaintiff disagreed on the quantum of the Preliminaries Sum and whether the defendant was required to provide an on-demand performance bond under the LOI. The plaintiff also alleged that during the discussions between the parties after the LOI was signed, the defendant had agreed to forgo its share in the first $5 million of shared savings. The plaintiff also felt that the defendant was overcharging and double-charging the plaintiff for work done. The defendant disagreed with all the plaintiff’s allegations. A deep distrust between the parties soon plagued their relationship after the LOI was signed. 8 Despite these disagreements, and in the interest of completing the Project, the plaintiff made all the payments under the LOI to the defendant, less $155,000 which is the sum counter-claimed by the defendant as the cost incurred by the defendant for the procurement of the conditional bond obtained from Oversea-Chinese Banking Corporation Limited (“OCBC Bond”).12Foot Note 12×Agreed Statement of Facts at Annex A.In total, the plaintiff paid the costs of all the trade packages, including the preliminaries of the trade contractors, the Preliminaries Sum of $12.3 million less $155,000, the defendant’s Management Contractor’s Fees and the defendant’s share of the shared savings which the plaintiff alleged was agreed to be calculated as follows: 0.5 x (total shared savings - $5 million). The plaintiff, nonetheless, reserved its rights to resolve the dispute over the quantum of the Preliminaries Sum under the LOI in court.13Foot Note 13×Agreed Statement of Facts at Annex A. 9 The Project was eventually certified as completed on 12 January 2011 by the Superintending Officer (“SO”), Jurong Consultants Pte Ltd (“JCPL”), which was appointed by the plaintiff.14Foot Note 14×Agreed Statement of Facts at para 41.The parties agreed that this exceeded the stipulated time period required of the defendant to complete the Project under the LOI. 10 Prior to the start of the trial, the parties had successfully resolved some of the claims raised in their pleadings leaving the following outstanding disputes for this court to consider: (a) Was the Preliminaries Sum for the defendant, the management contractor, agreed by the parties under the LOI to be $12.3 million? (b) Did the defendant agree to waive its first $5 million of the shared savings? (c) Was the defendant entitled to its counterclaim of $155,000 which was the cost incurred to secure the performance bond? (d) Were the delays in the completion of the Project due solely to the defendant or were both the plaintiff and the defendant responsible for the delays?15Foot Note 15×Opening Statement of the Defendant (in original action) at paras 2 – 4. (e) Is the plaintiff entitled to liquidated damages for the delay? (f) Is the plaintiff entitled to a refund of the additional preliminaries it paid to the defendant for the delay in the Project’s completion? 11 As this trial was bifurcated, I shall only determine the liabilities of the parties. The assessment of damages will be determined at a later stage.",
        "Background": "",
        "Events leading up to the signing of the LOI": "12 Sometime in 2007, Mr Tang Tat Kwong (“DW1”), the Chief Executive Officer of JIHPL, which is the parent company of the defendant, and PW1 representing the Crescendas Group, agreed to make a joint bid for the development of the Project. The plaintiff was used as the vehicle to make the joint bid for the development of the Project.16Foot Note 16×Mr Leow’s AEIC at paras 4 and 5. 13 This culminated in the execution of a Heads of Agreement dated 29 October 2007 (“HOA”) signed by Accrington Pte Ltd, the plaintiff’s parent company, and JIHPL. Under the HOA, the plaintiff was required to engage the defendant as the management contractor for the Project.17Foot Note 17×Agreed Statement of Facts at para 1. See also Mr Leow’s AEIC at para 6. 14 In or around December 2007, the plaintiff was awarded the contract to develop the Project. Pursuant to the HOA, it entered into discussions with the defendant to negotiate the contract sum and the scope of work that the defendant would provide as the management contractor for the Project.18Foot Note 18×Mr Leow’s AEIC at para 9. 15 In accordance with the HOA, the plaintiff appointed JCPL as the design consultant and the SO of the Project.19Foot Note 19×1JCB00165.JCPL developed the design intent of the Project with input from the defendant. JCPL also developed and issued the architectural design drawings, which were used by the defendant (as management contractor) to engage the trade contractors. In turn, the defendant developed the relevant detailed drawings for the construction of the various works in the Project.20Foot Note 20×Mr Leow’s AEIC at paras 71 and 72. 16 In early May 2008, JCPL’s scope of work was reduced as the defendant took over the design, development and supervision of the temporary and permanent structural works which included the piling works. The defendant informed the plaintiff and JCPL that it would be able to reduce the cost of the reinforced concrete works (“RC works”) by doing so and hence enjoy substantially higher shared savings. To achieve this, the defendant appointed Parsons Brinckerhoff Pte Ltd (“Parsons”) as its consultant engineers for the temporary and permanent structural works.21Foot Note 21×Mr Leow’s AEIC at para 73. 17  On the recommendation of the defendant, the plaintiff engaged WT Partnership to prepare a cost estimate for the Project.22Foot Note 22×Agreed Statement of Facts at paras 3 and 7.WT Partnership was the Quantity Surveyor involved in a recent development of a biological science building in the vicinity known as Biopolis II.23Foot Note 23×Agreed Statement of Facts at para 2.As Biopolis II was of a similar nature to the Project, the parties believed that WT Partnership would be familiar with the scope and pricing of the works required for the Project.24Foot Note 24×Mr Leow’s AEIC at para 16.To assist the plaintiff in planning for the finances of this Project, WT Partnership prepared a document dated 13 March 2008 which laid down the estimate of the costs that would be involved in the Project (“WT Cost Estimate”).25Foot Note 25×1JCB00495 – 1JCB00507.It is not disputed that the plaintiff received the WT Cost Estimate and reviewed it thoroughly. 18 For the negotiation of the LOI the plaintiff was represented by PW1, Mr Onn Soon Lee (“PW2”), Mr David Loh Weng Keong (“Mr David Loh”) and Mr Patrick Teo (“Mr Teo”).26Foot Note 26×Affidavit of Evidence in Chief of Onn Soon Lee dated 25 July 2018 (“Mr Onn’s AEIC”) at para 5.The defendant was primarily represented by Mr David Tse Tze Kwong (“DW2”) and DW1.27Foot Note 27×Mr Kwong’s AEIC at para 5. 19 In the course of the negotiation between the plaintiff and the defendant, numerous meetings were conducted and they exchanged emails and drafts of the LOI in April, May and June 2008. The details of these correspondence, meetings and drafts are important in the determination of the quantum of the Preliminaries Sum and other issues under the signed LOI. This will be discussed in greater detail below at [104] onwards. 20 On 11 June 2008 the defendant sent the plaintiff a breakdown of the preliminaries for the Project entitled “Preliminaries for Main Building Works for Biopolis III at One-North” which explained how the sum of $12.3 million was derived (“June Preliminaries Breakdown”). 21 Eventually, the parties signed the LOI dated 26 June 2008 on 30 June 2008. The LOI is the central source of the parties’ disputes. 22 It cannot be gainsaid that pursuant to the LOI, the plaintiff would have to pay the trade contractors through the defendant for their services rendered to the Project. However, it was the defendant who entered into the various trade contracts with the various trade contractors after evaluating the respective tender submissions through a tender exercise. Each tender exercise involved tender questionnaires, tender interviews, tender opening and price negotiation. The defendant would then prepare a tender report in which the preferred trade contractor was identified. The selected trade contractor would subsequently be recommended to the plaintiff for its approval.",
        "The LOI": "23 Despite the large scale of the Project, the signed LOI was a bare-bones document of only four pages. The parties attempted to enter into a more formal and comprehensive agreement in the months following the signing of the LOI but were unsuccessful as they had encountered irreconcilable differences. 24 For ease of reference, I shall now reproduce the relevant clauses of the LOI: The Contract Sum 25 Clauses 1.0, 1.1 and 1.2 provide for the Contract Sum under the LOI:28Foot Note 28×2JCB00786. 1.0CONTRACT SUM The Contract Sum shall be at the total sum ofSingapore DollarsNinety Five Million Eighty Hundred and Eighty/Seventy Thousand Only (S$95,870,000.00)(excluding prevailing GST). [The incorrect type-written amount “Eighty” was struck out and replaced with a hand-written word “Seventy” in the original LOI]. The breakdown of the Contract Sum is as follows: - 1.1Guaranteed Maximum Price (GMP) for All Construction Trades inclusive of all trades Preliminaries and trades Profit attendances, Management Contractor’s Fees, procedure and process management for Green Mark Gold certification and LEED certification but excluding Provisional items as listed herewith*: S$82,267,500.001.2Preliminaries (Fixed Sum) and the Profit and Attendance for the Management Contractor shall deemed to cover for all the items as listed in the Provisional items herewith* but up to the limit of S$1,302,500.00: S$13,602,500.00TOTAL GUARANTEED MAXIMUM PRICE (GMP):S$95,870,000.00 26 The defendant argues that under cl 1.2, the Preliminaries Sum is fixed at $12.3 million. This is computed by subtracting the Profit and Attendance for the Management Contractor of $1,302,500 from the sum of $13,602,500. However, the parties dispute whether the Preliminaries Sum was agreed at $12.3 million. I shall discuss this further at [104] onwards. The shared savings for GMP 27  The shared savings in the LOI between the parties can be found in cll 4.0, 4.1 and 4.2:29Foot Note 29×2JCB00787. 4.0SHARED SAVING FOR GMP Any saving achieved from the Out-Turn Costs and the Final GMP shall be shared between the Employer and the Management Contractor in the following order:- 4.1 The total saving achieved shall be shared equally between the Employer and the Management Contractor. 4.2 The Management Contractor shall bear all costs if the Out-Turn costs exceed the Final GMP. Interim payment of shared saving is subjected to finalise agreed Scope as stipulated in 3.0 above. 28 The dispute here is whether the defendant had agreed to waive its share in the first $5 million of the shared savings. This will be discussed further below at [180] onwards. The contract period 29 Clause 5.0 of the LOI lays down the contract duration for the Project:30Foot Note 30×2JCB00787. 5.0CONTRACT PERIOD The contract period for the Works shall beEighteen (18) calendarmonths for substantial completion and ready for Temporary Occupation Permit (TOP) application and inspections from the relevant authorities. The commencement date of the Contract shall be 23rd July 2008 or the Date of Permit to Commence Work from the Authorities whichever is the earlier. 30 Under the signed LOI, the contractual completion date for the Project was on 22 January 2010, which is 18 months from 23 July 2008. This is undisputed. However, the parties disagreed on the meaning of “substantial completion” in cl 5.0. This issue is crucial because it will determine the date on which the development of the Project is deemed complete under the signed LOI. This will in turn determine the duration of the delay in completing the Project. I shall discuss this issue below at [223] onwards. Liquidated damages 31 Given that the Project was delayed and was completed after 22 January 2010 which is the completion date stipulated under cl 5.0 of the LOI, the liquidated damages clause under the LOI is relevant. Clause 6.0 of the LOI provides for liquidated damages:31Foot Note 31×2JCB00788. 6.0LIQUIDATED DAMAGES In the event of a delay in completing the Works, the Management Contractor shall be liable to pay the Employer liquidated damages for late completion. In this regard, the rates of the liquidated damages that shall apply are as follows: a.S$30,000.00per calendar day including Sundays and Public Holidays for the first 30 days the Works remain incomplete after the contract period, as defined herein Clause 5.0 b.S$70,000.00per calendar day including Sundays and Public Holiday for the duration the Works remain incomplete beyond the 30th day up to the 60th day after the contract period, as defined herein Clause 5.0 c.S$50,000.00per calendar day including Sundays and Public Holidays for the duration of the Works remain incomplete beyond the 60th day after the contract period, as defined herein Clause 5.0 32 The “Works” referred to in cl 6.0 cited above refers to the construction and maintenance of the Project.32Foot Note 32×2JCB00786.The parties are in disagreement as to whether cl 6.0 applies. The defendant submits that cl 6.0 does not apply because the plaintiff had caused critical delays to the Project which the plaintiff denies. This will be discussed in greater detail below at [353] onwards. Terms of payment 33 The dispute on the quantum of the Preliminaries Sum to be paid also involved the interpretation of cl 7.1 which can be found under the heading “Terms of Payment” in the LOI:33Foot Note 33×2JCB00787. 7.0TERMS OF PAYMENT The terms of payment shall be as follows: - 7.1Management Contractor’s Preliminaries Ten (10%) percent down-payment of the Preliminaries of S$12,300,000.00 (ie S$1,230,000.00) shall be payable to the Management Contractor within thirty (30) days from Date of this letter or from the date of acceptance of this letter by the Management Contractor, whichever is the later. Subsequent payments for the Preliminaries shall be on monthly basis, basing of the actual work done/certified. The down-payment monies shall be adjusted progressively from the payments due from 13th to 18th interim payments. The fixed sum Preliminaries portion of the contract condition (including but not limiting to necessary cost breakdown for payment certification) is to be agreed within 4 weeks from the date of project commencement. 34 The parties’ dispute here concerns the meaning of the second paragraph of cl 7.1 of the LOI. The plaintiff submits that the second paragraph of cl 7.1 meant that the parties had agreed to determine the quantum of the Preliminaries Sum within four weeks of the Project’s commencement date. The defendant on the other hand, submits that this paragraph meant that the parties agreed to discuss within four weeks of the Project’s commencement datehowthe Preliminaries Sum of $12.3 million was to be paid out by the plaintiff over the duration of the Project. I shall deal with this issue below at [104] onwards.",
        "The draft contract": "35 After the signing of the LOI, the defendant engaged WT Partnership to prepare a formal detailed contract. A draft of the formal contract was circulated to the plaintiff on or about 13 August 2008 (“Draft WT Contract”).34Foot Note 34×Agreed Statement of Facts at para 15.The Draft WT Contract contained,inter alia, a breakdown of the Preliminaries Sum of $12.3 million (“August Preliminaries Breakdown”) that showed a breakdown of the defendant’s work for the Project.35Foot Note 35×Agreed Statement of Facts at para 16.However, the August Preliminaries Breakdown did not state the cost of each item. Thus, the plaintiff asked the defendant to provide the costing for all the preliminaries works that constituted the Preliminaries Sum. The defendant then sent a revised Preliminaries Breakdown on 12 September 2008 (“September Preliminaries Breakdown”) to the plaintiff. After further discussion between the parties, another revised version of the preliminaries breakdown was provided on 6 October 2008 (“October Preliminaries Breakdown”).36Foot Note 36×Mr Leow’s AEIC at paras 49 – 52.I shall refer to the August Preliminaries Breakdown, the September Preliminaries Breakdown and the October Preliminaries Breakdown collectively as the Preliminaries Breakdown. 36 The plaintiff disagreed with the Preliminaries Breakdown and ultimately, the Draft WT Contract was not executed. Nonetheless, the Preliminaries Breakdown and the Draft WT Contract continue to be relevant because the parties regularly referred to these documents in the course of the Project.",
        "The performance bond": "37 On 29 July 2009, the defendant provided the plaintiff with the OCBC Bond. The OCBC Bond was for the sum of $4,793,500. The plaintiff eventually returned the OCBC Bond to the defendant on 21 January 2010 because it was a conditional bond and not an on-demand bond.37Foot Note 37×Agreed Statement of Facts at paras 18 and 19.According to the plaintiff, the OCBC Bond was not in compliance with the LOI because it was understood by the parties that the defendant was to provide an on-demand performance bond. Furthermore, the OCBC Bond was provided one year late and this again was not in compliance with what was agreed under the LOI. 38 One of the disputed issues is that the parties disagreed on whether there was an obligation on the defendant to provide a performance bond under the LOI. If there was such an obligation, the parties disagreed on what kind of performance bond the defendant must provide. I shall discuss this issue below at [171] onwards.",
        "The delays": "39 As mentioned above, under the LOI, the development of the Project was to be completed by 22 January 2010.38Foot Note 38×2JCB00787. See also Statement of Claim (Amendment No 3) at para 31.However, the Project was only certified to be completed on 12 January 2011.39Foot Note 39×Agreed Statement of Facts at para 41. 40 The defendant accepted that the Project was not completed within 18 months as stipulated under cl 5.0 of the LOI. However, the defendant alleged that the plaintiff had also substantially contributed to the delays and these were critical delays. The liability for the delays will be discussed at [218] onwards below.",
        "The parties’ cases": "41 The parties’ main areas of disagreement are as follows: (a) The amount for the defendant’s Preliminaries Sum under the LOI; (b) Whether the defendant had an obligation to provide a performance bond under the LOI, and if so, what sort of performance bond it would have to provide; (c) Whether the defendant had waived its share of the first $5 million of the shared savings; and (d) The liabilities of the parties in relation to the delays caused to the completion of the Project. 42 The parties’ cases in respect of each of the above disputed areas are summarised as follows:",
        "The Preliminaries Sum": "The plaintiff’s claim 43 The plaintiff submits that under the LOI, the plaintiff was all along under the understanding that the Preliminaries Sum of $12.3 million for the defendant should also include the preliminaries for all the trade contractors of the Project. The plaintiff claims that this assertion is supported by the events leading up to the signing of the LOI. However, during a dinner meeting on 27 June 2008, DW2 told the plaintiff that the sum of $12.3 million was only meant for the preliminaries to be provided by the defendant. The plaintiff disagreed and immediately made clear in the draft LOI which was attached in an email by PW2 on 28 June 2008 that the $12.3 million was to cover all of the preliminaries of the Project. According to the plaintiff, the defendant objected to this and the disagreement could not be resolved until the phone conversation between PW1 and DW2 on the afternoon of 30 June 2008 (“30 June Conversation”). In that phone conversation, the plaintiff alleges that the parties agreed that the $12.3 million stated in the LOI as the Preliminaries Sum was a tentative figure and the final amount of the Preliminaries Sum was to be decided within four weeks of the commencement of the Project.40Foot Note 40×Plaintiff’s Closing Submissions at para 56.This was the intent behind the second paragraph of cl 7.1 of the signed LOI.41Foot Note 41×Plaintiff’s Closing Submissions at paras 98 to 100. 44 Unfortunately, the parties were unable to reach an agreement on the final Preliminaries Sum even after four weeks from the commencement of the Project.42Foot Note 42×Statement of Claim (Amendment No 3) paras 24 and 25.Nevertheless, in the interest of completing the Project, the plaintiff agreed that JCPL would certify payments for the Preliminaries Sum based on the fixed sum of $12.3 million without prejudice to the plaintiff’s right to challenge the same later. The plaintiff then paid the Preliminaries Sum to the defendant less $155,000.43Foot Note 43×Statement of Claim (Amendment No 3) paras 26 and 27. 45 Given the above, the plaintiff now asserts that since the parties did not come to any agreement as to how much the defendant would be paid for the provision of the management contractor’s preliminaries (ie,the Preliminaries Sum) within four weeks after the commencement of the Project, the court should order that the defendant is only entitled to be compensated for work done on aquantummeruitbasis. Thus, the plaintiff seeks an order that any excess amount previously paid by the plaintiff to the defendant for the preliminaries be refunded.44Foot Note 44×Statement of Claim (Amendment No 3) paras 28 and 29. The defendant’s defence 46 The defendant contends that the plaintiff agreed that the defendant’s Preliminaries Sum was fixed at $12.3 million under the LOI and that this sum did not include the trade preliminaries. 47 First, the defendant avers that the plaintiff understood what a fixed Preliminaries Sum in all the draft LOIs meant,ie, that it did not include the trade contractors’ preliminaries, and the parties proceeded on that basis.45Foot Note 45×Closing Submissions of the Defendant (in Original Action) at para 20. 48 Second, the defendant also contends that the 30 June Conversation did not occur and that this evidence should be disregarded.46Foot Note 46×Closing Submissions of the Defendant (in Original Action) at paras 77 – 151.The defendant argues that the plaintiff did not rely on this conversation when attempting to re-negotiate the Preliminaries Sum subsequent to the signing of the LOI.47Foot Note 47×Closing Submissions of the Defendant (in Original Action) at paras 113 – 131. 49 Third, the defendant avers that cl 7.1 of the LOI which is under the heading “Terms of Payment” set outhowthe fixed Preliminaries Sum of $12.3 million was to be disbursed to the defendant.48Foot Note 48×Defence and Counterclaim (Amendment No 4) at para 22.6.According to the defendant, the second paragraph of cl 7.1 of the signed LOI came about because of a disagreement between the parties on how the fixed sum of $12.3 million was to be disbursed to the defendant. Apart from paying the defendant 10% of the $12.3 million within 30 days of the signing of the LOI, the defendant initially wanted the plaintiff to pay 60% of the Preliminaries Sum within four months of the execution of the signed LOI. This was set out in the earlier draft of the LOI which was circulated by DW2 in an email to the plaintiff on 28 June 2008 at 1.51pm.49Foot Note 49×2JCB00749.However, the plaintiff was not agreeable to the defendant’s request for the advance payment of the 60%. Thus the 60% advance payment was taken out of cl 7.1 but the present paragraph 2 of cl 7.1 of the signed LOI was inserted to allow the parties to negotiate and to come to an agreement within four weeks of the Project’s commencement date on how the remainder of the Preliminaries Sum was to be disbursed to the defendant.50Foot Note 50×Closing Submissions of the Defendant (in Original Action) at para 49. 50 The defendant also argues that it is commercially sound and sensible for the defendant to want to fix the Preliminaries Sum given the rising prices of the raw materials in the construction industry when the LOI was under negotiations.51Foot Note 51×Closing Submissions of the Defendant (in Original Action) at paras 17 – 19.Hence the defendant disagrees with the plaintiff’s interpretation of the second paragraph of cl 7.1 of the signed LOI and argues that there was no overpayment when the plaintiff paid the defendant the $12.3 million less $155,000. 51 Finally, the defendant argues that since the plaintiff drafted the second paragraph of cl 7.1 of the signed LOI, thecontraproferentumrule will apply such that a viable interpretation that is against the interests of the party that drafted the clause is to be preferred. Therefore, by the operation of thecontraproferentumrule, any ambiguity in cll 1.0 and 7.1 of the signed LOI is to be construed against the plaintiff. That means the Preliminaries Sum of $12.3 million was fixed and definite, and not tentative or provisional.52Foot Note 52×Closing Submissions of the Defendant (in Original Action) at paras 157 – 160.",
        "The Performance Bond": "The defendant’s counterclaim 52 The defendant counterclaims against the plaintiff for the balance of the fixed Preliminaries Sum in the amount of $155,000 which it had incurred for the procurement of a performance bond as demanded by the plaintiff.53Foot Note 53×Defence and Counterclaim (Amendment No 4) at para 71.The defendant had provided to the plaintiff a performance bond in the form of the OCBC Bond.54Foot Note 54×Defence and Counterclaim (Amendment No 4) at para 72.Furthermore, the defendant also claims that there is no contractually binding provision under the LOI requiring the performance bond to be acceptable to the SO or the plaintiff.55Foot Note 55×Defence and Counterclaim (Amendment No 4) at para 74.Hence, the SO had erred in certifying that the defendant did not provide a performance bond. Therefore, the defendant is entitled to be paid $155,000 for the procurement of the OCBC Bond.56Foot Note 56×Defence and Counterclaim (Amendment No 4) at para 75. See also Closing Submissions of the Defendant (in original action) at paras 164 – 165. The plaintiff’s defence 53 The plaintiff denies that it is obliged to pay the defendant for the provision of the OCBC Bond as the defendant failed to comply with the requirements under the LOI which include the provision of an on-demand performance bond. The OCBC Bond provided by the defendant was a conditional performance bond instead of an on-demand performance bond. Furthermore, the OCBC Bond was only furnished more than a year after the execution of the LOI. These were in breach of the LOI.57Foot Note 57×Reply and Defence to Counterclaim (Amendment No 2) at paras 58.2 – 61.2.Hence, the plaintiff did not accept the OCBC conditional performance bond. Thus, the plaintiff submits that it is not liable to the defendant for the sum of $155,000.58Foot Note 58×Reply and Defence to Counterclaim (Amendment No 2) at paras 62 – 65.",
        "The first $5 million of shared savings": "The defendant’s counterclaim 54 This is the defendant’s counterclaim for its share of the first $5 million of the shared savings. The defendant submits that it is entitled to 50% of thetotalshared savings achieved in the completion of the Project.59Foot Note 59×Defence and Counterclaim (Amendment No 4) at para 61.According to the defendant, the plaintiff did not pay the defendant its 50% share in the first $5 million of the shared savings because it was under the misapprehension that the defendant, by virtue of the defendant’s letter dated 6 April 2009 (“6 April Letter”), had offered to waive its share in the first $5 million of the shared savings. The defendant contends that out of goodwill and on a without prejudice basis, it stated in the 6 April Letter that it was prepared to waive its share in the first $5 million of the shared savings provided the plaintiff kept to the commercial terms of the LOI. The defendant argues that this meant that the plaintiff accepts that (i) the Preliminaries Sum was fixed at $12.3 million; (ii) there would be no reduction in the GMP figure; and (iii) there would be no change to the Management Contractor’s Fees.60Foot Note 60×Closing Submissions of the Defendant (in Original Action) at para 182(c).The plaintiff failed to comply with these conditions in its purported acceptance letter dated 9 May 2009 (“9 May Letter”).61Foot Note 61×Closing Submissions of the Defendant (in Original Action) at para 182.Accordingly, the defendant avers that the goodwill gesture to waive its share in the first $5 million of the shared savings was unenforceable and void.62Foot Note 62×Defence and Counterclaim (Amendment No 4) at paras 68 – 70. 55 The defendant also argues that the offer in the 6 April Letter was not a distinct or fixed offer but one which must be read in the light of the ongoing negotiations between the parties in their attempt to resolve their differences at that point in time. The defendant avers that these differences were not ultimately resolved and there was no agreement that the defendant would not take its share of the first $5 million of the shared savings.63Foot Note 63×Closing Submissions of the Defendant (in Original Action) at paras 187 – 188. 56 Furthermore, the defendant argues that the plaintiff did not provide any consideration in return for the acceptance of the defendant’s offer in the 6 April Letter.64Foot Note 64×Closing Submissions of the Defendant (in Original Action) at paras 211 – 216. 57 Therefore, the defendant submits that there was no binding agreement between the parties that the defendant would waive its share in the first $5 million of the shared savings. Thus, the defendant claims its share of the shared savings from the plaintiff.65Foot Note 65×Defence and Counterclaim (Amendment No 4) at para 69. The plaintiff’s defence 58 The plaintiff’s defence avers that by way of the 6 April Letter, the defendant had offered to forgo its share in the first $5 million of shared savings as part of their agreement post-LOI. This was a result of a compromise arising from the disagreements between the parties. The plaintiff duly accepted this offer. The plaintiff argues that the defendant intended the offer made in the 6 April Letter to be a binding offer.66Foot Note 66×Plaintiff’s Closing Submissions at paras 163 – 172.This binding offer was accepted by the plaintiff via its 9 May Letter.67Foot Note 67×Plaintiff’s Closing Submissions at para 159.The plaintiff also argues that it had offered a valid consideration in return for the defendant’s offer in the 6 April Letter. In particular, the plaintiff had agreed to abstain from taking further actions against the defendant in the light of the ongoing disagreements between them and in return, the defendant agreed to waive its right to share in the first $5 million of the shared savings.68Foot Note 68×Plaintiff’s Closing Submissions at paras 200 – 214. 59 Thus, the plaintiff claims that the defendant is not entitled to its share in the first $5 million of the shared savings.69Foot Note 69×Reply and Defence to Counterclaim (Amendment No 2) at paras 52.1 – 52.5. See also Plaintiff’s Closing Submissions at paras 8 to 54.",
        "The delay in the Project’s completion": "The plaintiff’s claim as regards the completion date of the Project 60 The Project was delayed for about a year and the plaintiff claims for liquidated damages in accordance with cl 6.0 of the LOI. First, the plaintiff argues that “completion” under cl 5.0 of the LOI is achieved only when:70Foot Note 70×Plaintiff’s Closing Submissions at para 474. (a) all works had complied with the requirements of the BCA and the various inspectors (“the Authorities”) before they are prepared to issue the Temporary Occupation Permit (“TOP”); (b) all works, including those that are not required for TOP application (ie, “Non-TOP works”), in particular, testing and commissioning works had to be completed and accepted by the Authorities; and (c) all documentation required by the Authorities (such as the relevant certifications) had been submitted by the defendant to the SO to allow the SO to apply for TOP. 61 The plaintiff relies on the various draft LOIs exchanged between the parties prior to the execution of the LOI to show that the parties had the above intention when they signed the LOI.71Foot Note 71×2JCB00746, 2JCB00752 and 2JCB00740. See Plaintiff’s Closing Submissions at paras 477 – 498.The plaintiff also argues that the Project was not ready for TOP inspection and application as at 22 December 2010 (which is the date the defendant contends was the date of completion for the Project) as there were numerous works which were outstanding as of 22 December 2010.72Foot Note 72×Plaintiff’s Closing Submissions at paras 497 – 514. 62 However, the Project was only certified completed on 12 January 2011. Therefore, the plaintiff asserts that the defendant is liable for 355 days of delay. Hence, the plaintiff claims a total of $17,750,000 in liquidated damages.73Foot Note 73×Statement of Claim (Amendment No 3) paras 35 – 38.In the alternative, the plaintiff claims general damages from the defendant for the delays caused by the defendant in the completion of the Project under the common law. Thus, the plaintiff claims for loss of rental income and loss and damages arising from the payment of staff salaries on site during the period of delay of the Project.74Foot Note 74×Statement of Claim (Amendment No 3) paras 46.1 – 47.2. 63 The plaintiff also claims for the refund of $5,052,508.54 being the additional preliminaries the defendant provided due to the delays caused by the defendant. The plaintiff had paid the sum for the additional preliminaries without prejudice to its rights to challenge the same. The plaintiff avers that since it had not caused any delay in the completion of the Project, it should not be liable for any additional preliminaries provided by the defendant arising from the delays.75Foot Note 75×Statement of Claim (Amendment No 3) paras 48 – 51.3.If the court finds that the plaintiff had caused some delay to the Project’s completion, the plaintiff nonetheless seeks an order from the court for the defendant to refund the excess (if any) of the additional preliminaries the plaintiff had paid to the defendant.76Foot Note 76×Statement of Claim (Amendment No 3) paras 51 – 51.3. The defendant’s defence as regards the completion date of the Project 64 As regards the issue of when the Project was completed, the defendant argues that “completion” under cl 5.0 of the signed LOI was achieved when the Project was ready for TOP application.77Foot Note 77×Defence and Counterclaim (Amendment No 4) at paras 37 – 44. See also Closing Submissions of the Defendant (in original action) at para 554.The defendant relies on the draft LOI sent by DW2 in an email dated 28 June 2008 and the signed LOI as evidence of this intention.78Foot Note 78×Closing Submissions of the Defendant (in original action) at para 556.Thus, the defendant contends that the Project was ready for TOP application on 22 December 2010 because that was the date when the BCA directed that an application be made for TOP albeit subject to compliance with certain minor requirements imposed by the BCA.79Foot Note 79×Closing Submissions of the Defendant (in original action) at para 579. 65 The defendant also urges the court not to accord too much weight to the SO’s representative, Siah Puay Lin’s (“PW3”), evidence regarding the completion date for the Project because the SO in this case had adopted numerous conflicting approaches in assessing the actual completion date which had given rise to different completion dates.80Foot Note 80×Closing Submissions of the Defendant (in original action) at para 576.Therefore, the defendant submits that the Project was completed, according to cl 5.0 of the signed LOI, on 22 December 2010 instead of 12 January 2011. The defendant’s allegations that the delays were caused by the plaintiff 66 The defendant further avers that it is not liable for any delay in the completion of the Project. First, the plaintiff had caused acts of prevention which set the time for completion under the LOI at large. Second, the Project was completed within reasonable time. The defendant contends that the plaintiff’s acts of prevention were as follows:81Foot Note 81×Defence and Counterclaim (Amendment No 4) at paras 30 – 36. (a) The termination of the Resident Engineer (“RE”) by the plaintiff caused delay in the piling works; (b) The delay in the award of the RC works trade contract due to the plaintiff’s standing instructions not to award any trade contracts without its approval. The plaintiff also interfered in the defendant’s tender process; (c) The delay in the award of the Aluminium and Glazing work (“A&G works”) trade contract; (d) The delay arising from the additional works from the Registered Inspector (“RI”) inspection; and (e) Delay arising from the additional works from the BCA inspection. 67 The defendant’s contentions are as further elaborated: (1) The termination of the RE 68 The defendant argues that the plaintiff had caused six days of delay from the period of 26 to 31 December 2008 due to the plaintiff’s termination of the RE on 23 December 2008 without an immediate replacement by JCPL who was also the SO. According to the defendant, piling works could not proceed without the presence of the RE on site. This is because the RE was required for the following two broad aspects of piling works:82Foot Note 82×Closing Submissions of the Defendant (in original action) at paras 309 – 314. (a) Boring works: the RE was required to decide, based on the soil sample excavated, whether the piles could terminate at a depth that was shorter than the requisite socketing depth; and (b) Casting works: the RE was to decide or determine the founding depth of the piles. This was to ascertain if the hole excavated by the piling contractor had actually reached the required design parameters specified by the Qualified Person (“QP”) Design, and to ensure the pile would fulfil its designed load bearing capacity requirements. 69 The defendant highlighted that because the RE was not present on site, the trade contractors responsible for piling works were unable to cast any piles for the period of 26 to 31 December 2008 when they could have done so. The defendant submits that casting works was the critical stage of piling works and so without a RE, the piling works had effectively “stopped”. In fact, the defendant’s expert, Mr Koh Beng Soon (“DW4”) testified that the trade contractors for the piling works would have completed approximately 30 piles with only 6 piles outstanding if the RE had not been terminated.83Foot Note 83×Closing Submissions of the Defendant (in original action) at para 319.However, due to the termination of the RE, no piles were casted during this period. Therefore, the plaintiff’s termination of the RE had delayed the Project. (2) Delay in the award of the RC works trade contract 70 The defendant alleges that the plaintiff had caused delay in the award of the RC works trade contract on the following grounds: (a) The plaintiff had directed the defendantnotto award the RC trade contract without its approval and had subsequently issued its approval late;84Foot Note 84×Closing Submissions of the Defendant (in original action) at paras 366 – 398. (b) The plaintiff had interfered in the tender process for the RC works trade contract by the late introduction of Chang Hua Pte Ltd (“Chang Hua”) in January 2009;85Foot Note 85×Closing Submissions of the Defendant (in original action) at paras 453 – 473. (c) The plaintiff delayed its grant of approval of the tender recommendation issued by the defendant on 5 February 2009;86Foot Note 86×Closing Submissions of the Defendant (in original action) at paras 474 – 483.and (d) Subsequently, instead of approving the tender recommendation issued by the defendant on 5 February 2009, the plaintiff introduced Tien Rui Pte Ltd and Shanghai Construction Co Pte Ltd’s (“Shanghai Tien Rui”) joint tender submissions on 24 April 2009 thus prompting the defendant to go through the whole tender process again.87Foot Note 87×Closing Submissions of the Defendant (in original action) at paras 453 – 473. 71 The defendant also submits that the plaintiff’s directions not to award the RC works trade contract without its approval and subsequent conduct of delaying the award of the RC works trade contract were part and parcel of the plaintiff’s scheme to slow down the completion of the Project.88Foot Note 88×Closing Submissions of the Defendant (in original action) at paras 352 – 365. 72 Finally, the defendant submits that the site was ready to receive the RC works trade contractors on 6 January 2009.89Foot Note 89×Skeletal Arguments (Oral hearing) of the Defendant at para 126.However, the defendant contends that due to the plaintiff’s interference in the RC works tender process, the plaintiff’s directions not to award any trade contract without its approval, and later its delay in approving the tender recommendation for the RC works trade contract issued by the defendant, the defendant had paced its work by reference to the plaintiff’s delaying actions. Thus, the plaintiff had caused delay for the period from 2 January 2009 to 1 June 2009 when the RC works was awarded. This is 151 days of delay caused by the plaintiff.90Foot Note 90×Affidavit of Evidence in Chief of Koh Beng Soon (“Mr Koh’s AEIC”) at p 420. (3) Delay in the award of the A&G works 73 It is not disputed by the parties that the tender report and recommendation for the award of the A&G works trade contract was issued for the plaintiff’s approval on 22 September 2009 but the plaintiff only gave its approval on 17 November 2009.91Foot Note 91×10JCB05371 and 12JCB6415. 74 The defendant submits that the plaintiff is liable for causing critical delays between 12 October 2009 (instead of 22 September 2009) and 16 November 2009 – a total of 37 days of delay. This is because the defendant relied on DW4’s analysis which found that the A&G works trade contract needed to be awarded by 12 October 2009 so as to allow the relevant design information on the cast-in items to be provided to the RC works trade contractor by February 2010 when the relevant RC works for the second-storey slab were supposed to commence.92Foot Note 92×Closing Submissions of the Defendant (in original action) at para 489.DW4 derived the date of 12 October 2009 by calculating backwards from the projected date of the start of works for the second-storey slab in February 2010 based on the Master Program and taking into account the delay in the piling works and the award of the RC works trade contract (“Impacted Master Program”).93Foot Note 93×Closing Submissions of the Defendant (in original action) at para 492. See also Transcripts, 31 August 2018, p 108 line 17 to p 109 line 6; 6 September 2018, p 14 line 6 to 20; and 31 August 2018, p 109 lines 14 to 20.On 17 November 2009,94Foot Note 94×12JCB6419.when the A&G works trade contract was awarded, the defendant submits that it is entitled to the 37 days’ delay because it could have used that time to do other catch-up works to make up for the fact that the Project was already in delay.95Foot Note 95×Closing Submissions of the Defendant (in original action) at para 499. 75 The defendant also submits that in the event the court finds that there was noactualdelay to the progress of the Project arising from the plaintiff’s late award of the A&G works trade contract because the A&G works were completed faster than was planned, the defendant is nonetheless entitled to the full amount of time allocated for A&G works. According to DW4, the defendant should be entitled to 37 days’ delay.96Foot Note 96×Closing Submissions of the Defendant (in original action) at para 496. (4) Delay arising from the RI and BCA inspections 76 On 4 November 2010, the RI conducted a combined mechanical and electrical, and architectural inspection of the Project site. By way of letter dated 9 November 2010, the SO informed the defendant that there were certain follow-up works which had to be done.97Foot Note 97×22JCB11574.The letter enclosed a list of the RI’s comments following from the inspection on 4 November 2010. In total, there were 42 items which required the defendant’s attention.98Foot Note 98×22JCB11575 – 22JCB11578. 77 On 9 December 2010, the BCA conducted a pre-TOP inspection of the Project. By way of letter dated 9 December 2010, the SO wrote to the defendant enclosing a list of the BCA’s comments for the defendant to follow up on.99Foot Note 99×22JCB11604 – 22JCB11608. 78 The defendant argues that the additional works to be undertaken, as instructed by the RI and the BCA, caused critical delays which should be attributed to the plaintiff. In particular, the defendant submits that JCPL was in charge of producing the architectural drawings which would also indicate where the signage and the railings were to be installed. The defendant contends that it had constructed the buildings of this Project in accordance with the drawings provided by JCPL. Hence, any additional signages which were instructed to be fabricated and installed by the RI following from the RI inspection and any additional railings instructed to be installed by the BCA following the BCA inspection which were not reflected in the drawings provided by JCPL were additional works ordered upon it by the plaintiff.100Foot Note 100×Closing Submissions of the Defendant (in original action) at paras 512 – 513 and 534. (5) Reasonable time to complete 79 The defendant avers that the various acts of prevention by the plaintiff set the time for the completion of the Project at large. Furthermore, there is no extension of time (“EOT”) clause under the LOI. Hence, the defendant asserts that cl 6.0 of the LOI on liquidated damages is no longer applicable.101Foot Note 101×Defence and Counterclaim (Amendment No 4) at para 35. 80 The defendant further contends that the Project was completed within reasonable time. The defendant argues that in calculating reasonable time, the court should take a holistic view of the Project and have regard to the theoretical programme, the actual nature and scope of works to be done and the time needed to do so, as well as the actual site condition.102Foot Note 102×Closing Submissions of the Defendant (in original action) at para 246. 81 On this, the defendant submits that the court must look at the timeactuallytaken to complete and then work backwards to see if that time was reasonable. The onus is then on the plaintiff, as employer, to show that the timeactuallytaken to complete the Project was excessive.103Foot Note 103×Closing Submissions of the Defendant (in original action) at paras 247 – 250.The defendant submits that the relevant factors this court should take into consideration in conducting this holistic analysis of reasonable time to complete are:104Foot Note 104×Closing Submissions of the Defendant (in original action) at para 251. (a) the actual circumstances and site conditions; (b) the actual scope of the works; (c) correspondence which was exchanged between the parties as to the reasonable completion date; (d) the amount of critical delays which each party was responsible for; (e) the non-critical delays which each party was responsible for; (f) the original contract duration; (g) the contractual allocation of risk and/or the relevant contractual bargain; (h) the nature of the Project; (i) parties’ conduct towards the original contractual completion date; and (j) any adjusted completion dates which were discussed by the parties. 82 The defendant relied on two English authorities for its propositions above:PantlandHick v Raymond & Reid[1893] AC 22 (“PantlandHick”)andAstea(UK) Ltd v Time Group[2003] All ER (D) 212 (“Astea”). 83 The defendant contends that the Project was completed within a reasonable time. Thus, the plaintiff is not entitled to seek general damages from the defendant for the delays it had itself caused. 84 The defendant also argues that in the event that the court finds that the completion date for the Project was 12 January 2011 instead of 22 December 2010, the defendant is not liable for the delay between 22 December 2010 to 12 January 2011.105Foot Note 105×Closing Submissions of the Defendant (in original action) at para 582.This period of delay was due primarily to the SO taking the time to apply for TOP and the time taken for the BCA to process the TOP application.106Foot Note 106×Closing Submissions of the Defendant (in original action) at para 582. The plaintiff’s reply to the defendant’s claim that the delays were caused by the plaintiff 85 In reply to the defendant’s defence, the plaintiff pointed out that the defendant’s own expert, DW4, acknowledged that the defendant was responsible for 120 days of delay. The plaintiff accepts that some of its actions, in the course of the Project, may have the potential to disrupt the works. However, these actions did not actually cause critical delays to the completion of the Project as the defendant’s delay was the dominant and effective cause of the delay to the progress of the work. 86 I shall now elaborate on the plaintiff’s responses to the various causes of delay which the defendant alleged were caused by the plaintiff. (1) The termination of the RE 87 In relation to the termination of the RE by the plaintiff for corruption without an immediate replacement, the plaintiff submits that the termination did not cause delay to the piling works for three reasons.107Foot Note 107×Reply and Defence to Counterclaim (Amendment No 2) at para 41.1.2.First, the plaintiff argues that the court should dismiss the defendant’s case on this issue because its pleaded position was inconsistent. The defendant pleaded that all boring and casting works had stopped but later at trial changed its case to one where only casting works had stopped.108Foot Note 108×Plaintiff’s Closing Submissions at para 235. 88 Second, the Project’s records showed that the piling works were still being carried out during the period when there was no RE.109Foot Note 109×Reply and Defence to Counterclaim (Amendment No 2) at para 41.1.1.The plaintiff made reference to the piling records which showed that boring works still continued during the period when there was an absence of a RE on site.110Foot Note 110×Plaintiff’s Closing Submissions at paras 234 – 249 and 282 – 290.The plaintiff also highlights that no stop-work order was issued in respect of the piling works.111Foot Note 111×Plaintiff’s Closing Submissions at paras 267 – 281. 89 Third, the plaintiff submits that if anything, the piling works were in fact delayed by the defendant.112Foot Note 112×Reply and Defence to Counterclaim (Amendment No 2) at para 41.1.4.The plaintiff avers that the defendant, as management contractor, failed to take any counter-measures or mitigating steps to avoid any delay caused by the termination of the RE. For example, the defendant could have asked its Supervision QP (Structure) from Parsons to step into the shoes of the RE.113Foot Note 113×Plaintiff’s Closing Submissions at para 233(d).Alternatively, the defendant could have asked the SO, JCPL, for instructions or to take steps to ensure an alternative engineer was present to undertake the role of the RE.114Foot Note 114×Reply and Defence to Counterclaim (Amendment No 2) at para 41.1.4(c).The plaintiff argues that this would have been consistent with the Building Control Act (Cap 29, 1999 Rev Ed) (“Building Control Act”).115Foot Note 115×Plaintiff’s Closing Submissions at paras 291 – 324. 90 In any event, the plaintiff submits that it should not be held liable for any delays during the period of 29 to 30 December 2008 because the replacement RE was appointed on 29 December 2008.116Foot Note 116×Plaintiff’s Closing Submissions at paras 250 – 253. (2) Delay in the award of the RC works trade contract 91  In relation to the tender award for the RC works, the plaintiff first avers that its instruction to the defendant on 13 December 2008 to seek the plaintiff’s approval before awarding any tender for trade works did not cause delay in the defendant awarding trade contracts under the LOI.117Foot Note 117×Reply and Defence to Counterclaim (Amendment No 2) at paras 27.1 – 27.8.This instruction was not to stop or slow down the progress of the works but to ensure that the plaintiff’s interest was protected. Furthermore, the plaintiff informed the defendant in a meeting on 14 January 2009 that it was for the defendant to decide the tendering process and the award of trade contracts. Thus the plaintiff had retracted its 13 December 2008 instruction, and the defendant knew that it should not be used as an excuse to delay the tendering process.118Foot Note 118×Reply and Defence to Counterclaim (Amendment No 2) at para 27.6. 92 With regard to the introduction of Chang Hua, and later the joint bid by Shanghai Tien Rui late in the tender process of the RC works, this was done in the best interest of the Project. Given the plaintiff’s instructions above, the defendant was free to reject Chang Hua’s and Shanghai Tien Rui’s tender submissions but chose not to do so. Hence the plaintiff cannot be held liable for any delay caused by the introduction of new tenderers late in the tender process.119Foot Note 119×Plaintiff’s Closing Submissions at paras 403 – 411.Furthermore, this ultimately resulted in substantial time and cost savings, hence increasing the shared savings which the defendant has claimed in full.120Foot Note 120×Reply and Defence to Counterclaim (Amendment No 2) at para 28.6.4.The result of introducing Chang Hua and Shanghai Tien Rui into the tender process was that the trade contractor agreed to complete the RC works two months earlier as compared to the earlier timeline proposed by the trade contractor in the previous tender recommendation.121Foot Note 121×Plaintiff’s Closing Submissions at paras 403 – 411. 93 In any event, the plaintiff also avers that the site was not ready to receive the RC works trade contractor until 1 March 2009.122Foot Note 122×Plaintiff’s Closing Submissions at paras 335 – 364.Thus, the plaintiff is not liable for any delay caused by the late introduction of Chang Hua in January 2009 because the defendant was not even ready to receive the RC works trade contractor on site. Thus, the plaintiff’s interference in the award of the RC works did not cause any actual delay in the Project’s completion. (3) Delay in the award of the A&G works 94 In relation to the A&G works, the plaintiff first avers that the delay was caused by the defendant’s delay in the RC works. This had a knock-on effect and the A&G works trade contractor could not commence its works on time. Hence the purported delay by the plaintiff in the award of the A&G works did not effectively interrupt the progress of the Project. In any event, the plaintiff avers that because the defendant was late in awarding the RC works, the defendant was not in a position to commence the A&G works on 17 November 2009, the date the A&G works trade contract was awarded.123Foot Note 123×Reply and Defence to Counterclaim (Amendment No 2) at para 36.4. 95 As for the defendant’s case that it needed the plaintiff’s approval before awarding the trade contract, the plaintiff submits that the defendant need not have waited for the plaintiff’s approval to award trade contracts and that this instruction was not conveyed by the defendant to its site management staff.124Foot Note 124×Plaintiff’s Closing Submissions at paras 440 – 453.The plaintiff further argues that the late approval of the award of the A&G works trade contract did not affect the critical path of the Project because at the date the A&G works trade contract was awarded, the RC works were far from ready to receive the A&G works. On 17 November 2009, when the A&G works trade contract was awarded, the RC works were still at the basement two level. Thus, even though the A&G works trade contract was awarded on 17 November 2009, the A&G works could not have commenced on the same day.125Foot Note 125×Plaintiff’s Closing Submissions at paras 462 – 463. (4) Delay arising from the RI and BCA inspections 96 As for the rectification works that the defendant was required to do after the RI inspection and the BCA inspection, the plaintiff argues that the fabrication and installation of additional signage and additional railing works were compliance works that the defendant was required to fulfil under the LOI. It is an express and/or implied term in the LOI that such compliance works fall within the scope of the defendant’s work. The plaintiff also argues that the fabrication and installation of additional signage would have been provided in the scope of work of Biopolis II which formed the basis of the scope of work of the defendant under the LOI.126Foot Note 126×Plaintiff’s Closing Submissions at para 522. 97 In the event the court finds that these were additional works, the plaintiff argues that there was no delay caused to the completion of the Project as the fabrication and installation of the additional signage and the additional railing works were completed before the other rectification works were completed. Therefore, these were not critical and they did not affect Project completion.127Foot Note 127×Reply and Defence to Counterclaim (Amendment No 2) at para 41.2 – 41.3. See also Plaintiff’s Closing Submissions at paras 544 – 556. 98 Finally, the plaintiff argues that in any event, the Master Program had catered 21 days for rectification works. This is more than adequate for the defendant to complete the additional works.128Foot Note 128×Plaintiff’s Closing Submissions at paras 557 – 565. (5) Reasonable time to complete 99 The plaintiff argues that in the event this court finds that the plaintiff had committed an act of prevention and so causedactualdelay to the completion of the Project (ie,they arecriticaldelay), the court should merely add the number of days of delay caused by the plaintiff to the contract period of 18 months under the LOI to determine the reasonable time for completion.129Foot Note 129×Plaintiff’s Closing Submissions at paras 569 to 571.The plaintiff submits that this was the approach adopted inFongsoonEngineering (S) Pte Ltd v Kensteel Engineering Pte Ltd[2011] SGHC 82 (“Fongsoon”), and this court should not depart from that approach. In the final analysis, the plaintiff argues that it is not liable for a single day of delay. Thus, the defendant is liable for all the delays in the Project’s completion.130Foot Note 130×Plaintiff’s Closing Submissions at para 627.",
        "Issues to be determined": "100 Having considered the parties’ respective cases on the disputed issues above, the issues that arise for my determination are: (a) Whether the parties agreed that the defendant’s Preliminaries Sum was fixed at $12.3 million under the signed LOI or that the Preliminaries Sum in the signed LOI was only tentative and that the parties intended the Preliminaries Sum to be finalised within four weeks of the commencement of the Project (“Issue 1”); (b) Whether the defendant is entitled to its counterclaim of $155,000, which is the cost it incurred to procure the OCBC Bond for the plaintiff (“Issue 2”); (c) Whether the defendant had waived its share in the first $5 million of the shared savings (“Issue 3”); and (d) What is the duration of the delay in the Project and what are the liabilities of the respective parties for causing the delay? (“Issue 4”). 101 In relation to the last issue on delay, I must first determine what constitutes the Project completion under cl 5.0 of the LOI and then determine the effective completion date of the Project. I shall then have to ascertain the liabilities of the parties for causing the delays in the completion of the Project. Accordingly, I have to consider the following issues relating to the delays: (a) Did the plaintiff and/or the defendant cause any delay when the plaintiff terminated the RE without any immediate replacement? If so, what is the duration of the delay? (b) Did the plaintiff and/or the defendant cause any delay in the award of the RC works to the trade contractor, namely MA Builders Pte Ltd? If so, what is the duration of the delay? (c) Did the plaintiff and/or the defendant cause any delay in the award of the A&G works to Positive Engineering Pte Ltd? If so, what is the duration of the delay? (d)  Should the defendant be held responsible for the delay caused by the additional works, particularly the fabrication and installation of the additional signage, as instructed by the RI? If so, what is the duration of the delay? (e) Should the defendant be held responsible for the delay caused by the additional works, specifically the additional railing works, as instructed by the BCA? If so, what is the duration of the delay? 102 Finally, if the plaintiff’s conduct caused the delays, whether these are acts of prevention which set the contract period under the signed LOI at large. If the plaintiff had committed acts of prevention, whether the Project was nevertheless completed in a reasonable time. If there were delays, I shall have to determine the type of damages to be awarded to the plaintiff (ie, whether the liquidated damages clause under cl 6.0 of the signed LOI applies or the plaintiff is entitled to general damages under the common law).",
        "My decision": "103 I shall deal first with the non-delay issues followed by the various issues relating to the delays.",
        "Issue 1: Whether it was agreed that the Preliminaries Sum was fixed at $12.3 million or the parties intended the Preliminaries Sum to be finalised within four weeks of the commencement of the Project": "The law 104 The Court of Appeal inCIFG Special Assets Capital I Ltd (formerly known as Diamond Kendall Ltd) v Ong Puay Koon and others and another appeal[2018] 1 SLR 170 had succinctly laid down the relevant principles to be applied in the construction of contracts at [19]: We begin with a brief statement of the relevant principles to be applied in the construction of contracts. These are well established in several decisions of this court and before us in the course of the oral arguments there was no real disagreement as to these. Stated briefly, these principles are as follow: (a) The starting point is that one looks to the text that the parties have used (see Lucky Realty Co Pte Ltd v HSBC Trustee (Singapore) Ltd [2016] 1 SLR 1069 at [2]). (b) At the same time, it is permissible to have regard to the relevant context as long as the relevant contextual points are clear, obvious and known to both parties (see Zurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd [2008] 3 SLR(R) 1029 at [125], [128] and [129]). (c) The reason the court has regard to the relevant context is that it places the court in “the best possible position to ascertain the parties’ objective intentions by interpreting the expressions used by [them] in their proper context” (see Sembcorp Marine Ltd v PPL Holdings Pte Ltd [2013] 4 SLR 193 at [72]). (d) In general, the meaning ascribed to the terms of the contract must be one which the expressions used by the parties can reasonably bear (see, eg, Yap Son On v Ding Pei Zhen [2017] 1 SLR 219 at [31]). 105 Furthermore, the Court of Appeal inSembcorp Marine Ltd v PPL Holdings Pte Ltdand another and another appeal[2013] 4 SLR 193 (“Sembcorp”) laid down strict requirements in relation to pleadings of extrinsic facts for the purpose of contractual interpretation (at [73]): Therefore, to buttress the evidentiary qualifications to the contextual approach to the construction of a contract, the imposition of four requirements of civil procedure are, in our view, timely and essential: (a) first, parties who contend that the factual matrix is relevant to the construction of the contractmust plead with specificity each fact of the factual matrix that they wish to rely onin support of their construction of the contract; (b) second, the factual circumstances in which the facts in (a) were known to both or all the relevant parties must alsobe pleaded with sufficient particularity; (c) third, parties should in their pleadings specify the effect which such facts will have on their contended construction; and (d) fourth, the obligation of parties to disclose evidence would be limited by the extent to which the evidence is relevant to the facts pleaded in (a) and (b). [emphasis added] 106 The Court of Appeal then explained that the effect of failing to comply with the above-stated requirements is that extrinsic facts placed before the court will not be accorded any weight when a court is construing a contract (Sembcorpat [74]). 107 In that light, I shall now consider the ordinary meaning of cll 1.0 and 7.1 of the LOI before looking at the context and relevant background facts pleaded by the parties leading up to the signing of the LOI on 30 June 2008. This is to consider whether my interpretation of cll 1.0 and 7.1 of the LOI is consistent with both the wordings of these clauses and the intention of the parties when they signed the LOI. Ordinary meaning of cll 1.0 and 7.1 of the LOI 108 For ease of reference, I shall again reproduce cll 1.0 and 7.1 of the LOI below:131Foot Note 131×JCB00786.Clause 1.0 of the LOI states as follows: 1.0 CONTRACT SUM The Contract Sum shall be at the total sum ofSingapore DollarsNinety-Five Million Eight Hundred and Eighty/ Seventy Thousand Only (S$95,870,000.00)(excluding prevailing GST). [The incorrect type-written amount “Eighty” was changed with a written word “Seventy”] The breakdown of the Contract Sum is as follows:- 1.1Guaranteed Maximum Price (GMP) for All Construction Trades inclusive of all trade Preliminaries and trades Profit attendances, Management Contractor’s Fees, procedure and process management for Green Mark Gold certification and LEED certification but excluding Provisional Items as listed herewith*: S$82,267,500.001.2Preliminaries (Fixed Sum) and the Profit and Attendance for the Management Contractor shall deemed to cover for all the items listed in the Provisional items herewith* but up to the limit of S$1,302,500.00: S$13,602,500.00TOTAL GUARANTEED MAXIMUM PRICE (GMP):S$95,870,000.00 109 Clause 7.1 of the LOI states as follows: 7.1 Management Contractor’s Preliminaries Ten (10%) percent down-payment of the Preliminaries of S$12,300,000.00 (ie S$1,230,000.00) shall be payable to the Management Contractor within thirty (30) days from Date of this letter or from the date of acceptance of this letter by the Management Contractor, whichever is the later. Subsequent payments for the Preliminaries shall be on monthly basis, basing of the actual work done/certified. The down-payment monies shall be adjusted progressively from the payments due from 13th to 18th interim payments. The fixed sum Preliminaries portion of the contract condition (including but not limiting to necessary cost breakdown for payment certification) is to be agreed within 4 weeks from the date of project commencement. [emphasis added] 110 From the above, I find that it is clear that the Preliminaries Sum under cl 1.0 is a fixed sum of $12.3 million. This provision of the signed LOI did not in any way, whether expressly or impliedly, state that the Preliminaries Sum is a tentative figure which is to be re-negotiated and agreed upon within four weeks of the commencement of the Project. I shall now explain my findings. 111 First, it is clearly stated in an unambiguous manner under cl 1.0 that the “Contract Sum shall be at …S$95,870,000.00” after which the signed LOI then gives a breakdown of how this figure is derived. It states clearly that the “Preliminaries (Fixed Sum)” is $12.3 million which is $13,602,500.00 less $1,302,500.000 which is the “Profit and Attendance for the Management Contractor [which] shall be … up to the limit of S$1,302,500.00”. The “Preliminaries (Fixed Sum)” is part of the total Contract Sum. However, clause 1.0 does not state that the Contract Sum of $95,870,000.00 is a tentative or provisional figure and that it has to be recalculated because the Preliminaries (Fixed Sum) is to be re-negotiated within four weeks of the commencement of the Project. 112 Second, cl 7 of the signed LOI deals with all matters concerning terms of payment as the name of this clause suggests. Clause 7.1 is titled “Management Contractor’s Preliminaries” and it explains that the defendant will be paid 10% down payment of the $12.3 million within 30 days of the date of the signed LOI or acceptance of the signed LOI by the defendant whichever is the later. Subsequent payments to the defendant shall be on a monthly basis based on actual work done/certified. Clause 7.1 further elaborates how the down payment monies are to be adjusted. Clause 7.2 states that the defendant’s Management Contractor’s Fees will be paid based on work done/certified, while cl 7.3 states the terms of payment for trade contractors. It is clear that cll 7.1 to 7.3 deal with the various terms of payment for the Project. 113 As it is not denied that the second paragraph of cl 7.1 of the signed LOI was inserted by the plaintiff and as this paragraph is under the section of the signed LOI which deals with the terms of payment for the defendant’s preliminaries, the above provision must obviously relate to the terms of payment relating to the defendant’s preliminaries. This is further reinforced by my findings, which I shall discuss in greater detail below, that the second paragraph of cl 7.1 of the signed LOI was inserted by the plaintiff to replace the defendant’s request for 60% advance payment of the Preliminaries Sum of $12.3 million. Therefore, the parties’ intention regarding the second paragraph of cl 7.1 of the signed LOI was not that the Preliminaries Sum of $12.3 million had to be further negotiated after the signed LOI. If this was indeed the intention of the parties, the plaintiff would not have parked this provision under the terms of payment of the defendant’s Preliminaries Sum. Instead the plaintiff would have amended cl 1.2 of the signed LOI to indicate that the Preliminaries Sum of $12.3 million has yet to be agreed. 114 Finally, if the second paragraph of cl 7.1 of the signed LOI is read in isolation and to the exclusion of the rest of the signed LOI, even ignoring the heading of this clause, then it might arguably be regarded as ambiguous. It is possible to mean as what the plaintiff has advocated,ie, that the Preliminaries Sum “is to be agreed within 4 weeks from the date of the project commencement”. However, as it is undisputed that the second paragraph of cl 7.1 of the signed LOI was drafted by the plaintiff,ie, PW2, under the principle ofcontraproferentum, any ambiguity in cl 7.1 is to be construed against the plaintiff. This court inLegisPoint LLC v Tay Choon Ai[2018] 3 SLR 1269 at [67] stated that under thecontraproferentumprinciple, “a viable interpretation that is against the interests of the draftsman is to be preferred”. Accordingly, thecontraproferentumprinciple applies such that cl 7.1 is construed against the interests of the plaintiff. Therefore, the Preliminaries Sum of $12.3 million was fixed, and not tentative or provisional. Reading cll 1.0 and 7.1 in the context of the signed LOI as a whole 115  A perusal of the signed LOI reveals that the parties had designed a contractual framework in the signed LOI such that items which were intended to be provisional were expressly stated to be so. This can be seen in cll 1.1 and 1.2 of the signed LOI which referred to Provisional Items and it made reference to eight items making up the Provisional Items. These eight items were termed Provisional Items with the agreement of the parties that the prices for these items and the scope of work involved in these works were to be negotiated and agreed at a later time. Examples of these Provisional Items are the “Landscape Works” and “Art/Sculptures”. Therefore, if the parties had intended for the Preliminaries Sum of $12.3 million to be provisional or tentative, it would have been excluded from the Contract Sum in cl 1.2. The Preliminaries Sum would have been categorised as a “Provisional Item”. This was not the case and the LOI clearly states that the “Preliminaries (Fixed Sum)” is $12.3 million. 116 I shall now consider whether the plain and contextual interpretation of cll 1.0 and 7.1 of the LOI which I have come to above is consistent with the events leading up to the parties’ signing of the LOI on 30 June 2008. The events leading up to the signing of the LOI 117 Upon reviewing the evidence preceding the signing of the LOI, I find that the plaintiff agreed to pay the defendant $12.3 million for the provision of the management contractor’s preliminaries (ie, the Preliminaries Sum). The plaintiff knew and did not dispute that the $12.3 million referred to as the Preliminaries Sum in all the draft LOIs concerned only  the provision of the defendant’s preliminaries. This is further reinforced by the WT Cost Estimate which the plaintiff relied upon heavily to understand its financial commitment for this Project. The WT Cost Estimate referredonlyto the defendant’s preliminaries and not the preliminaries for the whole Project (which includes the defendant’s preliminaries and the preliminaries of the trade contractors). During the negotiation, the plaintiff was also aware of the defendant’s concerns to have the price for the management contractor’s preliminaries fixed in the LOI as requested by DW2. The defendant was adamant and steadfast that the Preliminaries Sum had to be $12.3 million. 118 As for the second paragraph of cl 7.1 of the signed LOI, upon tracing the correspondence between the parties and the evolution of the drafts of the LOI in the lead-up to the signing of the final LOI, I find that the evidence clearly supports the finding that this paragraph was not meant for the parties to re-negotiate the Preliminaries Sum but for the parties to agree within four weeks from the commencement of the Projecthowthe fixed sum of $12.3 million was to be disbursed to the defendant throughout the duration of the Project. This was the reason for the plaintiff to replace the defendant’s request for 60% advance payment at the second paragraph of cl 7.1 with a completely different second paragraph of cl 7.1 in the signed LOI. 119 I shall now elaborate. (1) The plaintiff knew that the defendant’s Preliminaries Sum was fixed at $12.3 million 120 First, when the plaintiff executed the LOI, the plaintiff was not inexperienced in the construction industry. PW1 had testified that he had experience as both developer and management contractor in the past.132Foot Note 132×Transcripts, 30 July 2018, p 57 lines 17-19, p 61 lines 7-20, p 62 line 8 to p 63 line 6.Although those past projects were not in the construction of a bespoke industrial building for a specialised industry such as the biomedical industry, the concept of what the job scope of a management contractor is as compared to the job scope of a trade contractor should not differ too greatly. 121 In particular, PW1 testified that he was aware that a management contractor would be required to provide general preliminaries on site while a trade contractor would be required to provide preliminaries specific to its trade work:133Foot Note 133×Transcripts, 30 July 2018, p 132 line 21 to p 133 line 22. Q: You have been involved in the construction industry, whether as developer or to a less extent as a main contractor for many years. You would know that a piling contractor has his own preliminaries right? A:… Of course they [ie, the piling contractor] have their preliminary, we all know. Every trade contractor got their own preliminaries … [emphasis added] 122 Second, and flowing from the plaintiff’s experience in the construction industry, the plaintiff knew from the WT Cost Estimate that the provision of the defendant’s preliminaries (ie, the management contractor’s preliminaries) was estimated to be $12.3 million. It is inconceivable that the plaintiff misunderstood from the WT Cost Estimate that $12.3 million was for the provision of the preliminaries for the entire Project (ie, the management contractor’s preliminaries and the trade contractors’ preliminaries). 123  The WT Cost Estimate was very clear in that it separately estimated the cost of the defendant’s preliminaries to be $12.3 million as it was under the heading “JPW’s Preliminaries”.134Foot Note 134×1JCB00500.As PW1 was experienced in the construction industry, he must have known that when reference was made to “JPW’s Preliminaries” and having engaged JPW (the defendant) as the management contractor, the reference to JPW’s Preliminaries in the WT Cost Estimate must only mean the estimated cost for the provision of the management contractor’s preliminaries and not for the provision of all preliminaries in the Project. 124 The plaintiff tried to assert that although it has experience in the construction industry, it was unfamiliar with the GMP contract and so could not have known that the $12.3 million being the estimated cost for “JPW’s Preliminaries” in the WT Cost Estimate referred only to the management contractor’s preliminaries.135Foot Note 135×1JCB00500.I am not convinced by this explanation. Although the GMP contract is different from a conventional construction contract, the fact remains that a management contractor’s preliminaries are different from a trade contractors’ preliminaries and each has to provide its own set of preliminaries. If one is to scrutinise the WT Cost Estimate, it also listed out items under the cost estimates of the trade contractors which were trade preliminaries although these items were not categorised as trade preliminaries. PW2 also informed the court that it had many discussions with WT Partnership on its Cost Estimate.136Foot Note 136×Transcripts, 10 August 2018, p 53 line 12 to p 54 line 15.Hence it is implausible for the plaintiff or PW2 to have grossly misunderstood what WT Partnership meant when it estimated “JPW’s Preliminaries” to be $12.3 million. 125 In any event, even if the plaintiff continued to be uncertain about what WT Partnership meant when it estimated “JPW’s Preliminaries” to be $12.3 million under the WT Cost Estimate (ie, whether it was only for the management contractor’s preliminaries or for the preliminaries of the whole Project), there is no evidence that the plaintiff sought any form of clarification on this point. The plaintiff also did not ask WT Partnership to rework its Cost Estimate to ascertain the defendant’s preliminaries for the whole project. As WT Partnership was specifically engaged by the plaintiff to provide an estimate on the contract sum, it is only reasonable and in fact it is incumbent on the plaintiff to conduct due diligence to secure its interest by clarifying whether the scope of the defendant’s preliminaries under the WT Cost Estimate justifies the sum of $12.3 million and whether this sum included the trade preliminaries. Furthermore, the plaintiff had many discussions with WT Partnership about the estimates before the LOI was signed to understand the costing and financial implications to undertake this Project. Hence, I can only surmise from the plaintiff’s inaction that the plaintiff understood that the $12.3 million was WT Partnership’s estimated cost for “JPW’s Preliminaries”. This must refer only to the defendant’s provision of the management contractor’s preliminaries for the Project. 126 Third, the plaintiff also argues that there was nothing on the face of the documents prior to the signing of the LOI to indicate that it is to pay for the defendant’s preliminaries separately from the trade contractors’ preliminaries. The plaintiff cited the main GMP contract framework (the “Main Contract Framework”) it received from the defendant on 11 April 2008 which merely stated that $12.3 million was for “Main Building Works for Biopolis III at One-North”.137Foot Note 137×1JCB0526 – 1JCB0528.The draft LOIs also did not draw any distinctions between the defendant’s preliminaries and the trade contractors’ preliminaries.138Foot Note 138×Plaintiff’s Closing Submissions at paras 67 to 72.The plaintiff also cited the June Preliminaries Breakdown provided by the defendant which did not state that it is only the management contractor’s preliminaries.139Foot Note 139×Plaintiff’s Closing Submissions at paras 73 to 76. 127 On this point, I am unable to agree with the plaintiff. PW1 admitted that he knew that the $12.3 million referred to in the first draft of the LOI stemmed from the WT Cost Estimate for “JPW’s Preliminaries”.140Foot Note 140×Transcripts, 30 July, p 105 lines 4 to 13.This is important because having already found that the plaintiff understood that the $12.3 million in the WT Cost Estimate under the heading “JPW’s Preliminaries” referred only to the cost of providing the management contractor’s (ie, the defendant) preliminaries, the plaintiff must have known all along that the $12.3 million referred to in all the draft LOIs must have referred only to how much the defendant is to be paid for the provision of the defendant’s preliminaries. It cannot refer to the cost of providing preliminaries for the entire Project. 128 The Main Contract Framework indicated that the “Fixed Preliminaries” was for $12.3 million.141Foot Note 141×1JCB0526 – 1JCB0528.Although it did not expressly state that the Fixed Preliminaries was for the management contractor, the logical inference, reading this Main Contract Framework, must be that the Fixed Preliminaries referred to the management contractor’s preliminaries as there was a breakdown of the Fixed Preliminaries attached to the Main Contract Framework. The breakdown of the Fixed Preliminaries made no reference to the trade preliminaries. Those items in the breakdown referred to the management of the main building works which were the responsibilities of the management contractor,ie, the defendant.142Foot Note 142×1JCB0526 – 1JCB0528. 129 Fourth, there is no evidence in the correspondence between the parties leading up to the signing of the LOI that the plaintiff made known its understanding that the defendant’s Preliminaries Sum of $12.3 million should be the provision of both the management contractor’s preliminaries and trade contractors’ preliminaries. This is particularly important to the plaintiff as its case is that the $12.3 million referred to in the draft LOIs prior to the signed LOI was for the provision of all preliminaries (ie, the management contractor’s preliminaries and the trade contractors’ preliminaries). In fact, the draft LOI sent by PW2 in the email on 28 June 2008 which attempted to lump all the preliminaries under cl 1.2 (ie, the management contractor’s preliminaries and the trade contractors’ preliminaries) under the $12.3 million, did not highlight or explain the plaintiff’s position on the Preliminaries Sum to the defendant. In the correspondence leading up to the signed LOI, there was also no mention of the plaintiff’s position regarding the $12.3 million (ie, that it was for both the management contractor’s preliminaries and the trade contractors’ preliminaries). Therefore, I can only surmise from the plaintiff’s conduct that, contrary to the plaintiff’s assertion, the plaintiff must have all along accepted that the $12.3 million was only for the provision of the defendant’s preliminaries only. 130 Fifth, the plaintiff was aware, prior to the signing of the LOI, that it had to pay for the defendant’s preliminaries and the trade contractors’ preliminaries separately. I come to this finding from the fact that the plaintiff participated in the tender process for the award of the piling trade contract which was already underway in June 2008.143Foot Note 143×Transcripts, 30 July 2018, p 132 line 5.In the piling subcontract, the section on preliminaries to be provided by the subcontractor was incorporated in the tender documents sent to the tenderers. Items marked “Not Applicable” in the trade preliminaries meant that the piling contractor was not required to price for those items (ie, the plaintiff need not have to pay the piling contractor for those items). Items not marked “Not Applicable” meant that the piling contractor had to provide those items and give a price for providing them (ie, the plaintiff must pay the piling contractor for those preliminaries). This was understood by the plaintiff.144Foot Note 144×Transcripts, 31 July 2018, p 48 line 9 to p 49 line 2.As the plaintiff approved the award of the piling trade contract to Sum Cheong Piling Pte Ltd (“Sum Cheong Piling”), the inference is that the plaintiff must have known that the preliminaries of the piling works were separate from the defendant’s Preliminaries Sum. It is also clear on the evidence that throughout the piling trade contract tender process, the plaintiff did not object to this arrangement. Therefore, the plaintiff was aware that there was a method for allocating preliminaries works between the defendant as management contractor and the trade contractors. 131 This shows that the plaintiff knew that the $12.3 million allocated as “JPW’s Preliminaries” under the WT Cost Estimate and the Preliminaries Sum of $12.3 million being negotiated in all the draft LOIs in June 2008 referred to the defendant’s preliminaries only. 132 Finally, I note that the plaintiff argues that allocating $12.3 million for the provision of the defendant’s preliminaries as well as all the trade contractors’ preliminaries is feasible.145Foot Note 145×Plaintiff’s Closing Submissions at para 70.I am unable to agree with the plaintiff’s point on this. If this was the case, the defendant would be in a conflict situation because it would first need to ensure that there were sufficient funds to pay for its own preliminaries and had to ration enough funds to pay for the preliminaries of all the trade contractors involved in this Project. This would also render estimation of the GMP in the WT Cost Estimate and subsequently the GMP figure in the signed LOI difficult as each trade contractor would have differing costs of providing their preliminaries. 133 In the light of the foregoing, I find that the plaintiff must have known that the Preliminaries Sum of $12.3 million referred to in all the draft LOIs and the final signed LOI was for the defendant’s preliminaries only. Thus, there is no reason for the parties to suddenly have a fundamental disagreement on whether the Preliminaries Sum under cl 1.0 of the signed LOI is tentative. (2) The 30 June Conversation did not occur 134 To recapitulate, this issue relates to the 30 June telephone conversation in which the plaintiff alleges that the defendant agreed that the defendant’s Preliminaries Sum of $12.3 million was a tentative figure and the final amount was to be decided within four weeks of the commencement of the Project. On the evidence, I find that the 30 June Conversation did not occur and that there was no such oral agreement. 135 I shall first consider whether the plaintiff can rely on this alleged oral conversation. Any reliance on extrinsic facts for the purpose of contractual interpretation must be specifically pleaded. In this case, the plaintiff relies on the 30 June Conversation to show that the parties had agreed that the Preliminaries Sum of $12.3 million was tentative or provisional and that the parties would finalise the sum within four weeks after the commencement of the Project. Hence the 30 June Conversation is crucial evidence that formed the basis of the plaintiff’s interpretation of the LOI that the Preliminaries Sum was agreed to be provisional at the time when the LOI was signed. 136  The defendant argues that the plaintiff did not sufficiently and specifically plead the 30 June Conversation. On the contrary, the plaintiff did specifically plead the details of the 30 June Conversation. In the plaintiff’s Reply to Defence and Defence to Counterclaim (Amendment No. 2), the plaintiff stated at paragraphs 3.4 and 3.5 the following: 3.4 Despitefurther discussions between the Plaintiff’s LawrenceLeow and the Defendant’s David Tse on 30 June 2008, the Preliminaries Sum could not be agreed. However, the following was agreed by the parties in respect of the Preliminaries: 3.4.1 The Preliminaries Sum would be a “fixed sum” and not a “lump sum” as stated in the draft letters of intent. This meant thatthe Defendant would receive a fixed price for each Preliminaries item that was actually delivered and/or carried out. The summation of the price for each Preliminaries item would comprise the Preliminaries Sum. This differed from what the Defendant initially requested, namely, that an agreed lump sum amount be paid by the Plaintiff irrespective of what Preliminaries items were actually delivered or carried out by the Defendant. 3.4.2 Ten percent (10%) of Preliminaries Sum would be paid up-front to the Defendant as a down-payment. The down-payment would be adjusted progressively from the 13th to the 18th interim payment. 3.4.3 The remaining 90% of the Preliminaries Sum would be paid to the Defendant monthly, based on the actual Preliminaries items delivered or carried out and certified by JCPL. 3.4.4 The parties would execute a letter of intent forthwith so that the Project could commence despite not having agreed the Preliminaries Sum. 3.5 Consistent with the matters set out in the preceding sub-paragraph, the parties agreed and made the following amendments to the final draft of the LOI that was sent by the Plaintiff to the Defendant on 30 June 2008 and which was duly executed: 3.5.1 The term “Lump Sum” in Clause 1.2 was replaced with the term “Fixed Sum”. 3.5.2 The provision for monthly payment of Preliminaries under Clause 7.1 was changed from payments “based on work done” to payments based on “actual work done/certified”. 3.5.3A new paragraph was added to Clause 7.1 to record the parties’ agreement that the fixed figure for the Preliminaries Sum as well as the Preliminaries Breakdown was to be agreed within four weeks of Project commencement. [emphasis added] 137 Thus, it can be seen that the plaintiff had stated in its pleadings the discussion between PW1 and DW2 on 30 June 2008 rendering the Preliminaries Sum provisional. 138 However, the contemporaneous evidence does not support the plaintiff’s contention that the 30 June Conversation had taken place. I shall now elaborate. 139 First, there is no documentary evidence making reference to the 30 June Conversation in any of the correspondence between the parties leading up to the signing of the LOI. According to the plaintiff, PW1 and DW2 had a conversation on the afternoon of 30 June 2008 prior to the email sent by PW2 to DW2 on 30 June 2008 at 2.59pm (“Second 30 June Email”). However, in the Second 30 June Email, no mention was made of the 30 June Conversation. All that was stated in the Second 30 June Email was “as requested” and I find that nothing can be made of these words. 140 I also find that the absence of any reference to the 30 June Conversation in the Second 30 June Email is quite telling because the parties have a practice of recording their preceding discussion in their email exchanges leading up to the execution of the LOI. For instance, DW2 would record what he perceived to be items which were discussed previously in his emails to the plaintiff when discussing the draft LOI. This was in fact done in his email dated 6 June 2008, 9 June 2009, 10 June 2009, 26 June 2008 and 28 June 2008.146Foot Note 146×2JCB00620, 2JCB00627, 2JCB00641, 2JCB00744 and 2JCB00749.The plaintiff also followed this good practice in (a) its email to the defendant dated 9 June 2008 by Mr David Loh, which made reference to a tele-conversation between the parties on 9 June 2008; and (b) PW2’s email dated 30 June 2008 at 11.52am (“First 30 June Email”), which made reference to a discussion held with DW2 on 29 June 2008.147Foot Note 147×2JCB00635 and 2JCB00768.Therefore, the fact that PW2 did not make any mention or reference to the 30 June Conversation in the Second 30 June Email meant that the 30 June Conversation probably did not occur. 141 Second, the compromise purportedly reached in the 30 June Conversation was very important to the plaintiff because the plaintiff opined that to pay $12.3 million for the defendant’s preliminaries was too costly. If such was the case, then one would expect this important event to be recorded contemporaneously. There is no such evidence before me. 142 Third, looking at the parties’ conduct after the execution of the LOI, it is also unusual and strange that the plaintiff did not make any mention of the 30 June Conversation in its negotiations with the defendant on the Preliminaries Sum post-LOI. The first time that PW1 raised his concerns about the Preliminaries Sum was in an email dated 6 January 2009.148Foot Note 148×4JCB002139.In that email, DW2 sought to,inter alia, explain to PW1 why the Preliminaries Sum had to be $12.3 million. DW2 further informed PW1 that he had “spent the entire weekend” with PW2 “finetuning the wording on the LOI, and [they] both finally agreed with the one that was now signed by all parties”. DW2 did not mention the 30 June Conversation in this email. Furthermore, PW1 did not reply to raise the 30 June Conversation when this would have been an excellent opportunity for PW1 to refer to that telephone conversation if indeed it did take place. 143 Subsequently, when the plaintiff again raised its desire to re-negotiate the Preliminaries Sum in the meetings between the parties on 14 January 2009 and 24 January 2009 (“January 2009 Meetings”), the plaintiff did not make any reference to the 30 June Conversation.149Foot Note 149×6JCB02853 and 6JCB02855.Another instance when the plaintiff raised the issue about the Preliminaries Sum fixed at $12.3 million was in its letter to the defendant dated 6 April 2009 (reproduced below at [195]).150Foot Note 150×5JCB02911 – 5JCB02912.In this letter, the plaintiff also did not make reference to the 30 June Conversation but instead stated that it would not object to the Preliminaries Sum remaining at $12.3 million. 144 Fourth, if the plaintiff’s allegation that the 30 June Conversation occurred was true, then the subsequent conduct of the parties after the signing of the LOI ought to have supported it. On the basis of the plaintiff’s case the parties would have until 25 August 2008 (commencement of the Project was on 28 July 2008) to agree to the Preliminaries Sum to be paid.151Foot Note 151×Transcripts, 31 July 2018, p 68 lines 10 to 19.However, there was no evidence to show that the parties had engaged in further discussions or negotiation to finalise the Preliminaries Sum of $12.3 million. The only request from the plaintiff was for the defendant to provide a detailed cost breakdown of the preliminaries it intended to provide. The defendant provided the Preliminaries Breakdown in reply (see above at [35]). The plaintiff then argues that the defendant merely worked backwards from $12.3 million in deriving the cost breakdown in the Preliminaries Breakdown. This reinforces my finding that the 30 June Conversation did not happen and it strengthens the defendant’s case that $12.3 million was already agreed upon under the LOI to be the Preliminaries Sum and the defendant was merely providing a breakdown of the costs. 145  On this point, the plaintiff argues that without a detailed cost breakdown of the defendant’s preliminaries, the parties were unable to reach an agreement on the scope of the preliminaries and therefore no agreement on the Preliminaries Sum could be reached.152Foot Note 152×Plaintiff’s Closing Submissions at para 107.This argument is not convincing. The plaintiff knew from the Draft WT Contract and the August Preliminaries Breakdown the works which the defendant proposed to provide. It could, from looking at the preliminaries and having already engaged WT Partnership, estimate whether $12.3 million was appropriate. It could also have engaged its own expert, if it so wished to make this determination. Instead, the plaintiff took no steps to evaluate and compare the defendant’s Preliminaries Breakdown but adamantly asserted that the Preliminaries Sum was too high. PW1 also tried to give the impression that he was inexperienced in the GMP contract and he could not make head or tail of whether the Preliminaries Breakdown provided by the defendant was for the whole Project or not and whether there would be double counting. This had nothing to do with the GMP contract as it involves quantification or valuation of the defendant’s scope of preliminaries works. Hence, I place little weight on the plaintiff’s argument on this point. (3) The plaintiff’s allegations of overlapping scope of preliminaries work between the defendant and the trade contractors’ preliminaries works 146  The plaintiff argues that one of the main reasons why the plaintiff could not have agreed to fix the Preliminaries Sum under cl 1.0 of the LOI at $12.3 million was that it was protecting its interests against the risk of the defendant making duplicated claims against the plaintiff for the provision of its preliminaries. This could happen when the defendant outsourced its preliminaries works to trade contractors who would then charge the plaintiff under the trade package, while the defendant would also submit a payment claim on the same work to the plaintiff.153Foot Note 153×Plaintiff’s Closing Submissions at paras 115 – 121.In other words, the plaintiff was both short-changed by the defendant in the sense that the defendant did less work than was agreed and over-charged by the defendant because the plaintiff paid the trade contractors for providing the same preliminaries which it already paid to the defendant to provide. The plaintiff gave a few of such instances in which the defendant had charged the plaintiff and the trade contractors for providing the same preliminaries.154Foot Note 154×Plaintiff’s Closing Submissions at paras 122 – 135.If this was indeed the plaintiff’s legitimate concern, it had ample opportunity to raise this concern to the defendant in the negotiations between the parties prior to the signing of the LOI. However, this was conspicuously absent. Furthermore, as discussed above at [130], the plaintiff was involved in the tender process for the piling contractor. It was aware of the piling contractor, Sum Cheong Piling’s preliminaries and the defendant’s scope of preliminaries works. The plaintiff did not raise its concern regarding the duplicated claims to the defendant. Throughout this Project, the evidence before the court shows that the plaintiff was actively involved in the progress of the Project including the tender and selection process of trade contractors. The plaintiff’s concern of double claims of preliminaries by the defendant and the trade contractors for the same scope of preliminaries works could have been easily addressed by the plaintiff. The plaintiff being the paymaster of the Project could refuse to make double payment for the same preliminaries works. Therefore, this could not have been one of the reasons for the plaintiff to allege that the defendant’s Preliminaries Sum in the LOI was intended to be provisional. 147 For these reasons and on the balance of probabilities, I find PW1’s evidence on the 30 June Conversation not to be credible. (4) DW2’s evidence on a discussion with PW2 on 29 June 2008 148 DW2 testified that he had a conversation with PW1 on 29 June 2008 during which the defendant made known its vehement objections to the plaintiff’s amendments that the Preliminaries Sum of $12.3 million was meant for all the preliminaries of the whole Project.155Foot Note 155×Transcripts, 16 August 2018 at p 16 line 10 to p 18 line 15.This discussion arose from the draft LOI which PW2 sent to DW2 on 28 June 2008 at 5.27pm.156Foot Note 156×2JCB00755.Evidence of this discussion can be seen from PW2’s First 30 June Email where he made explicit reference to a discussion held between himself and DW2 on 29 June 2008.157Foot Note 157×2JCB00768.Second, DW2 made reference to this discussion in his email to PW1 dated 6 January 2009 in which DW2 stated that “[PW2] spent the entire weekend with me fine tuning the wording on the LOI, and we both finally agreed with the one that was now signed by all parties”.158Foot Note 158×6JCB02139 – 6JCB2141. 149 The plaintiff submits that this court should disregard DW2’s evidence on the conversation DW2 had with PW2 on Sunday, 29 June 2008 because this conversation was not put to PW1 and PW2. Hence PW1 and most importantly, PW2, was not afforded a chance to rebut this evidence.159Foot Note 159×Plaintiff’s Closing Submissions at para 88.On this point, I find that although the defendant’s counsel did not specifically put this point to PW2 in cross-examination, PW2 was nevertheless referred to his First 30 June Email and PW2 did not rebut it. Instead, PW2 testified that the contents of the First 30 June Email were in response to the points DW2 had raised:160Foot Note 160×Transcripts, 8 August 2018, p 97 lines 9 to 22. Q:Now, let's go on to look at your reply, which is on       the same page 2JCB, 768, the upper half of the page. Your reply is on 30 June 2008 at 11.52am and you send him an amended draft; that's listed at attachments. Then, you say -- you start by saying: \"Hi David further to our discussions yesterday, I would really like to conclude this chapter and move on. Thus I am prepared to confirm the LOI as per the amended copy of the LOI to the best I can do.\" Then you say what you have done in your email, right, points 1 to 4? A:Yes, that's in response to the points that David has raised. [emphasis added] 150 From the above cross-examination, PW2 was given ample opportunity to explain that no discussion had occurred between PW2 and DW2 on 29 June 2008. Instead, PW2 did not challenge the accuracy of the First 30 June Email which he drafted and sent to DW2. Thus the plaintiff is misconceived on this point. However, I find that DW2 had vehemently objected to the Preliminaries Sum of $12.3 million being allocated for the preliminaries of both the defendant and the trade contractors. (5) It is not probable for the parties to sign the LOI without agreement on the Preliminaries Sum 151 The defendant’s witnesses stated that to perform the role of management contractor it was critical for the Preliminaries Sum to be fixed at $12.3 million. In June 2008 the parties knew of the rapid increase in the costs of construction materials.161Foot Note 161×Transcripts, 30 July 2018 p 85 lines 10 to 12; p 88 lines 2 to 5. See also Tang Tat Kwong’s AEIC at paras 16 to 20.This was similarly expressed in the report from the Ministry of Trade and Industry.162Foot Note 162×5JCB02681.Thus I can understand the importance for the defendant to fix the Preliminaries Sum of $12.3 million as it was critical for the defendant to know its risk in undertaking this Project.  DW2 had explained that this was a GMP contract and in the light of the rising construction costs, the defendant would have to bear all the risk of costs overrun beyond the GMP figure.163Foot Note 163×Transcripts, 16 August 2018, p 177 lines 3 to 20.Hence, to hedge against these uncertainties, it was of paramount importance that the defendant fixed the Preliminaries Sum of the management contractor at $12.3 million. This was further corroborated by DW2’s email to PW2 on 28 June 2008 where DW2 stated:164Foot Note 164×2JCB00768. 2. Preliminaries is a lump sumwe need 12.3millions minimum to run the project to ensure this complete on time and taking all the risk. Jurong will not agree to take this item as pay when require basis on invoices, when the eventual invoice is less, we got paid less, who would do such thing andyet take all contracting risk such as equipment breakdown, resource shortageetc?Good try Onn …. [emphasis added] 152 Furthermore, the sum of $12.3 million was estimated by WT Partnership as the fair amount for the defendant and the parties agreed to this sum. DW2 had stated in court that if the plaintiff disputed this sum, the defendant would not sign the LOI.165Foot Note 165×Transcripts, 16 August 2018, p 17 lines 1 to 20.This is understandable as the Preliminaries Sum of $12.3 million was the foundation of the management contractor’s agreement in the LOI. Therefore, it made commercial sense for the defendant to have certainty and to fix its preliminaries at $12.3 million. If the parties could not resolve this critical and fundamental pricing issue in June 2008 and they had been in discussion about the terms of the LOI since April 2008, it is unlikely that they would be able to resolve it within a short period of four weeks from the commencement of the Project. For these reasons, I find that both parties had agreed to fix the Preliminaries Sum at $12.3 million and I am not persuaded by the plaintiff’s case that the Preliminaries Sum in the LOI was only a tentative figure as it is not supported by the plain reading of the LOI and the contemporaneous evidence surrounding the execution of the LOI. (6) The parties inserted the second paragraph of cl 7.1 of the signed LOI because they could not agree on the payment schedule for the Preliminaries Sum 153  I turn now to consider the second paragraph of cl 7.1 of the signed LOI. Prior to 28 June 2008 cl 7.1 of the LOI had only one paragraph. The first version of the second paragraph of cl 7.1 appeared in the draft LOI attached to the email from DW2 to PW2 on 28 June 2008.166Foot Note 166×2JCB00749.In this draft, cl 7.1 was drafted as such:167Foot Note 167×2JCB00753. 7.1Management Contractor’s Preliminaries Ten (10%) percent down-payment shall be payable within thirty (30) days from Date of this letter and the subsequent payment for the Preliminaries shall be on monthly basis of the work done. The down-payment shall be adjusted progressively from the payment due from 13th to 18th interim payments. Till Clause 3 be finalised, the following shall form the basis on the Preliminaries payment mode, in addition to the month advanced: 20% for the 1st and 2nd months, 10% for the 3rd and 4th months, and equally shared in the remaining months. [emphasis added] 154 Clause 3 referred to in the above cited draft LOI was about the scope of works which reads:168Foot Note 168×2JCB00752. 3.0SCOPE OF WORK The Contractor construction Scope of Work and Terms and Conditions thereof are defined and provided in the Contract Documents of the Proposed Erection of 7-Storey Multi-User Business Park Development with 2 Levels of Basement Carpark at Biopolis Drive/Biomedical Groove (hereinafter called as “the Works”). 155 Thus, subject to the finalisation of the scope of work, the defendant wanted 60% advance payment to be paid in stages over four months and the balance of the unpaid $12.3 million to be paid equally over the remaining months. This was in addition to the 10% down payment which had to be paid within a month of the execution of the LOI. 156 In PW2’s email reply dated 28 June 2008 at 5.27 pm, about four hours after DW2 proposed the above changes to the draft LOI cited above, PW2 objected to paying 60% of the Preliminaries Sum within the first four months of the commencement of the Project. PW2, in his reply email, also informed the defendant that “the new requirement for the advance payment for preliminariesis really not to be discussed now” [emphasis added] and that parties should “discuss this further”. As a result, the second paragraph of cl 7.1 which DW2 proposed above was deleted by PW2 from the draft LOI attached to his reply email.169Foot Note 169×2JCB00755. See in particular 2JCB00759. 157 In DW2’s email to PW2’s reply email cited above, on the same date at 7.24pm, DW2 suggested that the plaintiff accepts the defendant’s proposal to pay the first 60% of the Preliminaries Sum within the first six months. DW2 further stated that this is the norm.170Foot Note 170×2JCB00768. 158 PW2 then replied to DW2’s First 30 June Email by stating,inter alia: 4. As I had explained, the payment terms which we had previously agreed should remain. While we can appreciate your reasoning of heavy cash flow for the initial period due to the construction method, I would have to ensure that the conditions is fair to both parties. In any case, JPW would definitely be paid whatever costs that would be incurred on top of the initial 10% downpayment. Furthermore, this downpayment would not be adjusted until later, which would had taken care of JPW’s initial capital requirement. This would prevent in the event where the construction activities are not as ‘flurry’ as anticipated and the monies to be paid is not justified. Trust that you can concurred on this. 159 In the draft LOI attached to the First 30 June Email, PW2 did not replace the second paragraph of cl 7.1 as proposed by  DW2 and DW2’s proposal cited above at [153] remained deleted. 160 However, in the Second 30 June Email, the second paragraph of cl 7.1 found in the signed LOI was inserted into cl 7.1. It was this version that was eventually signed by the parties. 161 From the genesis of the second paragraph of cl 7.1 of the signed LOI, it reveals that there was disagreement between the parties as to how much of the Preliminaries Sum of $12.3 million was to be paid to the defendant as advance payment. There is no documentary evidence that the second paragraph of cl 7.1 of the signed LOI was inserted to indicate that the Preliminaries Sum of $12.3 million was a tentative figure. In fact, the emails starting from the first version of the second paragraph of cl 7.1 till the signed LOI which I had discussed above did not indicate that the Preliminaries Sum of $12.3 million was to be a tentative figure. 162 Thus, I find that the second paragraph of cl 7.1 of the signed LOI was inserted because the parties could not agree on the payment schedule for the Preliminaries Sum. 163 For the above reasons, I am of the view that the defendant’s Preliminaries Sum of $12.3 million was agreed by the parties. It was also obvious that the parties must have contemplated that if there were double payment by the plaintiff for the same preliminaries work of the defendant and the trade contractors’ preliminaries, the defendant should not be entitled to such payments. Accordingly, I find that the defendant’s Preliminaries Sum was fixed at $12.3 million and any double payments made by the plaintiff must be refunded. Summary 164 In summary, I am not convinced that the 30 June Conversation took place between PW1 and DW2 in which PW1 alleged that the $12.3 million stated in the signed LOI for the preliminaries was a tentative figure and the Preliminaries Sum was to be agreed upon within four weeks of the commencement of the Project. There was no corroborative evidence to support the plaintiff’s case. The plaintiff knew that the $12.3 million referred to in the WT Cost Estimate and all the draft LOIs referred only to the defendant’s preliminaries. The plaintiff also knew that the $12.3 million did not include the trade preliminaries which were separate. Clause 1.1 of the signed LOI clearly stated,inter alia,that trade preliminaries were part of the GMP. 165 Clause 1.2 of the signed LOI had unambiguously stated that the Preliminaries Sum was $12.3 million. This was agreed by the parties when they signed the LOI. This clause did not indicate that the Preliminaries Sum was a tentative figure. 166 I am unable to accept the plaintiff’s interpretation of the second paragraph of cl 7.1 of the signed LOI that the Preliminaries Sum was tentative subject to agreement by the parties within four weeks of the commencement of the Project. Upon a review of the genesis of this provision in the drafts of the LOI and the correspondence between the parties, I find that the second paragraph of cl 7.1 of the signed LOI was inserted into the LOI by the plaintiff because the parties were unable to agree on the payment schedule of the Preliminaries Sum when they signed the LOI. Thus, they had agreed to discuss the details of how the Preliminaries Sum was to be disbursed within four weeks of the commencement of the Project. 167 The conduct of the parties post-LOI also did not indicate that the Preliminaries Sum of $12.3 million was tentative. There was a complete absence of corroborative evidence to indicate that parties continued to discuss or negotiate the defendant’s Preliminaries Sum after the execution of the LOI. 168 It would not make logical sense for the parties to leave the contract price for the defendant’s Preliminaries Sum provisional as this was the foundation of the provision of preliminaries by the defendant in the signed LOI. If the Preliminaries Sum could not be agreed by the parties, then the signed LOI would have meant nothing to the parties, especially the defendant, and it would be inconceivable that the latter would want to sign the LOI. In fact, DW2 testified that it was critical for the defendant to be paid $12.3 million for the Preliminaries Sum, otherwise it would not have undertaken this Project. 169 I surmise that when the plaintiff was offered to develop the Project, it conducted a thorough due diligence to fully appreciate the cost implication. The plaintiff went through numerous discussions with WT Partnership on its cost estimate of the Project. At that time, the plaintiff realised that the defendant’s Preliminaries Sum was quite high. Thus they tried creatively to negotiate for a lesser sum. The plaintiff suggested to the defendant that the preliminaries should include the trade preliminaries. When the defendant rejected this suggestion, the plaintiff reluctantly accepted it and signed the LOI as the construction costs were on the rise at that time. 170 After the Global Financial Crisis (“GFC”) in late 2008, the plaintiff realised that it had entered into a bad commercial bargain because the escalation in construction prices did not materialise and it felt that it had agreed to pay too much for the construction of the Project. Thus the plaintiff continued doggedly to re-negotiate the signed LOI. About six months after the execution of the LOI, the plaintiff reignited the issue that the Preliminaries Sum was too high. This time, the plaintiff tried to re-negotiate almost all other items in the signed LOI such as reduction of the GMP, the defendant’s Management Contractor’s Fees and the Preliminaries Sum. These will be discussed in greater detail when I discuss the issue on whether the defendant had agreed to forego its share of the first $5 million of the shared savings.",
        "Issue 2: Whether the defendant is entitled to its counterclaim of $155,000 which it incurred to procure the OCBC Bond": "171 The evidence shows that the parties had agreed that the defendant was to provideaperformance bond when they signed the LOI. The email from DW2 to PW2 dated 11 April 2008 attached the proposed contractual framework and a “broad breakdown” of the preliminaries the defendant proposed to provide.171Foot Note 171×1JCB00570-1JCB00575.Under the proposed contractual framework, the defendant was to provide a performance bond to the value of 10% of the Contract Sum.172Foot Note 172×1JCB00574. 172 This later evolved when the defendant’s DW2 sent an email to the plaintiff’s Mr David Loh, PW2 and PW1 dated 12 June 2008 attaching the June Preliminaries Breakdown. The June Preliminaries Breakdown was based on Biopolis II which was the completed neighbouring development that was similar to this Project.173Foot Note 173×2JCB00662 – 2JCB00699.Under the June Preliminaries Breakdown which DW2 said he had looked at, the defendant agreed to provide a performance bond within 14 days from the date of the award and the amount shall be equal to 10% of the Contract Sum. It was also stated that the validity of the performance bond was to cover the whole works until the issuance of Final Certificate. I note that no specimen performance bond was provided in this breakdown despite the plaintiff making reference to a specimen. Nonetheless, I find that it is reasonable for the defendant to have been aware that the performance bond it had to provide had to be in a specific form.174Foot Note 174×2JCB00673.To determine what exactly is the “specific form” of performance bond to be provided, I shall now look at the documents parties exchanged with regard to the Preliminaries Breakdown. 173 First, with the 11 April 2008 email cited above and the June 2008 Preliminaries Breakdown operating in the backdrop, the parties executed the LOI on 30 June 2008. I therefore find that it was in the minds of both parties that the defendant was to provide a performance bond as part of its preliminaries under the LOI. 174 Although the LOI did not mention or provide the specific form of performance bond, the defendant seems to rely on either the September Preliminaries Breakdown or the October Preliminaries Breakdown to derive the sum of $155,000 which it is now claiming from the plaintiff for the provision of the OCBC Bond. Under both these breakdowns, the provision of the performance bond was costed at $155,000. 175 Furthermore, the September Preliminaries Breakdown and the October Preliminaries Breakdown made reference to a “Contract” and the only “Contract” in discussion at that point was the Draft WT Contract that was circulated on 13 August 2008 and the August Preliminaries Breakdown. In fact, the September Preliminaries Breakdown and the October Preliminaries Breakdown were built upon the August Preliminaries Breakdown which was attached to the Draft WT Contract when the plaintiff requested a costed breakdown of the defendant’s preliminaries. Under cl 4.12 of the Draft WT Contract, the defendant was obliged to provide a security deposit as stipulated in the “Conditions of Contract” within 14 days from the date of the award. Clause 4.2 of the Draft WT Contract provides a specimen of banker’s guarantee and it was clear that this was an on-demand performance bond.175Foot Note 175×3JCB01275-3JCB01276. 176  Therefore, as the defendant was relying on either the September Preliminaries Breakdown or the October Preliminaries Breakdown, the defendant is entitled to claim $155,000 if it had provided an on-demand performance bond. As it is undisputed that the OCBC Bond which the defendant provided was not an on-demand performance bond, the defendant cannot then rely on the September Preliminaries Breakdown nor the October Preliminaries Breakdown to claim the sum of $155,000 as part of its preliminaries from the plaintiff for the provision of the OCBC Bond. 177  The defendant further submits that notwithstanding that the OCBC Bond was not an on-demand performance bond, it can nonetheless claim the cost of providing the OCBC Bond from the plaintiff. The defendant’s argument is that the OCBC Bond was provided on a goodwill basis. The major contradiction lies in the fact that despite providing the OCBC Bond on a goodwill basis, the defendant expected the plaintiff to pay for it. If such is the case, there must be a clear acceptance by the plaintiff of such terms. However, this was not the case as evident from DW1’s testimony:176Foot Note 176×Transcripts, 13 August 2018, p 57 line 6 to p 58 line 10. Q: Okay. So by using the word “goodwill”, does it mean you’re going to provide them a bond for free? A: I think the meaning here “goodwill” is that prior to establishing and affirming the format of the bond, we are providing one. Q: Yes. And my question is would that mean you were giving it to them without charge, for free, “yes” or “no”? A: No. Q: No. So you’re telling them you’re giving them on a goodwill basis but you intend to charge them? A: Yeah. Q: Did you tell them; did you tell Crescendas? A: No, I didn’t. Q: Surely Crescendas would be entitled to have a say as to what kind of bond they want if they are going to be charged for it, Mr Tang. Do you not agree that’s normal? A: Yes, I think we have to then determine what is an acceptable format. Q: Correct. And did you determine whether the bond you were going to give them was acceptable to them? A: At that point in time, I think that was what we thought was appropriate. Q: No, no, Mr Tang. I will read your answer, “I think we have to then determine is it in an acceptable format”. Did you determine with Crescendas whether that bond you were intending to give was in an acceptable format to them, “yes” or “no”? A: Not in this instance. 178 Furthermore, taking the defendant’s case at its highest, namely that the signed LOI did not specify a specific form of performance bond, the defendant would only be entitled to payment for the provision of a performance bond if there was an agreement from the plaintiff to accept the OCBC Bond. From the evidence of DW2 above, it is clear that the defendant did not seek an agreement from the plaintiff. In fact, the plaintiff rejected the performance bond (see above at [37]). 179 For these reasons, I dismiss the defendant’s counterclaim.",
        "Issue 3: Whether the defendant had waived its share of the first $5 million of shared savings": "180 As a matter of law, whether an offer is a “goodwill” offer which does not give rise to a legal obligation or a legally binding offer will depend on the circumstances and the intention of the parties at the material time when the “goodwill” offer is made (O’Hare v Coutts[2016] EWHC 2224 at [231]). In particular, where an offer is made in a business and commercial context, there is a strong presumption that the offer made is intended by the offeror to be binding, unless it is expressly stated to be otherwise (Andrew Phanget al,The Law of Contract in Singapore(2012, Singapore Academy Publishing) at para 5.020–5.021). In this case, I find that the defendant’s offer in the 6 April Letter to waive its share in the first $5 million of the shared savings was not a goodwill offer. The defendant intended to create binding legal relations by this offer. As can be seen from the contents of the 6 April Letter which I shall discuss in detail below at [195] onwards, the defendant was effectively offering to waive its share of the first $5 million of the shared savingsifthe plaintiff agreed not to challenge its obligation to pay the defendant the Preliminaries Sum of $12.3 million and its Management Contractor Fee as stipulated under the LOI. 181 Despite the existence of a conditional offer and an intention to create legal relations, I find that there was ultimately no agreement between the parties that the defendant would forego its share in the first $5 million of the shared savings. In coming to this finding, the 6 April Letter and the 9 May Letter must be considered in its context in order to distil the intention of the parties when the offer from the defendant was made and the purported acceptance by the plaintiff about a month later. In this vein, there were exchanges of emails and letters dealing with several issues and disputes between the parties during the long interval between the offer and purported acceptance. There were also key correspondence between the parties after the 9 May Letter which would shed light on whether such an agreement existed. To consider these events would lead to a fair and accurate outcome. Thus, with respect, I do not agree with the plaintiff’s counsel who submits that the issue of waiver should be considered as a standalone transaction. The 6 April Letter offer was part and parcel of the ongoing negotiations between the parties to resolve their differences at that point in time. I am also not convinced that the plaintiff had provided consideration for the offer by the defendant not to share in the first $5 million of the shared savings. 182 I shall now explain my findings in detail. There was no consideration for the defendant’s offer 183 The evidence shows that the plaintiff did not provide any consideration for the offer made by the defendant in the 6 April Letter. First, PW1 fared badly when he was cross-examined on the issue of consideration. He seriously contradicted himself when he was asked whether the plaintiff had offered any consideration in return for the defendant’s offer. In cross-examination, PW1 first admitted that the plaintiff did not give any consideration in return for the defendant’s offer: Q:I’m not asking you to remember any particular letter. I’m asking you a very simple question: what did Crescendas give in return for JPW foregoing its share in the first 5 million of savings? A: Itwas given to us on a goodwill basis and we accepted it on that basis. Unless the document was for something else, right. Maybe we can look at that document. Q: That’s fine, Mr Leow, because that’s exactly our point. Of course, there’s nothing given in return and I don’t need to explain the law on this point. I’ll just take you to the 9 May letter. A: Yes. [emphasis added] 184 In re-examination, PW1 then made an about-turn and stated that he was contemplating taking out proceedings against the defendant and refrained from doing so when the defendant made the offer in the 6 April Letter: Q: So you then went on to say that “when they start giving the 5 million not sharing, ease off the tension”. What do you mean by “ease off the tension”? A:Actually at that time, I was contemplating a few things I would do,the easiest were togo to JTC and say, “Look, please cancel the HOA”,because JTC is somehow the ultimate parent and I was alsocontemplating to suspend work.Because if a bond --demand bond is not provided, I’m entitled to suspend work and obviously if all these cannot work, then we go to court like that.… [emphasis added] 185  Second, besides these serious contradictions in PW1’s evidence, the plaintiff’s allegations -– that it abstained from taking adverse actions against the defendant – is also not borne out on the evidence. The contemporaneous correspondence, emails and documents did not show that the plaintiff told the defendant expressly and clearly that if the defendant offered not to share in the first $5 million of the shared savings, the plaintiff would refrain from taking actions or escalate their disputes. If anything, it was the defendant who actually notified the plaintiff of the possibility of commencing a security of payment adjudication to resolve the dispute surrounding the huge outstanding progress payments from the plaintiff in the meeting held on 24 January 2009.177Foot Note 177×6JCB02856. 186 Hence, on the balance of probabilities, I find that the plaintiff did not provide any consideration in return for accepting the defendant’s offer in the 6 April Letter. There was no agreement between the parties (1) Correspondence leading up to the 6 April Letter 187 In order to appreciate the defendant’s offer in the 6 April Letter, it is necessary to trace back the relationship of the parties from January 2009. At that time the parties were at odds with one another over their respective obligations under the LOI, and no consensus was reached. This was evident from the Minutes of Meeting recorded on 14 January 2009 by the plaintiff. In that meeting, the parties were disputing the quantum of the Preliminaries Sum.178Foot Note 178×6JCB02852.The plaintiff alleged that the Preliminaries Sum was too high and unjustified. The defendant disagreed and stated its position that the plaintiff had agreed to a fixed Preliminaries Sum. The defendant informed the plaintiff that it must accept that the defendant needed to have some allowance to factor in the risk factor. 188 At the 14 January 2009 meeting, the plaintiff asked the defendant to reduce the GMP by $5 million because steel prices had not increased as was anticipated by the defendant when the LOI was signed. The defendant disagreed. Also, at that point in time the defendant was unhappy with the plaintiff as the latter had withheld progress payments totalling about $9,262,561.56 to the defendant.179Foot Note 179×1DCB Tab 12.The plaintiff responded by stating that progress payments to the defendant would not be held back but alleged that the defendant had been making inflated claims and there were other issues which the plaintiff was concerned about. 189 In a subsequent Minutes of Meeting between the parties on 24 January 2009, they again expressed their disagreement on their respective obligations under the LOI.180Foot Note 180×6JCB02905.Similar to the 14 January 2009 meeting above, the plaintiff again challenged the basis of the Preliminaries Sum under the LOI being fixed at $12.3 million, arguing that it was too high. The plaintiff also asked for a reduction of the GMP by $5 million as the anticipated increase in steel price did not materialise. The plaintiff said that at the time the LOI was executed (ie, June 2008) the defendant had asked for an increase of the GMP by about $7 million ($2 million for M&E and $5 million to reflect the rising steel prices). The plaintiff agreed out of goodwill. By January 2009, the increase of steel price did not materialise and the plaintiff requested a reduction of the GMP by $5 million. The plaintiff also mentioned that it would only pay the outstanding progress payments to the defendant upon the resolution of their disagreements. At this meeting, the plaintiff also questioned whether the Management Contractor’s Fees under the LOI were inflated. 190 From the above two meetings in January 2009, it is clear that the parties were in disagreement over their obligations under the LOI. The plaintiff wanted to amend the signed LOI by reducing the GMP by $5 million. The plaintiff further intended to reduce or remove the Management Contractor’s Fees as well as to reduce the Preliminaries Sum. The plaintiff was aware that the defendant wanted to stick to the terms of the LOI and not have the terms of the LOI amended. 191  In the letter dated 12 March 2009 from the defendant to the plaintiff, the defendant made reference to meetings held on 9 and 10 March 2009 between the parties where the plaintiff had made requests to amend the terms of the signed LOI. The defendant then told the plaintiff to list down the changes to the signed LOI it was proposing in order to avoid any misunderstanding.181Foot Note 181×6JCB02905. 192  The plaintiff wrote to the defendant on 2 April 2009 and made reference to a meeting held between the parties on 1 April 2009.182Foot Note 182×6JCB02911 – 6JCB02912.This letter was marked “without prejudice” and the plaintiff listed down the changes which it would like to make to the signed LOI. The relevant paragraphs of this letter are reproduced below: 2. We had explained to you our understanding of the issues relating to the “GMP arrangement” and the reasons for the position we have taken. We also explored possible ways to overcome the current “difficulties” so as to push forward with the project. 3. You have requested that we summarise in writing the terms of our proposal for your consideration. We are grateful for your agreement to give the same further consideration and we set out below the key points of our proposal: 3.1 The S$5 million increase to the GMP that was previously agreed on the basis of steel price increases is to be withdrawn, that is to say, the GMP will be reduced by S$5 million to $73,350,000.00. 3.2 The provisions for the payment of the Management Contractor’s Fees that formed part of the GMP and Profit & Attendance Fees in respect of the Provisional Trade Packages are to be withdrawn, that is to say, we will no longer be obliged to make payment of these fees. 3.3 There will be no provision for the imposition of liquidated damages against you in the event of a delay in completing the project. We will only be entitled to such damages that are recoverable from the trade contractors. 3.4 You will not be responsible for any cost overruns, that is to say, you will not bear the additional cost even if the construction cost exceeds the “revised” GMP. 3.5 We will not object to the Preliminaries sum remaining at $12.3 million. 193  PW1 explained that by marking a letter “without prejudice”, it meant that the contents of the letter could not be held against him unless and until the parties had reached an agreement.183Foot Note 183×Transcripts, 3 August 2018 at p 5 lines 8 to 12.It is clear from this letter that the parties were negotiating on whether to amend the terms of the signed LOI as well as how to resolve the disagreements between the parties which were ventilated in the January 2009 meetings. 194 The defendant replied on 3 April 2009 to confirm receipt of the plaintiff’s proposal to amend the signed LOI and informed the plaintiff that the defendant would refer the plaintiff’s proposal to the defendant’s Board for its consideration.184Foot Note 184×5JCB02948. (2) The 6 April Letter 195 On 6 April 2009, the defendant reverted back to the plaintiff regarding its proposed changes to the signed LOI. This reply was also marked “without prejudice”. The relevant paragraphs of the 6 April Letter are reproduced below:185Foot Note 185×6AB02950. Upon detail consideration from the senior management/Board, as the current endorsed LOI was a result of lengthy negotiation and is a legal bind document, it should not be altered and it should continue to form the basis of the project execution till the final Agreement is endorsed. In view of the current global economic condition, andsolely on a goodwill basis,the senior management/Board hadagreed to allowJURONG Primewide Pte Ltd toabstain from taking the 50% cost saving [ie, shared savings] in the first 5millions from the current GMP quantum(S$78.3 millions) for the trade packages.The rest of the commercial terms as stipulated in the current LOI remains. The senior management/Board are of the view that this goodwill is a fair assessment for the project current situation and reflecting the current market condition. The decision is thus final. [emphasis added] 196  As the defendant’s reply was also marked “without prejudice”, the plaintiff must have realised that what was stated in this letter would not be binding until the parties had come to a formal agreement. 197  From the events prior to the issuance of this offer on 6 April 2009, it is clear that the defendant’s offer to waive its share in the first $5 million of the shared savings was madeon conditionthat the rest of the terms of the signed LOI remains. In the light of the disagreements between the parties as ventilated in the January 2009 meetings and which the plaintiff recorded (see above at [187]– [189]), the plaintiff must have known that the defendant’s offer was on the condition that the plaintiff would not pursue its intention to amend the terms of the signed LOI (ie,including that the defendant’s Preliminaries Sum would remain at $12.3 million as stipulated in the signed LOI and that the Management Contractor’s Fees not be removed). (3) Correspondence after the 6 April Letter 198 The subsequent correspondence after the 6 April Letter leading up to the 9 May Letter show that the parties continued to discuss and negotiate their disagreements regarding their obligations under the signed LOI. The offer made by the defendant in the 6 April Letter became just one of the offers by the defendant in the negotiation. The defendant’s offer to forgo its share in the first $5 million of the shared savings was part of a package deal which would eventually form part of a settlement agreement that the parties hoped to arrive at in the resolution of their differences at that point in time. 199 Starting first with the plaintiff’s letter dated 13 April 2009 to the defendant, the plaintiff made reference to a meeting between the parties on 7 April 2009.186Foot Note 186×6JCB02952.The relevant paragraphs of this letter are reproduced below: Further to the meeting … on 7 April 2009, we believe both parties have in-principle agreed to put their difference aside for now and work together to complete the project. While we appreciated Jurong Primewide Pte Ltd’s agreement to waive and not take their 50% share of the first S$5 million savings of the GMP, we would like to record our regret that you were unable to concur and/or agree with our position in relation to the Preliminaries and Management Contractor’s Fees as set out in our letter … dated 2 April 09. … In addition to your concession on the first $5m savings on the GMP, you have also agreed that JPW will: 1. not front-load all subsequent progress claims, in particular the Preliminaries and Management Contractor’s Fees; 2. remain obliged to complete and handover the project by 31 March 2010; 3. not claim or seek to recover from us any prolongation and/or any other associated losses/costs which JPW or any other party has suffered or may suffer; 4. absorb and be solely liable for all costs incurred in connection with or arising out of the engagement of Parson Brinkerhoff for services rendered (including but not limited to the civil and structural design works) or to be rendered. … [P]lease note thatsuch agreement as well as payment by us pursuant to the same is without prejudice to our rights in respect of our position concerning the Preliminaries and Management Contractor’s Fees … [emphasis added] 200 From this letter it is clear that the parties were still trying to resolve their differences. It is apparent that the defendant’s offer not to take its share of the first $5 million of the shared savings was part and parcel of the options available to the parties in this negotiation. In this letter, the plaintiff continued to maintain its position to review the Preliminaries Sum and Management Contractor’s Fees contrary to what the defendant wanted by the phrase “the commercial terms of the LOI remains”. In substance, the plaintiff’s 13 April 2009 letter was a rejection of the defendant’s letter of 6 April 2009. 201 In reply to the plaintiff’s letter dated 13 April 2009 regarding the defendant’s waiver of its share in the first $5 million of the shared savings cited above, the defendant disabused the plaintiff of its misapprehension in a subsequent letter dated 15 April 2009. In this letter, the defendant reminded the plaintiff that the 6 April Letter was “purely on a goodwill basis” and on the condition that the terms of the LOI remain unchanged.187Foot Note 187×6JCB02957.Subsequently in the defendant’s letter dated 20 April 2009, the defendant stated that the points raised in the plaintiff’s letter dated 13 April 2009 simply “stated [the plaintiff’s] preferred outcomes on certain issues raised at the meeting on 7 April 2009”, that “[c]learly to-date [parties] have not agreed [on] these issues” and “[u]ntil a new agreement is reached … the project will continue to be executed based on the [LOI] …”.188Foot Note 188×6JCB02974.I also find that these letters from the defendant clearly notified the plaintiff that the offer in the 6 April Letter was on a “without prejudice” basis and that nothing was agreed until a formal agreement had been entered into by both parties. This also shows that the offer in the 6 April Letter can hardly be read as a binding offer unless the plaintiff was prepared to honour the terms of the LOI and not amend them. 202 The plaintiff in fact acknowledged that the defendant had not agreed to waive its share in the first $5 million of the shared savings in its email to DW2 dated 21 April 2009.189Foot Note 189×6JCB02977.In that email, PW2 was discussing with DW2 on the possible terms of the agreement which would resolve the parties’ outstanding disputes. PW2 stated in that email the words “assume first $5 million waived by JPW”. This suggests that the defendant had not agreed to waive its share in the first $5 million of the shared savings yet. 203 After the above email, the defendant wrote to the plaintiff in a letter dated 28 April 2009 where it referred to a meeting between the parties on 20 April 2009.190Foot Note 190×6JCB02979.The defendant informed the plaintiff that it acknowledged the plaintiff’s position to reserve its rights on the issues of the Preliminaries Sum and the Management Contractor’s Fees and that the parties had agreed that the signed LOI would remain as the contract framework between the partiesuntil a mutual agreement on these issues are reachedbetween the parties. 204 Subsequently, PW2 wrote an email to DW1 and DW2 on 8 May 2009 where PW2 put in writing the various positions of the parties in the ongoing dispute between them.191Foot Note 191×6JCB03042.PW2 then went on to acknowledge that there was a need to “document and confirm all matters discussed and agreed”. This again shows the plaintiff’s understanding that no agreement would be final until it was formalised. 205 Finally, in an email between  DW2 and  PW2 on 8 May 2009, both parties concurred that any agreement reached in the resolution of the parties’ ongoing disagreement should be penned down into a side agreement with the help of their lawyers.192Foot Note 192×6JCB03044. 206 From the above correspondence between the parties after the 6 April Letter, I find that it is clear that the parties understood the 6 April Letter was a “without prejudice” letter and that nothing was agreed until a formal agreement was documented and mutually agreed upon. I do not agree with the plaintiff’s submissions that the defendant’s offer to waive its share in the first $5 million of shared savings was a standalone separate offer isolated and unrelated to the overall negotiations between the parties.193Foot Note 193×Plaintiff’s Closing Submissions at paras 173 to 181.This approach would not be an accurate evaluation of the evidence to ascertain whether there was a legally binding contract between the parties. (4) The 9 May Letter 207 It is the 9 May Letter which the plaintiff relied heavily on to show the plaintiff’s purported acceptance of the defendant’s offer in the 6 April Letter. I cite the relevant paragraphs of the 9 May Letter:194Foot Note 194×6JCB03048. We refer toyour letter dated 4 May 2009(Ref: S-JPW-08-0002/S0500/THW/CO266) We believe you have misunderstood our position as stated in our letter dated 13 April 2009 (Ref: CBPL/C-08/10/PT/slo/31). We accept the terms contained in your letter dated 6 April 2009 (Ref: S-JPW-08-0002/S0500/THW/C0242). Crescendas’ payment as reflected in our [other] letter dated 13 April 2009 (Ref: CBPL/C-08/10/PT/slo/30) will be unconditional.The terms of the LOI remain, however, parties have agreed that this means that our right to have the meaning or interpretation of provisions relating to the Preliminaries and Management Contractor’s Fees construed by a court of law (or other appropriate forum) is reserved and not prejudiced in any way.We believe this is not disputed. … With regard to the other issues raised in the 5th and 6th paragraphs of our letter dated 13 April 2009(Ref: CBPL/C-08/10/PT/slo/31), please note that we are not linking it to our above-mentioned payment. Our understanding was that we had agreed the issues raised in these paragraphs however, it appears from your letter that you do not share the same view.In good faith, we will attempt to resolve these issues with you moving forward. [emphasis added] 208 First, on a plain reading of the 9 May Letter, the plaintiff sought to do many things. Notably, it sought to first clarify its position in relation to the defendant’s letter dated 4 May 2009. Secondly, it sought to accept the offer made by the defendant in the 6 April Letter. Thirdly, it stated that the payment as reflected in its other letter dated 13 April 2009 was unconditional. 209 This then brings me to consider what the plaintiff meant by “we accept the terms contained in your [6 April Letter]”. This suggests that the plaintiff intended to accept the offer made by the defendant in the 6 April Letter. However, in the next paragraph, the plaintiff qualified this acceptance by stating that “[t]he terms of the LOI remain, however, parties have agreed that this means that our right to have the meaning or interpretation of provisions relating to the Preliminaries and Management Contractor’s Fees construed by a court of law (or other appropriate forum) is reserved and not prejudiced in any way”. This prompted the defendant to clarify certain positions in its reply letter dated 11 May 2009 which then showed that the defendant rejected the plaintiff’s qualified acceptance. (5) Correspondence after the 9 May Letter 210 In a letter dated 11 May 2009, the defendant informed the plaintiff the following:195Foot Note 195×6JCB03051. … With regards to your acceptance of our letter dated 6 April 2009 (ref: S-JPW-08-002/S0500/THW/C0242),we trust that you appreciate the position taken in that letter is without prejudice to our rights and on the basis that the rest of the commercial terms stipulated in the letter of intent dated 26 June 2008 (ref: CBPL/C-08/10/SLO/lwk/12)[ie, LOI]remains. By your letter of 13 April 2009 (ref: CBPL/C-08/10/PT/slo/31), you have sought to the change of commercial terms to the letter of intent. Accordingly, we trust that both parties will in good faith resolve all issues between us together so as to move forward towards a successful project. [emphasis added] 211 From the defendant’s letter dated 11 May 2009, it is clear that the defendant’s position was that the parties had not come to any agreement. In fact, the defendant stated that it understood the plaintiff’s position in the letter dated 13 April 2009 (see above at [199]), as one seeking to amend the commercial terms of the LOI. In other words, the defendant made it clear in this letter that by seeking to challenge the Preliminaries Sum and the Management Contractor’s Fees, the plaintiff was going against the condition set out in the 6 April Letter, namely what the defendant understood as “all the commercial terms of the LOI remains”. On this, I am unable to agree with the plaintiff’s argument that the 6 April Letter should be read only on its plain and ordinary meaning, devoid of any of the context surrounding the correspondence leading up to and subsequent to the 6 April Letter.196Foot Note 196×Plaintiff’s Closing Submissions at para187.As can be seen in the detailed examination of the chronology of correspondence between the parties above, “all the commercial terms of the LOI remains” has a more nuanced meaning than its plain and ordinary reading and the intention of the defendant can only accurately be gleaned from the context surrounding the 6 April Letter. 212 Therefore, from the plaintiff’s case, it is clear that the plaintiff wanted to have its cake and eat it too. In the plaintiff’s 9 May Letter, it was willing to accept the defendant’s concession not to take its 50% share in the first $5 million of the shared savings but was adamant to challenge and dispute its obligations under the signed LOI, namely, its obligation to pay the Preliminaries Sum and the Management Contractor’s Fees. As mentioned, in the letter dated 11 May 2009, the defendant considered this an intention on the part of the plaintiff to amend the commercial terms of the signed LOI. Thus, the plaintiff had refused to accept the condition attached to the 6 April Letter and so its acceptance was invalid. 213 Furthermore, when the defendant stated in its 11 May 2009 letter that “we trust that both parties will in good faith resolve all issues between us together so as to move forward towards a successful project”, I find that it is clear that parties had not achievedconsensus ad idemon the issue of the defendant’s waiving its right to share in the first $5 million of the shared savings. 214 The subsequent email thread on this subject between PW2 and DW2 starting from 14 May 2009 clearly showed that parties had not reached any form of agreement yet. In the first email dated 14 May 2009 after the 9 May Letter, DW2 wrote to PW2 as a follow up on their meeting earlier the same day. DW2 summarised the terms of settlement thus far and this included a “5 million offset of profit sharing from the 78,3 million (GMP remains)”.197Foot Note 197×7JCB03471.In reply, PW2 emailed DW2 on 15 May 2009 asking for confirmation “that the GMP reduce by $5 million as you had offered from the onset”.198Foot Note 198×7JCB03470.DW2 replied on 16 May 2009 that the “GMP saving will not be counted in the first 5 millions (sic), not the GMP”.199Foot Note 199×7JCB03470.I surmise from this that DW2 was clarifying that the defendant proposed not to take its share in the first $5 million of the shared savings. On the whole, this email thread showed that parties were still negotiating a settlement agreement after the 9 May Letter and a settlement agreement had not been concluded between the plaintiff and the defendant. The defendant’s offer to waive its share in the first $5 million of the shared savings was still an offer on the table for the parties to consider. Arguments on pleadings 215 The plaintiff argues that the defendant had not pleaded that:200Foot Note 200×Plaintiff’s Closing Submissions at paras 160–161. (a) the offer made in the 6 April Letter was made on a “goodwill” basis and so was not enforceable; (b) the offer made in the 6 April Letter was part of a “package deal” and that the plaintiff had failed to agree with the other terms that were part of the “package deal”; (c) the plaintiff failed to comply with the condition that the “rest of the commercial terms as stipulated in the current LOI remains”; and (d) the agreement was not supported by consideration. 216 I disagree with the plaintiff’s arguments above. It is the plaintiff’s defence that the parties had agreed for the defendant to waive its share in the first $5 million of the shared savings. Thus, the onus is on the plaintiff to prove that such an agreement existed. Second, I find that the defendant had sufficiently pleaded the contents of the 6 April Letter.201Foot Note 201×Defence and Counterclaim (Amendment No. 4) at paras 68 and 69.The defendant had pleaded that there was no agreement arising from the 6 April Letter and the 9 May Letter. Third, the contents of these letters were amply ventilated in court by both the parties’ witnesses. Hence, neither party had been prejudiced by the defendant’s case. Thus, I place no weight on the plaintiff’s arguments above. Summary 217 In summary, I find that there is no contractually binding agreement between the parties that the defendant would forgo its share in the first $5 million of the shared savings. First, I find that the plaintiff did not provide any consideration for the offer made by the defendant in its 6 April Letter. Second, I am of the view that the plaintiff was not prepared to accept the conditions stipulated by the defendant for the waiver of its share in the first $5 million of the shared savings. In fact, the plaintiff had rejected the defendant’s offer of 6 April 2009 as early as the plaintiff’s letter dated 13 April 2009. Accordingly, the plaintiff’s conditional acceptance in its 9 May Letter of the defendant’s offer of 6 April 2009 was not valid. Furthermore, after the 9 May Letter, I find that the parties did not come to any agreement on whether the defendant had agreed to waive its share in the first $5 million of the shared savings. This is understandable as the defendant did not agree with the plaintiff’s acceptance as the latter clearly indicated that it rejected the defendant’s conditions. Therefore, the plaintiff has no basis to withhold the defendant’s share in the first $5 million of the shared savings.",
        "Issue 4: Liabilities of the parties for the delays and the duration of the delays": "218 I shall now deal with the various issues relating to the delays in the Project. It is undisputed that the Project was delayed. It is also undisputed that both parties had contributed to the delays although the plaintiff alleges that its action did not impedeactualprogress of the Project. 219 In order to ascertain the period of delays, I shall first determine what constitutes Project completion under cl 5.0 of the LOI. This will enable me to establish the contractual completion date of the Project according to cl 5.0 of the LOI. 220 Next, I have to ascertain whether the cause of the delays was solely attributable to the defendant, the plaintiff or both parties. To do so, I shall consider the following issues relating to the delays: (a) Did the plaintiff and/or the defendant cause any delay when the plaintiff terminated the RE without any immediate replacement? If so, what is the duration of the delay? (b) Did the plaintiff and/or the defendant cause any delay in the award of the RC works to the trade contractor, namely MA Builders Pte Ltd? If so, what is the duration of the delay? (c) Did the plaintiff and/or the defendant cause any delay in the award of the A&G works to Positive Engineering Pte Ltd? If so, what is the duration of the delay? (d)  Should the defendant be held responsible for the delay caused by the additional works, particularly the fabrication and installation of the additional signage, as instructed by the RI? If so, what is the duration of the delay? (e) Should the defendant be held responsible for the delay caused by the additional works, specifically the additional railing works, as instructed by the BCA? If so, what is the duration of the delay? 221 Finally, if the plaintiff’s conduct had caused the delays, whether these set the contract period under the LOI at large. If time is set at large, I have to consider whether the Project was completed in reasonable time. If not, I have to ascertain how much delays were attributable to the defendant. 222 I shall now deal with the above issues in turn. When was the Project deemed completed under the LOI? 223 The parties are in dispute as to what is the actual completion date of the Project. As stated above, the defendant’s position is that completion took place once the Project was ready for TOP application and inspection. The plaintiff’s position is that completion took place at a later date, upon the issuance of the TOP. To recapitulate, cl 5.0 of the LOI stipulates when the Project will be deemed complete. For ease of reference, cl 5.0 of the LOI is reproduced below:202Foot Note 202×2JCB00787. 5.0 CONTRACT PERIOD The contract period for the Works shall be Eighteen (18) calendar monthsfor substantial completionandready for Temporary Occupation Permit (TOP) application and inspections from the relevant authorities. The commencement date of the Contract shall be 23rd July 2008 or the Date of Permit to Commence Work from the Authorities whichever is earlier. [emphasis in original omitted; emphasis added in italics and bold italics] 224 There are two interpretations that may be given to cl 5.0: (a) One interpretation of cl 5.0 is that it creates two distinctive requirements (“Interpretation A”). The first requirement is that the works had to be substantially completed in 18 months: “The contract period for the “Works” shall be Eighteen (18) calendar months for substantial completion”. The second requirement is that the works had to be ready for TOP application and inspections from the relevant authorities in 18 months: “The contract period for the “Works” shall be Eighteen (18) calendar months for … Temporary Occupation Permit (TOP) application and inspection from the relevant authorities”. It may be argued that the requirement of substantial completion is wider than the requirement that works had to be ready for TOP application and inspections. This interpretation of cl 5.0 of the LOI is reached by inferring the word “and” (emphasised in bold italics) disjunctively. (b) Another interpretation of cl 5.0 is that it simply means that contractual completion is reached when the Project is ready for TOP application and inspection (“Interpretation B”). It follows that the relevant work to be completed for the purposes of contractual completion are those that go towards TOP application and inspection (as opposed to the grant of a TOP). Under this interpretation, the phrase “ready for Temporary Occupation Permit (TOP) application and inspections from the relevant authorities” merely elaborates and sheds light on the words “substantial completion”. This interpretation of cl 5.0 is reached by construing the word “and” (emphasised in bold italics) conjunctively. 225 Having had regard to the contextual background of cl 5.0, I arrived at the conclusion that Interpretation B is to be preferred. This interpretation best comports with the parties’ intention at the time the LOI was signed. 226 I begin with the plaintiff’s interpretation of cl 5.0. The plaintiff submits that Interpretation A is to be preferred. As stated above at [60], the plaintiff’s position is that completion is only achieved when: (a) all works had complied with the requirements of the Authorities before they are prepared to issue the TOP; (b) the documents required by the Authorities have been submitted to the SO for TOP application; and (c) Non-TOP works have also been completed. The first two aforementioned items (ie, (a) and (b)) go towards meeting the requirement to be ready for TOP application and inspection, whereas the third item (ie, (c)) goes towards the requirement of substantial completion.203Foot Note 203×Plaintiff’s Closing Submissions at paras 475–476.As Non-TOP Works have to be completed before the issuance of a TOP, the plaintiff asserts that the correct interpretation of cl 5.0 is that contractual completion occurs on the issuance of the TOP. 227 The defendant, on the other hand, submits that Non-TOP Works are not essential to the issue of completion. Rather, contractual completion is met when works necessary for TOP application and inspection have been completed. In essence, the defendant prefers Interpretation B.204Foot Note 204×Defendant’s Closing Submissions at para 554. 228 The significance in adopting Interpretation A over Interpretation B lies in whether Non-TOP Works are relevant for the purpose of completion under the LOI. This, in turn, has an impact on whether completion occurs when the Project is ready for TOP application and inspection or upon the issuance of the TOP. The court must ultimately have regard to the parties’ intention at the time the LOI was signed. 229 To ascertain the intention of the parties behind cl 5.0 of the signed LOI, it is pertinent to trace and examine the various versions of cl 5.0 of the draft LOIs prior to the parties signing the final LOI on 30 June 2008. As the evidence will show, the parties contemplated two different yardsticks for completion in the lead-up to the execution of the LOI: upon obtaining TOP, and upon the Project being ready for TOP application and inspection. The eventual position in the signed LOI was the latter which is that completion occurs upon the Project being ready for TOP application and inspection. 230 The first draft LOI consisted of only two pages and it was sent by DW2 to the plaintiff in his email dated 3 June 2008. It stated that the contract period for the Project would be “(18) calendar months including obtaining Temporary Occupation Permit (TOP) from the relevant authorities” [emphasis in original omitted].205Foot Note 205×2JCB00601.This became cl 5.0 in the next draft and was unamended in the next 5 drafts.206Foot Note 206×2JCB00623, 2JCB00637, 2JCB00630, 2JCB00642, 2JCB00727 and 2JCB00746.At this stage of the parties’ negotiations, the completion date for the Project would be when the relevant authorities issued the TOP. 231 Subsequently, in the draft LOI attached in DW2’s email dated 28 June 2008 at 1.51pm, cl 5.0 was amended as follows:207Foot Note 207×2JCB00752. 5.0 Contract Period The contract period for the Works shall besubstantial completion in Eighteen (18) calendar months for (TOP) Ready for inspection from the relevant authorities. [emphasis in original omitted; emphasis added in italics] DW2 sought to amend completion to be in tandem with the Project being ready for TOP inspection. This, however, was not accepted by the plaintiff. In PW2’s reply email dated 28 June 2008 at 5.27pm, PW2 amended the above clause back to the previous wording; namely, to state that the contract period for the Project would be “[e]ighteen (18) calendar months including obtaining Temporary Occupation Permit (TOP) from the relevant authorities” [emphasis in original omitted].208Foot Note 208×2JCB00758.This wording remained in the next draft of the LOI which was attached to PW2’s First 30 June Email. Finally, in the signed LOI, cl 5.0 adopted its current form which is reproduced above at [223]. 232 From the above chronology, it is clear that the parties initially intended for the Project to be completed when TOP was obtained, by stating that the contract period shall be “(18) calendar months including obtaining Temporary Occupation Permit (TOP) from the relevant authorities”. This was the intention of the parties for the first seven drafts of the LOI. Their intention, however, changed in the draft LOI attached in DW2’s email dated 28 June 2008 (see above at [231]) and in the final signed LOI where the parties agreed that the Project’s completion would be achieved when the Project was ready for TOP application and inspection. 233 What is pertinent in this analysis is that nowhere in these draft LOIs did the parties mention anything about Non-TOP works such as testing and commissioning works. The parties first focused on the date when the Project attained TOP, which would be the Project completion date. Subsequently, the completion date was brought forward to the time when the Project would be ready for TOP application, as can be seen from the plain reading of cl 5.0 of the signed LOI. Hence, this shows that the parties felt that Non-TOP works were not critical for the Project’s contractual completion. 234 In addition to this analysis, I cannot accept the plaintiff’s submissions that “substantial completion” in the signed LOI means that all testing and commissioning works for the Project had to be completed and that “the owner can occupy or use the Work or a portion thereof for its intended use” and that all works that “had a safety implication … had to be completed before substantial completion was achieved”.209Foot Note 209×This is because under the Building  Control Act, s 12(4) states that having TOP is only “prima facie evidence that a building is suitable for occupation”. This means that when a building is granted TOP, the BCA is satisfied that the building is suitable for occupation. Applying the plaintiff’s interpretation of cl 5.0 of the LOI, the Project would only be considered substantially completed when it was fit for occupation. This would effectively require the TOP certificate to have already been granted for the Project. This is not the correct interpretation of cl 5.0 of the signed LOI as the parties had moved away from this position as I had discussed in the foregoing paragraphs. 235 Furthermore, if I accept the plaintiff’s definition of “substantial completion” (see above at [60]), it would render the phrase “and ready for Temporary Occupation Permit (TOP) application and inspections from the relevant authorities” otiose in the LOI. This is because if the Project has obtained all the criteria mentioned by the plaintiff (ie, complied with the requirements of the Authorities, completed all Non-TOP works and all documentations required by the Authorities were submitted), the Project would have been more than just ready for TOP application. This interpretation will render the phrase “and ready for Temporary Occupation Permit (TOP) application …” superfluous. It is trite law that when construing a contract, there is a presumption against redundant words or surplusage (Centre for Laser and Aesthetic Medicine Pte Ltd v GohPui Kiat and others[2017] SGHC 72 at [31]). Therefore, I am unable to accept the plaintiff’s arguments. 236 I shall now address four evidential points raised by the plaintiff. First, I note that the plaintiff sought to rely on Teo Boon Thong Thomas’s (“DW3”) evidence to argue that the defendant had admitted that “substantial completion” is different from the Project being ready for TOP application.210Foot Note 210×Plaintiff’s Closing Submissions at paras 489 – 496.On this, I find that on closer examination of DW3’s evidence, it shows that DW3 did not make such an admission: Court:Mr Teo, what is your understanding of substantial completion and TOP ready? Does it mean the same thing? A: Actually, for TOP ready, is more - -it’s almost the same as substantial completion,but TOP ready, we will focus more on items on -- that will be inspected by the respective inspectors to ensure that the building is functionable [sic]. And in TOP ready, sometime there is some finishing work may not be done. So long as it does not impede on the safety of the user, then the RE will give the light, will approve the inspection. Substantial completion means almost the same thing,that we have done most of the things, major things that need to -- works in operation.Again, it’s almost like TOP ready, like some finishing works that is not done, will not affect-- can be taken as total substantial completion. It’s 95 per cent. Your Honour, because after that there is also other kind of handing over for inspection, this and that, it’s all internal. [emphasis added] DW3 was trying to explain that the Project had to be substantially completed but not 100% completed for it to be ready to apply for TOP. This is consistent with my findings above. 237 Second, the plaintiff relied on PW3’s evidence where she gave evidence that “substantial completion” was different and separate from the Project being ready for TOP application.211Foot Note 211×Plaintiff’s Closing Submissions at para 488.On this I find that PW3’s evidence is inconsistent. Documentary evidence clearly showed that PW3 had, on behalf of the SO, declared that the Project was completed as at 24 November 2010 and 21 December 2010.212Foot Note 212×22JCB11623 and 22JCB11628.In these two documents, the SO had made declarations to the BCA that the Project was completed on 24 November 2010 and 21 December 2010. When confronted with these documents in cross-examination, PW3 stood by her declarations in these two documents. She then clarified that as far as substantial completion was concerned, it was fine if there were minor works outstanding or defects which could be dealt with during the defects liability period.213Foot Note 213×Transcripts, 10 August 2018 p 116 line 6 to p 118 line 5.This evidence only shows that PW3 was not clear as to how she understood Project completion. Thus, I did not place much weight on her evidence on this point. 238 Third, the plaintiff’s expert Mr Daniel Thomas Connors (“PW4”) opined that Clause 9.8.1 of A201-2007 –General Conditions of Contract for Constructionproduced by the American Institute of Architects (“AIA”) states that ‘substantial completion’ is the stage in the progress of work when “the owner can occupy or use the Work or a portion thereof for its intended use”.214Foot Note 214×Affidavit of Evidence-in-Chief of Daniel Thomas Connors (“Mr Connors”) at p 222 para 301.This may be the interpretation under the AIA and it is a general interpretation which the contracting parties can depart from. Indeed, as I have found above, the parties had clearly intended to depart from the AIA definition of “substantial completion” when they signed the LOI. 239 Fourth, the plaintiff submits that the court should disregard the defendant’s argument on the interpretation of cl 5.0 of the signed LOI because PW1’s evidence on this was not challenged during cross-examination.215Foot Note 215×Plaintiff’s Closing Submissions at paras 477 – 480.PW1 stated that in order to achieve completion under the signed LOI, the defendant had to achieve:216Foot Note 216×Mr Leow’s AEIC at para 228; Plaintiff’s Closing Submissions at para 477. (a) substantial completion, being a state where the full use, occupation and enjoyment of the building would not be hindered by any outstanding works (TOP and non-TOP) that had to be performed; (b) a state of completion or readiness for “an application for TOP (as distinct from calling for inspections). This meant [the defendant] not only had to complete the physical works, but had to furnish the SO with all relevant documentation required for a TOP application. 240 The above evidence is also corroborated by PW2.217Foot Note 217×Plaintiff’s Closing Submissions at para 479.Hence the plaintiff submits that this court should accept PW1’s interpretation of the LOI. 241 The defendant’s counsel might not have put the defendant’s case to PW1 but he had questioned PW1 about the completion date when he cross-examined PW1 on paragraph 26 of his AEIC.218Foot Note 218×Transcripts, 30 July 2018 p 107 line 20 to p 108 line 9.PW1 had adequately given his version of what constituted Project completion under the LOI and what he understood to be agreed between the parties regarding this issue. It was clear that the defendant does not accept the plaintiff’s interpretation of cl 5.0 of the signed LOI and the plaintiff was given an opportunity to explain its case on this point. Therefore, the rule inBrowne v Dunndoes not apply here. 242 Furthermore, although the general proposition is that testimony not subjected to contradiction in cross-examination may be treated as unchallenged and thus accepted by the opposing party, the court is still entitled to reject such testimony. The court must still embark on a careful evaluation of thetotalityof the evidence to determine the cogency and weight of such testimony. In other words, it need notalwaysfollow that any unchallenged testimony of a witness must be accepted wholesale by the court (Lizabte Ismail v Public Prosecutor[1997] 1 SLR(R) 555 at [72]). When PW1’s evidence cited above is looked at in the light of the contextual interpretation of  cl 5.0 of the signed LOI which I had embarked on above at [223]–[235], it is clear that PW1’s evidence is inconsistent with the documentary evidence presented in this case. 243 Therefore, I do not accept the plaintiff’s case that Project completion under the signed LOI is more than just the Project being ready for TOP application and includes Non-TOP works as well. 244 In summary, I find that cl 5.0 of the signed LOI meant that the Project would be deemed complete when it was ready for TOP application and not when TOP was granted. Arising from the BCA’s inspection of the Project on 22 December 2010, the BCA directed the SO to apply for TOP.219Foot Note 219×22JCB11713.Therefore, the Project must be deemed by the BCA to be ready for TOP application on 22 December 2010. Hence, under cl 5.0 of the signed LOI, the Project was completed on 22 December 2010. Liabilities for the delays in the Project completion The law 245 It is not disputed that there is an implied obligation on the plaintiff not to prevent the defendant from completing the Project on time. An “act of prevention” is committed when the plaintiff prevents, impedes or otherwise makes it more difficult for the defendant to complete the works by the date stipulated in the contract (Yap Boon Keng Sonnyv Pacific Prince International Pte Ltd and another[2009] 1 SLR(R) 385 at [34]). 246 If the action of the plaintiff caused delay in the Master Program of the Project but in reality the progress of the Project was not affected, this is notional delay. An example of this is when the delay caused by the defendant over-ran the delay caused by the plaintiff. Notional delay would not constitute an act of prevention. To constitute an act of prevention, the plaintiff’s action had to cause delay to theactual progressof the works involved in the Project such that it impeded the Project and delayed its completion date. (AdyardAbu Dhabi v SD Marine Services[2011] EWHC 848 at [281]–[282]; see alsoJeramFalkus Construction Limited v Fence Investments Inc[2011] EWHC 1935 (TCC) at [50] and [52]). 247  With these legal principles in mind, I shall now proceed to examine each of the delaying events which the defendant alleged was caused by the plaintiff and consider whether they are acts of prevention. A finding that the plaintiff had committed an act of prevention, even for a day, would have implications on whether the defendant is bound by the contract period of 18 months under cl 5.0 of the signed LOI and whether the defendant can be held liable for liquidated damages under cl 6.0 of the signed LOI. I shall discuss this further below at [356] onwards. The Master Program 248 Before going into the various delaying events, I pause here to highlight two aspects of the case which are highly relevant in the determination of the liability for the delays caused in the completion of the Project. 249 First, both parties’ experts relied on the Master Program in their analysis for the delays issue.220Foot Note 220×Mr Connors’s AEIC at paras 12 to 14 and Mr Koh’s AEIC at page 21 para 3.1.2.This Master Program was dated 11 August 2008 and was submitted by the defendant to the SO.221Foot Note 221×3JCB01422 – 3JCB01440.This Master Program was the basis of the timeline on which the defendant followed to complete the Project. Thus, I shall be making references to this Master Program when examining the experts’ evidence in relation to the various delaying events below. Overarching relationship between the parties 250 Second, on the various issues relating to delays, it is important to bear in mind the overarching relationship between the parties as it will have a material influence on the conduct of the parties. As mentioned at [3] above, the LOI is not the typical conventional construction contract. Under the GMP framework, the plaintiff and the defendant had a common interest in keeping the cost of the Project down. If the out-turn cost is lower than the GMP, the plaintiff only needs to pay the lower out-turn cost and 50% of the shared savings to the defendant. The defendant and the plaintiff would benefit from this as they have equal share of the shared savings. 251 There was an incentive for the parties to try their best to ensure that the out-turn cost of this Project was kept as low as possible. Hence, it is understandable that the plaintiff played an active role in this Project. For instance, the plaintiff was effectively involved in the procurement of trade contractors for the various aspects of the Project to keep the out-turn cost of the Project low. It is also pertinent to note that the plaintiff controlled the purse strings in this Project. The payment structure between the plaintiff and the defendant and the various trade contractors was on a reimbursement basis. The trade contractors would first invoice the defendant for work done and the defendant would then seek payment of the same from the plaintiff. 252 If this was a conventional construction contract, the plaintiff would not have to be so involved in the project as the sole responsibility of the project would fall on the shoulders of the management contractor. The plaintiff would pay a lump sum to the selected management contractor for the development of the project. In turn, the management contractor would then be fully responsible to select the various trade contractors and make progressive payments to them. Any cost saving by the management contractor will not be shared with the employer and if there is cost over-run, the management contractor will have to bear with the losses. Hence in a conventional construction contract, the management contractor will have complete autonomy in running the project vis-a-vis the employer. 253  The overarching relationship between the parties resulted in them working in close collaboration in this Project. This aspect of the parties’ relationship becomes very important when I consider the interventionist conduct of the plaintiff in determining the liabilities of the parties in the disputes concerning the delays. 254 I shall now deal first with the various issues relating to the delays. The termination of the RE without immediate replacement 255 Upon reviewing the evidence, I find that the termination of the RE by the plaintiff without a replacement had caused a six days’ delay to the piling works. 256 I shall first address the plaintiff’s argument on the defendant’s inconsistent pleadings. I find that the plaintiff’s argument is misconceived. It is reasonable for the defendant to plead that the piling works had stopped because the defendant understood that no piling works can continue without the RE and so the termination of the RE without an immediate replacement by the plaintiff caused a delay in the piling works. From the defendant’s pleading, this court is being asked to determine whether this was actually the case and to determine this issue requires me to look at what the experts have to say and assess the experts’ opinions against the evidence before me. Both parties’ experts gave substantial evidence on the issue and were questioned by this court and the parties’ counsel on their findings. Whatever perceived inconsistency in the defendant’s pleadings which the plaintiff is now relying on did not materialise into any prejudice to the plaintiff’s case. 257 I shall now consider whether a RE was required to be on site for piling works to continue. I find thatbothboring works and casting works are critical works in piling. The RE was required to ensure that both boring and casting works were carried out in compliance with the building requirements for the Project. In relation to the boring works, the plaintiff’s expert witness, PW4, agreed that the RE was required for the boring works to be of the correct depth (ie, the “toe level”) and of the correct soil parameters before casting works could commence.222Foot Note 222×Transcripts, 29 August 2018, p 33 lines 13 to 23 and p 61 line 15 to p 62 line 15.The defendant’s expert, DW4, had also illustrated at trial the reason why a RE was required to supervise the boring works.223Foot Note 223×Exhibit D1.In relation to the casting works, the parties did not dispute that a RE was required to be on site for the casting works. 258 Furthermore, boring and casting works are dependent on each other for the purpose of piling. Casting works cannot commence if the hole that is to be casted is not bored to the requisite specifications. Likewise, if the holes bored were not casted, the piling works trade contractor could not continue to bore many other holes. This is because if the holes that were already bored were not filled up in the casting works, the previously bored holes might collapse. Ultimately, a pile will be regarded as complete only when the pile has been casted.224Foot Note 224×Transcripts, 29 August 2018, p 35 line 22 to p 36 line 6. 259 Therefore, if the RE was on site, both the boring and casting works could have been done uninterrupted. According to both parties’ experts, if the RE was on site, it was possible for the piling works trade contractor in this Project to complete five piles per day – four contiguous bored piles and one foundational pile.225Foot Note 225×Transcripts, 29 August 2018 p 153 lines 6 to 16.It is clear that without the RE on site for any period of time, piling works would be delayed. 260 I shall now consider the evidence. First, I disagree with the plaintiff’s arguments that the records showed that piling works did not stop during the period when the RE was terminated because boring work was still being carried out during this period in the absence of a RE and no stop-work order was issued (see above at [88]).226Foot Note 226×Plaintiff’s Closing Submissions at paras 245–248 and 267–281.As I have earlier mentioned, both boring and casting works are inextricably linked to each other and both must be done in the presence of the RE. In fact, the records of the piling works trade contractors for the periodbeforethe termination of the RE show that when the RE was present on site, both boring and casting works were done on the same day.227Foot Note 227×Schedule 2 of the Closing Submissions of the Defendant (in original action).Therefore, the fact thatno casting workswere being done in the period between 26 and 31 December 2008 only shows that the piling works trade contractors were unable to complete any piles during this period and so piling works were inevitably delayed by the termination of the RE. This is despite the fact that no stop-work order was issued. 261 In the same vein, the plaintiff also argues that it should not be held liable for any delays to piling works from 29 December 2008 onwards because the replacement RE was appointed on that day as was evidenced from the fact that his salary was paid with effect from 29 December 2008.228Foot Note 228×Plaintiff’s Closing Submissions at para 250. See also 6JCB02847.On this, I find that it is not realistic for the replacement RE to commence work immediately and supervise the boring and casting works on the same day as his appointment. The RE would need time to get up on the design and specifications of the piling and structural design of the Project and the progress of the piling works thus far before commencing his duties. The only evidence to show that the replacement RE was on site to supervise boring and casting works was 2 January 2009 when casting works were done. Hence, I find that piling works were delayed for the period between 26 and 31 December 2008. 262  Moving now to the question of who was responsible for the appointment of the RE, I find that this responsibility fell on the plaintiff because there was an arrangement between the parties that the SO, which is JCPL, was responsible for the appointment of the RE on behalf of the plaintiff. This is evident from the fact that first, PW3 had testified that the RE, who was terminated on 23 December 2008, was provided by JCPL and the RE’s salary, which was paid by JCPL, was reimbursed by the plaintiff to JCPL.229Foot Note 229×Transcripts, 10 August 2018, p 67 lines 12 to 21.Second, it is not disputed that it was the plaintiff who terminated the RE on 23 December 2008 for corruption. Third, DW2 had written an email dated 26 December 2008 to the plaintiff and JCPL informing them that the termination of the RE without an immediate replacement would cause delays to the Project. This is evidence that the defendant was acting under this arrangement (ie, to respect the plaintiff’s prerogative to appoint and terminate the RE).230Foot Note 230×1DCB Tab 11.Finally, in appointing the replacement RE, JCPL’s letter to the plaintiff dated 16 January 2009 clearly showed that the plaintiff continued to be the party who was responsible for the appointment and remuneration of the RE. In this letter, JCPL informed the plaintiff that the employment of the site staff, including the RE, was madeon behalfof the plaintiff and JCPL would bill the plaintiff for the payment of their salary.231Foot Note 231×4JCB02196. 263  The plaintiff argues that the defendant must appoint a replacement RE or ought to have instructed Parsons to deploy its Supervision QP (Structure) to take over the role of RE in the interim. However, given the arrangement on the appointment of the RE above, I find that it is unreasonable for the plaintiff to expect the defendant to appoint a RE on its own accord without instructions from the plaintiff. Doing so would go against the arrangement between the parties in relation to the appointment of the RE and would infringe on the plaintiff’s prerogative to appoint and terminate the RE, which it had done. Furthermore, PW3 testified at trial that the RE was the plaintiff’s eyes and ears to make sure that the piling works were done properly.232Foot Note 232×Transcripts, 10 August 2018, p 90 lines 5 to 9.Hence, it would be reasonable for the defendant to notify the plaintiff of the delay the termination of the RE would cause but ultimately would defer to the plaintiff to appoint a replacement RE. 264 Turning now to the plaintiff’s argument that the proper party to appoint the RE was in fact the defendant, I reject this argument. Section 9(6)(a) of the Building Control Act provides that the Supervision QP (Structure) is responsible for the appointment of a RE. However, in this case there was an arrangement between the parties on the appointment of a RE as I have explained above. This arrangement is consistent with the Building Control Act if the RE that was appointed met the requirements under the Building Control Act and the Supervision QP (Structure) is able to confirm this. This was also the BCA’s position as stated in its publication titled “FAQ on Changes in Building Control 2007/2008” where the BCA clarified that “…there may be cases where the developer or builder may choose to help the QP in the procurement of the [RE]. This may be done in the form of a procurement contract between the developer or builder and the [RE].” Thus, the defendant is not liable for the delay in piling works for not taking steps to instruct Parsons’ Supervision QP (Structure) to appoint a replacement RE or to step into the role of the RE during the interim. It is likely that Parsons’ Supervision QP (Structure) deferred to the decision of the plaintiff in the appointment of the replacement RE provided that the replacement RE met the requirements under the Building Control Act. 265 Furthermore, nowhere is it stated in the Building Control Act that the onus is on the Supervision QP (Structure) to take mitigating steps to appoint a RE immediately upon the RE’s termination. In this case, the defendant decided to stop piling works and waited for a replacement RE. This is also consistent with the Building Control Act which requires that an appropriate qualified person must supervise piling works (s 7(c) of the Building Control Act). 266 Therefore, I do not accept the plaintiff’s contention that the defendant ought to be held liable for the delay caused by the termination of the RE because it failed to take mitigating measures by instructing Parsons’ Supervision QP (Structure) to take over. Instead, I find that the conduct of the plaintiff in this debacle quite irresponsible. Knowing the importance of a RE to the piling works, the plaintiff should have had a replacement RE ready and alerted the defendant and JCPL of its intention to terminate the RE before the termination of the RE. Having terminated the RE without taking the necessary consequential actions to prevent delay in the piling works, it is unreasonable and unfair to now blame the defendant for the delay in the piling works. 267 As for the plaintiff’s arguments that the defendant did not plead that PW3, the SO’s representative, was responsible to oversee the piling works until a replacement RE was appointed,233Foot Note 233×Plaintiff’s Closing Submissions at para 263.I place little weight on this argument because ultimately it was the plaintiff’s prerogative and responsibility, given the arrangement between the parties as I had explained above, to appoint the RE. 268 For the above reasons, I find that the plaintiff had committed an act of prevention in the termination of the RE on 23 December 2008 and had failed to provide an immediate replacement. Hence the plaintiff had caused a delay ofsix daysto the completion of the Project (ie, 26 to 31 December 2008). Delay in the award of the RC works 269 To determine the parties’ liabilities in the delay in the award of the RC works, I shall have to consider the following issues: (a) The impact of the directive by the plaintiff not to award any trade contract without the plaintiff’s approval and its impact on the award of the RC trade contract; (b) The impact of the introduction of Chang Hua in the tender process on 7 January 2009; (c) The impact of the plaintiff’s failure to approve the RC works tender recommendation by the defendant after it had considered Chang Hua’s tender and the subsequent late introduction of Shanghai Tien Rui into the RC works tender process; and (d) When the Project was ready to commence RC works. 270 I shall now discuss these issues in turn. (1)  The plaintiff’s directions 271 I shall first consider the chronology of events. The parties initially agreed to follow the procurement process at Appendix B of the minutes of the 11 June 2008 Project Meeting (“11 June 2008 Procurement Process”).234Foot Note 234×2JCB00647 – 2JCB00655.Under the 11 June 2008 Procurement Process, the defendant would have to submit a tender report and recommendation to the plaintiff after which the plaintiff would have two working days to provide its comments and express its concerns. If there were no comments or concerns from the plaintiff within two days, the defendant could proceed to award the tender. However, if there were comments and concerns from the plaintiff and the defendant agreed with those comments and concerns, both parties would have three working days to agree on the next choice of trade contractor to award the tender. 272 The 11 June 2008 procurement process was overwritten on 13 December 2008 when the plaintiff’s Mr David Loh sent an email to the defendant stating the following:235Foot Note 235×4JCB02090. Please be advised thatno trade contract is to be awarded without the approval of our Chairman, Mr LawrenceLeow. Kindly inform us formally when you intend to award any trade contract so that we can seek our Chairman’s approval. [emphasis added] 273 Subsequently, on 19 December 2008, Mr David Loh sent an email to the defendant and gave the following instructions:236Foot Note 236×4JCB02092. Please be advised on the following regarding trade packages tender interviews and award:- 1. JPW to look into the schedule of the Works to determine and inform us on the date of the award of the critical trade packages. 2.No further tender interviews for Big ticket package such as Structural, ACMV and Electrical Works without our concurrence or instruction. 3. To let us have the list of clarifications in advance prior to any scheduling interviews. 4.No award of any trade packages withoutCrescendas Bionix’s endorsement and approval. … All final negotiations will be attended by our VP, Mr Onn. The above instruction is from Mr Onn and should anyone in JPW disagree, then JPW can ask that person who instruct them or they can call Mr Onn to tell him directly. [emphasis added] 274 From the above two emails, it is crystal clear that the plaintiff had instructed the defendant not to award any more trade contracts without the plaintiff’s endorsement and approval. It must also be highlighted that the plaintiff required that its vice-president, PW2, to be present in the final negotiations of the trade contracts. 275 Pursuant to this instruction, DW2 wrote an email to inform the plaintiff that an interview for RC works trade contract would be held the following week and that a delay to the interview could cause delay to completion.237Foot Note 237×4JCB02094.PW2 responded in an email dated 22 December 2008 and stated that “[f]or the moment, it is unfortunately that I am on leave and would not be able to attend the structural package interviews,if it is insisted that it must be carry through, I would suggest that the response/ reply remains sealed until my return” [emphasis added].238Foot Note 238×4JCB02095.On this, PW2 testified that he merelysuggestedthat the tender response/reply remained sealed until his return and that the defendant was mistaken to take it as an instruction.239Foot Note 239×Transcripts, 10 August 2018 at p 20 lines 11 to 15 and p 21 lines 5 to 15.However, I do not accept this explanation because the purported suggestion was inconsistent with a subsequent email sent by the plaintiff on 29 December 2008 where the plaintiff reminded the defendant that it was PW2’s “instruction” that the replies from the tenderers remained sealed until his return.240Foot Note 240×1DCB Tab 13.This subsequent email was in reply to the defendant’s email earlier on the same day reminding the plaintiff that the tender opening for the RC works would be held on 30 December 2008.241Foot Note 241×1DCB Tab 13.Hence the plaintiff’s response made it very clear that PW2’s email for the defendant to hold off the tender opening till his return was in actual fact an instruction rather than a meresuggestion 276 Naturally, the defendant did not open the tender reply and responses of the tenderers for RC works until 7 January 2009.242Foot Note 242×Mr Onn’s AEIC at para 32.At around this time, the plaintiff introduced Chang Hua as a tenderer for RC works. I shall explain the effect of this late introduction later at [291]. Suffice to say that as a result, the defendant took additional time to go through the whole tender process to consider Chang Hua’s tender submissions. 277  At a meeting between the parties on 14 January 2009, the parties discussed,inter alia, the delay that the defendant alleged was caused by the plaintiff’s instructions in December 2008 not to award the trade contracts without its approval.243Foot Note 243×6JCB02854.I reproduce the relevant paragraphs of the minutes: 2.19 [DW2] claimed that [the plaintiff’s] instruction not to award the trade contracts until [PW1’s] approval caused delay. [DW2] also question why [the plaintiff] introduce new contractors for RC. [DW2] says that as management contractor, [the defendant] has a free hand on awarding contracts. Some trade contracts like RC need to be awarded soon. 2.20 [PW1] disagreed that [the plaintiff] is interfering. [The plaintiff] has never stopped [the defendant] from proceeding with the tender exercises. [PW1] questioned how his request to check the trade contracts before award has delayed the project. [PW1] said it is for [the defendant] to decide if it wants to admit new contractors. But it must make sure [the plaintiff’s] interest on price are protected. … 278 The plaintiff relied on the above explanations by PW1 during the meeting on 14 January 2009 to show that the instructions given by the plaintiff in December 2008 for the defendant not to award any trade contracts without its approval no longer applied.244Foot Note 244×Closing Submissions of the Defendant (in original action) at paras 366 – 398.I am unable to accept this argument and I shall explain my reasons below. 279 In a letter dated 5 February 2009, the defendant issued the final recommendation and tender report of the RC works for the plaintiff’s approval. In the same letter, the defendant informed the plaintiff that “to avoid any further delay on awarding this trade contract, [the defendant] would [appreciate] if [the plaintiff] can confirm [the defendant’s] recommendation by Monday, 9th February 2009”.245Foot Note 245×6JCB02849. 280 On 6 February 2009, the plaintiff replied to the defendant that it had concerns about some of the defendant’s staff and the plaintiff became very cautious about approving tender awards on the recommendation of the defendant (“6 February Letter”). Furthermore, the plaintiff informed the defendant the following:246Foot Note 246×6JCB02851. As the management contractor, it is ultimately your responsibility to make the decision on the award of the RC trade contract and for that matter all other contracts for this project. While that is the case, [the plaintiff] must surely be entitled to comment on such contracts if we have a valid reason to or if we have concerns. It is then for you to decide whether or not to take on board our views.However, we shall in no way be held responsible for any delay, failure or refusal to comment or agree with any of your recommendations for whatever reasons.We reckon that it is a good practice to keep us informed of the project costing on a timely basis for purposes of cashflow budgeting.Ultimately however, this should not be confused with the award process. You should make your own decision to proceed with the award of any trade contracts that you have assessed to be the best so as not to affect the progress of the project. We will look to you to ensure that our interests are not prejudiced. [emphasis added] 281 The plaintiff relied on the 6 February Letter to show that the plaintiff had made it clear to the defendant to disregard its instructions in December 2008 and to proceed to award trade contracts without the plaintiff’s approval if it deems fit.247Foot Note 247×6JCB02850 – 6JCB02856.Again, I am unable to agree with this position and I shall explain it below after examining the chronology of events. 282 Subsequently, on 25 February 2009, the SO for the Project, JCPL, drafted a new procurement flowchart which reflected the parties’ position.248Foot Note 248×6JCB02858.I reproduce the new procurement flowchart:  283 The plaintiff argues that this flowchart indicated that the plaintiff’s approval was not necessary for the tender award because unlike step 15 and step 16 in the above flowchart, which indicated that the SO would return the tender recommendation back to the defendant if it had comments on the tender recommendation for the defendant to address, there is no similar loop from step 17 to step 18. This shows that if the plaintiff did not approve the tender recommendation, the defendant could proceed straight to step 18.249Foot Note 249×Transcripts, 7 August 2018 p 38 line 12 to p 39 line 15. 284 On the face of the procurement flowchart above, I am unable to agree with the plaintiff. It is common sense and logical that without step 17, the defendant could not proceed to step 18 in the procurement flowchart. Thus if the plaintiff did not approve the Tender Recommendation Report in step 17, the procurement process would be stalled and the defendant could not proceed to the award stage in step 18. This is further reinforced by the fact that in step 15 to step 16, if the SO had some comments on the Tender Recommendation Report, the reverse arrow to step 15 showed that the defendant must first rectify it before referring back to the SO. If the SO approved it, the defendant could proceed to step 17. 285 Similarly, in the previous procurement flowchart under the Draft WT Contract, if the SO did not approve the Tender Recommendation Report by the defendant, the procurement flow reversed back to the defendant to prepare another Tender Recommendation Report to submit to the SO.250Foot Note 250×3JCB01257.The previous procurement flowchart is reproduced below:  286 It is important to note that the flowchart in the Draft WT Contract indicated that the plaintiff was not the approving authority. In this flowchart, the SO merely informs the plaintiff after she approves the tender award. The 25 February 2009 flowchart issued by the SO which the plaintiff did not disagree with is materially different as regards the approving authority. This flowchart is consistent with the plaintiff’s direction to the defendant in December and it was issued after the 6 February Letter of the plaintiff, which purported to override the plaintiff’s December 2008 instructions. Hence, I find that the procurement flowchart prepared by the SO in the letter dated 25 February 2009 is evidence that the plaintiff had not revoked its instructions to the defendant in December 2008 where the defendant was instructed not to award trade contracts without the plaintiff’s approval. 287 Turning now to the 14 January 2009 meeting and the 6 February Letter by the plaintiff, these events have to be considered in the light of the overarching relationship between the parties. It is pertinent to reiterate that this is not a conventional contract. The LOI is a GMP concept and required parties to collaborate in order to enjoy the shared savings. Hence, it is in the best interest of the plaintiff to play an active role in the award of the trade contracts as the selection of the trade contractor would have an important impact on the cost of the Project. It is also important to emphasise that the plaintiff was the paymaster of the defendant, JCPL, and the trade contractors in this relationship. In fact, the plaintiff held the purse strings of the Project. Although the defendant was responsible to pay the trade contractors, the plaintiff would reimburse the defendant for this payment (see above at [251]). 288 This overarching relationship was further made obvious when PW1 testified that the plaintiff could decide not to reimburse the defendant for the works done by the trade contractors if the plaintiff had issues with their works or claims: Q:Would Crescendas pay the contract price of any trade packages awarded without its approval? A: Most probably, yes. Q: But you would have the right not to do so, right? A: If I can find something not right, I can actually go to the management contractor and say “Look, this is something we’ll not pay. Maybe this part we will not pay”, you know but generally, it should not be affecting -- it should not affect payment if merely I disagree with the recommendation. … Q:You see, just a few answers ago, you yourself said that where you had not approved the trade package, then: “If I can find something not right, I can actually go to the management contractor and say, look, there’s something we will not pay.” A:If there’s some, say, improper behaviour which we were very concerned about at that point in time, obviously wewould be entitled to not paying themif we are able to prove it. … Obviously we are entitled to do. … [emphasis added] 289 Finally, it is pertinent to also note that as at 26 December 2008 (about the time when the plaintiff issued its instruction to the defendant), the plaintiff had an outstanding payment owed to the defendant and the piling works trade contractors for works done in the amount of $9,262,561.56.251Foot Note 251×1DCB Tab 12.By February 2009, this debt owed to the defendant for work done ballooned to $11,074,067.69.252Foot Note 252×1DCB Tab 17.Thus, given the relationship between the parties, the important fact that the plaintiff was the paymaster, and the further fact that the plaintiff had failed to make substantial payments to the defendant and the piling works trade contractor for work done, it is entirely reasonable and expected that the defendant would not proceed to award the trade contracts without the plaintiff’s approval. The defendant was concerned that the plaintiff would refuse payment if it had awarded trade contracts without the plaintiff’s approval. Therefore, despite the plaintiff’s articulation at the meeting on 14 January 2009 and its 6 February Letter informing the defendant to proceed with the award of the trade contractors, these communications would not have convinced the defendant to do so without the plaintiff’s approval. 290 Therefore, on the balance of probabilities, it is clear that the plaintiff had specifically instructed the defendant not to award trade contracts without its approval and this instruction was not revoked by the plaintiff. (2)  The plaintiff’s introduction of Chang Hua and the plaintiff’s subsequent delay in approving the 5 February 2009 tender recommendation and report 291 On 7 January 2009, the plaintiff introduced Chang Hua as a tenderer for the RC works. This was done at the last stage of the tender process. The plaintiff argues that by virtue of the 14 January 2009 meeting and the 6 February Letter, the defendant had the option of not even considering Chang Hua.253Foot Note 253×Plaintiff’s Closing Submissions at para 376.As explained above, the defendant was beholden to the plaintiff and it would be to the defendant’s peril to ignore the late submission of the plaintiff’s suggestion of Chang Hua. Thus, it is entirely understandable and prudent for the defendant to seriously consider the plaintiff’s proposed candidate for the RC works despite the very late submission. 292 Consequently, the defendant had to re-run the tender and evaluation process to determine if Chang Hua’s submissions could make the cut. This would inevitably take more time. As explained by DW3 in his testimony: A: I think it’s both in the sense, one,it’s not the norm to get another tenderer to come in at the last minute, and it’s also not fair for the other three or four [other tenderers], depending on how many we selected for the interview.Thirdly, by introducing another tenderer in,we have to go through the whole process of qualifying the tenderer and also giving him all the necessary information, also have to do a technical questionnaire with him so that he -- so that the tendererare on the same level as the other-- so all this will take time and again it will delay the whole process again. … A:Like I say again, there is this process of timeframe, I think just now you went through the appendix B. Which means that when we call for tenders, those who are qualified will be called in to submit their interest. There’s a process where once they have shown their interest, we will given the drawings and specs, whatever, the process.So but what you’re saying right now is that after having earlier when we have maybe done five or six tender interviews and we have narrowed down to the most appropriate contractor, which is two of them, and we have done a recommendation, and then before that--  and that’s last stage then you introduce another tenderer in, I don’t think it’s right because then it would defeat the whole tender exercise, we have to go through the whole process so the due diligence is done.We cannot just accept the price --  like what I can see, the price there is lower but does mean it’s correct. So our team, the contract manager and the QS doing their due diligence, they have to go through the whole process. … What you saw now is actually the last -- last stage where we are at the process of appointing the contractor, and then that is where Chang Hua comes in. So I don’t think it’s fair and it’s right. [emphasis added] 293 It is also pertinent to note that PW1 admitted that the insertion of a tenderer at the point of a tender opening, which is late in the tender process, would result in having to review the whole submission afresh, as the previous tender questionnaire would have to be given to the new tenderer, Chang Hua.254Foot Note 254×Transcripts, 7 August 2018, p 29 line 25 to p 30 line 7.This is to ensure fairness to all tenderers. 294 Therefore, I find that it is reasonable and justified for the defendant to spend about a month to consider Chang Hua’s tender and prepare a tender report and recommendation. This was prepared and submitted to the plaintiff on 5 February 2009 (see above at [279]). (3)  The plaintiff’s failure to approve the defendant’s RC tender recommendation dated 5 February 2009 and subsequent introduction of Shanghai Tien Rui 295 When the defendant issued its recommendation on 5 February 2009 to the plaintiff for approval, the plaintiff sat on it. Again I reiterate that in the light of my findings at [287]–[290] above, the defendant was left with no choice but to wait for the plaintiff’s approval or risk non-payment from the plaintiff for the work done by the trade contractor it awarded without the plaintiff’s approval. It is notable that the plaintiff did not give its approval despite reminders by the defendant that there would be cost and time implications arising from the plaintiff’s delay in approving the tender recommendation. The plaintiff, upon receipt of the defendant’s reminders, did not inform the defendant that its approval was not necessary and that the defendant could proceed with the award as it deemed fit. As a result of the plaintiff’s delay in approving the tenderer for the RC works, the defendant had to seek numerous extensions of the validity of the tender submissions for the RC works from the tenderers.255Foot Note 255×6JCB02906 – 6JCB2910. 296 Despite the reminders from the defendant, PW1 admitted during cross-examination, that he had no reason to withhold the plaintiff’s approval: Q: We’ve just seen the recommendation of MA Builders in February 2009 and we’ve seen that Crescendas didn’t approve it. You had no objection on technical grounds to MA Builders, did you? A: No. Q: And by this time, so not the original submissions by Chang Hua and so forth, by this time MA Builders had the lowest price right? A: I think, yeah, I believe so but price is one factor, but I think [Parsons’] recommendation is actually the deciding factors. Q: Well, absolutely. There’s no reason not to award to MA Builders. Technical is the recommendation from Parsons Brinkerhoff and they’re the lowest price. … Q: Were you upset that JPW was recommending MA Builders? A: No. Q: Were you upset by their letter of recommendation? A: No. 297 In the light of the delays, the plaintiff asked the defendant whether the short-listed tenderers for the RC works could re-submit their tenders so that they could complete RC works in a shorter time-frame. The defendant complied with the plaintiff’s request and the tenderers re-submitted their revised tender bids based on a shorter project duration on 24 April 2009.256Foot Note 256×Mr Leow’s AEIC at paras 194 – 196. 298 At this point, instead of approving the tender recommendation made by the defendant on 5 February 2009 or allowing the defendant to carry through the tender opening on 24 April 2009, the plaintiff introduced Shanghai Tien Rui’s tender submissions at the tender opening for the defendant to consider.257Foot Note 257×Mr Leow’s AEIC at para 196. 299 Given the nature of the relationship between the parties as explained above at [287]–[290], the defendant went through the entire tender process again to consider Shanghai Tien Rui’s tender submissions. In the final analysis, the plaintiff’s introduction of Shanghai Tien Rui came to naught. The defendant rejected Shanghai Tien Rui’s bid and returned their unopened tender submission because upon conducting due diligence check on Shanghai Tien Rui, the defendant found grave concerns regarding its corporate governance and its technical competencies.258Foot Note 258×6JCB03049, 7JCB03472, 7JCB03491, 7JCB03513 and 7JCB03517. 300 After considering Shanghai Tien Rui’s bid and the revised tender submissions from the other tenderers, the defendant issued its tender recommendation on 1 June 2009 and the plaintiff accepted this recommendation.259Foot Note 259×7JCB03796. 301 With regard to the introduction of Shanghai Tien Rui, the plaintiff contended that this resulted in savings of two months for the completion of RC works. Under the tender recommendation of 5 February 2009, the shortlisted tenderers submitted that they could complete the RC works within 10 months but after the introduction of Shanghai Tien Rui, in the final tender recommendation on 1 June 2009, the tenderers indicated that they could complete the RC works within 8 months as requested by the defendant who acted on the plaintiff’s direction.260Foot Note 260×Mr Leow’s AEIC at para 197. 302 In determining whether there was actual delay caused by the plaintiff’s actions, I must consider the actual impact of the plaintiff’s actions on the progress of the Project. What is undisputed is that in the final outcome, the RC works took 12 months to complete and the plaintiff’s purported two months’ savings did not materialise. Therefore, I do not accept that the plaintiff’s introduction of Shanghai Tien Rui resulted in a saving of two months. 303 In summary, I find that the plaintiff’s delaying actions in the award of the RC works trade contract can be distilled as follows: (a) Instructions given to defendant not to award trade contracts without its approval; (b) Instructions not to open the tender submissions until PW2’s return; (c) Introduction of Chang Hua on 7 January 2009 resulting in the defendant going through the whole tender process to evaluate Chang Hua’s bid and to ensure the tender process is fair; (d) Late approval of the defendant’s tender report and recommendation dated 5 February 2009; and (e) Introduction of Shanghai Tien Rui on 24 April 2009 resulting in the defendant going through the whole tender process again to evaluate Shanghai Tien Rui’s bid and to ensure the tender process is fair. 304 However, to determine whether the plaintiff should be held liable for the entire duration of the delay to the RC works caused by the above delaying actions, I must also determine when the Project site was ready for the RC works trade contractors to commence work. To recapitulate, the defendant submits that the plaintiff is responsible for the delay from 2 January 2009 to 1 June 2009. This is on the premise that if the defendant opened the tender submissions on 30 December 2008 as it intended to, instead of waiting for PW2’s return from his leave (see above [273]–[276]), the defendant could have prepared the tender report and recommendation for the plaintiff’s approval by 2 January 2009.261Foot Note 261×Mr Koh’s AEIC at p 420. 305 The plaintiff, on the other hand, contends that the RC works trade contract could only commence on 1 March 2009 because the Project site was only ready to receive the RC works trade contractors on that date. 306 I wish to point out that PW4, the plaintiff’s expert, acknowledged the plaintiff was responsible for the delay caused from 1 March 2009 (when the site was ready for RC works to commence) to 1 June 2009 (the date the plaintiff granted its approval for the RC works).262Foot Note 262×Transcripts 30 August 2018, p 123 line 20 to p 124 line 3.However, he said that this delay was not attributable to the plaintiff as the defendant ought to ignore the plaintiff’s instructions given in December 2008 and should have awarded the RC works trade contract in February 2009. I cannot agree with PW4’s assertion that the plaintiff did not cause the delay because, as I have explained above, the defendant had to await the approval from the plaintiff (see [287]–[290] above). 307 With the above in mind, I shall now discuss my findings on when the Project site was ready for the RC works to commence. (4)  When was the Project ready to commence RC works 308 Turning to the first issue of when the RC works trade contract could have been awarded, the defendant argues that the defendant could have prepared the tender report and recommendation on 2 January 2009 and the plaintiff would be able to grant its approval on the same day but for the plaintiff’s instructionsnotto open the tender submissions till PW2’s return from his leave.263Foot Note 263×Closing Submissions of the Defendant at paras 448 –452.This timeline is entirely plausible given the fact that the revised tender submissions that were to be opened on 30 December 2008 were from the lowest two tenderers and they had replied to the tender questionnaire.264Foot Note 264×4JCB02112 – 4JCB02119.On the procurement flowcharts that I had reproduced above, the opening of the tender submissions by the lowest two tenderers following the tender questionnaire was at the tail-end of the procurement cycle (at step 13 for both versions of the flowchart at [282] and [285] above). Thus, barring any need for further clarification interviews, the defendant would be in a position to prepare the tender report for the plaintiff’s approval upon opening the tender submission on 30 December 2008. Given the weekend and New Year’s holiday to work on, the defendant would be able to prepare and submit the tender report and recommendation for the plaintiff’s approval on 2 January 2009. Under the Master Program, the time allocated for the “Appointment of Structure Works Sub Contractor” is two calendar days.265Foot Note 265×3JCB01431.I notice that in this case, the plaintiff had approved the RC works trade contract on the same day the defendant submitted its recommendation on 1 June 2009. This might be because the plaintiff was heavily involved in the tender process leading up to the tender report and recommendation issued by the defendant on 1 June 2009. However, if such interventions were not to occur, I believe it is only fair that the plaintiff be given the full two days to consider the tender report and recommendation before granting its approval. Thus, the RC works trade contract could only have been awarded on 4 January 2009 but for the plaintiff’s delaying actions. On a side note, I also notice that the 11 June Procurement Process allocated twoworkingdays for the plaintiff to approve the tender report and recommendation. However, the 11 June Procurement Process waspriorto the signed LOI on 30 June 2008 while the Master Program was formulated after the signed LOI. As the parties and the SO relied on the Master Program throughout the Project, it is only proper that I rely on the Master Program to assess the timeline in this case. 309 I shall now consider when the Project site was ready for RC works to commence. For RC works to commence, there were a number of site preparations that had to be done and this is not disputed. The main preparatory works were as follows: (a) First, the Project site must be de-watered. In other words, the site should not be so waterlogged that it would prevent heavy vehicles/machineries from accessing the site; (b) Second, hard core had to be laid down on the Project site. This was to lay metal sheets on the ground at the relevant parts of the Project site to enable the machineries involved in the RC works to enter and safely deploy in the Project site to commence work; and (c) Third, sufficient length of the contiguous bored pile wall had to be hacked to enable the RC works trade contractors to start work on the capping beam. This would involve the piling works trade contractor excavating a sufficient length of the completed contiguous bored pile wall and then hacking these exposed piles up to the requisite cut-off levels according to the Project’s design, thus exposing the metal rebars necessary for the RC works trade contractors to commence constructing the capping beam.266Foot Note 266×Plaintiff’s Closing Submissions at para 337 and Closing Submissions of the Defendant (in original action) at paras 432 – 445. 310 It is the plaintiff’s position that the Project site was only ready for the commencement of RC works on 1 March 2009.267Foot Note 267×Plaintiff’s Closing Submissions at para 336.This is based on PW4’s analysis.268Foot Note 268×PW4’s Presentation Slides at Tab 2. See also Transcripts, 30 August 2018 at p 50 onwards.According to PW4, the contiguous bored pile wall consisting of both contiguous bored piles and grout piles were completed on 21 January 2009. It then took the piling works trade contractor until 24 February 2009 to complete the hacking of the contiguous bored pile walls such that the metal rebars would be exposed and ready for the casting of the capping beam. It then took a further week till 1 March 2009 for the defendant to de-water the Project site and to lay down the hard core for the deployment of the RC works trade contractor’s machineries.269Foot Note 269×PW4’s Presentation Slides at Tab 2. See also Transcripts, 30 August 2018 at p 50 onwards. 311 On the contrary, the defendant argues that the pace of the piling works throughout the period of 30 December 2008 till the award of the RC works trade contract was based on the conduct of the plaintiff.270Foot Note 270×Closing Submissions of the Defendant (in original action) at paras 419 – 429.According to DW4, if the plaintiff’s delaying actions had not occurred, the piling works trade contractors and the defendant would have prepared the Project site to be ready to receive the RC works trade contractors in December 2008.271Foot Note 271×Transcripts, 30 August 2018, p 90 line 4 to p 91 line 12.DW4 testified as follows: A: It’s an oversimplification of the site situation. As I have explained in my report, when the defendant is ready to award the RC trade contract, say by end of December 2008, that should not be prevented from awarding.The reason, from a construction point, not from a legal interpretation, it doesn’t make sense for the defendant to hold back the works when they have the opportunity to progress. So if we are looking at the December progress report, if I were to put myself in the defendant’s shoes at that point in time, I would have expedited the work, including the excavations for the level 1 slab, including the hacking of the contiguous bored pile, and all the works that are ready, need to be prepared for the RC trade contractor to commence their work.So that will be the natural and obvious reasons for a main contractor, in this case the defendant, to carry out such work and to continue it. When we look at the site condition in February or January, it’s all in hindsight. What should the main contractor do when they are ready to award the RC trade contract? The award should go ahead, then let the site prepare for the conditions to receive the RC trade contract to commence their work.Bear in mind that the RC trade contract needs to be around to prepare shop drawings, bar bending schedule, to do the setting out plan, to submit method statements. All these require time. Even though there is no physical work on site, such preparatory work needs to be carried out before that. [emphasis added] 312 DW3 also testified that the defendant was pacing its works because of the plaintiff’s act of prolongation.272Foot Note 272×Closing Submissions of the Defendant (in original action) at para 426. 313 On the evidence, I find that the defendant and the piling works trade contractors were in fact pacing their works by reference to the plaintiff’s delaying actions and that based on the progress reports, the defendant and the piling works trade contractors were capable and ready to ensure that the Project site was ready to receive the RC works trade contractors if the RC works trade contract had been awarded by the plaintiff on or about 4 January 2009. 314 First, the notion of pacing is consistent with the principle that a contractor is entitled to plan and perform the work as he pleases, provided that he completes the project by the time fixed in the contract. This court inLian Soon Construction Pte Ltdv Guan Qian Realty Pte Ltd[1999] 3 SLR(R) 518 (“Lian Soon”) accepted this position. At [31] ofLian Soon, Warren Khoo J, when discussing extension of time, stated the following: … the basic position at law [is] that the contractor is entitled to have the time initially allowed him by the contract to complete the works initially comprised in the contract, and any “float time” which he has within that over-all time is his for him to use... 315 In the English case ofGreater London Council v Cleveland Bridge and Engineering Co(1986) 34 BLR 50, the English Court was asked to decide whether the respondent in that case was under an obligation to perform a contract to manufacture, deliver and erect gates and gate arms of the Thames Barrier with due diligence and expedition. In discussing this issue, the English Court made some germane findings. Staughton J, sitting in the Queen’s Bench Division when this case was heard at first instance ruled: There is, moreover, a general principle applicable to building and engineering contracts, that in the absence of any indication to the contrary,a contractor is entitled to plan and perform the works as he pleases, provided always that he finishes it by the time fixed in the contract. That is exemplified by the case ofWellsv Army and Navy Co-operative Society(1902),Hudson’s Building Contracts, 4th edition, 346, where Wright J said at p. 352: “the plaintiffs must, within reasonable limits, be allowed to decide for themselves at what time they are to be supplied with details. The plaintiffs were entitled to do the work in what order they pleased.” See also Vaughan Williams LJ at p 354: “… in the contract one finds the time limited within which the builder is to do this work.That means not only that he is to do it within that time, but it means also that he is to have that time within which to do it… And on the same page: “In my judgment, where you have a time clause and a penalty clause, it is always implied in such clauses that the penalties are only to apply if the builder has, as far as the building owner is concerned and his conduct is concerned, that time accorded to him for the execution of the works which the contract contemplates he should have. [emphasis added] 316 Therefore, where the contractor’s progress of work is dependent on the employer doing certain acts, the contractor is entitled to pace its work by reference to the employer’s actions. In the event the employer delays his actions, the contractor may pace its works accordingly, depending on the contractor’s overall schedule and progress of work. 317 In this case, it is the prerogative of the piling works trade contractor and the defendant to do their work in whatever order they please and pace their works by reference to the plaintiff’s conduct of when it would award the RC works trade contract. It is expected that the piling works trade contractor and the defendant would need to do some works to prepare the site for the RC works trade contractor’s deployment. One of the critical preparatory work was the hacking of the contiguous bored piles to expose the rebars for the purpose of the RC works trade contractor to carry out the work of constructing the capping beam. The rebars, however, should not be exposed for too long in order to avoid rust and corrosion. When that happens, additional work has to be done to treat the rust and corrosion. This will entail additional work which can be avoided if there is co-ordination and timing to ensure that hacking is not done too early. The issue of rust and corrosion of the debars, if exposed to the element for too long, was raised by DW3 and PW4.273Foot Note 273×Transcripts, 30 August 2018, p 136 lines 10 to 22 (PW4) and Transcripts, 21 August 2018, p 76 line 15 to p 77 line 7 (DW3), 318 The circumstantial evidence indicates that the defendant had practised pacing. As I had discussed, on 13 December 2008, the plaintiff issued its instruction not to award any trade contracts without its approval and subsequently, this became relevant to the award of the RC works trade contract when the plaintiff instructed the defendant on 29 December 2008 to wait for PW2’s return from leave before opening the tender submissions as discussed above. It is clear from the defendant’s perspective that the RC works trade contract tender submissions from the two lowest bidders would not have been opened on the scheduled date of 30 December 2008 and that it became uncertain when the RC works trade contract would be awarded. As can be seen in the chronology I had laid down in detail above at [271]–[290], the plaintiff’s conduct from January 2009 till the introduction of Shanghai Tien Rui indicated to the defendant that the RC works trade contract would not be awarded anytime soon. 319 Therefore, I accept DW3’s evidence that the defendant had paced its work. DW3, the project manager on site, gave evidence that the hacking was in fact paced by reference to the delay in the award of the RC works trade contract by the plaintiff274Foot Note 274×Transcripts, 20 August 2018, p 21 lines 6 – 19.: Q: So this is the issue I have, Mr Teo. You have your piling contractor hacking five metres of the CBP a day, but your RC contractor is expecting to construct about 14.28 metres of capping beam a day. There is a mismatch right? A: Yes. Q: So you’d agree there has to be a lead time by which your piling contractor is to start hacking first, correct? A: Yes, but I cannot say why it is - - there is a slow lead of the hacking and - - can I clarify on this?My thinking, at that time, it may be because we have no confirmation on the RC work, the rate may be slowerdown. [emphasis added] 320 I note that the hacking of the contiguous bored piles started on 22 January 2009 and was completed on 24 February 2009.275Foot Note 275×Plaintiff’s Experts Presentation Slides Tab 2 p 2.This is a total of 34 days and according to DW3’s evidence above, this rate of hacking was due to pacing. I accept that the hacking of the contiguous bored pile wall would have taken a shorter period of time if the piling works trade contractor had not paced its work. 321 I also note that in December 2008, the progress of the piling works indicated that the Project site was in a position to receive the RC works trade contractor if it was awarded on 4 January 2009. The Monthly Progress Report 05 for December 2008 indicated that as of 30 December 2008, 97.92% of the contiguous bored piles had been completed or 330 contiguous bored piles had been completed and 45.40% of the grout piles had been completed or 153 grout piles had been completed.276Foot Note 276×4JCB02142 – 4JCB02189.According to DW3, the hacking work could commence much earlier than that (ie, earlier in December 2008) and would have reached a sufficient length for RC works to commence.277Foot Note 277×Transcripts, 17 August 2018, p 111 line 20 to p 112 line 23.It was, therefore, plausible for the piling works trade contractor to hack a sufficient length of the contiguous bored pile walls from 30 December 2008 to 6 January 2009 (if the RC works trade contract had been awarded on 4 January 2009). 322 A further evidence of pacing can be seen from the photograph of the site on 24 February 2009 which is reproduced below:278Foot Note 278×6JCB02890.  323 On 24 February 2009, the piling works trade contractor had completed hacking of the contiguous bored pile wall (see above at [320]). However, it is clear from the site photograph above that the Project site was still waterlogged and only some hard core had been laid down. DW3 and PW4 testified that it would take at most four days for the laying down of the hard core279Foot Note 279×Transcripts, 21 August 2018, p 79 lines 1 to 6 and Transcripts, 30 August 2018, p 65 lines 18 to 25.and that de-watering would take a day or two according to DW4280Foot Note 280×Transcripts, 30 August 2018, p 148 lines 23 to 25.(about one week in total). I find that the reason why the site was still waterlogged and that only some hard core had been laid down was because the defendant was waiting for the plaintiff to award the RC works trade contract which was pending the plaintiff’s approval. There is simply no urgency for the defendant to do these preparatory works when the plaintiff had not given its approval to the RC works tender report and recommendation which was submitted on 5 February 2009. Furthermore, given that it would take six days for the RC works trade contractor to commence work after the award of the trade contract,281Foot Note 281×Transcripts, 30 August 2018, p 91 lines 13 to 15.the defendant was confident to de-water the site and lay down the hard core in time for the RC works trade contractor to enter and commence work on site. Moreover, the hacking of the contiguous bored piles and preparation of the site for the RC works trade contractor could be done concurrently. 324 Therefore, I do not accept the plaintiff’s contention that the site was only ready to receive the RC works trade contractor on 1 March 2009. The reason why hacking of the contiguous bored pile walls, the laying down of the hard core and the de-watering of the Project site were not done near 30 December 2008 or at least prior to the stipulated award date of the RC works trade contract on 2 January 2009, was because the defendant and the piling works trade contractor were pacing their work in anticipation of the delay in the award of the RC works trade contract by the plaintiff. 325 PW4 did not take into account pacing in his computation. According to PW4’s analysis, he found that RC works could only commence after all the contiguous bored piles and the grout piles had actually in fact been completed and after the necessary works had been done to de-water the site, laid down the hard core and the site had been prepared for the RC trade contractors to move in.282Foot Note 282×PW4’s Presentation Slides at Tab 2. See also Transcripts, 30 August 2018 at p 50 onwards.His calculation was based on sequential events when it is clear that these activities could be carried out concurrently. Furthermore, it is not necessary for the piling works to be fully completed (ie, that all the contiguous bored piles were completed) before RC works can commence. The RC works could commence on site as long as a sufficient stretch of the contiguous bored piles wall had been completed and hacked. In fact, PW4 conceded this point and testified that RC works could commence even before all the contiguous bored piles and grout piles had been completed.283Foot Note 283×Transcripts, 30 August 2018, p 57 line 18 to p 59 line 13. 326 Therefore, I find that the Project site would have been ready for the RC works trade contractor to start work if the RC works trade contract was awarded on 4 January 2009. In this case the RC works only commenced so much later on 8 June 2009 after the plaintiff approved the RC works tender recommendation on 1 June 2009. This was due to the plaintiff’s own delaying actions. (5)  Summary 327 For the above reasons, I find that the plaintiff, by committing the delaying actions at [303] above, had committed acts of prevention which caused the delay in the award and subsequent commencement of the RC works for the period of 4 January 2009 to 1 June 2009. This is a total of147 daysof delay. Delay in the award of the A&G works 328 Here, the plaintiff first argues that the defendant should not wait for the plaintiff’s approval before awarding the A&G works trade contract (see above at [95]). I repeat my findings at [290] above. I find that given the relationship between the parties, the defendant had to wait for the plaintiff to approve the award of A&G works trade contract recommended by the defendant. As I had explained earlier, it is justifiable for the defendant to wait for the plaintiff’s approval before awarding the A&G works trade contract. 329 However, on the evidence, I am of the view that the plaintiff’s delay in granting the approval of the A&G works trade contract had not causedactualdelay to the progress of the Project. I shall now explain. 330 By way of background, A&G works comprise  two essential stages and this is not disputed by the parties’ experts: (i) the design, mock-up and drawing approval stage; and (ii) the production lead time which is when the A&G works trade contractor would proceed to manufacture and fabricate all the cast-in items that were approved in the first stage.284Foot Note 284×Transcripts, 6 September 2018, p 14 line 6 to p 15 line 2.77 days were allocated under the Master Program for the first stage and 56 days was allocated for the production lead time – a total of 133 days.285Foot Note 285×Defendant’s Expert’s Presentation Slide at Appendix 6. Mr Connors’s AEIC at p 28. 331  The A&G works trade contractor would have to coordinate and work with the RC works trade contractor so that the design and casting of the columns and slabs of the floors were suitable for the installations of the A&G cast-in items.286Foot Note 286×Exhibit E1 at S/N 3.1.In particular, it is necessary for the A&G works trade contractor to coordinate with the RC works trade contractor in the design and construction of the Level 2 beam and slab of the Project at the casting stage but not necessary for the design and construction of the lower levels. This is because the cast-in items of the A&G works would only be installed from Level 2 onwards. Without this collaboration, the RC works trade contractor would not be able to start designing and constructing the Level 2 beam and slab and so delaying the entire Project. 332 In that light, it is an agreed fact that delay in the award of the A&G works trade contract becomes critical and effective when the RC works trade contractors’ work had reached Level 2 slab and beam. At this stage, the RC works trade contractor would need to work with the A&G works trade contractor in the design and construction of the Level 2 slab. If the RC works trade contractor was not ready at this stage to work with the A&G works trade contractor, there would be a subsequent delay in the design and construction of the Level 2 slab and beam onwards and so, would delay the entire Project. 333 Second, as explained above, when the A&G works trade contractor was appointed on 17 November 2009, it was projected (according to the Master Program) that they would have to obtain the approval for their design within 77 days. This would mean that the RC works trade contractors would receive the approved design for the cast-in items for the construction of the Level 2 slab and beam 77 days after the award of the A&G works trade contract which is on 2 February 2010 (including weekends). If one were to take into account the production lead time of 56 days for the A&G works trade contractor to fabricate the cast-in items to install in the Level 2 slab and beam, the construction of the Level 2 slab and beam could only commence sometime after 30 March 2010 onwards. 334 However, from the evidence of both parties’ experts, the A&G works trade contractor was able to have its design approved and have its cast-in items fabricated much earlier such that the Level 2 slab and beam could commence construction much earlier. It is also clear that the RC works trade contractor had also caught up. Hence, both these trade contractors were able to work together and commence the construction of the Level 2 slab and beam on 23 January 2010.287Foot Note 287×Transcripts, 6 September 2018, p 15 lines 19 to p 17 line 4.This shows that the design and construction of the Level 2 slab and beam work was notactuallydelayed by the late award of the A&G works trade contract. 335 For the above reasons, I find that the plaintiff did not causeactualdelay to the completion of the Project regarding the A&G works. 336 I shall now address the defendant’s submissions on DW4’s analysis on the delay. DW4’s analysis was not based on theactualprogress of the works. DW4 maintained that the A&G works trade contractor must be given the full 133 days (77 days for approval of design and drawings and 56 days for production lead time) before the RC works trade contractor could commence the casting and construction of the Level 2 slab and beam. DW4 then went on to analyse that based on the Impacted Master Program, the RC works trade contractor is projected to begin construction in February 2010. Thus, the A&G works trade contract must be awarded no later than 12 October 2009 so that the RC works trade contractor can begin construction in February 2010. 337 However, as I had discussed above, this is not what had actually happened. The progress of the A&G works and the RC works were faster than was planned under the Master Program and DW4’s analysis had no answer to this fact. To accept DW4’s analysis would mean that this court ignores the central question of whether the delay caused by the plaintiff hadactuallycaused a delay. This is also the position of the law in determining acts of prevention (see above at [245]–[247]). In the light of the foregoing, I find that the plaintiff did not causeactualdelay to the completion of the Project. 338 I shall now consider the defendant’s contention that even if there were noactualdelay, the defendant is nonetheless entitled to the full time allocated to the defendant for A&G works.288Foot Note 288×Closing Submissions of the Defendant (in original action) at paras 495 – 502.In other words, although the A&G works were completed ahead of schedule, the defendant must nonetheless be entitled to the full time period allocated for A&G works. Therefore, the defendant should be given the additional 37 days it sought being the time between 12 October 2009 which DW4 analysed was the date the A&G works trade contract ought to be awarded under the Impacted Master Program and 17 November 2009 when it wasactuallyawarded. 339 On this, I have earlier mentioned that a contractor is entitled to plan and perform the work as he pleases, provided that he finishes it by the time fixed in the contract (see [314]–[316] above). However, if the delay is due solely to the action of the employer, the contractor can apply for an extension of time under the contract. With the concurrence of the architect, the contractor may be entitled to the period of delay. This is only fair as the contractor will not be penalised for any delays caused by the employer by way of liquidated damages. In this case, there is no extension of time provision in the LOI. But there is an extension of time provision in the Draft WT Contract which the parties did not sign. Notwithstanding that the Draft WT Contract was not binding, the parties had been referring to this Draft WT Contract whenever the situation suited them. However, despite having this provision, the defendant did not submit a request for an extension of time to the architect for the plaintiff’s delay in approving the A&G works and the various instances of delays by the plaintiff. It is arguable that the concept of GMP and shared savings might have a large part to play in the defendant’s decision not to request for an extension of time. 340 Therefore, I disagree with the defendant’s contention that it is nonetheless entitled to the full time allocated for A&G works despite having already found that there was noactualdelay caused by the plaintiff to the A&G works due to the plaintiff’s late award of the A&G works trade contract. Additional works instructed following the RI Inspection 341 On the issue of whether the instructions by the RI following the RI Inspection to fabricate and install the additional signage were outside the scope of the LOI, I agree that the architectural design of the building in the Project was provided by JCPL, and the signage and its location would fall under the architectural aspect of the building works. PW3 who was the SO representative confirmed that JCPL provided a team of architects to oversee the design of the building.289Foot Note 289×Transcripts, 10 August 2018, p 57 line 25 to p 58 line 2.This is also logical given the fact that the architect responsible for the design of the building would be required to indicate which access points are for firefighting access and which doors to keep latched at all times. These were some of the additional signage the defendant had to fabricate and install following from the RI Inspection.290Foot Note 290×22JCB11575 – 22JCB11576.Furthermore, the SO instructed the defendant to provide the additional signage.291Foot Note 291×1DCB Tab 43A.Therefore, contrary to the plaintiff’s position, JCPL was responsible to ensure that the design of the building was adequate to comply with the requirements of the BCA. 342 Addressing the plaintiff’s argument that the fabrication and installation of additional signage would have been provided in the scope of work of Biopolis II (which formed the scope of work under the LOI), the plaintiff did not adduce any evidence on the scope of work of the management contractor in Biopolis II. Thus, the plaintiff’s argument is not supported on the evidence. 343 Moving on to whether the fabrication and installation of additional signage were critical to the Project’s completion, I find that they were indeed critical. First, as I had already found above at [223]–[244], Project completion under the LOI is defined as the Project being ready for TOP application. Thus, any works which are necessary to achieve readiness to apply for TOP is critical for Project completion. According to DW4, it was crucial for the defendant to address the RI’s instructions following from the RI Inspection before the defendant could call for the pre-TOP inspection.292Foot Note 292×Transcripts, 6 September 2018, p 69 lines 2 to 7.I note that the plaintiff’s expert PW4 did not dispute this point. The RI’s instructions included the fabrication and installation of the additional signage. Hence, the defendant would have to expend time to address this instruction. Although I agree that the RI’s instructions included 42 items for the defendant to rectify, both parties’ experts only gave evidence on the time impact of fabricating and installing the additional signage and no other evidence was adduced as to how long the defendant took to rectify the other items.293Foot Note 293×Experts Agreed Document Tab 2 at S/N 4(iii). See also Transcripts, 6 September 2018, p 32 lines 14 to 21.Therefore, I find that the fabrication and installation of additional signage were critical to address the instructions from RI and so it was critical to the defendant to call for the pre-TOP inspection. 344 Having already found that the fabrication and installation of additional signage were critical to the Project’s completion and were additional works outside the scope of the signed LOI, it is now left for me to determine the duration of the delay caused by the fabrication and installation of these signage. On this point, I accept DW4’s expert opinion that seven days (four days for procuring the additional signage and three days for installation) would be a reasonable time to complete the additional signage works.294Foot Note 294×Mr Koh’s AEIC at p 46 and Expert’s Agreed Document at Tab 2 S/N 4(iii).I note that the plaintiff’s expert witness, PW4, also conceded that seven days was a reasonable estimate of the time required to fabricate and install the additional signage.295Foot Note 295×Transcripts, 6 September 2018, p 30 line 17 to 18. 345 Finally, having found that the fabrication and installation of these additional signage were works outside the scope of the LOI, I find that the time taken for these works to be done should not count under the allocated time under the Master Program for rectification works as the plaintiff argued. Therefore, the seven days that the plaintiff took to fabricate and install the additional signage is considered a delay to the completion of the Project caused by the plaintiff’s acts of prevention. Additional works arising from the 1st BCA Inspection 346 Similar to my findings above, I find that the additional railing works instructed by the BCA inspectors following the pre-TOP inspection were outside the scope of works of the defendant under the LOI. Again, the defendant had constructed the building pursuant to the architectural drawings prepared by JCPL. It is pertinent to note that PW3, who was the representative of JCPL, testified that as far as her role as a Qualified Person was concerned, she oversaw the regulatory aspects of architectural compliances.296Foot Note 296×Transcripts, 10 August 2018, p 59 line 13 to 14.I also repeat my findings at [341] above. 347 Further, I also find that the additional railing works instructed by the BCA inspectors following the pre-TOP inspection were critical to the Project’s completion. Without the additional railing works following the BCA inspection, the BCA inspectors would not have given the green light to the SO to proceed to apply for TOP after it had re-inspected the site on 22 December 2010 and found that the site was ready for TOP application.297Foot Note 297×22JCB11713.Thus, the time taken for the defendant to complete the additional railing works had led to a delay in the completion of the Project. In the same vein, being works outside the scope of work of the defendant under the LOI, I do not find that the time taken to complete the additional railing works should count under the time allocated under the Master Program for rectification works. 348 Similarly, I find that although there were other works instructed by the BCA following the pre-TOP inspection, both parties only confined their dispute to whether the additional railing works caused delay to the completion of the Project and their experts only gave evidence on this item.298Foot Note 298×Experts’ Agreed Document at Tab 2 at S/N 5(iii). See also Transcripts, 6 September 2018, p 32 lines 22 to 23. 349 Finally, I agree with DW4 that the delay caused by the additional railing works is 13 days. PW4 also agrees with the estimate.299Foot Note 299×Mr Koh’s AEIC at p 46. See also Experts’ Agreed Documents at Tab 2 S/N 5(iii) and Transcripts, 6 September 2018 p 40 line 8. 350 It bears reiterating that having already found that the Project would be deemed to be complete when it was ready for TOP application, I do not accept the plaintiff’s arguments that the installation and fabrication of additional signage and the additional railing works did not cause delay because the defendant was still behind on the testing and commissioning works.300Foot Note 300×Plaintiff’s Closing Submissions at paras 555 – 556.This is because the testing and commissioning works are Non-TOP Works. As I have already found above at [223]–[244], Project completion under the LOI is defined as the Project being ready for TOP application. Non-TOP Works are then not critical to Project completion. Summary of delays caused by the plaintiff 351 In summary, I find that the plaintiff had committed acts of prevention that caused the Project’s completion to be delayed in the following magnitude: (a) Six days of delay caused by the termination of the RE; (b) 147 days of delay caused by the plaintiff’s delaying actions in the award of the RC works trade contract; (c) Seven days of delay caused by the fabrication and installation of additional signage pursuant to the instructions of the RI following the RI Inspection; and (d) 13 days of delay caused by the additional railing works instructed by the BCA following the pre-TOP Inspection. 352 In total, the plaintiff’s acts of prevention above caused the Project’s completion to be delayed by 173 days. Is time set at large for the completion of the Project? 353 It is axiomatic that where there is no EOT clause, and the employer commits an act of prevention, the contractor is no longer bound by the original contractual completion date, and the time for the completion of the project will be set at large. Thus, any liquidated damages clauses entered into between the parties is rendered inoperative. Nonetheless, the contractor is under an obligation to complete the project within reasonable time and failure to complete the project within reasonable time will render the defendant liable for general damages (seeFongsoonat [24]–[25] andKwang In Tong Chinese Temple v Fong Choon Hung Construction Pte Ltd[1997] 1 SLR(R) 907 at [18]; see alsoLaw and Practice of Construction Contracts, Chow Kok Fong (5th Ed, Sweet & Maxwell) at para 9.084). The parties are in agreement with these legal principles.301Foot Note 301×Plaintiff’s Supplementary Closing Submissions at para 5 and Defendant’s Answers to Judge’s Questions Raised at the Oral Hearing on 22 October 2018 at paras 1 and 2. 354 As I have already found that the plaintiff is responsible for 173 days of delay due to its acts of prevention, the defendant is no longer bound to complete the Project within the 18 months as stipulated under cl 5.0 of the LOI. Similarly, the plaintiff’s right to claim liquidated damages under cl 6.0 of the LOI no longer applies. 355 In that light, what remains for this court is to determine whether the defendant had completed the Project within reasonable time. If this isnotso, the defendant will be liable for general damages. I shall now consider this issue. What is a reasonable time for the completion of the Project? The law 356 InFongsoon, this court held at [25] that: Even though time for completion is at large, the contractor has to complete the works within a reasonable period. If the contractor fails to do so, the employer will be able to sue to recover general damages resulting from the contractor’s breach (see per Salmon LJ inPeak Construction (Liverpool) Ltd v McKinney Foundations Ltd(1970) 1 BLR 114 at 121).What constitutes a reasonable time is a question offact. As a guide, how the courts in some cases have determined the period of reasonable time is by simply adding the effect of the employer’s delay to the contractual deadline. This is usually regarded as a fair method because it is able to strike an appropriate balance between not allowing the employer to take advantage of its own fault, and not giving the contractor any other additional time other than that caused by the employer’s delay(see generallyBalfour Beatty Construction Ltd v London Borough of Lambeth[2002] 1 BLR 288). [emphasis added] 357 The principles inFongsoonare therefore as follows: (a) What constitutes a reasonable time is aquestion of fact; (b) When determining reasonable time, the court must strike an appropriate balance between not allowing the employer to take advantage of its own fault and not giving the contractor any other additional time other than that caused by the employer’s delay; and (c) TheFongsoonmethod of determining reasonable time by simply adding the employer’s delay to the contractual completion time is merely a guide on calculating reasonable time which meets the above two considerations. 358 Guidance onwhatconstitutes the relevant facts to take into account when determining reasonable time can be gleaned from the English High Court case ofAsteaat [144]: …It would, I think, be wrong in principle to proceed upon the basis that an obligation to do something within a reasonable time was equivalent to an obligation to do it as soon as was practically possible, subject only to not being held responsible for causes of delayoutwith one’s control.… What it seems to me the application of the test formulated by the House of Lords inPantlandHick v. Raymond & Reidinvolves a case such as the present is a broad consideration, with the benefit of hindsight, and viewed from the time as at which one party contends that a reasonable time for performance has been exceeded, of what would, in all the circumstances which are by then to have happened, have been a reasonable time for performance.That broad consideration is likely to include taking into account any estimate given by the performing party of how long it would take him to perform; whether that estimate has been exceeded and, if so, in what circumstances; whether the party for whose benefit the relevant obligation was to be performed needed to participate in the performance, actively, in the sense of collaborating in what was needed to be done, or passively, in the sense of being in a position to receive performance, or not at all; whether it was necessary for third parties to collaborate with the performing party in order to enable it to perform; and what exactly was the cause, or were the causes of the delay to performance. This list is not intended to be exhaustive. [emphasis added in italics and bold italics] Factors relevant to determine reasonable time for completion 359 In the light of the principles cited above, I do not accept the plaintiff’s submission thatAsteais distinguishable from the present case because inAstea, there was no agreed completion date between the parties.302Foot Note 302×Plaintiff’s Closing Submissions at paras 580 – 585.This is not a valid differentiation. First, the principles above are statements of general application. Second, in both instances, time is set at large and the court is asked to determine, based on the facts of the case before it, what is then the reasonable time for the project’s completion. This is indeed the approach inFongsoonwhen the learned judge ruled that what constitutes reasonable time is a question of fact (seeFongsoonat [25]). 360 Drawing on the principles inAsteaandFongsoon, the determination of what constitutes reasonable time for the Project’s completion is a holistic approach that includes taking into account theactualconduct of the parties that caused the delay. This would require this court to consider all the facts, including whether the parties’ initial agreed time frame to complete the Project was reasonable, the experts’ opinions of the parties on the timelines in the light of theactualscope of work involved in the Project, and theactualdelay caused by the plaintiff. 361 Before turning to the issue proper, I pause to deal with two points raised by the parties. First, the plaintiff argues that this court should not consider the defendant’s case on the holistic approach to determine the reasonable time for completion because the defendant did not plead any of those factors.303Foot Note 303×Plaintiff’s Closing Submissions at para 591.I disagree. It is trite that, generally, only material facts are needed to be pleaded. I find that it is the defendant’s pleaded case that the Project was completed within reasonable time. Although it did not specifically state this in its pleadings, it did plead that the completion date under the LOI is set at large and that it is not liable for either liquidated damagesorgeneral damages because of the plaintiff’s acts of prevention.304Foot Note 304×Defence and Counterclaim (Amendment No. 4) at paras 29 – 44.This can only mean that the defendant is pleading that it is not liable for any delay in the completion of the Project (ie, the Project was completed within reasonable time). As to the various factors which the defendant listed down for this court to consider in assessing reasonable time, I find that those are evidential facts which the defendant could legitimately make to support its pleadings. Those facts were amply ventilated at trial by the parties’ witnesses and no one was caught by surprise. Hence, the plaintiff’s objection is unmeritorious. 362 Second, I did not place any weight on the defendant’s arguments that this court should consider the delay caused by the plaintiff in the late award of the Pneumatic Waste Conveyance Trade Contract and the Electrical Installation Trade Contract.305Foot Note 305×Closing Submissions of the Defendant (in original action) at paras 503 – 509.This is because the parties had agreed to withdraw these delaying events as the plaintiff’s acts of prevention. Hence, these events are irrelevant to this trial and I did not allow the defendant to cross-examine the plaintiff’s witnesses on these events as these are not issues for this court to consider.306Foot Note 306×Transcripts, 7 August 2018, p 9 line 11 to p 24 line 2. The reasonable time to complete the Project 363 I find that the reasonable time to complete the Project is 18 months plus 25 days for the capping beam works and a further 173 days which is the delay attributed to the plaintiff. I come to this finding by considering the following points below. 364 First, it is important to note that both parties have vast experience in the construction industry. They also had the benefit to benchmark the Project against a similar development in the vicinity which was the completed Biopolis II. Against this backdrop, they agreed that 18 months was sufficient to complete the Project. This is evidenced in the signed LOI which parties had negotiated extensively and which I had examined in great detail in this judgment. This is also supported by DW3’s evidence in cross-examination: Q:This programme [the Master Program] demonstrates how Jurong Primewide planned to finish the works by 22 January 2010, would you agree with that? A: Yes. Q: Would you say or would you agree or it is your position, sorry, that this is a reasonable programme, it’s an achievable programme? A: Yes. Q: So if there had not been any interference by any party, Jurong’s position is that it would have been able to complete the project based on this programme? A: Yes. 365 In addition, I also note that the Master Program was not prepared in isolation. The SO had provided some comments to the defendant on certain aspects of the Master Program, stating that some of the timelines therein were optimistic. Despite the SO’s comments, the defendant replied stating that the timelines provided for in the Master Program were adequate.307Foot Note 307×3JCB01423. 366 Therefore, I place great weight to the fact that the parties agreed that 18 months was adequate time to complete the Project. Nonetheless, this is but one of the factors to consider in determining reasonable time. The second factor which I shall examine is the experts’ opinion. 367 On this second point, the experts were at odds with each other. The plaintiff’s expert witness, PW4, opined that 18 months was sufficient. He came to this finding by examining the entire Master Program to make sure that the duration for completing each individual item was reasonable.308Foot Note 308×Transcripts, 6 September 2018, p 121 line 1 to p 122 line 18. See also Mr Connors’s AEIC at p 39.The defendant’s expert witness, DW4, on the other hand, submitted that a reasonable time needed for the completion of the Project would have been 24 to 26 months.309Foot Note 309×Transcripts, 6 September 2018, p 123 lines 3 to 17.DW4 came to this finding on the basis that the Master Program did not take into account the time needed for the capping beam works and the parties underestimated the time it required to set up and pre-load the temporary struts.310Foot Note 310×Transcripts, 6 September 2018, p 136 line 8 to p 137 line 12. 368 To resolve this issue, the court must take into consideration theactualscope of work (see [359]–[362]) and assess whether the Master Program had catered for all theactualwork involved bearing in mind that the parties had assessed that 18 months was reasonable. The question should then be whether 18 months is a reasonable time for completing the Project in the light of the fact that capping beam works will also take time. 369 Since capping beam works were not reflected in the Master Program, time should be accorded to perform this task. I note that the capping beam works actually took 66 days to complete, longer than was anticipated. However, DW4 estimated that the capping beam works would take at least 25 days.311Foot Note 311×Mr Koh’s AEIC at p 36.I am of the view that it would not be appropriate to grant 66 days for the capping beam works because it was stated in the Monthly Progress Report 13 for August 2009 that the capping beam works were in fact delayed by a myriad of factors.312Foot Note 312×10JCB05320.Therefore, in deciding the time it would normally take to complete the capping beam works, I accept the assessment of DW4,ie,that it would have taken 25 days. 370 I note that PW4 accepted that capping beam works were not provided for under the Master Program, but he opined that the parties knew the scope of the substructure work would include the capping beam and nonetheless went ahead to agree on the Master Program. Hence, PW4 believed that 18 months for the completion of the Project was reasonable.313Foot Note 313×Transcripts, 6 September 2018, p 125 lines 13 to 19.I disagree with PW4’s evidence on this because it was speculative as to whether the parties knew at the time when they agreed that 18 months was sufficient to complete the Project and as a result, did not include time for the capping beam works. 371 As for whether the time required for the installation and pre-loading of the temporary struts was underestimated, I find that having already included this work under the Master Program and the fact that the parties agreed that the time allocated under the Master Program was sufficient (ie,12 days), weight must be given to what the parties found was reasonable time to complete this work.314Foot Note 314×Transcripts, 6 September 2018, p 136 lines 3 to 6 and p 137 line 16 to p 138 line 5.Although the installation and pre-loading of the temporary struts took longer than was anticipated (ie, 24 days), no evidence was submitted as to what caused this delay. Hence, I did not place any weight on DW4’s and PW4’s assessment on whether the installation and pre-loading of the temporary struts was underestimated, and so I do not find that more time should be added to the 18 months already agreed between the parties for the actual time taken for the installation and pre-loading of the temporary struts. 372 Finally, I do not accept DW4’s assessment that the reasonable time to complete the Project is 24 – 26 months. Although I am prepared to add a further 25 days to the 18 months that the parties agreed was sufficient for the Project’s completion (this 25 days being the time it will take for the capping beam works), I find that there is no basis for the Project’s completion to take 24 – 26 months instead of only 18 months and 25 days. DW4’s evidence on this is not grounded on theactualscope of works but on general statements about the nature of the works involved – being a top-down construction method. 373 Without the acts of prevention from the plaintiff, the reasonable time for this Project to complete is 18 months and 25 days. If the plaintiff’s acts of prevention are taken into account then, adopting theFongsoonmethod to ensure that an appropriate balance is struck between not allowing the employer to take advantage of its own fault and not giving the contractor any other additional time, other than that caused by the employer’s delay, the reasonable time for the Project to complete would be 18 months plus 25 days and 173 days (a total of 18 months and 198 days of delay). Summary 374 In the light of the foregoing, I find that a reasonable time for the Project’s completion is 18 months and 198 days. Apportionment of delay and additional preliminaries 375 It is undisputed that the Project’s start date under cl 5.0 of the LOI is 23 July 2008. For the Project to be completed within reasonable time, it should have been completed by 9 August 2010 (adding 18 months and 198 days to the Project’s start date). However, the Project was only completed on 22 December 2010 (see [244] above). Thus, the delay to the Project that is attributable to the defendant is 133 days (this being the difference between the new completion date of 9 August 2010 and the date on which the Project was completed, 22 December 2010). The defendant’s expert witness, DW4, opined that the defendant had also caused delay to the Project’s completion albeit for 120 days. 376 Therefore, the plaintiff is not liable to pay the defendant for the additional preliminaries that the defendant incurred for the 133 days of delay which is attributable to the defendant. If the defendant had been paid for these additional preliminaries, then the defendant must refund the same to the plaintiff. 377 Before I summarise my findings, I shall address two other points raised by the parties.",
        "The plaintiff had embarked on a campaign to slow down the completion of the Project": "378 The first matter to be addressed was raised by the defendant regarding the issue of delay. Upon considering the evidence and the testimony of PW1 and PW2, I find that the plaintiff had embarked on a subtle campaign to slow down the completion of this Project while attempting to avoid having to bear any financial responsibility for doing so. This was largely due to the GFC in late 2008 which moderated construction prices and threw a pall of uncertainty to the demand for the Project at that time. In response, the plaintiff attempted to re-negotiate the LOI to reduce the contract price while at the same time slowed down the completion of the Project in an insidious way so that the plaintiff would not be penalised on costs for slowing down the Project. 379 On the evidence, PW1 agreed that the GFC resulted in the moderation of construction prices.315Foot Note 315×Transcripts, 30 July 2018, p 88 lines 2 to 20.PW2 then admitted that the GFC had a considerable impact on the likely demand for the Project at the time.316Foot Note 316×Transcripts, 10 August 2018, p 13 lines 22 to 25.PW1 also admitted that all the parties involved in the Project under the HOA started to explore options for the Project moving forward.317Foot Note 317×Transcripts, 3 August 2018, p 109 to p 110 line 10; p 110 lines 13 to 25; and p 111 lines 6 to 18. 380 In the light of the meeting the parties had, DW2 wrote an email to the plaintiff on 6 December 2008 stating that “[DW1] had spoken to me and ask for my view on [PW1’s] intent to explore [the possibility] of slowing down the work [on] site”.318Foot Note 318×1DCB Tab 8.In this email, DW2 provided detailed options for the plaintiff to consider, the first being atotal suspensionof works on site for three to six months and the second option being aslowdown of workson site for three to six months. DW2 informed the plaintiff that additional suspension costs might be incurred for a slowdown of the Project. 381 On 13 December 2008, a week after the above email, the plaintiff sent the email instruction to the defendant not to award any trade contracts without PW1’s approval (see above at [272]). On 6 January 2009, very close in time to the plaintiff’s continued instruction for the defendant not to award trade contracts without its approval, DW2 sent an email to PW1 stating that:319Foot Note 319×4JCB02139. [PW1] request for a potential cost prolong for a few months, off my head I suggest a budget of 700k, the final analysis done by Crescendas PM and the consultant, together with our guys, came out around S$487,000 excluding any claim in loss of profit, so the real number likely be somewhere between the two. 382 In other words, in this email, DW2 responded to PW1’s request for an estimate on the prolongation costs that it might be liable to pay should there be a decision from them to slow down or suspend the work on the Project for a few months. PW1 testified in cross-examination that he made no such requests to the defendant and that the defendant had gone ahead to calculate the prolongation costs and wrote the above-mentioned email to the plaintiff at its own initiative.320Foot Note 320×Transcripts, 3 August 2018, p 119 line 7 to p 120 line 20.I find PW1’s evidence on this issue incredible. Although DW2 did not receive such request directly from PW1 but from DW1 instead, I find that it makes no sense for the defendant to go ahead and estimate the costs of prolongation and update the plaintiff of its findings via email if the plaintiff did not at least ask the defendant to explore the option. Ultimately, the plaintiff did not indicate to the defendant whether to slow down the completion of the Project. It was obvious that the high costs implications for slowing down the Project were unattractive to the plaintiff. 383 Nevertheless, as I have discussed above, the plaintiff then commenced a subtle campaign to slow down the progress of the works on the Project. On 7 January 2009, a day after the defendant informed the plaintiff of the estimated prolongation costs, the plaintiff introduced Chang Hua into the tender process for the RC works trade contract. The plaintiff then, instead of approving the defendant’s tender report and recommendation which was issued on 5 February 2009, introduced Shanghai Tien Rui on 24 April 2009 thus forcing the defendant to go through the whole tender process again to ensure that the tender process was fair to all tenderers. In the background of this delay caused by the plaintiff in the award of the RC works trade contract, the plaintiff was also slow in paying the defendant for work done thus far (see above at [286]–[289]). In fact, the defendant had to commence numerous security of payment adjudication against the plaintiff to recover outstanding payments from the plaintiff throughout the whole Project.321Foot Note 321×11JCB11452 – 11JCB11453. 384 Therefore, the plaintiff’s conduct throughout the construction of the Project was highly interventionist and the evidence clearly shows that the plaintiff’s acts were unconducive to the progress of the works towards the completion of the Project. 385 Nevertheless, given the evidence before me, I am unable to agree with the defendant’s case that when the Project was completed on 22 December 2010, it was completed within reasonable time. As explained at [375] and [376] above, even the defendant’s own expert witness, DW4, found that the defendant was also responsible forcriticaldelays in the Project. Therefore, it would not be appropriate to find thatonlythe plaintiff was responsible for the delays in the completion of the Project. My observation on the plaintiff’s attempts to slow down the Project only reinforces my findings that it had committed the acts of preventions discussed above in this judgment.",
        "DW2’s evidence": "386 The second matter I wish to address was raised by the plaintiff regarding the credibility of DW2’s evidence. The plaintiff submits that DW2’s evidence was tailored to meet the plaintiff’s case. The plaintiff argues that DW2’s belated filing of his Affidavit of Evidence-in-Chief (“AEIC”) was suspicious and was a deliberate move on DW2’s part so that he could have sight of the evidence tendered by the plaintiff.322Foot Note 322×Plaintiff’s Closing Submissions at paras 634 – 636.The plaintiff also argues that DW2’s evidence was tailored specifically to “plug the holes” in the defendant’s case because DW2’s evidence in his AEIC was blatantly outside the scope of what was initially ordered by the court in HC/ORC 4800/2018 dated 6 July 2018 (“Court order”). Under this Court order, because DW2 was allowed not to file an AEIC, he could only give evidence on the following issues: (a) The context surrounding the Preliminaries Sum under the LOI; (b) Whether there was a subsequent agreement by the parties for the defendant’s preliminaries to be assessed on the basis of actual cost of preliminaries incurred by the defendant; (c) Whether the defendant was entitled to any share in the first $5 million of the shared savings; and (d) Whether the defendant was entitled to the balance of the fixed Preliminaries Sum of $155,000. 387 However, in DW2’s AEIC, DW2 went beyond the above scope and gave evidence on delay issues. Thus, the plaintiff submits that DW2’s evidence was tailored to meet the plaintiff’s case and so is not credible. 388 I cannot agree with the plaintiff. The Court order was applicable only if DW2 did not file an AEIC, which both parties initially thought he would not. However, when the trial commenced, I asked the defendant to urge DW2 to file an AEIC as it would save time. I even told the defendant to convey to DW2 that it is the court’s view that DW2’s filing of the AEIC would in fact help save time and costs for both parties. In giving my direction in chambers, I did not inform the defendant to confine DW2’s AEIC to the scope of the Court order and the plaintiff did not object to this when we were discussing this issue. Upon the Court’s direction, the defendant was successful in procuring an AEIC from DW2. Hence, I find that the Court order is only binding on the parties if DW2 came on the stand without filing an AEIC. 389 Next, the plaintiff was not prejudiced by DW2’s late filing of his AEIC. The plaintiff was given time and opportunity to extensively cross-examine DW2 over two days and in the plaintiff’s cross-examination, the plaintiff went beyond the scope of the Court order. The plaintiff in fact cross-examined DW2 on the delay issue as well. An instance of this was on the delay in the award of the RC works trade contract.323Foot Note 323×Transcripts, 16 August 2018, p 138 lines 8 to 15. 390 The mere fact that DW2 filed his AEIC on the eve of him coming to court to give evidence does not automatically mean that his evidence is not credible. As the Court of Appeal inAuto Clean ‘N’ Shine Services (a firm) v Eastern Publishing Associates Pte Ltd[1997] 2 SLR(R) 427 stated at [20]: … Our courts have been sufficiently perceptive and robust to deal with and sift out attempts by litigants to reshape their evidence. In this case, if the plaintiff sought to reshape the evidence to meet the case of the defendants, it can be tested in cross-examination and no doubt the trial judge would be in a position to assess the veracity and credibility of the evidence on the totality of the evidence before him. 391 Likewise, in this case, where relevant, I have assessed DW2’s evidence on the totality of the evidence before me on the respective issues canvassed in this judgment. Therefore, I disagree with the plaintiff’s submissions that DW2’s evidence should be disregarded totally because of DW2’s late filing of his AEIC.",
        "Summary of findings": "392 In summary, I make the following findings: (a) First, on the issue of the Preliminaries Sum, I find that the parties’ intention was for the Preliminaries Sum under the LOI to be fixed at $12.3 million and any double payment made by the plaintiff must be refunded by the defendant; (b) Second, with regard to the performance bond, I find that the plaintiff is not liable to pay the defendant $155,000 for the provision of the OCBC Bond; (c) Third, on the issue of the defendant’s waiver of its share in the first $5 million of the shared savings, I find that there was no agreement between the parties that the defendant would forego its 50% share in the first $5 million of the shared savings as the plaintiff failed to comply with its conditions; (d) Fourth, with regard to the issue of delays, I find that the plaintiff had caused 173 days of delay by its acts of prevention, that the time for the Project’s completion is set at large and that the reasonable time for the Project’s completion is 18 months plus 198 days. Thus, the defendant was in delay of 133 days; and (e) Finally, the plaintiff should not be liable to pay the defendant for the additional preliminaries that the defendant incurred for the 133 days of delay for which the defendant is liable.",
        "Conclusion": "393 In conclusion, I make the following orders: (a) I dismiss the plaintiff’s claim under Issue 1; (b) I dismiss the defendant’s counterclaim under Issue 2; (c) I allow the defendant’s counterclaim under Issue 3; and (d) I allow the plaintiff’s claim for delays albeit that the defendant is liable for general damages for 133 days of delays in the completion of the Project; and (e) I allow the plaintiff’s claim for a refund of the portion of the additional preliminaries it paid to the defendant for 133 days of delay only. 394 As for costs, I order that costs is to be agreed between the parties, failing which costs is to be taxed. Tan Siong ThyeJudge Parmar Karam Singh, Kang Weisheng Geraint Edward, Muslim Albakri, Siaw Hui and Leong Lijie (Tan Kok Quan Partnership) for the plaintiff;Philip Antony Jeyaretnam SC, Koh Kia Jeng, Lau Wen Jin, Reuben Gavin Peter and Tan Ting Wei (Dentons Rodyk & Davidson LLP) for the defendant."
    }
}