{
    "case_title": "UWL vUWM",
    "ncitation": "[2019] SGHCF 17",
    "coram": "Tan Puay Boon JC",
    "sections": {
        "Introduction": "1 The plaintiff (“the Husband”) and the wife (“the Wife”) were married in China on 9 August 2002. The Wife was already living in Singapore at the time of the marriage. The Husband moved from China to Singapore in October 2003. The parties have no children.1Foot Note 1×Joint summary of relevant information (updated 12 December 2018) (“joint summary”) at pp 1–4. 2 The Wife holds a master’s degree from a local university. She was employed as a senior Information Technology manager until she resigned in October 2012 to venture into business in China. She claims that her businesses have failed and that she has no income. The Husband is a doctor and earns at least $23,000 a month.2Foot Note 2×Joint summary at pp 1–2. 3 The Husband left the matrimonial home on 20 March 2013 and the parties have been living separately since 21 March 2013 (“the date of separation”). The Wife then left for China sometime in the later part of 2013, although it is not clear precisely when.3Foot Note 3×Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 4; Wife’s ancillary affidavit dated 12 July 2018 at p 7.She spent most of her time in China4Foot Note 4×Wife’s ancillary affidavit dated 12 July 2018 at p 7.until the Husband filed for divorce in May 2017 on the basis of the parties’ four years’ separation. She returned to Singapore to participate in these proceedings. Interim judgment (“IJ”) was granted in August 2017. The parties were married for 10 years when they separated and 15 years when IJ was granted.5Foot Note 5×Joint summary at p 1; Husband’s written submissions at pp 2–3.",
        "Matters in dispute": "4 The issues that are before me for determination are the division of the matrimonial assets, maintenance of the Wife and costs of the ancillary matters (“AM”) hearing.",
        "Division of matrimonial assets": "",
        "Legal principles": "5Section 112 of the Women’s Charter (Cap 353, 2009 Rev Ed) (“the Women’s Charter”) sets out the power of the Court to order the division of matrimonial assets, and lays down the considerations that are to be taken into account when making the division. I keep these in mind when dividing the matrimonial assets. 6 InNK v NL[2007] 3 SLR(R) 743 (“NK v NL(2007)”) (at [31]–[33]), the Court of Appeal discussed two distinct methodologies that have been applied in the case law in the division of matrimonial assets – the global assessment methodology and the classification methodology. The global assessment methodology “consists of four distinct phases:viz, identification, assessment, division and apportionment” (at [31]). The classification methodology involves “an assimilation of all four of the above steps into a broad judicial discretion which, in the first instance, separately considers and dividesclassesof matrimonial assets” [emphasis in original] (at [32]). The Court of Appeal explained that while there is “much to be said for either method, both of which are consistent with the legislative framework provided by s 112 of the [Women’s Charter]”, in the final analysis, the court should apply the methodology that achieves the paramount aim of ensuring that the matrimonial assets are divided in a just and equitable manner (at [33]). 7 In the present case, I will adopt the classification methodology. I find this to be the more appropriate methodology given that one of the real properties owned by the parties carries a negative value. Thus, I will separately consider and divide the real properties from the other assets.",
        "Identification and assessment of assets": "8 The parties have signed a joint summary of relevant information, which was last updated on 12 December 2018. I will refer to this version of the joint summary in this judgment. Relevant dates 9 The parties agree that the assets should bevaluedat the date of the AM hearing. I accept that this is an appropriate date: seeTND v TNC and another appeal[2017] SGCA 34 at [19]. They however disagree on the date on which the assets should beidentified. It is common ground that the default date is the IJ date:ARY v ARX and another appeal[2016] 2 SLR 686 (“ARY x ARX”) at [31]. This is because the IJ “puts an end to the marriage contract and indicates that the parties no longer intend to participate in the joint accumulation of matrimonial assets …”:AJR v AJS[2010] 4 SLR 617 at [4], cited with approval inARY v ARXat [32]. Nevertheless, the court possesses the discretion to depart from that date in “deserving cases”, where they are “cogent reasons to do so”:ARY v ARXat [34]–[35]. 10 The Husband submits that the assets should be identified at the date of separation. In other words, any asset or liability acquired or incurred after that date should not be included for division. He highlights that “relations between parties were virtually non-existent from [the date of separation].” Further, he submits that the parties had a “common understanding that they would cease to jointly acquire or invest in further assets, and that any future accumulation of assets would accrue to them individually”. He also emphasises that “parties always kept their finances separate in the course of their marriage, and largely paid for their own individual expenses”.6Foot Note 6×Husband’s written submissions at paras 23–26. 11 The Wife submits that the assets should be identified at either the IJ or AM hearing date. She points out that the parties had communicated to make financial arrangements in relation to mortgage payments of two real properties which parties do not dispute are matrimonial assets. This, according to her, shows that “the ties between the parties were not clearly severed”.7Foot Note 7×Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 5.In her written submissions, she also cites the Husband’s annual income of $300,000 as an additional reason to adopt either the IJ or AM date.8Foot Note 8×Wife’s written submissions at para 53. 12 In my view, the Wife’s reasons are not convincing. The mere fact that the parties made financial arrangements after the date of separation does not show that the marriage had not broken down by then. Those discussions strike me as purely transactional. I also do not see how the quantum of the Husband’s income is relevant to the analysis. It may be relevant if the Husband had suddenly made a windfall after the date of separation, but this is not the case here. 13 On the other hand, I agree with the Husband that the assets should be identified at the date of separation. While the IJ date is typically the date which “puts an end to the marriage contract” (see [9] above), I find that the marriage had come to an end by the date of separation. Indeed, as stated above, the Wife moved to China shortly after separating. 14 I find support for my conclusion in the decision of the Court of Appeal inBRL v BRM(Civil Appeal No 77 of 2018). In that case, because of an incident which transpired in February 2014, the wife moved to China on 1 March 2014 with their daughter, leaving the husband behind. Sometime in April 2014, the wife informed the husband that she and their daughter would not be returning to Singapore. In the circumstances, the High Court declined to include in the pool of assets the increase in value of a company owned by the husband after 2014. The High Court reasoned that this was because the wife “had, in effect, ended their marital relationship” when she left for China.9Foot Note 9×Certified Transcript (Divorce Transferred No 3125 of 2014) dated 12 April 2018 at pp 81–82.This decision was affirmed on appeal. Indeed, the Court of Appeal went further and excluded from the pool of assets a landed property in China acquired by the wife in December 2014, a few months after she had left Singapore for China.10Foot Note 10×Minute sheet (Civil Appeal No 77 of 2018) dated 1 February 2019. 15 The present case is on all fours withBRL v BRMas the Wife here had also left for China after the Husband moved out of the matrimonial home. In fact, it is possible to argue that the reasoning inBRL v BRMappliesa fortiorihere because the parties inBRL v BRM, while separated, were still bound to co-operate in caring and providing for their daughter: s 46 of the Women’s Charter. In this case, the parties did not have a child and thus led their own lives after the date of separation, especially so after the Wife returned to China. 16 I also find support from the decision of the High Court (Family Division) inUBD v UBE[2017] SGHCF 14, where the court departed from the general rule that matrimonial assets should be valued at the date of the AM hearing date on the basis that the parties had lived separate and independent lives for six years before the divorce (at [12]). Thus, I will identify the matrimonial assets as at the date of separation in this case. 17 To be consistent, I will adopt the same approach in relation to identifying liabilities: seeUAP v UAQ[2018] 3 SLR 319, where the High Court declined to take into account various alleged liabilities because they were not supported by evidence and were also incurred after the IJ date: see [67]. Since I have taken the date of separation as the point of reference when identifying assets, I will do the same for liabilities. As with assets, I will value liabilities at the AM hearing date where they have been incurred before the date of separation. 18 Before I leave this point, I clarify that I am not laying down a general rule or even a presumption that matrimonial assets should be determined or valued at the date of separation. Indeed, the Court of Appeal has held otherwise because the law “regards the parties as being in a subsisting legal union even though that union may have undergone factual disintegration”:ARY v ARXat [40]. Nevertheless, there are cogent reasons for adopting the date of separation as the operative date for determining the assets in this case: the parties did not have children and the Wife returned to China shortly after the parties separated, where she lived and engaged in business ventures for several years before coming back to Singapore to participate in these proceedings. 19 I now turn to the parties’ various assets and liabilities. River Valley property 20 The River Valley property is the matrimonial home which the parties purchased in July 2010 for $1,350,000.11Foot Note 11×Joint summary at p 6.The Husband estimates the gross value of this property to be $1,650,000. He relies on a Urban Redevelopment Authority (“URA”) resale transaction list indicating that a unit was sold for this price in June 2018.12Foot Note 12×Husband’s ancillary affidavit dated 21 June 2018 at para 10 and p 226 (Husband’s bundle of affidavits, vol II, p 311).The Wife initially relied on a Central Provident Fund (“CPF”) valuation of $1,340,000,13Foot Note 13×Wife’s ancillary affidavit dated 12 July 2018 at p 17.but as counsel for the Husband pointed out at the hearing, this valuation is for the purpose of determining the loan amount and does not represent the market value of the property. The Wife now relies on a URA resale transaction list indicating that a unit was sold in March 2017 for $1,500,000.14Foot Note 14×Wife’s affidavit of assets and means at p 21; Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 9.As the Husband’s evidence reflects a transaction that is closer to the AM hearing date, I will take $1,650,000 as the gross value of this property. 21 It is not disputed that there are two loans secured against the River Valley property: a home loan of $910,454.30 and a term loan of $178,396.53.15Foot Note 15×Joint summary at p 6; Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 9.The Husband submits that the term loan should not be deducted from the gross value of the River Valley property because it was not used towards its acquisition.16Foot Note 16×Husband’s ancillary affidavit dated 21 June 2018 at para 12.I disagree. The term loan is an encumbrance on the River Valley property. It is a sum that must be repaid if and when the parties attempt to realise the value of the River Valley property by selling it. In this way, the value of the River Valley property is compromised by the existence of the term loan. The manner in which the term loan is used does not change this fact. In the circumstances, the net value of this property is the difference between its gross value and the sum of the two loans: $561,149.17. Marina property 22 The Marina property is an investment property which the parties purchased in February 2013 for about $5,800,000.17Foot Note 17×Joint summary at p 7.The parties initially disagreed on the present gross value of this property. They came to different figures, relying on desktop valuation and an offer from a potential buyer.18Foot Note 18×Joint summary at pp 6–7.At the hearing on 22 February 2019, the parties agreed to obtain a joint updated valuation of the Marina property, and indicated their agreement to share the cost of obtaining the valuation.19Foot Note 19×Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 10.The valuer subsequently stated its opinion that the fair market value of the Marina property was $3,400,000 as at 8 March 2019.20Foot Note 20×Exhibit H2.At the hearing on 17 April 2019, counsel for the Wife claimed that this valuation was “underpriced”.21Foot Note 21×Minute sheet (Divorce Transferred No 2254 of 2017) dated 17 April 2019 at p 10.However, she did not offer any cogent reason for her assertion. Accordingly, I find that the gross value of this property is $3,400,000. 23 As for the outstanding liability of this property, the Wife has tendered a statement from UOB stating that the outstanding loan of the Marina property was $4,280,265.32 as at 30 June 2018.22Foot Note 22×Wife’s ancillary affidavit dated 12 July 2018 at p 20.The Husband does not dispute this figure.23Foot Note 23×Joint summary at p 7.I adopt this figure as there is no evidence of the outstanding liability on the Marina property which is closer to the AM hearing date. The net value of this property is -$880,265.32, being the difference between those two sums. Other assets (1) Jointly-owned assets 24 The parties do not dispute the following assets and their values:24Foot Note 24×Joint summary at pp 7–8. AssetValue ($)UOB account -55730.29UOB account -69484.12UOB account -7338 (closed)0 (2) Assets in Husband’s sole name 25 The parties do not dispute the following assets and their values:25Foot Note 25×Joint summary at pp 8–10. AssetValue ($)CPF accounts274,275.29AIA policy -65690UOB account -22470UOB account -219283.16OCBC account -10013,483.95POSB account -202424.63BOC account -937120,004.93TD account -27983,218.65 26 Regarding the Husband’s CPF accounts, the Wife points out that the above value of $274,275.29 is outdated because it reflects the amount in the accounts in August 2017.26Foot Note 26×Joint summary at p 8.However, the value of CPF and bank accounts should usually be taken at IJ date, or the date of separation in this case: seeUNEv UNF[2018] SGHCF 12 at [4]. I will thus not adopt the updated figures. 27 The Wife also submits that the Husband has $153,780 in his OCBC account -1001. However, on her own evidence, this sum represents his bonuses from 2013 to 2017.27Foot Note 27×Joint summary at p 9, item 5.As with the CPF moneys, the earnings accrued in this period are not matrimonial assets. I thus accept the Husband’s value of $3,483.95 for this bank account. 28 The Wife further submits that the Court should include the moneys in a Standard Chartered account (“the Standard Chartered account”) which she claims were dissipated. I will address this item below in my discussion on adverse inferences.28Foot Note 28×Joint summary at p 16, item 1.The Wife also submits that four other accounts should be included.29Foot Note 29×Joint summary at pp 16–17, items 2–5.However, the moneys from these accounts represent the Husband’s salary and allowance from January 2017 to October 2018 and are thus not matrimonial assets. (3) Assets in Wife’s sole name 29 The parties do not dispute the following assets and their values: AssetValue ($)CPF accounts240,487.60UOB account -306793.83POSB account -262926.85DBS account -450140.00 30 The Husband submits that the value of the Wife’s shareholding in the following companies should be included in the pool of assets: AssetValue ($)Singapore company [A]587,335 (value of shareholding)538,335 (amount Wife invested)Singapore company [B]5,000Chinese company [C]1,106,859.85Chinese company [D]156,000 31 Singapore companies [A] and [B] were incorporated by the Wife to invest in Chinese companies [C] and [D] in what appears to be a joint venture.30Foot Note 30×Minute sheet (Divorce Transferred No 2254 of 2017) dated 22 February 2019 at p 12.Companies [A], [B], [C] and [D] were incorporated in August 2012,31Foot Note 31×Husband’s affidavit of assets and means dated 27 September 2017 at p 744.January 2017,32Foot Note 32×Husband’s affidavit of assets and means dated 27 September 2017 at p 761.March 201633Foot Note 33×Husband’s affidavit of assets and means dated 27 September 2017 at p 774.and September 201334Foot Note 34×Husband’s affidavit of assets and means dated 27 September 2017 at p 779.respectively. Thus, save for [A], they were incorporated after the date of separation. As for [A], while it was incorporated about six months before the date of separation, I find it more likely than not that the value of its shareholding was largely built up after the date of separation, since it was incorporated for the purposes of investing in companies [C] and [D]. 32 I now turn to the sum of $538,335 which the Wife invested in [A].35Foot Note 35×Wife’s answers to interrogatories dated 9 January 2018 p 11, item 21.The Wife accepts that of this sum, $300,000 came from UOB account -5573, which the parties jointly own:36Foot Note 36×Wife’s answers to interrogatories dated 9 January 2018 p 14, item 26.see [24] above. However, the Wife claims that this investment “has no value” as Companies [C] and [D] are in debt and have been ordered to be wounded up by the Chinese government.37Foot Note 37×Joint summary at pp 12–13; Wife’s answers to interrogatories dated 9 January 2018 p 11, item 21.Since it is clear that the sum of $300,000 was from the parties’ joint bank account, and since it appears from a WhatsApp conversation between the Husband and the Wife that the Husband did not explicitly consent to the withdrawal of this sum,38Foot Note 38×Husband’s affidavit of assets and means dated 27 September 2017 at p 794.the Wife has to account for it. I thus notionally return $300,000 to the pool of assets under the parties’ joint names. As for the balance of $238,335, the Husband has not adduced evidence on the source of these funds. I thus find that this sum was more likely than not earned by the Wife after the date of separation. The Wife therefore does not have to account for it: see [26] above. This is consistent with how I will treat the Husband’s expenditure after the date of separation: [67] below. 33 The Husband also submits that Company [A] owes the Wife $90,110 and that this should be notionally included in the pool of assets.39Foot Note 39×Joint summary at p 13.He relies on the company’s audited 2016 accounts, which shows that this sum was “due to a director”;40Foot Note 40×Wife’s voluntary affidavit dated 20 March 2018 at p 346.the Wife was the only director.41Foot Note 41×Wife’s voluntary affidavit dated 20 March 2018 at p 334.As above, I find that this sum was more likely than not earned after the date of separation and will not require the Wife to account for it. 34 The Husband further submits that the Wife has undisclosed investment income.42Foot Note 42×Joint summary at p 14, item 12.He relies on the Wife’s 2017 bank statements.43Foot Note 43×Husband’s ancillary affidavit dated 21 June 2018 at para 8(c).Since the income was earned after the date of separation, I do not include it in the pool of assets. 35 In addition, the Husband points out that the Wife has not disclosed two insurance policies. He relies on pictures of unopened envelopes addressed to the Wife from insurance companies; the Wife was referred to as a “Policyholder” in one of the letters.44Foot Note 44×Husband’s ancillary affidavit dated 21 June 2018While the Wife has not provided any explanation, I decline to consider them as the value of those policies are not likely to be significant. 36 The Husband also submits that the Wife has undisclosed income of $1,370,000. The sole basis of this assertion is a WhatsApp message from the Wife: Let’s pray together, once my China partner can be replace soon, our business in China will be resume as updated you that first aircraft my Jewish partner will give me profit 1 million USD. 37 This message does not assist the Husband. First, it is incoherent. It is not clear precisely what the Wife is trying to convey. Second, there is no evidence as to the context in which this message was sent. The Wife could have been boasting or reassuring the Husband about her large investments. Thus, the message does not prove that the Wife had actually earned profits of USD $1,000,000. Wife’s liabilities 38 The parties agree that the Wife owes $5,402.33 in arrears of MCST fees.45Foot Note 45×Joint summary at p 15. 39 The rest of her purported liabilities are disputed. In the joint summary, the Wife has set out 22 items under her list of liabilities. They comprise credit card liabilities (items 1 to 10), loans from mobile payment applications (items 11 to 13) and loans from third parties (items 14 to 22).  I will not take into account these liabilities because I find it more likely than not that they were incurred after the date of separation: see [17]. In particular, regarding items 1 to 13, the Wife has not tendered evidence indicating that the loans were incurred prior to the date of separation. As the Husband points out, the earliest statement is dated October 2016, more than three years after the date of separation.46Foot Note 46×Husband’s written submissions at para 104.When this was brought up at the hearing, the Wife did not seek to deny that the liabilities were incurred after the date of separation.47Foot Note 47×Minute sheet (Divorce Transferred No 2254 of 2017) dated 17 April 2019 at p 3.As for the loans from third parties, the evidence, where available, indicates that they were taken after the date of separation. The rest of the alleged loans were not even supported by evidence.48Foot Note 48×Joint summary at p 25, items 10 to 22. 40 The Wife submits that she had to take out the loans so that she could pay for the mortgage over the River Valley property. However, the Wife eventually started making payments through her CPF account.49Foot Note 49×Minute sheet (Divorce Transferred No 2254 of 2017) dated 17 April 2019 at pp 3–4.She could have done so earlier and avoid incurring these liabilities. In the alternative, she could have rented out the flat or at least a room to raise funds. Indeed, this was what the Husband suggested to her in an email sent to her in June 2013.50Foot Note 50×Husband’s affidavit of assets and means dated 27 September 2017 at Tab 102.I note that the Wife claims that it was the Husband who refused to have the property rented out. She relies on text message sent by the Husband to property agents instructing them not to rent out the property.51Foot Note 51×Wife’s ancillary affidavit dated 12 July 2018 at p 59.However, it is clear from those messages that the reason for the Husband’s instructions is that the parties disagree on what should be done with the property. The messages are thus consistent with the Husband’s account that it was the Wife who had refused to rent out the property. Therefore, I find that the Wife did not have to incur those liabilities even if she had done so.",
        "Division of assets": "Methodology in ANJ v ANK 41 In their submissions on the division of matrimonial assets, the parties have used the structured approach laid out by the Court of Appeal inANJ v ANK[2015] 4 SLR 1043 (“ANJ v ANK”). This approach was succinctly summarised inTIT v TIU[2016] 3 SLR 1137 (“TIT v TIU”) at [21] as follows: (a) express as a ratio the parties’ direct contributions relative to each other, having regard to the amount of financial contribution each party made towards the acquisition or improvement of the matrimonial assets [(“Step 1”)]; (b) express as a second ratio the parties’ indirect contributions relative to each other, having regard to both financial and non-financial contributions [(“Step 2”)]; and (c) derive the parties’ overall contributions relative to each other by taking an average of the two ratios above (the derived ratio shall be referred to as “the average ratio”), keeping in mind that, depending on the circumstances of each case, the direct and indirect contributions may not be accorded equal weight, and one of the two ratios may be accorded more significance than the other. Adjustments could also be made in respect of other relevant factors under s 112 or s 114(1) of the Women’s Charter … [(“Step 3”)]. 42 The present case is unique because the marriage broke down and the Wife left Singapore a few years before the IJ date. The issue is whether, when applying the structured approach, the parties’ contributions (both direct and indirect) should be assessed up till the date of separation, the IJ date or the AM hearing date. In this regard, the decision of the Court of Appeal inAUA v ATZ[2016] 4 SLR 674 (“AUA v ATZ”) is apposite. In that case, the parties entered into a deed of separation which covered the division of matrimonial assets in the event of a divorce. The wife subsequently filed for divorce. In deciding the AM, the High Court held that the deed did not reflect a fair and equitable distribution of assets and should be varied because the sum of $40,000 awarded to the wife only reflected the parties’ relative contributions up till the date of the deed and did not adequately take into account the wife’s continuing indirect contributions to the marriage until its final dissolution:AUA v ATZat [23]. The Court of Appeal disagreed. It appliedARY v ARXby analogy, holding that (at [25]): … The question is whether the marriage still exists in any meaningful sense such that the actions of the parties, whether in theacquisition of assets, thecare of their children, or otherwise, may properly be said to have been done during the subsistence of the marriage and should therefore be taken into account in the division exercise. … [emphasis added] 43 The Court of Appeal concluded that since the parties’ marital relationship came to a close with the conclusion of the deed, there was no injustice in the fact that the deed did not appear to take the wife’s continuing role as primary caregiver to the child into account when determining her share of the matrimonial assets:AUA v ATZat [27]. I add that while the specific issue in that case was whether the wife’s indirect contributions after the conclusion of the deed should be taken into consideration, it is clear from the Court of Appeal’s comments at [25] ofAUA v ATZ(extracted immediately above at [42]) that the same principles apply to direct financial contributions. 44 Returning to the facts of the present case, I have, applyingARY v ARX, found that the parties’ marriage did not exist in any meaningful sense after the date of separation: [13] above. In the circumstances, applyingAUA v ATZ, I will consider the parties’ contributions up till the date of separation only. River Valley property (1) Direct financial contributions 45 It is not disputed that the Husband stopped contributing to the mortgage payments from August 2013.52Foot Note 52×Joint summary at pp 26–27.The extent of the Wife’s contributions after that is disputed, but her contributions during this period are irrelevant: see above paragraph. It appears to be common ground that the parties’ direct contributions pre-August 2013 are 60:40 in the Wife’s favour. In particular, the Wife submits that she made 81% of the financial contributions towards the acquisition of this property: 60% pre-August 2013 and 21% after that.53Foot Note 53×Joint summary at p 26.The Husband submits that the Wife’s financial contributions amount to 68.95%, but that is because he has included the sums which the Wife contributed post-August 2013.54Foot Note 54×Husband’s written submissions at para 48.After removing that amount, his calculations show that the Wife contributed about 60% in terms of direct financial contributions. (2) Indirect contributions 46 The parties’ positions are not far apart. The Husband submits that the ratio should be 60:40 between him and the Wife while the Wife submits that the ratio should be equal.55Foot Note 55×Joint summary at p 31. 47 I note that this is a not a typical marriage because the parties do not have any children. Thus, there was no need for either or both of them to take the role of a caregiver. The traditional division of labour between the breadwinner and the homemaker does not apply here at all. Instead, both parties were very much focused on their careers. I accept that the Husband probably contributed more towards the payment of bills and other outgoing given his higher income, that he did household chores from October 2003 to August 2004 when he was searching for employment and that he cared for the Wife and her family to the best of his ability. On the other hand, I also accept that the Wife supported the Husband when he first moved to Singapore, that she took care of the expenses when the Husband was unemployed and that she cared for the Husband as well.56Foot Note 56×Joint summary at p 31.In the circumstances, I do not think that this Court can meaningfully conclude that either party contributed to a greater extent than the other. Thus, the ratio of indirect contributions shall be 50:50. (3) Division of the property 48 The average of the ratios of direct and indirect contributions is 55:45 between the Wife and the Husband. The Husband submits that he should be granted a larger share of this property because the Wife was entitled to occupy it rent-free since March 2013, which is a relevant factor under s 112(2)(f) of the Women’s Charter. This submission however fails to take into account the reality that the Wife spent most of her time in China after the date of separation. Thus, she could not have physically occupied the property. Whether she should have rented this property out during this period is a separate issue and has been addressed above at [40]. The Wife is thus entitled to 55% of the net value of this property (see [21] above), which is $308,632.04. Marina property 49 The parties have made extensive submissions on their respective contributions to the acquisition of this property. Unfortunately, this property carries a negative value. Thus, the court is in effect dividing a liability instead of an asset. 50 The Husband submits that his direct contributions to this property amounts to around 80% while his indirect contributions amount to 60%. As a result, he should, in normal circumstances, be entitled to 70% of the property. However, since this property carries a negative value, he submits that the outstanding liability should be apportioned in a ratio inverse to the parties’ contributions. In other words, he should bear only 30% of the outstanding liability on the property.57Foot Note 57×Husband’s written submissions at paras 79; 83–88.On the other hand, the Wife submits that her direct and indirect contributions to the acquisition of this property amounts to 50%.58Foot Note 58×Joint summary at pp 28 and 31.Presumably, it is her position that the outstanding liability should be shared equally between the parties as well. 51 In my judgment, it would be just and equitable for the parties to bear the outstanding liability on this property equally. The Husband accepts that this property was intended to be a “joint investment” by the parties. He states that he had “strong misgivings” about the acquisition of this property, and only agreed to it after the Wife had “promised to pool her finances with him to purchase the property”, and most importantly, “to share and profits and losses equally”. In the light of the nature of this investment and the parties’ understanding at the time of acquisition, I find it fair for the parties to bear the loss equally. 52 I should also point out that the Husband’s proposed approach would entail a lose-lose proposition for the Wife. Under the Husband’s approach, he would be entitled to 70% of the property if it bore a positive value (under theANJ v ANKstructured approach) but liable for only 30% of any outstanding liability if the property bore a negative value. Either way, he would be in a better position than the Wife. This would be inconsistent with the parties’ agreement that profits and losses relating to the acquisition of this property should be shared equally. 53 The outstanding liability of $880,265.32 shall be borne equally between the parties. As agreed, the cost of obtaining the latest valuation shall also be shared equally. Other assets 54 The remaining assets to be divided are as follows: AssetNet Value ($)Joint NamesUOB account -55730.29UOB account -69484.12Wife’s $300,000 investment (taken from UOB account -5573)300,000.00Sub-total for net value of assets in joint names300,004.41Husband’s NameCPF accounts274,275.29AIA policy -65690UOB account -22470UOB account -219283.16OCBC account -10013,483.95POSB account -202424.63BOC account -937120,004.93TD account -27983,218.65Sub-total for net value of assets in the Husband’s name301,090.61Wife’s NameCPF accounts240,487.60UOB account -306793.83POSB account -262926.85DBS account -450140.00Arrears of MCST fees-5,402.33Sub-total for net value of assets in the Wife’s name235,245.95Total PoolGrand Total836,340.97 55 The parties’ direct contributions are therefore: Husband ($)Wife ($)Assets in joint names150,000.20150,000.20Husband’s name301,090.61-Wife’s name-235,245.95Total451,090.81385,246.15Ratio0.539 (or 0.54)0.461 (or 0.46) 56 I have found that the parties have made equal indirect contributions: see [47] above. Thus, the parties’ contributions in relation to these assets are: Husband (%)Wife (%)Direct Contributions5446Indirect Contributions5050Average ratio5248 57 The Husband is thus entitled to $451,092.82 worth of these assets while the Wife is entitled to $385,248.16 worth of these assets. The parties should work out the consequential orders. The orders should be drafted on the basis thatthe Wife must account for the full sum of $300,000 alone, even though I have attributed this sum jointly to the parties in assessing their direct contributions (on the basis that the sum was taken from the parties’ joint bank accounts). If they are able to agree on the consequential orders, they may send a draft to the court for approval, indicating their consent, before extracting the orders. The parties are to have liberty to apply within three months of the date of this judgment in the event that they require further directions. Alleged dissipation of assets and adverse inference 58 The Wife has made numerous allegations against the Husband, stating that he has dissipated and concealed assets of almost $2,000,000. A rough breakdown can be found below:59Foot Note 59×Wife’s written submissions at paras 24–28. (a) $836,728 transferred from the Husband’s bank accounts to Canada and China; (b) $283,000 transferred from the Husband’s bank accounts to other bank accounts; (c) $228,437 worth of “other hidden assets in Singapore between April to December 2017”; and (d) $500,000 worth of assets “pending verification”. 59 In my view, none of these contentions are made out. I shall start with (b). The Wife’s complaint is that the Husband had transferred $283,000 from his Standard Chartered account to his HSBC account “without explaining the usage”.60Foot Note 60×Wife’s written submissions at para 24(n).It is difficult to see how the mere shifting of moneys between accounts justifies an allegation of dissipation or an adverse inference. As long as the moneys are not spent, they can be accounted for. 60 I move on to (d). The claim under this head was “pending verification” was because it was subject to an application for discovery and interrogatories by the Wife. The Wife took the view that the documents she had applied for and the questions which she sought to put to the Husband would establish her case. The Wife’s application was dismissed by an Assistant Registrar of the Family Justice Courts (“the AR”), who found that:61Foot Note 61×Certified transcript (SUM 3232 of 2018) dated 25 October 2018 at pp 32–33. (a) the Wife’s application for discovery was an abuse of process; (b) some of the documents sought were not in the Husband’s possession, custody or power; (c) the Husband’s position and evidence is adequately set out in his affidavits; and (d) the interrogatories sought were impossibly broad, irrelevant unnecessary. 61 The Wife appealed against the decision of the AR. At the hearing of the appeal before me, counsel for the Wife indicated that she was no longer pursuing the interrogatories she had initially sought. As for the documents applied for in her discovery application, she stated that she would only be seeking documents relating to the property adjustments for 2014 and 2015. After hearing the submissions, I dismissed the appeal as I agreed with the AR’s reasons.62Foot Note 62×Minute sheet (RAS 29 of 2017) dated 21 December 2018 at p 7.The Wife thus has no basis to claim that the Husband was hiding assets worth $500,000. 62 As for (c), the Wife’s allegation that the Husband was hiding $228,347 worth of assets in Singapore is also premised on her discovery application,63Foot Note 63×Wife’s supplemental affidavit dated 27 September 2018 (not admitted for the purpose of the hearing).which was dismissed. Thus, this allegation is not supported by evidence as well. 63 I now address the Wife’s allegations at (a). This comprises various alleged transfers to the Husband’s family from March 2013 for various purposes such as vacations, medical treatment and loan repayments.64Foot Note 64×Wife’s written submissions at para 24.Save for a few items, these allegations are not supported by evidence. The Wife had applied earlier to file a supplemental affidavit to address these allegations, but her application was dismissed by the AR, who found that: … The vast majority of the affidavit was comprised of submissions or was an attempt to rehash [the Wife’s] earlier positions, and in some instances, even contained evidence as to without prejudice negotiations between the parties. Further, the affidavit failed to set out substantive evidence which [the Wife] said she had in her possession, such as call recordings and transcripts of such recordings. This is impermissible… 64 Nevertheless, the AR permitted the Wife to file an affidavit addressing specific and limited issues, namely the Husband’s alleged “false document of dental expenditure” and his “false statement and documents of his usage of concealed assets in Canada”.65Foot Note 65×Certified transcript (SUM 3232 of 2018) dated 25 October 2018 at pp 34–35.The Wife did not appeal against the AR’s decision. Thus, most of her allegations at (a) are not supported by evidence. 65 However, as mentioned, the AR did allow the Wife to adduce some evidence of the Husband’s alleged dissipation. These are:66Foot Note 66×Wife’s ancillary affidavit dated 12 November 2018. (a) $74,000 spent on burial plots; (b) $155,944 remitted to the Husband’s sister in Canada for the purchase of a property; and (c) $50,000 spent on a family vacation. 66 The Husband does not deny these expenditures.67Foot Note 67×Husband’s ancillary affidavit dated 15 November 2018.I accept that these expenditures are rather high, even for a person who earns more than $20,000 a month. I also accept that the sum remitted to the Husband’s sister is suspicious, given that the transfer was made in March 2013, when the Husband moved out of the matrimonial home. 67 Nevertheless, in the exercise of my discretion, I will not draw an adverse inference against the Husband. This is because the Husband’s earnings after the date of separation do not form matrimonial assets: see [26] and [32] above. I note that the Husband earns almost $300,000 a year. Thus, even if the Court were to find that the Husband had dissipated $836,726 since March 2013, that sum could be taken as having been earned after March 2013, and therefore would form no part of the matrimonial assets to be divided. The same applies to the Wife. Given that she had left for China to carry out business more than half a decade ago, it is inconceivable that she did not earn any income or had no bank account in China. Nevertheless, I decline to draw an adverse inference against her because assets amassed during her time in China after March 2013 form no part of the pool of matrimonial assets. Legal fees 68 The Wife has also requested for the parties’ legal costs in these proceedings to be “clawed back” into the pool of assets. The Wife states that she has incurred around $13,000 while the Husband has incurred around $230,000.68Foot Note 68×Wife’s letter to the court dated 10 May 2019.The Wife’s request is not wrong as a matter of principle. InAQT v AQU[2011] SGHC 138, the High Court held at [37] that: … It was highly unusual for the legal fees forthese very matrimonial proceedingsto be deducted from the pool of matrimonial assets. It would be an unwise precedent to allow parties to deduct their hefty legal costs from the pool of matrimonial assets. Whatever liability parties owe their solicitors for the matrimonial proceedings should be settledfrom their own shareof the matrimonial assets after division. To deduct the legal fees from thejointpool of matrimonial assets during the proceedings would be to render any cost order the Court made in the judgment largely nugatory. [emphasis in original] 69 Nevertheless, I will treat the sums spent on legal costs as having been earned after March 2013, since the statement of claim was filed on 22 May 2017. There is thus no need to notionally return the sums spent on legal proceedings back to the pool of assets.",
        "Maintenance for the wife": "70 The power of the court to order maintenance for former spouses is set out in s 113 of the Women’s Charter, while the factors relevant to determining the quantum of maintenance are stated in s 114. As for the applicable principles, the Court of Appeal held inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 at [13]: The overarching principle embodied in s 114(2) of the Act is that offinancial preservation, which requires the wife to be maintained at a standard, which is, to a reasonable extent, commensurate with the standard of living she had enjoyed during the marriage. [emphasis added] 71 The Wife graduated with a Bachelor of Applied Science from a university in Melbourne in 2000. She then graduated with a Master of Science (Information Systems) from a local university in 2009.69Foot Note 69×Husband’s affidavit of assets and means dated 27 September 2017 at p 71; Tabs 82 and 83. 72 Since the parties have no children, the Wife worked during the marriage. Her declared income in 2012 was more than $85,000.70Foot Note 70×Husband’s affidavit of assets and means dated 27 September 2017 at Tab 84.Further, according to the accounts of Company [A], a total of $96,000 was paid for “salaries and bonuses”71Foot Note 71×Wife’s voluntary affidavit dated 20 March 2018 at pp 273 283.from 22 August 2012 and 31 December 2013. Notably, the Wife was the only director of that company. In addition, based on the available bank statements, there were deposits amounting to more than $50,000 into the Wife’s personal bank accounts in 2017 which were marked as salary received.72Foot Note 72×Husband’s ancillary affidavit dated 21 June 2018 at p 89 and the references therein to Wife’s voluntary affidavit dated 20 March 2018.Large sums amounting to tens of thousands of dollars were also deposited from Company [A]’s bank account into the Wife’s personal bank accounts in 2017.73Foot Note 73×Husband’s ancillary affidavit dated 21 June 2018 at pp 90–91 and the references therein to Wife’s voluntary affidavit dated 20 March 2018.The Wife is therefore capable of earning substantial income. 73 The Wife now claims that she needs maintenance because her business ventures in China have failed. However, these ventures were undertaken after the date of separation. The Court of Appeal has also recognised that a maintenance order should not be made to “compensate parties for the vicissitudes of life”; a spouse should not be turned into a “general insurer of sorts” of the other spouse:ATE v ATD and another appeal[2016] SGCA 2 at [29]. Thus, the Husband ought not to bear the consequences of the Wife’s business decisions. 74 In the circumstances, I order that there be no maintenance for the Wife.",
        "Conclusion": "75 In light of the above, I order that: (a) the Wife is entitled to 55% of the net value of the River Valley property ($308,632.04); (b) the parties should bear the outstanding liability on the Marina property ($880,265.32) equally; (c) the Wife is entitled to $385,248.16 worth of the remaining assets while the Husband is entitled to $451,092.82; and (d) the Wife is not entitled to maintenance. 76 I encourage the parties to agree on the issue of costs, which includes considering the option of each party bearing its own costs. If there is no agreement, they are to file and exchange submissions on the issue of costs (limited to ten pages each) within 21 days from the date of this judgment. Tan Puay BoonJudicial Commissioner Wong Soo Chih and Cheng Hiu Lam Larisa (Ho Wong Law Practice LLC) for the plaintiff;Tan-Goh Song Gek Alice (A C Fergusson Law Corporation) for the defendant."
    }
}