{
    "case_title": "Law Chau Loon vAlphire Group Pte Ltd",
    "ncitation": "[2019] SGHC 275",
    "coram": "Vincent Hoong JC",
    "sections": {
        "Introduction": "1 The present case revolved around a judgment debt that was indubitably owed by the applicant to the respondent. According to the applicant, the parties entered into a binding settlement agreement in relation to the debt. The respondent denied the binding nature of such a settlement, and argued in the main that the parties who had entered into the purported settlement agreement lacked the authority to do so on its behalf. 2 Having considered the parties’ submissions, I found that the parties had entered into a valid and binding settlement agreement. The respondent has appealed against my decision. These are my reasons.",
        "Background": "",
        "The judgment debt": "3 The respondent company, Alphire Group Pte Ltd (“Alphire”), was incorporated in or around May 2012 by the applicant and one Alicia Chua Buan Ling (“Alicia”). At the time of Alphire’s incorporation, Alicia and the applicant were its only directors and shareholders.1Foot Note 1×Affidavit of Alicia Chua Buan Ling (“Alicia”) para 4.Of the 3,000 shares in Alphire, Alicia holds 2,000 shares, while the applicant holds 1,000 shares.2Foot Note 2×First Affidavit of Law Chau Loon (“LCL1”) para 9. 4 In 2015, Alphire commenced a suit in the High Court against the applicant, to recover sums which the applicant had collected on Alphire’s behalf as a director, but which he failed to account for (“the Suit”). In the Suit, Alphire’s claims were broken down into five categories, namely Categories A, B, C, D, and E. While the applicant admitted collecting the sums in Categories A and B, he denied ever collecting the sums in Categories D and E. As for Category C, it overlapped with Category B, and the two categories were thus analysed together:Alphire Group Pte Ltd v Law Chau Loon[2017] SGHC 297 (the “Judgment”) at [8]. 5 In his Judgment, Vinodh Coomaraswamy J held that the applicant was liable to Alphire for the Category A and B sums (the Judgment at [26] and [31]). However, as Alphire failed to make any submissions or tender any objective evidence to establish that the applicant had indeed collected the sums in Categories D and E (which he denied ever collecting), the learned judge held that the applicant was not liable for the sums claimed under Categories D and E (the Judgment at [32]–[33]). 6 As a result, the applicant was liable to pay the sums in Categories A (S$2,821,788.52) and B (S$3,083,429.22) to Alphire. To be deducted against these sums were payments that had been paid by the applicant to Alphire, which amounted to S$2,379,169.03. Hence, Alphire was entitled to S$3,526,048.71 and interest thereon (“the Judgment sum”) (the Judgment at [34]–[36]). However, Alphire’s claims under Categories D and E, which totalled S$1,298,478.77 (the Judgment at [9(c)]–[9(d)]),3Foot Note 3×See the Judgment at [9(c)] and [9(d)].failed in their entirety. 7 The applicant’s appeal against Coomaraswamy J’s decision was subsequently dismissed by the Court of Appeal.4Foot Note 4×Alicia para 6; LCL1 para 20.",
        "The alleged settlement agreement": "8 It was undisputed that the Judgment sum remained unsatisfied. However, according to the applicant, sometime on 2 February 2019, he met Han Seng Juan (“Han”), Dr Loh Kim Kang David (“David”) and Wong Kok Hoe (“Wong”) (collectively, “the Investors”). The Investors were directors of Centurion Corporation Limited (“Centurion”), an investment holding company listed on the Singapore Stock Exchange, and they were involved in Alphire as its investors.5Foot Note 5×LCL1 paras 11 to 12, pp 38 to 39. 9 During a meeting on 2 February 2019, the Investors and the applicant allegedly agreed to a full and final settlement in relation to the Judgment sum. Under the purported agreement, Alphire was to withdraw or withhold enforcement proceedings against the applicant, provided that he furnished and/or agreed to the following, in addition to the payment of S$1m:6Foot Note 6×LCL1 para 39. (a) payment of a further sum of S$400,000.00 in four (4) monthly instalments of S$100,000.00 each, the first instalment commencing on 1 June 2019, by way of four (4) post-dated cheques (the “Post-Dated Cheques”), to cover the legal fees incurred by Alphire in the Suit; (b) to the best of his knowledge, contact particulars of and all necessary information concerning other debtors of Alphire. Alphire would rely on such information to recover any alleged debts due to it and the applicant would not be involved in the debt-recovery process; (c) the transfer of his shareholding in Alphire to Alicia at no cost; and (d) a confirmation that he would have no further claims against Alphire. (collectively, “the Original terms”) 10 Alphire however denied having entered into the settlement agreement on the above terms. Following extensive discussions between the parties’ solicitors on the precise terms of the settlement agreement,7Foot Note 7×LCL1 pp 188, 195 to 222; Alicia paras 12 to 18.Alphire eventually took the view that the applicant had decided not to proceed with further settlement negotiations.8Foot Note 8×Alicia p 12, para (j). 11 Accordingly, Alphire regarded the S$1m that it had received from the applicant as partial satisfaction of the Judgment,9Foot Note 9×Alicia p 12, para (j).and proceeded to commence enforcement proceedings against the applicant.10Foot Note 10×LCL1 paras 85 to 86; pp 224 to 259. 12 Confronted with the enforcement proceedings and the impending risk of a bankruptcy application against him,11Foot Note 11×LCL1 para 88.the applicant took out the present Originating Summons, in which he sought, amongst other prayers, a declaration that the settlement agreement made on 2 February 2019 was valid and binding on Alphire. The applicant also sought a stay of all enforcement proceedings taken out by Alphire against him.12Foot Note 12×Originating Summons 730 of 2019.",
        "Parties’ submissions": "",
        "Applicant’s submissions": "13 The applicant asserted that the Investors had actual or apparent authority to enter into the settlement agreement on the Original terms on Alphire’s behalf on 2 February 2019.13Foot Note 13×Applicant’s Submissions (“AS”) paras 5 and 11. 14 As regards the Investors’ authority, the applicant submitted that the Investors had significant involvement in the management and operation of Alphire. For example, the Investors had agreed to invest about S$8m in Alphire around the time of its incorporation, and Alicia and the applicant would meet with the Investors at the premises of Centurion to discuss the management and operation of Alphire.14Foot Note 14×AS p 9, para 27.Given the Investors’ involvement, the applicant submitted that both the applicant and Alicia, who were then the directors of Alphire, answered to the Investors on the management, operations and profitability of Alphire. Both Alicia and the applicant also dealt with the Investors as their superiors, and thereby acknowledged that the Investors had the ultimate decision-making power in Alphire.15Foot Note 15×AS p 10, paras 31 to 32.Accordingly, the Investors had actual authority to make decisions on Alphire’s behalf.16Foot Note 16×AS p 10, para 33.Alternatively, the actions of the applicant and Alicia had clothed the Investors with apparent authority to make decisions on Alphire’s behalf.17Foot Note 17×AS pp 10 to 11, para 34. 15 Turning to the alleged settlement agreement, the applicant’s case was that the settlement agreement was made and crystallised on 2 February 2019, at the 2 February 2019 meeting between the applicant and the Investors.18Foot Note 18×AS p 21, para 81.The settlement agreement was based on the Original terms. While parties subsequently negotiated over the alleged terms in an attempt to vary the Original terms, the failed negotiations could not detract from the fact that the settlement agreement had been entered into on 2 February 2019.19Foot Note 19×AS p 23, para 92. 16 As such, the applicant sought an order recognising the valid and binding nature of the settlement agreement on the Original terms.20Foot Note 20×Originating Summons 730 of 2019 para 1; AS p 25, para 104.",
        "Alphire’s submissions": "17 In response, Alphire submitted that the Investors lacked both actual and apparent authority to enter into the settlement agreement on Alphire’s behalf.21Foot Note 21×Respondent’s Written Submissions (“RWS”) p 9, para 12.According to Alphire, the Memorandum and Articles of Association of the company provided that its business “shall be managed by the directors”. As Alphire did not expressly or impliedly authorise any of the Investors to act and/or to make decisions on its behalf, actual authority does not arise on the present case.22Foot Note 22×RWS p 10, para 14. 18 As for the Investors’ apparent authority, Alphire submitted that even if the Investors had agreed to invest funds in Alphire (which it denied), they were beneficial shareholders at best; at law, shareholders in general are unable to bind a company to business decisions. Furthermore, even if any of the Investors had been privy to Alphire’s management or operation, such did not amount to any representation by Alphire and/or Alicia that they were authorised to act and/or make decisions on Alphire’s behalf.23Foot Note 23×RWS pp 13 to 14, para 17(a). 19 In any case, Alphire’s case was that no binding settlement agreement had been entered into at the 2 February 2019 meeting. This could be seen by the applicant’s conduct subsequent to the 2 February 2019 meeting, which included: (a) In an email on 8 February 2019, which represented the first mention of any alleged settlement in respect of the Judgment, the applicant’s lawyer expressly marked the email as “Without Prejudice” and “Subject to Contract”.24Foot Note 24×RWS p 15, para 21(a). (b) Further, in a letter dated 8 February 2019 from the applicant’s solicitors to Alphire’s solicitors, the applicant’s solicitors stated that they had “no instructions with regard” to any offer of repayment to Alphire, and did not make mention of the alleged settlement agreement that was purportedly concluded at the 2 February 2019 meeting.25Foot Note 25×RWS p 17, para 22(c). (c) In subsequent correspondence between the parties’ solicitors, the applicant’s solicitors wrote that time was required for parties to “finalise the terms of the in-principle settlement”, suggesting that any settlement between the parties had not been finalised.26Foot Note 26×RWS pp 17 to 18, para 22(d)–(e). 20 Thus, Alphire submitted that the action had been brought by the applicant as an “afterthought[,] in an attempt to delay and/or avoid liability under the Judgment”.27Foot Note 27×RWS p 18, para 23.",
        "Issues": "21 From the submissions, the issues that arose for my consideration were: (a) First, whether the Investors had the authority to bind Alphire; and (b) Second, if the Investors had such authority, whether the parties had entered into a binding settlement agreement and, if so, what were the terms of the agreement.",
        "Authority of the Investors": "",
        "Actual authority": "22 I first considered whether the Investors had actual authority to bind Alphire to the settlement agreement. 23 While there was no document or resolution expressly showing that they were vested with such authority, implied actual authority exists “when it isinferred from the conduct of the parties and the circumstances of the case, such as when the board of directors appoint one of their numbers to be managing director. They thereby impliedly authorise him to do all such things as fall within the usual scope of that office” [emphasis added] (Hely-Hutchinson v Brayhead Ltd[1968] 1 QB 549, cited inSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another suit[2009] 4 SLR(R) 788 (“Skandinaviska(HC)”) at [30]). 24 As was held inFreeman & Lockyer (A firm) v Buckhurst Park Properties (Mangal) Ltd and another[1964] 2 WLR 618 (“Freeman”) at 634, “actual authority could have been conferred by the board without a formal resolution … But to confer actual authority would have required not merely the silent acquiescence of the individual members of the board, but the communication by words or conduct of their respective consents to one another and to [the alleged agent].” 25 In the affidavit of evidence-in-chief tendered by the applicant for the Suit in 2015 (the “2015 AEIC”), the applicant highlighted the significant involvement of the Investors. According to the applicant, Alicia had told him that the Investors had injected between S$7m to S$9m into Alphire.28Foot Note 28×LCL1 p 78, para 55.Alphire’s annual meetings for the years 2012 and 2013 were held at Centurion’s office, and were attended by the Investors, the applicant and Alicia. During those meetings, Alphire’s profit and loss statement for the year was discussed. According to the applicant, Alicia also shared Alphire’s monthly and annual profit and loss statements with Wong, who worked with Han and David, and whom Alicia referred to as “boss”.29Foot Note 29×LCL1 p 78 paras 53 to 54. 26 However, Alicia sought to downplay the involvement of the Investors. According to her, the Investors were merely her “personal friends”, and they did not have any authority to act or make decisions on behalf of Alphire. Such authority rested solely with Alicia, who was the sole director of Alphire following the applicant’s removal.30Foot Note 30×Alicia para 8.According to Alicia, the Investors had merely conveyed to her that the applicant hadproposeda settlement during the 2 February 2019 meeting,31Foot Note 31×Alicia para 12.and that it was her decision to agree to an in-principle settlement on Alphire’s behalf.32Foot Note 32×Alicia para 13. 27 Reviewing the evidence, it was patent that Alicia did not dispute the level of investment injected by the Investors, even though the applicant had clearly asserted in his affidavit for the present action that the Investors had agreed to invest about S$8 million in Alphire around the time of its incorporation.33Foot Note 33×LCL1 para 14(a).Furthermore, Alicia did not directly challenge the applicant’s assertion that she would “update the Investors on Alphire’s monthly and annual profit and loss statements”, and that she had “even referred to Wong as ‘boss’”. There was also no denial of the fact that Alicia and the applicant would meet with the Investors at the premises of Centurion to “discuss the management and operation of Alphire”.34Foot Note 34×LCL1 para 14(c)-(d).Furthermore, apart from Alicia’s affidavit, which did not directly contradict the various assertions made by the applicant, no other affidavits were tendered on Alphire’s behalf, be it by the Investors or otherwise. 28 To add credence to the applicant’s account of the Investors’ involvement, it was noteworthy that the applicant had made his assertions in his 2015 AEIC, long before the issue of the Investors’ authority surfaced. 29 The evidence thus showed that the directors of Alphire were in fact subservient to the Investors, who were directly involved in the management and operation of Alphire, and who were the ones whom the directors of Alphire answered and/or reported on issues relating to the management, operations, and profitability of Alphire. Given their significant involvement in the financial affairs of the company, it was unsurprising that the Investors would be vested with the implied actual authority to enter into a settlement agreement in relation to the outstanding Judgment sum that was owed to Alphire, and in which they, as Investors, would have a direct interest. 30 In my judgment, the correspondence between the parties’ solicitors was illuminating. On 8 February 2019, the applicant’s solicitors sent an email, which was marked “Without Prejudice” and “Subject to Contract”, to Alphire’s solicitors, alleging that “[o]ur respective clients have reached an in-principle full and final settlement of the judgment debt in respect of” the Suit.35Foot Note 35×LCL1 p 197. 31 In reply to the email, Alphire’s solicitors wrote on 12 February 2019 that “[w]e have likewise received instructions thatour respective clientshave reached anin-principle settlementin respect of matters arising from and/or in connection with” the Suit [emphasis added].36Foot Note 36×LCL1 p 195. 32 Subsequently, on 15 February 2019, Alphire’s solicitors wrote to the applicant’s solicitors, informing that “[w]e are instructed that the terms of thefull and final settlementof matters arising from and/or in connection with the Judgment that was reached betweenour respective clientson or around2February 2019are as follows…” [emphasis added].37Foot Note 37×LCL1 p 198, para 2. 33 Parties subsequently quarrelled over the precise terms of the “full and final settlement”. However, in their numerous correspondence, the authority (or lack thereof) of the Investors was never questioned or raised. Instead, the solicitors proceeded on the understanding that there had been an “in-principle” or “full and final settlement” entered into between their respective clients, being the applicant and Alphire, on2 February 2019. From Alicia’s affidavit, it was clear that theonlymeeting between the parties on or around 2 February 2019 was the 2 February 2019 meeting, which was attended by the Investors and the applicant, with the glaring absence of Alicia.38Foot Note 38×Alicia para 12. 34 That being the case, Alicia’s attempt to characterise the settlement on 2 February 2019 as a mereproposalwas not only unsupported by evidence from any of the Investors, but wascontradictedby the emails sent by Alphire’s own solicitors, who had characterised the 2 February 2019 meeting as culminating in a “full and final settlement of matters … between our respective clients”. 35 Indeed, it was also telling that the issue of the Investors’ authority was only raised for the first time on 17 May 2019, after multiple attempts to negotiate the terms of the settlement agreement were rebuffed by the applicant.39Foot Note 39×LCL1 p 221.Such a belated shift in position, after the parties had consistently been in consensus that a final settlement had been entered into at the 2 February 2019 meeting, suggested that the issue relating to the purported lack of authority was but a tactical decision to enable Alphire to distance itself from the settlement agreement. This was after it was unable to gain the applicant’s approval of the terms of the said agreement. 36 In the circumstances, I found that the Investors were vested with the implied actual authority to enter into the settlement agreement on Alphire’s behalf. I did not accept Alicia’s contrary explanation, by which she sought to downplay the Investors’ role in the company, as I found that it was plainly contradicted by the documentary evidence, as seen from the correspondence between the parties’ solicitors.",
        "Apparent authority": "37 Given my finding that the Investors had actual authority to enter into the settlement agreement on Alphire’s behalf, I did not think it was necessary for me to consider the issue of apparent authority.",
        "The settlement agreement": "38 The issue thus turned to whether there was in fact a settlement agreement entered into between parties and, if so, what were the terms of such an agreement. 39 For there to be a valid settlement agreement, there must be “an identifiable agreement that is complete and certain, consideration, as well as an intention to create legal relations” (Gay Choon Ing v Loh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332 (“Gay Choon Ing”) at [46]).",
        "An identifiable agreement that is complete and certain": "40 The first element is an identifiable agreement that is complete and certain. This “means that negotiations between the parties must have crystallised into a contractually-binding agreement in which there is no uncertainty as to the terms of the contract concerned” (Gay Choon Ingat [47]). 41 In determining whether the negotiations have culminated in a contractually-binding agreement, the concepts of offer and acceptance are to be applied, albeit with regard to thecontextin which the agreement was concluded (Gay Choon Ingat [63]). 42 An example of this dogmatic application of the traditional concepts of offer and acceptance can be seen in the Federal Court of Malaysia’s decision inThe Ka Wah Bank Ltd v Nadinusa Sdn Bhd[1998] 2 MLJ 350 (“The Ka Wah Bank”), which was regarded by the Court of Appeal inGay Choon Ingas a correct reflection of the court’s task, which entails looking at the “wholecourse of the negotiations between both parties in order to ascertain if an agreement is reachedat any given point in time” [emphasis in original] (Gay Choon Ingat [53]). 43 InThe Ka Wah Bank, the respondents contended that a suit between them and a bank had been compromised or settled as a result of an exchange of correspondence passing between their solicitors and an authorised agent of the bank. The respondents averred that the letters read as a whole constituted a binding agreement in full and final settlement. However, the bank denied that this was a valid compromise. Considering the chain of correspondence, the  Federal Court concluded that there was a valid compromise in the circumstances, on the basis oftwoletters which suggested that the bank would accept shares owned by the respondents as afull and final settlementof the sum owed. 44 The context in which parties allegedly arrived at a full and final settlement is thus of utmost importance. I therefore proceeded to consider the circumstances surrounding the 2 February 2019 meeting between the applicant and the Investors. Circumstances surrounding the 2 February 2019 meeting 45 According to the applicant, before 2 February 2019, he had begun communicating with Han, who spoke to him on behalf of the Investors and Alphire, with a view to compromise the Judgment sum.40Foot Note 40×LCL1 para 33.In a chance encounter with Han around the end of January 2019, the applicant asserted that Han informed him that Alphire and the Investors were willing to compromise the Judgment sum to the sum of S$1m.41Foot Note 41×LCL1 para 34. 46 Later, on 2 February 2019, Han arranged to meet the applicant at 1:00pm at the lobby of a local hotel.42Foot Note 42×LCL1 para 37; p 194.On that day, the applicant went to the hotel with S$1m in cash, which he carried in a paper bag.43Foot Note 43×LCL1 para 38. 47 At around 1:00pm on 2 February 2019, Han, who was accompanied by David and Wong, arrived at the hotel.44Foot Note 44×LCL1 para 38.The parties then conducted a meeting, whereby they allegedly agreed to a full and final settlement of the Judgment sum, and for Alphire to withdraw or withhold enforcement proceedings against the applicant, provided that he agreed to the Original terms, in addition to the payment of S$1m.45Foot Note 45×LCL1 para 39. 48 The applicant agreed to the Original terms, and he then handed the S$1m in cash to David, who then gave the monies to Wong.46Foot Note 46×LCL1 paras 40 to 41.At 1:41pm on the same day, Han then recorded the terms of the parties’ settlement in a WhatsApp message (“the WhatsApp Message”) which he sent to the applicant. The WhatsApp Message stated:47Foot Note 47×LCL1 para 42; p 194. We agree that if [the applicant] pays us S$1m (received on 2 February 2019) plus S$400,000 in 4 installments (sic) of S$100,000 each commencing 1st June 2019 (with cheques issued in advance) and provide all necessary information and contact particulars regarding the debtors owing amounts to Alphire and transfer his shares free of charge in the company to Alicia and confirms he has no claims against Alphire we will agree to the settlement and withdraw our bankruptcy petition. 49 Alicia did not challenge the accuracy of the above chain of events, save that she had “no knowledge of the events that allegedly took place between Han and [the applicant]”.48Foot Note 48×Alicia para 9.Neither did the Investors tender any evidence to refute the applicant’s version. Hence, this court was left with little to no evidence that contradicted the above chain of events. 50 The following also supported various aspects of the applicant’s version of events: (a) First, Alicia herself admitted that the applicant had paid S$1m to the Investors during the 2 February 2019 meeting.49Foot Note 49×Alicia p 5, para 12(a).This confirmed that there was indeed a 2 February 2019 meeting, and that the applicant had arrivedpreparedwith the sum of S$1m, thereby corroborating his version that there had beenpriordiscussions of a settlement in the sum of S$1m. (b) Second, Alicia confirmed that the general terms that had been worked out during the 2 February 2019 meeting were that:50Foot Note 50×Alicia p 5, paras 12(a) to 12(c). (i) the applicant would pay Alphire a total of S$1.4m, with S$1m paid upfront, and $400,000 in monthly instalments; (ii) the applicant would assist Alphire in the recovery of sums owed to Alphire by a number of debtors whom the applicant had dealt with whilst he was a director of Alphire, by providing all the necessary information to do so; and (iii) the applicant would transfer his shareholding in Alphire to Alicia at no cost, and would have no further claims against Alphire whatsoever. While Alicia asserted that these “general terms” were merely conveyed as a “settlement proposal”, and that the S$1m had been paid over by the applicant “as an indication of [the applicant’s] good faith” only,51Foot Note 51×Alicia p 5, para 12.what was significant was that they mirrored in substance the Original terms, as well as the WhatsApp Message. These terms were also repeated in the 15 February 2019 letter sent by Alphire’s solicitors to the applicant’s solicitors, although in the letter, further terms were sought to be introduced.52Foot Note 52×LCL1 pp 198 to 199. That the Original terms were repeated after the WhatsApp Message had been sent showed that they were the subject of concerted negotiations between the applicant and the Investors, and that the applicant did not conjure the Original terms unilaterally. (c) Thirdly and crucially, the 15 February 2019 letter sent by Alphire’s solicitors to the applicant’s solicitors clearly stipulated that they had been instructed that the “terms of the full and final settlement … that was reached between our respective clients on or around 2 February 2019 are as follows…”.53Foot Note 53×LCL1 p 198, para 2.Plainly, this amounted to anadmissionon Alphire’s part that afull and final settlementwas reached between the parties on or around 2 February 2019, and that the alleged “settlement proposal” was in fact a “full and final settlement” of the matters in relation to the Suit. 51 Viewed alongside the applicant’suncontradictedversion of events which culminated in his payment of S$1m to the Investors, it was clear that the Investors and the applicant had entered into a contractually-binding agreement on 2 February 2019. The terms of the settlement agreement were also clearly exhibited in Han’s WhatsApp Message to the applicant, which mirrored in substance the Original terms. Events subsequent to the 2 February 2019 meeting did not vary the terms of the settlement agreement 52 Nonetheless, Alphire referred to the conduct of the applicantsubsequentto the 2 February 2019 meeting, which it submitted detracted from a finding that any settlement agreement had been entered into.54Foot Note 54×RWS p 14, para 19. 53 In this vein, Alphire referred first to the 8 February 2019 email that the applicant’s solicitors had sent, which was expressly marked “Without Prejudice” and “Subject to Contract”. In that email, the applicant’s solicitors then set out the terms of the “in-principle agreement” which the parties had allegedly agreed to. The terms were in substance the Original terms.55Foot Note 55×LCL1 p 197. 54 Alphire referred to the Court of Appeal’s decision inBumi Armada Offshore Holdings Ltd and another v Tozzi Srl (formerly known as Tozzi Industries SpA)[2019] 1 SLR 10 (“Bumi Armada”), where the court observed at [21] that “[t]he convention that a clearly expressed ‘subject to contract’ stipulation in an arrangement, which would otherwise give rise to a contract as a matter of law, negatives the existence of such a contract, is very well established in both legal and commercial circles…”. Accordingly, Alphire submitted that the terms of the agreement between the parties were clearly still subject to contract, and the effect of the 2 February 2019 meeting was that no binding settlement had been concluded.56Foot Note 56×RWS pp 15 to 16, paras 21 to 22. 55 I did not accept Alphire’s submission. Inherent in its argument was thatnosettlement agreement had been reached on 2 February 2019. However, as Alphire had acknowledged by way of the letter sent by its own solicitors on 15 February 2019, which wasnotmarked as “Without Prejudice” or “Subject to Contract”, the respective parties had arrived at a “full and final settlement … on or around 2 February 2019”.57Foot Note 57×LCL1 p 198.As observed by the Court of Appeal inGay Choon Ingat [53]: … the courts look at thewholecourse of the negotiations between both parties in order to ascertain if an agreement is reachedat any given point in time. It should further be noted that where such a point is identified, the mere fact that negotiations are continuedthereafterdoes not of itself affect the existence of the agreementalready concluded. Of course, if the continued negotiations disclosean agreed rescissionof an agreement already concluded, then the position is quite different. [emphasis in original] 56 This was precisely the case inBumi Armada. In that case, the parties held a meeting on 31 July 2014 (“the 31 July Meeting”). The minutes for the meeting were subsequently prepared on 1 August 2014 (“the 1 August MOM”), and the 1 August MOM included a “subject to contract” stipulation. That being the case, the court held that the 1 August MOM could not create a legally binding obligation (Bumi Armadaat [23]). However, the testimony given at trial revealed that there had in fact been an unqualified oral agreement concluded at a 31 July Meeting. Hence, the court concluded that “there was a binding oral agreement as to the right of first refusal on 31 July 2014 notwithstanding the 1 August MOM.” Taking such a view, the 1 August MOM was effectively irrelevant, and there was no need to consider the effect of the “subject to contract” clause (Bumi Armadaat [26]). 57 In the present case, the parties had entered into a binding settlement agreement on the Original terms and as evidenced by the WhatsApp Message. It may have been that the “Subject to Contract” had been slipped in unintentionally, or that the applicant’s solicitors did not appreciate the significance of introducing such a clause in the header of their 8 February 2019 email. However, the effect of the 8 February 2019 email, and the subsequent correspondence between the parties in which they quarrelled over the precise terms of the settlement agreement, were strictly speaking irrelevant, as the applicant had never agreed to a variation of the Original terms. 58 In fact, the applicant’s solicitors stressed that Alphire had sought to introduce additional terms in its 15 February 2019 letter, which were terms the applicant did not agree to.58Foot Note 58×LCL1 pp 204, 208, 212.That being the case, the correspondence between the parties after 2 February 2019 did not amount to an agreed rescission of the settlement agreement that was already concluded on 2 February 2019. 59 The other documents relied on by Alphire also did not demonstrate a rescission of the 2 February 2019 settlement agreement. 60 In this regard, Alphire highlighted that the applicant’s solicitors had written to them on 8 February 2019 stating that they had “no instructions with regard” to any offer of repayment to Alphire. According to Alphire, this meant that “there was, in truth, no such Alleged Settlement”.59Foot Note 59×RWS p 17, para (c) and Annex D para 9.I did not accept this argument, as the 8 February 2019 letter was time-stamped 12:22.60Foot Note 60×RWS Annex D.Shortly thereafter, and on the same day, the applicant’s solicitors then sent the 8 February 2019 email, at 6:35pm (or 18:35), specifying that the parties had entered into an in-principle agreement on the Original terms.61Foot Note 61×LCL1 p 197.The 8 February 2019 letter therefore did not detract from the finding that a settlement agreement had been entered into on 2 February 2019; it was simply an accurate reflection of the state of the applicant’s solicitors’ knowledge (or lack thereof) at the time the letter was sent. 61 Next, Alphire referred to the applicant’s solicitors’ email dated 6 March 2019. In that email, the applicant’s solicitors requested a two week adjournment of an examination of judgment debtor hearing to allow “parties to finalise the terms of the in-principle settlement”. This allegedly constituted further proof that the terms of the settlement had not been finally settled on 2 February 2019.62Foot Note 62×RWS p 17, para (d) and Annex E p 2.In my view, the 6 March 2019 email should be read in its proper context. The email was the applicant’s solicitors’ reply to emails sent by Alphire’s solicitors on 15 and 18 February 2019, in which the latter had proposed that the terms of the settlement agreement constituted terms that exceeded the Original terms.63Foot Note 63×LCL1 p 198 and 203.Given the conflict between the parties as to the actual terms of the settlement agreement, the 6 March 2019 was thus an indication that more time was required to determine the actual terms of the settlement agreement. Subsequently, on 12 March 2019, the applicant’s solicitors sent a letter to Alphire’s solicitors, in which they confirmed that only the Original terms had been agreed to on 2 February 2019.64Foot Note 64×LCL1 p 204.This was then supported by a letter sent by the applicant’s solicitors on 28 March 2019, in which a copy of the WhatsApp Message was exhibited.65Foot Note 65×LCL1 pp 207 and 210.Hence, read in the proper context, it was clear that the email dated 6 March 2019 did not amount to a concession that there was no concluded settlement agreement entered into between the parties on 2 February 2019. 62 In totality, I was therefore satisfied that there was an identifiable agreement that was complete and certain which the parties had entered into at the 2 February 2019 meeting.",
        "Consideration and intention to create legal relations": "63 I was also satisfied that the other requirements necessary for the formation of a binding settlement agreement were present. 64 There was clear consideration, as the applicant had agreed to pay S$1.4m and the Original terms in exchange for Alphire’s agreement to a settlement of the outstanding Judgment sum, which exceeded S$1.4m. 65 The parties also intended to create legal relations by way of the settlement agreement arrived at during the 2 February 2019 meeting. This was clear as the WhatsApp Message, which evidenced the parties’ agreement on that day, was couched in legalistic terms, and reflected the quid-pro-quo that had been bargained for by the parties. 66 In summary, the Investors, on behalf of Alphire, had agreed to settle its outstanding dispute relating to the Judgment in exchange for S$1.4m and certain assistance from the applicant. This was clearly a business and commercial arrangement, where the presumption is that the parties had intended to create legal relations (Gay Choon Ingat [72]). No evidence or submission was tendered or made to rebut this presumption. Accordingly, I also found that this requirement was satisfied. 67 In the circumstances, all three requirements required for there to be a binding settlement agreement were established.",
        "Conclusion": "68 Accordingly, I granted the application and made the orders prayed for by the applicant. 69 Having heard the parties on the issue of costs, I awarded the applicant S$7,500 for the costs (inclusive of disbursements) of the present action, to be paid by the respondent.66Foot Note 66×Minute Sheet (18 September 2019), p 2. Vincent HoongJudicial Commissioner Lim Tahn Lin Alfred and Lee Tat Weng, Daniel (Fullerton Law Chambers LLC) for the applicant;Reuben Tan Wei Jer and Daryl Tan Teck Hong (Quahe Woo & Palmer LLC) for the respondent."
    }
}