{
    "case_title": "Red Star Marine Consultants Pte Ltd vPersonal Representatives of the Estate of Satwant Kaur d/o Sardara Singh, deceased and another",
    "ncitation": "[2019] SGHC 22",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1 The plaintiff is in the business of marine consultancy. It claimed $1,741,812.03 (“the Sum”) from the first defendant who is the personal representative of the estate of Satwant Kaur d/o Sardara Singh, deceased (“the Deceased). I will refer to the personal representative of her estate as “D1”. The plaintiff also included a sister of the Deceased, Manjit Kaur d/o Sardara Singh as the second defendant (“D2”) in the action. The plaintiff’s claim was reduced to $1,633,875.20 during closing submissions. I set out the allegations of the plaintiff below. 2 The Deceased was the personal secretary of Mr Dhanvinder Singh s/o Karam Singh (“DS”), the managing director of the plaintiff. DS and the Deceased were the only employees of the plaintiff and DS, who was frequently away from Singapore, trusted her. DS and his wife (“Kathelene”) were the two directors and shareholders of the plaintiff but Kathelene did know much about the business of the plaintiff. She did not not work at the plaintiff’s office and    came to the plaintiff’s office only occasionally when called upon to do so by DS. 3 The plaintiff’s case was that between 2005 and 2012, the Deceased had fraudulently obtained various sums of money which amounted to the Sum in aggregate. She did this by getting DS to sign cash cheques which she then either encashed or deposited into her own personal bank account. She misled DS into thinking that the cash cheques were meant for payment to third party service providers which the plaintiff had engaged.  The plaintiff referred to these third party service providers as vendors or contractors and, for convenience, I will use the word “vendors”. 4 The fraud was only discovered after the plaintiff had moved its office on or about 29 August 2012. On or about 5 September 2012, the Deceased was not around. Kathelene was helping out in the move and she was unpacking at the new office when she discovered incriminating documents against the Deceased, for example, the Deceased’s insurance policies, bank passbooks and other documents pertaining to properties of the Deceased indicating that the Deceased had substantial wealth. 5 Kathelene informed DS, who was not in Singapore then, of this discovery. When DS returned to Singapore, he went to the plaintiff’s new office on or about 7 or 8 September 2012 to look at the incriminating documents. He left Singapore on or about 8 September 2012 and told Kathelene not to allow the Deceased entry into the new office. 6 On 14 September 2012, Kathelene attempted to gain entry into the new office but the lock(s) had been changed. From her inquiries with neighbouring occupants, she believed that the Deceased and D2 had got a locksmith to change the lock(s) and gained entry. Kathelene called the police to report the incident. Kathelene’s evidence was that many documents were missing. 7 On 14 September 2012, the Deceased made a police report to explain why she got the lock(s) of the new office changed. She also sent her letter of resignation to the plaintiff by post. 8 On 15 September 2012, DS made a police report of the Deceased’s fraudulent activities. Thereafter, the police commenced investigations. 9 In statements given by the Deceased to the police, she admitted that she had received various sums of money from the plaintiff. However, she alleged that this was with the consent of DS who was the one who instructed her what to state on payment vouchers for the cheque payments and to prepare the cash cheques. Some of the money was paid as some sort of commission to her. In any event, she was entitled to use the money as she thought fit. DS had wanted to evade Goods and Services Tax and income tax. Also he had not wanted Kathelene to know that the plaintiff was making huge profits and their marriage was on the verge of divorce. The Deceased had used the money to buy insurance policies and properties and DS was aware of her properties. When DS needed money, he would ask the Deceased to withdraw money from her personal account to lend to his friends or for his own use. DS had also demanded that she buy expensive items for him. 10 The Deceased was eventually charged with criminal breach of trust (“CBT”). According to the plaintiff, she faced eight charges for CBT. Two other charges were irrelevant to the present claim. The exhibits relied on by the plaintiff showed eight amended charges each dated 5 May 2015. D1 alleged that the Deceased was initially charged in October 2014. 11 In any event, the Deceased was eventually granted a discharge not amounting to an acquittal in January 2016. 12 The Deceased died from cancer on 8 May 2016 at the age of 49 years. 13 On 8 June 2016, the plaintiff filed the present action. There was no prior letter of demand sent to the Deceased or D1. There was a Disposal Inquiry on 12 and 17 January 2017. On 17 January 2017, the plaintiff applied for and obtained a Mareva injunction against D1 to restrain D1 from disposing of assets up to $2 million. 14  Ten months after the commencement of the action, the plaintiff joined D2 as the second defendant in the action. The basis of this claim was that D2 had used money from the Deceased to buy two properties, one of which she was holding as a joint tenant with the Deceased. The plaintiff alleged that D2 knew that the money was wrongfully obtained by the Deceased from the plaintiff. D2’s defence was that the two properties were bought using her own money and that, in any event, she was not aware that any money from the Deceased came from the plaintiff. 15 The main issue on liability was whether the Deceased had fraudulently taken the money without the consent of DS. Kathelene and DS were the witnesses for the plaintiff. DS was the main witness for the plaintiff and his credibility was all important on this main issue. 16 As the Deceased had already passed away, she could not give evidence to defend herself. D1’s evidence was based primarily from statements which the Deceased had given to the police. D1 also called witnesses some of whom testified that they had heard DS saying in the past that he had given the Deceased a lot of money. D2 gave evidence for herself. 17 DS’ position was that each time that he had been asked by the Deceased to sign a cash cheque, the cheque would be accompanied by a payment voucher and an invoice from a vendor. The Deceased had misled him into thinking that the cheque was to pay for that invoice and that the vendor had requested for a cash cheque to be issued. In other words, he had thought that the cheque was to make payment for a genuine purpose. 18 Using the figures from the eight charges which had been pressed against the Deceased, DS presented a table of the sums of money wrongfully taken by the Deceased from the plaintiff. The money was either in the currency of Singapore or the United States of America. I will convert those in the latter currency based on an agreed exchange rate of US$1=S$1.43 and add that to the amount taken in Singapore currency to make the points below. 19 The figures from the eight charges showed that the Deceased had taken the following amounts from the plaintiff: (a)From February 2006 - December 2006about S$180,000(b)From January 2007 - November 2007about S$340,000(c)From January 2008 - November 2008about S$345,000(d)From January 2009 - November 2009about S$370,000(e)From March 2010 - December 2010about S$240,000(f)From January 2011 - December 2011about S$150,000(g)From January 2012 - August 2012about S$  89,000 20 As mentioned above, the Deceased had admitted that she had received various sums of money from the plaintiff. Indeed, she had set out the various sums in detail and, apparently, the sums in the charges and which were the subject of the plaintiff’s claim were based on figures which she had provided to the police. 21 DS said that as a private exempt company, there was no requirement for its financial statements to be audited. However, the plaintiff had engaged the services of an outside accountant, by the name of Jabbar, to prepare its financial statements. DS had signed the financial statements each year. According to DS, the money which the Deceased had wrongfully taken from the plaintiff was hidden under an expense item called “Survey Charges”. In other words, money which she had wrongfully taken was treated in the accounts as part of “Survey Charges” and this item or expense was wrongly inflated accordingly. Consequently, the profit for each of the years was correspondingly reduced. The “Survey Charges” and the profits before tax for the years in question were: YearSurvey ChargesProfit before Tax2006$342,829$20,2012007$443,943$27,0062008$370,189$29,3852009$358,549$20,4082010$327,006$14,7762011$747,650$43,0392012$907,615$49,910 22 As can be seen, the amounts which the Deceased had received for each of the five years from 2006 to 2010 was more than half of the “Survey Charges”. Indeed, in 2008, the amount she had received was more than 90% of the “Survey Charges”. In 2009, the amount she received was even more than the “Survey Charges”. 23 In addition, the amounts which she had received for each of the five years from 2006 to 2010 far exceeded the profit before tax by about nine to ten times or even more than ten times. 24 DS had admitted that even though he was busy, he would have had an idea of the revenue, expense and profit of the plaintiff. Initially, during the trial, he said that before he signed the financial statements for each year, he would have looked at the amount for the “Survey Charges”. 25 In my view, he would have realised that the “Survey Charges” could not have been so high if indeed he was initially unaware that she had inflated such charges. 26 Subsequently, during the trial, DS said that he looked at the profit figures only. Even if he had looked at the profit figures only, it could not have escaped his attention that the profit figure for each year, especially for the five years from 2006 to 2010, was much lower than what he would have expected them to be. In other words, he would have realised that the profits could not have been so low and something was amiss, if indeed it were true that the Deceased had taken the money without his consent. 27 Unfortunately for the plaintiff, DS could not give any adequate explanation as to why he was unaware that something was amiss in the light of the profit figures stated in the financial statements. 28 There are other aspects of the evidence which suggest that DS was not a truthful witness but it is at present unnecessary to elaborate on them. 29 I am of the view that DS was not a truthful witness on the main issue. It is clear to me that he knew and had consented to the money being taken by the Deceased. It is irrelevant whether in fact the arrangement between them was that the Deceased was to hold the money in trust for him as no such arrangement was pleaded by the plaintiff. 30 The question of limitation or a time bar raised by D1 is academic. 31 It is also irrelevant whether D2 had the financial ability and did in fact make all of certain payments for the two properties in question, as alleged by her, although I find D2 to be an untruthful witness on some aspects of her evidence about her financial ability. It is also irrelevant whether D2 knew that any money from the Deceased which was used to pay for the two properties had come from the plaintiff, although it is likely that she must have known this, whether or not the money was wrongly received by the Deceased from the plaintiff. 32 In the circumstances, I dismiss the plaintiff’s claim against D1 and D2. 33 I will hear the parties on costs. Woo Bih LiJudge Mahmood Gaznavi s/o Bashir Muhammad (Mahmood Gaznavi & Partners) for the plaintiff;Satwant Singh s/o Sarban Singh (Satwant & Associates) for the 1st defendant;Lim Tahn Lin, Alfred and Lye May-Yee Jaime (Fullerton Law Chambers LLC) for the 2nd defendant."
    }
}