{
    "case_title": "CBB vLaw Society of Singapore",
    "ncitation": "[2019] SGHC 293",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The applicant seeks judicial review of the decision of the respondent not to refer for investigation and scrutiny a series of complaints made by him in respect of the conduct of a lawyer, who was involved in various transactions involving the applicant’s mother.",
        "Background": "2 The applicant’s mother, whose mental capacity was put in issue in proceedings under the Mental Capacity Act (Cap 177A, 2010 Rev Ed) (“MCA”), purportedly established a trust pursuant to the advice of a lawyer, whom I will refer to as “Mr L”. The facts were the subject matter of litigation, culminating in the Court of Appeal’s decision inRe BKR[2015] 4 SLR 81 (“BKR”). Mr L is the same person that is referred to by the same abbreviation inBKRat [21]. 3 In summary, the Court of Appeal found that the applicant’s mother suffered from a mental impairment. It concluded that she did not have the capacity to make two sets of decisions: (a) the establishment of a trust sometime around 26 October 2010; and (b) the requested transfer of her assets from two banks to a third bank with which the trust was created (BKRat [17]). Both of these sets of decisions were found to have been tainted by the undue influence of some of the applicant’s mother’s relatives. Mr L had advised the applicant’s mother on the establishment of the trust (BKRat [22]–[23]), and had also spoken on behalf of the applicant’s mother in meetings that took place in November 2010 and December 2010 with the banks from which her assets were to be transferred (BKRat [26]–[36]). Mr L also did work for the applicant’s mother in relation to the MCA proceedings inBKR, which were commenced on 18 February 2011, up until 21 November 2014.1Foot Note 1×Applicant’s first affidavit at pp 236–272.Following the Court of Appeal’s decision, professional deputies were appointed to act for the applicant’s mother on 18 December 2015. 4 On 17 April 2018, the applicant here filed a complaint with the respondent in respect of Mr L’s conduct relating to the establishment of the trust, the transfer of assets and the conduct of the MCA proceedings (see [3] above).2Foot Note 2×Applicant’s first affidavit at pp 51–80.To forestall the possibility that the subject matter of the complaint would be time-barred under s 85(4A) of the Legal Profession Act (Cap 161, 2009 Rev Ed) (“LPA”), reasons were set out in the complaint for the Council of the respondent should it be required to apply for leave under s 85(4C) of the LPA. 5 As it were, the Council of the Law Society (“the Council”) declined to apply for leave of court under s 85(4C) of the LPA to refer to the Chairman of the Inquiry Panel (“the Chairman”) the portions of the complaint relating to matters that arose more than six years prior to the date of the complaint.3Foot Note 3×See Tab 6 of the Applicant’s Bundle of Relevant Correspondence.Only matters in the six year time period (ie, between 17 April 2012 and 17 April 2018) were referred to the Chairman, who then constituted a Review Committee (“the RC”) under s 85(5) of the LPA to review those portions of the complaint.4Foot Note 4×See Tab 1 of the Applicant’s Bundle of Relevant Correspondence. 6 On 10 July 2018, the RC, pursuant to s 85(8) of the LPA, directed the Council to dismiss the portions of the complaint relating to conduct by Mr L occurring before 17 April 2012, while conduct after that date was referred back to the Chairman.5Foot Note 5×Applicant’s affidavit at pp 278–280.An Inquiry Committee was then constituted to inquire into the complaint. 7 The RC’s decision was communicated to the complainant via letter on 12 July 2018 (“the 12 July Letter”), with the RC’s report attached.6Foot Note 6×See Tab 3 of the Applicant’s Bundle of Relevant Correspondence.Paragraphs 9, 16 and 17 of the report are important and are set out here in full for convenience: 9. The [RC] notes that all matters relating to the Trust took place prior to 17 April 2012 and accordingly fall outside the period contemplated by section 85(4A) of the [LPA]. Accordingly, these particular complaints ought to be dismissed on this basis. … 16. … [T]he [RC] is unanimously of the view that the Complainant’s complaints on matters relating to the Trust lack substance because of section 85(4A) of the [LPA] as the said complaints relate entirely to conduct that took place more than 6 years prior to the date of the Complaint. The [RC] humbly directs the Council to dismiss these complaints. 17. … the [RC] is unanimously of the view that in relation to the complaints about [Mr L’s] conduct in respect of [the MCA proceedings] … such complaints should be referred back to the [Chairman] but only in relation to conduct that took place after 17 April 2012. Paragraph 6 of the 12 July Letter is also relevant, stating: As required under section 85(9) of [the LPA], the Council must give effect to the direction of the RC to dismiss a certain aspect of your complaint against [Mr L] as well as furnish you, the Complainant with the reasons in writing … 8 Follow-up correspondence ensued, with the applicant attempting to persuade the Council to apply for leave of court under s 85(4C) of the LPA.7Foot Note 7×See Tab 4 of the Applicant’s Bundle of Relevant Correspondence. 9 In a letter dated 16 August 2018 (but which was apparently only received by the applicant on 4 October 2018) (“the 16 August Letter”), the Council informed the applicant of its reasons for declining to apply for leave under s 85(4D) of the LPA:8Foot Note 8×See Tab 6 of the Applicant’s Bundle of Relevant Correspondence. …We note that the establishment of the Trust took place around 26 October 2010. Any complaints relating to the establishment of the Trust would be brought before 20 October 2016. The Court of Appeal delivered its judgment on the issue of [the applicant’s mother’s] mental disability on 19 May 2015. There was thus more than a year left after the issue of the Court of Appeal judgment (if the same is relevant to the intended complaint) for persons interested to take steps to make the complaint. However, no complaints were brought before the expiry of the time limitation. We also note that you are making this complaint in your own personal capacity. There is thus no reason for Council to apply to Court for leave pursuant to section 85(4D) of [the LPA]. 10 This prompted the applicant to commence the present judicial review proceedings on 13 November 2018. 11 In January 2019, it was determined by the Inquiry Committee that no formal investigation was necessary and it recommended that that portion of the complaint referred to it should be dismissed.9Foot Note 9×Applicant’s reply affidavit at pp 26–30.Judicial review of this decision is sought by the applicant in Originating Summons No 470 of 2019, but those proceedings were put in abeyance pending the determination of the present application. 12 At the hearing on 15 July 2019, the application was considered on a “rolled-up” basis, but the respondent was given an opportunity for further submissions, with a final reply from the applicant.",
        "Summary of the applicant’s case": "13 The applicant argues that its application in respect of a quashing order was filed in time; it was filed within three months of the impugned decision of the Council, which was made on 16 August 2018, as required by O 53 r 1(6) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”).10Foot Note 10×Applicant’s submissions at para 78.Alternatively, an extension of time ought to be granted by the court.11Foot Note 11×Applicant’s first affidavit at paras 144–148. 14 The applicant contends that leave should be granted for the application. The applicant has exhausted all alternative remedies. The Council’s decision not to refer the portions of the applicant’s complaint concerning Mr L’s actions occurring more than six years before the date of the complaint is susceptible to judicial review. The applicant also has standing to bring judicial review proceedings. Finally, there is aprima faciecase of reasonable suspicion in favour of granting the remedies sought. 15 As for the substantive application, the applicant identifies two decisions which he argues should be the subject of a quashing order and/or a mandatory order: (a) First, if the Council is required to seek leave of court under s 85(4A) of the LPA to refer the complaint to the Chairman, the Council’s decision not to apply to court for such leave.12Foot Note 12×Applicant’s submissions at para 133(a). (b) Second, if the Council is not required to seek leave of court under s 85(4A) of the LPA to refer the complaint to the Chairman, the decision of the RC to direct the Council to dismiss part of the applicant’s complaint in its report dated 10 July 2018.13Foot Note 13×Applicant’s submissions at para 133(b). 16 The relevant decision for the purposes of the present proceedings would thus turn on whether s 85(4A) of the LPA imposed a requirement on the Council to apply for leave to refer the complaint to the Chairman. The applicant claims that leave was not required. Section 85(4A) of the LPA should be read with s 24 of the Limitation Act (Cap 163, 1996 Rev Ed) (“LA”). Alternatively, the actions of Mr L can be construed as a single continuous course of conduct. Finally, the exception for fraud in s 85(4A)(b) of the LPA applies. 17 The grounds of judicial review relied upon by the applicant varied depending on whether the decision of the Council or the RC was the relevant one. The Council’s decision was challenged on the grounds of illegality, irrationality and procedural impropriety.14Foot Note 14×Applicant’s submissions at para 176.The RC’s decision appears to be challenged on the grounds of illegality and irrationality.15Foot Note 15×Applicant’s submissions at paras 261–272. 18 The applicant’s arguments are discussed in greater detail below at [42]et seq.",
        "Summary of the respondent’s case": "19 The respondent argues that the application for judicial review should be denied. The application was made outside the three-month period prescribed under O 53 r 1(6) of the ROC as the Council’s decision was made on 23 May 2018. The applicant should account for his delay in seeking judicial review.16Foot Note 16×Respondent’s further submissions at para 2. 20 Leave of court was required under s 85(4C) of the LPA.17Foot Note 17×Respondent’s further submissions at paras 4–5.The Council chose not to seek leave under s 85(4C) of the LPA. Conduct by Mr L in relation to the establishment of the trust, as well as work done in relation of the MCA proceedings prior to 17 April 2012 were not referred to the Chairman. 21 The applicant’s arguments that s 85(4A) of the LPA should read with s 24 of the LA are not sound. There is no incorporation or reference to s 24 of the LA in s 85 of the LPA.  In any event, s 24 of the LA only allows the person under disability to bring the matter up, and does not benefit the applicant.18Foot Note 18×Respondent’s further submissions at paras 18–19.The term “conduct” should not be given an expanded meaning as argued for by the applicant, as the relevant conduct is that of the establishment of the trust. The subsequent acts are consequences flowing from the establishment. Otherwise, uncertainty would be caused.19Foot Note 19×Respondent’s further submissions at paras 20–21.The term “fraud” in s 85(4A) of the LPA does not extend to undue influence, and only covers theDerry v Peek(1889) LR 14 App Cas 337 (“Derry v Peek”)type of fraud.20Foot Note 20×Respondent’s further submissions at paras 27–29. 22 As regards the substantive grounds for judicial review, the respondent argues that there is no justification for the court to impugn the decision-making process of the Council or the RC. There was no duty on the part of the Council to give reasons for its decision.21Foot Note 21×Respondent’s further submissions at para 39.Judicial review is only limited to the decision-making process:Chee Siok Chinand others v Minister for Home Affairs and another[2006] 1 SLR(R) 582 (“Chee Siok Chin”). Here, the Council did not abdicate its discretion on whether to apply for leave under s 85(4C) of the LPA to the RC, which did not purport to exercise any such discretion. The Council had referred to relevant factors in arriving at its determination including the fact that the complaint could have been made earlier, and that the complaint was made by the applicant in his personal capacity.22Foot Note 22×Respondent’s further submissions at para 43.There was also no procedural impropriety.23Foot Note 23×Respondent’s further submissions at para 52.",
        "Decision": "23 I am satisfied that the application should be granted. An extension of time can be granted to allow the judicial review application to be made. Leave was required from the court for the complaint to be reviewed as parts of the complaint stretched beyond the limitation period. The applicant was able to show that the decision of the Council not to seek leave was irrational for failing to take into account relevant considerations and taking into account irrelevant considerations.",
        "Analysis": "24 The decision will consider the issues in the following order: (a) whether a “rolled up” procedure may be used for the judicial review application; (b) the time in which the judicial review application should be made; (c) whether leave should be granted to the applicant to apply for judicial review; and (d) the substantive issues raised as to the decision by the Council of the Respondent.",
        "Leave application": "25 Since the decision of the High Court inYong Vui Kong v Attorney-General[2011] 1 SLR 1, “rolled-up” applications have been the norm in judicial review applications. Both the leave and substantive questions are dealt with at the same time. This has the advantage of some saving of time and cost, as matters are disposed of fully as expeditiously as possible. In part, this approach has been justified on the grounds that splitting the leave stage from the substantive arguments rarely confers any benefit, unless it is clear that leave would not be granted. 26 The threshold for leave is not all that high. It is certainly not the case here that the application is clearly going to fall at the first hurdle. There were sufficient grounds laid out in the application which would have easily triggered the substantive stage.",
        "Time for bringing application for quashing order": "27 A preliminary issue is whether the application for a quashing order was brought out of time such that the applicant must obtain court sanction for his application to be heard. The relevant provision is O 53 r 1(6) of the ROC, which states: … [L]eave shall not be granted to apply for a Quashing Order to remove any judgment, order, conviction or other proceeding for the purpose of its being quashed, unless the application for leave is made within 3 months after the date of the proceeding … or … the delay is accounted for to the satisfaction of the Judge to whom the application for leave is made … 28 The applicant argues that the relevant decision for the purposes of judicial review proceedings was either that of the Council not to seek leave to refer the complaint to the Chairman, or the decision of the RC directing the Council to dismiss the portions of the complaint relating to events occurring prior to 17 April 2012.24Foot Note 24×Applicant’s submissions at paras 71, 80.The decision of the Council not to seek leave was made on 16 August 2018. While the decision of the RC was made on 10 July 2018, the applicant had acted promptly at all times such that an extension of time should be granted.25Foot Note 25×Applicant’s submissions at paras 80–85. 29 The respondent takes the position that the relevant decision is that of the Council deciding not to seek leave under s 85(4C) of the LPA on 23 May 2018 to refer the complaint to a Review Committee despite it being out of time. The present proceedings, having been commenced on 13 November 2018, do not meet the three month deadline imposed by O 53 r 1(6) of the ROC. Alternatively, if the relevant decision is that of the RC, the application would still have been filed out of time as its decision was made on 10 July 2018.26Foot Note 26×Respondent’s further submissions at para 2.The applicant must thus satisfactorily account to the court for the delay in bringing the present proceedings before the application for a quashing order is heard. 30 For the purposes of O 53 r 1(6) of the ROC, the time runs from the date on which the impugned decision is made and not when the applicant learns of the decision:Per Ah Seng Robin and another v Housing and Development Board and another[2016] 1 SLR 1020 at [51], citingTeng Fuh HoldingsPte Ltd v Collector of Land Revenue[2007] 2 SLR(R) 568 at [16]–[17]. 31 Here, even assuming that the judicial review proceedings were commenced out of time, I do not think that it would be just to hold the applicant to the three-month timeframe in O 53 r 1(6) of the ROC. It appears from the communications between the parties that the applicant persistently sought to convince the Council to reconsider its decision not to refer the entire complaint to the Chairman.27Foot Note 27×See Tab 3 of the Applicant’s Bundle of Relevant Correspondence.As against this, the Council’s statements to the applicant on this issue were ambiguous; it appears that the Council only definitively informed the applicant that it was not seeking leave under s 85(4C) of the LPA in its letter dated 16 August 2018, which was apparently only received by the applicant on 4 October 2018 due to the respondent’s failure to pay sufficient postage. In the circumstances, bearing in mind that any infringement of O 53 r 1(6) of the ROC would have been relatively brief, I am satisfied that the applicant has satisfactorily accounted for any delay in commencing proceedings for a quashing order.",
        "Requirements for leave": "32 The requirements for leave to commence judicial review proceedings were set out inJeyaretnam Kenneth Andrew v Attorney-General[2013] 1 SLR 619 at [5]: (a) the subject matter of the complaint is susceptible to judicial review; (b) the material before the court discloses an arguable case or aprima faciecase of reasonable suspicion in favour of granting the remedies sought by the applicant; and (c) the applicant has sufficient interest in the matter. These requirements were seemingly accepted on appeal by the Court of Appeal inJeyaretnam Kenneth Andrew vAttorney-General[2014] 1 SLR 345. 33 The respondent does not dispute that the subject matter of the complaint is justiciable and that the applicant haslocus standito bring the judicial review proceedings (ie, requirements (a) and (c)). The fact that the applicant makes the present application in his personal capacity, rather than on behalf of his mother, is a point raised by the respondent, but only in connection with the question of the exercise of the Council’s discretion rather than as a bar to the application for judicial review. While the applicant was not the client of Mr L, this does not affect his standing to obtain judicial review. Section 85(1) of the LPA allows anyone to make a complaint against a legal practitioner: seeDeepak Sharmav Law Society of Singapore[2016] 4 SLR 192(“Deepak Sharma”)at [63]–[76]. If indeed the applicant was entitled to file a complaint against Mr L for work done in relation to the applicant’s mother, it follows that he possesses thelocus standito bring judicial review proceedings against the respondent in respect of that same complaint: seeDeepak Sharmaat [77]–[81]. 34 As for requirement (b), since I heard the application on a “rolled-up” basis, I do not need to decide whether there is aprima faciecase of reasonable suspicion in favour of granting the remedies sought by the applicant. Instead, I will consider the substantive merits of the applicant’s case.",
        "Substantive issues": "35 The substantive issues contested between the parties are: (a) whether s 85(4C) of the LPA requires that leave of court be sought in respect of the complaint made; and (b) whether the Council properly exercised its discretion not to seek leave of court to refer the portions of the complaint relating to events arising more than six years prior to the Chairman, or alternatively, whether the RC properly exercised its discretion to direct the Council to dismiss part of the applicant’s complaint.",
        "The disciplinary framework under the LPA": "36 Before proceeding, I first set out the disciplinary framework under the LPA in so far as it is relevant to the present application. 37 The filing of a complaint under s 85(1) of the LPA is one of the ways in which disciplinary proceedings can be commenced against a legal practitioner. Section 85(1A) states that the Council shall, subject to section 85(4A), refer every complaint to the Chairman. 38 Section 85(4A) covers the situation in which a complaint against a regulated legal practitioner is based on conduct occurring more than six years prior to the date of the complaint: (4A) Subject to subsection (4C), the Council shall not refer a complaint of the conduct of a regulated legal practitioner to the [Chairman] under subsection (1A) if the complaint is first made to the Society after the expiration of the period of — (a)6 years from the date of the conduct; or (b) where the complaint relates to any fraud alleged to have been committed by the regulated legal practitioner, 6 years from the earliest date on which the complainant discovered the fraud or could with reasonable diligence have discovered it, if that period expires later than the period referred to in paragraph (a). 39 It can be observed that s 85(4A) functions as a sort of time bar, preventing disciplinary proceedings from continuing their usual course in respect of conduct occurring more than six years before the date of the complaint (subject to the fraud exception in s 85(4A)(b)). However, unlike the LA, the time bar under s 85(4A) of the LPA is not absolute; the Council can apply to court to allow it to refer complaints to the Chairman notwithstanding the fact that the subject matter of the complaint is conduct occurring more than six years prior. 40 The governing provisions for such applications are s 85(4C)(a) and s 85(4D) of the LPA, the relevant portions of which read: (4C) The Council may, with the leave of the court — (a)refer a complaint of the conduct of a regulated legal practitioner to the [Chairman] under subsection (1A) after the expiration of the period referred to in subsection (4A) … … (4D) An application for the leave of the court under subsection (4C) shall be — (a) made by the Council by originating summons; and (b) accompanied by an affidavit — (i) setting out — (A) every document constituting the complaint of the conduct of the regulated legal practitioner concerned, including every statutory declaration in support of the complaint (if any) … (ii) explaining why the complaint was not made to the Society before the expiration of the period referred to in subsection (4A) … and (iii) explaining why the complaint or information, as the case may be, should be referred to the [Chairman], notwithstanding the expiration of the period referred to in subsection (4A)… The provisions contemplate a situation in which a complaint is brought to the attention of the respondent more than six years after the underlying conduct has taken place. In appropriate circumstances, the Council may exercise its discretion to apply to court to sanction the reference of the complaint to the Chairman and continue the disciplinary process. 41 After a complaint is referred to the Chairman, he must convene a Review Committee to review the complaint (s 85(6) LPA). The Review Committee, after reviewing the complaint, may either direct the Council to dismiss the matter or refer the matter back to the Chairman (s 85(8) LPA).",
        "The failure to seek the court’s leave": "Whether leave of court was required to refer the complaint to the Chairman 42 The applicant argues that s 85(4A) of the LPA, which requires leave of court to refer a complaint to the Chairman if it is brought six years from the date of the conduct (subject to possible postponement in the case of fraud), is inapplicable in the present case for three reasons: (a) First, s 85(4A) of the LPA must be interpreted in the context of s 24 of the LA. This was based on a statement by Minister for Law K Shanmugam (“the Minister”) during the second reading of the Legal Profession (Amendment) Bill (Bill No 16 of 2008) that the limitation period in s 85(4A) of the LPA was to bring the disciplinary procedure in the LPA “in line with the general limitation in law”: seeSingapore Parliamentary Debates, Official Report(26 August 2008) vol 84 at col 3192 (K Shanmugam, Minister for Law). This would postpone the running of time to 18 December 2015, the date on which the Court of Appeal released its decision determining that the applicant’s mother was under a disability.28Foot Note 28×Applicant’s submissions at paras 137–144. (b) Second, the applicant argues that the term “conduct” in s 85(4A) of the LPA refers to continuing conduct.29Foot Note 29×Applicant’s submissions at para 145.Even though the trust was set up sometime in October 2010, Mr L continued to advise and work on the trust up till 11 December 2014. As for the MCA proceedings, Mr L’s bills demonstrates that he played an active part behind the scenes up until November 2014.30Foot Note 30×Applicant’s submissions at paras 162–163.CitingO’Connor v Bar Standards Board[2018] 2 All ER 779 (“O’Connor”), the applicant argues that Mr L’s actions, both in relation to the trust and the MCA proceedings, were part of a course of conduct which lasted up till at least 5 November 2014. The six-year period prescribed under s 85(4A) of the LPA would thus only lapse on 4 November 2020.31Foot Note 31×Applicant’s submissions at paras 166–167. (c) Third, s 85(4A)(b) of the LPA applies as the term “fraud” encompasses undue influence. Here, the complaint raises the distinct prospect that Mr L exercised undue influence on the applicant’s mother. The six-year period under s 85(4A) of the LPA would thus not have begun to run until the earliest time on which Mr L’s fraud could have been discovered, which was when the deputies were appointed in respect of the applicant’s mother on 18 December 2015.32Foot Note 32×Applicant’s submissions at paras 168–173. 43 The respondent argues that the Council had to obtain leave under s 85(4C) of the LPA before the portions of the complaint relating to events occurring before 12 April 2012 could be referred to the Chairman.33Foot Note 33×Respondent’s further submissions at para 5.There is no authority in support of the applicant’s proposition that s 24 of the LA is incorporated into the LPA. Even if s 24 of the LA were incorporated, it would apply only to the person under disability, which in this case would be the applicant’s mother.34Foot Note 34×Respondent’s further submission at paras 18–19. 44 The term “conduct” referred to in s 85(4A) of the LPA should not be confused with its consequences. An expansive reading of the term “conduct” should be avoided as this would lead to uncertainty. The relevant conduct here was Mr L’s actions in establishing the trust in or around 26 October 2010. The case ofO’Connoris fact-specific and does not assist the applicant.O’Connorconcerned proceedings under s 7(5)(a) of the Human Rights Act 1998 (c 42) (UK) (“HRA”), which requires that a proceeding be brought before the end of “one year beginning with the date on which the act complained of took place”. The act complained of involved the commencement of disciplinary proceedings against a barrister. The United Kingdom Supreme Court (“UKSC”) concluded as it did in the context of the specific scheme under which the disciplinary proceedings were brought against the barrister, which included a right of appeal; it would have been difficult for a claimant to bring a claim within one year of the commencement of disciplinary proceedings being brought without knowing the outcome.35Foot Note 35×Respondent’s further submission at paras 21–26.In the present case, the complaint could have been made well before the lapsing of the six-year time period specified in s 85(4A) of the LPA.36Foot Note 36×Respondent’s further submissions at para 26. 45 Finally, the term “fraud” in s 85(4A)(b) of the LPA should be defined narrowly to refer to fraud as defined inDerry v Peek. The complaint filed by the applicant does not specifically allege fraud on the part of Mr L.37Foot Note 37×Respondent’s further submissions at paras 27–29. (1) Section 24 of the Limitation Act 46 I agree with the respondent that the LA is not incorporated within the scheme contemplated in the LPA. The mere fact that the Minister’s speech during the second reading of the Legal Profession (Amendment) Bill (Bill No 16 of 2008) mentioned that its purpose was to bring the LPA disciplinary process in line with the general rules on limitation does not mean that all the specifications, powers and requirements under the LA are brought in. The various phrases used by the Minister, such as “bringing into line” could just as easily refer to a general and broad alignment, meaning the application of a six-year time bar, similar to that which applies to most types of civil claims.  Loading, as the applicant does, other matters onto the words of the Minister goes too far, and brings in a whole regime into the LPA for which no reference is made in the express language of the statute. 47 The applicant argues that the respondent had failed to point to any authority in support of the proposition that the LA was not in fact incorporated into the limitation provisions of the LPA.38Foot Note 38×Respondent’s further submissions at para 24–25.If anything, it is the applicant who needs to substantiate his construction of the provision. The starting point of any exercise in legislative interpretation is always the actual words used. The statutory provisions in the LPA do not at all refer to the LA in any form.  In the absence of such language, the remarks made by the Minister cannot be taken, even at their widest, as importing the LA regime in any way. 48 In any event, even if the applicant’s case were taken at its highest, s 24 of the LA would still not apply in the present case. Section 24 of the LA only applies to extend the limitation period if “the person to whom [the right of action] accrued was under a disability”. As pointed out by the respondent, even though the complaint was made by the applicant in respect of Mr L’s conduct while representing his mother, he is not bringing an action on her behalf. The present complaint is brought on the basis of the applicant’s personal right to make a complaint against an errant solicitor (see [33] above). Since the applicant was not under a disability at any time, there is no basis for s 24 of the LA to apply. (2) Conduct 49 The term ‘conduct’ would appear on its own to capture not just a distinct act occurring at a single point in time, but also actions over a span of time. The definition in theNew Shorter Oxford English Dictionary(Oxford University Press, 1993) (in sense 7) is: The action or manner of carrying on a proceeding, business, etc; management, handling … 50 That being said, I am not convinced that the term “conduct” should be given an overly broad reading. There should be certainty as far as possible as to where the line should be drawn. I accept the respondent’s submission that the purpose of s 85(4A) of the LPA is to prevent a legal practitioner from being exposed to complaints which are stale, and for which evidence is scant. 51 I do not think that the case ofO’Connorassists the applicant. As argued by the respondent, the statutory language of the HRA is different from that found in s 85(4A) of the LPA.39Foot Note 39×Respondent’s further submissions at paraSection 7(5) of the HRA states: Proceedings under subsection 1(a) must be brought before the end of – (a) the period of one year beginning with the date on which the act complained of took place; or (b) such longer period as the court or tribunal considers equitable having regard to all the circumstances, but that is subject to any rule imposing a stricter time limit in relation to the procedure in question. One can observe that the wording of s 7(5) of the HRA is markedly different from that found in s 85(4A) of the LPA. No authority was cited for the proposition that the interpretation given to the term “act” in s 7(5)(a) of the HRA is applicable to the term “conduct” in s 85(4A) of the LPA (see [38] above). More importantly, a closer analysis of the decision inO’Connorshows that it does not stand for the proposition that all of Mr L’s actions done in respect of the trust or MCA proceedings can be construed as a single continuous course of conduct. InO’Connor, the UKSC considered whether disciplinary proceedings instituted against a barrister ought to be construed as a single continuous act, or a series of discrete acts under s 7(5) of the HRA. In adopting the former view, Lord Lloyd-Jones considered that the process of prosecuting disciplinary proceedings “is a single process in which the prosecutor takes many steps” (at [29]). I do not think that any analogy can be drawn between the prosecutorial process considered inO’Connorand the actions allegedly undertaken by Mr L on behalf of the applicant’s mother. A quick perusal of the applicant’s complaint reveals many specific instances of alleged wrongdoing on the part of Mr L.40Foot Note 40×Applicant’s first affidavit at pp 53–74.Seen in this light, the fact that some events occurred after 17 April 2012 does not mean that the six-year time bar is inapplicable in respect of all related incidents. 52 Here, what must be considered are the specific instances of Mr L’s conduct in relation to the retainer or instructions which he purported to act under and which the complaint takes issue with. 53 As mentioned above at [3], the trust was supposedly created on 26 October 2010, though it would seem the documents were only signed sometime in November that year (BKRat [17]).  This was followed by various attempts to transfer the applicant’s mother’s assets to the bank with which the trust was established in November 2010 and December 2010. The relevant conduct as regards the establishment of the trust and the transactions relating to it, would seem to have occurred only in 2010.  The conduct thus falls outside the six-year period specified in s 85(4A) of the LPA. 54 As for the MCA proceedings, in so far as the dates of such bills or invoices would be a proxy of the conduct of work by Mr L, those bills relating to work done prior to 17 April 2012 would similarly be caught by s 85(4A) of the LPA as well. 55 It follows from the above analysis that, in so far as the matters forming the subject of the applicant’s complaint relate to work done by Mr L occurring prior to 17 April 2012 for either the establishment of the trust or the MCA proceedings, leave of court would have had to be sought by the Council under s 85(4C) of the LPA before the complaint could be referred to the Chairman. (3) Fraud 56 Another argument put forward by the applicant was that time had not run out as fraud was involved.41Foot Note 41×Applicant’s submissions at paras 168–173.Section 85(4A) of the LPA prescribes that in relation to fraud, time only runs from the point of discovery or when reasonable diligence could have led to discovery: (4A) Subject to subsection 4(C), the Council shall not refer a complaint of the conduct of a regulated legal practitioner to the Chairman of the Inquiry Panel under subsection (1A) if the complaint is first made to the Society after the expiration of the period of — … (b) where the complaint relates to any fraud alleged to have been committed by the regulated legal practitioner, 6 years from the earliest date on which the complainant discovered the fraud or could with reasonable diligence have discovered it, if that period expires later than the period referred to in paragraph (a). This effect of this provision is that the limitation period may be extended where fraud is involved. The justification for this is evident: fraud would generally involve an element of concealment, so it would be unjust to bind a claimant to a period when she would not have been aware of her rights against the defendant. 57 The respondent argues that there is no authority that the term “fraud” in section 85(4A)(b) of the LPA includes undue influence; rather, it should encompassDerry v Peekfraud, in which a defendant is fraudulent if he makes a statement knowing it to be false, not believing it to be true, or being reckless as to its truth.42Foot Note 42×Respondent’s further submissions at paras 28–29. 58 The applicant seeks to extend the application of this proviso to the unconscionable conduct of Mr L, which he says is equivalent to fraud. No authority was cited in support of this expansion however. 59 I am unable to accept that the allegation of unconscionability here is “fraud” for the purposes of s 85(4A)(b) of the LPA. 60 What is implicated by the section is deceptive behaviour that is hidden or concealed. Unconscionable conduct, including the exercise of any undue influence, would seem to be of a different character – while there may indeed be some concealment or surreptitiousness, the gravamen of unconscionability is, unlike fraud, not deceit or deception, but an exploitation of a situation of vulnerability.  While reprehensible, the difference in jurisprudential substance would seem to indicate that a specific reference in statute is required, and that such conduct cannot be squeezed into the term “fraud”. 61 I am fortified in my conclusion by a case not cited by the parties,Chagos Islanders vAttorney General[2003] EWHC 2222 (QB) (“Chagos Islanders”). There, an attempt was made by the claimant to give the term “fraud” as used in the Limitation Act 1980 (c 58) (UK) a broad meaning, covering unconscionable behaviour. As noted in Andrew McGee, Limitation Periods (Sweet & Maxwell, 8th Ed, 2018) at para 20.012, this attempt failed: … The court rightly rejected this bold attempt to extend the meaning of fraud in this context, which should be confined to the narrow class of cases where it has already been held to apply. The applicant’s arguments on this score seem to be of the same nature as inChagos Islanders, giving an overly broad meaning to the term “fraud”. 62   I would also note the possible argument that the term “fraud” in s 85(4A)(b) of the LPA also includes the “fraudulent concealment” exception embodied in s 29(1)(b) of the LA: seeegChua Teck Chew Robert v Goh Eng Wah[2009] 4 SLR(R) 716. I do not think that it is at present necessary for me to consider the point as, even on the authorities relied on by the applicant, there is nothing to suggest that a claim in undue influence potentially falls within the ambit of the fraudulent concealment exception. The relevant decision for the purposes of judicial review proceedings 63 It follows from the above analysis that the decision of the RC directing the Council to dismiss the portions of the complaint relating to conduct by Mr L occurring before 17 April 2012 was immaterial for the purposes of the present application (see [6] above). The Council was required under s 85(4A) of the LPA to seek leave of court before referring the portions of the complaint relating to matters occurring before 17 April 2012 to the Chairman. To the extent that the Council may have referred matters which were caught by the operation of s 85(4A) of the LPA to the Chairman (and considered subsequently by the RC), the RC did not have the jurisdiction under the LPA to consider them; any decision taken by the RC to direct the dismissal of the complaint or referral back to the Chairman would beultra viresand void. 64 Rather, the relevant decision in the present case is that of the Council, which is addressed in the following section. 65 I also note that the applicant’s submissions in relation to the RC’s decision appear to take issue with the substantive merits of the decision.43Foot Note 43×Applicant’s submission at paras 266–272.It bears mentioning that in judicial review proceedings the court is concerned with the decision-making process and not a review of the merits of the decision itself: seeChee SiokChinat [93]. The court cannot substitute its views for those of the decision-maker, even if it itself might have come to a different conclusion. Whether the Council should have applied for leave of court to refer the complaint to the Chairman 66 The applicant argues that the Council should have applied for leave to proceed with the entire complaint despite the time bar. The Council’s decision was challenged on all three traditional grounds for judicial review (ie, illegality, irrationality and procedural impropriety): (a) First, the Council acted illegally in misunderstanding its duties under s 85 of the LPA. It failed to consider whether leave should be sought under s 85(4C) of the LPA in respect of events referenced in the complaint which occurred prior to 17 April 2012, and instead, surrendered and abdicated its discretion to the RC.44Foot Note 44×Applicant’s submissions at para 180. (b) Second, the Council acted irrationally in deciding not to seek leave of court under s 85(4C) of the LPA. The two reasons provided by the Council in their letter dated 16 August 2018, that leave was not sought due to the events occurring more than six years prior to the complaint, and the fact that the complaint was made by the applicant in his personal capacity, were without merit.45Foot Note 45×Applicant’s submissions at paras 202–214. (c) Third, the Council’s decision was tainted by procedural impropriety for violating the fundamental rules of natural justice and the mandatory requirements of procedural fairness provided for by the LPA.46Foot Note 46×Applicant’s submissions at paras 215–223.The Council failed to adhere to the statutory procedure provided for in the LPA by submitting to the RC’s direction.47Foot Note 47×Applicant’s submissions at paras 218–219.The Council also failed to give the applicant an opportunity to be heard.48Foot Note 48×Applicant’s submissions at paras 220–223. 67 The respondent argues that the Council had exercised its discretion properly. The Council did not abdicate its discretion to the RC and had applied itself to the question of whether leave should be sought under s 85(4C) of the LPA.49Foot Note 49×Respondent’s further submissions at para 43a.The high threshold for a finding of irrationality is not met.50Foot Note 50×Respondent’s further submissions at para 50.The Council, in deciding not to seek leave, had legitimately considered the fact that the applicant was able to make his complaint in good time before October 2016, and that the complaint was made by the applicant in his personal capacity rather than on behalf of his mother.51Foot Note 51×Respondent’s further submissions at para 51.There was no procedural impropriety on the part of the Council.52Foot Note 52×Respondent’s further submissions at para 52.Finally, in so far as the merits of the Council’s decision were challenged, its exercise of its statutory discretion should not be disturbed; the fact that there is a strong chance of success that leave will be granted is not a sufficient basis to quash the Council’s decision.53Foot Note 53×Respondent’s further submissions at para 53. 68 I should also mention that the respondent raises the argument that there is no duty on the part of the Council to give reasons for its decision (see [22] above).54Foot Note 54×Respondent’s further submissions at para 39.To my mind, this is simply irrelevant at this stage of the proceedings. Having elected to provide what it now terms “short form” reasons to the applicant, the court is entitled to scrutinise those reasons to ensure that the statutory discretion conferred on the Council has been exercised lawfully. If indeed the Council had taken into account other considerations in exercising its discretion not to seek leave under s 85(4C) of the LPA, those reasons ought to have been placed before the court. (1) When the decision was made by the Council 69 One of the main points of contention between the parties was when the Council made the decision not to seek leave under s 85(4C) of the LPA to refer the portions of the complaint relating to events occurring before 17 April 2012 to the Chairman. 70 The applicant argues that the Council did not in fact make any decision before the RC report. The applicant’s position is that the Council’s decision was made on 16 August 2018.55Foot Note 55×Applicant’s submissions at para 77. 71 The respondent denies this, saying that the Council had made its decision by 15 May 2018, before the portion of the complaint relating to matters occurring after 17 April 2012 was referred to the Chairman, which the Applicant himself acknowledged in his letter of 8 August 2019.56Foot Note 56×Respondent’s further submissions at para 44; Tab 1 of the Applicant’s Bundle of Relevant Correspondence. 72 I accept on the evidence that any such decision was indeed made before the complaint was sent to the Chairman. The correspondence sent by the respondent to the applicant was in itself reflective of a decision that had been made.  As pointed out in the further submissions of the respondent, in the letter of 15 May 2018 from the respondent to the applicant, it was conveyed that a referral would be made first to the Council, then by the Council to the Chairman, who would in turn appoint a RC and thereafter, if required, an Inquiry Committee. That letter also noted that information going back beyond six years would be treated as background information. Thereafter, on 23 May 2018, the respondent wrote to the applicant that the decision had been made by the Council to refer the compliant to the Chairman.57Foot Note 57×Tab 2 of the Applicant’s Bundle of Relevant Correspondence.That date, 23 May 2018, would have been the latest date by which the decision would have been made. (2) The discretion exercised by the Council (A) Illegality 73 As noted by the applicant, and not contested by the respondent, decisions of administrative bodies such as the Council are subject to scrutiny by the court and judicial review remedies will be granted if there has been illegality, irrationality or procedural impropriety:Chng Suan Tze v Minister for Home Affairsand others and other appeals[1988] 2 SLR(R) 525 (“Chng Suan Tze”). 74 Illegality would be established where the decision-maker exceeds the ambit of the powers granted to him under the relevant statute: seeChng Suan Tzeat [86]. 75 The applicant’s contentions on illegality essentially consisted of two strands. First, that the Council did not consider whether leave should be sought under s 85(4C) of the LPA, choosing instead to abide by the RC’s recommendation. Second, that the Council in deciding whether to seek leave failed to take into account relevant considerations.58Foot Note 58×Applicant’s submissions at paras 179–201.In my view, only the first line of arguments relate to an instance of illegality. The second line of arguments are more rightly considered as falling under the irrationality claim and are only considered in the following section (see [77]–[86] below). 76 The applicant’s arguments hinge primarily on the conclusions of the RC in its 10 July 2018 and the 12 July Letter (see [7] above). I accept that there is ambiguity over whether the Council and the RC had misunderstood the disciplinary framework under the LPA. However, I do not think that they go so far as to show that the Council had not independently considered whether it ought to seek leave under s 85(4C) of the LPA. Indeed, in the letter dated 16 August 2018, the Council provided its reasons for not doing so to the applicant.59Foot Note 59×See Tab 6 of the Applicant’s Bundle of Relevant Correspondence.There was no suggestion that the reasons contained therein were false. I therefore find that the applicant’s illegality claim is not made out. (B) Irrationality 77 I now turn to consider whether the Council’s exercise of its discretion not to seek leave under s 85(4C) of the LPA was irrational. 78 The fact that the discretion conferred upon a decision-maker by statute is wide does not mean that it is unlimited. That discretion must be exercised in a way that promotes the policy and objects of the Act under which it is conferred: seePadfield v Minister of Agriculture, Fisheries and Food[1968] AC 997 at 1030. A failure to do so may be grounds for courts to intervene in judicial review proceedings on the ground of irrationality, orWednesburyunreasonableness as it is more commonly known, taking its name from the decision inAssociated Provincial Picture Houses Limited v Wednesbury Corporation[1948] 1 KB 223. 79 The termWednesburyunreasonableness encompasses a whole host of conduct. The primary guidance which can be gleaned from the speech of Lord Greene MR (at 229) is that the decision-maker must “exclude from his consideration matters which are irrelevant to what he has to consider”, and must also refrain from “taking into consideration extraneous matters”. The threshold for a finding ofWednesburyunreasonableness is a high one. InChng Suan Tzeat [119], the Court of Appeal approved Lord Diplock’s formulation of an irrational decision inCouncil ofCivil Service Unions v Minister for the Civil Service[1985] AC 374as one so “outrageous in its defiance of logic or of accepted moral standards that no sensible person who had applied his mind to the question to be decided could have arrived at it.” 80 The first step in the analysis calls for a consideration of the purpose of disciplinary proceedings under the LPA, and specifically the purpose of s 85(4C), which allows for a complaint to be referred to the Chairman for conduct outside the six-year period. The applicant, citingDeepak Sharmaat [63], submits that the purpose for disciplining solicitors is to maintain the high standards and good reputation of the legal profession. This does not appear to be disputed by the respondent, and I agree that this formulation broadly encapsulates the purpose of the disciplinary framework contained in Part VII of the LPA. 81 Where s 85(4C) of the LPA is concerned (see [40] above), the key observation to be made is that Parliament specifically contemplated a scenario in which a solicitor might, in the appropriate case, be subject to disciplinary proceedings notwithstanding the fact that the conduct complained of took place outside the regular six-year limitation period (assuming the fraud exception does not apply). 82 Bearing in mind the general purpose of the disciplinary framework in Part VII of the LPA, and the specific purpose of s 85(4C), the question to be asked is whether the Council, in exercising its discretion not to seek leave, took into account irrelevant considerations or failed to consider relevant considerations. 83 The Council’s reasons for declining to seek leave under s 85(4C) of the LPA are contained in the 16 August Letter (see [9] above) and can be summarised as follows: (a) First, the complaint was made by the applicant in his personal capacity. (b) Second, the conduct complained of took place in October 2010, which meant that more than a year was left after the Court of Appeal’s decision inBKRfor interested persons to make the complaint. 84 With respect, I do not think that the fact that the complaint was made by the applicant in his personal capacity is a relevant consideration for the purposes of deciding whether leave should be sought under s 85(4C) of the LPA. As mentioned above at [80], the purpose of the disciplinary framework in Part VII of the LPA is to maintain the high standards and good reputation of the legal profession. The disciplinary process does not serve to vindicate the personal rights of the legal practitioner’s client, which can protected in an ordinary civil proceeding. Seen in this light, the fact that a complaint is filed by a person other than the client of the legal practitioner is an irrelevant consideration as far as the disciplinary process is concerned. If anything, factoring such a consideration into the decision on whether to seek leave would actually detract from the purpose of the disciplinary framework. 85 As for the second reason provided by the Council, I am of the view that it fails to take into account other relevant considerations in making its decision. The reasons provided by the Council focus entirely on the applicant’s failure to bring the complaint sooner and appear to have neglected to consider the merits of the complaint entirely. While I agree with the respondent that the length of time which has elapsed since the alleged wrongdoing is a relevant consideration in determining whether leave ought to be sought under s 85(4C) of the LPA, the inquiry cannot end there. To my mind, the purpose of the disciplinary framework requires that the Council take into account all relevant factors in its decision to seek leave, including the seriousness of the alleged wrongdoing and the merits of the complaint. After all, the Court of Appeal inLaw Society of Singapore v Chan Chun Hwee Allan[2018] 4 SLR 859 at [32] recognised that the court would be more inclined to exercise its power to cure a procedural irregularity where the alleged misconduct is serious and/or prolonged. It was therefore incumbent on the Council to factor these other considerations in its decision on whether to seek leave. There was no evidence before the court that the Council did so. 86 In the circumstances, given the substantial lapses in the Council’s decision-making process on whether leave should be sought under s 85(4C) of the LPA, I am satisfied that its decision can be characterised as unreasonable in theWednesburysense. I therefore grant a quashing order against the Council’s decision not to apply for leave to refer the portion of the applicant’s complaint relating to events occurring prior to 17 April 2012 to the Chairman. I also grant a mandatory order directing the Council to perform its duty under the LPA. I note that the applicant sought a mandatory order for the referral of the complaint, but given the ambit of judicial review, which does not usually go into the merits of a decision, the proper course should only be to compel proper consideration of the factors raised at [85] above. (C) Procedural Impropriety 87 The applicant raised two arguments on the ground of procedural impropriety. The first was that the Council failed to adhere to the statutory procedure in the LPA by submitting to the RC’s direction. This was essentially the same argument made under the head of illegality (see [73]–[76] above). 88 The applicant’s remaining claim in respect of procedural impropriety was based on the Council’s failure to give him an opportunity to be heard in breach of the fundamental rules of natural justice.60Foot Note 60×Applicant’s submissions at para 220–223 89 Whether the fundamental rules of natural justice require a hearing to be held depends on the subject matter and the context:Manjit Singh s/o Kirpal Singhand another v Attorney-General[2013] 2 SLR 844 at [88]. The highest standards are adopted in a court of law or arbitral tribunal because at the end of the process the parties’ rights will be determined or affected:Subbiah Pillai v Wong Meng[2001] 2 SLR(R) 556 at [58]. 90 Here, the decision of the Council was simply a preliminary inquiry into whether disciplinary proceedings should be commenced against Mr L. Furthermore, it cannot be said that the decision of the Council affected the applicant’s rights in any way. I therefore find that there was no procedural impropriety on the part of the Council by not holding a hearing which the applicant was invited to. Importantly, the evidence was that the Council was at all times willing to correspond with the applicant about his concerns via letter.",
        "Redaction": "91 In the MCA proceedings culminating in the Court of Appeal’s decision inRe BKR, the identity of the applicant’s mother and any information which might lead to her identification were subject to redaction. Out of an abundance of caution, the names of both the applicant and the lawyer subject to the complaint (ie, Mr L) have been redacted in this judgment, following the Court of Appeal’s approach.",
        "Conclusion": "92 For the reasons above, judicial review is allowed: the decision of the Council not to apply for leave to refer the pre 17 April 2012 events to the Chairman is quashed, and a mandatory order is granted directing the Council to reconsider its decision on whether to apply for leave to refer the whole of the applicant’s complaint to the Chairman under s 85(4C) of the LPA. 93 Directions for the determination of costs will be given separately. Time for any appeal is extended in the meantime. Aedit AbdullahJudge Sarjit Singh Gill SC and Jamal Siddique Peer (Shook Lin & Bok LLP) for the applicant;Tan Wee Kheng Kenneth Michael SC (Kenneth Tan Partnership) for the respondent."
    }
}