{
    "case_title": "Zheng HongfanvSingaravelu Murugan",
    "ncitation": "[2019] SGHC 184",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Facts": "2 The plaintiff is the finance director of Xingang Investment Pte Ltd (“Xingang”), an excluded moneylender under s 2(e)(iii) of the Moneylenders Act (Cap 188, 2010 Rev Ed). Xingang carries on the business of lending money to corporations.1Foot Note 1×Zheng Hongfan Affidavit dated 10 April 2019 at para 5.The defendant is the husband of Chandran Meenakumari (“Meenakumari”), and is the owner of a property at 95 Park Villas Rise (“the Property”).2Foot Note 2×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 6.Meenakumari is a director and sole shareholder of the company, Emson Systems (S) Pte Ltd (“Emson Systems”).3Foot Note 3×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 7. 3 By way of a written agreement made between Xingang, Emson Systems, Meenakumari and the defendant, Xingang loaned Emson Systems S$350,000 on the terms of the same agreement (“the Loan Agreement”).4Foot Note 4×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 8.At the same time, both Meenakumari and the defendant executed a Deed of Guarantee (“the Guarantee”) in which each of them agreed to guarantee, upon demand being made in writing, the payment to Xingang of the sums of money payable under the Loan Agreement.5Foot Note 5×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 9.Pursuant to the Loan Agreement, the defendant executed a Power of Attorney in favour of the plaintiff.6Foot Note 6×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 10.The defendant did not dispute that Xingang lent Emson Systems the S$350,000 and that he stood as guarantor together with his wife, Meenakumari.7Foot Note 7×Singaravelu Murugan’s Affidavit at para 5. 4 The plaintiff is the donee under the Power of Attorney, which granted him certain powers to deal with the Property.8Foot Note 8×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 14.At some point, Emson Systems defaulted on its obligations under the Loan Agreement. The plaintiff then sought to enforce the Guarantee and exercise its powers under the Power of Attorney. 5 The Power of Attorney contains,inter alia, the following terms: 1. To transfer, sell, lease, mortgage, charge and deal with the [Defendant’s] legal and beneficial interest in [the Property] as the Attorney may think desirable in the [Defendant’s name] or jointly with others and on such terms as the Attorney shall in the Attorney’s absolute discretion think fit. 2. To enter into any negotiations and to appoint brokers, valuers, auctioneers, solicitors and other agents to act on the Land Owner’s behalf inall matters arising out of or in connection with the transfer, sale, lease, mortgage, charge, management and upkeep of the Propertyor any of the powers herein granted. [emphasis added] 6 On 15 March 2019, the plaintiff’s solicitors wrote to the defendant’s then solicitors, Grays LLC, to inform the defendant that the plaintiff intended to exercise the rights and powers under the Power of Attorney, and that it was going to sell the Property to recover the loaned sum.9Foot Note 9×Zheng Hongfan’s Affidavit dated 10 April 2019 at para 20.The defendant was also informed that a valuation was to take place on 19 March 2019. 7 The plaintiff was unable to carry out the valuation. There were two further attempts by the plaintiff’s appointee, Ms Yek Pei Ling (“Ms Yek”), to carry out valuation of the Property. Those attempts were also unsuccessful. This led the plaintiff to take out this application for a mandatory injunction against the defendant. The plaintiff sought the following orders:10Foot Note 10×Summons for Injunction dated 11 April 2019. 1. the Defendant shall, whether by himself, his agents and/or servants, render and/or provide all assistance necessary or required, to the Plaintiff, her servants and/or agents, without any delay, in order for the Plaintiff to exercise the powers, rights and/or privileges granted to her under the Power of Attorney dated 27 September 2018, registered and deposited in the Registry of the High Court of Singapore under HC/PA/5148/2018 pursuant to Section 48 of the Conveyancing and Law of Property Act (Chapter 61) and Order 60 of the Rules of Court (hereinafter referred to as “the Power of Attorney”), including but not limited to: a. to allow and/or provide access to the Plaintiff, her servants and/or agents, within 3 days from the service of this Order on the Defendant, access to the property known as 95 Park Villas Rise Singapore 545330 (hereinafter referred to as “the Property”) in order for a valuation exercise to be carried out in respect of the Property; b. to allow and/or provide access, within 2 days of request and/or notice by the Plaintiff, her servants and/or agents, to all prospective purchasers of the Property to view the Property; c. to yield vacant possession of the Property to the purchaser(s) of the Property in accordance with and in compliance with the Sale and Purchase Agreement to be executed by the Plaintiff pursuant to the Power of Attorney; 2. An order restraining the Defendant, whether by himself, his agents and/or servants or howsoever otherwise caused, from preventing, interfering, precluding, disrupting and/or hindering the Plaintiff, his servants and/or agents, from exercising the powers, rights and/or privileges granted to the Plaintiff under the Power of Attorney; 3. The Defendant shall pay and/or indemnify the Plaintiff for all the costs in the enforcement of the Power of Attorney, on a solicitor-and-client basis, including but not limited to, the sum of SGD300 charged by Knight Frank Pte Ltd for the aborted valuation exercises; 4. 4. The Defendant shall bear the costs of this application, on a solicitor-and-client basis; and 5.  such further and/or other reliefs that the Honourable Court deems fit and just. 8 The plaintiff relied on cl 2 of the Power of Attorney (see above at [5]) to appoint Ms Yek to carry out valuation of the Property.",
        "My decision": "9 During the hearing on 21 May 2019, the defendant raised three main arguments against the plaintiff’s application. 10 The defendant first argued that the Power of Attorney did not grant theplaintiffthe power to access the Property, and therefore the access orders sought (see above at [7]) should be refused. This submission was misconceived as it betrayed a misunderstanding of how cl 2 of the Power of Attorney was meant to operate. That clause reads: 2. To enter into any negotiations and to appoint brokers, valuers, auctioneers, solicitors and other agents to act on the Land Owner’s behalf in all matters arising out of or in connection with the transfer, sale, lease, mortgage, charge, management and upkeep of [the Property] or any of the powers herein granted. 11 The defendant also suggested that because cl 2 stated that the valuer was to act on the Land Owner’s behalf – in this case, the defendant – it cannot include a power which was exercised contrary to his wishes, such as by forcing him to yield access and/or vacant possession. 12 A plain reading of cl 2 shows that the donee is empowered to appoint various agents to act on the donor’s behalf “in all matters arising out of or in connection with” the sale of the property. A valuer duly appointed by the donee will have those powers under the Power of Attorney. The phrase “all matters arising out of or in connection with” is, in my view, sufficiently broad to permit the valuer to gain access to the Property in order to perform the valuation exercise. Having granted the donee the power to appoint the valuer to act on his behalf in connection with the sale of the Property, it does not lie in the mouth of the donor to deny the valuer access to the Property to frustrate the sale. 13 The defendant also argued that the Power of Attorney was to be read together with the Loan Agreement, and that the Power of Attorney was so wide in nature that it did not mirror the terms of the Loan Agreement. Although this argument was not easy to follow, I understood the defendant to be saying that the plaintiff was not entitled to carry out a valuation exercise because of the effect produced when cll 5.6 and 5.7 of the Loan Agreement are read together,ie, that the plaintiff wasobligedto purchase the Property at the “Agreed Property Price” of S$2,040,000 and therefore could not elect to sell it on the open market to a third party at some other price other than the Agreed Property Price. Clauses 5.6 and 5.7 read as follows:11Foot Note 11×Zheng Hongfan’s Affidavit dated 10 April 2019 at p 34. 5.6 Singaravelu Murugan agrees and confirms that where the Lender so elects in an Event of Default as set out in Clause 7 below, to sell the Property to the Lender and/or its nominee(s) at the agreed sale price of Singapore Dollars: Two Million Forty Thousand Only (S$2,040,000.00) (hereinafter referred to as the “Agreed Property Price”), such part of the purchase price of the Property being the Agreed Property Price less the payment(s) to discharge the Paramount Encumbrances, shall on completion of the sale and purchase of the Property, be set-off against an equivalent amount of the Loan or such part thereof as is outstanding and/or any monies due and/or payable to the Lender under this Agreement as at the date of completion and shall be treated and deemed as payment towards such part of the Agreed Property Price for the purchase of the Property. 5.7 Singaravelu Murugan shall therefore execute the following documents concurrently with the execution of this Agreement:- (i) An Option to Purchase (hereinafter referred to as the “OTP” granting the Lender and/or its nominee(s) the option to purchase the Property at the Agreed Property Price and on the terms and conditions set out therein; (ii) An Irrevocable Power of Attorney in respect of the Property (hereinafter referred to as the “POA”) on the terms and conditions set out therein; and (iii) The Instrument of Transfer and all other relevant documents relating to the sale and transfer of the Property, executed by the Borrower in escrow (hereinafter referred to as the “SPA Documents”). 14 The defendant’s submission was easily refuted by cl 7.5(ii) of the Loan Agreement. The clause reads: 7.5 Singaravelu Murugan further agrees and confirms that in an Event of Default:- … (ii) where the Lender has elected not to exercise the OTP, the Attorney will be exercising his/her powers under the POA to sell and transfer the Property to third parties to realise the sale proceeds to repay the Loan or such part thereof that is outstanding and pay all monies due and/or payable to the Lender under this Agreement … 15 The effect of the above clause was clearly to provide the Lender, Xingang, with a choice: it could either elect to exercise the OTP and purchase the Property from the defendant at the Agreed Property Price of S$2,040,000, or the plaintiff could exercise his powers under the Power of Attorney to sell the Property to a third party at market price. 16 The defendant’s final substantive argument was that the Loan Agreement and the Power of Attorney contained no specific term stipulating what would happen to the rest of the sale proceeds once the Property was sold. For this reason, the Power of Attorney was suggested to be too “vague and wide” and should therefore not be enforced. I failed to see the merit to this argument as cl 7.5(ii) plainly stated that the sale proceeds that was received by a third party buyer was only to “repay the Loan …that is outstanding” and to “pay all monies due and/or payable to the Lender”. The donee does not have the power to deal with the remaining sums of money after the loaned sums have been recovered and would therefore have to render an account of the balance to the defendant. 17 In the premises, I granted an order in terms and ordered the defendant to pay costs to the plaintiff fixed at $15,000. Lee Seiu KinJudge Lim Tong Chuan and Pang Haoyu Samuel (Aquinas Law Alliance LLP) for the plaintiff;Cheryl Tan (Fernandez LLC) for the defendant."
    }
}