{
    "case_title": "I-Admin (Singapore) Pte Ltd vHong Ying Ting and others and another suit",
    "ncitation": "[2019] SGHC 127",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The plaintiff’s claims in Suit Nos 585 of 2013 and 965 of 2015 (respectively “Suit 585/2013” and “Suit 965/2015”, and collectively “the Suits”) were that three of the defendants in the Suits, being ex-employees of the plaintiff and its subsidiaries, conspired to infringe its copyright by taking and using its confidential information to set up a competitor firm in the business of payroll processing. The plaintiff’s claims were for copyright infringement, breach of confidence, breach of contract, conspiracy and inducing breach of contract. 2 For the reasons given in these grounds of decision, I dismissed the plaintiff’s claims in the Suits, save an award for nominal damages for breach of contract against Mr Hong Ying Ting (“Mr Hong”) in Suit 585/2013. The plaintiff has since appealed against my decision.",
        "Facts": "",
        "The parties": "3 The plaintiff in the Suits is i-Admin (Singapore) Pte Ltd. It is a Singapore-incorporated company in the business of providing outsourcing services and systems software, primarily in the areas of payroll and human resource (“HR”) management. It began developing the “payAdmin” system comprising its core payroll engine from 2000 onwards.1Foot Note 1×Seok Jin Kim’s (“Kim’s”) affidavit of evidence-in-chief (“AEIC”) at paras 16(a) and 19. 4 The defendants in Suit 585/2013 are Mr Hong, an ex-employee of the plaintiff;2Foot Note 2×Kim’s AEIC at para 11; Hong’s AEIC at paras 21 and 81.Mr Liu Jia Wei (“Mr Liu”), an ex-employee of i-Admin (Shanghai) Ltd (“i-Admin (Shanghai)”), the plaintiff’s wholly owned Chinese subsidiary;3Foot Note 3×Kim’s AEIC at paras 12 and 13; Liu’s AEIC at paras 5 and 6.Nice Payroll Pte Ltd (“Nice Payroll”), a Singapore-incorporated company in the business of providing payroll outsourcing services and HR management functions;4Foot Note 4×Hong’s AEIC at para 4.and Mr Li Yong (“Mr Li”), a Chinese national and Singapore permanent resident who invested in Nice Payroll.5Foot Note 5×Hong’s AEIC at paras 102–114. 5 Mr Hong, Mr Liu and Mr Li are Nice Payroll’s directors. Unless otherwise specified, references to “the defendants” and their submissions should generally be taken to refer to the defendants in Suit 585/2013. 6 The defendant in Suit 965/2015 is Mr Tan Kim Liat Errol (“Mr Tan”). He was employed by the plaintiff from November 2002 to December 2006. He became acquainted with Mr Hong during this period. He was later employed by Olabo Pte Ltd (“Olabo”), one of the plaintiff’s subsidiary companies, from February to June 2011, and worked for Nice Payroll from June 2011 to October 2012.6Foot Note 6×Tan’s AEIC at paras 4, 13, 22 and 34.",
        "Background to the dispute": "Mr Hong, Mr Liu and Mr Tan’s employment from 2010 to 2011 7 Mr Hong, Mr Liu and Mr Tan were each employed by the plaintiff or its subsidiaries during the period from 2010 to 2011 in the following capacities. 8 Mr Hong was a general manager in the plaintiff’s systems department.7Foot Note 7×Kim’s AEIC at para 11(c), Hong’s AEIC at paras 21(f) and 21(g).By his account, Mr Liu was an operations manager in i-Admin (Shanghai)’s operations department from May 2009 to April 2010. He was moved to i-Admin (Shanghai)’s business development department from May to June 2010, and then to its implementation department from July to November 2010. He managed i-Admin (Shanghai)’s applications department from 1 December 2010 to April 2011.8Foot Note 8×Liu’s AEIC at paras 14(f)–14(i). 9 Mr Tan began working for Olabo in 2011 upon Mr Hong’s recommendation, and worked on network and server maintenance.9Foot Note 9×Tan’s AEIC at paras 12–14. The Kikocci Project and setting up Nice Payroll 10 In 2009, Mr Hong and Mr Liu shared their frustrations about the plaintiff’s payroll engine, which they both had experience using. They discussed creating a better payroll software and named their proposed project the “Kikocci Project”. During this period, Mr Liu began coding for the Kikocci Project using an online web-based application development tool, Oracle Application Express (“APEX”). The Kikocci Project was designed to be a portal that stored and displayed employee records in different APEX pages.10Foot Note 10×Hong’s AEIC at paras 45 and 86–92; Liu’s AEIC at paras 47, 48, 58–61.In December 2009, Mr Hong and Mr Liu incorporated the Kikocci Corporation in the British Virgin Islands, and Mr Liu bought the domain name “www.kikocci.com”. Mr Hong and Mr Liu designed the Kikocci website as a mock-up of their intended payroll service.11Foot Note 11×Hong’s AEIC at para 95; Liu’s AEIC at para 66.They continued to discuss the Kikocci Project over Skype on various occasions from 2010 to 2011.12Foot Note 12×Kim’s AEIC at paras 47–57; Hong’s AEIC at para 99; Liu’s AEIC at para 78.Mr Liu stopped coding on the Kikocci Project in November 2010.13Foot Note 13×Hong’s AEIC at para 100; Liu’s AEIC at para 65. 11 It would appear that from August 2010 to March 2011, Mr Hong shared with Mr Li that he and Mr Liu were keen on starting a payroll business and were looking for an investor. Mr Hong suggested that Mr Li could invest in the Kikocci Corporation, but Mr Li preferred to invest in a new company instead.14Foot Note 14×Hong’s AEIC at para 110.On 18 March 2011, Mr Li and Mr Hong incorporated Nice Payroll, with Mr Li as the only director and 100% shareholder. Mr Li invested $100,000 in paid-up capital and provided a loan of $900,000 pursuant to a Cooperation Agreement dated December 2011. Mr Hong and Mr Liu agreed to develop Nice Payroll’s business and its payroll software, and they would in return receive ⅓ ownership each by June 2013. Mr Hong and Mr Liu also agreed to close the Kikocci Corporation and its website.15Foot Note 15×Li’s AEIC at paras 32–34 and LY-1 Tab 1; Hong’s AEIC at paras 112–114.This Cooperation Agreement was based on verbal discussions from March 2011.16Foot Note 16×Notes of Evidence (“NEs”) (27 March 2018) at p 1 ln 11 – p 2 ln 9. Resignations from the plaintiff and its subsidiaries 12 On 30 April 2011, Mr Liu resigned from i-Admin Shanghai. Mr Hong left the plaintiff’s employment on 30 June 2011. Mr Tan also left the plaintiff’s employment in June 2011. They began working for Nice Payroll thereafter.17Foot Note 17×Kim’s AEIC at paras 66–67 and 74; Hong’s AEIC at para 81; Liu’s AEIC at para 80; Tan’s AEIC at para 22.Ms Zaza Shen (“Ms Shen”), a software engineer employed by i-Admin (Shanghai), also resigned on 30 June 2011. She began working for Nice Payroll from 5 August 2011 onwards.18Foot Note 18×Kim’s AEIC at para 75. The plaintiff’s discovery of Nice Payroll and subsequent events 13 In 2013, the plaintiff came across Nice Payroll’s website while conducting market research. The plaintiff noted that Nice Payroll advertised itself as providing services and systems similar to the plaintiff’s, and that Mr Hong and Mr Liu were its directors. The plaintiff was suspicious of Nice Payroll’s activities and conducted forensic investigations into the defendants’ affairs.19Foot Note 19×Kim’s AEIC at paras 29–34. 14 The plaintiff commenced Suit 585/2013 on 2 July 2013 and applied for an Anton Piller order as against the defendants in Suit 585/2013. The Anton Piller order was granted on 9 July 2013 and was executed at Nice Payroll’s premises on 17 July 2013. It was not disputed that some materials related to the plaintiff were found in Nice Payroll’s possession on its office server (the “Dell Server”) and on Mr Hong’s Lenovo ThinkPad laptop (the “ThinkPad laptop”), and that Mr Hong and Mr Liu deleted files related to “i-Admin” prior to the execution of the order.20Foot Note 20×Kim’s AEIC at paras 35–37; Lead Counsel’s Statement, Common Ground between Parties, S/N 1 and 2.It was also not disputed that Mr Hong accessed the plaintiff’s demonstration platform in April 2013 after he left the plaintiff’s employment.21Foot Note 21×Kim’s AEIC at paras 112–113; Lead Counsel’s Statement, Common Ground between Parties, S/N 3. 15 In June 2014, the plaintiff obtained a discovery order against the defendants in Suit 585/2013. In order to comply with the discovery order, Nice Payroll engaged forensic experts to extract files from the Dell Server. On 15 July 2014, Mr Hong and Mr Liu reviewed files that Nice Payroll’s forensic experts had extracted. They came across personal data files of the plaintiff’s clients, including HSBC Bank (Singapore) Limited (“HSBC”). Mr Hong recognised the list of clients (apart from HSBC) to be clients that the plaintiff had been contracted by ADP International Services BV (“ADP”) to service. On 4 September 2014, Mr Hong informed HSBC and ADP that their data had been placed in Nice Payroll’s possession.22Foot Note 22×Hong’s AEIC at paras 308–320; Liu’s AEIC at paras 279–281.",
        "The parties’ cases in Suit 585/2013": "",
        "The plaintiff’s case": "16 The plaintiff’s case was that Mr Hong and Mr Liu had, since 2009, schemed to set up a competing company. To this end, they set up the Kikocci Corporation and worked on the Kikocci Project during their working hours while still employed by the plaintiff, using the plaintiff’s resources. They eventually decided to incorporate Nice Payroll with Mr Li, and used the plaintiff’s copyrighted and/or confidential materials to develop Nice Payroll’s business and software codes. Five claims were made against the defendants. 17 First, Mr Hong and Mr Liu’s reproduction of the plaintiff’s copyrighted material amounted to copyright infringement. Nice Payroll’s products and/or services also infringed the plaintiff’s copyright.23Foot Note 23×Statement of Claim (Amendment No. 2) in Suit 585/2013 (“2ASOC”) at paras 7–10.1. 18 Second, the defendants acted in breach of their duties of confidence to the plaintiff by reproducing its confidential material, by using its source codes and databases to generate Nice Payroll’s payroll reports, and by reporting data breaches to HSBC and ADP. Mr Hong also breached his duty of confidence by accessing the plaintiff’s demonstration platform without its authorisation.24Foot Note 24×2ASOC at paras 12–19. 19 Third, Mr Hong acted in breach of contract. He breached his non-disclosure agreement (“NDA”) by retaining the plaintiff’s confidential information and using it for Nice Payroll’s business purposes; breached its Information Technology (“IT”) security policy; and breached his implied duty of good faith by working on the Kikocci Corporation and/or Nice Payroll during the plaintiff’s working hours and by taking its confidential information.25Foot Note 25×2ASOC at paras 20–23. 20 Fourth, Mr Hong and Mr Liu engaged in the tort of conspiracy to set up a competitor firm in breach of the plaintiff’s confidence. Mr Li was involved in their conspiracy to infringe the plaintiff’s copyright and breach its confidence.26Foot Note 26×2ASOC at paras 24–31. 21 Fifth, Mr Li induced Mr Hong and Mr Liu to breach their respective NDAs with the plaintiff.27Foot Note 27×2ASOC at paras 32–37.",
        "The defendants’ case": "22 The defendants denied any infringement of copyright. Copyright did not subsist in the plaintiff’s software as it was insufficiently original, and the plaintiff did not own copyright in the Kikocci files. In any case, Nice Payroll’s software products and services did not constitute a substantial reproduction of the plaintiff’s software products, source codes and database structures: its software had been independently developed using programming language that differed from the plaintiff’s.28Foot Note 28×Defence (Amendment No. 1) in Suit 585/2013 (“AD”) at paras 7 and 8. 23 The breach of confidence claim was denied. The plaintiff was estopped from invoking its NDAs as it had not strictly enforced its security policies. The defendants had not used the plaintiff’s source codes, systems and databases to generate payroll reports. Mr Hong had not accessed the plaintiff’s demonstration platform to utilise its confidential information. Mr Hong and Mr Liu had not reported the plaintiff’s data breaches to interfere with its relations with HSBC and ADP.29Foot Note 29×AD at paras 13–18.The breach of contract claim was denied on similar grounds.30Foot Note 30×AD at paras 19–26. 24 No conspiracy existed: Mr Li was an angel investor who had been unaware of Mr Hong’s and Mr Liu’s previous employment. His lack of knowledge as to Nice Payroll’s possession of the plaintiff’s materials and the arrangements between Mr Hong and Mr Liu and their previous employers also meant that no inducement of breach of contract occurred.31Foot Note 31×AD at paras 27–36.",
        "The parties’ cases in Suit 965/2015": "25 The plaintiff claimed that Mr Tan had reproduced and/or adapted the plaintiff’s copyright material in the development of Nice Payroll’s source codes, systems, materials and other documents and to generate payroll reports for Nice Payroll and its customers. This amounted to copyright infringement and breach of confidence.32Foot Note 32×Statement of Claim in Suit 965/2015 (“SOC”) at paras 6–8 and 9–14.He conspired with Mr Hong and Mr Liu to commit these offending acts.33Foot Note 33×SOC at para 15. 26 Mr Tan denied the claims against him as unsubstantiated by evidence. He had not accessed the plaintiff’s source codes for the purposes of copying, reproducing or adapting them. He had also not breached the plaintiff’s confidence: even if he was sent some of its materials as email attachments, it was not proved that he had actually referred to and used the plaintiff’s confidential materials when programming and preparing documents for Nice Payroll. Comparisons of the alleged source material with Nice Payroll’s materials would show that no reproduction or adaptation took place.34Foot Note 34×Tan’s Closing Submissions at paras 3–33.",
        "My decision": "27  I was not satisfied that the plaintiff’s claims had been made out on the balance of probabilities. While there were perhaps strands of evidence that pointed to a suspicion of breaches by the defendants in the Suits, this was not enough to bring the plaintiff over the requisite evidential threshold. The strength of the inferences drawn from the evidence was not to the extent that it was more likely than not that the plaintiff’s assertions were true, as opposed to the alternative explanations proffered by the defendants. 28 Much of the parties’ cases turned on the strength of the respective sides’ expert evidence. To this end, concurrent evidence sessions were held for the software and forensic experts. The approach adopted here was as follows. The experts first summarised their positions in presentations. Based on these presentations, counsel identified issues that remained contentious, which set the parameters for the witness conferencing that followed. The contested issues were then raised in sequence. The plaintiff’s expert would raise matters directly to the defendants’ expert for his response or clarification; the plaintiff’s expert would afterwards be given time to make further responses. Finally, the defendants’ expert would raise any further points on that specific topic for the plaintiff’s expert to respond to. Given the technical nature of the canvassed matters, I was of the view that this format permitted the experts to raise matters directly to the court rather than through counsel, and allowed them to reach consensus where possible, or otherwise to identify more clearly the areas of contention between the parties. 29 In general, I preferred the defendants’ expert evidence in respect of the questions of both coding and forensics. I found the defendants’ experts’ opinions to generally be more cogent, in terms of their explanations and reasoning. I would emphasise, however, that I did not find that the plaintiff’s experts’ testimony was in any way partial or in breach of the obligation owed to the court, as the defendants contended in their submissions.35Foot Note 35×Defendants’ Closing Submissions (“DCS”) at paras 20–22. 30 I also proceeded on the basis that as the factual bases and issues relating to liability in the plaintiff’s causes of action overlapped considerably, the resolution of issues in respect of one cause of action would have an impact on the remaining claims left to be decided. It bears noting that the plaintiff’s submissions departed at various points from its pleadings. Where this occurred to a great extent, I limited my consideration to its claims as pleaded. 31 I now turn to the specific issues raised.",
        "Issue 1: Copyright infringement": "32 I found that copyright generally subsisted in the plaintiff’s materials and that the plaintiff had ownership of the copyright. Any possible lack of distinction or quality was not sufficient here to deny that copyright subsisted in the claimed materials. However, I did not find that the plaintiff’s copyright was infringed. While the plaintiff showed that the defendants had access to its materials, there was no substantial copying of the plaintiff’s software and source codes in the generation of Nice Payroll’s various databases, templates, and other files and documents. While there may have been some similarity between the materials, it did not follow and was not proved that copying had occurred.",
        "Preliminary matters": "Categorisations and whether pleadings were properly made 33 The plaintiff set out a list of materials over which it claimed copyright.36Foot Note 36×2ASOC at para 10.1 and Annex B.It submitted that its copyrighted material fell into five categories:37Foot Note 37×Plaintiff’s Closing Submissions (“PCS”) at para 40. (a) source codes for its payroll software systems and human resource information system (“HRIS”) (“Category 1 materials”); (b) databases and other materials constituting the technical infrastructure supporting its payroll software systems and HRIS (“Category 2 materials”); (c) business development and client-related materials (“Category 3 materials”); (d) materials related to its operations,eg, documents setting out internal guidelines and policies (“Category 4 materials”); and (e)source codes developed as part of the Kikocci Project (“Category 5 materials”). 34 The defendants took objection to the plaintiff’s copyright claims over materials not covered by its pleadings. The plaintiff had claimed copyright to materials set out at Annex A of the amended statement of claim in Suit 585/2013 (“2ASOC”), and had listed materials that were allegedly infringing copies of its materials at Annex B of the 2ASOC. However, some of the materials in the plaintiff’s proposed categorisation were pleaded only in relation to the breach of confidence claim, and listed at Annex C of the 2ASOC (eg, the files “Payitem_Singapore.xls” and “LenovoSG.xls” in Category 2 and “HK Statutory_rev28Feb2011.doc” in Category 3).38Foot Note 38×See 2ASOC at para 19 and Annex C; DCS at paras 259 and 287; Defendants’ Reply Submissions (“DRS”) at para 20. 35 I had some sympathy for the defendants on this point; the plaintiff’s pleadings could have been clearer as to which of the defendants’ materials allegedly infringed its copyright. However, the ultimate question at the end of the day was whether the plaintiff’s pleadings were sufficient: seeInvenpro(M) Sdn Bhd v JCS Automation Pte Ltd and another[2014] 2 SLR 1045 (“Invenpro”) at [127]. This issue arose inGlobal Yellow Pages Ltd vPromedia Directories Pte Ltd and another matter[2017] 2 SLR 185 (“Global Yellow Pages”) at [54] to [56], where the Court of Appeal disagreed with the High Court that the statement of claim in question had been framed in sufficiently broad and general terms as to include a temporary database which had not been referenced in the initial pleadings. The Court of Appeal noted as follows: 54    Promedia submits that the Judge erred in holding that the temporary database was covered by GYP’s pleadings. … 55    We agree with Promedia’s argument. The statement of claim (“SOC”) states that the infringing works comprised Promedia’s directories, which are the Online Directory, the printed form directories and the Green Book CD-ROM. … The use of “namely” (instead of “including”) suggests that the list of allegedly infringing works is exhaustive, while the lack of any reference or allusion to databases suggest that they were not regarded as infringing works. In this respect, we respectfully disagree with the Judge, who held at [367] of the Judgment that the SOC was framed in sufficiently broad and general terms such that the temporary database could be regarded as an infringing work. … 36 The result inGlobal Yellow Pagesturned on the use of the word “namely”, which suggested that the list of infringing materials contained in the statement of claim was exhaustive. The present case, however, differs. Given the interlinked nature of the causes of actions and looking at the pleadings as a whole, I found that the defendant was not prejudiced by any insufficient particularity in the pleadings. Critically, the plaintiff’s case in relation to breach of confidence asserted that the defendants had reproduced and copied its confidential information and materials as listed at Annex C.39Foot Note 39×2ASOC at para 17(a).The agreed list of issues in Suit 585/2013 between the parties also included the question of whether copyright subsisted in the materials listed at Annexes A to C of the 2ASOC.40Foot Note 40×Lead Counsel’s Statement, Agreed List of Issues, S/N 1.I thus considered the merits of the plaintiff’s copyright claim in relation to the Annex C materials as well, as raised in its submissions. Basic terminology: Database architecture, tables and components 37 For clarity, I set out some definitions of terms that will be used. Other terms will be defined in my grounds of decision where necessary. 38 The current case concerns payroll software used to record employee information, compute and record payroll items, and generate payrolls.41Foot Note 41×Yap’s Expert Report, exhibited to Yap’s AEIC (“Yap’s Expert Report”), at para 3.2.3.These payrolls contain payitems, which are payment components in payslips,eg, salary amounts, Central Provident Fund (“CPF”) contributions and bonuses.42Foot Note 42×Lakshminarayanaswamy Chandra Mohan’s (“Chandra’s”) AEIC at para 6. 39 Associate Professor Roland Yap (“Prof Yap”), the defendants’ coding expert, helpfully defined elements of software programs. I reproduce his definitions here. Software, which is developed as source code, is written in programming languages. These vary in syntax, expressive power and areas of application. The present case concerned two programming languages: Java, a general purpose programming language, and Structured Query Language (“SQL”), a more domain-specific programming language whose purpose is to query and manipulate databases.43Foot Note 43×Yap’s Expert Report at para 3.2.2.An SQL “query” causes a database to give a result without changing the database itself.44Foot Note 44×Yap’s Expert Report at p 101, S/N 31.Prof Yap explained that software which deals with large amounts of data may choose to utilise a database. To expand:45Foot Note 45×Yap’s Expert Report at paras 3.2.2(c), 3.5.1, 3.5.2 and 7; NEs (May 9 2018) at p 16 ln 15–23. (a) Many types of databases exist. In this context, a “database” refers to a relational database that organises, processes and stores data as relations. Databases do not appear visually as tables or spreadsheets; they are logical constructions which the database software presents to the programmer. (b) The plaintiff’s and Nice Payroll’s systems used the Oracle database, a relational database management system. The Oracle database uses PL/SQL, a proprietary programming language extension to SQL.46Foot Note 46×Yap’s Expert Report at para 3.6.10. (c) A database is made up of one or more schemas, which comprise the database’s architecture. Each schema contains one or more “database tables”, which organise data into columns and rows. Each column, or “field”, stores data of a certain logical type,eg, “birthday” fields store data having a “date” type. Data is stored as rows in the tables. (d) A schema does not define the data contained in the tables. In Oracle, the schema defines the structural relationships in the database by specifying the tables and fields, and the relationships between the data in rows of a table,etc.47Foot Note 47×Yap’s Expert Report at p 21; NEs (9 May 2018) at p 18 ln 12 – p 19 ln 15.The schema may also define one or more columns to be “primary keys”. The values in the primary key should be unique within the table, giving rise to a “uniqueness constraint”, such that rows with duplicate keys cannot be inserted in the same table. 40 The following table illustrates how the above terms are used:48Foot Note 48×Yap’s Expert Report at pp 20 and 21. Employee IDNameDepartmentSkill1001Aliceadministrationlaw1002Bobmarketingpsychology In this table, data corresponding to every employee is contained in a row. The “Employee ID” field is the primary key. No two rows will have the same primary key, and the primary key determines and constrains the values of the other fields in the row. As the order of rows and columns is not critical, the database will treat the following table to be the same as the previous table: SkillNameEmployee IDDepartmentpsychologyBob1002marketinglawAlice1001administration",
        "The applicable law": "41 The defendants disputed the subsistence of copyright in the plaintiff’s materials, the plaintiff’s ownership of this copyright and whether such copyright was infringed. I briefly set out the applicable law in relation to these issues. 42 To succeed in a claim for copyright infringement, a plaintiff must prove that copying has taken place, which can come in the form of establishing similarity combined with proof of access to the plaintiff’s works:Flamelite(S) Pte Ltd and others v Lam Heng Chungand others[2001] 3 SLR(R) 610 at [27];Invenproat [202]. 43 Copyright subsists in original literary works: s 27 of the Copyright Act (Cap 63, 2006 Rev Ed) (“Copyright Act”). Literary works include compilations in any form and computer programs: s 7A(1) of the Copyright Act. In the context of compilations, the compiler must exercise sufficient creativity in selecting or arranging the material within the compilation. The resulting copyright only protects the original expression in the form of the selection or arrangement of the material. Ultimately, the court is guided by the fundamental principle that copyright law protects not ideas, facts or data, but the expression thereof:Global Yellow Pagesat [24] and [30]. 44 For copyright to subsist in any literary work, there must be an authorial creation that is causally connected with the engagement of the human intellect:Global Yellow Pagesat [24]. The concept of authorship is integral to copyright, and a human author must first be identified before the work in question can be deemed to be original: seeAsia Pacific Publishing Pte Ltdv Pioneers & Leaders (Publishers) Pte Ltd[2011] 4 SLR 381 (“Asia Pacific Publishing”) at [94]. It is not necessary to name each and every author to make out a claim, but it must be shown that the product was generated from a human author or human authors working alone or collaboratively,ie, the existence of such persons must be clearly established:Asia Pacific Publishingat [75]. A body corporate may not be considered the author of an original work, but may be the copyright owner by virtue of the operation of a contract of employment or an assignment: see s 194 of the Copyright Act andAsia Pacific Publishingat [56]. 45 Having established that copyright subsists in an original work and that a plaintiff owns such copyright and haslocusstandito bring a claim, the court considers whether copyright hasprima faciebeen infringed. Copyright is only infringed if there has been a copying of a substantial part of the protected works. Substantiality depends on the quality, not quantity, of the material copied; the defendant must have copied or taken the parts of the work that contributed towards the finding of originality:Global Yellow Pages Ltd vPromedia Directories Pte Ltd[2016] 2 SLR 165 at [239]. A causal connection between the plaintiff’s copyrighted work and the defendant’s infringing work must also be shown:Asia Pacific Publishingat [108];Invenproat [213].",
        "Category 1 materials: Source codes": "Whether copyright subsisted in the materials 46 The defendants submitted that the plaintiff’s software was not original. There was no evidence of the creation and intellectual effort expended on the source codes, or of the plaintiff’s creative process. Prof Yap’s unrebutted evidence also showed that the plaintiff’s software lacked originality in respect of its source codes.49Foot Note 49×DCS at paras 51–60.Payroll tasks are conceptually straightforward, involving (a) storing and retrieving HR information, which can be carried out through a database; (b) computing payroll items, which is governed by the definition of the particular payitem (eg, the amount of CPF due, which is defined by the CPF Board rules); and (c) generating reports or bank statements, which is straightforward.50Foot Note 50×Yap’s Expert Report at paras 3.3.2.1 and 3.3.2.5. 47 The plaintiff responded that the defendants’ denial of the subsistence of copyright had not been properly pleaded. Regardless, affidavit evidence attested to the efforts of the plaintiff’s employees in developing its software.51Foot Note 51×Kim’s AEIC at para 20; Sutrisno’s AEIC at paras 46–48.Its software was sufficiently original: while its functions might be predefined, copyright subsisted in the expression of the codes and databases to achieve those functions. Intellectual effort would also have been required to ensure that the source code and databases properly operated, and to determine how the input data was to be expressed, presented and collated.52Foot Note 52×Plaintiff’s Reply Submissions (“PRS”) at paras 13 and 19(c). 48 I observed that the plaintiff did not identify specific authors of the materials. To this end, I consideredAsia Pacific Publishing,where a body corporate asserted authorship over horse-racing information organised in various tables. The respondent could only identify its employees as having gathered and organised the information and data in the tables (at [77]); the Court of Appeal found that such facilitative work did not amount to authorship: at [78]. As the collection, organisation and selection of data were done by separate people, each individual employee’s contribution (which had not been particularised) was insufficient to render them an author or joint authors of the tables: at [79]. The Court of Appeal also considered that the respondents might have been unable to identify authors as a high degree of automation might have been involved in compiling the tables: at [81]. In the circumstances, without the identification of a human author, there could be no “original work” capable of copyright protection, and the respondent’s claim that copyright subsisted in the tables that were “authored” by it failed: at [82]. 49 This, however, was not a case where it was seriously disputed that some human intellectual input resulted in the creation of the Category 1 materials. Indeed, there was no suggestion that the materials came from anywhere else. The evidence before me was sufficient for me to draw the conclusion that they were authored by the plaintiff’s employees. 50 As regards the originality of the plaintiff’s software, I did not find Prof Yap’s evidence to be relevant: the expert witnesses had been brought in to consider the question of copyright infringement, and not the issue of originality. I ultimately considered copyright to subsist in the plaintiff’s software, which was a computer program under s 7A(1)(b) of the Copyright Act. The criteria for originality within the meaning of ss 7A and 27 of the Copyright Act requires merely that the work was independently created by the author and that it possesses some minimal degree of creativity: seeGlobal Yellow Pagesat [15]. The plaintiff’s independent work in creating the source codes exceeded this low threshold. Whether the plaintiff owned the copyright 51 The defendant contended that no evidence was led as to who the authors of the plaintiff’s software were, and that no development documents were produced by the plaintiff.53Foot Note 53×DCS at paras 45–47.This was not fatal to the plaintiff’s claim, and I was satisfied that the plaintiff owned any copyright subsisting in its software by virtue of the assignment clauses in its employees’ contracts of employment. I accepted that copyright was assigned to the plaintiff by operation of cl 3.1 of the plaintiff’s standard form employment contracts and cl 4.1(a) of its Employee IT Security Policy 2007 (the “2007 IT Policy”). Copyright owned by i-Admin (Shanghai) was also assigned to the plaintiff through a deed of assignment.54Foot Note 54×Kim’s AEIC at paras 21 and 22. Whether the plaintiff’s copyright wasprima facieinfringed 52 Although the plaintiff claimed that its copyright in specific source codes and software materials (eg, the files “BankDiskOCBCSGONI.java” and “BankDiskSGP7144.java”) was infringed,55Foot Note 55×PRS at para 61.it only submitted that two main aspects of its software were substantially reproduced as part of Nice Payroll’s software: its database structures56Foot Note 56×PCS at paras 325–332.and result upload functionality.57Foot Note 57×PCS at paras 333–335.Mr Harish Pillay (“Mr Pillay”), the plaintiff’s coding expert, did not opine on the other files listed. I therefore did not consider these files as part of the copyright claim. Claims that the plaintiff’s materials were “utilised” to develop Nice Payroll’s software will instead be considered as part of the plaintiff’s breach of confidence claim. 53 I first explain the software aspects which the plaintiff sought to compare. The database structures referred to different database tables which were structured to serve given purposes,eg, to calculate Hong Kong tax declarations (the plaintiff’s “TAX_VTA_RRP”) and to collect calculated results from the payroll engine (the plaintiff’s “PR_PAYROLL_RESULT”).58Foot Note 58×Pillay’s Expert Report, exhibited to Pillay’s AEIC (“Pillay’s Expert Report”), at para 50; Liu’s AEIC at paras 148 and 153.Both software’s “result upload functionality” referred to the use of Java codes whose function was to upload payroll results in Microsoft Excel spreadsheets into the respective payroll databases, bypassing the payroll engine in the process.59Foot Note 59×Yap’s Expert Report at para 5.6.3. (1) Database structures and software elements 54 In relation to the database structures, the plaintiff relied on Mr Pillay’s evidence that the database structures of Nice Payroll’s payroll system were “essentially similar” to the plaintiff’s. He conducted an “ocular comparison” and identified similarities in the database tables’ naming conventions and the order in which they were organised.60Foot Note 60×Pillay’s Expert Report at paras 50–55. 55 The defendants disputed Mr Pillay’s methodology on two grounds. First, the database structures could not be compared in isolation from the overall database architecture and design of the source code. Second, the plaintiff’s expert had selectively compared only four of the plaintiff’s 32 database tables, and had compared only the column names in the database tables. These were insufficient bases to conclude that there were substantial similarities between the selected tables, let alone Nice Payroll’s entire database.61Foot Note 61×DCS at paras 171–174. 56 I found the defendants’ submissions compelling. I understood from the expert evidence that the database tables were but a component of the overall database architecture. While the tables contained data, their contents were only given meaning when they were “called upon” or referred to by the source code. In this sense, the meaning to be ascribed to the data would be encoded in the source code; the “logic” of the software was found in the source code.62Foot Note 62×See NEs (9 May 2018) at p 34 ln 2–11; p 47 ln 16 – p 48 ln 21; p 50 ln 7 – p 53 ln 4.I agreed with the defendants that it was thus necessary to consider the overall architecture and design of its software to determine whether the plaintiff’s copyright in its software had been infringed. This would entail a consideration of the programming language used and the logic of the source code, as well as the database components which the source code drew upon. It was not sufficient to focus on the contents of the database tables alone. 57 To this end, Dr Yap explained the plaintiff’s software architecture to be a three-tier application architecture: (a) the software was presented on webpages using JavaServer Pages on the “presentation tier”; (b) the main application logic was written in Java on the “logic tier”; and (c) the logic tier interfaced with the “data tier” (the Oracle database) using SQL. In comparison, Nice Payroll’s software architecture was written in APEX, an application development tool that ran within the Oracle database. Nice Payroll’s data, application logic and user interface were stored in and on the Oracle database. Nice Payroll’s application development required the application logic (code) to be written in PL/SQL.63Foot Note 63×Yap’s Expert Report at para 3.7.2.This was not disputed by Mr Pillay, who explained that the two software environments had been built upon inherently different programming languages, such that it was of “no good value” comparing the two. Instead, he compared “what was left”,ie, the database tables which the code relied upon, and the output of the payroll systems: the payroll report itself.64Foot Note 64×NEs (9 May 2018) at p 48 ln 23 – p 49 ln 23; p 53 ln 8–16. 58 The defendants submitted that the plaintiff’s and Nice Payroll’s software were so substantially different that it would have been extremely time- and cost-inefficient to develop Nice Payroll’s software from the plaintiff’s:65Foot Note 65×DCS at paras 67–73. (a) The plaintiff’s source code was larger than Nice Payroll’s. Much of Nice Payroll’s PL/SQL code was automatically generated by the APEX application builder used by its human programmers, which meant that the actual code written by its programmers was even smaller. A great deal of effort would have been required to reproduce the plaintiff’s code by translating it into a different language and then shrinking it. (b) The plaintiff made extensive use of Java’s language features, Java being a much more powerful programming language than PL/SQL. The difference in programming languages meant that the plaintiff’s program could not be meaningfully compared to Nice Payroll’s. (c) The plaintiff isolated its database by client. This allowed it to engage in specific database customisation. Its SQL queries were embedded into its Java code and called upon multiple database tables. In comparison, Nice Payroll’s client data was stored in a single database and its PL/SQL code was integrated with its SQL queries and called on a single database schema. (d) The core functionality in the two payroll systems differed. For instance, the payroll calculation algorithms differed: the plaintiff’s Java code computed payrolls at the individual payroll item level, sequentially processing each employee’s payroll; Nice Payroll’s algorithm computed payrolls at the employee level, computing payroll items per employee. As the inner and outer loops for calculation were completely different, the plaintiff’s code would have required complete rewriting to be converted into Nice Payroll’s. In addition, the database architectures of the two systems differed: the plaintiff’s software included more schemas and tables, the contents of the database tables were organised differently, and different primary keys were used.66Foot Note 66×DCS at paras 63–65, 178–192.Prof Yap additionally disagreed with Mr Pillay’s focus on the software output, as different software could produce similar or identical payroll reports.67Foot Note 67×NEs (9 May 2018) at p 52 ln 13–20. 59 For the plaintiff’s claim in respect of the software to succeed, it had to prove that the defendants copied a substantial part of the work that contributed towards the finding of originality. As I noted above at [50], what distinguished the plaintiff’s software was its organisation of its database architecture and its development of its source codes. The defendants’ expert evidence demonstrated on the balance of probabilities that Nice Payroll’s software was so fundamentally different that it could not have been copied from the plaintiff’s. To the extent that some similarities existed across the two systems, I accepted the defendants’ position that any similarities in Nice Payroll’s software and payroll output could be attributed to the functional and statutory requirements that informed what payroll reports should generally contain. I will comment on the payitem and CPF database tables in more detail below. (2) Result upload functionality 60 Mr Pillay gave evidence that it was unusual that Nice Payroll’s and the plaintiff’s result upload coding did not read data from the “Employee Name” field.68Foot Note 68×Pillay’s Expert Report at paras 58–60.The defendants responded that Mr Pillay should have compared the source codes before reaching a conclusion. They explained that Nice Payroll’s code read from the “Employee ID” field to minimise human error, and that the “Employee Name” field was retained to assist persons reading and uploading spreadsheets into the database. From a computer science viewpoint, the two codes were different as they were based on different algorithms involving different error handling and processing logic.69Foot Note 69×NEs (9 May 2018) at p 59 ln 6 – p 61 ln 9; p 144 ln 12 – p 145 ln 10; DCS at paras 196–200; Yap’s Expert Report at para 5.6.7. 61 I accepted the defendants’ argument that the mere fact that both source codes did not read data from the “Employee Name” field did not constitute the copying of a substantial part of the plaintiff’s work. This quality alone did not render the plaintiff’s source code original, especially given that the other aspects of the codes were different. The copyright infringement claim in respect of this specific functionality therefore did not succeed.",
        "Category 2 materials: Databases and technical infrastructure": "62 The plaintiff classified its Category 2 materials to comprise: (a) its payitem databases, comprised in the Microsoft Excel (“Excel”) files “payitem setup_iAdmin.xls”, “Payitem_Singapore.xls” and “LenovoSG.xls”;70Foot Note 70×PCS at para 51; Agreed Bundle (“AB”) at Folder (3), S/N 46, 47 and 48 respectively.and (b) its CPF database, which was “comprised in a form … substantially similar to the document ‘cpf.xls’”.71Foot Note 71×PCS at para 57; LJW-1 Tab 26 (attachment) exhibited to Liu’s AEIC; AB at Folder (2), S/N 21. 63 The parties understood the plaintiff’s case to be that: (a) The files “Payitem_Singapore.xls” and “LenovoSG.xls” (“the plaintiff’s Payitem Bibles”) were created by the plaintiff and generated from its database tables.72Foot Note 72×Chandra’s AEIC at paras 26 and 28; Wenli Fan’s (“Fan’s”) AEIC at paras 61 and 62.They were circulated between the defendants and used to create the file “payitem_bible.xls” which was integrated into Nice Payroll’s payitem database table “PR_PAYITEM”.73Foot Note 73×PCS at para 245; DCS at paras 256–258. (b) The plaintiff’s database table “PAY_CPF_RULE”, which sets out the CPF Board calculation rules,74Foot Note 74×Fan’s AEIC at paras 7 and 8.was used to generate the file “cpf.xls”. The defendants used this file to generate their own CPF database table “PR_CPF_RATES_SGP”.75Foot Note 75×PCS at para 258; DCS at paras 155 and 167. 64 I observed that the file “payitem setup_iAdmin.xls” was only referenced in the plaintiff’s submissions to be a file that Mr Hong downloaded from the plaintiff’s demonstration platform and deleted on the day the Anton Piller order was executed.76Foot Note 76×PCS at paras 182(a) and 223; PRS at para 61(e).I thus disregarded it for the purposes of the copyright claim. 65 I also noted that the plaintiff’s use of technical language was not as precise as it could have been. I agreed with the defendants that the Excel files were not technically “databases and other infrastructure materials” (the plaintiff’s description of the Category 2 materials), as it was not shown that the files were part of the plaintiff’s source code or database architecture.77Foot Note 77×See DCS at paras 156(a) and 262; DRS at paras 22 and 25.Rather, they were compilations of data or representations of the data in the database tables within the software, and I will refer to them as such. Whether copyright subsisted in the materials 66 I took the plaintiff’s copyright claim to concern its database tables, and not the Excel filesper se. It was thus not strictly necessary for me to consider the latter. However, given that the plaintiff alleged the defendants to have used the Excel files to develop Nice Payroll’s infringing databases, I shall address them as well. 67 I accepted the plaintiff’s position that the Excel files were generated from its database tables. The defendants did not dispute that the Payitem Bibles were the plaintiff’s, but contended that the “cpf.xls” file had not been generated from the plaintiff’s CPF database table.78Foot Note 78×See DCS at paras 167–170.Mr Liu had sent “cpf.xls” to Mr Tan in an email on 29 September 2011, such that it was later found in the defendants’ possession. Although Mr Liu claimed in his affidavit of evidence-in-chief (“AEIC”) that he did not recall how he had obtained a copy of the file,79Foot Note 79×Liu’s AEIC at para 197 and LJW-1 Tab 26 (attachment in email).he subsequently admitted under cross-examination that he had generated the file from i-Admin (Shanghai)’s system during his previous employment with it, but claimed that the file had only included headers with no data when he created it:80Foot Note 80×NEs (10 July 2017) at p 153 ln 6–11; p 155 ln 12–20. Q:  Do you confirm that when this table was generated without the data as you claim, this table must have been generated from the i-Admin system? A:  Because the file -- Q:  \"Yes\" or \"no\"? A:  Yes. … Q: So you are saying that you -- then, when you made that [SQL] query to generate this Excel spreadsheet, you made the query to generate just the headers but with no data from the i-Admin CPF rules table? A: Based on the function in PL/SQL developer, it has this function. COURT:  But you just confirm that you did this deliberately? A: I think so. Just -- this is the file [“cpf.xls”] I have discovered in my thumb drive, but there's no data inside. Mr Liu further claimed that he only populated the file with data subsequently.81Foot Note 81×NEs (10 July 2017) at p 154 ln 6–17. 68 On the plaintiff’s end, Mr Pillay’s evidence was that the file “cpf.xls” and the Excel file which the plaintiff generated from its CPF database table for the purposes of comparison (ie, the file “pay_cpf_rule.xls”) were more than 90% identical.82Foot Note 82×Pillay’s Expert Report at para 42 and Annex 38.The defendants focused on the dissimilar data entries in these two Excel files to submit that “cpf.xls” could not have been generated from the plaintiff’s database.83Foot Note 83×DCS at para 169.I found on the balance of probabilities that while the file “cpf.xls” had been generated from the plaintiff’s database table, the evidence only went so far as to establish that the generated file included headers and not data at the time of its creation. 69 I next considered whether copyright subsisted in the plaintiff’s databases and the Excel files generated from them. I agreed with the defendants’ characterisation of the plaintiff’s Payitem Bibles.84Foot Note 84×See DCS at para 260.They were compilations of information on items calculated in the payroll process:inter alia, the worksheets in the Excel files listed descriptions of payitems and their natures.85Foot Note 85×See Chandra’s AEIC at paras 25 and 27.The data in “cpf.xls” set out CPF calculation rule data and CPF contribution rates for different income and age ranges as of September 2011.86Foot Note 86×PCS at para 58; Liu’s AEIC at para 197. 70 The defendants submitted that copyright did not subsist in the plaintiff’s Payitem Bibles. First, there was no information about the time, effort and skill taken to compile the payitem information in the Payitem Bibles. Second, there was no originality in listing the payitems and their natures, which were dictated by statutory regulations and client instructions.87Foot Note 87×DCS at para 261.Third, payroll systems are expected to store relevant payroll information,eg, information pertaining to the company and personal details of employees. The content and arrangement of the plaintiff’s database tables were typical of payroll systems generally and thus unoriginal in that respect. Payroll processing is also constrained by mandatory statutory requirements,eg, the CPF Board rules. Similarly, the plaintiff’s CPF database structure did not attract copyright protection as it was a transliteration of the data in the CPF Board rules, which were widely available on the Internet.88Foot Note 88×Yap’s Expert Report at paras 3.3.1.4 and 3.3.1.7.Excel files derived from the database tables would also not attract copyright.89Foot Note 89×DCS at paras 156(b)–158. 71 I did not agree with the defendants. I preferred the plaintiff’s position that even if payitem and CPF information was publicly available, intellectual effort, analysis, industry knowledge, and knowledge of regulatory rules, HR policies and employment best practices were still required to organise the information into a format that was suitable for processing by a computer program.90Foot Note 90×Chandra’s AEIC at para 8; PRS at paras 50–52 and 56(a).I was satisfied that the organisation of the relevant information into columns and rows in a database table involved a minimal degree of creativity, and that the database tables therefore constituted compilations of facts under s 7A(1)(a) of the Copyright Act that were original and attracted copyright protection:Global Yellow Pagesat [15]. I also found that such copyright protection extended to any Excel files generated from the database tables. To the extent the information was publicly available, this only affected whether the resultant copyright protection was “thin”’, as copyright protection would not extend to the data contained in the tables and Excel files. I will return to this below. Whether the plaintiff owned the copyright 72 As with the plaintiff’s software, it was not crucial for the plaintiff to prove which human authors created the database tables in question. I found that the plaintiff’s employees had created the database tables and that it owned the copyright subsisting in these works by operation of the assignment clauses in the relevant employment contracts. Whether the plaintiff’s copyright wasprima facieinfringed 73 The plaintiff claimed that the defendants had utilised its payitem and CPF databases to create Nice Payroll’s databases and other materials.91Foot Note 91×PCS at paras 244–256 (payitem databases) and 257–279 (CPF databases).I was persuaded by the defendants’ arguments that there was no substantial copying of the database tables, given the structural differences between the plaintiff’s and Nice Payroll’s payitem and CPF database tables. (1) Payitem database tables 74 The plaintiff argued that the defendants adapted its Payitem Bibles to create the file “payitem_bible.xls”. On 16 August 2011, Mr Hong sent the plaintiff’s Payitem Bibles to Ms Vercilia Lim (“Ms Lim”), a payroll operator at Nice Payroll. Mr Hong had found that the list of approximately 50 payitems which Ms Lim had prepared was “not detailed enough”, and instructed that she merge the payitems of the plaintiff’s Payitem Bibles with Nice Payroll’s own.92Foot Note 92×Pillay’s Expert Report at Annex 15 (email on 16 August 2011); NEs (6 July 2017) at p 14 ln 25 – p 15 ln 18.Mr Hong acknowledged under cross-examination that he sent Ms Lim the plaintiff’s Payitem Bibles to save on time and costs.93Foot Note 93×NEs (6 July 2017) at p 17 ln 5–13.The plaintiff relied also on Mr Pillay’s evidence, which tracked the emails sent between Nice Payroll’s employees to establish how the different iterations of Nice Payroll’s payitem bible were built upon the plaintiff’s.94Foot Note 94×Pillay’s Expert Report at para 32.Nice Payroll’s source code ultimately drew upon “the contents of the document ‘Payitem_bible.xls’ (as integrated into [Nice Payroll’s] database)”.95Foot Note 95×Pillay’s Expert Report at para 39. 75 In response, the defendants first submitted that the plaintiff had conflated two files: “Payitem Bible_Singapore.xls” and “payitem_bible.xls”.96Foot Note 96×DCS at para 258.They implicitly accepted that the first Excel file had been adapted from the plaintiff’s Payitem Bibles.97Foot Note 97×DCS at paras 270–272.However, as “Payitem Bible_Singapore.xls” was not part of the source codes, the defendants rejected Mr Pillay’s evidence as given outside his field of expertise: being a coding expert, it was impermissible for him to comment on the similarities of the plaintiff’s Payitem Bibles and the file “Payitem Bible_Singapore.xls”.98Foot Note 98×DCS at para 263.In any case, the defendants denied the claim of copyright infringement. Any similarities between these files were limited to the copied facts, and not the arrangement of those facts; there was hence no copyright infringement.99Foot Note 99×DCS at para 273. 76 I agreed with the defendants in this regard. As I alluded to above at [71], the copyright protection extended to compilations of facts does not extend also to the facts and data contained therein. It was clear that there was no reproduction of the plaintiff’s arrangement of the contentsper se; otherwise, the plaintiff would have compared the database tables or the Excel files directly, without having to rely on document comparisons showing the “evolution” of the plaintiff’s Payitem Bibles into the file “Payitem Bible_Singapore.xls”. This indicated to me that the final product in the form of “Payitem Bible_Singapore.xls” was sufficiently distinct from the plaintiff’s Payitem Bibles such that no copying could be said to have taken place. 77 As for the file “payitem_bible.xls”, the defendants submitted that this was an Excel file generated from Nice Payroll’s database table “PR_PAYITEM”, and therefore a representation of “PR_PAYITEM”. An assessment of its similarity to the plaintiff’s payitem database tables required consideration of the development and design of the respective source codes; Mr Pillay’s focus on whether “PR_PAYITEM” was referred to in Nice Payroll’s source codes was irrelevant since the source codes would necessarily draw on the data contained in the database tables to operate and produce output.100Foot Note 100×DCS at paras 265–267. 78 To this end, Prof Yap compared the plaintiff’s and Nice Payroll’s source codes, how they interacted with the payitem database tables, and the schemas of the database tables.101Foot Note 101×NEs (9 May 2018) at p 93 ln 3–5.He concluded that Nice Payroll’s code differed from the plaintiff’s in that it did not include the non-statutory “hard-coded” payitems found in the plaintiff’s code. He explained that most payitems are generic and simply serve as data to be drawn upon by the code; they are added or deducted from an employee’s payroll computation. However, certain payitems may be hard-coded if they require specific computation: code may be written to cater for a particular statutory computation. The plaintiff’s codes referred to at least 21 statutory and two non-statutory hard-coded payitems; Nice Payroll’s only included 12 statutory hard-coded payitems. Furthermore, the defendants’ payitem bible used a naming convention that contained more information that the plaintiff’s.102Foot Note 102×Yap’s Expert Report at paras 5.3.2.2–5.3.2.8.The defendants concluded that as the source code’s logic differed such that the parties’ database tables were used differently in their respective software, no copying had occurred. Any similarities that Nice Payroll’s payitem database table had to the plaintiff’s Payitem Bibles were explained by the fact that the data contained therein reflected what was found in the relevant statutory rules.103Foot Note 103×DCS at para 271. 79 I agreed with the defendants’ conclusion in relation to this matter as well. The question of whether substantial copying has occurred must consider what makes the copyrighted material original. I mentioned at [71] that the plaintiff’s database tables were original by dint of the creative effort invested to organise the relevant information into a format suitable for computer processing. It was therefore relevant to consider whether the defendants’ organisation of the database tables – both within the database schema andvis-à-visthe source code – was a reproduction of the plaintiff’s. I found Mr Pillay’s assessment of the defendants’ emails to be irrelevant to this analysis, and preferred Prof Yap’s evidence instead. It was on the basis of the latter that I was satisfied that differences in the naming conventions and the number and type of hard-coded payitems sufficiently distinguished Nice Payroll’s payitem database table from the plaintiff’s, and that no copying could be said to have occurred. (2) CPF database tables 80 Parties took similar positions as regards the CPF database tables. As the plaintiff submitted, this aspect of its claim did not concern the parties’ respective source codesper se.104Foot Note 104×PRS at para 54.Mr Pillay compared the cells and fields of the parties’ respective database tables to conclude that Nice Payroll’s CPF database had been “lifted or evolved” from the plaintiff’s.105Foot Note 105×PCS at para 277.Conversely, the defendants identified differences between the tables: Nice Payroll’s CPF database table was a more compact reformulation of the CPF Board rules, and had 17 columns to the plaintiff’s 24. Nice Payroll’s CPF calculation rules also involved algebraically equivalent but different arithmetic computations that optimised the CPF Board rules, resulting in more streamlined and simpler formulae.106Foot Note 106×DCS at para 161; Yap’s Expert Report at paras 5.4.3.1–5.4.3.10. 81 As above, I preferred the defendants’ more holistic approach towards the comparison of the database tables. I accepted that some similarities between the tables were a given, as both were limited by requirements in the CPF Board rules. But on the whole, there was clear evidence that Nice Payroll’s CPF database table was organised differently from the plaintiff’s. No copying had therefore occurred.",
        "Category 3 materials: Business development and client-related materials": "82 I only considered the materials that the plaintiff made submissions on: (a) the file “Copy of ePayroll eHR pricing for all regions(04 Jan 2011).xls”, which contained the plaintiff’s pricing information and business strategy material, stating fees offered for services rendered;107Foot Note 107×HYT-1 Tab 44 exhibited to Hong’s AEIC; AB at Folder (3), S/N 28. (b) the compressed folder “RR to Li Lian.zip”, which contained documents relating to the plaintiff’s operations, including its software and hardware technical platform, data security and security design architecture;108Foot Note 108×SJK-1 Tab 21 (attachment in email) exhibited to Kim’s AEIC; AB at Folder (18), S/N 426.and (c) the compressed folder “Standard Imp Template.zip”, containing the plaintiff’s implementation templates for six jurisdictions. It included the file “SG Client_Imp Template.xls”, which the plaintiff’s Singapore clients would input their data into for the plaintiff to process.109Foot Note 109×Kim’s AEIC at paras 40 and 82(a), SJK-1 Tab 18 (attachment in email). Whether copyright subsisted in the materials 83 The plaintiff submitted that copyright subsisted in these materials which had been created through a process of development of the plaintiff’s systems, pricing and business strategy.110Foot Note 110×PCS at para 63. 84 The defendants argued that the Category 3 materials were not original as no evidence had been led on why they were protected by copyright. In particular, the implementation templates were used for the purely functional purpose of collecting client data, and thus required no creative input to create.111Foot Note 111×DCS at paras 300, 295–299 and 277–278; DRS at para 28.I disagreed. Regardless of the purpose for which these materials had been created, the plaintiff had utilised business skill to arrange the templates in a manner that was thought to be most conducive to its clients’ data input. They had a “quality of character not possessed by the raw material”:Asia Pacific Publishingat [103] and [105], citingFortuity Pty Ltd vBarcza(1995) 32 IPR 517. The Category 3 materials were therefore protected by copyright. Whether the plaintiff owned the copyright 85 The defendants contended that the plaintiff had not led sufficient evidence as to the creation of the templates.112Foot Note 112×DCS at paras 279–281.I followed the approach I adopted towards the materials in Categories 1 and 2, and found that the plaintiff owned the copyright subsisting in the material. Whether the plaintiff’s copyright wasprima facieinfringed 86 The plaintiff submitted that the defendants had utilised its business development materials to develop Nice Payroll’s business development materials.113Foot Note 113×PCS at paras 315–324.The defendants responded that the plaintiff had not compared the allegedly infringing materials in question; indeed, Ms Fan Wenli, who managed the plaintiff’s database, agreed in cross-examination that the defendants’ and plaintiff’s implementation templates were dissimilar.114Foot Note 114×NEs (30 June 2017) at p 88 ln 15–24.I also noted that the plaintiff did not identify infringing materials belonging to the defendants that were alleged to have been copied from its copyrighted Category 3 materials. I therefore dismissed the copyright claim in relation to the Category 3 materials.",
        "Category 4 materials: Operational materials": "87 The defendants contended that the plaintiff failed to identify any materials that fell within Category 4.115Foot Note 115×DRS at para 30.I noted that the plaintiff did identify these materials in appendices to its submissions,116Foot Note 116×PCS at Appendix A, S/N 87–94, and Appendix B, S/N 28.but did not make substantive submissions in relation to them.117Foot Note 117×PCS at paras 64 and 65.Accordingly, no decision could be reached on whether copyright was infringed in relation to these materials.",
        "Category 5 materials: Source codes for the Kikocci Project": "88 It was not disputed that copyright subsisted in the Category 5 materials,ie, the source codes for the Kikocci software (“the Kikocci files”) which were created by Mr Liu during his employment with i-Admin (Shanghai). Rather, parties were concerned with the ownership of said copyright. 89 Both sides called foreign law experts to give evidence on People’s Republic of China (“PRC”) law relating to copyright in software. Ms Zhou Yan (“Ms Zhou”) and Ms He Wei (“Ms He”) were called for the plaintiff and defendants respectively. The relevant PRC legal materials relating to copyright ownership 90 Ms Zhou relied on Art 13 of the Regulation on Computers Software Protection (2013 Revision) (Order No 632 of the State Council) (“Computer Software Regulations”) in her expert opinion.118Foot Note 118×PCS at para 72; Zhou’s Expert Report, exhibited to Zhou’s AEIC (“Zhou’s Expert Report”) at para 3.1.The defendants submitted that two additional laws had to be considered: the Copyright Law of the People’s Republic of China (2010 Amendment) (“Copyright Law”) and the Regulation for the Implementation of the Copyright Law of the People’s Republic of China (2013 Revision) (Order No 633 of the State Council) (“Copyright Law Implementation Regulations”). In particular, Art 16 of the Copyright Law also had to be fulfilled for the plaintiff to claim ownership of the copyright in the Kikocci files.119Foot Note 119×DCS at paras 222 and 224. 91 I considered that Art 1 of both Regulations, which Ms He drew attention to, specified that the Regulations were “formulated in accordance with the Copyright Law”.120Foot Note 120×NEs (8 May 2018) at p 68 ln 6–17; He’s Expert Report, exhibited to He’s AEIC (“He’s Expert Report”) at Annexes 3 and 4.As Ms He explained, the Regulations are administrative regulations formulated by the State Council, an administrative body, and are subject to the Copyright Law, which is enacted by PRC legislative bodies.121Foot Note 121×NEs (8 May 2018) at p 67 ln 7–10; p 70 ln 7–14.Ms He did note that the Computer Software Regulations were specific laws that took “precedence” over the general Copyright Law,122Foot Note 122×NEs (8 May 2018) at p 39 ln 8–12.but I agreed with the defendants that they still had to be read in conjunction with the Copyright Law and the Copyright Law Implementation Regulations, and considered them together. 92 The relevant sections of Art 16 of the Copyright Law state:123Foot Note 123×He’s Expert Report at Annex 2, p 9. A work created by a citizen in the fulfilment of tasks assigned to him by a legal entity or other [organisation] is a work created in the course of employment. Subject to the provisions of the second paragraph of this Article, the copyright in such work shall be enjoyed by the author; … In any of the following cases, the author of a work created in the course of employment shall enjoy the right of authorship, while the legal entity or other [organisation] shall enjoy the other rights included in the copyright and may reward the author: (1) drawings of engineering designs and product designs, maps, computer software and other works which are created in the course of employment mainly with the material and technical resources of the legal entity or other [organisation] and for which the legal entity or other [organisation] bears responsibility; (2) works created in the course of employment the copyright in which is, in accordance with laws, administrative regulations or contracts, enjoyed by the legal entity or other [organisation]. Ms He’s expert opinion cited Art 11 of the Copyright Law Implementation Regulations as defining two terms used in Art 16 of the Copyright Law:124Foot Note 124×He’s Expert Report at para 6 and Annex 3. The term “tasks” … means the duties the citizen shall fulfil in the legal person or [organisation] by which he is employed. The term “material and technical resources” … means the funds, equipment or materials purposely provided to the citizen by the legal person or [organisation] by which he is employed for the creation of a work. 93 Article 13 of the Computer Software Regulations states:125Foot Note 125×He’s Expert Report at Annex 4. Where a piece of software developed by a natural person working in a legal entity or other [organisation] in the course of his service involves one of the following circumstances, the copyright therein shall be enjoyed by such legal entity or [organisation], which may reward the natural person for the development of the software: (1) the software is developed based on the development objective explicitly designated in the line of his service duty; (2) the software is a foreseeable or natural result of his work activities in the line of his service duty; or (3) the software is developed mainly with the material and technical resources of the legal entity or other [organisation], such as funds, special equipment or unpublished special information, and the legal entity or other organization assumes the responsibility therefor. Both experts agreed that copyright ownership by the plaintiff only required one of the three circumstances under Art 13 to be fulfilled. Application to the present facts 94 Assessing the evidence as a whole, I agreed with the defendants that the circumstances under Art 13 of the Computer Software Regulations read with Art 16 of the Copyright Law had not been fulfilled. 95 I first considered whether either Arts 13(1) or 13(2) had been fulfilled. The plaintiff submitted that it sufficed that Mr Liu had performed work on the Kikocci files from late 2009 to 30 April 2011, while employed by i-Admin (Shanghai). During this period, he was obliged under the terms of his employment to perform i-Admin (Shanghai)’s work.126Foot Note 126×PCS at para 73(a); Zhou’s Expert Report at para 5.2. 96 Conversely, the defendants looked into the capacity that Mr Liu had been employed in when he coded the Kikocci files. Although Ms Zhou’s expert opinion had not considered this aspect of the evidence,127Foot Note 127×NEs (8 May 2018) at p 15 ln 15–20.I found that consideration of this factor was required by the wording in Arts 13(1) and 13(2), which focus on whether a work has been developed in “the line of [an employee’s] service duty”. This was also supported by theSecond-InstanceWritten Civil Judgment of Dispute Over Ownership of Copyright Among Shanghai Enfang Information Technology Co., Ltd., Wang Siping and Taizhou Juyi Information Technology Co., Ltd.(2013) Zhe Tai Zhi Zhong No 1, a judgment by Taizhou City’s Intermediate People’s Court. The Intermediate People’s Court upheld the finding at first instance that the appellant company could not claim ownership over software developed by the respondent as there was inadequate evidence that there was a request or assignment for the respondent to develop the software in question.128Foot Note 128×Exhibit D18; translated judgment exhibited to Leong Yi-Ming’s (“Leong’s”) AEIC, LYM-2 at pp 32–33.Although Chinese judgments are not binding on other courts, I accepted Ms He’s evidence that they still serve as references.129Foot Note 129×NEs (8 May 2018) at p 66. 97 It was in this vein that the defendants submitted that Arts 13(1) and 13(2) of the Computer Software Regulations had not been fulfilled. I agreed. Mr Liu developed the Kikocci files in April or May 2010 when he was not employed in a software development capacity.130Foot Note 130×Liu’s AEIC at paras 14(f)–14(i) and 58; Kim’s AEIC at para 12.Indeed, i-Admin (Shanghai) had been unware of the Kikocci files until 2013, after Mr Liu left its employment.131Foot Note 131×DCS at paras 225–227.I also considered that the “last written dates” of the recovered Kikocci files dated from June to November 2010,132Foot Note 132×Tan Swee Wan’s Expert Report, exhibited to Tan Swee Wan’s AEIC (“Tan’s Expert Report”) at paras 5.18 and 5.19.predating Mr Liu’s move to i-Admin (Shanghai)’s applications department in December 2010, when he recommenced programming work at i-Admin (Shanghai). These factors together showed that the development of the Kikocci files were neither an “explicitly designated” development objective in the line of Mr Liu’s service duty nor a “foreseeable or natural result of his work activities in the line of his service duty”. I thus found that Arts 13(1) and 13(2) of the Computer Software Regulations had not been fulfilled. 98 Turning to Art 13(3) of the Computer Software Regulations, the plaintiff submitted that Mr Liu had created the Kikocci files using its material and technical resources. He had access to the plaintiff’s payroll source codes, databases, business information and client data, and utilised its hardware, software and other resources when developing the files. He used its computers to create the source code and used its servers and networks to communicate with Mr Hong about the Kikocci Project, and did both during office hours.133Foot Note 133×PCS at para 73(b); Zhou’s Expert Report at para 5.3. 99 The defendants contended that the plaintiff failed to show that Mr Liu had used the plaintiff’s “special and dedicated [programming] tools” to develop the Kikocci files. They relied on another Chinese judgment in support of their arguments: theSecond-Instance Written Civil Judgment of Dispute Over Infringement of the Right of Publication BetweenZhanyu Enterprise Development (Shanghai) Co., Ltd. and Li Xiaochu(2017) Hu 73 Min Zhong No 3 (“ZhanyuEnterprise”). 100 This decision did not apply the Computer Software Regulations, but considered whether para 2 of Art 16 of the Copyright Law entitled the appellant company to claim ownership of copyright subsisting in three posters. The first instance court held that the appellant company’s computer, hard disk and office hours were not “specially provided” for the respondent to create the copyrighted works for the appellant company. The Shanghai Intellectual Property Court upheld this decision on appeal. It held that “material and technical resources” within the meaning of Art 16 referred to the “legal entity or other organisation specially [providing] funds, equipment or information and materials for the citizen to complete the creation(s)”. The created works had not required “special and specialised equipment … for their specific expressions”. The materials allegedly provided by the appellant,ie, funds, the computer, hard disk and office hours, were for “general use” and “[did] not possess the indispensability and specificity of the works created”. Paragraph 2 of Article 16 was therefore not fulfilled.134Foot Note 134×Exhibit D17; translated judgment exhibited to Leong’s AEIC at LYM-1 pp 10–11. 101 ApplyingZhanyuEnterpriseto the present facts, the defendants argued that the plaintiff’s “material and technical resources” had not been used in the creation of the Kikocci files. Even if the files had been programmed on i-Admin (Shanghai)’s laptop, the software used was not a “special-use” equipment that fell within Art 13(3). Authorship and ownership of the copyright files therefore lay with Mr Liu.135Foot Note 135×DCS at paras 229–235. 102 There was some dispute between the forensic experts regarding the extent to which Mr Liu had coded the Kikocci files during office hours. Both experts raised concerns about using the metadata timings of the “f109.sql” application files relating to the Kikocci Project136Foot Note 136×Hong’s AEIC at para 91; Liu’s AEIC at paras 51 and 53.as a proxy to measure the amount of time that Mr Liu spent on the Kikocci files. (a) The plaintiff’s expert concluded that 40% of the Kikocci files were written during office hours by relying on “last saved” timings in the “f109.sql” files that recorded user activity and whenparticularfunctions and modulesin a file were written and last saved.137Foot Note 137×NEs (10 May 2018) at p 94 ln 11–24.The defendants’ expert criticised the use of these timings as creating inconsistency: the “last saved” timings only showed that changes happened within a particular file, and did not reflect whether these changes were substantive: for instance, merely navigating back and forth within a file would cause the “last saved” timing to be updated.138Foot Note 138×NEs (10 May 2018) at p 107 ln 7 – p 108 ln 6; NEs (11 May 2018) at p 2 ln 15–20. (b) Instead, the defendants’ expert relied on the “last written” and export timings of the files to conclude that 19–22% of the Kikocci files were created during working hours. “Last written” timings show the last time changes were made to theoverall file, and export timings are generated when a user saves and exports his work. These timings would reflect when a person makes “essential” changes to the files.139Foot Note 139×Felix Lum’s Expert Report, exhibited to Felix Lum’s AEIC (“Lum’s Expert Report”) at paras 2.4–2.10; NEs (10 May 2018) at p 134 ln 1–6; NEs (11 May 2018) at p 3 ln 22 – p 4 ln 1.The plaintiff’s expert’s response was that these timings were biased towards showing that Mr Liu only worked on the file outside of his working hours: the “last written” timing only shows when a back-up file is created, and cannot indicate when the codes contained therein were last written or worked on. Mr Liu could have worked on the Kikocci files during office hours, saving and exporting them after he ended work.140Foot Note 140×NEs (10 May 2018) at p 93 ln 10–21; NEs (11 May 2018) at p 4 ln 16–25. 103 In my view, both experts raised valid concerns about using these timings to measure the time Mr Liu spent working on the Kikocci files while at work. But what seemed more methodologically concerning was the fact that the forensic experts were only able to analyse the deleted Kikocci files that were successfully recovered. As the plaintiff’s forensic expert observed, there may well have been more files that had been deleted and which could not be recovered.141Foot Note 141×NEs (10 May 2018) at p 93 ln 5–10.As the existing evidence could only portray an incomplete picture, it was unsafe to draw any conclusions regarding the extent to which Mr Liu had worked on the files during office hours. I therefore did not place much weight on this aspect of the parties’ cases. 104 Instead, I focused on the software and equipment that Mr Liu had used to create the Kikocci files, and whether their use caused the Kikocci files to fall within the meaning of “works” under para 2 of Art 16 of the Copyright Law which the plaintiff could claim copyright ownership over. It was clear from the foreign law evidence that this required the software and equipment to be “purposely” or “specially” provided by the plaintiff for Mr Liu to create the Kikocci files: see Art 11 of the Copyright Law Implementation Regulations and the first instance decision that was upheld inZhanyuEnterprise. This requirement was not fulfilled in the present case, for the following two reasons: (a) I found that Mr Liu had used i-Admin (Shanghai)’s laptop for some of the Kikocci coding work: the Kikocci files that were forensically assessed were found on the laptop which i-Admin (Shanghai) had assigned to him.142Foot Note 142×Tan’s Expert Report at paras 4.4.2 and 5.16.But it was crucial that this laptop had not been purposely or specially provided to him for coding the Kikocci files. Rather, it was provided for his general use, as part of his employment in i-Admin (Shanghai)’s operations and business development departments at the time. (b) Neither was the software used to code the Kikocci files proprietary to the plaintiff or provided to Mr Liu for the purpose of coding those files. I believed Mr Hong and Mr Liu’s evidence to the effect that Mr Liu had downloaded and installed Oracle APEX from Oracle’s website following a Skype conversation that they had on 12 February 2010, and that this software was free-to-download and publically accessible.143Foot Note 143×Liu’s AEIC at para 78(a); Hong’s AEIC at para 99(a). The Skype conversation in question is exhibited to Kim’s AEIC at SJK-1 Tab 13. As the plaintiff had not provided the material and technical resources which Mr Liu had used to code the Kikocci files, it did not own the copyright in the said files pursuant to Art 13(3) of the Computer Software Regulations read with para 2 of Art 16 of the Copyright Law. 105 Accordingly, as none of the conditions in Art 13 of the Computer Software Regulations read with Art 16 of the Copyright Law were fulfilled, the plaintiff did not have ownership over the copyright in the Kikocci files. These files were authored by Mr Liu outside the scope of his employment at i-Admin (Shanghai), using free-to-download and publically available software. Ownership of the copyright thus resided with him.",
        "Conclusions on the copyright claim": "106 Having compared the copyrighted materials with the allegedly infringing materials, I concluded that no substantial copying was proved in relation to the materials in Category 1 and 2. Although the evidence showed that the defendants had access to some of the plaintiff’s materials when they developed Nice Payroll’s payroll systems, I could not conclude that there was copying on this basis alone. The process by which Nice Payroll’s materials were created did not go towards the quality of those materials. This went towards the breach of confidence claim instead, which I turn to next.",
        "Issue 2: Breaches of the plaintiff’s confidence": "107 I found that the defendants indeed owed obligations of confidence to the plaintiff, but there was, in the end, no use of the plaintiff’s confidential information in the relevant sense. 108 The elements that have to be settled for an action in breach of confidence to succeed are listed inClearlabSG Pte Ltd v Ting Chong Chai and others[2015] 1 SLR 163 (“Clearlab”) at [64]: (a) The information must possess the necessary quality of confidentiality. This is satisfied if it is relatively inaccessible to the public,ie, it has not become public knowledge (at [66]). (b) The information must have been imparted in circumstances importing an obligation of confidence. Where there is a contract expressly or impliedly imposing an obligation of confidence, this element may be satisfied simply by reference to the contract (at [65]). (c) There must be an unauthorised use of that information to the detriment of the party communicating it. 109 The plaintiff identified four incidents that allegedly amounted to breaches of confidence on the part of one or more defendants. I shall categorise and deal with them in turn. I first turn to the general question of whether the individual defendants owed the plaintiff obligations of confidence.",
        "Whether the defendants owed the plaintiff obligations of confidence": "110 The defendants generally rejected the plaintiff’s arguments that all the defendants owed it duties of confidence.144Foot Note 144×See PCS at paras 90–94.They submitted that only Mr Hong owed a contractual obligation of confidence to the plaintiff through the NDA he signed;145Foot Note 145×SJK-1 Tab 17 exhibited to Kim’s AEIC; AB at Folder (18), S/N 431.even then, it had to be proved that the restrictive covenant in the NDA was reasonable. Mr Liu and Mr Tan did not owe duties of confidence to the plaintiff as their NDAs had been signed with the plaintiff’s subsidiaries. There was insufficient evidence as to Nice Payroll’s or Mr Li’s knowledge of the alleged confidential materials; they thus could not be said to have owed an equitable obligation of confidence to the plaintiff.146Foot Note 146×DRS at paras 40–49. 111 I found that Mr Hong was bound by cl 1 of the NDA he signed. He owed the plaintiff a contractual duty of confidence, regardless of the extent to which the plaintiff enforced its security protocols. I rejected the argument that his NDA was unenforceable. The plaintiff’s enforcement of the NDA did not seek to restrict Mr Hong’s ability to utilise his skill and knowledge to compete with the plaintiff. Rather, it sought to protect its confidential information, as it was legally permitted to do: seeClearlabat [67] and [75]. This is separate from information that should be regarded as part of an ex-employee’s skill and knowledge acquired in the course of employment which he is entitled to use and which the plaintiff may not protect for its own:Clearlabat [80]. 112 The defendants correctly identified that Mr Liu and Mr Tan did not owe the plaintiff contractual duties of confidence. Nevertheless, they did owe equitable duties to the plaintiff to the extent they came into possession of its materials through their employment with its subsidiaries, and to the extent they knew the materials in question were created by the plaintiff. Clause 1.2 of the NDAs which they entered into with their respective employers provided that they were to keep confidential all information that came to their knowledge in the course of their employment, and were not to use such confidential information in any manner that would cause injury or loss to their previous employers and their associated companies (defined in cl 6.1(b) to include the plaintiff).147Foot Note 147×Kim’s AEIC at SJK-1 Tab 17 (NDAs of Mr Liu and Mr Tan).Further, it was clear that the plaintiff operated with its subsidiary companies as a functional whole, as if it was a single entity spread over various locations.148Foot Note 148×Kim’s AEIC at para 22.This was supported by how the defendants themselves collaborated on the plaintiff’s software across their separate offices: when Mr Hong faced payroll issues with the accounts of one of the plaintiff’s clients, he transferred the account to i-Admin (Shanghai)’s operations team and worked with Mr Liu to stabilise it.149Foot Note 149×Hong’s AEIC at para 41.A reasonable man, in the circumstances of the case, would have recognised the information brought in from the plaintiff as confidential to it, such that equity would intervene and impose a duty of confidence even absent a contractual provision binding Mr Liu and Mr Tan: seeClearlabat [112]. 113 As Mr Hong was a director of Nice Payroll, his state of mind and knowledge was attributed to Nice Payroll:Clearlabat [145];Centre for Laser and Aesthetic Medicine Pte Ltd v GohPui Kiat and others[2017] SGHC 72 at [45]. It was therefore also subject to an equitable duty of confidence. 114 Mr Li would also have owed an equitable duty of confidence to the plaintiff to the extent that he was aware that information in Nice Payroll’s possession had come from the plaintiff. However, I did not find in the circumstances that any such obligation of confidence arose. There was no evidence to show that he had been involved in the running of Nice Payroll’s business such that he would have had knowledge of any confidential information being received or used by the other defendants.",
        "The alleged instances of breach of confidence": "Development of Nice Payroll’s source codes, systems and client materials 115 The plaintiff stated that the defendants had reproduced, copied, adapted or referenced its confidential source codes, systems, database structures and client information to develop the defendants’ source codes, systems and materials.150Foot Note 150×2ASOC at para 17(a).I agreed that the plaintiff’s source codes, systems, database structures and client materials were confidential, but only to the extent the information in question was not found in the public domain and was original. As noted by Lee Seiu Kin J inClearlabat [215], information that is too broad, general and unoriginal may not be capable of being protected as confidential: … InDeMaudsley v Palumbo[1996] FSR 447 (“DeMaudsley”), an idea for a dance club was held not to be protectable because its five composite elements were, individually or combined, far too vague and/or unoriginal to constitute confidential information. [The unprotectable elements were that] (a) the club would operate all night long, (b) the decor would be of “high tech industrial” warehouse style, (c) there would be separate areas for dancing, resting and socialising as well as a VIP lounge, (d) the acoustic design for the enclosed dance area would prevent sound, light and atmosphere to leak beyond the area, and (e) top disc jockeys would appear at the club. … 116 It followed from my findings in relation to the copyright claim above that no reproduction or copying of the plaintiff’s materials had occurredper se. Although the plaintiff alleged that the defendants had adapted its database structures, it did not explain how such “adaptation” had occurred or what references the defendants had made of the plaintiff’s database structures; it only relied on Mr Pillay’s comparison of the parties’ respective database tables.151Foot Note 151×PCS at paras 325–332.I thus disregarded this aspect of its claim. As for the defendants’ alleged adaptations of or references to the plaintiff’s material, the plaintiff’s submissions focused mainly on the defendants’ adaptation of its payitem and CPF database materials and its result upload functionality.152Foot Note 152×PCS at paras 333–335.In particular, it argued that the element of unauthorised use of its information was made out by the defendants’ copying of its payroll data to save time and effort in developing Nice Payroll’s own payitem database structures and bible, thereby expediting its entry into the market.153Foot Note 153×PRS at para 83. 117 I took the view, however, that mere copying did not amount to actual use for the purposes of making out the breach of confidence claim. In reaching this conclusion, I looked to the reasoning inClearlabfor guidance. 118 To summarise, the plaintiff inClearlab(“Clearlab”), a contact lens manufacturer, sued its ex-employees,inter alia, for taking its confidential information and using it for the benefit of a rival company (“Aquilus”). Six “clear instances” of breach of confidence were found to have occurred: (a) The first two instances of breach involved the use of Clearlab’s confidential software to design contact lenses: at [157] to [165]. (b) The third involved the defendants’ copying of Clearlab’s lens formulations to use in Aquilus’s application for a Health Sciences Authority (“HSA”) manufacturing license: at [166] to [176]. Lee J took note of the fact that the defendants would otherwise not have had enough time to independently develop a workable lens formulation: at [174]. (c) Fourth, Aquilus used Clearlab’s combination of dosage, spin-speed and lens dimensions in its lens production. One of the defendants admitted under cross-examination that Aquilus faced “a lot of difficulties in coming up with a good lens”, and thus asked another colleague for Clearlab’s specifications in order to “shorten the trial”: at [180]. This suggested that the document from Clearlab containing this data was used for making certain lens: at [177] to [181]. (d) Fifth, the defendants had input Clearlab’s parameter settings into a machine used to cut the metal insert for producing Aquilus’s lens cast mould: at [182] to [186]. (e) Finally, the defendants used Clearlab’s documents to obtain four certifications for ISO and OHSAS standards, following an audit by TQCS International Pty Ltd (“TQCSI”), an audit firm: at [187] to [194]. ISO certification required a minimum of three months of actual implementation of quality management systems and related standard operating procedures (“SOPs”). Clearlab pointed toward the speed at which Aquilus obtained certifications (within three months after three of its four technical crew came on board) as suggestive of copying: at [188]. Lee J noted in particular how certain emails showed that the defendants circulated batches of Clearlab’s SOPs and operating instructions (“OIs”) with instructions to “change for Aquilus”; the reply email described the 18 attached files as having “removed all mentions of [Clearlab] and also changed the words 1-Day to [Aquilus’s] Daily Lens”. Lee J found that implementation of the SOPs and OIs to satisfy the audit requirements constituted use; relevantly, an email sent in the midst of the TQCSI audit stated, “As per Mr Ting advice, we can use Clearlab’s standard for a while.”: at [193]. 119 It is clear from this reasoning that the copying of information alone does not constitute breach of confidence. Crucially, the defendants inClearlabhad actually used Clearlab’s confidential information for various purposes: to apply for a HSA license, to obtain ISO and OHSAS certifications, and in developing Aquilus’s contact lenses. The same could not be said in this case. As the defendants argued, while the data in the plaintiff’s Payitem Bibles might have been copied into the file “Payitem Bible_Singapore.xls”, this file was “not commonly used”.154Foot Note 154×DCS at paras 270–275.The argument that the copied data had also been used to create Nice Payroll’s payitem database was also shaky; to this end, I accepted the defendants’ arguments that payitems were common knowledge in the payitem industry and that MrOng would have been able to c Hong would have been able to compile a similar list of payitems based on his own knowledge of the payitem industry.155Foot Note 155×NEs (7 July 2017) at p 136 ln 12 – 20; p 137 ln 16 – p 138 ln 15; p 141 ln 24 – p 142 ln 15.Indeed, I generally found that the plaintiff was unable to explain with any particularity how the defendants had used the copied payitem data or the headers in the “cpf.xls” file. This could be contrasted with the situation inClearlab, where the use of the copied data was shown to be critical to the actual running of Aquilus’s operations and to the defendants’ ability to obtain relevant licenses within months, thereby bypassing the research and development and trial process. 120 The plaintiff’s submissions further described how the defendants retained other materials which belonged to it, and accessed them or circulated them amongst themselves and Nice Payroll’s other employees. Specifically: (a) Mr Liu accessed the “From Zaza” folder on at least eight occasions. This folder contained some of the plaintiff’s materials, and Mr Liu’s browsing was performed to identify and potentially utilise relevant or useful materials.156Foot Note 156×PCS at para 186; PRS at paras 78 and 79.In particular, he had searched for and accessed the file “BankDiskSGP7144.java”. This was the plaintiff’s source code that generated a “bankdisk” file. It was used for payment disbursement and was formulated according to a client bank’s specifications.157Foot Note 157×Sutrisno’s AEIC at para 49 and ST-1 Tab 6 (source code). (b) The “RR to Li Lian.zip” folder, which contained some of the plaintiff’s operational documents, was found on Mr Hong’s ThinkPad laptop. On 10 May 2012, Mr Hong emailed Mr Tan and attached the files “RR to Li Lian.zip” and “SGWI ICP questionnaire 111020-1.xls”. He sent the former file to Mr Tan to review when replying to a client questionnaire (the latter file).158Foot Note 158×Kim’s AEIC at paras 82(e) and 111 and SJK-1 Tab 21 (email). (c) Mr Liu emailed Mr Hong on 18 July 2011, attaching the plaintiff’s client implementation templates in the file “Standard Imp Template.zip” for his “reference” at a period when Nice Payroll was building its own implementation templates.159Foot Note 159×Kim’s AEIC at para 82(a) and SJK-1 Tab 18 (email); NEs (26 March 2018) at p 51 ln 3–18. (d) Mr Liu emailed Ms Shen on 15 August 2011, attaching “epayroll.zip”, which contained the plaintiff’s ePayroll source codes.160Foot Note 160×Kim’s AEIC at para 82(b) and SJK-1 Tab 19 (email) (e) Mr Liu emailed Mr Hong on 15 August 2011, attaching the plaintiff’s Payitem Bibles.161Foot Note 161×Kim’s AEIC at para 82(c). (f) Mr Liu emailed Ms Shen on 20 August 2011, attaching the files “GIRO Format.pdf”, which contained coding specifications from OCBC Bank, and “BankDiskOCBCSGONI.java”, the plaintiff’s source code which generated a “bankdisk” file for its client. In the email, he instructed, “verify the java coding with the spec since the coding is the up to date one but the spec I found is 2007. If they are tally, pls do the coding asap. [sic]”.162Foot Note 162×Kim’s AEIC at para 83 and SJK-1 Tab 22 (email); Sutrisno’s AEIC at para 50 and ST-1 Tab 7 (source code). (g) Mr Liu emailed Mr Hong and Mr Tan on 26 March 2012, attaching the file “HK Statutory_rev28Feb2011.doc”, which included information about Hong Kong’s statutory calculation requirements. The email was sent with the understanding that the attachment might be of use to Mr Liu and Mr Tan, who were developing Nice Payroll’s Hong Kong payroll engine at the time.163Foot Note 163×Kim’s AEIC at 82(d) and SJK-1 Tab 20; NEs (26 March 2018) at p 46 ln 23 – p 48 ln 14. (h)  The Eclipse software is a workspace to programme and develop Java applications. The plaintiff argued that the defendants executed the Eclipse software to view and reference the plaintiff’s Java codes which were located in the “From Zaza” folder. The plaintiff’s Java files had also been concurrently opened with the defendants’ Java files, and a compilation of 259 of the plaintiff’s Java codes was found on the defendants’ Dell Server. The plaintiff drew the conclusion that the defendants had used its materials as part of their Eclipse projects, and had reviewed and utilised its files in the course of Nice Payroll’s business.164Foot Note 164×Tan’s Expert Report at paras 13.1–13.23. In addition, the plaintiff highlighted that its file “tax.txt”, which contained the plaintiff’s source code for calculating tax for its Singapore payroll engine, was found in Mr Tan’s folder in the Dell Server.165Foot Note 165×PRS at para 61; Kim’s AEIC at para 109. 121 The defendants responded that the plaintiff had not proved that they had actually used its documents. The defendants’ possession of and access to the plaintiff’s materials did not itself amount to use. Although Mr Hong did receive the plaintiff’s client implementation templates, Nice Payroll’s implementation templates were created independently and were ultimately dissimilar.166Foot Note 166×Hong’s AEIC at paras 166–167.Similarly, Mr Tan had received the files “RR to Li Lian.zip” and “HK Statutory_rev28Feb2011.doc”, but had not referred to those files when respectively filling up the client questionnaire or creating Nice Payroll’s Hong Kong payroll engine; instead, he referenced online materials.167Foot Note 167×DCS at paras 298–299; 289 and 320.He also denied referring to the file “tax.txt” when creating Nice Payroll’s tax module.168Foot Note 168×Tan’s AEIC at para 29.Mr Liu’s email to Ms Shen could also be explained: he had not instructed her to “incorporate or copy” the OCBC “bankdisk” source code, but merely to check if the specifications he had were up to date.169Foot Note 169×DRS at para 100(b). 122 The defendants also rejected the implication that they had used the Eclipse software in relation to the plaintiff’s files to develop their own materials.170Foot Note 170×DCS at paras 213–218.They argued that the Eclipse software had only been run ten times171Foot Note 171×Tan’s Expert Report at para 13.6;cfLum’s Expert Report at para 4.51.– too few to actually develop a program. Even though Eclipse projects had been created, three of the four projects could not be run or viewed, and the last had been created and compiled by Ms Shen.172Foot Note 172×Tan’s Expert Report at para 13.12;cfLum’s Expert Report at paras 4.28–4.49.It was also Ms Shen who had compiled the plaintiff’s Java files.173Foot Note 173×Lum’s Expert Report at paras 4.61–4.66. 123 Judging from the evidence, I concluded that the plaintiff’s assertions could not be supported on the balance of probabilities. Although Mr Hong and Mr Liu admitted to an intention of using the plaintiff’s materials for Nice Payroll’s purposes, this alone could not allow the plaintiff’s claim to succeed. Access alone would not be sufficient to establish anything. Its case was that the defendants had actually referred to its materials in developing Nice Payroll’s business materials. Accordingly, even if reference or reviewing was made out (which it was), the latter element of its pleaded claim still had to be proved. Similarly, although the defendants or Ms Shen had reviewed the plaintiff’s materials through the use of the Eclipse software, it had to be further shown that this resulted in the creation of the defendants’ own materials. Given the lack of any proof that the defendants had indeed used the plaintiff’s material to generate material which they used in the course of Nice Payroll’s business, I found that no breach of confidence had occurred. 124 For completeness, I note that the plaintiff invoked what it called the “expansive approach” taken inClearlabat[205] to [207] towards the standard of proof required to show unauthorised use of confidential material,174Foot Note 174×PRS at para 74.where Lee J found that the mere taking of Clearlab’s materials could amount to a breach of confidence. The plaintiff here sought to argue that any lack of proof of use or detriment arising from the documents taken by the defendants was not fatal to its claim.175Foot Note 175×PRS at para 76.I disagree: as this formulation of the breach of confidence claim had not been pleaded, it could not be considered; the plaintiff should have specifically pleaded that the fact of mere taking sufficed to give rise to breach of confidence. In any case, such a claim would not have succeeded as the present case could be sufficiently distinguished fromClearlab.Lee J, in concluding that the defendants had breached their obligations of confidence to Clearlab in respect of the whole lot of documents taken out of Clearlab (at [207]), considered that: (a) First, the defendants systematically took a “substantial” and “remarkable” documents numbering in the thousands shortly before leaving Clearlab: at [150], [151] and [195]. This suggested that they had taken the documents not for the purposes of their work at Clearlab, but to accumulate them to be used at Aquilus. The defendants admitted to taking and passing on Clearlab’s documents for “reference”. This showed that the documents were treated as a resource that they could freely use: at [206]. (b) Second, the retention of the documents was in breach of the defendants’ employment contract with Clearlab: at [206]. 125 It was further crucial that the defendants inClearlabhad set themselves an extremely short manufacturing timeframe that would only have been consistent with the use of Clearlab’s confidential information: at [149]. This went towards showing that the defendants inClearlabset out with the intention of taking and using Clearlab’s documents from the start. Moreover, Lee J’sobiterobservations about whether “potential use” could amount to a breach of confidence were also situated alongside the “clear” instances of breach of confidence where Clearlab’s confidential information was actually used: see the discussion above at [117] to [119]. It was against the backdrop of multiple breaches of confidence that Lee J found that it would have been no defence that certain documents in the defendants’ collection of Clearlab’s documents were not actually used, when each of the documents had been taken with the intention of using them: at [207]. Seen in this context, the present facts were not so egregious (as inClearlab) that the mere fact that the plaintiff’s documents could potentially have been used by the defendants amounted to a breach of confidence on their part. Generation of payroll reports for Nice Payroll’s employees 126 The plaintiff submitted that the defendants used a copy of its payroll software to generate Nice Payroll’s internal payroll reports between May 2011 and February 2012.176Foot Note 176×2ASOC at para 17(aa); PCS at paras 228–243.On 27 June 2011, Mr Liu sent an email to Mr Hong entitled “Payroll Server”, which stated: Here are the server info for payroll. IP: 175.41.140.194 Open IE (don't close eclipse) I have setup the home page already. [Username and password details] Please do data input in HRIS first instead of template. I haven't setup that module since the templates has not been uploaded include recurring/variable template in epayroll. If you have any problem with synchronization, let me know. 127 Mr Sutrisno (“Mr Sutrisno”), the plaintiff’s head of the Network, System and Security Department, interpreted this email to mean that the plaintiff’s payroll software had been hosted at the abovementioned IP address. This IP address was traced to an Amazon Web Services cloud server. The use of Eclipse indicated that the defendants were running the plaintiff’s Java codes, since their own software was written in PL/SQL and programmed using APEX. The references to “HRIS” and “ePayroll” also pointed to the use of the plaintiff’s software, which required data to be input into an HRIS template and a “recurring/variable” template in “ePayroll”. Finally, the reference to “synchronization [sic]” also indicated that the plaintiff’s software had been used, seeing as how the plaintiff’s software required multiple databases to be synchronised, while Nice Payroll’s comprised a single database.177Foot Note 177×Sutrisno’s AEIC at paras 57–62 and ST-1 Tab 8 (email).Mr Pillay also found that Nice Payroll’s payroll reports were identical to the plaintiff’s and that Nice Payroll’s source code did not contain relevant coding which would have enabled it to generate the internal payroll reports that had been created during the material period.178Foot Note 178×Pillay’s Expert Report at paras 14(a) and 27. 128 The defendants submitted that the plaintiff’s argument was deficient on various grounds:179Foot Note 179×DCS at paras 110–111 and 124–143. (a) First, the evidence did not exclude the possibility that Mr Liu had created a discrete Java tool to generate internal payroll reports that looked like the plaintiff’s. This tool was deleted after Nice Payroll’s payroll software became operational in March 2012. (b) Second, there was no forensic evidence that the defendants had actually run the plaintiff’s software to generate internal payroll reports. Running a single piece of code to generate a payroll report would have required various pieces of the plaintiff’s source codes and database to be fully installed and operational. Prof Yap’s evidence showed that it would have been extremely difficult to set up the various elements of the plaintiff’s software and database. Indeed, given the small number of employees at the time (three to eight), a payroll report could have been easily created by hand or by running a simple custom program.180Foot Note 180×Yap’s Expert Report at para 5.2.7; Pillay’s Expert Report at Annex 2 (emails enclosing Nice Payroll’s employee payrolls from May 2011 to February 2012). (c) Third, the email sent on 27 June 2011 could be explained on the basis that Mr Liu had directed Mr Hong to run his discrete Java code to generate Nice Payroll’s internal reports, and to let him know if the source code could not “synchronise” with Nice Payroll’s database. This interpretation was not precluded by the text of the email: references to the “recurring/variable template” could refer to recurring and variable payitems, and references to Eclipse and “HRIS” were not unique to the plaintiff’s software. 129 Assessing the evidence, it was critical that no forensic evidence showed that the plaintiff’s software had been run, as Mr Sutrisno admitted under cross-examination.181Foot Note 181×NEs (28 June 2017) at p 143 ln 3–7.Given the small scale of the defendants’ initial operations, it was also unlikely on the balance of probabilities that the defendants would have installed the plaintiff’s software simply to process internal payroll reports when less taxing alternatives were available to it. I thus found that the plaintiff failed to sufficiently prove that their inferences should be drawn from the available evidence, and dismissed the breach of confidence claim in this regard. Mr Hong’s access to and use of the plaintiff’s demonstration platform 130 The plaintiff pleaded that Mr Hong breached its confidence by using confidential log-in credentials to log onto its product demonstration platform to access various modules of its system without authorisation.182Foot Note 182×2ASOC at para 17(ab).This demonstration platform was hosted on the Internet. It was set up to allow potential clients to view dummy employee data within the plaintiff’s interface and test out the functionalities of its eClaim, eLeave, HRIS, eTimesheet and ePayslip modules, but not its core payroll calculation module. Visitors could log onto the demonstration platform using user identifications and passwords which were provided by the plaintiff.183Foot Note 183×Hong’s AEIC at paras 280 and 281; Sutrisno’s AEIC at para 9. 131 The plaintiff’s forensic expert stated that the forensic evidence showed that Mr Hong logged onto the plaintiff’s demonstration platform on 19 April 2013 and downloaded the file “payitem setup_iAdmin.xls”.184Foot Note 184×Tan’s Expert Report at paras 7.1–7.11, and Appendix 15.This file contained a list of the plaintiff’s payitems.185Foot Note 185×Kim’s AEIC at para 113.Mr Hong also browsed the plaintiff’s server on other occasions between April and June 2012 and March and May 2013.186Foot Note 186×Tan’s Expert Report at paras 7.12–7.22.Mr Sutrisno also provided affidavit evidence discussing additional instances when Mr onHonHong had browsed and downloaded files from the demonstration platform,187Foot Note 187×Sutrisno’s AEIC at paras 19–43.but I limited my consideration to those aspects of the plaintiff’s case that its forensic expert was given the opportunity to comment on. 132 The defendants disputed the confidentiality of the log-in credentials on the basis that they had not been changed since June 2011, when Mr Hong left the plaintiff’s employment.188Foot Note 188×Hong’s AEIC at para 282; NEs (27 June 2017) at p 172 ln 13–17.Senior management was also unaware of when members of the plaintiff’s sales team gave the log-in credentials to potential clients.189Foot Note 189×NEs (27 June 2017) at p 5 ln 15–17.The plaintiff’s ex-employees and potential clients who did not engage its services could therefore access the demonstration platform. In any case, both the dummy information and “payitem setup_iAdmin.xls”, which consisted of information regarding payitems and their natures, were public data and not confidential.190Foot Note 190×DCS at paras 325–328. 133 I did not agree with the defendants in this regard. The fact that the plaintiff’s demonstration platform was hosted on the Internet was insufficient to strip the information hosted on it of itsprima facieconfidential nature. Even if the payitems and their nature were public information, the file “payitem setup_iAdmin.xls” was original in so far as its contents were arranged and compiled in an original manner. To this extent, the file was confidential in nature. 134 As above, however, the plaintiff stumbled when proving that the defendants made unauthorised use of this information. Mr Seok Jin Kim (“Mr Kim”), the plaintiff’s Chief Executive Officer, stated that Nice Payroll’s systems were developed through the use of the file “payitem setup_iAdmin.xls”.191Foot Note 191×NEs (27 June 2017) at p 16 ln 14 – p 17 ln 12.But as the plaintiff could not give further details as to how the defendants made unauthorised use of this file, the breach of confidence claim in respect of Mr Hong’s mere access to the plaintiff’s demonstration platform could not succeed. Disclosures to HSBC and ADP 135 The plaintiff’s case was that the defendants used its confidential information to interfere with its economic relations with third parties.192Foot Note 192×2ASOC at para 17(b).In particular, Mr Hong and Mr Liu lodged a police report on 17 July 2014 alleging that the plaintiff had lost client data belonging to HSBC and ADP, two of its clients. Mr Hong also emailed HSBC and ADP on 4 September 2014 to inform them that the plaintiff’s client data was in Nice Payroll’s possession.193Foot Note 193×Hong’s AEIC at paras 317–320. 136 The plaintiff submitted that Mr Hong and Mr Liu, who had known from the start that they were in possession of its confidential information, bided their time to strategically trigger police investigations and blow the whistle on the plaintiff to derail the litigation proceedings against them.194Foot Note 194×PCS at paras 337–344.This ultimately resulted in HSBC refusing to renew its contract with the plaintiff and Mr Kim having to repair the plaintiff’s relationship with ADP.195Foot Note 195×PRS at paras 103–107; Kim’s AEIC at paras 124–126. 137 The plaintiff’s case that the disclosures to HSBC and ADP constituted a breach of confidence appeared to conflate (a) the client data in the defendants’ possession, which was confidential information that had been retained by the defendants without the plaintiff’s permission; and (b) the fact that this data was in the defendants’ possession. The information in category (b) came to Mr Hong and Mr Liu’s knowledge after they left the plaintiff’s and i-Admin (Shanghai)’s employment. In my view, although they might have been obliged not to make unauthorised use of the information in category (a), it did not follow that they could only disclose that they had come into possession of this information with the plaintiff’s authorisation. While they could have directly informed the plaintiff of this fact instead of disclosing the latter information to HSBC and ADP, they were not compelled to do so. 138 Furthermore, the references to “interference” in the plaintiff’s submissions appeared to invoke the tort of wrongful interference with trade. This was not pleaded as a claim, and would not have succeeded in any case. The plaintiff would have had to show that (a) the defendants had committed an unlawful act affecting a third party; (b) the defendants acted with an intention to injure the plaintiff; and (c) the defendants’ conduct in fact resulted in damage to the plaintiff:Paragon Shipping Pte Ltdv Freight Connect (S) Pte Ltd[2014] 4 SLR 574 at [83]. It was unclear how the defendants’ actions were “unlawful”, and the plaintiff would have run into further difficulties in proving that damage resulted from the disclosures to HSBC and ADP. Mr Kim testified that HSBC had subsequently conducted an independent audit of the plaintiff’s security and operational measures, before ultimately deciding not to renew its contract with the plaintiff.196Foot Note 196×NEs (23 June 2017) at p 82 ln 10–16; p 83 ln 25 – p 84 ln 2; p 86 ln 6 – p 88 ln 19.As for ADP, it appeared that Mr Hong and Mr Liu’s actions did not cause any material damage to its relations with the plaintiff, as ADP continued to engage the plaintiff’s services.197Foot Note 197×Kim’s AEIC at para 126.I therefore concluded that the evidence as a whole did not show that any damage attributable to the defendants was caused, or that Mr Hong and Mr Liu were liable for any wrongdoing for the disclosures made.",
        "Issue 3: Breaches of contract by Mr Hong": "",
        "The non-disclosure agreement with the plaintiff": "139 The plaintiff claimed that Mr Hong retained its confidential information, used it to generate Nice Payroll’s internal payroll reports, and transmitted it without the plaintiff’s authorisation.198Foot Note 198×2ASOC at paras 20.2 and 20.3.It was not disputed that Mr OngHonHong entered into an NDA with the plaintiff. He was bound by cl 1.2(a) of the NDA to keep confidential any and all confidential information that came into his knowledge in the course of his employment with the plaintiff, even after leaving its employment. The NDA also required that he not store the plaintiff’s confidential information in an “externally accessible computer or electronic information retrieval system or transmit it in any form or by any means whatsoever outside of the [plaintiff’s] usual place of business” (cl 1.3(b)) and that he return all records and documentation relating to the plaintiff’s business upon leaving its employment (cl 3.1).199Foot Note 199×SJK-1 Tab 17 exhibited to Kim’s AEIC; AB at Folder (18), S/N 431. 140 The plaintiff’s files were found on the hard disk of Mr Hong’s ThinkPad laptop, pursuant to the Anton Piller order executed on the defendants on 17 July 2013. Mr Hong had also circulated some of the plaintiff’s confidential materials to other Nice Payroll employees: see above at [120]. These were contraventions of cll 1.2(a), 1.3(b) and 3.1 of the NDA in so far as Mr Hong had circulated the plaintiff’s confidential materials, stored them in his externally accessible computer and knowingly retained them. But on the facts I did not find that these actions led to any substantial loss or damage. This followed from my findings that the plaintiff’s confidential materials had not been used to generate Nice Payroll’s payroll reports or for Nice Payroll’s business purposes. I would thus only award nominal damages for this breach.",
        "Breach of the plaintiff’s 2007 IT policy": "141 The plaintiff claimed that Mr Hong was bound by the 2007 IT Policy, which he signed on 20 June 2007, and that he breached cl 4.2(g) by using portable storage devices plugged into the plaintiff’s network and by subsequently connecting those devices to his ThinkPad laptop.200Foot Note 200×2ASOC at paras 20.4 and 20.5.It added in its submissions that Mr Hong had made unauthorised use of his ThinkPad laptop while working for the plaintiff.201Foot Note 201×PRS at para 97(d).The plaintiff’s forensic expert concluded that Mr Hong used at least six USB devices across his plaintiff-assigned computer and his ThinkPad laptop.202Foot Note 202×Tan’s Expert Report at paras 8.6–8.10.2 and Table 13.The plaintiff’s materials that were found on Mr Hong’s ThinkPad laptop included the files “RR to Li Lian.zip”, “Standard Imp Template.zip”, “Copy of ePayroll eHR pricing for all regions(04 Jan 2011).xls” and “payitem setup_iAdmin.xls”.203Foot Note 203×Tan’s Expert Report at paras 8.1–8.5.Mr Hong had known that he had retained these materials after leaving the plaintiff’s employment.204Foot Note 204×NEs (5 July 2017) at p 13 ln 5–9. 142 I found that the 2007 IT Policy did not bind Mr Hong. What was in evidence was an unsigned 2007 IT Policy: see Mr Kim’s AEIC, which exhibited the file “Emp-IT-Security-Policy-2007”.205Foot Note 205×PCS at para 108; AB at Folder (21), S/N 452; SJK-1 Tab 5 exhibited to Kim’s AEIC.In its reply submissions, the plaintiff stated only that it could not be disputed that Mr Hong was subject to the 2007 IT Policy, which “formed part of the terms of his employment as one of the prevailing employee policies”.206Foot Note 206×PRS at para 97(b).I noted that a copy of the 2007 IT Policy that had been apparently signed by Mr Hong and dated 20 June 2007 was included in the plaintiff’s final agreed bundle of documents, which was submitted to court on 6 July 2017.207Foot Note 207×AB at Folder (18), S/N 436; NEs (6 July 2017) at p 159 ln 1–2.This copy was not formally admitted through an affidavit, but had been produced by the plaintiff pursuant to a notice to produce documents served by the defendants dated 13 March 2017. It had not been included in the first agreed bundle of documents which the plaintiff submitted via a hard disk drive the day before the trial began,ie, 21 June 2017;208Foot Note 208×NEs (3 July 2017) at p 95 ln 4–8; NEs (30 June 2017) at p 97 ln 4–15.the defendants’ counsel were unable to indicate their position on the authenticity and admissibility of the first agreed bundle due to its late service.209Foot Note 209×NEs (22 June 2017) at p 2 ln 2–5; p 18 ln 18 – p 19 ln 6.The burden lay on the plaintiff to prove its case by showing that there was a binding document; this it did not do. 143 The defendants claimed in their defence that the plaintiff had waived its right to enforce the 2007 IT Policy and/or was estopped from relying on it.210Foot Note 210×AD at paras 13(a) and 23.To this end, they argued that the plaintiff had poor security protocols for the protection of its source codes and client data. Evidence from the forensic and factual witnesses also showed that the plaintiff’s programmers could access, download and remove material with great ease.211Foot Note 211×DCS at paras 84 and 368.There were a number of difficulties with this argument, notably the question of whether a representation had been made and whether Mr Hong had relied on such representation, but it was not necessary for me to go into depth on this point given my finding on the absence of proof above. For completeness, I did note that the plaintiff’s enforcement of its 2007 IT Policy was not especially rigorous. But there was force in the plaintiff’s submission that the fact that it could have enforced its 2007 IT Policy more strictly did not give rise to waiver or estoppel.",
        "Breach of an implied duty of good faith and fidelity": "144 The plaintiff claimed that Mr Hong breached an implied duty of good faith and fidelity by (a) engaging in the business of the Kikocci Corporation and Nice Payroll during his working hours without the plaintiff’s approval; and (b) taking the plaintiff’s confidential information.212Foot Note 212×2ASOC at para 20.6. 145 The Court of Appeal affirmed inSmileInc Dental Surgeons Pte Ltd v Lui Andrew Stewart[2012] 4 SLR 308 (“SmileInc”) that an employee’s taking of preparatory stepsto compete with a former employer, either during his working hours or his own time, does not constitute a breach of any implied duty of good faith, absent evidence that the employee is wrongfully seeking to disclose confidential information or trade secrets: at [65], citing Norman Selwyn,Selwyn’s Law of Employment(Oxford University Press, 16th Ed, 2010) at para 19.2. The line is drawn between steps taken that are preparatory to future competition (which is permissible) and steps that constitute actual competitive activity (which is not permissible): at [67]. 146 InSmileInc, the only acts that had taken place before the respondent left the appellant’s employment were the incorporation of the competing business, the leasing and fitting out of the business premises, and discussions with another former employee to join the competing business – these were all merely preparatory acts: at [81]. The Court of Appeal would have found otherwise if the respondent had obtained a license from the Ministry of Health to carry on his medical or dental practice, had treated patients under the auspices of the competing business in direct competition with the appellant, or had engaged in the active solicitation of his patients when under the appellant’s employ: at [81]. 147 I found that Mr Hong had not breached any implied duty of good faith or fidelity in relation to his work on the Kikocci Corporation and Nice Payroll. Although there was some evidence at least to the effect that Mr Liu had worked on the Kikocci files during working hours (see the discussion above at [102]) and Mr Hong received at least one business enquiry about the Kikocci Corporation,213Foot Note 213×Hong’s AIEC at para 96.there was no evidence that the Kikocci Corporation entered into any agreements with any clients. Prior to 30 June 2015 and before he left the plaintiff’s employment, Mr Hong incorporated the Kikocci Corporation and Nice Payroll, designed the Kikocci website, paid an external vendor to increase Internet search rankings for the Kikocci website,214Foot Note 214×NEs (5 July 2017) at p 119 ln 18 – p 120 ln 10.and had discussions with Mr Liu and Mr Li about setting up a competing business. These were only preparatory steps that did not amount to actual competitive activity with the plaintiff. 148 As for the alleged taking of the plaintiff’s materials, the defendants submitted that there was no direct evidence that Mr Hong had taken the plaintiff’s confidential materials when he left its employment. The plaintiff’s materials in Nice Payroll’s possession were largely found in the folders “From Zaza”, “Zaza_dev” and “Zaza/Testing”.215Foot Note 215×DCS at para 80.While Mr Hong had unintentionally left some of the plaintiff’s materials on his ThinkPad laptop,216Foot Note 216×DCS at paras 308 and 309.the bulk of the plaintiff’s materials had been brought to Nice Payroll by Ms Shen. Ms Shen had been able to download a copy of the plaintiff’s materials due to i-Admin (Shanghai)’s lax security policies, and had passed it to Mr Liu when she joined Nice Payroll.217Foot Note 217×DCS at paras 88–108.It was only from 9 to 10 April 2012 that Mr Liu transferred those materials to Nice Payroll’s Dell Server.218Foot Note 218×Liu’s AEIC at paras 100–106. 149 The plaintiff cast this as a convenient and self-serving bare assertion that pinned the blame on Ms Shen, who had not been joined as a defendant and who could not give evidence.219Foot Note 219×PRS at paras 27–34.The plaintiff further submitted that as it had demonstrated the defendants’ possession and circulation of its materials, and had shown that Mr Hong in particular could have obtained these materials, the evidential burden shifted to the defendants to prove their case that Ms Shen had indeed taken the plaintiff’s materials to Nice Payroll.220Foot Note 220×PRS at paras 29 and 30. 150 I did not agree with the plaintiff that the defendants’ alternative explanation was a bare assertion. Although the plaintiff’s forensic expert concluded that the “From Zaza” folder had been created by Mr Liu on 9 April 2012,221Foot Note 221×Tan’s Expert Report at para 9.10.the defendants’ forensic expert found that the folder structure of the “From Zaza” folder was the same as that disclosed in the logical evidence file from Ms Shen’s i-Admin (Shanghai) computer. 4,879 files in the “From Zaza” folder also had last written dates after 31 March 2011 and before 1 July 2011.222Foot Note 222×Lum’s Expert Report at paras 4.1–4.10.Mr Sutrisno also admitted under cross-examination that of the computers belonging to Mr Hong, Mr Liu and Ms Shen that were forensically examined, the computer that had the set of files which most closely resembled the set of the plaintiff’s files found in the Dell Server was Ms Shen’s, and acknowledged that this strongly suggested that it was Ms Shen who had made and removed the copies of the materials that were found in the Dell Server.223Foot Note 223×NEs (28 June 2017) at p 125 ln 10–23.The defendants submitted that neither Mr Hong nor Mr Liu had been in Shanghai before 1 July 2011, and they could not have removed the materials then. The fact that the folder names included Zaza’s name also increased the likelihood that the materials had come from her computer. Finally, adverse inferences should be drawn against the plaintiff, given its failure to provide forensic evidence of thumbdrive access to Ms Shen’s i-Admin (Shanghai) computer to show that she had not removed the plaintiff’s materials.224Foot Note 224×DCS at paras 98–100. 151 In any case, the burden remained on the plaintiff to adduce positive or circumstantial evidence showing on the balance of probabilities that Mr Hong had actively taken its information while under its employment, in such a manner as to go beyond mere preparation for future competition. I found that the plaintiff had not done so, and dismissed this claim accordingly.",
        "Issue 4: Tort of conspiracy by unlawful means": "152 The elements required to establish a conspiracy by unlawful means were set out inClearlabat [236]: (a) there was a combination of two or more persons to do certain acts; (b) the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts; (c) the acts were unlawful; (d) the acts were performed in furtherance of the agreement; and (e) the plaintiff suffered loss as a result of the conspiracy. 153 The plaintiff acknowledged that it did not have direct contemporaneous knowledge of the formation of the conspiracy. However, it drew the following inferences that a conspiracy existed based on the following facts. 154 First, Mr Hong and Mr Liu had two Skype conversations in August 2010 that indicated that Mr Li (whom they called “Leo”) had already begun reviewing and giving feedback on the Kikocci Project. By 30 November 2010, the Kikocci website also included a quote from “Leo” of “Broad Sure Pte Ltd”, a company which belonged to Mr Li. These established to the plaintiff that Mr Li was “deeply involved” in the Kikocci business.225Foot Note 225×PCS at paras 132–139. 155 Second, Mr Li claimed that he wanted to recoup his $1m investment within two to three years.226Foot Note 226×Li’s AEIC at para 11.He also imposed a $10m penalty clause in the Cooperation Agreement and emailed Mr Hong and Mr Liu on 31 March 2011 to state that if software development was not on schedule, the director in charge would stop drawing a salary until development was back on track.227Foot Note 227×Li’s AEIC at para 41 and LY-1 Tab 4.The plaintiff concluded that this would have given Mr Hong and Mr Liu an incentive to take a shortcut by using the plaintiff’s materials for Nice Payroll’s business purposes.228Foot Note 228×PCS at paras 141–145. 156 Third, internal schedules emailed by Mr Hong to Mr Liu and Mr Li showed that they intended to utilise the plaintiff’s materials for Nice Payroll’s operations. The version of the file “schedule.xlsx” sent on 28 March 2011 listed development milestones for Nice Payroll. Cells D17 and E17 in the “Schedule” sheet stated that “i-Admin system conversion” was scheduled for five man-days.229Foot Note 229×Kim’s AEIC at para 90 and SJK-1 Tab 23; AB at Folder (19), S/N 439 (English translation of “schedule.xlsx”);cfLJW-1 Tab 12 exhibited to Liu’s AEIC.The file “Time.xls”, sent on 9 May 2011, also provided that Nice Payroll’s employees would be performing an “i-Admin Payroll Result Conversion”.230Foot Note 230×PCS at paras 146–149; Kim’s AEIC at paras 94 and 97 and SJK-1 Tab 23. 157 The defendants’ affidavit evidence explained that the plaintiff offered a subscription-based online payroll calculation service (the “Software-as-a-service” model, or “SaaS”) which Mr Hong and Mr Liu considered subscribing to for a time. The schedules referred to the conversion of payroll results calculated by the plaintiff’s SaaS software into the defendants’ payroll result format, and not a conversion of the plaintiff’s code.231Foot Note 231×DCS at paras 118 and 119; Hong’s AEIC at para 259.Mr Kim did not deny that this was possible and that this would have been a legitimate use of its software.232Foot Note 232×NEs (23 June 2017) at p 151 ln 9 – p 152 ln 12.Mr Hong and Mr Liu did not ultimately subscribe to any SaaS software, preferring instead to perform payroll calculations manually.233Foot Note 233×Hong’s AEIC at paras 260–262. 158 The plaintiff argued that this account was unlikely on the balance of probabilities and that the defendants’ case was internally inconsistent. Although Mr Hong’s and Mr Liu’s affidavit evidence stated that Mr Li had rejected the SaaS idea in March 2011, they admitted under cross-examination that Mr Li had only done so in May 2011. Further, Mr Li’s account during cross-examination that he had not understood the schedules because he could not read or understand English was inherently unbelievable, given that he had reviewed the schedules which contained the English word “i-Admin” without asking for clarification. It was similarly unbelievable that Mr Li did not know what “i-Admin” and who the plaintiff was.234Foot Note 234×PCS at paras 150–158. 159 Fourth, Mr Li had invested $1m in Nice Payroll without having researched the payroll industry in Singapore and when he was not completely certain of Mr Hong’s and Mr Liu’s expertise. The only logical inference to be drawn was that Mr Li knew that Mr Hong and Mr Liu would use the plaintiff’s materials to develop Nice Payroll’s payroll software, and thus made his investment decision on that basis.235Foot Note 235×PCS at paras 159–164. 160 The defendants submitted that the plaintiff’s case was weak in any case. Its evidence did not demonstrate Mr Li’s heavy involvement in the Kikocci business; it only showed that he had given general advice and had allowed his name to be used in a fake testimonial on the Kikocci website. There was no evidence that he had been involved in any conspiracy, and there was also no evidence that Mr Hong and Mr Liu had conspired to take the plaintiff’s information.236Foot Note 236×DRS at paras 121–128. 161 Having considered the submissions, I concluded that conspiracy was not made out as element (a) was not borne out by the evidence. Some aspects of the evidence of the defendants were wanting: for instance, there were noticeable inconsistencies between their affidavit evidence and oral testimony as to when Mr Hong began discussions with Mr Li. I also did not believe that Mr Li could not understand English or that he was as clueless about Mr Hong’s and Mr Liu’s previous employment as he claimed. The translated emails showed that he was clearly able to discuss the milestone schedules notwithstanding that they included the English word “i-Admin”.237Foot Note 237×Wong Tsz Hin’s AEIC at WTH-1 Tabs B and C. 162 However, this did not make it more likely than not that the plaintiff’s version of events should be believed. There was insufficient evidence of any coordination or arrangement between the defendants to take the plaintiff’s confidential information to commit copyright infringement and breach of confidence. Indeed, it was not unlikely that Mr Li would invest $1m in Nice Payroll and that he would therefore impose exacting demands to protect his investment. The defendants’ explanation of the internal schedules was also supported by other remarks in the same files. The plaintiff omitted to mention that the file “schedule.xlsx” included a “remarks” column that explained that “i-Admin system conversion” involved “Conversion of results data from i-Admin system to standard module”;238Foot Note 238×SJK-1 Tab 23; AB at Folder (19), S/N 439 (English translation of “schedule.xlsx”);cfLJW-1 Tab 12 exhibited to Liu’s AEIC.the document did not state that the conversion was of the plaintiff’s payroll system for Nice Payroll’s purposes. It was also not unbelievable that the defendants might resort to using the plaintiff’s SaaS software as a temporary stopgap while developing Nice Payroll’s systems. 163 In the end, I was satisfied that all that could be established was that Mr Hong and Mr Liu were keen on exploring opportunities for themselves. It was to this end that they took preparatory steps to set up competing businesses in form of the Kikocci Corporation and, eventually, Nice Payroll. That may not be what an employer may wish to hear, but I suspect that is the reality for most employees. Mr Hong and Mr Liu’s actions fell far short of any conspiracy to steal the plaintiff’s confidential information. As regards Mr Li, I did not find that the evidence showed that he was involved in any way in any machinations as alleged by the plaintiff. He appeared at most to be a demanding investor; his involvement did not appear to extend to Nice Payroll’s specific operations, and he could not be said to have had knowledge about the alleged copyright infringement and breaches of confidence, which were not made out regardless.",
        "Issue 5: Inducement of breach of contract": "164 The elements of this tort are set out inClearlabat [285]: (a) knowledge of the existence of the contract; (b) an intention to procure the breach; (c) inducement; and (d) breach of the contract. The plaintiff claimed that Mr Li induced Mr Hong and Mr Liu to breach their respective NDAs with the plaintiff. As Nice Payroll’s directing and/or controlling mind, he had authorised and/or directed it to be in possession of and/or to utilise the plaintiff’s confidential information.239Foot Note 239×2ASOC paras 33–34.Specifically, he pressured Mr Hong and Mr Liu to expedite the development of Nice Payroll’s systems to become market-ready and must have known and intended that Mr Hong would breach his contractual obligations to the plaintiff by taking its confidential materials and working on the Kikocci Project and Nice Payroll during the plaintiff’s office hours.240Foot Note 240×PCS at para 158; PRS at para 101. 165 As the defendants raised, the plaintiff was not the proper party to bring this claim as regards Mr Liu, as he had not signed an NDA or any other contract with the plaintiff. As regards Mr Hong’s NDA with the plaintiff, element (d) was made out, to the extent that Mr Hong had retained the plaintiff’s materials on his ThinkPad laptop (see above at [140]). There was, however, no evidence that Mr Li had known of Mr Hong’s NDA with the plaintiff. A causative link also had to be drawn between the allegedly inducing act and the eventual breach by the contract-breaker (Clearlabat [287]), and it was not shown that the pressure that Mr Li imposed on Mr Hong in the incipient stages of Nice Payroll’s development caused Mr Hong to later retain the plaintiff’s materials. I therefore dismissed this claim.",
        "The claims against Mr Tan": "166 The plaintiff’s claims against Mr Tan were predicated on its copyright infringement claim against the defendants in Suit 585/2013. It claimed that Mr Tan had conspired with Mr Hong and Mr Liu to reproduce, copy, adapt and/or reference its source codes, systems and database structures and client data to develop Nice Payroll’s materials and generate payroll reports for Nice Payroll and its customers. This amounted to copyright infringement and breach of confidence. 167 In submissions, the plaintiff relied on the following. Mr Tan had access to its copyright material when he was employed at Olabo, or could easily have obtained access through Mr Hong. Some of the plaintiff’s source codes were found in folders that Mr Tan had access to while he was employed by Nice Payroll. In particular, the files “tax.txt” and “cpf.xls” had been found in the directory “D:\\Errol\\” on Nice Payroll’s Dell Server. Mr Tan had also operated the Eclipse program and accessed Eclipse projects that pointed to the plaintiff’s materials. Finally, Mr Hong had emailed files containing the plaintiff’s materials to Mr Tan for the purpose of developing Nice Payroll’s materials.241Foot Note 241×PRS at paras 109–121. 168 Given that I ultimately found that Nice Payroll’s materials were not infringing copies of the plaintiff’s own materials and that the defendants did not make use of the plaintiff’s confidential materials in the relevant sense, the claims against Mr Tan failed as they were not supported by the evidence.",
        "Miscellaneous issues": "169 The plaintiff’s submissions raised additional claims that were unpleaded. I will deal with them briefly. 170 First, the plaintiff relied on the “mass departures” of Mr Hong, Mr Liu and Mr Tan from their respective employers as a factual basis for finding that a conspiracy between them existed to steal and use the plaintiff’s materials to set up a competing business.242Foot Note 242×PCS at paras 165–176.In my view, while the defendants might not have been candid about their reasons for resigning and their intention to join a competing business, I did not find that this amounted to a conspiracy; these ex-employees were not obliged to inform the plaintiff of their plans. 171 Second, the plaintiff pointed to Mr Hong and Mr Liu’s deletion of the plaintiff’s documents on the day of the Anton Piller order as evidencing their intention to destroy evidence showing that they had taken and retained the plaintiff’s materials for their own use. Specifically, Mr Hong had logged onto his ThinkPad laptop and deleted “payitem setup_iAdmin.xls”, and performed a search for “i-Admin” on his laptop and created “desktop.rar”, which he stored files in. “Desktop.rar” was found to contain some of the plaintiff’s files, which were mostly in the file “RR to Mr Li Lian.zip”. Mr Liu deleted two folders from Nice Payroll’s Dell Server: “From Zaza” and “Zara_dev”, which contained i-Admin materials.243Foot Note 243×Tan’s Expert Report at paras 6.1–6.14; Liu’s AEIC at para 272.I found that any erasure of the documents was a matter that did not affect the substantive claim, and did not support in themselves adverse findings against the defendants.",
        "Conclusion": "172 To conclude, I dismissed the plaintiff’s claims in the Suits save for the breach of contract claim against Mr Hong, for retaining and circulating the plaintiff’s materials in breach of cll 1.2(a), 1.3(b) and 3.1 of the NDA. I awarded the plaintiff nominal damages of $500 as no injury or damage resulted from Mr Hong’s breach. I ordered delivery up by the defendants of any materials belonging to the plaintiff in two weeks. Costs awards were dealt with separately. The plaintiff has since appealed against my decision. Aedit AbdullahJudge Tan I Kwok Lionel, Tng Sheng Rong (Tang Shengrong) andDebbie Tang (Rajah & Tann Singapore LLP) for the plaintiff;Dr Lai Tze Chang Stanley SC, Goh En-Ci Gloria, Clara TungYi-Lin and Leong Yi-Ming (Allen & Gledhill LLP) for the defendants in Suit 585/2013;The defendant in Suit 965/2015 in person."
    }
}