{
    "case_title": "Seah Chee Wan and anothervConnectus Group Pte Ltd",
    "ncitation": "[2019] SGHC 228",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Introduction": "1 In this judgment, I deal with an application to wind up a company by one of its contributories, who is also a creditor, on the grounds that it is just and equitable to wind it up and also that it is unable to pay its debts as they fall due.  There is a separate but linked application in Originating Summons No 449 of 2018 (“OS 449/2018”), which is an application under s 182 of the Companies Act (Cap 50, 2006 Rev Ed) (the “Act”) to convene an Extraordinary General Meeting of the same company without the necessary quorum.  OS 449/2018 will be the subject of a separate judgment although the material facts in relation to that application are essentially the same as that for the present winding up application.",
        "The background to the disputes": "",
        "The setting up of the company": "2 The company that it is at the centre of these disputes is Connectus Group Pte Ltd, a company established and based in Singapore (“Connectus Group”).  It was incorporated on 16 August 2012.  It is in the business of providing human resource services, particularly employment and executive search services.1Foot Note 1×Ng Sing King’s Bundle of Affidavits Vol 1 (“ABAF1”) para 4. 3 Connectus Group was set up by (i) Seah Chee Wan, who is also referred to as Alex Seah (“AS”), (ii) Seah Shiang Ping, who is also referred to as Stacey Seah (“SS”), and (iii) Lim Tien Ho (“LTH”).  The two Seahs are siblings.  Together with LTH, the three of them had been colleagues in Hudson Global Resources (Singapore) Pte Ltd (“Hudson”), which is a well-established firm in the same line of business.2Foot Note 2×1st and 2nd Defendants’ Bundle of Affidavits Vol 3 (“PBAF3”) paras 16 – 17. 4 AS, SS and LTH decided to strike out on their own.  They came up with the name “Connectus” for their own human resource services business and Connectus Group was thus set up.3Foot Note 3×PBAF3 paras 16 – 20. 5 To start the business, the three of them needed additional capital investment.  In March 2012, before Connectus Group was incorporated, SS had been introduced through an acquaintance to one Ng Sing King, also referred to as Paul Ng (“PN”).  PN was a potential investor who had various business interests.4Foot Note 4×PBAF3 para 23 and p 215.SS asked PN whether he would be interested in being a partner in their business that would be established.  PN had many meetings with AS, SS and LTH.  He learnt of their respective areas of specialities and what each of them wanted to do.  PN told them about his own track record in human resource services businesses in Singapore and China.  He had acted as a consultant and advisor to several such businesses.  With his undoubted experience, AS, SS and LTH were looking to PN as an advisor on how to set up and run a successful human resource services business.5Foot Note 5×PBAF3 paras 27, 31, 35, 37. 6 PN eventually agreed to invest in the business venture.  In November 2012, a few months after Connectus Group was incorporated, PN used a company that he substantially owned and controlled, APBA Pte Ltd (“APBA”),6Foot Note 6×PBAF3 pp 607 – 610.to subscribe for shares in Connectus Group.7Foot Note 7×PBAF3 para 38.On 12 November 2012, the four shareholders - APBA, SS, AS and LTH - entered into a Shareholders’ Agreement in relation to Connectus Group (“the SHA”).8Foot Note 8×APBA Core Bundle (“ACB”) pp 46 – 96. 7 The SHA was comprehensive and dealt with all the usual matters that one would expect to be covered by such an agreement.  It included provisions dealing with how meetings would be conducted, restrictions on voting rights, reserved matters, anti-dilution of shareholding, “tag-along” and “drag-along” rights, dividends policy, management deadlock, buy-out provisionsetc.  There is also a provision of the SHA (clause 5.2), which provided, in gist, that each of the shareholders was entitled to appoint a director to the board of Connectus Group unless his shareholding fell below 15%.9Foot Note 9×ACB p 57. 8 After the entry of APBA, the shareholding in Connectus Group was as follows:10Foot Note 10×ABAF1 p 120. (a) AS - 117,000 shares (23.4%) (b) SS - 117,000 shares (23.4%) (c) LTH - 117,000 shares (23.4%) (d) APBA - 149,000 shares (29.8%) 9 It is not disputed that PN had asked for slightly more than a 25% stake so that he could block any special resolutions.11Foot Note 11×PBAF3 para 38.After APBA’s investment, as per the terms of the SHA, PN was appointed as APBA’s representative to the board of Connectus Group.12Foot Note 12×ACB p 57, clause 5.2.1(c).The only other directors were AS, SS and LTH.13Foot Note 13×ACB p 57, clause 5.2.1. 10 The four shareholders brought different practice areas and business segments to the table.  AS had been working for a number of years in China, developing human resource businesses there.  He wanted to continue focusing on growing the business in China.  SS’s and LTH’s practice areas were based in Singapore.  SS was primarily interested in servicing the healthcare industry, while LTH’s practice areas were the IT and semiconductor industries.14Foot Note 14×PBAF3 para 90 and pp 189 – 195. 11 PN’s contribution was his experience and expertise in running a human resource services business.15Foot Note 15×PBAF3 para 32.While the other three had experience only in employee recruitment and executive search, PN offered to help Connectus Group develop revenue streams in areas like payroll administration, recruitment process outsourcing, interim management and contract staffing.16Foot Note 16×PBAF3 p 215. 12 AS, SS and LTH were employed full-time by Connectus Group and drew salaries.17Foot Note 17×Transcripts (1 March 2019), p 29 lines 7 – 18; p 30 lines 2 – 9.On the other hand, APBA provided consultancy and accounting services to Connectus Group, and billed the company for these services.18Foot Note 18×Transcripts (1 March 2019), p 28 line 10 – p 29 line 6.",
        "The entry of Edwin Lim and his family": "13 Less than a year later, in July 2013, LTH decided to part ways with Connectus Group.  He sold his shares in the company to PN,19Foot Note 19×ACB p 97.who then sold them to one Ong Poh Suan, also known as Sharon Ong (“SO”).20Foot Note 20×ACB p 98.She is the wife of Edwin Lim Tow Ee (“EL”),21Foot Note 21×Transcripts (1 March 2019), p 71 lines 1 – 2.another former colleague of AS and SS from Hudson, and one of the central players in the eventual disputes between the parties.  It is not disputed that the AS, SS and EL had known each other for some time, even before they worked together in Hudson.  EL was looking to leave Hudson to join Connectus Group.  He was introduced by AS and SS to PN.  EL wanted to take up LTH’s stake in Connectus Group, and AS, SS and PN then agreed to have him come on board as their fourth shareholder and also to become the Chief Executive Officer (“CEO”) of the company.22Foot Note 22×PBAF3 paras 57 and 101. 14 The trouble was that EL was an inveterate gambler and often found himself in debt.23Foot Note 23×Transcripts (8 March 2019), p 149 lines 12 – 13.He did not have the funds needed to buy LTH’s stake.  EL approached his father, Lim Meng Foo (“LMF”), for the capital.  LMF’s unchallenged evidence is that he agreed to pay for the 23.4% stake in Connectus Group so that EL could become the CEO of the company.  He would not have come up with the funds if EL was not going to be offered the job of CEO.  However, knowing his son’s gambling habits, LMF decided that it would be best that the 23.4% stake be registered in the name of EL’s wife, SO.24Foot Note 24×Transcripts (8 March 2019), p 150 lines 14 – 21, p 151 lines 8 – 15, p 160 lines 9 – 14.She was also appointed as a director of the company. 15 Hence, with the departure of LTH, the four shareholders in Connectus Group were AS, SS, APBA and SO, in the same shareholding proportion as before, save that SO stepped into the shoes of LTH.  In effecting the transfer of the Connectus Group shares from PN to SO, a document was executed by PN, APBA, AS and SS, which stated, amongst other things, that “APBA, Alex, Stacey and Ng agree to waive the SHA completely and immediately”.25Foot Note 25×ACB p 98.While these words on the SHA are quite ambiguous, the evidence of the parties before me was that they treated the SHA as no longer having any legal force.  Neither side relied on any of the SHA provisions ascontinuingto give them any particular rights as shareholders or to impose any legal obligations on the other shareholders.",
        "The business in China": "16 In 2013, Connectus Group started taking steps to establish a presence in China.  As prevailing government regulations in China did not permit Connectus Group to immediately set up a subsidiary in China, alternative arrangements in China had to be found in order for the company to be able to operate there.26Foot Note 26×PBAF3 para 128a; Ng Sing King’s Bundle of Affidavits Vol 2 (“ABAF2”) Tab 3, para 9. 17 On 27 March 2013, Connectus Group entered into a Cooperation Agreement (the “Cooperation Agreement”) with a Chinese company called Shanghai Lethic Business Consulting Co Ltd (“SLBC”).27Foot Note 27×ACB pp 518 – 520.This was a company that was majority owned and controlled by a businessman called Chary Zhu De Quan,28Foot Note 28×For spelling of name: ABAF1 para 25.who the parties referred to simply as “Chary”.29Foot Note 29×Transcripts (1 March 2019), p 105 lines 9 – 15.PN also has a shareholding interest in SLBC.30Foot Note 30×Transcripts (6 March 2019), p 140 lines 14 – 23.In fact, it was PN who had introduced the other shareholders of Connectus Group to Chary.31Foot Note 31×Transcripts (6 March 2019), p 178 lines 2 – 4. 18 The parties have variously described the Cooperation Agreement with SLBC as a “joint collaboration agreement” or a “joint collaborative agreement”.32Foot Note 32×Transcripts (1 March 2019) p 28 line 8; Transcripts (6 March 2019) p 178 lines 5 – 11.This was always intended to be a transitional arrangement until Connectus Group could establish its own subsidiary in China.   In essence, pursuant to the Cooperation Agreement, Connectus Group would deposit RMB 1.2m of investment funds with SLBC.  In turn, SLBC would set up the entire business infrastructure to allow Connectus Group to operate in China, including the hiring of employees and acting as the payroll agent.  The operating expenses would be paid for in the first instance by SLBC.  The Cooperation Agreement also provided that SLBC would also sign contracts on Connectus Group’s behalf, issue invoices and also collect on all payments.  SLBC would also charge a management fee to Connectus Group.33Foot Note 33×ACB pp 518 – 520. 19 While the Cooperation Agreement was, on paper, only between Connectus Group and SLBC, it is not disputed that there were two other stakeholders.  Bonnie Wang and Frank Zhang (collectively, “the Chinese partners”) were two former colleagues of AS in Hudson who worked in China.  They were now part of the management team of the Chinese operations of Connectus Group, and they together own 33.33% of the business there.34Foot Note 34×Transcripts (6 March 2019) p 111 line 24 – p 112 line 14.Hence, they contributed RMB 300,000 out of the RMB 1.2m of investment funds that were deposited with SLBC.35Foot Note 35×1st and 2nd Defendants’ Bundle of Affidavits Vol 2 (“PBAF2”) p 131.However, as far as SLBC was concerned, the entire amount of RMB 1.2m was booked as coming from Connectus Group.  The parties have collectively referred to the business arrangement with the Chinese partners as the “joint venture in China”.36Foot Note 36×Transcripts (5 March 2019), p 129 lines 16 – 17; Transcripts (7 March 2019), p 73, line 17. 20 AS was based in China and was the head of the operations of the joint venture there.  His evidence was that the profits generated by the joint venture was a total of about RMB 3.335m for the years 2013 to 2015.37Foot Note 37×Transcripts (5 March 2019), p 15 lines 6 – 15; p 70 lines 22 – 23.This figure is corroborated by Profit & Losses statements (“P&L Statements”) signed off by AS on behalf of Connectus Group from 2013 to 2015, which show that the joint venture’s gross profit for the years 2013, 2014 and 2015 were RMB 164,674.03, RMB 1,904,825.51 and RMB 1,265,591.44 respectively;38Foot Note 38×ACB pp 696 – 698.the three figures add up to approximately RMB 3.335m. 21 After three years of operation, Connectus Group was permitted under Chinese regulations to set up a wholly-owned subsidiary in China.  In 2016, Connectus Business Consulting (Shanghai) Co Ltd was established as a wholly-owned foreign subsidiary.  Parties referred to this company as “Connectus WFOE”, with WFOE being the acronym for “wholly foreign-owned enterprise”.39Foot Note 39×Transcripts (1 March 2019) p 8 lines 19 – 22.As the name suggests, Connectus WFOE is 100% owned by Connectus Group.40Foot Note 40×1st and 2nd Defendants’ Bundle of Affidavits Vol 5 (“PBAF5”) para 28(c); ABAF2 Tab 3, para 11. 22 On 27 April 2016, Shanghai Connectus Group Co Ltd (“Connectus Shanghai”) was established with the following shareholding – 66.67% owned by Connectus WFOE and 33.33% owned collectively by the Chinese partners.41Foot Note 41×1st and 2nd Defendants’ Bundle of Affidavits Vol 1 (“PBAF1”) para 21; ACB p 153. 23 Eventually, the business of the joint venture in China was transferred from SLBC to Connectus Shanghai and carried out through that new company.42Foot Note 42×ABAF2, Tab 3, p 4, para 12, PBAF5 para 28.",
        "Other agreements signed with Chary-controlled entities.": "24 In the second half of 2016, Connectus Group executed an agreement with Shanghai Lethic Talent Services Co., Ltd (“SLTS”), which was dated 1 August 2016.43Foot Note 43×ACB p 535.This is another company substantially owned and controlled by Chary.  PN also has a shareholding interest in SLTS. 25 Under this agreement, SLTS acknowledged that it owed a “consultancy fee” of about RMB 3.335m to Connectus Group and that this would be paid on or before 31 March 2017.44Foot Note 44×ACB p 535.It is not in dispute that Connectus Group did not provide any consultancy services to SLTS.  This agreement had been suggested by Connectus Group’s auditors as a device by which the company could recognise the approximately RMB 3.335m profits of the Chinese joint venture in the accounts of Connectus Group.45Foot Note 45×ACB pp 440 and 445.In fact, there was another agreement signed between the same parties slightly earlier where SLTS confirmed that it was holding on Connectus Group’s behalf “accumulated profits” from the Chinese joint venture in the amount of approximately RMB 3.335m.46Foot Note 46×ACB p 536.But, there is no dispute that this agreement was superseded by the one describing the amount of RMB 3.335m as a “consultancy fee” that was owed. 26 The reason for SLTS’s involvement must be explained.  It is not entirely clear what the arrangements were but, it appears that, while SLBC was the party to the Cooperation Agreement with Connectus Group, the parties agreed for SLTS to be the entity that actually held the cash receipts that was generated by the business of the joint venture in China.47Foot Note 47×Transcripts (5 March 2019) p 51, lines 14 – 21 and p 52, lines 2 – 4. 27 In 2015, Connectus Group was short of cash and needed funds.  It turned to another company substantially owned and controlled by Chary called Talent-Spot Asia Co., Limited (“TSHK”), which is incorporated in Hong Kong, for loans.  These were interest-bearing loans.  A loan agreement was executed sometime in late September 2016, but back-dated to 31 December 2015, after the disbursement of most of the loans in 2015.48Foot Note 48×ACB p 533.The loan agreement set out the various amounts and the interest payable.  There was another loan agreement dated 1 July 2016 which dealt with some smaller loan amounts.49Foot Note 49×ACB p 534.About RMB 4m was borrowed by Connectus Group from TSHK in total. 28 On behalf of Connectus Group, AS cancelled the “consultancy fee” agreement with SLTS in 11 October 2017.50Foot Note 50×PBAF2 p 233.This was done without board approval or consultation with his other directors.  His evidence was that, while he had initially agreed to have such an agreement, he now felt that it was a sham and was done only to “window dress” the accounts of Connectus Group.51Foot Note 51×Transcripts (5 March 2019) p 140 line 22 and p 146 lines 13 – 14.",
        "Other loans to Connectus Group": "29 The loans made by TSHK to Connectus Group in 2015 were not the only loans taken by the company.  In 2013 and 2014, the shareholders had made loans to the company of varying amounts, in proportion to their respective shareholding.  There were loan agreements that were prepared and signed by all the shareholders, setting out the interest amounts.  These were intended to be short-term loans to help the company tide over cash-flow difficulties, and there were dates stipulated for repayments of these loans.52Foot Note 52×ACB pp 521 – 532.But, Connectus Group never had enough money to repay the shareholder loans in full.53Foot Note 53×ACB p 515. 30 In 2017, AS made further short-term loans to Connectus Group to keep it going.  In that year, a total of S$275,000 was lent to the company by AS, with an agreed rate of interest of 10%.54Foot Note 54×ACB p 537 and Exhibit P2.Unlike the shareholder loans made in 2013 and 2014, these further loan agreements were only signed by AS, as lender, and EL, in his capacity as CEO of Connectus Group.55Foot Note 55×ACB pp 537 – 538; Transcripts (5 March 2019) p 174 line 22 – p 175 line 9; p 177 line 24 – p 178 line 21.Nonetheless, PN admitted that he knew about these loans.56Foot Note 56×Transcripts (7 March 2019) p 162 lines 7 – 14.",
        "The deterioration of the parties’ relationships with each other": "31 The relationship between the shareholders was fraught with difficulties from sometime in 2014.  After APBA became a shareholder, it seconded one of its employees, Kwang Chan Pong (“Kwang”),57Foot Note 57×See,eg, ACB p 93.to act as the Chief Financial Officer (“CFO”) of Connectus Group.  In this way, APBA took charge of the accounting function for Connectus Group.58Foot Note 58×Transcripts (6 March 2019) p 1 lines 15 – 18; Transcripts (7 March 2019) p 34 lines 1 – 8.After his appointment as CFO, Kwang reported that EL had been drawing his commissions from Connectus Group in advance of when they would normally be paid, which is when the company brought in a profit.59Foot Note 59×Transcripts (7 March 2019) p 38 lines 2 – 14.It appears that EL was taking advances on these commissions because he needed to fund his gambling habit. 32 After Kwang had pointed out to the shareholders that Connectus Group was actually borrowing money to pay EL his commissions in advance and that revenue had been wrongly booked into the accounts of Connectus Group so that EL could draw commissions,60Foot Note 60×Transcripts (7 March 2019) p 39 lines 2 – 5.the relationship that EL had with APBA started to strain considerably.  In September 2014, EL caused Connectus Group to stop payment of fees due to APBA for consultancy and accounting services.61Foot Note 61×Transcripts (7 March 2019) p 32 line 24 – p 33 line 1.When EL proposed that Kwang be removed as the CFO, PN objected to this.62Foot Note 62×Transcripts (7 March 2019) p 39 lines 6 – 8.Despite this, Kwang eventually left his position as the CFO in May 2015.63Foot Note 63×Transcripts (6 March 2019) p 2 line 10; Transcripts (7 March 2019) p 31 lines 15 – 19; p 33 lines 1 – 3.PN also claimed to have objected to Connectus Group taking loans from TSHK in 2015, but this was sanctioned by AS and EL.64Foot Note 64×Transcripts (7 March 2019) p 39 lines 9 – 14; ACB pp 421 – 422 and 533 – 534. 33 Matters came to a head in July 2015.  It appears that, by this time, AS, SS and EL (and hence SO) had formed a faction within Connectus Group.  They could not get along with PN, and wanted to bring in a new investor to replace him.  On 21 July 2015, AS, SS and SO sent a letter to the board of directors of Connectus Group to requisition an Extraordinary General Meeting (“EGM”) of the company to be convened in order for a resolution to be passed for the removal of PN as a director.65Foot Note 65×ACB p 99.Almost immediately, PN responded by demanding, through a lawyer’s letter, that EL repay a personal loan of S$100,000 that he had made to him.66Foot Note 66×ACB p 283; Transcripts (7 March 2019) p 187 lines 15 – 19. 34 An EGM of Connectus Group was convened on 11 August 2015.67Foot Note 67×ACB p 429.Several days before that, on 5 August 2015, APBA issued a letter to AS, SS, SO and the company secretary in response to the notice of EGM that had been issued.  A number of matters were raised, including PN’s efforts to meet with the other directors to discuss the serious debt and cash flow situation of the company.68Foot Note 68×ACB pp 427 – 429.More significantly, the letter also went on to state:69Foot Note 69×ACB p 428, para 8(a)(ii). As the Company is in essence a joint venture between [APBA], [AS], [SS], and [SO], [PN’s] directorship is inextricably bound together with our shareholding in the Company.  As such, there is no basis for [PN] to be excluded from management (and removed as a director) whilst we are still a shareholder of the Company.  However, if the other shareholders wish for us to exit as a shareholder, we are prepared to discuss our exit from, and [PN’s] directorship in, the Company… 35 On 11 August 2015, just before the start of the EGM, it is alleged by AS that there was a private meeting between EL and PN.  What transpired at that meeting and what EL and PN might have agreed has not been disclosed to the Court.  But, what happened after that meeting was that EL immediately had a discussion with AS and SS, where he told them that he, and hence SO, was withdrawing his support for the resolution to remove PN as a director.70Foot Note 70×Transcripts (1 March 2019) p 87 lines 16 – 22.The EGM then proceeded with the requisitioning shareholders agreeing to withdraw their proposed resolution.71Foot Note 71×Transcripts (1 March 2019) p 89 line 24 – p 90 line 4.PN denied that there was any such private discussion with EL just before the start of the EGM.72Foot Note 72×Transcripts (7 March 2019) p 46 lines 11 – 15. 36 The financial situation of Connectus Group did not improve in 2016 and 2017.  EL continued to take advances on his salaries and commissions throughout 2016.73Foot Note 73×Transcripts (6 March 2019) p 43 lines 19 – 22.In the meantime, in early 2017, SO’s shares in Connectus Group were transferred to her father-in-law, LMF.  LMF’s evidence was that he had retired from his job at the beginning of 2017, and there was now no longer any restrictions for the Connectus Group shares to be registered in his name.  After all, he had paid for those shares.74Foot Note 74×Transcripts (8 March 2019) p 151 lines 8 – 17 read with p 153 lines 19 – 20. 37 In July 2017, AS, SS and PN discovered that EL had made unauthorised withdrawals of the company’s funds.75Foot Note 75×Transcripts (7 March 2019) p 186 lines 16 – 24.He was severely in debt because of his gambling addiction.  PN arranged to meet EL in Shanghai.  It was not disclosed to the Court what they had discussed and what agreements they had reached.76Foot Note 76×Transcripts (8 March 2019) p 6 line 25 – p 7 line 22.But, shortly thereafter, LMF and APBA executed mutual undertakings to the effect that each of them would not sell their shares in Connectus Group without the other.77Foot Note 77×PBAF2 p 155.This was a preparation for a mutual exit from Connectus Group by APBA and LMF.  The actual undertakings were not put into evidence in these proceedings, but there is no dispute that they were executed for the purpose of binding APBA and LMF to an agreement to sell their shares as one majority bloc. 38 EL acknowledged that he owed approximately S$110,514.58 to Connectus Group.78Foot Note 78×PBAF2 p 234.He then resigned as the CEO of the company in late July 2017.79Foot Note 79×PBAF3 p 597.He was made a bankrupt by Resorts World Sentosa by the end of August 2017.80Foot Note 80×PBAF3 pp 648 – 649. 39 After this, things continued to spiral downwards for Connectus Group.  EL had left things in a complete mess, and the company did not have enough funds to carry on.81Foot Note 81×ACB p 227.Issues were raised in relation to the continued management of the Singapore office.82Foot Note 82×PBAF3 pp 591 – 592.The company was struggling to pay the rent for the premises in Singapore.83Foot Note 83×ACB p 474; PBAF3 p 213, last 10 lines.TSHK was also pressing for repayment of its loans.84Foot Note 84×ACB pp 516 – 517.By May 2018, there was also no staff left in the company, as all of them had resigned.85Foot Note 85×PBAF3 pp 71 – 73 and 503 – 540. 40 Beginning from August 2017, PN started pressing AS and SS to account for the state of affairs of the company.  He started describing them as “executive directors” in his emails, where he asked them various questions about the cash position of the company.86Foot Note 86×PBAF3 p 591.It is not disputed that, around this time, the parties were in discussions for APBA and LMF to sell their shares to AS and SS,87Foot Note 87×Transcripts (8 March 2019) p 55, lines 12 – 18.or for APBA to buy over the shares of AS and SS.88Foot Note 88×PBAF3 p 299.PN represented LMF in these discussions.  But, eventually, this did not come to fruition because parties could not agree on the price and whether AS and SS would agree to a non-competition clause in the event of them selling their shares.89Foot Note 89×PBAF3 p 299 and pp 743 – 744. 41 On 19 September 2017, AS and SS commenced proceedings against Connectus Group seeking recovery of outstanding shareholders’ loans and interest due to them in the amount of S$418,857.81 in the case of AS and S$266,446.81 in the case of SS.90Foot Note 90×ACB pp 510 – 515.These proceedings were then discontinued less than two weeks later on 1 October 2017, even though there was no repayment of any of the amounts owed.91Foot Note 91×PBAF1 p 147; Transcripts (5 March 2019) p 171 lines 5 – 8; Transcripts (8 March 2019) p 90 lines 9 – 15. 42 On 10 October 2017, TSHK commenced proceedings in Singapore against Connectus Group, seeking recovery of its loans in the amount of approximately RMB 4.2m and interest of approximately RMB 800,000.92Foot Note 92×ACB pp 516 – 517 and Statement of Claim (attached) at para 11.These proceedings are still pending. 43 On 9 November 2017, the landlord of the office premises served a statutory demand on Connectus Group for the amount of S$67,743.10 due as unpaid rent.  The arrears had been outstanding since June 2017.93Foot Note 93×ABAF1 pp 227 and 230. 44 AS and SS wrote emails to PN proposing solutions such as a voluntary winding-up or judicial management.94Foot Note 94×ABAF1 p 293.PN wanted to meet at a directors’ meeting to discuss matters, but AS and SS did not want to meet him in person.95Foot Note 95×ACB p 486. 45 PN raised several issues about the accounts that had been prepared by the company, and wanted AS and SS, who he described repeatedly now as “executive directors”, to explain the company’s dire financial situation.96Foot Note 96×PBAF3 p 591.His evidence was that AS was not able to give him a satisfactory explanation of the company’s state of affairs in a meeting with the company’s auditors in February 2018.97Foot Note 97×ABAF1 paras 59 – 60; p 257. 46 With the concurrence and support of LMF, with whom APBA together control 53.2% of the shares of Connectus Group,98Foot Note 98×ABAF1 para 5.on 26 December 2017, APBA requisitioned an EGM of the company to consider resolutions to remove AS and SS as directors of the company.  The EGM was held on 10 January 2018, with APBA’s representative and LMF attending.  However, as AS and SS were absent, and as Connectus Group’s articles of association require three members of the company to form a quorum,99Foot Note 99×ABAF1 p 54, clause 68.the EGM was dissolved for being inquorate.100Foot Note 100×ABAF1 p 275. 47 Subsequently, APBA and LMF again convened another EGM to consider the resolutions to remove AS and SS.  The EGM was held on 26 March 2018.  It was again dissolved due to a lack of quorum given the absence of AS and SS.101Foot Note 101×Ng Sing King’s Bundle of Affidavits Vol 4 (“ABAF4”), Tab 6, para 14.The resolutions that were proposed by APBA, and supported by LMF, also included a resolution to replace AS and SS with PN’s sister, one Ng Siew King.102Foot Note 102×ABAF1 p 283. 48 APBA then filed OS 449/2018 in April 2018 seeking the court’s leave under s 182 of the Act to convene an EGM of Connectus Group without the necessary quorum in order to pass the resolutions in question for the removal of AS and SS as directors of the company. 49 Shortly thereafter, AS and SS filed CWU 78/2018, seeking to wind up Connectus Group on the basis that it is just and equitable to do so, and also on the basis that the company is insolvent. 50 I heard the parties’ submissions on OS 449/2018 over several hearings, after which I reserved judgment.  I informed the parties that I would decide on the application after hearing the evidence and submissions of the parties in the winding up application.  After all, if I formed the view that Connectus Group should be wound up, there would be little purpose in granting the relief sought in OS 449/2018even ifAPBA establishes its case for an order under s 182 of the Act. 51 In respect of CWU 78/2018, directions were given by me for parties to give discovery.  It was agreed by the parties that the deponents of the various affidavits in support of and in opposition to the winding-up would attend court to be cross-examined.  Given the inter-connectedness of the two matters, parties also sensibly agreed that the evidence in CWU 78/2018 could be relied upon for the purpose of OS 449/2018 andvice versa.103Foot Note 103×Order of Court (HC/CWU 78/2018) dated 1 November 2018. 52 Shortly before the hearing of the evidence in this matter, SS indicated that she was withdrawing her application to wind up the company.  On the first day of the hearing, I granted leave for SS to withdraw her application, subject to the question of costs.104Foot Note 104×Transcripts (1 March 2019) p 1 line 16 – p 2 line 9.She did not appear as a witness for AS, who was proceeding with his application to wind up Connectus Group. 53 I heard the evidence of the parties over five hearing days.  Thereafter, the parties made their final submissions in writing in relation to the matters in dispute.",
        "The parties’ cases in relation to the winding up application": "",
        "AS’s case": "54 AS relies on two grounds for his application.  First, he alleges that Connectus Group is unable to pay the debts due to him, that is, the shareholders loans extended to the company.  Second, he alleges that it would be just and equitable for the company to be wound up.105Foot Note 105×Seah’s Closing Submissions at paras 9 – 22. 55 For the ground that Connectus Group is unable to pay its debts, AS relies on a statutory demand served on the company on 26 March 2018, which set out the sum of S$418,857.81 as the amount of his unpaid shareholder’s loans and accrued interest.106Foot Note 106×PBAF1 paras 4 – 6; p 417.The statutory demand has not been set aside.  AS also refers to the other unpaid shareholder loans, the claim made by TSHK against the Connectus Group for the recovery of its loans, and the rental arrears that are due to Connectus Group’s landlord.  He claims that the Connectus Group simply does not have the money to pay all these creditors.107Foot Note 107×PBAF2 paras 115 – 116. 56 On the just and equitable ground, AS alleges that Connectus Group is essentially a joint venture, with the characteristics of a quasi-partnership, between AS, SS, APBA and the Lim family (meaning the family of EL)108Foot Note 108×PBAF3 paras 15, 180 – 181.and that the relationship between the parties has broken down.109Foot Note 109×PBAF3 para 257.He submits that APBA and the Lim family have acted against the interests of the quasi-partnership in various ways since July 2017, including by attempting to remove AS and SS as directors of the company, which is allegedly in breach of each shareholder’s right to have a representative on the board of the company.110Foot Note 110×PBAF3 para 82.As a consequence, AS submits that there has been a loss of mutual trust and confidence between the quasi-partners, and this justifies an order for the company to be wound up.111Foot Note 111×PBAF3 para 257. 57 AS also argues that Connectus Group has suffered management deadlock at the board level since about October 2017, which has been caused by unfair accusations that AS and SS are responsible for the dire financial straits of the company when, in reality, this had been caused by EL’s mismanagement and malfeasance.112Foot Note 112×PBAF1 para 39(g) and 1st and 2nd Defendants’ Bundle of Affidavits Vol 4 (“PBAF4”), Tab 9, paras 100 – 102. 58 Finally, AS submits that Connectus Group has ceased all its operations in Singapore as at May 2018 and hence there is a loss of substratum for the joint venture.  In this regard, it is not in dispute that all operations have ceased, and Connectus Group’s main asset now is its 66.67% interest in the joint venture in China.113Foot Note 113×PBAF1 para 39(b).",
        "APBA’s case": "59 APBA resists the application that the company should be wound up.  While it accepts that Connectus Group does not have the funds to make payment of the shareholder loans that had been extended by AS and SS, APBA raises some questions about whether the debts are indeed owed.  More significantly, APBA alleges that the financially distressed situation of the company has been caused by AS.  APBA accuses AS of not taking the necessary steps to repatriate Connectus Group’s profits from the joint venture in China.  In fact, APBA alleges that AS has breached his duties as a director by actively taking steps to frustrate the repatriation of such profits.  It submits that, if the profits are repatriated to Connectus Group, there would be more than sufficient funds to make payment to all outstanding creditors of the company, including AS and SS.114Foot Note 114×APBA Closing Submissions at paras 121, 132 – 137, 155. 60 APBA also denies that Connectus Group is the embodiment of a joint venture between itself, AS, SS and the Lim family.  APBA claims that it is just an investor in the company and there are no express or implied understandings between the shareholders other than what is set out in the company’s articles of association.115Foot Note 115×APBA Closing Submissions at paras 90, 93, 104(a).As Connectus Group is not a quasi-partnership, there is no expectation that each shareholder would be entitled to appoint a director to the board of the company.  As such, APBA and the Lim family did not infringe any rights of AS or SS when they sought to remove them as directors by requisitioning the EGMs in early 2018.116Foot Note 116×APBA Closing Submissions at paras 104, 203. 61 As for cessation of the company’s business, APBA does not deny that Connectus Group no longer operates any business in Singapore.  However, it submits that this occurred in May 2018,afterthe application for winding up was filed by AS and SS.  Hence, as a matter of law, this is not a basis upon which AS can rely in seeking to wind up Connectus Group in the present winding up application.117Foot Note 117×APBA Closing Submissions at paras 210 – 214.APBA also makes some allegations that AS and SS have acted to divert the business and employees of Connectus Group away to another company called Gateway Search Pte Ltd.118Foot Note 118×APBA Closing Submissions at paras 248 – 253.",
        "Insolvency of Connectus Group": "62 The first ground relied on by AS to wind up Connectus Group is s 254(1)(e) of the Act, which provides that the “Courtmayorder the winding up if … (e) the company is unable to pay its debts” [emphasis added]. 63 A company is unable to pay its debts, or insolvent, if it fails either the cash flow test or the balance sheet test:Encus International Pte Ltd (in compulsory liquidation) v Tenacious Investment Pte Ltd and others[2016] 2 SLR 1178(“Encus”) at [53].  A company that has failed to meet a current demand for a debt already due fails the cash flow test, while a company which presents a deficit on an overall balancing of liabilities against assets fails the balance sheet test:Re Great Eastern Hotel (Pte) Ltd[1988] 2 SLR(R) 276 at [85].  No one test is dominant, and both tests may be relevant depending on the circumstances of the case.  Regard must ultimately be given to all the evidence which appears relevant to the question of insolvency:Chip Thye Enterprises Pte Ltd (in liquidation) v Phay Gi Mo and others[2004] 1 SLR(R) 434 (“Chip Thye”) at [20] andEncusat [53].",
        "Disputed debt": "64 In response to AS’s application to wind up Connectus Group on account of its insolvency, APBA submits that, Connectus Group, if it were represented, would be able dispute the debt claimed by AS.119Foot Note 119×APBA Closing Submissions at paras 129(b) and 171. 65 In this regard, the law is well established that where the company disputes the debt claimed by the creditor on substantial grounds, the court will restrain the winding-up petition as it is an abuse of process for the creditor to try to enforce a disputed debt in such a way:Metalform Asia Pte Ltd v Holland Leedon Pte Ltd[2007] 2 SLR(R) 268 (“Metalform”)at [62], citingMann v Goldstein[1968] 1 WLR 1091.  The applicable standard for determining the existence of a substantial dispute is “no more than that for resisting a summary judgment application,ie,the debtor-company need only raise triable issues”:Pacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 at [23]. 66 APBA submits that the debt claimed by AS may be disputed as the loan agreements contained “extraordinarily high interest rates” of 10% and were “made without board approval”.120Foot Note 120×APBA Closing Submissions at para 178.It is also submitted that Connectus Groupmighthave already repaid the debts allegedly owing to AS, although this cannot be confirmed as Connectus Group is not legally represented in this case.121Foot Note 121×APBA Closing Submissions at para 181.There is also a suggestion that ASmighthave utilised the loans for his personal purposes.122Foot Note 122×APBA Closing Submissions at paras 182 – 183. 67 APBA does not deny that loans had been made by the shareholders, including by AS, in 2013 and 2014.123Foot Note 123×ACB pp 521 – 532.As for the loans made by AS in 2017, which amount to S$275,000, PN does not deny that he was aware that AS was extending short-term loans to the company to keep it afloat,124Foot Note 124×Transcripts (7 March 2019) p 162 lines 7 – 14.but his position is that there were no board resolutions which approved the taking of these loans at the rate of 10% interest.125Foot Note 125×ABAF4 Tab 6, para 67. 68 In my view, it is quite irrelevant that no board resolutions were obtained at the time the loans were extended.  All the directors were aware of the grave cash-flow situation of the company, and that AS and SS were extending short-term loans to the company.  In fact, APBA was asked to but declined to make any further loans to the company.126Foot Note 126×Transcripts (5 March 2019) p 175 lines 7 – 9. 69 As for the rate of interest charged, this was provided for in the loan agreements with AS that had been executed by EL, as the CEO on behalf of Connectus Group.127Foot Note 127×ACB p 537 and Exhibit P2.PN would surely have been aware that the loans would carry interest, just like the shareholders loans that had been made earlier in 2013 and 2014.  The conduct of PN in not having questioned the rate of interest that would be chargeable on these loans despite his awareness of them128Foot Note 128×Transcripts (7 March 2019) p 162 lines 7 – 14.suggests to me that he was leaving it to EL to decide with AS what was the appropriate interest rate to charge.  I find that EL was thus impliedly authorised by the directors to agree with AS on the appropriate rate of interest. 70 As regards the propriety of how the loans which were extended by AS were utilised, PN accepted that EL had explained that Connectus Group was in “desperate need of funds” when the loans were sought.129Foot Note 129×Transcripts (7 March 2019) p 162 lines 21 – 25; ACB p 379.Even if some of the funds had been utilised to pay AS’s salary, such amounts had been owing for five years,130Foot Note 130×Transcripts (6 March 2019) p 7 lines 15 – 20.and AS was rightly entitled to claim payment of these amounts in his capacity as an employee of Connectus Group.  Given the urgency of the loans, and as there is no evidence that it had been utilised in any way other than for the company’s purposes, it cannot be said that the loan amounts had been misused such that Connectus Group has a substantial basis to dispute the debt due to AS. 71 Finally, it is mere speculation that the loans might have been repaid by Connectus Group to AS.  It bears remembering that PN remains a director of Connectus Group, while APBA is also the largest shareholder of the company.  Even though Connectus Group has not been represented in the present proceedings, APBA and PN are surely in a position to determine if the loans have been repaid to AS, assuming there are even funds that could be utilised to repay such loans.  Yet, no such evidence was tendered before me.  The bare assertion that Connectus Group could, with representation, tender such evidence to show that the loans might have been repaid, is plainly insufficient to demonstrate a substantial dispute over the loans. 72 Hence, I find that APBA has failed to demonstrate a substantial dispute in respect of the debts due and owing to AS.",
        "Cross-claim for breaches of fiduciary duties": "73 Next, APBA submits that Connectus Group can raise a cross-claim against AS for his breaches of fiduciary duties, and that the amount claimable under such a cross-claim would easily exceed the debt claimed by AS.131Foot Note 131×APBA Closing Submissions at paras 187 – 188. 74 Establishing a distinct possibility of a cross-claim that may exceed the debt claimed for by the creditor is a sufficient basis for resisting a winding-up application.  As the Court of Appeal stated inMetalformat [82]: So long as the court is satisfied that on the evidence there is a distinct possibility that the cross-claim may exceed the undisputed debt, it should give the company the opportunity to prove its claim rather than to allow a winding-up petition to be filed, with all the normal consequences attendant upon the filing of such a petition. 75 Various breaches of fiduciary duties are alleged by APBA, key of which are:132Foot Note 132×APBA Closing Submissions at para 121(a) – (c). (a) AS refused to remit the profits from the Chinese joint venture (“the China profits”), which belong to Connectus Group, thus harming Connectus Group financially; (b) AS failed to capitalise Connectus WFOE and Connectus Shanghai, thereby putting the China profits at risk; and (c) AS cancelled the “consultancy fee agreement” with SLTS without board approval or consultations with other directors of Connectus Group. 76 I will deal with the respective allegations of breaches in turn, as each would provide an independent basis for a cross-claim against AS.  As for the points raised by APBA that AS and SS were in breach of their duties by refusing to allow Connectus Group legal representation and that they were complicit with EL’s numerous advances,133Foot Note 133×APBA Closing Submissions at para 121(d) – (e).I will deal with them in greater detail at [146]–[149] below. Profits of the Chinese joint venture 77 APBA’s main plank in its submissions in relation to the cross-claim is that Connectus Group would have the funds to repay its debts if profits which are due from its China joint venture are repatriated back to Singapore.  APBA argues that the joint venture operations in China have been doing well and generating profits.  These profits can and should be repatriated to Singapore, but instead, AS has been deliberately taking steps to frustrate attempts to repatriate these profits to Singapore.  Accordingly, AS’s conduct is engendering the very situation (ie,inability to pay its debts) which he is trying to rely on to wind up Connectus Group.  The winding up application ought therefore to be dismissed, as AS’s conduct is an abuse of process which should not be countenanced.134Foot Note 134×APBA Closing Submissions at para 155. 78 More particularly, APBA’s contention is that the amounts of RMB 3,335,090.98 and RMB 3,747,888.15, which represent the Chinese joint venture’s profits from the years 2013 to 2015 and the year 2016 respectively, should be repatriated from China to Connectus Group to alleviate the cash flow issues of the company and pay off its creditors, including AS.135Foot Note 135×APBA Closing Submissions at para 133.In addition, it points out that there was also approximately RMB 1.6m in profits generated by Connectus Shanghai (which took on the business of the Chinese joint venture) in 2017 and 2018, which should rightfully be repatriated.136Foot Note 136×APBA Closing Submissions at para 133. (1) Insufficient cash for repatriation 79  AS is in charge of the Chinese operations.137Foot Note 137×Transcripts (1 March 2019) p 8 lines 4 – 6.His explanation is that SLTS has been acting as the payroll agent for Connectus Shanghai since it commenced operations in 2016.138Foot Note 138×Transcripts (5 March 2019) p 49 lines 2 – 7.This is because, even though Connectus Shanghai’s majority owner is Connectus WFOE, the latter company has not been capitalised.139Foot Note 139×Transcripts (1 March 2019) p 151 line 24 – p 152 line 1.As a result, Connectus Shanghai has not received funds from Connectus WFOE to run its business from the time it started its operations in 2016.  SLTS has stepped in to finance the operations of Connectus Shanghai.  As a result of having paid the salaries and operational expenses of Connectus Shanghai, SLTS is owed about RMB 3.69m by Connectus Shanghai.140Foot Note 140×ACB p 478, paras 5 – 7; Transcripts (5 March 2019) p 41 lines 3 – 11; p 48 lines 20 – 24.There is evidence in the form of emails from as late as July 2017 where AS had updated PN about this financing being provided by SLTS for the operations in China,141Foot Note 141×PBAF2 p 185.and there is nothing produced by APBA which shows that PN had objected to this arrangement. 80 The operational expenses of Connectus Shanghai have been high and are growing because it has expanded quickly in the past few years.142Foot Note 142×PBAF2 p 187.As of 2019, Connectus Shanghai has seven offices across China, including in Beijing, Chengdu, Shenzhen, Suzhou and, of course, Shanghai.143Foot Note 143×Transcripts (5 March 2019) p 59 line 24 – p 60 line 4.While business is growing and Connectus Shanghai employs about 120 to 130 staff as at March 2019,144Foot Note 144×Transcripts (5 March 2019) p 60 lines 7 – 9.the company is tight on cash due to its growing payroll, which, according to AS, has increased to about RMB 2m a month.145Foot Note 145×Transcripts (5 March 2019) p 52 line 23 – p 53 line 16; PBAF3 paras 302 – 309. 81 AS’s evidence is that SLTS has been using the cash that it holds from the joint venture (established by the Cooperation Agreement) to partially pay off the debts due to it from Connectus Shanghai.146Foot Note 146×Transcripts (5 March 2019) p 51 lines 2 – 12; ACB p 478, para 7.He also testified that the cash received from the China business has primarily been used up to fund Connectus Shanghai’s growing payroll, and hence there is no available money to be repatriated to Singapore.147Foot Note 147×Transcripts (5 March 2019) p 52 line 23 – p 53 line 19; p 54 line 12 – p 55 line 9.In short, the cash being generated by Connectus Shanghai is being used as its working capital.148Foot Note 148×Transcripts (5 March 2019) p 129 lines 13 – 15; ACB p 379.The audited accounts of Connectus Shanghai show that the company only had RMB 586,770 of “Cash and cash equivalents” as at 31 December 2017.149Foot Note 149×ACB pp 681 and 690.This supports the contention that the company does not have sufficient cash on hand for dividends to be declared so that such sums can be repatriated through Connectus WFOE to pay off Connectus Group’s debts in Singapore. 82 While APBA does not accept these explanations by AS, there is little evidence before me to show that AS is not telling the truth.  APBA refers to the joint venture’s P&L Statements from 2013 to 2018, which show that the total amount of gross profits earned by the joint venture in the period is approximately RMB 8.5m.150Foot Note 150×APBA Closing Submissions at para 133; ACB pp 239, 682, 696 – 698 and 703.However, there is a difference between acknowledging that there are profits arising from the operations in China that accrue to the joint venture or to Connectus Shanghai, and whether there is available cash that can be repatriated to settle Connectus Group’s debts in Singapore. 83 APBA also refers to some WhatsApp messages in a group chat between SS, AS and EL in January 2017, which PN had obtained from EL.  In these messages, AS wrote that a potential investor was “[s]till keen” to invest in Connectus Group as AS had said that he would “settle all the debts via profit in [Connectus Shanghai]”.151Foot Note 151×ACB p 375.APBA argues that this shows that AS could repatriate cash from China if he wanted to.  In my view, given that there is no timeline stated as to when such debts would be paid off, AS’s message does not necessitate the conclusion that there is sufficient cashat presentthat can be repatriated to settle Connectus Group’s debts.  This is especially when it is undisputed that the business in China has been growing since January 2017,152Foot Note 152×Transcripts (5 March 2019) p 62 lines 11 – 13.and AS’s evidence is that cash generated by Connectus Shanghai has been channelled to support the Chinese business’s growing working capital. 84 PN has experience in doing business in China.153Foot Note 153×PBAF4, Tab 9, p 101.He has business interests there.  The evidence before me was that he was one of the shareholders of SLBC and SLTS,154Foot Note 154×Transcripts (6 March 2019) p 140 line 14 – p 141 line 3.although Chary was the majority owner and controller of these companies.155Foot Note 155×ABAF4 Tab 6, para 113.Apart from his shareholding, PN is also a director of Connectus Shanghai.156Foot Note 156×PBAF3 pp 276 – 277.As such, PN would surely be in a position to determine the extent of the business operations of Connectus Shanghai and whether the expansion of the operations in China is being financed by SLTS using the profits of the joint venture, which is now operating out of Connectus Shanghai.  Despite this, there was nothing substantive placed before me by APBA which contradicted in any material way AS’s evidence about how the cash from the Chinese operations has been used. (2) No inappropriate use of joint venture funds 85 Next, APBA argues that AS should not have permitted the joint venture’s profits to be effectively used as the working capital of Connectus Shanghai, and that this is “not the will of Connectus, and there is neither board nor shareholder approval for such usage”.157Foot Note 157×APBA Closing Submissions at para 146.I do not accept this argument as being a realistic one.  The directors and shareholders of Connectus Group have permitted AS to build and grow the Chinese business from the time of the inception of the joint venture to its present state in the form of Connectus Shanghai.  I do not see any evidence that suggests to me that there were parameters set on how he should run the business in China.  In any event, his expansion of the Chinese business can ultimately be only good for the shareholders of Connectus Group.  As such, it appears to me that they left AS to deal with the Chinese operations as he deemed fit. 86 From 2014 to 2016, there was no evidence of any email or written correspondence where PN asked AS for the profits from the Chinese joint venture to be repatriated.  It was only belatedly, sometime after July 2017, when it became clear that Connectus Group could not sustain its operations because of cash flow issues, that PN started agitating for the Chinese joint venture profits to be repatriated in Singapore.158Foot Note 158×PBAF2 pp 199 – 201.This was because he was not prepared to extend further shareholder loans to Connectus Group, unlike what AS did.159Foot Note 159×Transcripts (5 March 2019) p 175 lines 7 – 9.As such, at worst, this was a dispute between the directors of Connectus Group as to what was the proper approach to take in terms of how to utilise the available cash in China – to expand the Chinese business or to try to repatriate it to Singapore to take care of cash flow issues here.  I do not accept that there is sufficient basis to assert that the China profits were wrongfully withheld from Connectus Group by AS.  His evidence, in any event, is that there is insufficient available cash in China to be sent to Singapore to settle all of Connectus Group’s outstanding debts.160Foot Note 160×Transcripts (5 March 2019) p 108 lines 15 – 18. 87 Another difficulty that I have with APBA’s submission that the cash in Connectus Shanghai ought to be repatriated to settle Connectus Group’s debts is that it appears to ignore the interests of the other parties who have an interest in the Chinese operations.  First, it is not in dispute that the profits of the joint venture were being held by SLTS.161Foot Note 161×Transcripts (5 March 2019) p 49 lines 2 – 7.In turn, SLTS was funding the operations of Connectus Shanghai.162Foot Note 162×PBAF2 p 185.I am not sure what, if anything, Connectus Shanghai can do to stop SLTS from dipping into the amounts held by SLTS to reduce the debts owed by Connectus Shanghai. 88 APBA argues that SLTS technically has no right of set-off because the joint venture profits are held for Connectus Group, and not Connectus Shanghai.  It says that the joint venture profits should be returned to Singapore.163Foot Note 163×APBA Closing Submissions at para 150.But, as pointed out by AS, only a part of the joint venture profits are ultimately due to Connectus Group.164Foot Note 164×Seah’s Closing Submissions at para 47(b).The minority partners in the joint venture (Bonnie Wang and Frank Zhang) are entitled to 33.33% of these profits.  AS would be disregarding their interests if he asked SLTS to repatriate the profits held on behalf of Connectus Shanghai to Singapore to satisfy the debts of Connectus Group.  He would be jeopardising his working relationship with the management of the Chinese operations.  It is also commercially unrealistic to expect the minority partners to agree to have their portion of the joint venture profits accounted through Connectus Group, when they would know that the company in Singapore is saddled with debts. (3) No oral tripartite agreement 89 Another point that APBA raised (through PN) in relation to the China profits is that there was anoralagreement between PN and Chary that the loans extended by TSHK to Connectus Group did not have to be repaid, and that they could be set-off against the joint venture profits that were being held by SLTS on behalf of Connectus Group.165Foot Note 165×Transcripts (6 March 2019) p 203 line 19 – p 204 line 22; p 207 lines 2 – 10.APBA had initially raised this point to show that Connectus Group is not as indebted as it appeared to be and that the suit that had been commenced by TSHK against Connectus Group had no basis.  However, in its written closing submissions for the winding up, APBA appeared to abandon its reliance on this point.  Instead, it relies on the Cooperation Agreement and an agreement confirming that SLTS held “accumulated profits” of about RMB 3.335m on Connectus Group’s behalf166Foot Note 166×ACB p 536; Transcripts (1 March 2019) p 115 lines 8 – 15.(“the Accumulated Profits Agreement”) as the bases to submit that the China profits are due and outstanding, and that they can be recovered by Connectus Group once an end is put to AS’s obstructive conduct with respect to the said profits.167Foot Note 167×APBA Closing Submissions at para 170. 90 Despite this shift in position in the written closing submissions, I will deal with this issue given that it featured heavily as one of the main bases of its submissions in OS 449/2018 to show that there is ample justification for the Court to lend its assistance by permitting an EGM of Connectus Group to be called for resolutions to be passed to remove AS and SS.168Foot Note 168×APBA Skeletal Submissions for OS 449/2018, pp 25 – 26, paras 63 – 64.This is allegedly because of the Seahs’ clear breaches of their duties by denying the existence of this oral tripartite agreement. 91 AS gave evidence that PN and Connectus Group’s auditors had come up with the idea that the joint venture profits held by SLTS could be used as “collateral” for the loans extended by TSHK to Connectus Group.169Foot Note 169×Transcripts (1 March 2019) p 130 lines 6 – 7 and 22 – 25.Put in a legal sense, PN was hoping that there could be a tripartite agreement between TSHK, Connectus Group and SLTS where Connectus Group did not have to repay the loans extended by TSHK, and TSHK would just look to joint venture profits held by SLTS for the repayment of the loans.170Foot Note 170×See ACB p 455.AS testified that, as far as he knew, this was what the board of Connectus GrouphopedTSHK and SLTS would agree to, but this never came to pass.  Chary simply did not agree to it.  He always insisted that the borrowed amounts had to be repaid by Connectus Group to TSHK.171Foot Note 171×Transcripts (1 March 2019) p 132 lines 2 – 5, lines 16 – 21; ACB p 457.According to AS, he told his fellow directors in Connectus Group that Chary had declined to sign a “three-way” or tripartite agreement that he had prepared between TSHK, SLTS and Connectus Group.172Foot Note 172×Transcripts (1 March 2019) p 142 lines 4 – 11.So, all the directors were aware that the TSHK loans had to be repaid. 92 PN’s evidence on this issue of the oral agreement was most unsatisfactory.  He initially testified that he did not approve of AS and EL going ahead in 2015 to borrow funds from TSHK, and that he did not have any discussion himself with Chary about these loans.173Foot Note 173×Transcripts (6 March 2019) p 201 lines 7 – 25; p 199 lines 4 – 21.However, when he appeared to realise that this was not consistent with his allegation about the oral agreement with Chary, he caught himself and belatedly explained that he, in fact, had an oral agreement with Chary in 2014 about these loans and that they were “collateralised” by the joint venture profits held by SLTS.174Foot Note 174×Transcripts (6 March 2019) p 202 line 2 – p 203 line 6. 93 I pause here to just point out that the term “oral collateral agreement” was inaptly used by PN and both counsel on this issue given that the “collateral” referred to was in its true sense a form of security, and not that there was a “side agreement” of sorts.  I also note that the use of the word “collateral” was also confusing because, as I understand APBA’s case, the agreement was that TSHK had to look to SLTS for recovery of its loans made to Connectus Group.  There was no question of TSHK being permitted to sue Connectus Group for the recovery of these loans. 94 In any event, when PN was then pressed in cross-examination as to why he was unable to give particulars of this “oral collateral agreement” to Connectus Group’s lawyers in the course of the defence of the suit that had been commenced by TSHK for recovery of the loans, he could not give any coherent or sensible answer except to say that his computer had broken down.175Foot Note 175×Transcripts (6 March 2019) p 208 lines 11 – 25.I was not able to understand how a computer breaking down had anything to do with giving particulars of anoralagreement that he had allegedly reached with Chary. 95 I also find that there was a glaring internal inconsistency with PN’s evidence.  His insistence that he always wanted AS to repatriate the joint venture profits to Singapore and, at the same time, his objection to the company borrowing money from TSHK, directly conflicted with his allegation that there was an oral agreement between him and Chary, on behalf of TSHK and SLTS, that the money borrowed from TSHK could be treated as the repatriation of the joint venture profits held by SLTS.  The evidence that emerged during the cross-examination showed quite clearly that no such oral agreement existed and that was probably why this issue was not seriously pursued in APBA’s post-hearing submissions for the winding up. 96 There was also evidence before me that, in a WhatsApp group chat between PN, AS, SS and EL in August 2016, PN had posed the question as to whether he was right in thinking that the loans had to be repaid to TSHK.176Foot Note 176×PBAF3 p 253.After being informed that Chary was indeed chasing for the repayment of the loans to TSHK, PN then told AS to implement a repayment plan soon.177Foot Note 177×PBAF3 p 254.All this completely contradicts his claim about the oral agreement with Chary that the loans repayments would be set-off against the profits of the joint venture held by SLTS. 97 In sum, I find that there is insufficient evidence to support a conclusion that the China profits are being wrongfully withheld by AS to manufacture the cash flow insolvency of Connectus Group. Failure to capitalise Connectus WFOE and Connectus Shanghai 98 As for AS’s failure to capitalise Connectus WFOE and Connectus Shanghai, APBA submits that this puts the China profits at risk.  However, it is not immediately clear why this is the case, as there appears to be no dispute that Connectus Group has a 66.67% interest in the China joint venture.178Foot Note 178×PBAF1 para 21; APBA Closing Submissions, p 9, para 19 and Seah’s Closing Submissions, p 8, para (k). 99 More fundamentally, from the evidence, it does not appear to me that Connectus Group has sufficient cash at hand to capitalise Connectus WFOE and Connectus Shanghai.  The initial capital investment of RMB 900,000 for the Chinese joint venture that had been collectively contributed by the shareholders of Connectus Group in 2013 was returned to the company over several tranches from January to August 2017.179Foot Note 179×ACB pp 540 – 541.PN claims that these moneys should have been used to capitalise Connectus WFOE.180Foot Note 180×Transcripts (8 March 2019) p 65 lines 4 – 5.However, the evidence before me is that these moneys were largely used by EL, and later AS, to pay off various debts and expenses of Connectus Group,181Foot Note 181×ACB p 432, Transcripts (5 March 2019) p 114 line 23 – p 115 line 2 and p 115 lines 15 – 20; PBAF3 pp 771 – 779.including the unpaid salaries of AS and SS, which had been outstanding for several years.182Foot Note 182×Transcripts (6 March 2019) p 7 line 15 – p 9 line 15; APBA Closing Submissions at para 183.Whether priority should instead have been given to the capitalising of Connectus WFOE was a judgment call on the part of EL and AS.  In the absence of evidence that these payments were improper or unlawful, the Court will be slow to impugn the business decisions of directors and management.  As such, I find that there is no breach of fiduciary duty by AS in this respect. Cancellation of the consultancy fee agreement 100 APBA also alleges that AS has breached his duties as a director by cancelling the “consultancy fee agreement” dated 1 August 2016183Foot Note 183×APBA Closing Submissions at para 221.where SLTS confirmed that it would pay a consultancy fee of approximately RMB 3.335m to Connectus Group,184Foot Note 184×ACB p 535.which quantum was the whole of the joint venture profits from 2013 to 2015, not just the 66.67% which Connectus Group is entitled to.  In truth, there were no consultancy services provided by Connectus Group to SLTS.  The evidence was that the auditors of Connectus Group were looking for a way where the profits of the joint venture held in China by SLTS could be recognised in the accounts of Connectus Group.185Foot Note 185×ACB pp 440 and 445.This fiction of a “consultancy fee agreement” was eventually settled upon, after the initial Accumulated Profits Agreement which confirmed that SLTS held “accumulated profits” of about RMB 3.335m on Connectus Group’s behalf had been abandoned.186Foot Note 186×ACB p 536; Transcripts (1 March 2019) p 115 lines 8 – 15. 101 AS was a part of the decision-making on this issue.187Foot Note 187×Transcripts (1 March 2019) p 114 line 13 – p 115 line 1.After he procured the agreement to be signed between SLTS and Connectus Group, he proceeded to give instructions to the staff for an invoice to be raised and issued to SLTS so that the “income” could be booked into Connectus Group’s accounts.188Foot Note 188×ACB p 454. 102 His evidence was that he decided to cancel this agreement in October 2017 because he had realised that it was improper to rely on a sham agreement to “dress up” the accounts of Connectus Group, and that the proper way to route money from Connectus Shanghai to Connectus Group was by a declaration of dividends.189Foot Note 189×Transcripts (1 March 2019) p 148 lines 14 – 16. Transcripts (5 March 2019) p 12 line 17 – p 13 line 15.His evidence was that this “window dressing” was done at the behest of PN, who wanted to be able to get third parties to invest in Connectus Group.190Foot Note 190×Transcripts (1 March 2019) p 119 lines 22 – 23.AS cancelled the agreement by executing another agreement with SLTS on behalf of Connectus Group, where it is also recorded that no consultancy services had been provided by Connectus Group to SLTS.191Foot Note 191×PBAF2 p 233.APBA’s submission is that this was a deliberate act by AS to deprive Connectus Group of sums duly owed to it.  It also showed that AS was working in cahoots with Chary.192Foot Note 192×APBA Closing Submissions at paras 156 – 167. 103 I have some doubts as to whether AS had acted properly when he unilaterally decided, without consulting the rest of the board of Connectus Group, to execute the cancellation agreement.  He may have been justified in thinking that this was not a genuine agreement, but this was a matter that probably should have been brought up for discussion at the board level.  Having said that, the existence or otherwise of the “consultancy fee” agreement is not quite relevant because it is undisputed that the agreement was a sham, and that no consultancy services had in fact been provided by Connectus Group.  Being a sham, it was not an agreement that could have created legally enforceable rights for Connectus Group against SLTS for recovery of the alleged “consultancy fee”.  So, in my judgment, the cancellation of the “consultancy fee agreement” does not ultimately affect Connectus Group’s legal rights. 104 In the circumstances, I am of the view that this issue of the cancellation of the “consultancy fee agreement” does not amount to a breach of fiduciary duty on AS’s part. 105 Hence, APBA has failed to show how Connectus Group would have any valid cross-claims against AS on account of a breach of fiduciary duty on his part.",
        "Conclusion on the issue of insolvency": "106 In short, when all the evidence is considered, I am satisfied that Connectus Group is unable to pay its debts which have fallen due to AS.  In this regard, I have found that there is no valid basis for Connectus Group to dispute the debt due and owing to AS, and further that the company does not have a valid cross-claim against AS.  That being the case, Connectus Group is cash flow insolvent. 107 In this respect, I did not consider the other debts of the company, for example, to SS and TSHK.  As explained in Roy Goode,Principles of Corporate Insolvency Law(Sweet & Maxwell, 4th Ed, 2011) at para 4-19, “even debts which are technically due are to be ignored where there is no current indication that the creditors concerned are requiring repayment.”  This makes sense in practice, as otherwise, most banks would be insolvent under the cash flow insolvency test, as they “do not keep enough liquid assets to be able to pay all their depositors at the same time”: Wee Meng Seng, “Taking Stock of the Insolvency Tests in Section 254 of the Companies Act” [2011] SJLS 486 at 491.  In this case, SS has withdrawn her application to wind up Connectus Group.  TSHK did not appear in the hearing before me as a supporting creditor, nor did it file any affidavit asking for Connectus Group to be wound up, even though leave was granted for it to do so.  My conclusion is thus limited only to the fact that Connectus Group is unable to pay its debts to AS which have fallen due. 108 Given that Connectus Group is cash-flow insolvent, the Court has thediscretionto wind it up pursuant to s 254(1)(e) of the Act.  As Chan Sek Keong CJ made clear inBNP Paribas v Jurong Shipyard Pte Ltd[2009] 2 SLR(R) 949 (“BNP Paribas”)at [5], the “use of the word ‘may’ instead of ‘shall’ [in s 254(1) of the Act] indicates a discretionary power in the court to order a winding up”.  Hence, particularly when faced with a commercially viable company, the following may be considered (BNP Paribasat [19]): Where a petition to wind up a temporarily insolvent but commercially viable company is filed, many other economic and social interests may be affected, such as those of its employees, the non-petitioning creditors, as well as the company’s suppliers, customers and shareholders. These are interests that the court may legitimately take into account in deciding whether or not to wind up the company. … 109 APBA has repeatedly stressed the point that, while Connectus Group presently has insufficient cash to pay AS, it can and will come into funds because it can seek a repatriation of cash from Connectus WFOE after that company has been capitalised, which parties agree is a pre-condition before the profits earned by the joint venture in China and Connectus Shanghai can be repatriated to Singapore.193Foot Note 193×APBA Closing Submissions at paras 169 – 170.PN has stated on affidavit that he will be prepared to inject fresh capital into Connectus Group so that it can proceed to use the funds to capitalise Connectus WFOE and take other steps in China to repatriate available cash to Singapore.  However, this is conditional upon assurances that PN and the Lim family will have control over the board – hence, the application by APBA in OS 449/2018 for leave of court to call an EGM without the necessary quorum to remove AS and SS as directors of Connectus Group and effectively take control of the board.194Foot Note 194×ABAF4 Tab 6, paras 156 – 158. 110 APBA has also made the point in its submissions that Connectus Group has not been represented by counsel in the winding up application.  This is because AS and SS have not agreed to the choice of counsel for Connectus Group suggested by PN and SO.195Foot Note 195×APBA Closing Submissions at para 172; ACB pp 498 and 501 (DRIW refers to Directors’ Resolutions in Writing).I am at a loss at how AS and SS can be entitled to vote at board level on the choice of counsel for Connectus Group to defend this winding up application that has been started by them.  But leaving aside that point, I do accept APBA’s point that, if Connectus Group was represented by counsel in the winding up application, the Court might have been assisted on the issue of the net asset position of Connectus Group and whether the company would, if given time, be in a position to pay off its debts to AS.196Foot Note 196×APBA Closing Submissions at paras 171 and 173. 111 Having regard to the above, while aprima faciecase for winding up has been established on the basis that the company is unable to pay its debts that are due and owing to AS, I am not prepared to order a winding up of Connectus Group on this ground.  This is for three interrelated reasons.  First, there is an ongoing business of the company, that is, its 66.67% ownership of Connectus Shanghai and the thriving Chinese operations.  This is capable of generating cash which can eventually be repatriated to Connectus Group to pay off its debts.  Second, APBA has declared its intention to inject more capital into Connectus Group and to take steps to eventually repatriate cash from the Chinese operations to Singapore to remedy its cash flow issues and pay off its creditors.  APBA wants to revive the business in Singapore as well.  Third, there is insufficient evidence to conclude whether Connectus Group is balance sheet insolvent, in particular given its substantial shareholding in the Chinese operations.  Given that balance sheet insolvency is also a relevant consideration in determining if the company is insolvent for the purposes of s 254(1)(e) of the Act (seeChip Thyeat [20] andEncusat [53]), I decline to wind up the company on this ground. 112 For the above reasons, I find that a winding up order on the basis of Connectus Group’s cash flow insolvency is inappropriate given the present circumstances.",
        "Whether it is just and equitable to wind up Connectus Group": "113 The alternate ground raised by AS is that it is just and equitable to wind up Connectus Group because of the breakdown of the relationship of trust and confidence between the shareholders.",
        "Applicable principles": "114 Section 254(1)(i) of the Act empowers the court to order the winding up of a company where “it is just and equitable” to do so. 115 As explained inEbrahimi v Westbourne Galleries Ltd[1973] AC 360 (“Ebrahimi”) at 379–380 (cited with approval inSim Yong Kim v Evenstar InvestmentsPte Ltd[2006] 3 SLR(R) 827 (“Evenstar”) at [29]), the court’s just and equitable jurisdiction cannot be invoked at whim, and the pre-requisite to its exercise is where the company has been organised as what has come to be termed a “quasi-partnership”. 116 A “quasi-partnership” may include one or more of the following elements (Ebrahimiat 379, cited with approval inEvenstarat [29]): (i)anassociation formed or continued on the basis of a personal relationship, involving mutual confidence– this element will often be found where a pre-existing partnership has been converted into a limited company;(ii)an agreement, or understanding, that all, or some (for there may be “sleeping” members), of theshareholders shall participate in the conduct of the business;(iii)restriction upon the transfer of the members’ interestin the company – so that if confidence is lost, or one member is removed from management, he cannot take out his stake and go elsewhere. [emphasis added] However, it is to be cautioned that the three circumstances mentioned inEbrahimiare non-exhaustive, and the court inEvenstarobserved at [30] that “[o]ur courts … have not limited their jurisdiction to superimpose equitable considerations to merely the three circumstances mentioned” inEbrahimi.  Factors analogous to the three factors would no doubt bring into play the just and equitable ground for winding up: seeEbrahimiat 379. 117 Once it is determined that the company is a “quasi-partnership”, it must be shown why keeping the company as a going concern would result in unfairness.  As the Court of Appeal observed inEvenstarat [31], “the notion of unfairness lies at the heart of the ‘just and equitable’ jurisdiction in s 254(1)(i) of the [Act]”.",
        "Is Connectus Group a quasi-partnership?": "118 Turning first to whether Connectus Group is a quasi-partnership, AS argues that AS, SS, PN and LTH had come together to pursue this business venture of building a human resource services firm.  It was to be a joint endeavour in that each of them had a role to play in the building of the business.  SS and LTH had their respective areas of speciality and focus in the Singapore market.  AS was tasked with building the business in the growing Chinese market.197Foot Note 197×PBAF3 paras 19, 87(c).PN was to contribute his know-how and experience when it came to building human resource services businesses, and by introducing other specific human resource services.198Foot Note 198×PBAF3 paras 31 – 32, para 87(d).In short, he stood in the position as an experienced advisor to AS, SS and LTH.  None of them were to be just passive shareholders.  Each of them were appointed directors so that they would have a say in the management and direction of the business.199Foot Note 199×ACB p 57, clause 5.2.1; PBAF3 para 90. 119 Not only was it the case that each of the shareholders had board representation, they were also deriving remuneration and benefits from the business.  AS, SS and LTH were full-time employees and paid salaries by Connectus Group, or its joint venture in China.200Foot Note 200×Transcripts (1 March 2019), p 29 lines 7 – 18; p 30 lines 2 – 9.APBA was providing accounting and consultancy services to the company.201Foot Note 201×Transcripts (1 March 2019), p 28 line 10 – p 29 line 6.Kwang had been seconded to Connectus Group to act as its CFO.  For these services, APBA was paid fees by Connectus Group.202Foot Note 202×PBAF3 paras 94 – 95. 120 In my judgment, this is the key factor which shows that this company was, at its core, a group of like-minded persons who had banded together to carry out a business ventureandderive regular payments from the venture.  In the case of AS, SS and LTH, this was their career and livelihood, and APBA hadassociated with themon this basisthat the three of them were dependent on the company to earn a living and build their careers.  To analyse this in the language of implied terms, if it had been expressly raised to the shareholders at that time when Connectus Group started its life that AS, SS and LTH would be directors and have jobs at this company as part and parcel of their investment, the unequivocal answer would have been “of course”.  This implied understanding was the foundation of their association. 121 When LTH left Connectus Group, his shareholding was transferred to PN and then to SO.203Foot Note 203×ACB pp 97 – 98.It is not in dispute that LMF paid for these shares,204Foot Note 204×Transcripts (8 March 2019), p 150 lines 14 – 21.even though it is a matter of dispute in other ongoing legal proceedings as to whether the shares were intended as a gift to his son, EL, but registered in the name of SO.  For the purposes of these proceedings, I will regard this bloc of shares as belonging to the Lim family, without making a specific finding as to who exactly is the beneficial owner. 122 The unchallenged evidence of LMF, when he was cross-examined, was that he would not have paid for the shares in Connectus Groupifthe other shareholders had not agreed that EL would be appointed as the CEO of the company.205Foot Note 205×Transcripts (8 March 2019) p 160 lines 9 – 16.This shows that, even with the change of shareholder, there was no change in the nature of the arrangement between the shareholders – each of them was to contribute to the business and be allowed to appoint a director to the board of the company, and also derive remuneration for their services.  In the case of the Lim family, EL was the designated representative and beneficiary, in that he was employed by Connectus Group as its CEO. 123 There is little significance to the fact that SO, EL’s wife, was the one who was appointed as the director of Connectus Group.206Foot Note 206×PBAF1, Tab 1, p 27; Transcripts (8 March 2019) p 165 lines 10 – 12.The evidence showed that she had no role at all in the running of the business or on any major decisions of the company.207Foot Note 207×PBAF3 paras 66, 152 and 237.For example, there was a group chat where AS, SS, PN and EL would discuss the affairs of the company and business decisions to be made.  SO was not part of this group chat because she was not involved at all in the affairs of the company.208Foot Note 208×PBAF3 para 106 and pp 219 – 261.She was also not paid any directors fees.209Foot Note 209×PBAF3 para 362. 124 APBA makes several arguments as to why Connectus Group is not a quasi-partnership.  First, it points out that PN took a larger stake of more than 25% as compared to the other three shareholders from the outset so that he was able to block any special resolutions being passed.210Foot Note 210×APBA Closing Submissions at para 94.Second, the initial shareholders had documented their rightsinter sein the form of the SHA.211Foot Note 211×APBA Closing Submissions at para 95.Third, APBA dealt with Connectus Group on a commercial basis by issuing invoices for the services it provided.212Foot Note 212×APBA Closing Submissions at para 100.All these, APBA argues, is indicative of the fact that the parties did not come together on the basis of a personal relationship, involving mutual trust and confidence. 125 I do not accept that these facts negate the existence of a quasi-partnership between the shareholders.  The existence of partnership agreements, and partners having differing profit and voting shares is not inconsistent with the existence of a partnership.  For example, inEvenstar, two brothers pooled their Sinwa company shares into a company, Evenstar Investments Pte Ltd (“Evenstar”).  Their respective shareholding in Evenstar was proportionate to the amount of Sinwa shares they had pooled into Evenstar, namely 86.5% and 13.5% respectively.  Notwithstanding their unequal shareholding, the Court of Appeal did not hesitate in concluding that Evenstar was a quasi-partnership, and that the brothers had used the company merely as a vehicle for their object of pooling together their Sinwa shares (at [14] and [45]). 126 Similarly, the fact that APBA was given a slightly larger voting share so that it could have the final say on certain issues, or that parties had chosen to set out their rights in a written agreement, simply show the specific arrangements in relation to the “partnership” that they had agreed to.  It does not mean that the parties had not come together with a mutual understanding that they would each participate in and carry out this business venture, instead of one or more of them being passive investors, unless of course, such an understanding was contradicted by the terms of a written agreement.  In this case, there is no documented contrary intention whether in the SHA or any other contemporaneous written evidence. 127 Additionally, the fact that APBA may have issued invoices to Connectus Group for its fees is not inconsistent with there being a quasi-partnership.  Having a mutual understanding that the shareholders would all actively contribute towards the growth of the business does not mean that all formal documentation becomes redundant.  That would not be commercially realistic, especially since PN’s plan for Connectus Group was to grow it with a view of selling or listing it within three to five years.213Foot Note 213×Transcripts (6 March 2019) p 142, lines 3 – 7. 128 For the above reasons, I find that Connectus Group is effectively a quasi-partnership between the four shareholders, as there was an understanding between them that each of the shareholders would be able to participate in the running of Connectus Group and also to derive remuneration for their respective contributions to the company.  It was on this fundamental basis that the shareholders pooled their resources together in the entity that is Connectus Group.  In my judgment, it is accordingly clear that their union was founded on a relationship of mutual trust and confidence between the parties. The Shareholders’ Agreement 129 APBA argues that, upon the departure of LTH, the three original shareholders - AS, SS and PN (as APBA’s representative) - had agreed to “waive” the SHA or treat it as “void”.  It is submitted that the intention of AS, SS and PN was to treat the agreement as having no effect.  Given the “voiding” of the SHA, “there was no agreement or understanding that parties had any right to directorship”.214Foot Note 214×APBA Closing Submissions at para 104(a).Therefore, even if Connectus Group began its life as a quasi-partnership, the relationship between the parties evolved after the “voiding” of the SHA, such that it should no longer be considered a quasi-partnership. 130 The basis of this submission is the one-page document signed by AS, SS and PN, both in his personal capacity and as representative of APBA, when PN was about to transfer to SO the shareholding he had acquired from LTH.  The last sentence of the document stated that AS, SS, PN and APBA “agree to waive the SHA completely and immediately”.215Foot Note 215×ACB p 98.In its submissions, APBA also points to emails and oral evidence of AS, where he accepts that the SHA was “already voided”.216Foot Note 216×APBA Closing Submissions at paras 63 – 64.Thus, it is argued that, in the absence of the SHA, there was no agreement between the shareholders that they each had a right to board representation.217Foot Note 217×APBA Closing Submissions at para 79.In fact, AS and SS had attempted to remove PN from the board of Connectus Group on July 2015.218Foot Note 218×APBA Closing Submissions at para 104(a); ACB p 99.Hence, there was nothing unfair or wrongful about APBA’s attempts to remove AS and SS as directors of Connectus Group. 131  I had some difficulty with the submission that the SHA has been “voided”, which I take to mean that it has, by agreement of the parties, been treated as no longer having any legal effect.  This is because clause 22.3 of the SHA provides that the agreement can only be amended or varied if it is done “in writing and signed by or on behalf of each of the Parties”.219Foot Note 219×PBAF2 p 331, clause 22.3Even if I was to accept the document signed by AS, SS, PN and APBA as one where they had agreed to treat the SHA as having no legal force, this would not be effective according to clause 22.3 since LTH did not execute that document.220Foot Note 220×See ACB p 98.In fact, there is no evidence that he even had knowledge of the existence of such a document.  Tellingly, the document evincing the parties’ agreement to waive the SHA was executed on the same day when LTH had transferred his shares to PN by way of a separate agreement.  While LTH’s signature was reflected in the latter agreement, his signature was absent in the former document whereby the parties agreed to waive the SHA “completely and immediately”.221Foot Note 221×Compare ACB pp 97 – 98. 132 However, the evidence of AS and PN is consistent in that they both treated the SHA as being no longer effective.222Foot Note 222×APBA Closing Submissions at para 38(b); Transcripts (1 March 2019) p 59 line 9 – p 60 line 16; ACB p 411.Furthermore, neither AS nor APBA have taken the position in their affidavits or submissions that the SHA provisions arestilllegally effective to create rights or obligations that govern the current dispute between the shareholders.  For example, APBA has not taken the position that the deadlock and buyout provisions at clause 17 of the SHA, or the default and call option provisions at clause 18, would prohibit AS from making this application to wind up Connectus Group on a just and equitable basis.  That being the case, I proceed on the basis that it is common ground that the SHA is no longer in force. 133 As for APBA’s submission that the “voiding” of the SHA shows that the shareholders had no right to board representation, I am unable to accept this argument.  In my judgment, it does not follow from the termination of the SHA that the underlying quasi-partnership between AS, SS and APBA had changed.  As I have already found, Connectus Group was in essence an incorporated quasi-partnership between the original four shareholders, and the change in 2013 was that one quasi-partner (LTH) was replaced by another quasi-partner (the Lim family).  There was no change to the mutual understanding between AS, SS and APBA that they would each play an active role in this business, save that the Lim family now participated in this joint endeavour and shared this mutual understanding.  I do not see the abandoning of the SHA, if effective, as evincing an intention to change the mutual understanding between AS, SS and APBA.  In fact, the evidence before me was that the AS, SS, APBA and the Lim family were planning to sign a new shareholders’ agreement.  AS gave evidence that he believed that it would be along the same terms as the last one, and that APBA’s Kwang was supposed to ensure that this agreement was prepared, but this was never done.223Foot Note 223×Transcripts (1 March 2019) p 60 lines 14 – 21; p 62 line 21 – p 63 line 20. 134 PN’s evidence in this regard was enlightening in several respects.  First of all, he gave evidence that the SHA had to be terminated because the Lim family did not want to be party to that agreement.224Foot Note 224×Transcripts (6 March 2019) p 162 lines 1 – 2.This is simply not credible.  It was not a reason that had been set out in any of his many affidavits filed in either proceeding before me.225Foot Note 225×Transcripts (6 March 2019) p 162 lines 14 – 16.Also, neither LMF nor SO gave evidence to this effect.  Not only that, there was no sensible reason why the Lim family would not want to be party to an agreement that would essentially set out in writing the rights of the shareholdersinter seandvis-à-visthe company.  Second, email chains, in which PN was copied to, showed that EL was actively asking Kwang to come up with a new shareholder’s agreement.226Foot Note 226×ACB pp 411 – 412.When shown the chain of emails, PN was evasive about whether he was aware of the need for a new agreement.227Foot Note 227×Transcripts (7 March 2019) p 60 lines 17 – 21; p 61 line 9 – p 62 line 5.As things turned out, the shareholders never got around to preparing and signing a new agreement, and more pressing issues for Connectus Group seemed to take precedence.  That parties were quite prepared to proceed without the need for a new shareholders’ agreement is, to my mind, consistent with the fact that the shareholders understood the role that each would play in relation to the company and the general nature of their rights against each other. 135 Hence, when Connectus Group convened an EGM to remove PN as a director, APBA’s response letter of 5 August 2015 was to remind the shareholders that they each had a right to have board representation of their choosing.  In APBA’s words, PN’s directorship was “inextricably bound together with” its shareholding.228Foot Note 228×ACB p 428, para 8(a)(ii).At the EGM, AS, SS and EL (holding the proxy for SO) backed down and the resolution to remove PN as a director was withdrawn.229Foot Note 229×Transcripts (1 March 2019) p 89 line 24 – p 90 line 4.APBA’s explanation is that the contents of its letter should not be taken at face value because it was but a desperate attempt by PN to stay in his position as a director and hence APBA was prepared to say anything.230Foot Note 230×APBA Closing Submissions at para 77(b).I found this explanation to be a rather poor excuse.  As was conceded by PN in his own affidavit, this was a letter that was drafted with legal advice.231Foot Note 231×ABAF4 Tab 6, para 40.Hence, it was a considered response.  I find that it is an admission by APBA that the understanding between the shareholders was that they would each have a role to play in managing Connectus Group. 136 I therefore find that, even if the SHA is no longer in force, the mutual understanding that underpinned the parties’ working relationshipvis-à-visConnectus Group remained intact.  This included the understanding that each shareholder would be entitled to representation on the board of Connectus Group.  Accordingly, the “voiding” of the SHA does not change my finding that Connectus Group is in essence a quasi-partnership.",
        "Unfairness": "137 Having concluded that Connectus Group is a quasi-partnership, I turn to consider whether keeping the company as a going concern would result in unfairness, which, as mentioned above at [117], lies at the heart of the just and equitable jurisdiction in s 254(1)(i) of the Act. 138 In this respect, s 254(1)(i) of the Act “does not allow a member to ‘exit at will’ … [n]or does it apply to a case where the loss of trust and confidence in the other members is self-induced” (Evenstarat [31]).  Real unfairness must be demonstrated.  Examples of when such unfairness has arisen, include cases “involvingmanagement deadlockorloss of mutual trust and confidence…, whether arising from broken promises or disregard for the interests of the minority shareholder.  Unfairness can also arise in theloss of substratumcases” [emphasis added]:Evenstarat [31]. Loss of mutual trust and confidence 139 Given the overt attempts by APBA and the Lim family to remove AS and SS as directors of the company, I accept the submission that there has been a clear breakdown in the relationship of trust and confidence between the parties. 140 PN has explained that, if he was in control of the board of Connectus Group, his avowed objective is to get Connectus WFOE capitalised, and then remove AS from involvement in the Chinese operations because he is of the view that AS has taken steps to prevent the repatriation of the profits to Singapore.232Foot Note 232×ABAF4 Tab 6, paras 156 – 158.SO has sworn on affidavit that she is fully agreeable with PN’s plans.233Foot Note 233×Supporting Affidavit of Ong Poh Suan Sharon (11 April 2018) at para 6.Put simply, AS would be sacked from Connectus Shanghai.  AS himself described the intended actions as an attempt to deprive him of his livelihood.234Foot Note 234×Transcripts (6 March 2019) p 75 lines 8 – 21.In my view, it is quite clear that such a contemplated course of action by APBA and the Lim family would be contrary to the mutual understanding of the shareholders that this was a business venture where all of them would be able to actively participate in the business and also derive remuneration from such participation. Management deadlock 141 There is also a management deadlock at the board level in that SO and PN cannot agree with AS and SS on the right course of action for the company in response to all its financial difficulties.  SO and PN believe that the way forward is to remove AS and SS as directors, to which the latter obviously do not agree.  AS believes that the only realistic options for the company now are judicial management or liquidation.  It is not important who is right or wrong in this regard.  What is relevant is that the parties have reached an intractable impasse and the company’s business in Singapore has withered in the meantime.  In the circumstances, given that the parties are simply unable to work with each other any further, and as there has been a loss of trust and confidence between the parties, I find that AS has established his case that it would be just and equitable to wind up Connectus Group. Loss of substratum 142 A related point raised by AS is that there is a loss of substratum of Connectus Group because the business in Singapore ceased completely by May 2018.235Foot Note 235×Seahs’ Closing Submissions at para 10(c).APBA’s objection to this is quite a technical one.  It argues that AS and SS had filed the application to wind up the company in April 2018, and in their joint affidavit in support, there is no mention of “loss of substratum” as a ground of winding up, and in any event, the state of affairs did not come into existence untilafterthe winding up application was filed.236Foot Note 236×APBA’s Closing Submissions at para 189(d). 143 It is not necessary for me to decide on APBA’s objection to this ground for seeking a winding up of Connectus Group because, even if one could consider the cessation of Connectus Group’s business in Singapore, there are two problems with AS’s arguments in this regard.  First, it appeared to me that SS had stopped working not because it was no longer possible to do so, but because of the ongoing difficulties in her relationship with PN, and to a lesser extent SO.  Second, Connectus Group was set up to carry out a human resource services business.  One aspect of that business, which is the Chinese operations being undertaken by its ultimate subsidiary, Connectus Shanghai, is still very much in full swing.  As such, it cannot be said that the purposes for which Connectus Group was established can no longer be achieved.  Rather, it is the breakdown of the working relationship between AS and SS on the one hand, and PN and SO on the other hand, which has caused SS to cease her career at Connectus Group and for all the employees of the company to leave.  Presently, the Singapore operations are no longer functioning and the company no longer has any office premises, but this is a symptom of the poor working relationship between the directors and shareholders, rather than the cause of it.  For these reasons, I am unable to agree with AS that there has been a loss of substratum such that it would be just and equitable to wind up Connectus Group.  In any case, the loss of substratum is but one avenue to demonstrate unfairness.  For the reasons given at [139]–[141] above, I nonetheless find that it would be just and equitable for Connectus Group to be wound up. Opportunity to investigate the affairs of Connectus Group 144 There is a further point that I must deal which has been raised by APBA.  A consistent theme that runs throughout its submissions is that the Court should not wind up Connectus Group because it would effectively whitewash the sins of AS and SS, and prevent APBA from taking control of the company and doing a thorough investigation of their conduct.237Foot Note 237×APBA Closing Submissions at paras 262 – 263. 145 I do not accept this submission. 146 In the first place, I find that the various instances raised by APBA of AS and SS having breached their duties as directors or having acted against the interests of Connectus Group cannot be made out on the evidence before me.  On the contrary, it appears to me that AS and SS have tried their best to make this business venture work in spite of the difficulties which had been caused by EL.238Foot Note 238×PBAF3 pp 112 – 115.Also, APBA only started to raise questions about various affairs in the company after the departure of EL, when APBA and LMF were trying to sell their stakes in the company to AS and SS.239Foot Note 239×PBAF3 pp 741 – 742. 147 Further, as a director, PN has an untrammelled right to inspect the company’s accounts and obtain information and documents of the company to address any concerns that he might have (see,eg,s 199 of the Act).  There was no allegation that he was denied access to any documents that he wanted to inspect.  In any event, he had legal recourse under the Act if he was deprived of his right to inspect any document of the company.  Further, as a director, PN was free to investigate any possible wrongdoing on the part of AS and SS.  However, there was just a smattering of accusations against AS and SS about how they apparently did not exercise more supervision over EL or about the way they selectively applied Connectus Group’s moneys to satisfy certain obligations rather than others.240Foot Note 240×See,eg,APBA Closing Submissions at para 121.But, there was no real substantiation that there had been any lack of probity or gross negligence on the part of AS and SS. 148 More importantly, it was open to APBA to seek appropriate remedies on Connectus Group’s behalf by commencing a derivative action under s 216A of the Act, if there was a credible basis for asserting AS and SS have breached their duties to Connectus Group.  In fact, APBA could have applied under s 216A of the Act for leave to defend the winding up application on behalf of Connectus Group, but this was not done. 149 If an order is made for Connectus Group to be wound up, it would still be open for APBA to furnish the liquidator with its reasons for believing that AS and SS have breached their duties.  A liquidator, if provided with the necessary funding, will be obliged to investigate and pursue legitimate claims against the former directors for any losses to the company occasioned by the breaches of their duties.  This would include the allegations against AS and SS for allegedly diverting business away to another company named Gateway Search Pte Ltd, an issue that was not clearly fleshed out in the evidence before me.",
        "Conclusion and appropriate remedies": "150 In the circumstances, for the reasons I have given, I find that AS has established that there exist grounds which make it just and equitable to wind the company up. 151 Although I have found that the grounds for winding up under s 254(1)(i) of the Act have been established, I find that this is a case where it may be appropriate for me to make an order under s 254(2A) of the Act that the shares of AS and SS be purchased by APBA.  Section 254(2A) states: On an application for winding up on the ground specified in subsection (1)(f) or (i), instead of making an order for the winding up, the Court may if it is of the opinion that it is just and equitable to do so, make an order for the interests in shares of one or more members to be purchased by the company or one or more other members on terms to the satisfaction of the Court. [emphasis in original] 152 Section 254(2A) of the Act was introduced to give effect to a recommendation of the Steering Committee appointed by the Ministry of Finance to review the Act:Ting Shwu Ping (administrator of the estate of Chng Koon Seng, deceased) v Scanone Pte Ltd and another appeal[2017] 1 SLR 95 at [34].  According to theReport of the Steering Committee for Review of theCompanies Act(June 2011) at para 131, a buy-out remedy would be preferable to a winding-up order in certain instances when the court is faced with an application to wind up a company on the just and equitable ground under s 254(1)(i) of the Act: … [T]he Steering Committee agrees that it would be useful to amend section 254(1)(i) to explicitly provide the court with the power to order a buy-out of the shares in an application for the winding-up of a company on the ‘just and equitable’ ground. This additional remedy would allow a court to order a buy-out instead of a winding-up in cases where thecompany is still viableand it would be amore efficient solutionfor the majority to buy out the minority (or vice versa) … [emphasis added] 153 A buyout of the shares of AS and SS, or of APBA and the Lim family, had been discussed by the parties at some stage in the second half of 2017.  It will be recalled that LMF and APBA had executed mutual undertakings to sell their shares together.  Thus, the warring parties had recognised that there is still value in the Connectus Group shares.  Given that, and APBA’s professed intention to wish to take control and run Connectus Group without interference from the Seah siblings, it would be appropriate for APBA to consider whether it wishes to buy the shares of AS and SS in order that it can carry out its plans for the company. 154 I therefore direct parties to file submissions within 14 days of judgment on whether such a buyout order should be made, and if so, on what terms.  Alternatively, if APBA no longer has any interest in gaining unrestricted control of Connectus Group and reviving its business, then it should state so.  If that is the case, I will then grant the order for Connectus Group to be wound up under s 254(1)(i) of the Act and also give directions for parties to make submissions on the appropriate person to be appointed as the liquidator of Connectus Group.  The liquidator appointed will have to,inter alia, take steps to secure the company’s interest in the business in China and may have to consider whether the business there is to be sold in order to raise funds to pay the company’s various creditors, or otherwise disposed of. 155 I will reserve my decision on the question of costs until I hear from the parties pursuant to my directions at [154]. Ang Cheng HockJudge Rajiv Nair (GKS Law LLC) for the plaintiffs;Khoo Ching Shin Shem, Teo Hee Sheng, Christian and Esther Yong (Focus Law Asia LLC) for APBA Pte Ltd;The defendant absent and unrepresented."
    }
}