{
    "case_title": "Danial Syafiq bin Mahbob  vAmin Juman bin Abdul Jabbar and another (Mohammed Faizal bin Ismail, third party)",
    "ncitation": "[2019] SGHC 282",
    "coram": "Andrew Ang SJ",
    "sections": {
        "Introduction": "1 This was an action in negligence brought by the Plaintiff, Danial Syafiq bin Mahbob who was seriously injured on 17 April 2013 when the motorcycle on which he was riding pillion behind the first Defendant, Amin Juman bin Abdul Jabbar (“the Defendant”), collided with a taxi driven by the Third Party, Mohammed Faizal bin Ismail. 2 By consent, interlocutory judgment for 100% liability was entered against the Defendant on 12 October 2016 with damages to be assessed and interest, costs and disbursements reserved to the Registrar.",
        "Facts": "3 Following the accident, the Plaintiff was admitted to Khoo Teck Puat Hospital’s (“KTPH”) Accident & Emergency department (“A&E”). According to the medical report dated 22 May 2015 of the Plaintiff’s expert witness, Dr Yang Weiren Eugene (“Dr Yang”), on arrival at the A&E, his Glasgow Coma Scales (“GCS”) was E2V1M5 (corresponding to 8) on account of the traumatic brain injury which he sustained.1Foot Note 1×Plaintiff’s Core Bundle dated 2 May 2019 (“Plaintiff’s Core Bundle”) at pp 1–2.He was intubated in the A&E. A CT imaging of the brain showed a left cerebral convexity acute subdural haemorrhage (“SDH”) measuring 1.3 cm in maximal thickness causing 0.8 cm midline shift to the right. He also sustained multiple foci of traumatic subarachnoid haemorrhages in the left cerebral hemisphere and fracture of the right zygomatic arch and parietal bones.2Foot Note 2×Plaintiff’s Core Bundle at p 4. 4 He underwent an emergency left craniectomy, evacuation of SDH and insertion of intracranial pressure (“ICP”) monitor. Post-operatively, he was monitored in the Surgical Intensive Care Unit (“SICU”). A repeat CT scan the next day revealed a large right cerebral convexity extradural haematoma (“EDH”). Hence an emergency right craniectomy and evacuation of EDH was performed.3Foot Note 3×Plaintiff’s Core Bundle at p 4. 5 A CT Brain Scan on 20 April 2013 showed improvement in midline shift.4Foot Note 4×Plaintiff’s Core Bundle at p 5. 6 There were no further ICP issues while he was in SICU and his GCS improved to E4VTM5. He was successfully extubated on 24 April 2013 and transferred to the general ward on 26 April 2013.5Foot Note 5×Plaintiff’s Core Bundle at p 5. 7 He was seen by a physiotherapist, occupational therapist and speech therapist and showed good progress. His GCS improved to 15 and he was discharged to Tan Tock Seng Hospital Rehabilitation unit on 20 May 2013.6Foot Note 6×Plaintiff’s Core Bundle at p 5. 8 He was readmitted on 9 June 2013 for an elective left cranioplasty performed on 10 June 2013. There were no complications and he was discharged on 13 June 2013 with regular Neurosurgery follow-up.7Foot Note 7×Plaintiff’s Core Bundle at p 5. 9 The Plaintiff’s expert Dr Premkumar Kandasamy Pillay (“Dr Pillay”), a consultant neurosurgeon in private practice, examined the Plaintiff on 1 December 2016 for the purpose of preparing a specialist medical report. In his report dated 17 January 2017, he noted that the Plaintiff’s GCS was 8 on arrival at KTPH on 18 April 2013. From physical and neurological examinations in his clinic, Dr Pillay noted the following:8Foot Note 8×Bundle of Affidavits dated 12 March 2019 (“Bundle of Affidavits”) at pp 210 and 211. “I noted that he was awake, alert and orientated. He was able to walk normally. Gross motor sensory and cerebellar testing was within normal limit. He was sent for detail [sic] neuro-psychological testing, and this was carried out on the 28th December 2016 by Mr. David Oon (Consultant Psychologist). The conclusion of this test was evidence of moderate impairment in Immediate Memory and General Memory. There was also moderate impairment in short term and long term Auditory and Visual Memory. There was evidence of deterioration in cognitive functioning with his cognitive abilities now within the borderline-defective range. In conclusion, this patient has sustained significant head injuries and significant cognitive, memory problems as a consequence. He also has a problem of post-traumatic epilepsy. All of these are permanent and life-long problems. I would assess his overall disabilities, in view of all these problems, at 55% permanent disability.” 10 Dr Pillay reviewed the Plaintiff’s condition on 23 August 2018 and noted in his specialist medical report dated 8 October 2018 as follows:9Foot Note 9×Bundle of Affidavits at p 221. “There has been no significant changes in his overall neurological status except for the fact that he has persistent seizures as a result of his brain injury. His last seizure was on the 3rd June 2018 ...” 11 However, the frequency of epileptic seizures has diminished over the period from 8 November 2013 to 3 June 2018 so that of the total number of 46 fits, most of them occurred in between 2013 and 2015, with 6 episodes in 2016, 4 in 2017 and only 1 in 2018. When asked, Dr Pillay opined that the fits could recur. 12 Dr Pillay continued as follows:10Foot Note 10×Bundle of Affidavits at p 221. “Gross motor examination was Grade 5/5, sensory examination was within the normal range and coordination was normal and he was walking normally. Detail [sic] neuro-psychological test was carried out, this showed that he continues to face significant difficulties in auditory memory and verbal reasoning ability. He struggles to remember auditory information and express his ideas with words and solves [sic] problems using language. I concurred that this will have an [sic] negative impact on his ability in a working situation as well as interacting with peers in the normal work force. His problem with his cognitive and memory functioning suggest that he will have difficulties understanding complex instructions and expressing himself verbally and in writing, as compare[sic] to his peers. He will need additional time to allocate and complete tasks. Instructions for him need to be clear, short and simple. He will be unable to fully assimilate complex instructions and information. It is unlikely that he will be able to work in a high performing job. He is at risk for long term seizures. It is clear that he needs cognitive and memory therapies. The cost of these therapies is estimated to be approximately SGD $10,000 per year.” 13 The Defendant’s expert witness, Dr Chong Piang Ngok (“Dr Chong”), a consultant neurologist and physician in private practice examined the Plaintiff on 23 March 2017 and issued his medical report on 6 April 2017 responding to questions posed in Defendant’s solicitors’ letter of 14 March 2017. 14 The main points he made are as follows:11Foot Note 11×Bundle of Affidavits at p 243. Comments: 1. The Plaintiff suffered severe brain injuries as a result of brain injuries following the accident. 2. The Plaintiff had no permanent physical neurological deficits. 3. Both Dr Yang and Dr Pillay opined that the Plaintiff suffered permanent cognitive deficits. 4. The Plaintiff suffered post-traumatic epilepsy. Answers to your Questions dated 14 Mar 2017: 4(i) The Plaintiff had no relevant pre-existing injuries. 4(ii) The Plaintiff suffered severe brain injuries. His Glasgow Coma Score was adversely affected. He had skull fractures. He was intubated. He required two craniectomies to drain life-threatening brain hematomas. 4(iii) The full injuries are described in the reports by Dr Thangaraj Munusamy and by Dr Eugene Yang. 4(iv) The Plaintiff does not have relevant physical neurological deficits. He is independent in all areas of activities of daily living. His permanent injuries are in the domain of cognition. I am inclined to believe that the Plaintiff’s complaints are consistent with the described injuries, and are genuine. 4(v) I do not see any need for future surgical procedures. Dr Yang and Dr Pillay did not mention such surgical procedures in their reports. He would need monitoring for his seizures. There is a possibility that seizure medications might not be necessary in the future.”",
        "Damages": "15 Under General Damages the Plaintiff’s heads of claim are as follows: Under General Damages the Plaintiff’s heads of claim are as follows: 1. Pain and suffering/Loss of amenities (i) Traumatic brain injury (ii) Multiple facial fractures (iii) Post-traumatic epilepsy (iv) Facial abrasion/haematoma 2. Loss of Future Earnings/Loss of Earning Capacity 3. Future surgery, medical and transport expenses. 4. Future maid/nursing care. 5. Provision for additional insurance premium which Plaintiff is likely to have to pay. 16 With regard to Special Damages, the Plaintiff’s claims fall under the following heads: (1) Medical Expenses (2) Transport Expenses (3) The mother’s pre-trial loss of earnings (4) Costs of renovation (5) Refund of examination fees",
        "General damages": "Pain and suffering; loss of amenities Brain injury 17 In respect of his brain injury, the Plaintiff seeks damages of $185,000 whereas the Defendant submits that a lower figure of $80,000 is appropriate.12Foot Note 12×Plaintiff’s written submissions dated 2 May 2019 at para 25 (“Plaintiff’s Written Submissions”); The 1st Defendant’s written submissions dated 2 March 2019 (“1st Defendant’s Written Submissions”) at para 9.Both parties rely on theGuidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010) (“GAGD”). 18 The Plaintiff’s figure of $185,000 in effect places the Plaintiff’s brain injury under the “Very Severe Damage” category in the GAGD where the range for this category of injury is from $160,000 to $250,000. The Plaintiff cites no precedents apart from a passing reference toLee Wei Kong (by his litigation representative Lee Swee Chit) v Ng Siok Tong[2012] SGCA 4 (“Lee Wei Kong”)13Foot Note 13×The 1st Defendant’s Bundle of Authorities Tab C.andAODv AOE[2015] SGHC 272 (“AODv AOE”)14Foot Note 14×The 1st Defendant’s Bundle of Authorities Tab A.. In any case, it appears to me that the injury sustained by the claimant inLee Wei Kongwhere the claimant was awarded $160,000 was more severe. 19 The Defendant submits that as “the Plaintiff has fully recovered from his traumatic injury and has no permanent physical or neurological deficits”, the Plaintiff’s injury should fall within category (c)(i) “Moderate brain damage” where the applicable range of damages is between $80,000 to $120,000.15Foot Note 15×1st Defendant’s Written Submissions at para 15. 20 The Defendant refers toYeoChee Siong v Salpac (S) Pte Ltd[2017] SGHC 304 (“YeoChee Siong”)16Foot Note 16×The 1st Defendant’s Bundle of Authorities Tab L.where the High Court awarded $130,000 for what the judge considered to be moderately severe brain damage. On appeal, the Court of Appeal (“the CA”) reduced the damages to $70,000 which placed the severity within category c(ii) of  the GAGD.17Foot Note 17×The 1st Defendant’s Bundle of Authorities Tab D. 21 The CA noted that the claimant had made good recovery and did not require “heavy reliance on care-givers for constant care” such as to qualify under category (b) (“Moderately severe brain damage”) of GAGD.18Foot Note 18×The 1st Defendant’s Bundle of Authorities Tab D at para 22 The Defendant concedes that unlike the claimant inYeoChee Siongthe Plaintiff suffered post-traumatic epilepsy and therefore came within category c(i) of GAGD. However, the $80,000 damages that the Defendant proposes places the Plaintiff at the bottom of the range from $80,000 to $120,000. 23 I agree with Defendant that the Plaintiff should come under category (c)(i), but I regard $100,000 as more appropriate taking into account the fact that the Plaintiff suffered post-traumatic epilepsy and remains at some (albeit low) risk of further fits in the future. Multiple facial fractures 24 The parties agree on the figure of $20,000 for this injury. Post traumatic epilepsy 25 Dr Yang in his 22 May 2015 medical report noted that the frequency of the Plaintiff’s traumatic seizures were once a month and that he was still on anti-epileptic medication. Although he opined that the seizures were likely to be permanent, we now know that they appear to have tailed off, there having been only 1 seizure in 2018. Dr Pillay, though, cautioned that they could recur. In his words:19Foot Note 19×Certified transcripts dated 20 March 2019 p 39 lines 16 – 22. Even though he only had one seizure in 2018, he could have another seizure at another time and sometimes you can have another period of having more seizures. The most dangerous consequence is called “status epilepticus” which is potentially life threatening. Because of this, he may require not only additional medications and more than just a single anti-epileptic medicine, he may even require hospitalisations… 26 On the other hand, Dr Chong opined as follows:20Foot Note 20×Certified transcripts dated 20 March 2019 p 40 lines 9 – 13. … it is unlikely that it suddenly will get much worse. Although that statement that, you know, anytime [he] may get another fit is obviously true, in more than 30 years of treating epileptics, you know, I can tell you there are very, very few status epilepticus …”. 27  Dr Pillay disagreed and suggested that the profile of Dr Chong’s patients could be different from those of patients seen by neurosurgeons.21Foot Note 21×Certified transcripts dated 20 March 2019 p 40 lines 25 – 29. 28 Despite the difference of opinion, the quantum of damages that parties argued for is not that far apart. Whereas the Plaintiff seeks $50,000 taking into account that the seizures overlap with brain injury, the Defendant proposes $40,000.22Foot Note 22×1st Defendant’s Written Submissions at para 19. 29 In my view a fair compromise is $45,000 and I so decide. Facial abrasions and scars 30 The Plaintiff seeks $3,000 in damages for facial abrasions and a separate award of $10,000 for 2 large scars from the frontal area to the back on each side of the scalp.23Foot Note 23×Plaintiff’s Written Submissions at para 37.The Plaintiff did not mention any haematoma in his closing submissions. Strangely, the Defendant characterised the Plaintiff’s claim as being for a haematoma, facial abrasion and allegedly non-existent scars. Defendant’s counsel argued that Dr Marrie Vyne C Shakya (“Dr Shakya”) in her report of 16 July 2018 did not mention any scars.24Foot Note 24×1st Defendant’s Written Submissions at para 22. 31 However Dr Shakya’s report was in relation to the Plaintiff’s fall after an epileptic fit on 4 June 2018. The facial abrasion and haematoma noted were presumably those resulting from the fall and were not even raised by the Plaintiff.25Foot Note 25×Defendant’s Core Bundle at p 29.It is little wonder the Defendant proposed $500 damages for the abrasion and $1,000 for the facial haematoma. 32 The fact that the Plaintiff has 2 large scars on his scalp is well documented. For example, Dr Chong’s medical report of 6 April 2017 noted as follows:26Foot Note 26×Bundle of Affidavits at p 243. There were two large scars from the frontal area to the back on each side of the scalp. 33 These were probably the result of the 2 craniectiomies performed on him (see also the photographs exhibited by the Plaintiff).27Foot Note 27×Bundle of Affidavits at pp 30 and 31.The facial abrasions were also recorded by Dr Yang in his report of 22 May 2015 as well as Dr Thangaraj Munusamy in the latter’s report of 29 August 2014. 34 Accordingly, I award the Plaintiff $3,000 for facial abrasions and $8,000 for the two large scars. Loss of Future Earnings (“LFE”) and Loss of Earning Capacity (“LEC”) 35 The Plaintiff claims Loss of Future Earnings (“LFE”) in an amount between $730,080 and $1,262,430.28Foot Note 28×Plaintiff’s Written Submissions at paras 116–118.The Defendant contends on the other hand, that the Plaintiff should only be awarded damages for Loss of Earning Capacity (“LEC”) and that such damages should be in the region of $75,000.29Foot Note 29×1st Defendant’s Written Submissions at para 28. 36 In support of his submissions, the Defendant’s counsel citesTeo Sing Keng v Sim BanKiat[1994] 1 SLR(R) 340 at [40] (“Teo Sing Keng”) where Goh Joon Seng J on behalf of the CA opined that an award for LEC, as opposed to one for LFE, should be made “where there is no available evidence of the plaintiff’s earnings to enable the court to properly calculate future earnings, for example, young children who have no earnings on which to base an assessment for [LFE]”.30Foot Note 30×The 1st Defendant’s Bundle of Authorites Tab-J at para 40. 37 However in the later case ofKohChai Kwang v Teo Ai Ling (by her next friend, Chua Wee Bee)[2011] 3 SLR 610 the CA referred toTeo Sing Kengand, after quoting the above statement, went on to explain as follows at [38]:31Foot Note 31×The 1st Defendant’s Bundle of Authorities Tab B. … But there is nothing in principle which precludes the award of LFE to an injured party who has yet to embark on a career provided that there are sufficient objective facts or evidence to enable the court to reasonably make the assessment. It does not necessarily follow that just because an injured party was still studying at the time the injury was sustained it would not be possible to award him damages based on LFE. 38 The CA went on to say at [44] : … [A] plaintiff is typically awarded LEC where he or she continues to be in employment and suffers no immediate loss of income, but would suffer a disadvantage on account of the injury sustained if he or she should lose that current job and have to look for a new job in the open market. As a young child or a student would not have entered the employment market, there can be no immediate loss of income; but to make afinalaward of only LEC on account of the fact that the young child or student has not yet suffered any loss of income is to apply a principle to a set of circumstances to which that principle was never intended to apply. One must not lose sight of the rationale of compensation for a tort committed, especially where the injuries caused to a young person are severe and the consequence to his or her future employability grim.  39 InLee Wei Kong,the CA again said at [30]:32Foot Note 32×The 1st Defendant’s Bundle of Authorities Tab C. In a case such as the present which concerns a young person who was still studying when he was injured and whose earning capacity has either been seriously curtailed or destroyed, the traditional manner of awarding LEC or LFE (as described at [29] above) poses a challenge as it is premised on the injured victim being already in employment at the time of the accident. However, the law is dynamic and has developed to meet the demands of justice in particular cases. The fact that the injured person is young and has not commenced work at the time of the accident should not be an impediment to the grant of an award for LFE. 40 The Defendant referred toTan Yu Min Winston(by his next friend Tan Cheng Tong) v Uni-Fruitveg Pte Ltd[2008] 4 SLR(R) 825 (“Tan Yu Min Winston”)33Foot Note 33×The 1st Defendant’s Bundle of Authorities Tab H.where the claimant was 13 years of age at the time of the road traffic accident which resulted in serious head injuries. He was awarded $100,000 in damages for LEC by Chan Seng Onn J. 41 The Defendant pointed out that the claimant inTan Yu Min Winstonhad been an average student before the accident and, post-accident, he remained an average student. He went on to study a course in Information Technology at Temasek Polytechnic and, at the time of assessment of damages, had managed to reach a slightly above average performance in his course.34Foot Note 34×1st Defendant’s Written Submissions at para 34. 42 The Defendant also referred toMuhamedIlyas Bin Mira Abdul Hamid v Kwek Khim Hui[2004] SGHC 12 (“MunhamedIlyas”).35Foot Note 35×The 1st Defendant’s Bundle of Authorities Tab E.The claimant, age 20 at the time of the road traffic accident, sustained serious head injuries. Subsequently, his residual disabilities caused him to lose his Economic Development Board scholarship to study electrical engineering and computer science at the University of California (Berkeley) when he was unable to complete his course in the usual 3 year period. He nevertheless continued in his studies albeit at a slower pace. There was no doubt that he would graduate. 43 The learned AR inMunhamedIlyasmade a finding of fact that the claimant had suffered a deterioration of memory as well as emotional trauma including symptoms of depression, but was unable to make a finding that the claimant had suffered any deterioration in his IQ. 44 As to the LFE, the AR had this to say at [37]:36Foot Note 36×The 1st Defendant’s Bundle of Authorities Tab E. Having read his affidavit and seen him in court, I was unable to agree with the underlying assumption behind the plaintiff’s claim for loss of future earnings – ie. that he would after graduating from Berkeley not be able to obtain a job or at most, would be able to obtain only a “menial job” (in the plaintiff’s words). It seemed to me that in view of his obvious intelligence and ability, he was in spite of the accident and its aftermath still likely to find gainful employment and in my view, was likely to be successful at whatever career he eventually chose. In the circumstances, I was unable to adopt Mr Lim’s submissions as to loss of future earnings. However, since I did find that there was some loss of memory function, I felt that in fairness the defendant has suffered some loss in terms of his future job prospects and I thus awarded him the sum of $100,000 as loss of earning capacity ... 45 InTeo Ai Ling(by her next friend Chua Wee Bee) v Koh Chai Kwang[2010] 2 SLR 1037 (“Teo Ai Ling”)37Foot Note 37×The 1st Defendant’s Bundle of Authorities Tab I.Steven Chong JC (as he then was) distinguished the above 2 cases ofTan Yu Min WinstonandMuhamedIlyasamongst others and observed at [53] that “in each of them, the students who were injured from the accident still managed not only to complete the course but also gained employment with comparable remuneration”. In his opinion, “[u]nder those circumstances, it was indeed understandable why loss of earning capacity was awarded in those cases. Since the [claimants] in those cases were still able to earn what they would otherwise have earned but for the accident, there could not have been any loss of future earnings”. 46 The present case is quite different. The Consultant Occupational Therapists at Ozworks Therapy Pte Ltd, Mr Sudev Sreedharan (“Mr Sreedharan”) and Miss Sharon Seah (“Ms Seah”) opined as follows:38Foot Note 38×Agreed Bundle of Documents on Quantum (Part 1) p 22. It is unlikely that he will be able to meet the requirements of a full-time diploma course as set out above due to his decreased recall ability, visuospatial skills, receptive and expressive language difficulties, slower processing of verbal instructions and decreased speed of completion of tasks. 47 Dr Yang of KTPH assessed his disabilities on account of the head injuries at 33%. As noted earlier, Dr Pillay assessed the disabilities at 55%. 48 Dr P. N. Chong, the Defendant’s expert was of the opinion that the Plaintiff’s injuries are in the domain of cognition and believed the Plaintiff’s complaints to be consistent with the injuries and genuine. 49 Herein lies the difference between the Plaintiff’s condition and those of the claimants inTan Yu Min Winston andMuhamed Ilyas. The Plaintiff will neither be able to obtain an engineering degree nor even a diploma from the BCA Academy. 50 It is therefore appropriate to award the Plaintiff LFE. What then should the multiplier and multiplicand be? The Plaintiff’s age is 28 at the time of assessment of damages. Given the retirement age of 65 years recently announced by the Prime Minister in his National Day Rally speech, the Plaintiff therefore should have a remaining working life of 37 years. The multiplier of 20 years proposed by the Plaintiff is therefore reasonable. 51 The Plaintiff’s mother gave evidence that but for the accident, the Plaintiff would have obtained an engineering degree from Australia with support from his parents. This was challenged by the Defendant who quoted the CA’s observation inLee Wei Kongthat the importance of family background should diminish if at the time of the accident, the claimant is older. This is because as the child grows older and attends school, his intellectual capacity will show in his school results. Thus his school results, rather than family background, would be a more reliable gauge to assess his potential.39Foot Note 39×1st Defendant’s Written Submissions at para 45.However, this is not to say that the family background is altogether irrelevant. 52 The Plaintiff was not strong in his studies. After his PSLE examinations he was posted to the Normal Academic Stream where he completed his “N” level and “O” Level Examinations securing 3 passes in the latter. Thereafter, he enrolled in ITE College East for 2 years and obtained a Higher National ITE Certificate in Electrical Engineering in March 2010. Following that, he performed full-time National Service in the Police force where he was ranked amongst the top 10% to 30% of his cohort. After completing full-time National Service, the Plaintiff assisted his father in the latter’s engineering services company. He had aspired eventually to follow in his father’s footsteps and obtain a degree in Electrical Engineering from Australia.40Foot Note 40×Bundle of Affidavits Tab 1 at paras 13–21. 53 The Plaintiff enrolled with the BCA Academy for a 3 year course leading to a diploma in Electrical Engineering and Clean Energy.41Foot Note 41×Bundle of Affidavits Tab 1 at para 22. 54 This was because he would not have qualified for admission to a polytechnic in Singapore. Unfortunately the accident occurred merely days after he enrolled. He was granted deferment in his studies until April 2014.42Foot Note 42×Bundle of Affidavits Tab 1 at para 17. 55 From April 2014 to October 2014, the Plaintiff completed Semester 1 of the 1st year of studies and passed only English 1 and Building Technology, failing the rest of the subjects. He withdrew from the BCA Academy as he was incapable, as a result of his severe head injuries, of completing the course.43Foot Note 43×Bundle of Affidavits Tab 1 at para 17. 56 In my opinion, the Plaintiff’s academic record does not support the contention that he would more likely than not have obtained an engineering degree from Australia. I share the Defendant’s doubt in this regard. 57 However, the Defendant goes on to question whether the Plaintiff would have obtained a diploma from the BCA even if the accident had not occurred. In my opinion, that is too pessimistic a view. It must be remembered that the diploma course at the BCA is less demanding than a similar course at a polytechnic in Singapore. Moreover, he could count on assistance from his father who is an engineer. I therefore accept that he would likely have obtained a diploma from the BCA if not for the accident. 58 Be that as it may, the difference between the starting medium monthly salary ($2,400) proposed by the Plaintiff on the basis that the Plaintiff would have obtained a BCA diploma in Engineering and that proposed by the 1st Defendant ($2,350) on the basis of a Higher Nitec (Engineering) diploma which the Plaintiff already has is only $50. 59 I shall adopt the starting monthly salary of $2,400 proposed by the Plaintiff. 60 Obviously the salary would not remain stagnant throughout the period of his working life. The Plaintiff therefore proposes an increase of $400 per month every 5 years. I will allow $200 instead. 61 The total future earnings that the Plaintiff could earn had he not been injured is worked out as follows:  S/nDescriptionFigures(i)$2,400 x 12 months x 5 years$144,000(ii)Plus $2,600 x 12 months x 5 years$156,000(iii)Plus $2,800 x 12 months x 5 years$168,000(iv)Plus $3,000 x 12 months x 5 years$180,000Sub-total$648,000(i)AddEmployer’s CPF Contribution at 17%$110,160Total$758,160(i)Lessestimated Income Tax at $200 per year (as proposed by 1st Defendant) subject to verification($4,000)Net future earnings$754,160 62 Next we need to take into account what the Plaintiff can reasonably be expected to earn in the 20 years in his impaired state to mitigate the loss of future earnings. 63 Mr Sreedharan and Ms Seah, Consultant Occupational Therapists of Ozworks Therapy Pte Ltd undertook a Functional Capacity Evaluation on the Plaintiff on 9 November 2016 and issued their report on 4 January 2017.44Foot Note 44×Plaintiff’s Core Bundle at pp 8–25. 64 Amongst the observations they made were the Plaintiff’s difficulties in the categories of language and visuospatial/executive performance. In the sentence repetition task he was hesitant and added extra words. In the visuospatial task, when asked to draw the face of a clock, he could only draw a circle without the numbers. 65 He showed signs of anxiety when asked to complete time-based activities (e.g. wiping sweating palms on his trousers and verbalizing feelings of anxiety). 66 With regard to Plaintiff’s job prospects, Mr Sreedharan and Ms Seah opined that due to his cognitive issues, he would be better able to meet the demands of jobs that did not require frontline interactions with clients, rapid processing of information and dynamic changes of job tasks. They also recommended that because of his seizures, the Plaintiff should not handle heavy machinery. Some examples of jobs suited to his condition were those of a postal service mail carrier, a cleaner/janitor or a clerk (data entry/file and copy). 67 The Defendant’s witness, Consultant Psychiatrist Dr Lionel Lim Chee Chong (“Dr Lim”) interviewed the Plaintiff on 1 November 2018. In his report dated 31 January 2019 he opinedinter aliaas follows:45Foot Note 45×The 1st Defendant’s Core Bundle of Documents pp 36 and 37, paras 59 to 63. (a) The Plaintiff suffers from Organic Brain Syndrome (or Neuro-Cognitive Disorder). (b) His Organic Brain Syndrome includes problems with memory, (he struggles with auditory information) changes in behaviour (he has angry outburst) and language difficulties (difficulties in verbal reasoning leading to difficulties in expressing his ideas in words). (c) There may be limitation in his employment choices. He is likely to struggle in employment where concepts and procedures are provided verbally. He may also encounter difficulties with his colleagues because of issues with anger control. 68 Although Dr Lim had opined that the Plaintiff is likely to do better in jobs that tap on his perceptual reasoning and motor skills and suggested that jobs such as warehousing, logistics and supply chain management might be suitable, in court his evidence was less convincing. 69 When asked whether he thought the Plaintiff could draw a clock face from memory, he answered that the Plaintiff should be able to do so. 70 It appeared he had forgotten Mr Sreedharan’s and Ms Seah’s report which was amongst the reports he listed as having read. Elaborating on auditory memory, Dr Lim told the court that when given verbal instructions, a person with a problem in auditory memory might only carry out part of the instructions and forget the rest.46Foot Note 46×Certified transcripts dated 21 March 2019 p 20 line 27 – p 21 line 7. 71 Counsel for Plaintiff asked Dr Lim what jobs would be available to the Plaintiff to tap on his perceptual reasoning and motor skills. It turned out that what Dr Lim had in mind was a job with the Plaintiff’s father for example, preparing inventory. To counsel’s question as to how the Plaintiff would be able to do that considering his problem with auditory memory, Dr Lim suggested that instead of five instructions at one go, the Plaintiff should be given one instruction at a time, with further instruction to be given only when he had completed the task. He accepted that in the real working world that would be difficult unless the Plaintiff had a charitable employer.47Foot Note 47×Certified transcripts dated 21 March 2019 pp 23–24. 72 The Plaintiff’s father gave evidence that he did not ask his son to assist him in any work that required climbing for fear of injury if he should have a fit while doing so. He had tried giving his son some data entry assignments but found that he made mistakes entering data into test reports. While he stopped short of saying the work was “unreliable”, he estimated that there might be 30% error or thereabout. 73 Upon further cross-examination with leave of the court, the father agreed that of approximately eight times that the Plaintiff did data entry work, there were many mistakes the first time but fewer in the eighth assignment. Nevertheless “there [is] still some mistake there”.48Foot Note 48×Certified transcripts dated 19 March 2019 p 92 line 7.Commenting on this, Mr Sreedharan opined as follows:49Foot Note 49×Certified transcripts dated 20 March 2019 p 8 line 11. I think it will be very difficult for him to hold on to a data entry job in that sense. 74 The Defendant submits that the Plaintiff could work as a stock clerk thereby drawing a median salary of $1,425. However, there is no evidence to support the suitability of this job. Counsel for Defendant did not explore this in his cross examination of Mr Sreedharan. Besides, in my view, there is serious doubt as to the suitability of the job. Stock levels of course change from time to time possibly with variable frequency and would require frontline interactions with others.  These are features which render the job unsuitable for the Plaintiff (see [66] above). 75 The 1st Defendant’s suggested median salary of $1,425 is found in an extract from the Median 25th and 75th Percentiles of Monthly Basic and Gross Wages of Common Occupations in Construction, June 2017.50Foot Note 50×Agreed Bundle of Documents on Quantum (Part 3) p 247. 76 Using the same table, the Plaintiff’s counsel submits that the appropriate job is that of a cleaner at a median gross salary of $1,100. 77 Unfortunately, no data outside of the Construction sector was adduced in evidence by either party. Nevertheless relying on the table provided, the job of an office or library attendant may also be suitable. If so, the appropriate salary should be $1,179. I shall adopt this figure, the job of a stock clerk in the construction sector, being in my view, too demanding. 78 I also need to take into account that the Plaintiff may not be able to hold down a job for long because of the possibility of an occasional outburst that he might have. It could also be that an employer may not be prepared to keep him if he makes mistakes often enough in his work. In  (I hope) the unlikely event that he suffers a seizure at work, that could also cost him his job. If he does lose a job, it may take some time before he could secure another. 79 Taking all the above into account I would allow a modest discount of 10% to the earnings he could earn going forward. For the same reasons, I do not think it is realistic to factor in any increments. 80 We thus arrive at the future earnings he could make in his impaired condition as follows:  DescriptionFigures$1,179 x 12 x 20 years$282,960Less10% discount($28,296)Sub-total$254,664PlusEmployer’s CPF Contribution at 17%$43,292Total$297,956 81 There is no need to take into account any income tax at this salary level. 82 The loss of future earnings is therefore the difference between this figure and the total of $754,160 which he could earn if he had not been injured. 83 This results in a loss of future earnings of $456,204. Future surgery, medical and transport expenses 84 The Plaintiff seeks $88,103.76 for his future medical and transport expenses and $50,000 for the cost of possible future surgery.51Foot Note 51×1st Defendant’s Written Submissions at para 58. 85 The Defendant submits that for failure to prove his claim, the Plaintiff should not be awarded any.52Foot Note 52×1st Defendant’s Written Submissions at para 57. 86 I understand that the likelihood is that the Plaintiff needs to continue taking medication for his epileptic fits for the rest of his life even though the frequency of such seizures reduced dramatically over the years from 2013 to 2018 so that he had only one in 2018. Dr Chong in his report of 6 April 2017 alluded to the possibility that such medication might not necessary in the future. 87 The Plaintiff in his affidavit-of-evidence-in-chief (“AEIC”) affirmed on 14 August 2018, stated that the medication would cost approximately $668.89 every six months. But he also affirmed that in 2015, the expenses were $1,093.34 and up to the date of his AEIC, the medical expenses incurred in 2018 were $1,244.90.53Foot Note 53×Bundle of Affidavits Tab 1 para 52. 88 For lack of clarity as to the annual cost of the anti-epilepsy medication, I will adopt the figure of $1,093.34. 89 Applying a multiplier of 25 years we arrive at a figure of $27,333.50. I also allow taxi fare (estimated at $30 per round trip) for 50 semi-annual visits to the hospital over the same 25 years. This yields $1,500. 90 As to the likelihood of future epileptic fits which require hospitalisation, I have very little to go on. Dr Pillay said it could not be ruled out but Dr Chong said it was unlikely. I make no award for this nor for costs of future surgery which I find to be more likely in the realm of conjecture. In order that such expenses are incurred, not only must the Plaintiff have a fit but must, as a result, fall and injure his head such as to require surgery. Future maid and nursing care 91 The Plaintiff claims $420,000 under this head of claim. The Plaintiff’s mother explained that her main concern was in regard to the Plaintiff’s seizures. She was of the view that someone had to be around to ensure that the Plaintiff was able to breathe when he was having a fit. She further stated that the Plaintiff needed someone to communicate with, someone who could cook for him and remind him to take his medication.54Foot Note 54×Bundle of Affidavits Tab 3, p 43. 92 Dr Pillay was of the opinion that it was fair that the Plaintiff’s family should employ a maid to look after the Plaintiff’s needs because he suffers epileptic fits. Especially when the parents are no longer around or become too old to look after him, it is important that there is a helper at hand if he suffers seizure at home.55Foot Note 55×Certified transcripts dated 20 March 2019 pp 54–55. 93 Dr Chong, on the other hand, disagreed that the Plaintiff would need a domestic helper. Dr Chong testified that he had many patients who travel overseas without having somebody to accompany them. The court asked Dr Chong what would happen if he was alone at home and had a fit. Dr Chong’s reply was that, with the exception of status epilepticus which was “very very rare”, he would wake up.56Foot Note 56×Certified transcripts dated 20 March 2019 p 40. 94 The court further asked whether a person might have a fit and fall in a position that inhibited breathing. Dr Chong said that it was unlikely that he would stop breathing because the automatic breathing mechanism is so strong that it is almost impossible to inhibit.57Foot Note 57×Certified transcripts dated 20 March 2019 pp 63 – 64. 95 Dr Lionel Lim opined that the Plaintiff does not require a full time helper. He took into account the fact that the Plaintiff had been able to take public transportation by himself and also that the Plaintiff was not exempted from reservist training but was capable of being deployed to perform other duties.58Foot Note 58×Certified transcripts dated 20 March 2019 p 81. 96 The evidence shows that the Plaintiff was able to go skate-boarding with his friends but not to participate in dangerous skate-boarding activities or stunts. He used the skate-board to keep up with his friends while filming them. He took public transport on his own. 97 He travelled to Japan in December 2018 in the company of a cousin who apparently had never seem the Plaintiff having a fit and would not know how to react if he did. 98 It appears he is able to carry out the activities of daily living. 99 In my view, it has not been proved on balance of probabilities that the Plaintiff would need a domestic helper on account of his condition brought about by the accident. 100 He is able to carry on the activities of daily living, to take public transportation to go skateboarding with friends (but not to perform stunts) and even to take videos while doing so. 101 I note that the frequency of epileptic fits has tapered off to just one episode in 2018. While Dr Pillay opined that it could recur in the future, Dr Chong was more optimistic that in future he might even be taken off the medication for his condition. In any event, in Dr Chong’s view, even if he were to suffer another seizure, there is little risk that he would come to harm. 102 In these circumstances, I would disallow the Plaintiff’s claim for future expenses of employing a domestic helper. Provision for additional insurance premium which plaintiff is likely to pay 103 There is evidence that there is an additional premium of $36.12 per month payable in respect of life insurance for the Plaintiff on account of his condition. The Defendant does not object to the quantum of the additional premium but submits that a multiplier of only 10 years should apply. I do not see why the same multiplier of 25 years should not apply here as was used in regard to other heads of claim earlier considered. Accordingly, I would allow a sum of $10,836.",
        "Special Damages": "Medical Expenses 104 The Plaintiff claims $81,461.91 while the 1st Defendant points out that the total of the invoices produced is actually $79,348.86. 105 Nevertheless, the Defendant contends that only $23,660.60 should be allowed under this head, his reason being that $55,688.26 of the medical expenses had been paid out to the Plaintiff by the Plaintiff’s insurer, NTUC Income and that the same company is the 1st Defendant’s insurer in respect of the Defendant’s motor vehicle insurance policy. 106 In my view, this contention is entirely devoid of merit. It is settled law that where a claimant had taken out accident insurance, the moneys received by him under the insurance policy are not to be taken into account when assessing the damages for the injury in respect of which he had been paid the insurance moneys. (See the Court of Appeal’s decision inThe “MARA”[2000] 3 SLR(R) 31 at [28] and this court’s application of same inNg Lay Peng v Gain City Engineering & Consultancy Pte Ltd[2018] SGHC 184 at [164] to [167]). 107 The mere happenstance that NTUC Income is also the insurer under the Defendant’s motor vehicle insurance policy does not make for any principled or cogent departure from settled law. 108 The Plaintiff’s figure of $81,461.91, being a counting error. I will allow the total medical expenses to be claimed at $79,348.86. Transport Expenses 109 There were 41 documented trips for the Plaintiff’s medical appointments. At $30 per round trip, the total transport expenses should be $1,230. The mother’s pre-trial loss of earnings 110In Lee Wei Kongat [53], the Court of Appeal declared as follows: It is well established that this head of damage is recoverable not because it is the mother’s loss but because it is the [claimant’s]loss, being the reasonable cost of meeting the need created by the tort … 111 InAODv AOE, Wei J held that to compute the reasonable costs of obtaining the care which the Plaintiff’s mother provided, the mother’s loss of earnings was the starting point. After determining the costs of care the Plaintiff was actually receiving, the Plaintiff had to demonstrate that it was reasonable for him to receive the particular mode of care he sought compensation for. 112 We have the evidence of the Plaintiff’s mother that after the Plaintiff’s operation on 18 April 2013, the family was told by Dr Yang that the Plaintiff had a 50-50 chance of survival which the doctor later reduced to 30-70.59Foot Note 59×Bundle of Affidavits dated 12 March 2019 p 33 para 3. 113 She also gave an account of what she and other family members did for the Plaintiff. 114 Paragraphs 3, 4, 5 of Plaintiff’s mother AEIC are as follows:60Foot Note 60×Bundle of Affidavit dated 12 March 2019 p33 paras 4 and 5. 3. After the operation on 18th April 2013, we were told by Dr Yang that my son had a 50/50 chance of survival. Later he said maybe his chance of survival was 30/70. We were advised to contact other family members and we did. We continued to pray for his survival. 4. The Plaintiff had another surgery on 19th April 2013. He was in ICU for about 10 days. He was unconscious most of the time until he was transferred to the general ward. Danial was unable to talk, his limbs were extremely weak. He did not seem to recognize us initially. While at KTPH for about 2 months, he was on drips daily. No food was allowed by mouth. He body weight dropped drastically. We took turns to be with him at the hospital. We motivated and encouraged him daily. We showed him pictures, video clips of him and his friends, etc. When he was able to move his limbs slowly and was still unable to talk, we write to him to communicate with him as we were not sure if he understood what we were saying. We used a portable whiteboard with markers and eraser. To our horror, when he scribbled some letters, we could not figure out what they were. To aid him further, we brought him magnetic alphabets and numbers. He had to re-learn alphabets and numbers and gradually was able to form words and can do simple calculations. 5. Through therapy, we were able to move the Plaintiff’s limbs more & gradually aided him to take baby steps before he was relocated to the TTSH Rehab Centre in Ang Mo Kio for rehabilitative care. 115 The Plaintiff was in the Rehabilitation Centre until 6 June 2013. He was readmitted to KTPH on 9 June 2013 for cranioplasty and was discharged on 13 June 2013. 116 On 8 November 2013 the Plaintiff had his first epilepsy attack. This was recounted in the mother’s AEIC at para 6 as follows:61Foot Note 61×Bundle of Affidavit dated 12 March 2019 p34 para 6. … On 8th November 2013, he had his first epilepsy attack in the morning. He fell at the staircase at home. We did not know it was epilepsy then. My husband and I had just completed our morning prayers when we heard a loud thud. We quickly rushed up and saw him at the mid-level staircase. We were shocked and quickly called for the ambulance as I recalled the surgeon informing us that a fall could be fatal for him. 117 The Plaintiff had 46 epileptic fits between 8 November 2013 and 3 June 2018 with greater frequency (35 episodes) in 2013 through 2015. In 2016 he had six seizures, four in 2017 and one in 2018. Although the frequency was seen to be tapering off, Dr Pillay opined that could still occur. 118 The mother explained that the doctors had advised that the Plaintiff should not injure his head again as that might lead to serious consequences. For that reason she took leave to care for the Plaintiff. 119 What is a reasonable period for the mother to have taken leave to care for the Plaintiff? 120 Firstly, for the period of about three months after the accident, his needs were such that it would be clearly unreasonable to expect the mother to have delegated the personal care of the Plaintiff to a third party caregiver. Nor do I consider it unreasonable that after his discharge from KTPH on 13 June 2013 the mother continued to care for him at home for a further period up to 31 December 2013. 121 Especially with the advent of the epileptic seizures on 8 November 2013, it is understandable why the mother stayed home to look after him. In this connection, Dr. Chong was of the view that, post-accident, two years would be a reasonable period for the mother to have stayed at home or to have an experienced caregiver to look after him. 122 I would allow full recovery of the mother’s loss of salary (inclusive of employers’ CPF contributions) of $11,588.37 per month from 18 April 2013 to 31 December 2013. This works out to be $97,728.59. In this connection I should state that although there is a certificate from the mother’s employer, the Singapore Prisons Service referring to a period of no pay leave from 1 August 2013 to 31 July 2017, counsel for the Plaintiff submitted without demur from the Defendant, that she had commenced no pay leave from the date of the accident (see para 56 of the Plaintiff’s written submissions). 123 For the remainder of the two year period recommended by Dr. Chong, I will adopt the figure of $1,000 a month proposed by the Defendant. This figure is also one of the alternatives submitted by the Plaintiff in para 56 of Plaintiff’s written submissions. This will result in a total of $113,728.59 ($97,728.59 + $ 16,000 ($1000 per month from January 2014 to April 2015)). Costs of Renovation and Refund of Examination fees 124 Special damages in respect of the costs incurred in renovating the Plaintiff’s home to cater to his needs have been agreed at $4,600. Likewise the refund of examination fees of $1,194.",
        "Conclusion": "125   Altogether the general damages allowed are $671,873.50 and the special damages allowed total $200,101.45. 126 I will hear the parties on interest, costs and disbursements.    Andrew AngSenior Judge Noor Lila Binte Abdul Hamid (A. Rohim Noor Lila LLP)Instructed counsel: Fazal Mohd b. Abdul Karim & Noraisan Hussin  (B. Rao K.S. Rajah) for the plaintiff;Tan Seng Chew Richard and Peh Siqi, Michelle (Tan Chin Hoe & Co) for the first defendant;Chan Chin Ling (Dentons Rodyk & Davidson LLP) for the third party."
    }
}