{
    "case_title": "Hou Chao (in his personal capacity and in his representative capacity on behalf of Yong Zhen Yuan Pte Ltd) vGu Xiaolan and others",
    "ncitation": "[2020] SGHC 194",
    "coram": "S Mohan JC",
    "sections": {
        "Introduction": "1 The present case arises from the decisions of the learned assistant registrar (“the AR”) in respect of Summons Nos 6251, 5936 and 6349 of 2019 (respectively, “SUM 6251”, “SUM 5936” and “SUM 6349”) (a) refusing leave for the plaintiff  to maintain a common law derivative action, (b) consequently, striking out specific portions of the plaintiff’s Writ of Summons (“WOS”) and Statement of Claim (Amendment No 1)  (“SOC”), and (c) refusing leave for the plaintiff to amend the third defendant’s name in the WOS and SOC. 2 Having heard the parties, I dismissed all of the plaintiff’s appeals against the AR’s decisions in Registrar’s Appeals Nos 83, 84 and 85 of 2020 (collectively, “the Registrar’s Appeals”). 3 As the plaintiff has appealed against my decisions in the Registrar’s Appeals, I now provide written grounds for my decisions.",
        "Background Facts": "",
        "The parties": "4 The third defendant, named in this action as Yong Zhen Yuan Pte Ltd (“the Company”), was incorporated in Singapore on 3 August 1995.1Foot Note 1×Gu Xiaolan’s 1st Affidavit (filed on 20.11.2019) (“Gu’s 1st Affidavit”) at para 8 and p 49.It has a total paid up capital of $300,000 at $1 per share,2Foot Note 2×Gu’s 1st Affidavit at para 10 and p 49.and is in the business of general wholesale trade and restaurant operation.3Foot Note 3×Hou Chao’s 1st Affidavit (filed on 9.10.2019) (“Hou’s 1st Affidavit”) at para 12.One of the Company’s suppliers is Shandong Qixia Shida Fruits Refrigeration Co Ltd (“Shida”).  Shida supplies China Fuji red apples to NTUC Fairprice Co-operative Limited (“NTUC”) and Kian Seng Fresh Produce Pte Ltd, and thereafter invoices the Company for the same.4Foot Note 4×Statement of Claim (Amendment No 1) (“SOC”) at para 15. 5 The plaintiff and first defendant are directors and minority shareholders of the Company. They each control 30,000 of its 300,000 shares. From August 1999 to December 2017, the plaintiff and first defendant respectively held 255,000 and 45,000 shares.5Foot Note 5×Hou Chao’s 3rd Affidavit (filed on 20.12.2019) (“Hou’s 3rd Affidavit) at para 7(a).They are currently undergoing divorce proceedings in China which were commenced by the first defendant in September 2019.6Foot Note 6×Gu’s 1st Affidavit at para 16.The first defendant has also commenced separate proceedings in China against the plaintiff and another individual (with whom the plaintiff is alleged to have had an affair and a child out of wedlock) for the return of spousal assets.7Foot Note 7×Gu’s 1st Affidavit at paras 16–17; Defendants’ Skeletal Submissions for the Registrar’s Appeals (filed on 04.06.2020) (“DS”) at paras 9–10. 6 The second defendant is the only child of the plaintiff and first defendant. She was made a director of the Company in November 20128Foot Note 8×Gu’s 1st Affidavit at p 60.and is currently its majority shareholder with 240,000 shares.9Foot Note 9×Gu’s 1st Affidavit at pp 51–52.The first defendant, second defendant and the Company will collectively be referred to as “the defendants”.",
        "Procedural history": "The main suit and the plaintiff’s pleaded case on the common law derivative action 7  On 8 October 2019, the plaintiff commenced Suit No 1009 of 2019 (“Suit 1009”) against the defendants. The claims in Suit 1009 were made by the plaintiff against the first and second defendants both in his personal capacity, and in his representative capacity on behalf of the Company by way of a common law derivative action against the first and second defendants.10Foot Note 10×SOC at para 9. 8 He alleged that the first defendant had acted fraudulently, and/or in breach of her fiduciary duties to the Company by:11Foot Note 11×SOC at header C, p 4. (a) Forging his signature to transfer 108,000 of his shares in the Company to herself and another 117,000 of his shares in the Company to the second defendant.12Foot Note 12×SOC at paras 19–20, 27–28; Hou’s 1st Affidavit at para 28.The first defendant then transferred 123,000 of her 153,000 shares to the second defendant, making the latter the Company’s majority shareholder.13Foot Note 13×SOC at paras 24–25; Hou’s 1st Affidavit at paras 28 and 34.For clarity, I should add that in a departure from his position before the AR, on appeal, the plaintiff no longer relied on this as a ground for any breach of fiduciary duties owed by the first and/or second defendant to the Company.14Foot Note 14×SOC at para 28; Notes of Arguments (11.06.2020) (“NOA”) at p 2, lines 4 to 28; Plaintiff’s Skeletal Submissions for the Registrar’s Appeals (filed on 04.06.2020) (“PS”) at para 3.3.3 (which refers to SOC at paras 33–36). (b) Withdrawing US$2.85m from the Company’s OCBC Bank corporate account without his knowledge and for unknown purposes via two separate withdrawals of US$2.45m on 23 May 2019 and US$400,000 on 15 July 2019.15Foot Note 15×SOC at paras 33–35; NOA at p 8, lines 5 to 12.While the SOC mentioned that the second defendant was also involved in the transfer,16Foot Note 16×SOC at para 36.Mr Ivan Ng (“Mr Ng”), the plaintiff’s counsel, confirmed during the hearing that this alleged breach pertained only to the first defendant.17Foot Note 17×NOA at p 2, lines 21 to 23. 9 The plaintiff also averred that the firstandsecond defendants had acted fraudulently and in breach of their fiduciary duties to the Company by refusing to pay Shida for the apples that the latter had shipped to Singapore from March 2018 to May 2019, causing the Company to incur a debt of US$1.57m.18Foot Note 18×SOC at paras 36, 38–40 and 42; Hou’s 1st Affidavit at paras 22–24.Shida thus looked to the plaintiff to satisfy the debt of US$1.57m.19Foot Note 19×SOC at para 40; Hou’s 1st Affidavit at paras 24–25. 10 Theonlyrelief sought by the plaintiff in the SOC that was relevant for the purposes of the common law derivative action was an order that the first and second defendants return the sum of US$2.85m to the Company.20Foot Note 20×SOC at p 13, para (b).This was also confirmed by Mr Ng during the hearing before me.21Foot Note 21×NOA at p 2, lines 27 to 28. The Mareva injunction against the first defendant 11 Prior to the service of any court papers on the defendants in Suit 1009, or otherwise giving them any notice thereof, on 9 October 2019, the plaintiff sought anex parteMareva injunction against the first defendantpersonallyto restrain her from transferring out “monies that are currently held inherUOB and OCBC bank accounts … in Singapore” [emphasis added].22Foot Note 22×See the Summons for Injunction filed in HC/SUM 5039/2019 on 09.10.2019 at para 1; PS at para 1.2.16. 12 The injunction was grantedexparteon 22 October 2019 by Senior Judge Andrew Ang in Summons No 5039 of 2019,23Foot Note 23×HC/ORC 7162/2019 at para 1; DS at para 12.but was subsequently set aside by Ang SJ at aninter parteshearing on 16 January 2020 upon the first defendants’ application in Summons No 5814 of 2019.24Foot Note 24×HC/ORC 520/2020 at para 1; PS at para 1.2.18; DS at para 14.",
        "The applications leading to the Registrar’s Appeals.": "",
        "The summonses before the AR": "13 On 27 November 2019, the defendants filed SUM 5936, under O 18 r 19(1) of the Rules of Court (Cap 322, R 5, 2014 Ed) (“Rules of Court”), to strike out parts of the WOS and SOC which related to the plaintiff bringing Suit 1009 in hisrepresentativecapacity on behalf of the Company.25Foot Note 25×Joint Bundle of Cause Papers (“JBCP”) at Tab 7. 14 In response, on 13 December 2019, the plaintiff filed SUM 6251 for leave to maintain a common law derivative action, in a representative capacity, to act on the Company’s behalf in Suit 1009.  The application was expressed to be made pursuant to O 14 r 12 of the Rules of Court.26Foot Note 26×JBCP at Tab 9. 15 On 19 December 2019, the plaintiff filed SUM 6349 for leave to amend and correct an error in the name of the Company in the WOS and SOC from “Yong Zhen Yuan” to “Yong Zeng Yuan”.27Foot Note 27×JBCP at Tab 11.",
        "The decision of the AR": "16 In a decision dated 25 March 2020 (“Decision”), the AR allowed the defendants’ striking out application in SUM 5936, and consequently, dismissed the plaintiff’s application in SUM 6251 for leave to maintain a common law derivative action.28Foot Note 28×JBCP at Tab 1 [the AR’s Decision]. 17 The AR found that the plaintiff failed to fully satisfy the necessary requirements for a common law derivative action because the SOC did not adequately recite the facts necessary to demonstrate that the action fell within the “fraud on minority” exception to the proper plaintiff rule (see below at [34]). First, the only discernible fraudulent conduct pleaded by the plaintiff pertained to the alleged forgery of his signature by the first defendant to transfer shares. The AR did not think that this was a claim that the Company could have pursued against the first and/or second defendant (at [9]). Second, while the AR noted the plaintiff’s averment that the first defendant’s withdrawal of US$2.85m from the Company’s OCBC account was a breach of fiduciary duties, the AR found that this averment not only failed to disclose any particulars as to the element of “fraud”, but also assumed the presence of “fraudulent conduct”, the very existence of which was incumbent on the Plaintiff to raise in the first place (at [10]–[11]). 18 At a further hearing on 2 April 2020, the AR dismissed the amendment application in SUM 6349 as both parties agreed that the amendment application was dependent on the results of SUM 5936 and SUM 6251.29Foot Note 29×JBCP at Tab 3 [Notes of Arguments (02.04.2020) at p 2, lines 22 to 23]. 19 The plaintiff appealed against all of the AR’s decisions. Registrar’s Appeal No 83 of 2020 was the plaintiff’s appeal against the AR’s refusal of leave for the plaintiff to maintain a common law derivative action. Registrar’s Appeal No 84 of 2020 was the plaintiff’s appeal against the AR’s decision to strike out parts of the WOS and SOC and Registrar’s Appeal No 85 of 2020 was his appeal against the AR’s dismissal of the application for leave to amend the Company’s name in the WOS and SOC.",
        "The main issue": "20 The main issue which arose for my consideration was whether the plaintiff had fulfilled the necessary procedural and substantive requirements for bringing a common law derivative action, such that leave should be granted for him to do so. 21 Connected to this main issue was the preliminary question of what, if any, was the effect of the plaintiff’s decision to bring acommon lawderivative action as opposed to seeking leave to bring astatutoryderivative action under s 216A of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”).",
        "The preliminary question": "22 Section 216A of the Companies Act was introduced in Singapore in 1993. Unlike the United Kingdom and Canada, the common law derivative action was not expressly abolished in Singapore with the introduction of s 216A of the Companies Act (see the Court of Appeal’s observations inPetroships Investment Pte Ltd v Wealthplus Pte Ltdand others and another matter[2016] 2 SLR 1022 (“Petroships”) at [67]). Whether an aggrieved individual may (in the case of an unlisted company) choose to commence a common law derivative action in place of the statutory derivative action and whether the latter may co-exist with, or has (instead) been abrogated by the former were questions expressly left open by the Court of Appeal (seePetroshipsat [70] andWoon’s Corporations Law(LexisNexis, 2019) (Issue 14) (“Woon’s Corporations Law”) at para 557). 23 That said, the Court of Appeal provided guidance as to how a court should deal with such an aggrieved individual in the interim (at [71]): What does appear clear, however, is that, as a matter of practicality, it does not seem efficient or effective for a party to initiate a common law derivative action when a statutory derivative action pursuant to s 216A is available.As Margaret Chew has perceptively observed (seeChewat p 324;cf Walter Woon on Company Lawat para 9.73): … However, it would be unusual for a complainant, for practical reasons, to ignore section 216A and to pursue the convoluted course of a common law derivative action, since section 216A provides, at the least, a clear, simplified and efficient procedure. Furthermore, in an application pursuant to section 216A, it is submitted that the onus does not lie on the complainant to show a ‘fraud on the minority’, in particular, wrongdoer control. Therefore, from the pragmatic point of view, it would seem to be in the interests of the complainant to pursue a statutory derivative action where he is a member of an unlisted company.Where a complainant chooses to forego the simplified statutory derivative action route, and opts (in the case of an unlisted company) to launch an application to pursue a derivative action by the common law route, the question then has to be with what motive the action is pursued.Where such a motive may be classified as one that is ulterior and the complainant is held not to be approaching the courts with ‘clean hands,’ should an alternative remedy be available (for instance, the statutory derivative action), it is conceivable that proceeding under the common law may be considered an abuse of process. [emphasis added in bold] 24 Mr Ng for the plaintiff did not take the position that the statutory derivative action was not available to the plaintiff to seek the return of the US$2.85m to the Company (ie,the only remedy sought in the SOC insofar as the derivative claim was concerned). Instead, Mr Ng contended that there was no abuse of process for the plaintiff to prefer the common law derivative action for three reasons: (a) First, the law allowed the plaintiff to choose his cause of action (seePetroshipsat [71]). He was thus not obligated to prefer a statutory derivative action.30Foot Note 30×PS at paras 3.1.3, 5.1.1(a). (b) Second, there was good reason for him to choose the common law derivative action, namely, that it would obviate the giving of notice under s 216A(3)(a) of the Companies Act. This was necessary because giving notice to the first and second defendants would stifle his application for the Mareva injunction against the first defendant, and also result in a real risk that the first defendant would dissipate her relevant assets prior to the hearing of the injunction application.31Foot Note 31×PS at para 3.1.4. (c) Third, the plaintiff averred that he did not think that giving notice to the first and second defendants was necessary as they hadde factocontrol of the Company and would, in any event, not have agreed to allow the Company to commence proceedings against themselves.32Foot Note 32×NOA at p 3, lines 8 to 9 referring to the Notes of Evidence before the AR (23.01.2020) at p 6, lines 11 to 27; Hou Chao’s 2nd Affidavit (filed on 12.12.2019) (“Hou’s 2nd Affidavit) at para 20. 25 The plaintiff added that the common law derivative action was brought in good faith to recover the loss caused to the Company, and that there was no “collateral motive” to “harass and oppress” the first defendant so that she would drop her claims in respect of spousal assets in the ongoing proceedings in China.33Foot Note 33×PS at paras 2.3.10, 3.3.8–3.3.10. 26 Counsel for the defendants, Ms Aw Wen Ni (“Ms Aw”), did not seek to argue that the common law derivative action had been abrogated and was content to accept that the position was still open. Instead, Ms Aw contended that the reasons given by the plaintiff for choosing the common law route were unconvincing, and the evidence demonstrated that the plaintiff had an ulterior motive. Ms Aw, therefore, called into question the plaintiff’s motives in opting to commence a common law derivative action against the first and second defendants.34Foot Note 34×NOA at p 7 line 28 to p 8 line 21. 27 On this preliminary question, I agreed with Ms Aw that that the plaintiff’s professed reasons were unconvincing, especially since a clear alternative remedy was available to him in the form of the statutory derivative action via s 216A of the Companies Act. 28 First, a simple assertion that the law allowed the plaintiff a choice as to which route to employ did not answer the more material question ofwhyhe chose to employ the common law route, which is at the heart of the inquiry referred to by the Court of Appeal inPetroships(see [23] above). 29 Second, as mentioned above at [11], the Mareva injunction sought by the plaintiff was against thepersonal assets of the first defendantand not of the Company. It was therefore irrelevant to the common law derivative action commenced by the plaintiff and the relief sought for the return to the Company of the moneys in the Company’s OCBC bank account. Even if I were to assume that giving notice to the defendants under the s 216A route would undermine the Mareva injunction application, the plaintiff could have applied to the court to dispense with the notice requirement under s 216A(4) of the Companies Act (seeFong Wai Lyn Carolyn v Airtrust (Singapore) Pte Ltd and another[2011] 3 SLR 980 at [13]). The plaintiff’s reply to this point was to simply reiterate that the law allowed him a choice as to the type of derivative action to launch and that the personal and derivative claims were “inextricably linked”.35Foot Note 35×NOA at p 3, lines 12 to 17.Alternatively, in my view, it was also open to the plaintiff to commenceseparateactions, distinguishing between his personal claims against the first and second defendants and the derivative claim made in his representative capacity.  The giving of notice under s 216A for the derivative claim would then not have alerted the first or second defendants to the plaintiff’s separate personal claims or to anyexparteMareva injunction application taken out by the plaintiff in connection with his personal claims. 30 Third, it is invariably the case that a minority shareholder who seeks to bring an action on behalf of the company against directors who have the support of majority shareholders (or who are themselves majority shareholders) will face opposition from the majority. Section 216A of the Companies Act applies in precisely such a situation, in providing a “clear, simplified and efficient procedure” as compared to the “convoluted course of a common law derivative action” (Petroships([22]supra) at [71]). The plaintiff’s argument (at [24(c)] was, therefore, somewhat circular and did not provide a satisfactory answer to the question posed. 31 I thus found it difficult to appreciate why the plaintiff had eschewed the statutory derivative action in favour of commencing a common law derivative action. 32 In addition to having no good reason for eschewing the more convenient alternative route of a statutory derivative action, it appeared to me that the plaintiff did have an ulterior motive for commencing a common law derivative action. However, having said that, I defer my analysis on this point as the facts relevant to motive were also relevant to the exercise of the court’s discretion whether to grant leave for the plaintiff to bring the common law derivative action.  I thus analyse these points in greater detail under the main issue (see below at [69] onwards). 33 In any event, I observe that the Court of Appeal inPetroshipsat [71] did not definitively state that a common law derivative action commenced by a plaintiff would invariably constitute an abuse of process (and hence be liable to be struck out) in circumstances where the plaintiff could also avail itself of an alternative remedy and had, therefore, seemingly brought the common law derivative action with ulterior motives. Ultimately, therefore, the Registrar’s Appeals hinged on the main issue, which I now turn to consider.",
        "The main issue: viability of the common law derivative action": "The legal requirements of a common law derivative action 34 It is an entrenched principle of company law that the proper plaintiff to sue in respect of alleged wrong done to a company is the company itself: this is famously known as the proper plaintiff rule inFoss v Harbottle(1843) 2 Hare 461 (“Foss v Harbottle”). 35 As observed inWoon’s Corporations Lawat para 658, such a rule breaks down completely when the wrongdoing defendants are in control of the company and are thereby in a position to prevent the company from bringing the suit. To get around this problem, the English courts developed a procedural mechanism to allow a minority shareholder to sue the defendants in a representative capacity: the common law derivative action. The minority shareholder commences an action in his own name but seeks to enforce the rights of the company. The shareholder can only claim remedies or reliefs that the company is entitled to. 36 In order to bring a claim under a common law derivative action, the plaintiff must fulfil the following procedural requirements (Abdul Rahim bin Aki v Krubong Industrial Park (Melaka) Sdn Bhdand others[1995] 3 MLJ 417 (“Abdul Rahim”) at 427, as cited inVenkatraman Kalyanaraman v Nithya Kalyani and others[2016] 4 SLR 1365 at [69]): (a) A minority shareholder must bring an action on behalf of himself and all the other shareholders of the company, excluding the majority wrongdoers. (b) The wrongdoers must be named as defendants. The company must be joined as a defendant so that it is bound by the result of the action. (c) The statement of claim must disclose that it is a derivative action, and recite the facts that make it so. 37 In addition to the procedural requirements, there are two substantive requirements that must also be satisfied before the court will consider granting leave to a minority shareholder to commence a derivative action on behalf of a company (Sinwa SS (HK) Co Ltdv Morten Innhaug[2010] 4 SLR 1 (“Sinwa”) at [20]). These are: (a) the company has a reasonable case against the defendant(s); and (b) the minority shareholder-plaintiff haslocus standito bring the common law derivative action in the name of the company. (a) Requirement (a) is fulfilled if the minority-shareholder plaintiff demonstrates that the company has, on aprima faciebasis, a reasonable or legitimate case against the defendant for which the company may recover damages or otherwise obtain relief (Sinwaat [22]). In this regard, the court will not undertake an extensive inquiry into the merits of the claim. It will however ascertain whether the case brought in the company’s name has a semblance of merit after having regard to the affidavits filed by both parties in support of their claims and the evidence presented before the court (Sinwaat [23]). In other words, or in striking out parlance, the leave application will be denied if it appears that the intended action is frivolous or vexatious or is bound to be unsuccessful (Sinwaat [24]). (b) Requirement (b) is fulfilled if the minority-shareholder plaintiff is able to show that he falls within the “fraud on the minority” exception to the proper plaintiff rule (Sinwaat [47]–[48]). 38 Even if all the substantive and procedural requirements are met, the court retains an overall discretion to decide whether to grant leave to commence a derivative action (Sinwaat [20]). Analysis and my decision 39 The defendants did not seriously dispute the plaintiff’s contention36Foot Note 36×PS at para 3.1.6.that the necessary procedural requirements had been met.37Foot Note 37×DS at para 20(b).Accordingly, I focused my attention on the substantive requirements and the exercise of discretion. (1) No reasonable cause of action 40 The plaintiff submitted that the Company had a reasonable cause of action against the first and second defendant, namely, for breach of their fiduciary duties towards it, and not fraudper se. As stated above at [8(b)] and [9], the breach(es) of fiduciary duties arose when:38Foot Note 38×NOA at p 2 lines 4 to 7; PS at paras 1.4.1(a)–(b), 3.3.3. (a) The first defendant made two “unauthorised, and unilateral, withdrawal[s] of the total sum of US$2,850,000.00 from the [Company’s] OCBC Account, leaving a balance sum of US$4,000.00” (as pleaded at paragraph 34 of the SOC). (b) The first and second defendants failed and/or refused to pay Shida for the apples that were shipped from China to Singapore (as pleaded at paragraph 36 of the SOC). 41 The plaintiff’s position was that the two were linked as the transfers could not have been made in good faith, or for proper purposes given that the Company was left with a paltry sum of US$4,000, which was insufficient to pay off its creditors (in particular, Shida).39Foot Note 39×NOA at p 2 lines 4 to 7; SOC at para 35. 42 The plaintiff also argued that he had properly pleaded sufficient facts to sustain the action on breach of fiduciary duties as he had pleaded the various losses suffered by the Company as a result of the first and second defendants’ breaches of fiduciary duties, namely: (a) the loss of the US$2.85m as the first and second defendants have refused to return the money to the Company; (b) the loss of the interest earned upon that sum; and (c) the commencement of legal proceedings by Shida against the Company in Suit No 49 of 2020 due to the Company’s failure to pay Shida.40Foot Note 40×PS at paras 3.3.6, 3.4.1. 43 In my view, the plaintiff failed to make out aprima faciecase that the Company had a legitimate or reasonable case against the first and second defendants. 44 First, I agreed with Ms Aw that the only relief pleaded and sought by the plaintiff (on behalf of the Company) which corresponded to the common law derivative action was an order for the return of the sum of US$2.85m to the Company.41Foot Note 41×SOC at p 13 para (b); DS at para 63.Mr Ng also acknowledged this (see [10] above). 45 The loss to the Company in respect of interest on that sum was not pleaded, stated in any of the affidavits or raised during the hearing before the AR.42Foot Note 42×NOA at p 2, lines 27 to 28 and p 7, lines 20 to 21 and 25 to 26.Quite apart from the unfairness occasioned by the belated nature of this new alleged “head of loss”, the absence of affidavit evidence meant that the claim for alleged loss of interest lacked any evidential basis. The absence of evidence, in turn, manifested itself in the speculative language used to describe this alleged loss in the plaintiff’s submissions. For example, the plaintiff claimed that it was a loss because “the [first] and/or [second defendants] did not aver or make any deposition that they will return the interest earned … since the transfer in May 2019.”43Foot Note 43×PS at para 2.3.5.Mere speculation in written submissions could not suffice to make out aprima faciecase against the first and second defendants. 46 The exact nature of the loss to the Company in respect of the failure to pay Shida was also not pleaded. Conceptually, I had difficulty understanding and accepting the argument that the commencement of legal proceedings by Shida against the Company constituted a “loss” to the Company, more so given Ms Aw’s confirmation that the Company was defending the suit brought by Shida.44Foot Note 44×NOA at p 6, lines 20 to 23.In any event, no relief in respect of this complaint was pleaded. 47 The plaintiff thus failed to plead the relevant losses and relief claimed in respect of two out of his three purported causes of action (on behalf of the Company) against the first and second defendants, as well as the material particulars. The only real relief sought by the plaintiff on the Company’s behalf was the return of the US$2.85m. 48 Second, I also agreed with the defendants that the Company did not have a reasonable case, on aprima faciebasis, even for the return of the US$2.85m. I was unable see how the transfer of the US$2.85m constituted a breach of the first and second defendants’ fiduciary duties to the Company or amounted to an abuse of their powers as directors of the Company.  I elaborate below. 49 The first defendant explained that the transfer was to the Company’s fully owned US subsidiary to earn interest as the Company’s OCBC account was non-interest bearing, as well as for the US subsidiary’s operating expenses. The plaintiff did not challenge the evidence that the money was indeed transferred to the Company’s US subsidiary.45Foot Note 45×PS at para 3.3.6(b). 50 The first defendant also refuted the plaintiff’s contention that the transfer was for improper purposes as the US subsidiary was dormant and had ceased business since July 2018.46Foot Note 46×Hou’s 3rd Affidavit at para 60.She provided documentary evidence to show that the US subsidiary was a going concern in May/June 2019 around the time when the transfers occurred in May and July 2019.47Foot Note 47×Gu Xiaolian’s 3rd Affidavit (filed on 10.01.2020) (“Gu’s 3rd Affidavit) at para 18, pp 19–20; NOA at p 7, lines 6 to 11.In or around May/June 2019, NTUC had informed the second defendant by email that the US subsidiary had been shortlisted as a potential supplier, and invited the US subsidiary to provide a quote for the supply to NTUC of seedless grapes from the USA. In an email reply dated 6 June 2019, the second defendant, on behalf of the US subsidiary, acknowledged that the US subsidiary would participate in the selection process.48Foot Note 48×Gu’s 3rd Affidavit at pp 19 - 20.The plaintiff sought to challenge the quality of the evidence adduced by the defendants and that they had not, for example, adduced evidence of the actual quote provided to NTUC or evidence that NTUC accepted the US subsidiary’s quote.49Foot Note 49×NOA at p 4, lines 11 to 17.In my view, the evidence adduced by the defendants was sufficient to demonstrate that the US subsidiary had not been dormant since July2018, contrary to the plaintiff’s assertion.  Otherwise, it would not make sense for NTUC to be requesting a quote from the US subsidiary in May/June2019, almost a year later. 51 Inherent in the plaintiff’s claim was a worry that the US$2.85m will not be returned to the Company. This concern, however, was in my view, wholly speculative. The first defendant had already deposed on affidavit, in the context of her application to set aside the Mareva injunction (see [12] above), that she would be willing to arrange for the transfer of the moneys from the US subsidiary back to the Company’s OCBC account.50Foot Note 50×Gu’s 1st Affidavit at para 28; DS at para 65.The plaintiff made much ado about the fact that the defendants refused his recent request for the sum to be returned to the Company (ie,after the hearing before the AR). With respect, there was no obligation on the part of the first and second defendants to oblige this request (made after this litigation was commenced). Nor is itprima facieevidence that the first and second defendants have benefitted from the sum and will never return it to the Company. 52 No other reason as to why the transfer of the US$2.85m would constitute a loss to the Company was pleaded by the plaintiff.  As mentioned at [41] above, the plaintiff’s complaint relating to the transfer was linked to his complaint regarding the failure of the Company to pay Shida. In essence, the plaintiff’s view was that the money should have been used to pay Shida, and this would then have obviated the need to defend the suit brought by Shida against the Company.51Foot Note 51×NOA at p 2, lines 9 to 25.This fortified my view that the plaintiff was unable to demonstrate, and did not plead, what the loss to the Company was, or for that matter, the gain to the first and second defendants flowing from the transfer of the US$2.85m. 53 I would add that I also struggled with the notion that the first and second defendants breached their fiduciary duties to the Company in causing the suit by Shidato be defended. Mr Ng submitted that the defence put up by the Company was unmeritorious.52Foot Note 52×NOA at p 2, lines 18 to 19.I could not agree. First, the merits of Shida’s claim or the Company’s defence to it were not before me. Second, and more fundamentally, I could not accept the contention that indefendingthe suit brought by Shida (as opposed to simply paying Shida’s claim), that gave rise to aprima faciecase of the first and second defendants breaching their fiduciary dutiesto the Company. 54 For completeness, I also considered the following reliefs sought by the plaintiff in the SOC even though the plaintiff did not rely on them for the common law derivative action: (a) A declaration that the transfer of the plaintiff’s shares to the first and second defendants is void, and an order for the transfer back to him of his 255,000 shares. (b) The return to the plaintiff of a sum of US$1,008,848.48 which the plaintiff claimed had been fraudulently transferred out of his OCBC account by the first defendant to her own account. (c) The return to the plaintiff of a sum of $591,249.96 said to be his share of monies jointly owned with the first defendant. 55 It was for good reason that the plaintiff did not seek to rely on these claimed losses to support the common law derivative action;noneof the above losses claimed was sufferedby the Company.Rather, they were the plaintiff’s own alleged personal losses and were in respect of hispersonalclaims against the first and/or second defendant. Taking each in reverse order, in respect of (c), the sum represented 50% of the sale proceeds of a condominium that was jointly owned by the plaintiff and first defendant in theirpersonal capacitiesand purchased during their marriage.53Foot Note 53×SOC at para 43 and p 13 para (d); Hou’s 1st Affidavit at paras 52–53.In respect of (b), the sum was transferred out of the plaintiff’spersonalOCBC account and was not part of the Company’s assets.54Foot Note 54×SOC at para 46 and p 13 para (c).In respect of (a), any transfer of shares, even if fraudulent, did not speak to any claim or relief that the Company could have pursued against the first and/or second defendant. A common law derivative action, properly so-called, is an action to enforce the Company’s rights, not those of the minority shareholder. Therefore, there was no sustainable cause of action in respect of these other pleaded reliefs in the context of a common law derivative action and Mr Ng, quite rightly, did not contend otherwise. 56 Having regard to the pleadings in the SOC and the available evidence before me, I was unpersuaded that the plaintiff had: (a) demonstrated a reasonable or legitimate case, on aprima faciebasis, for a claim by the Company against the first and second defendants; or (b) pleaded the requisite facts to maintain such a claim. In my judgment, the plaintiff failed to establish the first substantive requirement for leave to maintain a common law derivative action. (2) Nolocus standito maintain a derivative action 57 Even assuming that the Company had a reasonable or legitimate case against the first and second defendant in respect of the transfer of the US$2.85m (the sole relief claimed), the common law derivative action would still be liable to be struck out.  In my judgment, the plaintiff could not in any event establish the requisitelocus standito maintain a common law derivative action, that is,to demonstrate an arguable case that the “fraud on minority” exception applied. 58 As submitted by Ms Aw, the exception has two constituent elements: (a) “fraud”; and (b) “control”. As there was no dispute that the plaintiff had established the latter element of control,55Foot Note 55×DS at para 69.the parties focused their submissions on the element of “fraud”. 59 On this issue, the AR found (in respect of the transfer of the US$2.85m) that: 11 … this averment by the Plaintiff not only fails to disclose any particulars tending to demonstrate the constituent element of “fraud” for the purposes of establishing the “fraud on the minority” exception … but seeks to assume the very point that is incumbent on the Plaintiff to raise in the first place. While this Court appreciates that the legal meaning of “fraud” for the purposes of establishing the ‘fraud on the minority’ exception does not appear to have been settled under Singapore law … this does not mean that the Plaintiff is thereby free not to plead in the SOC any material fact which would satisfy the element of “fraud”. … 60 To the best of my understanding, the plaintiff’s response to this on appeal was as follows:56Foot Note 56×PS at paras 1.3.7–1.3.8. (a) First, the cause of action was for breach of fiduciary duties, not fraud. It was thus unnecessary “to plead the ‘constituent element’ of common law ‘fraud’ on the Company to establish fraud on minority”.57Foot Note 57×PS at paras 1.4.1(a), 3.2–3.2.3, 3.3–3.3.3. (b) Second, the notion of “fraud” in the context of the “fraud on minority” is much broader than that in common law fraud (citingTing Sing Ning (alias Malcolm Ding) v Ting Chek Swee (alias Ting Chik Sui)and others[2008] 1 SLR(R) 197 (“Ting Sing Ning”) at [13]).58Foot Note 58×PS at paras 1.4.1(c), 2.3.1–2.3.2.The plaintiff recognised that the definition of “fraud” is presently unsettled,59Foot Note 59×PS at para 2.3.1.but relied on Tan Cheng Han (gen ed),Walter Woon on Company Law(Sweet & Maxwell, revised 3rd Ed, 2009) (“Walter Woon on Company Law”) at para 9.44 to suggest that a “fraud on minority” would exist where the majority use their voting power in a manner that the law regards as illegitimate to cause some injury or loss to the Company or to the minority shareholder.60Foot Note 60×PS at para 2.3.3. (c) Third, there was fraud on the minority when the first and/or second defendant transferred the US$2.85m to the US subsidiary and refused to return it.61Foot Note 61×PS at para 2.3.4.This had been sufficiently pleaded. (d) Fourth, even if the sum was returned, the two defendants “had nonetheless benefitted” from the interest earned on the sum and this constituted “fraud” on the Company.62Foot Note 62×PS at paras 2.3.5–2.3.6. 61 Given my earlier finding that the Company did not have a reasonable cause of action against the first and second defendants, the resolution of the Registrar’s Appeals did not turn on the precise scope of “fraud”, as was the case inSinwa([37]supra). I thus did not have to decide on that issue and did not propose to do so. Even without doing so, I was not persuaded that the AR had erred. 62 First, the plaintiff’s first argument seemed to betray a confusion of concepts. The question of whether there was a reasonable cause of action is separate from the question of whether “fraud” in the context of fraud on minority had been pleaded (see above at [37]). 63 Second, even if it was sufficient to plead only the material facts relating to the transfer of US$2.85m, Mr Ng accepted that only thefirst defendantwas involved in the transfer.63Foot Note 63×NOA at p 2, lines 21 to 22.While he took pains to emphasise that the transfer was linked to the failure to pay Shida which constituted a breach of fiduciary duties on the part of both the first and second defendants, Mr Ng also confirmed that noseparaterelief was sought in relation to the failure to pay Shida.64Foot Note 64×NOA at p 2, lines 27 to 28.This meant that strictly speaking, the material facts in relation to thesecond defendant’spurported “fraud on minority” had not been pleaded. 64 Third, there was no suggestion that the AR was taking issue with the Plaintiff’s failure to plead the material facts in relation tocommon law fraud.On the contrary, it was apparent from the Decision that the AR had appropriately applied his mind to the unsettled notion of “fraud” in the context of the “fraud on minority” exception; this was explicitly stated in the Decision at [11]. 65 Fourth, even if I were to accept the broader notion of fraud as stated above at [60(b)] or the tentative view expressed by Ang J (as he then was) inSinwa(([37]supra) at [53])that “fraud” may be made out if “the defendant had,prima facie,prevented legal action from being taken out against [the relevant parties] in order to protect his own interests”, the plaintiff wouldstillbe unable to establish the requisite “fraud”.The plaintiff did not plead any conduct on the part of the first and second defendants that would constitute “fraud” under any of the two abovementioned broader definitions of “fraud”. The plaintiff based his case off the transfer of the US$2.85m to the Company’s US subsidiary. However, on the evidence available, this was, in and of itself, neither an illegitimate transaction which constituted a loss to the Company, nor a transaction which resulted in a personal benefit to the first and second defendants.65Foot Note 65×DS at paras 70–71.Further, the SOC did not containanypleading in respect of the plaintiff’s claim that the first and second defendants had benefitted personally from the interest earned on the sum. Such a claim was, as I have said, speculative (see above at [45]). The plaintiff had thus failed to plead the necessary particulars of “fraud” in respect of the claim for the transfer of the US$2.85m.  The essence of a derivative claim, shorn of its frills and even at its lowest, must still demonstrate some semblance of “abuse or misuse of power” or “fraud on a power” by the wrongdoer (Ting SingNing([60(b)]supra) at[13]).  In my view, the plaintiff had failed to meet even this threshold. 66 Fifth, I agreed with the defendants that the plaintiff’s case, at best, was that he had pleaded an alleged breach of fiduciary duties in respect of the transfer of the US$2.85m which in turn constituted “fraud”.66Foot Note 66×DS at para 70.In this regard, I agree withMCH International Pte Ltd and others v YG Group Pte Ltd and others[2017] SGHCR 8 at [38] that a mere allegation of breach of fiduciary duties in the pleadings does not automatically lead to an allegation of fraud. Such a broad notion of fraud would make a mockery of the proper plaintiff rule inFoss v Harbottleas well as the cogent policy reasons behind it (seeSinwa([37]supra) at [22]). It would potentially allow any disgruntled minority shareholder to commence and maintain a common law derivative action so long as the alleged wrongdoers had conducted themselves in a way that could then be couched in language (in a pleading), however obtuse, to resemble a breach of fiduciary duties. This would, in my view, open the door to abuse. 67 For these reasons, I concluded that the plaintiff had failed to establish the requisitelocus standifor leave to maintain a common law derivative action.  He had failed to plead the material facts demonstrating the constituent element of fraud, or that “fraud” existed in the first place. The second substantive requirement was accordingly also not met by the plaintiff. 68 For completeness, I would add that I had also considered the defendants’ submission that the plaintiff’s application for leave to maintain a common law derivative action in SUM 6251 was procedurally irregular as it was expressed to be taken out pursuant to O 14 r 12 of the Rules of Court.67Foot Note 67×DS at paras 25–28.The law is clear that the question oflocus standito bring a derivative action should be decided as a preliminary point. The application should normally be made under O 33 r 2 of the Rules of Court for trial of a preliminary issue, or determined as part of an O 18 r 19 striking out application (seeSinwaat [15] citingWalter Woon on Company Lawat paras 9.60–9.62 with approval). While I had my reservations about the propriety of the plaintiff bringing the leave application under O 14 r 12 of the Rules of Court, this procedural point was ultimately rendered academic.  It was unnecessary for me to decide on it given that the question oflocus standiwas raised in the course of the striking out application in SUM 5936.  Even if it had been a procedural irregularity, I would not have been inclined to exercise my discretion under O 2 r 1(2) of the Rules of Court to cure the irregularity. Given my decision that the plaintiff had failed to establish the requisitelocus standiwhich meant that his application for leave also failed, it would be pointless to cure any procedural irregularity in the application. (3) The plaintiff’s motives and the court’s discretion 69 Finally, I also considered if I should exercise my discretion to grant leaveassumingthe plaintiff had successfully met the procedural and substantive requirements. 70 As mentioned at [35], the common law derivative action is a procedural device invented by the courts to enable justice to be done when a company had been wronged by miscreant directors or shareholders. A minority member has no right to bring a derivative action; rather, it is a matter of grace (seeWoon’s Corporations Lawat para 503). Accordingly, in order to be considered worthy of that grace, the maxim “he who comes to equity must come with clean hands” applies to the aggrieved minority member. Thus, he who seeks to maintain a derivative action must do so in the best interests of the company and not for any ulterior purpose (seeSinwaat [69]).  To borrow the words of Ang J (as he then was) inSinwaat [70], the court will consider if the plaintiff has “laid all [his] cards on the table”. 71 This was not a case that warranted the exercise of my discretion as the plaintiff did not appear, in my view, to be acting in the best interests of the Company, but rather in pursuit of his own ulterior purposes. 72 The timeline of the relevant events leading up to Suit 1009 was telling. The transfer of the sum of US$2.85m occurred in May and July 2019. However, the plaintiff waited for close to four months before commencing Suit 1009 in October 2019. This was about a month after the first defendant had commenced divorce proceedings against the plaintiff in China and the further proceedings to recover spousal assets (see [5] above).68Foot Note 68×Gu’s 1st Affidavit at paras 16–17. 73 The plaintiff’s explanation for this was that he was kept in the dark about the transfers, and had sought the return of the money the moment he became aware of them.69Foot Note 69×NOA p 9, lines 24 to 25.Such a contention was at odds with the picture that the plaintiff had painted of himself in his affidavits. On his own account, he was an experienced managing director who had helmed the Company from 2011 to 2019,70Foot Note 70×Hou’s 1st Affidavit at para 17.and (singlehandedly) secured the success of the Company’s business.71Foot Note 71×Hou’s 3rd Affidavit at para 29.He described himself as a “hands-on, and operational, person who wishes to oversee all details to ensure that no part of the exportation goes wrong”.72Foot Note 72×Hou’s 1st Affidavit at para 17.It seemed incredible that such an involved and driven individual could have possibly been kept in the dark for even a month about not one, but two consecutive withdrawals from the Company’s OCBC account totalling 99.86% of the account balance such that only US$4,000 was left.  The plaintiff also did not explain in any of his affidavits precisely when he first became aware of the transfers. 74 The plaintiff’s bare assertion that there was no collateral purpose in bringing Suit 100973Foot Note 73×NOA at p 3, lines 19 to 20; PS at paras 2.3.10, 3.3.8–3.3.10 and 3.4.8.was insufficient to satisfy me that he had commenced the common law derivative action with “clean hands”. In Mr Ng’s submissions, the only evidence cited in support of the plaintiff’s good faith in bringing the common law derivative action was in paragraphs 49 and 50 of the plaintiff’s third affidavit filed on 20 December 2019.74Foot Note 74×PS at paras 2.3.10 and 3.3.8 – 3.3.10; Hou’s 3rd Affidavit at paras 49–50.However, those paragraphs do not in fact support the plaintiff’s position because they refer only to the plaintiff’s motive to “get back what rightfully belongs to [him]” but which were fraudulent transferred away, as opposed to what belonged to the Company. It was also expressly stated in this affidavit that the contents therein were only in reply to the first defendant’s application to set aside the Mareva injunction granted by Ang SJ.75Foot Note 75×Hou’s 3rd Affidavit at paras 3–5.Even though paragraphs in that affidavit did refer to the US$2.85m transfer, it seemed odd to me that the plaintiff should be referring to the Company’s assets as assets that rightfully belong tohim.  A similar statement appears later in the same affidavit where the plaintiff deposed that the real reason for the transfer by the first defendant of the US$2.85m from the Company’s OCBC Account was to deprivehimof the same.76Foot Note 76×Hou’s 3rd Affidavit at para. 62.These statements gave rise to further doubts in my mind as to whether the plaintiff was indeed acting in the interests of the Company, or whether he had an axe to grind. 75 Therefore, if necessary for my decision, I would have declined to exercise my discretion to grant leave for the plaintiff to maintain the common law derivative action in Suit 1009. (4) Conclusion 76 After having regard to the pleadings, the available evidence before me and the submissions of the parties, I concluded that the AR was correct in allowing the defendants’ striking out application in SUM 5936, and dismissing the plaintiff’s application in SUM 6251 for leave to maintain a common law derivative action. 77 I too was not persuaded that the plaintiff had demonstrated, even on aprima facie basis, a reasonable or legitimate case for a claim by the Company against the first and second defendants or that the requisite facts for such a claim had been pleaded. Nor was I satisfied that the plaintiff possessed the requisitelocus standito maintain the common law derivative action, or that he had commenced the derivative action with “clean hands”. 78 This being the case, I dismissed Registrar’s Appeal Nos 83 and 84 of 2020 with costs. 79 It was common ground between the parties that the success of Registrar’s Appeal No 85 of 2020 (which was the plaintiff’s appeal against the dismissal of his amendment application in SUM 6349) depended on whether Registrar’s Appeal Nos 83 and 84 of 2020 succeeded. As I dismissed Registrar’s Appeal Nos 83 and 84 of 2020, I also dismissed Registrar’s Appeal No 85 of 2020.     80 Costs of the Registrar’s Appeals were fixed by me in the round at $5,000, inclusive of disbursements, to be paid by the plaintiff to the first and second defendants. S MohanJudicial Commissioner Ng Khai Lee Ivan, Tay Hui Yuan Denise (Infinitus Law Corporation) for the plaintiff; Aw Wen Ni, Ho Wei Jie Vincent (WongPartnership LLP) for the first, second and third defendants.",
        "": ""
    }
}