{
    "case_title": "Management Corporation Strata Title Plan No 0827vAikyu Trading Co (Pte) Ltd",
    "ncitation": "[2020] SGHC 217",
    "coram": "Andre Maniam JC",
    "sections": {
        "Introduction": "1 Where a management corporation (“MC”) represents subsidiary proprietors (“SPs”) in reaching a settlement with the Collector of Land Revenue (the “Collector”) on the amount of compensation for the compulsory acquisition of some common property, can the MC then withhold from those SPs: (a) the terms of settlement;(b) the settlement sum; and(c) the amount of expenses to be deducted (including legal and other professional fees and costs)? 2 In the present case, I decided that the plaintiff (the “SP”, or the “plaintiff SP”) was entitled to an order that the defendant MC provide him with the settlement agreement (which was in the form of a letter addressed to him and other SPs) and related documents (collectively, the “Settlement Documents”). 3 I upheld the first instance decision of the learned District Judge (the “DJ”) that the Settlement Documents came within s 47 of the Building Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (the “BMSMA”), and that there was no good reason why the court should not make an order for production in favour of the SP. 4 I also held that the SP was entitled to the Settlement Documents on an agency analysis (although this had not found favour with the DJ). 5 I set out my grounds of decision, bearing in mind that the DJ had granted leave to appeal because the ambit of s 47(1) BMSMA had yet to be considered by the High Court.",
        "Procedural history": "6Section 47(1) BMSMA allows SPs (amongst others) to obtain information and documents from an MC, including “any other record or document in the custody or under the control of the management corporation” in s 47(1)(b)(viii). 7The MC contended that this was limited to documents obtained in the exercise or performance of a power, duty or function conferred or imposedby theBMSMA itself(and specifically in the course of the MC’s regulation and management of the strata development). Specifically, the MC argued that an SP had no right to documents that the MC had obtained whilst representing the SPs (or some of them) pursuant to a resolution of the SPs, in respect of compulsory acquisition of common property. 8The MC’s position was that s 47(1) BMSMA did not apply because: (a) what the MC had done in representing the SPs, did not pertain to regulation and management of the strata development; and (b) the MC had obtained the documents because of theresolutionandnottheBMSMAitself. 9 The plaintiff SP applied1Foot Note 1×By way of DC/OSS 39/2019.for the Settlement Documents on three grounds: s 47(1) BMSMA; agency; and contract. The DJ allowed the SP’s application on the ground of s 47(1) BMSMA, but not the other grounds. The DJ granted leave to appeal. 10 I dismissed the MC’s appeal, agreeing with the DJ that the Settlement Documents came within s 47(1) BMSMA, and that there was no good reason why the court should not make an order for production in favour of the SP. I also held that agency was another ground justifying production of the documents to the SP.",
        "Factual background": "11 On 9 December 2011, part of the common property of the subject building was gazetted for compulsory acquisition, with a statutory award of compensation to be made by the Collector pursuant to s 10 of the Land Acquisition Act (Cap 152, 1985 Rev Ed) (the “Land Acquisition Act”). 12 At an extra-ordinary general meeting of the MC on 4 May 2012, it was unanimously resolved as follows:2Foot Note 2×Parry Yeo’s affidavit dated 17 April 2019, pages 94–95. … that the [MC] be authorized and empowered to take and handle the land acquisition proceedings on behalf of all the subsidiary proprietors as it thinks fit, including but not limited to the following :- a. appoint solicitors, surveyors and / or any other consultants deemed necessary to advise the MC and / or to represent the MC at the Collector’s Inquiry and / or any appeal to Land Acquisition Board and / or to Court of Appeal accordingly, as it thinks fit ; b. determine as it thinks fit the subsidiary proprietors’ interest in the land to be acquired and / or the amount to be claimed as compensation for the said interests and /or the basis or mode of the valuation for the compensation to be claimed and / or to raise objections, if any, to the Collector and / or at any appeal to the Land Acquisition Board or the Court of Appeal; c. do all things necessary to make the said claim for compensation and / or raise any objections at the [Collector’s] Inquiry and / or at any appeal to the Land Acquisition Board or the Court of Appeal as it thinks fit, including but not limited to making appropriate representations or submissions, calling appropriate witnesses to give evidence, engaging appropriate experts to give opinions and engaging solicitors to represent the MC; d. decide and as it thinks fit to accept any offer from the Collector and / or to make any offer to the Collector on the amount of compensation, including interest and / or cost; e. decide whether to appeal to the Land Acquisition Board on the Collector’s award and to the Court of Appeal on the Land Acquisition Board’s decision as it thinks fit, and if so, to conduct the same as it thinks fit provided that the MC shall only make an appeal to the Land Acquisition Board if the Collector’s award is 25% or more below the compensation claimed. 13 This was recorded in the minutes of the meeting as a “90% resolution”, a term that is defined in s 2(5) BMSMA. 14 The Collector made an award of $210,000, and then a supplementary award of $65,000, totaling $275,000 in compensation. There was some dissatisfaction with the amount of compensation, and the MC lodged a petition of appeal on 26 May 2014 with the Land Acquisition Appeals Board. Some 32 SPs later declined to participate in the appeal, and were paid their share of the compensation. The MC continued to represent the remaining 84 SPs (the “appealing SPs”) in the appeal and certain “without prejudice” discussions, which culminated in a settlement between the MC and the Collector (the “Settlement”). The terms of the Settlement were set out in a letter from the Collector dated 22 March 2018 (the “Settlement Letter”) that was addressed to the appealing SPs, including the plaintiff SP. The MC said that the Settlement entitled the appealing SPs to a significantly higher amount of compensation. 15 The MC said that the Settlement Letter contained in paragraph 2(c) “a strict confidentiality clause where the Defendant [MC] and the 84 SPs are obliged to keep the matters in the Appeal and the Settlement Letter strictly confidential, including the additional sum payable by the Collector (the “Settlement Sum”). Further, there is an obligation imposed on the Defendant not to cause or allow anyone to breach the terms of the Settlement Letter.”3Foot Note 3×Parry Yeo’s affidavit dated 17 April 2019, at para 25. 16 The MC said it was concerned about potential breach of the confidentiality obligations, and so the MC (and in particular its council) decided as follows:4Foot Note 4×Parry Yeo’s affidavit dated 17 April 2019, at para 29. (i) The Defendant shall not disclose the Settlement Sum received from the Collector to the SPs, who are entitled to additional compensation. (ii) The Defendant shall require each SP entitled to compensation to sign a Confidentiality & Settlement Agreement before receiving its share of the Settlement Sum after deduction of all costs and expenses. (iii) The costs and expenses incurred in the Appeal shall not be disclosed as there is genuine concern that the SPs could easily deduce the settlement sum received from the Collector once an SP is provided that SP’s allocation of the net settlement sum (based on share value) and the total costs and expenses incurred in relation to the Appeal. 17 82 of the 84 appealing SPs signed the Confidentiality & Settlement Agreement as required by the MC, leaving only the plaintiff SP, and another SP for which payment was not collected as that SP was in arrears. 18 As I mentioned above, the plaintiff SP applied to court for the MC to provide the Settlement Documents; the SP succeeded at first instance, and on appeal before me (see [9]–[10] above).",
        "The Settlement Documents came within s 47(1) BMSMA": "19 Section 47(1) BMSMA reads as follows: Supply of information, etc., by management corporations 47.—(1)  A management corporation shall, upon application made to it in writing in respect of a lot which is the subject of the subdivided building concerned by a subsidiary management corporation, or by a subsidiary proprietor or mortgagee or prospective purchaser or mortgagee of that lot or by a person authorised in writing by such a subsidiary proprietor or mortgagee and on payment of the prescribed fee, do any one or more of the following things as are required of it in the application: (a) inform the applicant of the name and address of the chairperson, secretary and treasurer of the management corporation and of any person who has been appointed under section 66 as managing agent; (b) make available for inspection by the applicant or his agent — (i) the strata roll; (ii) the notices and orders referred to in section 29(1)(g); iii) the plans, specifications, certificates, drawings and other documents delivered under section 26(4); (iv) the minutes of general meetings of the management corporation and of the council; (v) the books of account of the management corporation; (vi) a copy of the statement of accounts of the management corporation last prepared by the management corporation in accordance with section 38(10); (vii) any notice under section 3, 8 or 16 of the Land Acquisition Act, or any copy of an award under section 10 of that Act, received by the management corporation for any non-lot acquisition relating to the strata title plan for which the management corporation is constituted; and (viii) any other record or document in the custody or under the control of the management corporation, at such time and place as may be agreed upon by the applicant or his agent and the management corporation and, failing agreement, at the subdivided building at a time and on a date fixed by the management corporation under subsection (2); … 20 The MC argued that the apparent width of the phrase “any other record or document” in s 47(1)(b)(viii) BMSMA should be cut down, such that it would only include documents coming into the custody or control of the MC pursuant to a power, duty or function conferred or imposed bythe BMSMAitself, and in particularin the course of the MC’s regulation and management of the strata development. The MC argued that if it should obtain any documents by acting pursuant to aresolutionpassed under the BMSMA torepresentSPs in seeking compensation for acquisition of common property(such as the Settlement Documents in the present case), those documents did not fall within s 47(1) BMSMA. 21 The DJ rejected that argument, and so did I.",
        "No limitation of the sort contended for by the MC appears on the face of s 47(1) BMSMA": "22 The wording of s 47(1) BMSMA does not bear out the limitation the MC contended for.",
        "An MC has powers, duties and functions under the by-laws, and not just under the BMSMA itself": "23 The MC sought to limit s 47(1) BMSMA with reference to the MC’s powers, duties and functions under the BMSMA itself, but the MC also has powers, duties and functions under the by-laws. That is stipulated in s 24(3) BMSMA: A management corporation constituted in respect of a strata title plan shall have the powers, duties and functions conferred or imposed on it by or under this Act,or by the by-lawsin respect of the parcel comprised in that strata title plan and, subject to this Act, shall have the control, management and administration of the common property comprised in that strata title plan. [emphasis added] 24 Section 29(2)(b) BMSMA states that a management corporation may “do all things reasonably necessary for the performance of its duties under this Partand for the enforcement of the by-laws” [emphasis added]. 25 Under s 101(1)(c) BMSMA, a Strata Titles Board may make orders with respect to “the exercise or performance of, or the failure to exercise or perform, a power, duty or function conferred or imposed by this Actor the by-lawsrelating to the subdivided building or limited common property, as the case may be” [emphasis added]. 26 No distinction is drawn in ss 24(3), 29(2)(b), or 101(1)(c) BMSMA between what an MC does pursuant to the BMSMA itself, and what it does pursuant to the by-laws. Limiting s 47(1) BMSMA to what the MC does pursuant to the BMSMA itself, and not pursuant to the by-laws, would be inconsistent with these provisions.",
        "An MC also has powers, duties and functions that arise from resolutions": "27 By-laws may be prescribed by regulations or made by special resolution (see ss 32(1)–32(3) BMSMA), and s 32(8)(b)(ii) BMSMA provides that an MC shall, among other things, make the by-laws available for viewing at its office, on the application of a person who has an interest in so applying. No distinction is drawn there betweenprescribedby-laws, and by-lawsmade byan MC(which are the result of a special resolution). 28 This indicates that documents obtained by the MC pursuant to a resolution should not be excluded from the ambit of s 47(1) BMSMA. 29 In a similar vein, s 47(1)(b)(iv) BMSMA covers “the minutes of general meetings of the management corporation and of the council”. Those minutes would include copies of resolutions, such as the very resolution of 4 May 2012, which the MC relies on in this case. Those minutes cannot be excluded from s 47(1) BMSMA just because they pertain to a resolution, and do not merely relate to the BMSMA itself. 30 InTan Hee Chye v MCST Plan No 395[2016] SGSTB 1, andTimothy Siah Yang Tek v 28th Management Council to MCST 1420[2018] SGSTB 1, it was held that an audio recording of an annual general meeting was a “record or document” under s 47(1)(b)(viii) BMSMA. 31 Likewise, s 47(1)(b)(ii) BMSMA covers “the notices and orders referred to in section 29(1)(g)”. In turn, s 29(1)(g) BMSMA makes it a duty of an MC “to cause proper records to be kept of notices given to the management corporation under this Act or any other written law, or of any orders made by a court, a Board or other tribunal and served on the management corporation”. 32 Strata Titles Board orders thus fall within s 47(1) BMSMA even if those orders are in respect of by-laws rather than the BMSMA itself, and even if those by-laws are made by resolution rather than prescribed by regulations. 33 Further, s 29(1)(d) BMSMA includes among an MC’s duties, when so directed by a special resolution, the doing of various things for the purpose of improving or enhancing the common property. It would not make sense for s 47(1) BMSMA to only cover documents in relation to common property in its original state, and not documents in relation to the improvements or enhancements thereof. 34 In view of the above, excluding from s 47(1) BMSMA anything that arises from a resolution is illogical, and inconsistent with other provisions in the BMSMA.",
        "Section 47(1) BMSMA does not only cover documents relating to a particular lot, to the exclusion of documents relating to common property": "35 The MC’s argument that documents under s 47(1) BMSMA must relate to a particular lot in the building (by a reading of the phrase “in respect of a lot” in that section), and not common property, is clearly incorrect. Section 47(1)(b)(vii) BMSMA covers notices or awards for any non-lot acquisition, and “non-lot acquisition” is defined in s 2(1) BMSMA to mean “any acquisition under the Land Acquisition Act (Cap. 152) of any common property (and no other land) comprised in a strata title plan”. The phrase “application made to it in writing in respect of a lot which is the subject of the subdivided building concerned” in s 47(1) BMSMA does not mean that s 47(1) BMSMA has nothing to do with common property; it simply means, in relation to those who apply under s 47(1) BMSMA as SPs of lots in a building, that they must be SPs of lots inthatbuilding, and notanotherbuilding. This interpretation is also consistent with case law. 36 InManagement Corporation Strata TitlePlan No 4436[2018] SGPDPC 18, the Personal Data Protection Commission (the “PDPC”) rejected the contention that only security guards, the managing agent’s staff, or police could view closed-circuit television (“CCTV”) footage. An SP had been allowed by the MC to view the CCTV footage, in order to locate a missing cat. The footage was of the lift lobby, not of the SP’s own lot. The PDPC accepted that that footage, of common property, was a document under s 47(1)(b)(viii) BMSMA. 37 InYap Sing Lee vManagement Corporation Strata Title Plan No 1267[2011] 2 SLR 998 (“Yap Sing Lee”), the appellant SP had applied to inspect,inter alia,legal advice given to the MC by its lawyers on claims or potential claims against the appellant SPandagainst two other SPs who had carried out similar works to their units (see [3], [4] and [7(d) of the judgment]. The Strata Titles Board rejected the appellant SP’s application for that legal advice,noton the ground that the legal advice did not pertain only to the appellant’s own lot, but on the ground of legal advice privilege; and that was the ground on which the decision was upheld by the High Court.",
        "The resolution was one under the BMSMA": "38 It was common ground between the parties that the resolution was one under the BMSMA, and that in representing the SPs (or some of them)vis-à-visthe Collector, the MC was not acting outside its powers. The MC regarded the resolution as having been passed under s 29(2)(a) BMSMA which provides that an MC may “enter into an agreement, upon such terms and conditions (including terms for the payment of consideration) as may be agreed upon by the parties thereto, with a subsidiary proprietor or occupier of a lot for the provision of amenities or services by it to the lot or to the subsidiary proprietor or occupier thereof”. 39 In more general terms, s 24(2)(a) BMSMA provides that an MC may sue and be sued on any contract made by it. 40 I did not think that the reference to s 29(2) BMSMA helped the MC. To the contrary, s 29(3) BMSMA, which concerns situations involving limited common property, uses the phrase “perform the duties and exercise the powers referred to in subsections (1) and (2)”. What an MC does pursuant to s 29(2) BMSMA is described in s 29(3) BMSMA as its “powers” and “duties”, in the same breath as what it does pursuant to s 29(1) BMSMA; furthermore, s 29(1) BMSMA encompasses not only powers and duties arising from the BMSMA itself but also what may arise from a resolution (ss 29(1)(d) and 29(1)(g) BMSMA as discussed at [31]–[33] above). There is no good reason to limit s 47(1) BMSMA to powers and duties arising out of the BMSMA itself, to the exclusion of powers and duties arising out of by-laws, resolutions, or agreements under the BMSMA.",
        "Section 47(1) BMSMA is not limited to documents relating to the MC’s regulation and management of the strata development": "41 The MC argued that s 47(1) BMSMA is limited to documents obtained in the course of the MC’s regulation and management of the strata development, and not anything undertakenad hocsuch as representing SPs in seeking compensation for compulsory acquisition of common property. 42 The MC specifically cited s 24(3) BMSMA, which I have referred to above (at [23] and [26]), and also s 29(1)(a) BMSMA – that it shall be the duty of a management corporation, amongst other things,  “to control, manage and administer the common property for the benefit of all the subsidiary proprietors constituting the management corporation”. Sections 24(3) and 29(1)(a) BMSMA refer to the control, management and administration of the common property, but an MC’s powers, duties and functions are more extensive than that. For instance, they include (under s 47(1)(b)(vii) BMSMA) making available notices under ss 3, 8 or 16 of the Land Acquisition Act, or any copy of an award under s 10 of the Land Acquisition Act, received by an MC for any non-lot acquisition. The MC’s argument that such documents should not fall within s 47(1) BMSMA, either because they are not “in respect of a lot”, or because they do not relate to the regulation and management of the strata development (on the basis that what has been compulsorily acquired is no longer part of the development), cannot stand in light of the express language of s 47(1)(b)(vii) BMSMA.",
        "The provision of the Settlement Documents to an SP that the MC represented, does not open the door to outsiders obtaining the documents": "43 The MC argued that if the court were to find that the SP was entitled to the Settlement Documents, that would open the floodgates to other SPs (who were not appealing SPs), or even outsiders such as prospective purchasers, obtaining the Settlement Documents; that would in turn result in the MC breaching its confidentiality obligations under the Settlement Lettervis-à-visthe Collector. I did not accept this. 44 The plaintiff SP was one of the appealing SPs, and (as I explain below, from [49] onwards) I rejected the MC’s contentions that it could withhold the documents from the SP on the grounds of confidentiality. 45 I did not however decide thereby that: (a) confidentiality wasnota basis on which production of documents under s 47(1) BMSMA could be resisted; or (b) an application by anoutsiderto the Settlement would be treated the same as an application by an appealing SP. 46 InYap Sing Lee([37]supra), the court held that s 47(1) BMSMA, on its true construction, did not exclude or abrogate legal advice privilege (see [35]–[36] and [41]–[50] of the judgment). 47 Itis open to the court to likewise recognise confidentiality as a reason for not ordering production of documents unders 47(1) BMSMA, either because that section does not exclude or abrogate confidentiality, or pursuant to a discretion not to grant the mandatory order sought. Indeed, the MC itself contended that the court should have the same discretion that a Strata Titles Board has (so it was argued) under s 113 BMSMA,ie, whether to order an MC “to supply or make available the information or to make so available the record or document, as the case may require, to the applicant”. Section 113 BMSMA says the Strata Titles Board “may” make such an order. 48If an outsider to the Settlement had applied to me for an order that the MC provide him with a copy of the Settlement Letter, I would not have granted that. But that was not the case before me. The SP was not an outsider; he was one of the appealing SPs that the MC had representedvis-à-visthe Collector. With that, I turn to my reasons why the MC was not entitled to withhold the Settlement Documents from the SP.",
        "There was no good reason for withholding the Settlement Documents from the SP": "49 The irony in the present case is: the Settlement Letter was addressed to the appealing SPs. The Settlement Letter imposed certain confidentiality obligations on the appealing SPs, including the plaintiff SP, and was agreed to on their behalf by the MC. Confidentiality obligations were also imposed on the MC. 50The Collector would have expected the appealing SPs to receive documents and information about the Settlement – after all, the Collector had addressed the Settlement Letter to the appealing SPs, expecting them to observe the confidentiality obligations stated in it. 51 However, the MC considered itself entitled to withhold the Settlement Letter and related documents/information from the appealing SPs (although it appears that SPs on the council – or at least those involved in instructing the MC’s solicitors, and at a minimum, Mr Parry Yeo, the MC’s chairman – did have such documents/information). 52The MC contended that if the Settlement Documents were provided to the appealing SPs, they might proceed to breach their confidentiality obligations, and that might jeopardise not only those appealing SPs in breach, but also the MC itself. I did not agree that this allowed the MC to withhold the Settlement Documents from the appealing SPs.",
        "The Collector had imposed no obligation on the MC to keep the Settlement Documents from the appealing SPs": "53 As I stated above (at [50]), and as the DJ held, the Collector would have expected the MC to provide the Settlement Documents to the appealing SPs.",
        "A breach of confidence by one of the appealing SPs is not thereby a breach by the MC": "54 If the MC were suggesting that an SP’s breach would amount to a breach by the MC, thereby causing the MC to incur liability, that does not follow.",
        "The MC’s stated concern about identifying which SP might breach confidence was not a good reason for withholding the Settlement Documents": "55One of the MC’s stated concerns was that, if there were a breach of confidence, it might not be able to identify which appealing SP was responsible for the breach, and so that might put the MC itself in jeopardyvis-à-visthe Collector. 56If, however, the Collector wished to pursue a claim for breach of confidence, the Collector would need to be able to identify the offender; the Collector could not simply hold the MC liable for what an unidentifiable SP had done. 57Moreover, the current situation is that the plaintiff SP is the only one left who is seeking the Settlement Documents. 58Of the 84 appealing SPs: there is the plaintiff SP; one SP which is in arrears and has thus not collected its share of payment; and 82 other appealing SPs who have all agreed with the MC that they will not get the Settlement Documents (see [17] above). If there is a breach after the plaintiff SP obtains the documents, the only SPs who could have been responsible for that breach are the plaintiff SP, and the SPs on the council who already have the Settlement Documents. In that event, presumably the MC would identify the plaintiff SP as the one responsible for the breach. I did not consider the MC to be justified in withholding the Settlement Documents from any of the 84 appealing SPs, but now it should certainly provide those documents to the plaintiff SP.",
        "Withholding the Settlement Documents would deny the SP information that it ought to have": "59 The following example provided by counsel for the SP resonated with me. Consider the case of a lawyer who has been authorised by his client to pursue or settle a claim; the lawyer concludes a settlement and then tells the client that he will only make payment to the client (after deducting his legal fees) if the client agrees: (a) that he will not know the amount of the settlement; and(b) that he will not know the amount of the legal fees. 60 If the client agreed to those terms, he would never know if he had been paid the correct amount; nor would he know what the lawyer’s fees were (eg, were they too high, or might the client at least have grounds to seek taxation of those fees?). I do not think a client in that position would be obliged to agree to those terms. 61 This example is of course not a perfect analogy; the MC here did not provide professional services itself – it engaged lawyers and other professionals to do so. Also (and for the avoidance of doubt), I cast no aspersions on the MC here or the professionals involved: I do not know what the Settlement Sum is, what the terms are, or what the fees are. But this is precisely the point: the SP is similarly kept in the dark, and it is entitled to know.",
        "The resolution relied upon by the MC did not allow it to withhold the Settlement Documents": "62 I did not consider that the resolution relied upon by the MC allowed it to withhold the Settlement Documents from the plaintiff SP (or the other appealing SPs). The MC was authorised to claim compensation, conduct the appeal, and accept an offer from the Collector; but this did not allow it, when an agreement had been reached for additional compensation, to deprive the appealing SPs that it had represented in arriving at the Settlement of the Settlement Documents (without which the SPs would not really know what had happened). 63 The DJ reached the same conclusion (at [25]–[31], especially [29] of his oral grounds of decision). I noted that although the DJ considered the obligation of disclosure under s 47(1) BMSMA to be mandatory, the DJ also held that the facts of the case did not justify the MC withholding the documents (see the paragraphs of the DJ’s oral grounds cited above). 64 I also noted that the MC’s chairman, Mr Parry Yeo, had in an e-mail of 30 January 2019 stated that he believed “… it is technically incorrect to withhold the figures from the sps involved in the compensation package”.5Foot Note 5×Kwek Seow Kew’s affidavit dated 13 March 2019, page 35.I agree. 65  Mr Yeo however continued in his e-mail: “It was a decision by the council and it was taken with the best interest of all sps in mind.” 66 If this suggests tension between the interests of the appealing SPs on the one hand, and the interests of the MC (orallof the SPs) on the other hand, that was not a good reason for depriving the appealing SPs (who were the ones the MC represented in concluding the Settlement) of documents they were entitled to. 67 Whether “all sps” in Mr Yeo’s e-mail refers to all the SPs, or all theappealingSPs, I found – as did the DJ – that the MC did not have good reasons for withholding the Settlement Documents from the appealing SPs. 68 The Settlement Documents came within s 47(1) BMSMA; the plaintiff SP was entitled to them, and I was satisfied that the order made in his favour by the DJ was correct and should be upheld. That was enough to dismiss the appeal. However, I also agreed with the SP that even if the documents fell outside s 47(1) BMSMA, the DJ’s order could additionally be justified on an agency analysis.",
        "On an agency analysis, the SP was entitled to the Settlement Documents": "",
        "There was an agency relationship between the MC and the SP": "69 The MC was an agent of all the SPs in seeking additional compensation from the Collector (and was eventually an agent of the appealing SPs in concluding the Settlement with the Collector). 70 This is an obvious case of an agency relationship. Pursuant to a unanimous resolution, the MC acted on behalf of the appealing SPs in concluding the Settlement with the Collector on the terms of the Settlement Letter; the MC had the authority to conclude a binding agreement between those it represented and a third party (the Collector). The two core elements of an agency relationship, as endorsed by the Court of Appeal inAlwieHandoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 at [147], are present here, namely: (a) consent of both the principal and agent; and (b) authority conferred or power granted to the agent to legally bind the principal. 71InYap Sing Lee([37]supra), the court noted at [28]that “the MCST and the SPs could enter a consensual agency relationship, and the BMSMA clearly envisions that a MCST may sometimes act as agent for its SPs (eg, unders 86 BMSMA)”.",
        "The MC as agent was obliged to provide the Settlement Documents to the SP as principal": "72It is well established that agents have a duty to provide information to their principals, particularly regarding facts that are material to the agent’s duties to the principal. (SeeGrains and Industrial Products Trading Pte Ltd v Bank of India[2016] 3 SLR 1308 at [105] for the common law position on the duty of an agent to inform and provide information to his principal.) 73It goes against this to say that the MC could withhold from the appealing SPs that it represented: (a) information about the Settlement Sum it had agreed to on their behalf; (b) information about legal or other costs it had incurred on their behalf; (c) the Settlement Letter which was addressed to them and which the MC had agreed to on their behalf; and (d) information about the confidentiality obligations in the Settlement Letter, which they were required to observe and which the MC had agreed to on their behalf. 74 The points made in the preceding section as to why the MC could not rely on its alleged confidentiality concerns to withhold the Settlement Documents from the plaintiff SP under s 47(1) BMSMA apply equally to an agency analysis. 75 I parted company with the DJ on the agency issue in that the DJ considered that he did not have enough facts before him to conclude there was an agency relationship, and that this could not appropriately be done in proceedings commenced by way of an Originating Summons. I accepted the SP’s submission that all the necessary facts were already before the court; indeed, the MC did not point to any other facts that might only later emerge, or which required a trial. The MC did argue that a factual evaluation was necessary as to whether its decision to withhold the documents was justified, and particularly whether it could consider the interests of the MC (or of all the SPs), or of all the appealing SPs, in withholding the Settlement Documents from the plaintiff SP. I made that evaluation in reaching my conclusion that s 47(1) BMSMA applied, and that the MC was not justified on the alleged grounds of confidentiality to withhold the Settlement Documents from the plaintiff SP. 76 The MC also argued that I had no jurisdiction or power to uphold the DJ’s decision on an alternative ground, namely, agency. The MC accepted that if this were an appeal from the High Court to the Court of Appeal, the Court of Appeal could uphold a decision on grounds other than those relied upon by the judge at first instance. However, the MC argued that the position in this regard was different for appeals from the State Courts to the High Court. 77 Section 22 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (the “SCJA”) provides as follows: Powers of rehearing 22.—(1)  All appeals to the High Court in the exercise of its appellate civil jurisdiction shall be by way of rehearing. (2)  The High Court shall have the like powers and jurisdiction on the hearing of such appeals as the Court of Appeal has on the hearing of appeals from the High Court. 78 Section 22(2) SCJA is not subject to any restriction like that contended for by the MC. Indeed, such a restriction would not make sense: it would mean that the High Court would be obliged to overturn a decision if the grounds relied upon by the first instance court did not justify the decision, even though the High Court regarded the decision as a correct one that could be justified on other grounds. 79 The MC also contended that, in any event, I should not deal with the agency issue because the DJ had only granted leave to appeal in relation to the s 47(1) BMSMA issue; as for the agency issue, the DJ had decided that against the SP, and the SP had neither appealed nor sought leave to appeal on that. 80 I did not think it was open to the SP to appeal against the DJ’s order in so far as the order was in the SP’s favour: an appeal lies against the order made, not against the reasons given – seeSingapore Civil Procedure 2020, vol 1 (Chua Lee Ming gen ed) (Sweet & Maxwell, 10th ed, 2020) at para 57/1/7. The issue of the SP seeking leave to appeal on the agency issue thus did not arise.",
        "Conclusion": "81Having found for the SP on both the issues of s 47(1) BMSMA and agency, I dismissed the MC’s appeal with costs. Andre ManiamJudicial Commissioner Hewage Ushan Saminda Premaratne and Yvonne Mak Hui-Lin (Withers KhattarWong LLP) for the appellant; Chen Chongguang Daniel and Loh Kah Yunn (Lee & Lee) for the respondent."
    }
}