{
    "case_title": "BRZvBSA",
    "ncitation": "[2020] SGHCF 17",
    "coram": "Tan Puay Boon JC",
    "sections": {
        "Introduction": "1 Summons No 168 of 2019 (“SUM 168”) is the defendant’s application for further orders in respect of the Order of Court granted on 17 May 2018 by the High Court Family Division (HCF/ORC 205/2018, referred to as “the AM Order”), as varied by the Court of Appeal, relating to the ancillary matters (“AM”) in the divorce between the plaintiff and defendant (“the Wife” and “the Husband” respectively, and “the parties” collectively). In particular, the Husband sought orders for the Wife to pay him certain sums that he argued were owing under the AM Order. Having considered the submissions, I allow the Husband’s application in part.",
        "Facts": "2 I begin by setting out the facts pertaining to the dispute, starting with the divorce proceedings.",
        "The divorce and AM proceedings": "3 The Husband and Wife were married on 4 August 2010.1Foot Note 1×Minute Sheet 17 May 2018 at p 6.The Wife filed the writ for divorce on 23 July 2015. Interim Judgment was granted on 17 November 2015 (the “IJ date”). The AM were then considered by the High Court Family Division. One of the central disputes in the AM proceedings was whether a number of flats (and the sales proceeds of one flat which had been sold) should be included in the pool of matrimonial assets. As of the date of the AM, one of the flats was the matrimonial home and seven other flats had been purchased in the Wife’s name.2Foot Note 2×Minute Sheet 17 May 2018 at p 8.I refer to these eight flats as “the Flats” collectively, and individually as follows (listed in the order in which they appear in the AM Order): (a) Marina Flat 19; (b) Keppel Flat 3; (c) Alexandra Flat 7; (d) Marina Flat 8; (e) Keppel Flat 19; (f) Keppel Flat 127; (g) Keppel Flat 41; and (h) Marina Flat 17. 4 Judgment in the AM was given on 17 May 2018. The High Court decided to consider all of these as matrimonial assets for the purpose of division. Exercising its discretion, the High Court then ordered all the assets in the pool to be divided equally. The High Court treated the assets in two classes for this purpose – real and non-real – and the present case is concerned only with the pool of real properties constituted by the Flats. The AM Order read as follows: 1.  The matrimonial assets are to be divided equally between the [Wife] and the [Husband]. 2. Parties are to appoint a joint valuer within one month of the date of this order to value all the eight (8) flats, namely [Marina Flat 19], [Keppel Flat 3], [Alexandra Flat 7], [Marina Flat 8], [Keppel Flat 19], [Keppel Flat 127], [Keppel Flat 41], [Marina Flat 17] (hereinafter referred to as “flats”) as at the date of this order. The valuation of the flats is to be completed within two months of appointment of the valuer. The total net equity of the flats is to be divided equally between the [Wife] and the [Husband]. The net equity of each flat is to be determined by deducting from the value of each flat, the outstanding mortgage amounts as at 30 November 2015 (as stated inJSI 3 of 20 March 2018), the further mortgage instalments and/or redemption payments including interest payments made by the [Wife], that are to be reimbursed to the [Wife], and the costs and expenses of valuation. 3. The [Wife] is to pay the [Husband] 50% of the total net equity of the flats as follows:- i) One third of the sum within 4 months of the date of the valuation report; ii) One third of the sum within 6 months of the date of the valuation report; iii) The last one third of the sum within 8 months of the date of the valuation report. 4. If parties do not reach an agreement within one month of the valuation report for a distribution in specie of the flats with or without some payment of monies, the [Wife] shall pay the [Husband] the amounts in the preceding clause. 5. Should parties wish to consider a distribution in specie of one or more of the flats with or without some payment of monies in satisfaction of the whole or part of the [Husband’s] 50% share, parties are to take all necessary steps to effect the same. Should parties be unable to agree on the logistics, either party may file an application for this issue to be decided. In the event that parties agree on a distribution in specie of one or some of the flats to the [Husband] or the [Wife], the costs of the transfer (not including any capital gains tax) to the [Husband] are to be borne equally by parties. 6. The [Wife] is to transfer to the [Husband], the sum of $1,382,292 (being 50% of the non-real property assets in the matrimonial pool less the value of the [Husband’s] assets in his sole name) as follows: i) One third within 2 months of the date of this order; ii) One third within 3 months of the date of this order; and iii) The remaining one third within 4 months of the date of this order. 7. The monies in parties’ joint Standard Chartered Bank account no. [xxx] is to be paid to the [Wife]. 8. Save for the preceding orders on the division and distribution of assets, each party is to keep assets in his or her own name. 9. There be no order for maintenance for the [Wife]. 10. Liberty to apply. 11. The [Wife] is to pay the [Husband] costs of $25,000. [emphasis in original] 5 The Wife filed a Notice of Appeal against the whole of the High Court’s decision on 7 June 2018. The parties also entered into discussions and agreed to appoint Colliers International (Singapore) Pte Ltd (“Colliers”) as valuers on 5 July 2018,3Foot Note 3×Husband’s 1st Affidavit dated 26 June 2019 (“HA1”) at p 86.with a joint letter of instruction sent on 11 July 2018.4Foot Note 4×HA1 at p 90.However, the scope and purpose of Colliers’ appointment are disputed in this case, and I defer discussion of this issue to the appropriate juncture below (see [28] below).",
        "Sale of Alexandra Flat 7 and the stay": "6 Pending the hearing of the appeal against the High Court’s decision, the Wife decided to sell Alexandra Flat 7. The parties arrived at an agreement on the sale as well as other matters relating to the AM Order. An application was brought in HCF/SUM 389/2018 for the order to be entered. On 19 December 2018, HCF/ORC 418/2018 (“the Stay Order”) was granted by consent as follows: (1)(a) The [Wife] shall apply for, and procure the bank(s)’ approval for the removal of, the [Husband] as a co-borrower of the mortgage loans on the following properties, by 16 October 2018: (i) [Marina Flat 19]; (ii) [Keppel Flat 127]; (iii) [Keppel Flat 41]; and (iv) [Marina Flat 17]. (1)(b) The [Husband] shall remove the relevant caveat(s) on the abovementioned properties to allow the bank(s) to refinance the properties pursuant to [(1)(a)] above … … (1)(c) The [Wife] shall be at liberty to ask for the 3% paydown under the Debt Reduction Plan for the refinancing of the properties referred to in paragraph 1(a) above to be taken into account in the final accounting of the division of matrimonial assets in CA/CA 105/2018 (which is denied by the [Husband]). (2)(a)  The [Husband] agrees to the [Wife’s] sale of [Alexandra Flat 7] to [the Purchaser] at the price of $2,150,000 on condition that the [Wife] is to instruct the [Wife’s] solicitors to pay the [Husband], in (part) satisfaction of the [Husband’s] obligations under paragraph 6 of the AM Order, $926,000 of the cash sale proceeds from the sale of [Alexandra Flat 7] upon completion of the same. The remaining cash sale proceeds less the following items are to be transferred to Chia Wong LLP to hold as stakeholders pending the disposal of CA/CA 105/2018: i. Reasonable legal fees and reasonable agent commission to be agreed, such agreement not to be reasonably [sic] withheld; ii. Adjusted final outstanding management fees and property tax, on the assumption that the same have been duly paid by the [Wife] to date; and iii. payment of the outstanding loan on the property. (hereinafter referred to as the “Net Sale Proceeds”). The quantification of the Net Sale Proceeds shall be as determined in accordance with the various completion accounts issued by the Purchaser’s and the vendor’s conveyancing solicitors. … (2)(c) The execution of paragraphs 3 to 7 and 11 of the AM Order shall be stayed pending appeal and the $926,000 transferred to the [Husband], the 1% Option Money held by the [Wife], and the Net Sales Proceeds held by Chia Wong LLP shall be taken into account in the final accounting of the division of matrimonial assets in CA/CA 105/2018. … (3) Pending the hearing of CA/CA 105/2018, the [Wife] is to put up the remainder of the properties in her name for sale. Where the properties are sold, the net sale proceeds (to be determined in line with paragraph (2)(a) above) shall be held in equal portions by both the [Wife’s] and [Husband’s] solicitors pending the outcome of the hearing of CA/CA 105/2018. The value of the sale of the said properties (where relevant) shall be taken into account in the final accounting of the division of matrimonial assets in CA/CA 105/2018. … [emphasis in original] 7 Alexandra Flat 7 was sold in December 2018. The Wife paid the Husband S$926,000.00 in accordance with para (2)(a) of the Stay Order, and the remainder of S$384,406.25 was transferred to Chia Wong LLP (“CW”) to hold as stakeholders.5Foot Note 5×HA1 at para 9.I note that CW has since changed its name to Chia Wong Chambers LLC, so references to one should be treated as references to the other as well. 8 The Husband was also removed as co-borrower for the four flats identified at para (1)(a) of the Stay Order. The Wife claimed that the banks required her to redeem 3% of the value of those four flats (“the 3% redemption monies”), which she sought in the present proceedings to include in the amount that the Husband was liable to reimburse her for.",
        "The Wife’s appeal to the Court of Appeal": "9 The Wife’s appeal, CA/CA 105/2018 (“the Appeal”), was heard by the Court of Appeal on 5 April 2019. The Court of Appeal dismissed the appeal, save for a sum of US$166,000.00. In its order (CA/ORC 78/2019, “the Appeal Order”), that sum was deducted from the pool of matrimonial assets, on the basis that this sum was double-counted as a result of a clerical error.6Foot Note 6×HA1 at para 10.The Wife was ordered to pay S$40,000.00 in costs to the Husband. The remainder of the AM Order was left undisturbed. 10 Following the appeal, the Husband’s solicitors, CW, and the Wife’s then solicitors, Rajah & Tann LLP (“R&T”), corresponded concerning the execution of the AM Order.7Foot Note 7×HA1 at para 11.On 17 May 2019, the Wife began representing herself and correspondence was sent to her personally instead.8Foot Note 8×HA1 at para 13.I deal with the relevant correspondence at [37]–[40] below.-----",
        "Sale of Keppel Flat 127": "11 In May 2019, Keppel Flat 127 was also sold.9Foot Note 9×Husband’s 2nd Affidavit dated 17 September 2019 (“HA2”) at para 28.The Husband brought an application in HCF/SUM 167/2019 (“SUM 167”) asking that the net sale proceeds from Keppel Flat 127 be held by CW as stakeholders pending determination of the sums due to the Husband and the manner of payment. The order was granted in HCF/ORC 201/2019 (“ORC 201/2019”), with costs reserved to be dealt with together with SUM 168. This, however, has since been re-addressed in HCF/ORC 224/2019 (“ORC 224/2019”) (see [15(b)] below).",
        "Sale of Keppel Flat 19": "12 After SUM 168 was filed, a further application was brought in HCF/SUM 177/2020 dealing with the sale of Keppel Flat 19. The parties were in agreement and the consent order was granted in HCF/ORC 163/2020. The effect of the order is that the net sales proceeds of Keppel Flat 19 would be held by CW as stakeholders pending determination of SUM 168. Paragraph 4 of the order provides that, upon determination of SUM 168, CW shall be at liberty to release the proceeds to the Husband towards meeting the cash sum found to be due to the Husband in SUM 168, upon which any excess shall be released to the Wife. 13 The fact that these various properties had been sold is not directly relevant to the present proceedings, since the AM Order did not specify whether any of the properties ought to be sold. However, they form an important part of the context in which the present dispute arises.",
        "The application in SUM 168": "14 On 28 June 2019, the Husband filed SUM 168. The Husband sought the following reliefs in the summons: 1. Pursuant to paragraphs 6 and 11 of the Order of Court made by [the High Court] dated 17 May 2018 (HCF/ORC 205/2018 (hereinafter the “AM Order”) and paragraphs 2 and 4 of the Order of Court by the Court of Appeal dated 5 April 2019 (hereinafter the “CA Order”):- a. That the sum ofS$384,406.25presently held by M/s Chia Wong LLP (“Chia Wong”) as stakeholders pursuant to the Order of Court dated 19 December 2018 (HCF/ORC 418/2018) (the “Stay Order”) shall be released to the [Husband] forthwith; b. That the [Wife] shall immediately pay to the [Husband] the sum ofS$3,885.75; 2. Pursuant to paragraphs 2 and 3 of the AM Order:- a. That the [Wife] shall pay to the [Husband] the sum ofS$3,422,025.24as follows:- (i) S$1,140,576 on or before 5 August 2019; (ii) S$1,140,675 on or before 5 October 2019; and (iii) S$1,140,675 on or before 5 December 2019; 3. Further or in the alternative, the [Wife] shall pay the [Husband] such outstanding sums and in such a manner pursuant to the AM Order and the CA Order as this Court shall deem fit; 4. The [Wife] shall apply for, and procure the bank’s approval for the removal of the [Husband] as a co-borrower of the mortgage loan on the property at [Marina Flat 8]; 5. That the costs of this application be borne by the [Wife]; and 6. Such further and/or other orders as this Court shall deem fit. [emphasis in original] 15 Three orders that deal with particular aspects of the prayers above have already been granted by consent: (a) On 15 July 2019, prayer 1(a) above was granted in HCF/ORC 210/2019. (b) On 14 August 2019, a consent order was granted in ORC 224/2019 which dealt with the sales proceeds addressed in ORC 201/2019 (see [11] above), as follows: (1) That the sum of S$978,520.11 held by M/s Chia Wong Chambers LLC as stakeholders pursuant to the Order of Court dated 8 July 2019 (HCF/ORC 201/2019) shall be released to the [Husband] forthwith in part satisfaction of the sum that the [Wife] is to pay the [Husband] pursuant to paragraph 3(i) of the Order of Court dated 17 May 2018 (HCF/ORC 205/2018) (the “AM Order”). (2) That the [Wife’s] consent to paragraph (1) above is without prejudice to her position to argue that the sum due to the [Husband] pursuant to paragraph 3(i) of the AM Order is less than the sum of S$978,520.11, and/or that it is due at a later date. … (c) On 14 September 2020, a consent order was granted in HCF/ORC 230/2020 which dealt with the removal of the Husband as co-borrower of Marina Flat 8 sought in prayer 4, on the following terms: Subject to the approval of Standard Chartered Bank which the [Wife] shall apply for and procure, the [Wife] shall forthwith remove and do all acts necessary for the removal of the [Husband] as a co-borrower of the mortgage loan on [Marina Flat 8] pursuant to the divorce and ancillaries proceedings herein. 16 At the outset, I note that it was not clear what the legal basis of the Husband’s application was. It does not appear to me that the application was for enforcement of a court order in the sense of seeking any of the relief under r 690 of the Family Justice Rules (S 813/2014) (“FJR”). Neither was this a suit on the judgment debt that the Husband alleged had accrued under the AM Order. Rather, I understand the present proceedings to be primarily concerned with the interpretation of the AM Order, with the application being brought because the AM Order had granted the parties liberty to apply. As the courts have stated in a variety of contexts, such an order granting “liberty to apply” is “only intended to supplement the main orders in form and convenience so that the main orders may be carried out and may not be used to vary the order of the court”:Anwar Siraj and another v Teo Hee Lai Building Construction Pte Ltd[2014] 1 SLR 52 (“Anwar Siraj”) at [47], citingTan Yeow Khoonand another v Tan Yeow Tat and another[1999] 3 SLR(R) 717;Koh Ewe Chee v Koh Hua Leongand another[2002] 1 SLR(R) 943; andKamla Lal Hiranand v Lal Hiranand[2003] 3 SLR(R) 198 (see alsoSigrid Else Roger Marthe Wauters v Lieven Corneel Leo Raymond van den Brande[2013] SGHC 256 at [5] in the matrimonial context). Yet, some of the arguments put forward byboth sidesin this case appeared to go beyond the scope of the “liberty to apply” order. Both sides seemed to content to treat SUM 168 as the forum for dealing with a range of issues related to the AM Order, to the extent also of varying the terms of the AM Order. I deal with this issue below (see [23]–[25] below) in terms of the court’s powers in the present proceedings, in relation to the specific issues raised.",
        "Parties’ positions": "17 In respect of prayer 1(b), the Husband argued that the sum of S$3,885.75 claimed was simply the balance owed by the Wife in respect of the non-real assets in the pool of matrimonial assets after making various additions and deductions.10Foot Note 10×Husband’s Written Submissions dated 29 October 2019 (“HWS1”) at para 15.He recognised that the primary dispute in the case concerned prayer 2 of SUM 168. In that regard, the Husband argued that (a) the valuation undertaken by Colliers in 2018 (“the Colliers Valuation”) should be adopted;11Foot Note 11×HWS1 at paras 23–42.(b) in calculating the net equity of the Flats, there should only be a deduction of the “further mortgage instalments and/or redemption payments including interest payments” (I refer to these collectively as “Mortgage Payments”)  from the value of each of the Flats, and not an additional reimbursement given to the Wife;12Foot Note 12×HWS1 at paras 47–53.and (c) in calculating the net equity of the Flats, the Mortgage Payments included should only be those made until, at the latest, the date of valuation when the net equity can be calculated.13Foot Note 13×HWS1 at paras 54–58.The Husband also claimed in his affidavit that the 3% redemption monies should not be included in the Mortgage Payments.14Foot Note 14×HA1 at para 29(f).On this basis, he argued that the Wife should be made to pay him a total of S$3,422,025.24. As for the dates on which each third of that sum was owed, the Husband considered that the timelines ran from 5 April 2019,ie, the date of the Appeal Order.15Foot Note 15×HWS1 at para 60.The Husband also claimed interest on the outstanding sums due.16Foot Note 16×HWS1 at para 63. 18 The Wife did not put forward any arguments on the amount claimed under prayer 1(b). She focused her attentions on prayer 2 of SUM 168. Her first argument was that a valuer had not yet been appointed in accordance with the AM Order, and that the Colliers Valuation was not in conformity with the AM Order and should not be relied upon.17Foot Note 17×WWS1 at paras 5–8.Because no valuer had been appointed under the AM Order, the Wife’s obligation to pay the Husband for his share of the pool of matrimonial assets had not yet arisen.18Foot Note 18×WWS1 at para 12.As for how the net equity of the Flats was to be calculated, (a) the Wife was entitled to bereimbursedfor the Mortgage Payments by the Husband, which went beyond merely deducting the Mortgage Payments from the valuation;19Foot Note 19×WWS1 at para 85.(b) all Mortgage Payments made until the AM Order is fully executed should be included in the calculation;20Foot Note 20×WWS1 at para 67.and (c) the Husband is liable to reimburse her for the 3% redemption monies. She further raised the concern that the AM Order had not required the Husband to remove the caveats lodged against the Flats, and sought an order from the court for him to do so.21Foot Note 21×WWS1 at paras 21–24.",
        "Issues": "19 Given the parties’ respective positions, the following issues arise for my determination, dealing first with the most substantial dispute: (a) With regard to prayer 2, (i) Should the Colliers Valuation be accepted for the purposes of the AM Order or should a valuation should be called for in accordance with the said Order? (ii) How should the net equity of the Flats be calculated, specifically: (A) what does it mean for the Wife to be “reimbursed” for the Mortgage Payments; (B) what is the appropriate cut-off date for assessing the Mortgage Payments to be deducted and/or added to the valuation of the Flats; and (C) should the 3% redemption monies be included in the Mortgage Payments to be accounted for? (iii) On what terms should the Wife be made to pay to the Husband any outstanding sums due under the AM Order (dealing both with the timelines and the question of interest)? (b) With regard to prayer 1(b), what is the correct amount for the Wife to pay to the Husband for his share of the non-real properties in the pool of matrimonial assets?",
        "Decision": "",
        "Valuation and calculation of shares in the real property": "20 The most substantial dispute in this case concerns the Husband’s share in the Flats and the Wife’s obligation to pay him a sum to represent that share. The law on interpretation of court orders 21 As much of the dispute turns on the proper interpretation of the AM Order, I begin by setting out the principles that apply to the interpretation of court orders. The starting point should be the language of the order. An interpretation would necessarily consider the natural and ordinary meaning of the words and the manner in which they are used. Regard must also be had to the whole of the order. As far as possible, each part of the court order should be read consistently with every other part and with the intention of the court which granted the order:Hoban Steven Maurice Dixon and another v Scanlon Graeme John and others[2007] 2 SLR(R) 770 at [41]. It is common sense that the court, in making an order, would not have wished to have different parts of the order produce different results. Beyond that, the interpretation of the court order should strive for consistency with the prevailing principles. As the High Court considered inSujatha v Prahbakaran Nair[1988] 1 SLR(R) 631 (“Sujatha”) at [16]: … [W]here an order of court is capable of being construed to have effect in accordance with or contrary to established principles of law or practice, the proper approach, in the absence of manifest intention, is not to attribute to the judge an intention or a desire to act contrary to such principles or practice but rather in conformity with them. … 22 These are not controversial principles. Bearing them in mind, I turn to consider the issues raised in this case. The scope of the application 23 I have noted above that since it appears that the present application in SUM 168 was brought under the order granting “liberty to apply”, as a starting point, I could only consider matters that wouldsupplementthe main orders in the AM Order, and I could not vary the AM Order in any way:Anwar Siraj([16]supra) at [47]. In my view, however, the parties’ respective arguments came close to requiring such a variation – see, especially, the Husband’s argument that the Colliers Valuation should be used because of the parties’ conduct in obtaining and relying upon it, and the Wife’s argument that the timeline for payment of the Husband’s share should be varied. It is unfortunate that neither set of counsel had raised this issue before me, or clarified the scope of the court’s jurisdiction and power in SUM 168. In the present case, however, I am satisfied that my findings ultimately fall within the scope of the matters supplementary to the main AM Order. 24 In any event, to the extent that the findings exceed the scope of the “liberty to apply” clause and would have required a separate proceeding to be brought, I consider that to be a procedural irregularity that would not be fatal, and I proceed to consider the arguments raised by both parties in the interests of resolving their dispute. Rule 10 of the FJR (which reproduces in substance O 2 r 1 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”)) provides that non-compliance with the FJR shall be treated as an irregularity and shall not nullify the proceedings or any step taken in the proceedings. The court also has the power to cure the irregularity by making any order dealing with the proceedings as it thinks fit, under r 10(2) of the FJR. As summarised by the High Court inAnwar Sirajat [48] (commenting on the ROC): The court may make any order it deems fit to correct the irregularities and generally the courts have taken a liberal approach in exercising this discretion: seeSinwa SS (HK) Co Ltd v Morten Innhaug[2010] 4 SLR 1. However, the courts would refuse to grant such a remedy where: (a) the curative approach would result in prejudice; (b) where the nature of the error is so serious or fundamental that it cannot, in principle, be validated; (c) where the mandatory nature of the rule breached may be construed as excluding cure; (d) where the rule is sufficiently comprehensive to govern non-compliance; and (e) where the substantive application, if made, would have failed: see Jeffrey Pinsler,Principles of Civil Procedure(Academy Publishing, 2013) at para 01.040. 25 In my judgment, none of these conditions apply here. No prejudice has been caused to either party, as neither party has in fact raised any complaints about the procedure adopted in this case. Both parties have sought to go beyond the “liberty to apply” order in this application. In fact, given how the proceedings have unfolded, I am of the view that it would be unjust for either party to now suggest that the court does not have the power to consider the matter as presented. I also do not see any mandatory rule that would be breached if I consider the matter in these proceedings. It would be unhelpful and unnecessarily costly to require the parties to re-litigate the issue in a fresh set of proceedings, especially since the only parties involved are the Husband and the Wife. As such, especially when neither party has argued otherwise, I will proceed to determine the substance of the dispute between the parties, except insofar as I consider it would be inappropriate for me to do so. Should the Colliers Valuation be accepted for the purposes of the AM Order? 26 The material part of the AM Order concerning the appointment of the joint valuer reads as follows: Parties are to appoint a joint valuer within one month of the date of this order to value all the eight (8) flats, namely [Marina Flat 19], [Keppel Flat 3], [Alexandra Flat 7], [Marina Flat 8], [Keppel Flat 19], [Keppel Flat 127], [Keppel Flat 41], [Marina Flat 17] (hereinafter referred to as “flats”) as at the date of this order. The valuation of the flats is to be completed within two months of appointment of the valuer. 27 The appointment of a valuer and the obtaining of a valuation report were clearly critical steps in the execution of the AM Order. First, the valuation was needed to ascertain the net equity, which would then determine how much the Wife was to transfer to the Husband (see paras 2 and 3 of the AM Order). Second, the date of the valuation report would also serve as the start of the timeline which governedwhenthe Wife was to transfer the sum identified to the Husband (see para 3 of the AM Order), and also set the timeline within which the parties were to considerin speciedistribution (see para 4 of the AM Order). 28 In the present case, a valuer had been appointed. By way of a joint letter of instruction, dated 11 July 2018,22Foot Note 22×HA1 at p 90.Colliers was requested to “prepare valuation reports for the [Flats], withallof the reports to be senttogetherto both Parties’ counsel within 2 months of [their] appointment” [emphasis in original]. Colliers prepared a fee proposal dated 27 July 2018,23Foot Note 23×HA1 at p 92.which the parties accepted.  Valuation reports, all dated 3 September 2018, were prepared as follows for each of the Flats: S/NFlatDate of valuationMarket value(S$)1.Marina Flat 1924Foot Note 24×WA1 at p 30.6 August 20181,350,000.002.Keppel Flat 325Foot Note 25×WA1 at p 45.7 August 20182,160,000.003.Alexandra Flat 726Foot Note 26×WA1 at p 60.6 August 20181,950,000.004.Marina Flat 827Foot Note 27×WA1 at p 75.8 August 20183,300,000.005.Keppel Flat 1928Foot Note 28×WA1 at p 91.8 August 20181,540,000.006.Keppel Flat 12729Foot Note 29×WA1 at p 107.3 September 20181,530,000.007.Keppel Flat 4130Foot Note 30×WA1 at p 123.7 August 20181,720,000.008.Marina Flat 1731Foot Note 31×WA1 at p 139.6 August 20181,360,000.00 29  The Wife claimed, however, that the Colliers Valuation was not the valuation envisaged by the AM Order, and, therefore, it could not be used for either determining the net equity and the sum owed to the Husband or for determining the timelines for the AM Order, which ran from the date of the valuation reports,ie3 September 2018. There having been no valuation under the AM Order, it was only appropriate to appoint a valuer now and to follow the AM Order’s process on that footing. In order to explain the existence of the Colliers Valuation, the Wife argued that this was done in preparation for mediation between the parties.32Foot Note 32×WWS2 at para 9, 22–27.Further, the Wife explained that Colliers had a conflict of interest and she only accepted Colliers as the valuer because the mediation date was approaching and she believed that the valuation would not be final but only for the purposes of the mediation, at which the figures would be negotiated.33Foot Note 33×WWS2 at para 33.The fact that the valuations were not done for the valuesas at the date of the AM Ordershowed that the appointment was not for the purposes of the AM Order.34Foot Note 34×WWS2 at para 39.She denied that there was any understanding between the parties that the valuation should not be at the date of the AM Order.35Foot Note 35×WWS2 at para 68. 30 The Husband argued that the parties had appointed Colliers to undertake the valuation in accordance with the AM Order. First, the Husband argued that the phrase “as at the date of this order” in the AM Order was not intended to refer to the date at which the Flats should be valued, but referred to the identity of the Flats.36Foot Note 36×HWS1 at paras 32–34.Second, even if the AM Order required the Flats to be valued as at the date of the AM Order, the parties had agreed to appoint Colliers as valuerson the basisthat the Flats would be valued at the date on which the properties were inspected. Therefore, they had agreed to depart from the AM Order.37Foot Note 37×HWS1 at para 30. 31 I deal with the issue in three parts. First, I consider the AM Order itself to see if the court had ordered the Flats to be valued as at the date of the AM Order. Second, I consider, even if so, whether the parties had agreed to appoint Colliers as the valuer for the AM Order. Third, I consider the effect of the fact that they had not directed Colliers to value the Flats as at the date of the AM Order. (1) What did the AM Order require? 32 I find that the AM Order required the Flats to be valued as at the date of the AM Order. First, the language of the AM Order was such that the phrase “as at the date of this order” qualified the phrase “to value all the eight (8) flats”. There was no issue of the identity of the Flats in the order at all, since the order had already specified the eight Flats and even listed them out by their addresses. As the AM Order had already stated the identity of the Flats, there was no reason why it had to go on to specify that the identity of the Flats was to be determined “as at the date of this order”. Put another way, in order for that construction to be correct, some phrase like “registered in the name of the Wife” or “held by the Wife” should have been placed before “as at the date of this order”. Otherwise, the only other option for what that phrase qualified was the valuation. 33 Second, I gave little weight to the fact that the High Court had not expressly stated in the course of its reasoning that the valuation should be made at the date of the AM Order.38Foot Note 38×HWS1 at para 31.The fact is that this was expressly stated in the final form of the order, as well as in the document handed to parties on 17 May 2018 titled “Annex 1”, stating the draft order. Further, given that the reasoning was given on the date of the AM Order, it made sense that the High Court would not refer to “retrospective” valuation. 34 Third, I was not convinced by the Husband’s argument that interpreting the AM Order in the manner he proposed was more consistent with general principles of family law.39Foot Note 39×HWS1 at para 34.He was correct to note that the usual position is that the valuation of the pool of matrimonial assets should be the date of the AM hearing:TDT v TDS and another appeal and another matter[2016] 4 SLR 145 at [50]. However, I do not see how that would support his argument, as that principle would suggest that a valuation dateas close to the AM hearingwould be preferable. Hence, it would actually support the Wife’s argument that the date of the AM Order should be used for valuing the Flats. (2) Did the parties appoint Colliers under the AM Order and did they agree to a valuation on a date other than the date of the AM Order? 35 As I have found that the AM Order required the Flats to be valued as at the date of the AM Order, the question then is whether the parties had agreed to depart from the AM Order in appointing Colliers to value the properties as of a later date. In this regard, I accept that this part of the judgment may traverse grounds not covered within the “liberty to apply” clause. As I have already concluded, the express words of the AM Order required that the Flats be valued as at the date of that Order. While the basis of my decision lies in the parties’ agreement otherwise (and in particular the Wife’s implied representation to the Husband: see [50] below), I accept that my decision comes close to varying the AM Order. However, as I have noted above at [25], I consider that it is appropriate for me to consider the substance of this argument in the present case, since the parties have proceeded on that basis and no objections have been raised, and I find that I have the power to cure any procedural irregularity that has arisen. 36 I turn now to consider the circumstances in which Colliers was appointed. 37 I first deal with the correspondence. (a) On 23 May 2018, CW had sent a letter to R&T referring to the High Court’s decision on 17 May 2018 and noting that the joint valuer was to be appointed by 17 June 2018.40Foot Note 40×Husband’s Reply Affidavit dated 17 September 2019 (“HA2”) at p 19.CW proposed two valuers and asked for R&T to communicate the Wife’s proposal by 30 May 2018. (b) In a letter dated 7 June 2018, CW followed up with the previous proposal, noting that the Wife had not yet given her input as to the appointment of a valuer. CW stated that if no objections were forthcoming by 14 June 2018, they would appoint a valuer.41Foot Note 41×HA2 at p 20. (c) On 11 June 2018, CW sent another letter, but this appears not to be exhibited in the affidavits. (d) On 14 June 2018, R&T replied to CW on behalf of the Wife. The letter refers to the appointment of valuers and proposes three valuers for consideration.42Foot Note 42×HA2 at p 21. (e) On 16 June 2018, CW replied stating,inter alia, that the valuers proposed by the Wife were “not as renowned as the valuers which” the Husband had suggested. The Husband stated that he was willing to absorb the difference in the fees of one of the Husband’s proposed valuers and the highest quoted fees among the Wife’s proposed valuers. At para 6 of the letter, CW reminded R&T that the deadline for the appointment of the valuers was 17 June 2018 based on the AM Order.43Foot Note 43×HA2 at p 23. (f) On 19 June 2018, R&T wrote to CW stating the Wife’s disagreement with the Husband’s assertion that the valuers she proposed were not renowned, but, in any case, proposed two other valuers, one of which was Colliers.44Foot Note 44×HA2 at p 24.R&T expressly noted that the Husband “had relied on a valuation report by [Colliers] on the properties in [CW’s] letter dated 23 October 2017.”45Foot Note 45×HA2 at p 25.In the event of disagreement, R&T proposed writing a joint letter to court to ask the court to decide on which valuer to appoint. (g) On 5 July 2018, CW replied to R&T stating the Husband’s agreement to appoint Colliers as the joint valuer. The letter enclosed a draft letter of instruction to Colliers. At para 4, CW sought a reply urgently “since the Court deadline of 17 June 2018 for appointing valuers has already long passed”.46Foot Note 46×HA1 at p 86. (h) On 10 July 2018, R&T confirmed that the Wife was agreeable to the proposal in the letter dated 5 July 2018 to send the letter of instruction as drafted to Colliers.47Foot Note 47×HA1 at p 89. (i) On 11 July 2018, CW sent the letter of instruction to Colliers. 38 The letter of instruction to Colliers made reference to the AM Order as follows at para 2: “The Court has directed that the Parties jointly appoint a valuer to conduct joint valuations of the properties listed below”, referring to the Flats.48Foot Note 48×HA1 at p 90.At para 3, Colliers was requested to prepare valuation reports for the Flats, with the reports to be sent to both parties’ counsel within two months of the appointment. No mention was made of the date of valuation. 39 In response, Colliers provided a fee proposal dated 27 July 2018. It summarised the work requested as: “the provision of valuation service to advise on the Market Value of the above-captioned properties [ie, the Flats]as at current date, for divorce proceeding purposes” [emphasis added]. The parties agreed to the fee proposal and Colliers commenced their work accordingly. 40 In her submissions, the Wife made reference to the mediation that was attempted by parties at around the same time. On 18 July 2018, the registry of the Singapore Mediation Centre (“SMC”) had written to the parties to confirm whether they were amenable to attempting mediation.49Foot Note 49×WA1 at p 149.On 25 July 2018, CW confirmed this to be the case. That same day, CW wrote to Colliers stating: “Parties are presently looking at possibly having a Mediation in late August 2018. As such, we would like to ask that the valuations be provided latest by 15 August 2018, in time for parties to consider the same before Mediation.”50Foot Note 50×WA1 at p 152.On 3 August 2018, in its email attaching the signed fee proposal, R&T also noted: “we would be grateful if the valuation can be done as soon as possible as parties are presently looking at having a mediation between mid to end August 2018.”51Foot Note 51×WA1 at p 164. 41 Having considered the evidence, I find that the parties had agreed to appoint Colliers as the valuer for the purposes of the AM Order. 42 First, the correspondence detailed at [37] above clearly focused on the question of appointing a valuer for the purpose of the AM Order. CW’s letters to R&T dated 23 May and 7 June 2018 expressly referred to the High Court’s order that the valuer should be appointed. On 16 June 2018, dealing with the Wife’s counter-proposals, CW reiterated that the deadline for appointing the valuer was 17 June 2018,ie, one month after the date of the AM Order. This deadline was derived from the AM Order itself at para 2. On 19 June 2018, R&T proposed Colliers, and noted that they could write in to the court to decide on the valuer. That appears to me to acknowledge that the appointment was made pursuant to the order of court, under which they had been given liberty to apply for further directions if needed. Again on 5 July 2018, CW made reference to the deadline of 17 June 2018,ie, the deadline imposed by the AM Order. In my view, the correspondence from both sides shows that Colliers was appointed with a view towards complying with the said order. 43 Second, I do not accept that Colliers was appointed as valuer for the purpose of the mediation as the Wife claimed. In the first place, there was no reference to mediation whatsoever in the correspondence leading up to the appointment of Colliers. Further, the agreement to appoint Colliers on 10 July 2018 (when R&T communicated the Wife’s acceptance of Colliers as valuer) took placebeforethe parties had indicated to the assistant registrar at the Case Management Conference on 18 July 2018 for the Appeal that they were going to attempt mediation. Following that, they were then contacted by the registry of the SMC. Given this context, the emails dated 25 July and 3 August 2018 to Colliers from CW and R&T respectively do not show that the valuations had been soughtfor the purposeof mediation, but that the parties foresaw that the valuations would be useful for the mediation as well. That was to be expected, since the valuation would inform the amount due from the Wife to the Husband under the AM Order and would provide the context in which their dispute could be mediated. 44 Third, I place little weight on the Wife’s argument that Colliers could not have been appointed for the purposes of the AM Order because they were not directed to value the Flats as at the date of the AM Order, and they had not been given copies of the High Court’s order. The former argument puts the cart before the horse in this case, since the very question that the court is now seeking to determine is whether the parties had, in appointing Colliers on the terms that they did, done so for the purpose of the AM Ordereven thoughthe AM Order provided for that date of valuation. The other circumstances show clearly that Colliers was appointed for the purpose of the AM Order. The latter argument is unpersuasive as there is nothing in the text of the order that would have assisted Colliers in their work. If the argument is that the date of the valuation was not stated to Colliers, that again is a question of whether the parties had agreed to depart from the AM Order and whether they should be held to that decision now. 45 I also give little weight to the Wife’s argument that Colliers had a conflict of interest and that she was pressured into accepting Colliers as the valuer, and that she did so because she believed the valuation to be for the purpose of mediation only. The correspondence bears out a completely different story. It was theWifewho had proposed Colliers to the Husband through R&T’s letter dated 19 June 2018. In that same letter, R&T acknowledged that Colliers had been relied upon by the Husband previously to value some of the properties. The Wife would already have known about this potential conflict and yet proposed Colliers as the valuer. Moreover, that letter came before the parties had indicated their amenability to mediation at the Case Management Conference on 18 July 2018. This meant that the Wife’s proposal of Colliers could not have been for the purpose of mediation, but must have been for the purposes of complying with the AM Order. Further, when that potential conflict was declared to the parties on 2 August 2018 by Colliers, no issues were raised and the parties agreed to appoint Colliers. Even if there were a potential conflict, the Wife clearly accepted that risk in proposing and agreeing to appoint Colliers for the purposes of the AM Order. 46 Having found that Colliers was appointed for the purpose of complying with the AM Order, I also find that the parties had agreed to have Colliers value the Flats at the “current date”,ie, not backdated to the date of the AM Order. This is clear from the fact that (a) the letter of instruction made no reference to the date at which the values of the Flats were to be obtained, (b) the fee proposal expressly stated that the valuation would be based on the “current date”, and (c) the parties agreed to the fee proposal without reservation. There is also no allegation that Colliers had departed from instructions in valuing the Flats at the respective dates stated at [28] above. It was clearly agreed by the parties that the valuation would be done at a date other than the date of the AM Order. 47 In my view, the fact that the Wife had obtained valuations from other valuers that showed that the value of the Flats as at the date of the AM Order was different from the value as at the dates of the Colliers Valuation was not relevant. I accept that there might be a difference in the value, even a significant one, but the question here is whether the parties had agreed to a valuationfor the purposes of the AM Orderthat used a different date. As I will go on to discuss, that agreement and the implied representation from the Wife meant that she could not now claim that the AM Order should be followed strictly. (3) What is the effect of the difference in dates? 48 The question, then, is what effect the parties’ agreement to appoint Colliers as valuer for the AM Order, but without strictly following the said order, has on how the AM Order is now to be executed? In my judgment, the Wife is estopped from asserting that the Colliers Valuation should not be used for the purposes of the AM Order. The Wife’s arguments focused on asserting that the Colliers Valuation was only sought for the purpose of mediation and not for the order. She did not offer substantive arguments on how I should treat the agreement in the event that I found against her on the facts. I take it that she does not dispute the fact that if the parties had agreed to appoint Colliers as the valuer under the AM Order and had agreed for the valuation to be done without reference to the date of that order, she would be bound by that choice. 49 In any case, for completeness and although these principles were not argued before me, I consider it helpful to set out the legal basis for my finding. I take guidance from the Court of Appeal’s discussion of the doctrine of “waiver by estoppel” inAudi Construction Pte Ltd v Kian Hiap Construction Pte Ltd[2018] 1 SLR 317 at [57]: Waiver by election is often distinguished from what is sometimes called waiver by estoppel: see, for example,Kammins Ballrooms Co Ltd v Zenith Investments (Torquay) Ltd[1971] AC 850 at 882H–883C,perLord Diplock. This refers to the doctrine of equitable (or promissory) estoppel. It requires an unequivocal representation by one party that he will not insist upon his legal rights against the other party, and such reliance by the representee as will render it inequitable for the representor to go back upon his representation:The Kanchenjungaat 399 col 2. … 50 A representation must be clear and unequivocal, but “does not need to be express and may be implied”:Tacplas Property Services Pte Ltd v Lee PeterMichael (administrator of the estate of Lee Ching Miow, deceased)[2000] 1 SLR(R) 159 at [62]. In my view, there was a clear and unequivocal representation, in the acceptance of the draft letter of instruction and in the acceptance of the fee proposal from Colliers, that the Wife would accept the valuation of the Flats as at a date other than the date of the AM Order, and that the Wife would not insist upon the strict terms of the AM Order. The Husband then relied upon this representation in the engagement of Colliers and payment of Colliers’ fees, as well as in relying on the Colliers Valuation for his subsequent position and in these proceedings. In my judgment, it would be inequitable for the Wife to now resile from that representation and assert the strict terms of the AM Order, when she had no such qualms during the process of agreeing on the valuer and the terms of the valuation. To require the whole process to start again, at a time that is significantly after the date when the properties were to be valued, after the Husband has based his claims on the Wife’s unequivocal (albeit implied) representation, would be unjust to the Husband. 51 Therefore, I hold that the Colliers Valuation should be used for the purposes of the AM Order, since the Wife can no longer claim that the Flats should be valued as at the date of the order. I do not vary the AM Order, but find that the circumstances are such that the Wife cannot resist the Husband’s argument that the Colliers Valuation should be used to implement the AM Order. How should the net equity of the Flats be calculated? 52 I turn then to the next broad issue in this case, which deals with how the net equity of the Flats is to be calculated under the AM Order. The material term of the AM Order is as follows: … The total net equity of the flats is to be divided equally between the [Wife] and the [Husband]. The net equity of each flat is to be determined by deducting from the value of each flat, the outstanding mortgage amounts as at 30 November 2015 (as stated inJSI 3 of 20 March 2018), the further mortgage instalments and/or redemption payments including interest payments made by the [Wife], that are to be reimbursed to the [Wife], and the costs and expenses of valuation. [emphasis in original] 53 As noted above, there are three particular issues for resolution. Each of these turns essentially on the interpretation of the AM Order. (1) What does it mean for the Wife to be “reimbursed” for the Mortgage Payments? 54 I begin by considering what the phrase “reimbursed to the [Wife]” means. The parties have put forward two different interpretations of this phrase, which can be expressed in terms of the formula for calculating the respective parties’ shares of the net equity of each flat. As defined at [17] above, I use the term “Mortgage Payments” to refer to “the further mortgage instalments and/or redemption payments including interest payments made by the [Wife]”. Both parties accept that the net equity of each flat is to be calculated as follows:  55 The disagreement lies in how each party’s share of the net equity should be calculated. The Husband’s position can be summarised as follows:  56 The Wife’s position can be summarised as follows:52Foot Note 52×WWS1 at paras 86–89.   57 The Wife claimed that the addition and deduction of the Mortgage Payments was required by the phrase, “that are to be reimbursed to the [Wife]”. The Husband argued that this phrase merely explained why the Mortgage Payments were deducted from the value of the flat, and that the Wife’s approach would not be consistent with the remainder of the AM Order. 58 In my judgment, the Husband’s approach is the correct interpretation of the AM Order. First, simply as a matter of language, I agree with the Husband that the phrase, “that are to be reimbursed to the [Wife]”, does not purport to change the calculation of the parties’ shares in the net equity. That phrase is a subordinate clause after the statement that the further Mortgage Payments were to be deducted from the value of the flat. It describes the deduction as the reimbursement, explaining that the Mortgage Payments are deductedbecausethey are to be reimbursed. 59 This is confirmed by the overall structure of how the net equity is calculated. The outstanding mortgage amount as of 30 November 2015 is deducted, which gives the equity of the property,ie,the net value of the property as of 30 November 2015. The IJ date was 17 November 2015, so 30 November 2015 was the end of the month closest to the IJ date. Subsequently, since the parties are taken for these purposes to be living separate lives after the IJ date, any payment that the Wife made for the purpose of paying off the loan should be attributed to her alone. As the Wife has the Flats in her name, by deducting these further Mortgage Payments from the net equity, this approach effectively allows the Wife to retain those sums and recoup whatever she had spent on the further Mortgage Payments. That deduction meant that she would not have to transfer that amount to the Husband for his share in the property. In other words, she was being reimbursed for what she paid after 30 November 2015 since she would not have to account for those sums in the calculation of what the Husband’s share of the Flats was. There was no ground for reimbursing the Wife further. 60 Having regard to the parties’ submissions, I also do not find that anything in the Notes of Evidence for the hearing on 17 March 2018 suggesting that the High Court Family Division intended otherwise. The High Court was consistent throughout and did not mention a further reimbursement of the Mortgage Payments to the Wife beyond what was encapsulated in the formula for net equity. 61 I consider also the Wife’s various computations which sought to show that the additional reimbursement that she claimed was necessary to give her closer to 50% of the real property assets. Taking the computation in her written submissions dated 2 April 2020 at p 33, there were two issues with her computations. First, it is not clear to me why the equity that she had in the properties was not counted as part of her “share” of the property, such that the payments she made towards the principal would be part of the equity that she owned in the properties. It is certainly not suggested that the Husband has any claim to that equity. Second, I do not see a basis for her to deduct her expenses for the Flats.53Foot Note 53×WWS 20 April 2020 at para 35.Having gone through the High Court’s reasoning in giving the AM Order, I do not see allowance granted to the Wife for the expenses she allegedly incurred for the Flats. Deducting that sum appeared to artificially reduce her entitlement so that the result showed something closer to 50%. The same criticisms can be made of her computations at p 27 of those submissions. I am not convinced by the Wife’s computations that the High Court must have intended for the Husband to further reimburse the Wife for the Mortgage Payments. 62 Finally, I deal briefly with the Wife’s contention that the Husband had in fact adopted the Wife’s interpretation when he sought a clarification from the court on 23 May 2018.54Foot Note 54×WSS1 at para 78.The Husband had stated at para 6 of that letter to the court an understanding of the formula in the AM Order that appeared to be similar to what the Wife was claiming. However, I note that this was done in the context of a clarification, meaning that this understanding was subject to change, and also showed what was apossiblealthough perhaps not desirable or correct interpretation of the AM Order. In any case, I do not see any reason to hold the Husband’s counsel to the same interpretation, since there would not be any inequity caused to the Wife by allowing them to put forward the interpretation that they do now. Therefore, I do not give any weight to the fact that the Husband had previously identified an interpretation that was contrary to the one he was advancing in present proceedings in this manner. 63 In the result, I find that the Husband’s interpretation of the AM Order is correct, based on the language, context, and intent of the AM Order. (2) When is the cut-off date for accounting for the Mortgage Payments? 64 The next issue for determination is when the date is, after which the Mortgage Payments are no longer to be deducted from the value of the flat for calculating the net equity. The Husband proposed that this date is, at the latest, when the valuation report is completed and the net equity is calculated.55Foot Note 55×HWS1 at para 55.The Wife argued that the date is when the AM Order is completely executed,ie, that the further Mortgage Payments should be accounted for until the Wife transfers the requisite sum to the Husband. Another possibility, which was highlighted by the Husband but not advanced in argument, is that the cut-off date should be the date of the AM Order. 65 In this case, the express language of the AM Order is not determinative of this issue. The AM Order does not provide a date after which the further Mortgage Payments are no longer to be counted. I accept that it would have been straightforward for the High Court to have provided a date or a timeframe if some definite timeline was in view.56Foot Note 56×WWS2 at para 118.Each of the three possibilities could have been easily described in the AM Order. Hence, the absence of an express cut-off date does not mean that any one of the three possibilities is to be preferred. 66 The context of the AM Order provides some guidance. I first rule out the Wife’s proposed interpretation. Taking the cut-off date as the date on which the Wife transfers the requisite sum to the Husband, as the Wife proposed, is unworkable. In order to determine what the Husband is entitled to, the net equity must be calculated, which includes deducting the Mortgage Payments. The deductions must be done in order to crystallise the net equity to which the Husband is entitled, and, accordingly, to determine what the Wife must transfer to the Husband pursuant to para 3 of the AM Order. Importantly, the Wife is to transfer the sums in three portions according to para 3, which are months apart. Yet, if the Wife’s interpretation is correct, then the deductions would have to keep on being accounted for even while the various payments are being made, but that would then modify the net equity to which the Husband is entitled to, and affect even the payments that had already been made. Given that para 3 refers to the Husband’s share of the net equity rather than providing that the sum to be transferred by the Wife is to be calculated each time the payment is made, the Wife’s interpretation does not fit the structure of the AM Order. 67 I agree with the Husband that thelatestdate that could operate as the cut-off date would be the date of the valuation report. The timelines that the AM Order prescribes in relation to payment of the share in the net equity are based around the date of the valuation report. Initially, the parties were to appoint a valuer within one month of the date of the AM Order. The valuer was to complete the valuation within two months of the appointment. At that point,once the valuation report is complete, the timeline for the obligation for the Wife to pay the Husband’s share in the net equity begins to run, under para 3. Moreover, the date of the valuation report is also used to determine the period of time within which the parties may consider distribution of the real propertiesin specieunder para 4. Furthermore, in terms of the calculation of the net equity, the figure that is most important is the valuation of each of the Flats, as that figure is the basis upon which the other figures are deducted. In order for the AM Order to work, the net equity has to be determined by the date of valuation report, otherwise these next steps would not be workable. These next steps depend on there being a stable determination of the net equity on which basis these steps can operate. 68 However, there remains a choice between the date of the valuation report and the date of the AM Order. I conclude that the AM Order provides that only the Mortgage Payments up to the date of the AM Order should be deducted in calculating the net equity. This is primarily because the Flats were to be valuedas at the date of the AM Order, and consistency with this would require that the net equity be calculated using the Mortgage Payments only up to that date. In other words, the purpose of the valuation report was to provide the value of the Flats at that date to calculate the net equity as at the date of the AM Order, which is divided in half, and is then given effect to either by the monetary transfer under para 3 or thein speciedistribution under paras 4 and 5. If the cut-off date for the Mortgage Payments was the date of the valuation report, there would be an odd inconsistency in that the value of the Flats would be as of the date of the AM Order, but the further Mortgage Payments made between the date of the AM Order and the date of the valuation report would still be deducted. In the absence of any reason for this discrepancy, I do not see a reason to adopt an interpretation that would lead to that result. 69 This is further supported by the oral grounds of decision delivered by the High Court on 17 May 2018. At paragraph 21, the High Court introduced the specific orders on the valuation of the Flats by stating that it had “for the purpose of division, used an average gross value of each of the Flats to work out their net equity and as there would be changes in the value of the Flatsand in the outstanding mortgage amounts as [the Wife] would have continued to pay the mortgage instalments and interest” [emphasis added], and an updated valuation would therefore be needed for the apportionment of the assets. In other words, the net equity was left to be calculated both because an updated valuation (at the date of the AM Order) was needed for each flat and because more payments for the instalments and interest would have been made. It appears from the way that these instalments and interest payments were referred to that they are those paymentsthat were made up to the date of the AM Order. Otherwise, reference could have been made to payments thatwould be made in the futurerather than just payments that have already been made. This same tense is used in the AM Order itself, which refers to “the further mortgage instalments and/or redemption payments including interest paymentsmadeby the [Wife]” [emphasis added]. Since these payments were being referred to as at the date of the AM Order, it is reasonable to construe them as referring to payments madeby the time the AM Order was given. 70 A third reason for this conclusion can be found in the phrase, “that are to be reimbursed to the [Wife]” found in para 2 of the AM Order. The principle that underlies this reimbursement shows that only the Mortgage Payments up to the AM Order should be included. The net equity of real properties for the purposes of ancillary matters is usually taken at the date of the AM Order. In this regard, I consider the Court of Appeal’s decision inTIC v TID[2019] 1 SLR 180 (“TIC”). That case concerned the question of who should bear the ongoing liabilities arising from property that is divided in divorce proceedings between the date of the order and the date of the completion of the transfer, where one party is given the option to purchase the other party’s share of the property:TICat [1]. The Court of Appeal held that, in the absence of specific direction, theprima facieposition is that the eventual owner of the property should bear the mortgage payments from the date of the court order to the date of the completed transfer:TICat [24(b)]. The reason for thisprima facieposition is that the net equity of the property would usually be determined as at the date of the court order, and any increase in the net equity subsequent to that date would accrue to the benefit of the eventual owner of the property:TICat [10]. Adapting the terms of theprima facieposition articulated by the Court of Appeal inTICto the present case would give the following results: (a) the Wife would be entitled to any increase in the net equity of the Flats due to her own payments towards the mortgages (ie,she would be “reimbursed” for her payments through this retention: see [59] above) up to the date of the AM Order; and (b) if the division is effected by a transfer, whoever is the eventual owner of the property would have to bear the mortgage payments after the date of the AM Order. 71 In the present case, I am not concerned with the latter, as that is not before the court. This is something that would have been covered under para 5 of the AM Order, in that the parties would either have to agree on or seek the court’s order for the mechanism by which anin speciedistribution could be effected. What is relevant for the present is the first part of theprima facieposition, which suggests that the cut-off date for accounting for the Mortgage Payments is the date of the AM Order. Having considered the High Court’s grounds of decision and the terms of the AM Order, I do not see any reason to suggest that the High Court intended to depart from theprima facieposition. Taking guidance fromSujatha([21]supra) at [16], this interpretation seeks to interpret the AM Order in conformity with established law and practice. This supports my conclusion that the AM Order was intended to divide the net equityas at the date of the AM Orderto give effect to the decision on division of the matrimonial assets. 72 The above discussion has proceeded on the basis of the AM Order as written, that is, on the basis that the Flats are to be valued as at the date of the AM Order. Should the conclusion be modified because of my findings that the parties are bound by the Colliers Valuation, which did not value the Flats at the date of the AM Order? I conclude that there is no need for any modification. First, my conclusion as the Colliers Valuation was based on the parties’ conduct, especially the Wife’s decision to accede to the proposal for Colliers to value the Flats at a dateafterthe date of the AM Order and for that valuation to be used for the purposes of the AM Order. The parties’ conduct does not show a corresponding intention that the Mortgage Payments up to that later date would continue to be accounted for. Second, as I have noted above, where there is a departure from the terms of the AM Order due to the parties’ subsequent conduct, I am of the view that the departure should be circumscribed as much as possible so that the AM Order can be implemented as written. Third, I do not see any pressing reason of principle that would require the Mortgage Payments up to the later date to be accounted for. I do not think that the Wife has suffered any prejudice, as she continues to be entitled to the equities in the Flats, and accordingly, any subsequent payments made towards the mortgage would accrue to her benefit. I therefore find that the AM Order continues to operate such that the Net Equity is calculated only with reference to the Mortgage Payments up to and including the date of the AM Order,ie17 May 2018. 73 Unlike the other paragraphs of the AM Order, para 2 was not stayed by the Stay Order. Therefore, I find that there is no reason to postpone this date to after the Appeal Order, and I therefore use 17 May 2018 as the cut-off date for accounting for the further Mortgage Payments. As Mortgage Payments are made monthly, I take it that this would include Mortgage Payments for the month of May 2018. (3) Should the 3% redemption monies be included in the Mortgage Payments? 74 In the course of removing the Husband as co-borrower for a number of the Flats, the Wife had to make payment of 3% of the principal sums in order to refinance the loans. In my view, it is clear that these sums would fall within the definition of the Mortgage Payments, since they are redemption payments, based on the express wording of the AM Order. I note also that the Husband did not seriously contend otherwise during submissions. 75 The issue, however, is whether they should be accounted for given that they were payments madeafterthe date of the valuation reports.57Foot Note 57×HA1 at para 29(f).I agree with the Husband that they cannot be so included. The AM Order was intended to crystallise the net equity as of the date of the AM Order. As far as the net equity is concerned, there is no basis for a further adjustment after that date. I therefore cannot agree that the 3% redemption monies should be deducted from the value of the Flats to arrive at the net equity. 76  I do not think that this is ultimately unfair to the Wife, even if these monies had to be paid because she was removing the Husband as co-borrower. This money would have gone to redeeming equity in the Flats in question. That means that the value would be hers since she is the one with the claim to the equities. If and when the properties are sold, then she will have the benefit of the redeemed equities. Further, the parties could have made provision for how this is to be accounted for in the Stay Order when they agreed that the Wife would remove the Husband as co-borrower for those Flats that were listed in the order, but did not do so.",
        "What should the Wife pay to the Husband and when?": "77 I summarise the conclusions I have reached above: (a) I accept that the Colliers Valuation should be used for the purposes of the AM Order, even though the Flats were valued at a date later than the date of the AM Order. (b) The formula for calculating the parties’ respective shares in the net equity is only a halving of the net equity, and does not require further adjustment for the Mortgage Payments made by the Wife. (c) The cut-off date for the accounting of Mortgage Payments in the net equity is the date of the AM Order,ie, 17 May 2018. The 3% redemption monies are not to be accounted for in calculating the net equity. 78 In that light, I come now to consider the quantification of the sum that the Wife should pay to the Husband. I have already noted the values of the various Flats at [28] above. The mortgage sums outstanding as at 30 November 2015 are stated in the Joint Statement of Information dated 20 March 2018. The remaining question is how much were the Mortgage Payments made by the Wife from 30 November 2015 to 17 May 2018, which I will take to include the month of May 2018. 79 The parties appear to be largely in agreement on the monthly Mortgage Payments made for each of the Flats. The Husband has provided figures, which do not appear to be disputed, for the Mortgage Payments as of August 2018,ie33 months after 30 November 2015.58Foot Note 58×HA1 at para 19.As neither party had advanced the date of the AM Order as the cut-off date for the Mortgage Payments, no aggregate value of those payments from 30 November 2015 to 17 May 2018 was forthcoming. I therefore proceeded by taking the average monthly payments from the Husband’s calculations (dividing by 33 months) then multiplied this by 30 months (being the number of months between 30 November 2015 and 17 May 2018, including May 2018). 80 I summarise these values in the following table: S/NFlatValue (A)(S$)Outstanding mortgage amount (B)(S$)Mortgage Payments (C)(S$)Net equity(A – B – C,ie,before deducting cost of valuation)(S$)1.Marina Flat 191,350,000.00609,446.9581,594.55658,958.502.Keppel Flat 32,160,000.001,304,027.97142,305.25713,666.783.Alexandra Flat 71,950,000.00841,207.2191,611.521,017,181.274.Marina Flat 83,300,000.001,704,281.03255,637.661,340,081.315.Keppel Flat 191,540,000.00690,811.03100,290.57748,898.406.Keppel Flat 1271,530,000.00643,953.9786,487.13799,558.907.Keppel Flat 411,720,000.00446,780.9866,924.821,206,294.208.Marina Flat 171,360,000.00789,808.74110,723.42459,467.84Total14,910,000.007,030,317.88935,574.926,944,107.20 81 The total net equity before deducting the cost of the valuations is therefore S$6,944,107.20. The total cost of the valuation was S$6,400.00.59Foot Note 59×HA1 at p 94.The total net equity is therefore S$6,937,707.20. As such, each party’s share is S$3,468,853.60, being 50% of that total net equity. 82 Next, I consider the issue of timing of the payments. The original AM Order had prescribed timelines based on the date of the valuation report. Since I have found that the date of the valuation report is 3 September 2018, the dates for payments originally would have run from that date. However, by the Stay Order, the order for payment of the Husband’s share of the net equity was stayed pending appeal. Hence, I accept that by reason of the parties’ agreement recorded in the Stay Order, the timelines began to run only on 5 April 2019 when the Appeal was disposed of. Yet another twist, however, was that the Wife maintained that the Colliers Valuation was not a valuation for the purposes of the AM Order, and therefore refused to make payment. The Husband then brought the present application for clarification. The Wife argued in the present proceedings that if I was minded not to order a new valuation for the purposes of the AM Order, she should be granted ten months from the date of the present judgment to pay the sums to the Husband.60Foot Note 60×Wife’s Submissions dated 14 November 2019.In my view, this would be prejudicial to the Husband and would not be an appropriate order to make given the context of the present proceedings. The AM Order (read with the Stay Order) is clear that the timeline would run from 5 April 2019. That the Wife mistakenly believed that the Colliers Valuation could not be used for the AM Order is not sufficient grounds for delaying payment even further. I therefore find that the Wife should have made the following payments: (a) One-third of the Husband’s share of the net equity within four months of 5 April 2019. (b) One-third of the Husband’s share of the net equity within six months of 5 April 2019. (c) One-third of the Husband’s share of the net equity within eight months of 5 April 2019. 83 I turn to the question of interest. The Husband asked for the usual 5.33% p.a. under r 680 of the FJR, as directed by the Chief Justice. I do not see any reason to find that the Husband cannot claim for interest at all, as he was always entitled to the payments in the above timeline. However, since this is not an action for the enforcement of a judgment debt, I do notawardinterest to the Husband. The present proceedings seek to determine the parties’ respective interests under the AM Order. The AM Order does not speak about interest, nor is the present action a claim on the judgment debt under the AM Order. Given the scope of the present proceedings, I leave it open as to whether the Husband would wish to seek payment of the interest in a separate action on what he is owed under the AM Order. The nature of those proceedings is sufficiently different that I am not convinced it would be correct for me to cure the procedural irregularity to that extent. As I have not pronounced on any enforcement orders against the Wife, what I have said here is without prejudice to the Husband taking out the necessary applications to seek payment of the sum from the Wife.",
        "What should the Wife pay to the Husband for his share of the non-real property assets?": "84 Having dealt with the substantial part of this application, I turn to prayer 1(b), which sought a payment of a sum of S$3,885.75. As the Wife did not make any specific challenge to the value claimed by the Husband, I only consider if the Husband’s claim is justified by the facts. The Husband’s calculation of S$3,885.75 was arrived at as follows:61Foot Note 61×HWS at para 15. (a) The sum awarded by the High Court in the AM Order was S$1,382,292.00. However, this had to be adjusted based on the Appeal Order which removed US$166,000 from the pool of matrimonial assets. After removing this sum, the sum owing from the Wife to the Husband was calculated as S$1,266,092.00. (b) The Husband added the following sums to which he claimed that he was entitled to: (i) the costs due to him for the AM proceedings (S$25,000.00) and for the Appeal (S$40,000.00); and (ii) half the total of the costs of the valuation undertaken by Colliers of the Flats (S$3,200); giving a total of S$1,334,292.00. (c)  From this amount, the Husband deducted the monies that had already been transferred to him for this purpose: (i) S$926,000.00 which had been transferred under para (2)(a) of the Stay Order; (ii) S$20,000.00 in security for costs provided by R&T and (iii) S$384,406.25 which had been released from CW as stakeholders under ORC 210/2019; giving a balance of S$3,885.75. 85 I note here that I accept the inclusion of the Colliers Valuation only because of my conclusion above that this valuation should be used for the AM Order, which provided that the fees and expenses of valuation were to be deducted from the value of the Flats. Since the amount that the Wife is made to transfer to the Husband is half of the net equity, that means that, in effect, the amount that ought to be used for the fees and expenses would be retained by the Wife (in whose name the Flats are held). It follows that the Wife should be made to bear the costs of the valuation, as it is something that the AM Order allows her to retain from the value of the Flats. Having found that the Colliers Valuation was done for the purposes of the AM Order, I find that the Husband should be able to claim this against the Wife. 86 However, I am ultimately not persuaded that I should make the order sought by the Husband. The Husband had added to the calculations the S$65,000.00 in legal costs that the courts had awarded for the AM proceedings and for the Appeal. I see no basis for me to perform this set-off against these debts, especially since they concern matters that are distinct from the question of the division of the matrimonial assets. Considering that these are summons in relation to a prior court order, under the “liberty to apply”, and in the absence of the parties’ agreement, I do not consider it appropriate to grant an order that would involve such a set-off. Hence, I will not make any order in respect of prayer 1(b). This is without prejudice to the Husband commencing other actions to recover the various sums due to him if parties are unable to agree on their payment.",
        "Caveats and terms on which Husband is to be removed as co-borrower": "87 I turn to the issue that the Wife raised about the Husband’s caveats. The Husband should work together with the Wife to lift the caveats on the relevant Flats.  In my view, it would be fair for the removal of the caveats to follow from the payment of the relevant sums under the AM Order. Insofar as a caveat needs to be lifted for the Wife to perform either a sale or re-financing of the relevant flat, the Husband should co-operate with the Wife to do so. Any remaining caveats should be removed after payment of the Husband’s share of the net equity is made. The process used for the prior occasions when caveats were lifted would be a useful guide. I will leave parties to draw up the necessary orders. In my view, this is purely supplementary to the main order in view in the AM Order, and would fall within the scope of the court’s powers in the present application.",
        "Costs": "88 Costs of SUM 167 were reserved to be dealt with SUM 168. Parties are to file and exchange written submission on costs of SUM 167 and these proceedings limited to 6 pages (excluding annexes exhibiting documents and list(s) of disbursements), within 21 days of this judgment.",
        "Conclusion": "89 I come to the following conclusions in this case: (a) In terms of prayer 1(b), I make no order for such payment to be made. (b) In terms of prayers 2 and 3, (i) I conclude that: (A) the Colliers Valuation should be used for the value of the Flats; (B) the Husband is entitled to half of the net equity, without further reimbursement for Mortgage Payments made by the Wife; (C) only the Mortgage Payments from 30 November 2015 to 17 May 2018 (ie, including mortgage payments made for the month of May 2018) should be deducted as part of the calculation of the net equity; (D) the cost of the valuation is to be the cost of the Colliers Valuation. (ii) Based on the evidence before me, I conclude that the Husband’s share of the net equity is S$3,468,853.60. (iii) The Wife was to have paid one-third of the Husband’s share of the net equity four months after 5 April 2019, another one-third six months after 5 April 2019, and the last one-third eight months after 5 April 2019. (c) Insofar as the Wife needs caveats withdrawn on certain Flats to sell the said Flats or to re-finance them, the Husband is to co-operate and do so. For the remainder of the caveats, the Husband is to withdraw all of them after receiving payment of his entitlement to the net equity. Parties are to draw up a draft order for the appropriate mechanism for this to be implemented. Tan Puay BoonJudicial Commissioner Philip Lam Hoe Wai (Lam & Co) for the plaintiff (until 2 July 2020), the plaintiff in person (from 2 July 2020); Wong Kai Yun and Chan Xian Yi Jonathan (Zeng Xianyi) (Chia Wong Chambers LLC) for the defendant.",
        "": ""
    }
}