{
    "case_title": "CIKvCIL",
    "ncitation": "[2020] SGHC 274",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 The parties previously submitted their dispute for determination pursuant to the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (the “Act”). Under that adjudication determination in SOP/AA 441 of 2019 (the “Adjudication Determination”), the adjudicator found that he had no jurisdiction to hear the matter on the basis of a lack of contract between the parties. 2  In this originating summons, the plaintiff contended that the adjudicator had made an erroneous determination on jurisdiction, or in the alternative, breached the principles of natural justice by failing to consider the plaintiff’s arguments. 3 I agreed with the plaintiff and set aside the Adjudication Determination on the ground that there was jurisdiction because a written contract did exist. The defendant has appealed against my decision, and these are my grounds.",
        "Background": "4  The plaintiff is a company that specialises in the design and development of pneumatic food waste management systems for hawker centres. The defendant is the main contractor for the construction of a five-storey integrated development known as Fernvale CC Project (the “Project”). 5 The Project also included the construction of a community club and hawker centre. As a result, the defendant appointed the plaintiff as the specialist sub-contractor for the design-and-build of a pneumatic food waste management system at the Project’s hawker centre. To this end, a letter of appointment was sent by way of email on 17 October 2018 (the “17 October 2018 Email”), from the defendant to the plaintiff, and provided as follows:1Foot Note 1×Chia’s 1st Affidavit p97 Tab 5 of Exhibit “CKK-1”. … We write to confirm on the awardPneumatic Food Waste Management SystemtoEcovacSystems Ptd Ltdin the Lump Sum amount of $444,000.00 (Singapore Dollars: Four Hundred and Forty-Four Thousand Dollars only) for Fernvale CC project which subject to Architect’s approval. Please find attached revised quotation, procurement checklist and Specimen of Contract Performance Bond for your further action, kindly revert to us on your signed copy for our preparation of formal Letter of Award. We shall forward you our Specimen of Down Payment Bond in due course. You shall commence your servicesIMMEDIATELYand coordinate closely with our project teams and Consultants for all necessary submission and/or presentation for approval. Kindly submit your project organization chart and work programme to usWITHIN 7 DAYSfrom this email. … 6 It should be noted thatpriorto the 17 October 2018 Email being sent, parties had met up for a “procurement negotiation meeting” on the very same date (the “17 October 2018 Meeting”). Part of the details of the 17 October 2018 Meeting were set out in a letter sent by the defendant on 27 July 2019 that crucially, states as follows:2Foot Note 2×Chia’s 1st Affidavit p 267. … We reject your allegations. The fact was during the procurement negotiation meeting with you on 17 October 2018, we clearly told you that we reject the advance payment term (or down payment) listed in your quotation unless you provide an advance payment bond, as a security deposit for the advance payment, in favour of [the defendant].You clearly accepted this term during the procurement negotiation meeting before we confirm the award of the sub-contract work to you. After our confirmation of the award of the sub-contract to you,you unilaterally insisted for an advance payment (or down payment) for the sub-contract work to be made to you otherwise you will not make progress for the necessary work … [emphasis added in bold] 7 Following the 17 October 2018 Email, the plaintiff commenced work on the Project. On 31 May 2019, it submitted the first progress claim for the sum of $133,200, for work done as at May 2019 (the “First Payment Claim”).3Foot Note 3×Chia’s 1st Affidavit at para 74, and Tab 42 of Exhibit “CKK-1”.This First Payment Claim was rejected by the defendant on the basis that it viewed the claim as one for down-payment. The plaintiff submitted a second progress claim on 23 June 2019 for the sum of $140,000, for work done as at June 2019 (the “Second Payment Claim”).4Foot Note 4×Chia’s 1st Affidavit at paragraph 77, and Tab 44 of Exhibit “CKK-1”The defendant again did not pay this sum, but sought to transmit a revised letter of agreement to the plaintiff on 6 July 2019 (the “LOA”). The plaintiff averred that it either did not receive or accept the LOA. 8 Matters subsequently came to a head when the Project’s architect, AGA Architects Pte Ltd (the “Architect”), issued an instruction directing the defendant to remove and replace the plaintiff as the specialist sub-contractor on 23 August 2019 (the “Architect’s Instruction”). This was due to concerns involving the plaintiff’s performance, including the lack of a comprehensive design report 54 weeks into the Project. Four days later, the defendant terminated the sub-contract with the plaintiff.",
        "The defendant’s case": "9 The defendant argued that the 17 October 2018 Email was a conditional offer, that was subject to the approval of the Architect as stated within the email itself and the procurement checklist annexed to the email. The plaintiff had repeatedly failed to provide information requested by the Architect, and the latter had also never granted the necessary approval as a result. 10 There was hence never any offer that had been accepted by either party. Further, the work that had been instructed to be commenced was for the plaintiff’sproposalfor the Architect’s approval. The instructions did not relate to the scope of the work set out in the quotation. Accordingly, there was no written contract between parties. 11 In the alternative, the defendant argued that if a contract did exist, the terms would be as set out in the LOA. Under the terms of the LOA, the application for an Adjudication Determination was filed prematurely.",
        "The plaintiff’s case": "12 The plaintiff argued that the 17 October 2018 Email was the contract between the parties. At that point, there was only one outstanding matter of discussion – whether the down-payment was to be paid upon the signing of the agreement or upon provision of an advance payment bond. Despite this, the defendant had confirmed the award of the sub-contract to the plaintiff and even instructed the plaintiff to commence work. 13 The defendant had also acted in accordance with the terms of the sub-contract, giving instructions to the plaintiff or communicating on relevant issues. The plaintiff was therefore also estopped from denying the existence and validity of the sub-contract.",
        "My decision": "14 In my view, the present situation is a rather straightforward instance of contractual formation. On the evidence, I find that an amended offer had been made by the plaintiff at the 17 October 2018 Meeting between the parties. This offer was then accepted by the defendant by way of the 17 October 2018 Email. 15 It is clear from the correspondence between parties that the defendant itself regarded the above sequence of events to be accurate. For instance, in the 17 October 2018 Email, it had explicitly stated that it was writing to “confirm on [sic] the award”. In the 27 July 2019 letter, set out above at [6], the defendant again stated that there was clear acceptance or agreement as to the terms at the 17 October 2018 Meeting, before the award of the contract was confirmed. 16 Finally, in an email sent to the plaintiff on 24 May 2019,5Foot Note 5×Chia’s 1st Affidavit pp 1114–1115.the defendant evidently proceeded on the basis that the 17 October 2018 Email constituted the contract. It referred to the terms within the 17 October 2018 Email to argue that it was “clearly stated that [the plaintiff] can apply for advance payment in [sic] the condition that you can provide us an advance payment bond”. The defendant also adopted the view that the plaintiff had subsequentlyrequestedawaiveron the advance payment bond, a request that the defendant denied. The reason given for its denial was that the plaintiff had not previously replied them and they hence “did not seek … top management approval for amendment to theterms of payment agreedbetween [the plaintiff] and [the defendant] on17 October2018” [emphasis added]. 17 This conclusion is further bolstered by the fact that the defendant had multiple occasions to clarify that a contract had not yet been formed but did not do so. It had not done so in the letter sent on 24 May 2019, as above in [16]. It had not done so in response to the First Payment Claim, simply rejecting to pay “due to no submission of advance payment bond”.6Foot Note 6×Chia’s 1st Affidavit Tab 42 of Exhibit “CKK-1”.It had not done so in response to the Second Payment Claim, opting instead to transmit the LOA to the plaintiff. In fact, it appears that the very first time that the defendant raised this objection was when it sought to terminate the sub-contract thefollowing yearon 27 August 2019. 18 The defendant cannot blow hot and cold in this regard. Given that it had previously, correctly, adopted the view that the 17 October 2018 Email constituted contract acceptance, it cannot now seek to withdraw from that. The “formal” LOA as referred to in the 17 October 2018 Email was exactly that – a formality between parties. This, in no way, detracted from the fact that a contract had already been formed on 17 October 2018. 19 I turn to deal with one final point in relation to the Architect’s approval provided for in the 17 October 2018 Email. I agree with the defendant that,prima facie, and when seen in isolation, this was a condition that the plaintiff had to fulfil before the contract could be said to be properly formed. On the evidence, however, I find that either the defendant had waived this condition, or the Architect had implicitly given its approval. This is patently obvious from the fact that in the very same 17 October 2018 Email, the defendant had requested for the plaintiff to “commence [its] servicesimmediately” [emphasis added]. The plaintiff was also requested to coordinate closely with the defendant’s consultants and project teams, and to submit its project organisation chart and work programme within seven days of the 17 October 2018 Email. These requests would simply not have been possible, and indeed rather presumptuous or ridiculous, if the contract had not been properly accepted, and formed, by then. 20 Even if the condition had not been waived by the defendant, I find that the Architect had implicitly given its approval to appoint the plaintiff as a sub-contractor. In the Architect’s Instruction, the Architect had stated as follows:7Foot Note 7×Chia’s 1st Affidavit p 766. … 7. We last issued our email on 5th August 2019 to register our concern with the progress in the specialist design-and-build scope of works. … 8. Given that no response was received on 19th August 2019, and add to that, the lack of response to the earlier comments given on 10th July 2019 following the preliminary draft catalogue submission (i.e. approx. a month before the checklist was issued on 5th August),pursuant to clause 11.3 of the Conditions of Contract, you are hereby directed to remove this sub-contractor /  specialist without further delay, and replace with immediate effect a suitable sub-contract / specialist for the PFWMS design-and-build works. … [emphasis added in bold] 21 Through the Architect’s Instruction, the Architect thus sought to invoke the relevant clause in the Conditions of Contract to remove the plaintiff as a specialist. It is implicit within this act that the Architect had already accepted that the plaintiffwasthe specialist that needed to be removed. If that had not been the case, the Architect could simply direct the defendant to seek a specialist to carry out the work. It can therefore be taken that the Architect’s approval to initially appoint the plaintiff as a sub-contractor had been obtained. 22 Accordingly, I hold that a written contract, as defined under the Act, existed between the parties. The adjudicator had therefore made an erroneous determination as to his jurisdiction.",
        "Conclusion": "23 For the reasons given above, I set aside the Adjudication Determination on the ground that there was jurisdiction because a written contract existed in the form of the 17 October 2018 Email from the plaintiff. Costs of this originating summons are to be paid by the defendant to the plaintiff, fixed at $5,000 all inclusive. 24 Counsel for the defendant submitted that the costs of $5,778.00 ordered by the adjudicator, being the defendant’s share of costs for the Adjudication Determination, be returned by the plaintiff.8Foot Note 8×Defendant’s Written Submissions para 87.In the circumstances, I find that it is fair that both parties share the costs of the Adjudication Determination. I will therefore not disturb the costs order made by the adjudicator. Lee Seiu KinJudge Nandakumar Ponniya Servai, Tan Yi Wei Nicholas, Daryl Tangand Lee Chuan (Wong & Leow LLC) for the plaintiff; Isaac Tito Shane, Chong Yi Mei and Ning Jie(Tito Isaac & Co LLP) for the defendant."
    }
}