{
    "case_title": "Toh Fong Peng and othersvExcelsior Capital Finance Ltd and others",
    "ncitation": "[2020] SGHC 51",
    "coram": "Kannan Ramesh J",
    "sections": {
        "The parties’ pleaded cases": "5 In this suit, the plaintiffs seek (1) a declaration that the defendants, or a combination of them, are the owners and operators of the Malaysian business; (2) an “Account” of all the plaintiffs’ transactions on the Malaysian business’s “Web Shop(s)” and payment to them of the amount due on the “Account”; and (3) in the alternative, damages to be assessed. 6 The 2nd defendant is Mr Fan Ren Ray and the 4th defendant is Mr Chua Teng Da (also known as Jayern Chua). It is undisputed that they prepared the marketing material for the Malaysian business and the scheme, and also procured the services of third party service providers to design, set up and administer the Web Shop. However, they argue that they did so at the request and on the instructions of the 1st plaintiff. The 3rd defendant, Mr Fan Ruicheng (also known as Bryannz Fan), is the brother of the 2nd defendant. At the close of the plaintiffs’ case, the 3rd defendant made a submission of no case to answer. He therefore did not give evidence at trial. The 5th defendant, Mr Chia Chee Tian Joe (also known as Joe Chia), was the sole director and shareholder of the 1st defendant, Excelsior Capital Finance Limited (“ECF”) until he allegedly resigned on 21 August 2013. 7 The plaintiffs’ case is that all four defendants, or a combination of them, are the owners and operators of the Malaysian business. The Malaysian business operated the scheme in which the participants purchased financial products under overarching oral agreements formed with the Malaysian business. Purchasers of the financial products sold under the scheme would generally be given member accounts on a “web shop”. These member accounts received fixed returns based on the financial products they purchased, and would also earn commission by selling financial products to other customers, who would become the seller’s “downstream” members in the scheme. If certain conditions were met, members also earned commissions based on the fixed returns on financial products purchased by their “downstream” members. The returns and commissions would be credited into an online “E-Wallet” in the “web shop”, and, according to the plaintiffs, could be either cashed out, used to make payments for financial products or transferred to other member accounts. 8 As far as this suit is concerned, the scheme operated on two platforms or “web shops” (see [7] above), which the plaintiffs referred to as the “ECF” and “IOC” platforms. These were two separate websites with two distinct domain names. The parties also referred to these websites as “the online database” or the “web shop(s)” (confusingly, using the term interchangeably in the singular and the plural). Hereinafter, I shall collectively refer to both databases or “web shops” as “the Web Shop”. “ECF” and “IOC” were references to the 1st and 7th defendants, ECF and IOC Group Limited (“IOC”). The plaintiffs’ position is that the Malaysian business was carried out using the names of various entities, such as the ECF and IOC, which were “nominally” the parties that made various agreements with the plaintiffs. The plaintiffs’ case is that ECF and IOC were sham companies with no real business. It is not disputed, however, that ECF itself did not in fact participate in any transactions between the plaintiffs and the Malaysian business. It should also be noted that the plaintiffs have confirmed that they are not making the argument that the corporate veil ought to be pierced in relation to either ECF or IOC (see [14] below), even though that point had initially been asserted in the Statement of Claim. The defendants’ position is that ECF was not a sham company, and that there had been an oral agreement between the 5th defendant (Joe Chia) and the 1st plaintiff pursuant to which the latter was allowed to use ECF for the Malaysian business on the understanding that she would take over the company. The 1st plaintiff failed to do so, and ECF was struck off in 2014. In substance, the defendants’ position is that the Malaysian business and the scheme are owned and operated by the 1st plaintiff. 9 According to the plaintiffs, each of them orally agreed with a representative of the Malaysian business to participate in the scheme. The representative would then be reflected as the “sponsor” of that plaintiff in the Web Shop. Where the 1st plaintiff was concerned, the representative who made the oral contract on behalf of the Malaysian business was allegedly the 2nd defendant (Ray Fan). It is agreed that the terms of the plaintiffs’ participation in the scheme were the same for each of them. However, the plaintiffs’ position is that the 1st and 6th plaintiffs’ initial member accounts were “empty lot” member accounts with no financial products attached to them, and therefore did not receive fixed returns. As pleaded, the 1st plaintiff’s commission for the IOC platform was 20%. While her commission for the ECF platform was initially 20% as well, this was later unilaterally reduced by the Malaysian business to 15% with effect from 1 November 2013, and then to 10% with effect from 1 February 2014. 10 According to the plaintiffs, under the terms of the oral agreement between them and the Malaysian business, the Malaysian business was to: (a) credit their returns from financial products they purchased and the commission from the financial products they sold into their “E-Wallets” on the Web Shop; (b) allow the plaintiffs to utilise their credit balances in the “E-Wallet” to make payments for financial products, transfer balances to other member accounts, or to convert into cash; and (c) maintain accounts and records of the transactions and financial products under the scheme, and to make those records accessible from the Web Shop. 11 The terms of the financial products purchased were ostensibly set out in documents including one titled “International Royal Franchise Agreement”, purporting to be an agreement between the plaintiffs and ECF. The defendants plead that the 1st plaintiff had requested the 2nd and 4th defendants’ assistance in drafting a franchise agreement for the Malaysian business. The 4th defendant explained in his affidavit of evidence-in-chief (“AEIC”) that they (the 2nd and 4th defendants) had been told that the participants in the scheme would each receive a certain number of IRP (which I understand to be a reference to “International Royale Points”, as set out in the “International Royale Franchise Agreement”) each month. The 2nd and 4th defendants then assisted the 1st plaintiff in drafting a franchise agreement. I note, however, that when shown the “International Royale Franchise Agreement” in cross-examination, the 2nd defendant denied having drafted the document. 12 The plaintiffs further claim that certain financial products known as “silver packages” were sold under the scheme. A term of these financial products was that the Malaysian business would procure and provide insurance for 60% of the principal sum paid for the financial products (“the insurance obligation”). This is consistent with the Defence in so far as it states that the defendants had been told by the 1st plaintiff that participants would receive protection for 60% of the franchise fees. The parties’ positions differ only as to whose obligation it was to procure the requisite cover. The plaintiffs further assert that while those who purchased financial products of at least US$10,000 were provided with a document titled “Certificate for Holdings Protection” issued by “Swiss International Trust Company AG”, this document was a sham as such a company did not exist. The claim forms submitted did not result in any payment or substantive response from the supposed insurance provider. On this basis, the plaintiffs claim that the Malaysian business breached its contractual obligations by failing to provide the requisite insurance cover for the silver packages as agreed. 13 As I understand it, the relevant transactions in the present case, such as the ones referred to above, took place outside Singapore. Consequently, the parties did not submit on, and I do not need to be concerned with, the provisions of the Multi-Level Marketing and Pyramid Selling (Prohibition) Act (Cap 190, 2000 Rev Ed). I also note that the defendants do not contend that any agreement between the plaintiffs and the Malaysian business ought not to be enforceable in Singapore by reason of any illegality of the Malaysian business and the scheme under Malaysian laws. I therefore do not consider this issue in this judgment.",
        "The parties’ cases at trial": "14 During the pre-trial conferences before me, counsel for the plaintiffs made it clear that the plaintiffs would not seek the lifting of the corporate veil in respect of ECF or IOC. This was also the plaintiffs’ consistent position at the trial and in closing submissions. The parties are further agreed that (1)eachof the plaintiffs entered into agreements with the Malaysian business to participate in the scheme; (2) the legal owners of the Malaysian business, whoever they are, are the parties which contracted with each of the plaintiffs, and (3) that the terms of each contractual relationship are identical. 15 The defendants’ pleaded position is that the 3rd, 5th and 6th defendants had no knowledge whatsoever of the Malaysian business and the scheme, whereas the 2nd and 4th defendants had limited knowledge on the scheme as conveyed to them by the 1st plaintiff. As such, they do not seek to challenge the substantive terms of the contracts between the plaintiffs and the owners of the Malaysian business in their Defence. The exceptions are the assertions in the Defence that the points credited to the members’ accounts could not be redeemed in cash or to make payment for financial products, and that the members’ commission was to be paid in points and not in cash. 16 Thus, it is common ground that the main issue of fact which needs to be decided is who the owners and operators of the Malaysian business and the scheme are. The parties are content to proceed on the basis that a finding on the ownership of the Malaysian business will be conclusive as to the issue of whom each plaintiff had contracted with as regards the scheme. There is also the consequential issue of determining the terms of the contract.",
        "The plaintiffs’ position on the ownership of the Malaysian business": "17 The plaintiffs’ position is that the defendants, or some combination of them, are the owners and operators of the Malaysian business and the scheme. They rely on the evidence of various witnesses, email and WeChat correspondence, as well as transcripts of various meetings. 18 The plaintiffs’ witnesses testified that the defendants had always acted as though the Malaysian business was theirs. The impression given by the defendants had allegedly been that they operated the Malaysian business through ECF. Therefore, the membersthoughtat the time that they were entering into contractual relationship with ECF, as they were under the impression that ECF was the owner of the Malaysian business and was selling the financial products under the scheme. It later transpired that the real owners of the Malaysian business were the defendants. As noted earlier, the issue of whether the relevant contracts were formed with ECF is moot given the agreement between the parties (see [16] above). 19 The plaintiffs submit that the defendants, as the owners of the Malaysian business, breached the terms of the oral agreement (see [10] above). Specifically, in the case of the 7th plaintiff, he has been unable to make transactions on the Web Shop for the IOC platform since September or October 2013, and has been unable to access the Web Shop since a subsequent date unknown to him. In relation to “the other Plaintiffs” (ie, presumably excluding the 7th plaintiff), they have been unable to access the Web Shop for the ECF platform since 8 September 2014, and have been unable to access the Web Shop for the IOC platform since a date they have not particularised. The Statement of Claim indicates that “[s]ince sometime in January 2014the otherPlaintiffs have not received the cash values of their redemptions on the ‘ECF’ platform” [emphasis in original]. In other words, these were redemptions made before 8 September 2014, when the plaintiffs still had access to the Web Shop. Presumably, this again excludes the 7th plaintiff. The pleaded position is slightly different from that taken in the 1st plaintiff’s AEIC, which was that the plaintiffs had not received the cash value of their redemptions since sometime in February 2014. According to the plaintiffs, the Malaysian business has further failed to give the plaintiffs the benefit of the fixed monthly returns owing under the financial products since access to the Web Shop was cut off.",
        "The defendants’ position on the ownership of the Malaysian business": "20 It is notable that there was a network marketing businessin Singapore(“the Singapore business”). It is also notable that counsel for the defendants accepts that the defendants are the owners of the Singapore business. However, they assert that the Singapore business is distinguishable from the Malaysian business and the scheme. Their position is that the latter is owned and operated by the 1st plaintiff. On their case, the contracts that are in issue were therefore entered into between the 1st plaintiff and the other members of the scheme (ie, the other plaintiffs). 21 Accordingly, the defendants’ main argument is that they were never the owners and operators of the Malaysian business or the scheme. The 3rd and 5th defendants allegedly did not have knowledge of the Malaysian business or the scheme, while the 2nd and 4th defendants’ knowledge was limited. The position of the latter two individuals was essentially that their involvement in the scheme was limited to carrying out the 1st plaintiff’s instructions and that what they knew of the scheme had been conveyed to them by the 1st plaintiff. 22 The defendants argue that the plaintiffs have not proven their case against the 2nd, 4th and 5th defendants on a balance of probabilities, and have not established aprima faciecase against the 3rd defendant. For reasons that are not clear, the plaintiffs relied on the same affidavits filed in their application for a Mareva injunction as their AEICs for the trial. That application had been dismissed, and the defendants argue that it would follow that the plaintiffs have failed to adduce sufficient evidence to discharge their burden of proof. Further, they argue that the evidence of one of the plaintiffs’ witnesses, Mr Wong Kok Hao Gabriel (“Mr Wong”), is irrelevant as he has no specific knowledge of the Malaysian business. His evidence in court pertained to the Singapore business, which is “distinct, different and unrelated” to the subject matter of the present suit. In any event, it is alleged that Mr Wong is not a neutral witness. 23 The defendants argue that the 1st plaintiff gave inconsistent accounts as to who the owners and operators of the Malaysian business are. While she claimed in a police report filed in Malaysia that she had been recruited by the 2nd, 3rd and 4th defendants, the police report she subsequently filed in Singapore referred only to the 2nd defendant. Neither report mentioned the 5th defendant. The defendants also submit that the 1st plaintiff’s evidence in cross-examination on the operator of the Malaysian business, as far as the IOC packages were concerned, pertained to the 2nd defendant alone. The claim against the remaining defendants must therefore fail. 24 The defendants then suggest that the evidence of the plaintiffs’ other witnesses is unhelpful or irrelevant. The evidence given by the 2nd plaintiff is “pure hearsay” as he does not have personal knowledge as to who the owners and operators of the Malaysian business are. Also, the 2nd plaintiff was not consistent as he agreed under cross-examination that it was “possible” that the 1st plaintiff was the owner of the Malaysian business since she had been able to create new accounts and provide “PINs” to other members. The 4th plaintiff’s evidence on the ownership of the Malaysian business had been given based on his belief that whoever gave the presentations on the financial products sold under the scheme was the owner of the Malaysian business. The 5th plaintiff is not a credible witness since he had admitted under cross-examination that a paragraph in his AEIC (on a training session allegedly conducted by the defendants) was untrue. The 6th plaintiff had no knowledge as to who the owner and operator of the Malaysian business was. 25 The defendants submit that the evidence instead shows that the 1st plaintiff is the owner and operator of the Malaysian business. Various allegations had been made against her in a WeChat group, including that “ECF [was] founded and started by [her]”. In their submission, it is “telling” that she did not reply to challenge the assertion in these messages even though she was a member of the WeChat group. The defendants also claim that the documentary evidence shows that the 1st plaintiff had been given “all administrative access”, had given instructions to ecfmarkets@gmail.com, had instructed the 2nd and 4th defendants to engage an IT services provider to design, set up and administer the Web Shop, and had effected payment to a customer. These show that the 1st plaintiff is the owner and operator of the Malaysian business. As such, the defendants did not receive any form of investment or money from the plaintiffs. 26 The defendants further submit that the failure to gain access to the Web Shop was due to the failure of the 1st plaintiff to effect payments to the IT services provider. The 4th defendant testified that access to the Web Shop was terminated in the second half of 2014 as a result, possibly in September 2014. The Defence states that the 2nd and 4th defendants had assisted the 1st plaintiff with procuring the services of the IT services provider, but had no obligation or responsibility to effect payment. This follows from their central position that the 1st plaintiff is the owner and operator of the Malaysian business, and the IT services provider had been retained by them at the request and on the instructions of the 1st plaintiff. In cross-examination, however, the 4th defendant accepted that their company, MDF Capital Limited (“MCL”) was obliged to pay the IT services provider but did not do so in full.",
        "My decision": "27 As I indicated above, the parties are in agreement that the main issue to be decided is the ownership of the Malaysian business. There is no dispute that the owners and operators of the Malaysian business owned and operated the scheme. In the course of my analysis, I also address what counsel for the defendants described as “probably the only other issue”,ie, whether ECF and IOC were sham companies or “fronts” for the defendants. 28 Two preliminary points should be noted at the outset. First, the defendants argue in their written closing submissions that the contracts lack certainty even as to essential terms. However, counsel for the defendants confirmed at the oral closing arguments on 3 October 2019 that the defendants werenotrunning the alternative case that, in the event the defendants were found to be the owners and operators of the Malaysian business and the scheme, the contracts were not enforceable or ambiguous. Second, while the defendants also argue in their written closing submissions that “the purchasers of the various … packages, clearly did not have any intentions to create legal relations with [the defendants]”, this contradicts theirexpressstatement that “[w]hoever the court finds to be the legal owner of [the Malaysian business], it will follow that that person is the contracting party”. I therefore do not address either of the above issues pertaining to the certainty of terms or the formation of these contracts in this judgment.",
        "The owners and operators of the Malaysian business": "29 As I indicated above, I am persuaded that the defendants are the owners and operators of the Malaysian business and the scheme. 30 I begin with an observation on the emphasis placed by the defendants on the plaintiffs’ failure, on the AEICs before the court, to obtain a Mareva injunction. The defendants argue that the plaintiffs’ failure to demonstrate that they had a good arguable case and a valid cause of action against the defendants at that stage means that they cannot now prove their case on a balance of probabilities (with regard to the 2nd, 4th and 5th defendants) or make out aprima faciecase against the 3rd defendant. This was since the plaintiffs had re-filed the same set of affidavits that had been filed in support of their application for a Mareva injunction as their AEICs at trial. This argument is unpersuasive. If the defendants’ submission is correct, I would have expected all of them to make a submission of no case to answer. However, only the 3rd defendant did so. I discuss his submission of no case to answer at [68] below. The 2nd, 4th and 5th defendants elected instead to give evidence, suggesting that, in their view, aprima faciecase had been made out against them, shifting the evidential burden to them. 31 In any case, the plaintiffs’ application for a Mareva injunction had been dismissed on the basis there were “severe gaps” in the Statement of Claim. I note that some amendments were made to the Statement of Claim since then. Even though these amendments do not address all of the concerns that had been raised by the court which heard the application for a Mareva injunction, the analysis I have to conduct is slightly different from that before the Judge who heard that application. For example, although one of the concerns then was that the Statement of Claim did not plead the dates of the oral agreement between each of the plaintiffs and the Malaysian business, this issue has now been resolved by the agreed position between the parties that oral contracts had been entered into in each case on identical terms. On this basis, I can simply go on to consider what the terms of these contracts were based on the evidence available. Furthermore, I now have the benefit of hearing the witnesses’ evidence at trial. This would include the evidence of the 2nd, 4th and 5th defendants, which, as I explain below at [68], can be taken into account in deciding whether aprima faciecase has been made out against the 3rd defendant as well. 32 That being said, I do not wish for a moment to suggest that it was sound litigation strategy for the plaintiffs to have simply relied on their Mareva injunction affidavits in the trial as their AEICs. It is not entirely clear why this strategy was adopted and counsel for the plaintiff did not offer an explanation. The record indicates that two extensions of time had been granted by the court to allow the plaintiffs to file their AEICs, with the second extension being coupled with an unless order. This appears to have resulted in the affidavits that had been filed in support of the application for a Mareva injunction being hurriedly filed as the plaintiffs’ AEICs. As I will explain at [81]–[83] below, this was a questionable decision which ultimately adversely affected the plaintiffs’ ability to prove at least part of their case. 33 A number of concessions were also made by both parties. Crucially, counsel for the defendants conceded that the defendants are the owners of the Singapore business (see [20] above). The defendants attempt to distinguish between the Malaysian business and the Singapore business. However, this is a distinction of convenience, not one of substance. I accept the plaintiffs’ submission that the Singapore and Malaysian businesses are simply different branches of the same business. This was also Mr Wong’s testimony: while he stated that he was part of the Singapore “network”, which was distinct from the network in Malaysia and China, he also testified that these were “all under the same business”: Court: So you’re not part of the Singapore network? … Witness:  No, I was not part of the---I was not part of the Malaysian network. I was part of the Singapore. … Q So just to confirm, Mr Wong, the phrase or the word “network” used in paragraph 6 refers to the network marketing business network that is run by Ms Toh in Malaysia and other countries. Right? A I don’t---I don’t think that’s how I would put it. Q So how would you put it, then? AI believe the word “network”---to us, “network” is just whoever that is referred, you know, by our network. Q So basically--- AYah, but we are all under the same business. That---to my understanding, we are all under the same business. Q So this network that you’re referring to is a network that is owned and operated by Ms Toh. Is that your evidence then? ANo, I always believed that the network---the network marketing business has always been owned by the defendant. Q But so far as the network marketing business that is in Malaysia and China, which is under Ms Yvonne Toh, you were never a part of that network. Correct? A Yes. Q So you would not have specific knowledge on the ins and outgoings of that particular network because your knowledge would be purely limited to the network in Singapore, which is a distinct network altogether. Correct? A Yes. [emphasis added] 34 Read in context, Mr Wong was in fact distinguishing between a “network” and the “network marketing business”, the former being a subset or branch of the latter. I therefore do not understand his evidence that the Singapore and Malaysian networks are “distinct” to be inconsistent with the finding that these are different facets of the same business, owned and operated by the same individuals. That the Singapore and Malaysian networks are part of the same business is also indicated by the 1st plaintiff’s evidence. In her AEIC, she states that the 2nd defendant had assured her that the point balances in the “APG reit” platform could be used for the “IOC” platform. In context, it is clear that this reference to the “IOC” platform is a reference to part of the scheme under the Malaysian business. The parties appeared to accept at the trial that the “APG” business was part of the Singapore network. The fact that a member’s point balances could be transferred between the APG and the IOC platforms is therefore suggestive that the Singapore and Malaysian networks (ie, what I refer to as the Singapore and Malaysian businesses in this judgment) are part of the same business. 35 Moreover, tellingly, the 2nd defendant stated in a presentation on 6 December 2013 that: “wealready done [sic] this business inSingapore, China,Malaysia, then we are in Thailand, Korea…” [emphasis added]. The 2nd defendant testified that the business being referred to was “Cuffz Holdings” as he was representing that company when speaking on stage, and that he was there to present a program referred to as the “DPP program” – and not to represent the Malaysian business. In doing so, the 2nd defendant was attempting to distance himself from ECF, which is a part of the Malaysian business (see [8] above). This is a characterisation which the speech, read as whole, cannot bear: the 2nd defendant clearly referred to ECF as one of three companies which “we got” and which “we” were going to promote. He then made announcements about ECF and the “silver packages”, which were sold under the scheme. Hence, when the 2nd defendant referred to “this business” in his presentation, he must have been referring to the business that ECF was involved in. Therefore, the 2nd defendant’s presentation on 6 December 2013 suggests that the Singapore and Malaysian businesses are one. 36 I also considered the manner in which the 1st plaintiff was portrayed in the correspondence sent by ECF: for example, in the letter sent by ECF dated 2 September 2014, the “Roles and Responsibilities” for running ECF were split into “Management” and “Country Master Franchise”, and the 1st plaintiff’s name was indicated next to thelattercategory. This letter also criticised the 1st plaintiff for not lending her “full support” to the business. I find it unlikely that she would have been described in this manner or criticised for not lending support to the Malaysian business if she is in fact its owner. 37 In contrast, I am not aware of any evidence that shows the Singapore and Malaysian businesses are owned by different individuals. The defendants appear to rely primarily on Mr Wong’s evidence, which, as I have indicated at [34] above, does not support the defendants’ position. In any event,even ifthe Singapore and Malaysian networks are separate businesses, the fact that very similar schemes were run with the involvement of a similar group of people, together with the evidence outlined above, would still be probative of the fact that the Malaysian business isalsoowned and operated by the defendants. 38 At this juncture, I note that it isnotsuggested by any party that the 1st plaintiff might be a co-owner of the Malaysian business together with any of the defendants. At the same time, it is also important to note that the defendants do not assert that the 1st plaintiff has any stake in the Singapore business. In short, the defendants proceed on the basis that the evidence suggests that the 1st plaintiff, and not the defendants, is the owner of the Malaysian business, with the converse being true as regards the Singapore business. The defendant’s position is thus binary. 39 In this regard, the defendants place emphasis on that the fact that the 1st plaintiff had not responded to the allegations made against her in the WeChat group around 26 September 2014, in particular that she owned the Malaysian business (see [25] above). However, this is not indicative one way or another of ownership. For example, the 4th defendant agreed when cross-examined that it would be natural for the 1st plaintiff to choose not to do so if she felt so aggrieved with the defendants that she filed police reports on 14 September 2014 and 3 December 2014 against some of them (see [23] above and [43] below). Given that the 1st plaintiff had made a police report against some of the defendants on 14 September 2014, her silence during the WeChat conversation on 26 September 2014 is explicable. In any event, her subsequent police report on 3 December 2014 speaks to her position. Further, in context, much of the anger from the other participants in the WeChat group was not directed at the 1st plaintiff, but instead primarily at the 2nd defendant. It could therefore be said that there was little need for the 1st plaintiff to respond to the allegations. I note also that some of the messages sent did not clearly indicate that the 1st plaintiff was the owner of the Malaysian business, and could instead be taken to suggest that her role was managerial or administrative in nature. For example, one message sent by the 2nd defendant read: YT [referring to the 1st plaintiff] is supposed to update u all on all new out come and doing. This is her job not our.I do the business she handle the network. So look for the right person for the right answer. [emphasis added] 40 It is also unclear whether the allegation that “ECF [was] founded and started by [the 1st plaintiff]” (see [25] above) was a reference to the 1st defendant, which had in fact been incorporated by the 5th defendant, or to the “ECF” platform. The lack of response by the 1st plaintiff to these messages therefore appears to be a poor indicator of the truth of the allegation that the owner and operator of the Malaysian business was the 1st plaintiff, particularly when weighed against the evidence as a whole. In any event, given the similarities referred to at [37] above, it simply does not stand to reason why different persons would own and operate the Malaysian and Singapore businesses. 41 I turn now to examine the evidence that relates to each of the defendants individually. The 2nd and 4th defendants 42 The defendants argue that the 1st plaintiff’s evidence on who the owners of the Malaysian business are is inconsistent. While the plaintiffs’ position is that the defendants (or some combination of them) are the owners and operators of the Malaysian business, the 1st plaintiff’s evidence in cross-examination, at least according to the defendants, was that the only operator of the Malaysian business was the 2nd defendant. On this basis, the defendants argue that the claim against the 3rd, 4th and 5th defendants must fail. Apart from this submission not assisting the 2nd defendant, I do not think this is a fair characterisation of the 1st plaintiff’s evidence. She testified as follows: Q … And would I be correct to state that for all these plaintiffs, the packages for IOC would have been marketed and sold by you? Would you agree to that statement, Ms Toh? And to clarify, the IOC package I’m referring to is the IOC convertible bonds. A Sold by me butunder the operator of Mr Ray Fan[sic]. [emphasis added] 43 Subsequently, the 1st plaintiff further testified that the 2nd defendant was “the one who [sic] holding the power”. Perhaps as a result, the 2nd defendant was named in the police report filed by the 1st plaintiff with the Singapore Police Force on 3 December 2014 (“the Singapore police report”): Somewhere in April 2012 I sign up for a Multi-Level Marketing Scheme in Kuala Lumpur with one Singaporean by the name of Fan Ren Ray … from IOC Group Limited. He offered me to sign up for the … [packages] and bring in more people to sign up for packages with the company. 44 While the 1st plaintiff may have placed more emphasis on the role played by the 2nd defendant, it is clear to me that this was not done to the exclusion of the other defendants. The 1st plaintiff in fact stated in cross-examination that while the 2nd defendant held the most power and the largest share in the Malaysian business, “all the five defendants” were owners of the Malaysian business. I understand the reference to “all the five defendants” to mean the 2nd to 6th defendants. She further explained that by identifying the 2nd defendant in the Singapore police report, she had intended to make the point that it was he who had introduced her to the scheme (see the excerpt at [43] above). That the 1st plaintiff did not intend to limit the allegation to the 2nd defendant is apparent from her earlier police report filed in Malaysia on 14 September 2014. There she identified the 2nd, 3rd and 4th defendants as the individuals who had recruited her to work with the scheme, and the individuals she had paid substantial amounts of money to. I do not agree with the defendants’ argument that the subsequent failure to identify these individuals in the Singapore police report is a material discrepancy. This omission is consistent with her evidence that the 2nd defendant is the principal player behind the Malaysian business even if the other defendants are also owners and operators of the Malaysian business. 45 In any event, as is clear from the rest of this judgment, my decision does not rest solely on the evidence of the 1st plaintiff. The 2nd plaintiff explained that his basis for stating that the defendants appeared to be the owners of the business was that he had approached the 2nd, 3rd and 4th defendants whenever a decision had to be made, or when he had questions that needed answers. His testimony was in fact that the1st plaintiffhad told him to do so when he approached her with questions. In assessing the 2nd plaintiff’s evidence, the defendants emphasise the fact that he had agreed under cross-examination that it was a “possibility” that the 1st plaintiff was one of the owners and operators of the Malaysian business. The 2nd plaintiff said this when cross-examined on two emails dated 4 and 5 April 2013 sent to the 1st plaintiff by the 4th defendant. The 2nd plaintiff’s concession has no evidential value as the emails were not sent or received by him. He was merely offering his view as to how the emails should be construed, which is evidentially irrelevant. The proper interpretation of the emails is a matter for the court. The email dated 4 April 2013 reads: Dear Yvonne Please use the below admin account to do account placement. Admin side can create new member with Zero BV and Zero Amount by choosing Member Type as VIP Members similar to the way its working in other projects. See below screenshot for the details: [Screenshot] And new staff account is created online with permission to see Top down and create new account. Login: … Pwd: … 46 The defendants argue that this email shows that the 4th defendant had given the 1st plaintiff the login and password to create accounts in the Web Shop. According to the defendants, the 1st plaintiff had full control over the creation of accounts, and all “admin creation of accounts” had been done by her. To my mind, this isnotwhat is suggested by this email, which clearly focuses on the creation of accounts forVIP members. This is consistent with the 1st plaintiff’s explanation of the email, which was that she had been authorised to create “0BV” accounts, which were accounts intended for people who were able to attract customers to the scheme. Seen in this light, I do not think that the email suggests that the 1st plaintiff was the owner of the Malaysian business. The same can be said of the 5 April 2013 email from the 4th defendant to the 1st plaintiff, in which he informed her that he had issued her with “PIN[s]” for account placement. I do not see how this indicates that the 1st plaintiff is theownerof the Malaysian business: at best, it shows that she played an administrative or leadership role in the scheme, which I do not understand to be in dispute. In fact, these emails suggest that the 4th defendant was involved in the operations of the Malaysian business. It is difficult to see how the 4th defendant can say otherwise given that he was issuing an “admin” account and PIN details to the 1st plaintiff for account placements. Moreover, if the 1st plaintiff was the owner of the business, she could surely have arranged for the IT services to be provided, rather than have the 4th defendant do so. For the reasons I discuss at [54] below, I find the 4th defendant’s assertion that he had engaged the IT services provider on the 1st plaintiff’s behalf to be untruthful. 47 On the other hand, the evidence shows that the 2nd and 4th defendants had acted as though they were owners of the business. The 2nd defendant appeared to accept this in cross-examination: he agreed that the defendants had done everything for the Malaysian businessas thoughthey were the owners, but his defence was that they had in fact done those things on the 1st plaintiff’s request. This begs the question why they would agree to do so. I can see no credible reason. I consider this at [52] below. 48 Indeed, the evidence is clear that the 2nd defendant conducted himself as if he was the principal player. This is most clearly seen through the various transcripts in evidence. As I indicated above at [35], the transcript of the 2nd defendant’s presentation on 6 December 2013 shows the 2nd defendant giving a presentation on the “silver packages” sold under the scheme. The manner in which the 2nd defendant spoke about the Malaysian business was suggestive of ownership. For example, he said that: Whenwe start this businesslast year,wehave started a lot of investment portfolio before, for the past 5 years.Wedecided to venture into silver. Silver wasn’t something very positive in the start …I gotanother companythe---the guys from Chiba(?) tell me silver is bad, gold is good. … [emphasis added] It is further telling that at this event, the 2nd defendant credited the 2nd plaintiff and the 4th defendant for “bringing him [t]here”, with no reference to the 1st plaintiff. 49 Another meeting was held on 25 February 2014, by which time there had been difficulties in making payment to the members of the scheme. The 2nd defendant conducted the meeting and spoke about the need to process payment in batches. He agreed that he had given the members the impression at this meeting that the projects involved him and the responsibility to make the payments was his. He testified that he had done so because he had a close relationship with the 1st plaintiff at the time, even thinking of her as a sister. I do not accept his testimony for the reasons explained in [52] below. Also, the 4th defendant had interjected to say that recordings of the meeting were not necessary, and that they (the 2nd and 4th defendants) would be sending out an official memo. It is therefore clear that the 2nd and 4th defendants were conducting the meeting on behalf of ECF. This was in fact reflected in the minutes prepared by the 4th plaintiff and Marianne Chai, in which the 2nd to 4th defendants were described as representatives of ECF. In contrast, the 1st plaintiff was listed amongst the other attendees, who were members of the Malaysian business. It is significant that the 1st plaintiff played no part in the entire proceedings and was instead seated in the audience with the rest of the members. 50 These events should also be seen in the light of the assurances made by the 2nd defendant at a further meeting held on 8 July 2014: MALE SPEAKER5:  Okay. Okay. Then I ask you question ah, like we got---we come here for ECF, after we receive so many (inaudible) already we are all happy lah. But ECF, if have (inaudible), maybe ah, the insurance company don’t pay the 60%. Will the company--- … DATO SRI:  The---the---that one---that one won’t happen. MALE SPEAKER5:  If. DATO SRI:The insurance company don’t pay I pay. [emphasis added] 51 “Dato Sri” was the 2nd defendant. When cross-examined on these words, the 2nd defendant hemmed and hawed: Q You are saying that insurance company would pay that’s why you are certain. You then made this proposal to offer to pay. A Definitely. If not, why should I say that? Q Because you were the owner of ECF silver. AIf I’m the owner, of course I won’t say that. … Court: That’s a question to you. Why would you make that promise if it’s not your prop---if not your business? Witness: My answer is I told the insurance will pay that’s why I give such a commitment. If not, I would not have given such a commitment. Q But even then, Mr Chua---sorry, Mr Fan, even then, why make a commitment if you have no interest in the business? A I’ve interest. If they carry on selling my DPP programme, I will make money. Q This---you’re giving your promise of payment. So would you have honoured this promise to pay? … A It’s---it’s a sentence to bring close to them, to give them confidence. Q No, my question: Would you have honoured that promise? A Based on ability,if I’m the owner, definitely I would pay if have the---I havethe ability. Q No, you made a promise to them. Would you have honoured it? A No, this is just a statement.It’s not a promise. This is a joke. … Q Okay. So you’re saying that you would not have honoured this statement that you said you would pay? AIf it’s my responsibility, I would pay. Q No, no,would you have honoured it? AIf I have the ability. QSo you’ll honour it if you have the ability? AI’ll honour if it’s my responsibility. Q But you made the assurance that you would pay. So that was untrue, correct? You had no intention to pay? A The insurance is supposed to pay. Q No, no, no. When you made that statement, you had no intention to make payment? A I made that statement because I believe that the insurance would pay. … Court:But that statement is not on the basis the insurance will pay. It’s on the basis---or it assumes the insurance does not pay. Witness: Yes, Your Honour. Court:So the question is whether you meant what you said. Witness:I meant what I said. It’s because I believe that the insurance would pay that’s why I commit to such a commitment. … Court: My question is: This statement says---states that the insurance---if the insurance company does not pay, you will pay. Witness: Yes. Court: That’s what it says, right? Witness: Yes, Your Honour. Court: So in the event insurance company does not pay, you’ll pay. That’s what it means. Witness: Yah, to that male speaker, yes. Court: So the question is:Did you mean it? Was this truthful? Witness:To---to the male speaker, yes. [emphasis added] In my view, the 2nd defendant’s prevarication on this issue affects his credibility as a witness. I infer that the 2nd defendant refused to give a straight answer to this simple question because he had no desire to tell the truth. 52 The 2nd defendant further testified that his intention at the 8 July 2014 meeting was to protect the 1st plaintiff. I find his evidence difficult to accept. If his knowledge of the Malaysian business was as limited as he claimed, it is inconceivable that he would have made this promise, especially to a roomful of investors who were riled up about not receiving the payments due to them. His explanation that he was focused on ensuring that they were able to promote another programme (the “DPP” programme) is untenable. The very suggestion that the 2nd defendant was prepared to take responsibility for the 1st plaintiff’s liability to procure the requisite insurance cover so that the defendants could sell another package to these same angry investors beggars belief. The overall impression that arises from these transcripts is that the 2nd – and, to a lesser extent, the 4th – defendants portrayed themselves as the persons responsible for the Malaysian business and its liabilities. In my view, the reason the 2nd defendant had done so was because he was in fact one of the owners and operators of the Malaysian business and the scheme. The same can be said of the 4th defendant. 53 It is not disputed that the 2nd and/or 4th defendants drafted a franchise agreement for the Malaysian business and also engaged an IT services provider, Blissful Infotech Solutions Pte Ltd, to set up the Web Shop. The 2nd defendant testified that the 4th defendant had been in charge of providing these services, and that his own role was instead to handle various projects. On the other hand, the 4th defendant’s position appears to be that the 2nd defendant was also involved in the process of setting up the Web Shop. In gist, the 4th defendant claims that he and the 2nd defendant had engaged the IT services provider on the 1st plaintiff’s instructions, and that they had later invoiced the 1st plaintiff for these services together with further charges for administrative services and work done on design and marketing materials through MCL, a company they owned. According to the 4th defendant, the first invoice, dated 1 September 2013, was paid in cash, but the second invoice, dated 1 March 2014, was not paid. The 1st plaintiff’s position was that she had not seen these invoices prior to the commencement of the present suit. 54 The defendants rightly note that the two invoices, if accepted as authentic, would add weight to their defence. It is unlikely that the defendants would have been entitled to invoice the 1st plaintiff for the IT services and other work if they were themselves the owners of the Malaysian business. I, however, have difficulty accepting that these invoices were genuine. The 4th defendant’s position was clearly and conveniently designed to make it impossible for there to be any evidence that would show that the invoices had been received by the 1st plaintiff, or that payment had in fact been made on the first invoice as he claimed. Initially, the 4th defendant maintained that MCL had no bank account and no accounting records. This is a completely inexplicable position. He later conceded that this was simply illogical, and there would have been records of the invoices kept by MCL’s staff. However, he did not produce those records. He also claimed that MCL had not entered into a formal contract with Blissful Infotech Solutions Pte Ltd. Instead, the scope and terms of the agreement, as well as the eventual invoice, were apparently conveyed over WeChat. These were said to be irretrievable as the 4th defendant had changed his phone. This was all unbelievable and very convenient. The effect is that there is no evidence that the invoices had been issued to the 1st plaintiff as the 4th defendant claims. I do not believe that the 4th defendant’s evidence is honest and therefore do not accept that the two invoices are genuine. 55 Further, the 1st plaintiff stated in her AEIC that the 2nd defendant had asked her for help in applying for corporate credit cards. This is corroborated by the email correspondence she produced, which shows that the 4th defendant had written to “Jef Ooi” stating that he had learnt from the 1st plaintiff of the “payment gateway solutions” provided by Mr Ooi: Dear Jef Through [the 1st plaintiff’s] recommendation, I have come to know about Ezybonds merchant system and payment gateway solutions. We are very interested in the services you can provide and is currently looking to secure minimum 1000 debit cards. Kindly hope that you can provide me with more information regarding this services. … 56 The 4th defendant subsequently indicated his interest in registering the 7th defendant as a merchant in the system run by Mr Ooi. An email he sent Mr Ooi on 9 May 2012 stated that he would make arrangements with the 1st plaintiff for payment to be made to Mr Ooi. When asked to provide a valid email address and mobile number for registration, he provided his own email address via email on 21 May 2012. More significantly, Mr Ooi sent the 4th defendant an email on 29 May 2012, which read: Please be advise, the merchant will have a card register under it. This card will be holding by the company accounts dept or the owner. I will suggest you provideyour boss/owner detailsand he will keep the card, because the money can go to the card for withdrawer. [emphasis added] 57 The 4th defendant responded by providing the 2nd defendant’s details. This signalled the 4th defendant’s belief that the 2nd defendant was the “boss/owner”. As a whole, the email correspondence between the 4th defendant and Mr Ooi corroborated the 1st plaintiff’s evidence that she had been assisting the 2nd and 4th defendants by introducing them to Mr Ooi. There is no indication in these emails that the 1st plaintiff played a larger role; in contrast, the 2nd and 4th defendants appeared to be the decision-makers. 58 I make a few observations on one further point. The plaintiffs’ position is that ecfmarkets@gmail.com was the 4th defendant’s email address, and that ioc.mgt@gmail.com was the 2nd defendant’s. The defendants’ position is that ecfmarkets@gmail.com was the email address used by the IT helpdesk, and that ioc.mgt@gmail.com was used by one Mr John Chan. In my view, the ownership of these email addresses is not material as there is no clear indication that access to these email accounts was confined to the owners of the Malaysian business only. 59 Nevertheless, the defendants argue that the 1st plaintiff had sent instructions to ecfmarkets@gmail.com, which indicated she had the authority to do so as the owner of the business. In my view, none of these emails in fact demonstrates that the 1st plaintiff was providing instructions, as opposed to merely reporting what had taken place (as the 1st plaintiff claims). Two possible exceptions are the email sent by the 1st plaintiff on 7 May 2013, in which she simply said “pls transfer additional for ho and his downline”, and the email dated 18 July 2013 in which the 1st plaintiff apparently asked for the requests from two members to withdraw money to be rejected. While these can be construed as instructions issued by the 1st plaintiff, they could equally have been requests or suggestions, as opposed to instructions given as the owner and operatorof the Malaysian business. I also have to weigh these documents against the rest of the evidence. This would include an email sent from ecfmarkets@gmail.com on 26 January 2014, in which the 1st and 2nd plaintiffs’ roles were described as that of “market leaders” who were to “collect funds from the market” while the management’s role was to “support all operations and secure good deals”. As noted earlier, it is not disputed that the 1st plaintiff was a senior member of the scheme and played a leadership role as such. This email is consistent with that and does not suggest more. 60 The effect of the foregoing is that it is far from clear, on the email correspondence before me, that the 1st plaintiff was the owner and operator of the Malaysian business. Given the nature of the business, it would not be surprising for someone like the 1st plaintiff, as one of its leaders, to have made requests or given suggestions to those running the business in respect of the affairs of more junior members. This then has to be seen in the light of the evidence, highlighted in the remainder of this judgment, which suggests that thedefendantsare the owners of the Malaysian business. (1) Whether payment was received 61 I turn now to the question of whether any payment had been received by the 2nd and 4th defendants. As I indicated to counsel in the course of closing submissions, this is a clear indicia of ownership. 62 The defendants’ position is that they had not received any investment or gold from the plaintiffs. One exception appears to be an occasion referred to by the 4th defendant, when the 1st and 2nd plaintiffs had handed to him and the 2nd defendant gold bars as payment for them to purchase silver collectibles on the 1st and 2nd plaintiffs’ behalf. In contrast, the 1st and 2nd plaintiffs testified that they had handed over large quantities of gold to the 2nd and 4th defendants. The 6th plaintiff testified that he had on occasion handed gold to the 2nd defendant or staff authorised by him, but that the majority was handed to the 4th defendant. The 6th plaintiff also tendered documents which he claimed had been signed by the 4th defendant in acknowledgement of the gold received by the latter (“receipts”). The 4th defendant’s position was that he had never signed the documents, or received any of the gold. If such payments had indeed been received by the 2nd and 4th defendants, that would be a strong indication that they are the owners of the Malaysian business. 63 In fairness, the plaintiffs’ evidence on this point is not without difficulties: there is some variation in what purports to be the 4th defendant’s signature in the documents adduced. Nevertheless, as the plaintiffs rightly note in their submissions, these receipts were reflected in the plaintiffs’ list of documents dated 23 October 2016, which was filed pursuant to O 24 r 1 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed). These receipts were described as “7 acknowledgements in writing signed by Jayern Chua acknowledging the receipt of Gold”. Jayern Chua is a reference to the 4th defendant. No notice was filed by the defendants under O 27 r 4(2) of the Rules of Court, and they are therefore deemed to have admitted to the authenticity of the documents under O 27 r 4(1). The receipts are also described in the agreed bundle as “[a]cknowledgements in writing signed acknowledging the receipt of Gold”. The parties have therefore agreed to the authenticity of the documents in the agreed bundle. The defendants cannot expect the court to then conclude, to the contrary, that the signatures were inauthentic. 64 The 1st plaintiff also testified that around US$13m in gold and a further US$50,000 had been given by the 2nd plaintiff and her to the 2nd defendant and his representatives. Some of the money was said to have been transferred via telegraphic transfer. However, no documentary evidence was produced to support this assertion. This certainly casts some doubt on whether her assertion that she had transferred these monies to the 2nd defendant was true, and also on her credibility in general. I took this into account in considering whether, on a balance of probabilities, it is more likely than not that the 2nd defendant had received the monies invested in the scheme as one of the  owners and operators of the Malaysian business. Nevertheless, this should be considered in the context of the other evidence above which demonstrates that he is an owner and operator of the Malaysian business, as well as the evidence which shows that the 4th defendant had received gold from the scheme. On balance, I find that the 2nd and 4th defendants had received the payments for investments in the scheme as owners and operators of the Malaysian business. The 5th defendant 65 Turning to the 5th defendant, I note that the 1st plaintiff stated candidly in her affidavit that she believed the 5th defendant might have been a “small player” in the Malaysian business. Indeed, there is comparatively less evidence showing that the 5th defendant is an owner and operator of the Malaysian business and the scheme. On the balance of probabilities, however, I am similarly persuaded that the plaintiffs have proven their case in respect of him. This is primarily because I have found that the Malaysian and Singapore businesses were essentially two parts of the same business, and therefore have the same owners and operators. It is not disputed that the 5th defendant is one of the owners and operators of the Singapore business (see [20] and [33] above). 66 Further, I note that the 5th defendant was also the sole director and shareholder of ECF, at least in 2012. He claimed to have paid US$20,000 to register ECF and obtain a financial services licence. The question that arises is why the 5th plaintiff would have allowed his company to be used in the scheme if he did not have a stake in the Malaysian business. His explanation appears to be that ECF had been a dormant company in 2013, and that he had agreed to let the 1st plaintiff use the company to market the Malaysian business provided she eventually paid for the shares. Notably, there was not a shred of documentary evidence, let alone an executed contract, which evidenced this. The 5th defendant explained that this was because the agreement was verbal, which I have difficulty accepting. On his own evidence, he had not known the 1st plaintiff well, and did not even have her contact information, such as an email address or contact number. Yet, he was able to accept such a loose arrangement on the use of the company and the transfer of and payment for the shares. Furthermore, the ownership of ECF could have been transferred easily. The 5th defendant was asked in cross-examination why the transfer of ECF was not effected immediately. His answer was that while he had asked the 1st plaintiff on several occasions as to when the transfer ought to take place, she did not give him a definite answer. I do not believe the 5th defendant’s explanation. It seems contrived to suggest that the 5th defendant would accept a response such as this from a person (the 1st plaintiff) with whom he had little familiarity. There are other difficulties with the 5th defendant’s evidence. The 5th defendant testified that in return for having ECF transferred to her, the 1st plaintiff only had to pay a total of US$8,000. Yet, ECF was a company that the 5th defendant had paid US$20,000 to incorporate, and was recorded as having a paid-up capital of £100,000. Moreover, if his evidence is to be accepted, up to seven other people had already committed to putting US$100,000 each into ECF, including the 2nd, 3rd and 4th defendants. It does not stand to reason that the 5th defendant would have agreed to sell his equity to the 1st plaintiff at a price well below cost or book value – particularly when the 1st plaintiff was someone he had little familiarity with. In the round, I do not believe that there was an agreement between the 1st plaintiff and the 5th defendant as the latter alleges. I further believe that the real reason why he allowed ECF to be used in the marketing of the scheme was because he had a stake in the Malaysian business as well. The 3rd defendant 67 Finally, as I noted above at [6], the 3rd defendant made a submission of no case to answer. As the defendants’ submissions indicate, the established test is whether the plaintiffs’ evidence at face value establishes a case in law, or whether the evidence led by the plaintiffs is so unsatisfactory or unreliable that their burden of proof has not been discharged (Lim Eng Hock Peter v Lin Jian Weiand another[2009] 2 SLR(R) 1004 at [209];RelfoLtd (in liquidation) v Bhimji Velji Jadva Varsani[2008] 4 SLR(R) 657 at [20] (“Relfo”)). The 3rd defendant’s position is that the plaintiffs have not established aprima faciecase that he is an owner and operator of the Malaysian business. I am unable to agree with this submission. 68 As a preliminary point, I note that the 3rd defendant cites the case ofHo Yew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 in arguing that he is entitled to rely on the evidence adduced by the other defendants who did not make submissions of no case to answer. Notwithstanding the defendants’ counsel’s express statement on 18 April 2019 that the 3rd defendant would not be relying on any evidence led by the other defendants, it was eventually agreed between the parties that the 3rd defendant would be entitled to do so. 69 I am, however, not persuaded that the plaintiffs have failed to establish aprima faciecase against the 3rd defendant. As the defendants themselves acknowledge, aprima faciecase is determined by assuming that the evidence led by the plaintiff is true, unless it is inherently incredible or out of alignment with common sense or reason (Relfoat [20]). As I pointed out at [33] above, the defendants, including the 3rd defendant, accept that they are the owners of the Singapore business, and I have found that the Singapore and Malaysian businesses were in fact one. This alone ought to lead to the conclusion that aprima faciecase has been made out against the 3rd defendant. The documentary evidence further points to the conclusion that the 3rd defendant has a stake in the Malaysian business. This includes the minutes of the meeting held on 25 February 2014, which lists the 3rd defendant as a representative of ECF (see [49] above), as well as the transcripts of various other meetings conducted by the defendants. For example, at a meeting held on 29 May 2013, the 3rd defendant states that “[t]hat time my APG China got into trouble … I had to reshuffle, revamp IOC”. APG and IOC were companies utilised by the scheme. The evidence led by the other defendants also does not assist the 3rd defendant, especially since I have rejected the defendants’ defence that the owner and operator of the Malaysian business is the 1st plaintiff. It is clear that the plaintiffs have established a case against the 3rd defendant, and accordingly that his submission of no case to answer must fail. Conclusion on ownership of the Malaysian business 70 I therefore find that the defendants are the owners and operators of the Malaysian business and the scheme. In concluding as such, I also find that the 1st plaintiff is not the owner and operator of the Malaysian business and the scheme.",
        "The oral agreement: terms and breach": "71 I turn now to address the terms of the oral agreement between the defendants as the owners and operators of the Malaysian business and the scheme on the one hand, and the plaintiffs as members of the scheme on the other. My observations are confined to the extent necessary to determine the defendants’ liability: as I have explained, the trial has been bifurcated, and the quantum of any damages to be ordered is to be determined separately. 72 As I indicated above at [28], the defendants argue in their written submissions that the essential terms of the oral agreement are uncertain. Despite that, counsel for the defendants confirmed in oral closing submissions on 3 October 2019 that the defendants arenotarguing in the alternative that the contracts between the owners and operators of the Malaysian business and the plaintiffs are not enforceable due to uncertainty over essential terms. Instead, the references to the ambiguity of the terms in the contracts were apparently made for “completeness”. Given counsel’s express confirmation that the defendants are not attempting to argue that the contracts are unenforceable due to uncertainty, there is no need for me to consider this argument any further. 73 In any case, I am persuaded that there is the bare minimum necessary to prove the existence of some terms of the oral agreement in the present case. For present purposes, I only need to turn my attention to three purported terms in particular: first, a term which obliges the Malaysian business to allow the plaintiffs access to the Web Shop for the “IOC” and “ECF” platforms; second, a term which obliges the Malaysian business to effect the redemption of credits by the plaintiffs for cash; and third, a term which obliges the Malaysian business to insure 60% of the principal sum invested under “silver packages” (ie, the insurance obligation referred to at [12] above). While the first term relates to the plaintiffs’ claims in respect ofunredeemedcredits on the Web Shop, the second term relates to the plaintiffs’ claims in respect of credits whichhave been redeemedbut not paid out to the plaintiffs. Access to the Web Shop 74 First, I find that it is a term of the contract between the parties that access to a “web shop” or online database would be provided, as the plaintiffs assert. This platform is essential to the functioning of the scheme, and it is difficult to see how the members would otherwise be able to keep track of their transactions, particularly those of their downstream accounts, and redeem their credits. All information concerning the transactions undertaken by individual members, and the benefits that accrue as a result, are or ought to be in the Web Shop. Without access, members would not be able say how many credits they had accumulated. Furthermore, without access to the Web Shop, members would have no ability to realise the value of the credits which they had accumulated there. 75 The failure to provide access to the Web Shop is therefore a breach of the contract between each of the plaintiffs and the defendants. I understand it to be common ground that access to the Web Page was terminated, and the 4th defendant in particular accepted that this could have taken place in September 2014 as the plaintiffs contend. According to the 1st plaintiff’s evidence, this breach occurred in respect of all the plaintiffs on or about 8 September 2014 in respect of the Web Shop, which I understand from her AEIC to be a reference to both the “IOC” and “ECF” platforms. This evidence has not been contradicted. The breach is therefore clear. 76 It should be noted that the Statement of Claim expressly carves out the claims of the7th plaintifffrom those of the other plaintiffs by clearly pleading his claim for loss of access, which is limited to the IOC platform, separately from those of the other plaintiffs. As noted above (see [19]), the plea is that sometime in September or October 2013, the 7th plaintiff was not able to carry out transactions on the IOC platform, and from an unspecified date onwards was not able to access the IOC platform. Notably, the 7th plaintiff has filed no AEIC and given no evidence in this action, and there is no other evidence showing that he lost access to the Web Shop. However, I do not view the carving out of his claim as being fatal. I have found that access to the Web Shop was cut off for all members of the scheme on or about 8 September 2014. That being the case, it must follow that the same conclusion would support the 7th plaintiff’s claim for breach of the oral agreement based on access being wrongfully terminated, at least by 8 September 2014. 77 I therefore find that access to the Web Shop was terminated on 8 September 2014. The termination of access was a breach of the contracts between the defendants and the plaintiffs. For the avoidance of doubt, as regards the 7th plaintiff, the breach would be with regard to the IOC platform only, and as regards the other plaintiffs, either or both the IOC and ECF platforms as the case might be. 78 The plaintiffs will now have to prove their losses flowing from the denial of access to the Web Shop. On their case, this would bethe loss caused to each plaintiff by their inability to access the Web Shop, leading to them being unable to redeem the credits which are recorded therein for transactions which have been carried out (potentially including any credits which ought to have been credited to the plaintiffs’ accounts on the Web Shop after 8 September 2014 for financial products with fixed monthly returns sold before that date) – in other words, the lost value of unredeemed credits as of 8 September 2014 and of credits thatshouldhave been credited to the account after 8 September 2014. The plaintiffs have been unable to quantify these losses because they have lost access to the records of their credit balances and transaction histories on the Web Shop, and they have apparently not kept their own comprehensive records. Nevertheless, since the present trial is bifurcated, the plaintiffs will have the opportunity to obtain the necessary discovery at the assessment of damages phase of the proceedings. For example, it is clear from my findings above that the records of the Web Shop ought to be within the possession or power of the 2nd to 5th defendants, are discoverable, and indeed ought to have been disclosed. Prior redemptions of credits for cash 79 I now turn to the second alleged term, which relates to redemptions of credits for cash. To be clear, this relates to redemption claims which had been made prior to 8 September 2014, but which have not been satisfied by payment. For convenience, I refer to these redemptions as “prior redemptions”. 80 I find that it necessarily follows from the analysis at [74] above that there was a term of the contract that required the Malaysian business to transfer cash to the plaintiffs when they met the requirements to cash out their credits on the Web Shop. Although the defendants have pleaded that credits in the Web Shop could not be “redeem to cash [sic]”, it does not appear to be seriously contested that the plaintiffs had originally received cash payments from the Malaysian business for their credits, and that these payments stopped sometime in early 2014 (see [19] above). Furthermore, in February 2014, email memos were sent to members of the scheme in ECF’s name explaining that there were delays caused by limits on overseas transfers imposed by ECF’s bank in Hong Kong. This explanation would only make sense if the credits were redeemable for cash. 81 It is clear that the claim for prior redemptions is one for a liquidated sum. Each plaintiff which makes the claim must therefore particularise and adduce evidence of the prior redemptions that have been made and for which payment is therefore due. However, with the exception of the 4th plaintiff, the plaintiffs have not particularised their claims. In so far as the 3rd plaintiff claims to have made “certain redemptions” for cash for which he never received any payment, he has not specified when these redemptions were made, or how much cash was owing. In the case of the 1st and 2nd plaintiffs, they have alleged in their evidence that cash redemptions have not been effected by the defendants since February 2014, but it is entirely unclear which of the plaintiffs had made such redemptions, themselves included. As I have noted, since the case here is that redemptions were made but payments not effected, it must follow that each plaintiff ought to be able to particularise and adduce evidence of the amounts that are owing to each of them. With the exception of the 4th plaintiff (see [84] below), no other plaintiff has done that. The bifurcation of the trial only assists the plaintiffs where the breach requires an assessment ofdamages.Where prior redemptions are concerned, the claim is for a liquidated amount (ie, a debt), for which there are no damages to be assessed. This claim, therefore, must be resolved in this phase of the proceedings. However, there is a distinct lack of particulars as to the quantum of the debt. 82 More fundamentally, it is far from clear that the claim is even that there was a breach arising from these prior redemptions relating toeach and every one of the plaintiffsindividually. The lack of particularity is exacerbated by the fact that, as the plaintiffs accept, in many cases credits were redeemed in return for other packages and not for cash. I cannot simply assume that a generic complaint that the defendants have failed to make payment on prior redemptionsin generalamounts to a breach in relation to each of the plaintiffsindividually. It must be remembered that each plaintiff sues for breach of contract on separate contracts and therefore must plead his specific loss and damage. This gap in the plaintiffs’ pleadings and evidence is fatal (other than in relation to the 4th plaintiff). I am therefore unable to find a breach of the obligation to make payment in relation to prior redemptions and to award judgment for any particular sum as regards each of the plaintiffs. 83 It bears noting that this gap in the plaintiffs’ case exists no doubt in part because of the plaintiffs’ failure to properly understand their claim and plead it adequately. It is also a result of the plaintiffs’ questionable decision to simply rely on the affidavits they had filed in support of the application for a Mareva injunction as their AEICs for the trial (see [30] above). The failure of each of the plaintiffs (other than the 4th plaintiff) to plead and prove their case in relation to this claim is therefore entirely a misfortune of their own making. 84 In contrast, the 4th plaintiff, aside from referring to other unspecified redemptions, has also given evidence of a specific sum of US$5,000 which he redeemed for cash on 30 December 2013, and for which he never received payment. Evidence to the contrary was not led, and I therefore find a breach of the cash redemption obligation in respect of the 4th plaintiff in so far as the US$5,000 is concerned. I order that the defendants make payment of this sum to the 4th plaintiff, with interest at the default rate of 5.33% from 30 December 2013 to the date of payment. The insurance obligation 85 Finally, I accept that the insurance obligation was a term of the contract,ie, that it was a term that 60% of the principal sum invested under “silver packages” would be insured. This was reflected in the transcripts of the defendants’ events (see, for example [50] above). The 4th defendant had also stated at a meeting on 29 May 2013 that: … We managed to secure the service of a trust.It’s an insurance, okay, lucky. Of course we pay them a premium to cover for us this project. So at least 60%, more or less is covered. So from now we have promotion, so promotion you get silver bar. So silver bar is 10%, around 10% of the total portfolio, total price. So your risk is left with 30% … [emphasis added] 86 While the 4th defendant’s evidence was that he had been referring to the purchase ofphysical silverand that the insurance coverage was a reference to insurance forphysical silver bars as opposed to the “silver packages”, I do not accept that this was the case.First, the reference to coverage of 60% of the principal sum matches the plaintiffs’ account of the insurance obligation. This is particularly since the defendants plead that they had been told by the 1st plaintiff that all participants of the “silver franchise programme”, which I understand to be a reference to the “silver packages”, would receive protection of 60% of the franchise fees. There appears to be no material difference between these “franchise fees” and the principal sum to be protected under the insurance obligation. 87 Second and more fundamentally, the overall impression from the transcripts is that financial products were being sold. For example, there are references to monthly dividends, to being a “franchise[e]”, and to participating in ECF Market’s business by representing ECF Market to sell. I note that there are multiple emails in evidence from ecfmarkets@gmail.com attaching information on the “silver packages” sold by ECF. Third, in so far as the 4th defendant claimed that he had been marketing physical silver on behalf of RSD Capital, this seems implausible since there is no specific reference to RSD in the transcript. Therefore, I do not accept the suggestion by the 4th defendant – and also the 2nd defendant, at [50] above – that they werenotreferring to the “silver packages” in these meetings. 88 However, in considering whether the insurance obligation was breached by the defendant, the difficulty is again that there is a paucity of particulars and evidence in the case, with the exception of the 3rd plaintiff’s evidence in relation to his own situation. For a start, it is unclear which plaintiffs had purchased the “silver packages”. It would appear from the plaintiffs’ AEICs and pleadings that there were several different kinds of packages sold by the Malaysian business (the “DPP” package, “Noble” package,etc). The plaintiffs’ pleaded position is that the insurance cover was only to be provided for the “silver packages”. From the evidence before me, it appears thatonlythe 3rd plaintiff has asserted with any degree of clarity that he had purchased the “silver packages”. There is thus no evidential basis for me to find that the insurance obligation had been breached in respect of the other plaintiffs. 89 The 3rd plaintiff claims to have purchased seven “silver packages” for US$76,000.00. The insurance claim would therefore have been for 60% of this sum. The main question that arises is whether the insurance coverage had in fact been procured by the defendants, or if, as the plaintiffs allege, the purported insurance provider “Swiss International Trust Company AG” is a sham. 90 I am satisfied that the defendants breached their obligation to provide valid insurance coverage pursuant to the insurance obligation. In particular, the defendants’ pleaded position is that: [T]he Swiss International Trust Company AG and the insurance thereof was orchestrated by [the 1st plaintiff]. All that the [d]efendants are aware is what was conveyed by [the 1st plaintiff]. Under [the 1st plaintiff’s] business plan namely the Network Marketing Scheme, all participant of the silver franchise programme will receive a protection towards 60% of the franchise fees. [The 1st plaintiff] further informed that after deduction of commission of 20–30% and administration expenses of 10%, [the 1st plaintiff] will still have sufficient cash remaining to provide cover for the 60% even if the silver franchise business fails. 91 On the defendants’ own case, they had not provided the insurance coverage. Indeed, this was a logical consequence of their position that they were not the owners and operators of the Malaysian business. Since the defendants have been found to be the owners and operators of the Malaysian business, the insurance obligation is therefore theirs to fulfil. This alone would provide sufficient basis for me to find that the insurance obligation had been breached in relation to the 3rd plaintiff. However, I am also of the view that “Swiss Insurance Trust Company AG” is a sham company. I am fortified in this conclusion by the fact that there appears to have been no substantive response by the alleged insurance company either approving or rejecting the claims which had apparently been submitted. One would have thought that any insurance company that has issued insurance coverage must respond and either reject or accept a claim if one is made. The silence from “Swiss Insurance Trust Company AG” despite the claims that were made supports the plaintiffs’ position that it is a sham company with no real business or existence. I therefore enter interlocutory judgment in favour of the 3rd plaintiff for damages to be assessed for the breach of the insurance obligation by the defendants. 92 In closing, I will add that it is not clear to me why the plaintiffs have decided to conduct the trial up to this stage without having obtained access to the records of the Web Shop, which on their own case contains the crucial set of information which would have allowed them to particularise their claims against the defendants and quantify their losses. These records could have been obtained in discovery from the defendants. No application for specific discovery was made by the plaintiffs. Although the defendants denied being in control of the Web Shop or of the Malaysian business, this key issue could have been determined as part of the process of discovery under O 24 r 2 of the Rules of Court. This case resonates with issues which could and should have been better addressed, some of which I have highlighted above. I shall say no more.",
        "Remedies": "93 The plaintiffs’ primary prayer is for an “Account” to be ordered, with payment to them of the amounts due on the “Account”. They explain in their closing submissions that this is in fact a claim forspecific performanceof the Malaysian business’s obligation to provide the details of transactions made on the Web Shop. This is an implausible reading of the plaintiffs’ pleadings. Having prayed for an account, a well-known term with specific legal connotations, the plaintiffs cannot expect the court to rewrite the prayer to seek something else altogether. 94 Even if I were to accept the plaintiffs’ reinterpretation of their prayers for relief, I see no basis for ordering specific performance. It is the plaintiffs’ own case that the results of ordering specific performance and ordering damages to be assessed will be the same. 95 Both parties appear to accept in their pleadings and submissions that the owners and operators of the Malaysian business should be held liable for its debts and liabilities. As the trial of this action has been bifurcated, evidence has not been led on the quantum of relief to be ordered. I therefore give interlocutory judgment in favour of the plaintiffs, with damages to be assessed in relation to the losses arising from the denial of access to the Web Shop from 8 September 2014. I also order interlocutory judgment in favour of the 3rd plaintiff for the breach of the insurance obligation. In addition, I order that the defendants make payment of US$5,000 to the 4th plaintiff, with interest at the rate of 5.33% from 30 December 2013 to the date of payment. The plaintiffs’ remaining claims are dismissed. 96 I will hear parties on costs. Parties are file their submissions on costs, limited to 10 pages each, within fourteen days. Kannan RameshJudge Muthu Kumaran s/o Muthu Santhana Krishnan (M/s Kumaran Law) for the plaintiffs;Robert Raj Joseph (Gravitas Law LLC) for the second to sixth defendants."
    }
}