{
    "case_title": "UNQ vUNR",
    "ncitation": "[2020] SGHCF 21",
    "coram": "Debbie Ong J",
    "sections": {
        "Background": "5 The Father and the Mother were married on 12 November 2005. They have two children, a daughter and a son, who were 12 and 10 years old respectively at the time of my decision. 6 Since divorce proceedings were commenced in 2016, the parents have been embroiled in acrimonious litigation over various matters including matters related to the Children. Several appeals have been filed against the decisions of the DJ, and the parents appeared before me in four different appeals prior to the present one. As part of an earlier appeal, I spoke to the Children in a judicial interview on 8 February 2018, when the daughter and the son were 9 and 7 years old respectively. I found the Children to be endearing and very comfortable in expressing themselves during their time with me. They were unfortunately conflicted in their loyalties to their parents and have been greatly affected by the turmoil of the divorce. Their welfare has always been my paramount concern. 7 The final judgment of divorce was granted on 27 July 2018. Under the current arrangements, the parents share joint custody of the Children with care and control to the Mother and access to the Father. Access to the Father has sometimes proved difficult and the parents have had to seek the assistance of third parties such as the Children’s school and their friends to facilitate the Father’s access time with the Children. 8 This was not the Mother’s first application for a PPO. The Mother left the matrimonial home with the Children in May 2016 and, in June 2016, filed an application in SS 1383/2016 for a PPO on behalf of the Children and herself. In that application, she alleged that the Father had committed family violence based on incidents that occurred in 2016. That application was dismissed on 11 April 2017 (seeUEJ v UEK[2017] SGFC 90 (“UEJ”)). The DJ held that there was cause for the Mother to have taken out the application because the Father was prone to outbursts, and such outbursts had, over a sustained period, caused fear in (at least) the Mother (UEJat [31]). However, the DJ found that family violence hadnotbeen committed because she did not find that the Father had the necessary mental element of “wilfully or knowingly” placing the Mother or Children in fear of hurt or did not, by his actions, intend to cause or know his actions would be likely to cause anguish (UEJat [37]–[42]). The Mother initially filed an appeal against that decision in HCF/DCA 58/2017 but the appeal was withdrawn on 7 September 2017.",
        "The present application": "",
        "The Mother’s position": "9 On 6 May 2019, the Mother lodged a Magistrate’s Complaint against the Father for family violence and sought a PPO on behalf of the Children. The Mother alleged that the Father had used violence, intimidation and aggression around the Children when he perceived that they were disobeying him, including threatening to humiliate them or to leave them without a father. The Father had allegedly also scolded the Children for taking the Mother’s side and warned the Children that if they refused to see him during his access time, the Mother would go to jail. According to the Mother, these incidents had occurred during the Father’s access time with the Children and had been relayed to her by the Children. 10 In the Mother’s affidavit dated 21 June 2019 filed in support of the PPO application, she highlighted three incidents in particular: (a)The 11 November 2017 incident: The Mother alleged that the daughter complained that the Father had hit her on the head. The Mother took the daughter to see a doctor and produced the note written by the doctor that recorded the daughter stating that the Father had hit her. (a)The 8 and 9 March 2019 incidents: The Mother alleged that the daughter had to be admitted to the hospital at 1.06 am on 7 March 2019 due to anxiety and hyperventilation at the prospect of access with the Father. In support of this allegation, she produced notes arising from the hospitalisation. The Children were discharged into the Father’s care that same day and the Mother alleged that they later told her that he had made them hand over their favourite toys as “punishment” for pretending to be sick. The Children stayed at the Father’s home on 8 and 9 March 2019, and the Mother alleged that when they returned on 9 March 2019, they informed her that the Father had yelled at them, stayed in the room and ignored them, and threw things around the house including a metal coffee mug. The Mother filed a police report arising out of this incident on 10 March 2019. (b)The 26 April 2019 incident: The Mother alleged that the daughter complained that the Father had used a pair of nail clippers to cut her on her thigh where she had a prior wound, and that it was “agonisingly painful”. A police report that named the informant as the daughter was filed on 2 May 2019. 11 The Mother also referred to a police report filed on 27 May 2019 that named the informant as the daughter. In this report, the daughter described incidents in which the Father had expressed his frustrations at the Children, raised his voice at them or kept them in school when they did not want to spend time with him during the court-ordered access time. In the affidavit, the Mother also referred to several of the incidents in 2019 where she alleged the Children told her that they felt harassed by the Father. The Mother also alleged that the Father refused to permit the Children to attend therapy sessions and highlighted that she had been informed that if the Children’s anxiety was not treated, their condition would worsen.",
        "The Father’s position": "12 The Father categorically denied the allegations. Instead, he alleged that the Mother had interfered with his access to the Children and had filed the application to justify the denial of access. The Father highlighted that the Mother had not been present for any of the alleged incidents and relied solely on what the Children had told her. He further alleged that he had merely been reacting to the Children’s disobedience towards him, including their refusal to see him during court-ordered access time. 13 In relation to the specific incidents highlighted by the Mother, the Father claimed: (a)The 11 November 2017 incident: The Father denied that this had occurred. He highlighted that this allegation had only been raised two years after the alleged occurrence and that neither the Mother nor the doctor who wrote the note claimed to have witnessed the incident. (b)The 8 and 9 March 2019 incidents: The Father similarly denied that he had lashed out at the Children. He claimed that the allegation of abuse was illogical given that the daughter was hospitalised on 7 March 2019 but the last time he had seen his daughter before the hospitalisation was on 2 March 2019. Further, the daughter had been discharged from the hospital into his care, and the Father highlighted that the discharge note stated that the daughter was in a better condition at discharge (in his care) than at admission (in the Mother’s care). The Father claimed that when the Children were with him, he had stayed in his room and refused to interact with the Children because they were disobeying him. He denied throwing the mug at them. The Father filed a police report over the incidents, and produced apology letters written by the daughter dated 9 March 2019 in which she admitted to “saying bad things about Daddy”, citing this as an example of how he was restrained in his discipline of the Children. He also relied on the testimony of a friend, “X”, who had seen his interactions with the Children on those days and who had helped send the Children back to the Mother’s home. (c)The 26 April 2019 incident: The Father denied causing hurt to the daughter. He alleged that the daughter had asked him to help her dress a wound on her leg and that he had done so for her benefit. He also relied on the evidence of X who had seen the Children on that day.",
        "The trial": "14 The trial was heard in the lower court over two days. Both parents appeared in person and the Father’s friend, X, also gave evidence. The parents maintained the allegations in their affidavits, and the Father also submitted that the Mother had relied on hearsay or otherwise inadmissible evidence as she had failed to call the doctors who authored the notes to testify at the trial.",
        "The decision below": "15 On 27 September 2019, the DJ granted the application for the PPO on behalf of the two Children. In her decision inUNR v UNQ[2020] SGFC 2 (“GD”), the DJ considered the three alleged incidents and also noted the Mother’s reliance on the daughter’s statement to the police dated 27 May 2019. 16 The DJ began by acknowledging that this was not a straightforward matter as the allegations related to incidents that happened during the Father’s access time, based on what the Mother alleged the Children had told her, but the Children had not given evidence in court: GD at [30]–[31]. The DJ found that the balance of probabilities in determining whether family violence had been committed or was likely to be committed by the Father leaned in favour of the Mother. She accepted the medical notes produced by the Mother as “independent contemporaneous documents” that supported the Mother’s contentions: GD at [32]. 17 Taking the evidence in totality, the DJ was satisfied that family violence had been committed by the Father on the Children on 11 November 2017 and 8 and 9 March 2019 in that the Father had placed the Children in fear of hurt and had caused continual harassment with intent to cause or knowing that it was likely to cause anguish to the Children. However, she was not satisfied that family violence had been committed in the alleged incident on 26 April 2019: GD at [33]. 18 The DJ noted that the issue of access constituted a source of major frustration for the Father which had translated into reactions towards the Children. She was of the view that a PPO was necessary not just to protect the Children but also to restrain the Father from committing further acts of family violence on the Children, even though these acts might not translate into actual physical hurt: GD at [33]. She observed that the Father was still entitled to access even with the PPO in place and indicated that with the PPO, access could be carried out in a more meaningful manner: GD at [34]. 19 The Father expressed his dissatisfaction with the DJ’s decision at the hearing where it was delivered, and filed the present appeal against the DJ’s decision on the same day.",
        "The parents’ submissions in this appeal": "20 The Father through his counsel submitted that the DJ erred in considering the medical notes produced by the Mother to be “independent contemporaneous documents” that supported the Mother’s allegations. The evidence was wrongly admitted as the doctors had not been called to testify at trial. Without that evidence, there was no corroboration of the Mother’s allegations. The Father’s counsel also highlighted that the alleged incident of physical violence involving the Father hitting the daughter had allegedly occurred two years before the complaint was filed, and that no action had been taken in the interim. In fact, even after that alleged incident, in December 2018, the Father had brought the Children for a holiday without incident. Additionally, the Father’s counsel submitted that two of the three alleged incidents did not involve the son, yet the PPO had been granted on behalf of both Children. 21 The Mother, who appeared in person, submitted that the medical notes proved that the daughter had told the doctors, of her own accord, about what had occurred. These notes corroborated the daughter’s anxiety at the prospect of meeting the Father. The police report filed by the daughter on 27 May 2019 also corroborated these allegations. She submitted that the evidence of the Father’s friend, X, was unreliable and biased, and that he had omitted pertinent information. The Mother explained that she had not taken out an application at the time of the first incident in 2017 because she was distraught and overwhelmed by the multiple legal proceedings. The Mother also alleged that there was no further evidence on the daughter’s medical condition as the Father had prevented the daughter from receiving follow-up treatment. Although the specific incidents related to the daughter, the PPO application included the son because he had been present with the daughter during all access times with the Father and witnessed the Father lashing out, and thus experienced family violence as well. The Mother submitted that the PPO granted by the DJ was not a means to obstruct access but a safety framework to protect the Children for the purpose of continuing access.",
        "My decision": "",
        "The law": "22 The court is empowered to make a protection order under s 65(1) of the Charter, which states: Protection order 65.—(1) The court may, upon satisfaction on a balance of probabilities that family violence has been committed or is likely to be committed against a family member and that it is necessary for the protection of the family member, make a protection order restraining the person against whom the order is made from using family violence against the family member. 23 There are thus two threshold requirements that must be met before a court may grant a PPO: (a) First, the court must be satisfied that family violence has been committed or is likely to be committed. (b) Second, the PPO must be necessary for the protection of the family member. 24 Whether these threshold requirements have been established is an assessment the court makes on the balance of probabilities, and not on the criminal standard of proof of “beyond reasonable doubt”. 25 Family violence is defined in s 64 of the Charter as follows: “family violence” means the commission of any of the following acts: (a) wilfully or knowingly placing, or attempting to place, a family member in fear of hurt; (b) causing hurt to a family member by such act which is known or ought to have been known would result in hurt; (c) wrongfully confining or restraining a family member against his will; or (d) causing continual harassment with intent to cause or knowing that it is likely to cause anguish to a family member, but does not include any force lawfully used in self-defence, or by way of correction towards a child below 21 years of age 26 Based on the statutory definition, family violence may be found in a variety of circumstances. Physically abusing a family member will constitute family violence under limb (b) of the definition where hurt (defined in s 64 of the Charter as bodily pain, disease or infirmity) was caused by an act that was known or ought to have been known would result in hurt. Acts that fall short of physical hurt but are committed to place a family member in fear of hurt, or where the respondent attempts to place the family member in fear of hurt, may also constitute family violence under limb (a) if such acts are committedwilfullyorknowingly. Similarly, causing continual harassment to a family member may amount to family violence under limb (d). The requisite intention or knowledge in limb (d) is quite specific – it is causing continual harassment withintent to cause or knowing that it is likely to cause anguishto a family member. Whether the person possessed the necessary intention or knowledge at the time will be inferred from all of the circumstances of the case. For example, while a person may deny possessing any intention to cause anguish to a family member by continual harassment, the court may infer that he or she did possess such an intention or knowledge based on the state of the parties’ relationship at the time, or evidence of the communications between the parties at the relevant period. 27 A PPO restrains the named respondent from using family violence against the protected person and may be accompanied by related orders such as granting the right of exclusive occupation of a shared residence to the protected person (see 65(5)(a)) or referring the respondent, the protected person, or both persons or their children to attend counselling (see s 65(5)(b)). 28 The civil standard of proof that is applied in determining whether PPOs ought to be granted (see [24] above) emphasises that the proceedings before the court are civil proceedings and not criminal proceedings (see alsoTan HockChuan v Tan Tiong Hwa[2002] 2 SLR(R) 90 at [8]). At the same time, it is important to recognise that the protection conferred by a PPO carries with it criminal sanctions. Any person who wilfully contravenes a PPO will be guilty of an offence and liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding six months or to both (see s 65(8) of the Charter). This is an arrestable offence. If a police officer has reason to suspect that a person has wilfully contravened a PPO, the police officer may arrest the person without a warrant (see s 65(11) of the Charter and ss 2, 17(1) and 429(19) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed)). In light of the criminal consequences that follow a breach of a PPO, ordering one is not a decision a court would take lightly.",
        "Whether family violence was committed": "29 It was the Mother’s case that family violence, in the form of the Father’s verbal threats and aggression, hadalreadybeen committed, and not that the Father’s conduct was such that it was likely to be committed, though the DJ noted that the PPO was also necessary to prevent further acts of family violence. The Father’s conduct should be seen in the context of the long-standing dispute between the parents on how to raise their two children. The Father’s allegedly abusive conduct was said to have occurred when the Children refused to see him or disobeyed him during the access time. The Father did not admit to any incidents of physical hurt even for the disciplining of the Children, and it was not the Mother’s case that he was disciplining them. 30 In granting the PPO, the DJ identified the incidents of family violence in November 2017 and March 2019 as incidents that fell under limbs (a) and (d) of s 64 (see GD at [33]). She appeared to be of the view that family violence had been committed in both incidents but did not identify which limb the incidents fell under, or if they fell within both limbs. The DJ was aware of the limitations in the evidence such as the fact that the Children had not been called to give evidence at the trial and that the Mother was not present to witness the alleged incidents. The DJ also referred to the documents that recorded that there had been visits and referrals to medical services, but also noted that the makers of those documents had not been called as witnesses at the trial. 31 With respect to the 7 November 2017 incident, the DJ did not appear to reach a specific finding in the GD on whether or not the Father had in fact hit the daughter. The alleged act of hitting the daughter could have fallen within limb (b) of the definition of family violence, of “causing hurt to a family member by such act which is known or ought to have been known would result in hurt”, but the DJ did not cite that limb. In citing limbs (a) and (d) instead, the DJ appeared to find that the Father had not hit the daughter, but might have accepted that some anger or violence was wilfully exhibited to place the Children in fear of hurt. In my view, while the DJ was correct to rely on the doctor’s note as evidence that the daughter had seen the doctor in the aftermath of this incident, thatin itselfwas insufficient evidence, on the balance of probabilities, for a finding that the Father had hit the daughter in circumstances that would amount to family violence. Whether family violence had been committed is a fact-specific inquiry, and there was insufficient evidence before the court to reach a conclusion on this issue. In any case, as explained below (at [38]), even if the Father had hit the daughter on 7 November 2017, there was no indication that a PPO was necessary based on that alleged incident alone. 32 As for the March 2019 incident, the fact that the daughter had seen doctors and been hospitalised on 7 March 2019 was not in itself in dispute. In my view, the DJ was not wrong in so far as she relied on the medical notes to show that there had been hospital visits and that the notes and referrals were issued pursuant to such visits. I accepted that the notes were evidence of how the daughter had responded to the ongoing conflict and that the daughter has been suffering from severe anxiety. However, the medical notes did not themselves prove that family violence had been committed. As stated above (at [26]), limbs (a) and (d) of the definition of family violence have a mental element – of “wilfully or knowingly” placing a family member in fear of hurt, or causing continual harassment “with intent to cause or knowing that it is likely to cause” anguish. The DJ was of the view that the Father’s “frustrations with access issues have translated into reactions towards the Children, which have adversely affected them”: GD at [33]. This finding was important, because continual harassment must have been caused withintentto cause orknowledgethat it was likely tocause anguishto the Children. Even if the Children have suffered anguish as a result of the Father’s actions, the court must be satisfied that the Father had caused this anguish with the necessary intent or knowledge. 33 Indeed, it is important to set this matter in context. The Mother’s complaints relate to the Father’s treatment of the Children over the past two or three years, after divorce proceedings were commenced. The Children have been in the care of the Mother and there have been difficulties and conflicts in respect of access even after several court orders, with the Children sometimes rejecting the Father (see [7] above). This gives context to the complaints as well as the actions of the Father. Even if he had been yelling at the Children or behaving in a certain manner, it is doubtful whether he had the necessary intention or knowledge tocause anguishto the Children. He appeared instead to be trying to obtain access to the Children and getting the Children to comply with his instructions but the Children did not respond in the way he wanted them to. He responded by reacting harshly to the Children or showing anger in their presence. His reactions and actions were not exemplary, and it would be of benefit for him to gain greater insight into how his actions and reactions impact others, and learn to parent more positively. However, the acts did not meet the threshold of family violence as required in the law. 34 The Father highlighted that the daughter appeared fine in his care and only suffered from anxiety and breathing difficulties when she was in the Mother’s care, while the Mother said this was due to the prospect of having access with the Father the next day. The daughter was admitted to the hospital on 7 March 2019,beforeshe was with the Father on 8 and 9 March 2019, where the Mother claimed the Father yelled at the Children, threw a mug, and stayed in the room and ignored them. This sequence of events illustrated the difficulty of proving that the Father had the necessaryintentto cause the Children anguish, because the daughter’s anxiety did not appear to be caused directly by the Father’s actions on 8 and 9 March 2019 and indeed preceded her interaction with the Father on those days. The relevance of the hospitalisation on 7 March 2019 to the particular allegations on 8 and 9 March 2019 was unclear. Rather than a response toonlythe Father’s actions on those days, the daughter’s anxiety appeared to be a reaction to the chronic conflict between her parents and the Father’s response to that conflict over a long period of time. 35 The Father’s alleged act of throwing the coffee mug on 8 March 2019 – which the Father denied – could amount to wilfully or knowingly placing the Children in fear of hurt if, for example, evidence showed that the children were standing in the direction where the mug was flung. But an expression of frustration by throwing a mug, though inappropriate and ill-advised, would not in itself constitute family violence. The DJ had set out the submissions of each party in respect of the March incident but did not make specific findings such as whether she found that the Father had flung the coffee mug in the direction of the Children. In my judgment, this illustrated the difficulty of reaching a finding on the balance of probabilities of whether family violence had occurred because of the limited evidence available. 36 As for the third incident on 26 April 2019, the DJ had rejected that incident as constituting family violence. The Father had explained that he was dressing the daughter’s wound, and his evidence was corroborated by the testimony of his friend, X. In any case, there was no appeal against this finding. 37 For these reasons, I found that the DJ had erred in finding that family violence had been committed. This is not to say that such expressions of frustrations in high-conflict parental disputes can never amount to family violence. Parents must be aware of their conduct and be sensitive to the impact on their children. As stated earlier, a court can infer the necessary intention or wilfulness from all the circumstances of the case. For example, where a parent has been repeatedly reminded of the children’s anguish or has been admonished by third parties, but still persists in aggressive outbursts around the children, a court can infer that the parent possessed the necessary knowledge that his or her conduct was likely to cause anguish to the children. In the present case, only a few incidents had been alleged with specificity, such as the Father’s act of throwing a mug. I was not persuaded that the Father had the necessary intention or knowledge for his acts to amount to family violence; I emphasise that this was an assessment made on the facts of this particular case.",
        "Necessity": "38 The second legal requirement before a court may order a PPO is that of necessity. Even if the court had accepted that the November 2017 incident occurred as the Mother alleged it had (which she claimed was based on what the daughter had relayed to her and the doctor), the incident would have occurred nearly two years before the present PPO application was filed. The fact that an incident of family violence might have occurred some years ago before the application was filed does not necessarily diminish its importance because there may be circumstances that explain the delay, but it may be relevant to the question of thenecessityof a protection order. The jurisdiction of the court is statutorily prescribed and serves as a safeguard against unnecessary intervention by the court in family matters (seeUHA v UHBand another appeal[2020] 3 SLR 666 at [72]). There were no proven incidents of physical violence since the incident in November 2017, even without a PPO in place. Indeed, the Father had taken the Children on a holiday after November 2017 without incident. The evidence and circumstances suggested that there was no necessity for a PPO. In making this finding, it must be emphasised that the necessity of a PPO is a fact-intensive assessment that will vary according to the evidence before the court in each case.",
        "The best interests of the Children": "39 While the DJ referred to the totality of the evidence, the brevity of the GD on the acts found to have constituted family violence and the threshold that they purportedly met left some questions unanswered. It was plausible that the DJ thought that the evidence on the threshold requirements was evenly balanced but leaned in favour of granting a PPO as she appeared to think that a PPO would enable the access to be carried out in a more meaningful manner. If she did consider this, it would have been in error because the potential use of the PPO as a tool to encourage meaningful access between a parent and a child is an irrelevant consideration. A PPO is a court order with serious criminal consequences. Instead of encouraging meaningful access, it may well be that the PPO discourages access entirely or sends a message to a child that she needs protection from her own parent. Similar to the granting of care and protection orders, state intervention through the courts in the form of ordering a PPO may risk entrenching thestatus quoat the time of parental conflict and reinforce a child’s negative perception of one parent (seeUNB v Child Protector[2018] 5 SLR 1018 at [60]). At the same time, it may also be that in some families, a PPO assists in promoting smoother access (though I emphasise that this effect in itself is not a relevant consideration in determining whether a PPO should be granted, but a consequence of the PPO). Each case must be considered on its own facts and circumstances. 40 At the hearing, the Father’s counsel informed me that the Father had not seen the Children in over a year due to his concerns about the potential criminal consequences of a breach of the PPO. While the Mother disagreed with this position, the fact is that a PPO carries serious consequences. It is not inconceivable that, in a high-conflict situation, a parent or partner may avoid all contact with the protected person out of caution due to the potential criminal liability, which may include the possibility of being arrested without a warrant. 41 A PPO, when properly ordered, is an invaluable tool for the protection of vulnerable family members. It also serves as a reminder for restraint and discourages a violent or potentially violent family member from perpetrating further violence through criminal sanctions. At the same time, it can have a negative impact on the relationships within the family (see [39] above). Particularly when a family unit is in the midst of reorganisation after breakdown, all parties must be sensitive to how ongoing proceedings may affect the children, who should not feel that they must align themselves with one parent or the other. As the Court of Appeal recently remarked inVDZ v VEA[2020] 2 SLR 858, “[e]verychild requireslove and carefrombothparentsin order to grow up and achieve their fullest potential asbalancedindividuals” [emphasis in original]. There are other ways to encourage meaningful access between a parent and a child that do not carry the force of criminal law, such as therapeutic assistance for the entire family with the cooperation of both parents. This is not to say that PPOs are diminished in their relevance; indeed, I have stated at the outset that the court will take a firm stance against family violence and will not hesitate to impose one where appropriate. 42 It is unfortunate that the parental disagreements in this matter have worsened over time. It was evident that the years of parental dispute have had an extremely negative impact on the Children and, in particular, on the daughter’s mental health. While the circumstances in which the “apology letter” from the daughter on 9 March 2019 came about may be debatable, I urge the parents to listen to her concerns, and appreciate the depth of her struggles that underlie her words. She wrote: … Now I am very very sorry about what I did. Very very sorry. Next time, I will not try to please mom or dad. I will do what is right. I have just been trying not to make any of them unhappy. Now I know that it just makes things worse. … 43 It was clear to me that the protracted parental conflict has deeply hurt the Children. They suffer from a conflict of loyalty; they feel torn between two parents whom they love very much. Much of the disputes of fact came down to what the Children had told each parent – it must not have been easy for the Children to tell one parent about their interactions with the other, given the weight of their conflict of loyalty bearing down on them. It was particularly troubling to hear references to the court proceedings and orders in the alleged interactions between the parents and the Children, for these orders should not be used as weapons in the parties’ own parental conflicts. It was also clear to me that though both parents had very different parenting styles, they loved the Children very much. The Children must have the opportunity to develop healthy relationships with both parents. 44 The Children are both still young, and the parents have a long road of co-parenting ahead of them. Both parents must conduct themselves with the welfare of the Children first and foremost in their minds. They seem to be familiar with the letter of the law requiring the welfare of the child to be the paramount consideration, yet lack insight on how their own conduct and interactions with the Children are hurting their welfare. The Father, even if stressed or agitated, should not take his frustrations out in a way that negatively affects the Children nor blame the other parent in front of the Children. The Mother should likewise refrain from increasing the Children’s negativity towards the Father by, for example, focusing on the Father’s stricter parenting style, or encouraging the belief that all anxieties stem from the Father’s conduct. I have already found that the parents’ conflicts over the years have contributed significantly to the Children’s distress.",
        "Conclusion": "45 For the reasons stated above, I allowed the Father’s appeal and set aside the PPO. I directed the Family Justice Courts’ Counselling and Psychological Services to follow up with Family Conferences for this family, to provide some therapeutic assistance. 46 The Father’s counsel sought costs for the appeal. Taking into account all the circumstances of this case, including the reasons for the Mother’s application and that she was defending the DJ’s decision in this appeal, I made no order as to costs. 47 Though the PPO was set aside, I urged the Father to reflect on his behaviour around the Children. His actions might have fallen short of family violence, but they were part of the difficult circumstances that exacerbated the Children’s fears and anxiety. He should continue to spend time with them and assure them of his love and commitment to them. He should also consider support from therapeutic services so that he can manage his reactions in more appropriate and constructive ways for the sake of the Children. I urged the Father to be open to appropriate therapeutic services for the Children as well. Debbie OngJudge Rajwin Singh Sandhu (Rajwin & Yong LLP) for the appellant;The respondent in person."
    }
}