{
    "case_title": "Timing LtdvTay Toh Hin and another",
    "ncitation": "[2020] SGHC 169",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 These are grounds issued to assist interested parties in the reasoning of the Court in allowing an appeal by the plaintiff against the decision of the Assistant Registrar (“AR”) below. The AR had dismissed the plaintiff’s application under O 49 r 1 of the Rules of Court (Cap 322, R 5, 2014 Ed) (“ROC”) for an order that,inter alia, all debts due and/or accruing due from Standard Chartered Bank (“SCB”) to the first defendant be attached to answer the first defendant’s debt under a judgment dated 9 January 2020 (the “Judgment”). 2 Central to the AR’s reasoning was the fact that he accepted the general proposition that where two persons have a joint account on which either can draw, the account is not attachable in respect of a debt owed by one of them. The authority cited for this proposition was the High Court’s decision inOne Investment and Consultancy Ltd and another v Cham Poh Meng (DBS Bank Ltd, garnishee)[2016] 5 SLR 923 (“One Investment”). The AR did not accept that the instant facts were distinguishable from those inOne Investment, and accordingly held that he was bound to follow the general proposition inOne Investment. 3 Having surveyed the applicable authority from other jurisdictions, I did not understand the Commonwealth authorities to establish any general proposition that a joint account cannot be garnished. If they do in fact stand for such a proposition, I declined to follow them, and preferred the American and Canadian authorities cited to me instead. In reaching this conclusion, I respectfully declined to follow the decision of Kannan Ramesh JC (as he then was) inOneInvestment.",
        "Brief Background Facts": "4 The relevant facts may be swiftly outlined and are largely uncontested. It suffices to observe for present purposes that the parties had submitted a dispute over a loan agreement to arbitration. On 11 November 2019, the arbitrator rendered an award in favour of the plaintiff (the “Award”). On 18 December 2019, the plaintiff obtained leave to enforce the Award in Singapore, and on 9 January 2020, judgment was entered in terms of the Award. The judgment required that each of the defendants pay the plaintiff the following sums (the “judgment sums”) on a joint and several basis: (a) US$34,375,342.47; and (b) Interest at the rate of 5.33% per annum on the relevant sums. 5 The defendants did not satisfy the judgment sums. The plaintiff thus sought and obtained an order for the examination of judgment debtor (“EJD”) against the first defendant. The first defendant disclosed that he had four accounts with SCB, all of which were held jointly with his wife, Ms Tay Cindy Iwasaki. 6 At the EJD hearing on 6 March 2020, the first defendant was asked about the source of the moneys in one of the four joint accounts with SCB. In relation to Xtrasaver (SGD) 0108324885, the first defendant indicated that it was “the primary account” he used, and that “moneys that were paid to [him] personally were put into joint account”. The first defendant also acknowledged that the moneys were paid to him personally and therefore “do not belong to [his] wife”. At the EJD hearing on 2 April 2020, the first defendant further acknowledged, in relation to a different SCB joint account, that he had “transferred money frommySCB to DBS for maintaining---to my wife for maintaining household expenses” (emphasis added). On the basis of this evidence, the plaintiff contended before me that the monies in all four SCB joint accounts were in fact beneficially owned by the first defendant, who treated them as his personal accounts. 7 On 19 March 2020, the plaintiff took out a summons for a garnishee order for SCB to show cause why the first defendant’s four joint accounts with SCB should not be garnished. The AR, on 16 April 2020, dismissed the summons. The plaintiff appealed.",
        "The Decision Below": "8 The AR rightly identifiedOne Investmentas the starting point of the analysis on whether or not a joint bank account can be garnished. He readOneInvestmentas laying down a general proposition that a joint account cannot be garnished to satisfy a judgment debt owed by one of the joint account holders, and was of the view that he was bound by the holding inOne Investment. The AR observed that the plaintiff had attempted to distinguishOne Investmentfrom the present facts on the basis that there was uncertainty surrounding the relative contributions of the joint account holders inOne Investment, but was unpersuaded by such an argument. Instead, he took the view that the ability to establish the respective contributions of the joint account holders is, under the law in Singapore, an irrelevant consideration. 9 Further, the AR also took the view that even if he were to accept thatOne Investmentcould be distinguished in the way suggested, the evidence before him fell short of establishing that all the moneys in the four joint accounts belonged wholly to the first defendant. Put another way, the AR was not satisfied, on the balance of probabilities, that the beneficial ownership of the entire sum of money held in the four joint accounts was held by the first defendant.",
        "The Law on Garnishment of Joint Bank Accounts": "",
        "The Singapore position": "10 It is appropriate to begin analysis of the Singapore position by reference toOne Investment. In that case, the second plaintiff obtained summary judgment against the defendant for a sum of money. The second plaintiff therefore took out a garnishee order against DBS Bank Ltd for the bank to show cause. The plaintiffs’ position was that the money in the defendant’s two accounts with the bank – which included an account jointly held with his wife – could be attached to satisfy the judgment debt. The bank argued for the general proposition that joint accounts could not be subject to garnishee orders. The plaintiffs were successful at first instance, and the bank appealed. 11 Ramesh JC allowed the appeal and accepted the bank’s arguments that joint accounts cannot be garnished. He did so for the following reasons: (a) First, the Commonwealth authorities and local academics were “near-unanimous” in their endorsement of the position set out inMacdonald v The Tacquah Gold Mines Company(1884) 13 QBD 535 (“Tacquah Gold Mines”) that garnishee proceedings could not be brought where a garnishee was jointly indebted to the judgment debtor and a third party. In particular, the English position was of high persuasive value because the garnishee process under the ROC could be traced to the Civil Procedure Ordinance 1878 (SS Ord No 5 of 1878), which in turn was based on English rules of procedure: Jeffrey Pinsler SC,Civil Justice in Singapore(Butterworths Asia, 2000) at pp 10 to 11. (b) Second, allowing the garnishment of joint accounts would prejudice the banks. A bank had no visibility as to the various contributions of the joint account holders, and the determination of the parties’ respective contributions was a fairly involved process that would typically require a full factual investigation, something that banks were not equipped to conduct. Significant financial and administrative costs would also be imposed on banks to inform the relevant parties and make the required determinations as to whether or not moneys held in joint accounts can properly be released. (c) Third, permitting the garnishment of joint accounts would cause prejudice to the non-judgment-debtor joint account holders. In particular, there is no requirement under the ROC that a joint account holder be notified, nor is there any mechanism for a joint holder to seek determination of the judgment debtor’s interest in the joint account. This would engender difficulty in determining what proportion of the joint account to freeze, or which joint accounts to freeze should there be multiple joint accounts held by one judgment debtor. 12 Ramesh JC also considered a White Paper issued by the English Lord Chancellor’s Department titled “Effective Enforcement: Improved methods of recovery for civil court debt and commercial rent and a single regulatory regime for warrant enforcement agents” (Cm 5744, 2003) (“Effective Enforcement”).Effective Enforcementconsidered whether legislative reform should be carried out to allow a joint account to be subject to attachment under a Third Party Debt Order (“TPDO”), as a garnishee order is now known in England, and eventually advised against that proposal for largely the same reasons as outlined above at [11]. 13 A further reason against allowing a joint account to be the subject of a TPDO raised inEffective Enforcementwas that it would give rise to difficulties as regards the freezing of the joint account in the period between an interim and final TPDO. Depending on the nature of the mandate given to account holders, freezing just the proportion belonging to the debtor may not stop other account holders from withdrawing the frozen sum. To freeze the entire account, on the other hand, would prejudice the innocent account holders by depriving them of access to their money. Ramesh JC observed that a similar problem would arise in Singapore under O 49 of the ROC in the period between the date of service of the order to show cause and the date of the final order.",
        "Foreign jurisdictions": "14 The Commonwealth decisions appear largely aligned withOne Investment. In England,Tacquah Gold Mineswas followed and applied in the specific context of joint bank accounts inHirschorn v Evans[1938] 3 All ER 491 (“Hirschorn”), where the majority ruled that a joint account could not be the subject of a garnishee order in respect of the debt of only one of the account holders as the bank was liable to the account holders jointly and not severally. This reasoning was adopted more recently inCatlin v Cyprus Finance Corporation (London) Ltd[1983] QB 759. 15 In Australia, the Court of Appeal of New South Wales followed the approach inHirschorninD J Colburt & Sons Pty Ltd v Ansen; Commercial Banking Co of Sydney Ltd (Garnishee)[1966] 2 NSWR 289, as did the Hong Kong courts inGail Stevenson v The Chartered Bank[1977] HKLR 566 (“Gail Stevenson”). A similar position was adopted in Northern Ireland (Belfast Telegraph Newspapers Ltd v Blunden (trading as Impact Initiatives)[1995] NI 351) in relation to a partnership joint account.",
        "My Decision on the Law": "",
        "The authorities do not preclude a garnishment order on the facts": "16 In my view, it is clear from a close analysis of the various authorities cited inOne Investmentthat they are readily distinguishable from the instant facts. I highlight a number of these for illustration. 17 InTacquah Gold Mines, there was a debt owing from the Tacquah Gold Mines Company jointly to Horton and Fitzgerald, the latter of whom was a judgment debtor. The judgment creditor sought to attach the debt, but was refused by the English Court of Appeal on the basis that the debt was owed to both Horton and Fitzgerald, and not Fitzgerald alone. There was no indication of the proportions in which the debt was owed between Horton and Fitzgerald. 18 The decision inHirschornbears this distinction out even more clearly. InHirschorn, there was no evidence at all on which a court could find that the money in the joint account in question belonged solely to the judgment creditor. This absence of evidential sufficiency was in fact the entire basis of Greer LJ’s dissent in that judgment. While the majority (Slesser and MacKinnon LJJ) did not reach a firm position on the effect of the evidential inadequacy, it is clear that their conclusions were reached in the context of there having been no evidence as to the respective ownership shares of the joint account holders in that case. 19 InGail Stevenson, the appellants as husband and wife held a savings account in their joint names with the respondent, the Chartered Bank. At the same time, the husband’s personal current account was overdrawn, as was that of a private limited company of which the husband was the managing director. In respect of these overdrafts, the husband executed a personal guarantee to the bank. His wife had not executed any such guarantee. Subsequently, the bank applied the whole of the balance standing to the joint savings account towards satisfying the indebtedness of the private limited company, purporting to do so under the authority of the guarantee given by the husband. This was rejected by Pickering JA, who held that the bank was not entitled to debit the joint account for the several obligation of the husband to it. As withTacquah Gold MinesandHirschorn, no evidence was adduced as to the individual contributions by the husband and wife to the joint account. 20 The Australian, Hong Kong, and Northern Irish decisions cited at [15] above all made reference to and relied on the decisions inTacquah Gold Minesand/orHirschorn. For convenience, I refer to those cases, as well as the English decisions outlined at [14] above, collectively as the “Commonwealth cases” or “Commonwealth authorities”. 21 The instant facts are readily distinguishable from the Commonwealth authorities on three inter-connected bases: (a) First, in none of the Commonwealth cases cited was there any evidence placed before the Court as to the respective account holders’ contributions to the joint account; (b) Second, none of the Commonwealth authorities involved any situations where there was aprima faciecase that all of the moneys in the joint account in fact only belonged to the judgment debtor; and (c) Third, and flowing from the first two points, in none of the Commonwealth cases cited did the Court have to apply its mind to the effect of any evidence on the account holders’ respective contributions to the joint account. In other words, the question of what would happen if the account holders’ respective contributions were known remains open. 22 Pertinently, the effect of the analysis above is that even where broad language was used in the Commonwealth authorities to suggest that joint accounts could not be garnished, such statements were merelyobiterand were not central to the finding in those cases. The precise effect of there being evidence as to the parties’ respective contributions to the joint account has not, to my mind, been directly grappled with by a Court. Even the relevant practitioners’ works on banking have not specifically addressed this point: seePaget’s Law of Banking(LexisNexis, John Odgers QCet al, 15th Ed) at [31.15].",
        "If the authorities preclude a garnishment order on the facts, they should not be followed": "23 Even if I am mistaken and the Commonwealth authorities do in fact preclude the garnishing of a joint account notwithstanding the existence of strongprima facieevidence that all the money in the joint account belongs to the judgment debtor, I am not convinced that those authorities should be followed. 24 Where there is strongprima facieevidence that all the money in the joint account belongs to the judgment debtor, I see no reason why the creditor should not be able to, at the very least, have the garnishee show cause why the joint account should not be garnished. To hold otherwise would permit debtors to insulate their assets by holding them in joint accounts, and would result in an arbitrary position where the recoverability of a judgment debt depended in large part on the manner in which the debtor had decided to organise his personal finances. Such a position would unduly undermine the position of judgment creditors, and would permit judgment debtors to, fortuitously or otherwise, frustrate the rulings of a Court. 25 In this regard, the decision of the Supreme Court of Nova Scotia inSmith v Schaffner[2007] NSSC 210 (“Smith”) is instructive. InSmith, the applicant sought to enforce a garnishee order for a sum of money against a joint account held by the respondent and a third party. The bank declined to hand over the contents of the joint account. Warner J of the Nova Scotia Supreme Court allowed the order against 45% of the amount in the joint account, that proportion being the judgment debtor’s contribution to the account as had been established on a balance of probabilities through the bank’s records. Warner J specifically held at [25] that: There is no reason, based on policy, equity or logic, that if the interest of the execution debtor in the “property” of a joint account is established, that a creditor should not be entitled to have the sheriff attach the execution debtor’s “interest” in the “property” by garnishee. To decline to do so, enables the debtor toartificially and unfairly hide assets from the creditorand brings disrespect to the law. (Emphasis added) 26 Granted, there remain practical questions that need to be resolved should garnishment be sought against a joint account. These were outlined by Ramesh JC inOne Investment([14]supra), and have been set out above at [11]. However, these practical difficulties are not insurmountable, and can be ameliorated by imposing the following requirements should an applicant seek to garnish a joint bank account: (a) First, it is for the applicant to show to the satisfaction of the Court that there is at least a strongprima faciecase that the whole of the moneys in the joint account(s) belong to the judgment debtor; (b) Second, the applicant (and not the garnishee bank) must serve notice on any joint account holder(s) at the very latest by the show cause hearing; and (c) Third, the applicant must provide an undertaking to pay for any costs and reasonably foreseeable losses of the garnishee, or joint account holder, should it be shown to the satisfaction of the court that the moneys subject to the show cause order are not in fact payable in whole or in part to the judgment debtor. While there is no express mechanism provided for in O 49 of the ROC for these three requirements to be stipulated, I am of the view that it is within my power to do so in exercise of the discretion conferred under O 49. In any event, the garnishee and joint account holder(s) would have the opportunity to present their position at the confirmatory hearing for garnishment, and any complications arising can be properly addressed then. 27 The cumulative effect of these three requirements is that any potential loss to either the garnishee bank or the joint account holder(s) will be minimised. This addresses the practical difficulties raised by Ramesh JC inOne Investmentand outlined at [11(b)] and [11(c)] above. I note also that several Canadian provinces, including Alberta, Newfoundland, and Ontario, expressly provide in statute for the garnishment of joint accounts with similar safeguards as outlined at [26] above. It does not appear that these provisions have caused significant practical difficulty. 28 A number of American authorities also shed some light on the practicalities of permitting the garnishment of joint accounts: (a) InLeaf v McGowan(13 Ill.App.2d 58, 1957) (“Leaf”), the Appellate Court of Illinois reasoned that since the depositors’ use of a joint account affords them the opportunity to obscure the respective rights in the fund, it would be more equitable to place the burden of proof on the non-debtor depositor rather than the party seeking to garnish because the facts of actual ownership are peculiarly within the knowledge of the depositors.Leaftherefore provides that a Court should examine the evidence as to the respective beneficial ownership of a joint account as between the joint owners, though it takes the position that the burden should be on the other joint account holder(s) (i.e.the account holder(s) who is/are not the judgment debtor) to show what proportion of the account should not be garnished. (b) InHayden v Gardner(381 S.W.2d 752, 1964) (“Hayden”), the Supreme Court of Arkansas held that a joint account could be garnished in proportion to the judgment debtor’s ownership of the funds, and that parol evidence was admissible to show the respective contributions of the owners of the account. As withLeaf, the Court held that the (non-debtor) joint account holder(s) bore the burden of proving what proportions of the joint account were exempt from garnishment. (c) InArmalite Architectural Prods. V Copeland Glass Co.(601 So.2d 414, 1992), the Supreme Court of Alabama held that joint accounts are garnishable to the extent of the ownership of the debtor. The Court agreed with the ruling inHaydenthat the burden lies on the depositors of the bank account to prove that the funds didnotbelong to the debtor. This was deemed to be the most equitable solution because it would be easier for the depositors rather than the creditor to have or obtain proof of the ownership of the commingled funds. (d) For completeness, as decisions of Alabama and Arkansas have been cited, it may also be noted that similar positions are taken in Alaska (Shacht v Kunimune440 P.3d149 (Alaska 2019)), and in Arizona (Musker v Gil Haskins Auto Leasing, Inc500 P.2d635 (Arizona Court of Appeals, 1972)).   I will leave it to future cases to survey the other states of the Union. While I am not of the view that the burden of proof should lie on the joint account holders for the reasons outlined below at [32], these cases do provide authority for the proposition that the Court should be able to consider evidence as to the beneficial ownership of the moneys in joint accounts in deciding whether or not garnishment should be permitted. 29 I turn finally toOne Investment. Insofar asOne Investmentstands for a general proposition that all joint accounts cannot be garnished, I respectfully decline to follow it. In addition to the analysis canvassed above, I am persuaded by the following reasons in doing so: (a) First, the justifications for the decision inOne Investmentthat joint accounts are not susceptible to garnishment (at [11] above) have already been comprehensively dealt with. The authorities relied on do not preclude consideration of evidence as to the parties’ respective shares of the joint account, and I decline to follow them if they do. As for potential prejudice to both the garnishee bank and the non-judgment-debtor joint account holder(s), this is ameliorated by the practical measures outlined at [26] above. (b) Second, I found the reasons for precluding garnishment of joint accounts elucidated inEffective Enforcementto be unconvincing. The mere fact that there exists a period of time between the initial application for the garnishee to show cause and the confirmation of the garnishment order does not necessarily pose difficulties. If the applicant for the garnishment order provides the relevant undertaking outlined at [26(c)] above, the practical difficulties will largely be addressed. This is all the more so in a case like the present where the evidence suggests that the entire sum in the joint account belongs only to the judgment debtor. (c) Third, the contention that permitting garnishment of joint accounts would lead to uncertainty if a judgment debtor holds multiple joint accounts is neither here nor there. In the same way that a creditor can choose what assets of a debtor he wishes to subject to a writ of seizure and sale, I see no reason a creditor should not be able to determine which accounts, out of the multiple joint accounts a judgment debtor might hold, he wishes to garnish. 30 I would therefore hold that as a question of law, where there is a strongprima faciebasis for concluding that all the moneys in a joint account belong to the judgment debtor, the joint account can be garnished, subject to the requirements outlined at [26] above.",
        "The Applicable Standard of Evidence": "31 While the applicant in the present case has contended that it has established its case on the balance of probabilities, I am wary of concluding that the balance of probabilities has been met based only on untested evidence. It would be preferable to state that what is required at the show cause stage, as is the case on the instant facts, is a strongprima faciecase. This accounts for the fact that a fuller determination of whether or not the balance of probabilities is made out can be better done at the confirmatory stage for the garnishment order, especially with the benefit of the garnishee’s arguments (if any). At the show cause stage, particularly where the input of the garnishee or other account holders of the joint account has not yet been sought, a strongprima faciecase should suffice. 32 On the present facts, I accept that a strongprima faciecase has been made out. Looking at the evidence as a whole, it would seem that the first defendant was referring generally to his accounts with SCB when testifying how he treated that money as his own. This is reinforced by his other testimony that he transferred money from SCB to DBS Bank for his wife’s use for family expenses, which strongly suggests that the moneys in the SCB joint accounts were, for all intents and purposes, the first defendant’s only. 33 I add for completeness that the burden of proving that the money in the joint accounts belongs to the judgment debtor (the first defendant) is firmly on the applicant. Here I depart from the American cases cited at [28] above. The main reason why the burden should fall on the applicant is that it is the applicant who seeks to interfere with the obligations that exist between the garnishee bank and the joint account holders. Placing the burden of proof on the applicant also helps better balance the interest of the non-judgment-debtor joint account holder(s), and the interest of the creditor in obtaining the moneys due to him by requiring the latter to look for and bring evidence into consideration before the normal state of affairs is disturbed.",
        "Further Considerations": "34 It has not been necessary in this judgment to consider the specific nuances of determining the precise shares held by each joint account holder to the joint accounts in question because the evidence suggests that the moneys in the joint accounts belonged only to the first defendant. A determination of exactly how joint accounts should be divided in the case where multiple account holders have made contributions is thus outside the scope of this judgment, and would be better left to a case considering those facts and the impact of any such calculation on the availability of garnishment.",
        "Conclusion": "35 The present factual matrix, and in particular the strongprima facieevidence that the moneys in the SCB accounts belong solely to the first defendant, allows for an outcome balancing the interests of the creditor in pursuing the moneys owed him, and the interests of the non-judgment-debtor joint account holder in maintaining the integrity of his account. Given the requirements imposed at [26], there may well not be very many situations where creditors ultimately wish to pursue joint bank accounts, but that should not altogether preclude the possibility that a joint account can be garnished. 36 I accordingly allowed the appeal and held that a show cause order under O 49 of the ROC can be made against joint accounts where certain criteria are met, namely where: (a) There is evidence that the whole of the moneys in the joint accounts belong to the judgment debtor; (b) Notice is served on the non-judgment-debtor joint account holder(s); and (c) An undertaking is given by the applicant to pay for any costs and reasonably foreseeable losses of the garnishee, or non-judgment-debtor joint account holder(s), should it be shown to the satisfaction of the court that the moneys subject to the show cause order are not in fact payable in whole or in part to the judgement debtor. Aedit AbdullahJudge Koh Swee Yen, Lin Chunlong, Goh Mu Quan and Dana Chang (WongPartnership LLP) for the plaintiff."
    }
}