{
    "case_title": "Teo Song Kheng vTeo Poh Hoon",
    "ncitation": "[2020] SGHC 47",
    "coram": "Kannan Ramesh J",
    "sections": {
        "The facts": "",
        "Agreed background facts": "4 Mdm Seah passed away on 22 June 2009 leaving behind a will dated 31 March 2003 (“the Will”). The Will named the plaintiff and the defendant the executor and executrix respectively. Grant of Probate was obtained on 6 May 2010. The validity of the Will, its contents and the Grant of Probate were not challenged for the purpose of this suit. 5 Under the Will, Mdm Seah’s children were to receive the following: (a) Mr Richard Teo, the parties’ brother, was to receive $1,000; (b) As for the residual estate: (i) The plaintiff and defendant were to each receive one-third; (ii) The remaining one-third was to be given to Mr Eric Teo (“Eric”), the parties’ other brother, in the following manner: $200,000 for him to purchase a flat, and $2,000 per month for as long as he lived. Any residual amount from Eric’s one-third share that was not exhausted by the time of his death would be given to his sons, Justin Teo and Darren Teo (“Darren”), in equal shares absolutely. 6 The parties were in agreement that prior to Mdm Seah’s death, a safe deposit box (“the First Box”) had been maintained with DBS Bank, Orchard Branch in the plaintiff’s and Mdm Seah’s joint names. The disputed items as well as other items of value belonging to Mdm Seah (“the other items”) had been kept in the First Box until shortly after Mdm Seah’s passing. The other items comprised,inter alia, individual gifts from the plaintiff, the defendant and Eric to Mdm Seah, and certain gold items that she had purchased herself. It appeared that the other items had been distributed amongst the plaintiff, the defendant and Eric sometime on or about 14 or 15 July 2009 at a meeting at the Mandarin Hotel. 7 On or about 23 June 2009, shortly after Mdm Seah passed away, the plaintiff and Eric emptied the First Box of its contents and brought them to DBS Bank, Siglap Branch (“the Siglap Branch”). There, a new safe deposit box was opened in the plaintiff’s sole name (“the Second Box”). The plaintiff deposited the contents of the First Box in the Second Box. The disputed items remained stored in the Second Box until on or about 15 July 2009. Notably, on 15 July 2009, the defendant gained access to the Second Box as her name was added as an account holder. 8 On 15 July 2009, the plaintiff removed the disputed items from the Second Box and brought them to the office of one Lim Ngang Him (“Lim”), the Managing Director of Efficient Jewellery Industries Pte Ltd, to be inventoried. Lim was a jeweller who had been frequently patronised by Mdm Seah. There was some controversy as to whether Eric and the defendant were with the plaintiff at that time as well as other facts surrounding the visit. I address this below.",
        "Contested facts leading to the present dispute": "9 The parties’ stories diverged with respect to the precise circumstances surrounding the visit to Lim. The parties disagreed on the events that occurred before and after the visit to Lim, in particular whether the defendant was handed the disputed items by the plaintiff on 16 July 2009 to be returned to the Second Box, and what had happened to the disputed items thereafter. 10 The plaintiff asserted the following version of events: (a) On 14 July 2009, prior to Lim’s inventory of the disputed items, the plaintiff, defendant and Eric had retrieved the contents of the Second Box and proceeded to the Mandarin Hotel. There, the other items were divided amongst themselves. The items that had been gifted to Mdm Seah by the plaintiff, defendant and Eric were returned to the respective donors whilst the gold items were distributed amongst them in an agreed proportion. The disputed items were, however, not distributed and were returned to the Second Box by the plaintiff. (b) On 15 July 2009, the plaintiff, Eric and the defendant visited the Siglap Branch again, this time to collect the disputed items. They then met Lim at his office with the disputed items. (c) Lim was asked to prepare an inventory of the disputed items which he did by cataloguing each item in a list and cross-referencing each item to a colour photocopy of the same that he had taken. The plaintiff seemed to suggest that Lim had provided an “estimate number” together with the inventory, which I understood to be a rough estimate of the value of the items. However, according to Lim, the plaintiff only asked him to value the items “some years later”. (d) The disputed items were collected from Lim by the plaintiff, the defendant and Eric on 16 July 2009. As the plaintiff had to catch a flight to Bangkok that day, he entrusted the disputed items to the defendant to be deposited in the Second Box. However, the defendant never returned the disputed items to the Second Box as requested, instead keeping them for herself. The defendant never informed the plaintiff of this. 11 The defendant did not dispute the events of 14 July 2009 in so far as they relate to the distribution of the other items at the meeting at the Mandarin Hotel. The defendant also accepted that she was added as an account holder to the Second Box on 15 July 2009. However, the defendant’s version of events differed as follows: (a) The meeting at the Mandarin Hotel, according to the defendant, occurred on either 14 or 15 July 2009. Prior to this meeting, the plaintiff had met Lim alone at the latter’s office and asked him to prepare the inventory of the disputed items – neither the defendant nor Eric were present at this meeting. The defendant and Eric arrived at Lim’s office only after the preparation of the inventory. When they arrived, the plaintiff showed them his handwritten note containing Lim’s estimated values of the disputed items. (b) Following the distribution of the other items at the Mandarin Hotel, on 15 July 2009, the plaintiff returned the disputed items to the Second Box. (c) On the very next day, 16 July 2009, the plaintiff unilaterally and without anyone’s knowledge removed the disputed items from the Second Box and had kept them since. 12 Notably, the disputed items were not produced in this suit, and their location remains unknown. This was unsurprising given that both parties disavowed possession of the disputed items and knowledge of their whereabouts, pointing the finger instead at the other. 13 Finally, it should be noted that the parties, along with Eric and his two sons, entered into a Deed of Family Arrangement on 17 August 2017 (“the Deed”). The Deed was entered into in part because of the dispute amongst the family members over their respective entitlements to the disputed items. While the parties did not challenge the Deed, they took different positions on how it ought to be construed, and how it affected their respective positions in this suit. I will elaborate on the Deed later in these grounds.",
        "The Parties’ cases": "",
        "The plaintiff’s case": "14 The plaintiff’s case was that the disputed items wereinter vivosgifts from Mdm Seah to him, and that the defendant had possession of them at the time of these proceedings. Accordingly, the plaintiff sought an order that the defendant account for and deliver up the disputed items to him. In support of this, the plaintiff made the following submissions: (a) The fact that Mdm Seah had gifted the disputed items to the plaintiff might be inferred from the defendant’s conduct since 2016. The email correspondence and the Deed evinced the defendant’s acknowledgment of the plaintiff’s right to the disputed items. The Deed, it was asserted, was evidence of the gift. (b) The disputed items were handed over to the defendant by the plaintiff on 16 July 2009 in the presence of Eric, to be deposited in the Second Box, but the defendant failed to do so. They had remained in her possession since. Eric’s and Lim’s evidence supported the plaintiff’s testimony in this regard. The defendant’s evidence was riddled with inconsistencies and contradictions, and thus should not be believed.",
        "The defendant’s case": "15 The defendant’s case was that the disputed items were part of Mdm Seah’s estate and had not been gifted to the plaintiff. In support of this, the defendant made the following submissions: (a) The plaintiff had not been able to identify which of the items in the First Box were gifts and had simply stated that “everything” in there had been given to him. This was despite the plaintiff himself accepting that at least one item in the First Box, a Tag Heuer watch, was held on trust for Darren. Notably, this was not one of the other items (see [6] above). The plaintiff’s inability to specifically identify the items that were the subject of the gift suggested that there was in fact no gift as alleged. (b) The plaintiff was not able to provide contemporaneous evidence of Mdm Seah’s intention to make the gift, or state with precision when, how, and under what circumstances Mdm Seah communicated her intention to him. The remaining evidence adduced by the plaintiff was tangentially relevant at best and did not help the plaintiff discharge his burden of proof. (c) The plaintiff could not prove on the evidence adduced that the defendant had possession of the disputed items. The plaintiff had the most contact with the disputed items at the critical points in time, in contrast to the defendant who barely had contact with them. Eric’s evidence did not support the plaintiff’s case and in fact undermined it. 16 As noted earlier, the defendant had filed a counterclaim for an account and delivery up of the disputed items. However, she discontinued the counterclaim on 17 September 2019 with costs. I therefore do not address the counterclaim in these grounds.",
        "My decision": "17 It is axiomatic that if the disputed items had been given to the plaintiff by Mdm Seah as he had claimed, they would not form part of her estate. If he failed on this issue, his alternative claim for an account, valuation and delivery up of the disputed itemsquabeneficiary of Mdm Seah’s estate would be relevantprovidedit was shown that the disputed items were in the defendant’s possession. I observe, however, that if the primary claim was disallowed, it would be on the basis the court had disbelieved the plaintiff’s evidence on the alleged gift. That being the case, accepting the rest of the plaintiff’s evidence on how the disputed items came to be in the possession of the defendant seemed difficult. With this in mind, I shall deal with the gift issue first.",
        "Issue 1: Whether the disputed items were gifted": "The law oninter vivosgifts in Singapore 18 The law oninter vivosgifts of chattels in Singapore has been articulated in case law. In summary, in so far as the gift is of chattels, there must exist an intention to relinquish the chattel on the part of the donor at the time of gifting (“the first element”), certainty as to the specific items that form the subject matter of the gift (“the second element”), and delivery or parting with possession of the chattel from donor to donee (“the third element”) (seeLee Hiok Tng (in her personal capacity) v Lee Hiok Tng and another[2001] 1 SLR(R) 771 (“Lee Hiok Tng”) at [35];Lee Leh Hua v Yip Kok Leong[1999] SGHC 52 (“Lee Leh Hua”) at [15]–[18]). These elements are cumulative. 19 The third element of delivery had,prima facie, been fulfilled by virtue of the plaintiff having joint possession with Mdm Seah of the First Box. It was not disputed that the First Box held the disputed items. It was also not disputed that the plaintiff had possession of the First Box and its contents. Given that the plaintiff had already come intophysicalpossession of the disputed items, the need to establish delivery,ie, a transfer of physical possession of the gift from donor to donee, was obviated. However, I found that the plaintiff had not proven the first and second elements on a balance of probabilities. Insufficient evidence of Mdm Seah’s intention to make a gift 20 On the first element, it is critical to determine the donor’s subjective intention to make the gift (Tan Yok Koon v Tan Choo Suan and another and other appeals[2017] 1 SLR 654 at [83]). The plaintiff relied on his own testimony, emails and the Deed in attempting to prove that Mdm Seah intended to gift the disputed items to him. Insofar as the emails and Deed were documents to which Mdm Seah was not a party, they do not speak directly to her donative intent. At best, they serve to corroborate the plaintiff’s evidence on the gift issue. Thus, the issue ultimately comes down to an assessment of the credibility of the plaintiff’s evidence. In this regard, it seemed obvious that where there was significant disagreement on the facts, and much of the case rested on oral testimony and events that occurred many years before the trial, a close examination of the documentary evidence, particularly that which was contemporaneous, was critical in assessing credibility. In this context, there were serious difficulties with the plaintiff’s evidence. I shall explain below. (1) The plaintiff’s evidence on the gift issue 21 The crux of the plaintiff’s case was that the disputed items had been handed over by him to the defendant on 16 July 2009 to be placed in the Second Box, and that this had been done in the presence of Eric. That being the case, the emails that were exchanged between Eric and the plaintiff shortly thereafter on 9 and 10 August 2009 respectively were critical as they were correspondence exchanged between two of the main actors contemporaneous in time to the alleged handover to the defendant. 22 Eric accepted that when he wrote the email on 9 August 2009 (“the 9 August email”), the facts were fresh in his mind since it had been written not long after the alleged handover of the disputed items to the defendant on 16 July 2009. If the facts were fresh in his mind, there was every reason to believe that Eric thought they were true. The reasons set out in [80] below fortified this view. Thus, in so far as his evidence at trial differed from the position he took in the 9 August email, it would seem that the latter was more reliable. It was clear from the content and tenor of the 9 August email that Eric had been upset with the plaintiff because the latter had removed the contents of the Second Box, which included the disputed items on 16 July 2009 without Eric’s and the defendant’s knowledge. Eric also noted that this had greatly upset the defendant. The fact that Eric and the defendant were upset suggested that they were under the impression that the contents of the Second Box did not belong to the plaintiff. Eric further asserted that the plaintiff had visited Lim on 15 July 2009on his own, and that there was an argument thereafter in the car between the plaintiff and the defendant over a diamond ring that was in the Second Box, which the plaintiff had removed. The argument continued over lunch at the Shangri La Hotel. 23 There were three other aspects of the 9 August email that were significant. First, Eric asserted an interest in the diamond ring mentioned above. Second, Eric asserted that the plaintiff had asked for a “discount out of [the] estimated value” of the diamond ring in return for being able to keep it. Third, Eric alleged that Mdm Seah had noted in her diaries that the items in the First Box belonged to the plaintiff, the defendant and Eric. It is significant that despite Eric’s testimony that the diaries were in his possession, the plaintiff, who had called him as a witness, did not ask for them to be produced. These three points were inconsistent with the assertion that the disputed items had been gifted to the plaintiff. I should also point out that there were three other documents from Eric, which I consider below in relation to the possession issue (see [61] below), which were consistent with Eric’s allegation that the disputed items had been removed from the Second Boxby the plaintiff. To the extent that these documents alleged that the disputed items had been wrongfully removed from the Second Box by the plaintiff, they spoke to Eric and the defendant belief that the said items had not been gifted to the plaintiff. At the same time, they corroborated the allegation in the 9 August email that it was the plaintiff who had emptied the Second Box of its contents, which is relevant to the possession issue. 24 Given the accusation in the 9 August email, one would have expected the plaintiff to have robustly asserted in his reply that the disputed items had been gifted to him by Mdm Seah and that he was free to deal with them as he deemed fit. However, he did not do that. The plaintiff’s reply to Eric in his email on 10 August 2009 (“the 10 August email”) was telling for several reasons. First, he appeared to concede that he had emptied the contents of the Second Box on 16 July 2009 and attempted to defend his conduct. In responding to Eric’s allegation that he had wrongfully removed the contents of the Second Box, the plaintiff admitted that he had “did the safe [sic]” because he felt Mdm Seah had not been fair to him (presumably a reference to the distribution in the Will): … 3) Yes!! I did the safe because I felt she was unfair about the whole thing but you know i love to do this kind of dump [sic] things when I’m upset just to proof [sic] a point. (for fun) again I said I am sorry!!! … 25 Read in context, this seemed to be an admission that he had removed the disputed itemsnotbecause they were hisbut because he felt that Mdm Seah had not treated him fairly. He made absolutely no allegation that he had done so because the disputed items were rightfully his as they had been given to him by Mdm Seah. In fact, the plaintiff assertion that he had removed the contents of the Second Box because Mdm Seah was unfair to him would not be consistent with a gift of the disputed items to him. 26  Second, it was pertinent that the plaintiff offered to compensate Eric for the diamond ring. While it was unclear whether the diamond ring was one of the disputed items – there were many similar diamond rings listed in Annex A and the plaintiff did not clarify – what was clear was that it was one of the items in the First Box. When questioned by counsel for the defendant, the plaintiff was unable to provide a satisfactory explanation as to why he would offer to pay compensation for retaining the diamond ring ifhein fact ownedit. Instead, despite agreeing earlier that he had sent the 10 August email, he later claimed that he could not remember whether he actually did. This seemed like nothing more than a convenient response to the apparent difficulty in his case. 27 A similar difficulty arose from the plaintiff’s assertion in the 10 August email that he hadnotremoved any of the contents of the First Box when they were transferred to the Second Box on 23 June 2009: …YOU CAN BE SURE NOT ONE SPECK OF GOLD OR EVEN A THREAD WAS TAKEN OUT OR REMOVED BY ME!! WHY BECAUSE THAT’S ME!! ALSO WHY MOM ENTRUSTED THIS TO ME OVER 12 YEARS AGO!!! AND I’LL NEVER LET HER DOWN!!... 28 This obviously raised the question as to why he would have hesitated to take items which were actually his or would need to explain his conduct. Unsurprisingly, the plaintiff was cross-examined on this. There were two key difficulties with the plaintiff’s responses to the questions that were posed. 29 First, he did not appear to be certain of what Mdm Seah had actually said to him when the disputed items were allegedly gifted. He initially claimed that she had said “[y]ou can keep the box in future. This will be your box”. He then stated that she said “[t]his could be [your] box”, and later that “this would be your box in future”. These purported statements by Mdm Seah carried very different meanings – they ranged from Mdm Seah intending to make a gift which was to vest on an unascertained date in the future to Mdm Seah merely saying thatshecould potentially make a gift in the future. If the plaintiff was to be believed that a gift had been made, he must surely be able to say unequivocally and with precision what was said by Mdm Seah, and when that happened. 30 Second, the plaintiff asserted at various points during cross-examination, admittedly in a confused manner, that the disputed items were meant to be gifted to himafter his mother’s death: Court:  What did she say? What exactly did she say? Witness: Well, she---“This would be your boxin future.” … Q: Okay. Now you did not take anything out because the properties in the box were not gifts from your late mother to you. A:  That’s true, yes. I agree. Sure. Q:  So I put it to you--- A:Sure. It’s not my---technically, I guess not my right at that time, yah. Q:  Which time? A:When she’s alive. …. Court:  But it’s---Mr Hua says that--- Witness: Yes. Court:  ---it’s your position that what was in the box--- Witness: What was in the box--- Court:  ---was given to you by your mother. Witness: You see, I’m---I’m---I’m saying this, when my mother is alive, I mean, not when she’s passed away or when she was alive,she told me but Ineverin my mind, you know, actively said, “Oh, this is my box even my mother is alive.”Never in my mind and I---I---it’s wrong for me---I don’t think so. I never at that time thought, you know. I---I---I---that means I do not know how to---I don’t understand what I wrote. I’m not sure but in that meaning, that---I know she gave to me but I mean as I---as she said---I don’t have---I didn’t write it down or---or she didn’t write it down. It’s true. [emphasis added] 31 The plaintiff could not explain why, if the disputed items had been gifted to him while Mdm Seah was alive, he would have thought of them as not being his until she passed away. Further, if the disputed items were meant to be his after his mother’s death, as the plaintiff appeared to suggest, this would have rendered them the subject of a nuncupative will. It is trite that nuncupative wills are not valid (Tan Pwee Eng v Tan Pwee Hwa[2011] 1 SLR 113 at [15]). Therefore, to the extent that the plaintiff had testified that the alleged gift was to take effect after his mother’s death, there would not have been aninter vivosgift. 32 Crucially, the 10 August email and the plaintiff’s responses when cross-examined on it not only demonstrated that the plaintiff lacked credibility, but also revealed the plaintiff’s lack of certainty as to whether the disputed items belonged to him. The only reason why the plaintiff would have refrained from taking the disputed items after Mdm Seah’s death, and further tried to assure Eric of this, was that he was unsure at that time whether the disputed items actually belonged to him. This was in fact conceded by the plaintiff in cross-examination: Q: I put it to you that---sorry, let me rephrase. If they are truly gifts from your late mother to you, why did you wait until she passed away? And only sometime on 15th July 2009, approach Mr Lim to make an inventory? A:I was not 100% surebut like getting there that I think so it’s---it’s belongs to me, that’s why I should consider doing that, get a inventory. Whether it’s right or wrong, I am not sure whether it’s right or wrong I do that.If it’s mine, it’sright, if it’s my---if it’s not mine, then it’s wrong. If it’s mine, then I do it. Q:  I put it to you--- A:  Yes, Sir. Q:---you’re not 100% sure whether the disputed items are gifts from your late mother to you. A:Yes. [emphasis added] 33 This should be understood in the context of the plaintiff’s agreement under cross-examination that there wasno way to verify his claimthat the disputed items had been given to him by Mdm Seah other than to accept his evidence. The impossibility of further verification, coupled with the plaintiff’s uncertainty over the very premise of his claim, left me with no basis to conclude that the disputed items had been the subject of aninter vivosgift. Indeed, if the plaintiff was uncertainin 2009of his right to the disputed items, it is hard to imagine how he could have been any more certainat the time ofthese proceedings, unless something had occurred in the interim which convinced him of this. However, the plaintiff was not able to point to anything which would have given him reason to be certain of his right to the disputed items. 34 The 9 and 10 August emails therefore clearly undermined the plaintiff’s evidence on the gift issue,ie, that the disputed items were gifted to him. The inconsistencies I have referred to above went right to the core of the plaintiff’s credibility no matter how they were construed. At best, they might be understood as manifestations of the plaintiff’s lack of clarity on what the precise arrangement between his mother and him was – at worst, they were indicative of untruthful testimony by the plaintiff. Either way, they raised serious doubts in my mind as to whether the plaintiff was to be believed. In this regard, two further points were significant. First, the plaintiff offered no explanation as to why Mdm Seah would have wanted to gift the disputed items to only the plaintiff to the exclusion of her other children and even grandchildren. Mdm Seah had carefully considered all her children and indeed some of her grandchildren in making the distributions in the Will. Second, the plaintiff was unable to explain why he had transferred the disputed items from the First Box, which was in his sole custody, to the Second Box which eventually was in the joint custody of the plaintiff and the defendant if the disputed items were truly his. Instead, he agreed that he had given the defendant joint and alternate access because she was a joint executor of the Will. Granting the defendant access as executor would only have been relevant if the disputed items were part of Mdm Seah’s estate. This was therefore another instance in which the plaintiff’s conduct was at odds with his case. 35 As noted earlier (see [33] above), the plaintiff accepted that his oral testimony was the foundation upon which his case rested. My finding that the plaintiff’s testimony was not credible was therefore fatal to his case. The remaining evidence in support of the plaintiff’s case was sparse at best: the plaintiff had not produced any documents, testamentary or otherwise, that supported his assertions of Mdm Seah’sinter vivosdonative intent. Instead, the documentary evidence referred to above spoke against his case. I therefore had difficulty accepting his testimony that Mdm Seah intended to make a gift. 36 I noted that the 9 and 10 August emails also undermined his case that the disputed items had been handed over to the defendant on 16 July 2009 to be placed in the Second Box, which was critical to the possession issue. In particular, the 9 August email spoke to a different conclusion (see [78] below). I shall address the possession issue later in these grounds. (2) The Deed 37 One document relied on by the plaintiff warrants further discussion: the Deed (see [13] above). The Deed was entered into by the parties, Eric and his two sons on 17 August 2017. The plaintiff argued that the Deed supported his evidence on the gift issue. I did not agree. 38 In his closing submissions, the plaintiff argued that by cl 8 of the Deed, the defendant “effectively gave up any rights that she had to the [disputed items] through her execution of the [Deed].” Crucially, at the same time, the plaintiff expressly stated in his submissions that his claim was brought on the basis of aninter vivosgift andnotthe Deed. In other words, the plaintiff’s cause of action on the primary claim was not based on the Deed. There was therefore no need for me to determine the validity of the Deed, and nothing in these grounds should be taken as making any findings on this point though I note that the parties did not challenge the document. Thus, what was relevant for this suit was whether the Deed was probative of the plaintiff’s evidence on the gift issue. 39 The relevance of the Deed, according to the plaintiff, was that it was evidence that Mdm Seah had made a gift of the disputed items. This was not the correct characterisation: the Deed could not speak directly to Mdm Seah’s donative intention as it was neither a document to which she was a party nor contemporaneous. At best, it reflected an assertion of ownership by the plaintiff over the disputed items, and therefore added no value to the earlier analysis on the plaintiff’s evidence on the gift issue. If the plaintiff’s evidence of the gift was not credible, as I found, the Deed could not assist him, as it was a non-contemporaneous document recording what appeared to be asettlement agreement. The plaintiff was effectively relying on the Deed, cl 8 in particular, to show that the defendant and Eric had conceded or admitted that the disputed items were his. Specifically, the plaintiff argued that (1) there would have been no good reason for the defendant to “give up her rights” to the disputed items unless she recognised that they had been gifted to the plaintiff; and, (2) the wording of cl 8, in particular, the absence of a reference to the defendant, suggested that the defendant had always acknowledged the plaintiff’s right to the disputed items: As part of the full and final settlement herein, Eric & sons hereby fully accept that they have no claims whatsoever with regards to the contents of the safe deposit box which is in the joint names of the deceased and Raymond and the same belongs solely to Raymond. 40 These submissions, however, were not sustainable for two reasons. First, if the Deed had the character advanced by the plaintiff, it was surprising that he did not rely on it to make his claim on the gift issue (see [38] above). This is telling. Second, it wasnotthe plaintiff’s case that the circumstances of the gift of the disputed items were known to anyone other than the plaintiff and Mdm Seah. Certainly, it had never been alleged that the circumstances were known to the defendant. This was critical. Thus, any acknowledgement by the defendant in the Deed that the disputed items were gifts to the plaintiff could only have been on the basis of what the plaintiff had told her. If what the plaintiff had told her was subsequently found to be riddled with difficulty, as I have, such acknowledgement would be of limited to no utility to the plaintiff. The position would be quite different if the plaintiff had run the case that the defendant was aware of the circumstances surrounding the gift and was therefore prepared to acknowledge the plaintiff’s interest in the Deed. But that was not his case. 41 It was relevant that the Deed settled wide-ranging issues that had caused disagreements between the parties and was not confined to the disputed items. The preamble stated that the parties were attempting to “resolve their differences so that the parties can move forward amicably and so that the current Trustees may be fully and irrevocably discharged …”. It was thus immediately clear that one plausible explanation for the defendant’s willingness to sign the Deed might have been her preparedness to forgo her legal right to the disputed items for the sake of family harmony or the efficient administration of Mdm Seah’s estate. Accordingly, I was not satisfied that any willingness on the defendant’s part to disclaim legal rights to the disputed items under cl 8 assisted the plaintiffas a matter of evidence. 42 The plaintiff further asserted that the language of cl 8 must be understood in the context of two emails which had been sent by the defendant before the Deed was executed. It would be useful to reproduce the material portions of those emails here given the emphasis placed on them by the plaintiff. 43 On 20 July 2016, the defendant emailed Unilegal LLC, solicitors of Mdm Seah’s estate, stating that: … Yes, address the safe deposit box. I told Eric he has no case with his accusations. He and Raymond removed [the] contents, I was not in Singapore, andRaymond is the owner of the box. He of course beg to differ. But [he] agreed that he has to accept that he has no claimin order to settle… [emphasis added] 44 The next email, dated 1 August 2016, was also sent to Unilegal LLC, and stated that: … This is incorrect. Why would Ray give me the box to keep. The box is not only on record in the deed as belonging to Raymond but throughout all the correspondence/and records of the estate. Therewill be no changeto item8. Safe Deposit Boxin the Deed of Family Arrangement… [emphasis in original] 45 I was not convinced that these emails and the Deed collectively evinced a recognition by the defendant that a gift of the disputed items had been made by Mdm Seah to the plaintiff. When questioned on the emails, the defendant maintained that they did not reflect her acceptance that the disputed items had been gifted to the plaintiff. Instead, she explained that what she had meant was that the plaintiffhad always claimedthat the disputed items belonged to him, and were in his possession: Q: You say: \"This is incorrect. Why would Ray give me the box to keep? The box is not only on record on the deed as belonging to Raymond but throughout all the correspondence and records of the estate.\" A: Yes. Q: Shouldn't you be saying that not only is this incorrect, this is outrageous because he has the box, he took the box wrongly? A: Mr Tan, I am a layperson. To me, I word it this way as the way I think is correct. I never had the box. From day one, the contents had been moved and he claimed himself that it belongs to him. Q: But your position, as we've heard in testimony today -- A: Mm'm. Q: -- is that he committed a crime in taking the contents of the box, and you don't even mention it here -- A: Because -- Q: -- that he took the box. You don't even mention it here that he took the box on 8 July 2009? A: I did not, but I say here as belonging to him,as he claim, belonging to him, and throughout allthe correspondence it has always been his. His. [emphasis added] 46 It appeared that the defendant accepted the plaintiff’s assertion of ownership of the contents of the Second Box in order to resolve the family dispute. However, as noted earlier (see [40] above), this was not of evidential value to the plaintiff. The emails in fact indicated to me that the defendant was a trusting individual who had not sought to claim ownership of the disputed items, either for herself or for Mdm Seah’s estate. This lent credibility to her evidence. Seen in context, the emails were also intended to give instructions to the solicitors on the terms of the Deed, which was intended to be asettlementamongst the family members. The fact that she did not go on to question the correctness of the plaintiff’s claim of ownership is equivocal when viewed in this context. This was entirely consistent with her evidence on the relevance of the Deed. The defendant maintained that the position she had taken in the Deed was a “compromise position”. 47 This being the plaintiff’s claim, he bore the burden of showing that the disputed items had been gifted to him. I was not aware of any “records of the estate” that, contrary to the email at [44] above, would have demonstrated this or augmented his weak testimony. I should add that the Deed had relevance to the possession issue, which I will address later in these grounds (see [69] below). 48 Accordingly, I found that Mdm Seah did not intend to gift and in fact did not gift the disputed items to the plaintiff. On this element alone, the plaintiff’s case on the gift issue failed given that the three elements were cumulative. I nonetheless turn to explain why the plaintiff could not succeed on the gift issue even if his incoherent testimony on his mother’s donative intent was accepted. Lack of certainty of subject matter 49 Yet another critical flaw in the plaintiff’s case was that he had been unable to identify with any certainty the precise items that he claimed were gifted to him by Mdm Seah. Singapore case law on the requirements of a validinter vivosgift has made it clear that a lack of certainty as to the subject matter of the gift would render the purported gift invalid (seeLee Hiok Tng(supra[18])at [35];Lee Leh Hua(supra[18]) at [16]). 50 The plaintiff was unable to maintain a consistent position on what exactly had been gifted to him by Mdm Seah. He suggested at various points during cross-examination that Mdm Seah had given him the entirety of the First Box (see [15(a) above]. This was despite the fact that the First Box, on the plaintiff’s own case, contained the other items as well as the disputed items. However, he eventually accepted that only the disputed items had been gifted to him. This inconsistency in itself raised questions on the credibility of his testimony as to what exactly had been gifted. The key question was how the plaintiff was able to discern which items had in fact been given to him by Mdm Seah when she did not specifically segregate the disputed items from the others in the First Box. 51 What was clear upon examination of the evidence is that the disputed items were a discernible grouponly by virtue of the plaintiff listing them as individual items in Annex A. Nowhere else in the evidence, not even in the plaintiff’s oral evidence, was it suggested that Mdm Seah had made such a segregation. The segregation was therefore entirely self-serving. The plaintiff himself accepted that Mdm Seah had not drawn up an inventory of the items that were to be gifted. This was critical as the First Box contained not just the disputed items but also the other items. A segregation of the items that were to be the subject of the gift was therefore vital. Accordingly, the parameters of the purported gift made by Mdm Seah were nebulous and there was consequently a lack of certainty as to the subject matter of the gift. 52 This was complicated by the plaintiff accepting that some of the items in the First Box hadnotbeen gifted to him,eg, a Tag Heuer watch that had been given to Darren (see [15(a)] above). The plaintiff also appeared to accept that a number of items, which had been given to Mdm Seah by some of her children, were not the subject of Mdm Seah’s alleged gift to him. 53 I therefore could not understand how the plaintiff was able to identify which of the items in the First Box were meant to be given to him, particularly since, on his own account, Mdm Seah did not specify which items were to be excluded. I sought to clarify this with the plaintiff, whose responses were entirely unhelpful and bordered on incoherent: Court:But there were various other items which were treated as not part of the gift from your mother to you. Witness:That is true also.That’s why on that--- Court:  So how do you reconcile the two? Witness: Okay. This kind gentleman said the---the one of the item which is a watch belonged to the boy, Eric son, which I believe but asked me to retrieve, I couldn’t because at that time I think I don’t have the box already. Then I---and then the items, remember that---the items who gave her gifts are supposed to take it back. So they can recommend---recognise their gifts. They cannot take everything. Of course, they didn’t. So what happen is, let’s say, as I said just now, my brother gave her a expensive watch, I remember something like that, and he took it back. Or I gave her a few rings of her lifetime, I took it back, you know. … Court:  ---I just want to understand your position--- … Court:  Are you saying--- Witness: Yes, Sir. Court: ---that when she said “This would be your box”--- Witness: Yes, Sir. Court:  ---whateveris in the box--- Witness: Yes. Court:  ---was yours? Witness: Yes, definitely, Sir. [emphasis added] 54 The plaintiff, evidently, was simply unable to assert any basis for his identification of the items that he alleged had been given to him. As such, I was unable to find that the second element was satisfied. Mdm Seah had not identified the disputed items as a specific group when she purportedly made the gift. A gift cannot be made of an amorphous and undefined group of items. The plaintiff must be able to identify with particularity which of the items contained in the First Box had been given to him by Mdm Seah, and to show some basis for this. He was unable to do so and I therefore was not able to conclude on a balance of probabilities that the disputed items were the subject ofinter vivosgifts. Conclusion: Nointer vivosgift 55 In light of the above, I was not satisfied that the plaintiff had discharged his burden of proof with respect to the gift issue. Accordingly, I concluded on a balance of probabilities that the disputed items werenotinter vivosgifts by Mdm Seah to the plaintiff. Given that it was not disputed by the plaintiff that these items were Mdm Seah’s to begin with, they therefore would form part of Mdm Seah’s estate. 56 Having reached this conclusion, the plaintiff’s prayer for an account and delivery of the disputed items on the basis that the items were his andnotpart of Mdm Seah’s estate had to fail. I turn now to consider whether the disputed items were in the defendant’s possession, as the plaintiff alleged.",
        "Issue 2: Whether the disputed items are in the possession of the defendant": "57 The plaintiff did not, in my view, discharge his burden of proof on the possession issue. The plaintiff relied on the evidence of Eric and Lim, as well as his own evidence, to show that the disputed items were in the defendant’s possession. I could accept neither the plaintiff’s nor Eric’s testimony due to my concerns over the cogency of their evidence. Lim’s evidence could be dealt with summarily. 58 Lim’s evidence quite simply did not assist the plaintiff. While Lim stated in his affidavit of evidence-in-chief that the defendant had accompanied the plaintiff to collect the disputed items, he was in no position to provide any evidence on the events that transpired thereafter. The plaintiff’s case was that the disputed items were entrusted to the defendant on 16 July 2009 to be placed in the Second Box. This happenedafterthe disputed items had been collected from Lim. Thus, Lim’s evidence, if accepted, could only go so far as to show that the defendant accompanied the plaintiff to collect the disputed items from him. His evidence did not shed any light on what had happened to the disputed items after that – Lim was unable to confirm and indeed did not confirm that part of the plaintiff’s case,ie, that the plaintiff handed possession of the disputed items to the defendant, with instructions to deposit them in the Second Box. 59 Accordingly, only the plaintiff’s and Eric’s testimonies were important. As will be explained, multiple difficulties plagued their evidence. The plaintiff’s evidence on the possession issue 60 The key difficulty with the evidence of the plaintiff and Eric was that they were inconsistent with the 9 and 10 August emails. It was apparent from the 9 August email that Eric had alleged that the plaintiff had wrongfully taken the disputed items from the Second Box on 16 July 2009. Eric must therefore have believed that to be true. It was also apparent from the plaintiff’s reply in the 10 August email that he conceded the point (see [24] above). In subsequent correspondence, Eric continued to maintain the position that the plaintiff had possession of the disputed items. I highlight three instances. 61 First, on 3 June 2015, Darren emailed the plaintiff and the defendant to request that the plaintiff return a Tag Heuer watch which had been allegedly gifted to Darren by Mdm Seah (see [15(a)] above). It was not disputed that the watch was one of the items in the First Box and subsequently the Second Box. Eric then wrote to the plaintiff and the defendant on 14 June 2015 to reiterate Darren’s request. Eric pointedly told the plaintiff,not the defendant, to return the watch to his son. Significantly, the plaintiff did not respond to deny that the watch was in his possession. Second, on 9 July 2016 (“the 2016 email”), Eric emailed the defendant. In this email, Eric alleged that the plaintiff had taken “[jewellery] that belong[ed] to [him and the defendant]”. This was clearly a reference to the disputed items. Third, in a letter dated 23 July 2018 from Eric’s solicitors to the plaintiff, he demanded payment of the compensation that the plaintiff had promised for the diamond ring in the 10 August email. If Eric had thought that the diamond ring was in the possession of the defendant, the demand would have been sent to her instead. 62 These three documents individually and collectively corroborated Eric’s assertion in the 9 August email that the disputed items had been taken from the Second Box by the plaintiff on 16 July 2009, without anyone’s knowledge. 63 Thus, the plaintiff’s assertion that the disputed items were handed to the defendant on 16 July 2009 went against the grain of the contemporaneous documentary evidence. Accepting the plaintiff’s case would have been tantamount to accepting that his uncorroborated evidence was credible. However, serious questions had already been raised over his credibility on the gift issue. As mentioned earlier, when cross-examined over events relating to the gift issue, the plaintiff was inconsistent and unable to explain contradictions in his evidence (see [21]–[36] above). This made it difficult to isolate and accept the credibility of his evidence on the possession issue. In any event, a similar pattern was apparent as regards his evidence on the possession issue. I highlight some examples. 64 First, the plaintiff gave an inconsistent account of how the disputed items allegedly ended up with the defendant on 16 July 2009. In his affidavit of evidence-in-chief, the plaintiff stated that he had collected the disputed items from Lim together with Eric and the defendant on 16 July 2009 (see [10] above). He had allegedly handed the disputed items to the defendant to be placed in the Second Box, as he needed to board a flight for Bangkok the same day. However, in cross-examination, he accepted that he had removed the disputed items from the Second Box on 16 July 2009. This concession was consistent with Eric’s account, as stated in the 9 August email. Crucially, when it was put to the plaintiff that he was the “last person to have taken possession of the disputed items”, he agreed. Thus, the plaintiff’s initial evidence was materially inconsistent with his subsequent concession which was in fact consistent with the 9 and 10 August emails. 65 If the plaintiff had indeed removed the disputed items from the Second Box on 16 July 2009, there would have been no reason for him to then hand them back to the defendant for her to deposit them in the Second Box. It would have been illogical to do so. If there was in fact a logical reason for doing so, the plaintiff certainly did not offer it at trial. It seemed from this that the disputed items were in the plaintiff’s possession. 66 Second, when questioned on the circumstances surrounding the return of the disputed items to him after the inventory had been prepared by Lim, the plaintiff alleged that he had forgotten certain details, yet adamantly insisted that he was able to recall others. This was despite the discussed events being in close temporal proximity to one another: Q: ---on the 15th itself and that you proceeded back to the box at Siglap to return the items, you are the very last person to have inti---interacted with the box and its contents on the 15th of July. Again, you can agree or disagree. A: Thinking. I’m not sure I did it or I did it with my sister,I’m not sure now. Either with me or my---with my sister. I cannot---it must be, yah. I don’t know. Let me see. Q: Let’s see if--- A: No, no, no. On the other hand, they have bring---they bring me---the part I can recollect quite clearly, they brought me--- I said I want to go back---I mean, I’m going back to--- … Q: ---you got the items back to the safe deposit box with Angela. Agree or disagree? A:I can’t remember, really. … Q: Sorry. Yes. Is it also possible you got it there yourself? Put it back yourself? A:No. … Q: Now, I’m instructed that your flight was in the morning. Agree or disagree or can’t remember? A:I cannot remember. I---I can check because my passport, I can---I’m sure it’s---must be around because it’s nothing---if it is morning or whatever flight, yah, it should show I---but I---what you asked me, I said I guess… [emphasis added] 67 The above exchange suggested to me that the plaintiff was being selective with his evidence and deliberately evasive. He claimed to have forgotten details which might be potentially disadvantageous to his case, while insisting on other details when it suited his cause. 68 Indeed, based on the state of affairs that has been canvassed thus far (see [64] above), the defendant rightly submitted that the plaintiff was the person who had contact with the disputed items at the critical points in time, in particular on the very last occasion. 69 Crucially, I found it significant that when the Deed was executed, the plaintiff did not deem it necessary to stipulate a return of the disputed items by the defendant. It seemed a matter of common sense and if not necessity that if the plaintiff truly believed that the disputed items had been wrongly taken by the defendant on 16 July 2009, he would have insisted on their return by specifically providing for it in the Deed. The fact that he did not suggested to me that he never thought they were with the defendant. 70 Finally, I noted that the plaintiff had placed significant emphasis on paragraph 46 of the defendant’s affidavit of evidence-in-chief. Specifically, he stated that the paragraph was “a very important focus [sic]” of his case on the possession issue. The plaintiff argued that the paragraph was “obviously inconsistent” with the defendant’s evidence at trial, and suggested that it was a concession by the defendant that she had possession of the disputed items. I could not accept either of these contentions. 71 Paragraph 46 referred to certain exhibits which were described as photographs. However, they in fact comprised photographs and certainphotocopies. The first three exhibits were three photographs of the defendant, one with the plaintiff, all taken in Bangkok on 17 July 2018. In these photographs, the defendant was seen wearing two items of jewellery. The fourth exhibit comprised the photocopies of the disputed items that Lim had made in July 2009 when preparing the inventory. I shall refer to the three photographs and the photocopies collectively as “the Photographs” for ease of reference. In the paragraph, the defendant described the items in the Photographs as “belong[ing] either to the Plaintiff or to [the defendant]”. She then said “the plaintiff is well aware that we have long settled matters concerning these said items, on a mutually agreeable basis as well”. The plaintiff asserted that this was an admission that the disputed items were in her possession on the basis that the defendant’s evidence in paragraph 46 related to the photocopies of the disputed items. 72 The defendant stated under cross-examination that while the items she had been depicted as wearing were hers, the ownership of the disputed items had “never been officially settled”. She then claimed that she had only been referring to the two items she had been wearing when she said in paragraph 46 that the plaintiff was aware that they had long settled matters concerning these items. 73 I was of the view that the plaintiff read too much into paragraph 46 and failed to understand the paragraph in its proper context. While the paragraph could have benefited from clearer drafting, it was important that the lack of clarity in drafting did not cloud its proper analysis. If the plaintiff’s reading of the paragraph was right, it would mean thatby her own affidavit of evidence-in-chief, the defendant had completely undermined her defence to the plaintiff’s claim on the possession issue by admitting that she had the disputed items. This surely could not have been what she intended. It was important to appreciate that a bright line ought to be drawn between the disputed items (as captured by the photocopies) and the two items of jewellery that the defendant was photographed wearing (as captured in the first three photographs). I was not persuaded that the latter was part of the former. I was also not persuaded that the two items belonged to the plaintiff. The two items could not be part of the disputed items for the simple reason that the defendant was photographedwith the plaintiffon 17 July 2018 wearing them. If these two items were part of the disputed items, they must have been converted on 16 July 2009 on the plaintiff’s case. It would then have been inexplicable for the defendant to have paraded them in front of the plaintiffon 17 July 2018. It would also have been inexplicable for the plaintiff to have allowed that to happen and be sanguine about it, as evidenced by the friendly disposition of both parties towards each other in the first photograph. The situation was only explicable on the basis that the two items were the defendant’s. 74 Indeed, the defendant had never taken the position that the two items that she was photographed wearing formed part of the disputed items. Thus, the defendant could not have been referring to the two items she was wearing when she said in paragraph 46 that the items in the Photographs belonged to either the plaintiff or her. She must have in fact been referring to the disputed items as ownership of the same had been a matter of contention between the parties. The subsequent assertion in the paragraph that the issue of ownership had long been settled between the parties confirmed that this was the correct reading. The defendant was referring to the Deed which purported to resolve that issue. That explained why the defendant concluded the paragraph by noting that the parties were smiling when the first photograph was taken on 17 July 2018. In short, the parties were smiling on 17 July 2018 as they had resolved their differences (or at least they thought they did) on 17 August 2017 when they executed the Deed. Seen in totality, the defendant’s position was clear: the items she had been wearing were hers, and, the issue of ownership of the the disputed items had been resolved on the terms of the Deed. It was difficult to see how paragraph 46 assisted the plaintiff on the possession issue. 75 What then of the defendant’s answers in cross-examination? To the extent the defendant said that paragraph 46 referred to the two items that she was wearing, I accept that her answers did not readily reconcile with the reading of the paragraph above. However, did that mean that the plaintiff’s case was made out on the basis of paragraph 46? The answer must surely be no. The plaintiff must show that paragraph 46, properly construed in context, was an admission that the defendant had the disputed items. However, as explained earlier, it did not and could not carry that meaning. I make one final observation. The three photographs were taken in Bangkok on 17 July 2018. As noted earlier, it was apparent from the first photograph that the parties were on good terms. They were sitting next to each other and smiling, with each leaning towards the other. If what the plaintiff alleged was true,ie, that the defendant had converted the disputed items on 16 July 2009, it was strange that he would be on such friendly terms with the defendant on 17 July 2018 when the photograph was taken. This raised further questions over the veracity of the plaintiff’s claim on the possession issue. 76 I turn next to Eric’s evidence which was to the effect that the disputed items had been handed over to the defendant by the plaintiff on 16 July 2009, on the way to the airport. I was unable to accept Eric’s evidence as well. Eric’s evidence 77 Eric testified that the defendant had received the disputed items from the plaintiff on 16 July 2009, and had stored them in a safe deposit box which she had opened with “this Shenton Way bank which [was] then known as ‘UOB’”. He stated that the defendant “took the… liberty of putting it [the safe deposit box] under her name”. This was inconsistent with his evidence given during a later part of cross-examination, where he testified that he saw the defendant “taking some items out of the bank” earlier in the day – by “bank”, Eric was referring to the Second Box. While Eric did not specify whether the “items” he had purportedly seen the defendant take were the disputed items, I inferred that this must be so as on the plaintiff’s case, only the disputed items were left in the Second Box (see [10] and [14] above) and also because counsel’s line of questioning at that point concerned the Second Box and its contents. It was accordingly Eric’s position that the defendant had, atvarious pointson 16 July 2009, taken possession of the disputed items, and that they had been with the defendant ever since. 78 As I have alluded to above at [22], Eric’s testimony also contradicted the documentary evidence starting with the 9 August email where he asserted categorically that it was theplaintiffwho had surreptitiously removed the disputed items from the Second Box that day. Eric did not dispute authorship of this email. 79 When questioned on the inconsistency, Eric admitted that his allegation in court that the defendant had taken the disputed items from the Second Box on 16 July 2009 had not been previously made. Eric attempted to explain the failure to state this in the 9 August email by claiming that he was grieving over Mdm Seah’s passing: Q:  Except that in---only in Court today--- A:  Alright. Q:  ---did you say Angela took some items as well. A:  Yah, because---because I think---I---I---I think when I wrote this mail, I was---it was a month later, I was still, you know, grieving---I’m still grieving about my mother’s demise. But the thing is happening so fast---so fast that the---this is what I wrote but I can---I did not go---if I did not go so detail in it. Q:  Yes. Okay. 80 It was inexplicable how Eric’s grief over his mother’s death could have resulted in confusion as to who had emptied the Second Box. The sole purpose of the 9 August email was to confront the plaintiff over his removal of the contents of the Second Box. Thus, at the very least, Eric would have ensured that the accusation was correctly made. And there was no reason to believe it was not. Eric had conceded that the facts were fresh in mind when he wrote the 9 August email (see [22] above). A review of the 9 August email showed that it had been written after careful consideration, Eric describing it as “the toughest mail [he had]… [written]”. Further, the allegation concerning the plaintiff was embellished with facts about the defendant’s reaction when she found out what the plaintiff had done. The defendant was described as “uncontrollable” and “fuming away”, and as having “read [the plaintiff] like a book”. Eric also described what he and the defendant had been told by the bank officer when they had turned up at the Siglap Branch and his own shock at the plaintiff’s conduct. Further, there was a reference to wanting to manage the situation without making a police report, and a request for money. All of this spoke to clarity of thought, not confusion of mind. 81 Indeed, it was not only the 9 August email that exposed inconsistencies in Eric’s evidence. As mentioned (see [60] and [61] above), there were at least three other instances when Eric had maintained the position that the plaintiff had possession of the disputed items. Eric was questioned on two of these. First, in the letter dated 23 July 2018 from Eric’s solicitors to the plaintiff, he said: Q: Yes. Why did you approach Raymond sometime between 23rd July 2018 onwards, sometime from 2000---23 July 18 onwards to ask for the items? A: Did I? I don’t know, I cannot remember. Did I? Do you have anything to say that I asked him? Q: Yes, I do. A: Yes, please can you share it to me so at least I would try and recollect? … Q: This is a letter written on your behalf by your lawyers. A: Yah, that’s right. Q: Yes. A: Okay. Yah, okay. Yah, you see, because I have to---if you were to question me outwardly and I do not have knowledge of what happened during this date, I definitely--- Q: Yes, fair enough, fair enough. A: ---so I hope you understand that I have to refer to this, yah. 82 This was not an explanation. Rather, it demonstrated an inability to reconcile the position taken in the letter with that at trial. 83 Eric was next questioned on the 2016 email. Specifically, Eric was questioned on how his testimony that the defendant had taken the disputed items was consistent with the allegation in the 2016 email that it was the plaintiff who had possession of the disputed items. In response, shockingly, Eric insisted that the 2016 email was referring to an incident on 23 June 2009 (see [7] above), andnotthe day when the defendant allegedly took possession of the disputed items (ie.16 July 2009). This made no sense whatsoever. It was difficult to understand why Eric would have made reference to an incident which had no relevance to the issue at hand,ie, who had wrongfully retained possession of the disputed items on 16 July 2009. If Eric truly believed that the defendant had converted the disputed items on 16 July 2009, he would surely not have written to the plaintiff about the events on 23 June 2009. That incident had been superseded by the alleged incident on 16 July 2009 and was thus not relevant. Eric’s lie was exposed when one examined the events of 23 June 2009. On that occasion, the plaintiffand Erichad transferred the contents of the First Box to the Second Box. There was nothing controversial about the events. Neither was there any reason for Eric to have confronted the plaintiff over the incident in the 2016 email. He was afterall party to the incident. His subsequent answers were incoherent and indecipherable: Q: Yes. Now, almost 7 years later in 2016--- A: Alright. Q: ---you say, “Eric took the jewellery away from us”--- A: Raymond took the jewellery. Not Eric, Eric is me. Q: Sorry. “Raymond took the jewellery away from us.” A: Alright. Q: Okay. And you say it refers to the 23rd June 2000--- A: Right, during that period of time. Q: Why aren’t you referring to the 16th July incident, according to your evidence? … A: No, because---because that---that jewellery during---due---during that period of time, three of us went to the box, collect this jewellery together. We distributed---we---we distributed some items among us, alright, and then the thing---the rest was brought back to the box. And then from there on, there was this problem of---of, you know, Raymond---Raymond---Raymond took the jewellery away for---through---and where we got back from Eng during the 16th of July, that’s when I say that, “You better go back to during that period of time, alright.” So during that period of time till now, till this very day, I thought that the jewellery is all belongs to us as---because three of us were involved in all this es---this whole situation. You got it. Q: I’m listening. Is that--- A: Yah. So that is why I wrote it down this way because why I have to refer back the---to the 23rd June is because during that period of time, three of us were involved. First itself, 23rd June, Raymond and myself went to collect the items from the box and then put it to another---we put it to another box. That’s where after that, Angela came into the picture. So when I said “us” mean---mean that period of time three of us were involved in this jewellery, right. 84 I was not satisfied with Eric’s explanation as reproduced above. I did not believe that he was telling the truth when he explained that he was actually referring to a purported incident on 23 June 2009. It was obvious that the allegation in the 2016 email was that the plaintiff had taken the disputed itemson 16 July 2009. It was clear from contemporaneous evidence such as the 9 August email that the events of 23 June 2009, even if true, were never the issue between the siblings. 85 Problems also plagued Eric’s testimony on the events that purportedly occurred at a “Shenton Way bank”. As stated earlier, Eric alleged during cross-examination that the disputed items were deposited in a safe deposit box opened in the defendant’s sole name at a bank in Shenton Way (see [77] above). This portion of Eric’s testimony formed a critical part of the plaintiff’s case on the possession issue. I was not persuaded by Eric’s evidence in this regard. It must be noted that this incident never featured in the documents that emanated from Eric referred to earlier (see [60] and [61] above). This omission was not explained. Further, it was raised late in the trial and in a piecemeal fashion. It was difficult to understand why there was a failure to raise this point earlier in this suit, given how central it was to the plaintiff’s case on the possession issue. In fact, not once did the plaintiff mention this incident in his testimony. The fact that Eric’s and the plaintiff’s testimonies were not even consistent on this point weighed heavily against accepting Eric’s evidence in this regard. 86 Overall, I had grave concerns over the truthfulness of Eric’s evidence. Aside from the inexplicable contradictions and omissions in his evidence as discussed above (see [77]–[85] above), Eric admitted on the stand that when the disputed items were, according to him, removed from the Second Box by the defendant, he could not even “see the [Second Box] for [himself]”. He conceded that there was no way he could confirm whether the defendant had in fact removedanyof the disputed items from the Second Box, or what items actually remained in the Second Box at the relevant time. That being the case, it was difficult to see how he could suggest that it was the defendant who had taken the disputed items. I was minded to conclude that his evidence at trial was concocted to support the plaintiff’s case. It seemed to me that Eric was being truthful only when he penned the 9 August email, and not when he testified. The tenor of the 9 August email and its contemporaneity suggested that it offered a more reliable account of what had happened. Conclusion: The defendant does not have possession of the disputed items 87 The evidence suggesting that the defendant had been handed possession of the disputed items and had kept them for herself was uncorroborated and unbelievable, and was drip-fed in a piecemeal fashion during the course of the trial. I was thus not satisfied that on a balance of probabilities, the defendant had possession of the disputed items. Accordingly, the plaintiff’s claim on the possession issue was also not made out. This meant that the plaintiff’s alternative case qua beneficiary therefore failed.",
        "The plaintiff’s application in HC/SUM 481/2020": "88 On a final note, I briefly address the plaintiff’s application for purportedly an Anton Piller order in HC/SUM 481/2020 (“the Application”). The Application was filed by way of anex partesummons on 15 January 2020, after evidence had closed and closing submissions had been filed. It was heard in chambers on 3 March 2020. The plaintiff sought,inter alia, an order that he be allowed to inspect the contents of any safe deposit boxes that might be in the defendant’s possession, and that the defendant be restrained from accessing any such safe deposit boxes without the plaintiff’s consent. 89 Counsel for the plaintiff withdrew the Application at the conclusion of the hearing on 3 March 2020. This was after I expressed reservations over the nature and timing of the Application. I summarise them here inobiter. 90 As a preliminary point, I noted that while the plaintiff sought an Anton Piller order, the Application, in substance, was under O 29 r 2 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) for an order for the preservation of property (ie. the disputed items) which was the subject matter of the cause. This was quite different from an Anton Piller order which seeks the preservation ofevidencewhich is at serious risk of destruction for the purpose of the trial. 91 More fundamentally, it was inappropriate for the Application to have been taken out at this juncture. First, as I observed, for all applications of this nature (ie, applications for relief relating to the preservation and/or seizure of property such as Anton Piller orders, Mareva injunctions or preservation orders under O 29 r 2 of the Rules of Court), an applicant invariably had to show that the defendant had possession of the said evidence/property. In the present context,possessionwas one of the two key issues in this suit. As such, the Application required the court to conclude in the plaintiff’s favour on one of the two principal issues before it even before delivering judgment in this suit. Second, counsel for the plaintiff sought to justify the Application on the basis it was necessary so as to ensure that the plaintiff would not be left with a hollow judgment (assuming the court found in his favour). I did not understand the argument. If the plaintiff succeeded in this suit, he would have obtained an order for delivery up of the disputed items. It would have then been open to the plaintiff to enforce that order in such ways as were permitted by law. It seemed strange to contend that an Anton Piller order would be necessary to ensure that an order for delivery up, if made, would not be rendered hollow.",
        "Conclusion": "92 I therefore dismissed the plaintiff’s claim and ordered costs against the plaintiff in favour of the defendant to be taxed if not agreed.  Kannan RameshJudge Tan Kheng Ann Alvin (Wong Thomas & Leong) for the plaintiff;Hua Yew Fai Terence, Chia Wei Lin Rebecca and Mohamed Baiross (I.R.B. Law LLP) for the defendant."
    }
}