{
    "case_title": "Eller, UrsvCheong Kiat Wah",
    "ncitation": "[2020] SGHC 106",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 The defendant set up a company to distribute medical devices in Malaysia. The plaintiff, who was the defendant’s friend and former colleague, was interested in becoming a shareholder in the defendant’s company but could not formally register his shareholding due to a contractual non-compete duty which he owed to his former employer. To circumvent this problem, the parties executed a trust deed creating an arrangement whereby the defendant held 50 shares in the company on trust for the plaintiff. 2 Shortly after the execution of the trust deed, the defendant caused the company to issue 350,000 additional shares in his own name. The plaintiff contends that this was a breach of the terms of the trust deed, which provided,inter alia, that the defendant could not increase the amount of the company’s share capital without the plaintiff’s agreement. He seeks equitable compensation for the loss which he has allegedly suffered from the dilution of his shareholding without his consent. The defendant counters that the plaintiff knew and approved of this share issuance, and/or that the plaintiff is in any event barred from relief due to the applicability of various defences. 3 Having carefully considered the evidence and the submissions before me, I find that the plaintiff succeeds on the issue of liability but not on the issue of quantum as claimed. In the interest of fairness, I order that a separate assessment be held to ascertain the quantum of compensatory relief (if any) payable by the defendant to the plaintiff. The grounds for my decision are set out below.",
        "Facts": "",
        "Background to the dispute": "4 The plaintiff is a Swiss national who is currently working in Singapore. 5 The defendant is a Malaysian citizen who is presently working and residing in Malaysia. 6 The plaintiff and the defendant first met each other in mid-2011. During this time, the plaintiff was employed by Sonova Holding AG (“Sonova”), a Switzerland-incorporated company which specialises in manufacturing and distributing hearing aid devices.1Foot Note 1×Plaintiff’s Bundle of Affidavits of Evidence-in-Chief, Vol 1 (“PBAEIC 1”) at p 2, para 3; Notes of Evidence (“NE”), 11 November 2019, 4/19The defendant was employed by Phonak Singapore Pte Ltd (“Phonak”), Sonova’s Singapore-incorporated subsidiary.2Foot Note 2×Defendant’s Bundle of Affidavits of Evidence-in-Chief, Vol 1 (“DBAEIC 1”) at p 2, para 3The defendant managed Sonova’s Malaysian sales and reported directly to the plaintiff, who was one of Sonova’s regional managers. 7 In or around April 2014, the defendant decided, on the advice of Sonova’s headquarters, to incorporate a company in Malaysia to take over the distribution of Sonova’s products in the Malaysian region.3Foot Note 3×DBAEIC 1 at p 2, para 4The defendant began to explore possible options to finance this company as he knew that its start-up costs would be substantial. 8 The plaintiff expressed a keen interest in investing in the defendant’s company. After discussion, both parties agreed that they would each invest MYR350,000 in the company as start-up capital.4Foot Note 4×PBAEIC 1 at p 5, para 21; DBAEIC 1 at pp 2–3, para 7Based on this agreement, the defendant proceeded to register Swiss Medicare Sdn Bhd (“the Company”) on 19 September 2014.5Foot Note 5×PBAEIC 1 at p 4, para 17The Company had 100 shares at the time of its incorporation, which were allotted as follows: (a) 80 shares to the defendant; (b) ten shares to the defendant’s wife, Ms Tan Poh Guan; and (c) ten shares to the defendant’s mother, Ms Tan Kim Siew. 9 Subsequently, the parties separately consulted their solicitors on the possible ways in which they could formalise their joint investment in the Company. In or around early November 2014, the defendant instructed his solicitors, M/s Anuar Yusof & Partners, to draft a partnership agreement (“the Proposed Partnership Agreement”), which was presented to the plaintiff for his consideration. The terms of the Proposed Partnership Agreement provided, inter alia, that the plaintiff and the defendant would each hold 350,000 shares in the Company.6Foot Note 6×Agreed Bundle of Documents, Vol 2 (“ABD 2”) at p 385, Cl 2.1 10 At the material time, the plaintiff owed a contractual non-compete duty to Sonova which prohibited him from,inter alia, directly holding shares in the Company until end-2015.7Foot Note 7×PBAEIC 1 at p 11, paras 32–33; NE, 11 November 2019, 13/22As such, the plaintiff declined to accept the Proposed Partnership Agreement. Instead, he proposed an alternative arrangement whereby the defendant would hold 50 of the Company’s shares, being 50% of the Company’s shareholding at the material time, on trust for the plaintiff. The plaintiff would then loan a sum of MYR350,000 to the defendant in his personal capacity. It was mutually understood that the parties would use the loan monies to further the Company’s business.8Foot Note 8×PBAEIC 1 at p 11, para 37 11 The defendant agreed to the plaintiff’s proposal. Accordingly, the parties executed a loan agreement (“the Loan Agreement”) for a sum of MYR350,000 (“the Loan Sum”), as well as a trust deed (“the Trust Deed”), dated 29 November 2014 and 30 November 2014 respectively.9Foot Note 9×PBAEIC 1 at p 13, para 50 and p 14, para 52",
        "The material terms of the Trust Deed": "12 It is undisputed that the Trust Deed created an express trust in favour of the plaintiff. The terms of the Trust Deed which are material to the present dispute are as follows:10Foot Note 10×ABD 2 at pp 510–511 1. DECLARATION OF TRUST The Nominee declares that he: (a) holds 50 ordinary shares in the Company (the “Shares”) as nominee and on trust for the Beneficial Owner; and (b) has no beneficial interest in the Shares. … 3. DIRECTORSHIP … 3.3 The Nominee shall, in relation to the Reserved Matters, exercise his rights as the legal and beneficial shareholder of the ordinary shares in the Companyin agreement with the instructions of the Beneficial Owner. 3.4 For the purposes of this clause 3, “Reserved Matters” shall mean: … (b)Increase the amount of the Company’s issued share capital [except as provided in this agreement], granting any option or other interest (in the form of convertible securities or in any other form) over or in its share capital, redeeming or purchasing any of its own shares oreffecting any other reorganisation of its share capital, including and not being limited to the transfer of the legal and/or beneficial interests in the shares of the Company held in the Nominee’s name from the Nominee to any other person, including existing shareholders; … [emphasis added]",
        "Issuance of shares by the Company": "13 Shortly after receiving the Loan Sum from the plaintiff, the defendant caused the Company to allot an additional 350,000 shares to himself through an ordinary resolution dated 15 January 2015 (“the Share Issuance”).11Foot Note 11×PBAEIC 1 at p 17, para 67; DBAEIC 1 at p 7, para 28Consequently, the Company’s share capital was increased from 100 shares to 350,100 shares. 14 The plaintiff avers that the Share Issuance was unauthorised and that he had no knowledge of the Share Issuance until his solicitors sent him a search result of the Company from the Companies Commission of Malaysia (“the Business Profile”) on 29 June 2018. The Business Profile confirmed that the defendant had held a total of 350,080 shares in the Company since January 2015.12Foot Note 12×PBAEIC 1 at p 19, paras 80–82 15 The defendant disputes the plaintiff’s alleged ignorance of the Share Issuance. He contends that the plaintiff must have known of the Share Issuance since the plaintiff was provided with the Company’s audited financial reports from as early as 15 February 2016. These reports contained information on the number and allotment of the Company’s shares after the Share Issuance.13Foot Note 13×DBAEIC 1 at p 7, paras 26–28",
        "Events leading up to the present action": "16 From 2015 to 2018, the defendant ran the day-to-day operations of the Company while the plaintiff assisted in maintaining the Company’s network and distribution portfolio.14Foot Note 14×PBAEIC 1 at pp 16–17, paras 63–64 and p 18, para 74The plaintiff was formally appointed as a director of the Company on 15 January 2016.15Foot Note 15×DBAEIC 1 at p 9, para 35 17 In or around early August 2018, the plaintiff and the defendant had a disagreement over the plaintiff’s refusal to sign off on several directors’ resolutions which required his approval.16Foot Note 16×DBAEIC 1 at p 10, para 39; PBAEIC at p 23, para 96The relationship between the parties deteriorated soon thereafter. 18 On 23 August 2018, the plaintiff through his solicitors sent a letter to the defendant which,inter alia, recalled the Loan Sum with interest of RM602,129.67 (“the Disputed Interest Sum”). Subsequently, a general meeting was convened to remove the plaintiff from his position as director.17Foot Note 17×DBAEIC 1 at p 10, para 39The plaintiff ceased to be a director of the Company with effect from 23 October 2018. 19 The defendant repaid the Loan Sum in full but declined to pay the Disputed Interest Sum as he was of the view that it had been erroneously calculated. On 20 December 2018, the defendant through his solicitors sent a letter to the plaintiff setting out what he believed to be the correct interest sum.18Foot Note 18×PBAEIC 1 at p 12, para 45–p 14, para 57 and pp 1032–1033 20 The plaintiff subsequently abandoned his pursuit of the Disputed Interest Sum and focused his attention on the Share Issuance instead. On 18 January 2019, the plaintiff through his solicitors sent another letter to the defendant, alleging that the defendant had breached the Trust Deed by effecting the Share Issuance without the plaintiff’s prior consent.19Foot Note 19×DBAEIC 1 at p 14, para 60On 11 February 2019, the plaintiff commenced the present action, seeking equitable compensation and/or an order for the defendant to buy out his shares in the Company.",
        "The parties’ cases": "",
        "The plaintiff’s case": "21 The plaintiff’s claim is a straightforward action for breach of the Trust Deed. Specifically, the plaintiff alleges that the defendant breached Clause 3.3 (read with Clause 3.4(b)) of the Trust Deed by causing the Company to execute the Share Issuance without the plaintiff’s authorisation.20Foot Note 20×Plaintiff’s Closing Submissions (“PCS”) at para 4 22 The plaintiff’s case essentially hinges on his assertion that he was not notified of and did not consent to the Share Issuance at any point in time.21Foot Note 21×PCS at paras 16–17In support of this position, the plaintiff relies on,inter alia, evidence which allegedly demonstrates that the parties were intended to be “equal partners” in the Company at all material times.22Foot Note 22×PCS at para 26",
        "The defendant’s case": "23 As a preliminary matter, the defendant seeks to expunge certain portions of the plaintiff’s Affidavit of Evidence-in-Chief (“AEIC”), on the basis that they constitute inadmissible evidence. 24 On the question of liability, the defendant contends that he did not breach the terms of the Trust Deed because: (a) it was never mutually envisaged that the parties would each own a 50% share in the Company;23Foot Note 23×Defendant’s Closing Submissions (“DCS”) at para 71and (b) the evidence demonstrates that the plaintiff knew and approved of the Share Issuance from as early as 15 February 2016.24Foot Note 24×DCS at paras 95–96 25 Further or alternatively, the defendant argues thateven ifhe has acted in breach of trust, he is not liable to compensate the plaintiff because:25Foot Note 25×DCS at paras 146–195 and 223 (a) the plaintiff has approached the court with “unclean hands”; (b) the plaintiff’s claim is barred by laches; (c) the plaintiff has acquiesced to the Share Issuance; (d) the plaintiff is estopped by his conduct from claiming that he never agreed to the Share Issuance; and/or (e) the plaintiff has waived his right to object to the Share Issuance. 26 Finally, the defendant contends that the plaintiff is in any event disentitled to the relief he seeks because he has failed to prove his loss and/or establish the quantum of his claim.",
        "Issues to be determined": "27 Based on the foregoing, the key issues to be determined in the present case are as follows: (a) whether the portions of the plaintiff’s AEIC which the defendant objects to are inadmissible; (b) whether there was a breach of the terms of the Trust Deed; (c) whether the plaintiff’s claim is defeated by any applicable defence(s) (ie,“unclean hands”, laches, acquiescence, estoppel and/or waiver); and (d) whether the plaintiff is entitled to the remedies he seeks.",
        "Preliminary issue: Admissibility of certain portions of the plaintiff’s AEIC": "28 I first address the defendant’s objections to the admissibility of certain portions of the plaintiff’s AEIC. These objections may be briefly summarised as follows: (a) Paragraphs 105–168 of the plaintiff’s AEIC contain inadmissible lay opinion evidence on the valuation of the Company’s shares (“the Lay Opinion”).26Foot Note 26×DCS at para 49 (b) Paragraphs 20–48 of the plaintiff’s AEIC contain evidence of negotiations leading up to the finalised Trust Deed (“the Negotiation Evidence”), which is inadmissible for the purpose of altering and/or adding to the meaning of the words contained in the Trust Deed.27Foot Note 27×DCS at para 68.1 (c) Paragraphs 32–34 of the plaintiff’s AEIC contain inadmissible hearsay statements of legal opinion which were allegedly rendered by the plaintiff’s foreign lawyers (“the Hearsay Legal Opinion”).28Foot Note 28×DCS at para 68.2 (d) Paragraphs 20–43 of the plaintiff’s AEIC, and especially paragraphs 20, 42 and 43, contain statements which are irrelevant and inadmissible in so far as they impute criminality and/or immorality to the defendant (“the Scandalous Statements”).29Foot Note 29×DCS at para 68.3 29 In the alternative, the defendant asserts that the abovementioned portions of the plaintiff’s AEIC should be given little or no weight. 30 In response, the plaintiff points out that the defendant has already attempted, without success, to expunge the abovementioned paragraphs on the first day of the trial. His repeated application is therefore vexatious and doomed to fail.30Foot Note 30×Plaintiff’s Reply Submissions (“PRS”) at paras 52–56 31 I begin by explaining my grounds for dismissing the defendant’s earlier application. Order 41 r 6 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”) provides that “[t]he Court may order to be struck out of any affidavit any matter which is scandalous, irrelevant or otherwise oppressive”. However, as the plaintiff correctly notes, an application for such an order must generally be made by way of originating summons, prior to the commencement of the trial. It was therefore procedurally improper for the defendant to bring an application of this nature at such a belated stage. 32 My decision on the defendant’s striking-out application does not, however, preclude me from ruling on theadmissibilityof the plaintiff’s affidavit evidence (seeSingapore Civil Procedure2020, vol 1 (Hon Justice Chua Lee Ming ed) (Sweet & Maxwell, 10th ed, 2020) at para 38/2/7). Indeed, O 38 r 2(5) of the ROC explicitly clarifies that inadmissible evidence will not be made admissible solely by virtue of its inclusion in an AEIC. 33 With this context in mind, I now turn to consider each of the defendant’s objectionsseriatim.",
        "The Lay Opinion": "34 The defendant’s objection to the admissibility of the Lay Opinion rests primarily on his contention that the plaintiff lacks expertise in the field of share valuation and is thus unqualified to give evidence in that field.31Foot Note 31×DCS at para 62 35 The parties are agreed that the plaintiff’s evidence on the valuation of the Company’s shares constitutes opinion evidence, which is generally admissible only if (a) it constitutes expert opinion under s 47 of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”); or (b) it falls within a category of lay opinion which is admissible under the EA. 36 I begin therefore by examining the question of whether the plaintiff qualifies as an “expert” within the meaning of the EA. The relevant provision in this regard is s 47(2) of the EA, which defines an “expert” as “a person with such scientific, technical or other specialised knowledge based on training, study or experience”. This definition is generally applied with “considerable laxity”: while the expert must be skilled, he may be so by experience rather than by special study (seeLeong Wing Kong v Public Prosecutor[1994] 1 SLR(R) 681 at [16], citingPublic Prosecutor vMuhamed bin Sulaiman[1982] 2 MLJ 320). Nevertheless, the mere fact of experience will not justify a witness giving expert testimony unless that experience relates specifically to the matters in issue: see Jeffrey Pinsler SC,Evidence and the Litigation Process(LexisNexis, 6th Ed, 2017) (“Evidence and the Litigation Process”) at para 8.025. 37 In the present case, the plaintiff holds himself out as someone who has extensive experience in the supply and distribution of medical devices, having been in the medical device industry for “more than 10 years”.32Foot Note 32×PCS at para 118This knowledge of the medical device supply chain is, however, of limited assistance where thevaluation of the Company’s sharesis concerned. As Vinodh Coomaraswamy J opined inPohFu Tek and others v Lee Shung Guan and others[2018] 4 SLR 425 at [33], the valuation of shares is a “wide and specialist subject”, entailing complex considerations of a technical and mathematical nature. The plaintiff has not given me any reason to believe that he possesses the requisite experience and/or qualifications to deal with matters of this kind. In fact, he has expressly conceded that he is not a certified accountant33Foot Note 33×NE, 11 November 2019, 20/25and that he lacks any form of accounting expertise.34Foot Note 34×NE, 11 November 2019, 22/15I am thus of the view that he is unqualified to give expert evidence on the valuation of the Company’s shares. 38 However, the inquiry does not end here. While it used to be the general rule that laypersons could not adduce opinion evidence unless it fell within the specific categories of lay opinion enumerated under ss 49–52 of the EA (see foregSim Cheng Soon v BT Engineering Pte Ltd and another[2007] 1 SLR(R) 148 at [22]), Parliament has since enacted a more general exception under s 32B(3) of the EA, which provides as follows: (3)  Where a person is called as a witness in any proceedings, a statement of opinion by him on a relevant matter on which he is not qualified to give expert evidence,if made as a way of conveying relevant facts personally perceived by him, is admissible as evidence of what he perceived. [emphasis added] 39 The purpose of s 32B(3) of the EA was explained inTanJoon Wei Wesley v Lee Kim Wei[2013] SGHCR 24 (at [45]) as follows: Section 32B(3) of the EA applies to the situation where theopinion or inference is a way of communicating facts which the witness had seen. An example would be when a witness to a traffic accident may be allowed to testify that the driver involved was intoxicated, the witness’s opinion that the driver was intoxicated being inferred from what he had observed, for example the driver had blood-shot eyes, an unsteady gait and slurry speech. The opinion would provide clarity to the witness’ testimony. It makes sense as such to allow for its admission.There would be little risk in admitting such evidence as the court will be able to assess the opinion against evidence of the facts upon which it is based. … [emphasis added] 40 It is clear, in my view, that the plaintiff’s lay opinion doesnotfall within the category of lay opinion evidence envisaged by s 32B(3) of the EA. This was evidently not a situation in which the plaintiff had given his opinion in order to express or communicate some fact(s) which he had personally observed. Rather, as the defendant asserts, the plaintiff had simply taken it upon himself to fulfil the role of a valuation expert by “pluck[ing] various different formulas off the internet (including from Google), and appl[ying] them based on his own understanding”.35Foot Note 35×DCS at para 63The product of the plaintiff’s calculations is, with respect, arbitrary and wholly unreliable. 41 As such, I agree with the defendant’s submissions that paragraphs 105–168 of the plaintiff’s AEIC are inadmissible for the purpose of assessing the quantum of the plaintiff’s claim.",
        "The Negotiation Evidence": "42 I now turn to the defendant’s objection to the admissibility of the Negotiation Evidence. 43 InKohLau Keow and others v Attorney-General[2014] 2 SLR 1165, the Court of Appeal opined (at [25]) that there is no absolute or rigid prohibition against the admissibility of extrinsic evidence for the purposes of construing a trust deed, particularly where such extrinsic evidence is objectively demonstrative of the settlor’s intent. However, the court did not have an opportunity to comment on the admissibility of evidence ofprior negotiationsin particular. 44 In my view, guidance on this specific issue may be drawn from the realm of contract law. Of particular salience is the Court of Appeal’s pronouncement inZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (at [132(d)]) that evidence of previous negotiations would only be admissible for the purposes of contractual interpretation if it is relevant, reasonably available to all contracting parties, and relates to a clear or obvious context. The Court of Appeal subsequently clarified inXiaZhengyan v Geng Changqing[2015] 3 SLR 732 that these requirements are likely to be satisfied with little difficulty where the plain wording of the contract is “extremely clear”, such that the evidence of prior negotiations “serves … aconfirmatory(and, hence, complementary as well as subsidiary) function” (at [69]). 45 I see no reasons in principle against applying the above contractual principles to the construction of trust deeds. The interpretation of a contract begins with the same ideological premise as the interpretation of a deed: in both contexts, it is the objectively-ascertained intentions of the parties to the instrument which forms the cornerstone of the interpretative exercise. It is also apposite to note that English and Australian authorities have readily and consistently extended the principles governing the interpretation of contracts to the interpretation of deeds, including trust deeds (see foreg,Vandervell v Inland Revenue Commissioners[1967] 2 AC 291 at 312;Byrnes vKendle(2011) 243 CLR 253 at [53]; Matthew Conaglen, “Sham Trusts” (2008) 67(1) CLJ 176 at 181). 46 Returning to the facts of the present case, I note that the defendant’s objection to the Negotiation Evidence rests primarily on his allegation that the Negotiation Evidence was tendered “for the purpose of changing and/or adding to the meaning of the words contained [in the Trust Deed]”. I am unable to agree with this submission. The plaintiff’s claim is premised solely on Clauses 3.3 and 3.4(b) of the Trust Deed, the plain wording of which clearly and unambiguously prohibit the defendant from increasing the Company’s issued share capital without the plaintiff’s consent. There is nothing in paragraphs 20–48 of the plaintiff’s AEIC which contradicts or detracts from this interpretation. If anything, I find that the Negotiation Evidence serves aconfirmatoryfunction in so far as it underscores the parties’ mutual willingness to consult each other on matters involving the Company’s share capital. 47 Further and in any event, I am of the view that the Negotiation Evidence satisfies the threeZurich Insurancerequirements. It is relevant because it illuminates the intended meaning of the Trust Deed. It was reasonably available to both parties as it had been contemporaneously documented in their e-mail exchanges with one another. Finally, it relates to an obvious context,ie,the circumstances surrounding the formation of the Trust Deed. 48 Thus, I find that the Negotiation Evidence is admissible to support the literal meaning of Clauses 3.3 and 3.4(b) of the Trust Deed, and that it should be given due weight for this purpose.",
        "The Hearsay Legal Opinion": "49 The only material statement in paragraphs 32–34 of the plaintiff’s AEIC is the plaintiff’s remark (at paragraph 33) that “[the plaintiff] could not hold shares as a registered shareholder in the Company as long as [he] was an employee of Sonova AG”.36Foot Note 36×PBAEIC 1 at p 11, para 33This statement is relevant for the purposes of proving the defendant’s “unclean hands” defence. Further, it is neither hearsay nor opinionas it contains facts which were personally perceived by the plaintiff, and which were subsequently affirmed by the plaintiff in cross-examination.37Foot Note 37×NE, 11 November 2019, 13/16–22I am accordingly of the view that paragraph 33 of the plaintiff’s AEIC is admissible in evidence and should be given full weight. 50 Paragraphs 32 and 34 of the plaintiff’s AEIC are irrelevant to the issues in the present dispute save to the extent that they set the background for the creation of the Trust Deed and the Loan Agreement. As such, I agree with the plaintiff that it is unnecessary for me to make a finding on their admissibility.",
        "The Scandalous Statements": "51 Finally, I come to the Scandalous Statements. These are statements which suggest that the defendant had allotted Company shares to his wife and his mother because he wanted to “cut down [on his] income tax submission”.38Foot Note 38×PBAEIC 1 at p 12, para 43 52 It is evident that the Scandalous Statements do not fall within the categories of relevant facts enumerated under ss 6–11 of the EA. As the defendant points out, the plaintiff’s claim relates to his interest in the 50 shares which the defendant held on trust for him. The fact that the defendant’s relatives held (and continue to hold) a proportion of the shares in the Company, and the reason(s) behind this arrangement, have no bearing whatsoever on this claim. Further, the Scandalous Statements impute criminality and/or unethical character to the defendant and are thus inadmissible under s 54 of the EA, which provides that “in civil cases the fact that the character of any person concerned is such as to render probable or improbable any conduct imputed to him is irrelevant, except in so far as such character appears from facts otherwise relevant”. As such, I decline to admit the Scandalous Statements into evidence.",
        "Whether there was a breach of the terms of the Trust Deed": "53 I now address the primary issue in the present dispute. This involves the question of whether the defendant committed a breach of trust by executing the Share Issuance on 15 January 2015. 54 Before delving into my analysis proper, I wish to make a preliminary observation about the parties’ characterisation of this issue. I am conscious of the fact that both the plaintiff and the defendant have devoted a substantial amount of ink and effort to the question of whether it was mutually intended that the plaintiff would hold a 50% share (as opposed to 50shares) in the Company. I must clarify at the outset that, in my view, this inquiry is only relevant to the extent that it affects thequantumof relief that the plaintiff would be entitled to if he succeeds in his claim. It isnotdeterminative of the existence of liability in the present case. 55 To reiterate, the breach alleged by the plaintiff is the defendant’s failure to comply with the directions under Clause 3.3 read with Clause 3.4(b) of the Trust Deed by “increas[ing] the amount of the Company’s issued share capital” without the plaintiff’s consent.39Foot Note 39×PRS at para 81The defendant does not dispute the plaintiff’s interpretation of Clauses 3.3 and 3.4(b) of the Trust Deed. Nor does he deny that he was responsible for executing the Share Issuance. As such, putting aside all potential defences and proof of loss issues, the only crucial question to be addressed in the present case is this: Did the plaintiff authorise the Share Issuance? In my view, this inquiry can be further broken down into two subsidiary issues: (a) First, did the plaintiffknowof the Share Issuance, and if so,whendid he acquire this knowledge? (b) Secondly, assuming that the plaintiffknewof the Share Issuance, did heagreeorconsentto it? 56 I proceed to examine each of these issues in turn.",
        "Knowledge of the Share Issuance": "57 The defendant’s case is that the plaintiff first came to know of the defendant’s intention to effect the Share Issuance during an oral conversation which purportedly took place between the parties in December 2014 (“the Alleged Oral Conversation”).40Foot Note 40×NE, 13 November 2019, 69/16–24; DCS at para 113 58 Further or alternatively, the defendant asserts that the plaintiff must have come to know of the Share Issuance by 15 February 2016 at thevery latest. This was the date on which the plaintiff signed off on the Company’s first audited financial report,41Foot Note 41×DCS at para 96the first page of which contained information about the Company’s share capital after the Share Issuance.42Foot Note 42×DBAEIC 1 at p 7, para 38 59 I first deal with the parties’ contentions regarding the Alleged Oral Conversation. According to the defendant, this conversation had taken place while the defendant was updating the plaintiff on the Company’s challenges in relation to the acquisition of new customers. To address these concerns, the defendant purportedly suggested “raising the [Company’s] capital” so that he could “submit the [Company’s] financial information to all the new customer [sic] for them to do the supplier due diligence”.43Foot Note 43×NE, 13 November 2019, 69/16–21 60 I find, on the balance of probabilities, that the Alleged Oral Conversation never took place. First, despite its obvious importance to the defendant’s case, the Alleged Oral Conversation had not been pleaded or mentioned in the defendant’s AEIC and only belatedly surfaced during the defendant’s cross-examination. When queried as to why this was the case, the defendant explained that:44Foot Note 44×NE, 13 November 2019, 70/8–11 When I provide---when I was providing information to my solicitors, I was trying to look for the documents evidence. So this is purely based on the oral discussions between the---myself and the plaintiff so I couldn’t really find any recorded evidence on that. That’s why I did not write it in. 61 I am unable to accept this explanation, which is, in my view, contrived and thoroughly unconvincing. As the plaintiff points out, the defendant had no qualms about referring to other oral discussions in his AEIC, despite the fact that he lacked documentary evidence to back up their existence. These alleged oral discussions include,inter alia, the defendant’s first meeting with the plaintiff in September 201445Foot Note 45×DBAEIC 1 at p 2, para 6and the alleged phone conversation between the parties in or around October 2014.46Foot Note 46×DBAEIC 1 at p 4, para 15It is odd that the defendant did not raise the existence of the Alleged Oral Conversation when he had multiple opportunities to do so, especially since he had thought to mention significantly less material oral discussions in his AEIC. 62 Secondly, the existence of the Alleged Oral Conversation was never put to the plaintiff during cross-examination. This is a violation of the rule inBrowne v Dunn(1893) 6 R 67, which requires parties to put contradictory facts to a witness during cross-examination in order to give the witness an opportunity to respond to them. Consequently, I am entitled to regard the plaintiff’s evidence (that he was never verbally informed of the increase in the Company’s share capital) as undisputed. 63 Thirdly, the contents of the Alleged Oral Conversation are unsubstantiated by any evidence apart from the defendant’s own assertions. In my view, the defendant has not shown himself to be a reliable or consistent witness. During cross-examination, he was able to recall the details of the Alleged Oral Conversation with apparent clarity, yet claimed to have lost all recollection of the extraordinary general meeting (“EGM”) during which the Share Issuance purportedly took place.47Foot Note 47×PCS at paras 50–54This was despite the fact that the Alleged Oral Conversation had taken place in December 2014, one monthpriorto the EGM in January 2015. The defendant’s unexplained amnesia, when juxtaposed against his seemingly flawless recollection of the contents of the Alleged Oral Conversation, significantly detracts from the credibility of his evidence as a whole. In the absence of any objective evidence to the contrary, I find that the Alleged Oral Conversation was nothing more than a convenient excuse which the defendant had fabricated on the stand in order to evade liability.48Foot Note 48×PCS at para 45 64 Next, I turn to the defendant’s contention that the plaintiff was presented with information about the Share Issuance by 15 February 2016, when he signed off on the Company’s first audited financial report for the period from 19 September 2014 to 31 December 2015 (“the 2014/2015 Financial Report”). 65 The first page of the 2014/2015 Financial Report provides as follows:49Foot Note 49×ABD 2 at p 724 ISSUE OF SHARES AND DEBENTURES During the period, the following issue of shares were made by the Company:-  ClassNumberTerms of issuePurpose of issueOrdinary RM1100CashSubscribed sharesOrdinary RM1350,000CashIncrease working capital 66 The third page of the 2014/2015 Financial Report also contains a table detailing the shareholdings of each of the Company’s directors. In this table, the defendant is recorded as having a balance of 350,080 shares in the Company as at 31 December 2015.50Foot Note 50×ABD 2 at p 726 67 The plaintiff does not dispute that he signed off on the 2014/2015 Financial Report on 15 February 2016.51Foot Note 51×ABD 2 at p 745However, he denies that he knew or ought to have known of the Share Issuance by virtue of that act.52Foot Note 52×PRS at para 93He attributes his ostensible oversight to the fact that he was “very much focus[ed] on … bringing the [Company] [to] a … profitable position” and hence “did not focus on each particular figure” in the report.53Foot Note 53×NE, 11 November 2019, 57/28–32 68 I am not persuaded by the plaintiff’s argument which, in my view, amounts to little more than a bare denial of knowledge. As the defendant points out, the plaintiff was “no sleeping director”.54Foot Note 54×DCS at para 26When sent updates of the Company’s operating status, the plaintiff would sometimes respond with questions and/or requests to inspect certain documents.55Foot Note 55×DBAEIC 1 at p 9, para 36; ABD 2 at p 716He also frequently attended at the Company’s office to execute paperwork and to inspect the Company’s books and affairs.56Foot Note 56×DBAEIC 1 at p 9, para 37Given the diligence with which the plaintiff conducted his duties as a director, I find it difficult to believe that he was unaware of the Share Issuance even though it was explicitly documented on thevery first pageof the 2014/2015 Financial Report. Consequently, I agree with the defendant that the plaintiff must have had knowledge of the Share Issuance since 15 February 2016.",
        "Authorisation of the Share Issuance": "69 I hasten to add, however, that my findings above unfortunately do not assist the defendant’s case. As the Share Issuance occurred inJanuary 2015, there was a “gap of 13 … months between [the defendant’s] actions and the [plaintiff’s] … knowledge”.57Foot Note 57×PRS at para 94It would thus be incorrect to suggest that the Share Issuance was carried out “in agreement with the instructions of the [plaintiff]”, pursuant to Clause 3.3 of the Trust Deed – after all, a person cannot possibly authorise or agree to something of which he had no knowledge at the material time. 70 In these circumstances, I find that the defendant has committed a breach of Clause 3.3 read with Clause 3.4(b) of the Trust Deed. I now proceed to examine the defences which, according to the defendant, defeat the plaintiff’s claim in its entirety. These consist of both equitable defences (ie, “unclean hands”, laches and acquiescence) as well as general defences (ie, estoppel and waiver).",
        "Whether the plaintiff’s claim is defeated by any applicable defences": "",
        "“Unclean hands”": "71 I turn first to the defendant’s “unclean hands” defence, which is based on the equitable maxim that “he who comes to equity must come with clean hands”. The principles relating to this defence were summarised by Sundaresh Menon JC (as he then was) inHong Leong Singapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 (“Hong Leong”) at [225]–[226] as follows: 225 It is true that a plaintiff in equity must approach the court with clean hands but this does not mean he must be blameless in all ways. Firstly, the undesirable behaviour in question must involve more than general depravity. “[I]t must have animmediate and necessary relation to the equity sued for; it must beadepravity in a legal as well as in a moral sense”: seeDering v Earl of Winchelsea[1775–1802] All ER Rep 140. ... 226 Moreover, the principle has lost some of its vitality over time. The position is set out thus inHalsbury’s Laws of Singaporevol 9(2) (LexisNexis, 2003) at para 110.016: The maxim has been relaxed over time and is no longer strictly enforced. The question is whether in all the circumstances it would be a travesty of justice to assist the plaintiff given his blameworthy participation or role in the transaction.The whole circumstances must be taken into account having regard to the relief sought, for the relative blameworthiness only emerges after a complete and exhaustive scrutinyand relief which is less drastic need not be defeated by conduct that is less opprobrious. … [emphasis added] 72 The doctrine of “unclean hands” is not as well-defined as its common law counterpart, the defence of illegality. Nevertheless, two features of the “unclean hands” defence are apparent. First, the conduct complained of must bear an immediate and necessary relation to the equity sued for (seeHong Leongat [225];E C Investment Holding Pte Ltd vRidout Residence Pte Ltd and others and another appeal[2012] 1 SLR 32 at [92]). Secondly, the court must undertake a “complete and exhaustive scrutiny” of all the circumstances in a particular case in order to ascertain whether it would be a travesty of justice to grant a plaintiff relief (seeHong Leongat [226]). 73 Beyond these two general principles, reference must be had to case law in order for one to fully appreciate the types of factual matrices which may disclose a successful “unclean hands” defence. See I C F Spry,The Principles of Equitable Remedies: Specific Performance, Injunctions, Rectification and Equitable Damages(Sweet & Maxwell, 8th ed, 2010) at pp 5–6: … [I]t becomes clear that the maxim that predicates a requirement of clean hands does not set out a rule that is either precise or capable of satisfactory operation. Rather in order to establish whether equitable relief should be refused through dishonesty or on a cognate groundit is necessary to examine precisely the rules and practices which have been established and followed by courts of equityand which are generally referable to such established considerations as fraud, misrepresentation, illegality or unfairness. … [emphasis added] 74 In the present case, the defendant asserts that the plaintiff has acted with “unclean hands” in two material respects: first, by using the present action as a “backdoor route” to recover the Disputed Interest Sum;58Foot Note 58×DCS at para 211and secondly, by breaching the contractual and fiduciary duties which he owed to his former employer, Sonova, through the execution of the Trust Deed.59Foot Note 59×DCS at para 220I examine each of these contentions in greater detail below. Commencing the Suit as a “backdoor route” to recover the Disputed Interest Sum 75 The first plank of the defendant’s “unclean hands” defence rests on the premise that the plaintiff has commenced the Suit in order to obtain the Disputed Interest Sum, which he had earlier failed to recover from the defendant because of “his own poor drafting”.60Foot Note 60×DCS at para 211 76 In my judgment, this argument is clearly a non-starter. In the first place, it is entirely speculative for the defendant to suggest that the present action is in any way linked to the plaintiff’s earlier unsuccessful attempts to recover the Disputed Interest Sum. There are numerous possible reasons – legal, commercial and/or personal – as to why one might decide to pursue or discontinue the pursuit of a legal demand. The fact that the plaintiff “conveniently omit[ted] to raise any issue about the Share Issuance until his failure to claim the [Disputed] Interest Sum”61Foot Note 61×DCS at para 209is notipso factosufficient to demonstrate a connection between the present action and his unsuccessful recovery of the Disputed Interest Sum. 77 Secondly,even ifthe plaintiff only commenced the present Suit as a “backdoor route” to recover the Disputed Interest Sum, I do not think that such conduct would suffice to form the basis of an “unclean hands” defence. It is clear fromHong Leongthat the plaintiff’s undesirable conduct must “be a depravity in a legal as well as in a moral sense”. In my view, pursuing one cause of action when another is thought to be unlikely to succeed is not morally reprehensible, much less a legal wrong. As such, this aspect of the defendant’s “unclean hands” defence necessarily fails. Breaching contractual and fiduciary duties owed to Sonova 78 The second plank of the defendant’s “unclean hands” defence is that the plaintiff acted in breach of his contractual and fiduciary duties to Sonova by acquiring beneficial ownership of the Company’s shares through his trust arrangement with the defendant. 79 The plaintiff objects to this submission on three grounds. First, he avers that the defendant is precluded from relying on this argument since it was neither raised nor particularised in the defendant’s pleadings.62Foot Note 62×PRS at para 149Secondly, he contends that the defendant has failed to adduce sufficient evidence of the plaintiff’s alleged breaches.63Foot Note 63×PCS at para 78Thirdly, he argues that even if these breaches did occur, they cannot form the basis of an “unclean hands” defence because they do not bear an immediate and necessary relation to the equity sued for.64Foot Note 64×PRS at para 145I will examine each of these objections in turn. (1) Whether the plaintiff’s alleged breaches were adequately pleaded 80 I deal first with the point on pleadings. As the Court of Appeal explained inVNithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 (“VNithia”) at [38], the general rule is that the court is precluded from deciding on any matter which the parties have not put into issue. However, the law permits a departure from this rule in limited circumstances, where no prejudice is caused to the other party or where it would be clearly unjust for the court not to do so (seeVNithiaat [40];OMG Holdings Pte Ltd vPos Ad Sdn Bhd[2012] 4 SLR 231 at [18]). 81 In my view, the defendant’s failure to provide particulars of the plaintiff’s alleged breaches has not caused irreparable prejudice to the plaintiff. First, there is nothing to suggest that the defendant knew of the plaintiff’s non-compete duty until it was expressly raised in the plaintiff’s AEIC, which was filedafterthe close of pleadings.It was theplaintiffwho hadvoluntarilyrevealed the existence of this duty to the Court and to the defendant. In light of these circumstances, it does not now lie in the plaintiff’s mouth to suggest that he was unfairly taken aback by the defendant’s submissions on this point. The plaintiff should have prepared for the likely consequences of exposing the motive(s) behind his conduct. 82 Secondly, although the defendant did not amend his Defence to incorporate the particulars of the plaintiff’s alleged breaches, I do not think that the plaintiff has suffered any substantial injustice as a result of this omission. By the plaintiff’s own admission, the circumvention of the non-compete clause was “[o]ne of thefirstissues that the [defendant] raisedat the startof the trial”65Foot Note 65×PCS at para 72[emphasis added]. The plaintiff has had ample opportunity to address (and has in fact comprehensively addressed) the defendant’s contentions on this issue, both at trial as well as in his written submissions. (2) Whether the defendant has proven the plaintiff’s alleged breaches 83I turn now to the plaintiff’s second submission. This involves the issue of whether the defendant has satisfactorily proven the plaintiff’s alleged breaches. 84It is important to reiterate that two separate (albeit interrelated) breaches are being alleged here – the first being the breach of the fiduciary duties which the plaintiff purportedly owed to Sonova, and the second being the breach of a non-compete clause which was incorporated into the plaintiff’s employment contract with Sonova. 85To demonstrate that a fiduciary relationship exists between the plaintiff and Sonova, the defendant referred me to the High Court’s decision inClearlabSG Pte Ltd v Ting Chong Chai and others[2015] 1 SLR 163(“Clearlab”). In that case, Lee Seiu Kin J opined that it was possible for an employee to owe fiduciary duties to his employer, although this would generally be “the exception rather than the norm” (Clearlabat [272]). Elaborating on the conditions under whichfiduciary duties might arise in such a context, Lee J held (at [272]–[273]) that: 272 … For the court to regard that an employee is also a fiduciary, the employee has to be placed in a position where he must act solely in the interests of his employer:University of Nottingham vFishel[2000] ICR 1462 at 1493E.The mere factof an employment relationship is not sufficient to support the existence of a fiduciary relationship.Rather, it must be shown that there are particular functions of the employee, which requires him to pursue the interests of his employer to the exclusion of other interests, including his own:Lonmar Global Risks Limited (formerly SBJ Global Risks Limited) v Barrie West[2010] EWHC 2878 (QB) at [152]. … 273 … Once a fiduciary relationship is found on the facts, there is further inquiry on whether it is engaged on the matters relied on by the plaintiff.There is no wholesale importation of every kind of fiduciary duty into each case, as that disregards what exactly it is about the particular employee’s situation that makes him a fiduciary. Even if the facts do bear a fiduciary relationship, it must be examined, in the particular circumstances, what are the fiduciary duties that arise. In this connection, the employment contract is of central importance. … [emphasis added in italics and bold italics] 86 Lee J then endorsed the following “rough and ready” guide to ascertain whether the imposition of a fiduciary obligation on an employee would be appropriate (seeClearlabat [275]): A rough and ready guide to whether or not the imposition of a fiduciary obligation would be appropriate are the three characteristics identified by Wilson J (dissenting) inRichard Hugh Frame v Eleanor Margaret Smith[1987] 2 SCR 99at [60] which were cited with approval by the Court of Appeal inSusilawativ American Express Bank Ltd[2009] 2 SLR(R) 737 at [41]: (1)    The fiduciary has scope for the exercise of some discretion or power. (2)    The fiduciary can unilaterally exercise that power or discretion so as to affect the beneficiary’s legal or practical interests. (3)    The beneficiary is peculiarly vulnerable to or at the mercy of the fiduciary holding the discretion or power. … 87 Applying this framework in the present case, I find that the defendant has not adduced sufficient evidence to prove, on a balance of probabilities, that the plaintiff owed fiduciary duties to Sonova. 88 I acknowledge that the first element of theClearlabframework is satisfied. The plaintiff, being the project leader of a team tasked to evaluate different models for the distribution of Sonova’s products in Malaysia,66Foot Note 66×NE, 11 November 2019, 5/26–29; PBAEIC 1 at p 3, para 13did exercise “some discretion or power” over Sonova’s Malaysian distribution strategy. 89 However, the defendant has not established the second and third elements of theClearlabframework. Apart from highlighting the plaintiff’s position as a “project leader”, the defendant has not led any evidence to show that the plaintiff was capable ofunilaterallyexercising his power or discretion so as to affect Sonova’s legal or practical interests. Nor has the plaintiff shown how Sonova was “peculiarly vulnerable” to the plaintiff’s exercise of power. 90 Turning to the plaintiff’s alleged contractual breach, I am likewise of the view that the defendant has failed to adduce sufficient evidence to demonstrate that a breach of contract has in fact occurred. Crucially, the plaintiff has never once admitted that the terms of his employment contract prohibit him from acquiringbeneficialownership of the Company’s shares. On the contrary, he has consistently taken the position that his employment contract only restricts him from holding shares in the Company as aregisteredshareholder. This point is clearly encapsulated in the following portion of his cross-examination:67Foot Note 67×NE, 11 November 2019, 13/26–28 and 14/16–20 Q: Because if you held 50% share, or any number of shares in Swiss Medicare at the time, it would be in breach of your contract with Sonova. Correct? A:If it will be officially registered, yes. … Q: So, by having the trustee, you’re trying to lock down those shares and trying to claim ownership over them. Do you agree if you actually had locked down the shares---sorry, if you had actually had ownership over the shares, you would be in breach of your contract with Sonova? A:If it will be officially registered, yes. [emphasis added] 91 Regrettably, the defendant has not tendered a copy ofthe plaintiff’s employment contract to counter the plaintiff’s testimony. Based on the evidence as it stands, I do not think that the defendant has discharged his onus of proving that the plaintiff committed a breach of contract by executing the trust arrangement. 92 Further, although the plaintiff expressly conceded during cross-examination that he had utilised the Trust Deed to “get around” the terms of his employment contract with Sonova,68Foot Note 68×NE, 11 November 2019, 14/3–6I do not read this statement as an admission that the trust arrangement was necessarily illegal and/or a breach of contract. One could very well utilise alegalmechanism to circumvent or “get around” what would otherwise be an illegal situation. 93 In view of these findings, the plaintiff cannot be said to have committed any act which is a “depravity in alegalas well as in a moral sense” [emphasis added]. It is thus unnecessary for me to evaluate the plaintiff’s third objection, which is that his alleged wrongdoing is not sufficiently connected to the equity sued for in the instant case.",
        "Laches": "94 The equitable defence of laches was summarised by the High Court inCytec Industries Pte Ltd v APP ChemicalsInternational (Mau) Ltd[2009] 4 SLR(R) 769 at [46] as follows: Laches is a doctrine of equity. It is properly invoked where essentially there has been asubstantial lapse of time coupled with circumstances where it would be practically unjust to give a remedyeither because the party has by his conduct done that which might fairly be regarded as equivalent to a waiver thereof; or, where by his conduct and neglect he had, though perhaps not waiving that remedy, yet put the other party in a situation in which it would not be reasonable to place him, if the remedy were afterwards to be asserted (SukhpreetKaur Bajaj d/o Manjit Singh v Paramjit Singh Bajaj[2008] SGHC 207 at [23];Re Estate of TanKow Quee[2007] 2 SLR(R) 417 at [32]). This is a broad-based inquiry and it would be relevant to consider the length of delay before the claim was brought, the nature of the prejudice said to be suffered by the defendant, as well as any element of unconscionability in allowing the claim to be enforced (Re Estate of TanKow Queeat [38]). … [emphasis added] 95 Subsequently, inChngWeng Wah v Goh Bak Heng[2016] 2 SLR 464 (“ChngWeng Wah”), the Court of Appeal emphasised (at [44]) that the basis for equitable intervention by the doctrine of laches is “ultimately found in unconscionability” and that the inquiry “should be approached in a broad manner, as opposed to trying to fit the circumstances of each case within the confines of a preconceived formula derived from earlier cases”. 96 The defendant asserts that it is inequitable for the plaintiff to suddenly take issue with the Share Issuance even though he has long had knowledge of the same.69Foot Note 69×DCS at para 185In response, the plaintiff contends that it was well within his right to determine, on the advice of counsel, which claim to pursue and when it should be pursued.70Foot Note 70×PCS at para 88Further, he avers that the defendant has not been prejudiced by the lapse of time since “[a]ny possible evidence that the [defendant] intends to rely on in relation to the Company’s affairs [has been] in [the defendant’s] custody, possession and power at all material times”.71Foot Note 71×PCS at para 92 97 As determined at [68] above, the plaintiff has had knowledge of the Share Issuance since 15 February 2016. However, the plaintiff only informed the defendant of his intention to pursue his breach of trust claim on 18 January 2019, before commencing the present Suit on 11 February 2019. Thus, the delay in the present case was slightly under three years. 98 In my view, this three-year lapse was not so lengthy as to cause serious prejudice to the defendant. The facts of the present case are materially different from those inChngWeng Wah.In that case, the appellant argued that the doctrine of laches was applicable since the respondent’s 12-year delay in commencing legal proceedings had caused most of the relevant evidence to be lost or destroyed. The Court of Appeal agreed with the appellant’s submissions and highlighted that the parties had been in a personal relationship wherein they had “dealt with each other on a relatively informal basis”, resulting in a situation where “limited formal documentation was kept” (at [54]–[55]). Additionally, the respondent’s claim was premised on an oral trust with no express terms (at [55]). Accordingly, any attempt to reconstruct the events surrounding the dispute would necessarily depend on the strength of the parties’ recollection, which had been severely compromised by the intervening lapse of time (at [54] and [59]). 99 Returning to the facts of the present case, I note that the plaintiff and the defendant were, like the parties inChngWeng Wah, long-time friends who were fairly close to each other. However, the similarity between the two cases ends there. Despite the informality of their relationship, the plaintiff and the defendant had predominantly corresponded via e-mail, and the instrument on which the plaintiff’s action is founded – namely, the Trust Deed – was formally recorded in writing. It would therefore be incorrect to characterise this case as one where limited documentary evidence was available. Further, the 12-year lapse inChngWeng Wahwas four times the duration of the delay in the present case. It is unlikely that a span of three years would have eroded the defendant’s recollection to such an extent as to impair his ability to effectively conduct his defence, especially since he has the aid of relatively extensive documentary evidence. 100 In the premises, I am satisfied that the plaintiff’s delay is not sufficiently unconscionable to bar him from equitable relief. The defence of laches thus fails.",
        "Acquiescence": "101 The doctrine of acquiescence is described in the following manner inHalsbury’s Laws of Englandvol 16 (Butterworths, 4th Ed Reissue, 2000) at para 924 (cited by the Court of Appeal inGenelabsDiagnostics Pte Ltd v Institut Pasteur and another[2000] 3 SLR(R) 530 at [76]): The term acquiescence is … properly used where a person having a right and seeing another person about to commit, or in the course of committing an act infringing that right,standsby in such a manner as really to induce the person committing the act and who might otherwise have abstained from it, to believe that he consents to its being committed; a person so standing-by cannot afterwards be heard to complain of the act. In that sense the doctrine of acquiescence may be defined as quiescence under such circumstances that assent may reasonably be inferred from it and is no more than an instance of the law of estoppel by words or conduct … [emphasis added] 102 Thus, while laches in its strict sense refers to delay on the part of the plaintiff coupled with prejudice to the defendant, acquiescence is “premised not on delay, but on the fact that the plaintiff has, by standing by and doing nothing, made certain representations to the defendant in circumstances to found an estoppel, waiver, or abandonment of rights” (seeTan Yong San v Neo KokEng and others[2011] SGHC 30 at [114]). 103 InKohWee Meng v Trans Eurokars Pte Ltd[2014] 3 SLR 663 (“KohWee Meng”), Judith Prakash J (as she then was) explained (at [120]) that there are two types of situations in which the defence of acquiescence might be established: first, where a plaintiff abstains from interfering while a violation of his legal rights is in progress; and second, where a plaintiff refrains from seeking redress when a violation of his rights, which he did not know about at the time, is brought to his notice. In the second type of situation, the plaintiff will only be held to have acquiesced if he “stood by and saw the defendant dealing with property in a manner inconsistent with the right of the plaintiff” (KohWee Mengat [119], citingSPathmanathan v Amaravathi[1979] 1 MLJ 38). 104 In my view, the facts of the present case do not correspond to either of the two situations described above. I agree with the plaintiff thatKohWee Mengsupports, rather than detracts from, his position that he did not demonstrate any acquiescence.72Foot Note 72×PRS at para 126InKohWee Meng, the plaintiff discovered that a Rolls-Royce Phantom SWB automobile (“the Rolls”) which he had purchased from the defendant was defective. The plaintiff sent the Rolls back to the defendant for rectification works on a total of eight occasions in 2008 and 2009. Despite the defendant’s efforts, the plaintiff remained dissatisfied with the Rolls’ performance and eventually commenced an action against the defendant, seeking to reject the Rolls and obtain a full refund. 105 At the trial, the defendant argued that the plaintiff’s lack of complaint about the Rolls’ defects from end-September 2009 till the commencement of the action signified the plaintiff’s acquiescence in the defendant’s breach of contract. Rejecting this defence, Prakash J held (at [122]) that: … [I]t is unlikely that the plaintiff’s conduct during this period could have induced the defendant to believe that it would not be sued. The plaintiff had explained in court that he saw no point in raising the issue since the defendant had failed to solve the noise and vibration after a year. During this time, he had sent the Rolls back for servicing on a total of eight occasions buthad not indicated that he would not sue on the noise and vibration. Nor did he give the defendant an indication that he would not enforce his rights. The plaintiff’s conduct did not demonstrate any acquiescence nor did the defendant demonstrate any reliance on the alleged acquiescence. Therefore, there was no acquiescence in this case. [emphasis added] 106 It is thus apparent that acquiescence requires more than mere silence on the part of the plaintiff. To succeed in the defence, the defendant must prove that the plaintiff, by “standing by”, has made some representation or given some indication to the defendant that he does not intend to insist on his legal rights. I am unable to find any proof of that here. As such, the doctrine of acquiescence is inapplicable in the present case.",
        "Estoppel": "107 It is trite that the defendant must prove three elements in order to successfully make out a defence of promissory estoppel: (a) the plaintiff must have made a clear and unequivocal representation, whether by words or conduct, that he will not enforce his strict legal rights; (b) the defendant must have acted in reliance on the plaintiff’s representation and suffered detriment as a result; and (c) it must be “inequitable” for the plaintiff to resile from his promise (see foreg,Nanyang Medical Investments Pte Ltd vKuek Bak Kim Leslie and others[2018] SGHC 263 at [140];Oriental Investments (SH) Pte Ltd vCatalla Investments Pte Ltd[2013] 1 SLR 1182 at [83]). 108 I note that the Court of Appeal inVNithiaheld (at [5]) that in a claim based onproprietaryestoppel, any supporting allegations have to be pleaded with sufficient detail and “with sufficient particulars of the substance of the representations, the reliance alleged to have been placed on the representations, and the detriment suffered by the party in relying on the representations”. This principle is equally applicable to a defence of promissory estoppel (seeVNithiaat [43], citingChngBee Kheng v Chng Eng Chye[2013] 2 SLR 715 at [94]). In my view, the defendant has not adequately particularised his defence of promissory estoppel. In relation to the first element (viz.the existence of a clear and unequivocal representation on the plaintiff’s part), the Defence only cursorily states that the plaintiff had “signed off on all of the Company’s audited financial reports … all of which contained the Company’s share capital subsequent to the Share Issuance”.73Foot Note 73×Defence at paras 7, 8 and 13Moreover, the facts evincing the defendant’s alleged detrimental reliance were not at all pleaded. 109 Nevertheless, I am of the view that the defence of promissory estoppel would not succeed even if it had been properly pleaded, as the defendant’s submissions on this point are entirely without merit. 110 First, the defendant submits that the plaintiff has represented, through his conduct, that he would not insist on his strict legal rights in relation to the Share Issuance. The plaintiff’s alleged representations include (a) his request to be added as one of the Company’s directors74Foot Note 74×DBAEIC 1 at p 8, para 33and (b) his proposal that the Company sign an agreement with his own consultancy firm,75Foot Note 75×DBAEIC 1 at p 9, para 35both of which ostensibly evinced his desire to continue collaborating with the defendant on matters involving the Company.76Foot Note 76×DCS at paras 159–160 111 I am unable to agree with this submission. In my view, the plaintiff’s acts merely signify his determination to retain his hold over the Company and to continue extracting profit from it. They do not amount to anunequivocalrepresentation that the plaintiff would not bring an action against the defendant for the breach of the Trust Deed. 112 In the alternative, the defendant asserts that the plaintiff’s failure to raise any issue with the Share Issuance despite his knowledge of the same amounts to a representationby silencethat he would not enforce his legal rights. I am likewise unable to accept this argument. It is well established that “mere silence or inaction will not normally amount to an unequivocal representation”unlessthere is a “duty to speak” (seeAudi Construction Pte Ltd v KianHiap Construction Pte Ltd[2018] 1 SLR 317 (“Audi”) at [58]). Given the diverse range of circumstances in which a “duty to speak” may arise, the court’s assessment of whether a “duty to speak” exists in a particular case is necessarily fact-specific (seeAudiat [61]): …The expression “duty to speak” does not refer to a legal duty as such, but to circumstances in which a failure to speak would lead a reasonable party to think that the other party has elected between two inconsistent rights or will forbear to enforce a particular right in the future, as the case may be. We emphasise that this is not the subjective assessment of the other party but an objective assessment made by reference to how a reasonable person apprised of the relevant facts would view the silence in the circumstances, though unsurprisingly, the parties’ relationship and the applicable law which governs it will be a critical focus of the court’s assessment of whether those circumstances exist. [emphasis added] 113 As I recently noted inTractors SingaporeLtd v Pacific Ocean Engineering & Trading Pte Ltd[2020] SGHC 60 at [92], it is important to bear in mind that cases in which a “duty to speak” arises are the exception rather than the norm. In my view, there was nothing exceptional about the circumstances of the present case which could have given rise to a “duty to speak” on the plaintiff’s part. Although the parties were close acquaintances, their friendship did not impose a moral or legal obligation on them to be fully transparent with each otherinevery respect. Ultimately, they were two independent and commercially-savvy businessmen whose interests and objectives had happened to coincide at the time of the Company’s inception. I am satisfied that a reasonable person who had been fully apprised of the facts of this case would not have viewed the plaintiff’s three-year silence as anunequivocalrepresentation that he did not intend to insist on his strict legal rights. 114 Accordingly, I find that the first element of the defendant’s estoppel defence is not made out. It is therefore unnecessary for me to address the other two elements here.",
        "Waiver": "115 Waiver concerns a situation where a party has a choice between two inconsistent rights and elects to exercise one of them (seeAudiat [54]). In these circumstances, the electing party will be taken to have abandoned the right which he has chosen not to exercise, provided that the following requirements are satisfied (seeAudiat [54];Aero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd[2013] 4 SLR 409 (“Aero-Gate”) at [42]): (a) First, the electing party must have acted in a manner that is consistent only with a particular right. (b) Second, the electing party must have communicated his choice to exercise that particular right to the party in breach in clear and unequivocal terms. (c) Third, the electing party must have sufficient knowledge of the facts giving rise to the existence of the right which he had elected not to exercise. 116 In the present case, the defendant asserts that the plaintiff has waived his right to take issue with the Share Issuance by continuing to remain involved in the Company post-Share Issuance.77Foot Note 77×DCS at para 189I am unable to agree with this argument for two reasons. First, the two “rights” referred to by the defendant arenotinconsistent and/or irreconcilable. In my judgment, it was not self-contradictory for the defendant to contribute to the Company’s development post-Share Issuance, whilst simultaneously preserving his legal entitlement to bring a claim against the defendant for the earlier breach of the Trust Deed. The former was not necessarily an indication of his intention to dispense with the latter. 117 Secondly, as stated at [110]–[114] above, neither the plaintiff’s conduct nor his inaction amounted to a clear and unequivocal representation that he did not intend to enforce his strict legal rights against the defendant. 118 As such, the defence of waiver is legally unsustainable and the plaintiff succeeds on the question of liability. I now turn to examine the plaintiff’s entitlement to the remedies he seeks.",
        "Remedies": "",
        "Whether proof of loss is required": "119 The plaintiff initially sought two forms of relief: first, damages to be assessed; and further (or in the alternative), an order that the defendant buys out the plaintiff’s shares in the Company at a price to be determined by this court.78Foot Note 78×Statement of Claim at p 5The plaintiff subsequently modified his claim for damages to a claim for equitable compensation through the falsification of the trust account.79Foot Note 79×PCS at paras 110–113 120 It should be noted at the outset that the price of a buyout order is calculated based on the market value of the plaintiff’s shares and is therefore independent of the plaintiff’s ability to prove his loss. However, the plaintiff has not advancedanyargument to justify his claim for a buyout order. Indeed, this claim appears to have been abandoned altogether in the plaintiff’s closing submissions, which refer only to his claim for equitable compensation.80Foot Note 80×PCS at paras 110–113I am thus unable to consider this remedy in further detail. 121 Turning to the plaintiff’s claim for equitable compensation, I make the preliminary observation that the plaintiff’s submissions appear to conflate thesubstitutiveremedy of falsification with thereparativeremedy of equitable compensation. In my view, these two remedies are legally distinct and conceptually incompatible. I elaborate on their differences in the discussion below. Traditional accounting remedies: Falsification and surcharging 122 Traditionally, the victim of a breach of trust would seek relief by claiming for an account. As noted by the Court of Appeal inChngWeng Wahat [21], there are broadly two different categories of accounts: (a) general or common accounts (also known as accounts of common form) where no misconduct has been alleged; and (b) accounts on the basis of wilful default, which involves some kind of misconduct on the part of the fiduciary. 123 A common account is usually ordered to ascertain whether a trustee has misapplied trust property in breach of hiscustodial stewardship dutyto act only in accordance with the terms of the trust (seeSimPoh Ping v Winsta Holding Pte Ltd and another and other appeals[2020] SGCA 35 (“SimPoh Ping”) at [111];Tongbao (Singapore) Shipping Pte Ltd and another v Woon Swee Huat and others[2019] 5 SLR 56 (“Tongbao”) at [125], citing Charles Mitchell, “Equitable Compensation for Breach of Fiduciary Duty” (2013) 66 CLP 307 at 320–321). 124 The claim for a common account is divided into three phases (seeChngWeng Wahat [22]): (a) First, the question of whether the plaintiff has a right to an account is asked. In general, the beneficiary of a trust is entitled “as of right” to be given a common account, without having to show that the trustee has committed a breach of trust (seeFooJee Seng and others v Foo Jhee Tuang and another[2012] 4 SLR 339 at [87]). (b) Second, the account is taken. (c) Third, once a discrepancy in the trustee’s account is revealed, the plaintiff canfalsifythe unauthorised disbursement from the account. This has the effect of creating a deficit between the account and the fund that the fiduciary must replenish (seeTongbaoat [125]). Alternatively, the plaintiff can opt toadoptthe unauthorised disbursement,egif it was made for an asset which has in fact risen in value (seeCheongSoh Chin and others v Eng Chiet Shoong and others[2019] 4 SLR 714 (“CheongSoh Chin”) at [78]). 125 Seeking payment following an account of common form is analogous to an order for specific performance or payment of a liquidated debt, and is therefore not dependent on proof of loss (seeSimPoh Pingat [113];Agricultural Land Management Ltd v Jackson and Others (No 2)[2014] WASC 102 at [336]–[337]; Yip Man and Goh Yihan, “Navigating the Maze: Making Sense of Equitable Compensation and Account of Profits for Breach of Fiduciary Duty” (2016) 28 SAcLJ 884 at 900). This is not to say that the concept of causation is wholly irrelevant, as the plaintiff must still establish a causal link between the trustee’s breach of duty and the subject-matter of the trust that is sought to be restored. However, “the sense in which causation appears in the situation of falsification is a limited one, meaning that the court does not go further to determine whether the loss would still have occurred in the absence of the trustee’s breach of duty” (SimPoh Pingat [114]–[115]). 126 Unlike a common account, which is available as of right, an account on the basis of wilful default is ordered only when a trustee breaches hismanagement stewardship duty. A breach of this nature occurs when the trustee fails to administer the trust fund in accordance with his equitable duties,egby managing the trust fund negligently (seeSimPoh Pingat [100]). 127 When an account is taken on the basis of a wilful default, the account issurchargedby the amount that the trusteemighthave received if not for his default (seeCheongSoh Chinat [82]). Accordingly, the plaintiff must establish that the trust has sustained a loss which is causally connected to the breach of the trustee’s duty (seeSimPoh Pingat [121]). Equitable compensation 128 The term “equitable compensation” was first introduced inNoctonv Lord Ashburton[1914] AC 932 to describe a reparative (ie, compensatory) remedy for anon-custodial breachof fiduciary duty. However, it subsequently evolved to encompass reparative remedies for custodial breaches, including breaches oftrust(see foreg,Target Holdings Ltd vRedferns (a firm) and another[1996] 1 AC  421 (“Target Holdings”);AIB Group (UK) plc v MarkRedler & Co Solicitors[2015] AC 1503 (“AIB”)). 129 As equitable compensation is intended to restore the victim of a breach of trust or fiduciary duty (as the case may be) to the position that he or she would have been in if not for the breach (seeQuality Assurance Management Asia Pte Ltd v Zhang Qing and others[2013] 3 SLR 631 at [41]), a plaintiff who seeks equitable compensation must establish both loss and causation. The law on causation in relation to equitable compensation was recently clarified by the Court of AppealSimPoh Ping, albeit in the context of a breach offiduciary duty(as opposed to a breach of trust). Nevertheless, and as I shall explain further below, the question of causation does not arise in the present case because the plaintiff has not even managed to prove the existence of any loss on his part. It is therefore unnecessary for me to examine the principles inSimPoh Pingin further detail. 130 At this juncture, I pause to note that the Court of Appeal inSimPoh Pingstrongly urged counsel, academics and courts to guard against loose usage of the “equitable compensation” terminology, and to use the term to referonlyto the reparative remedy sought fornon-custodialbreaches offiduciary duty(seeSimPoh Pingat [123] and [126]). However, the Court of Appeal didnotexpressly rule out the possibility that a reparative monetary award (which is distinct from the traditional accounting remedies of falsification and surcharging described at [122]–[127] above) could be awarded for a breach oftrust, as in the cases ofTarget HoldingsandAIB.For clarity, I will hereinafter refer to such an award as “compensatory relief”. The appropriate remedy in the present case 131 It is evident from the preceding analysis that an order for compensatory relief for a breach of trust is distinct from the remedy of falsification. The former isreparativeand therefore contingent on proof of loss. By contrast, the latter isrestitutionaryorrestorativein nature. It is available as of right once a common account has been taken and a misapplication of trust property has been established (see [125] above andLibertarian Investments Ltd v ThomasAlexej Hall[2014] 1 HKC 368 at [167]–[168]). 132 In my judgment, the remedy of falsification would not be appropriate in the present case. As explained at [123] above, falsification is intended to remedy a discrepancy in the trust account which results from an unauthorised disbursement by the trustee. This was not such a case. It is clear that the defendant did not misapply the 50 shares which he held on trust for the plaintiff. Nor does the plaintiff allege this to be the case. Rather, the plaintiff’s claim is that the defendant has caused thevalueof these 50 shares to fall by issuing 350,000 additional shares in his own name. 133 As the plaintiff has not sought an account on the basis of wilful default, the only suitable remedy which is available to the plaintiff in the present case is an order for compensatory relief similar to that ordered inTarget HoldingsandAIB.As such, it is imperative for the plaintiff to prove his loss in order to demonstrate his entitlement to relief.",
        "Whether loss was proven in the present case": "134   The plaintiff submits that his loss must be calculated “on the basis of what [his] 50% beneficial shareholding in the Company should be worth”, as the defendant has deprived him of the same by diluting his shareholding in breach of the Trust Deed.81Foot Note 81×PBAEIC 1 at p 25, para 105 135 I disagree with the plaintiff’s proposed measure of loss. The purpose of a reparative remedy is to compensate the plaintiff for the losses he would not have sufferedhadthe breach of trust not taken place.Consequently, I agree with the defendant that the plaintiff’s loss should instead be equivalent to: (a) the value that the plaintiff’s beneficially-owned 50 shares in the Company would have beenhadthe Share Issuance not occurred(“Value A”); less (b) thecurrentvalue of the 50 shares in the Company which are beneficially owned by the plaintiff (“Value B”).82Foot Note 82×Defendant’s Reply Submissions (“DRS”) at para 80 If Value B is higher than Value A, the plaintiff cannot be said to have suffered any loss and therefore would not be entitled to any form of compensatory relief for the defendant’s breach. 136   In my assessment, the plaintiff has not led sufficient evidence to discharge the onus of proving his loss. As I earlier held at [34]–[41] above, the Lay Opinion is wholly inadmissible for the purpose of proving the quantum of the plaintiff’s claim. Furthermore, the plaintiff has not raised any evidence to rebut the defendant’s allegation83Foot Note 83×DCS at para 124that the Company would not have been able to source out potential purchasers such as hospitals and medical centres if its share capital had not been increased from MYR100 to MYR350,100. As such, based on the evidence as it currently stands, the plaintiff would only be entitled to declaratory relief at best. 137 However, this is not the end of the inquiry as the plaintiff submits that, in any event, “the [c]ourt is entitled to grant interlocutory judgment and direct that damages be assessed at a further hearing … [before] the Registrar”.84Foot Note 84×PCS at para 122This is in effect a request for the bifurcation of the trial, which I consider in fuller detail below.",
        "Whether it is permissible for the plaintiff to seek the bifurcation of the trial at this stage": "138 As the defendant points out,85Foot Note 85×DRS at para 13the plaintiff did not make an application to bifurcate the trial under O 33 r 2 of the ROC. Nevertheless, case law suggests that the absence of such an application does not preclude the court from exercising its powers to make a bifurcation order, even if the trial of the matter has already been concluded. 139 InLee Chee Wei v TanHor Peow Victor and others and another appeal[2007] 3 SLR(R) 537 (“Lee Chee Wei”), the plaintiff claimed specific performance of an agreement for the sale and purchase of his shares or, in the alternative, damages in lieu of specific performance. The claim for specific performance was found to be impractical, but the plaintiff had not adduced any evidence on the value of his shares. The Court of Appeal acknowledged that the plaintiff’s conduct of the trial “le[ft] much to be desired” (at [80]) but ultimately made an order for the assessment of damages in lieu of specific performance. It held (at [64]) that although neither of the parties had applied prior to the trial for a bifurcation of the hearing pursuant to O 33 r 2 of the ROC, “the fact remain[ed] that the plaintiff would have readily been granted a bifurcation order, had he applied for it at the appropriate juncture”. Furthermore, “the defendants [had] suffered no prejudice that [could not] be adequately compensated by costs” (at [76]). 140Lee Chee Weiwas subsequently endorsed inChew Ai Hua Sandra v WooKah Wai and another (Chesney Real Estate Pte Ltd, third party)[2013] 3 SLR 1088 (“Sandra Chew”), where Lionel Yee JC (as he then was) made an order for damages to be separately assessedafterthe conclusion of the trial even though the plaintiff had not made any prior application to bifurcate the hearing. Yee JC’s findings on this point were not overturned on appeal. 141 Underpinning bothLee Chee WeiandSandra Chewis the proposition that “the [c]ourt ought not to be so far bound and tied by rules … as to be compelled to do what will cause injustice in the particular case” (Sandra Chewat [68], citingIn the Matter ofan Arbitration between Coles and Ravenshear[1907] 1 KB 1 at 4). Ultimately, “each case involving procedural lapses or mishaps must be assessed in its proper factual matrix and calibrated by reference to the paramount rationale of dispensing even handed justice” (Lee Chee Weiat [82]). 142 In my view, the present case is analogous toLee Chee Weiin that a bifurcation order would almost certainly have been granted if the plaintiff had applied for it prior to the commencement of the trial. As inLee Chee Wei, the assessment of compensatory relief in the present case is “somewhat controversial” as it would require expert evidence on,inter alia, the valuation of the 50 shares beneficially owned by the plaintiff and the Company’s ability to secure purchasers in the hypothetical scenario that the Share Issuance had not occurred. As such, it is likely that “substantial costs and time would have been saved” if liability issues had been resolved first, as a negative finding on this critical question alone “would have rendered otiose any need to adduce evidence on damages” (seeLee Chee Weiat [64]). 143 Furthermore, it is noteworthy that the defendant did not choose to call any expert witnesses to rebut the plaintiff’s Lay Opinion. Accordingly, any prejudice which the defendant may suffer (in the form of inconvenience, unnecessary expense and/or duplicated effort) is likely to be very slight. Such prejudice is also readily compensated by costs (seeSandra Chewat [69]). 144 In the circumstances, I am of the view that it would be fair and just for the quantum of compensatory relief due to the plaintiff to be assessed at a separate hearing, and I thus make an order in those terms.",
        "Conduct of the action": "145 Before closing, I make the brief observation that the plaintiff’s closing and reply submissions contain a number of personal attacks on the defendant’s counsel, insinuating,inter alia, that the defendant’s counsel is unprofessional and/or inept. While these irrelevant and disparaging remarks have not had any impact whatsoever on the outcome of my decision, I take the view that such assertions are wholly inappropriate and uncalled for. It is of paramount importance that all advocates and solicitors, as members of an honourable profession, conduct themselves with dignity and extend professional courtesy and civility towards one another at all times.",
        "Conclusion": "146 In summary, my decision is as follows: (a) Interlocutory judgment is entered for the plaintiff as regards the defendant’s liability for breaching Clause 3.3 read with Clause 3.4(b) of the Trust Deed. (b) An assessment of compensatory relief is to be conducted by the Registrar to determine the amount of compensatory relief, if any, which is to be paid by the defendant to the plaintiff. The question of interest, if any, is also reserved to the Registrar. 147 I will hear parties on the issue of costs at a later date. Parties are to file their submissions on costs, limited to ten pages each, within 14 days from the date of this judgment. Additional costs for the assessment of compensatory relief shall be reserved to the Registrar. Vincent HoongJudge Cai Enhuai Amos and Wong Changyan Ernest (Yuen Law LLC) for the plaintiff; Pang Khin Wee (Peng Qinwei) (Hoh Law Corporation) for the defendant."
    }
}