{
    "case_title": "Public ProsecutorvSoh Chee Wen and another",
    "ncitation": "[2020] SGHC 186",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 This is an ongoing trial involving alleged stock market manipulation. 2 The accused persons face 178 charges each for being a party to a criminal conspiracy to commit 10 offences under s 197(1)(b) of the Securities and Futures Act (Cap 289, 2006 Rev Ed) (“SFA”) (ie,the 1st to 10th charges), 162 offences under s 201(b) of the SFA (ie,the 11th to 172nd charges) and six offences under s 420 of the Penal Code (Cap 224, 2008 Rev Ed) (ie,the 173rd to 178th charges), punishable under s 120B of the Penal Code read with certain other provisions. The charges relate to the securities of three companies, namely, Blumont Group Limited (“Blumont”), Asiasons Capital Ltd (“Asiasons”) and LionGold Corp Ltd (“Liongold”) over different periods between 1 August 2012 to 3 October 2013. 3 Further, the first accused faces three charges under s 148 of the Companies Act (Cap 50, 2006 Rev Ed), for being concerned in the management of Blumont, Asiasons and Liongold respectively while being an undischarged bankrupt (having been adjudged a bankrupt by a court in Malaysia) (ie,the 179th to 181st charges). As against the first accused, there are also five charges of tampering with witnesses under s 204A of the Penal Code (ie,the 182nd to 184th, the 186th and 189th charges), as well as three charges of attempting to tamper with witnesses under s 204A of the Penal Code read with s 511 of the same (ie,the 185th, 187th and 188th charges). 4 In the course of the Prosecution’s case, the accused persons applied for a permanent stay of the proceedings. In the alternative, they prayed for a conditional stay of the same. They argued that to prevent an abuse of process, the court has the inherent powerto stay criminal proceedings. To invoke the court’s inherent power, the accused persons argued that the Prosecution’s conduct of the trial thus far had seriously prejudiced them, rendering a fair trial impossible. A stay of proceedings would thus be necessary. 5 In response, the Prosecution disagreed that the court has the inherent power to stay criminal proceedings. The separation of judicial and prosecutorial powers under the Constitution of the Republic of Singapore (1999 Reprint) (“Constitution”) precludes the existence of such an inherent power. Such a judicial power would interfere with the prosecutorial powers to institute, conduct or discontinue proceedings. Such powers, the Prosecution argued, lie within the exclusive domain of the Attorney-General (“AG”). In the alternative, the Prosecution argued that should such an inherent power exist, it should be exercised only in exceptional circumstances. The allegations levied against the Prosecution, it submitted, were unmeritorious, and there was no basis for the court to exercise any such power to do so. 6 Having considered the oral and written submissions of the parties, I dismissed the applications. Given the uncommon nature of the applications, and the constitutionality point raised by the Prosecution, I now furnish full reasons for my decision.",
        "Issues for determination": "7 The parties’ arguments raised these three issues for determination: (a) whether the court has the inherent power to stay criminal proceedings for abuse of process; (b) if the court has the inherent power to stay criminal proceedings, what are the circumstances that would warrant the exercise of such a power; and (c) whether on the grounds relied on by the accused persons, the court should exercise the inherent power to stay these criminal proceedings. 8 I shall discuss each in turn.",
        "Whether the court has the inherent power to stay criminal proceedings for abuse of process": "9 The arguments of the accused persons were broadly aligned. For the proposition that to prevent an abuse of process, the court has the inherent power to stay criminal proceedings, the first accused relied on the English cases ofAttorney General’s Reference (No 1 of 1990)[1992] 3 All ER 169 (“AG’s Reference”),R v Horseferry Road Magistrates’ CourtEx parte Bennett[1994] 1 AC 42 (“Exp Bennett”) andR v Maxwell[2011] 1 WLR 1837 (“Maxwell”), while the second accused traced the root of this proposition to the House of Lords decision inConnelly v Director of Public Prosecutions[1964] 2 WLR 1145 (“Connelly”). 10 Next, the accused persons submitted that this is also the position in Australia and New Zealand: seeJagov District Court of New South Wales(1989) 87 ALR 577 (“Jago”);R vTrong Ruyen Bui[2011] ACTSC 102 (“Bui”), andMoevaov Department of Labour[1980] 1 NZLR 464. According to the second accused, the position in Hong Kong is the same as well: seeHKSAR v Lee Ming Tee and another[2001] 1 HKLRD 599 (“Lee Ming Tee”). 11 Turning to the Singapore position, the accused persons relied on a trio of cases which endorsed the English positionie, Public Prosecutor v Ho So Mui[1993] 1 SLR(R) 57 (“Ho So Mui”),Public Prosecutor vSaroop Singh[1999] 1 SLR(R) 241 (“SaroopSingh”) andSum Lye Heng (also known as Lim Jessie) v Management Corporation Strata Title Plan No 2285 and others[2003] 4 SLR(R) 553 (“Sum Lye Heng”). However, two subsequent cases contradicted the proposition that the accused persons argued for. They sought to distinguish these two cases by confining them to their facts,ie, Yunani Bin Abdul Hamid v Public Prosecutor[2008] 3 SLR(R) 383 (“Yunani”) andLaw Society of Singapore v TanGuat Neo Phyllis[2008] 2 SLR(R) 239 (“Phyllis Tan”). 12 Addressing the constitutionality point, the accused persons argued that such an inherent power would not constitute an infringement of the prosecutorial power vested in the AG by virtue of Art 35(8) of the Constitution. In exercising its judicial power as vested by Art 93 of the Constitution to control and manage its proceedings, the prosecutorial power may be circumscribed by the court. 13 The Prosecution argued that as a matter of law, the existence of an inherent power to stay criminal proceedings would contravene the constitutional separation of judicial and prosecutorial powers, and impinge on the AG’s powers to institute, conduct or discontinue proceedings. A permanent stay would discontinue the proceedings, while a conditional stay would impose conditions before a prosecution can be re-instituted. 14 In support of its argument, the Prosecution relied onYunaniandPhyllis Tan. The three cases which precededPhyllis Tandid not deal with the constitutionality point. The Prosecution also distinguished the cases from England, Australia and New Zealand on the basis that these jurisdictions do not have a similar constitutional provision. Although Article 63 of the Basic Law of Hong Kong vests in the Secretary of Justice the control of criminal prosecutions, inLee Ming Tee([10]supra), the court did not specifically consider if an inherent power to stay criminal proceedings would impinge on Article 63 of the Basic Law. The Prosecution’s argument was thus premised on the view that Art 35(8) of the Constitution confers exclusivepowers on the AG to “institute, conduct or discontinue proceedings”. If these powers are not exclusively conferred on the AG, the argument that the English, Australia and New Zealand authorities are inapplicable would consequently fall away. 15 I begin my analysis by observing that the parties did not dispute that in England, Australia and New Zealand, the consistent position is that the superior courts have an inherent power to stay criminal proceedings for an abuse of process. In the UK Supreme Court case ofMaxwell([9]supra),LordDyson JSC stated as follows at [13]: It is well established that the court has the power to stay proceedings in two categories of case, namely (i) where it will be impossible to give the accused a fair trial, and (ii) where it offenders the court’s sense of justice and propriety to be asked to try the accused in the particular circumstances of the case. 16 On the rationale for any such inherent power, Lord Morris of Borth-y-Gest observed inConnelly([9]supra)at 1153: There can be no doubt that a court which is endowed with a particular jurisdiction has powers which are necessary to enable it to act effectively within such jurisdiction. I would regard them as powers which are inherent in its jurisdiction. A court must enjoy such powers in order to enforce its rules of practice and to suppress any abuses of its process and to defeat any attempted thwarting of its process…The power (which is inherent in a court’s jurisdiction) to prevent abuses of its process and to control its own procedure must in a criminal court include a power to safeguard an accused from oppression or prejudice. [emphasis added] 17 However, the position in Singapore is less clear. I summarise the five local cases parties cited in chronological order below: (a) InHo So Mui([11]supra)at [36],the Court of Appeal referred to “dicta”inAG’s Reference([9]supra)andJago([10]supra), and provided a “preliminary view” that a power exists to stay criminal proceedings in circumstances where it can be shown that the accused could not have a fair trial. This was reached without full arguments on the nature and extent of the court’s inherent power, and the Court of Appeal emphasised that it was not a definitive view. (b) InSaroopSingh([11]supra),Yong Pung How CJ cited extensively fromAG’s Reference,and accepted that the court has the discretion to stay criminal proceedings on the ground of substantial delay. Yong CJ acknowledged that the discretion should be exercised only in exceptional circumstances. On the facts of the case, there was a 15-year delay in bringing the Prosecution’s appeal before the High Court. If the appeal were to be allowed, a retrial would be the appropriate course of action. Yong CJ thus exercised the power to dismiss the appeal on the ground of delay. In his view, a fair retrial would be impossible. (c)Sum Lye Heng([11]supra)concerned a private prosecution commenced by a management corporation against the previous chairperson of the council of the management corporation, and the parties did not dispute the court’s power to stay criminal proceedings. As such, Woo Bih Li J recognised that the High Court had the power to grant a permanent stay of criminal proceedings for abuse of process. In doing so, Woo J cited the High Court of Australia case ofWilliams vSpautz(1991-1992) 174 CLR 509, which in turn referred toConnelly: see [44]–[47].Woo J proceeded to permanently stay the private prosecution as the management corporation was estopped from complaining about the conduct of the previous chairperson (when it had acted on the basis that her conduct was in full compliance with the statutory provisions): see [65]–[68] and [79]. (d)Phyllis Tan([11]supra)concerned the use of evidence obtained by entrapment to commence disciplinary proceedings for charges under s 83(2)(e) and 83(2)(h) of the Legal Profession Act (Cap 161, 2001 Rev Ed) (“LPA”). The Court of Three Judges considered the question of whether the use of evidence obtained by entrapment or illegal means amounted to an abuse of process which would then justify a stay of proceedings. The court held that even if the evidence might have been obtained by entrapment or illegal means, this did not amount to an abuse of process of the court: see [138]. However, in relation to the inherent power to stay proceedings, the court observed thatSum Lye Hengconcerned a private prosecution and not a public prosecution. The court expressed the view that there was a limited scope to enlarge the concept of abuse in criminal proceedings: see [133]–[134]. The court proceeded to consider the question of the separation of constitutional judicial and prosecutorial powers and held as follows at [145]: In relation to public prosecutions, Art 35(8) makes it clear that theinstitution, conduct or discontinuanceof any criminal proceedings is a matter foronlythe Attorney-General to decide. This means that except for unconstitutionality, the Attorney-General has an unfettered discretion as to when and how he exercises his prosecutorial powers. This also means that it is improper for the court to prevent the Attorney-General from prosecuting an offender by staying the prosecution. [emphasis added] However, the court also noted that judicial power may circumscribe the prosecutorial power in two ways as follows at [146]: …The prosecutorial power cannot circumscribe the judicial power. On the contrary, it is the judicial power that may circumscribe the prosecutorial power in two ways: First, the court may declare the wrongful exercise of the prosecutorial power as unconstitutional. …Secondly,it is an established principle that when an accused is brought before a court, the proceedings thereafter are subject to the control of the court: seeGoh ChengChuan v PP[1990] 1 SLR(R) 660,Ridgewayat 32-33 andLooseleyat [16]-[17].Within the limits of its judicial and statutory powers, the court may deal with the case as it thinks fit in accordance with the law. [emphasis added] (e) Then inYunani([11]supra),in exercising the High Court’s revisionary jurisdiction to set aside a conviction on the basis that the applicant faced overwhelming pressure to enter a plea of guilt, VK Rajah JA remitted the matter for a retrial in the then Subordinate Courts: see [57]–[59]. In relation to an application by the applicant to grant a stay of the proceedings based onSaroopSingh, he held that there was no delay which would cause irreversible or irremediable prejudice to the applicant should a retrial take place: at [64]–[66]. However, he also observed that inSaroopSingh,the court had not considered Art 35(8) of the Constitution and the authorities cited inSaroopSinghemanated from jurisdictions without a similar constitutional provision. Therefore, he doubted the correctness of the decision. That said, he left the issue open to be decided based on full arguments: at [63]. 18  By the above, the views of the High Court and the Court of Three Judges (which is a specially constituted court under the LPA) are divergent, and there is no binding decision by the Court of Appeal on the issue. With that, I set out the relevant Articles in the Constitution as follows: 35. Attorney-General … (8) The Attorney-General shall have power, exercisable at his discretion, toinstitute, conduct or discontinueany proceedings for any offence.  93. Judicial power of Singapore Thejudicial powerof Singaporeshall be vested in a Supreme Courtand in such subordinate courts as may be provided by any written law for the time being in force. [emphasis added] 19 I should add that s 11(1) of the Criminal Procedure Code (Cap 68, 2012 at Rev Ed) (“CPC”) echoes Art 35(8) of the Constitution by stating that the AG shall have “the control and direction of criminal prosecutions and proceedings under [the CPC] or any other written law”. 20 On a plain reading of Art 35(8) of the Constitution, I make two observations. First, it allows the AG to achieve three specified ends. By the exercise of this discretion, the AG may cause criminal proceedings to be instituted against any person where none existed. The AG may also conduct the criminal proceedings against any such person. The AG may also discontinue any existing criminal proceedings against such a person. InPhyllis Tan,the court remarked that these are matters foronlythe AG to decide, and the Prosecution similarly adopted this stance in the present applications. However, this is not expressly stated in Art 35(8) of the Constitution. A pertinent question for present purposes is whether the attainment of any of these ends is exclusive to the AG,ie, they canonlybe achieved via the exercise of the AG’s prosecutorial powers and by no other means. I shall turn to this shortly at [22] below. 21 Second, strictly speaking, the AG does not appear tohave the power, under Art 35(8) of the Constitution, to maintain criminal proceedings. All that Art 35(8) of the Constitution provides for is that the AG has the power to conduct such criminal proceedings as may have been initiated and which has not been discontinued. The AG, of course, has the power “to initiate, maintain and terminate a criminalprosecution”:Lim Chit Foo v Public Prosecutor[2020] 1 SLR 64(“Lim Chit Foo”) at [22], but this appears to be a different matter from saying that the AG has the exclusive power to maintain criminalproceedings.I discuss this distinction at [33] below. 22 As the powers of the AG to institute, conduct or discontinue any proceedings for any offence stems from Art 35(8) of the Constitution, it seems to me that ifanyof the powers is non-exclusive in the sense that it may be lawfully exercised by other persons, the other powers must be similarly construed as well, since there is nothing in the express language of the provision that distinguishes the nature of any of the powers from the others. 23Aurol Anthony Sabastian v Sembcorp Marine Ltd[2013] 2 SLR 246 (“Aurol”) is a decision of the Court of Appeal which discussesPhyllisTan.It concerned an appeal against an order of committal made in relation to criminal contempt proceedings commenced by a private individual without consulting the AG as required under O 52 r 2 of the Rules of Court (Cap 322, R5, 2006 Rev Ed). The Court of Appeal refused to cure the procedural irregularity and allowed the appeal. In that context, the Court of Appeal said at [33]–[35] that: 33 Notably, Art 35(8) of the Constitution does not circumscribe the power of the AG only to criminal proceedings initiated under any written law: it is thus intended to governallcriminal proceedings, whether initiated pursuant to a statute or under the common law. Art 35(8) of the Constitution has been judicially interpreted in many cases, and most notably inLaw Society of Singapore v TanGuat Neo Phyllis[2008] 2 SLR(R) 239 (“Phyllis Tan”) to mean the following: In relation to public prosecutions, Art 35(8) makes it clear that theinstitution, conduct or discontinuance ofanycriminal proceedings is a matter for only the Attorney-General to decide. This means that except for unconstitutionality, the Attorney-General has an unfettered discretion as to when and how he exercises his prosecutorial powers. … [emphasis in original in italics emphasis added in bold italics] 34 In so far as it is a matter of the AG’s power and discretion, the position is clear. There is no doubt that the AG has the power to institute and conduct prosecutions and proceedings for criminal contempt and this is reflected in the many cases where the AG has done so before our courts. But,it has also been held that Art 35(8) of the Constitution does not prevent other persons from commencing private prosecutions in the permitted circumstances. InPP vNorzian bin Bintat[1995] 3 SLR(R) 105 at [19], the High Court held: It is not disputed that in certain circumstances an aggrieved person may commence a private prosecution for certain offences without the consent of the Attorney-General. Thus, it isuncontroversial that the Attorney-General does not have the sole discretion to institute or conduct criminal proceedings… 35 Similarly, inAG v Tee Kok Boon[2008] 2 SLR(R) 412 at [68], the High Court held that: Article 35 deals with the office of the Attorney-General and matters incidental thereto such as the appointment of the Attorney-General, his duties and powers. I am of the view that while Art 35(8) states his power to institute proceedings for any offence, itdoes not preclude others from instituting criminal proceedings as may be prescribed by written law. The Attorney-General has overall control over criminal proceedings. As mentioned, the Attorney-General may intervene even in private prosecutions. [emphasis in underline added] 24 From the above, it seems clear that the powers to institute and conduct criminal proceedings are not exclusive to the AG. If, within the scheme of the Constitution, such powers are indeed exclusive in nature, written laws that permit others to assume such powers in parallel,eg, laws which permit private prosecutions, would be unconstitutional. That is plainly not the position at law, and that conclusion does not automatically follow from the express language of Art 35(8) of the Constitution. The power to discontinue criminal proceedings, which is mentioned in the same breath as the abovementioned powers, should not be treated any differently. 25 Notably, the Court of Appeal inAuroldeparted from the observation inPhyllis Tan(at [145]) that under Art 35(8) of the Constitution, the institution and conduct of any criminal proceedings is a “matter for only the Attorney-General to decide [emphasis added]”. If nothing in the empowering language of Art 35(8) of the Constitutionie, the “[AG] shall have power, exercisable at his discretion, to…” vests exclusive power over the institution and conduct of criminal proceedings on the AG such that these are matters for only the AG to decide, it would seem that nothing in the same language vests exclusive power over the discontinuance of criminal proceedings on the AG. 26 In this connection,PP vNorzian bin Bintat[1995] 3 SLR(R) 105 (“Norzian”) is instructive. At [17]–[19], Yong CJ recognised that by virtue of the exercise of a judicial power, criminal proceedings may be terminated as follows: 17 In my view, no matter how broadly the word “discontinue” in Art 35(8) is construed, it cannot possibly bear the meaning suggested by the Public Prosecutor. This is because, if Art 35(8) is to be of any assistance to the appellant, it must mean that the Attorney-General, and hence the Public Prosecutor, has the sole discretion to terminate proceedings. Otherwise, the mere fact that the Attorney-General has “the power, exercisable at his discretion, to institute, conduct or discontinue any proceedings for any offence” does not get the appellant very far. 18 A termination of a criminal proceeding may result from a number of circumstances. It may result from the Prosecution voluntarily withdrawing the Prosecution. It may result from a conviction or an acquittal. In the case of a conviction, it may result from a guilty plea or from judgment after the end of a trial. In the case of an acquittal, it may result from the Prosecution not offering a case, from the judge finding that aprima faciecase had not been made out, from the judge deciding at the end of the case that the offence had not been proved,or from a judge consenting to a composition. It can hardly be argued that every such termination of a criminal proceeding falls within the ambit of Art 35(8). If that is the case, the absurd result would be that only the Attorney-General and Public Prosecutor can acquit or convict an accused. 19 It is not disputed that in certain circumstances an aggrieved person may commence a private prosecution for certain offences without the consent of the Attorney-General. Thus, it is uncontroversial that the Attorney-General does not have the sole discretion to institute or conduct criminal proceedings.So, the question is whether there is anything so special about discontinuing an action that only the Attorney-General or Public Prosecutor may do so. [emphasis added] 27 Yong CJ concluded, at [21]–[22] ofNorzian, that: 21I am of the view therefore that Art 35(8) only applies to voluntary termination of criminal proceedings on the part of the Attorney-General and Public Prosecutor. Hence, if the Public Prosecutor, for whatever reason, decides not to proceed with a case, nobody can complain about it. This is reflected in ss 184 and 193 of the CPC. It is also reflected in s 336 of the CPC.However, if the proceedings had been terminated under s 180(f) or s 189 of the CPC as a result of the judge finding that a prima facie case has not been made out, then the Public Prosecutor cannot complain otherwise than by way of an appeal.It can hardly be said that such a termination of the action impinges on the discretion of the Public Prosecutor.Similarly, it cannot possibly be argued that a decision on the part of the examining magistrate in a preliminary inquiry to discharge an accused under s 142 or s 145 of the CPC, because he considers the charge to be groundless, impinges on the discretion of the Public Prosecutor. That would result in the manifest absurdity that preliminary inquiries are otiose.Whatever the scope of the Public Prosecutor’s discretion under Art 35(8) is, it does not extend to the situation where criminal proceedings are terminated as a result of a judicial decision. 22Article 93 of the Constitution must always be borne in mind.This unequivocally vests the judicial powers of the State in the courts.Thus, where a judicial decision is involved, there is simply no question of the Public Prosecutor’s discretion being fettered. [emphasis added] 28 Thus, whatNorzianappears tostand for is that the AG does not have an exclusive power to discontinue criminal proceedings, in the sense that it does not have the right to insist that criminal proceedings are maintained in the face of a discontinuance of the same by the court exercising its judicial power. Most of the examples of judicial decisions made by the court to terminate proceedings cited inNorzianconcern those based on the merits of the case. However, this is not quite the case with a composition order. Further, the language used inNorzianis not so limited, and is expressly stated to encompass a judicial decision made by way of the exercise of judicial power by the court. 29 That said, where the AG exercises its power to institute, conduct or discontinue criminal proceedings, such exercise is unfettered, and cannot be questioned by the court other than by the judicial review mechanism (ie, where the constitutionality of the AG’s exercise of power is determined). At [48]–[49] ofNorzian, Yong CJ said: 48 … It is possible to compound an offence before any arrest or application for a summons or warrant of arrest is made. In that case, no consent of the court is required. The composition is complete once agreement is arrived at … It would then be the duty of the magistrate to enter an acquittal and there is no discretion in the matter at all. Nor may the victim withdraw consent to the composition. Of course, in the vast majority of cases where this happens, the matter is never brought to the attention of the courts and no prosecution is ever mounted. However, the point is,even if a prosecution is mounted by the Public Prosecutor, as he is entitled to do, it would be an exercise in futility, as the prosecution will necessarily result in an acquittal.It is as good as mounting a prosecution when the evidence clearly shows that no offence was committed or when the evidence clearly shows that a plea ofautrefois acquitis available. 49The point is, the Public Prosecutor’s discretion is never curtailed. Even where a prosecution is pre-empted by a composition,there is nothing to prevent the Public Prosecutor from prosecuting the case. Of course, the prosecution must necessarily fail, but that is an altogether different story. [emphasis added] 30 InPhyllis Tan([11]supra) at [145],the court relied onNorzianat [49] for the proposition that, “except for unconstitutionality, the Attorney-General has an unfettered discretion as to when and how he exercises his prosecutorial powers. This also means that it is improper for the court to prevent the Attorney-General from prosecuting an offender by staying the prosecution.” As set out above at [17(d)], inPhyllis Tan,the court was concerned whether a prosecution founded on evidence obtained by entrapment or by illegal means was an abuse of process, and whether a stay of proceedings would be the appropriate response by the court. It was in that context that the remark was made. Consistent with the example given inNorzianof a composition pre-empting prosecution,it is entirely within the AG’s prerogative whether to institute proceedings in those circumstances. It would therefore be wrong to interfere with the AG’s discretion to prosecute. But in my view, this does not foreclose the court’s inherent power to control its proceedings by staying on the ground of abuse of process. 31 Based on the foregoing, I was of the view that the constitutional separation of judicial and prosecutorial powers does not preclude the existence of an inherent power to stay criminal proceedings for an abuse of process.Having put to rest this constitutional point, I did not see any other reason why the court should not have such an inherent power. Certainly, the Prosecution did not proffer any other reason for consideration. Returning to the remarks inConnelly([9]supra)cited above at [16], in the exercise of its criminal jurisdiction, the inherent power is meant to “prevent abuses of [the court’s] process and to control [the court’s] own procedure” and to “safeguard an accused from oppression or prejudice”. 32 InReNalpon Zero Geraldo Mario[2013] 3 SLR 258 at [34], a case that the second accused cited, the Court of Appeal recognised that the court has a “fund of powers conferred on it by virtue of its institutional role to dispense justice”. At [27], the Court of Appeal cited with approval from I H Jacob, “The Inherent Jurisdiction of the Court” (1970) 23 CLP 23 that “the reserve or fund of powers” is “a residual source of powers”, which may be drawn upon to “ensure the observance of the due process of law, to prevent improper vexation or oppression, to do justice between the parties and to secure a fair trial between them.” In my view, if any injustice is incurable by any means available to the court save to terminate the proceedings, then the court should have the inherent power to do so. 33 Indeed, as the first accused argued, this also appears to be consistent with the passage of the court inPhyllis Tan([11]supra)at [146], also set out at [17(d)] above. This passage appears to draw a distinction between the exercise of the prosecutorial power and control of criminal proceedings in court. First, the exercise of the prosecutorial power is fettered onlyinsofar that the court may declare it unconstitutional. Second, it is the court, and not the prosecution, that may control the criminal proceedings once the accused is brought before the court within the limits of its judicial and statutory powers. I would observe that this is entirely consistent with the language of Art 35(8) of the Constitution, which does not give the AG the power tocontrol(as opposed to the power toconduct) criminal proceedings. Accordingly, if the power to stay criminal proceedings is located within the court’s judicial power to control its proceedings,Phyllis Tandoes not appear to contradict the position that such a power may be exercised by the court. 34 As alluded to above at [21], inLim Chit Foo([21]supra), the Court of Appeal also drew a distinction between the discretion to “initiate, maintain and terminate a criminalprosecution”[emphasis in original], and the conduct of criminal proceedings. There, the Court of Appeal considered the Prosecution’s practice of standing down charges and held that the effect is to adjourn the proceedings in relation to such charges to a later time. Therefore, it would be wrong “to conceptualise the practice as falling purely within the Prosecution’s discretion, as it would give the prosecution unfettered control over the conduct of criminal proceedings before the court”: see [25]. What was in issue was the demarcation of the powers in relation to criminal proceedings. In this connection, once charges have been brought before the court, criminal proceedings are subject to the overall supervision and control of the court. The AG is not vested with “the power to determine how the proceedings as a whole, involving both the Prosecution and the Defence, will be managed and conducted. That, plainly, is a function and responsibility of the court”: see [20], [22] and [24]. 35 I should add that after finding that the court has the power to intervene in relation to decisions to stand down charges which might be oppressive to accused persons, the Court of Appeal also remarked that “it would be wholly unsatisfactory if the court were powerless to intervene in such cases except by resorting to narrow concepts such as abuse of process or any allegation of improper conduct on the Prosecution’s part”: seeLim Chit Fooat [25]. Thus, there is recognition of the power of the court to intervene to address any concerns about abuse of process. 36 With that, I turn to the Malaysian case ofDatuk HajiWasli bin Mohd Said v Public Prosecutor and another application[2006] 5 MLJ 172 (“DatukHaji Wasli”) which provides some additional support for the position I have reached. This is so, bearing in mind that the prosecutorial powers of the Malaysian Attorney-General are constitutionally enshrined in Art 145(3) of the Malaysian Constitution in termsinpari materiawith the language of Art 35(8) of the Constitution: (3) The Attorney General shall have power, exercisable at his discretion, to institute, conduct or discontinue any proceedings for an offence, other than proceedings before a Syariah court, a native court or a court-martial. [emphasis added] 37 At issue inDatuk HajiWasliwas the question of whether the court could act to strike out or stay criminal proceedings on the grounds that it was an abuse of its process. In the Malaysian High Court, Abdull Hamid Embong J held, at [9]-[10], that: [9] Learned Deputy Public Prosecutor took the stand that the power of the Attorney General (acting as the public prosecutor) to institute conduct or discontinue any proceedings for any offence as stated in art 145(3) of the Federal Constitution is unfettered and cannot be challenged. It should not therefore be subservient to the common law concept of the inherent power of the court. Counsel for WMS earlier contended that such powers are not without limit, reading in support this passage fromPublic Prosecutor v Jorge EnriquePellon Tellon[1998] 1 CLJ Supp 118: The public prosecutor shall have power exercisable at his discretion to institute, conduct or discontinue any proceeding, for an offence based on evidence that he has had upon investigation, but once the case comes to court, the power of the public prosecutor ceases and immediately the court is seized with jurisdiction to try the case in accordance with the time-honoured rules of procedure and rules of evidence. [10] The courtin exercising its inherent power is in fact exercising a judicial power, in the sense that it hears both sides before determining where the justice of the case lies. Striking out a case, or staying its proceedings is an exercise of this judicial power. In my view, this act does not encroach into the parameters of the public prosecutor’s power of prosecution which is an executive power solely entrusted upon him to act upon the evidence available to him. Once a criminal proceeding is before the court, ‘a host of judicial powers will flow to enable it to proceed with the trial and determine the disputes between the parties.’ (per Mohd Azmi SCJ inPublic Prosecutor v Dato Yap Peng[1987] 2 MLJ 311). … [emphasis added] 38 Thus, the Malaysian High Court has held that the granting of a stay of criminal proceedings does not intrude on the express constitutional powers of the AG to “institute, conduct or discontinue any proceedings for an offence”, because the power to stay criminal proceedings is one which is properly located within the court’s inherent power, which in turn forms part of the judicial power vested in the court. 39 To sum up, on this issue, I agreed with the accused persons. I am of the view that the superior court has the inherent power to stay criminal proceedings for abuse of process, and that this does not contravene the constitutional separation of judicial and prosecutorial powers.",
        "The circumstances in which the court would exercise the inherent power to stay criminal proceedings": "40 Should the court rule against the Prosecution on the constitutionality point and thus find that it has the inherent power to stay criminal proceedings, the Prosecution accepted that as stated inMaxwell([9]supra) which was relied upon by the first accused,the inherent power may be exercised in two categories of cases, namely, (i) where it will be impossible to give the accused a fair trial; or (ii) where the particular circumstances are such that to try the accused would offend the court’s sense of justice and propriety:Maxwellat [13] which is cited at [15]supra. 41 At this juncture, I should state that the accused persons were essentially submitting that the present case fell within the first category which was specifically considered inAG’s Reference([9]supra)ie,that for delay or any other reason amounting to an abuse of process, it would be impossible to give an accused a fair trial. Therefore, this is the focus of my discussion. 42 To elaborate, inAG’s Reference, the English Court of Appeal held that there is the power to stay criminal proceedings. Citing from Lord Reid’s decision inConnelly, it is said that this power arises from “the court’s residual discretion to prevent anything which savours of abuse of process”. This abuse may arise in many different forms, and most commonly concerns delay: at 641. The court cautioned that not all such abuses would warrant a permanent stay of criminal proceedings, which should only be granted in exceptional circumstances: at 643. The granting of a permanent stay would not be justified where “the powers of the judge and the trial process itself would have provided ample protection” to the accused:at 644. 43 I observe that this is broadly consistent with the position taken by the High Court of Australia inJago([10]supra), where Mason CJ said at 584: To justify a permanent stay of criminal proceedings, there must be a fundamental defect which goes to the root of the trial “of such a nature that nothing that a trial judge can do in the conduct of the trial can relieve against its unfair consequences”. 44 Gaudron J emphasised, at 616, that a permanent stay of criminal proceedings should only be granted as a final resort: Another feature attending criminal proceedings and relevant to the grant of a permanent stay thereof is that a trial judge, by reason of the duty to ensure the fairness of a trial, has a number of discretionary powers which may be exercised in the course of a trial … The existence and availability of these powers, when considered in the light of the necessarily limited scope of the power to grant a permanent stay, serve to indicate that a court should have regard to the existence of all of its various powers, and should only grant a permanent stay if satisfied that no other means is available to remedy that feature which, if unremedied, would render the proceedings so seriously defective, whether by reason of unfairness, injustice or otherwise, as to demand the grant of a permanent stay. 45 By the above, abuses of process (whether from delay or any other reason) that have rendered impossible a fair trial to an accused would justify a permanent stay of proceedings. It is for the accused to show on the balance of probabilities that he will suffer serious prejudice to the extent that no fair trial can be held, and that the continuance of the prosecution would amount to an abuse of the process of the court. This is a remedy of last resort and it is granted only in exceptional circumstances. These principles were endorsed inSaroopSingh([11]supra) (in the context of delay), which I adopted and applied to the present case from [51] below. 46 Having said that, I make a few comments about the second category of cases. According toMaxwell, a stay of criminal proceedings should be granted where the court concludes in all the circumstances a trial will “undermine public confidence in the criminal justice system and bring it into disrepute” so as to militate against the public interest in trying persons charged with criminal offences:Maxwellat [13]–[14], referring toExp Bennett([9]supra)andR v Latif[1996] 1 WLR 104 (“Latif”). In undertaking this enquiry, there is a balancing of competing public interestsie,that of ensuring that those who are charged with crimes should be tried with that of ensuring that the integrity of the criminal justice system is upheld. Again, the approach in Australia is broadly similar. InStrickland v Director of Public Prosecutions (Commonwealth) and others[2018] HCA 53, the High Court of Australia observed at [269] that one of the three non-exhaustive categories in which the power has been exercised is where the use of the court’s procedures would bring the administration of justice into disrepute. 47 However, I have some reservations in relation to this basis for granting a permanent stay. As gleaned fromMaxwellandLatif, this appears to encompass an “infinite variety of cases”. InExp Bennett, the court stayed criminal proceedings against the defendant as he had been forcibly abducted and brought into the country to stand trial in disregard of extradition laws. This case did not involve irremediable unfairness of the trial. Rather, the basis for granting a stay was that the initiation of criminal proceedings(in contravention of extradition laws) against the defendant was, in the opinion of the court, contrary to the public interest. In the local context, given Art 35(8), cases such asExp Bennettmight be more properly be dealt with under the judicial review mechanism regardless of the court’s views as to the public interest as the complaint does not strictly relate to an abuse of the process of the court. However, as I mentioned above, the accused persons did not seriously argue that the present case fell within this second category. As such, I need not make a determinative finding on this point and leave it for full arguments in an appropriate case. 48 I now turn to the question of conditional stays. Where appropriate, the Australian courts have ordered conditional stays of proceedings:Bui([10]supra)andR v Ulman-Naruniec[2003] 143 A Crim R 531. This is where the impugned conduct fails to reach the exceptional threshold required for a permanent stay, but where such unfairness and prejudice have been occasioned to the accused that a court has no other choice but to intervene. Even then, it is recognised that this would be an exceptional remedy:Buiat [96].As the effect of a conditional stay order is to stay the criminal proceedings indefinitely unless the conditions imposed are complied with, it shouldonlybe ordered if, but for the fulfilment of the conditions imposed, a permanent stay would be warranted. 49 As such, the circumstances in which a conditional stay would be justified would likely be extremely limited, assuming that the conditional stay of criminal proceedings is an available and appropriate remedy in the first place. I express this reservation because it seems to me that should it be required for the court to intervene to ensure fairness, the court should impose the appropriate orders or directions (with an adjournment of the proceedings if necessary). If the orders and directions are not complied with, and a fair trial becomes impossible, it may then be appropriate to impose a permanent stay. In this regard, no English or New Zealand authorities were cited to me in relation to orders for conditional stays of criminal proceedings. However, as I discuss at [97] below, I did not have to decide on this point conclusively. 50 For completeness, as the Prosecution submitted, any power to stay proceedings ought not to be exercised in order to express the court’s disapproval of official conduct. I agree. Its purpose is not to discipline the authorities in order to express the court’s disapproval of official conduct:Exp Bennett.",
        "Whether a stay of proceedings should be granted": "",
        "Grounds for the permanent stay": "51 I now turn to the application of these principles to the issue of whether a stay should be granted.In support of his application for a permanent stay, the first accused person relied on the following grounds: (a) that the Prosecution failed to act carefully and diligently in bringing the charges against the first accused;1Foot Note 1×1st Accused’s Written Submissions (“1AWS”) at para 35. (b) that the Prosecution was “effectively waging a war of attrition” against the first accused instead of conducting the trial in an expeditious manner;2Foot Note 2×1AWS at para 37. (c) that the Prosecution breached its disclosure obligations underMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205 (“Kadar”), thereby causing irreparable injustice to him;3Foot Note 3×1AWS at para 38. (d) that the Prosecution had made an unnecessary criminal motion for the court to hear further arguments on the issue of whether the Prosecution could rely on litigation privilege;4Foot Note 4×1AWS at para 45.and (e) that the Prosecution had made errors in the data evidence provided.5Foot Note 5×1AWS at para 47. 52 The second accused raised the following grounds in her application for a permanent stay: (a) the “drip-feeding” ofKadar-disclosable statements and late disclosure of “highly exculpatory” material;6Foot Note 6×2nd Accused’s Written Subs (“2AWS”) at para 44.and (b) that the Prosecution had conducted “prosecution by attrition”,7Foot Note 7×2AWS at para 88.which overlapped with the grounds advanced by the first accused. 53 I therefore analyse the grounds raised by the second accused under the five grounds set out by the first accused. Failure to act carefully and diligently in bringing charges 54 Essentially, the first accused pointed out that although the investigations against him commenced in 2014, 161 charges were preferred against him only in November 2016. Even then, the Prosecution amended 30 charges during the committal hearing. Then, in the middle of the trial, the Prosecution applied to amend 178 of the charges against him. Flowing from the application and the amendment of the charges, 28 days of trial, from 19 August 2019 to 27 September 2019, were vacated. The Prosecution had ample opportunities to review their case, and amend their charges at an earlier time.8Foot Note 8×1AWS at para 34.This, the first accused argued, led to “time and costs wasted that simply cannot be recovered”.9Foot Note 9×1AWS at para 36.Along a similar vein, the second accused contended that the amendment application caused significant prejudice to the accused persons.10Foot Note 10×2AWS at para 106. 55 By s 128 of the CPC, it is clear that the court may amend a charge at any time before judgment is given. A key consideration in any amendment application is the question of whether prejudice may be occasioned to the accused. As I indicated in my brief grounds on 27 August 2019 when I allowed the amendment application, that application was made 20 days into the Prosecution’s case. By then, the Prosecution had only called 12 of about 90 witnesses on the list of witnesses at the time. The amendments were in relation to the 178 charges of criminal conspiracy pursuant to s 120B of the Penal Code (see [2] above), which were originally charges of abetment by conspiracy pursuant to s 109 of the Penal Code. The amendments technically removed an ingredient from the original chargesie,the acts done pursuant to the conspiracy. However, the Prosecution confirmed that it would nonetheless prove such acts. Therefore, the Prosecution argued that its case did not materially change. 56 As I stated previously, there certainly was sufficient time and opportunity for the accused persons to review their respective defence strategies, so as to meet the case against them. In view of the nature of the amendment, the Prosecution queried if the vacation of all dates until 27 September 2019 would be required. One possibility discussed was to resume the trial in the middle of September 2019. Based on the instructions of the accused persons, however, Defence Counsel applied for a vacation of the remaining dates until 27 September 2019. To ensure that the accused persons were not prejudiced by the amendment of charges, I granted their requests to do so. 57 Even taking into consideration the lengthy period of investigations prior to the trial, and the amendment of 30 charges at the committal hearing stage, the amendment of the 178 charges during the trial was not irremediably unfair, oppressive or prejudicial to the accused persons such as to render a fair trial impossible. Prosecution by attrition 58 By “prosecution by attrition”, the accused persons essentially contended that the Prosecution had caused delay to the proceedings either deliberately or through incompetence as follows: (a) the “exceptionally lengthy” examination-in-chief of the Prosecution witnesses, despite the use of conditioned statements prepared pursuant to s 264 of the CPC for use as evidence-in-chief of the witnesses;11Foot Note 11×1AWS at para 37(a). (b) the piecemeal provision of conditioned statements and the exhibits of the Prosecution witnesses, at times right before or during the evidence of the relevant witnesses;12Foot Note 12×1AWS at para 37(b). (c) the provision of “vague and inadequate particulars” in the Prosecution’s s 231 CPC notices for new Prosecution witnesses who did not testify at the committal hearing;13Foot Note 13×1AWS at para 37(d).and (d) the Prosecution’s dilatory disclosure ofKadar-disclosable material after the Defence had requested for them allegedly hampered the cross-examination of a key Prosecution witness, Mr Ken Tai Chee Ming (“Mr Ken Tai”).14Foot Note 14×1AWS at para 37(e). 59 The first two matters are interlinked. Examination-in-chief is part and parcel of the trial process, and the Prosecution must be given time to present its case. While the Prosecution could have adduced oral evidence from its witnesses, to expedite the trial, conditioned statements have been (and will be) used. Although there was a need to elicit supplementary oral evidence from some of its witnesses, I did not consider the examination-in-chief of any witness to be “lengthy” to an egregious degree. Indeed, the length of the examination-in-chief reflected the scale and complexity of the case, and the amount of evidence to be adduced from some of the key witnesses. 60 In any event, as suggested by Defence Counsel in November 2019, the Prosecution began to provide supplementary conditioned statements for its witnesses along with additional exhibits (where possible) to reduce any need for oral supplementary evidence-in-chief and to further expedite matters. There was certainly no legal requirement for it to do so. As far as possible, the Prosecution aimed to provide any supplementary conditioned statement at least a month before the witness took the stand and prioritised its task based on the order of witnesses who were scheduled to the take the stand. As these supplementary conditioned statements were furnished in advance to the accused persons, this measure facilitated the preparation of cross-examination by Defence Counsel. I did not agree with the allegation that this was a “piecemeal” process, or that the “piecemeal” provision of the supplementary conditioned statements was unfair, oppressive or prejudicial to the accused persons. 61 I now turn to the alleged “vague and inadequate particulars” in the s 231 CPC notices for Prosecution witnesses who did not testify at the committal hearing. A notice pursuant to s 231 of the CPC is meant to contain “an outline of [the witness’] evidence”. While I accepted that the contents of the s 231 CPC notices for these witnesses initially provided by the Prosecution might have lacked detail in relation to some of the witnesses, I subsequently directed the Prosecution to furnish more particulars. The Prosecution did so. Nonetheless, the accused persons continued to take issue with the particulars given in relation to some witnesses. In this regard, I was of the view that sufficient notice had been given. Some of the witnesses are likely to be hostile witnesses. As such, it would not be reasonable to expect the Prosecution to be able to furnish detailed accounts of what the witnesses’ evidence would be. Again, I did not see any basis to allege this to be unfair, oppressive or prejudicial conduct. 62 I also did not think that the Prosecution’s allegedly dilatory disclosure of the details of Mr Ken Tai’s personal accounts and trades rendered a fair trial impossible. At the end of the day, the information was disclosed and made available for the cross-examination of Mr Ken Tai.15Foot Note 15×1AWS at para 37(e).The Prosecution disclosed the material once Defence Counsel made a specific request for them.16Foot Note 16×PWS at para 162.I did not agree with the first accused that the Prosecution had “intentionally withheld” the information, or with the second accused that “reasonable requests” were “met with obstruction and delay”. 63 For the above reasons, I did not think that the various aspects of this ground advanced by the accused persons rendered a fair trial impossible. Failure to discharge Kadar disclosure obligations 64 Next, the accused persons contended that the Prosecution had failed to comply with theirKadardisclosure obligations by failing to disclose the following material in a timely manner: (a) the investigation statements of key Prosecution witnesses;17Foot Note 17×1AWS at para 38; 2AWS at para 44. (b) phone messages between Prosecution witnesses and the accused persons;18Foot Note 18×1AWS at para 39.and (c) landline recordings of the various trading representatives of the trading accounts allegedly controlled by the accused persons to engage in market manipulation (“controlled accounts”)19Foot Note 19×1AWS at para 41.potentially relating to trading activity in the controlled accounts. 65 In relation to unused material, the scope of the Prosecution’sKadardisclosure obligations extends to disclosure of material that is credible and relevant to the guilt or innocence of an accused, or material that provides a real chance of pursuing a line of inquiry that leads to the first-mentioned material:Kadar([51]supra) at [113]. 66 I deal first with the allegation of the lack of timely disclosure of the investigation statements of key Prosecution witnesses. I should state that before the commencement of trial, the Prosecution had disclosed a large number of investigation statements to the accused persons. In the course of the trial, the Prosecution had also been disclosing further statements. According to the Prosecution, this resulted from their ongoing review of and compliance with itsKadarobligations, when more details emerged in the course of trial preparation (especially during witness interviews where inconsistencies with the expected evidence and the investigation statements emerged), when the witnesses testified in court, and when more became known about the cases run by the Defence. 67 I note that in particular, the accused persons took issue with the late disclosure of the investigation statements of the following witnesses: Mr Ng Kit Kiat, Mr Ken Tai, Mr Gwee Yeow Pin,20Foot Note 20×The accused persons rely on the alleged late disclosure of the investigation statements of these three witnesses.Mr Goh Hin Calm, Mr Peter Chen, associates of Mr Gabriel Gan and Mr Lee Lim Kern.21Foot Note 21×The first accused relies on the alleged late disclosure of these additional witnesses.The Prosecution provided factual rebuttals to these allegations (which I shall not set out in full).22Foot Note 22×PWS at para 65.While the Prosecution could have erred on the side of caution in disclosing the investigation statements, as recently exhorted by the Court of Appeal inMuhammadNabill bin Mohd Fuad v Public Prosecutor[2020] SGCA 25 (“Nabill”), I disagreed that there were “repeated” or “egregious” breaches of theKadarobligations, or any deliberate withholding of “highly exculpatory” material.23Foot Note 23×2AWS at paras 4(a), 43-84. Soh Chee Wen’s statement paras 47-72. 68 Three investigation statements of Mr Ng Kit Kiat were served when the witness was on the stand because the allegation made about witness coaching rendered it appropriate to do so. The remaining six out of 20 investigation statements of Mr Ken Tai were furnished one month before Mr Ken Tai took the stand. At the end of the day, the relevant investigation statements were available for the cross-examination of Mr Ng Kit Kiat and Mr Ken Tai. No irremediable unfairness was caused to the accused persons. In respect of Mr Gwee Yeow Pin and Mr Goh Hin Calm, the investigation statements were served prior to the trial on 22 March 2019, and for the others, in March 2020. These witnesses have not taken the stand, and the investigation statements would be available for their cross-examination. 69 I should add that to facilitate proceedings, the Prosecution has agreed to discloseallthe investigation statements of the witnesses who will be called on to testify in court. Further, the Prosecution will disclose all the investigation statements made by potential witnesses who will not be called that Defence Counsel requests for.24Foot Note 24×PWS at para 202.This position takes on board the Court of Appeal’s observation inNabillat [48] that “where there is any doubt over whether a particular statement is subject to disclosure, whether under theKadaror [Nabill]disclosure obligations, the Prosecution ought to err on the side of disclosure.” Thus, I did not see any further prospect of concern on this front, such as to render a fair trial impossible. 70 I now turn to the phone messages. The first accused’s main contention was that the Prosecution only sought to disclose phone messages which they deemed relevant and which they were relying on to prove their case, rather than the entire corpus of phone messages in their possession.25Foot Note 25×Statement of Soh Chee Wen at paras 60 – 61. 71 On this point the Prosecution argued that they were not obliged, underKadar, to disclose allthe messages in their possession, but only those that were relevant to the case. In particular, it had sought not to introduce irrelevantmessages. However, once the concern had been expressed by the court about the possibility of the Prosecution missing out potentially relevant messages, the Prosecution agreed to disclose the full threads of messages where any message within such threads were relied on by the Prosecution, or which were requested by the Defence Counsel.26Foot Note 26×PWS at para 81.This position was reached prior to the decision inNabill.The Prosecution maintained that such disclosure was not pursuant to itsKadarobligations, but to facilitate the smooth conduct of the trial. 72 As I stated above at [65], the scope of the Prosecution’sKadardisclosure obligations in relation to unused material is not unlimited. The Prosecution is under no obligation to disclose all the phone messages in its possession. In any event, with the present level of disclosure of full message threads, there is no risk of any message being inadvertently left out because of the Prosecution’s assessment whether any message falls within itsKadarduty of disclosure. At the end of the day, the phone messages are being disclosed in advance of the cross-examination of the relevant witnesses,27Foot Note 27×PWS at Annex B.and therefore a fair trial is not rendered impossible. 73 Lastly, I deal with the issue of the disclosure of the landline recordings of the various trading representatives of the controlled accounts. The accused persons argued that it was “undisputed that the contents of the landline recordings (which include accountholders giving instructions, reporting of trades done as well as positions due, discussions on contra losses and payment and accountholders calling to check about their accounts) are clearly relevant and helpful to the case”28Foot Note 28×1AWS at para 41; 2AWS at para 65.and should have been disclosed before the committal hearing.29Foot Note 29×1AWS at para 40.The Prosecution failed to disclose the material despite a request made by the first accused on 3 December 2018. The accused persons also pointed out that these landline recordings had “already affected the cross-examination of Mr Henry Tjoa” (a trading representative for several controlled accounts) and that they were not available for the cross-examination of several trading representativeseg,Mr Andy Lee, Mr Alex Chew, Mr Ong Kah Chye and Mr Ng Kit Kiat, all of whom had already given evidence. 74 In my view, even if there had been any tardy disclosure of these landline recordings, it did not render a fair trial impossible because it remains for Defence Counsel to take such steps as necessary to address this issue. For one, it remains open for Defence Counsel to submit that the court should not attach weight to any witness’ testimony if the landline recordings were inconsistent with the witness’ evidence. Of course, there is still the possibility of recalling any witness. 75 But to begin with, I was not persuaded that the Prosecution’s conduct with regards to the landline recordings amounted to seriously unfair, oppressive or prejudicial conduct.The initial request on 3 December 2018 was framed in broad terms30Foot Note 30×PWS at para 87.and the Prosecution had, reasonably in my view, asked the Defence to provide the basis for such a broad request.31Foot Note 31×PWS at para 88. the Prosecution does not owe a duty to the Defence to analyse or filter the materialIn any case, the fact that the Prosecution had landline recordings in its possession would have been clear from 22 February 2019, which was when the Prosecution served six recordings from the landline of Mr Wilson Kam on Defence Counsel.32Foot Note 32×PWS at para 89.Clearly, the Prosecution was not concealing the fact that it had landline recordings in its possession. The specific request foralllandlinerecordings was made on 18 March 2020,33Foot Note 33×PWS at para 92.and the Prosecution acceded to disclosure shortly after. Again, taking guidance fromNabill,the Prosecution could have erred on the side of caution, and disclosed all landline recordings. However, there was no basis for me to find that the conduct amounted to an abuse of process. 76 The second accused then alleged that, in providing the landline recordings to the Defence, the Prosecution had “indiscriminately flooded the Defence with all unused material,i.e.all available landline recordings and call logs of the local brokerage firm trading representatives that appear in exhibit IO-F” and that it “now expects the Defence to do the Prosecution’s work by sifting out the wheat from the chaff, even though the undeniable disparity of resources between the Prosecution and accused persons makes such an exercise impracticable in the extreme”.34Foot Note 34×2nd Accused’s Further Written Submissions (“2AFWS”) at para 17.In my view, the allegation was of no merit. The Prosecution’sKadarduty is to disclose material. As a category of material, the landline recordings have been disclosed. The Prosecution thus duly discharged itsKadarobligations (assuming that all the landline recordings fell within theKadarduty to begin with). The Prosecution does not owe a duty to the Defence to further analyse or filter the material, and there was nothing unfair in this. 77 The remaining issue was whether I should find that the Prosecution had material falling within itsKadardisclosure obligations that remains undisclosed, as the second accused appears to suggest.35Foot Note 35×2AWS at para 80.I did not think so. A presumption of regularity applies in respect of the Prosecution’s discharge of theirKadarduty of disclosure:Lee Siew Boon Winston v Public Prosecutor[2015] 4 SLR 1184 at [169]. As such, the court cannot simply find that disclosures of specific material havenotbeen made without the benefit of any clear evidence to the contrary. The second accused certainly did not adduce any evidence to this end. 78 For the foregoing reasons, I did not agree that the manner, mode and timing of disclosure of information and material amounted to an abuse of process, and a fair trial was rendered impossible. The “unnecessary” criminal motion 79 The accused persons took issue with the Prosecution’s bringing of the criminal motion to determine whether the Prosecution could claim litigation privilege in criminal proceedings. This criminal motion was lodged after I had made a ruling on the issue on 23 May 2019 based on brief arguments. The accused persons contended that the criminal motion was “procedurally improper”, and that the Prosecution’s further arguments on litigation privilege were “entirely unnecessary”.36Foot Note 36×1AWS at para 46. 80 In dealing with the criminal motion, I agreed with the accused persons that a criminal motion was not the correct procedure. However, I was also of the opinion that the issues were important ones that could and should be dealt with expeditiously by way of an application for further arguments in the course of the main proceedings.37Foot Note 37×Minute Sheet in HC/CM 24/2019 dated 9 July 2019. 81 I did not see how the bringing of the criminal motion, while procedurally deficient, made a fair trial impossible. Admittedly, some time and costs might have been spent by the accused persons to raise the procedural objection. Such is the course of litigation. It is by no means out of the ordinary. However, there was no delay occasioned to the criminal proceedings, as the matter was dealt with in the middle of two tranches of trial dates. As the issues merited further consideration in the context of the criminal proceedings against the accused persons, I did not think there was anything untoward on the part of the Prosecution in raising them. Indeed, eventually, I ruled in favour of the Prosecution in relation to its position that it is entitled to claim litigation privilege. Further, I decided not to order costs of the criminal motion to the accused persons under s 409 of the CPC as I did not consider that the criminal motion was frivolous, vexatious or otherwise an abuse of process of the court. Errors in the data evidence 82 The accused persons argued that “numerous errors in the data provided” by the Prosecution led to a waste of trial time and substantial wasted costs being incurred, thereby justifying a permanent stay of criminal proceedings. Such errors comprised incomplete orders and trades data in SGX-2, SGX-4 and SGX-6,38Foot Note 38×Statement of Soh Chee Wen at para 84-90; 2AWS at paras 90-93.inaccurate flags within SGX-1, SGX-3 and SGX-5,39Foot Note 39×Statement of Soh Chee Wen at para 96.technical errors in the statistical analysis conducted by GovTech,40Foot Note 40×Statement of Soh Chee Wen at paras 91-95.erroneous data used to prepare the Prosecution’s expert report,41Foot Note 41×Statement of Soh Chee Wen at para 97.and errors in SGX-1, SGX-3 and SGX-5 (compared to the contract reports in SGX-7) in relation to post-trade amendments.42Foot Note 42×Statement of Soh Chee Wen at paras 98-99. 83 While I acknowledge the Prosecution’s explanation that these errors arose due to the scale and complexity of this case,43Foot Note 43×PWS at para 109.I was of the view that the Prosecution and the investigation agencies should have been more meticulous and rigorous in terms of trial preparation. Nonetheless, I agreed that the Prosecution has tried its best to address the problems. More importantly, the Prosecution has taken the position that it would resolve any issues in the Defence’s favour where gaps in information persisted.44Foot Note 44×PWS at para 109.Thus, there was no basis for me to find that the conduct was seriously unfair, oppressive and prejudicial, such that a fair trial was rendered impossible. 84 I only wish to make these further observations. First, the affected flags within SGX-1, SGX-3 and SGX-5 had no bearing on the case. In fact, Defence Counsel confirmed this, and the parties were able to proceed to use the unamended SGX documents without the corrected flags. 85 Second, the incomplete orders and trades data in SGX-2, SGX-4 and SGX-6 concerns “untraded orders” in 58 accounts held at foreign brokerages and private banks, out of 189 controlled accounts (with 131 being accounts at local brokerages). Instead of containing all orders (including untraded orders), the relevant SGX documents only contained orders that had been traded, whether in full or in part. The problem was discovered during the cross-examination of Mr Ken Tai. Upon this discovery, the Prosecution worked to remedy the situation (and agreed to resolve any uncertainties in data in favour of the accused persons). As it stands, I am informed that the untraded orders added less than 2% each to the total number of orders and trades in the controlled accounts. The further information was then made available for the cross-examination of Mr Ken Tai. Essentially, the untraded orders for a few days out of the relevant period formed the subject of cross-examination of Mr Ken Tai. The next witness who is likely to be confronted with such evidence has yet to take the stand. 86 Third, I turn to the problems in SGX-1, SGX-3 and SGX-5 (compared to contract reports in SGX-7) in relation to post-trade amendments. SGX-1, SGX-3 and SGX-5 capture orders and trade data. However, after orders are traded, there may be amendments made which are reflected in the contracts reports in SGX-7. These are not captured in SGX-1, SGX-3 and SGX-5. To address this problem in relation to SGX-1, SGX-3 and SGX-5, the Prosecution had worked to obtain further information on the post-trade amendments. The update was that there are approximately 120 post-trade amendments out of 192,000 trades (representing about 0.06% of all trades). Out of these, only 28 of these involved adjustments between controlled accounts and accounts which are not the subject matter of the charges (representing about 0.01% of all trades). 87 By the additional observations, the point I wish to make is that while it may be premature for me to conclude, as the Prosecution submitted, that “these issues were limited in extent, and do not shake the integrity of the data or materially change the complexion of the evidence”, there has certainly been no evidence to the contrary so as to conclude that the impact of the errors is such that a fair trial is rendered impossible. 88 In terms of trial management, while the Prosecution attended to the problem in relation to the “untraded orders” in SGX-2, SGX-4 and SGX-6 which arose in the midst of the cross-examination of Mr Ken Tai, the trial proceeded by interposing 29 witnesses so that there would be minimal loss of trial time. In this connection, I did not agree that Defence Counsel did not have time to prepare for the cross-examination of these 29 witnesses. There were conditioned statements for all but one of these witnessesie,Mr Tiong Sing Fatt. Furthermore, the list of 29 witnesses which were dealt with was agreed upon with the input of Defence Counsel. In relation to the other data sets which presented concerns, there was also minimal impact on trial time. 89 The remaining question was, therefore, whether I should find that a fair trial had been rendered impossible because of potential errors in the evidence lying undiscovered beneath the surface. Indeed, it remains open for the accused persons to challenge any errors in the evidence. In my view, it would be entirely premature and speculative for me to find that a fair trial had been rendered impossible. Conclusion on the prayer for a permanent stay of criminal proceedings 90 For the reasons stated above, I did not think that a permanent stay of criminal proceedings was justified on any or all of the grounds advanced by the accused persons. 91 I conclude by observing that three grievances underpinned the grounds raised by the accused persons. 92 First, that the trial was unnecessarily prolonged, as time was required to alleviate any potential unfairness to the accused persons from the events discussed above. There was also the concern that the trial would be prolonged further should the Prosecution continue with this path of conduct. As I said, I did not find that the Prosecution acted unfairly so as to prejudice or oppress the accused persons. Moreover, I did not consider the prolonging of the trial thus far (and potentially to deal with issues that arise) would render a fair trial impossible. InSaroopSingh([11]supra), Yong CJ held that an extremely long delay of 15 years (where there had been inaction on the part of the Prosecution) had rendered a fair trial impossible, because the offender’s criminal liability would turn on one key factual issue requiring the judge to assess the credibility of witnesses’ impressions of the state of the offender’s drunkenness: at [27]. In his view, it was doubtful that the four key witnesses to the trial would be able to recall the events more than 18 years ago with any accuracy: at [29]. Simply put, these conditions are not present here. Any delays occasioned did not (and are not likely to) cause a substantial lapse of time, thus completely undermining the ability of the witnesses to recollect the material events.In any event, the witnesses’ evidence would not be the sole determinant of the guilt or innocence of the accused persons, given the presence of other evidence. 93 Second, the accused persons also argued that there have been wasted costs (or costs thrown away), especially incurred in analysing the erroneous data. There were also costs wasted as the defence strategies had to be reviewed, in order to take on board the effect of the disclosed material and changed positions. While there might have been some wasted costs, I was not persuaded that any work done thus far, be it by Defence Counsel or any expert, had beencompletelywasted. Admittedly, in a complex trial such as this, the accused persons would wish to carefully consider their strategies and maximise their available resources so as to effectively present their defence. Diminished resources on the part of the accused persons, however, would not, in my view, render a fair trial impossible. 94 Third, I was mindful, of course, that the first accused remains in remand. Therefore, it would be important that the trial be conducted efficiently. This requires the efforts not only of the Prosecution, but also Defence Counsel, to maximise the use of trial time. The parties must continue to strive to do so. That said, the first accused had been denied bail because of a wholly separate set of considerations. On this point, I refer to [98] below. 95 In light of all the above, I dismissed the accused persons’ primary prayer for a permanent stay.",
        "Grounds for the conditional stay": "96 I now turn to the accused persons’ alternative prayer for a conditional stay of criminal proceedings on the same grounds. The conditions which the accused persons asked to be imposed are as follows: (a) for the Prosecution to pay the first accused’s costs,45Foot Note 45×1AWS at para 4(a).and the second accused’s reasonable costs at the committal hearing as well as wasted costs;46Foot Note 46×2AWS at para 3(b). (b) for bail to be granted to the first accused;47Foot Note 47×1AWS at para 4(b). (c) for the Prosecution to disclose all material falling within theirKadarobligations;48Foot Note 48×2AWS at para 3(b).and (d) for the Prosecution to carry out a complete review of all its exhibits and evidence and to provide an undertaking that all its exhibits and evidence are complete and accurate.49Foot Note 49×2AWS at para 3(b). 97 As I indicated above at [49], I have some doubts about the availability and appropriateness of such a conditional stay order. In any event, I should state that for the same reasons for dismissing a permanent stay, I did not think there were exceptional reasons to grant a conditional stay either. In particular, any problems in relation to disclosure and errors in data have been (and will be) dealt with in the course of trial. This alone was sufficient to dispose of the alternative prayer. I make two more observations. 98 In my view, bail cannot be sought as a condition of a stay, bypassing the requirements within s 97 of the CPC and without satisfying the applicable legal principles in relation to the grant of bail. On 27 February 2018, I rejected the first accused’s application for bail on the grounds that the first accused was a real flight risk50Foot Note 50×HC/CM 26/2017, Minute Sheet 27 February 2018 (Oral Judgment) at para 9.and that there was some evidence that he had engaged in witness tampering.51Foot Note 51×HC/CM 26/2017, Minute Sheet 27 February 2018 (Oral Judgment) at para 10.If there has been any material change in circumstances, it would be appropriate for an application to be made under the proper provision within the CPC.52Foot Note 52×PWS at para 211.Circumventing such an application by way of a conditional stay would hence be improper. 99 Further, I am of the view that the court does not have the power to order costs against the Prosecution at this stage. Under s 355(2) of the CPC, the court’s power to order costs against the Prosecution arises only when an accused is acquitted of the charges against him or her, and the prosecution is frivolous or vexatious. Where these conditions have not been fulfilled, it does not seem to me that the court has the power to order costs against the Prosecution.",
        "Conclusion": "100 For the reasons given above, I dismissed the applications. Hoo Sheau PengJudge Teo Guan Siew, Jiang Ke-Yue, Nicholas Tan, Loh Hui-min, Ng Jean Ting and David Koh (Attorney-General’s Chambers) for the prosecution; Narayanan Sreenivasan SC, Lim Wei Liang Jason and Tan Zhen Wei Victoria (K&L Gates Straits Law LLC) for the first accused; Philip Fong Yeng Fatt, Sui Yi Siong and Lau Jia Min Jaime (Eversheds Harry Elias LLP) for the second accused."
    }
}