{
    "case_title": "Yip Fook Chong (alias Yip Ronald) and anothervLoy Wei Ezekiel and another",
    "ncitation": "[2020] SGHC 84",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 The case pertains to an alleged oral agreement (the “Agreement”) between a 73-year-old man (the first plaintiff) who suffers from post-ICU delirium and a 22-year-old man (the first defendant) gone awry. The first plaintiff’s property (the “Telok Kurau Property”) was mortgaged to Coutts & Co Ltd (“Coutts”) as security for a loan granted by Coutts to the first plaintiff, who owed an outstanding loan of $2.625m to Coutts. The second plaintiff helped the first plaintiff source for a replacement funder due to pressure from Coutts for the first plaintiff to move out of his property. 2 The first plaintiff and first defendant are co-directors and shareholders of the second plaintiff. The second plaintiff entered into a $4m loan with a third party funder, Ethoz Capital Ltd (“Ethoz”). The said loan was secured over the Telok Kurau Property and personally guaranteed by the first plaintiff and first defendant jointly and severally. The $4m was used to discharge the outstanding mortgage of the sum $2.625m and the advance interest to Ethoz for $281,500. The balance sum of $1,268,500 was deposited into the second plaintiff’s bank account. 3 The first defendant transferred the balance sum into the second defendant’s bank account and subsequently into his own personal bank account. The balance sum is the subject of the parties’ dispute. The plaintiffs claim that (a) the first defendant’s use of the balance sum was in breach of his fiduciary duty and was unconscionable; and (b) the defendants were unjustly enriched. The defendants’ defence is that the use of the balance sum was in accordance with the Agreement entered into for investment purposes on behalf of the second plaintiff company.",
        "Facts": "",
        "The parties": "4 At the material time in 2016, the first plaintiff, Mr Yip Fook Chong @ Yip Ronald (“Yip”) was 73 years old. Yip has a Bachelor of Science (Engineering) degree and a Master of Science (Mechanical Engineering) degree.1Foot Note 1×Yip’s AEIC at para 2.After obtaining work experience managing offshore oil and gas underwater engineering projects for major multinational companies, Yip started his own business building and selling barges and tugboats under the second plaintiff company, Yip Holdings Pte Ltd (“Yip Holdings”).2Foot Note 2×Yip’s AEIC at para 2.Yip retired around 2010 and since he was the sole director and shareholder of Yip Holdings, the company ceased doing business and became dormant.3Foot Note 3×Yip’s AEIC at para 2. 5 The first defendant, Mr Loy Wei Ezekiel (“Loy”) was 22 years old at the material time in 2016 and started serving his National Service on 17 May 2016.4Foot Note 4×Loy’s AEIC at para 4.Loy identifies himself as an entrepreneur and a businessman.5Foot Note 5×Loy’s AEIC at para 4. 6 Yip and Loy are currently co-directors and shareholders of Yip Holdings. Loy remains the majority shareholder with 105,000 shares while Yip holds the remaining 95,000 shares of the company.6Foot Note 6×Agreed Bundle of Documents (“ABOD”) at p 571.This is the current status of Yip Holdings’ shareholding till date. However, this was not always the case. 7 Yip was previously the sole director and sole shareholder of Yip Holdings. On or around 20 April 2016, Loy was appointed as a director Yip Holdings (“the Appointment”).7Foot Note 7×ABOD at p 571.Between 20 June 2016 and 21 June 2016, 105,000 shares of Yip Holdings were transferred from Yip to Loy (“the Share Transfer”).8Foot Note 8×ABOD at pp 61, 64.The notifications of the Appointment and the Share Transfer were lodged with ACRA from 22 to 23 September 2016.9Foot Note 9×SOC at paras 4-5; Loy’s AEIC at para 55.However the circumstances under which the Appointment and Share Transfer were made are disputed by the parties. 8 Loy is also the sole director and shareholder of the second defendant company, Property Street Pte Ltd (“Property Street Pte Ltd”), which was formerly known as Yip & Loy Pte Ltd.10Foot Note 10×ABOD at p 540.",
        "Telok Kurau Property, Coutts Outstanding Mortgage and the Ethoz Loan": "9 Yip owned a property (ie,the Telok Kurau Property) and lives alone in the Telok Kurau Property as he is divorced and his only daughter (“Li-Fen”) worked overseas.11Foot Note 11×Yip’s AEIC at para 2.At times, an unidentified lady from the Philippines visited Yip at his place, who Loy claims to be his mistress.12Foot Note 12×Loy’s AEIC at paras 23, 42. 10 The Telok Kurau Property was mortgaged to Coutts as security for a loan granted by Coutts to Yip.13Foot Note 13×Yip’s AEIC at para 5; Statement of Claim (Amendment No. 1) (“SOC”) at para 1.As Coutts was winding down their operations, it was pressuring Yip to pay back the outstanding loan of $2,625,000 to them (“Outstanding Mortgage”). This led Yip to source for another funder to pay off his loan with Coutts.14Foot Note 14×Yip’s AEIC at para 5. 11 The subject matter of the plaintiffs’ case is a sum of $1,268,500 which is the balance of a $4m loan borrowed by Yip Holdings from a funder, Ethoz. This $4m loan will be referred to as the “Ethoz Loan” and sum of $1,268,500 will be referred to as the “Balance Sum”. The Balance Sum was deposited into Yip Holding’s bank account and subsequently transferred into Property Street Pte Ltd’s bank account for further use, which is currently a matter of dispute between the parties.",
        "Yip and Loy’s business relationship": "The first meeting 12 Sometime around December 2015 to 2016, Yip and Loy became acquainted.15Foot Note 15×Yip’s AEIC at para 3; Loy’s AEIC at para 7.Yip’s testimony was that Loy befriended him in a coffee shop opposite 106 Rangoon Road.16Foot Note 16×Yip’s AEIC at para 3.According to Loy, it was through his broker, named Ms Jan Lee (“Jan”), who connected “like-minded investors to businessmen who could do business together”.17Foot Note 17×Loy’s AEIC at para 7.A first meeting was conducted at the coffeeshop along Rangoon Road between Loy, Yip, Jan and two other individuals Mr Alex Tan (“Alex”), who was allegedly Yip’s broker, and Mr Ronnie Low (“Ronnie”), who was Yip’s project manager for an upcoming real estate redevelopment project.18Foot Note 18×Loy’s AEIC at para 10.This redevelopment project will be referred to as the “Rangoon Redevelopment Project”. 13 On the other hand, Yip does not recall ever knowing either Alex or Ronnie at trial.19Foot Note 19×NE 2 October 2019 at p 48. Rangoon Redevelopment Project (according to Loy) 14 Loy testified that Jan had informed him of a potential business partner (ie, Yip)seeking for investors to join in on his real estate redevelopment plans. Requiring funds of approximately $2.625m, this potential business partner was seeking to inject money into his property located at Telok Kurau area in return for a portion of the house and rights to redevelop a three-storey property located at the Rangoon Road area.20Foot Note 20×Loy’s AEIC at para 8. 15 Yip allegedly told them that they could redevelop the building located at 102, 104 and 106 Rangoon Road (the “Rangoon Properties”), all of which were units that Yip allegedly owned, as Yip wanted to honour his father who was the previous developer of the said Properties.21Foot Note 21×NE 4 October 2019 at p 66.However, Yip was unable to proceed with the redevelopment of the Rangoon Properties as he had to first raise funds to discharge an outstanding mortgage of $2.625m on his Telok Kurau Property due to Coutts.22Foot Note 22×Loy’s AEIC at para 13.At the end of the first meeting, Loy informed Yip that there was potential for the Rangoon Redevelopment Project as the Rangoon Road Properties were old, run down and underdeveloped.23Foot Note 23×Loy’s AEIC at para 14.Loy proposed to Yip that he could get together some of his Malaysian business partners, namely Mr Edwin Wong (“Datok Wong”) and Tunku Mukhri A’lwi (“Tunku”), to join them in their meeting due to their “strong expertise in real estate development in Malaysia”.24Foot Note 24×Loy’s AEIC at para 15. 16 Sometime in December 2015, Jan, Alex, Ronnie, Yip, Datok Wong and Tunku met at the same coffee shop and discussed the possibility of incorporating a new company in Singapore for the purposes of real estate development.25Foot Note 25×Loy’s AEIC at para 15.Thereafter, Yip brought the parties for a tour of the Rangoon Road Properties save for one unit, which Yip informed them was tenanted out and thus he was unable to let them inside.26Foot Note 26×Loy’s AEIC at para 17.After the site visit, Yip allegedly confirmed that the Rangoon Road Properties belonged to him.27Foot Note 27×Loy’s AEIC at para 18.The fact that Yip allegedly owned all of the Rangoon Properties is in fact untrue (see below at [123]). 17 Yip and Loy then decided to redevelop the Rangoon Properties into a boutique condominium or tear them down completely and rebuild them as a hotel (ie, the Rangoon Redevelopment Project).28Foot Note 28×Loy’s AEIC at para 18.However, the Outstanding Mortgage owed to Coutts was an obstacle to the Rangoon Redevelopment Project.29Foot Note 29×Loy’s AEIC at para 19. 18 Loy testified that Yip and Loy decided that it was better to deal directly with each other for the Rangoon Redevelopment Project instead of going through their respective brokers, Alex and Jan, as they were looking to earn the commission.30Foot Note 30×Loy’s AEIC at para 20.They hence decided to only involve Alex and Jan once the Rangoon Redevelopment Project had completed for the purposes of marketing the new development.31Foot Note 31×Loy’s AEIC at para 20. 19 This was how the business relationship between Yip and Loy allegedly started.32Foot Note 32×Loy’s AEIC at para 20. Subsequent meetings 20 Thereafter, most of their business meetings involving the Rangoon Redevelopment Project took place at the Telok Kurau Property.33Foot Note 33×Loy’s AEIC at para 21.These meetings would usually last a few hours and out of convenience, Yip duplicated a set of house keys for Loy and allowed Loy to stay over at the Telok Kurau Property after the meetings, if he so wished.34Foot Note 34×Loy’s AEIC at para 21.",
        "The Agreement": "21 I now turn to summarise the parties’ position on the alleged Agreement and its terms, which is a key contention of the present dispute. The defendants’ position 22 It is the defendants’ version of events that by way of oral discussions from November 2015 to April 2016, Yip and Loy discussed the following terms:35Foot Note 35×Defence (Amendment No. 1) dated 5 March 2018 (“Defence”) at para 9. (a) Yip represented that he owned the property at 102 Rangoon Road (“102 Rangoon Road Property”); (b) Yip’s Telok Kurau Property had an outstanding mortgage of $2,625,000 due to Coutts; (c) Loy was to come up with a plan to assist Yip to discharge his mortgage; (d) Yip and Loy agreed that should Loy successfully assist Yip in discharging the outstanding mortgage due to Coutts, Yip would grant the right to re-develop the 102 Rangoon Road Property to any of Loy's companies. 23 By way of verbal discussions between Yip and Loy over the period ofApril to September 2016, Yip and Loy entered into an agreement orally (ie, the Agreement referred to in [1]) with the following terms:36Foot Note 36×Defence at para 10. (a) Yip would transfer 105,000 shares of Yip Holdings to Loy. (b) Both Yip and Loy would be shareholders of Yip Holdings. (c) Yip would also appoint Loy as a director of Yip Holdings. (d) In return, Loy would be in charge of running the operations and finances of Yip Holdings. (e) Ethoz would then enter into a loan agreement with Yip Holdings. (f) Pursuant to the loan agreement, Ethoz would disburse $4,000,000 to Yip Holdings. (g) Of the loan amount of $4,000,000, $281,500 would be retained by Ethoz as advance interest. (h) Of the loan amount of $4,000,000, Yip would utilise $2,450,000 to discharge the mortgage held in favour of Coutts. (i) The original amount due to Coutts was $2,625,000. Loy assisted Yip in reducing the amount payable to Coutts to $2,450,000 by way of negotiations between Coutts, Yip and Loy that took place from May to November 2016. (j) As a result, Yip agreed that the difference of $175,000 was due to Loy as payment for reducing the amount payable to Coutts (“the Haircut Sum”).37Foot Note 37×Loy’s AEIC at para 27. (k) Of the remaining loan amount of $1,268,500, Yip and Loy agreed that Loy would manage the finances of Yip Holdings and increase the original capital of $1,268,500. (l) Yip and Loy agreed that Loy was allowed to withdraw the $1,268,500 from Yip Holding's Account to invest so as to grow the capital of Yip Holdings (known as the “Investments”). (m) Once Loy had grown Yip Holding’s funds sufficiently, Loy would transfer the funds back into Yip Holdings’ Account. The profits would then be utilised to develop the 102 Rangoon Road Property. (n) At the same time, Yip would try to sell his Telok Kurau Property at a profit and invest the profits back into Yip Holdings’ Account so that Yip Holdings could accumulate sufficient funds to develop the 102 Rangoon Road Property and the Rangoon Redevelopment Project.38Foot Note 38×Loy’s AEIC at para 69(e). (o) Any further charges aside from the first year advance interest charged by Ethoz was to be borne by both Loy and Yip. There was no agreement as to the proportion each party had to pay for the further charges. The source of funds for each party is as follows: (i) Loy was to use the returns of the Investments from growing the capital of Yip Holdings (above at [23(l)]) to make payment for a part of the further charges. (ii) Yip was to use the proceeds of sale of the Telok Kurau property to make payment for the further charges. If the Telok Kurau Property was not sold by the date due for payment of the further charges, Yip was to use the rental proceeds he obtained from 102 Rangoon Road to make payment for a part of the further charges. 24 It was also agreed between the parties that Loy would engage in the following as part of the said Investments:39Foot Note 39×Loy’s AEIC at para 69(d). (a) approximately $900,000 would be invested in the property located at 304 Orchard Road, Lucky Plaza (the “Lucky Plaza Property”); (b) approximately $200,000 would be invested in shares; and (c) approximately $100,000 would be invested in a mobile application and technology called “Property Street”. The plaintiffs’ position 25 On the other hand, Yip denied making the Agreement and did not agree to Loy’s business plan.40Foot Note 40×PCS at paras 22-23; Yip’s AEIC at para 24.It is Yip’s testimony that except for agreeing to take a loan from Ethoz for the purpose of repaying Coutts, Yip had not made any agreements or given his consent to the Share Transfers, the terms of the Agreement, the transfer of the $1,268,500 from Yip’s Holding’s Account to Yip & Loy’s bank account, and the Investments of the said $1,268,500, as claimed by Loy.41Foot Note 41×Yip’s AEIC at para 24, with reference to Defence at paras 8.2, 10, 23 and 24. 26 Yip also testified that he did not remember signing any form appointing Loy as the director of Yip Holdings or any form transferring any shares in Yip Holdings to Loy nor instructing Loy to lodge anything with ACRA.42Foot Note 42×Yip’s AEIC at para 25.",
        "Formation of the alleged Agreement": "27 I now turn to the events that led to the formation of the alleged Agreement. Sourcing for Replacement Funders 28 Pursuant to the oral discussions (see above at [22]), Loy looked for financial organisations to grant Yip and Loy loans and business opportunities.43Foot Note 43×Defence at para 9.2.According to Loy, they approached approximately 13 financial institutions including Premier E-Force Pte Ltd (“Premier E”), RedPine Capital Funding Pte Ltd (“Red Pine”) and ORIX Leasing Singapore Ltd (“ORIX”).44Foot Note 44×Loy’s AEIC at para 24. 29 According to Loy, Yip offered him an incentive to help Loy secure a funder by informing Loy that he could retain the difference in mortgage sum (ie, the Haircut Sum) if Loy were able to help him discharge the Outstanding Mortgage with Coutts at a lower sum of $2.625m.45Foot Note 45×Loy’s AEIC at para 27.For instance, if Loy managed to reduce the mortgage sum payable to Coutts to $2.45m (which he eventually did), Loy would be entitled to retain the Haircut Sum of $175,000 (ie, the difference between $2.625m and $2.45m). According to Loy, the reason for giving Loy this Haircut Sum was because Yip knew that “he would be making way more money once he could discharge the Outstanding Mortgage and the Rangoon Redevelopment [Project] was completed”.46Foot Note 46×Loy’s AEIC at para 27. (1) April 2016: Coutts’ demands to pay the Outstanding Mortgage 30 Around April 2016, Coutts started actively sending out demands to Yip requesting him to discharge the outstanding mortgage.47Foot Note 47×Loy’s AEIC at para 25.However, the financial institutions that Yip and Loy approached were unwilling to advance substantial loans to Yip due to his advanced age.48Foot Note 48×Loy’s AEIC at para 25. 31 It is Loy’s testimony that on 20 April 2016, Yip decided to appoint Loy as a director of Yip Holdings as his business partner as (a) part of the Rangoon Redevelopment Project; and (b) to help source for investors who could help Yip to discharge the Outstanding Mortgage.49Foot Note 49×Loy’s AEIC at para 26.The said appointment was to facilitate the negotiation process with financial institutions and other business personnel. Yip also actively started introducing Loy as the co-director of Yip Holdings to the staff of the various financial institutions.50Foot Note 50×Loy’s AEIC at para 26. (2) May 2016: Red Pine 32 In May 2016, Yip and Loy were in discussions with one Natty Jung from Red Pine for the possibility of disbursing a loan to help Loy discharge the Outstanding Mortgage.51Foot Note 51×Loy’s AEIC at para 31.However, Red Pine was unwilling to extend the loan to Yip due to his advanced age and noted that if Yip had passed on, Red Pine would not be able to “go after anyone for the remaining loan amount”.52Foot Note 52×Loy’s AEIC at para 31.Red Pine required that Loy be in the directorship and hold majority shareholding in Yip Holdings in order for them to grant Yip Holdings any loan amount.53Foot Note 53×Loy’s AEIC at para 31. 33 On 20 May 2016, Yip and Loy corresponded over Whatsapp. The messages of the said correspondence are reproduced below:54Foot Note 54×ABOD at p 30. Yip:  Are you still helping me? You have been silent over the last 4 days. I am extremely concern by your silence. Coutts Bank is now putting extra pressure on me to move out if there is no concrete action for settlement. Please call me. [Ronald] Yip. Are you still helping me. You have been silent for the last for days. I am extremely concerned. By yr silence as Coutts Bank is putting extra pressure one me To move out if there is no concrete action to settle payment. Please call me asap what shall i [do]. Loy:  ... Yes we will continue with the funder Are we able to reduce the settlement amount with Coutts? Yip:  Ok let us talk and work together as one unit. Red Pines are reorganizing and not [available] to meet us for the next two weeks. Timothy says we must somehow raise Cash about S$1 to [1.5] million than we offer Cash settle about 50% or 60% or Max 70% as cash settlement. We in the meantime try delay payment using any excuse to delay without upsetting Coutts Bank. Loy:  Ok We get the disbursement sum and then give to our funder ... Yip:  Yes we must raise the disbursement all in cash before we make offer. Otherwise. Coutts Bk can say we are not sincere. Amy is trying to take they funds out but Tim says not much money in her Singapore Banks. Most likely unable to help us. No appointment to meet today. (3) 20 May 2016: Agreement to the Share Transfer 34 Loy’s testimony is that on 20 May 2016, Yip orally informed Loy that he was agreeable to transfer 105,000 ordinary shares in Yip Holdings to Loy so that he would hold 52.5% shareholding in Yip Holdings.55Foot Note 55×Loy’s AEIC at para 32.Yip wanted to give Loy more control of Yip Holdings and he wanted Loy to help make financial decisions for the company.56Foot Note 56×Loy’s AEIC at para 32.This was to address concerns over Yip’s advanced age that hampered his ability to obtain loans to discharge the Outstanding Mortgage.57Foot Note 57×Loy’s AEIC at para 32. 35 Yip allegedly informed Loy that he did not appoint his daughter, Li-Fen, to be the director and majority shareholder of Yip Holdings and to help him source for funds to discharge the Outstanding Mortgage as Li-Fen was an American citizen and was hardly in Singapore.58Foot Note 58×Loy’s AEIC at para 33. (4) July 2016: ORIX 36 At or around July 2016, Yip and Loy visited ORIX and met with a loan manager who informed them that ORIX was unable to extend them a loan.59Foot Note 59×Loy’s AEIC at para 35.The reason given was that ORIX could not secure any such loan against an immovable property that was already “tied to another loan with Coutts”.60Foot Note 60×Loy’s AEIC at para 35.Instead, the loan manager suggested for them to approach Ethoz, the sister company of ORIX.61Foot Note 61×Loy’s AEIC at para 36. (5) July 2016: Preliminary Meeting with Ethoz 37 In or about May to July 2016, Yip and Loy made arrangements to meet the staff of Ethoz to discuss a potential loan that Ethoz may disburse to Yip and Loy.62Foot Note 62×Defence at para 9.3.In their first meeting with Ethoz around July 2016, Mr Brandon Chai (“Brandon”) and Mr Javier Tan (“Javier”), conducted a preliminary assessment of the parties’ financial situation.63Foot Note 63×Loy’s AEIC at para 37.The parties informed Brandon and Javier of their plans for the Rangoon Redevelopment Project and Yip reiterated to Brandon and Javier that Loy was the co-director and shareholder of Yip Holdings and was authorised to negotiate for and on behalf of Yip Holdings.64Foot Note 64×Loy’s AEIC at para 37. 14 July 2016 to 4 August 2016: Yip’s Hospitalisation 38 From 14 July 2016 to 4 August 2016, Yip was hospitalised for necrotising fasciitis of the left upper limb.65Foot Note 65×Dr Koh’s AEIC at para 5.This required three surgeries and a period of prolonged intensive care unit (“ICU”) stay.66Foot Note 66×Dr Koh’s AEIC at para 5. 39 Loy testified that he was unaware of Yip’s hospitalisation as he was serving his National Service during the weekdays.67Foot Note 67×Loy’s AEIC at para 38.Loy claimed that Yip was uncontactable during that period and he only first learnt of Yip’s hospitalisation for the first time from Yip’s mistress when he visited the Telok Kurau Property sometime in August 2016.68Foot Note 68×Loy’s AEIC at para 44. Post-hospitalisation from September 2016 40 On 14 September 2016, Dr Mervyn Koh (“Dr Koh”), the plaintiff’s expert witness and a Senior Consultant and Head of Department (Palliative Medicine) at Tan Tock Seng Hospital, examined Yip. This was after Yip had been admitted to Tan Tock Seng Hospital Orthopaedics from 14 July 2016 to 4 August 2016.69Foot Note 69×Dr Koh’s AEIC at para 5.At the time of assessment on 14 September 2016, Dr Koh assessed that Yip had the following features consistent withpost-ICU delirium:70Foot Note 70×Dr Koh’s AEIC at para 6. (a) Short-term memory loss – often forgetting what he had just told his daughter; (b) Aphasia – word-finding difficulty; and (c) Disorganised thinking – he was unable to reason with his daughter logically. 41 On 22 February 2017, Dr Koh diagnosed Yip withpost-ICU cognitive impairmentafter his cognitive status did not show any improvement.71Foot Note 71×Dr Koh’s AEIC at para 11.The evidence on Yip’s medical condition will be covered in greater detail below (at [136]). 42 According to Yip, after he was discharged from the hospital, Loy would regularly visit Yip at the Telok Kurau Property.72Foot Note 72×Yip’s AEIC at para 9(1).As Loy was living alone, Yip gave him a copy of the house key and Loy “came and went as he felt like it”.73Foot Note 73×Yip’s AEIC at para 9(1).Loy would sometimes even stay over at Yip’s house.74Foot Note 74×Yip’s AEIC at para 9(1).Loy brought Yip out for meals and a few of Yip’s hospital appointments.75Foot Note 75×Yip’s AEIC at para 9(1); Li-Fen’s AEIC at paras 4 and 16. 43 After Yip’s discharge, he was uncontactable by phone.76Foot Note 76×Li-Fen’s AEIC at para 4.Li-Fen contacted Loy.77Foot Note 77×Li-Fen’s AEIC at para 4.She recalled that Yip had mentioned to Li-Fen of a “young smart boy” he had met earlier in the year who called himself “Dato Loy”.78Foot Note 78×Li-Fen’s AEIC at para 4.On 16 August 2016, Li-Fen asked her friend, Tracey Yuen (“Tracey”), to check on Yip at the Telok Kurau Property and remind Yip of his medical appointment.79Foot Note 79×Li-Fen’s AEIC at para 6.Tracey updated Li-Fen over Whatsapp that Yip was “getting things confused in his head” and “[t]alks very slow[ly] to [himieTracey]”.80Foot Note 80×Li-Fen’s AEIC at para 6. August 2016: Further negotiations with Ethoz 44 According to Loy, in August 2016, Yip and Loy met Brandon and Javier at Ethoz’s office and were informed by them that they had since done an ACRA search on Yip Holdings and found that Yip was the only director and shareholder on record.81Foot Note 81×Loy’s AEIC at para 47.The representatives from Ethoz also informed Yip and Loy that Ethoz was not willing to enter into a loan agreement with Yip Holdings as at that time, Yip, who was already 73 years of age, was the sole director and shareholder of Yip Holdings.82Foot Note 82×Defence at para 9.Brandon and Javier then suggested for them to consider incorporating a new company, given that Yip Holdings was dormant.83Foot Note 83×Loy’s AEIC at para 47. 15 August 2016: Incorporation of Yip & Loy Pte Ltd 45 According to Loy, Yip and Loy then discussed at the same meeting on the possibility of incorporating a new company, Yip & Loy Pte Ltd, (ie, which was the former name of thesecond defendant company) such that Loy, who was only 22 years old then, would be its sole shareholder and director.84Foot Note 84×Defence at para 9; Loy’s AEIC at para 48.Ethoz would then enter into a loan agreement with Yip & Loy Pte Ltd (as it was then named). This loan would be secured by Yip’s Telok Kurau Property.85Foot Note 85×Defence at para 9. 46 Given their plans to incorporate Yip & Loy Pte Ltd, Loy entered into an agreement with JJ & E Consulting Pte Ltd (“JJ & E”) for its incorporation and secretarial services.86Foot Note 86×Loy’s AEIC at para 49; Tab 2 LEW-1 at p 41.Yip & Loy Pte Ltd was incorporated on 15 August 2016.87Foot Note 87×Loy’s AEIC at para 50.According to Loy, Yip & Loy Pte Ltd was later renamed to Property Street Pte Ltd (ie, the second defendant) as a start-up company between Yip and Loy.88Foot Note 88×NE 4 October 2019 at p 100. 47 According to Loy, in or around August to September 2016, Ethoz informed Yip and Loy that it was not willing to enter into a loan agreement with Yip & Loy Pte Ltd (as it was then named) as it was incorporated too recently.89Foot Note 89×Defence at para 9; Loy’s AEIC at para 51.Javier allegedly informed Loy that unless his appointment as a director and shareholder of Yip Holdings was formalised, Ethoz would be unable to disburse the loan.90Foot Note 90×Defence at para 9; Loy’s AEIC at para 51.",
        "22-23 September 2016: Singpass account log-in credentials and updating of ACRA business profiles": "48 Yip’s testimony is that on 22 September 2016, Loy visited the Telok Kurau property and he informed Loy that he had to go to the community centre to get a “2FA” (the abbreviation for a “two-factor authentication”), which he did not understand anything about.91Foot Note 91×Yip’s AEIC at para 9(2).Loy informed him that it was needed in order to borrow money to repay Coutts. Loy brought Yip to the community centre.92Foot Note 92×Yip’s AEIC at para 9(2).Loy talked to an officer about the said “2FA”, got some documents and asked Yip to sign it, which he did.93Foot Note 93×Yip’s AEIC at para 9(2).Thereafter, the officer gave Loy a small box and Loy kept it.94Foot Note 94×Yip’s AEIC at para 9(2). 49 The plaintiffs’ case is that Loy had brought Yip to a community centre and “influenced” him to reset his SingPass password and to obtain a SingPass OneKey token. As a result Loy obtained Yip’s Singpass password and Singpass OneKey token. The plaintiffs also aver that without the knowledge and consent of Yip, Loy used Yip’s SingPass password and OneKey token to wrongfully access the ACRA online filing system and lodge the following notifications:95Foot Note 95×SOC at paras 4-5. (a) the appointment of Loy as a director of Yip Holdings on 22 September 2016. (b) the change of email address of Yip Holdings from “ronyippie@yahoo.com” (which was Yip’s email address) to “ronyippie@hotmail.com” (which was created by Loy) on 22 September 2016. (c) the transfer of 105,000 ordinary shares in the capital of Yip Holdings from Yip to Loy on 23 September 2016. A notification of the transfer of 100,000 shares was lodged at 7.28am and the same for 5,000 shares was lodged at 1.06pm. Yip testified that during this period he was physically and mentally weak, confused and did not have the concentration to read and understand more than a few sentences.96Foot Note 96×Yip’s AEIC at para 10. 50 On the other hand, Loy testified that Ethoz would be only willing to disburse a loan if they had sight of Yip Holding’s updated ACRA business profile.97Foot Note 97×Loy’s AEIC at para 55.As such, he and Yip went to Bedok community centre to update the latter’s SingPass account, obtain his log-in credentials and update the ACRA business profile of Yip Holdings on or around 22 September 2016.98Foot Note 98×Loy’s AEIC at para 55.They went to the community centre to register Yip’s mobile number to receive the one-time PIN number to execute the ACRA lodgement for Yip Holdings.99Foot Note 99×Loy’s AEIC at para 55.Loy claimed that Yip did this himself and Loydid notspeakto the counter staff on Yip’s behalf anddid not knowthe SingPass log-in credentials given to Yip at the counter.100Foot Note 100×Loy’s AEIC at para 55. 51 They then proceeded back to the Telok Kurau Property to conduct the actual ACRA lodgement, using the one-time PIN number that was linked to Yip’s mobile number and Yip did the said lodgementhimself.101Foot Note 101×Loy’s AEIC at para 56.Based on the ACRA business profile of Yip Holdings dated 29 September 2017, it is recorded that Loy had been appointed as a director of Yip Holdings since 20 April 2016 and holds 105,000 ordinary shares in Yip Holdings (ie,52.5%), and Yip holds the remaining 95,000 ordinary shares (ie, 47.5%).102Foot Note 102×Loy’s Affidavit dated 3 November 2017 (SUM 5045/2017) at pp 6-8. 52 According to Loy, during the lodgement, Yipsuggestedcreating a new email account for him given that he would prefer for his email address of “ronyippie@yahoo.com” to be used for personal matters and that he preferred not to receive any corporate-related emails in his personal email address “ronyippie@yahoo.com”.103Foot Note 103×Loy’s AEIC at para 57.This led to Yip suggesting the creation of a new email “ronyippie@hotmail.com” to be used for corporate matters only.104Foot Note 104×Loy’s AEIC at para 57.Loy denied ever obtaining Yip’s SingPass OneKey token and testified that he did not have knowledge of Yip’s SingPass password.105Foot Note 105×Loy’s AEIC at para 58.",
        "4–6 October 2016: Procurement of the Ethoz Loan": "53 Around September 2016, Yip engaged Mr Sarjit Singh (“Sarjit”), who was a Senior Director of M/S Gavan Law LLC, as his legal advisor with regards to the negotiations with Coutts.106Foot Note 106×Li-Fen’s AEIC at para 17. 54 By way of a Letter of Offer dated 4 October 2016 (“LOO”), Ethoz offered to grant Yip Holdings a loan amount of $4m, with an interest rate of 6% per annum, which was to be secured by way of a mortgage over the Telok Kurau Property and personal guarantees to be executed by both Yip and Loy.107Foot Note 107×Loy’s AEIC at para 65; ABOD at p 441.The $4m loan was offered to Yip Holdings only after they were able to confirm that a settlement had been entered with Coutts.108Foot Note 108×Loy’s AEIC at para 65. 55 At the meeting at Ethoz’s office where Ethoz presented the LOO to Yip and Loy, Javier, Brandon and one Ng Boon Tee (“Boon Tee”) from Ethoz were present.109Foot Note 109×NE 8 October 2019 at p 10.According to Javier, Brandon and Boon Tee were presenting the LOO, explaining the terms and conditions to Yip and Loy.110Foot Note 110×NE 8 October 2019 at p 10.The Ethoz representatives explained the interest servicing, which allowed for either a monthly repayment of the said interest or an upfront payment of the full one year interest amount of $240,000.111Foot Note 111×NE 8 October 2019 at p 12.It was a “bullet repayment” and at the end of the first year, the customer had to either pay back the principal amount of $4m or had the option to extend another year by a second payment of a 1 year interest amount of $240,000.112Foot Note 112×NE 8 October 2019 at p 12.As for an extension into the third year, it would be subject to management approval.113Foot Note 113×NE 8 October 2019 at p 12.The meeting lasted for approximately an hour.114Foot Note 114×NE 8 October 2019 at p 10.Javier testified that Yip raised concerns about cl 8.1 of the LOO regarding the negative pledge clause and that this was not uncommon amongst Ethoz’s customers from his experience.115Foot Note 115×NE 8 October 2019 at pp 13-14.The LOO was not accepted during that meeting.116Foot Note 116×NE 8 October 2019 at p 10. 56 On 6 October 2016, Loy testified that he and Yip visited Sarjit’s office to seek legal advice on the terms of the LOO.117Foot Note 117×Loy’s AEIC at para 66.Sarjit allegedly advised Yip to accept the LOO and pay Coutts with the loan and informed them that for the personal guarantees, if Yip were to “kick the bucket”, Loy would be solely liable for the $4m Ethoz Loan.118Foot Note 118×Loy’s AEIC at para 66. 57 Having sought legal advice from Sarjit, Yip and Loy decided to proceed with the $4m Ethoz Loan and passed a director’s resolution dated 6 October 2016, which had been prepared by Ethoz’s “credit admin officer” as a standard document authorising Yip Holdings to take up the $4m loan.119Foot Note 119×Loy’s AEIC at para 67 and Tab 9 of LWE-1 at p 183; NE 8 October 2019 at p 21. 58 On 6 October 2016, Yip and Loy jointly executed the LOO to obtain the $4m Ethoz Loan, with the Telok Kurau Property to be mortgaged as security for the said loan.120Foot Note 120×Loy’s AEIC at para 68 and Tab 10 of LWE-1 at pp 185-190; ABOD at p 449.Yip and Loy also executed a deed of guarantee dated 6 October 2016 as a joint and several personal guarantors.121Foot Note 121×NE 8 October 2019 at p 8; ABOD at p 511. 59 Javier recalled that Yip and Loy had informed him that they needed working capital for the Rangoon Redevelopment Project and Javier and his management previously had sight of the Development Plan dated 19 September 2016 as part of the parties’ credit proposal.122Foot Note 122×NE 8 October 2019 at pp 5-6; Exhibit D2.",
        "10 October 2016: Opening of Citibank Account": "60 Loy’s testimony is that on 10 October 2016, Yip and Loy attended the office of Citibank to open a new bank account for Yip Holdings (“Yip Holdings’ Account”).123Foot Note 123×Loy’s AEIC at para 72.This was required as Yip Holdings did not have an existing bank account as it was a dormant company with no active transactions. Its previous bank account with UOB was automatically closed sometime in 2008.124Foot Note 124×Loy’s AEIC at para 72. 61 Yip testified that Loy told him that he had to open a new bank account for Yip Holdings in order to get the loan from Ethoz and they met an officer.125Foot Note 125×Yip’s AEIC at para 9(4).Despite being “drowsy” and confused, Yip signed the papers to open the bank account and gave the papers to Loy.126Foot Note 126×Yip’s AEIC at para 9(4).",
        "13 October 2016: Execution of documents": "62 On 13 October 2016, Yip and Loy visited the office of Ethoz’s law firm, One Legal LLC and executed the Deed of Assignment of Rental Proceeds, Deed of Subordination, Mortgage Instrument IE/633566B and the Term Loan Facility Letter from Yip Holdings before one Ms Toh Jia Wen (“Jia Wen”), an associate of the One Legal LLC, who witnessed the signing of the said documents.127Foot Note 127×NE 4 October 2019 at pp 18, 23-25, 34. 63 It is Jia Wen’s testimony that prior to getting Yip and Loy to sign the documents, she explained to them that the documents were security documents relating to the loan transaction.128Foot Note 128×NE 4 October 2019 at p 11.Only after verifying that the clients understood why they were at the office, she explained the effect of the documents setting out the parties’ obligations.129Foot Note 129×NE 4 October 2019 at p 54.Thereafter, the clients (ie, Yip and Loy) signed the documents. 64 On the other hand, Yip testified that when Loy brought him to a law firm to sign the documents, Loy simply told him that he had to sign them to obtain the Ethoz Loan.130Foot Note 130×Yip’s AEIC at para 9(5).As such, Yip signed the documents.131Foot Note 131×Yip’s AEIC at para 9(5).",
        "October 2016: Loy and Sarjit negotiated with Coutts for a settlement": "65 Loy testified that he was authorised to help Yip enter into negotiations to reduce the amount repayable to Coutts and he helped in the negotiations by liaising actively with Sarjit to “bridge the gap” between Yip and Coutts.132Foot Note 132×Loy’s AEIC at para 61.Loy helped Yip to draft a settlement proposal to Coutts dated 14 October 2016 and compiled supporting documents for Coutts’ consideration.133Foot Note 133×Loy’s AEIC at para 62; Tab 7 of LWE-1 at p 61.The settlement proposal offered three settlement options to Coutts.134Foot Note 134×Loy’s AEIC Tab 7 of LWE-1 at p 64.Thereafter, the said proposal was handed to the Coutts’ representative, Hannah Tay.135Foot Note 135×Loy’s AEIC at para 62. 66 On 27 October 2016, Sarjit made an offer of $1.7m for the full and final settlement.136Foot Note 136×Loy’s AEIC at p 180.After negotiations conducted over a series of emails between Sarjit and Coutts’ representative Andrew Turner (“Andrew”) from 31 October 2016 to 9 November 2016, the parties agreed to a reduced full and final settlement sum of $2.45m in an email by Coutts to Sarjit dated 9 November 2016.137Foot Note 137×Loy’s AEIC at pp 177-180.It is noted that in the series of negotiation emails, Loy was not copied as one of the parties in the email thread. It was only in an email dated 17 November 2016 that Sarjit had forwarded the email thread to Yip and Loy for their information.138Foot Note 138×Loy’s AEIC at p 177.This is consistent with Yip’s testimony that Sarjit was the one who managed to reduce the amount repayable to $2.45m.139Foot Note 139×Yip’s AEIC at para 12.",
        "The Appointment and the Share Transfer": "67 Loy claims that Yipdecidedthat the best option moving forward was for parties to crystallise Loy’s appointment as a director and shareholder of Yip Holdings.140Foot Note 140×Loy’s AEIC at para 52.Loy testified that as Yip did not know how to go about dealing with the paperwork and that Yip Holdings “did not previously employ anyone to provide corporate secretarial services”, the parties decided to engage JJ & E to assist them with the necessary board resolutions to formally appoint Loy as a director and shareholder of Yip Holdings.141Foot Note 141×Loy’s AEIC at para 53. 68 The following board resolutions were prepared by JJ & E and executed by both Yip and Loy at JJ & E’s office sometime in November 2016 (“the Resolutions”):142Foot Note 142×Loy’s AEIC at para 53. (a) Directors’ resolution of Yip Holdings for the Appointment, annexing Loy’s consent to act as a director and statement of non-disqualification to act as director, backdated to20 April 2016;143Foot Note 143×Loy’s AEIC Tab 4 of LWE-1 at pp 47-48.and (b) Directors' resolution of Yip Holdings for the Share Transfer of 105,000 ordinary shares of Yip Holdings from Yip to Loy, annexing share transfer form and IRAS requisition form for transfer of shares, backdated to20 May 2016.144Foot Note 144×Loy’s AEIC Tab 5 of LWE-1 at pp 50-54. Loy’s explained that the Appointment and Share Transfer was backdated because Yip had already introduced him as a co-director and shareholder of Yip Holdings as of the respective dates.145Foot Note 145×Loy’s AEIC at para 54.The Resolutions were mere formalities as a pre-requisite for Loy and Yip to obtain the loan from Ethoz.146Foot Note 146×Loy’s AEIC at para 54. 69 According to Loy, after the Share Transfer was carried out in accordance to the parties’ plan (see above at [34]), Yip left Loy to deal with Yip Holding’s affairs and Loy began to have “sole conduct” of the same.147Foot Note 147×Loy’s AEIC at para 34.",
        "Disbursement of the $4m Ethoz Loan": "70 Loy testified that as part of the Agreement, the $4m loan would be used as follows: (a) the Balance Sum of $1,268,500 for the Investments; (b) $281,500 retained as advance interest by Ethoz; and (c) $2.45m to be used by Yip to discharge the Outstanding Mortgage.148Foot Note 148×Loy’s AEIC at para 69(d). 71 On 17 November 2016, Ethoz disbursed the $4m loan by way of (a) a cashier’s order for the sum of $2.45m made in favour of Coutts, being the mortgage redemption monies;149Foot Note 149×Loy’s AEIC at Tab 16 LWE-1 at p 255.and (b) a cheque for the Balance Sum of $1,268,500 made in favour of Yip Holdings.150Foot Note 150×Loy’s AEIC at Tab 17 LWE-1 at p 258.The cheque for the Balance Sum was banked into Yip Holdings’ Citibank account on 17 November 2016.151Foot Note 151×Loy’s AEIC at para 76. 72 On 18 November 2016, the entire Balance Sum was transferred fromYip Holdings’Account intoYip & Loy PteLtd’sCitibank account.152Foot Note 152×Loy’s AEIC at para 76; Subir Singh Grewal’s AEIC (“Exhibit P7”) at p 29 para 14.Thereafter, the Balance Sum was then transferred intoLoy’spersonal Citibank account in three transactions of $1.2m on 18 November 2016, $18,500 on 22 November 2016 and $49,900.78 on 30 December 2016.153Foot Note 153×Exhibit P7 at p 29 para 15. 73 $113,987.89 was also transferred from Loy’s personal Citibank account to his personal OCBC account from 22 December 2016 to 14 February 2017 over seven bank transfers.154Foot Note 154×Exhibit P7 at p 30 para 17. 74 Over seven transactions from 3 January 2017 to 15 February 2017, $300,000 was transferred from Loy’s personal Citibank account into his mother’s first bank account (“Mother’s Bank account 1”) and $550,000 into his mother’s second bank account (“Mother’s Bank account 2”) by way of bank transfers and cheque deposits.155Foot Note 155×Exhibit P7 at p 29 para 16. The alleged Investments through Yip & Loy Pte Ltd for the Rangoon Redevelopment Project 75 Loy alleged that he and Yip had agreed that the Balance Sum would form the additional capital of Yip Holdings and that Loy would manage the finances of Yip Holdings by making the following Investments of the Balance Sum in the manner set out above at [24].156Foot Note 156×Loy’s AEIC at para 69(d).The parties allegedly agreed to make use of the newly incorporated company, Yip & Loy Pte Ltd, such that the Investments would be “channelled” through it and since Loy was the sole director and shareholder of Yip & Loy Pte Ltd, this would be in line with the Agreement that Loy would be in charge of running the operations and finance of Yip Holdings.157Foot Note 157×Loy’s AEIC at para 71. 76 The alleged plan was for the profits from the Investments to increase the Balance Sum to approximately $1.4m to $1.5m. Thereafter, Loy would then transfer the returns, together with the Balance Sum back to Yip Holdings.158Foot Note 158×Further and Better Particulars dated 20/10/17 (“FNBP”) Answer (3) under paragraph 10.11 of Defendants’ Defence (Setdown Bundle at p 33).The alleged plan was also for Yip to sell the Telok Kurau Property at a profit and invest them back into Yip Holdings to accumulate sufficient funds.159Foot Note 159×Loy’s AEIC at para 69(f).With these said funds, Yip Holdings would purchase at least two units of the Rangoon Properties and subsequently develop 102 Rangoon Road into a boutique condominium to be owned by Yip Holdings.160Foot Note 160×Loy’s AEIC at paras 69(e)-(f); FNBP Answer (1) under Paragraph 10.13-10.14 of Defence (Setdown Bundle at p34). (1) Lucky Plaza Property 77 Loy testified that the Lucky Plaza Property was chosen as the development was old and likely to enter into anenblocsale in the near future and Yip had frequently visited Lucky Plaza.161Foot Note 161×Loy’s AEIC at para 78.Yip allegedly agreed during an “oral discussion” that it would be purchased inLoy’s sole nameas they would be able to save on the Additional Buyer’s Stamp Duty (“ABSD”) as (a) Yip already owned three private properties; (b) Yip Holdings would also be liable to pay a high ABSD as a corporate entity; and (c) Loy did not own any local property under his name.162Foot Note 162×Loy’s AEIC at para 79.According to the said agreement, the plaintiffs would hold the beneficial interest in the Lucky Plaza Property.163Foot Note 163×Loy’s AEIC at para 79(d). 78 On 14 November 2016, one Husen Kadany Kang (“Husen”) granted Loy an Option to Purchase the Lucky Plaza Property.164Foot Note 164×Exhibit P7 at p 29 para 18.The Lucky Plaza Property’s purchase price was set at $1.4965m.165Foot Note 165×Exhibit P7 at p 29 para 18.Loy used $116,500 from his personal Citibank account towards the purchase of the Lucky Plaza Property.166Foot Note 166×Exhibit P7 at p 29 para 19. 79 Loy also took out a separate personal housing loan of $1.0465m from OCBC Bank over a period of 30 years, secured on the Lucky Plaza Property, to complete the purchase.167Foot Note 167×Exhibit P7 at p 32 para 20.This said loan was approved on 14 December 2016, in order to make up for the difference for the purchase of the Lucky Plaza Property.168Foot Note 168×Loy’s AEIC at para 80.Over seven transactions from 9 to 10 February 2017, $400,000 was transferred from the Mother’s Bank account 2 to Loy’s OCBC Bank account, which was then used to satisfy the fixed deposit payment for 48 months as a pledge to OCBC Bank for the said mortgage.169Foot Note 169×Exhibit P7 at p 32 para 21.The transactions are summarised as follows: DateAmountFromToMethod9 February 2017$400,000Mother’s Bank account 2Mother’s Bank account 1Bank transfer9 February 2017$254,000Mother’s Bank account 1-Cash Withdrawal9 February 2017$146,000Mother’s Bank account 1-Cash Withdrawal9 February 2017$254,000-Loy’s OCBC Bank accountDeposit in cash9 February 2017$146,000-Loy’s OCBC Bank accountDeposit in cash10 February 2017$400,000Loy’s OCBC Bank account-Used as fixed deposit payment 80 On 27 February 2017, the Mother paid the balance of the purchase price by way of a cashier’s order for the sum of $368,823.90 from Mother’s Bank account 2.170Foot Note 170×Exhibit P7 at p 33 para 22. 81 Completion of the Lucky Plaza Property took place on 28 March 2017 and was registeredin Loy’s sole name.171Foot Note 171×Exhibit P7 at p 33 para 23. 82 The monthly repayments to OCBC Bank amounted to approximately $3,600 per month (including bank interest rates).172Foot Note 172×NE 9 October 2019 at pp 104-105.According to Loy, the Lucky Plaza Property came with an existing tenancy which a monthly rental of $3,000 which was expiring on 9 September 2018.173Foot Note 173×DBOD at pp 289-297.The monthly rental was allegedly used to repay the OCBC Bank’s monthly instalments for the period of 28 February 2016 to 9 September 2016 (ie,six months). The difference of $600 per month (between the monthly rental of $3,000 and the monthly bank repayment of $3,600) for the period of six months, which amounted to $3,600, was also covered by the Balance Sum.174Foot Note 174×NE 9 October 2019 at pp 104-105. (2) Shares 83 Loy testified that of the remaining sum of $371,000 (after approximately $900,000 from the Balance Sum was used towards the Lucky Plaza Property), $200,000 went into the purchase of the shares in line with the Agreement.175Foot Note 175×Loy’s AEIC at para 82.Prior to each of Loy’s investments, he allegedly consulted Yip orally but Yip informed him that he “trusted [Loy’s] abilities due to [his] proven track record” and did not need to inform him prior to each and every investment decision made.176Foot Note 176×Loy’s AEIC at para 84.According to Loy, the shares “did well and grew by about 7% to 8%”.177Foot Note 177×Loy’s AEIC at para 84.This left a balance of $171,000.178Foot Note 178×Loy’s AEIC at para 85. 84 This was however found to be untrue when Loy’s Central Depository Account (“CDP”) statements are examined (see below at [132]). (3) Property Street mobile application 85 As for the remaining $171,000, approximately $100,000 was allegedly invested in a mobile application called “Property Street”, which was a “global real estate platform that aims to help individuals buy and sell real estate [via] a mobile application”.179Foot Note 179×Loy’s AEIC at para 86.An IT company called Innomedia Technologies Pte Ltd (“Innomedia”) was engaged to develop the technologies.180Foot Note 180×Loy’s AEIC at para 87. 86 However, the invoices of Innomedia provided by Loy only amounted to a total of $28,500 for the purposes of “Development of Car Portal for CAR STREET”, “Development of Mobile Apps for CAR STREET”, “Development of Website & Mobile Apps for Property Portal”.181Foot Note 181×DBOD Vol 1 at pp 335-346, composed of the following amounts ($5,000 + $4,500 + $7,000 + $5,000 + $7,000) for Invoice Nos #INV201730, #INV201736, #INV201743, #INV201745 and #INV201750 respectively.When cross-examined about the use of the monies for development of the invoices for “Development of the Car Portal for CAR STREET”, Loy gave an explanation that it was another application, “Car Street”, which was being concurrently developed.182Foot Note 182×NE 9 October 2019 at p 109. Haircut Sum 87 Loy testified that the remaining amount of $71,000 was insufficient to cover the Haircut Sum of $175,000 for reducing the Mortgage Sum by that said amount.183Foot Note 183×Loy’s AEIC at para 89.However, Loy did not request for Yip to top up the difference given that their partnership was founded on the basis that they had “larger plans in mind” for the Rangoon Redevelopment Project.184Foot Note 184×Loy’s AEIC at para 89.",
        "Yip engages help to account for the $4m": "88 For two to three weeks in December 2016, Loy stopped seeing or calling Yip.185Foot Note 185×Yip’s AEIC at para 13.After the alleged “disappearance”, Yip sought help from one Kulip Singh (“Kulip”), a retired police inspector and court prosecutor.186Foot Note 186×Yip’s AEIC at para 14.Kulip prepared a letter dated 29 December 2016 for Yip to the solicitors from Ethoz asking for documents which he had signed and delivered to the said law firm.187Foot Note 187×Yip’s AEIC at para 14; pp 13-14. 89 On 30 December 2016, One Legal LLC replied by way of a letter to Yip, enclosing the documents that he had signed.188Foot Note 188×Yip’s AEIC at para 14; pp 15.Kulip explained to Yip that the documents revealed that Ethoz had agreed to grant him a loan of $4m with his house mortgaged as security, and after the $2.45m was repaid to Coutts, the Balance Sum would have to be given to him as “it was [his] house that had been mortgaged”.189Foot Note 189×Yip’s AEIC at para 15.However, Yip informed Kulip that he did not receive the Balance Sum and did not know what happened to it.190Foot Note 190×Yip’s AEIC at para 15.By way of an ACRA search by Kulip, Yip allegedly found out that Loy was a director and majority shareholder.191Foot Note 191×Yip’s AEIC at para 15.Yip also allegedly informed Kulip that he had not made Loy a director and shareholder of Yip Holdings.192Foot Note 192×Yip’s AEIC at para 15. 90 Yip panicked and sent a distress message on Whatsapp to Li-Fen on 30 December 2016, reproduced as follows:193Foot Note 193×Yip’s AEIC at para 16; p 79. Loy. Had taken ovrr our Yip Holdings and also pledge Telok kurau for Sgh Dollar house for 4.00 lo Million S do&ars Money and property maybe all [gone] Loy had put himself as director of Yip Holdings via the password and he had borrowed 4 million from Edtoss by pledging Telok Kurau house to Edthoss. The 4.00 million expected to be released from Edtoss to Yip Holdings within the next few days. Once the is release from Loy can withdraw and spend it. Kurlip [indecipherable] Will try to scan documents to you. Loy had disconnect his phone sim card. Not spokened to him two three weeks 91 Kulip prepared a letter dated 9 January 2017 to Ethoz’s solicitors which Yip signed and delivered to One Legal LLC.194Foot Note 194×Yip’s AEIC at para 17.This letter (a) informed them that Loy had brought Yip to make “a key device”, “took his password” and made himself a 51% director of his company Yip Holdings without Yip’s knowledge and consent; (b) asked them for a full statement account of the $4m and if the Balance Sum had not yet been deposited into Yip Holdings, to refrain from transferred any monies into Yip Holdings with immediate effect and hold back the Balance Sum until further instructions; (c) that any monies that Loy takes out of Yip Holdings from the proceeds of Loy’s mortgage of the Telok Kurau Property would be a criminal act under s 420 of the Penal Code (Cap 224, Rev Ed 2008).195Foot Note 195×Yip’s AEIC at para 17; pp 80-81. 92 On 10 January 2017, Ethoz’s solicitors informed Yip by way of a letter and enclosed documents, that Ethoz had disbursed the $4m on 17 November 2016 in the manner as follows:196Foot Note 196×Yip’s AEIC at para 18; pp 82-163. (a) $281,500 was retained by Ethoz as advance interest for the first year facility fee and commitment fee; (b) $2,450,000 by way of a cashier’s order in favour of Coutts; and (c) The Balance Sum of $1,268,500 by way of a cheque in favour of Yip Holdings. 93 On 11 January 2017, Kulip prepared a letter which Yip signed and sent out to Loy, reproduced as follows:197Foot Note 197×Yip’s AEIC at para 19; p 164. WHEREABOUT THE S$1,268,500 COLLECTED BY YOU ON THE 10th NOVEMBER 2016 AFTER WHICH YOU COMPLETELY DISAPPEARED FROM CONTACT You are completely aware that the above proceeds arose up of the mortgage of my house at Telok Kurau to which you have no ownership nor share. Surprisingly, after you collected the cheque enclosed at Annex “A” of which we have evidence you chose to disappear completely. You are not contactable on the handphone and in the last two months you don’t even bother to call me. We give you till 5p.m. on the 18 of January 2017 to contact me Mr. Yip at 96737484 and arrange to meet at Mr. Kulip Singh’s office failing which we have to take the next effective step to solve this mystery by referral to due authorities. It is in your interest to meet up and resolve this issue. We thank you. 94 Loy never replied to the said letter.198Foot Note 198×Yip’s AEIC at para 20.",
        "Loy’s explanation for his disappearance": "95 Loy alleges that during the period of December 2016, he received numerous calls on his mobile from one Benny who worked for Yip.199Foot Note 199×Loy’s AEIC at para 91.Benny had allegedly threatened to kill Loy, attack his family, told Loy he knew where Loy lived and that would not hesitate to send his men to his address to look for him.200Foot Note 200×Loy’s AEIC at para 91. 96 From January to February 2017, Yip allegedly sent debt collectors to Loy’s home address to cause harassment, alarm and distress to Loy and his family members.201Foot Note 201×Loy’s AEIC at paras 91-92.They also allegedly made threats of violence against Loy through phone calls.202Foot Note 202×Loy’s AEIC at paras 91-92.Loy had never met these men in person and did not know their names or identities.203Foot Note 203×Loy’s AEIC at para 92.Despite being able to book out of camp on weekdays during January to February 2017, he was fearful and chose not to head home or only went home late at night.204Foot Note 204×Loy’s AEIC at para 93. 97 No other evidence of the alleged calls or threats were provided. Loy explained that between the period of February 2017 and August 2017, he was not in contact with Yip as he was “worried of being in further contact with him given that he [had] already sent down Benny and/or debt collectors to [his] home address demanding for the full S$4m loan”.205Foot Note 205×Loy’s AEIC at para 94.",
        "Police Report, Letter of demand and Criminal Proceedings": "98 Kulip prepared a police report dated 13 January 2017, which Yip signed and handed to the police based on Yip’s narration of events.206Foot Note 206×Yip’s AEIC at para 22.On 24 July 2017, Yip’s solicitors sent a letter of demand to Loy’s home address.207Foot Note 207×Loy’s AEIC at para 94; Tab 19 of LWE-1.Loy testified that heneversaw the letter of demand as he was not based at his home address from February 2017 to August 2017.208Foot Note 208×Loy’s AEIC at para 95. 99 Loy was arrested on 16 August 2017 and criminal charges were brought against Loy.209Foot Note 209×Exhibit P7 at para 7.Loy’s criminal proceedings had yet to be concluded at the time of the trial for this present civil suit.",
        "September 2017: Sale of Yip’s Telok Kurau Property": "100 Thereafter, Yip, as the mortgagor of the Ethoz Loan, had no means of paying Ethoz’s following year’s interest of $240,000, which was due in November 2017. As a result, Yip had to sell his Telok Kurau Property in September 2017 in order to repay the $4m Ethoz Loan.210Foot Note 210×SOC at para 22(3).",
        "The plaintiffs’ case": "101 The plaintiffs deny Loy’s alleged business plan and the Agreement,211Foot Note 211×PCS at para 22;inter alia:212Foot Note 212×Yip’s AEIC dated 27 November 2017 at para 27. (a) making the Appointment and Share Transfer; (b) making Loy in charge of running the operations and managing the finances of Yip Holdings; (c) granting of the Haircut Sum of $175,000; (d) withdrawing of the Balance Sum from Yip Holdings for the Investments through the transfer to the second defendant; (e) the Rangoon Redevelopment Project and the use of the profits from the Investments for the said project; and (f) selling of the Telok Kurau Property for a profit for the Rangoon Redevelopment Project. 102 As Yip (a) did not agree to the Appointment and the Share Transfer; and (b) no consideration was received by Yip for the Share Transfer, the plaintiffs seek the following (the “Declarations”):213Foot Note 213×SOC at paras 8-10; 32(9). (a) A declaration that the notification to the Registrar of Companies of the addition of Loy as a director of Yip Holdings be annulled, accompanied by an order that the register of directors of Yip Holdings kept by the Registrar of Companies be rectified accordingly and that notice of the rectification be lodged with the Registrar of Companies; (b) A declaration that the notifications to the Registrar of Companies of the transfer of 100,000 ordinary shares in the capital of Yip Holdings Pte Ltd from Yip to Loy, and the transfer of 5,000 ordinary shares in the capital of Yip Holdings Pte Ltd from Yip to Loy be annulled, accompanied by an order that the register of members of Yip Holdings Pte Ltd kept by the Registrar of Companies be rectified accordingly and that notice of the rectification be lodged with the Registrar of Companies. 103 The plaintiffs also submit that the transfer of the Balance Sum of $1,268,500 from Yip Holdings to Yip & Loy Pte Ltd was a wrongful application of the money by Loy for his own use (“the Wrongful Transfer”). They make the following claims: (a) The Wrongful Transfer was unconscionable (“Unconscionability Claim”).214Foot Note 214×SOC at para 23. (b) The Wrongful Transfer was in breach of trust and fiduciary duty (the “Breach of Fiduciary Duty Claim”).215Foot Note 215×SOC at para 23. (c) The defendants were unjustly enriched at the expense of the plaintiffs and the plaintiffs had right to recover the Balance Sum in restitution. (“Unjust Enrichment Claim”).216Foot Note 216×SOC at para 32(1), (2); PCS at para 54. 104 The plaintiffs submit that the Balance Sum is held by the defendants on constructive trust for the plaintiffs and the defendants are jointly and severally liable, as constructive trustees, to (a) account for the Balance Sum and any profits derived from it; or (b) compensate the plaintiffs for their losses and damages suffered.217Foot Note 217×SOC at para 31.The plaintiffs claim for the following: (a) the Balance Sum of $1,268,500 and the sum of $76,110 for the interests on the $1,268,500 paid to Ethoz from the defendants, as well as interest on this said sum; (b) an order that the Lucky Plaza Property be sold and the sale proceeds paid to Yip; (c) an order that the $400,000 cash pledged to the financing bank (see above at [79]) be released to Yip; and (d) an order that the shares as part of the Investments be sold and the sale proceeds be paid to Yip.",
        "The defendants’ case": "105 The crux of the defendants’ case lay in the following propositions: (a) In April 2016, Yip had agreed to appoint Loy as a director and in May 2016, agreed that Loy become the majority shareholder of Yip Holdings for the purposes of obtaining a loan to discharge the Coutts Mortgage Sum that existed over the Telok Kurau Property. Due to the circumstances surrounding the Coutts mortgage, it was imperative that Loy be appointed as the director and majority shareholder of Yip Holdings in order to obtain a loan to discharge the said mortgage sum before proceeding with the investments under the Agreement and other terms for the purposes of the Rangoon Redevelopment Project. (b) The $1,268,500 was legitimately used for the Investments, pursuant to the Agreement that was reached between Yip and Loy sometime in October 2016.218Foot Note 218×Loy’s AEIC at para 69; Defence at para 10.The aim was to grow the sum, being Yip Holdings’ capital, to about $1.4 to $1.5m and ultimately utilise such capital to redevelop the Rangoon Properties.",
        "My decision": "106 This case primarily turns on the key issue of whether Yip and Loy had, in fact, entered into the alleged Agreement as described by Loy from April to September 2016.  The alleged Agreement is composed of four main parts, which I have categorised as follows: (a)Part I:The Share Transfer, the Appointment and Loy’s running the operation and finances of Yip Holdings (see [23(a)] to [23(d)] of the Agreement). (b)Part II:The entering of the Ethoz Loan agreement between Ethoz and Yip Holdings (see [23(e)] of the Agreement). (c)Part III:The Haircut Sum of $175,000 given to Loy for reducing the amount payable to Coutts (see [23(i)] to [23(j)] of the Agreement). (d)Part IV:The disbursement of $4m from the Ethoz Loan in the following manner: (i) $281,500 retained by Ethoz as advance interest; (ii) $2.45m to discharge the Outstanding Mortgage held in favour of Coutts; and (iii) the use of the Balance Sum of $$1,268,500 for the Investments, as well as the sale of the Telok Kurau Property to accumulate funds for the Rangoon Redevelopment Project (see [23(f)] to [23(h)] and [23(k)] to [23(o)(ii)] of the Agreement). In my judgment, I find that the parties agreed on some aspects of the Agreement but not others.",
        "Suspicious nature of Loy’s disappearance and the manner in which the Balance Sum was siphoned out of Yip Holdings": "107 It is without a doubt that the nature of Loy’s actions after the Wrongful Transfer was indubitably suspicious. The timely disappearance of Loy and his silencevisYip, his alleged business partner, occurred around December 2016, after (a) the disbursement of the Ethoz Loan on 17 November 2016; (b) the Wrongful Transfer of the Balance Sum on 18 November 2016; and (c) the grant of Loy’s housing loan from OCBC Bank for the purchase of the Lucky Plaza Property on 14 December 2016. 108 Loy failed to provide a plausible explanation for his disappearance and cessation of contact with Yip, who according to Loy, was his business partner with whom they had “larger plans in mind”. I find his explanation for the disappearance to be entirely fabricated. His allegations of the numerous threatening calls on his phone from Benny and the debt collectors who harassed him and his family members at the home address are not supported by evidence. No records of the alleged “numerous calls” threatening his life on his phone were provided. No police reports were made either, despite Loy’s ostensible fear of his and his family’s safety. Loy also conveniently never met these alleged persons and yet none of his family members provided testimony regarding the said harassment. A reasonable reaction by Loy to stop the alleged harassment would have been to contact Yip to stop or to lodge a police report for safety reasons. I also find it hard to believe that Yip, who was 73 years old and suffering from post-ICU delirium, had planned the alleged threats. 109 Further, Loy’s testimony is that Yip had “sent down Benny and/or debt collectors to [his] home address demanding for the full [$]4m loan”.219Foot Note 219×Loy’s AEIC at para 94.Yip allegedly sent debt collectors to Loy’s home address to cause harassment, alarm and distress to Loy and his family members from January to February 2017.220Foot Note 220×Loy’s AEIC at paras 91-92.It would have made no sense for Yip to demand for the full sum of $4m, based on objective evidence. According to Kulip’s letter dated 11 January 2017 prepared on behalf of Yip (see above at [93]), Yip was clearly only interested at this point of time in the $1,268,500 collected by Loy from Ethoz and not the full sum of $4m. On Loy’s evidence, it would have been illogical for Yip to have hounded Loy to repay the full sum of the Ethoz Loan. The content of the alleged harassments do not cohere with a reasonable reaction from Yip. It therefore casts further doubt on the existence of the alleged harassments by Yip. 110 Accordingly, Loy’s bare assertions to explain his sudden disappearance must be rejected. 111 Loy’s cessation of contact with Yip also shows that he had no genuine intention to pursue the Rangoon Redevelopment Project with Yip after the Wrongful Transfer. If Loy had truly intended to continue with the business partnership and make the Investments in accordance with the alleged Agreement, there would minimally have been updates to Yip as regards Loy’s use of the Balance Sum, especially since Yip made multiple attempts to contact Loy during his disappearance. There was also no reason for Loy to have disconnected the SIM card in his phone (see above at [90]). 112 Second, the manner in which the Balance Sum was siphoned out of Yip Holdings is highly suspicious. For instance, Loy made the payment of $400,000 for the fixed deposit of the Lucky Plaza Property in the manner spelt out at [79], which involved the bank transfer through the Mother’s two bank accounts, withdrawal of two sums of $254,000 and $146,000 in cash, and deposit of the same in cash back into Loy’s OCBC Bank Account all on 9 February 2017. This was immediately used to pay the fixed deposit payment on 10 February 2017. There is no logical reason for the multiple bank transactions and cash withdrawals if Yip and Loy previously agreed for the use of the Balance Sum for the purchase of the Lucky Plaza Property in Loy’s sole name. It is also noteworthy that Loy had been granted the Option to Purchase on 14 November 2016, just three daysbeforeEthoz disbursed the Ethoz Loan on 17 November 2016. Loy made calculated preparations to start the conveyancing of the Lucky Plaza Property in his sole name even before the Ethoz Loan was disbursed. 113 In my judgment, the surreptitiousness of Loy’s actions raises suspicions and is indicative of his guilty mind to siphon off and misappropriate the monies from Yip Holdings account for his personal use.",
        "The witnesses": "Loy’s Credibility 114 I found Loy to be wholly lacking in credibility in certain material parts of his evidence. His testimony regarding his business plan and the Agreement was contradictory. There were multiple material inconsistencies present in Loy’s testimony in court, his pleadings and AEIC, which I now turn to. (1) Maintaining contact with Yip in February 2017, obtaining approval before the Investments and updating Yip after the Investments 115 According to his Defence, Loy’s version of events was that except for a brief hiatus in January 2017, Loy had been maintaining frequent contact with Yip up till December 2016 and only stopped contacting Yip because of the debt collectors’ harassment of Loy. However, he “started contacting [Yip] again in February 2017to update [Yip] on how the $1,268,500 was being invested and to persuade [Yip] to stop using debt collectors to threaten him.”221Foot Note 221×Defence at para 27. 116 In his Further and Better Particulars (“FNBP”), Loy’s version of events was that he had informed Yip that of the $1,268,500, he would invest about $200,000 in shares, about $100,000 in a website and mobile phone application called Property Street and the remaining $968,500 in the Lucky Plaza Property.222Foot Note 222×FNBP at Particulars 4 of para 10.11 of Defence (Setdown Bundle at p 33).Loy would also inform Yip before he proceeded with each of the aforementioned investments, and the first plaintiff agreed with the first defendant on the investment choice.Loyalso updated Yip after he proceeded with the said investments.223Foot Note 223×FNBP at Particulars 4 of para 10.11 of Defence (Setdown Bundle at p 33). 117 After discovery, when Yip’s Whatsapp message to Li-Fen dated 30 December 2016 indicated that Loy had stopped contacting Yip two to three weeks before 30 December 2016, Loy provided a different version of events. Loy testified in his AEIC that he wasnot in contact with Yipbetween the period of February 2017 and August 2017, and in court testified that after the first few times Loy made certain investments, Yip hadgivenhimcarte blancheauthority to trade shares without consulting or updating him after.224Foot Note 224×NE 9 October 2019 at p 90.However, these significant facts were never mentioned in Loy’s pleadings. (2) Knowledge of the reduction of amount by $175,000 118 According to Loy, his business plan, which had been formulated and agreed to by Yip by October 2016, had already allocated the Balance Sum of $1,268,500 in the proportions for the Shares, the Property Street mobile application and the Lucky Plaza Property.225Foot Note 225×FNBP Particulars (4) (Setdown Bundle at p 33).However, in October 2016 when Loy’s business plan was allegedly agreed upon by Yip, the amount that was required to repay Coutts was $2.625m, not $2.45m. This was because Coutts had only accepted the $2.45m as the full and final settlement amount by way of an email with Sarjit on 9 November 2016.226Foot Note 226×ABOD at p 347.As such, it would have been impossible for Loy to have allocated $1,268,500 for the Investments with Yip’s agreement, since Coutts only agreed to the settlement sum of $2.45m on 9 November 2016afterthe alleged business plan was already formulated. 119 When confronted about this impossibility, Loy gave an incredible explanation that Andrew had previously informed him that Coutts had already agreed to settle at $2.45m by October 2016, but wanted to negotiate over email with Sarjit “for show”.227Foot Note 227×NE 9 October 2019 at p 10.Loy testified that he did mention this explanation in his pleadings or AEIC,228Foot Note 228×NE 8 October 2019 at p 113.but could not show it in either his pleadings or AEIC.229Foot Note 229×NE 8 October 2019 at p 114.Loy then explained that there was an email dated 4 October 2016 after the call with Andrew that was forwarded to Ethoz, in support of his said explanation.230Foot Note 230×NE 8 October 2019 at p 115.Loy was also unable to produce the said email.231Foot Note 231×NE 9 October 2019 at pp 1-4.Loy then changed his testimony, explaining that Andrew had spoken to Loy over a Whatsapp call about accepting the $2.45m by October 2016, although there were no Whatsapp messages between Andrew and Loy regarding the said explanation.232Foot Note 232×NE 9 October 2019 at p 4. 120 It is highly unbelievable that Andrew, a professional and the Head of Risk at Coutts, would on one hand orally agree with Loy over a Whatsapp call but on the other continue to negotiate with Sarjit and put on a show by way of emails from 31 October 2016 to 9 November 2016. There is no logical reason for Andrew to do so. 121 Further, the correspondence between Andrew and Sarjit made no reference to any discussions over Whatsapp with Loy. Loy was also not copied in any of the email correspondences. It is obvious that Loy was fabricating explanations in order to bolster his claim, an approach which ironically backfired and only diminished his credibility. (3) Payment of Haircut Sum with rentals of Rangoon Road Properties 122 When Loy was cross-examined on where Yip would obtain the money to pay Loy the alleged Haircut Sum of $175,000 (since the Balance Sum would have been allocated for the Shares, the Property Street mobile application and the Lucky Plaza Property), his explanation was that it would come from the rental proceeds of Yip’s Rangoon Road Properties (“Rental Proceeds Arrangement”).233Foot Note 233×NE 8 October 2019 at p 110.Yip allegedly agreed to the Rental Proceeds Arrangement. Loy testified that this explanation was in his AEIC.234Foot Note 234×NE 8 October 2019 at p 121.However, he later admitted that it was not.235Foot Note 235×NE 9 October 2019 at p 18.When confronted as to why he did not tell his solicitors about the Rental Proceeds Arrangement, Loy became evasive and made irrelevant statements without answering the question.236Foot Note 236×NE 9 October 2019 at pp 18-19. 123 Further, the objective evidence contradicts the logic of Loy’s alleged Rental Proceeds Agreement as Yip did not own the Rangoon Properties (ie, 102, 104 and 106 Rangoon Road). 124 The units 102 and 106 Rangoon Road were two shop units on the first storey of the mixed development building.237Foot Note 237×Li-Fen’s AEIC at para 34.Six apartment units, namely 102A, 102B, 102C, 106A, 106B and 106C, were located on the second and third storey. At trial, it was revealed that in fact, 104 Rangoon Road was not a recognised unit number and was instead “contained” in 102 Rangoon Road.238Foot Note 238×NE 9 October 2019 at p 25. 125 According to the Inland Revenue Authority of Singapore (“IRAS”) annual valuation of property documentation, 106 Rangoon Road was not owned by Yip, but was instead owned by his brother, Yip Fook Meng.239Foot Note 239×DBOD at p 377; NE 1 October 2019 at p 141.When confronted with this fact, Loy gave an incredible explanation that Yip had collected the rent on behalf of his brother for 106 Rangoon Road and there was an arrangement that Yip could “pocket” this sum.240Foot Note 240×NE 9 October 2019 at p 34. 126 102 Rangoon Road was also registered in Yip’s name only as the executor of his father’s estate but Yip wasnotthe beneficial owner.241Foot Note 241×ABOD at pp 583-586; Li-Fen’s AEIC at para 34.According to Li-fen, 102 Rangoon Road was tenanted to TMA Engineering Pte Ltd in 2016 at a monthly rent of $6,500 a month,242Foot Note 242×Li-Fen’s AEIC at para 34.although I note that the tenancy agreement between Yip and TMA Engineering Pte Ltd dated 19 March 2015 and tendered as documentary evidence was in fact not signed.243Foot Note 243×Li-Fen’s AEIC at pp 252-257.In any case, Li-Fen testified that Yip had a difficult time collecting the rent from 102 Rangoon Road such that she had to engage solicitors to “chase for payment”.244Foot Note 244×Li-Fen’s AEIC at pp 258-259. 127 Loy also provided no evidence that Yip could have received the alleged rental yields from 102 and 106 Rangoon Roadfor his own personal useto fund the alleged Haircut Sum of $175,000. Loy only provided a handwritten document dated 7 November 2016 where Yip had approved a tenant, one Zhang Weilin, to “use the ground floor of 102[,] 104 and 106 Rangoon Road as a restaurant”. Yip had signed off as the “[o]wner of 102, 104 and 106 Rangoon Road”, with Loy as the sole witness.245Foot Note 245×Exhibit D4 p 4.However, the IRAS documentation shows that Yip only beneficially owned the unit 106B Rangoon Road and not 102, 104 and 106 Rangoon Road. Even taking Loy’s case at its highest, the handwritten agreement merely indicates that Yip had been granted ostensible authority to act on behalf of the actual owners of the said unitsto approvethe useof the units 102, 104 and 106 Rangoon Road as a restaurant. It did not mean that Yip would be authorisedto appropriate the rental proceedsfrom the units 102 or 106 Rangoon Road for his personal use (ie, to fund the Haircut Sum for Loy). 128 Further, 106B Rangoon Road, was tenanted out for only $3,000 a month.246Foot Note 246×NE 9 October 2019 at p 36.In my judgment, the monthly rent of $3,000 after deduction of expenses such as property tax would be wholly insufficient to fund the substantial Haircut Sum of $175,000. It would have taken Yip about five years to save up the huge amount $175,000 from the monthly rent of $3,000 per month, assuming zero expenses and no breaks in tenancy (ie, full occupancy for the whole period of 5 years). 129 Accordingly, the objective evidence directly contradicts Loy’s version of events that the Rangoon Road Properties (ie, 102, 104 and 106 Rangoon Road) were owned by Yip and rental proceeds could have been collected from the said units to fund the Haircut Sum. As such, I find Loy’s explanation of the Rental Proceeds Arrangement to be a fabrication and this factors into my assessment of Loy’s credibility. (4) Purchase of the Shares 130 Loy’s testimony is that approximately $200,000 from the Balance Sum, which was transferred out of Yip Holdings on 18 November 2016, went into the purchase of Shares, in line with the Agreement.247Foot Note 247×Loy’s AEIC at para 82. 131 In his AEIC, Loy testified that he had bought oil and gas shares in Ezra Holdings Ltd (“Ezra”), pharmaceutical shares in QT Vascular Ltd (“QT Vascular”) and F&B shares in Kimly Ltd.248Foot Note 248×Loy’s AEIC at para 83.However, Loy changed his testimony at trial that the shares he had purportedly purchased for Yip Holdings were Ezra, QT Vascular and Hyflux.249Foot Note 249×NE 4 October 2019 at p 108; 9 October 2019 at p 64.Loy testified that there was buying and selling of these shares over the period of December 2016 to August 2017 until the police froze Loy’s bank accounts in August 2017.250Foot Note 250×NE 9 October 2019 at pp 79-81. 132 However, Loy’s CDP statements from August 2016 to August 2017 directly contradict his testimony. (a) First, there were no purchase of Hyflux shares from December 2016, and only a sale 11,100 shares on 19 December 2016.251Foot Note 251×CDP Statements at p 1. (b) Second, for the QT Vascular shares, there were purchases of a total of 410,000 shares from 23 November 2016 to 23 January 2017 but these shares were all transferred to an undisclosed recipient on 27 April 2017.252Foot Note 252×CDP Statements at p 3.No mention of the said transfer was made during Loy’s testimony at trial. (c) Third, for the Ezra shares, the only transactions after November 2016 were purchases of a total of 150,000 shares in January 2016.253Foot Note 253×CDP Statements at p 2.At the time, the share price was around $0.05.254Foot Note 254×Exhibit P5.Loy only paid $7,500 for the said 150,000 shares which he was still holding when the police froze his shares trading account in August 2017. As such, there is still an unexplained sum of $192,500 from the Balance Sum that was not “invested” in the manner in which Loy had described at trial. 133 Loy also testified that he was “making money” for Yip Holdings before the police froze his shares trading account and that at the time of freezing his account, the share prices were higher than what he had bought them for.255Foot Note 255×NE 9 October 2019 at pp 75-77.However, the opposite is in fact true. The Ezra share price fell from $0.05 (at the time of purchase) to $0.01 (at the time when the police froze his shares account).256Foot Note 256×Exhibit P5.As for the QT Vascular shares which he had transferred to an undisclosed recipient, he purchased them at the prices of approximately $0.11, $0.10 and $0.08 (in November, December 2016 and January 2017 respectively). However, when the police froze his shares trading account, the share prices had fallen to about $0.02.257Foot Note 257×See Graph annexed to Plaintiffs’ Reply at p 31.No Hyflux shares were purchased for Yip Holdings. 134 I find that these instances of blatant fabrication establish Loy’s lack of credibility. Yip’s Medical Condition 135 I now turn to deal with the evidence regarding Yip’s medical condition. 136 Dr Koh diagnosed Yip with post-ICU delirium on 14 September 2016, which is afluctuating conditionthat causes a patient to be disoriented in his surroundings and to have difficulties recognising his family or friends. Post-ICU delirium may also affect a person’s memory as well as his executive functions (ie, the ability to plan and have higher order thinking). Aphasia and disorganized thinking are also common features. Post-ICU delirium describes a cognitively impaired mental state which occurs after an ICU admission whichmay or may not improve with time.258Foot Note 258×NE 1 October 2019 at p 19, 20, 46 and 60.Dr Koh’s assessment of Yip was that Yip’s condition would have either been the same or worse from his follow-up assessment approximately every two months or so.259Foot Note 259×NE 1 October 2019 at p 20.Dr Koh subsequently followed up with Yip on his cognitive status until 21 June 2017.260Foot Note 260×Dr Koh’s AEIC at p 9 (Medical Report dated 17 July 2017). 137 Regarding Yip’s ability to make corporate decisions (such as appointing a new director of a company, selling shares or mortgaging his own house as security for his company to borrow money), Dr Koh admitted that it was difficult for him to comment definitely as he did not assess Yip’s capacity to make corporate or financial decisions during his consultations.261Foot Note 261×Dr Koh’s AEIC at p 9 (Medical Report dated 17 July 2017).However, Dr Koh’s opinion was that it wouldlikely have been difficultfor Yip to makecomplex corporate and financial decisionsbased on his cognitive and mental status since 14 September 2016.262Foot Note 262×Dr Koh’s AEIC at p 9 (Medical Report dated 17 July 2017). 138 Li-Fen’s testimony on Yip’s condition before and after the hospitalisation is as follows:263Foot Note 263×Li-Fen’s AEIC at paras 11-14. Dad was highly intelligent. He holds a Bachelor of Science (Engineering) degree from Case Institute of Technology, and a Master of Science (Mechanical Engineering) degree from University of Santa Clara. ...Before his hospitalization, dad was a detailed person and articulate.Soon after his discharge, I noticed that when I asked for details, he could not give.He would say, “I don’t know,” or “Don’t ask me.”Often, he was at a loss for words. Also, dad would say he could not tell if he was dreamingor in reality.There was one occasion where he called in panic saying he was worried that his bike accident had caused injury to someone and that he would be sued. I had to explain to him that his arm infection was not due to a bike accident but was caused by a fall at a staircase. I had to explain that to him twice before he calmed down. This was when I knew something was wrong with his mind. I decided to bring him to see a doctor. On 25 August 2016 I told Tracey: “I don’t think my dad is doing well. More stress the more he confused. I think by this weekend, I will decide when I will go back. Need to coincide w Doctor apt…” Tracey replied: “…yathink you're right…he does seemkinda spaced out…” [emphasis in original in italics; emphasis added in bold italics] Li-Fen’s testimony is corroborated by the Whatsapp messages with Tracey dated August 2016 as well as her actions of bringing Yip to Dr Koh for a mental assessment.264Foot Note 264×Li-Fen’s AEIC at p 23. 139 Tracey, who had checked on Yip when Li-Fen was in New York and Yip was hospitalised, also testified that since Yip’s discharge from the hospital, it was obvious that Yip was mentally weak and confused, noting that:265Foot Note 265×Tracey’s AEIC at para 6. [Yip]spoke very slowly and with long pauses.Often, he could not find the words to express himself. Often, he could not finish his sentence because he had lost track of what he was saying. Hehad trouble remembering what he wanted to say.Then he would get frustrated. He would also apologize. When I was speaking to him, often he would be in a daze or spaced out; not knowing what was going on. [emphasis added] 140 However, on the other hand, Loy’s testimony is that when he first met Yip sometime in August 2016 after Yip was discharged from the hospital, he observed that Yip’s mental condition was “fine”, that Yip could recognise him and that he spoke to him about the Coutts mortgage.266Foot Note 266×NE 4 October 2019 at pp 69-70.Loy confirmed that he neverdetected any deterioration in Yip’s mental state throughout his interaction with Yip from August 2016 to January 2017.267Foot Note 267×NE 4 October 2019 at p 70.However, given Loy’s credibility, I attribute limited weight to his evidence. 141 Most pertinently, the testimonies of Javier and Jia Wen on Yip’s state of being at their respective meetings are crucial. 142 Javier’s testimony is that during the meetings on 4 and 6 October 2016, Yip’s demeanour was “okay”.268Foot Note 268×NE 8 October 2019 at pp 17-18, 21-23.He was able to speak English fluently, follow the signing process and seemed to understand the documents,inter alia(a) the LOO dated 4 October 2016; (b) the Ethoz Secured Term Loan Facility Agreement dated 6 October 2016; (c) the Deed of Guarantee dated 6 October 2016; and (d) Yip Holdings’ Directors Resolution to accept the Ethoz Loan dated 6 October 2016 (collectively referred to as “Set A Documents”).269Foot Note 269×NE 8 October 2019 at pp 17-18, 21-23.Javier also testified that Yip had no difficulty putting his sentences together and did not appear dazed or confused.270Foot Note 270×NE 8 October 2019 at pp 22-23.In particular, I place emphasis on the fact on 4 October 2016, Yip had raised concerns about cl 8.1 of the LOO regarding the negative pledge, which led to the LOO not being accepted (see above at [54]). This was an instance where Yip had exercised his mind independently, made a reasonable query that was not uncommon amongst Ethoz customer’s (in Javier’s experience) and eventually made a decision not to sign the LOO. 143 Jia Wen’s testimony is that during her meeting with Yip and Loy on 13 October 2016, the parties signed documents,inter alia(a) the Deed of Assignment of Rental Proceeds between Yip Holdings (as borrower), Ethoz (as lender) and Yip (as mortgagor), with Jia Wen as the witness; (b) the Deed of Subordination between the same parties; (c) the Land Titles Act mortgage for the Telok Kurau Property; and (d) the Term Loan Facility Letter from Yip Holdings (collectively referred to as “Set B Documents”).271Foot Note 271×NE 4 October 2019 at pp 18, 23-25, 34.Both Yip and Loy had asked questions at the meeting.272Foot Note 272×NE 4 October 2019 at p 16.She did not recall Yip asking questions that were unrelated to the matter or completely irrelevant.273Foot Note 273×NE 4 October 2019 at p 30.She also testified that Yip appeared to understand what was being explained to him.274Foot Note 274×NE 4 October 2019 at p 26.Jia Wen also emphasised that in relation to old or young clients, it was her practice to assess if they were mentally capable and whether they understood her language.275Foot Note 275×NE 4 October 2019 at p 19. 144 I place weight on their evidence as Dr Koh had testified that Yip’s mental or cognitive impairment (eg, aphasia, disorganised thinking and impaired executive functions) would be evident to those who engaged in serious conversations (such as on business, property or financial matters) with him before and after his hospitalisation (which was from 14 July to 4 August).276Foot Note 276×Dr Koh’s AEIC at para 14. 145 These were two clear instances where Yip’s fluctuating medical condition was in remission and I therefore find as a fact that he had in fact signed the Set A Documents and Set B Documents with full knowledge of the nature of those documents. 146 I further note that Yip has not pleadednonest factumin that he did not know and understand what he was signing at the time he signed the Resolutions. Yip only claimed that he does not “remember seeing or signing” the Resolutions and disputes signing the Resolutions in his AEIC for the interlocutory application by the defendants (see below [221] for details) to strike out the second plaintiff’s proceedings and retained the position that he did not sign the Resolutions at trial.277Foot Note 277×Yip’s AEIC dated 27 November 2017 at para 25; NE 3 October 2019 at p 101.With that in mind, I turn now to the issue of whether the parties actually entered into the various aspects of Agreement as averred by the defendants.",
        "Part I of the Agreement: The Appointment, Share Transfer and Loy’s running the operation and finances of Yip Holdings": "Whether Yip had agreed to the Appointment and Share Transfer 147 The plaintiffs’ case is that Yip did not appoint or agree to appoint Yip as the director of Yip Holdings and Loy instead brought Yip to the community centre, “influenced” him to reset his SingPass password and OneKey token. Loy then used the SingPass password and OneKey token to wrongfully access the ACRA online filing system and lodged the notifications for the Appointment and the Share Transfer (see above at [48]). The plaintiffs aver that Yip did not agree to the Appointment and the Share Transfer. 148 However, the objective evidence seems to suggest otherwise. 149 First, the defendants tendered as documentary evidence an undated share transfer form of “105,000 ordinary shares fully paid” of Yip Holdings which was signed by both Yip and Loy in the presence of two witnesses, Mr Lim Ern Siang and Mr Gian Juat Ngim.278Foot Note 278×DBOD at p 388.In my judgment, if Yip truly had no intention to appoint Loy as a majority shareholder of Yip Holdings, he could simply have objected to signing the share transfer form. 150 Second, Yip and Loy also signed the Resolutions in November 2016 for (a) the Appointment backdated to 20 April 2016279Foot Note 279×DBOD at pp 383-385.and (b) the Share Transfer backdated to 20 May 2016 (see above [68]).280Foot Note 280×DBOD at pp 387.Yip however disputed the authenticity of his signatures on the Resolutions in his AEIC for the interlocutory striking out application by the defendants (see below [221] for details) and continued to take this position during the trial.281Foot Note 281×Yip’s AEIC dated 27 November 2017 at para 25; NE 3 October 2019 at p 101.As such, Yip ought to follow through on his position that he never signed the Resolutions. It cannot be Yip’s case that he had signed the Resolutions but he did not know and understand what he was signing because of his post-ICU delirium. The main issue is whether Yip had in fact appended his signature to the Resolutions or whether those signatures on the documents were forgeries. 151 Ms Yang Chiew Yung (“Ms Yang”), a Consultant Forensic Scientist, concluded in her expert report that it is “likely” that Yip’s signatures on the Resolutions were written by him.282Foot Note 282×Yang Chiew Yung’s AEIC at p 19 para 24.These laboratory findings were reached through examination, visual comparison and microscopy of Yip’s signatures on other documentsinter alia, the Memorandum and Articles of Association of Yip Holdings dated 5 October 1990 and affidavits deposed by the Yip in 2018.283Foot Note 283×Yang Chiew Yung’s AEIC at p 14 para 7.I accept the evidence of the expert witness, Ms Yang. I reject the plaintiffs’ attempt to dispute the authenticity of the signatures in the Resolutions and I find the Resolutions to be valid. I also observe that Yip could also have objected or refused to sign the Resolutions if there had truly been no agreement between Yip and Loy regarding the Appointment and Share Transfer. 152 I also note the present difficulties Yip faces of having accepted that the validity of the Set A Documents and Set B Documents signed in relation to the Ethoz Loan, but not the Resolutions in relation to the Share Transfer and Appointment which he also signed, all of which were done in about the same period of time. If Yip takes the position that the Ethoz Loan documents (ie, Set A Documents and Set B Documents) are void or invalid for any reason, he should also have pursued an action against Ethoz that the secured term loan facility agreement for $4m, the director’s resolutions to accept the Ethoz loan, the mortgage and guarantee were all unenforceable. However, his failure to pursue any action against Ethoz means that Yip is stuck with having to accept the validity of the Ethoz Loan and the securities provided to Ethoz to secure the loan. This must mean that despite his mental condition of post-ICU delirium, he had the requisite mental capacity and understanding at the time he signed the Set A Documents and Set B Documents in relation to the Ethoz Loan. However, Yip appears to take the rather untenable position that this same mental condition of post-ICU delirium prevented him from having the necessary mental capacity and understanding to sign the Resolutions when these Resolutions are far less complex in nature than the Set A Documents and Set B Documents. 153 As far as I understand it, Yip’s position at trial is an affirmative denial that he had signed the Resolutions in relation to the Share Transfer and the Appointment (which is refuted by Ms Yang’s expert evidence) coupled with an inconsistent alternative factual position (which he should not take) thatifhe did sign the Resolutions, then he did not understand what he was signing because of his mental condition of post-ICU delirium. In connection with the latter, I note that Yip rightly has not at any time pleadednonest factum. Nor has he specifically pleaded that he had no mental capacity at the time he signed the Resolutions because of his post-ICU delirium. 154 In my judgment, it is likely that Yip had agreed to the Share Transfer and the Appointment of Loy as a director in order to satisfy the requirements by replacement funders as a stop-gap measure. This was to ward off pressure from Coutts for Yip to sell and move out of the Telok Kurau Property and to use the proceeds of sale of the property to repay the outstanding loan to Coutts.284Foot Note 284×NE 4 October 2019 at p 147. 155 It is evident from Yip’s Whatsapp message dated 20 May 2016 (see above at [33]) that due to Coutts’ pressure on Yip to move out (as Yip provided “no concrete action for settlement”), Yip was keen on preventing the Telok Kurau house from being sold and had requested for Loy’s help to reduce the settlement amount or delay payment. This was prior to his hospitalisation from 14 July 2016 to 4 August 2016. 156 Further, Ethoz was unwilling to enter into a loan agreement with Yip Holdings since Yip, who was 73 years of age, was the sole director and shareholder of Yip Holdings (see above at [44]). Red Pine was also unwilling to loan such a huge sum to Yip due to his age unless someone younger, such as Loy, had directorship and a majority shareholding (see above at [32]). As it is common for lending institutions to take the age of the sole director and shareholder into consideration, I find it likely that Yip agreed to the grant of directorship and majority shareholding of a valueless dormant company to Loy for the purposes of obtaining the Ethoz Loan as he had no other viable choice. 157 This fact was further confirmed by Yip himself at trial:285Foot Note 285×NE 2 October 2019 at p 77. Q  ... The second reason as set out in my client’s affidavit was so that you---he could help source for, again, these financial institutions. And thereason for that was having approached all these financial institutions, nobody wanted to loan you money in your personal name because I’m afraid you were a little bit too old at that stage in time. Do you remember that? A  Yes, that part I know, but--- Q  That part you know. Alright. And, essentially,you had no issues with appointing my client as a director of Yip Holdings because you had informed him, “Well, it’s a dormant company with no assets.”Do you remember that? A  Yes. [emphasis added] 158 The plaintiffs’ version of events that Loy had used Yip’s SingPass password and OneKey token to wrongfully access the ACRA online filing system and lodge the notifications for the Appointment and the Share Transfer without Yip’s consent is also lacking in proof. I note that Yip provided no reliable testimony as to the account of events in detail on the day Loy had allegedly brought Yip to the community centre, “influenced” him and lodged the said notifications without his consent. It was apparent during the trial that Yip’s medical condition of post-ICU cognitive impairment had deteriorated with the further passage of time and on multiple instances, he did not have the ability to recall even undisputed events and documents that he had previously signed.286Foot Note 286×NE 2 October 2019 at p 79, 159 Having considered the objective evidence, the lack of reliable witness testimony from Yip and the probable motivations of Yip to allay pressure from Coutts for Yip to move out of the Telok Kurau Property, I find on a balance of probabilities that Yip had agreed to the Share Transfer and the Appointment before signing the Resolutions. By signing the Resolutions in November 2016, Yip affirmed the decision to lodge the ACRA notifications for the Appointment and the Share Transfer. 160 Yip also trusted Loy enough to grant him directorship and majority shareholder of Yip Holdings as well as to assist him with the meetings, documents and correspondence in relation to Coutts and the Ethoz Loan. In light of that, I find it likely that Yip had agreed to Loy’sbona fiderunning of the operation and finances of Yip Holdings. Failure to pay $105,00 as consideration 161 Loy, as the purported transferee of the 105,000 shares in Yip holdings, declared to IRAS on 23 November 2016 that the consideration for the transfer was his payment of $105,000 to Yip and that he had accordingly paid the amount of stamp duty calculated (by way of the stamp duty certificate).287Foot Note 287×ABOD at p 354.However, at trial, Loy admitted that he had not paid Yip the $105,000.288Foot Note 288×NE 4 October 2019 at pp 81-82, 86. 162 The plaintiffs aver that it is unbelievable that Yip would give majority shareholding and management control of Yip Holdings to Loy without any payment by Loy.289Foot Note 289×PCS at para 29.However, this argument is unpersuasive as Yip Holdings was a valueless, dormant company. The shares would have been valued at close to or at zero. It does not follow that Yip would not have given majority shareholding of such a company to Loy without any payment. Instead, it was entirely plausible that Yip had agreed to appoint Loy as the director and majority shareholder to facilitate the grant of the Ethoz Loan, as mentioned above at [155]. 163 The plaintiffs also argue that the Share Transfer was invalid for want of consideration as no monetary sums were paid to Yip for the 105,000 shares. It is trite law that the consideration must be sufficient but need not be adequate. In the widely-cited decision ofWilliams v Roffey Bros & Nicholls (Contractors)Ltd[1991] 1 QB 1 (“Williams”), the English Court of Appeal held that consideration need not be alegalbenefit to the counterparty but could be afactual or practicalbenefit or detriment (at least in so far as the situation concerns the promise to perform or the actual performance of an existing contractual duty owed to the same party).Williamshas been cited and recognised in a number of Singapore cases, including the Court of Appeal inSea-Land Service Inc v CheongFook Chee Vincent[1994] 3 SLR(R) 250 (at [9]–[13]) andGay Choon Ingv Loh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332(at [70]), as well as the Singapore High Court decision ofTeo Seng Kee Bob vArianecorp Ltd[2008] 3 SLR(R) 1114 at [89]. Evidently, the Singapore courts adopt a liberal view in finding consideration. On the present facts, there wasfactualorpracticalbenefit to Yip as valid consideration for the Share Transfer to Loy. As the 105,000 shares were actually not worth anything much since Yip Holdings was essentially a valueless dormant company, Yip should not expect to receive any substantial valuable consideration in return for a transfer of these shares to Loy. More importantly from Yip’s point of view, by appointing Loy as the director and majority shareholder, there was a greater chance of satisfying the conditions and obtaining a loan from Ethoz or another potential replacement funder such as Red Pines (see above at [155]). Accordingly, the plaintiffs’ arguments must fail. 164 For the above reasons, I find that Yip and Loy did agree to Part I of the Agreement.",
        "Part II of the Agreement: Ethoz Loan": "165 As for the taking of the $4m Ethoz Loan for the purpose of repaying Coutts, it is undisputed that parties had agreed to this aspect of the Agreement.290Foot Note 290×Yip’s AEIC at para 24.The corollary of this is that Yip cannot now deny that he had knowingly signed all the numerous documents (ie,Set A Documents and Set B Documents) placed before him by Ethoz to sign in order to obtain the loan. A number of these documents are of a complex nature. These were events taking place as late as October 2016, several months after his discharge from the hospital on 4 August 2016, when he had a full understanding of the nature of those documents and the transactions involved despite his condition of post-ICU delirium that was assessed to be present on 14 September 2016.",
        "Part III of the Agreement: The Haircut Sum for Loy": "166 As for Part III of Agreement on the Haircut Sum of $175,000 due to Loy for “reducing the amount payable to Coutts” (see above at [23(i)] to [23(j)]), it is unbelievable that Yip would have agreed to that for the following reasons. 167 First, as mentioned above at [122], it is not possible for Yip to have funded the Haircut Sum using the rentals of the Rangoon Road Properties, which he had no beneficial ownership over. 168 Second, it was impossible for Loy to have known that the Coutts Outstanding Mortgage would have been reduced to $2.45m by October 2016. Loy’s explanation that Andrew would have put on a show with Sarjit by way of email is also ludicrous (see above at [119]). 169 Third, it is unbelievable that Yip would agree to pay $175,000 for the “assistance” that Loy provided to Yip in the negotiations, which taking Loy’s case at its highest, involvedonly(a) attending three meetings with Coutts’ lawyer, (b) having four tele-conversations with Coutts’ lawyer, (c) writing an email to Sarjit, (d) drafting the letter dated 14 October 2016 to Coutts, (e) attending two to nine meetings with Sarjit, and (f) looking through the figures in Yip’s documents concerning Coutts.291Foot Note 291×FNBP (Setdown Bundle p 32); NE 8 October 2019 at pp 100, 102-103.This is considered in light of Yip’s financial situation where he could only survive on $1,000 a month from his CPF payout. 170 Last and most crucially, it would be plainly illogical for Yip to agree to give Loy theentireHaircut Sum for negotiating with Coutts to reduce the Outstanding Mortgage sum to $2.45m. If the Haircut Sum (equal to the sum reduced) would entirely have to be paid to Loy, there would be no net benefit whatsoever to Yip to reduce the Outstanding Mortgage and there would be no incentive for Yip to expend effort and time in negotiating with Coutts for the reduction of the amount to be repaid. If Loy’s version of events had been that he would get a commission from the amount reduced, that might have been more believable as there would still be some net benefit to Yip in having the Outstanding Mortgage reduced. 171 For the above reasons, I find that the parties did not agree to Part III of the Agreement to give Loy the Haircut Sum of $175,000 for “reducing the amount payable to Coutts”. In other words, Loy fabricated this part of the alleged oral Agreement.",
        "Part IV of the Agreement: The use of the Balance Sum for the Investments and sale of Telok Kurau Property for the Rangoon Redevelopment Project": "172 I now turn to the Loy’s alleged agreement with Yip to use the Balance Sum for the Investments (ie, Part IV of the Agreement). According to Loy, Loy and Yip had orally agreed to use the Balance Sum for the Investments as part of the Agreement, in the manner described above (at [23(k)] to [23(o)(ii)]). Loy’s alleged plan for the use of the Investments was to “grow Yip Holding’s funds sufficiently” to “develop the 102 Rangoon Road Property” (see [23(m)] of the Agreement). According to Loy’s estimation, the Investments would “grow the funds” from $1,268,500 to approximately $1.4 to $1.5m.292Foot Note 292×NE 4 October 2019 at p 133.At the same time, the alleged plan was for Yip to concurrently sell the Telok Kurau Property at a profit and invest the profits back into Yip Holdings to accumulate sufficient funds for the Rangoon Redevelopment Project (see [23(n) of the Agreement]).293Foot Note 293×Loy’s AEIC at para 69(f). 173 In my judgment, Loy’s version of events as regards the use of the Balance Sum for the Investments is patently untrue. I say so for the following reasons. 174 First, according to Loy’s alleged business plan (as of October 2016), the use the Balance Sum of $1,268,500 from the Ethoz Loan for the Investments for the Rangoon Redevelopment Project is illogical. The inherent logical fallacy in Loy’s purported business plan lies in his calculations as of October 2016. Taking Loy’s case at the highest and assuming that Yip had agreed to and was willing to sell his family home, the Telok Kurau Property, for a profit to invest in the alleged Rangoon Redevelopment Project, the Investments and the Ethoz Loan were absolutely unnecessary. 175 Loy’s testimony at trial is that by October 2016, Yip and Loy would “buy over the balance units that were not owned by [Yip]’s family” for the Rangoon Redevelopment Project.294Foot Note 294×NE 4 October 2019 at p 129.As they had a valuation of approximately $900,000 per unit, they would require $2.7m to “buy over” three units. Loy admitted that there would also be “miscellaneous expenses”, which included application fees, submissions fees, development approvals and development charges, which would be “manageable” although Loy could not give an estimated amount.295Foot Note 295×NE 4 October 2019 at pp 137, 139.Based on Loy’s proposal titled “Development Plan for a Mixed Development Project” dated 19 September 2016,296Foot Note 296×DBOD at p 69.the costs for the developer’s license from Urban Redevelopment Authority, demolition costs, construction costs and upfront payment of pre-development architectural works would all be taken care of by Loy’s undisclosed and unidentified “partners”.297Foot Note 297×NE 4 October 2019 at p 139. 176 As at October 2016, the valuation of the Telok Kurau Property was $6.5m.298Foot Note 298×NE 4 October 2019 at p 137.Loy also conceded that Yip could have sold his Telok Kurau Property in October 2016 if he had wanted to.299Foot Note 299×NE 4 October 2019 at p 150.If Yip had sold the Telok Kurau Property at $6.5m and paid off Coutts’ Outstanding Mortgage of $2.45m, Yip would have had$4.05mwhich would have been significantly more than the estimated $2.7m budgeted by Loy for the Rangoon Redevelopment Project. There was no reason for Yip to take on the $4m Ethoz Loan and pay the advance 6% interest of one year plus other fees totalling $281,500 to Ethoz, if Yip had always intended to sell the Telok Kurau Property and had genuine interest in the Rangoon Redevelopment Project. 177 Loy tried to explain that Yip’s house was “in a forced sale stage” and that the Ethoz Loan replacement funding was a stop-gap to ward off Coutts’ forced sale.300Foot Note 300×NE 4 October 2019 at p 147.I do note that this proposition is plausible as it is corroborated by Yip’s Whatsapp message dated 20 May 2016 where he informed Loy that “Coutts Bank is now putting pressure on me to move out if there is no concrete action for settlement”.301Foot Note 301×Loy’s AEIC at para 29; p 32.However, even assuming that Yip had entered into the Ethoz Loan for the purpose of warding off Coutts’ forced sale, there would have been no need for Yip to agree to use the Balance Sum for the Investments. Assuming that Yip was genuinely interested in the Rangoon Redevelopment Project in October 2016, it would be more logical to use the Balance Sum of $1,268,500 and the sum of $2.5m (ie,the net sale proceeds of the Telok Kurau Property worth $6.5m after repaying the $4m Ethoz Loan) which amounts to $3,768,500 to start the Rangoon Redevelopment Project. There was no need to invest the Balance Sum and grow it to approximately $1.4m to $1.5m, as Loy averred. Even disregarding the risk that is inherent in all investments, the additional contribution of $231,500 (ie, $1.5m minus $1.285m) on Loy’s own best estimate would not have made any significant contribution to the $2.7m budgeted amount needed for the Rangoon Redevelopment Project. 178 Second, according to the Agreement, there was an indefinite timeframe for Loy’s purported Investments to grow the Balance Sum to approximately $1.4 to $1.5m. There was no specific date where the Balance Sum and its profits had to be returned back to Yip Holdings (to reach a profit yield of about 10%). In Loy’s words, it was “open-ended”.302Foot Note 302×NE 9 October 2019 at p 49.Seen in the context of (a) Loy’s timely disappearance in December 2016; (b) the hefty annual interest of $240,000 payable to Ethoz due in the second year of the Ethoz loan; and (c) Yip’s need for financial liquidity due to his age, being retired and financially dependent on his monthly CPF payouts of $1,000,303Foot Note 303×NE 9 October 2019 at p 40.I find it highly unbelievable that Yip would have agreed to the use of the Balance Sum for the Investments by Loy for an indefinite timeframe. 179 Third, the apportionment of the payments of “any further charges aside from the first year advance interest charged by Ethoz” according to the Agreement (see above at [23(o)]) was highly unfavourable to Yip. On Loy’s end, his alleged “payment” was from the return of the Investments, which came from the Balance Sum from the Ethoz Loan mortgaged on Yip’s Telok Kurau Property. On Yip’s end, he had to use the proceeds of the sale of the Telok Kurau Property or the rental proceeds he obtained from 102 Rangoon Road (which he was not a beneficial owner of). In substance, Yip took all the risk, as it was his Telok Kurau Property that was mortgaged, while Loy only needed to pay for any said further charges through the “returns” of the Investments, which was funded by the Ethoz Loan. I find it unlikely that Yip would have agreed to this apportionment of risk given the sheer inequity of the said arrangement. 180 Fourth, I also found that the manner in which Loy siphoned off the Balance Sum from Yip Holdings extremely suspicious and indicative of a guilty mind. There would be no need to transfer the money in such a manner (as described above at [79]), if the use of the Balance Sum had truly been in accordance to the parties’ Agreement and with Yip’s consent. 181 Fifth, Loy’s version of events concerning the purchase of the Shares and the investment in the mobile application, “Property Street” is to be disbelieved. As elaborated above (at [130] to [133]), Loy’s alleged use of $200,000 from the Balance Sum from the Shares is lacking in evidence. The invoices from Innomedia for the alleged use of the mobile property application only amounted to $28,500, not $100,000 as Loy had alleged (see above at [35]). As such, I reject Loy’s testimony regarding the use of $200,000 for the Investments and $100,000 for the mobile application. 182 For the above reasons, I find that the partiesdid not agreeto (a) use the Balance Sum for the Investments as part of the Agreement; and (b) sell the Telok Kurau Property at a profit and invest the profits back into Yip Holdings to accumulate sufficient funds for the Rangoon Redevelopment Project, in the manner described above (at [23(k)] to [23(o)(ii)]). 183 Finally, I find that Yip did not agree to try to sell his Telok Kurau Property at a profit and invest the profits back into Yip Holdings in order to accumulate sufficient funds for the Rangoon Redevelopment Project (according to [23(n)] of the Agreement). I do, however, accept the part of Loy’s evidence that Yip was in factinterestedin pursuing the Rangoon Redevelopment Project. 184 Yip signed the Ethoz Loan on the basis that the Balance Sum from the $4m would have been for the Rangoon Redevelopment Project. Javier testified that the said project was proposed to Ethoz’s representatives during their meetings and eventually placed before the management of Ethoz who approved the Ethoz Loan. Further, Yip does not dispute knowing and understanding all the documents he signed in order to obtain the Ethoz Loan. It is also unlikely for Loy to have fabricated the Rangoon Redevelopment Project without Yip having given him the relevant information on the properties for the said Project. This is further corroborated by Li-Fen’s testimony that the Yip family had always wanted to redevelop the Rangoon Road Properties for many years, but they did not do so as it was not mathematically feasible and it was difficult to obtain the agreement from the other owners of the units in the said development.304Foot Note 304×NE 1 October 2019 at 137. 185 That said, I still find that Yip never agreed to sell the Telok Kurau Property and was doing everything he could in order to stay in the said property. This is evident from his Whatsapp message to Loy dated 20 May 2016 (see above at [33]). Yip had been seeking a replacement funder to repay the Outstanding Mortgage with Coutts as he never wanted to sell the house and Coutts was pressuring Yip to repay the outstanding loan. The Telok Kurau Property was his family’s heirloom and Yip’s father had semi-gifted it to Yip by selling it to him at below market value in 1970. According to Li-Fen, selling the Telok Kurau Property was never an option for Yip.305Foot Note 305×DBOD at p 94; Yip’s AEIC at para 2; NE 1 October 2019 at p 136.Yip would not have been willing to sell the Telok Kurau Property to finance the Rangoon Redevelopment Project as he would have no suitable alternative housing to live in. Yip was not the beneficial owner of 102 Rangoon Road. 106B Rangoon Road, which Yip owned, was located on the third storey with no lift facilities and was hardly suitable for a man of Yip’s age who had recovered from three surgeries.306Foot Note 306×NE 4 October 2019 at p 123. 186 I turn to reconcile a potential inconsistency that arises with this proposition between (a) Yip’s interest in the Rangoon Redevelopment Project and the need to sell the Telok Kurau Property to fund the $2.7m; and (b) his irrational unwillingness to sell the Telok Kurau Property. The truth of the matter is that Yip would haveeventuallybeen required to sell the Telok Kurau Property in order to fund the Rangoon Redevelopment Project. According to Loy’s calculations, at least $2.7m was required to start the said development, and the Balance Sum of $1,268,500 was hardly sufficient to fund the said Project. Javier had also testified that he was informed by the parties of the Rangoon Redevelopment Project and that they had some “internal funding”.307Foot Note 307×NE 8 October 2019 at p 28. 187 However, in my judgment, this can be explained by Yip’s stubbornness and irrational unwillingness to sell the Telok Kurau Property. Li-Fen testified that Yip hadneverwanted to sell the house and this resulted in the Outstanding Mortgage from Coutts ballooning from $1m to $2.625m.308Foot Note 308×NE 1 October 2019 at p 136.Despite her advice that the best thing he could do was to sell the Telok Kurau Property to pay off the Outstanding Mortgage from Coutts, Yip irrationally refused to sell the Telok Kurau Property as selling the said property was “never an option for him”.309Foot Note 309×NE 1 October 2019 at p 136.It appears that Yip had adopted the same irrational, optimistic mindset for the present Ethoz Loan as a replacement funder, in order to live in the Telok Kurau Property “on borrowed time” for as long as possible. Based on Yip’s obstinate unwillingness to sell the Telok Kurau Property, I am of the view that Yip was willing to allow the burdensome interest rates under the Ethoz Loan to accrue before ever selling the Telok Kurau Property. To that extent, I find that the inconsistency between (a) Yip’s interest in the Rangoon Redevelopment Project and the need to sell the Telok Kurau Property to fund the $2.7m; and (b) his irrational unwillingness to sell the Telok Kurau Property can be reconciled. For the above reasons, I find that Yip did not agree with Loy to try to sell his Telok Kurau Property at a profit and invest the profits back into Yip Holdings for the Rangoon Redevelopment Project. 188 In summary, I find that Yip had agreed to Part I and II of the Agreement but not Part III and IV of the Agreement.",
        "The plaintiffs’ claims": "189 I now turn to deal with the claims by the plaintiffs in relation to the Balance Sum. Unconscionability Claim 190 I start with the plaintiffs’ claim that on the basis of unconscionability, the Agreement is not binding on Yip and unenforceable by Loy (the “Unconscionability Claim”).310Foot Note 310×Plaintiffs’ Opening Statement at para 11.The plaintiffs aver that the Agreement should thus be vitiated or void. 191 In particular, given my findings that Yip did not agree to Part III and IV of the Agreement and that Yip does not dispute Part II of the Agreement, my decision on the Unconscionability Claim will solely pertain to Part I of the Agreement (ie, that the agreement on Share Transfer, the Appointment and Loy’s running the operation and finances of Yip Holdings are unconscionable). 192 The Court of Appeal inBOM v BOK[2019] 1 SLR 349 (“BOM”) set out the law on unconscionability (at [142]): In summary, and at risk of oversimplification,the narrow doctrine of unconscionability applies in Singapore. To invoke the doctrine, the plaintiff has to show that he was suffering from an infirmity that the other party exploited in procuring the transaction. Upon the satisfaction of this requirement,the burden is on the defendant to demonstrate that the transaction was fair, just and reasonable. In this regard, while the successful invocation of the doctrine does not require a transaction at an undervalue or the lack of independent advice to the plaintiff, these are factors that the court will invariably consider in assessing whether the transaction was improvident. It is important, though, to reiterate that the application of the criteria ofinfirmitymustnotbeoverlybroad, lest we be led back, in effect, to thebroaddoctrine of unconscionability. [emphasis in original in italics, emphasis added in bold italics] (1) Whether Yip’s infirmity that was exploited by Loy 193 I start with the issue of whether the plaintiffs have proven that Yip wassuffering from an infirmity that the other party exploited in procuring the transaction. The pertinent time period to examine is Yip’s medical condition in 22–23 September 2016 when the ACRA notifications were lodged and November 2016, when Yip signed the Resolutions for the Appointment and the Share Transfer. 194 Given that the oral agreement between Yip and Loy for the Appointment and the Share Transfer took place on 20 April 2016 and 20 May 2016 respectively, Yip had no infirmityper sefor the alleged exploitation as they occurredbeforeYip’s hospitalisation on 14 July 2016. 195 Based on my evaluation of the medical evidence summarised above at [136]–[145], I find that the plaintiffs have not proven that there was an infirmity exploited by Loy during 22 to 23 September 2016 and November 2016. In particular, I place weight on the meetings with Javier and Jia Wen as instances when Yip’s mental condition was in remission. Javier’s and Jia Wen’s testimonies are consistent with Dr Koh’s description of post-ICU delirium as afluctuating condition. I also did not find the plaintiffs’ emphasis on the fact that the meetings with Javier or Jia Wen were only “around an hour long” each to be particularly pertinent. What was crucial was that in that time span, Yip had been able to exercise his independent mind, pursue reasonable queries (eg,on the negative pledge clause) and make decisions (eg, not accepting the LOO). 196 Given that the first stage of the test inBOMhas not been satisfied, I find that the plaintiffs’ Unconscionability Claim must fail. Breach of Fiduciary Duty Claim 197 I now turn to the plaintiffs’ Breach of Fiduciary Duty Claim. 198 After the Balance Sum had been deposited into Yip Holdings’ Account as part of the Ethoz Loan and given my finding that Part IV of the Agreement did not exist, the Wrongful Transfer out of Yip Holdings’ account for Loy’s personal use and benefit was clearly an unauthorised transaction by Loy in breach of his fiduciary duties to Yip Holdings in his capacity as a director. 199 I first deal with thelocus standiissue of whether the second plaintiff, Yip Holdings, can be a party to the present proceedings. From my findings above that (a) Yip had agreed to the Share Transfer and the Appointment (see above at [159]) and (b) Loy was validly appointed as a director and majority shareholder of Yip Holdings through Resolutions which were valid, it is clear that Loy is a valid director and majority shareholder of Yip Holdings. 200 As such, Yip is a minority shareholder of Yip Holdings and I find that Yip has nolocus standito commence the present lawsuit in the name of Yip Holdings without the express consent of Loy as the majority shareholder or a validly passed resolution from Yip Holdings to do so. As such, Yip cannot commence an action on behalf of Yip Holdings, as the second plaintiff, in the present proceedings without commencing a derivative action. As such, I dismiss the claims made by the second plaintiff in the present proceedings. 201 Given that the plaintiffs have not specifically pleaded the capacity of the parties in which they seek to sue the defendants, I will now turn to analyse Yip’s claims by way of the possible different capacities in which Yip could make a claim, namely as (a) a minority shareholder of Yip Holdings (holding 47.5% of the total shares); (b) a director of Yip Holdings; or (c) an individual who has a relationship of trust and confidence with Loy. (1)QuaMinority Shareholder 202 I start with Yip’s claims as a minority shareholder. 203 By transferring the entire Balance Sum from Yip Holdings’ Account into Yip & Loy Pte Ltd’s Citibank account on 18 November 2016 and thereafter into his personal Citibank account through three transactions, it is clear that Loy had breached his fiduciary duty toYip Holdingsas a director in relation to the use of the Balance Sum. 204 However, the plaintiffs’ claim that Loy had breached his fiduciary duty as a director of Yip Holdings must be dismissed due to the proper plaintiff rule inFoss v Harbottle[1843] 67 ER 189, applied in Singapore inNg HengLiat and others v Kiyue Co Ltd and another[2003] 4 SLR(R) 218;Ho Yew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333. It provides that in an action to seek redress for a wrong alleged to have been done to a company, the proper plaintiff isprima faciethe company itself.Yip lacked the standing to seek relief in respect of the alleged breach of the fiduciary duty by Loy as a director of Yip Holdings. 205 As Yip neither pleaded nor obtained leave to court through a statutory derivative action pursuant to s 216A of the Companies Act (Cap 50, Rev Ed 2006) (“Companies Act”) or at common law to bring the suit on behalf of Yip Holdings, I find that Yip’s Breach of Fiduciary Duty claim in his capacityquaminority shareholder must fail. (2)QuaDirector 206 In his capacityquadirector, Yip has no viable claim for a breach of fiduciary duty claim against Loy as a fellowdirector. Loy does not owe any fiduciary duty to Yip as a fellow director. Neither did Yip suffer any loss in his capacity as a director by Loy’s Wrongful Transfer. It is the company that suffered the loss. Again, the proper way is for Yip as a fellow director to bring a derivative action pursuant to s 216A of the Companies Act on behalf of Yip Holdings. (3)QuaIndividual on the basis of a relationships of trust and confidence 207 I turn to consider whether a fiduciary relationship existed between Loy and Yip on the basis of a relationship of trust and confidence. 208 Lord Justice Millett inBristol and West Building SocietyMothew[1998] Ch 1 set out the applicable test on who a fiduciary is: “a fiduciary is someone who has undertaken to act for or on behalf of another in a particular manner of circumstances which give rise to a relationship oftrust and confidence” (emphasis added); affirmed inPhilip AntonyJeyaretnam and another v Kulandaivelu Malayaperumal and others[2019] SGHC 214 (“Philip Antony”)at [13]. The Court of Appeal made the following observations of the term “fiduciary” inTurf Club Auto Emporium Pte Ltd and others v YeoBoong Hua and others and another appeal[2018] 2 SLR 655: 42 There is no universal definition for the term, though we note that there appears to be growing judicial support for the view that a fiduciary is “someone who has undertaken to act for or on behalf of another in a particular matter in circumstances which give rise to a relationship of trust and confidence” …. It has also been said that “[f]iduciary duties are obligations imposed by law as a reaction to particular circumstances of responsibility assumed by one person in respect of the conduct of the affairs of another” ….  The concept of a fiduciary has also been described as one that “encapturesa situation where one person is in a relationship with another which gives rise to a legitimate expectation, which equity will recognise, that the fiduciary will not utilise his or her position in such a way which is adverse to the interests of the principal” … 43 While there are settled categories of fiduciary relationships – such as the relationship of a trustee-beneficiary, director-company, solicitor-client, between partners – it does not mean that all such relationshipsareinvariably fiduciary relationships. In these relationships, there is a strong, but rebuttable, presumption that fiduciary duties are owed.Equally, the categories of fiduciary relationships are not closed or limited only to the settled categories. Fiduciary duties may be owed even if the relationship between the parties is not one of the settled categories, provided that the circumstances justify the imposition of such duties… [emphasis added] 209 InPhilip Antony, Debbie Ong J considered the following factors in finding a fiduciary relationship between Dr Paul and Perumal, who had befriended and cared for Dr Paul (at [15]): Dr Paul waselderly, physically weak, in need of care and showed signs of mental impairment. Perumal moved into her home and his own evidence was that he assisted in caring for Dr Paul andcarried out various acts on her behalf. These actsinvolved monetary transactions and important matters such as where she would live.In particular, Perumal was centrallyinvolved in the selling of Dr Paul’s Haig Road property and her subsequent purchase of the Ceylon Road property.Dr Paul wasclearly relianton Perumal. Theirs was a relationship of trust and confidence and Perumal certainly knew that. I hold that Perumal was in a fiduciary relationship vis-à-vis Dr Paul. [emphasis added] In considering whether a fiduciary relationship existed between Yip and Loy, the same considerations inPhilip Antonywould apply. 210 On the present facts, Yip was suffering from post-ICU delirium and was officially diagnosed from 14 September 2016 after his hospitalisation. As Dr Koh testified, it was a fluctuating mental condition, though with time it could either deteriorate or remain the same (see above at [136]). The condition caused disorientation and difficulties in recognising family or friends and also negatively impacted his memory and executive functions (ie, his ability to plan and have higher order thinking). 211 While I do note that after Yip’s discharge from the hospital, Loy provided Yip with meals, brought him for medical check-ups and even accompanied him to Yip’s Telok Kurau Property, I do not find Yip’s degree of reliance on Loy to be as high as that inPhilip Antony.311Foot Note 311×NE 4 October 2019 at p 72.Further, inPhilip Antony, Perumal had cut Dr Paul off from her friends and relatives who could have given her advice on the transactions. Here, Yip was constantly in contact with Li-Fen “almost every day”312Foot Note 312×Li-Fen’s AEIC at p 15.and had access to legal advice from Sarjit before deciding to obtain the Ethoz Loan. 212 While it can be said that Loy had assisted Yip with his financial matters, such as the sourcing for replacement funders, the negotiating of the Outstanding Mortgage with Coutts and the execution of the Ethoz Loan (seeaboveat [32]–[37], [60] and [65]), it cannot be said that Yip was not exercising independent decision-making when his mental condition was in remission (eg, his meetings with Javier and Jia Wen). There were instances whereby Yip exercised his mind independently such as his queries about cl 8.1 of the LOO on the negative pledge. 213 Further, Yip’s rational thinking is evident from his decision to agree to the Appointment and Share Transfer. The Share Transfer and the Appointment were primarily for the benefit of Yip, in order to satisfy requirements of Ethoz in order to obtain the Ethoz Loan as replacement funding to discharge the Outstanding Mortgage. It does not appear that Loy had been granted acarte blancheauthority to do as he pleased and was completely entrusted to deal with Yip’s financial matters on his behalf, in his best interests, and on the basis of a relationship of trust and confidence. Yip does not dispute that he had agreed with Loy on the Ethoz Loan for the purpose of repaying Coutts for Yip’s benefit (ie, Part II of the Agreement). It would appear that Loy had instead been actingaccording toYip’s instructionsup until the completion of the Ethoz Loan (save for the Wrongful Transfer). 214 In my judgment, the present circumstances do not justify the finding of a relationship of trust and confidence between Yip and Loy such as inPhilip Antonyand I find that Loy does not owe a fiduciary duty to Yip on an individual basis. 215 For the above reasons, I dismiss the Breach of Fiduciary Duty Claim. Unjust Enrichment Claim 216 I now turn to the Unjust Enrichment Claim. InBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd[2018] 1 SLR 239 (at [45]), the Court of Appeal observed that the three requirements of a claim in unjust enrichment are (a) enrichment of the defendant, (b) at the expense of the plaintiff, and (c) circumstances which make the enrichment unjust (ie, the presence of an “unjust factor”), citingSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another appeal[2011] 3 SLR 540 at [110]. The Court of Appeal also noted that the defendant may raise defences to defeat the claim in whole or to reduce the quantum of the claim. 217 The defendants contest the second requirement of establishing unjust enrichment, submitting that it could not be demonstrated that the defendants had received a benefitat the expense of Yip.313Foot Note 313×DCS at para 188.InWeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801(“Anna Wee”), the Court of Appeal observed at [128]: The requirement that the benefit is given to the recipient “at the expense of” the claimant is therefore not acarte blancheto substitute any sort of connection, causal or otherwise, between the gain and the loss. It refers specifically to the requirement that the claimant (here, the Appellant), must prove that she had lost a benefit towhich she is legally entitled or which forms part of her assetsand which is reflected in the recipient’s gain, regardless of whether that gain is one of traceable property or of a transfer of value. [emphasis in original] 218 On the present facts, the loss of the Balance Sum was to the second plaintiff, Yip Holdings, and not Yip. Yip is unable to prove that he had lost a benefit which he is legally entitled to, as the Balance Sum formed a part of the $4m Ethoz Loan which was disbursed to Yip Holdings, not Yip. Yip does not own the proprietary rights to the Balance Sum because the $4m is a loan by Ethoz to Yip Holdings and not a loan to Yip. 219 In relation to the third requirement of the “unjust factor”, Yip argues that taking the property of another without consent is an unjust factor, citingAAHG, LLC v Hong Hin Kay Albert[2017] 3 SLR 636 where the High Court (at [74]) accepted that the “lack of consent” listed inGoff & Jones:The Law of Unjust Enrichment(Sweet & Maxwell, 8th Ed, 2011) ought to be recognised as an unjust factor for the claim in unjust enrichment to succeed. However, Yip’s lack of consent for the Wrongful Transfer is immaterial as Yip Holdings, not Yip, owns the proprietary rights to the Balance Sum. Given that Yip Holdings is no longer a plaintiff in the present claim, the third requirement is also unsatisfied. 220 Once again, the failure of Yip to pursue a derivative action to sue as a minority shareholder of Yip Holdings is fatal to his claim. For the above reasons, the Unjust Enrichment Claim is dismissed.",
        "Summons 5045": "221 On 3 November 2017, the defendants applied for the striking out of the second plaintiff as a party to the proceedings by way of Summons 5045 of 2017 (“Summons 5045”).314Foot Note 314×HC/SUM 5045/2017 dated 3 November 2017.The Assistant Registrar granted Summons 5045 and struck out the claims of the second plaintiff’ (ie, Yip Holdings) against the defendants on 18 December 2017.315Foot Note 315×Transcript of HC/SUM 5045/2017 dated 18 December 2017.On 22 December 2017, the plaintiffs appealed against the Asst Registar’s decision in Registrar’s Appeal 371 of 2017.316Foot Note 316×Notice of Appeal RA 371/2017 dated 22 December 2017.On 15 January 2018, I allowed the appeal against the Asst Registrar’s decision as there was a triable issue as to whether the Share Transfer and the Appointment were valid.317Foot Note 317×Minute Sheet RA 371/2017 dated 15 January 2018.In my judgment, the decision to strike out the second plaintiff’s claims could not have been decided yet without proceeding with the present trial. The decision requires the Court’s finding first on whether Loy is a director and majority shareholder of Yip Holdings (ie, whether the Share Transfer and the Appointment were valid). 222 Now that I have made the necessary finding that the Share Transfer and the Appointment are valid (above at [199]–[200]), I so hold that the second plaintiff’s claims cannot be maintained and must be struck out.",
        "Conclusion": "223 I make a final observation that the wrong in Loy’s Wrongful Transfer is best categorised as a breach of fiduciary duty owed to Yip Holdings in his capacity as a director. Had Yip obtained leave to commence a statutory derivative action pursuant to s 216A of the Companies Act or at common law to bring the suit on behalf of Yip Holdings, the plaintiffs would likely have succeeded on their claims to find that Loy had breached his fiduciary duties owed to Yip Holdings through an unauthorised transaction of the Balance Sum, which was clearly for Loy’s personal gain. Even after the conclusion of this present suit, I do observe that this option is still available to the first plaintiff, being the minority shareholder of the second plaintiff. 224 For the above reasons, the plaintiffs’ claims must be dismissed. I will hear the parties on costs if not agreed. Chan Seng Onn JJudge Yeoh Oon Weng Vincent (Malkin & Maxwell LLP) for the plaintiffs; Nicolas Tang Tze Hao and Jolene Gwee Jia-Min (Farallon Law Corporation) for the defendants.",
        "": ""
    }
}