{
    "case_title": "GVR Global Pte LtdvWayne Burt Pte Ltd and another",
    "ncitation": "[2020] SGHC 87",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Background": "2 The first defendant, Wayne Burt Pte Ltd, is a Singapore-registered company of which the plaintiff is a controlling shareholder.1Foot Note 1×Fourth Affidavit of Mahesh Triplicani Gowri Sankar (“MTGS4”) dated 19 June 2019 at [1].The second defendant, M.R.K. Enterprises Pte Ltd, is the creditor which had successfully applied in CWU 252/2018 for the winding-up order.  The second defendant opposed the application by the plaintiff for the winding-up order to be stayed or set aside. 3 The plaintiff, which holds more than 90% of the shareholding in the first defendant, did not allege that there was any defect in the winding-up order made by Woo J.  The plaintiff accepted that the order was regularly obtained, and there was no allegation that the formal statutory requirements for winding-up had not been met.  In particular, there was no suggestion that the statutory demand against the first defendant or the winding-up papers had not been properly served, or that the required advertisements had not been taken out. 4 Instead, the plaintiff’s case was that the debt claimed by the second defendant, which formed the basis of its statutory demand, was not a debt actually owed by the first defendant.2Foot Note 2×MTGS1 at [6] to [10].In short, although parties did not frame it as such, the substance of the plaintiff’s complaint was that the second defendant had practised a fraud on the Court in procuring the winding-up order, in that the first defendant had been wound up on the basis of anon-existentdebt.",
        "Procedural History": "5 A brief background to these proceedings is as follows. 6 On 14 September 2018, the second defendant issued a statutory demand (the “statutory demand”) to the first defendant seeking satisfaction of a loan for US$2 million (the “US$2m loan”) which had been extended to the first defendant on or about 12 June 2013.  The statutory demand was served on the first defendant’s registered address at 47 Changi North Crescent, Singapore 499623, but was not responded to.3Foot Note 3×Affidavit of Pisupati Seshachalam Murali (“PSM CWU”) dated 22 October 2018 at [6]. 7 On 23 October 2018, the second defendant applied for the first defendant to be wound up based on the said statutory demand. 8 On 16 November 2018, Woo J ordered that the first defendant be wound up.  The judge appointed Mr Farooq Ahmad Mann as the sole liquidator of the first defendant (the “Liquidator”).  The first defendant did not contest the application for winding-up. 9 On 23 November 2018, the plaintiff commenced these proceedings for,inter alia, a stay of the winding-up order.  The plaintiff then filed an urgent application seeking an interim stay of the winding-up order.  Having heard parties on 12 December 2018, I ordered an interim stay of the winding-up order pending the final disposal of this OS.  I also directed that the Liquidator furnish a report on the financial standing of the first defendant one month prior to the hearing of this OS, and made clear that the directors of the first defendant were to provide such documents and information as may be required by the Liquidator for the preparation of this report.4Foot Note 4×ORC 194/2019 at [5].",
        "Issues in dispute": "10 In these proceedings, there was no dispute that a sum of US$2m had indeed been transferred from the second defendant to the first defendant on 12 June 2013.5Foot Note 5×First affidavit of Kesavan Perumal (“KP1”) dated 23 November 2018 at [14]Rather, the dispute centred on the nature of this transfer.  The plaintiff claimed that the sum was part of the consideration paid for the purchase, by the second defendant from the first defendant, of shares in Raycom Engineering & Aerospace Pte Ltd (“Raycom”), a subsidiary of the first defendant, and hence was not a loan.6Foot Note 6×KP1 at [13] and [14]. 11 On the other hand, the second defendant insisted that the sum of US$2m was a loan extended by the second defendant to the first defendant which has not been repaid.7Foot Note 7×PSM CWU at [5].The source of the money was the GV Reddy Irrevocable Trust, which had transferred this sum of US$2m to the second defendant on 4 June 2013.  This trust was a family trust of the Reddy family and had been set up by Dr Gollamudi Venka Reddy (“Dr Reddy”), a United States-based businessman.8Foot Note 8×Transcript of 19 June 2019 at Page 79, Lines 1 to 10.The second defendant then lent this sum to the first defendant.  The US$2m was ultimately intended to be passed from the first defendant to Mr Mahesh Triplicani Gowri Sankar (“Mr Mahesh”), who owns and controls the plaintiff, and, through it, the first defendant.9Foot Note 9×Transcript of 20 June 2019 at Page 6, Lines 23 to 30.According to the second defendant, Mr Mahesh had asked for a loan from Dr Reddy for a business venture and had asked for the moneys to be sent to the first defendant.  Dr Reddy had agreed.  Dr Reddy’s evidence was that Mr Mahesh had sought the US$2m loan to finance the acquisition of a plant from the Shell Oil Company as part of a project in the petrochemicals sector.10Foot Note 10×First affidavit of Gollamudi Venka Reddy (“GVR1”) dated 25 February 2018 at [27]. See also Transcript of 20 June 2019 at Page 11, Lines 16 to 19 (thoughNBthe transcribing error of “Shell Plant” as “shelf plan”). 12 While the above arrangement for what was ultimately the extending of a loan from Dr Reddy to Mr Mahesh might seem unusual, the second defendant’s case was that this was an arrangement that was agreed to by the two principal individuals,ie, that the intermediaries (the first and second defendants) would be the borrower and lender.11Foot Note 11×PSM1 at [15].",
        "The Law": "13 The plaintiff, in its OS, sought two alternative grounds of relief.  The plaintiff sought a setting aside of the winding-up order pursuant to the Court’s “inherent jurisdiction”, and, in the alternative, an indefinite stay of the winding-up order under s 279 of the CA.",
        "Setting aside the winding-up order": "14 The plaintiff indicated in its amended OS that it was seeking to set aside the winding-up order “pursuant to the inherent jurisdiction of the Court”.12Foot Note 12×Amended Originating Summons 1443/2018 dated 15 January 2019, Amendment No. 1 by Order of Court made on 10 January 2019.As a preliminary point, I was of the view that the plaintiff had improperly conflated the inherent jurisdiction of the Court and the inherentpowersof the Court.  The inherent powers of the Court are specifically provided for in O 92 r 4 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”), where reference is made to “the inherent powers of the Court to make any order as may be necessary to prevent injustice or to prevent an abuse of the process of the Court”.  As was noted by the Court of Appeal inReNalpon Zero Geraldo Mario[2013] 3 SLR 258 at [40] and [41]: [T]he inherent jurisdiction of the court actually refers to an exercise of the inherent powers of the court … it would be preferable to refer to the exercise of [the Court’s] right to regulate matters properly before [it] as the exercise of the court’s inherent powers rather than its inherent jurisdiction. 15 I next turned to the issue of whether winding-up orderscanin fact be set aside pursuant to the Court’s inherent powers.  In this regard, there appeared to be differing views in the authorities.  InInterocean Holdings Group (BVI) Ltd v Zi-Techasia (Singapore) Pte Ltd (in liquidation)[2014] 2 SLR 485 at [16], Edmund Leow JC observed that: In Singapore, a winding-up order once perfected is one of those strange creatures that cannot be set aside or revoked.  At least, there is no express provision in the [CA] permitting this. 16 However, inStandard Chartered Bank (Singapore) Ltd v Construction Professional Resources Pte Ltd[2019] 5 SLR 709 (“Standard Chartered”) at [10], Choo Han Teck J expressed the view, in the context of an application to set aside a winding-up order, that the inherent powers of the court under O 92 r 4 of the ROC “can be used in instances where [they] can express justice and ensure no prejudice to anyone in any way”.  In that case, the inherent powers of the Court were relied on to set aside a winding-up order. 17 Eventually though, this point was not argued before me.  In fact, the plaintiff did not even refer to the fact that it was seeking the setting aside of the winding-up order in its submissions.  The question of whether the fraud on the Court (see [4] above) as alleged by the plaintiff would suffice to warrant the setting aside of the winding-up order pursuant to the Court’s inherent powers was simply not addressed.  I was thus led to the inexorable conclusion that the plaintiff had, for all intents and purposes, abandoned the prayer for relief in the form of setting aside of the winding-up order.  In any event, the issue of setting aside the winding-up order was rendered moot by my findings as outlined below.  I therefore say no more on this particular issue.",
        "Indefinite stay of the winding-up order": "18 I turned then to the relief of a stay sought by the plaintiff, which was dealt with in its submissions.  As the plaintiff itself recognised, an indefinite stay against the winding-up order would be premised on the application of s 279 of the CA.  In particular, s 279(1) of the CA provides that: (1) At any time after an order for winding up has been made, the Court may, on the application of the liquidator or of any creditor or contributory and on proof to the satisfaction of the Court that all proceedings in relation to the winding up ought to be stayed, make an order staying the proceedings either altogether or for a limited time on such terms and conditions as the Court thinks fit. 19 InPhangChoo Ong v Gilcom Investment Pte Ltd (LRG Investments Pte Ltd and another, non-parties)[2016] 3 SLR 1156 (“PhangChoo Ong”), LRG Investments Pte Ltd had applied to wind up Gilcom Investment Pte Ltd (“Gilcom”) on the basis of a default judgment obtained against it.  A winding-up order was duly granted.  The plaintiff there, who was the sole director and shareholder of Gilcom, sought a stay of that winding-up order pursuant to s 279(1) of the CA so that Gilcom could be allowed to apply to court to set aside the default judgment.  The stay was not granted.  In particular, Chua Lee Ming JC (“Chua JC”), as he then was, was not satisfied that Gilcom was in fact able to pay its debts.  At [18] to [20], Chua JC succinctly summarised three broad but non-exhaustive principles which guide the exercise of the Court’s discretion under s 279(1) of the CA: (a) First, an applicant for a stay has to show that the state of affairs that required the company to be wound up no longer exists. (b) Second, a stay will be refused if granting a stay would be detrimental to “commercial morality” and the interests of the public at large.  While the term “commercial morality” defies ready definition, Chua JC made reference to the court having to be satisfied that it would be reasonable to entrust the affairs of the company to the directors under whose management the company had previously been subjected to an order for winding-up, and to the court having to be satisfied that the trading operations of the company have been “fair and above board”, particularly when there has been a failure by the directors in their obligations to furnish information to the official receiver. (c) Third, a stay will be refused if the interests of the creditors, the members and the liquidator are not protected. 20 The parties before me did not dispute that the Court’s exercise of its discretion under s 279 of the CA is guided by reference to,inter alia, the abovementioned principles. 21 I pause to make the observation that cases involving s 279 of the CA typically involve situations where the company which was the subject of the winding-up order manages to pay the debts owed, or where the debts were later forgiven or waived by the lenders.  For example, inStandard Chartered([16]supra), the defendant applied to have the winding-up order stayed on the grounds that the debt had since been paid and the plaintiff had no objection to the stay on that premise.  The issue of fraud (see [4] above), by contrast, is not commonly used as a basis to seek an indefinite stay of winding-up orders under s 279 of the CA.  However, I accepted that s 279 of the CA is worded broadly enough to include fraud as a basis for an indefinite stay, and was satisfied that a fraud practised on the Court could, at least in principle, warrant an indefinite stay of a winding-up order. 22 In addition, I note that if one were to succeed in proving fraud for the purpose of an application for an indefinite stay of a winding-up order under s 279 of the CA, such fraud would not only warrant the imposition of a stay as sought, it may well be sufficient grounds forsetting asidethe impugned winding-up order.  An order of court procured by fraud, sensibly, is a nullityin toto.  Setting aside, in that light, may thus be the more appropriate remedy to be pursued in cases involving fraud.  Setting aside extinguishes the order of court in its entirety, whereas an indefinite stay by its very nature contemplates the possibility of that stay being lifted (and the underlying winding-up order resurrected).  I struggle to see what could justify the lifting of a stay in cases where fraud has been sufficiently proven.  With that said, as mentioned earlier (see [17] above), the plaintiff did not in fact pursue the relief of setting aside the winding-up order, despite having indicated that it would do so in the amended OS.  Even though the substance of the plaintiff’s complaint about the winding-up order was that it was procured by fraud, the plaintiff arguedonlyfor an indefinite stay, and did not argue in its submissions that the order should be set aside.  The second defendant also proceeded on the basis that a stay could be granted if fraud was shown.  Consequently, the specific discussion on fraud and whether it could or should be used as a basis to seek an indefinite stay of a winding-up order under s 279 of the CA (even when the remedy of setting aside the order could instead be sought) was not addressed before me in this OS. 23 On a separate note, it also bears reiteration that the present case was an applicationby the plaintiffto stay a regularly-obtained order of court for the winding-up of the first defendant.  Thus, there was no doubt to my mind that the burden wassquarelyon the plaintiff to persuade me that a stay or setting aside of the order should be granted. As was observed inPhangChoo Ong([19]supraat [18]): … An applicant for a stay has to show that the state of affairs that required the company to be wound up no longer exists.  Where the winding up was on the ground of insolvency, the applicant has to show that the company is solvent … Credible evidence of solvency is required, not least because the court is putting the company back into operation.  Mere assertions of solvency will not be sufficient. 24 Similarly, inChimbuscoInternational Petroleum (Singapore) Pte Ltd v Jalalludin bin Abdullah and other matters[2013] 2 SLR 801, after making the bankruptcy orders against the defendant-guarantors, Vinodh Coomaraswamy JC, as he then was, dismissed their application for a stay of execution of the insolvency orders.  In so doing, the Judicial Commissioner considered at [96] that: In insolvency proceedings as in ordinary civil proceedings … the onus is therefore squarely on the defendant to show why it is appropriate to stay the proceedings or to stay execution of the orders rather than to let the insolvency proceedings run their normal course. 25 Therefore, it being the plaintiff that was seeking to prevent the winding-up order from taking effect, the plaintiff had to discharge the burden of showing that the “state of affairs that required the company to be wound up no longer exist[ed]”.  In the context of this case, the onus accordingly fell on the plaintiff to prove that the first defendant was in fact solvent, and that the second defendant’s case that there was a loan owing from the first defendant shouldnotbe accepted by the Court. 26 Not only was the burden of proof in the present proceedings on the plaintiff – I further noted that this burden is not readily discharged.  Instead, the plaintiff “must make out a case that carries conviction”:In re Calgary and Edmonton Land Co Ltd[1975] 1 WLR 355 at 359, as approved by Chua JC at [15] ofPhangChoo Ong([19]supra).",
        "The nature of the US$2m transaction": "27 The thrust of the plaintiff’s case was that the winding-up order should not have been made because the US$2m transaction was not a loan which was owing from the first defendant to the second defendant, but was in fact consideration for a separate transaction (see [10] above).  The only two persons who gave evidence before me who hadpersonalanddirectknowledge of the alleged US$2m loan were Mr Mahesh and Dr Reddy.  Mr Mahesh’s evidence was completely at odds with Dr Reddy’s.  One of them was obviously not telling the truth as to the existence or otherwise of this purported orally-agreed loan.  An assessment of their credibility was thus essential for my decision.  In this regard, I could not accept the plaintiff’s rather surprising submission that there was no needat allfor me to consider the issue of Mr Mahesh’s credibility.13Foot Note 13×Plaintiff’s Reply Written Submissions (“PRWS”) at [5]. 28 Having considered the evidence that was adduced before me, my assessment of the credibility of the two witnesses was that Dr Reddy’s evidence was to be preferred to that of Mr Mahesh.  While neither party’s evidence was entirely cogent, certain aspects of Mr Mahesh’s evidence were startling in their defiance of logic, and wereentirelydevoid of documentary support.  The following instances are some examples of the deficiencies in the evidence of Mr Mahesh.  The cumulative weight of these deficiencies rendered it impossible for me to accept Mr Mahesh’s (and by extension, the plaintiff’s) contention that the state of affairs that required the first defendant to be wound up no longer existed (see [19(a)] above), or more precisely, never existed.  I was also not able to accept that the US$2m transferred from the second defendant to the first defendant was consideration for shares purchased by the second defendant in Raycom.",
        "The purchase price for the Raycom shares": "29 Given that the plaintiff’s central claim was that the US$2m transferred by the second defendant to the first defendant was consideration for Dr Reddy’s purchase of shares in Raycom, one might have expected that the plaintiff would have been able to at least identify the purchase price of the shares in Raycom which had purportedly been purchased.  After all, Mr Mahesh (who was the ultimate beneficial owner of the plaintiff) also owned and controlled the first defendant and Raycom.14Foot Note 14×KP1 at [14], Transcript of 18 June 2019 at Page 30, Lines 1 to 8. 30 However, Mr Mahesh provided contradicting accounts of the purchase price of the said shares.  At various parts of his affidavit of 19 June 2019, Mr Mahesh gave evidence that the sum of US$2m remitted to the first defendant in June 2013 was the purchase price of shares in Raycom.15Foot Note 15×2 MTGS at [21], [27], [43], [45], [46].In fact, Mr Mahesh’s affidavit stated no fewer thanfourtimes that the US$2m was the price for 8,243,825 shares in Raycom.16Foot Note 16×2 MTGS at [21], [27], [43], [46].However, under cross-examination, Mr Mahesh admitted that this was not accurate because the consideration for the shares paid by the second defendant was actually approximately US$6.1m.17Foot Note 17×Transcript of 18 June 2019 at Page 50, Lines 13 to 23.It is telling that this figure of US$6.1m waspreciselythe figure which he expressly disclaimed in his affidavit evidence.  In fact, Mr Mahesh had, in his affidavit evidence, specifically described the claim that the second defendant had paid US$6.1m for the 8,243,825 shares in Raycom as being “wrong and misleading”.18Foot Note 18×MTGS2 at [45]. 31 To extricate himself from this inconsistency between the purchase price for the shares being at first US$2m and now US$6.1m, Mr Mahesh claimed that the sum of US$2m was onlypartof the total consideration of approximately US$6.1m.19Foot Note 19×Transcript of 18 June 2019 at Page 53, Lines 2 to 8.This assertion had not been made prior to that point in cross-examination. 32 Mr Kesavan Perumal (“Mr Perumal”), another witness for the plaintiff, also asserted in his affidavits that the US$2m transfer from the second defendant to the first defendant was merely payment for the Raycom shares.20Foot Note 20×For example, see 1st affidavit of Kesavan Perumal dated 23 November 2018, para 14 and 21.This is relevant because Mr Perumal gave evidence that, while he was a director of the first defendant, all the information in his affidavits in relation to the second defendant’s purchase of shares in Raycom came from Mr Mahesh.  He acknowledged that he had no personal knowledge of this matter because he was not a director of the first defendant at the time of the transaction.21Foot Note 21×Transcript of 18 June 2019 at Page 65, Lines 25 to 31, Transcript of 14 August 2019 at Page 6, Lines 12 to 32. 33 However, Mr Perumal’s evidence actually made the matter even more confusing because he had separately stated in his affidavits that the consideration for the Raycom shares paid by the second defendant was US$3m, andnotUS$2m or US$6.1m.22Foot Note 22×KP 1 at [17] and KP3 at [32].Unsurprisingly, the plaintiff sought to disavow this evidence in its submissions, arguing that it “must be apparent to anyone” that Mr Perumal, its own witness, is a “simple man” who “has confused concepts and entities”.23Foot Note 23×Plaintiff’s Written Submissions (“PWS”) at [66].However, that still did not satisfactorily explain the figure of US$3m that Mr Perumal, who was a director of the first defendant, stated was the purchase price for the Raycom shares.  Even taking the plaintiff’s arguments at their highest, the sale price of the Raycom shares was a straightforward matter that could have been easily verified by a director of the first defendant, and which didnotrequire great sophistication to understand. 34 The inconsistency in the affidavit and oral evidence of Mr Mahesh on this very simple issue of the consideration for the Raycom shares paid by the second defendant was not properly explained.  This inconsistency was compounded by the evidence of Mr Perumal, who was clear that the information he receivedcame from Mr Mahesh.24Foot Note 24×Transcript of 14 August 2019 at Page 12, Lines 9 to 25.These inconsistencies led me to question Mr Mahesh’s credibility and the reliability of his evidence.",
        "The “handwritten note”": "35 Part of the second defendant’s case on the US$2m loan outstanding from the first defendant was what the parties referred to as the “handwritten note”.  This was a document which the second defendant alleges was handwritten by Mr Mahesh and which was said to evidence an admission on Mr Mahesh’s part that the US$2m loan was owing from the first defendant to the second defendant.25Foot Note 25×DCB, p 18-19. 36 In Mr Mahesh’s affidavit of 19 June 2019, he claimed that “[t]he handwritten document is aforgery.  A professional and seasoned businessman like me willneveracknowledge any amount in such scrap paper, not to mention such a large amount” [Emphasis added].26Foot Note 26×TGSM2 at [28] 37 Despite this rather unequivocal statement, in a surprising turn of events while giving oral evidence, Mr Mahesh admitted that the “handwritten note” was indeed prepared by him and contained his signature.27Foot Note 27×Transcript of 18 June 2019 at Page 11, Lines 19 to 32.Under cross-examination, he accepted that he had written out and signed the note at a meeting with Dr Reddy in Chennai, India on 12 December 2017.28Foot Note 28×Transcript of 19 June 2019 at Page 38, Lines 1 to 6. 38 I found this to be quite a remarkable departure from the position he had taken in his affidavit.  There was no real explanation by Mr Mahesh for this about-turn save that he had inappropriately used the word “forgery”. 39 This was not a convincing explanation at all given that Mr Mahesh is a well-educated and savvy businessman with a good command of English.29Foot Note 29×Transcript of 18 June 2019 at Page 14, Lines 1 to 9.When it was expressly pointed out to him that calling something a forgery typically entailed an allegation that the handwriting or signature was not actually that of the person it purported to represent, his only explanation was that his choice of words was improper.  I found this to be a rather convenient explanation which did not sit well with the fact that he is a professional and seasoned businessman. 40 Mr Mahesh’s attempt to explain away the “handwritten note” and his allegations that it was a forgery also led him to provide a somewhat strained interpretation of the note’s contents.  Mr Mahesh claimed that the “handwritten note” pertained to a loan extended by Dr Reddy to Raycom.  This was despite the “handwritten note” explicitly referring to the US$2m as a “personal loan” owing from Mr Mahesh to Dr Reddy.30Foot Note 30×MTGS1 at p 12. 41 Tellingly, when askedwhenthis purported loan to Raycom was made, Mr Mahesh was unable to answer.31Foot Note 31×Transcript of 19 June 2019 at Page 42, Lines 1 to 4.When asked whether the Raycom accounts would reflect this purported loan, Mr Mahesh wasalsounable to answer.32Foot Note 32×Transcript of 19 June 2019 at Page 42, Lines 17 to 21.When it was pointed out to him that Raycom had since gone into liquidation, and when asked whether Dr Reddy or his related entities would be on the list of creditors, Mr Mahesh wasonce againunable to answer.33Foot Note 33×Transcript of 19 June 2019 at Page 44, Lines 8 to 26. 42 What Mr Mahesh did in response was to continue insisting that the loan was one which Dr Reddy had made to Raycom, and not to him.  Mr Mahesh also claimed that Dr Reddy had made loans in the past to Raycom though, even on his own case, those loans did not amount to US$2m.34Foot Note 34×MTGS1 at [7].He then claimed that there was a share purchase agreement signed by a prospective investor in Raycom – one Fraser Corp Pte Ltd – which clearly mentioned a loan made by Dr Reddy to Raycom.35Foot Note 35×Transcript of 19 June 2019 at Page 45, Lines 3 to 7.This share purchase agreement signed by Fraser Corp Pte Ltd was never produced to verify Mr Mahesh’s claims. Perhaps unsurprisingly, any reference to this explanation involving Fraser Corp Pte Ltd was conspicuously absent from the plaintiff’s submissions.  I therefore was not able to accept Mr Mahesh’s bare assertions in this regard. 43 I also found Dr Reddy’s explanation on how the “handwritten note” had been produced to be more coherent, logical and consistent with the actual words and numbers that appear in the “handwritten note”.  I accepted Dr Reddy’s evidence that Mr Mahesh had acknowledged that the US$2m loan was due and payable and that Mr Mahesh was explaining how he was going to cause the first defendant to sell its shares in Raycom in order to raise moneys to repay the loan.36Foot Note 36×Transcript of 20 June 2019 at Page 53 Lines 1 to 25He also agreed to pay interest on the loan and wrote out the workings on interest.  This was consistent with what is apparent on the face of the note itself. 44 I further found that the term “personal loan” appeared in the “handwritten note” because Mr Mahesh knew that Dr Reddy regarded the first defendant and Mr Mahesh as one and the same.37Foot Note 37×Transcript of 20 June 2019 at Page 55 Lines 14 and 15.It was also consistent with the fact the loan had originated from a request by Mr Mahesh to Dr Reddy for a personal loan in relation to a business venture of the former: see [11] above.  The fact that Mr Mahesh actually signed the “handwritten note” and allowed Dr Reddy to retain it suggested that it was intended to assure the latter that the loan would be repaid as promised.  Once again, this was more consistent with Dr Reddy’s evidence than Mr Mahesh’s version of events. 45 After weighing the two contrasting explanations of the “handwritten note”, I accepted that the note showed Mr Mahesh, and by extension the first defendant, acknowledging the existence of a US$2m loan from Dr Reddy to Mr Mahesh, via the making of a loan from the second defendant to the first defendant.",
        "Mr Mahesh’s written communications with Dr Reddy": "46 More importantly, apart from Dr Reddy’s evidence on the matter, the fact that the “handwritten note” acknowledged the debt of US$2m was confirmed by the communications between Mr Mahesh and Dr Reddy that preceded and followed the meeting in Chennai where the note was signed. 47 First, there was an email from Dr Reddy to Mr Mahesh dated 16 May 2017 which set out the background to why the US$2m loan had been made in June 2013 and how it was still outstanding.38Foot Note 38×Second Defendant’s Bundle of Affidavits Vol III (“BAF3”) at p 993.Another email dated 20 October 2017 by Dr Reddy to Mr Mahesh referred to a recent discussion between the two, where Mr Mahesh had indicated that he would repay the US$2m loan when Raycom was sold by the first defendant.39Foot Note 39×BAF3, at p 995.There was yet another email from Dr Reddy to Mr Mahesh on 9 November 2017 chasing for repayment of the US$2m loan.40Foot Note 40×BAF3, at p 996.While Mr Mahesh claimed in cross-examination that he had replied to all these emails to deny that there was a US$2m loan that was owing, there were no documents produced by the plaintiff to show that he had in fact responded as claimed. 48 These emails then led up to the meeting in Chennai on 12 December 2017.  This background context lends support to Dr Reddy’s evidence that, at that meeting, Mr Mahesh was attempting to reassure him that he had been trying to raise funds to repay the US$2m loan and had written out and signed the “handwritten note” in the course of their discussions. 49 Critically, Dr Reddy also produced an exchange of text messages with Mr Mahesh in the months following the Chennai meeting which showed that Dr Reddy had been chasing Mr Mahesh for updates as to his attempts to sell Raycom to raise funds to repay the US$2m loan.41Foot Note 41×BAF3, at p 1008 to 1021.Dr Reddy suggested to Mr Mahesh in one of these text messages that a formal document be prepared to record the loan amount owing, as well as the interest that Mr Mahesh had agreed to pay.  In response, Mr Mahesh stated “Ok Uncle”.  In another text message, Mr Mahesh stated “U draft letter what is comfortable to U about 2 mill Shell loan .,, I will sign and send it to U”.  In yet another text message, Mr Mahesh stated “My commitment to your $2 mill usd … will be honoured – Beg, Borrow & Steal …”. 50 In my view, the clearest admission yet came in Mr Mahesh’s text message sent on 5 March 2018, where he stated “Any time before the end of March Uncle.  2 mill will be paid as i borrowed personally uncle ., i am committed to settle it . I hv not put U in any misery”.42Foot Note 42×See also Transcript of 20 June 2019, Page 24, Lines 7 to 17.The language in this last text message I have referred to echoes what Mr Mahesh had written in the “handwritten note” when he referred to a “personal loan” of US$2m. 51 In light of the documentary evidence, I did not think that the plaintiff could seriously argue that the sum of US$2m transferred on 12 June 2013 was actually not a loan, but instead part-payment of the second defendant’s acquisition of shares in Raycom.  I also found it highly significant that Mr Mahesh had been given an opportunity to file a final affidavit in reply to Dr Reddy’s affidavit dated 11 July 2019, where the above emails and text messages had been exhibited and referred to, but failed to give any explanation at all for these emails and text messages in his reply affidavit dated 31 July 2019.  Strikingly, Mr Mahesh was wholly unable to produce any documents, emails, or text messages to support his bare allegation that he had refuted Dr Reddy’s claim that the loan of US$2m had been taken by him. 52 Overall, the above episodes illustrate the limited credibility of Mr Mahesh’s evidence.  He shifted his position on numerous issues, and his claims were contradicted by his own correspondence.  He showed himself to be willing to claim that there existed documentation to support his claims, only to completely fail to actually produce that purported documentation when called upon to do so.  I was therefore unable to accept the plaintiff’s claim that the US$2m transferred from the second defendant to the first defendant was not a loan and was instead part-payment for shares in Raycom.",
        "The second defendant’s “ledger”": "53 Against the weight of all the aforementioned evidence, the plaintiff pointed me to an inconsistency in the evidence of the second defendant’s director, Mr Pisupati Seshachalam Murali (“Mr Pisupati”).  Mr Pisupati had relied on a “ledger” which purportedly showed the various sums transferred by the second defendant to the first defendant.  These sums totalled approximately US$6.1m,43Foot Note 43×Second Defendant’s Bundle of Affidavits Vol I (“BAF1”) (Pisupati Seshachalam Murali’s affidavit of 10 December 2018) at p 311.which Mr Pisupati described as payments for the shares in Raycom. 54 The transfers in this “ledger” were at various dates in 2012.  However, counsel for the plaintiff referred to the second defendant’s DBS Bank statement for June 2013 which showed that, apart from the entry showing the transfer of approximately US$2m to the first defendant on 12 June 2013, there was another entry which showed that approximately US$1m was transferred to the first defendant on 21 June 2013.44Foot Note 44×Second Defendant’s Bundle of Affidavits Vol II (“BAF2”), p 487 (Pisupati Seshachalam Murali’s affidavit of 22 October 2018 at Exhibit PSM-1).In cross-examination, Mr Pisupati stated that this latter entry in the statement was for payment of the Raycom shares.  This evidence by Mr Pisupati was inconsistent with the earlier-mentioned “ledger” entries showing the payments for the Raycom shares.45Foot Note 45×Transcript of 15 August 2019 at Page 46, Line 12 to Page 47, Line 15. 55 Apart from this inconsistency, the plaintiff also pointed to the fact that the structuring of the loan as coming from Dr Reddy to the second defendant and then from the second defendant to the first defendant was odd.46Foot Note 46×PWS from [24] to [35].The plaintiff’s argument in this regard was twofold.  First, there was an inconsistency between the amount Mr Pisupati alleged to be the applicable interest rate on the loan of 3% in his oral evidence, and the interest rate of 10% which was referenced in the “handwritten note”.  Second, Mr Pisupati himself appeared to have accepted that, whatever the interest rate applicable, the fact that the loan from Dr Reddy to the second defendant was interest-bearing made it commercially unviable for the second defendant to only be seeking the return of the principal amount (sansinterest) of US$2m from the first defendant. 56 The plaintiff urged me to infer from these discrepancies that the transfer of approximately US$2m on 12 June 2013 must therefore be part of the consideration of US$6.1m for the Raycom shares.  I could not see why such an inference would necessarily flow from the matters outlined at [54] and [55] above.  After all, the second defendant had produced its bank statements and other financial documents from 2012 and 2013 which showed various transfers to the first defendant from the second defendant and other related entities adding up to more than US$6.1m.  The second defendant asserted that these transfers included, and fully accounted for, the payments for the Raycom shares. Thus, quite apart from the US$2m transfer on 12 June 2013, there was ample basis for me to accept that a total purchase price of US$6.1m had been in fact transferred by the second defendant for the purchase of the Raycom shares.47Foot Note 47×Second Defendant’s Core Bundle (“DCB”) at p 65 to 75.Put another way, the “ledger” did notipso factolead to the conclusion that the US$2m must have been part-payment for the Raycom shares. 57 Further, it was significant that the plaintiff was unable to provide me with any credible explanation as to what the other money transfers were for, given that it was in fact the plaintiff’s position that these transfers werenotfor payment of the Raycom shares.  There was some suggestion by Mr Mahesh, under cross-examination, that some of these transfers wereotherloans from the second defendant that have since been repaid or were for transactionsunrelatedto the agreement for the purchase of the Raycom shares.48Foot Note 48×Transcript of 18 June 2019 at Page 51, Lines 14 to 28.However, despite claiming that he could get documents, such as bank statements of the first defendant which were with its auditors, that would substantiate what he said, no such documents were eventually produced in these proceedings by the plaintiff or the first defendant to support Mr Mahesh’s bare allegation that the money transfers adding up to US$6.1m were for other matters unrelated to the acquisition of the Raycom shares.  This was yet another instance of Mr Mahesh making rather convenient claims about documents which purportedly supported his position, but never actually producing them. 58 Given the evidence, I was of the view that the more natural inference is that the “ledger” was inaccurate in setting out the dates of the transfers, a possibility that was also suggested by Mr Pisupati.  Upon examination of the “ledger”, it appeared that the document was not part of the accounts or financial records of the second defendant, but a document that was prepared for some other purpose.49Foot Note 49×BAF2 at p 487.In other words, it did not appear to be a true “ledger” in the accounting sense.  That being so, the more likely explanation was that this document had been inaccurately prepared.  On balance, I accepted Mr Pisupati’s evidence in this regard. 59 Further, I should add that I did not consider the plaintiff’s arguments as outlined at [55] above to be persuasive.  While there might have been uncertainty over the precise interest rate of the loan from the second defendant to the first defendant, there was clear evidence – whether from the “handwritten note” or Mr Mahesh’s correspondence with Dr Reddy – that the US$2m transferred from the second defendant to the first defendant was a loan and not payment for shares in Raycom.  There also existed a whole range of possibilities which might have explained the apparent inconsistencies.  For example, Dr Reddy might have been willing to forgo the interest if at least the principal loan amount was recovered, Mr Pisupati may not have been privy to the final discussion between Mr Mahesh and Dr Reddy about the precise interest rate applicable, or Mr Pisupati may simply have been mistaken.  Either way, none of these possibilities precluded a contract of loan existing between the first and second defendants.",
        "The second defendant’s financial statements": "60 The plaintiff also referred me to the audited accounts of the second defendant and argued that those accounts did not reflect that there was a loan outstanding from the first defendant.50Foot Note 50×PWS at [34] to [35].In particular, the plaintiff relied on the audited accounts for the financial year ending 31 December 2013.  It pointed out that, while notes to the accounts showed that there were outstanding loan receivables of about US$10.5m, these loans were described as being “secured” by the “borrowing companies’ assets” and as carrying an interest rate of 3% per annum.51Foot Note 51×BAF1 at p 372. 61 By contrast, the loan alleged to exist by the second defendant was, as stated in the statutory demand,onlyfor the sum of US$2m.  According to the plaintiff, this suggested that the alleged loan was interest-free, and that it was not secured by any of the first defendant’s assets.  The reference in the second defendant’s audited accounts to its outstanding loan receivables as being secured by the borrowing companies’ assets and carrying an interest rate of 3% per annum would thusnotappear to include the unsecured loan of US$2m claimed by the second defendant in the statutory demand to be owing from the first defendant.52Foot Note 52×PSM CWU at [7].This in turn, according to the plaintiff, suggested that the US$2m transfer was not a loan and was instead something else.  In this light, the plaintiff submitted that Mr Pisupati’s allegation in his oral evidence that the US$2m loan to the first defendant had an interest rate of 3%, which had not been raised in his affidavit evidence, was an attempt to force the US$2m loan to fit within the description of the loan receivables in the financial statements.53Foot Note 53×Transcript of 15 August 2019 at Page 58, Lines 24 to 32. 62 The difficulty I had with this submission was that it wrongly and unduly elevated the probative value of the audited accounts on an issue that was best tested by the direct evidence of the protagonists. 63 The audited accounts, which are relevant by virtue of s 34 of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”), had to be ascribed their proper weight depending on the facts and circumstances of the case.  They did not, in and of themselves, trump the probative weight of other evidence tending to prove or disprove the existence of the US$2m loan.  This is made clear by the illustration to s 34 of the EA, which provides as follows: Illustration A sues B for $1,000 and shows entries in his account-books showing B to be indebted to him to this amount. Theentries arerelevant, but are not sufficientwithout other evidence to prove the debt. [Emphasis added] 64 As a result, inLim Mong Hong v Public Prosecutor[2003] 3 SLR(R) 88, Yong Pung How CJ held that while a printout showing certain payments was relevant under s 34 of the EA, it “could only, at best, form corroborative evidence and could not be used as the sole basis for the appellant’s conviction” (at [46]).  While it might reflexively be argued that the standard of proof is different in a criminal case given that it concerned potential infringements on liberty, the Court of Appeal observed at [55] ofSIC College of Business andTechnology Pte Ltd v Yeo Poh Siah and others[2016] 2 SLR 118 (“SIC College”)that: While it was ultimately within the scope of the Judge’s discretion to admit the evidence, the admission of the Printout was not in itself sufficient, without other evidence, to prove adebtbecause s 34 of the Evidence Act states that such statements “shall not alone be sufficient evidence to charge any person with liability”. The obvious danger of relying on account book entries is even greater if the claimant or one of his affiliates was the one who was making the records. This danger remains even if accountants had given an unqualified opinion on the previous consolidated accounts that formed the basis for the first transaction on the ledger. [Emphasis original] 65 The relevance ofdirectevidence as opposed to only relying on the accounts was also emphasised inRe Ice-Mack PteLtd (in liquidation)[1989] 2 SLR(R) 283 (“Re Ice-Mack”), which was cited with approval by the Court of Appeal inSIC College.  At [21] ofRe Ice-Mack, Yong Pung How CJ observed that: It may well be that, in what might be called a straightforward case, documents such as those produced by the applicant [under s 34 of the Evidence Act] might be accepted as sufficient evidence to prove a debt obligation. But, in this case, once the validity of the claim was challenged, it was incumbent on the applicant to go to the root of the matter and to produce proper evidence of the various “loans and payments for and on behalf of the company” ... which it claimed to have made. These cases underscore the importance of not placing undue weight on accounts, especially when direct evidence is available. 66 On the instant facts, the direct evidence in the form of the testimony of Mr Mahesh and Dr Reddy, and their correspondence with each other, offered better probative value on the question of the existence of the USD$2m loan than the company’s accounts.  These accounts, like the “ledger”, were presumably prepared by accounts staff who may not have had the full picture.  The accounts might therefore have contained errors which passed unnoticed by the directors. 67 Further, the sum claimed in the statutory demand should not be taken as being determinative ofallthe claims owing from the debtor to the creditor.  This is clear from [9] ofRe Inter-Builders Development Pte Ltd[1991] 1 SLR(R) 126, where this Court held that: In my view, s 254(2)(a) [of the CA] would operate if the petitioning creditor can establish that a sum exceeding [the statutory threshold] is due to him from the company and he has made a demand for a sum in excess of [the statutory threshold] in the manner provided in s 254(2)(a) which the debtor has neglected to pay.  To hold otherwise would, in the words of Lord Chelmsford quoted above [inCardiff Preserved Coal and Coke Co v Norton(1867) LR 2 Ch App 405 at 410] “make every winding-up order bad where the creditor had demanded the smallest sum above what was actually due to him”. What is clear from this extract is that the creditor does not need to stipulate thepreciseamount owing in the statutory demand.  All that is required is that the amount claimed exceeds the statutory threshold, and that the amount claimed is in fact owed to the creditor.  This approach is unsurprising – a creditor may wish to claim only an amount which isindisputablyowed to him in a statutory demand rather than risk a dispute over issues like interest, especially if his objective is to get quick payment or seek the winding up of the company.  While r 94(2) of the Bankruptcy Rules (Cap 20, R 1, 2006 Rev Ed) (“Bankruptcy Rules”) does require that the statutory demand state the actual amount of debt that has accrued as of the date of the demand, as observed by Valerie Thean J inLalwaniAshok Bherumal v Lalwani Shalini Gobind and another[2019] 4 SLR 1304 at [21] and [22], non-compliance with r 94 of the Bankruptcy Rules is not, without more, fatal.  Rather, the Court has the power to make appropriate orders in relation to the statutory demand to ensure that substantial justice is done as between the parties.  On appeal, the Court of Appeal specifically agreed with Thean J that the court had the power to remedy irregularities in relation to statutory demands so long as substantive injustice would not be occasioned by the remedy. 68 In short, the contents of the statutory demand issued by the second defendant were not determinative as to the precise amount that is owed from the first defendant to the second defendant, and whether the loan was an interest-free one.  I did not have to make any findings as to what the actual amount owed by the first defendant to the second defendant was, or on the agreed interest rate, given that such findings would have been unnecessary for me to decide whether to have granted the plaintiff’s application to stay the winding-up order. 69 In my judgment, the plaintiff has placed undue weight on the second defendant’s accounts and on the precise amount claimed in the statutory demand to assert a potential inconsistency, even in the face of the clear direct evidence available.  As already explained, I found the direct evidence to be overwhelmingly in support of a finding that there was a US$2m loan, and that the loan was due and owing from the first defendant to the second defendant.  This in turn suggested to me that the more plausible explanation for the inconsistencies outlined above was that the audited accounts of the second defendant were simply inaccurate.  I found that the probative value to be accorded to the accounts was minimal at best, and that what little probative value could be ascribed was plainly insufficient to overcome the clear and direct evidence from the key protagonists.",
        "The solvency of the first defendant": "70 Another significant aspect of the plaintiff’s case which I found troubling was the fact that neither Mr Mahesh nor Mr Perumal dealt in their affidavits with the issue of the three promissory notes given to Dr Reddy and his related entities.54Foot Note 54×Transcript of 20 June 2019, Page 36, Line 14 to Page 37, Line 18. 71 By way of  background, all three promissory notes were signed by Mr Mahesh in his capacity as “Managing Director, Wayne Burt systems [sic] Pte Ltd”, with the first defendant’s registered address included below.55Foot Note 55×Affidavit of Pisupati Seshachalam Murali dated 10 Dec 2018 at Exhibit PSM-15 at pp 177 to 194.Each promissory note stipulated an interest rate of 10% per annum, and was for the sum of US$500,000.  One note indicated Dr Reddy as the party the sum of US$500,000 was payable to, while the other two indicated the GV Reddy Irrevocable Trust U/D/T and DFT Group LLC respectively.  It was not disputed that both the GV Reddy Irrevocable Trust U/D/T and DFT Group LLC are entities associated with Dr Reddy. 72 At the hearing of SUM 5620/2018 on 12 December 2018, which was the plaintiff’s application for an interim stay of the winding-up order pending the resolution of the OS, the issue of the first defendant’s solvency was raised.  Counsel for the second defendant drew my attention to the fact that the three abovementioned promissory notes totalling an amount of US$1.5m had been given by Mr Mahesh on behalf of the first defendant to Dr Reddy and his related entities.  Three statutory demands had also been served on the first defendant in respect of these promissory notes in September 2018.56Foot Note 56×BAF1 (1st affidavit of Pisupati Seshachalam Murali dated 10 Dec 2018), p 294 – 302.These demands were unanswered and counsel for the second defendant sought to persuade me that the first defendant was hopelessly insolvent, quite apart from the issue of the US$2m loan that had been given by the second defendant.57Foot Note 57×See Notes of Arguments for SUM 5620/2018 dated 12 Dec 2018 at p 3.In reply to this, counsel for the plaintiff informed me that the claims under the promissory notes were disputed by the first defendant, who intended to resist any such claims.58Foot Note 58×See Notes of Arguments for SUM 5620/2018 dated 12 Dec 2018 at p 4. 73 Despite this clear statement to the Court, and despite knowing that the solvency of the first defendant would be a critical issue for consideration in an application under s 279 of the CA (seePhangChoo Ong([19]supraat [18])), the plaintiff did not provideanyexplanation in the affidavits of Mr Mahesh and Mr Perumal that were subsequently filed in support of the application which addressed why these claims under the promissory notes were disputed. 74 It was only in his final affidavit dated 31 July 2019, filed to deal with certain new documents disclosed by the second defendant, that Mr Mahesh appeared to suggest, albeit in an unclear fashion, that the sum of US$1.5m lent under the promissory notes had been sent by the first defendant to Kerns Aero Products Pvt Ltd (“KAP”) for the latter’s use as working capital.  Mr Mahesh claimed that this arrangement was agreed to by Dr Reddy, and that there was therefore no longer an obligation on the first defendant to honour the promissory notes.59Foot Note 59×MTGS6 from [6] to [10]. 75 I was unpersuaded by Mr Mahesh’s claims in this regard.  Dr Reddy produced correspondence in the form of emails which showed that Mr Mahesh accepted that US$3m in loansremainedoutstanding to Dr Reddy’s family trust and its related entities.60Foot Note 60×BAF3 (Dr Reddy’s affidavit of 11 July 2019), p 991-994.When confronted with this while being cross-examined, Mr Mahesh claimedfor the first timethat the loans were no longer owing from the first defendant because Dr Reddy had agreed to have these loans converted into equity in KAP, such that Dr Reddy was now KAP’s majority shareholder.61Foot Note 61×Transcript of 13 August 2019, Page 24, Lines 16 to 27, and Page 37, Lines 1 to 17.Not only was this explanation not found in Mr Mahesh’s affidavits, it was also not supported by any documents or emails produced by the plaintiff.  When asked why he could not produce any documents or emails to substantiate his assertions, Mr Mahesh incredibly stated that he had text messages in his phone to show the agreement with Dr Reddy, but these had been deleted because they contained sensitive and confidential information.62Foot Note 62×Transcript of 13 August 2019, Page 15, Lines 25 to 30. 76 Given the highly unsatisfactory state of Mr Mahesh’s evidence in this regard, I was left to conclude that his evidence had been completely made up in an attempt to deny the fact that the first defendant was seriously in debt and thus insolvent.  Accordingly, quite aside from the US$2m loan, I was not satisfied that the plaintiff had “[made] out a case that carries conviction” that the first defendant was solvent and that the winding-up order should be indefinitely stayed or set aside.",
        "Furnishing information and documents to the Liquidator": "77 My conclusion on the insolvency of the first defendant is buttressed by evidence apart from the promissory notes.  Giving evidence as a director of the first defendant, Mr Perumal had testified under cross-examination that the first defendant did not have any cash or bank accounts and also did not have any employees.63Foot Note 63×Transcript of 14 August 2019 at Page 136, Line 11 to Page 137, Line 23.He also agreed with the second defendant’s counsel’s suggestion that the first defendant was, as of the time of the hearing, insolvent.  I was unable to accept the plaintiff’s suggestion that Mr Perumal was simply explaining what he meant by the term “insolvent” when he had stated clearly that “I know [there are] no funds in [the] accounts”.64Foot Note 64×Transcript of 14 August 2019 at Page 138, Lines 2 to 3. 78 Either way, the latest audited financial statements of the first defendant, for the period ending on 31 March 2015, showed that its total and current liabilities exceeded its total and current assets by US$6,198,204.65Foot Note 65×DCB at p 218.The auditors had expressed the view that the continued financial support of the shareholders of the first defendant would be needed to keep the company as a going concern.66Foot Note 66×DCB at p 218.Despite this, there was no attempt by the plaintiff to furnish me with any evidence that the shareholders of the first defendant had injected fresh capital or moneys into the company since 2015, for example, through the production of the bank statements of the first defendant or any documents showing capital or cash injections. 79 Whether the first defendant was solvent and able to meet its liabilities was one of my main concerns when I granted the plaintiff’s application in SUM 5620/2018 for an interim stay of the winding-up order on 12 December 2018.  That was why I had ordered the directors of the first defendant at that time – Mr Mahesh, Mr Perumal and Mr Rangamani Krishnan (“Mr Krishnan”) – to cooperate with the Liquidator by providing him with the documents and information he required. This had been ordered so that the Liquidator could provide an independent report on the financial state of the first defendant one monthbeforethis OS was due to be heard.  After all, there might be no point in staying the winding-up order if it was shown that the company would not be able to meet its liabilities in respect of other debts.  Counsel for the plaintiff had assured me at the hearing on 12 December 2018 that there would be full cooperation by the three directors of the first defendant with the Liquidator.67Foot Note 67×See Notes of Arguments for SUM 5620/2018 dated 12 Dec 2018 at pp 4 to 5. 80 To put it very bluntly, the three directors of the first defendant simply defied the order that I made on 12 December 2018.  They refused to answer the Liquidator’s queries or provide any information or documents to him.  As early as 11 February 2019, the Liquidator had written to the first defendant and each of the first defendant’s directors to request for financial information and documents.68Foot Note 68×Affidavit of Farooq Ahmad Mann (“FAM”) dated 17 May 2019 at [13] and [14].These letters went unanswered.  On 25 February 2019, the Liquidator wrote to the first defendant’s former solicitors seeking a response from the first defendant and/or its directors in relation to my order.  This letter once again went unanswered.69Foot Note 69×FAM at [15] and [16].The Liquidator confirmed in his affidavit that he “received no assistance from the 1st Defendant and/or its directors”, and wrote to the Court on 4 March 2019 to update me accordingly.70Foot Note 70×FAM at [18].As a result of theflagrant failureby the first defendant and its directors to comply with my order of 12 December 2018, the Liquidator was not able to produce his report, and I was left with no reliable information as to the solvency of the first defendant. 81 There was no explanation in the affidavits of Mr Perumal or Mr Mahesh as to why my order was not complied with.  In his oral evidence, Mr Perumal stated that he left it to Mr Krishnan and Mr Mahesh to provide the necessary information and documents to the Liquidator.  Mr Krishnan then resigned as a director.  Mr Mahesh’s explanation, given only when he was cross-examined, was that he did not have many of the documents requested by the Liquidator because these documents were in the custody of the liquidators of the subsidiaries of the first defendant.  He claimed that he had written to those liquidators to ask for documents belonging to the first defendant, even though there was no documentary evidencewhatsoeverplaced before me indicating that he had actually done so.  This was despite express requests for such documentary evidence by the second defendant’s counsel. 82 I did not accept Mr Mahesh’s and Mr Perumal’s belated explanations for not complying with the order that I made on 12 December 2018.  In fact, I found Mr Mahesh’s claim that he did not haveanyof the documents requested by the Liquidator to be rather unbelievable.  This was because he had been able to procure the accountants of the first defendant to produce a set of updated unaudited management accounts of the company for the past four years, which the plaintiff had applied to introduce into evidence in the course of the hearing in June 2019 via SUM 3062/2018.  I dismissed this application for various reasons, including the fact that the accountants were themselves not being called as witnesses to explain these accounts.  More importantly, this was ablatantattempt to circumvent my order of 12 December 2018, pursuant to which I had wanted the Liquidator of the first defendant, an officer of the Court, to carry out this exercise of examining the financial condition of the company, and not Mr Mahesh’s chosen accountants. 83 Given the state of the evidence before me, I found that the plaintiff had not discharged its burden of showing that the first defendant was solvent and able to carry on as a going concern.  This went towards the first of the considerations outlined inPhangChoo Ong([19]supra).  Given my findings, it is not necessary for me to discuss the other considerations inPhangChoo Ong(see [19(b)] and [19(c)] above).",
        "Conclusion": "84 For the reasons set out above, I found that the plaintiff’s application in the OS had no merit.  I accepted that the first defendant did in fact owe the second defendant the sum of US$2m because of a loan extended by the second defendant to the first defendant.  I was unable to accept that the US$2m transaction was part-payment for shares in Raycom.  Even if I was mistaken on this, I noted that the promissory notes and the parlous state of the evidence led by the plaintiff on the financial position of the first defendant left me unconvinced that the company was in fact solvent. 85 Accordingly, there was no basis to stay the winding-up order.  There was also no basis whatsoever to set aside the order.  I therefore dismissed the OS and discharged the interim stay order that I made on 12 December 2018. Ang Cheng HockJudge N K Rajarh, Rajaram Muralli Raja and Kyle Gabriel Peters (K&L Gates Straits Law LLC) for the plaintiff;The first defendant absent and unrepresented;Isaac Tito Shane, Ramesh s/o Varathappan and Jaspreet Kaur Purba (Tito Isaac & Co LLP) for the second defendant."
    }
}