{
    "case_title": "Millennium Pharmaceuticals, IncvZyfas Medical Co (sued as a firm)",
    "ncitation": "[2020] SGHC 28",
    "coram": "Dedar Singh Gill JC",
    "sections": {
        "Background": "3 The plaintiff is a Delaware incorporated company.1Foot Note 1×1st Affidavit of Constance Yeung (“CY”), para 4.The defendant is a Singapore registered partnership and a distributor of generic pharmaceutical, medicinal and healthcare products.2Foot Note 2×Affidavit of Mohamed Tahir dated 16 September 2019, para 7.These include products for the treatment of cancer.3Foot Note 3×Affidavit of Mohamed Tahir dated 16 September 2019, para 8. 4 The plaintiff is the registered proprietor of the following patents (“the Patents”):4Foot Note 4×1st Affidavit of CY, para 8. (a) Singapore Publication No SG 151322;(b) Singapore Publication No SG 182998; and(c) Singapore Application No SG 10201600029P. 5 The Patents are process patents relating to the manufacture of “bortezomib”, a cancer drug for the treatment of multiple myeloma and mantle cell lymphoma.5Foot Note 5×1st Affidavit of CY, para 9. 6 On 1 February 2018, the defendant applied to register a therapeutic product sold under the name “Myborte” (“the Myborte product”) with the HSA.6Foot Note 6×Affidavit of Mohamed Tahir dated 16 September 2019, para 26.Notably, the Myborte product contained the active ingredient bortezomib.7Foot Note 7×1st Affidavit of CY, Tab CY-06.On or around July 2019, the plaintiff discovered that the defendant had obtained registration for the Myborte product.8Foot Note 8×1st Affidavit of CY, para 11. 7 At the time of the declaration to the HSA, bortezomib was itself not covered by any existing product patent in Singapore.9Foot Note 9×Affidavit of Mohamed Tahir dated 16 September 2019, paras 24 and 25.The defendant was of the view that only product patents that were in force in respect of a therapeutic product had to be declared. As a result, the defendant failed to disclose that the Patents were in force. 8 On 11 July 2019, the plaintiff’s solicitors requested a copy of the defendant’s declaration to the HSA.10Foot Note 10×1st Affidavit of CY, para 26.On 24 July 2019, the defendant’s solicitors replied stating that there was no infringement of the Patents and therefore no need to declare the existence of the Patents in the HSA declaration.11Foot Note 11×1st Affidavit of CY, para 27.This led to the plaintiff filing the present summons.",
        "My decision": "9 On 23 October 2019, I granted the following declaration:12Foot Note 12×Order of Court dated 23 October 2019. … that the Defendant's declaration(s) made under regulation 23(2) [of the TPR] omits to disclose matter that is material to its application(s) for registration of its therapeutic product (SIN15736P)… 10 Although the plaintiff initially sought a declaration that the defendant’s declaration contained a “statement that is falseor misleading in a material particular or omits to disclose any matter that is material to the application”, its solicitors accepted that it was sufficient for reg 23(2) of the TPR to be violated if the defendant’s declaration “omitsto disclose matter that is material to its application”.13Foot Note 13×Minute Sheet dated 23 October 2019, p 3.Accordingly, I confined the order to the defendant’s omission. I made no finding on whether the declaration contained a “statement that is false or misleading in a material particular”. 11 The TPR are regulations passed under ss 71 and 72 of the Health Products Act (Cap 122D, 2008 Rev Ed) (“HPA”). The HPA is intended to regulate different types of health products with different regulatory requirements (Singapore Parliamentary Debates, Official Report(12 February 2007, vol 82 at cols 1264 to 1266 (Mr Khaw Boon Wan, Minister for Health) (“HPA Debates 2007”)). Before the HPA, there were four different pieces of legislation on medicines (HPA Debates 2007 at col 1264). 12 The subject of my decision involved reg 23(2) of the TPR, which is substantially similar to the former s 12A(2) of the Medicines Act (Cap 176, 1985 Rev Ed) (“MA”). It was helpful to examine the parliamentary debates on the MA to ascertain the purpose behind the requirement under reg 23(2) of the TPR that an applicant must make a declaration to the HSA that there was a “patent in force in respect of the therapeutic product”. 13  Mr Khaw Boon Wan, then Minister for Health, explained that s 12A was included in the MA to fulfil the obligation under the US-Singapore Free Trade Agreement that no marketing approval be granted to a generic product before the expiration of the patent except with the consent of the patent owner. Section 12A of the MA would enable the HSA to consider the patent status of the product in deciding to grant marketing approval (Singapore ParliamentaryDebates,Official Report(15 June 2004) vol 78 at col 152 (Khaw Boon Wan, Minister for Health).  In my view, reg 23(2) of the TPR, which is substantially similar to s 12A of the MA, serves the same purpose. 14 Regulation 23(2) of the TPR provides: … Unless the [HSA] otherwise determines,the applicant must, at the time of the application and such other time before the determination of the application as the[HSA] may require, make and furnish to the [HSA] a declaration in the form specified on the [HSA’s] website, stating (a)whether a patent under the Patents Act is in force in respect of the therapeutic product; and … [emphasis added] 15 Under s 37(1) of the HPA, the HSA may suspend or cancel the registration if,inter alia, it has reasonable grounds to believe that the registrant of the health product has been obtained by fraud or misrepresentation, or the registrant of the health product has contravened “any other prescribed requirement”. Reg 23(2) of the TPR provides one such prescribed requirement. 16 Under reg 23(3) of the TPR, if the applicant is not the proprietor of the patent in respect of the therapeutic product, it must provide further information in the declaration, such as whether the proprietor of the patent has consented to the grant of the registration of the therapeutic product. Further, reg 23(5) of the TPR provides that an applicant may be required to serve a notice on the proprietor of the patent: (5) Where the applicant is not the proprietor of a patent under the Patents Act that is in force in respect of the therapeutic product, the [HSA] may require the applicant to serve, in accordance with section 67 of the HPA, on the proprietor of the patent, a notice in the form specified on the [HSA’s] website, and within such time as the [HSA] may determine, if – (a) the applicant has declared that, in the applicant’s opinion and to the best of the applicant’s belief, the patent is invalid or will not be infringed by the doing of the act for which the registration is sought; or (b) the Authority considers it appropriate in any particular case for the applicant to do so. 17 Where an applicant makes a declaration under reg 23(2) of the TPR that is “false or misleading in a material manner or omits to disclose any matter that is material to the application”, an interested person may apply to the HSA to cancel the registration of the therapeutic product. Regulation 24 of the TPR, which is the relevant provision for cancellation, provides: Cancellation of registration of therapeutic product subject to patent dispute 24.—(1)  Without prejudice to the generality of section 37(1) of the Act, the [HSA] may, upon an application by any interested person, cancel the registration of a therapeutic product, if the [HSA] is satisfied — (a) that — … (ii) a court has determined that the declaration made under regulation 23(2) contains a statement that is false or misleading in a material particular or omits to disclose any matter that is material to the application;… [emphasis added] 18 During the hearing, the defendant’s solicitor, Mr Wong Siew Hong (“Mr Wong”), conceded that the requirement under reg 23(2)(a) of the TPR for applicants to disclose “whether a patent under the Patents Act is in force in respect of a therapeutic product” included the disclosure of existingprocesspatents in respect of the therapeutic product.14Foot Note 14×Minute Sheet dated 23 October 2019, p 3.This was a concession rightly made in light of theex temporedecision of the Court of Appeal inMillennium Pharmaceuticals, Inc v Drug Houses of Australia Pte Ltd and another appeal[2019] SGCA 31 at [3]: [t]he Respondent avers that its product does not infringe theprocessesprotected by the Appellant’s patents and therefore the patents had no relevance to the product and there was no need to declare them to the HSA. However, that is not a course of action which the Respondent can choose to take.Ithas to declare the patents and then state, among several possibilities, that the patents are invalid and will not be infringed by the doing of the act for which the registration of its product is sought. It is then for HSA to decide whether to invoke reg 23(5) of the TPR to require the Respondent to serve the requisite notice on the Appellant. [emphasis added] 19  Mr Wong also accepted that the existence of the Patents was “a matter that [was] material to the defendant’s application” under reg 24(1)(a)(ii) of the TPR. Hence, the only issue arising for my determination was whether the defendant hadomittedto disclose the existence of the Patents. The answer to this turned on the following question of interpretation: whether an operative omission under reg 24(1)(a)(ii) of the TPR requires that the defendantknowinglyorintentionallyomits to state the existence of relevant patents. 20 The defendant submitted that, in determining whether the declaration omitted to disclose any matter that was material to the application, the court must examine the defendant’s knowledge or intention at the time the declaration was made.15Foot Note 15×Defendant’s submissions, para 30.The plaintiff contended that there was no requirement under reg 24(1)(a)(ii) of the TPR that the defendant mustintentionallyorknowinglyomit to disclose any matter that was material to the application. 21 The governing provision on the interpretation of statutes, s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed) (“IA”), provides that “[i]n the interpretation of a provision of a written law, an interpretation that would promote the purpose or object underlying the written law… shall be preferred to an interpretation that would not promote that purpose or object”. “Written law” is defined under s 2 of the IA to include subsidiary legislation made under an Act. The purposive approach to interpretation under s 9A of the IA therefore applies to the TPR. When the court is undertaking a purposive interpretation of a text, it should first begin by ascertaining the possible interpretations of the text as it has been enacted. This, however, should never be done in isolation but with due regard to the context of the text within the written law as a whole (Zainudinbin Mohamed v Public Prosecutor[2018] 1 SLR 449 at [25] citing Sundaresh Menon CJ inAttorney-General v Ting Choon Meng and another appeal[2017] 1 SLR 373 (“Ting Choon Meng”) at [59]). 22 Analysing reg 24(1)(a)(ii) of the TPR in isolation, it is clear that there is nothing in the provision requiring the mental elements of knowledge or intention. Having regard to the principle that a provision is to be interpreted in relation to the context of the provision within the written law as a whole (Ting Choon Mengat [59]), I considered the neighbouring provision, reg 25 of the TPR. Unlike reg 24(1)(a)(ii) of the TPR, reg 25explicitlyreferred to mental elements.  23 Regulation 25 of the TPR provides: Offences for making false patent declaration 25.A person who, when making a declaration under regulation 23(2) – (a) makes any statement or furnishes any document which the personknowsor hasreason to believeis false in a material particular; or (b) by theintentional suppressionof any material fact, furnishes information which is misleading… shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 12 months or to both. [emphasis added] 24 There is a clear difference between the language of regs 24(1)(a)(ii) and 25 of the TPR. The absence of references to words like “knows”, “intention” or “reason to believe” in reg 24(1)(a)(ii) shows that the provision doesnotrequire that a personknowinglyorintentionallyomit any matter material to the application. 25 Further, the difference in the language between regs 24 and 25 of the TPR is justified on the basis of their respective purposes. Regulation 24 of the TPR, as I have pointed out above at [17], is the means by which an interested person couldcancelthe registration of a therapeutic product. This is evident from the title of the provision, which states “[c]ancellation of registration of therapeutic product subject to patent dispute”. Regulation 24 of the TPR is therefore intended as anadministrativeprocess by which a registered therapeutic product could be cancelled. It makes inherent sense that the provision for cancellation does not require proof of an intentional or knowing act of omission. Indeed, this is what the provision plainly provides. Contrarily, reg 25 of the TPR is anoffence-creating provision that makes an offender liable on conviction to a “fine not exceeding $20,000 or to imprisonment for a term not exceeding 12 months or to both”. It is clear that the intention is to impose criminal liability, with the attendant consequences of a fine or term of imprisonment, only where the person knew or had reason to believe that a statement is false in a material particular, or where he intends to suppress a material fact. 26 I therefore preferred the plaintiff’s interpretation. All that the plaintiff was required to show was that the defendant had failed to disclose any matter that was material to its application. As there was no dispute that the defendant had failed to indicate in its declaration to the HSA that the Patents were in force, and given that Mr Wong had conceded that this was “material” for the purposes of the TPR, I granted the plaintiff the declaration sought. Dedar Singh GillJudicial Commissioner Suhaimi bin Lazim and Yan Chongshuo (Mirandah Law LLP) for the plaintiff;Wong Siew Hong and Kuek Kai Liang (Eldan Law LLP) for the defendant."
    }
}