{
    "case_title": "Goodwood Associates Pte Ltd vSouthernpec (Singapore) Shipping Pte Ltd and another suit",
    "ncitation": "[2020] SGHC 242",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 In these proceedings, Goodwood Associates Pte Ltd (“Goodwood”) claims against Southernpec (Singapore) Pte Ltd (“SPPL”), the purchaser under two contracts of sale of fuel oil dated 2 July 2015 (the “July Contracts”), for the purchase price of the fuel oil. Also, Goodwood claims against Southernpec (Singapore) Shipping Pte Ltd (“SPSPL”), the guarantor under a guarantee granted in favour of Goodwood dated 1 June 2015 (the “SPSPL Guarantee”) for the payments due from SPPL under the July Contracts. The positions of SPPL and SPSPL are aligned, and I shall refer to them collectively as “Southernpec”. 2 Denying liability, Southernpec contends that the July Contracts are shams. Further, Southernpec claims against Goodwood, Mr Lee Soek Shen (“Mr Lee”) and Mr Andrew Lim Boon Leong (“Mr Lim”) for engaging in lawful and unlawful means conspiracy with three other non-parties, to make legal claims on the false premise that the July Contracts are genuine. 3 While Goodwood’s claims are straightforward ones based on contract, Southernpec’s allegations concern fraud and deception, with the July Contracts being part of a wider web of fictitious transactions. Therefore, at the heart of the dispute is the question whether the July Contracts are sham transactions. Having considered the evidence and the submissions of all the parties, this is my decision.",
        "Background": "",
        "The parties and other personalities": "4 Goodwood is a Singapore-incorporated company involved in the wholesale of petrochemical products. Mr Lee is its sole director and shareholder.1Foot Note 1×Affidavit of Evidence in Chief (“AEIC”) of Lee Soek Shen (“Lee”) at para 2He is also a director of New Silkroutes Group Limited, formerly known as Digiland International Limited (“Digiland”),2Foot Note 2×Lee’s AEIC at para 21.a publicly listed company in which Goodwood has a substantial shareholding (ranging from 6.85% to 14.83% from sometime between 2015 and 2017).3Foot Note 3×29th Agreed Bundle (“29AB”) at pp 18048, 18148 and 18262. 5 Mr Lim was the Head of the Oil Trading Division of International Energy Group Pte Ltd (“IEG”), a wholly owned subsidiary of Digiland and its oil and gas trading arm.4Foot Note 4×Lee’s AEIC at paras 17 to18.He was responsible for cultivating and maintaining relationships with trading counter-parties, negotiating spot and term contracts, and ensuring the successful execution of IEG’s trades.5Foot Note 5×Andrew Lim’s AEIC (“Andrew’s AEIC”) at paras 4 to 5. 6 As for SPPL and SPSPL, they are Singapore-incorporated companies which are part of a group of companies headquartered in the People’s Republic of China. SPPL is engaged in the business of ship bunkering and the sale of petrochemical products while SPSPL is in the business of owning ships, chartering, and oil storage.6Foot Note 6×Xu Qiuxiong’s AEIC (“Xu’s AEIC”) at para 7.Mr Xu Qiuxiong (“Mr Xu”) is a director of both SPPL and SPSPL, while SPPL’s Fuel Oil Trading Manager is Mr Jason Wu Jian Cai (“Mr Wu”).7Foot Note 7×Lee’s AEIC at para 14; AEIC of Jason Wu Jian Cai (“JW”) at para 1",
        "Events leading to the July Contracts": "Goodwood’s account – Credit sleeving trades of fuel oil 7 The events leading to the July Contracts, as well as the nature of these agreements, are disputed. This is Goodwood’s account given by Mr Lee.8Foot Note 8×Lee’s AEIC at paras 41 and 51. 8 Sometime after Goodwood was incorporated in August 2014, Mr Lee directed its Senior Operations Manager, Mr Lim Yew Piow (“Mr Lim Y P”), to register as a trading counter-party with SPPL to facilitate future trading between the two companies.9Foot Note 9×Lee’s AEIC at para 24. 9 Then, sometime in March 2015, Mr Lim informed the management of Digiland and IEG that SPPL wanted to purchase fuel oil from BMS United Bunkers (Asia) Pte Ltd (“BMS”), another oil trading company, but was unable to do so because SPPL did not have a trading credit limit with BMS.10Foot Note 10×Lee’s AEIC at para 27.Mr Lim suggested that Digiland and IEG get involved as intermediaries to purchase fuel oil from BMS, as Digiland was a publicly-listed company and was therefore able to secure a trading credit limit with BMS. Digiland could transfer its trading credit limit to IEG after securing it with BMS.11Foot Note 11×Lee’s AEIC at para 28.However, Digiland realised that the trading credit limit of US$5m extended by IEG and Digiland to SPPL had been exhausted by previous trades. Therefore, it was proposed that Goodwood would be involved as another intermediary. Goodwood’s role would be to purchase fuel oil from IEG/Digiland (which in turn would buy the fuel oil from BMS), and sell it on to SPPL, in exchange for a fee.12Foot Note 12×Lee’s AEIC at para 29. 10 Due to the credit risks involved, Goodwood required a corporate guarantee from SPPL’s parent company, Southernpec Corporation, before it would agree to act as an intermediary.13Foot Note 13×Lee’s AEIC at para 31.This, according to Mr Wu, was a “customary” practice to “supportactualpurchases” (emphasis added).14Foot Note 14×JW’s AEIC at para 15.Thereafter, Southernpec Corporation and SPSPL each executed a guarantee of US$5m in favour of Goodwood (the latter of which is the SPSPL Guarantee dated 1 June 2015). 11 With the guarantees in place, Goodwood entered into two transactions to buy 1,500 MT and 1,700 MT of fuel oil from BMS through IEG to sell the same to SPPL on 10 June 2015 (the “June Contracts”), followed by the two transactions to buy 2,000 MT and 1,200 MT of fuel oil from BMS through Digiland to sell the same to SPPL on 2 July 2015 (as documented by the July Contracts). The key terms of the July Contracts are set out at [38] below. 12 In these transactions, Mr Lim Y P represented Goodwood, and dealt with Mr Wu of SPPL. Mr Lim represented IEG, and Mr Lim Koon Hock (“Mr Lim K H”), the former chief financial officer of Digiland, represented Digiland.15Foot Note 15×Lee’s AEIC at paras 43 and 54.Mr Lim was not an employee of Goodwood; nor was he an agent of Goodwood.16Foot Note 16×Lee’s AEIC at paras 17 and 141. 13 Thus, Goodwood played a limited role as an intermediary or “credit sleeve” to facilitate the sales of fuel oil between BMS and SPPL for a margin of US$3 per MT. Goodwood only knew of the involvement of BMS, IEG (for the June Contracts) and Digiland (for the July Contracts as Goodwood’s procurement agent), Goodwood itself, and SPPL. Mr Lee did not know the reason for SPPL entering into the deals or what it would be using the fuel oil for. Such credit sleeving transactions are routine in the industry.17Foot Note 17×Lee’s AEIC at paras 41 and 51. 14 In accordance with the July Contracts, Goodwood duly performed its obligations to SPPL. This is based on inter-tank transfers supported by inter-tank transfer certificates (the “ITT certificates”) and cargo release notices (the “CRNs”) issued by SPSPL (which I shall describe in more detail at [19]-[20] below). Southernpec’s account – Circular fictitious trades of non-existent fuel oil 15 According to Mr Wu, however, in May 2015, Mr Lim spoke to him about the possibility of doing fictitious “paper” deals in fuel oil, purportedly to help improve Goodwood’s revenue figures. Mr Wu brought the matter up to Mr Xu, who agreed to do so.18Foot Note 18×JW’s AEIC at paras 18 and 19.This was because Mr Xu and Mr Wu had enjoyed a good working relationship with Mr Lee, Mr Lim and Dr Goh Jin Han (“Dr Goh”), the director and chief executive officer of Digiland, when the latter three were involved with another oil trading company IAG-Pacific Petroleum Pte Ltd.19Foot Note 19×JW’s AEIC at paras 6 to 10. 16 To that end, Mr Lim came up with a scheme involving a circular series of fictitious trades (the “Scheme”) with BMS on board.20Foot Note 20×JW’s AEIC at para 71.In particular, Mr Lim introduced Mr Mohammad Arif bin Abdol Rahman (“Mr Arif”), a BMS bunker oil trader, who, according to Mr Wu, would “handle day-to-day running of the Scheme for BMS” with the blessing of his superior, Mr George Markos Kounalakis (“Mr Kounalakis”), the managing director of BMS.21Foot Note 21×JW’s AEIC at para 73. 17 As Mr Wu understood it, the Scheme was intended to comprise a circular chain of “back-to-back sales” ofnon-existent“fuel oil” from one entity in the chain to another lower down the chain. To start the chain, BMS would provide actual funds to Universal Alliance Limited (“UA”), another oil trading company, which would then use the funds to make payment to the next fictitious “sub-seller” above it in the chain for an ostensible purchase of fictitious fuel oil, until the funds found their way back to BMS.22Foot Note 22×JW’s AEIC at para 21. (1) The June Arrangements 18 Pursuant to the Scheme, two series of transactions were structured in June 2015 for 1,500 MT and 1,700 MT of fuel oil (the “June Arrangements”) as described graphically below.   19 These transactions were supported by ITT certificates which on their face confirmed that the fuel oil transacted had been physically transferred from one ship tank to another aboard the same fuel-storage vessel. As the fuel oil transacted was stored aboard a vessel, the MTMarine Star, which was owned and operated by SPSPL, the ITT certificates were issued by SPSPL. Another supporting document was a CRN for each transaction on SPPL’s letterhead which represented that the volume of fuel oil traded was being held in SPPL’s lawful possession. The various transactions in the June Arrangement were duly executed and performed without any issues, including the June Contracts between Goodwood and SPPL.23Foot Note 23×Lee’s AEIC at para 45. (2) The July Arrangements 20 The parties then entered into another two series of transactions in July 2015 for 2,000 MT and 1,200 MT of fuel oil (the “July Arrangements”) as described graphically below. Similar to the June Arrangements, these transactions were supported by ITT certificates and CRNs in the same form as those described in the preceding paragraph, save that the vessel in question was MTStar Bright.Another counterparty, Taigu (Singapore) Energy Pte Ltd (“Taigu”), was also involved.  (3) The nature of the July Contracts 21 In relation to the July Contracts, it is Southernpec’s position that at all material times, Goodwood and Mr Lee well knew that while ostensibly purporting to be agreements for the sale and purchase of fuel oil, these were in fact façades. Mr Lim, who orchestrated the Scheme including the use of fictitious documents, was an employee of Goodwood, or an agent of Goodwood and Mr Lee. Indeed, all the parties knew of the details of the June and July Arrangements.24Foot Note 24×JW’s AEIC at para 21.All the transactions were done pursuant to the Scheme for the transmission of money once received (with BMS providing the cash upfront to UA to fund the chain of transactions for some unknown benefit) so as to artificially improve the reported financial performance of Goodwood.25Foot Note 25×JW’s AEIC at paras 23 and 24.There was no trading in fuel oil at all. Indeed, the fuel oil was “non-existent”.26Foot Note 26×JW’s AEIC at paras 25 and 31.Therefore, the July Contracts were not enforceable. Mr Lim’s account – Circular sleeving trades of fuel oil 22 According to Mr Lim, he introduced Mr Wu to Goodwood, BMS and UA. In turn, Mr Wu introduced Taigu to UA. Represented by their own employees, the parties then separately entered into the trades on their own accord in relation to the fuel oil on board vessels owned and operated by SPSPL.27Foot Note 27×Lim’s AEIC at para 8.Mr Lim was merely the introducer; he was not an employee of or agent for Goodwood or Mr Lee.28Foot Note 28×Lim’s AEIC at paras 16 and 17Admittedly, there was circularity to the June and July Arrangements (as set out in the diagrams above). However, these were not fictitious transactions. The transactions were credit sleeving trades of fuel oil owned by SPPL (for which title to the fuel oil passed without any physical delivery of the goods).29Foot Note 29×Lim’s AEIC at paras 20 and 24.",
        "Default on the payment obligations in the July Contracts": "23 From the documents produced at the trial, it would appear, as Southernpec contends and Mr Lim admits, that the June and July Contracts formed part of the June and July Arrangements. I pause to make three observations on the structure of the arrangements. First, the arrangements involved real, and not merely apparent, profits for each party (except UA) in the chain. Second, UA obtained the benefit ofimmediatecash from BMS, but needed to pay a substantial premium to SSPL/Taigu within 26–27 days. While it is not entirely clear what UA’s commercial reasons for entering into the transactions were, this is not relevant to the issues at hand. Third, the fuel oil in question (if in existence) originated with SPPL and remained with SPPL. 24 In any event, in relation to the July Arrangements, UA defaulted on its payment to Taigu, which in turn did not pay SPPL.30Foot Note 30×Xu’s AEIC at para 45.This led to SPPL’s default on its payment obligations to Goodwood under the July Contracts. Nonetheless, Southernpec asserts that the July Contracts are not enforceable. Goodwood, however, completely disavows knowledge of the July Arrangements (and no knowledge of the Scheme). In fact, BMS was duly paid by Digiland (on behalf of Goodwood as its procurement agent) on 27 August 2015.31Foot Note 31×3AB at pp 1782 to 1783.Having set out the essence of the dispute, I turn to the parties’ cases.",
        "The parties’ cases": "",
        "Suit 51 of 2016": "25 Suit 51 of 2016 (“S 51”) was commenced by Goodwood on 19 January 2016. Goodwood pleads the following claims: (a)  Goodwood had duly performed its obligations under the July Contracts. It had duly delivered 2,000 MT and 1,200 MT of fuel oil to SPPL via inter-tank transfers on 3 July 2015 and 8 July 2015 respectively.32Foot Note 32×Statement of Claim (Amendment No 2) (“SOC2-S51”) at paras 16C and 17.Goodwood relied on the ITT certificates issued by SPSPL which represented that the volumes of fuel oil stated therein (ie,2,000.380 MT and 1,200.627 MT) had taken place as described therein.33Foot Note 33×SOC2-S51 at para 16F to 17; 3AB at pp 1472 and 1481. (b) Goodwood also relied on the CRNs issued by SPPL which stated that the volumes of fuel oil were being held in SPPL’s lawful possession.34Foot Note 34×SOC2-S51 at para 16E. (c) Goodwood is entitled to payment of the sums owed under the July Contracts, as well as late payment interest as agreed under cl 8 of the July Contracts,ie, 5% above the one-month London Interbank Offered Rate (“LIBOR”) for US dollars on the day when payment was due from SPPL.35Foot Note 35×SOC2-S51 at para 19. (d) SPSPL is liable under the SPSPL Guarantee to satisfy SPPL’s liabilities under the July Contracts.36Foot Note 36×SOC2-S51 at para 20. (e) In the alternative, SPSPL is liable for fraudulent or negligent misrepresentation in that Goodwood had relied on false documents prepared by SPSPL, namely the ITT certificates and CRNs, to perform its obligations by arranging for payments to its supplier for the fuel oil falsely attested in those documents.37Foot Note 37×SOC2-S51 at paras 23 to 31. 26 SPSPL asserts, in its defence, that the July Contracts were sham transactions supported by sham documents (ie, the ITT certificates and CRNs issued by SPSPL), and accordingly did not have any legal effect.38Foot Note 38×Defence and Counterclaim (Amendment No 2) in Suit 51 (“DCC2-S51”) at para 17.SPSPL raises the following points: (a) Mr Lim was an employee and/or agent of Goodwood, and operated on the instructions of and/or authorisation of Goodwood and Mr Lee at all times.39Foot Note 39×DCC2-S51 at para 9.It was Mr Lim who had involved SPPL in the sham or fictitious July Arrangement40Foot Note 40×DCC2-S51 at paras 14 and 17.in order to artificially increase Goodwood’s sales and revenue numbers.41Foot Note 41×DCC2-S51 at para 16.These sham transactions were supported by fictitious ITT certificates and CRNs created under Mr Lim’s direction on the instructions or consent of Goodwood and Mr Lee.42Foot Note 42×DCC2-S51 at para 17. (b) The sales of fuel oil under the July Arrangements did not resemble an authentic sale for petrochemical products by way of ITT. In such sales, there would be instructions from the owner of the fuel oil to the operator of the vessel or terminal to perform the ITT; the ITT certificates and CRNs would specifically identify the seller and buyer for the particular sale and purchase transaction; and there would be a physical inspection made of the goods sold and purchased by an independent quantity surveyor before payment is made. Furthermore, the precise chemical properties of the fuel oil transacted would be stated, instead of a broad and generic reference to “fuel oil”.43Foot Note 43×DCC2-S51 at para 22(1). 27 SPSPL also denies that it had misrepresented the validity of the ITT certificates and CRNs to Goodwood as Goodwood knew, at all times, that those documents were sham documents.44Foot Note 44×DCC2-S51 at paras 17, 27C(2)-(4). 28 In response to this, Goodwood and Mr Lee deny that Mr Lim was an employee or agent.45Foot Note 45×Goodwood and Lee’s Reply and Defence to Counterclaim (Amendment No 2) in Suit 51  (“GLRDCC2-S51”) at para 5.They also assert that they were not aware of and were not parties to any scheme to enter into the allegedly sham July Contracts,46Foot Note 46×GLRDCC2-S51 at para 5E.nor were they aware of the dealings between BMS, UA, Taigu and SPPL, or any other dealings between Mr Lim and SPPL.47Foot Note 47×GLRDCC2-S51 at para 6. 29 Goodwood and Mr Lee also plead that Goodwood had entered into the July Contracts for a legitimate commercial purpose,ie, acting as an intermediary between BMS and SPPL for the sale of fuel oil by BMS to SPPL and taking on the credit risk of transacting with SPPL in exchange for a fee of US$3 per MT of fuel oil. In this process, Digiland was used a procurement agent (also earning a margin of US$3 per MT of fuel oil).48Foot Note 48×GLRDCC2-S51 at para 8. 30 SPPL was estopped by its own representations, conduct, or convention, or precluded by its own illegality, from asserting that the ITT certificates were false, that the ITT certificates did not certify the delivery of fuel oil under the July Contracts, that SPPL was not the legal holder of the fuel oil, and/or that the July Contracts were not valid, genuine and legally enforceable.49Foot Note 49×GLRDCC2-S51 at para 5E(b).Goodwood and Mr Lee also deny that they were involved in the issuance of the ITT certificates, and asserted that they were not in a position to verify whether any inter-tank transfers had, in fact, taken place.50Foot Note 50×GLRDCC2-S51 at para 13.Furthermore, Goodwood and Mr Lee aver that “it is not unheard of” for a sales contract to specify the product being sold as “fuel oil”, as a shorthand for low viscosity and low sulphur fuel oil.51Foot Note 51×GLRDCC2-S51 at para 20. 31 Additionally, on 16 November 2017, SPSPL introduced counterclaims against Goodwood, Mr Lee and Mr Lim for lawful and unlawful means conspiracy. For unlawful means conspiracy, the basis was that from or around 25 August 2015, Mr Lee, Mr Lim, Goodwood and others communicated with each other to take the common unlawful stand that fictitious “chain sale transactions” under the July Arrangements consisted of a series of genuine transactions between parties, thereby combining together to make legal claims or employ civil processes against SPPL and SPSPL which were scandalous, frivolous, vexatious and in abuse of process of the court.52Foot Note 52×DCC2-S51 at para 39. 32 For lawful means conspiracy, SPSPL counterclaims against Goodwood, Mr Lee and Mr Lim for acting with others to make legal claims against SPPL which were scandalous, frivolous, vexatious and in abuse of process of the court with the sole or predominant intention of injuring SPSPL.53Foot Note 53×DCC2-S51 at para 43.The allegations of conspiracy are flatly denied by Goodwood and Mr Lee,54Foot Note 54×GLRDCC2-S51 at paras 32 to 33 and 48.as well as by Mr Lim.55Foot Note 55×Andrew Lim’s Defence to Counterclaim (Amendment No 1) in Suit 51 (“ALDCC1-S51”) at paras 20 and 24.",
        "Suit 1245 of 2015": "33 Originally, Suit 1245 of 2015 (“S 1245”) was commenced on 4 December 2015 by BMS against SPPL for the purchase price of a separate parcel of 2,200 MT of fuel oil. Goodwood was not involved in this transaction. In response, SPPL claimed that this transaction was also a sham. As such, on 14 March 2016, SPPL counterclaims against BMS, Mr Kounalakis, Mr Arif, Goodwood, Mr Lee and Mr Lim for,inter alia,lawful and unlawful means conspiracy to injure SPPL. On 16 November 2016, BMS’s claim, as well as SPPL’s counterclaim against BMS, Mr Kounalakis and Mr Arif, were settled. 34 Nonetheless, SPPL maintains its counterclaim against Goodwood, Mr Lee and Mr Lim for engaging in lawful and unlawful means conspiracy (together with BMS, Mr Kounalakis and Mr Arif) on the same grounds as that mentioned at [31]–[32] above.56Foot Note 56×SPPL’s Counterclaim (Amendment No 2) in Suit 1245 (“CC2-S1245”).SPPL’s claims are flatly denied by Goodwood and Mr Lee,57Foot Note 57×Goodwood and Lee’s Defence to Counterclaim (Amendment No 1) and Counterclaim by the 4th Defendant in Suit 1245 (“GLDCC1-S1245”) at paras 51 and 65.as well as by Mr Lim.58Foot Note 58×Andrew Lim’s Defence to Counterclaim (Amendment No 2) in Suit 1245 (“ALDCC2-S1245”) at paras 19 and 22. 35 Then, on 26 October 2018, Goodwood counterclaims against SPPL for the purchase price based on the July Contracts, or alternatively based on the fraudulent and negligent misrepresentation (as set out in [25(e)] above in relation to the equivalent claim against SPSPL).59Foot Note 59×GLDCC1-S1245 at paras 71 and 75.",
        "Issues to be determined": "36 The following issues which arise for determination shall be dealt with in turn: (a) Whether the July Contracts are sham transactions; (b) If not, whether the July Contracts were duly performed by Goodwood; (c) Alternatively, whether SPPL and SPSPL are liable for fraudulent or negligent misrepresentation; (d) Whether the SPSPL Guarantee covered any liability arising out of the July Contracts; and (e) Whether Southernpec’s claims in the tort of lawful means conspiracy and/or unlawful means conspiracy against Goodwood, Mr Lee and Mr Lim are made out on the facts. 37 Should any of the claims be allowed, the quantum of damages to be awarded.",
        "Whether the July Contracts are sham transactions": "",
        "The July Contracts": "38 On the issue of whether the July Contracts are sham transactions, I begin by setting out more details about these agreements. Each of the July Contracts comprises 18 pages with 22 clauses. In each of them, the material terms are as follows:60Foot Note 60×3AB at pp 1470 to 1477 (1,200 MT); pp 1479 to 1486 (2,000 MT). (a) clauses 1 and 2 designate Goodwood as the “seller” of the “product” and SPPL the “buyer”; (b) clause 3 describes the “product” as “fuel oil” without more; (c) clause 5 states the “transfer date range”, being 3 to 4 July 2015 for the sale of the 2,000 MT of fuel oil; and 8 to 9 July 2015 for the sale of 1,200 MT of fuel oil; (d) clause 6 describes the quality and quantity of the fuel oil to be delivered to be as “per Inter-Tank Transfer (ITT) certificate and Quality Analysis Report”; (e) clauses 4 and 7 set the quantities of fuel oil to be transacted at 2,000 MT and 1,200 MT at the price of US$466 per MT; (f) clause 8 provides that Goodwood’s invoice shall be based on the ITT certificates and the price of US$466 per MT, and payment shall be 28 days from the ITT date. While delivery documents may be provided to SPPL if requested, payment is not conditional upon receipt of such documents. 39 Taken together, these clauses show that the July Contracts are, ostensibly at least, written commercial agreements for the sale of fuel oil (as generically described) at a stipulated price of US$466 per MT. I note that the exact grade of “fuel oil” is not specified in cl 3, and I shall return to this later at [84]–[87]. Despite this, however, in my judgment, the July Contracts remain sufficientlycertainbecause the lack of any specification of the fuel oil does not mean that the contract cannot be performed. All it means is thatany“fuel oil” delivered as per the ITT certificate would suffice. I also do not think that the reference to a “Quality Analysis Report” is a term that stipulates the quality of the fuel oil to be delivered. The lack of any objective quality requirement in the July Contracts against which the results of such a report could be compared renders any interpretation to that effect illogical. Consequentially, my view is also that the absence of any “Quality Analysis Report” issued is not detrimental to Goodwood’s position that the July Contracts have been duly performed (a point to which I return at [115] below). 40 The July Contracts give rise to a very strong presumption that both Goodwood and SPPL intended thereby to create legal relations by way of these documents. The onus of rebutting this very strong presumption rests on the party asserting the contrary:ChngBee Kheng and another (executrixes and trustees of the estate of Fock Poh Kum, deceased) v Chng Eng Chye[2013] 2 SLR 715 (“ChngBee Kheng”) at [51]; Andrew Phang Boon Leong (gen ed),The Law of Contract in Singapore(Academy Publishing, 2012) (“Phang”) at para 05.020, citingEdwards v Skyways Ltd[1964] 1 WLR 349 at 355. If successfully rebutted, the July Contracts would not be valid and enforceable contracts. 41 In the present case, as SPPL and SPSPL are the parties asserting that the July Contracts do not give rise to legally enforceable rights, they bear the burden of displacing this strong presumption. In order to do so, Southernpec seeks to characterise the July Contracts as “sham transactions”61Foot Note 61×Joint Closing Submissions of Southernpec (Singapore) Pte Ltd and Southernpec (Singapore) Shipping Pte Ltd (“SPCS”) at para 117.which neither Goodwood nor SPPL intended to be enforceable. Before delving into the evidence relied on by Southernpec, I first turn to the applicable legal principles.",
        "The law on sham transactions": "42 All parties relied on the classic definition of a sham transaction laid down by Diplock LJ inSnook v London and West Riding Investments Ltd[1967] 2 QB 786 (“Snook”) at 802, which was cited with approval by the High Court inTKM (Singapore) Pte Ltd v Export Credit Insurance Corp of Singapore Ltd[1992] 2 SLR(R) 858 at [45] as follows: As regards the contention of the plaintiff that the transactions between himself, Auto Finance and the defendants were a ‘sham’, it is, I think, necessary to consider what, if any, legal concept is involved in the use of this popular and pejorative word. I apprehend that, if it has any meaning in law, it means acts done or documents executed by the parties to the “sham” which are intended by them to give to third parties or to the court the appearance of creating between the parties legal rights and obligations different from the actual legal rights and obligations (if any) which the parties intend to create. But one thing, I think, is clear in legal principle, morality and the authorities (seeYorkshire Railway Wagon Co. v. MaclureandStoneleigh Finance Ltd. v. Phillips), thatfor actsor documents to be a “sham”, with whatever legal consequences follow from this, all the parties thereto must have a common intention that the acts or documents are not to create the legal rights and obligations which they give the appearance of creating.No unexpressed intentions of a “shammer” affect the rights of a party whom he deceived.There is an express finding in this case that the defendants were not parties to the alleged “sham”. [emphasis added] 43 In other words, a sham transaction must involve a common intention to mislead:ChngBee Khengat [52]. Further, in determining whether a transaction is a sham, the court will not confine itself to the transaction itself, but will also consider the underlying substance of a wider series of transactions in which the transaction in question is a part:W T Ramsay Ltd v Inland Revenue Commissioners[1982] AC 330 (“Ramsay”). As Lord Wilberforce said at 323–324: Given that a document or transaction is genuine, the court cannot go behind it to some supposed underlying substance. This is the well-known principle ofInland Revenue Commissioners v. Duke of Westminster[1936] A.C. 1. This is a cardinal principle but it must not be overstated or overextended. While obliging the court to accept documents or transactions, found to be genuine, as such, it does not compel the court to look at a document or a transaction in blinkers, isolated from any context to which it properly belongs.If it can be seen that a document or transaction was intended to have effect as part of a nexus or series of transactions, or as an ingredient of a wider transaction intended as a whole, there is nothing in the doctrine to prevent it being so regarded: to do so is not to prefer form to substance, or substance to form. It is the task of the court to ascertain the legal nature of any transaction to which it is sought to attach a tax or a tax consequence and if that emerges from a series or combination of transactions, intended to operate as such, it is that series or combination which may be regarded. [emphasis added] 44 In my view, a circular chain of transactions such as the July Arrangement, like the tax avoidance scheme inRamsay, calls for a wider scope of analysis beyond the individual component transactionsiethe July Contracts. However, circular chains of transactions are notipso factoshams:TowerMCashback LLP 1 and another v Revenue and Customs Commissioners[2011] 2 AC 457 at [77]. 45 In fact, this is illustrated in a case relied on by Goodwood and Mr Lee ofGarnacGrain Co. Inc v HMF Faure and Fairclough Ltd[1966] 1 QB 650 (“GarnacGrain”), which concerned a genuine circular chain of four back-to-back contracts for the sale and purchase of lard. Of this circular chain, Megaw J observed at 679 as follows: … this was a series of transactions between independent traders who acted in concert so as to secure mutual benefits, and in the course of securing such advantages they were prepared to finance [A], from whom the products which were to be exported came. … The method of trading which the participants adopted was a series of sales, each at an enhanced price, to give the traders a profit. They could, of course, have adopted other methods, but they were entitled, if they chose, to adopt this method of a series of sales and purchases. No doubt normally it was not expected that any delivery of documents would take place until the final export sale, but, on the documents, there plainly was a right in the respective purchasers to demand delivery of documents. 46 Megaw J went on to say, at 683–684, that: No doubt it was contemplated by all parties to all four contracts that if all went well those who knew themselves to be intermediate parties, that is, both buyers and sellers, would not insist upon handling the shipping documents but differences in price would be settled in account. The actual property in the goods would never pass to them and the contracts would not be performed according to their terms. No doubt, [A] and [D], who knew that the contracts formed a circle, contemplated that if all went well no documents would be delivered at all and no lard shipped pursuant to any of the contracts.… The mere fact that [A] and [D] expected all to go well, that there would in fact be no insolvency and that none of the parties to the circle of contracts would insist upon delivery of documents or shipments of the goods under their contracts because in the absence of insolvency there would be no business reason for doing so, does not affect their legal rights under the contracts. … To [affect the parties’ legal rights under the contracts] it isnecessary to go further and to show that the parties really made some otherand different contract between them and agreed that the ostensible contract should not give rise to legally enforceable rights or liabilities. [emphasis added] 47 For the purposes of theSnooktest, it seems to me necessary to distinguish between circular trading transactions in whichno deliveryof the subject-matter commodity is contemplated and those in whichno tradingin any subject-matter commodity is contemplated at all. In the first scenario, the parties fully intend the legal title in the subject-matter commodity to pass through the various parties in the circular chain of transactions. The intention to be bound to the various trade contracts constituting the circular chain is therefore present. In contrast, in the second scenario, the parties do not intend to trade in any commodity at all. They do not intend to take legal title in the subject-matter commodity, and do not intend the creation of any legal obligation to pay for the trades in the subject-matter commodity. The entire circular series of transactions, therefore, is nothing more than fiction. This is, in fact, Southernpec’s characterisation of the July Arrangements. 48 I should add that nothing in what I have said should be taken to be an endorsement of circular trades infictitiouscommodities. In my judgment, there may be nothing uncommercial in parties seeking to make arbitrage profits or brokerage fees by exploiting the rapid and often capricious ebbs and flows of the commodities market as long as they trade ingenuinecommodities, albeit in a circular fashion. It is an entirely different matter if the parties seek to manipulate their reported financial performance by purporting to trade in commodities which in fact do not exist, or which the parties know are not available for tradingegcommodities which are legally owned bynoneof the parties to the trading arrangement. Accordingly, if any party to a circular trading arrangement has such knowledge at the time the relevant trades are entered into, this is, in my view,prima facieevidence of his knowledge of a sham trading arrangement. 49 Applying the principles set out above to the present case, it is in my view necessary for Southernpec to prove on the evidence that Goodwood had such knowledge of the July Arrangements and the Scheme at the point the July Contracts were entered into, so as to indicate a lack of intention on Goodwood’s part that the legal rights and obligations ostensibly created by the July Contracts would be enforceable. What any of the other parties knew with regard to the July Arrangements (eg, that it was part of the Scheme) would be helpful in shedding some light on what Goodwood might have intended with regard to the July Contracts, but is ultimately not determinative. 50 In this connection, I note that Southernpec relies heavily on Mr Lim’s knowledge with regard the Scheme, arguing that Mr Lim’s knowledge could and should then be fully attributed to Goodwood or Mr Lee on the basis of agency. Otherwise, there is no evidence adduced from any representative of BMS, UA or Taigu to throw light on the question of Goodwood’s knowledge. Therefore, before proceeding to consider Goodwood’s knowledge and intention with regard the July Arrangement, it is necessary for me to ascertain the scope of Mr Lim’s knowledge, and then to determine the question of attribution.",
        "The scope of Mr Lim’s knowledge": "51 On the evidence, it is clear that Mr Lim was involved in the June and July Arrangements to a far greater degree than Goodwood or Mr Lee. During the trial, Mr Lim admitted that he was actively communicating with the representatives of the various parties to the June and July Arrangements.62Foot Note 62×Notes of Evidence (“NE”) 20 January 2020 at p 117 line 25 to p 118 line 1In fact, the evidence shows that Mr Lim had detailed knowledge of the structures and details of the various transactions in the June and July Arrangements. I list two instances. 52 First, Mr Lim had advised Mr Wu on the drafting of the ITT certificates and CRNs issued by SPSPL for the purposes of the June Arrangements63Foot Note 63×1AB at p 369.(and which was used as a base for the ITT certificates and CRNs issued for the purposes of the July Arrangement) by attempting to convince SPPL (via Mr Wu) not to specify the names of the transferor and transferee on the ITT certificates because “there are 5 companies in [the June Arrangements]” and he wanted to avoid the need to prepare multiple ITT certificates. Second, Mr Lim instructed Mr Wu on the details of the contracts for the June transactions,iethe transaction prices and the ITT date ranges.64Foot Note 64×1AB at p 342. 53 Contrary to what Mr Wu alleged, however, the evidence before me did not show that Mr Lim was aware that the fuel oil ostensibly transacted in both the June and July Arrangements, stored aboard the MTMarine Starand the MTStar Bright, vessels ultimately owned by SPSPL, belonged to Socar Trading Singapore Pte Ltd (“Socar”), the time-charterer of the MTMarine Star, and Glencore Singapore Pte Ltd (“Glencore”), the time-charterer of the MTStar Bright, respectively. That was knowledge whichprima faciebelonged exclusively to SPPL and SPSPL. Certainly, there is no evidence, beyond Mr Wu’s bare allegation, that Mr Lim was informed of this at the time the July Contracts were entered into. 54 On this point, Southernpec’s position is premised on the bare assertion that as Mr Lim had “regular and insistent” communications with Mr Wu and that he was the primary character administering the July Arrangements, it was “incredible” that he did not know of this.65Foot Note 65×SPCS at para 251.This assertion, in my view, is not persuasive. Mr Lim was not involved in the operations of SPSPL and was accordinglynotin any position to doubt or gainsay Mr Wu when he designated the fuel oil within the tanks on board the MTMarine Starand MTStar Brightto be used for inter-tank transfers for the June and July Arrangements.66Foot Note 66×1AB at p 336; NE 20 January 2020 at p 173 line 7 to 8.It wasfarfrom incredible that Mr Lim did not know that the fuel oil transacted was purportedly not SPPL’s to sell. Accordingly, I reject Southernpec’s argument in this regard. 55 In my view, therefore, Mr Lim knew that the July Arrangements involved two circular series of back-to-back sales and purchases of fuel oil. He was aware of the details of those sales and purchases, such as the price, the ITT dates, and the identities of the transacting parties (ie,BMS, Digiland, Goodwood, SPPL, Taigu and UA). However, there is insufficient basis to find that he was aware that the fuel oil purportedly sold by SPPL to kick-start the June and July Arrangements did not in fact belong to SPPL, but to Socar or Glencore.",
        "Whether Mr Lim’s knowledge could be attributed to Goodwood and Mr Lee": "56 The next question is the extent to which such knowledge can be attributed to Goodwood and Mr Lee. At the outset, I should state that I do not accept the assertion that Mr Lim was an employee of Goodwood. There was no evidence of this at all. I focus on whether the rules of agency would apply, as the knowledge acquired by an agent of Goodwood and Mr Lee while acting within the scope of his authority may be imputed to them:The “Dolphina”[2012] 1 SLR 992 at [216]. Two questions therefore arise for determination: (a) Whether Mr Lim was an agent of Goodwood and Mr Lee; and (b) Whether Mr Lim’s structuring and administration of the June and July Arrangements fell within the scope of any such agency. 57 These two matters will be considered in relation to the aspects which Southernpec relies on to show that Mr Lim was an agent, which are as follows. (a) First, Mr Lee admitted during trial that he delegated authority to Mr Lim (an employee of IEG and not Goodwood) to chase for the debts under the July Contracts67Foot Note 67×NE 13 November 2019 at p 108 line 8 to p 109 line 1.instead of Mr Lim Y P, who Mr Lee claimed to be Goodwood’s only trader;68Foot Note 68×NE 12 November 2019 at p 182 lines 14 to 17; SPCS at para 136.1. (b) Mr Lim allegedly concealed the “true nature” of the June contracts from his immediate superior, Dr Goh, when Dr Goh questioned him on them on 11 June 2015 in relation to the June deals;69Foot Note 69×SPCS at para 136.2. (c) Mr Lim allegedly reported directly to Mr Lee instead of Dr Goh on 2 and 12 August 2015;70Foot Note 70×SPCS at para 136.3. (d) Goodwood’s own pleadings in a separate legal action concerning an entirely different deal cast Mr Lim as acting for Goodwood;71Foot Note 71×SPCS at para 141.1. (e) Mr Lim admitted that he had the authority from Mr Lim Y P to communicate deal proposals to SPPL on behalf of Goodwood;72Foot Note 72×SPCS at para 144. (f) Mr Lim referred to Goodwood personnel as his “colleagues”,73Foot Note 73×SPCS at para 150.and Mr Lee referred to Mr Lim as Goodwood’s trader on 20 August 2015;74Foot Note 74×SPCS at para 152. (g) Mr Lim was listed as Goodwood’s commercial contact in the June Contracts;75Foot Note 75×SPCS at para 156.and (h) Mr Lim conceded that it was he who proposed the granting of a US$5 million trading credit line to SPPL on behalf of IEG and Goodwood.76Foot Note 76×SPCS at para 157. 58 Before dealing with the specific instances set out above, I would observe generally that the evidence clearly showed that IEG and Goodwood shared a close business relationship. Indeed, Mr Lee gave evidence at trial that IEG was Goodwood’s only supplier, and that Goodwood was set up to complement IEG’s business.77Foot Note 77×NE 12 November 2019 at p 185 line 2 to 5; Lee’s AEIC at para 19.The two entities shared the same office space and a common internet line.78Foot Note 78×Lee’s AEIC at para 143.Their trading personnel were physically proximate; Mr Lim’s evidence was that Mr Lim Y P “was just sitting across a couple of desks away”.79Foot Note 79×NE 20 January 2020 at p 51 line 22 to p 53 line 12. 59 Mr Lee was also the director of Digiland, IEG’s parent company. According to Mr Lim, that was the reason why he reported information about the various transactions concerning IEG to Mr Lee,80Foot Note 80×NE 20 January 2020 at p 59 lines 4 to 6.including the prospects of UA making the payments due under the July Arrangements, which occurred by text messages on 12 August 2015.81Foot Note 81×3AB at p 1665.That conversation was recorded as follows: 12/08/2015, 6:09 p.m. – [Mr Lee]: UA’s behavior is unbecoming and has hurt TG and everyone in the transaction chain. 12/08/2015, 6:11 p.m. – [Mr Lee]:for some reason,[Dr Goh]is convinced that the money in UA’s HSBC account is gone. 12/08/2015, 6:12 p.m. – [Mr Lee]:ialready shared that you [checked] that usd1.68m is still there pending disbursement by UA. [emphasis added] 60 Southernpec attempted to use this particular conversation to portray Mr Lim as working for Goodwood’s and Mr Lee’s interests before that of his employer, IEG, and his immediate superior Dr Goh because it purportedly showed that Mr Lee was aware of the fact that Mr Lim had ascertained the state of UA’s bank account ahead of Dr Goh. In my judgment, this conversation did not unequivocally show that Mr Lim had informed Mr Lee ahead of Dr Goh of the money in the UA bank account. In fact, all it showed was that Mr Lee had responded to a concern of Dr Goh’s. Southernpec’s interpretation is not the only plausible interpretation for the conversation or even the most likely one. It is equally plausible, for instance, that Dr Goh had noted Mr Lim’s findings but still expressed concern to Mr Lee, and that Mr Lee then informed Dr Goh of what he already knew. 61 Furthermore, this conversation took place after UA had defaulted on its obligations under the July Arrangements. By 12 August 2015, both Digiland and Goodwood, as related counterparties under the July Arrangements, would obviously have an interest in working together in attempting to recover the sums they were owed thereunder. Indeed, Mr Lee’s evidence at trial was that this was the case.82Foot Note 82×NE 13 November 2019 at p 113 lines 6 to 9. 62 It is also in the context of collaboration borne out of mutual interest that the 2 August 2015 exchange of text messages relied on by Southernpec to prove that Mr Lim was acting as Goodwood’s and Mr Lee’s agent in orchestrating the July Arrangements must be understood. The 2 August 2015 messages related to Mr Lee asking Mr Lim for the date by which Goodwood could expect to receive payment from SPPL for the July Contracts:83Foot Note 83×3AB at p 1646. 02/08/2015, 7:06 p.m. – [Mr Lee]: When can we meet henky andwhen can Goodwood receive the payment? 02/08/2015, 7:07 p.m. – [Mr Lee]: I will need the usd 0.9m cash now and restructure the bal usd uss0.9m on higher int% 02/08/2015, 7:08 p.m. – [Mr Lee]: see if henky has a better idea…i’mopen to any meaningful suggestions that would make all this go.away. … 02/08/2015, 7:14 p.m. – [Mr Lee]: we need to meet with [Dr Goh] these 2 days to take a common position, such that you can share w/southernpec and bms. [emphasis added] 63 These messages do not even pertain to the material time where the July Contracts were entered into as they relate to the aftermath of UA’s failure to effect due payment under the July Arrangements. They are, however, consistent with Mr Lee’s evidence that Mr Lim, as an employee of IEG, was collaborating with Goodwood personnel in a joint effort to recover what they were owed under the July Arrangement. This is borne out by Mr Lee’s reference to the need to meet Dr Goh to “take a common position” which could then be shared with Southernpec and BMS. Accordingly, there is, in my judgment, nothing in the conversations of 2 and 12 August 2015 that proves that Mr Lim was in fact orchestrating and administering the July Arrangements as an agent of Goodwood or Mr Lee. This disposes of the assertions at [57(a)] and [57(c)] above. 64 I now turn to consider the instances where, according to Southernpec, Mr Lim referred to Goodwood personnel as his “colleagues”. There were two such instances as follows: (a) The first instance occurred on 15 June 2015 at 11.12 am. At that time, Mr Wu sent Mr Lim a WeChat message that read:84Foot Note 84×1AB at p 392. Jason Wu: Still need the seller to send us recap, for the 1700T trade Andrew Lim: Ok.I ask my colleague to send. [emphasis added] (b) The second instance occurred on 28 July 2015 at 3.23 pm. There, Mr Lim responded to Mr Wu’s request to tell Goodwood to “ease up” on pushing SPPL to make payment for the July Contracts by saying that he had “already told the [Goodwood] colleagues”.85Foot Note 85×1AB at p 508. 65 I accept that in both instances, Mr Lim’s use of the words “colleagues” to refer to Goodwood personnel evinces a close working relationship between them – a matter which is supported by the other evidence: see [58] above. However, that does not mean that Mr Lim was Goodwood’s agent. Given that Mr Lim was not an employee of Goodwood, an agency relationship could only be established if there exists a representation (whether expressly or by conduct) by Goodwood or Mr Lee to that effect:Sigma Cable Co (Pte) Ltd v NEI Parsons Ltd[1992] 2 SLR(R) 403 at [30];GoldrichVenture Pte Ltd v Halcyon Offshore Pte Ltd[2015] 3 SLR 990 at [55]. In this regard, Mr Lim’s offhand comments on who he considered his “colleagues” did not suffice. 66 This brings the analysis neatly to the significance of Mr Lee having referred to Mr Lim as “[Goodwood]’s trader” in a text message conversation with Mr Wu on 20 August 2015:86Foot Note 86×3AB at pp 1692–1694. [Mr Lee]:  Universal Alliance took usd2m cash [from] Goodwood in an earlier deal w/Alro and USD1.5m cash [from] BMS in this current situation. In the first Alro defaulted on Goodwood. In the 2nd Universal Alliance defaulted on TG. [Mr Lee]:  In both situations, Goodwood’s cashflow is affected. It is time that everyone else who are involved feels the inconvenience which I had to carry since Jan 2015. [Mr Wu]: Now see what Andrew can do …,he is the one who is the trader under [Goodwood.] [Mr Lee]:  Jason, I believe that you will do the decent thing to rectify the situation. As we will open a file w/the police for both PT Alro and to highlight the situation w/ Universal Alliance, Southernpec and BMS may be asked to give testimony of Universal Alliance. [Mr Lee]:Andrew asgoodwood’s trader should be chasing for payment from Southernpec. For whatever reasons that he is not doing so,we will not question fornow but we cannot just leave things as they areand for everyone toexpect NSG/Goodwood to resolve the matter… [emphasis added] 67 While Mr Lee indubitably did refer to Mr Lim as “[Goodwood]’s trader”, the significance of this reference must be appreciated in its proper context. This conversation took place after issues with receiving due payment from SPPL in respect of the July Contracts had surfaced and Mr Lee had by then authorised Mr Lim to chase for those debts on behalf of Goodwood at a meeting on 31 July 2015 (attended by Mr Arif, Mr Wu and Mr Lim).87Foot Note 87×NE 13 November 2019 at p 107 line 23 to p 108 line 22.In my judgment, there was therefore nothing surprising about Mr Lee’s reference to Mr Lim as “[Goodwood]’s trader” in the context of chasing for payments due under the July Contracts. Moreover, this conversation took place well after the various contracts under the July Arrangement had been entered into. Accordingly, it sheds no light on whether Mr Lim acted as Goodwood’s or Mr Lee’s agent in orchestrating and structuring them. Therefore, there is no basis for a finding of fact to that effect. This disposes of the assertion at [57(f)] above. 68 The same reasoning also broadly applies to Mr Lim’s admission that he had the authority from Mr Lim Y P to communicate Goodwood’s deal proposals to SPPL in at least two instances (iethe June and July Contracts);88Foot Note 88×1AB at p 342 (June Contracts); 1AB at p 448 (July Contracts).that he made the proposals for Goodwood’s granting of a US$5 million line of trade credit to SPPL;89Foot Note 89×1AB at p 284.and the fact that Mr Lim was listed as Goodwood’s commercial contact in the June Contracts (assuming that this was not a typographical error).90Foot Note 90×3AB at p 1360.The authority to communicate does not amount to the authority to orchestrate and to administer the June and July Arrangements. This disposes of the assertions at [57(e)], [57(g)] and [57(h)] above. 69 I now turn to Southernpec’s allegation that Goodwood had pleaded, in a separate suit against IEGieHigh Court Suit 425 of 2018, in respect of a similar transaction between UA, IEG and PT Petro Energy Alro (“PT Alro”) that the sale process was “controlled and managed by IEG, Andrew Lim”.91Foot Note 91×SPCS at para 141.1; NE 13 November 2019 at p 93 lines 5 to 8.Southernpec relies on this to assert that Mr Lim was acting for Goodwood.92Foot Note 92×SPCS at para 141.In my view, such assertions are unfounded. The fact that the entire sale process was controlled and managed by Mr Lim does not mean that he was acting as Goodwood’s agent in so doing. All it means is that he brokered and controlled the parties’ execution of the entire transaction. Mr Lee gave evidence to the same effect during cross-examination:93Foot Note 93×NE 13 November 2019 at p 93 line 8 to p 96 line 18. Q. You say that [Goodwood] was named as the seller. Here, you use terms like “named as the seller” to PT Alro and the sale process was controlled and managed by IEG, Andrew Lim. Wouldn’t you agree with me that in doing so, to all outward appearances, Andrew Lim was acting for your company? A. I disagree. … Q. Then you see that the words you use are very specific. The process is controlled and managed by Andrew Lim? A. (Nods). Q. So he is actually even controlling and managing the process of the sale between Goodwood and PT Alro, isn’t that what you’re saying? A.No, I was saying that Andrew Lim managed the transaction and introduced the transaction from UA to PTAlro. Similarly, [Goodwood] and IEG came in but in this particular instance we are not trading with each other, we are joint venture partners in a split. … Q. … What is important is subparagraph (12), same page: “At all material times GA was led by Andrew Lim to believe that the purchase of marine fuel oil from [UA] and the sale of the same oil to PT Alro was a genuine sale of and trade of marine oil.” I am a bit unclear about this,but it would seem to suggest that the fact that [Goodwood] could be led to believe by Andrew Lim to think of certain things means that Andrew was acting in a representative capacity for [Goodwood], isn’t that true? A.No, I don’t believe that to be the case. When I say that [Goodwood] was led, it was in the capacity of him leading the transaction. I stillhave to decide whether I make the decision of payments, et cetera. Q.But the person to conveyyou facts to make your decision was only Andrew Lim? A.That’s correct. [emphasis added] 70 In my view, Mr Lee’s evidence points towards Goodwood’s reliance on information provided by Mr Lim in deciding whether to enter into the trades. While I accept that Mr Lim was the person managing how the various trades would work,egwhich parties were to trade with each other and how the trades would be executed, this did not mean that he undertook such tasks as an agent of Goodwood or Mr Lee. 71 Southernpec also makes much of the fact that Mr Lee had testified at trial94Foot Note 94×NE 12 November 2019 p 214 line 3 to p 215 line 1.that he was unhappy with Mr Lim for involving UA in the July Arrangements as he was in breach of a directive from the Digiland/IEG management in so doing and UA had been involved in the PT Alro transaction in which Goodwood had incurred significant losses (even though it was not the defaulting party).95Foot Note 95×SPCS at para 142.Puzzlingly, Southernpec then asserted that “if [Mr Lim]were acting only for IEG, there would have been no reason for Lee/[Goodwood] to be unhappy with him for involving UA when the instructions not to deal with UA were purportedly given only ‘by Digiland/IEG management’ and not Lee/[Goodwood]”.96Foot Note 96×SPCS at para 143.In my judgment Mr Lee’s unhappiness with Mr Lim for breachingDigiland/IEGdirectives not to involve UA does not automatically lead to a conclusion that Mr Lim had also breached Goodwood’sor Mr Lee’sdirectives (as his alleged principal) as well. All that this showed was that the interests of Goodwood/Mr Lee and Digiland/IEG were aligned, which is perfectly consistent with the fact that in the PT Alro transaction and in the June Arrangements, IEG and Goodwood were involved as adjacent transacting counterparties.97Foot Note 97×NE 12 November 2019 p 213 lines 19 to 21 (PT Alro Transaction). 72 In view of the above, I do not accept Southernpec’s attempt to rely on the PT Alro transaction as a basis for a finding of fact that Mr Lim was Goodwood or Mr Lee’s agent in orchestrating or administering the July Arrangement. This disposes of the assertion at [57(d)] above. 73 I will now deal with Southernpec’s allegation that Mr Lim had lied to Dr Goh in that he had allegedly failed to disclose the true nature of the 1,500 MT deal (which was part of the June Arrangement). To explain, on 11 June 2015, Dr Goh sent Mr Lim an email, copying Mr Lee and Mr Lim Y P, querying Mr Lim on the specifics about the June deal, including who the fuel oil was being purchased from, the exact product being sold, when the payments could be made, as well as the commercial viability of the price. After Mr Lim’s explanation by way of an email on 13 June 2015, Dr Goh informed Mr Lim to be careful to “secure the tank assay” so as not to be caught in any dispute between BMS and SPPL. Mr Lim assured Dr Goh that “[t]here will be a ITT certificate and a cargo release document issued by Southernpec as supporting documents”.98Foot Note 98×2AB at pp 1244 to 1244(b); Lee’s AEIC at paras 38 to 40.In my view, this exchange shows that Digiland and Goodwood were being cautious about the arrangements with BMS and SPPL. Indeed, I should add that as Digiland is a publicly listed company, and Mr Lee was a director of both Goodwood and Digiland, public announcements were made in relation to the June deals on 24 June 2015.99Foot Note 99×Lee’s AEIC at paras 46 to 48.Even if Mr Lim did not disclose the true nature of the June deals to Dr Goh, it is difficult to see how this supports a finding that Mr Lim had any authority from Goodwood or Mr Lee to orchestrate and structure the June and July Arrangements. This disposes of the assertion at [57(b)] above. 74 Lastly, Southernpec also makes the startling suggestion that Mr Lim and Mr Lim Y P were in fact the same person by relying on the evidence of its expert witness, Mr Tan Kah Leong, that several emails from Mr Lim Y P and Mr Lim were sent from the same fixed IP address, 49.128.33.198,100Foot Note 100×AEIC of Tan Kah Leong at p 26, para 7.2 (Expert Report).and that therefore it was highly probable that they were sent out from the same physical location. This is completely unhelpful as IEG and Goodwood shared the same office space and internet line (as I observed at [58] above), and therefore it would not be surprising if the emails of Mr Lim Y P, an employee of Goodwood, and Mr Lim, an employee of IEG, were sent out from the same physical location. This fact did not support a finding that Mr Lim Y P and Mr Lim are one and the same person. 75 On the basis of the above, I am not persuaded that Mr Lim acted as an agent of Goodwood or Mr Lee in orchestrating and structuring the June and July Arrangements. His knowledge of the various parties and transactions involved in the June and July Arrangements could not be attributed to Goodwood or Mr Lee. Even if I were to be wrong in finding that Mr Lim was not aware that the fuel oil was non-existent (see [55] above), again, such knowledge could not be attributed to Goodwood and Mr Lee.",
        "Whether Goodwood intended the July Contracts to create legal relations": "76 With that, I turn to Southernpec’s remaining arguments to prove Goodwood’s knowledge of the sham nature of the July Contracts and the July Arrangements, and that Goodwood did not intend to be bound by the July Contracts. These fall into two broad areas. Conduct in relation to the July Contracts 77 The first broad area concerns the conduct of Goodwood and SPPL relating to the July Contracts which allegedly show that they never treated them as legally-binding contracts for the trading of fuel oil. (1) Parties’ alleged indifference to the form and contents of the July Contracts 78 First, Southernpec contends that both SPPL and Goodwood treated the form and contents of the July Contracts with cavalier indifference, evidenced by the lack of care given by Goodwood towards identifying and correcting the various alleged typographical errors101Foot Note 101×SPCS at para 296.and Goodwood’s failure to obtain SPPL’s authorised signatures on the July Contracts.102Foot Note 102×SPCS at para 214Southernpec also points out that there is no evidence of any negotiations for, or acceptance of, the terms of the July Contracts.103Foot Note 103×SPCS at para 211.Southernpec argues that all these point towards the July Contracts being shams which the parties did not intend to be bound by. 79 I do not consider the negotiation, acceptance and signature points of any significant assistance to Southernpec’s case. It is clear from the evidence, in particular, the deal recaps sent via emails by Mr Lim Y P to Mr Wu on 1 July 2015104Foot Note 104×3AB at p 1427 (1,200 MT); p 1428 (2,000 MT).and confirmed by the latter via emails on the same day,105Foot Note 105×3AB at p 1431 (1,200 MT); p 1432 (2,000 MT).that the written agreements in the July Contracts mainly served to formalise deals struck earlier between Goodwood and SPPL. It was Mr Peter Lin Jianbin (“Mr Peter Lin”), SPSPL’s Operations Manager, who was copied on Mr Lim Y P’s emails setting out the deal recaps who requested the contracts from Mr Lim Y P.106Foot Note 106×3AB at p 1468 (1,200 MT); p 1458 (2,000 MT).After receiving the contract for the 2,000 MT deal (which was also sent to Mr Wu),107Foot Note 107×3AB at p 1459.Mr Peter Lin chased for the contract for the 1,200 MT deal.108Foot Note 108×3AB at p 1468.Upon receiving the latter (which was also sent to Mr Wu), Mr Peter Lin then sent Mr Lim Y P an email in which he stated that the ITT for the fuel oil will be arranged to be on 8 July 2015109Foot Note 109×3AB at p 1505.(in accordance with cl 6 of the contract in relation to the 1,200 MT deal). This is clear evidence that SPPL, ostensibly at least, considered itself bound by the terms of the July Contracts and there was no need for Goodwood to have obtained SPPL’s signatures on them. 80 Two “typographical errors” with regard to the June and July Contracts were pointed out by Southernpec in support of the assertion that there was a “complete lack of care and attention to the paperwork” which was a “strong indication, and indeed evidence, of the transactions being completely artificial”:110Foot Note 110×SPCS at para 296. (a) The presence of the retention of title clause under cl 10 of the July Contracts being inconsistent with Mr Lee’s own understanding on when he thought title to the fuel oil was to pass;111Foot Note 111×SPCS at para 297.and (b) The June Contracts had listed Mr Lim as the “commercial contact” for Goodwood when he was not its employee.112Foot Note 112×SPCS at para 298. 81 I shall deal first with the presence of the retention of title clause in cl 10 of the July Contracts. This stated:113Foot Note 113×3AB at p 1462 (2,000 MT); p 1472 (1,200 MT). 10. TITLE/RISK RISK SHALL BE TRANSFERRED [F]ROM SELLER TO BUYER ON THE ACTUAL ITT DATE. TITLE TO THE PRODUCT DELIVERED SHALL REMAIN WITH THE SELLER UNTIL THE SELLER’S INVOICE HAS BEEN PAID IN FULL, IN SO FAR AS THE SELLER HAS THIS RIGHT ACCORDING TO LAW, WHETHER THAT LAW IS THE LAW OF THE PLACE OF DELIVERY, OR ACCORDING TO THE LAW OF THE VESSEL’S FLAG STATE, OR ACCORDING TO THE LAW AT THE LOCATION WHERE THE VESSEL IS FOUND. FOR THE AVOIDANCE OF DOUBT, WHILE TITLE SHALL REMAIN WITH THE SELLER, ANY RIGHT OF THE SELLER TO A MARITIME LIEN (WHERE APPLICABLE) IS HEREBY EXPRESSLY PRESERVED. 82 The express language of cl 10 was inconsistent with Mr Lee’s evidence during cross examination,ie, that he thought title to the fuel oil was to pass on the inter-tank transfer date.114Foot Note 114×NE 14 November 2019 at p 46 lines 14 to 18.From this, it is plain that Mr Lee was not familiar with the contractual documentation. Indeed, it was his evidence that he delegated responsibility for trading to Mr Lim Y P,115Foot Note 115×NE 12 November 2019 at p 180 line 25.and there was no evidence to show that he was aware of the contractual documentation at the material time. In my view, Southernpec’s contention that Mr Leemusthave known and approved of the deal from the start because he allegedly owed a fiduciary duty to do so116Foot Note 116×SPCS at para 160.is of no merit. In any case, the fact that Mr Lee (who is not legally-trained) was mistaken during cross-examination as to the legal effect of the retention of title clause in the July Contracts did not mean that Goodwood did not intend to be bound by them at the material time. 83 I also do not accept Southernpec’s argument that the fact that Mr Lim was listed as Goodwood’s “commercial contact” in the June contracts showed that Goodwood and SPPL were “absolutely unconcerned about proper contractual documentation because those documents were never intended to be legally binding on the parties”.117Foot Note 117×SPCS at para 298.It is worth highlighting that the July Contracts did not contain any such errors, showing that the parties cared enough about proper contractual documentation to make the necessary corrections. In any case, there is no expectation of utmost precision and certainty in draftsmanship:Wartsila Singapore Pte Ltd v Lau Yew Choongand another suit[2017] 5 SLR 268 at [165]. Moreover, the contact information in the June and July Contracts also did not carry much significance, if any, because both Goodwood and SPPL knew well who the contact person of the other was. Indeed, Mr Wu and Mr Peter Lin had consistently been in communication with Mr Lim Y P on trading and documentation matters relating to the June and July Contracts before the written agreements were sent. Any errors in the June Contracts, in this regard, carried little weight in this analysis. (2) Whether it was commercially unconscionable for parties to trade in generically described fuel oil 84 Second, Southernpec contends that it was commercially unconscionable for parties to trade in “fuel oil” without specifying its chemical properties,eg, quality, gravity, weight, sulphur, content, viscosity, and purity.118Foot Note 118×SPCS at para 234.Goodwood and Mr Lee, however, dispute this on the grounds that “fuel oil” denoted a specific type of fuel oil.119Foot Note 119×Goodwood’s and Lee’s Closing Submissions (“GLCS”) at para 269 to 270.Given the many grades of fuel oil available in the market, I consider it questionable, as a matter of commercial wisdom, if a trader ostensibly intending to purchase and take delivery of fuel oil displays such indifference to its specifications. However, the July Contracts werenottrades of this kind. Goodwood and Mr Lee point out, and the evidence clearly shows, that Goodwood knew and intended the July Contracts to be “sleeving” trades.120Foot Note 120×Goodwood’s and Lee’s Reply Closing Submissions (“GLRCS”) at para 26(e); NE 12 November 2019 at p 177 line 5. 85 It has been recognised that a sleeving trade in the fuel oil industry is one where a party, known as the “sleeve provider”, contracts to purchase fuel oil from one party (its supplier) and separately contracts to sell it on to another party (its buyer), benefitting from the arrangement by charging a fee:G-Fuel Pte Ltd v Gulf Petrochem Pte Ltd[2016] SGHC 62 at [3]. In that case, the “fee” consisted of a US$3 charge payable by the buyer to the sleeve provider per MT of fuel oil sleeved. This is, in my view, no different from the present case. 86 Goodwood asserts that it was a sleeve provider for US$3 per MT of fuel oil purchased from BMS through IEG (the June Arrangements) and Digiland (the July Arrangements) which was then sold on to SPPL. It was an intermediate trading party and did not expect to take delivery of the fuel oil, similar to the position of the intermediate trading parties inGarnacGrain([45]supra). It seems to me that it is not unreasonable for a sleeve provider such as Goodwood to be indifferent to the exact quality of the fuel oil it was sleeving as it was not its business, as a sleeve provider, to enquire into what the ultimate buyer and ultimate seller in the sleeve transaction were trading in. 87 I reach the same conclusion in relation to Southernpec’s reliance on evidence given by its expert witness, Mr John Timothy Driscoll, that the July Contracts did not appear to represent a genuine commercial transaction for fuel oil calling for settlement for physical delivery121Foot Note 121×John Timothy Driscoll’s AEIC (“JTD”) at p 36 para 71 (Expert Report).as the grade, properties or specifications of the fuel oil transacted was not specified,122Foot Note 122×JTD at p 47 para 107 (Expert Report).and also that the transacted prices were “wildly out of line with the assessed daily prices of conventional, benchmark fuel oil grades reported on the days of the alleged [ITTs] and contract dates”.123Foot Note 123×JTD at p 47 para 107 (Expert Report).These were considerations germane to a trader expecting to take delivery of the fuel oil but not to a sleeving party whose only relevant concerns are the sleeving fee earned for facilitating the transaction and assuming counterparty risk. As Goodwood and Mr Lee point out, the product description of the fuel oil is a matter of contract between buyer and seller as long as the fuel oil transacted was sufficiently identified.124Foot Note 124×GLCS at para 270.The fact that the effective underlying transaction did not appear to be a commercial one does not detract from the intention of Goodwood, a sleeving party, for the July Contracts to create binding legal rights and obligations. (3) Whether parties were aware that the supporting delivery documents were falsified 88 Third, Southernpec asserts that both parties to the July Contracts were aware that the supporting delivery documents,ie, the ITT certificates and the CRNs, were falsified documents. In this connection, Southernpec seeks to show the following: (a) That the parties never intended to have ITT certificates document the trades; and (b) That the ITT certificates for the June and July Contracts documented inter-tank transfers that in fact never took place aboard the designated vessels, the MTMarine Starand the MTStar Bright.At the material times, while the vessels were owned by SPSPL, they were on time-charter to Socar and Glencore respectively. Such evidence was given by SPSPL’s former Shipping Operations Executive, Mr Marcus Loh Siak Heng (“Mr Loh”). 89 On the first point, Southernpec alleges that it was Mr Lim who unilaterally introduced the requirement for ITT certificates and CRNs for the June Arrangement on 13 June 2015 by amending the various deal recaps.125Foot Note 125×SPCS at para 269.Prior to this, the parties were happy to enter into the various contracts under the June Arrangements without the need for any ITT certificate, thereby showing that the June Arrangements were a sham (and by extension the July Arrangements too). I do not think the evidence bears this out. As Goodwood and Mr Lee contend, Mr Wu had already sent Mr Lim a draft ITT certificate and CRN on 10 June 2015.126Foot Note 126×GLRCS at para 216; 2AB at pp 1180 to 1182.Clearly, the issuance of these documents was contemplated before 13 June 2015 and there is nothing to suggest that Goodwood was not aware of this. Certainly, there is no evidence which shows that Goodwood had accepted that no appropriate supporting documentation would be furnished in respect of the June and July Contracts. 90 I do not agree with the gloss Southernpec attempts to put on these amendments to the deal recaps,ie, that the reason why Mr Lim could “unilaterally manipulate” the details of the deals without negotiation, comment or protest from BMS or Goodwood was because the parties all knew that the deals were shams.127Foot Note 127×SPCS at para 176.An equally valid explanation for the lack of protest was that the requirement for the ITT certificates and CRNs were accepted as a matter of course by the parties. 91 For the above reasons, I do not think that Goodwood was indifferent as to the issuance of appropriate supporting documentation for the June and July Contracts. 92 I now turn to the second point regarding Mr Loh’s evidence that any cargo on board the MTMarine Starand the MTStar Brightbelonged to Socar and Glencore respectively.128Foot Note 128×Marcus Loh Siak Heng’s AEIC (“MLSH”) at para 24.No inter-tank transfers ever took place aboard the MTMarine Star(in respect of the June Contracts) and the MTStar Bright(in respect of the July Contracts).129Foot Note 129×MLSH at para 50.In fact, his evidence was also thatnoITT certificates would be provided in respect of physical transfers of petrochemical products between tanks on the same vessels. The only evidence for any transfer would be the change in the ullage readings (indicating the quantity of fuel stored) in the tanks.130Foot Note 130×NE 4 November 2019 at p 153 line 19 to p 154 line 3.He further stated that the ITT certificates issued in respect of the June and July Contracts designated Shiptanks 2C,131Foot Note 131×3AB at p 1267 (June Contracts, 1,700 MT); p 1545 (July Contracts, 2,000 MT).3C,132Foot Note 132×3AB at p 1267 (June Contracts, 1,700 MT); p 1295 (June Contracts, 1,500 MT); p 1547 (July Contracts, 1,200 MT).1W,133Foot Note 133×3AB at p 1295 (June Contracts, 1,500 MT).4C134Foot Note 134×3AB at p 1545 (July Contracts, 2,000 MT).and 5C,135Foot Note 135×3AB at p 1547 (July Contracts, 1,200 MT).which did not accurately match the designations of the fuel oil storage tanks aboard the MTMarine Starand/or the MTStar Brightin the ullage reports.136Foot Note 136×3AB at p 1269 (MTMarine Star); p 1531 (MTStar Bright).Mr Loh admitted that he had manufactured these ITT certificates (which contain particulars of the ship tanks) on the instructions of Mr Peter Lin137Foot Note 137×NE 4 November 2019 at p 51 line 8 to 22.and that they were, accordingly, fictitious records of inter-tank transfers138Foot Note 138×NE 4 November 2019 at p 54 line 13 to 16.as the said ITTs did not take place.139Foot Note 139×NE 4 November 2019 at p 54 line 22 to p 55 line 1. 93 Even if I were to accept that the ITT certificates generated by SPSPL are not genuine documents, the question is whether Goodwood or Mr Lee had any knowledge that no genuine inter-tank transfers would be carried out, and whether such knowledge showed that they intended the June and July Contracts to be sham sleeving trades. Whether Southernpec conducted itself on the basis that the June and July Contracts in themselves or as part of the June and July Arrangements were shams is not determinative for the purposes of theSnook([42]supra) test. In this regard, there is no evidence showing that Goodwood and Mr Lee really did anything other than to accept Southernpec’s ITT certificates and CRNs at face value. I accept Goodwood’s and Mr Lee’s contention that this is reasonable since Goodwood was merely a sleeving party which did not expect to take physical delivery of the fuel oil.140Foot Note 140×GLRCS at para 217.Neither Goodwood nor Mr Lee had any reason to doubt Southernpec’s representations regarding the inter-tank transfers and SPPL’s ownership of the fuel oil as SPSPL was the owners of the storage vessels and accordingly had ready access to information regarding the fuel oil’s ownership and storage location. There is no evidence that Goodwood would have access to such information in order to verify the authenticity of the ITTs and CRNs. Knowledge of the nature of the July Arrangements 94 I now turn to the second broad area. Essentially, Southernpec argues that based on the evidence, Goodwood and Mr Lee knew of the nature and structure of the July Arrangements at the time the July Contracts were entered into. I note that the bulk of Southernpec’s submissions in this regard rely heavily onMr Lim’sknowledge. However, given that I have found at [75] above that Mr Lim’s knowledge of the June and July Arrangements couldnotbe attributed to Goodwood or Mr Lee, I will consider only those aspects which werenotwholly premised on Mr Lim’s knowledge. (1) The contents of the CRNs 95 While Mr Lee admitted that Goodwood knew of the transactions involving BMS, Digiland, Goodwood itself, and SPPL (see [23] above), he said that Goodwood did not know of the July Arrangements. In this regard, I note that Mr Lee asserted that Goodwood only obtained the CRNs for the July Arrangements from Digiland which had obtained the same from BMS on 26 August 2015.141Foot Note 141×Lee’s AEIC at para 151.I proceed on the basis that Goodwood or Mr Leewerein fact aware of the type of CRNs to be expected for the July deals (especially since there were similar CRNs for the June Contracts). The CRNs were on the letterhead of SPPL. They were dated 3 July 2015 (for the 2,000 MT cargo) and 8 July 2015 (for the 1,200 MT cargo) and stated: TO: TO ORDER OF CONTRACTUAL BUYER … IN ACCORDANCE WITH THE SALES CONTRACT, WE, AS THELEGAL HOLDEROF THE CARGO, HEREBY RELEASE THE CARGO AS SPECIFIED BELOW TO THE RECEIVER. … Cargo Receiver: TO ORDER OF CONTRACTUAL BUYER Cargo Description: FUEL OIL TANK NO: … Quantity: …MT Loading Laycan: … [emphasis added] 96 Goodwood had contracted to sell fuel oil supplied by Digiland to SPPL. However, the CRNs showed that SPPL was in fact the “legal holder” of the fuel oil cargo which was the subject-matter of the transaction. As such, assuming that Goodwood was aware of the CRNs, Goodwood should have known that the July Contracts were part of some circular chain of transactions as the fuel oil originated from SPPL (even if it did not know of the other parties such as UA and Taigu). 97 In my judgment, this in itself does notipso factomean that the fuel oil cargo transacted was fictitious or that the July Contracts were part of a sham circular chain of transactions. On this point, I refer to the discussion at [47] above; indeed,GarnacGrain([45]supra)is an example of a genuine circular trading transaction. It therefore follows that even if Goodwood was aware of some circularity in the transactions involving the July Contracts, more is required to establish knowledge of the July Arrangements and the Scheme. (2) Relevance of expert evidence regarding Goodwood’s knowledge of the July Arrangement 98 Southernpec seeks to rely on the testimony of Mr Lim’s expert, Mr Koh Leong Teck (“Mr Koh”), that for “flash title transfers” not involving any physical delivery of the goods,142Foot Note 142×SPCS at para 172.he wouldassumethat “the whole chain knows about every single bit of the deal”, that all parties in the chain trusted each other, that every party in the chain unquestioningly accepted the transaction documentation and did not question it, and that the identities of each party in the chain was known to every other party. 99 However, it is clear from Mr Koh’s testimony during cross-examination that he had simply made those assumptions without any discernible factual basis at all.143Foot Note 143×NE 3 February 2020 at p 151 line 20 to p 154 line 23.In my view, it was not necessary for all parties in the July Arrangements to have known the identities of the other parties in order for the contractual documents to have any meaning. Each sleeve provider in the chain would need to establish its claim to the fuel oil transacted by tracing its legal rights through the various sale contracts preceding its transaction,ifit wished to take delivery of the fuel oil (which, as observed at [85], may not be the case for sleeving parties). But this didnotmean that each sleeving party would know the identities of the parties to subsequent transactions in the July Arrangements,even ifthey had known that the transactions were circular in nature. For this, all that the relevant party needed to know was that one party to the chain of transactions was the original buyer/sellerandthe eventual seller/buyer of the traded commodity. In this regard, Mr Koh’s assumptions cannot in any conceivable way be substituted for evidence. (3) The significance of inconsistencies in the testimony of Mr Lim, IEG and Goodwood 100 Southernpec also points out that Mr Lee and Mr Lim presented different accounts of how and why the June and July Contracts came to be.144Foot Note 144×SPCS at para 354.As I noted at [9], according to Mr Lee, Goodwood’s involvement as a sleeving party started because Mr Lim had informed the management of Digiland/IEG that SPPL wanted to purchase fuel oil from BMS but needed Digiland/IEG’s trading credit limit to do so, which had been exhausted by previous trades. Goodwood was inserted so that it would be Goodwood, and not Digiland/IEG, which would be reflected as the seller of the fuel oil to SPPL. However, Mr Lim’s version presented Digiland/IEG as the sleeving party for the fuel oil deal between BMS and Goodwood because Goodwood did not have any trading credit line with BMS,145Foot Note 145×Andrew Lim’s AEIC at para 10.and Mr Lim admitted that by 1 June 2015, BMS and SPPL could trade directly.146Foot Note 146×NE 20 January 2020 at p 79 lines 2 to 13. 101 In relation to whether BMS and SPPL could trade directly, it is not clear to me that Goodwood knew of this (even if Mr Lim did). As I indicated above, Mr Lim’s knowledge cannot be attributed to Goodwood or Mr Lee. While Mr Lee focused on why Goodwood had to be inserted as an intermediary between IEG/Digiland and SPPL, he did not elaborate on why IEG/Digiland had to be inserted as an intermediary between BMS and Goodwood. Mr Lim’s version filled that gap. I do not see their evidence as being materially inconsistent. As Goodwood submits, I also do not see how these differences in the evidence evinced Goodwood’s knowledge of the allegedly “sham” nature of the June and July Arrangements.147Foot Note 147×GLRCS at para 95. (4) The significance of the alleged meeting between Mr Lee, Mr Lim, Mr Wu and Mr Xu 102 According to Mr Xu and Mr Wu, they met Mr Lee and Mr Lim on 14 May 2015 to discuss the fictitious transactions. However, I find Mr Xu’s and Mr Wu’s evidence of the alleged meeting to be an afterthought. In his affidavit of evidence-in-chief, Mr Xu did not mention this alleged meeting at all. Initially, in his affidavit of evidence-in-chief, Mr Wu did not say that Mr Xu attended the alleged meeting. Given that this was Southernpec’s key plank to directly establish Mr Lee’s knowledge, it was incredible that the evidence was so unsatisfactory. 103 More significantly, in cross-examination, Mr Wu conceded that at the alleged meeting, there was no mention that Mr Lee knew about the involvement of UA.148Foot Note 148×NE 8 November 2019 at p 132 lines 1 to 20.I also note that Mr Wu conceded that there was simply no documentary evidence to even point towards Mr Lee’s knowledge of UA in the chain of transactions in June 2015.149Foot Note 149×NE 8 November 2019 at p 134 lines 21 to 24.In fact, in a fairly contemporaneous Whatsapp message sent by Mr Lee to Mr Wu on 20 August 2015, Mr Lee made it clear that Mr Goh and he did not know of UA’s involvement (even though “everyone else knew”).150Foot Note 150×3AB at p 1690.This went against Southernpec’s attempts to paint Mr Lee as one of the masterminds behind the entire Scheme and, by extension, the June and July Arrangements. 104 To sum up, I do not accept that there was any such alleged meeting with Mr Lee, and there is no evidence that Mr Lee had full knowledge about the “sham” nature of the June and July Arrangements. (5) Goodwood’s role as intermediary 105 At this juncture, it is apposite for me to consider the significance of observations made by the Court of Appeal in their recent decision inBWG vBWF[2020] 1 SLR 1296 (“BWG”), which was decided after parties here had made their final submissions. The facts ofBWGare very similar to the present case, and the Court of Appeal’s factual findings would therefore be germane to the present inquiry. Essentially, there was a string of three contracts involving X, the appellant, and the respondent. First, the appellant purchased cargo from X. Then, the appellant sold the cargo to the respondent (pursuant to “the appellant-respondent contract”). Subsequently, the respondent sold the cargo back to X. The respondent alleged that the circular oil trading transaction was in fact a disguised loan arrangement with the appellant injecting the funds to kick-start the process in return for a substantial profit (ie, the role performed by BMS in the June and July Arrangements) (at [6]–[8]). 106 Under the arrangement, the appellant provided the funds for the arrangement by way of a letter of credit (“L/C”) taken out with a bank, UBS, upon the tender of a notice of readiness (“NOR”) at the discharge port (at [7]). Subsequently, the respondent failed to make payment to the appellant under the appellant-respondent contract. The appellant sought to recover payment by legal action. The respondent raised four defences (at [35]–[40]): (a) That the appellant failed to furnish the contractually-stipulated certificates of quantity, quality and origin of the oil sold to the respondent. (b) The appellant never passed title or delivered the crude oil to the respondent. (c) The entire transaction involving X, the appellant and the respondent was a sham and therefore unenforceable. Stale documents that did not represent any real cargo were used to create the false impression of a genuine sale and purchase of goods, to conceal the true nature of the transactionie,a disguised loan, and to induce UBS to effect payment under the letter of credit and finance the sham transaction. (d) There was an “unwritten understanding” that each party in the transaction was to pay its respective seller only when it had received payment from its respective buyer. As the respondent had not been paid by X, it was not obliged to pay the appellant. 107 Plainly, the facts, claims and defences raised are uncannily similar to those in the present case. The Court of Appeal made the following factual observations. (a)  First, X must have known, through its employee (who coordinated the deal between the appellant and the respondent) that it would be the eventual buyer of its own crude oil from the respondent following the deal between the appellant and the respondent (at [44]). (b) The appellant likely knew that the transaction was a disguised loan arrangement because: (i) The appellant was unable to explain why it was willing to sell crude oil worth more than US$30m to the respondent without obtaining any form of security in the absence of any history of trading between the parties (at [46]); (ii) The documents used to facilitate the entire transactionvizan “update” from the vessel master stating that the discharging of the crude oil had been completed omitted any mention of the cargo purportedly transacted, or the parties to the transaction. This appeared highly suspicious (at [47]); (iii) The tendered NOR was not addressed to the appellant or the respondent but instead was addressed to two entities known as “Haiyuan” and “Petrobras” whose involvement in the transaction was not explained (at [48]); (iv) The material terms of the three contracts, when read together, were consistent with a loan arrangement (at [49]). 108 On these factual findings, the Court of Appeal concluded that the appellant knew that the transaction between X and the appellant was a disguised loan arrangement and not a genuine transaction for the sale of goods because as the purported creditor in the disguised loan transaction, it was “self-evident” that the appellant must have known the true nature of the transaction. It had also tendered the suspect NOR (at [50]). 109 In my judgment, these conclusions cannot be drawn with respect to Goodwood in the present case for the following reasons: (a) InBWG, the appellant was in the position of thecreditorin the disguised loan arrangement. This was not the case for Goodwood. Instead, Goodwood was the sleeving party interposed between BMS, Digiland and SPPL. BMS was the funding party. The nature of Goodwood’s participation in the July Arrangements did not carry with it the implied knowledge that the transactions were not what they appeared to be. (b) The appellant inBWGhad introduced false shipping documentation and was therefore must have known that the trading arrangement was not abona fideone. Here however, it was not Goodwood but SPPL and SPSPL which had done so. Goodwood had merely relied on the shipping documentation against the very parties which had issued them. The suspect nature of the shipping documentation pointed to the dishonesty of the appellant in that case, but the same could not be said in respect of Goodwood. In this regard, I reiterate that any involvement of Mr Lim could not be attributed to Goodwood. (c) InBWG, the appellant had been inexplicably cavalier in extending significant sums (more than US$30m) on unsecured credit to the respondent without the benefit of any prior trading relationship which pointed to its knowledge that the trading arrangement was a sham. Here, however, Goodwood had procured the SPSPL Guarantee. Leaving aside the question of whether the SPSPL Guarantee covered “sham” transactions, this showed that Goodwood did not treat SPPL as a party with which itneverintended to create binding legal relations. (d) The delivery documents lacked detail in both cases but inBWGthey did not even refer to the crude oil transacted or even the parties to the transaction. Here, although the contracting parties were not named, the fuel oil transacted was specifically identified in the ITT certificates. Further, the appellant inBWGhad procured the delivery documents and the fact that they were content to rely on unsatisfactory documents while being one of the principal traders in the arrangement (ie,not a sleeving party) was telling. Here however, Goodwood, a sleeving party, had a reasonable expectation that the delivery documents would be accepted by the very parties which had prepared them (SPPL and SPSPL, which were related companies). It could therefore not be said, without more, that the quality of the delivery documentation necessarily points to Goodwood’s knowledge of the sham nature of the June and July Arrangements. 110 Given Goodwood’s intermediary role in the transactions involving BMS, Digiland, Goodwood and SPPL, its participation did not point towards knowledge of the July Arrangements or the Scheme. Conclusion 111 From the entirety of the evidence, there is no basis for me to conclude that Goodwood or Mr Lee knew or intended the July Contracts to be shams.Contrary to Southernpec’s assertions, as Goodwood and Mr Lee submit, the evidence (especially the documentary records) show that Goodwood conducted due financial diligence on SPPL as a potential trading partner from May 2015,151Foot Note 151×Lee’s AEIC at para 31.negotiated and secured the SPSPL Guarantee for a sum of US$5m before commencing the first trades with SPPLie,the June Contracts,152Foot Note 152×Lee’s AEIC at para 32 to 34.discussed the June and July deals via emails and executed the June and July Contracts to formalise the deals. 112 Concurrently, there were also discussions and formalisation of the deals for purchase of the fuel oil from BMS (with Mr Arif as the contact person) by Digiland (through Mr Lim K H). Indeed, I accept that as an intermediary for BMS and SSPL, Goodwood and Mr Lee only knew (and dealt with) BMS, IEG/Digiland and SPPL for the June and July Contracts. They did not know about UA/Taigu, or any dealings of Mr Lim with BMS, SPPL or UA/Taigu. 113 Even if Goodwood and Mr Lee knew that the June and July Contracts formed part of circular chains of trading transactions, there remains insufficient evidence to indicate that Goodwood and Mr Lee knew that the fuel oil transacted was in fact non-existent and that therefore the circular chain of trading transactions was in fact a sham. After SPPL defaulted on its payment obligations, Goodwood sought to recover the outstanding sums under the July Contracts from SPPL. Upon learning of the involvement of UA and Taigu, and of SPPL’s difficulty getting paid from them, Goodwood and Mr Lee urged SPPL to take efforts to demand payments from them.153Foot Note 153×Lee’s AEIC at para 92.There was discussion on repayments in August and September 2015. After Southernpec raised its allegations on the fictitious nature of the transactions sometime around 22 September 2015,154Foot Note 154×3AB p 1870.Goodwood lodged a report to the Commercial Affairs Department on 16 October 2015 on the matter.155Foot Note 155×5AB pp 2999-3202. 114 In my view, by the whole of its conduct, Goodwood and Mr Lee demonstrated that they consistently treated the July Contracts as genuine. Therefore, Southernpec fails to displace the strong presumption that the July Contracts are valid and enforceable.",
        "Whether the July Contracts were performed": "115 I now turn to consider whether the July Contracts had been performed by Goodwood. For proof of delivery, Goodwood relies on the ITT certificate dated 3 July 2015 (in relation to 2,000.380 MT of fuel oil) and the ITT certificate dated 8 July 2015 (in relation to 1,200.627 MT of fuel oil). This, Goodwood contends, is in accordance with cl 6 of the July Contracts (see [38(d)] above).156Foot Note 156×Lee’s AEIC at paras 54(c), 54(d), 55(c) and 55(d).Pursuant to cl 8 of the July Contracts (see [38(f)] above), Goodwood issued an invoice dated 3 July 2015 for US$923,177.08 (which fell due on 30 July 2015) and another invoice dated 8 July 2015 for US$559,492.18 (which fell due on 4 August 2015). I should add that no Quality Analysis Reports were issued, contrary to cl 6 of the July Contracts, but as I observed at [39] above, this is not detrimental to Goodwood’s contention that it had performed its obligations under the July Contracts in accordance with cl 6. I also note Goodwood’s explanation that given that these were sleeving trades, the parties did not require the Quality Analysis Reports. 116 Instead, the issue turns on whether Goodwood is entitled to rely on SPSPL’s ITT certificates (which showed that the fuel oil transacted had actually been delivered by Goodwood, the “Contractual Seller”, to SPPL, the “Contractual Buyer”). The complication in this is that these documents, as well as the CRNs, according to Mr Loh’s evidence as set out at [88(b)] above, are falsified documents. Goodwood contends, on the basis of the doctrine of estoppel by representation or, alternatively, estoppel by convention, that SPPL and SPSPL cannot assert that the fuel oil did not exist and that the fuel oil was not delivered. 117 Southernpec, on the other hand, relies on several authorities for its position that such falsified documents could not be relied on to prove performance of a contract. Against this, Goodwood and Mr Lee argue that Southernpec could not rely on their allegations that their own documents were fictitious to avoid contractual liability,157Foot Note 157×GLCS at para 287.and seek to distinguish the authorities cited by Southernpec on that basis.",
        "Whether SPPL and SPSPL are estopped from denying the existence and delivery of the fuel oil": "118 The doctrine of estoppel by representation is an evidential doctrine used to set up the facts against which the parties’ rights and liabilities will be determined, which may have the effect of disposing of the substantive issue in the case:Phang([40]supra) at para 4.101. A party can be assisted in “enforcing a cause of action by preventing the defendant from denying the existence of some fact essential to establish the cause of action”:NipponMenkwa Kabushiki Kaisha (Japan Cotton Trading Company, Ltd) v Dawsons Bank Ltd(1935) 51 LI L Rep 147 at 150. The question, therefore, is whether the ITT certificates and the CRNs issued by SPSPL and SPPL amount to an estoppel by representation. If this question is answered in the affirmative, SPSPL and SPPL cannot then claim that the fuel oil did not exist and/or that it was not delivered. 119 For an estoppel by representation to arise, the representation must be clear and unambiguous, given the serious consequences of establishing an estoppel by representation:LinkforcePte Ltd v Kajima Overseas Asia Pte Ltd[2017] SGHC 46 at [18]. Also, it must be demonstrated that a party was encouraged to act to his detriment in reliance on the representation:Yokogawa Engineering Asia Pte Ltd vTranstel Engineering Pte Ltd[2009] 2 SLR(R) 532 at [18]. 120  Goodwood’s case is that the ITT certificates and the CRNs are representations by SPPL and SPSPL to the effect that:158Foot Note 158×GLCS at para 303. (a) SPPL was the legal holder of the fuel oil sold under the July Contracts, which was held in its own lawful possession or by SPSPL acting as SPPL’s agent and/or on its behalf; (b) SPPL had released the fuel oil cargo stored in ship tanks 3C and 4C for the 1,200 MT and 2,000 MT transactions respectively to the “receiver”; (c) the volumes of fuel oil as stated in the ITT certificates existed; and (d) delivery of those volumes of fuel oil from ship tanks 3C to 2C (for the 1,200 MT transaction) and from ship tanks 4C to 2C (for the 2,000 MT transaction) had taken place aboard the MTStar Brighton 3 July 2015 and 8 July 2015 respectively, as described in the ITT certificates. 121 Goodwood contends that the presentation of the ITT certificates was the basis on which Goodwood had paid BMS in accordance with its contractual obligations under the July Arrangements. Goodwood had therefore suffered detriment in reliance on the representations described above.159Foot Note 159×GLCS at para 306.Southernpec was therefore estopped by its representations from asserting that the fuel oil did not exist or that the fuel oil was not delivered.160Foot Note 160×GLCS at para 307. 122  Southernpec’s principal contention was that Goodwood could not have relied on the representations as Goodwood or Mr Lee knew that these were sham documents.161Foot Note 161×SPCS at para 406.As I found at [93], I did not think that there was any evidence to support this allegation. 123 Alternatively, Southernpec raise three points. (a) First, Goodwood could not have relied on the ITT certificates to enter into or “substantially perform” the July Contracts162Foot Note 162×SPCS at para 407.1.as they had executed their invoices on 3 and 8 July 2015,163Foot Note 163×3AB at pp 1506 and 1524.while, according to Mr Lee, Goodwood had only received the ITT certificates on 16 July 2015.164Foot Note 164×Lee’s AEIC at para 54(c).I accept Goodwood’s explanation that although the invoices were dated 3 and 8 July 2015, they were only issued on 27 and 28 July 2015 after the ITT certificates had been received from BMS. As Goodwood pointed out, this must have been the case in order for Goodwood to know the precise amount of fuel oil (ie,the amounts as stated in the ITT certificates) to invoice for.165Foot Note 165×GLRCS at para 171; Lee’s AEIC at 149. (b) Second, Goodwood could not have relied on the ITT certificates to pay BMS because the BMS sales confirmations indicated that the ITTs took place aboard the MTMarine Star, while the corresponding ITT certificates stated that the ITTs took place aboard the MTStarBrightinstead.166Foot Note 166×SPCS at para 407.2.Goodwood explained that these were typographical errors and that all the parties understood that the inter-tank transfers were to be conducted aboard the MTStar Bright.167Foot Note 167×GLRCS at para 172.In my view, although it was unsatisfactory for BMS not to have corrected the typographical errors in their sales confirmations, Goodwood, as a sleeving party between BMS and SPPL, had no reason to reject the ITT certificates as a basis for paying BMS while expecting that the same ITT certificates would be honoured in accordance with the July Contracts. (c)  Third, Goodwood led no evidence concerning reliance as according to Mr Lee, he only knew about the July Contracts on or about 30 July 2015. He therefore did not know when the July Contracts were first made and when they were performed.168Foot Note 168×SPCS at para 407.3.However, I do not see how this is relevant to whether Goodwood had relied on the ITT certificates in making payment to BMS. In my view, since there was insufficient evidence to say that Goodwood knew that the July Arrangement was a sham, it follows that there was no reason for Goodwoodnotto have relied on the ITT certificates in making payment to BMS, since that was the only proof of performance contemplated under the relevant sales agreements. 124 For the above reasons, I am of the view that SPPL is estopped by representation from denying that the July Contracts were performed. I do not consider it necessary to deal with estoppel by convention.",
        "Whether falsified documents could be relied on to prove contractual performance": "125 I now turn to consider the authorities relied on by Southernpec in support of its position that the falsified documents could not be relied on to prove contractual performance. These areRafsanjanPistachio Producers Co-operative v Bank Leumi (UK) Plc[1992] 1 Lloyd’s Rep 513 (“Rafsanjan”),Lambias(Importers & Exporters) Co Pte Ltd v Hongkong & Shanghai Banking Corp[1993] 1 SLR(R) 752 (“Lambias”),Beam Technology (Mfg) Pte Ltd v Standard Chartered Bank[2003] 1 SLR(R) 597 (“Beam Technology”) andHindley v East Indian Produce Co Ltd[1973] 2 Lloyd’s Rep 515 (“Hindley”). 126 InRafsanjan, the defendant bank refused to make payment under four letters of credit (“L/Cs”) it had granted because the plaintiff had failed to comply with the documentary requirements stated therein. When the plaintiff commenced legal action for payment under the L/Cs, the defendant bank alleged that the L/Cs had been procured by a fraud to which the plaintiff was a party. Hirst J found that the plaintiff was a party to the fraudulent procurement of the L/Cs and therefore found in favour of the defendant bank on the basis that the plaintiff could not be allowed to benefit from its own fraud (at 539). 127 This “fraud exception” is clearly based on the well-established “fraud principle”, that a party may not benefit from his own fraud, and in particular may not, for the purposes of enforcing an agreement, rely on documents which contain material representations of fact that to his knowledge are untrue:United City Merchants (Investments) Ltdand Glass Fibres and Equipments Ltd v Royal Bank of Canada, Vitrorefuerzos SA and Banco Continental SA (incorporated in Canada)[1983] AC 168 at 183. In the same vein, it is well-established that a party is not entitled to rely on his own fraud or illegality to assist a claim or rebut a presumption:Tinsley v Milligan[1994] 1 AC 340 at 366. The “fraud principle” therefore undermines both the shield and sword in the hands of a dishonest party. The present case, however, falls outside the “fraud exception”. As I found above, Goodwood and Mr Lee werenotaware that the ITT certificates and CRNs were false. There was therefore no fraudulent misrepresentation by Goodwood and Mr Lee as to the validity of the ITT certificates and CRNs and no dishonest presentation of the same. 128 Indeed, in my view, the common thread running throughRafsanjanandBeam Technologyis that the court will be very hesitant to allow a party to rely on its own fraudulent document (Rafsanjan), or a fraudulent document in which preparation it had assisted in some way (Beam Technologyat [37]), to enforce against or to evade the enforcement of contractual rights by an innocent party. Here, the “fraud principle” embodied in these cases applies with full force. In my judgment, Southernpec’s shield, that the ITTs and CRNs are not genuine documents, is undermined by the fraudulent preparation of those documents by SPSPL. To hold otherwise wouldrewardsellers of goods for their fraudulent preparation of delivery documentation by affording them an “escape hatch” from their contractual obligations, which they can decide to use as and when it benefits them. This is an untenable result. 129 As forHindley([125]supra), I agree with Goodwood that it is of no assistance to Southernpec. The case concerned a bill of lading for goods which had never been shipped. Kerr J held that it was “an implied term of a contract of this nature that the bill of lading shall not only appear to be true and accurate in the material statements which it contains, but that such statements shall in fact be true and accurate”. Thus, the seller was in breach of the contract. The present case, however, does not justify the implication of such a condition on Goodwood. I should also mention that inLambias([125]supra), the plaintiffs were not allowed to rely on a forged document notwithstanding that their conduct fell short of fraud, because their failure to act with care and circumspection in producing documents in conformity with the contractual requirements contributed to the fraud (at [68]).Lambiashowever is clearly distinguishable because in the present case, Goodwood was not involved in the production of the documents they relied on at all. Instead, it was SPSPL which, on SPPL’s instructions, issued the allegedly false ITT certificates, representing that delivery of fuel oil was completed. It does not lie in SPSPL’s or SPPL’s mouth to then self-servingly reject the very ITT certificates they had issued or procured on the basis that the ITT certificates were not true and accurate delivery documents. For completeness, I should reiterate that any involvement of Mr Lim would not be attributable to Goodwood. 130 On the basis of the foregoing, I find that Goodwood may rely on the ITT certificates and the CRNs issued by SPSPL (with the full knowledge of SPPL) in its claims against SPPL and SPSPL. I accordingly find that the July Contracts were duly performed, and that Goodwood is entitled to seek payment of the monies owed thereunder against SPPL. As such, it is unnecessary for me to consider Goodwood’s alternative case in fraudulent or negligent misrepresentation. I shall deal with further points in relation to the claim against SPSPL below.",
        "Whether SPSPL is liable under the SPSPL Guarantee": "131 The SPSPL Guarantee (the validity of which SPSPL does not dispute169Foot Note 169×SPCS at para 420.) is meant to provide security to Goodwood in relation to agreements for the sale of goods by Goodwood to SSPL (the “Agreements”).170Foot Note 170×2AB at p 1028.Goodwood’s claims for the sums due from SPPL under the July Contracts rest, principally, on cll 2.1 and 1.1 of the SPSPL Guarantee. 132 Clause 2.1 reads as follows:171Foot Note 171×2AB at p 1030. 2.1Guarantee. In consideration of [Goodwood] entering into the Agreements with [SPPL] on the terms and conditions therein, [SPSPL] hereby unconditionally and irrevocably: (a)Guarantee: guarantees to [Goodwood], as a continuing obligation, the due and punctual payment, discharge and performance by [SPPL] of the Guaranteed Liabilities; and (b)Undertaking to Pay: undertakes that, if and whenever [SPPL] defaults in the payment, discharge and performance when due of any of the Guaranteed Liabilities, [SPSPL] shall on demand by [Goodwood] pay, discharge or perform the same, PROVIDED ALWAYS that the total amount recoverable under the guarantee in thisClause 2.1(Guarantee) from [SPSPL] shall not exceed the sum of United States Dollars Five Million only (US$5,000,000.00). 133 “Guaranteed Liabilities” is defined in cl 1.1 in the following terms: … all present and future duties, obligations and liabilities of the Obligors under the Transaction Documents, including all duties, obligations and liabilities to pay all monies of whatsoever nature which may from time to time be or become owing or payable by the Obligors to [Goodwood] under, in connection with or arising out of the Transaction Documents; “Obligors” include both SPPL and SPSPL. 134 “Transaction Documents”, in turn, refers to: … (i) the Agreements, (ii) any Security Documents, (iii) any document entered into or made in connection with any of the Agreements, or (vi)(sic)any other document from time to time designated as a Transaction Document by [SPSPL] and/or [SPPL], and [Goodwood]; 135 Plainly, the July Contracts are “Agreements” under the SPSPL Guarantee, and the sums due under the July Contracts are covered as guaranteed liabilities by the SPSPL Guarantee. As I have found that the July Contracts were not shams, SPSPL’s arguments that the SPSPL Guarantee does not apply to sham transactions172Foot Note 172×SPCS at para 422.are accordingly inapplicable. I therefore find that SPSPL is liable under the SPSPL Guarantee to Goodwood for the sums payable by SPPL under the July Contracts.",
        "Whether Goodwood, Mr Lee and Mr Lim are liable for the tort of conspiracy": "136 SPPL’s and SPSPL’s counterclaim (in S 1245 and S 51 respectively) against Goodwood, Mr Lee and Mr Lim for lawful or unlawful means conspiracy is grounded on the assertion that these three parties had allegedly acted in concert with BMS, Mr Kounalakis and Mr Arif to take the “false position” that the June and July Contracts and Arrangements were genuine (ie,by the commencement of legal proceedings, the issuance of statutory demands and the giving of false evidence) in order to set SPPL and SPSPL up as the “fall guys” to ultimately bear the consequences of UA’s failure to pay its debts under the July Arrangement.173Foot Note 173×SPCS at para 543 (unlawful means conspiracy); para 600 (lawful means conspiracy). 137 The four elements of lawful or unlawful means conspiracy as set out below must be established on the facts before a claim in lawful or unlawful means conspiracy can succeed:EFT Holdings, Inc and another vMarinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”) at [112]: (a) a combination of two or more persons to do certain acts; (b) the alleged conspirators had: (i) the intention to cause damage or injury to the plaintiff by acts which were unlawful (in a claim for unlawful means conspiracy), or (ii) thepredominantintention to cause damage or injury to the plaintiff by acts which were lawful (in a claim for lawful means conspiracy) (at [73]); (c) the acts were performed in furtherance of the agreement; and (d) the plaintiff suffered loss as a result of the conspiracy. 138 In my judgment, the claims in unlawful means conspiracy fail against Goodwood and Mr Lee as a consequence of my finding that the July Contracts were not shams but were in fact lawful and enforceable bargains. Goodwood and Mr Lee were therefore fully entitled to take legal action to enforce the July Contracts to protect their own interests. For the same reason, I also find that the claims in lawful means conspiracy against Goodwood and Mr Lee fail as they did not have the predominant intention to injure SPPL and SPSPL. A lawful act predominantly motivated by self-interest will generally not furnish a basis for lawful means conspiracy as the predominant intention to injure is not present:MCH International Pte Ltd and others v YG Group Pte Ltd and others and other suits[2019] SGHC 43at [142];EFT Holdingsat [96]. 139 What remains of the counterclaim in lawful and unlawful means conspiracy against Mr Lim is based on the allegation that he had given false evidence that the July Arrangements were real and actionable, and thereby put Goodwood in a position to “try [its] luck in court and make claims for recovery of payment for the [July Contracts]”.174Foot Note 174×SPCS at para 605.This claim fails on the basis of ample authorities, both English and local, making it plain that no civil action in conspiracy (nor indeed in law) lies against witnesses in respect of “evidence prepared, given, adduced, or procured by them in the course of legal proceedings [because] the law protects witnesses and others, not for their benefit, but for a higher interest, namely, the advancement of public justice”: see,eg,Marrinanv Vibart[1963] 1 QB 528 at 536;Darker(as personal representative of Docker, deceased) v Chief Constable of the West Midlands Police[2000] 3 WLR 747 at 768;Times PublishingBhd and others v Sivadas[1988] 1 SLR(R) 572 at [44]–[45]; andTanaka Lumber Pte Ltd vDatuk Haji Mohammad Tufail bin Mahmud and another[2015] SGHC 276 at [55]. 140 In any event, for completeness, I should point out that on the evidence, Southernpec has also not shown that there was a “combination” (ie,any agreement) by all or some of the parties (ie,Goodwood, Mr Lee, Mr Lim, BMS, Mr Kounalakis and Mr Arif) for legal action to be taken against Southernpec. These claims therefore fail.",
        "Quantum of Goodwood’s claim": "141 Goodwood’s claim under the July Contracts and the SPSPL Guarantee against SPPL and SPSPL respectively are for the following:175Foot Note 175×SOC2-S51 at p 20. (a) the sum of US$1,491,669.26176Foot Note 176×3AB at p 1524 (US$559,492.18) and p 1610 (US$932,177.08).due under the two July Contracts; and (b) contractual interest under cl 8 of the two July Contracts,177Foot Note 177×SOC2-S51 at p 20.at the rate of 5.1885% per annum on US$932,177.08 from 30 July 2015 (being the due date for payment for the 2,000 MT deal) to the date of payment, and at the rate of 5.19075% per annum on US$559,492.18 from 4 August 2015 (being the due date for payment for the 1,200 MT deal) to the date of payment. 142 The quantum of these claims is not seriously disputed by Southernpec, and in light of my findings as to liability above, I see no reason why these amounts should not be awarded. 143 I note that Goodwood also claims against SPSPL a full indemnity for costs pursuant to cll 2.3, 7.1(b)(i) and 7.1(b)(ii) of the SPSPL Guarantee.178Foot Note 178×SOC2-S51 at pp 20 and 21.Apart from the costs for S 1245 and S 51, Goodwood seeks to recover as damages the costs for Originating Summons No 891 of 2015 (“OS 891”) and Originating Summons No 892 of 2015 (“OS 892”) where SPSPL and SPPL respectively obtained orders restraining Goodwood from presenting any applications to wind them up based on statutory demands served by Goodwood. In this connection, I consider it appropriate to hear parties further onallissues of costs, including the costs for OS 891 and OS 892.",
        "Conclusion": "144 From all of the above, I find that the July Contracts are not shams. SPPL and SPSPL are liable to Goodwood under the July Contracts and the SPSPL Guarantee respectively. Judgment is granted to Goodwood against SPPL and SPSPL in the sum of US$1,491,669.26 for the invoiced amounts under the July Contracts. Contractual interest is awarded at the rate of 5.1885% per annum on US$932,177.08 from 30 July 2015 to the date of payment, and at the rate of 5.19075% per annum on US$559,492.18 from 4 August 2015 to the date of payment. I dismiss SPPL’s and SPSPL’s claims based on the tort of conspiracy to injure. Parties are to provide their costs submissions, and apply for other consequential orders (if any), within two weeks of this judgment. Hoo Sheau PengJudge Khoo Boo Teck Randolph, Vanessa Chiam Hui Ting and Chan Jian Da (Drew & Napier LLC) for the plaintiff in the counterclaim in Suit 1245 of 2015; Koh Swee Yen, Quek Yi Zhi, Joel and Anand Shankar Tiwari s/o Sivakant Tiwari (WongPartnership LLP) for the fourth and fifth defendants in the counterclaim in Suit 1245 of 2015 and the plaintiff and the first and second defendants in the counterclaim in Suit 51 of 2016; Sim Chong, Phua Jun Han and Choong Jia Shun (Sim Chong LLC) for the defendant and plaintiff in the counterclaim in Suit 51 of 2016; Chacko Samuel and Angeline Soh Ean Leng (Legis Point LLC) for the sixth defendant in the counterclaim in Suit 1245 of 2015 and the third defendant in the counterclaim in Suit 51 of 2016."
    }
}