{
    "case_title": "Ong Heng Chuan vOng Teck Chuan and others",
    "ncitation": "[2020] SGHC 161",
    "coram": "Mavis Chionh Sze Chyi JC",
    "sections": {
        "Introduction": "1 The plaintiff (“OHC”), the first defendant (“OTC”), the second defendant (“OBC”) and the third defendant (“OSA”) are siblings.  They are the current shareholders of the fourth defendant, an exempt private company (the “Company”).  The Company is currently in compulsory liquidation pursuant to an order of court made on 12 July 2018 for its winding up. 2 OHC and OTC each hold 520,000 shares, which amount to about 17.33% of the total shares in the Company; OBC holds 1,760,000 shares (58.6%); and OSA holds 200,000 shares (6.67%).  Currently, according to the Company’s business profile on the Accounting and Corporate Regulatory Authority (“ACRA”) website, the only director of the Company is OTC: the ACRA profile shows that he was appointed as director on 30 December 2015.  It is not disputed that prior to OTC’s appointment on 30 December 2015, he was appointed as a director of the Company between 3 July 1984 and 14 April 2001.  In the present suit, OHC alleged that OTC also acted as ade factoand/or shadow director of the Company in the period between 14 January 2008 and 29 December 20151Foot Note 1×[6] and [7] of the Statement of Claim (Amendment No. 2)..  This allegation was disputed by OTC. 3 In respect of OBC, it is not disputed that he was previously appointed as a director of the Company from 16 August 1980 to 8 December 1983, and subsequently from 1 September 1999 until his resignation on 30 December 2015.  It is not disputed that for most of the period when OBC served as a director of the Company from the late 1990s to 30 December 2015, he was also running his own property development business, which was unrelated to the Tong Garden business.  In so far as the running of the Company was concerned, OHC alleged in the present suit that OBC was “accustomed to act[ing] on the directions and/or instructions and/or influence and/or wishes” of OTC in the period between 14 January 2008 and 29 December 20152Foot Note 2×[7] of the Statement of Claim (Amendment No. 2)..  This allegation was disputed by OBC and OTC. 4 OSA was a director of the Company from 10 April 1999 to 15 July 2009 (although OHC has alleged that she was “removed” sometime in 2008). 5 As for OHC, he was a director of the Company from 16 August 1980 until 7 May 2003.  During this period, he was also the managing director of the Company from 31 July 1999 until 7 May 2003.  An Extraordinary General Meeting (“EGM”) of the Company on 7 May 2003 voted not to re-elect him as director.  He was declared a bankrupt on 3 December 2004 and obtained a discharge from bankruptcy on 16 September 2016. 6 OHC brought the present suit against OTC and OBC pursuant to s 216 of the Companies Act (Cap 50, 2006 Rev Ed).  His Statement of Claim (Amendment No 2) made it clear that he had no complaint against OSA and had added her as a defendant only because of her shareholding in the Company3Foot Note 3×[39] of the Statement of Claim (Amendment No. 2)..  As against OTC and OBC, it was pleaded that “the affairs of the Company [had] been conducted and/or the powers of [OTC] and/or [OBC] as directors … and/or collectively as majority shareholders [had] been exercised in a manner oppressive to [OHC] and/or in disregard of and/or … prejudicial to [OHC’s] interests as a shareholder of the Company”4Foot Note 4×[37] of the Statement of Claim (Amendment No. 2)..  OHC sought an order for OTC and OBC to buy out his shares “without discount” and at a price which would factor in “appropriate adjustments to offset the effects of the oppressive conduct”; or in the alternative, an order for OTC to transfer to him shares (the number “to be determined”) in two Thai entities controlled by OTC (Tong Garden Co Ltd and NOI Food Industry Co Ltd) and in two other companies set up by OTC (Tong Garden Food (Singapore) Pte Ltd and Tong Garden Food (Malaysia) Sdn Bhd). 7 At the end of the trial, I dismissed OHC’s claims against OTC and OBC and ordered him to pay them costs.  As OHC has appealed against my decision, I set out my reasons in these written grounds.  I start by setting out the undisputed facts which form the background to the dispute between the parties.",
        "Background": "8 OHC, OTC, OBC and OSA are four of the ten children of the late Mr Ong Tong Guan (“the late Mr Ong”) and his wife, the late Mdm Chai Ah Hee.  The late Mr Ong set up a sole proprietorship, Tong Garden Product Services, in the 1960s, to sell snack food under the “Tong Garden” brand (“Tong Garden Business”).  In 1980, the Company – Tong Guan Food Products Pte Ltd – was incorporated.  It grew to become the ultimate holding company for a number of subsidiaries and associated companies (which the parties have referred to collectively as the “Tong Garden Group”) involved in the manufacture, marketing and sale of various snack products such as nuts, seeds and dried fruits. 9 Over the years, several of the siblings joined the Tong Garden Business – including OHC, OTC, OBC, OSA, and their eldest brother Ong Leong Chuan (“OLC”).  It is not disputed that the late Mr Ong remained in sole control of the business until he became ill in early 1984.  He passed away on 24 July 1984.  OHC, OTC, OBC and OSA are currently the only four shareholders of the Company after multiple changes in shareholdings over the years, these changes having resulted from “a multitude of legal actions between the siblings” and from sales by siblings uninvolved in running the Company of their shares to other siblings5Foot Note 5×[16] of the Statement of Claim (Amendment No. 2)..",
        "The subsidiaries and associated companies": "10 In his statement of claim, OHC has asserted – and the other three siblings agree – that the Company “is a pure holding company. It does not conduct any business. It derives revenue via its investments in the businesses of its subsidiaries and associated companies”6Foot Note 6×[22] of the Statement of Claim (Amendment No. 2)..  For the purposes of the present action, the relevant subsidiaries and associated companies were the following.",
        "The Singapore subsidiary": "11 Within the Tong Garden Group, Tong Garden Food Products Singapore Pte Ltd (“Food Products (S)”) was the main operating entity in Singapore.  It handled the manufacturing, sales and marketing of Tong Garden snack products in Singapore.  Incorporated in Singapore in 1994, it was a wholly-owned subsidiary of Tong Garden Holdings Pte Ltd (“TGHPL”) which was in turn a wholly-owned subsidiary of the Company. 12 Food Products (S) was wound up by way of a members’ voluntary liquidation on 8 July 2013.",
        "The Malaysian subsidiaries": "13 Tong Garden Food Products Sdn Bhd (“Food Products (M)”) was the manufacturing arm of the Tong Garden Group in Malaysia while Tong Garden Snack Food Sdn Bhd (“Snack Food (M)”) took care of sales and marketing in Malaysia.  Both were subsidiaries of Tong Garden Holdings Sdn Bhd, itself a subsidiary of TGHPL (which in turn was wholly owned by the Company). 14 Food Products (M) and Snack Food (M) are presently in liquidation.",
        "The Thai entities": "15 As to the Thai entities, it was OHC’s case in these proceedings that the Company had interests in the following three Thai companies prior to 20 July 20097Foot Note 7×[30] of the Statement of Claim (Amendment No. 2).: (a) Tong Garden Co Ltd (“Tong Garden (T)”); (b) Nut Candy House Co Ltd (“Nut Candy (T)”); and (c) NOI Food Industry Co Ltd (“NOI (T)”). 16 According to OHC:8Foot Note 8×[31] of the Statement of Claim (Amendment No. 2). The Company owned 39.99% of the issued shareholding of Tong Garden (T), with the remaining shares being held by NOI(T) and the Company’s nominees. Accordingly, the Company effectively controlled and owned Tong Garden (T).  Nut Candy (T) was a subsidiary of Tong Garden (T). The Company had an interest in NOI (T) through N.O.I. Food Products Pte Ltd which was wholly owned by [TGHPL], which is in turn wholly owned by the Company. 17 While OTC agreed that Tong Garden (T) was the main operating entity of the Tong Garden Group in Thailand and that NOI (T) was its subsidiary, it was OTC’s case that the Company had sold him its 39.99% shareholding in Tong Garden (T) via a sale and purchase agreement on 4 January 2001.  According to OTC, the “beneficial interest in the remaining 60.01% of the shareholding in Tong Garden (T)” belonged to him.  As for NOI (T), OTC asserted that it “was never a subsidiary or an associated company of the Company, and the Company has never had any direct or indirect interest in it”9Foot Note 9×[16] of the 1st Defendant’s Defence (Amendment No. 3).. 18 The corporate structure of the Tong Garden Group prior to March 2008 is set out in the chart contained in exhibit P1.  The corporate structure of the Tong Garden Group after March 2008 is set out in the chart in exhibit P2.  These two charts were tendered by OHC’s counsel.  The reason why OHC drew up the corporate structure charts prior to and after March 2008 was because on 15 March 2008, OTC and OBC had entered into an agreement concerning,inter alia, the transfer of OBC’s shares in the Tong Garden Group to OTC: OHC has alleged that this agreement was relevant to the acts of oppression he suffered.",
        "OHC’s allegations of minority oppression": "19 I will next summarise OHC’s case in respect of his claims of minority oppression.  At this juncture I will confine myself for the most part to what OHC has pleaded in his statement of claim.  It should be noted that in his evidence at trial, he deviated in a number of instances from the case pleaded in his statement of claim.  I will address the relevance and the effect of these deviations in the later part of these written grounds. 20 According to OHC, he had “legitimate expectations” as to how the Company should be run, which expectations were breached by OTC and OBC in their treatment and disposal of the trademarks, assets and business of subsidiaries and associated companies in Singapore, Malaysia and Thailand.  It should be highlighted that OHC’s case wasnotbased on the Company being (or being akin to) a quasi-partnership: he accepted that it was not.  Instead, he pleaded that his “legitimate expectations” as to how the Company should be run were “based on his strict legal rights under the Articles of Association of the Company, Section 157 of the Companies Act (Cap 50), common law and/or equity”10Foot Note 10×[36] of the Statement of Claim (Amendment No. 2)..  According to OHC, “[t]hese legal rights were derived from and/or based on the duties owed by [OTC] as ade jure,de factoand/or shadow director and/or [OBC] as ade juredirector at the material time”.  In his statement of claim, OHC pleaded that the duties owed by OTC and OBC were as follows: (a) that “[p]ursuant to Article 97(15) of the Articles of Association of the Company, the directors would enter into contracts and/or vary contracts, and do all things on behalf of the Company as they may consider expedient or otherwise for the purposes of the Company”; (b) that the directors of the Company “would at all times act honestly and use reasonable diligence in the discharge of their duties”; (c) that the directors “would not make improper use of their position as directors to gain directly or indirectly an advantage for themselves or for any other person or cause detriment to the Company”; (d) that the directors “would always act in the interests of the Company and all shareholders”; (e) that the directors “would not place themselves in positions where their interests and the interests of the Company may conflict”; (f) that the directors “would use their powers for proper purposes and for the benefit of the Company and all shareholders”; and (g) that the directors “would not misapply the Company’s assets”. 21 In the present case, OHC’s case was that OTC and/or OBC had “whether acting by themselves or acting in concert … committed, procured and/or caused” certain “oppressive acts … to have taken place” which were “unfairly prejudicial to [OHC] and ... contrary to or departed from [the above] legitimate expectations … to the extent that it was grossly and manifestly unfair to [OHC]”11Foot Note 11×[38] of the Statement of Claim (Amendment No. 2)..  According to OHC, the allegedly oppressive conduct by OTC and OBC had “effectively resulted in the Company’s operations, assets (including trademarks) and business being unlawfully diverted, disposed and/or transferred to companies owned and/or controlled by [OTC] … without the knowledge of [OHC]”; further, that “[q)uite apart from the said unlawful diversion, disposal and/or transfer, no proper or adequate consideration was paid to the Company”12Foot Note 12×[91] of the Statement of Claim (Amendment No. 2).. 22 I next set out OHC’s allegations concerning the allegedly oppressive conduct perpetrated by OTC and OBC.  Before I do so, three general points need to be made first in order to provide context to these allegations. 23 Firstly, to reiterate, the Company was a holding company that carried out no business activities of its own; and as such, it derived its revenue – and indeed, its value – from its investments in the businesses of its subsidiaries and associated companies13Foot Note 13×See for e.g. [40] of the Statement of Claim (Amendment No. 2).. 24 Secondly, the transactions which OHC relied on in putting forward his claim of oppression were – to a large extent – not disputed by OTC and OBC in the sense that they did not dispute these transactions having taken place.  Where the parties differed was in their characterisation of the Company’s financial health at the time the allegedly oppressive acts were carried out – and, in that connection, their characterisation of the purpose and nature of these transactions.  Broadly speaking, OHC’s case was premised on the Company having been a financially viable – indeed, a “flourishing”14Foot Note 14×[19] of OHC’s AEIC.– commercial entity in possession of “extremely valuable” assets.  According to this narrative, OTC and OBC were the villains who “surreptitiously” engineered the diversion of the Company’s business and assets in order to benefit OTC and/or OBC. 25 According to OTC and OBC, however, the Company – and the wider Tong Garden Group – had long been mired in financial difficulties.  According to their narrative, things had gotten so dire that by 2007, none of the Ong siblings wanted anything more to do with the Tong Garden business as they saw it as a sinking ship.  It was in this context that OBC – then the majority shareholder and one of only two remaining directors of the Company – had approached OTC for help.  The transactions on which OHC relied in advancing his oppression claim were in fact part of a larger effort to wind down the entire Group’s business in an orderly manner, while preserving the reputation and standing of the brand started by their father. 26 Thirdly, OTC and OBC took the position that in any event, the acts which OHC complained of in the present suit – even if proven – were wrongs done to the Company and not to any individual shareholder of the Company.  In other words, OHC had suffered no loss or harm in his personal capacity other than an alleged diminution in the value of his shares; and his use of s 216 of the Companies Act in these circumstances constituted an abuse of process. 27 I will deal with the first set of transactions which – according to OHC – constituted oppressive acts carried out by OTC and OBC against him.  These were the transactions relating to the disposal of trademarks belonging to the Tong Garden Group.",
        "OHC’s account of the oppressive acts carried out against him": "",
        "The disposal of the Tong Garden Group’s trademarks": "28 Prior to being wound up, Food Products (S) and Snack Food (M) sold Tong Garden snack products under the “Tong Garden” and “NOI” trademarks in Singapore, Malaysia and other countries such as Indonesia, the Philippines and Hong Kong15Foot Note 15×[137] of OHC’s AEIC..  The “Tong Garden” and “NOI” trademarks were owned by TGHPL, Food Products (S) and NOI Food Products Pte Ltd.  The latter two companies, according to OHC, were wholly owned by TGHPL which in turn was wholly owned by the Company – a state of affairs which in OHC’s view meant that “the Company was the beneficial owner of the trademarks”16Foot Note 16×[138] of OHC’s AEIC.. 29 By an agreement dated 13 March 200017Foot Note 17×Exhibit OTC-7 of OTC’s AEIC., the Tong Garden Group (through the Company, TGHPL, Food Products (S) and NOI Food Products Pte Ltd) sold,inter alia, the “Tong Garden” and “NOI” trademarks, together with the goodwill of the business relating to the goods in respect of which these trademarks were registered, to a company called Villawood Holdings Limited (“Villawood”).  A list of the trademarks registered to entities within the Tong Garden Group as at March 2000 – and transferred to Villawood through the said sale and purchase transaction – can be found in the schedule to the agreement of 13 March 200018Foot Note 18×pp 143-144 of OTC’s AEIC..  The consideration paid by Villawood was a sum of S$260,003.  It is not disputed that Villawood is a company incorporated in the British Virgin Islands, and that it is owned and controlled by OBC and his wife who was also a director of the said company at the material time. 30 In his statement of claim, OHC pleaded that the agreement of 13 March 2000 concerned the transfer of trademarks that were initially registered in the name of the Company, Food Products (S), TGHPL, and NOI Food Products Pte Ltd, as well as the benefit of trademark applications in the names of these companies for trademarks which were pending registration19Foot Note 19×[44A] of the Statement of Claim (Amendment No. 2).(collectively, the “Registered Trademarks”).  It was further pleaded that in relation to the “Tong Garden” and “NOI” trademarks which had not been registered, the Company owned these unregistered trademarks under common law by virtue of the reputation and goodwill in these unregistered trademarks used in conjunction with the business operated by the Company through its subsidiaries20Foot Note 20×[44C] of the Statement of Claim (Amendment No. 2).(the “Common Law Trademarks”).  The Registered Trademarks and Common Law Trademarks are collectively referred to as “the Trademarks” in OHC’s statement of claim. 31 It is not disputed that the following events took place in the period prior to the sale of the Trademarks.  In 1998, the Tong Garden Group was facing pressure from,inter alia, UOB Venture Investments Limited (“UOBVI”) and UOB Venture Investments II Limited (“UOBVII”) (collectively, the “UOB Entities”) regarding its liability for certain investments made by the UOB Entities into the Tong Garden Business.  On 18 August 1998, the UOB Entities claimed that default had occurred in relation to an investment agreement whereby the UOB Entities had granted TGHPL a convertible bond of $1.5m.  In Suit No 1390 of 1998 (“Suit 1390”), the UOB Entities sued TGHPL – as well as the Company, OLC, OHC, OTC, Tong Garden (T) and NOI (T) – for immediate repayment of the $1.5m with accrued interest21Foot Note 21×Exhibit OTC-2 of OTC’s AEIC..  In October 1999, OHC, OBC and OTC agreed to carry out a rights issue to raise the Company’s capital for the purpose of negotiating a settlement of Suit 1390.  Suit 1390 was settled via an agreement to pay the UOB Entities an 18% penalty on top of the debt amount22Foot Note 22×[65] of OTC’s AEIC.. 32 Separately, on 26 August 1999, UOBVI served a notice on TGHPL to redeem preference shares granted to UOBVI pursuant to an investment agreement dated 12 December 1995 (the “1995 UOB Agreement”). Pursuant to the 1995 UOB Agreement, UOBVI had invested a sum of $3.5m in TGHPL by subscribing for redeemable convertible preference shares (the “Preference Shares”) in TGHPL23Foot Note 23×Exhibit OTC-32 of OTC’s AEIC.: the price of the redemption of these Preference Shares in the event of default was $3.5m plus interest (the “Redemption Price”).  In its notice dated 26 August 1999, UOBVI noted that an event of default had occurred, and “in light of the continuing disagreement between the Directors of the company”, it wanted the Preference Shares redeemed at the Redemption Price. 33 On 12 November 1999, TGHPL held an EGM24Foot Note 24×Exhibit OTC-4 of OTC’s AEIC., whereby it was resolved that the directors “whenever deemed appropriate and in the best interest of the Company, [would] be authorised to sell any of the Company properties or assets to raise funds for the redemption RCP shares held in the name of UOBVI”.  The resolution further provided that any such sales “shall be at valuation price or market price as may be determined” by any of the firms named in the resolution – namely, KPMG Peat Marwick, Arthur Anderson & Co, and PricewaterhouseCoopers. 34 PricewaterhouseCoopers Management Services Pte Ltd (“PWC”) was engaged by OHC in his capacity as the then managing director of TGHPL to “provide a desktop valuation of the “Tong Garden” brand (including the “NOI” brand) for Singapore and Malaysia”25Foot Note 25×[140] of OHC’s AEIC..  In their report dated 17 February 2000, PWC opined that the value of the “Tong Garden” and the “NOI” brand names was “estimated to be in the range of S$200,000 – S$260,000”26Foot Note 26×Exhibit OTC-5 of OTC’s AEIC.. 35 The purchase consideration of S$260,003 was accordingly based on PWC’s valuation.  The agreement to sell the Trademarks to Villawood was approved by a TGHPL director’s resolution on 17 March 2000.  It should be noted that by 2000, UOBVI’s claim against TGHPL for redemption of the Preference Shares under the 1995 UOB Agreement had taken a litigious turn via the former’s commencement of Suit No 84 of 2000.  The payment made by Villawood went towards part payment of TGHPL’s liability to UOBVI27Foot Note 27×Exhibit OTC-8 of OTC’s AEIC.. 36 In pursuing his present claim for oppression, however, OHC took the position that the sum of S$260,003 paid by Villawood “did not in any way reflect the true value” of the “Tong Garden” and “NOI” trademarks28Foot Note 28×[44] of the Statement of Claim (Amendment No. 2)..  According to OHC, the Trademarks were “the most valuable asset of the Tong Garden Group”.  He claimed that the reason why these valuable assets were sold to Villawood was to “protect” them “by transferring them offshore on a temporary basis”29Foot Note 29×[44] of the Statement of Claim (Amendment No. 2)..  In OHC’s statement of claim, it was not stated what the Trademarks were to be “protected” from.  Nevertheless, he asserted that the “intention” was for them “to ultimately be returned to companies within the Tong Garden Group at a later stage”.  He did not plead the date when this “return” of the Trademarks was to take place.  According to him, OTC and OBC owed the following fiduciary duties to the Company in relation to the Trademarks transferred to Villawood30Foot Note 30×[44D] of the Statement of Claim (Amendment No. 2).: (a) to ensure that the Registered Trademarks “as substantial assets of the Company, were protected and preserved, whilst registered in the name of Villawood”; (b) to procure Villawood to “grant the necessary permissions and licences to the companies within the Tong Garden Group to use the Trademarks (such that the Company ultimately benefitted from the use of the Trademarks) until such time that the Trademarks are returned or transferred to the Company and/or companies within the Tong Garden Group”; (c) to ensure that Villawood “would not dispose and/or transfer any of the Trademarks to any entity which was not within the Tong Garden Group thereby preventing the benefit from the use of the Trademarks accruing to the Company as the ultimate holding company and beneficial owner of the Trademarks”; and (d) to ensure that “no other entity apart from the Company and/or its subsidiaries would apply for or obtain any further ancillary or concurrent trademark rights (registered or otherwise) based on any of the Trademarks”. 37 Sometime in October 2002, Villawood granted a ten-year licence to Food Products (S) and Snack Food (M) to manufacture and sell products bearing,inter alia, the “Tong Garden” and “NOI” trademarks.  As this licence was to run with effect from 13 March 2000, it would have expired on 13 March 2010.  It was not renewed.  Nor were the Trademarks “returned” to the Tong Garden Group.  According to OHC, “[w]ithout ownership of the trademarks or at the very least, the right to use the trademarks, the Company (through its subsidiaries) was not able to manufacture, distribute and/or sell the various Tong Garden Products”31Foot Note 31×[190] of OHC’s AEIC.. 38 OHC claimed that he only found out about this state of affairs in 2015.  It was in 2015 that he came to realise that Tong Garden snack products were being manufactured, marketed and sold in Singapore and Malaysia by Tong Garden Food (Singapore) Pte Ltd and Tong Garden Food (Malaysia) Sdn Bhd – entities which were not actually part of the Tong Garden Group32Foot Note 32×[49] of the Statement of Claim (Amendment No. 2)..  Tong Garden Food (Singapore) Pte Ltd was incorporated on 7 March 2008 with OTC as its sole director: it is wholly owned by a company known as OTC Food Corporation Pte Ltd.  As for Tong Garden Food (Malaysia) Sdn Bhd, it was incorporated on 3 April 2008 and is 99% owned by OTC Food Corporation Pte Ltd (the other two shareholders being OTC and his wife, each with one share).  OTC is one of the directors of Tong Garden Food (Malaysia) Sdn Bhd.  OTC Food Corporation Pte Ltd was incorporated on 12 September 2014 and is wholly owned by OTC, who is also a director of the said company. 39 Broadly, therefore, OHC’s case was that OTC and OBC had breached their fiduciary duties to the Company by “surreptitiously” arranging for the “diversion” of “valuable” trademark assets to entities owned and/or controlled by OTC, so as to benefit OTC at the expense of the Company and its shareholders.  As to how this was allegedly done, OHC provided a number of details in his affidavit of evidence-in-chief (“AEIC”).  Prior to the expiry of the ten-year licence in March 2010, Villawood had written to Food Products (S) and Snack Food (M) on 8 February 2010 to notify them that the licence would not be renewed33Foot Note 33×Exhibit OHC-100 of OHC’s AEIC..  On 13 March 2010, Villawood entered into a Trademarks Licence Agreement with Tong Garden Food (Singapore) Pte Ltd and Tong Garden Food (Malaysia) Sdn Bhd respectively34Foot Note 34×Exhibit OHC-101 of OHC’s AEIC..  Through these agreements, Villawood granted each company a perpetual, irrevocable and exclusive licence to market, manufacture and sell products under (inter alia) the “Tong Garden” and the “NOI” trademarks – including the “Tong Garden” trademark registered via Trade Mark Registration No T9510191B – in Singapore and Malaysia respectively. 40 It will be recalled that in addition to the Registered Trademarks, OHC had pleaded that the Company also owned under common law those “Tong Garden” and “NOI” trademarks which had not been registered.  It was OHC’s case that post 13 March 2000, the Company remained “the beneficial owner of all the goodwill, intellectual property rights, title and interest in or arising from the use of” the Common Law Trademarks35Foot Note 35×[44C] of the Statement of Claim (Amendment No. 2.  According to OHC, therefore, any registration of the Common Law Trademarks “had to be effected in the name of the Company or any of the companies within the Tong Garden Group with the approval of the Company”36Foot Note 36×[55D] of the Statement of Claim (Amendment No. 2)..  Notwithstanding this, OTC and/or OBC were said to have procured Villawood to apply to register the “Tong Garden” trademark via Trade Mark Registration No T0914609F in the name of Villawood before arranging for its “subsequent transfer to [OTC]’s company”.  The Company, which had been “the owner of the Common Law Trademarks”, “ultimately lost ownership of the said asset” as a result of the registration in the name of Villawood. 41 All these trademarks – including Trade Mark Registration No T9510191B and Trade Mark Registration No T0914609F – were subsequently transferred to Tong Garden Food (Singapore) Pte Ltd on 9 November 2015 and thereafter to OTG Enterprise Pte Ltd on 8 April 2016. OTG Enterprise Pte Ltd was incorporated on 8 April 2016 and is wholly owned by OTC.  OHC asserted that it was by virtue of the above acts that the “Tong Garden” trademarks (via Trade Mark Registration Nos T9510191B and T0914609F) came to be effectively owned by OTC37Foot Note 37×[56] of the Statement of Claim (Amendment No. 2)..  OHC contended that38Foot Note 38×[190] of OHC’s AEIC.– … These assets have been diverted to OTC’s companies for the benefit of OTC and/or OBC, at my expense.  Without ownership of the trademarks or at the very least, the right to use the trademarks, the Company (through its subsidiaries) was not able to manufacture, distribute and/or sell the various Tong Garden Products – which was the very core of the Tong Garden Group’s business.",
        "The agreement dated 15 March 2008 between OTC and OBC and the subsequent disposal of the Company’s assets and business": "42 The treatment of the Tong Garden Group’s trademarks formed an important aspect of OHC’s case theory.  To recap, his case theory postulated that OTC and OBC had set about to divest the Company of its “extremely valuable” assets – including but not limited to, the Trademarks – and ultimately its business; further, that they did so in order that OTC would be able to advance his “personal commercial interests” at the expense of the interests of the Company and its shareholders.  The agreement between OTC and OBC dated 15 March 2008 (the “15 March 2008 agreement”39Foot Note 39×Exhibit OTC-34 of OTC’s AEIC.) formed the next plank on which OHC’s case theory was built. 43 Pursuant to the 15 March 2008 agreement, it was provided that – 1. [OBC] shall sell and/or procure the sale to and [OTC] shall purchase for the consideration of S$7,000,000.00 (Singapore Dollars Seven Million Only): a) all the shares of [OBC] in the Tong Garden Group. b) all of the debts owed to [OBC] by the Tong Garden Group. c) the trademark “Tong Garden” owned by Villawood Holdings Limited. 44 OHC claimed that the 15 March 2008 agreement was a “secret deal”40Foot Note 40×[165] of OHC’s AEIC.between OTC and OBC; and that following this “secret deal”, OTC was able – with OBC’s connivance – to divert to his own companies “the Company’s assets, manpower, infrastructure, information relating to distribution networks and customers, and logistics”41Foot Note 41×[170] of OHC’s AEIC..  I have already dealt with OHC’s allegations about the treatment of the Tong Garden Group’s trademarks which (according to OHC) the Company was the beneficial owner of.  OHC contended that aside from the Trademarks, OTC also “misappropriated” the Company’s “tangible plants and equipment” as well as its “extremely valuable intangible assets such as technical knowhow and distribution networks”. 45 In alleging these “misappropriations”, OHC relied,inter alia, on the distributorship agreement which Tong Garden Food (Singapore) Pte Ltd entered into with Food Products (S) and Food Products (M), and the distributorship agreement which Tong Garden Marketing Sdn Bhd entered into with Snack Food (M) and Food Products (M)42Foot Note 42×Exhibit OHC-96 of OHC’s AEIC..  Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd are two of the companies ultimately controlled by OTC.  The distributorship agreements were entered into on 14 August 2009.  Pursuant to these distributorship agreements, Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd were appointed the sole and exclusive distributor of peanuts and other snack foods in Singapore and Malaysia respectively.  Food Products (S) and Snack Food (M) were to cease carrying on the business of developing and selling these snack foods, while providing Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd with such promotional materials, information, expertise, know-how and other assistance as the latter two companies might reasonably require.  It was also agreed as part of these distributorship agreements that the profits from the sale and distribution of the products would be shared among the various entities in the following proportions: 60% to Tong Garden Food (Singapore) Pte Ltd or Tong Garden Marketing Sdn Bhd (as the case might be), and the remaining 40% to Food Products (S) or Snack Food (M) (as the case might be). 46 Aside from the allegations about the “misappropriation” of “extremely valuable intangible assets such as technical knowhow and distribution networks”, OHC also pointed to invoices showing, firstly, that Food Products (S) had seconded staff to Tong Garden Food (Singapore) Pte Ltd for the periods August to December 2008 and January to December 2009 (excluding November 2009); secondly, that Tong Garden Food (Singapore) Pte Ltd had rented motor vehicles and office premises from Food Products (S) between June and December 200843Foot Note 43×[174] and exhibit OHC-94 of OHC’s AEIC..  The relevance of these matters was not made clear in OHC’s AEIC.  The suggestion seemed to be that having acquired the Trademarks, the “technical know-how” and the “distribution networks” of the various Tong Garden Group entities, OTC made further inroads into the business activities and capabilities of these entities by making use of their vehicles and premises. 47 Indeed, according to OHC, it was not too long after the 2009 distributorship agreements that Food Products (S), Food Products (M) and Snack Food (M) were put into voluntary liquidation between 2012 and 201444Foot Note 44×[191]-[196] of OHC’s AEIC..",
        "The disposal of the Thai entities": "226 I come next to the third act of oppression alleged by OHC: the disposal of the Thai entities.  This concerned the 2001 Thailand SPA, pursuant to which OTC had contracted to purchase from the Company “the whole of [its] undertaking” in “the Territory” (defined as being Thailand, Laos, Cambodia, Vietnam and Myanmar) and “the goodwill and all other assets” situated in “the Territory”.  To recap, it was not disputed that despite the broad definition of “the Territory”, the only relevant business entities at the material time were the Thai entities.  It was also not disputed that the purchase price was to be based on the NTA of Tong Garden (T) for the year ended 31 December 2000 “after making appropriate adjustment for difference in inter company balances”.  It will be recalled that for various reasons, the valuation was not carried out until 2009, when OTC and the Company (represented by OBC) signed the Variation Agreement of 20 July 2009.  OHC’s case was that the Thai shares should have been valued as at 2009 and not 31 December 2000.  This was because a valuation report obtained shortly after the signing of the Variation Agreement put the fair market value of Tong Garden (T) shares as at 31 December 2000 at a negative figure.  It was OHC’s case that in proceeding to take 31 December 2000 as the relevant date for valuation, OTC and OBC were “act[ing] in concert” pursuant to a “scheme” they had “orchestrated” to “dispose and/or divert” the Thai entities’ shares to OTC “at a nominal price of S$2 in total, to further [OTC’s] personal commercial interests at the expense of the Company and its shareholders”247Foot Note 247×[87]-[88] of the Statement of Claim (Amendment No. 2).. The Company’s ownership of the Thai entities 227 I address first a preliminary point on which OHC took an opposing stance from that taken by OTC.  This concerned the extent of the Company’s ownership of the business entities in Thailand at the time the 2001 Thailand SPA was entered into.  In his statement of claim, OHC alleged that prior to 20 July 2009, the Company “effectively controlled and owned Tong Garden (T)”, and that it also “had an interest in NOI (T) through N.O.I. Food Products Pte Ltd which was wholly owned by [TGHPL], which is in turn wholly owned by the Company”248Foot Note 248×[31] of the Statement of Claim (Amendment No. 2)..  OHC claimed that whilst the Company held 39.99% of the issued shares in Tong Garden (T), the remaining shares were held by NOI (T) – which he claimed the Company had an interest in – and the Company’s nominees.  He also claimed that NOI Food Products Pte Ltd (“NOI (S)”) owned 49% of NOI (T)249Foot Note 249×[379] of the Plaintiff’s Closing Submissions.. 228 OHC’s claims were denied by OTC, who asserted that the Company had only a 39.99% shareholding in Tong Garden (T) which it agreed to sell to him under the 2001 Thailand SPA: the other 60% of the shareholding in Tong Garden (T) belonged beneficially to OTC.  OTC also asserted that “NOI (T) was never a subsidiary or an associated company of the Company, and the Company has never had any direct or indirect interest in it”250Foot Note 250×[16] of the 1st Defendant’s Defence (Amendment No. 3).. 229 I found OHC’s claims on this issue to be meritless.  His claims were contradicted by the documentary evidence adduced.  In the first place, OHC’s claim that the Company “effectivelycontrolled and owned” [emphasis added] Tong Garden (T) was suspiciously vague: in particular, he failed to specify the percentage of the Company’s interest in Tong Garden (T) purportedly derived from its interest in NOI (T).   In contrast, in his AEIC, OTC gave a detailed explanation as to why he asserted that the Company had owned only 39.99% of the Tong Garden (T) shareholding whilst the other 60% was owned beneficially by him251Foot Note 251×[147] of OTC’s AEIC..  In gist, Tong Garden (T) had owed the Company a sum of $635,000.  In or around 1996, out of this sum of $635,000, $254,000 was taken up as an investment by the Company in 39.99% of Tong Garden (T).  As for the balance $381,000, OTC had agreed to take over Tong Garden (T)’s obligation to repay the Company this sum; and this was recorded in the Company’s books as a debt owing from OTC instead of Tong Garden (T)252Foot Note 252×p 637 of OTC’s AEIC..  This arrangement was also noted in an Audit Adjustment done for Food Products (S) on 30 June 1996 – which, incidentally, OHC himself had signed off on253Foot Note 253×1AB 146-147.. 230 The fact that the Company’s interest in Tong Garden (T) stood at 39.99% was also recorded in the former’s own audited accounts254Foot Note 254×See e.g. 14 AB 7803 and 7826..  OHC has not been able to pinpoint any specific document which reflected the Company’s purported “effective” ownership of the other 60% of the Tong Garden (T) shareholding. 231 As for OHC’s claim that NOI (S) owned 49% of NOI (T), this was not corroborated by NOI (S)’s accounts: nowhere in NOI (S)’s accounts was there a record of the said company holding an interest in NOI (T). 232 Nut Candy (T) is a wholly-owned subsidiary of Tong Garden (T)’s.  Its accounts have been factored into Tong Garden (T)’s, for the purpose of determining the value of the Thai entities under the 2001 Thailand SPA255Foot Note 255×11AB 5848.. The use of Tong Garden (T)’s NTA as at 31 December 2000 for the valuation of the shares 233 Whilst OHC made a number of allegations about the 2001 Thailand SPA, in the end his objections came down to this: he was aggrieved about the use of Tong Garden (T)’s 31 December 2000 NTA for the valuation of its shares as he felt that this failed to take into account “the possible increases in the NTA of Tong Garden (T) over the said 8-year period”256Foot Note 256×[68] of the Statement of Claim (Amendment No. 2).and led to the sale of the shares (“the Tong Garden Group’s treasures”257Foot Note 257×[232] of OHC’s AEIC.) “at an immense undervalue”258Foot Note 258×[83] of the Statement of Claim (Amendment No. 2).. 234 I rejected OHC’s complaints for the following reasons. 235 In so far as OHC was suggesting that OTC and OBC had “engineered” the 2009 purchase price and that they had no basis for relying on the 31 December 2000 NTA figure to determine the price to be paid, this suggestion had no merit.  The use of the NTA as at 31 December 2000 was contractually provided for in clause 4 of the 2001 Thailand SPA.  It has never been OHC’s case that the 2001 Thailand SPA was invalid or void – even as at July 2009.  Clause 4 also provided that the NTA value would be “as per the audited accounts … after making appropriate adjustment for difference in inter company balances”259Foot Note 259×p 605 of OTC’s AEIC..  From the signatures affixed to the 2001 Thailand SPA (and it should be noted OHC signed the agreement on behalf of the Company), it would appear that the agreement was signed on 4 January 2001260Foot Note 260×p 602 of OTC’s AEIC..  In the circumstances, parties would plainly have contemplated that the valuation of the shares pursuant to clause 4 would not be capable of being conducted for some time yet.  That the parties had contemplated the prospect of some lag time between the signing of the agreement and the actual valuation was alluded to in an e-mail dated 15 January 2001 from the Company’s Stone Forest advisor Goh Hoi Lai (“Goh”) to OTC.  In that e-mail, Goh referenced not only the 2001 Thailand SPA but also the related agreement whereby OTC was to sell his shares in the Company to OHC, OBC and OSA before making the following comments261Foot Note 261×2AB 1084-1085.: … [T]o move forward and to prevent TG [ie,the Company] from collapsing, both parties should bury the past and must be willing to compromise, if need be …  Given the circumstances,we [ie, Stone Forest] are of the view that the most appropriate valuation method for [the Company] and TG (Thai) is to base on NTA, which is basically the paid up capital plus retained earnings or minus accumulated losses.  Both parties agreed.  The two S&P agreements were then drawn up such that both parties are bound by them even though the actual valuation will be known at a later date, upon completion of work by CLSF [ie, Stone Forest] or another independent party to be chosen by both parties. … [emphasis added] 236 Tellingly, despite having been aware of the potential lag in the valuation process, neither side found it necessary to provide in the 2001 Thailand SPA for the consequences of such lag.  There was certainly no move to include a provision for any changes to the NTA in the interim to be taken into account in the valuation. 237 In short, therefore, there was a valid contractual basis for OTC and OBC to have regard to Tong Garden (T)’s NTA as at 31 December 2000 at the time they were seeking to determine the price to be paid for the shares in mid-2009. 238 In so far as OHC sought to suggest that the CCK valuation in 2009 had substantially “undervalued” Tong Garden (T)’s NTA as at 31 December 2000, I also found no merit in this suggestion.  CC Koh & Co’s valuation – that the NTA of Tong Garden (T) was negative as at 31 December 2000 – accorded with contemporaneous evidence: the evidence showed that even as at 2000 to 2002, the Company was already recording negative NTA – and OHC must have been aware of the fact. 239 In particular, the Company’s financial statements for the year ended 30 June 1996 (which were signed off by OHC himself) had recorded an entry that the value of Tong Garden (T) was being written down to zero.  When confronted with these accounts in cross-examination, OHC at first said he did not know why he had signed the accounts “back then” – but subsequently conceded that they showed the Company had taken the view that its investment in Tong Garden (T) was worth zero as at 1996. 240 This state of affairs clearly did not improve in the years which followed.  In the Operational and Financial Review report which Stone Forest produced for the Tong Garden Group in September 2000, Stone Forest stated that Tong Garden (T)’s NTA as at 31 December 1999 was negative (-$1,577,721)262Foot Note 262×2AB 778..  Again, OHC could hardly have missed seeing this report: he was the one who had – on behalf of the Tong Garden Group – engaged Stone Forest to produce it.  Even after the signing of the 2001 Thailand SPA, references continued to be openly made to Tong Garden (T)’s negative NTA, on occasions where OHC was present.  For example, OHC was present at a meeting between Food Products (S) and OCBC on 26 March 2002 where OSA had informed OCBC of “the negative NTA in Thailand operations”263Foot Note 263×4AB 1982..  As another example, in a letter dated 7 February 2002 sent by OSA on the Company’s behalf, OHC was informed that the “Thailand operations” had “negative NTA and huge unreconciled amount”264Foot Note 264×4AB 1899..  If OHC had in fact held the belief as at 2001 that the Thai entities were valuable assets, one would have expected him to react to such information with shock and outrage.  He did not.  Just as oddly, in his testimony at trial, he gave no explanation at all for these communications. 241 The upshot, therefore, was that OHC’s claim about Tong Garden (T) having been a “valuable asset” simply could not be believed.  None of the Ong siblings – not even OHC – disputed the fact that post the 2001 Thailand SPA, OTC was left to run the business of the Thai entities on his own with no participation by the Company265Foot Note 265×See e.g. OBC’s testimony in cross-examination in transcript for 18 September 2019 at p 162 lines 3 to 25., even as the parties made somewhat half-hearted efforts to resolve the issues of valuation of and payment for the Tong Garden (T) shares.  I say these efforts were half-hearted because despite the Company complaining266Foot Note 266×See eg 4AB 1914.that OTC had failed to provide Tong Garden (T)’s accounts for the purpose of the valuation and even threatening at one point to sue267Foot Note 267×See eg 5AB 2421., no litigation was commenced, and no concrete actions were taken to follow up on the valuation of the shares until mid-2009.  If the Thai entities had indeed been the “jewels” in the Tong Garden Group’s “crown” as OHC claimed, then it was incredible that the Company should have been so lackadaisical about chasing up on the valuation of the shares and on getting paid for them. 242 The true state of affairs, in my view, was more probably than not that asserted by OTC: namely, that his siblings knew Tong Garden (T) was not doing well financially at the time the 2001 Thailand SPA was entered into, and they certainly did not regard it as a “valuable asset”.  This was reflected, for example, in OSA’s letter to IRAS on 30 November 2005268Foot Note 268×5AB 2673-2675..  The letter was written by OSA for the purpose of furnishing to IRAS information about the Tong Garden subsidiaries’ financial performance for the years of assessment 2000 and 2001; and in respect of Tong Garden (T), OSA referred to its dire financial state for the year of assessment 2000 in unambiguous terms: As our ultimate parent company owns 39.99% of the Thai company, we were fully aware of the financial position of the Thai company.  It was loss-making and it had a negative net asset value: see the relevant financial accounts of the Thai company.  There was no prospect of the Thai company paying any part of the debt of $2,297,000. That amount was irrecoverable; We did not then take any legal action against Tong Garden Co Ltd (Thailand) as it would be throwing good money after bad money.  We were fully aware of the financial position of the Thai company.  Being loss-making and with a negative net asset value, it was in no position to pay; In short, therefore, there was nothing contrived – or even surprising – about the negative NTA value that CC Koh & Co arrived at in its valuation. 243 In his statement of claim, OHC found it necessary to point out that the Variation Agreement of 20 July 2009 had changed the completion date of the 2001 Thailand SPA to 28 July 2009, and had also deleted the clause requiring OTC to tender his resignation from directorships within the Tong Garden Group – but it had not changed the purchase price for the Tong Garden (T) shares269Foot Note 269×[65] of the Statement of Claim (Amendment No. 2)..  However, no real elucidation was provided by OHC as to why the changes he had highlighted were in some way prejudicial to the Company’s interests.  As to the change in completion date, although completion of the 2001 Thailand SPA did not take place on the originally scheduled date of 17 April 2000 (per clause 9 of the agreement270Foot Note 270×p 606 of OTC’s AEIC.), parties had obviously anticipated such an eventuality; and clause 9 expressly provided that completion could take place on “such other date as may be mutually agreed by the parties”.  As to the deletion of the clause requiring OTC’s resignation from his directorships within the Tong Garden Group, this issue of OTC’s resignation was actually moot because on 23 February 2001, OTC had already tendered a letter271Foot Note 271×p 612 of OTC’s AEIC.stating his resignation as director of the Company, TGHPL and the Singaporean and Malaysian subsidiaries.  OTC’s resignation was noted in the minutes of the Company’s Board meeting on the same date272Foot Note 272×2AB 1101.. 244 OHC also alleged in his statement of claim that the transfer of the Thai entities – at a price based on the Tong Garden (T) NTA at 31 December 2000 – was a “scheme” which OTC and OBC had “surreptitiously engineered” in order to divert “valuable assets” to OTC273Foot Note 273×[87]-[88] of the Statement of Claim (Amendment No. 2)..  In this connection, it should be remembered that as at January 2001, the Company had already contracted to dispose of the Thai entities to OTC.  Indeed, as I have noted, OHC himself signed the 2001 Thailand SPA on behalf of the Company.  Throughout the years which followed the signing of the 2001 Thailand SPA, there was no attempt by the Company to question the validity of the agreement.  As I have also noted, OHC’s position in these proceedings was not that the agreement was in some ways invalid or void.  The use of the NTA value as at 31 December 2000 as the basis for valuation of the shares was contractually provided for (clause 4 of the 2001 Thailand SPA): it was not something which OTC and OBC “engineered” on their own in the Variation Agreement in July 2009. 245 As for the suggestion that OTC and OBC acted “surreptitiously” in bringing about the Variation Agreement, this was patently untrue.  The Variation Agreement was tabled for approval at an EGM on 8 October 2009.  Notice of this EGM was sent to the OA, in whom all of OHC’s property would have vested upon his bankruptcy274Foot Note 274×8AB 4046-4048..  In this respect, I found it significant that while OHC pleaded that the OA did not attend this EGM275Foot Note 275×[67] of the Statement of Claim (Amendment No. 2)., he carefully avoided saying anything about whether the OA had received the notice of the EGM.  From this, I inferred that the OAmusthave received the notice of the EGM – because if no notice had been given, OHC would surely have been quick to put such a fact forward as proof of his brothers’ duplicity.  The transfer of the Thai entities was also recorded in the Company’s annual report of 31 December 2009276Foot Note 276×19AB 10277..  In fact the entry in the Company’s annual report made it clear that the shares had been transferred “to a shareholder” at a “nominal price of S$1”, “based on the net tangible assets as per the audited accounts of [Tong Garden (T)] for the financial year ended 31 December 2000”277Foot Note 277×19AB 10302..  In other words, far from being “surreptitious” about the completion of the 2001 Thailand SPA, it appeared to me OTC and OBC were quite transparent about it. 246 In the circumstances, I rejected the contention that the Variation Agreement was a deliberate “scheme”278Foot Note 278×[87]-[88] of the Statement of Claim (Amendment No. 2).by OTC and OBC to “orchestrate” the former’s acquisition of the Thai entities on the cheap.  Ultimately, in arguing that his brothers had damaged the Company’s interests in completing the sale of the Thai entities to OTC at a price based on Tong Garden (T)’s 2000 NTA, OHC was really saying that the Company was entitled to a higher sale price.  However, OHC could not dispute that what the Company was contractually entitled to was what had been provided for in clause 4 of the 2000 SPA.  This was perhaps what prompted the presentation of an alternative argument in his closing submissions279Foot Note 279×[413] of the Plaintiff’s Closing Submissions.: namely, that OBC was in breach of his duty to exercise reasonable diligence as a director of the Company because he had failed to “[take] into account the increase in value of Tong Garden (Thailand) for the previous 8 years” before completing the sale of its shares in 2009. OHC’s alternative argument of “negligence” by OBC 247 I rejected OHC’s alternative argument for the following reasons. 248 Firstly, the contention that OBC had been “negligent” in his handling of the completion of the share sale in 2009 was never pleaded by OHC.  For this reason alone, I would have been disinclined to give any credence to this contention.  As the CA has pointed out inV Nithia(co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 (at [36] and [38]): 36 … [P]leadings delineate the parameters of the case and shape the course of the trial.  They define the issues before the court and inform the parties of the case that they have to meet.  They set out the allegations of fact which the party asserting has to prove to the satisfaction of the court and on which they are entitled to relief under the law. … 38 Thus, the general rule is that parties are bound by their pleadings and the court is precluded from deciding on a matter that the parties themselves have decided not to put into issue.  As Sharma J said inJanagi v Ong Boon Kiat[1971] 2 MLJ 196 (approved inOMG Holdings Pte Ltd v Pos Ad Sdn Bhd[2012] 4 SLR 2311 …) … The court is not entitled to decide a suit on a matter on which no issue has been raised by the parties.  It is not the duty of the court to make out a case for one of the parties when the party concerned does not raise or wish to raise the point.  In disposing of a suit or matter involving a disputed question of fact it is not proper for the court to displace the case made by a party in its pleadings and give effect to an entirely new case which the party had not made out in its own pleadings.  The trial of a suit should be confined to the plea on which the parties are at variance. 249 I did not think it would have been fair in this case to allow OHC to rely on the unpleaded point about OBC’s “negligence”.  While the court retains discretion to allow a party to raise an unpleaded point, such discretion will generally be exercised only where no prejudice has been caused to the other party in the trial.  In the present case, considering that the allegation of “negligence” was not even put to OBC in cross-examination, the element of surprise – and therefore, of prejudice – was clearly present. 250 Moreover, OHC’s submissions were strangely vague on what exactly it was OBC should have done in 2009.  OHC certainly did not suggest that OBC should have repudiated the 2001 Thailand SPA.  What he suggested was that OBC should have taken “legal advice”280Foot Note 280×[412] and [414] of the Plaintiff’s Closing Submissions..  Yet he failed to explain what exactly OBC should have taken “legal advice” on.  If what he meant to suggest was that OBC should have consulted lawyers on how he could negotiate with OTC to factor into the price any increases in Tong Garden (T)’s NTA between 2001 and 2009, such a suggestion was never pleaded nor put to OBC in cross-examination. 251 In any event, even assuming that OBC was “negligent” in completing the share sale at a price based on the 31 December 2000 NTA value, OHC still had to show that this breach of his director’s duty of reasonable diligence amounted to a personal wrongvis-à-visOHC himself as minority shareholder.  He was unable to do so.  I will deal with this failing in OHC’s case in the next section of these written grounds, as this was a failing which was common to his other allegations of breaches of fiduciary duties by OTC and OBC. 252 There are two remaining issues in this section I will address. The Deed of Waiver 253 The first issue concerns the Deed of Waiver which was also signed by OTC and OBC on 20 July 2009.    It was OHC’s case that this Deed of Waiver was another deliberate ploy by OTC and OBC to benefit the former.  For the reasons set out below, I did not find that this was so. 254 In so far as OHC decried the writing off of inter-company debts between the Company and the Thai entities, it should be pointed out that the resolution of these inter-company debts was already provided for in the 2001 Thailand SPA: clause 4 of the agreement expressly stipulated that the purchase price of the shares would be based on Tong Garden (T)’s NTA as at 31 December 2000, “after making appropriate adjustment for difference in inter company balances”281Foot Note 281×p 605 of OTC’s AEIC.. 255 More pertinently it should be noted that the Company had in fact instructed its then solicitors (Loy & Co) to send OTC letters of demand for the debt amount which it believed was due from Tong Garden (T), apparently to the Singapore subsidiary282Foot Note 282×See eg 4AB 1966..  This debt amount was disputed by OTC who wanted to see supporting documentation283Foot Note 283×See eg 4AB 1975..  Despite some correspondence back and forth, however, no concrete steps were taken by the Company to enforce its claim.  Indeed, as I noted earlier, by end-2005 OSA was telling IRAS that there was “no prospect” of Tong Garden (T) paying the debt, and that it had avoided taking legal action against Tong Garden (T) so as to avoid “throwing good money after bad money”284Foot Note 284×5AB 2673..  On 24 September 2007, OSA – in giving instructions to the then solicitors for Food Products (S) on the representations to be made to IRAS – informed them that the inter-company debt from Tong Garden (T) was time-barred285Foot Note 285×6AB 2949..  Whilst it was unclear from OHC’s case when precisely the purported debt was incurred, it could hardly be disputed that by September 2007, more than six years had elapsed from the signing of the 2001 Thailand SPA in which the inter-company balances were mentioned. 256 Given the fact that any inter-company debt owing from Tong Garden (T) would have been time-barred as at July 2009, there were valid commercial reasons for OBC to provide the Deed of Waiver. OTC’s alleged concealment of Tong Garden (T) accounts 257 Next, OHC claimed that OTC had sought to conceal Tong Garden (T) accounts after 2000, in defiance of orders made during these proceedings for the discovery of these accounts.  OHC claimed that OTC was concealing these accounts because he did not want OHC – or the court – to see how well Tong Garden (T) had been performing between 2002 and 2008286Foot Note 286×[399]-[401] of the Plaintiff’s Closing Submissions.. 258 As there appeared to be some suggestion from OSA and even at one point from OHC that OTC had failed even to produce the pre-2000 Tong Garden (T) accounts, I should state firstly that in so far as the pre-2000 accounts were concerned, I was satisfied that OTC had produced these to the Company and its auditors.  The correspondence from the Company’s then solicitors (Loy & Co) to OTC showed that the Company acknowledged having received from OTC the audited accounts for Tong Garden (T), NOI (T) and Nut Candy (T)287Foot Note 287×3AB 1411..  The correspondence also showed that when the Company requested more information from OTC, he had proposed that the Company’s auditors should visit the Thai office to inspect the financial records – and Stone Forest personnel did subsequently visit the Thai office to conduct such an inspection288Foot Note 288×See transcript of 11 September 2019 at p 120 line 1 to p 121 line 19.. 259 As to the allegation that OTC had failed to provide post-2000 Tong Garden (T) accounts in defiance of discovery orders, I did not find this allegation to be made out.  From the affidavits sworn by OTC, it was clear that his position had consistently been that the accounts sought – being accounts for the period spanning 1999 to 2009 – were no longer in his possession, custody or power.  This did not strike me as being unbelievable or unreasonable: it was not disputed that the law in Thailand only required companies to retain their records for five years, whereas the accounts sought were a decade (or more) old289Foot Note 289×See eg OTC’s affidavit of 4 January 2019.. 260 Moreover, I found it unbelievable that OTC should have found it necessary to risk being found in violation of various specific discovery orders just to hide the fact that the Thai entities had been doing well.  By the time these proceedings were launched, it would scarcely have been difficult for OHC to find out from other sources – suppliers and customers, for example – whether the Thai entities were doing well.  OBC testified, for example, that he was able to observe during his trips to Thailand how Tong Garden products were widely stocked in hotels.  OTC himself did not appear to me to be chary of revealing the good performance of his Thai companies.  If anything, OTC was keen to highlight throughout the trial how he had turned the Thai entities around after the 2001 Thailand SPA by dint of his own efforts and by pumping in his own funds. The Thai entities issue: Summary 261 In summary, the evidence did not support OHC’s contention that the completion in 2009 of the sale of the Thai entities was a surreptitious scheme by OTC and OBC to “engineer” the acquisition of these entities by OTC on the cheap.  OTC and OBC had a valid explanation for why the price was based on Tong Garden (T)’s NTA as at 31 December 2000.  There was also no attempt by them to conceal the completion of the sale, as the Variation Agreement was put up for approval at an EGM of the Company, with notice being duly given to the OA (at that time OHC’s trustee in bankruptcy).",
        "Summary of OHC’s case on minority oppression": "61 To sum up, OHC’s case on minority oppression postulated that the unlawful diversion and disposal of “the Company’s operations, assets (including trademarks) and business” with “no proper or adequate consideration”61Foot Note 61×[242] of OHC’s AEIC.constituted oppression of his minority interest because62Foot Note 62×[243]-[245] of OHC’s AEIC.– (a) these acts took place while he was a bankrupt and had difficulty in obtaining information about the Company.  According to him, OTC and OBC “took advantage of this” to carry out the allegedly oppressive acts because they thought he would not be able to find out – and indeed he only found out about their actions in December 2015; (b) these acts were “not single isolated acts” but were “part of a plan by OTC and OBC to secretly strip the Company to benefit themselves”; (c) he (OHC) had “devoted the majority of [his] life to the Company” and had helped to build up the Tong Garden into a valuable brand name.  In striking “at the very core of the Company’s business and existence”, OTC’s and OBC’s allegedly oppressive acts had thus caused him “to be personally affected”.",
        "OTC’s and OBC’s version of events": "62 OTC and OBC presented a starkly different picture of the financial state in which the Tong Garden Group found itself in March 2008.  According to OTC and OBC, the Tong Garden Group had been beset for years with internecine strife among the Ong siblings63Foot Note 63×[15] of OBC’s AEIC.which disrupted business operations and caused creditors to be chary of its financial stability.  The business of the Tong Garden Group was itself beset with cash flow problems and pressure from creditors, even as far back as the late 1990s when it faced litigation from the UOB Entities over its financial liabilities to them (see [31]–[35] above).",
        "The financial problems faced by the Company and the Tong Garden Group": "63 Both OTC and OBC gave evidence as to the financial problems faced by the Company, and by the Tong Garden Group as a whole, in the years leading up to the 15 March 2008 agreement.  Thus, for example, apart from the two suits brought by the UOB Entities between 1998 and 2000, TGHPL had its trade facilities with United Overseas Bank (“UOB”) frozen in mid-2000 as a result of outstanding amounts it owed UOB on trust receipts and a revolving loan64Foot Note 64×See [3.4.2] of the Operational and Financial Review conducted on TGHPL by Stone Forest Consulting Pte Ltd in September 2000, at exhibit OTC-14 of OTC’s AEIC.; and in March 2002, Food Products (S) had its credit facilities with Oversea-Chinese Banking Corporation (“OCBC”) frozen, apparently after it failed to comply with OCBC’s request for its audited accounts65Foot Note 65×See [8] of the minutes of meeting between OCBC representatives and the Company’s representatives on 26 March 2002, at Vol 4 of the Agreed Bundle of Documents p 1983 (4AB 1983)..  Such was the parlous state of the Tong Garden Group’s finances that a Special Manager was appointed by the creditor banks66Foot Note 66×See transcript of 27 August 2019 at p 106 lines 3-6.; and even then, by July 2002, at least one of the creditor banks (OCBC) was threatening to appoint judicial managers67Foot Note 67×See OCBC’s letter of 17 July 2002 at 4AB 2126; also exhibit OTC-16 of OTC’s AEIC..  By this time (July 2002), the Tong Garden Group as a whole owed some $9m to the creditor banks68Foot Note 68×4AB 2127.– UOB, OCBC and Bangkok Bank; and although by August 2003, this amount had been reduced to $7.7m69Foot Note 69×5AB 2579., clearly this was still a very sizeable amount. 64 Nor were the banks the only creditors putting pressure on the Tong Garden Group in the period leading up to March 2008.  Both OTC and OBC gave evidence about the pressure which the Tong Garden Group faced from other creditors.  OBC has listed at paragraph 33(19) of his closing submissions a number of such examples; and OTC has done so too at paragraphs 293–324 of his closing submissions.  These other creditors ranged from trade creditors to service providers seeking payment of their professional fees.  There were trade creditors who sued for the sums owed to them and obtained judgment: for example, Maya Systems Consultants Pte Ltd obtained judgment against Food Products (S) in August 2004 for the sum of $51,00070Foot Note 70×5AB 2628.; Munchy Food Industries Sdn Bhd obtained judgment against Food Products (S) in January 2005 for the sum of $317,890.6971Foot Note 71×5AB 2638.; and Kian Cheong (Boxes) MFG Co Pte Ltd obtained judgment against Food Products (S) in August 2007 for the sum of $29,835.80.  There were also letters of demand and chasers for payment from trade creditors – such as Meridian Nut Growers Alliance LLC, whose e-mails72Foot Note 72×3AB 1266.chasing for payment OHC forwarded to OTC with the comment that “[t]hese kind of mail from supplier not the first time”.  As for the demands for payments from service providers, these included more than one accounting firm which had provided audit and other services73Foot Note 73×5AB 2617-2623.. 65 According to OTC and OBC, while many of these financial woes appeared to be concentrated within Food Products (S), they had a direct impact on the Company’s financial viability.  As a holding company that had no manufacturing or trading activity of its own, the Company derived its revenue – and therefore its financial viability, indeed its very value – from its investments in the businesses of its subsidiaries and associated companies.  Financial trouble in those subsidiaries and associated companies could only spell trouble for the finances of the Tong Garden Group and of the Company itself – especially when the subsidiary in question was the Tong Garden Group’s main operating entity in Singapore.  It was precisely because of these very shaky finances that the siblings then running the Company (OHC, OSA, later OBC, at times OTC) were preoccupied with finding ways to raise funds.  In addition to bank borrowings, attempts were also made between the late 1990s and 2007 to raise funds by other means: for example, by means of rights issues (two in 1999), and by multiple loans advanced by OBC to the various subsidiaries74Foot Note 74×See for example Tab 3 of exhibit OBC-9 of OBC’s AEIC where he has listed “a few examples” of such advances..",
        "The sale of the Trademarks to Villawood": "66 It was in this context that on 12 November 1999, an EGM of TGHPL gave approval for the sale of the company’s assets, including its intellectual property rights75Foot Note 75×[56(1)] of OBC’s AEIC..  It will be remembered that in late August 1999, UOBVI had served on TGHPL a notice to redeem Preference Shares to the tune of $3.5m pursuant to the 1995 UOB Agreement.  This meant that the Company and its subsidiaries needed,inter alia, to liquidate some of its assets to pay UOBVI the Redemption Price.  Per the resolution passed at the EGM, any sale was to be subject to a valuation of the assets being conducted by any of the following firms: KPMG Peat Marwick; Arthur Anderson & Co; and PWC. 67 PWC was subsequently engaged to conduct a valuation of the “Tong Garden” brand prior to the sale of the Trademarks.  Indeed, it was OHC himself who had represented TGHPL in engaging and instructing PWC; and it was OHC who had – together with OSA, OTC and OBC – accepted PWC’s valuation of “$200,000 to $260,000” before approving the sale of the Trademarks to Villawood at S$260,003 in March 2000.  In short, the evidence showed that there had been a proper valuation of the Trademarks for the purpose of sale, and the valuation had been carried out independently by a reputable professional firm76Foot Note 76×[57] of OBC’s AEIC..  Moreover, UOBVI – who was to receive the proceeds from the sale of the Trademarks in partial satisfaction of the amount owed to it – was vigilant in wanting to make sure that “the valuation and sale [were] at arm’s length”77Foot Note 77×[58] of OBC’s AEIC..  The correspondence between TGHPL’s then solicitors and UOBVI’s solicitors in March 2000 showed that UOBVI was aware the Trademarks had been sold to a buyer related to TGHPL’s management, and that UOBVI had at one stage contemplated requiring another valuation to be carried out by KPMG Peat Marwick78Foot Note 78×pp 250-251 of OBC’s AEIC.but had not subsequently proceeded with this course of action.  It also had to be borne in mind that OTC and even OHC himself had given guarantees under the 1995 UOB Agreement and risked being held personally liable by UOBVI if TGHPL failed to settle its liability to the bank79Foot Note 79×[76] of OTC’s AEIC..  In other words, they had a vested interest in making sure that there was a valid sale of the Trademarks resulting in proceeds being made available to pay UOBVI. 68 According to OTC and OBC, therefore, there was no room for OHC belatedly to contend that the Trademarks had been sold at an undervalue, or that the transfer to Villawood had merely been a “temporary” one.  There was no agreement that Villawood or OBC would “hold the Trademarks for the Tong Garden business, nor was there any discussion about returning the Trademarks to the Tong Garden business”.  Quite simply, the Trademarks belonged to Villawood once the sale had taken place80Foot Note 80×[72] of OBC’s AEIC.; and as OBC owned and controlled Villawood, it was he who decided what to do with the Trademarks post March 2000. 69 In the immediate aftermath of the March 2000 sale to Villawood, OBC continued to allow the various Tong Garden entities to use the Trademarks without bothering with any formalities.  However, the Tong Garden Group’s creditor banks became nervous about what might happen in the absence of a formal licensing agreement if OBC – who had been providing financial support to the Group – were to withdraw his support81Foot Note 81×[74] of OBC’s AEIC..  In October 2002, as a result of conditions set by the creditor banks, Villawood granted a ten-year trademark licence (with effect from 13 March 2000) to Food Products (S), Food Products (M) and Snack Food (M) to manufacture and sell products bearing the Trademarks82Foot Note 82×[79] of OBC’s AEIC.. 70 According to OBC, the creditor banks had also asked that he waive the payment of royalties by the Tong Garden entities licensed to use the Trademarks.  He did not give any such waiver but he did agree to a moratorium on payment of royalties until the Company’s finances improved.  In any event, up until the time he entered into the 15 March 2008 agreement with OTC, he had not received any royalty payments from the Tong Garden entities83Foot Note 83×[89] of OBC’s AEIC..",
        "The continuing financial woes of the Company and the Tong Garden Group": "71 Even after TGHPL’s liability to UOBVI under the 1995 UOB Agreement was settled, the Company and its various subsidiaries continued to experience financial woes.  The various attempts to raise funds created something of a vicious circle of indebtedness, whereby they would attempt to pay off creditor banks by deploying (inter alia) funds intended for use as working capital, and then find themselves having to borrow more funds for working capital.  It is not disputed that the amount owing by TGHPL under the 1995 UOB Agreement was eventually paid off using the proceeds from the sale of the Trademarks and from a rights issue in October 1999, as well as moneys from a credit line obtained from Bangkok Bank and moneys taken from Food Products (S)’s working capital84Foot Note 84×See the summary of payments set out in the table at [17] on p 9 of the 2nd Defendant’s Closing Submissions (“D2CS”).. 72 According to OTC and OBC, therefore, it was unsurprising that the Company, and the Tong Garden Group as a whole, continued to struggle to pay off debts.  Indeed, it was OTC’s and OBC’s position that the Company was both balance sheet insolvent and cash flow insolvent in the period leading up to their 15 March 2008 agreement. 73 On 9 January 2007, OCBC sought to revise the credit facilities extended to Food Products (S), so as to require (inter alia) that OBC execute a Deed of Guarantee and Indemnity to secure these facilities.  OBC refused to do so.  By then, according to OBC, the audited accounts of the Tong Garden Group showed that he had lent at least a total of $3.5m to the various Tong Garden entities: in fact, by his own estimation, the total amount he had lent was “much closer to $5 million”85Foot Note 85×[29] of OBC’s AEIC..  He was also feeling very frustrated by this time because despite having lent so much money to the Tong Garden Group and having expended much time and effort to help its business, he had never been paid a single cent in director’s fees or dividends, whereas he had to pay interest on the credit lines from which he made these loans – and even worse, he had also ended up being sued by OSA and two other sisters in 200786Foot Note 86×[33] of OBC’s AEIC.. 74 On 24 May 2007, solicitors acting for OCBC wrote to Food Products (S) to demand repayment of some $3.7m87Foot Note 87×6AB 28427..  On 31 July 2007, OCBC wrote again to Food Products (S) to state that the excess arrears under its credit facilities amounted to about $3.8m.  Within that same month (July 2007), the Inland Revenue Authority of Singapore (“IRAS”) issued notices against Food Products (S) for unpaid taxes totaling $1,289,326.32 and appointed UOB, OCBC and DBS as collection agents88Foot Note 88×6AB 2890-2895..  In OSA’s reply to IRAS on 21 November 2007, she lamented that IRAS’ Enforcement Division was chasing Food Products (S) for $1.4m when the latter “just [didn’t] have that kind of money”89Foot Note 89×6 AB 2970..",
        "The agreement dated 15 March 2008 between OTC and OBC": "75 Around this time, OBC and OSA were the only two directors left in the Company.  OBC left OSA to do most of the running of the Tong Garden business, since he had his own property development business: he was involved mainly when it came to negotiating with the creditor banks and when OSA needed him to lend money to the Tong Garden Group.  By 2007, however, OBC had decided that he no longer wanted to be involved in the Tong Garden business.  It was clear to him that the Tong Garden business “was badly insolvent” and that it was “not viable to keep pumping funds into it to prop it up”.  It was also clear to him that OSA was unable to run the business and to turn it around by herself90Foot Note 90×[37] of OBC’s AEIC..  He decided to offer to hand the business over to Ong Siew Lay (“OSL”), one of the sisters who was suing him. 76 On 6 August 2007, OBC sent OSL a letter91Foot Note 91×Tab 6 of exhibit OBC-9 of OBC’s AEIC.which he copied to OHC, OSA and two other siblings (Ong Siew Kuan and Ong Siew Chin).  In this letter, he noted that the Tong Garden business had not flourished in the Ong siblings’ hands.  He also noted that he had his own business pursuits and had only joined the Company because of their mother’s request that he help to “‘salvage’ Tong Garden”, but felt disappointed to have had his efforts taken for granted92Foot Note 92×p 139 of OBC’s AEIC.: Now I am tired and, I wouldn’t want to get involved in Tong Garden business anymore … I would like to inform you that all my shares interest in Tong Garden will be transferred to you, Siew Lay.  I shall pull out in total from Tong Garden.  The “Tong Garden” logo and its trade mark I shall leave it under the custody of Teck Chuan [ie, OTC]. As for my estimated four to five million dollars capital loan to Tong Garden, the company may return it to me over a period of five to ten years. 77 OSL did not take up the offer.  OBC then contemplated approaching OTC to take over the business.  He knew that OTC was running the Thailand operations well; and in May 2007, he had actually broached with OSA the prospect of getting OTC back to run the Tong Garden business – but had met with OSA’s response that between letting OTC take over the business and winding up the Company, she preferred the option of winding up93Foot Note 93×Tab 8 of exhibit OBC-9 of OBC’s AEIC..  By late 2007, however, OBC had concluded that if there were to be a winding up, it “would be in the interest of all parties concerned, creditors, employees and shareholders” that this “be done in an orderly manner rather than a sudden closure and assets sold at ‘fire-sale’ prices”.  He decided to approach OTC to take over the business.  He did not approach OLC or OHC because both of them were bankrupt at that time, and in any event OHC had not responded to the 6 August 2007 letter on which he (OHC) had been copied. 78 Initially, OTC was reluctant to take over the Tong Garden business in Singapore and Malaysia as he knew it was in bad shape94Foot Note 94×[163] of OTC’s AEIC..  He eventually agreed to OBC’s request that he do so because he too realised it was important to make an effort to pay off the creditors of the business, especially since he remained a guarantor for various loans.  He also wanted to prevent the Tong Garden brands from disappearing from the market, even if the business originally started by their father had to die95Foot Note 95×[165] of OTC’s AEIC.. 79 It was in these circumstances that OTC and OBC entered into the 15 March 2008 agreement96Foot Note 96×Exhibit OTC-34 of OTC’s AEIC..  As set out earlier (at [43]), clause 1 of this agreement provided that OBC would sell (or procure the sale of) and OTC would purchase – for $7m – all of OBC’s shares in the Tong Garden Group; all the debts owed to OBC by the Tong Garden Group; and the “Tong Garden” trademark owned by Villawood.   In his AEIC, OTC stated that although the 15 March 2008 agreement referred to his being assigned the debts owed to OBC by the Tong Garden Group, the actual agreement between him and OBC was that he (OTC) would guarantee the payment to OBC of these debts: “[i]n other words, [he] would ensure that the relevant companies in Father’s Tong Garden Group repaid the debts.  If they did not, [he] undertook to personally repay OBC”97Foot Note 97×[168] of OTC’s AEIC..  The figure of $7m “represented a global settlement sum for the entire transaction”.  The two brothers did not discuss in detail the amount attributable to OBC’s shares or to the Trademarks. 80 In his AEIC, OBC too clarified that he and OTC had not intended for the latter to purchase the debts he was owed by the Tong Garden entities.  Instead, their agreement was for OTC to guarantee the return to OBC of “all the monies [he] had loaned to the Company plus all monies [he] had expended via shareholding”98Foot Note 98×[44] of OBC’s AEIC..  Both brothers were also agreed that OTC “would restructure the business and salvage what could be saved”: in particular, OTC would “ensure that all creditors [were] paid and that the Tong Garden business remained within the family”.",
        "The 2008 restructuring": "196 OHC’s failure to prove that the Tong Garden trademarks continued to be beneficially owned by the Company post 13 March 2000 held significant implications for his claims about the diversion of the Company’s “valuable assets” in Singapore and Malaysia via the 2008 restructuring.  According to OHC, this alleged diversion constituted the second major instance of oppressive conduct by OTC and OBC.  As OTC and OBC pointed out, however, leaving aside the trademarks, OHC had great difficulty pinpointing which “valuable assets” were “surreptitiously” diverted from the Company’s Singaporean and Malaysian subsidiaries by OTC and OBC. 197 In OHC’s closing submissions, the following was alleged216Foot Note 216×[364]-[365] of the Plaintiff’s Closing Submissions.: 364. OTC had acquired the “Tong Garden” Trademarks from OBC, seconded and subsequently took over the staff of the Tong Garden Group, acquired the Tong Garden Group’s vehicles, acquired the Tong Garden Group’s customer base by way of distributorship agreements and finally in the banking facilities based on the established financial performance through the profit-sharing in the distributorship agreements with Food Products (S) and Snack Food (M). 365. OTC’s explanation that he paid fair market value for the plant and machinery ignores the fact that he was able to acquire the critical aspects of the business as stated above without any payment. 198 In addressing these allegations, I should make clear the following matters at the outset.  The 15 March 2008 agreement – by which OBC agreed to transfer to OTC his shares in the Tong Garden Group, the debts owed to him by the Tong Garden Group, and the “Tong Garden” trademarks owned by Villawood for $7m – was the means by which OTC was able to implement his plans for the 2008 restructuring of the Tong Garden Group.  Both OTC and OBC have explained that the agreement was based on their shared understanding that OTC would “gradually deflate the old Tong Garden business structure, and build up a new one to avoid disruption to Tong Garden’s employees, creditors and reputation in the snack food market, while working with creditors to repay them and ensuring that there are continuing supplies”217Foot Note 217×[47] of OBC’s AEIC; also [165] of OTC’s AEIC..  I have earlier found that at the point in time just prior to the occurrence of the allegedly oppressive acts in 2008, the Company was either insolvent (having met the test for balance sheet insolvency), or at the very least in a parlous financial state.  In light of my findings on the state of the Company’s finances, I was of the view that OTC and OBC had acted with valid commercial reasons in the interests of the Company (Ideal Design([97]supra) at [66]).  This was not a case where the Company could have continued blithely on the same path without any fear of a financial reckoning.  Even OSA recognised this: when asked by OBC in May 2007 to indicate her preference as between letting OTC take over the business and winding up the Company, she did not protest that the Company should simply carry on as it had been doing, and in fact she preferred the more drastic option of winding up218Foot Note 218×Exhibit D-5..  As late as 14 April 2011, OSA apparently remained of the view that the Company should be wound up: in a letter to ACRA, her then solicitors requested ACRA to hold off on striking off the Company under s 344(1) of the Companies Act on the ground that she intended “to apply to Court to wind up the company”219Foot Note 219×9AB 4379.. 199 In fact, it should be noted that on 17 July 2008, OHC himself had written to the OA who was then managing his affairs, to assert that the companies of the Tong Garden Group were being poorly managed and to request that the OA take steps to get the companies wound up220Foot Note 220×7AB 3613.: Since Our group of companies businesses had not been proper manage [sic] after i left till date, may i request u to apply to court to wind up the whole group businesses and i can get my monies back to repay all my debtors? 200 As OTC has pointed out221Foot Note 221×See transcript for 12 September 2019 at p 149 lines 1 to 23., if he had wanted to pick off the Company’s assets for himself, he and OBC could have quietly left the Company to flounder on and eventually fail on its own.  After all, as detailed in [161]–[163] and [170]–[171] above, the Singaporean subsidiary Food Products (S) was struggling so badly financially it had to resort to selling its factory to pay off OCBC, while the Malaysian subsidiaries which had been propping up Singapore operations with sizeable monthly remittances were also seeing their financial prospects grow increasingly dim.  More likely than not, it would have been a matter of time before the problems faced by the subsidiaries sounded the death knell for their ultimate holding company, especially since OBC – who had been lending money to the Tong Garden Group – was determined by August 2007 to jettison his shares in the Company and to turn his back on its business.  Once the liquidation process started for the Company and its subsidiaries, OTC could then swoop in to buy the liquidated assets on the cheap.  It would not of course be in the Company’s interests to adopt a course of actionthatwould spell a potentially chaotic and ignominious end, even if the end was inevitable – but if indeed OTC and OBC had wanted to scoop up its “valuable assets”, such a course of action would have entailed little effort and risk on their part. 201 On the other hand, if this was not what they wanted, then it was clearly in the Company’s interests for its business to be wound down in a gradual and orderly manner.  Since its business was really that of investing in its subsidiaries, this involved taking steps to ensure that the business of these subsidiaries was wound down in a gradual and orderly manner.  In this context, it made sense for OTC – in implementing the 2008 restructuring – to be concerned about paying suppliers and other creditors so as to prevent any hasty action by them which might rebound on the Company.  As OTC himself put it222Foot Note 222×See transcript for 12 September 2019 at p 149 lines 1 to 23.: … It is the purpose to come in D4 [ie, the Company] to help, to slowly wind down the company for the benefit of all the shareholder.  I have two choice: either to wait for D4 to collapse and I come and buy the liquidated asset – will be much cheaper for me.  But I … come into D4, is to protect my father name.  Because I don’t want my father name to be discredited.  I promise all my supplier and creditor that I will honour my payment, regardless of the D4 subsidiary health.  If D4 subsidiary cannot pay, I will pay myself.  That’s why all the supplier willing to give me time to pay.  In fact, OCBC even give me time to pay.  Because I told them I will guarantee OCBC, if I cannot sell the property within one year, I will pay them the losses. 202 I next address the specific allegations of diversion of assets cited in paragraph 364 of OHC’s closing submissions.  First, as to the Tong Garden trademarks, I have dealt with this subject in [178]–[195] above.  To the findings I have articulated earlier regarding the sale of the trademarks to Villawood on 13 March 2000, I would add the following other observations.  Given that the purpose of the 2008 restructuring was to “gradually deflate the old Tong Garden business structure, and build up a new one to avoid disruption to Tong Garden’s employees, creditors and reputation in the snack food market”223Foot Note 223×[47] of OBC’s AEIC., it made sense for the Tong Garden trademarks to be transferred to the new entities set up by OTC to carry on the late Mr Ong’s legacy of the Tong Garden brand name. 203 Moreover, the transfer of these trademarks was certainly not done for free: the consideration of $7m which OTC contracted to pay OBC under the 15 March 2008 agreement was stated to cover the transfer of the trademarks224Foot Note 224×p 695 of OTC’s AEIC..    In his AEIC, OBC gave evidence that OTC had made payment of the said consideration in instalments.  He also produced the documentation which he was able to locate of such payments225Foot Note 225×[48] and Tab 10 of OBC’s AEIC..  OHC’s expert witness Mr Abuthahir has commented in his report that the documentation showed payment totaling only about $3.4m226Foot Note 226×[4.5.1(a)] of Mr Abuthahir’s expert report..  I noted, however, that OBC himself had made it clear in his AEIC that he had exhibited whatever records he managed to obtain, and he recognised that these records were incomplete in that they showed only a portion of OTC’s payments – albeit in his view “a large portion”227Foot Note 227×[48] of OBC’s AEIC..   The point, however, is that therewerepayments made under the 15 March 2008 agreement – contrary to OHC’s claim that OTC was getting “critical aspects of the business …without any payment” [emphasis added]. 204 I pause here to note that OHC did seek to castigate the absence of any indication in the 15 March 2008 agreement of how exactly the figure of $7m was to be apportioned as between the transfer of OBC’s shares in the Tong Garden Group, the repayment of the debts owed to him by the Tong Garden Group, and the transfer of the Tong Garden trademarks.  I deal with this issue in [222]–[224] below. 205 Second, as to the secondment of staff from the Tong Garden Group to OTC’s companies, the only evidence which OHC produced of such secondment related to one Ng Chee Seng, who was said to have been “an employee of various entities in the Tong Garden Group in Singapore from the years 1976 to 2011” and who appeared to be receiving his salary payments from OTC’s Tong Garden Food (Singapore) Pte Ltd from May 2009 onwards228Foot Note 228×[175] of OHC’s AEIC..  In his AEIC, OHC did not actually spell out why this particular piece of evidence established any breach of fiduciary duties by OTC and OBC.  It was not alleged, for example, that OTC was wrongfully poaching staff who were privy to the Company’s trade secrets and/or confidential information.  Nor was it alleged that staff like Ng Chee Seng were in possession of some sort of specialised skills or qualifications. 206 In my view, once OTC embarked on winding down the business of the Company and its subsidiaries, the employment of personnel employed by these entities would no doubt be affected.  If these were personnel like Ng Chee Seng who had served the Tong Garden Group for years, it was not unreasonable for OTC and OBC to “avoid disruption”229Foot Note 229×[47] of OBC’s AEIC.to their employment by redeploying them in the companies which OTC was setting up to continue the snack food business.  After all, avoiding (or at least minimising) the disruption to existing employees would assist to reduce the upheaval to be expected within the Company and its subsidiaries as a result of the winding down of business.  Moreover, OTC’s evidence was that his companies had paid secondment fees to the entities within the Tong Garden Group: documentary records were kept of such payments230Foot Note 230×See e.g. exhibit OTC-50 at pp 1473-1474 of OTC’s AEIC.; and OTC’s evidence on this score was not refuted. 207 In short, therefore, assuming OTC had (with OBC’s assent) transferred the employment of staff from the Tong Garden Group to his companies in the course of the 2008 restructuring, I accepted that this was done in pursuit of the interests of the Company. 208 Third, in respect of the alleged acquisition of the Company’s vehicles, OHC did not adduce any evidence of the vehicles purportedly acquired by OTC for free.  He did not even specify the number of the vehicles allegedly acquired by OTC for free, let alone the make or model of these vehicles.  This was perplexing since OTC had put forward a fair amount of documentary evidence in relation to the sale of vehicles.  For one, the valuation report231Foot Note 231×Exhibit OTC-49 of OTC’s AEIC.prepared by a qualified valuer (one Lui Fook Kee, “Lui”) on the plant and machinery at the Singapore factory had included two vehicles – a Nissan standup reach truck and a Toyota diesel engine forklift. OTC’s evidence232Foot Note 232×[181] of OTC’s AEIC.was that his companies purchased the items set out in the valuation report at the fair market value determined by Lui.  No evidence was put forward by OHC to refute this assertion.  Nor did OHC seek to cross-examine Lui even though the latter was made available for cross-examination.  OTC also put forward other documentary evidence233Foot Note 233×Exhibit OTC-50 of OTC’s AEIC.which appeared to record the sale of other vehicles by Food Products (S) to OTC’s company.  Thus, for example, there were documents which appeared to show that Food Products (S) had sold vehicles to Tong Garden Food (Singapore) Pte Ltd for cash and at the prices quoted by a local automobile trading company234Foot Note 234×See e.g. exhibit OTC-50 at pp 1465-1466 of OTC’s AEIC..  There was no attempt by OHC to refute the evidence. 209 In the circumstances, I rejected the suggestion that OTC had breached his fiduciary duties by acquiring the Company’s vehicles “without any payment”. 210 Fourth, OHC claimed that OTC had used the distributorship agreements with Food Products (S), Food Products (M) and Snack Food (M) to acquire for his companies the customer base of the Tong Garden Group.  Again, however, I found OHC’s claims to be baseless.  To begin with, I have found that given the parlous financial state of the Company (as well as the Singaporean and Malaysian subsidiaries), there were valid commercial reasons for OTC and OBC to pursue the winding down of their business.  This was to be a gradual process, not an abrupt overnight cessation of all business.  In this connection, as OTC explained, there were still responsibilities to customers which had to be fulfilled; and it was pursuant to the distributorship agreements that his companies took on the responsibilities owed to customers.  This was why, in a letter sent to “[a]ll [c]ustomers”, OTC’s Tong Garden Food (Singapore) Pte Ltd had informed them that235Foot Note 235×11AB 5640.– … Tong Garden Food Products (Singapore) Pte Ltd (ie, Food Products (S)) has changed its distributorship to Tong Garden Food (Singapore) Pte Ltd with effect from 1 June 2008. In addition, we confirm that all goods purchased from Tong Garden Food Products (Singapore) Pte Ltd can be returned to Tong Garden Food (Singapore) Pte Ltd.  Agreements and advertising contracts between you and Tong Garden Food Products (Singapore) Pte Ltd will be honoured by Tong Garden Food (Singapore) Pte Ltd with immediate effect. … 211 In any event, the claim that OTC had used the distributorship agreements to “poach” the Tong Garden Group’s customers presupposed that there was a customer base that was somehow unique and confidential to the Tong Garden Group.  However, OHC adduced no evidence to support such a proposition.  OTC, on the other hand, gave evidence that the nature of the snack food business was such that the major customers for snack food products would be well-known retail chains such as Cold Storage, NTUC, Giant, Sheng Siong and 7-11; and the main consideration for these retailers in deciding whether to carry a product would be whether they were paid the listing fee,ie, the requisite fee for listing the product in their outlets236Foot Note 236×See transcript for 16 September 2019 at p 43 line 14 to p 45 line 17..  OTC’s evidence in this respect was not seriously challenged. 212 In the circumstances, I rejected the contention that OTC had breached his fiduciary duties to the Company by using the distributorship agreements to acquire the Tong Garden Group’s customers for his own companies. 213 Fifth, OHC also alleged that OTC was only able to obtain financing (presumably for his companies) “based on the established financial performance through the profit-sharing in the distributorship agreements with Food Products (S) and Snack Food (M)”.  If this was meant to be an assertion that OTC’s companies had obtained financing only because of the profits they derived from the distributorship agreements with the Tong Garden Group entities, it was a bare assertion for which once again, OHC produced no corroborative evidence. 214 OTC, on the other hand, gave evidence that he had injected his own capital into his companies, taken “numerous loans and [given] personal guarantees in respect of these loans”237Foot Note 237×[174] of OTC’s AEIC..  OHC did not refute this part of OTC’s evidence when he took the stand; and indeed, OTC was able to produce supporting documents.  Thus for example, on 21 July 2009 Tong Garden Food (Singapore) Pte Ltd took a bridging loan of $500,000 from DBS for which OTC gave a personal guarantee238Foot Note 238×pp 833-839 of OTC’s AEIC..  It was also noted in the loan documentation239Foot Note 239×p 834 of OTC’s AEIC.that Tong Garden Food (Singapore) Pte Ltd had received loans from OTC himself; and that the aggregate of directors’ and shareholders’ loans it had received came to $594,000.  As another example, OTC’s Malaysian company Tong Garden Food (Malaysia) Sdn Bhd took a loan of RM8m from RHB Bank Bhd on 22 September 2008, for which both OTC and OBC gave personal guarantees240Foot Note 240×pp 868-882 of OTC’s AEIC.. 215 In the circumstances, I found no merit in OHC’s allegation that OTC had obtained financing for his companies “based on the established financial performance through the profit-sharing in the distributorship agreements with Food Products (S) and Snack Food (M)”. OHC’s allegation that the 2008 restructuring was carried out surreptitiously 216 In alleging that the 2008 restructuring exercise was really part of OTC’s and OBC’s bid to transfer valuable assets from the Company to OTC’s companies, OHC claimed that the entire exercise was carried out “surreptitiously”241Foot Note 241×[57] of the Statement of Claim (Amendment No. 2).at a time when he “was a bankrupt and … when it was very difficult to obtain information about the Company”.  According to OHC, OTC and OBC “took advantage of this to carry out these acts, thinking that [he] would not be able to find out”; and in the end, he only managed to find out about the various allegedly oppressive acts “in December 2015”242Foot Note 242×[243] of OHC’s AEIC..  These allegations about the “surreptitious” nature of OTC’s and OBC’s actions were meant to underscore the lack of any valid commercial reason for those actions. 217 In this connection, I should reiterate that based on my findings as to the financial state the Company and its subsidiaries were in, there were valid commercial reasons for OTC to pursue the 2008 restructuring and for OBC to acquiesce to it.  More fundamentally, however, I found that the evidence available actually contradicted OHC’s claims about having been ignorant of the 15 March 2008 agreement – and the ensuing 2008 restructuring – until “December 2015”.  In the first place, it was clear from the evidence before me that OTC was open with the world at large about what he was doing.  Thus, for example, not only did he arrange for his companies to enter into distributorship agreements with the Singaporean and Malaysian subsidiaries of the Tong Garden Group, he wrote to all customers to notify them of these arrangements243Foot Note 243×11AB 5640.. Copious documentation was also maintained of the transactions between the Tong Garden Group entities and OTC’s companies, including a ledger of the amounts owing between the two sets of companies244Foot Note 244×7AB 3704..  If OTC and OBC had truly intended to be “surreptitious” about the 2008 restructuring, then such transparency was simply bizarre. 218 OHC’s own e-mail correspondence with OTC gave the lie to his assertion that he was ignorant of the 15 March 2008 agreement and the 2008 restructuring exercise until December 2015.  The e-mail exchange between OHC and OTC beginning on 2 February 2010245Foot Note 245×8AB 4115 to 4117.– following an offer by OTC to the OA to buy OHC’s shares in the Company for $50,000 – was particularly instructive.  In his first e-mail in the exchange, OHC expressed indignation at the offer and asked OTC if he really thought OHC’s shares were worth $50,000 or if he had “other plan”. 219 OTC responded as follows: Johnny, Base on current Book Value is about negative S$8,000,000. So how much can I offer?  Or give me your valuation report to your value of your share, I will revise my offer. No, I have no plan now but just how I am going to pay off creditor. Johnny, am I the one who created this value of your share? Am I the one who make you bankrupted? Touch your heart and answer. Please don’t put the blame on me. You have make and choose your choice. However, I am very grateful to you for ganging with them to kick me out of the company. If not I may end up like you. How much you own to creditor (that sue you)? If you let me know and I may help a bit to pay off your creditor. That’s the best I can do, I am so sorry. 220 OHC’s reply to OTC came not long after (on 4 February 2010), and its contents were quite telling.  I have reproduced it below and highlighted (in bold italics) the relevant portions: 1. Are u saying the whole TG group book value is negative S$ 8 million or only Spore TG? If this is true, why do u want to buy my 520k shares at S$50k?? Come on, don’t ever treat like those day johnny!! I woke up with my eyes open big n learnt after paid so much legal fees!!  2.Its normal for any one to plan how to operate n pay off all our creditors when u want to take over Spore n Malaysia TG, and I don’t believe u took over our family business with NO plan!!We are no more young like those day!!  3. What happened to me today, i never put the blame on u, all my friends know that include my sons. I only blame myself for being too kind n NO selfish intention to my sibling when OLC out from TG, i was the one who invited all of them back with good intention, thinking we will work closely n bring TG for 1st board listing. But, never ever thought that fucker OBC came back with his own agenda!! I will never ever forget n forgive this bastard OBC!!!  4.We all know very well what happened to TG group and our present position very well since the whole story started from day 1, no point for us to point at each other now, i have lost my interest on all these matters!!  5. U know very well how TG group started n we learned each other’s character very well after all these sad family stories started!!  6. My sons know very well how his dad got bankrupt after all the hard works n times contributed to our family business!! They know i got bankrupt not because of gamble or speculating shares!! Believe my late wife will come back to look for those who made me bankrupt, after i spent so much times in family business but not with my family!!  7. Put yourself in my position, how would u feel after contributed all your times in this family biz whole heartedly n end up bankrupt?? Will u die off with eyes close?? I won’t !!!!  8.What agreement u had with bastard OBC we know in heart!! Do u think is fair to me?? Do u think what u did today its correct for your conscience n our parent?? Don’t forget whatever we did some body up there are watching!!  9. I never ever cheated any of my sibling n friends since day 1 started work in my life, and never ever let any of our staffs cheat company any single cent, but now i face my own fucking sibling cheated me!! Do u think i will keep silent?? Do u think our children are happy to see this??  How much good food can u eat? How big house can u stay? U are clear that what bastard obc facing now? Who visit him during CNY although he stays in big house??  James, monies its not every thing!! I don't have to tell u that right?? Earn $$$$$ with your conscience!! Never ever follow bastard OBC’s step n sleep un peacefully!!  I don’t intend to pay banks who sue me bankrupt but have to pay my personal friend’s loan, if u really keen to buy my shares, i am open for discussion, let me have your thought, thanks for long reading.  [emphasis added in bold italics] 221 Putting aside the invective and recriminations, the e-mail revealed that as at 4 February 2010, OHC was already aware that OTC and OBC had entered into an agreement – and further, that OTC had taken over the “family business”.  His assertion that these things were done “surreptitiously” behind his back – and that he only found out about them in December 2015 – was thus plainly untrue. OHC’s allegations about the absence of a breakdown of the $7m consideration 222 OHC further argued that OTC and OBC had deliberately refrained from stating in the 15 March 2008 agreement how the consideration of $7m was to be broken down as between the purchase of OBC’s shares in the Tong Garden Group, the repayment of the debts owing to him by the Tong Garden Group, and the transfer of the Tong Garden trademarks.  According to OHC, OTC and OBC deliberately did not provide such a breakdown because they were intent on “concealing the value they attributed to OBC’s shares and the ‘Tong Garden’ trademarks from this Honourable Court”246Foot Note 246×[163] to [172] of the Plaintiff’s Closing Submissions.. 223 I did not find any merit in OHC’s argument about the deliberate suppression of information in the 15 March 2008 agreement.  There was no evidence to support the suggestion that the absence of a breakdown of the $7m figure in the agreement was a deliberate ploy to oppress OHC’s rights as a minority shareholder by concealing information from him about the value of his shares and that of the Tong Garden trademarks.  Given the familial relationship between OTC and OBC and the relatively informal nature of the whole transaction (as seen for example from the lack of any formal valuation of the shares), I did not find it surprising – or sinister – that there was no breakdown of the $7m figure.  In any event, OBC did in cross-examination provide an explanation as to how he arrived at the $7m figure.  OBC believed that he had lent some $4m to $5m in total to the Tong Garden Group (which was why he had been willing to transfer his shares to OSL for $5m); and by the time he came to strike a deal with OTC in March 2008, he also wanted to ask for another $2m more to cover the amount then being claimed from him by OSL.  My understanding of OBC’s evidence was that apart from what Villawood had previously paid for the trademarks ($260,000), OBC wanted to recoup the moneys he believed he had expended over the years for his involvement in the business of the Tong Garden Group – whether on paying off its entities’ debts or on taking up shares in rights issues.  The $7m figure was not intended to be a precise computation of these various amounts: it was OBC’s approximation, but OTC was willing to accept it anyway without insisting on a detailed breakdown.  In return, it may be seen that OBC was willing to extend some leeway to OTC in the payment of the $7m: while the 15 March 2008 agreement provided for certain milestones to the payment schedule, it was clear that OBC did not insist on strict compliance with the milestones. 224 In short, while the absence of a breakdown of the $7m figure indicated a certain lack of exactitude and formality in the transaction, this was indicative of the willingness of the two brothers to allow some give-and-take between them: I did not see it as being indicative of their intention to conceal from OHC the value of his shares and/or the value of the trademarks. The 2008 restructuring: Summary 225 In summary, I accepted OTC’s and OBC’s evidence that there were valid commercial reasons for the 2008 restructuring exercise.  I did not find any merit in OHC’s claims that this restructuring was simply a ploy to arrogate to OTC’s companies the “valuable assets” and business of the Company (and its Singaporean and Malaysian subsidiaries).",
        "The transfer of the Thai entities": "87 As to the Thai entities, it was not disputed that OTC had from the outset been the one overseeing Tong Garden (T).  In her defence, for example, OSA pleaded that OTC had “been managing the business of the Thai Entities from their incorporation to date”108Foot Note 108×[23] of the 3rd Defendant’s Defence..  OTC gave evidence that the 2001 Thailand SPA came about because he wanted nothing more to do with the running of the business in Singapore and Malaysia, having grown tired of the constant feuding among his siblings.  At a meeting with OHC and OBC on 7 September 2000, he proposed to relinquish his interest in the Tong Garden business “in Singapore, Malaysia, China and elsewhere, in exchange for full control of [Tong Garden (T)]”109Foot Note 109×[122] of OTC’s AEIC..  OHC and OBC were agreeable.  After all, Tong Garden (T) – described in the minutes of the 7 September 2000 meeting as “the smallest entity within the group”110Foot Note 110×Exhibit OTC-22 of OTC’s AEIC.– was at that point not regarded as an attractive proposition, being a loss-making company with negative book value111Foot Note 111×[125] of OTC’s AEIC.. 88 By 26 October 2000, the Company’s solicitors had circulated a draft agreement to give effect to the understanding reached at the 7 September 2000 meeting.  On 8 November 2000, Stone Forest Consulting Pte Ltd (“Stone Forest”) – which was then advising the Company on its financial matters – wrote to OHC, OBC, OTC and OSA to set out their advice on how the proposed arrangements should be effected112Foot Note 112×Exhibit OTC-26 of OTC’s AEIC..  It was Stone Forest’s advice that there should be two agreements drawn up: one dealing with the sale of the Thai entities to OTC, the other dealing with the sale of OTC’s shares in the Company to OHC, OBC and OSA.  In accordance with Stone Forest’s advice and following negotiations between the parties, OTC and the Company executed the 2001 Thailand SPA on 4 January 2001, while the corresponding agreement for the purchase of OTC’s shares in the Company by OHC, OBC and OSA was also executed by the four siblings concerned.   According to OTC, although no First Schedule was attached to the 2001 Thailand SPA, it was “understood by all parties that [he] was to purchase the Parent Company’s 39.99% shareholding in Tong Garden (T)”: the reason why the term “Territory” in clause 1 of the agreement was defined so as to include countries such as Laos, Cambodia and Vietnam was to “enable [him] to use the ‘Tong Garden’ and ‘NOI’ trademarks in these countries”. 89 OTC also gave evidence that the sale of shares stipulated in the two agreements was not formalised because of disagreement over an inter-company loan owing by Tong Garden (T) to the Company.  According to OTC, “OBC and/or OSA” wanted him to agree to a loan amount which was higher than the amount recorded in Tong Garden (T)’s books113Foot Note 113×[142] of OTC’s AEIC..  OTC’s requests for documents supporting this higher loan amount were ignored.  As a result of the impasse, the transfer of the Company’s shares in Tong Garden (T) to him was not formalised.  Nevertheless, as far as OTC was concerned, the parties treated both the agreements as having been executed114Foot Note 114×[143] of OTC’s AEIC..  On 23 February 2001, OTC tendered his resignation from the directorship of the Singaporean, Malaysian and Chinese entities in which the Company held a direct or an indirect interest.  He proceeded to take over Tong Garden (T), pouring his own money into it in an effort to improve the business and treating it as his “own personal business”115Foot Note 115×[144] of OTC’s AEIC..   The running of the Singapore, Malaysia and China business was left entirely to OHC, OBC and OSA. 90 OTC acknowledged that while he was managing Tong Garden (T) on his own, he had yet to make payment for the Company’s 39.99% shareholding in Tong Garden (T)116Foot Note 116×[145] of OTC’s AEIC..  Following the 15 March 2008 agreement, he was advised by his lawyers to “complete the legal formalities required under” the 2001 Thailand SPA.  It was in this context that he entered into the Variation Agreement with the Company on 20 July 2009.  As far as he and OBC (who represented the Company) were concerned, the Variation Agreement did not change any of the material terms of the 2001 Thailand SPA.  In particular, no change was made to the provision in the 2001 Thailand SPA that the purchase consideration for the Tong Garden (T) shares was to be based on the NTA of Tong Garden (T) as at 31 December 2000.  This was because the parties themselves had always contemplated that they would be bound by the provisions in the 2001 Thailand SPA even though the NTA of Tong Garden (T) as at 31 December 2000 would not actually be determined until sometime after the execution of the agreement117Foot Note 117×[188] of OTC’s AEIC.. 91 OTC and OBC also asserted that there was nothing surreptitious about the execution of the Variation Agreement.  It was approved at the EGM of the Company on 8 October 2009 after notice of the EGM was given to all shareholders, including OHC (through the OA)118Foot Note 118×Exhibit OTC-52 of OTC’s AEIC..  As for the valuation of the Tong Garden (T) shares, a firm of valuers (CC Koh & Co) was engaged to prepare a valuation report on the fair market value of the shares based on Tong Garden (T)’s NTA as at 31 December 2000 – as per the provisions of the 2001 Thailand SPA.  It was the valuers’ opinion that the shares had negative value as at 31 December 2000 in light of Tong Garden (T)’s negative NTA at that date.  That Tong Garden (T)’s NTA was negative as at 31 December 2000 was also evident from the company’s audited accounts and other documents119Foot Note 119×[194]-[197] of OTC’s AEIC..  Indeed, some of these documents included correspondence sent to OHC and minutes of a meeting attended by him: they showed that he had been well aware, at the very least by early 2002, that Tong Garden (T)’s accounts showed a negative NTA120Foot Note 120×See for e.g. exhibit OTC-55 of OTC’s AEIC.; and yet he had not raised any objections or expressed any consternation until the present litigation.  In the circumstances, there was no basis for OHC to complain about the CCK valuation and/or the Valuation Agreement.",
        "Summary of OTC’s and OBC’s case": "92 To sum up, therefore: OTC’s and OBC’s position was that the transactions impugned by OHC were genuine transactions for which there were valid commercial reasons.  Neither OTC nor OBC had committed any breaches of their fiduciary duties as directors of the Company.  Moreover, OHC had known of these transactions for years prior to the present litigation and had not raised any objections for years.  In particular, he had been contemporaneously aware of the 2008 restructuring exercise but had not protested then, nor for years afterwards.  His present claim for minority oppression had come about only after he realised that OTC had made a success of the 2008 restructuring and that the new companies set up by OTC were doing well.  That OHC’s claim of oppression was not genuine and was motivated by greed was seen,inter alia, in his asking – by way of his prayer for “alternative” relief – to be given shares in OTC’s new companies. 93 In any event, OTC and OBC contended that even assuming the breaches of fiduciary duties alleged by OHC were made out, they constituted wrongs done to the Company: OHC himself could not claim to have suffered any loss other than a diminution in the value of his shares in the Company, which was purely reflective of the Company’s loss.  His claim, despite being cloaked in the rhetoric of minority oppression, was thus in reality a claim to vindicate corporate wrongs and recover reflective loss.",
        "The law: The general principles applicable to claims of minority oppression": "94 Having summarised each side’s narrative as to the alleged acts of oppression, I set out below the general principles applicable to claims under s 216 of the Companies Act.  There is no real dispute as between the two sides about what these principles are.  InOver & Over Ltd v Bonvests Holdings Ltdand another[2010] 2 SLR 776 (“Over & Over”), the Court of Appeal (“CA”) agreed with the first-instance judge that there was “no meaningful distinction” between the four limbs of injustice to minorities countenanced in s 216: the “common thread” under s 216 is “some element of unfairness which would justify the invocation of the court’s jurisdiction under s 216” (at [77]).  In this connection, the CA cited the judgment of the Privy Council inRe Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227, a case on appeal from the Federal Court of Malaysia concerning the application of the Malaysian equivalent of our s 216.  In that case, Lord Wilberforce held (at 229) – … [F]or the case to be brought within s 181(1)(a) [ie,the Malaysian equivalent of our s 216] at all, the complaint must identify and prove “oppression” or “disregard”.  The mere fact that one or more of those managing the company possess a majority of the voting power and, in reliance upon that power, make policy or executive decisions, with which the complainant does not agree, is not enough.  Those who take interests in companies limited by shares have to accept majority rule.  It is only when majority rule passes over into rule oppressive of the minority, or in disregard of their interests, that the section can be invoked. …there must be a visible departure from the standards of fair dealing and a violation of the conditions of fair play which a shareholder is entitled to expect before a case of oppression can be made(Elder v Elder & Watson Ltd1952 SC 49):their Lordships would place the emphasis on“visible”.  And similarly “disregard” involves something more than a failure to take account of the minority’s interest: there must be awareness of that interest and an evident decision to override it or brush it aside or to set at naught the proper company procedure(per Lord Clyde inThompson v Drysdale1925 SC 311, 315). … [emphasis added] 95 InTomolugen Holdings Ltdand another v Silica Investors Ltd and other appeals[2016] 1 SLR 373 (“Tomolugen”), the CA held (at [88]) that … the essence of a claim for relief on the ground of oppressive or unfairly prejudicial conduct lies in upholding the commercial agreement between the shareholders of a company.  This is irrespective of whether the agreement is found in the formal constitutional documents of the company, in less formal shareholders’ agreements or, in the case of quasi-partnerships, in the legitimate expectations of the shareholders … The role of [s 216] was, and still remains, that of remedying differences which sometimes inevitably arise as a consequence of persons associating for an economic purpose through the corporate form of a company.  Section 216 is concerned with protecting the commercial expectations of the parties to such an association. … 96 The special treatment of quasi-partnerships was explained inOver & Over.  There, the CA noted (at [78]) that while a court in deciding whether to grant relief under s 216 will usually consider the legal rights and the legitimate expectations of members as enshrined in the company’s constitution, a special class of quasi-partnership companies form an exception to this rule.  In such cases, shareholders may have enforceable expectations which do not emanate from any articles of association and which are not necessarily submerged in the company’s structure, but which arise from considerations of a personal character between one individual and another that may make it unjust or inequitable to insist on legal rights or to exercise them in a particular way (at [79]).  In the context of quasi-partnerships, the courts have “consistently applied a stricter yardstick of scrutiny because of the peculiar vulnerability of minority shareholders in such companies” (at [83]). 97 In the present case, however, OHC has been clear that he doesnotallege the Company to be a quasi-partnership.  He has been clear that his case isnotbased on equitable considerations arising from some personal relationship of mutual confidence between him, OTC and OBC.  While each of the four siblings has at one point or another during these proceedings referred to the business of the Company (and of the Tong Garden Group) as “the family business”, it was evident from the outset that such references to “the family business” meant no more than that the shareholders of the Company were members of the same family.  In this respect, the High Court inLeong Chee Kin(on behalf of himself and as a minority shareholder of Ideal Design Studio Pte Ltd) v Ideal Design Studio Pte Ltd and others[2017] SGHC 192 (“Ideal Design”) has noted that it is not the case that a minority oppression claim can succeed only where equitable considerations are superimposed or where the court finds that the company is a quasi-partnership (at [51]): … s 216 of the [Companies] Act is wide enough to encompass companies of different types.  But a claim in minority oppression is often more difficult to establish where no equitable considerations are superimposed.  This is because in the absence of equitable considerations, the unfairness of a party’s conduct must be measured against legitimate expectations arising from the members’ legal rights and the company’s constitution … 98 In this connection, the wrong which a claimant in s 216 proceedings seeks to vindicate must be a wrong done to him in his personal capacity as a minority shareholder – as opposed to a wrong done to the company. As the High Court inIdeal Designpointed out (at [81]–[83]), this conceptual distinction between personal rights and corporate rights is the result of two rules.  The first is the proper plaintiff rule, which states that “only a company can sue for losses that it has suffered, because a company is a legal entity distinct from its shareholders”.  An important exception to this rule is the statutory derivative action provided under s 216A of the Companies Act, which allows a shareholder to obtain leave of court to bring an action on the company’s behalf for a wrong done to the company.  The other side of the proper plaintiff rule is the rule against recovery of reflective loss, which states that “a person may not initiate an action to recover a loss which he has suffered by virtue of a diminution in the value of his shares in a company which merely reflects the company’s own loss and for which the company can be made whole if it were to pursue its rights against the party responsible for that loss”.  As the court inIdeal Designnoted (at [83]), the proper plaintiff rule and the reflective loss principle – taken together – require that a breach of a right vested in a shareholder be vindicated at the suit of the shareholder, whereas a breach of a right vested in the company ought to be vindicated at the suit of the company. 99 This delineation between personal wrongs and corporate wrongs – and the applicability (or not) of s 216 in each case – was considered at length by the CA inHo Yew Kong v Sakae Holdings Ltdand other appeals and other matters[2018] 2 SLR 333 (“Ho Yew Kong”). 100 InHo Yew Kong, Sakae Holdings Ltd (“Sakae”) was the minority shareholder in the company Griffin Real Estate Investment Holdings Pte Ltd (“Griffin”), while Gryphon Real Estate Investment Corporation Pte Ltd (“GREIC”) was the majority shareholder.  Sakae, GREIC and Griffin entered into a joint venture agreement (“JVA”) whereby Griffin was intended to be the vehicle through which the parties would invest in certain properties, redevelop them and sell them at a profit.  Sakae brought proceedings under s 216 against the shareholders of GREIC – Andy Ong, Ong Han Boon and Ho Yew Kong.  Sakae alleged that they had acted in a manner oppressive to its interests as a minority shareholder by engaging in transactions that caused a substantial amount of moneys to be diverted from Griffin to companies in the ERC Group which was owned and controlled by Andy Ong.  One of the issues in contention during the trial was whether Sakae’s oppression claims were properly brought under s 216 in that they pertained to personal wrongs committed against it, or whether this was really a case of corporate wrongs committed against Griffin which ought instead to be vindicated by way of a derivative action under s 216A of the Companies Act.  The trial judge held that Sakae’s oppression claims were properly brought under s 216.  In upholding her decision, the CA reaffirmed its decision inNg Kek Wee v Sim City Technology Ltd[2014] 4 SLR 723 (“Ng Kek Wee”) that s 216 should not be used to vindicate essentially corporate wrongs, for two broad reasons (at [85]): … First, an overly permissive interpretation of s 216 allowing it to be invoked to vindicate wrongs to a company would be contrary to the legislative scheme, which provided for the commencement of a statutory derivative action on behalf of the company (subject to its own built-in safeguards) under s 216A to remedy such wrongs.  Second, permitting an essentially corporate wrong to be pursued by way of an oppression action under s 216 would be an abuse of process as it improperly circumvented the proper plaintiff rule, and might result in the aggrieved shareholder who brought a s 216 action recovering damages at the expense of other similarly affected shareholders, who could otherwise have benefitted too if the action had properly been brought on behalf of the company under s 216A … 101 As it had done inNg Kek Wee, inHo Yew Kongthe CA acknowledged that “the distinction between personal complaints of oppression and complaints of wrongs against a company was not always clear, and this was compounded by the fact that under s 216, ‘the concept of commercial unfairness also appears to embrace wrongs done to the company’” (at [86]).  The CA held that where an oppression action features both personal wrongs and corporate wrongs – 115 … the key question to be addressed in [such] overlap cases may be framed in these terms: is a plaintiff who brings an oppression action under s 216, instead of seeking leave to commence a statutory derivative action under s 216A, abusing the process? 116 … In our judgment, the appropriate analytical framework to ascertain whether a claim that is being pursued under s 216 is an abuse of process is as follows: (a)Injury (i) What is the real injury that the plaintiff seeks to vindicate? (ii) Is that injury distinct from the injury to the company and does it amount to commercial unfairness against the plaintiff? (b)Remedy (i) What is the essential remedy that is being sought and is it a remedy that meaningfully vindicates the real injury that the plaintiff has suffered? (ii) Is it a remedy that can only be obtained under s 216? … 119 … In our judgment, an oppression action under s 216 should generally not be permitted where the essential (or, as the case may be, the sole) remedy sought is a remedy forthe company(such as a restitutionary order in favour of the company).  Where that is the case, the presumptively appropriate remedy would be the statutory derivative action under s 216A.  In such a case, it will also be evident that the plaintiff’s primary purpose in bringing the action is not to obtain a remedy that brings to an end the situation by which it has been prejudiced or harmed as a shareholder.  In contrast, a plaintiff who seeks an essential remedy directed at bringing to an end the oppressive conduct which it has been subjected to as a shareholder will likely be permitted to pursue its claim by way of an oppression action under s 216 even if, as part of that essential remedy, it also seeks remedies in favour of the company such as restitutionary orders.  This will readily be seen to be the case where the remedies sought by the plaintiff, such as a share buyout or a winding-up order, will be impacted by suitable restitutionary orders in favour of the company. 120 At the same time, we do not think the question of whether an action under s 216 amounts to an abuse of process can be resolved by focusing solely on the essential remedy sought by the plaintiff …  To properly invoke s 216, the plaintiff would have to identify the real injury which it has suffered and establish that that injury does amount to oppressive conduct against it as a shareholder.  In this regard, it will be relevant to examine how the real injury which the plaintiff suffers as ashareholderis distinct from and not merely incidental to the injury which thecompanysuffers. … The crucial question in such a case is whether the plaintiff shareholder can demonstrate an injury to it that is distinct from the wrong done to the company. [emphasis in original] 102 Applying the above analytical framework to the facts ofHo Yew Kong, the CA was satisfied that Sakae’s oppression claims related to personal wrongs committed against it and hence were claims that were properly pursued by way of an action under s 216 as opposed to a statutory derivative action under s 216A (at [124]).  The CA’s reasoning in this respect was instructive. 103 On the question ofinjury, the CA agreed with the trial judge’s finding that Sakae’s rights had been carefully negotiated for in the JVA and/or other documents executed at the inception of the parties’ joint venture (at [125]).  The CA also agreed with the trial judge’s finding that there had been systemic abuse by Andy Ong and Ong Han Boon in relation to the management of Griffin’s affairs in that they had misappropriated large sums from Griffin without Sakae’s knowledge.  While such conduct undoubtedly constituted a wrong against Griffin, the CA was satisfied that it also separately amounted to a distinct personal wrong against the minority shareholder, Sakae.  In coming to this conclusion, the CA considered the following factors to be relevant.  Firstly, Sakae had entered into the joint venture as an investor and had provided funding for the joint venture: it would clearly have been Sakae’s legitimate expectation that its funds would not be mismanaged, much less siphoned away in the way it was done by Andy Ong and Ong Han Boon.  Secondly, it was also clear that Sakae had let Andy Ong and his team manage Griffin’s affairs because of the long-standing friendship between Andy Ong and Douglas Foo (“Foo”), the chairman of Sakae’s board.  Andy Ong knew that Foo – and by extension, Sakae – trusted him.  He deliberately took advantage of that trust, using Griffin as a vehicle through which he cheated Sakae.  In addition to the misappropriation of substantial funds, he and Ong Han Boon also engaged in fraudulent schemes by concocting sham documents to mislead Sakae and to conceal the true nature of the transactions.  The result was that there were “systemic abuses which benefitted one group of shareholders (namely, GREIC and, subsequently, ERC Holdings as well, both of which were controlled by Andy Ong at the material time) at the expense of the other (namely, Sakae)”.  In the CA’s view, therefore, the real injury which Sakae sought to vindicate was the injury to its investment in the joint venture and the breach of its legitimate expectations as to how Griffin’s affairs generally and its financial investment in Griffin in particular would be managed (at [125]). 104 Turning next to the question ofremedy, the essential remedy sought by Sakae was to exit the JVA.  In its statement of claim, it had prayed for either a winding up of Griffin or a buyout of its shares in Griffin.  In the CA’s view (at [128]), either remedy offered the only way in which Sakae could exit the joint venture with as little loss as possible and thereby meaningfully vindicate the real injury that it had suffered; namely, the misuse of its investment in Griffin and the breach of its expectations as to how Griffin would be managed.  Further, these remedies were only available in a s 216 action.  Although Sakae had additionally prayed for relief in the form of restitutionary orders against Andy Ong, Ong Han Boon and Ho Yew Kong, these orders did not constitute the essential remedy sought: rather, they were necessary in so far as they helped to ensure a fair value exit for Sakae, in that any restitution received would go directly to Griffin, such that on its winding up, all its shareholders (including Sakae) would receive the appropriate and due realisation of their investment in Griffin.  This outcome would also avert the risk of multiple claims being brought against Andy Ong and the others, as well as the risk of prejudice to the shareholders and creditors of Griffin.  Seen in this light, and given especially Sakae’s desire to wind up Griffin, any benefit that accrued to Griffin from Sakae’s oppression action was purely incidental to the essential remedy which Sakae sought – which was to bring to an end the matters that it complained of on the fairest terms possible. 105 In the circumstances, the CA concluded that it was not an abuse of process for Sakae to pursue its oppression claims by way of a s 216 action. 106 It should be additionally noted that “[a]lthough s 216(2) [of the Companies Act] confers on the court an extensive discretion to “make such order as it thinks fit”, the CA has cautioned inSembcorp Marine Ltd v PPL Holdings Pte Ltdand another and another appeal[2013] 4 SLR 193 (“Sembcorp Marine”) at [158] that – … any order granted must be made with a view to bringing an end to or remedying the matters complained of:Walter Woon([131]supra) at para 5.96.  The purpose of s 216 is to relieve minority oppression, not to proscribe majority rule.  It is for that reason that in most cases, the only practical mechanism to end minority oppression is a corporate divorce where one party buys the other out. … 107 InSembcorp Marine, the relief sought by the claimant (PPL Holdings) in its s 216 action was the invalidation of certain resolutions which the directors nominated by the majority shareholder had passed.  The CA held that given the gravely deteriorated state of the relationship between the parties, such an order could not possibly be an appropriate remedy in this case, even assuming the grounds of oppression relied upon were made out.  Among other things, there was a “real and present risk of further disputes … over the validity of resolutions owing to the fractious relationship between the parties”: invalidating the several resolutions highlighted by PPL Holdings would not go very far in redressing its underlying complaint of minority oppression.  Having concluded that the relief sought by PPL Holdings was not an appropriate remedy, the CA found it unnecessary to reach a decision on whether the substantive grounds under s 216 of the Companies Act were established.",
        "The issues in contention": "108 It will be recalled that OHC’s claim of minority oppression was based on his “legitimate expectations” as to how the Company should be run.  These “legitimate expectations” were said to arise from his “legal rights” under “the Articles of Association of the Company, Section 157 of the Companies Act (Cap 50), common law and/or equity”, in so far as they formed the sources for duties imposed on OTC and OBC as directors of the Company121Foot Note 121×[36] of the Statement of Claim (Amendment No. 2)..  To recap: as pleaded by OHC, these were essentially duties of loyalty, honesty and diligence, which required,inter alia, that OTC and OBC “always act in the interests of the Company and all shareholders”, that they refrain from putting themselves in positions where their interests might conflict with those of the Company, and that they discharge their duties “with reasonable diligence”122Foot Note 122×[36(a) to (g)] of the Statement of Claim (Amendment No. 2)..  OHC’s case was that the various transfers of the assets, shares and business of entities within the Tong Garden Group were carried out by OTC and OBC in breach of their duties; and that these acts were thus contrary to his “legitimate expectations” as to how the Company should be run123Foot Note 123×[38] of the Statement of Claim (Amendment No. 2).. 109 It is fair to say that OTC and OBC did not dispute – as a general proposition of law – that directors of a company owe duties of loyalty, honesty and diligence to the company.  However, OTC disputed firstly that he was a director of the Company at the time the allegedly oppressive acts took place.  ACRA records showed that he was appointed a director of the Company between 3 July 1984 and 14 April 2001, and re-appointed as director on 30 December 2015; and he rejected OHC’s assertion that he was either ade factoor a shadow director in the period between 14 January 2008 and 29 December 2015 when the allegedly oppressive acts were carried out124Foot Note 124×[6] and [7] of the Statement of Claim (Amendment No. 2).. 110 Secondly, even assuming both OTC and OBC were subject to the directors’ duties pleaded by OHC during the relevant period, both disputed that the various transfers and disposals of assets, shares and business were in breach of such duties.  In this connection, as I alluded to earlier, each side’s opposing characterisation of the nature of these transfers and disposals was premised on the view they took of the Company’s solvency, the viability of its business, and the value of its assets. 111 Thirdly, even assuming the various transfers and disposals were found to have been carried out in breach of their directors’ duties, OTC and OBC contended that these breaches really amounted to wrongs against the Company and not against OHC in his personal capacity as a minority shareholder.  As such, even if they were held to be in breach of their directors’ duties, the appropriate course of action was for a statutory derivative action to be pursued under s 216A of the Companies Act; and it was an abuse of process for OHC to bring an oppression claim under s 216. 112 Fourthly, contrary to OHC’s claim that he had only found out about the various transfers and disposals “in December 2015”125Foot Note 125×[243] of OHC’s AEIC., both OTC and OBC charged that OHC had in fact known about the impugned transfers and disposals much earlier.  As such, he was barred by the doctrine of laches from claiming the reliefs sought (according to OTC126Foot Note 126×[70.3] of the 1st Defendant’s Defence (Amendment No. 3).) and/or time-barred under the Limitation Act (Cap 163, 1996 Rev Ed) (according to OTC and OBC)127Foot Note 127×[38.3] of the 1st Defendant’s Defence (Amendment No. 3). [31] of the 2nd Defendant’s Defence (Amendment No. 1).. 113 I will address each of these contested issues in turn.",
        "Whether OTC was either ade factodirector or a shadow director in the period between 14 January 2008 and 29 December 2015": "114 On the issue of whether OTC was either ade factodirector or a shadow director of the Company between 14 January 2008 and 29 December 2015, while the evidence available was in my view insufficient to warrant a finding that he was a shadow director, I was prepared to accept that he did act as ade factodirector.  My reasons are as follows. 115 At the outset, it should be noted that whether someone is ade jure,de facto, or shadow director, he owes the same duties to the company under the Companies Act and at general law: see in this respect the definition of “director” in s 4(1) of the Companies Act and also the judgment of the High Court inSakae Holdings Ltd v GryphonReal Estate Investment Corp Pte Ltd and others (Foo Peow Yong Douglas, third party) and another suit[2017] SGHC 73 (“Sakae Holdings”)at [33]. 116 In so far as the definition of a “de factodirector” is concerned, this has been clearly explained by the High Court inRaffles Town Club Pte Ltd v Lim Hock Eng Peter and others(Tung Yu-Lien Margaret and others, third parties)[2010] SGHC 163 (“Raffles Town Club”).  In that case, Chan Seng Onn J noted that there did not appear to have been any local judicial pronouncement on the exact meaning of the term.  Having reviewed the relevant English and Australian authorities, he cited with approval the applicable principles as set out by Jonathan Gaunt QC (sitting as a deputy judge of the High Court) inGemma Ltd v Davies[2008] BCC 812 as follows (at [58]): (1) To establish that a person was ade factodirector of a company, it is necessary to plead and prove that he undertook functions in relation to the company which could properly be discharged only by a director (per Millett J. inRe Hydrodam (Corby) Ltd (in liq.)[1994] BCC 161 at 163). (2) It is not a necessary characteristic of a de facto director that he is held out as a director; such “holding out” may, however, be important evidence in support of the conclusion that a person acted as a director in fact (per Etherton J. inSecretary of State for Trade and Industry v Hollier[2006] EWHC 1804 (Ch); [2007] BCC 11 at [66]). (3) Holding out is not a sufficient condition either. What matters is not what he called himself but what he did (per Lewison J. inRe Mea Corp Ltd[2006] EWHC 1846 (Ch); [2007] BCC 288). (4) It is necessary for the person alleged to be a de factodirector to have participated in directing the affairs of the company (Hollier (above) at [68]) on an equal footing with the other director(s) and not in a subordinate role (above at [68] and [69] explaining dicta of Timothy Lloyd Q.C. inRe Richborough Furniture Ltd[1996] BCC 155 at 169–170). (5) The person in question must be shown to have assumed the status and functions of a company director and to have exercised “real influence” in the corporate governance of the company (per Robert Walker L.J. inRe Kaytech International Plc[1999] BCC 390). (6) If it is unclear whether the acts of the person in question are referable to an assumed directorship or to some other capacity, the person in question is entitled to the benefit of the doubt (per Timothy Lloyd Q.C. inRe Richborough Furniture Ltd(above)), but the court must be careful not to strain the facts in deference to this observation (per Robert Walker L.J. inKaytechat 401). In the same judgement, Chan J also considered the concept of “shadow directors” and held that the test as to whether a person was a “shadow director” of a company was to be formulated as follows (at [45]): … a “shadow director” is one “in accordance with whose instructions and directions the directors are accustomed to act”. By “accustomed”, this means that there must be a “pattern of behaviour” (per Lord Millet J inRe Hydrodam (Corby) Ltd[1994] BCC 161 (“Re Hydrodam”) at 163) on the part of the rest of the directors in complying with the shadow director’s directions or instructions. … 117 Chan J added that he agreed with academic commentary to the effect that the word “accustomed” suggested “some degree of habit”: there must be some consistent pattern in the behaviour of compliance; and occasional instances of compliance would not be sufficient to satisfy the definition.  Equally, in the converse situation where there is such a pattern of compliance, the occasional exercise of independent judgment by the board should not excuse the alleged shadow director.  Chan J also made it clear that he found it unnecessary to introduce an element of “manipulation” or “puppeteering” into the definition of “shadow director” as the imposition of such additional requirements would defeat theraison d’êtreof this concept, which is to ensure that those who are responsible for the important corporate decisions of a company are held to task regardless of what they are called and their motives or manner in making such corporate decisions.  As Chan J put it (at [48]): The test is, thus, simple: is there sufficient evidence showing that the directors of a corporation are accustomed to act on the directions or instructions of that person? If yes, then the status of a shadow director may be imputed to him. Whether the board has exercised its decision independently or otherwise is irrelevant and has to be so: otherwise, the rationale underpinning the “shadow director” concept would be subverted. It follows, therefore, that the shadow director is not necessarily a sinister puppeteer who is manipulating the board from the wings of a stage as our imaginations would have us believe. … 118 Somewhat oddly, despite OHC having pleaded that OTC had acted either as ade factoor a shadow director during the period 14 January 2008 to 29 December 2015, it was not clearly explained in the statement of claim what functions OTC was supposed to have undertaken in relation to the Company which could properly only be discharged by a director.  In his AEIC, OHC set out various acts by which OTC was alleged to have taken over control of the Company from 2008 onwards128Foot Note 128×[157]-[200] of OHC’s AEIC..  Thus, for example, OHC’s AEIC recounted the following: (a) On 14 January 2008, OBC sent an internal memorandum on behalf of the Tong Garden Group and the board of directors of the Company, to all Tong Garden employees in Singapore and Malaysia, in which he announced that with effect from 14 January 2008, the “operations of the two countries’ business shall be taken over by [OTC]”, and OSA would “retire from the day-to-day running of the business in Singapore & Malaysia to enable [OTC’s] management of the said business”129Foot Note 129×[161] of OHC’s AEIC.. (b) On 18 January 2008, OTC executed (together with OBC) Support Services Agreements between Food Products (M) and Food Products (S), and between Snack Food (M) and Food Products (S).  Pursuant to these agreements, the Malaysian companies outsourced to Food Products (S) certain financial management and internal audit functions, for which Food Products (S) was to receive “a fee equivalent to the actual payroll costs of the personnel assigned” to provide the services, “plus a mark up of 50%”130Foot Note 130×[162] and exhibit OHC-86 of OHC’s AEIC..  The agreements were signed by OTC on behalf of the Malaysian companies and by OBC on behalf of Food Products (S). (c) Staff from Food Products (S) were apparently seconded to OTC’s company Tong Garden Food (Singapore) Pte Ltd from August to December 2008 and from January to December 2009 (excluding November 2009).  In respect of at least one employee of Food Products (S), it appeared that from May 2009 onwards, his payslip was issued on the letterhead of Tong Garden Food (Singapore) Pte Ltd.131Foot Note 131×[174]-[175] of OHC’s AEIC. (d) OTC’s company Tong Garden Food (Singapore) Pte Ltd also rented motor vehicles and office premises from Food Products (S) between June and December 2008132Foot Note 132×[174] of OHC’s AEIC.. (e) In August 2009, Food Products (S), Food Products (M) and Snack Food (M) entered into distributorship agreements with OTC’s companies, Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd133Foot Note 133×[176]-[177] of OHC’s AEIC..  The key provisions of these distributorship agreements have been described in [45] above.  It will be recalled that under these agreements, Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd were appointed the sole and exclusive distributor of peanuts and other snack foods in Singapore and Malaysia respectively; and profits from the sale and distribution of these products were to be shared with 60% going to Tong Garden Food (Singapore) Pte Ltd or Tong Garden Marketing Sdn Bhd (as the case might be), and 40% to Food Products (S) or Snack Food (M) (as the case might be). (f) OTC and/or OBC failed to procure a renewal of the Trademark Licence Agreements of 10 October 2002 which Villawood had signed with the companies of the Tong Garden Group.  Instead, OBC caused Villawood to enter into a Trademarks Licence Agreement with Tong Garden Food (Singapore) Pte Ltd and Tong Garden Marketing Sdn Bhd on 13 March 2010, pursuant to which Villawood gave these two companies the perpetual, irrevocable and exclusive licence to market, manufacture and sell products under (inter alia) the “Tong Garden” and “NOI” trademarks in Singapore and Malaysia134Foot Note 134×[183]-[185] of OHC’s AEIC.. (g) On 20 February 2012, by way of a Directors’ Resolution in Writing pursuant to article 107 of the Company’s Articles of Association, it was resolved that Food Products (S) be placed into members’ voluntary liquidation135Foot Note 135×[191]-[192] of OHC’s AEIC..  This Directors’ resolution was signed by the then sole director of Food Products (S) (one Loh Ngiap Hin).  A special resolution to this effect was also passed at an EGM of Food Products (S) in February 2012.  This was signed by OBC in his capacity as the authorised representative of TGHPL (which owned the entire beneficial interest in Food Products (S)). (h) On 10 October 2013, OBC and Loh Ngiap Hin signed off on another Directors’ Resolution in Writing, this time resolving to wind up the business of the Malaysian entities – Tong Garden Holdings Sdn Bhd, Food Products (M) and Snack Food (M).  An ordinary resolution to this effect was also passed at an EGM of the Company on 31 October 2013 by the proxies of OTC and OBC who attended the meeting. 119 For the most part, OTC did not deny the occurrence of the above events and acts.  It should be noted, however, that these events and acts related chiefly to the business and assets of subsidiary companies within the Tong Garden Group, rather than those ofthe Companyitself; further, that only some of these were acts carried out by OTC.  No explanation was proffered by OHC in his AEIC, nor in the course of his testimony, as to how the above events and acts amounted to evidence ofOTChaving been either ade factodirector or a shadow director ofthe Company.  For that matter, nothing emerged in the cross-examination of OTC and OBC which elucidated OHC’s case theory as to how OTC had acted either as ade factodirector or a shadow director of the Company.  In particular, on the subject of shadow directors, it did not appear that OHC was able to pinpoint any specific piece of evidence which might establish that OBC had been “accustomed” to acting on the directions and instructions of OTC in the running of the Company.  If this was indeed what OHC was seeking to convey, it appeared to me to be conjecture; and tellingly, such a case theory was not actually explored with either OTC or OBC in cross-examination.  In the circumstances, I did not find any basis for concluding that OTC was a shadow director of the Company in the period between 14 January 2008 and 29 December 2015. 120 I had somewhat more sympathy for the alternative argument that OTC was acting as ade factodirector of the Company.  Whilst the events and acts brought up in OHC’s AEIC (above) related mainly to subsidiaries such as Food Products (S) rather than to the Companyper se, this was perhaps not surprising, given that the Company was a pure holding company which conducted no business of its own, and whose revenue was derived from its investments in the businesses of the subsidiaries and associated companies136Foot Note 136×[40] of the Statement of Claim (Amendment No. 2)..  OTC did not deny having made the various arrangements – the distributorship agreements, for example, and the secondment of Tong Garden Group employees to his own companies, as well as the purchase of equipment and other items from subsidiaries like Food Products (S).  Indeed, in his AEIC, he revealed that having agreed to OBC’s request to take over the running of the Tong Garden Group’s business, he made the decision to “let the Parent Company [ie, the Company – Tong Guan Food Products Pte Ltd] and its subsidiaries become inactive and eventually wound up”137Foot Note 137×[172] of OTC’s AEIC..  He implemented this decision by “gradually wind[ing] down the operations of [the Company] and/or its subsidiaries by realising their assets and paying off their creditors as best as possible”.  It should also be highlighted that on his own evidence and on OBC’s, he did these things largely on his own: as OBC himself put it138Foot Note 138×[45] of OBC’s AEIC.– With the involvement of OTC, I then, as before with OSA, left the running of the Tong Garden business to him. 121 OTC has argued that he was simply stepping in to “clean up the mess that was [the late Mr Ong’s] Tong Garden Business” in the absence of any other Ong sibling’s willingness to do so and that instead of acting as a director of the Company, he was in effect acting as a manager.  I did not think this was an accurate description of the functions undertaken by OTC in the period between 14 January 2008 and 29 December 2015.  The decisions he took to let the Company and its subsidiaries become inactive and eventually to wind them up were decisions which were critical to the continued operation (or not) of the Company.  I did not think decisions on such existential issues could have been made and implemented by a mere “manager”.  In my view, these could only have been undertaken by a director of the Company.  The fact that OTC may not have held himself out as a director in the period between 2008 and 2015 is beside the point.  As Chan J remarked inRaffles Town Club([116]supra)at [59] (quoting Lewison J inRe Mea Corp Ltd[2006] EWHC 1846 (Ch)), “what is important is not what he called himself, but what he did”. 122 For the reasons given above, I was prepared to accept that OTC was ade factodirector of the Company between 14 January 2008 and 29 December 2015.  As a director of the Company in that period, he was subject to the same duties of loyalty, honesty and diligence as OBC.",
        "Whether OTC and OBC acted in breach of their duties as directors": "123 I next address the issue of whether OTC and OBC acted in breach of their duties as directors of the Company.  I found that they did not.  My reasons for coming to this conclusion were as follows. 124 To recap, OHC’s case is that he had “legitimate expectations” that the directors of the Company would comply with the duties imposed on them as directors by various sources, including the Companies Act and common law; and that OTC and OBC breached these duties in carrying out the various impugned transfers, thereby breaching OHC’s “legitimate expectations”.",
        "The applicable legal principles": "125 InIdeal Design([97]supra), the plaintiff was the minority shareholder of the company Ideal Design Studio Pte Ltd.  He brought a minority oppression claim against the defendants (who were the remaining directors and the majority shareholders) after being removed from his position as director and after discovering that the defendants had incorporated five new companies of their own to which they had diverted business away from Ideal Design Studio Pte Ltd.  He relied on three grounds of oppression, one of which was the diversion of business.  In allowing the plaintiff’s claim on this particular ground, the High Court held (at [65]) that it was a “well-established principle” that – 65 … the directors of a company have a fiduciary duty to act in its best interests.  It follows from this that shareholders have a legitimate expectation that those in control of the company will actbona fidein the best interests of the company.  That is especially so when the majority shareholders are themselves the directors.  These propositions were set out clearly by Hoffmann LJ (as he then was) inRe Saul D Harrison.  In that case, he observed that, as a starting point, the legitimate expectations of shareholders must be analysed against the company’s constitution and the fiduciary duties imposed by the law … … Since keeping promises and honouring agreements is probably the most important element of commercial fairness, the starting point in any case under s 459 [equivalent to s 216 of the Act] will be to ask whether the conduct of which the shareholder complains was in accordance with the articles of association. The answer to this question often turns on the fact that the powers which the shareholders have entrusted to the board are fiduciary powers, which must be exercised for the benefit of the company as a whole.  If the board act for some ulterior purpose, they step outside the terms of the bargain between the shareholders and the company. … [T]he fact that the board are protected by the principle of majority rule does not necessarily prevent their conduct from being unfair within the meaning of s 459. … 66 Whether there has been a breach of a director’s fiduciary duties is thus a relevant, but not determinative, consideration in deciding whether there has been oppressive conduct.  In this respect, those in control of a company must act with valid commercial reasons when pursuing a company’s best interests … [T)he test is whether an honest and intelligent person in the position of the directors could objectively and reasonably conclude that the impugned acts were in the interests of the company. [emphasis in original omitted] 126 In so far as the diversion of business was concerned, the High Court held that “[t]he majority’s conduct in diverting business away from a company in which a complainant has a minority shareholding, without adequate justification”, would amount to oppressive conduct under s 216 of the Companies Act (at [67]).  On the evidence before it, the court rejected the defendants’ contention that they had valid commercial reasons for diverting business from Ideal Design Studio Pte Ltd to their five new companies.  In the court’s view, the diversion – being without any valid commercial reason – was “contrary to the best interests of Ideal Design Studio”, and was “not only a breach of [the defendants’] fiduciary duties to Ideal Design Studio” but also “grossly commercially unfair to the plaintiff as a minority shareholder of Ideal Design Studio”.  The defendants were found to have “defeated the plaintiff’s legitimate expectation as a shareholder and [were] thus guilty of oppressive conduct within the meaning of s 216 of the [Companies] Act” (at [77]). 127 OHC sought to present his case as being very similar toIdeal Design([97]supra), in that he too was complaining about the diversion of assets and business away from the Company to OTC’s companies, not for any valid commercial reason but (according to him) simply to benefit and enrich OTC. 128 I pause here to note that whilst the High Court inIdeal Design([97]supra) spoke only of a director’s fiduciary duties, in the present case OHC has pleaded – in addition to fiduciary duties on OTC’s and OBC’s part – a duty to “use reasonable diligence in the discharge of their duties”139Foot Note 139×[36(b)] of the Statement of Claim (Amendment No. 2).pursuant to s 157(1) of the Companies Act.   In this respect, it is not disputed that the relevant standard of care and diligence is objective: that is, whether the director has exercised the same degree of care and diligence as a reasonable director found in his position.",
        "The financial status of the Company in the period leading up to 2008 and thereafter": "The opposing narratives 129 By way of another recap: OTC’s and OBC’s assertion that they had valid commercial reasons for the impugned transfers – and OHC’s assertion that they had none – were based on competing narratives about the financial status of the Company in the period leading up to 2008 and afterwards.  OTC and OBC asserted that the Company – and the wider Tong Garden Group – had been struggling with considerable financial difficulties from 1999 through to 2008; and that these dire circumstances explained the efforts to wind down business operations in an orderly fashion via the 2008 restructuring exercise.  OHC, on the other hand, claimed that the Company had been a “flourishing” entity with “extremely valuable” assets which OTC and OBC had misappropriated for the benefit of OTC’s companies.  I found in favour of OTC’s and OBC’s version of events; and I was satisfied in the circumstances that they had valid commercial reasons for the various transfers.  I set out below my reasons for coming to these conclusions. Why the solvency status of the Company was a point of contention 130 At the outset it should be noted that both OTC and OBC contended that the Company was insolvent in the period leading up to 2008 and certainly at the time the 15 March 2008 agreement was entered into.  Assuming they owed the Company duties as directors between 14 January 2008 and 29 December 2015, this issue of the Company’s solvency – or at least, of the gravity of its financial problems – was relevant to any consideration of the nature and extent of these duties.  As the High Court explained inParakou Shipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 15 (“Parakou”, at [62]): Where directors’ duties are concerned, it is axiomatic that directors have a duty to act in the interests of the company.  Generally, this refers to the interests of the company as a separate commercial entity which in many cases are very readily identified with the interests of its shareholders as a whole: Hans Tjio, Pearlie Koh and Lee Pey Woan,Corporate Law(Academy Publishing, 2015) (“Corporate Law”) at para 09.045.  The company’s solvency status is relevant because “when a company is insolvent, or even in a parlous financial position, directors have a fiduciary duty to take into account the interests of the company’s creditors when making decisions for the company”:Liquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 (“Progen”) at [48].  The greater the concern over the company’s financial health, the more weight the directors must accord to the interests of creditors over those of the shareholders:Dynasty Line Ltd (in liquidation) v Sukamto Sia and another and another appeal[2014] 3 SLR 277 (“Dynasty”) at [34]. 131 To the above, it should be added that where a company is insolvent or in a parlous financial position, its directors’ fiduciary duty to “ensure that the company’s assets are not dissipated or exploited for their own benefit to the prejudice of creditors’ interests” is a duty owed to the company: there is no duty owed directly to the creditors (Liquidators of Progen Engineering Pte Ltd vProgen Holdings Ltd[2010] 4 SLR 1089 at [48] and [52]). 132 Both sides were also agreed that “[t]he cash flow test and the balance sheet test are well established tests for determining whether a company is solvent … [A] company is insolvent if it is unable to pay its debts as they fall due (the cash flow test) or if the value of its assets is less than the amount of its liabilities, taking into account the contingent and prospective liabilities (the balance sheet test)” (Parakouat [64]). 133 According to OTC and OBC, assuming they owed the Company fiduciary duties as directors at the time the allegedly oppressive acts took place, these duties included the duty to take into account the interests of creditors.  On the issue of solvency, it should also be noted that OTC’s and OBC’s position was that the Company was at the very least balance sheet insolvent at the material time.  As for cash flow insolvency, even if the Company itself could not be said to fall strictly within the definition of cash flow insolvency, its subsidiaries were cash flow insolvent – or faced severe cash flow issues; and these problems impacted adversely on the Company’s own finances. 134 Not surprisingly, OHC denied that the Company was insolvent either before or at the point the allegedly oppressive acts occurred.  Nor did he even admit to the Company, or for that matter the Tong Garden Group, having any financial problems: according to him, “[t]here was no crisis”140Foot Note 140×[227] of the Plaintiff’s closing submissions.; it was only one subsidiary – Food Products (S) – which had financial difficulties141Foot Note 141×[239] of the Plaintiff’s closing submissions.; and even then, these financial difficulties were a “mere bump in the road”142Foot Note 142×[275] of the Plaintiff’s closing submissions.. Balance sheet insolvency 135 I will deal with the issue of balance sheet insolvency first.  It is not disputed that the Company’s audited financial statements show it had negative NTA from 1999 onwards.  The relevant figures are set out in the table below: DateNet Asset (S$)Income Statement (S$)Cash Flow Statement(S$)Page reference in agreed bundles30/6/1999-10,579,233-12,390,165-12AB6438 – 643931/12/1999-8,341,040618,193-12AB6656 – 665731/12/2000-9,176,664-835,6242,49313AB6982 – 698531/12/2001-13,296,693-4,120,02937214AB7284 – 728731/12/2002-13,642,644-725,95110,34614AB7569 – 757231/12/2003-14,331,175-688,53110,10414AB7846 – 784931/12/2004-13,942,064-126,53311815AB8029 – 803231/12/2005-14,011,914-69,8503,86415AB8258 – 826131/12/2006-14,104,201-92,28718,20116AB8480 – 848331/12/2007-14,081,459-29,2584,91416AB8742 – 874631/12/2008-13,366,014715,4454,72917AB9077 – 908031/12/2009-13,396,845-30,8311,17217AB9586 – 9589 136 It is also not disputed that prior to June 1999, the Company’s accounts had not shown negative NTA; and that the chief reason for its negative NTA in 1999 was the decision by its management to make provisions to impair its investment in its subsidiaries. 137 While OHC could not deny what the Company’s audited financial statements showed, he sought to suggest – in the course of cross-examination of the defendants – that an accurate picture of the Company’s financial health – as well as the financial health of the Tong Garden Group as a whole – was possible only by reference to its consolidated accounts; and no such consolidated accounts were available.  In his cross-examination of the defendants, OHC also sought to suggest that the provisions for impairments were not properly made. Consolidated accounts 138 In respect of OHC’s arguments about the need for consolidated accounts, it must first be pointed out that OHC was a director of the Company between 16 August 1980 and 7 May 2003.  During that period, he signed off on numerous occasions on the Company’s audited accounts143Foot Note 143×See for example 12AB 6226 in relation to the audited accounts for the financial year ending 30 June 1998., which included the following statement by directors: Statement by directors We, the undersigned, state that, in the opinion of the directors: (i) One set of consolidated accounts has not been prepared for the Group as it is considered preferable, in the interests of the shareholders, that the accounts of the subsidiaries be attached to the accounts of the Company as there are no practical benefits to be gained by the shareholders of Tong Guan Food Products Pte Ltd [ie, the Company]; (ii) The accounts so prepared are not significantly affected by transactions and balances between the Company and its subsidiaries, and which are disclosed in the notes to the Company’s accounts. 139 It should be noted that OSA – who for reasons of her own appeared to align herself with OHC’s position during the trial – had also signed off on similar statements in the Company’s accounts. 140 As at 1999, or for that matter as at 2003, the relevant provisions of the Companies Act permitted that in lieu of one set of consolidated accounts being prepared for the Tong Garden Group, the accounts of the subsidiaries could be attached to the financial statements of the Company.  This state of affairs was acknowledged by OHC’s expert witness, Mr Abuthahir Abdul Gafoor (“Mr Abuthahir”), during cross-examination144Foot Note 144×See transcript for 29 August 2019 at p 114 lines 2 to 17..  This state of affairs was also explained to OHC by the then Special Manager, one Tay Woon Teck, during an Annual General Meeting on 7 May 2003 when OHC asked why the 1999 audited accounts had not been consolidated. 141 Curiously, having previously declared in his capacity as director the belief that there were “no practical benefits” to be gained by the shareholders in having consolidated accounts prepared, OHC did not provide any coherent explanation for his insistence at trial on the need for one set of consolidated accounts.  He failed to explain how (if at all) the picture presented of the Company’s and/or the Tong Garden Group’s financial health by a set of consolidated accounts would differ from that presented by the existing financial statements.  In particular, he failed to demonstrate how a set of consolidated accounts would prove that the Company had actually been balance sheet solvent between 1999 and 2009. 142 In this connection, it must be highlighted that before this matter came to trial, OHC already had the means to obtain the consolidated accounts.  Following several requests by OHC to the OA for the consolidated accounts of the Company, one Sebastian Chew (“Chew”) informed OHC on 17 June 2013145Foot Note 145×9AB 4510.that the OA’s office had consolidated the financials of the Company.  As the files were too large to be sent via e-mail, Chew suggested that OHC could either pay $800 to collect a set of these consolidated accounts from the OA’s office, or he could attend at the OA’s office to view these accounts and make a copy of the specific documents he required.  OHC replied to Chew on 18 June 2013 claiming that he was unable to pay $800 but would go to the OA’s office to scan the documents himself.  Astonishingly, however, it would appear that OHC never followed up to do so.  No such consolidated accounts were provided by him in discovery.  Nor were any such consolidated accounts provided to his expert, Mr Abuthahir, for the latter’s comments.  This would suggest that OHC either never bothered to obtain the consolidated accounts from the OA’s office –orthat hehadthe accounts but did not want to disclose them.  When questioned about the matter in cross-examination, OHC blamed Chew (rather unfairly) for allegedly not replying to his e-mail of 18 June 2013, before conceding that he hadnotgone to the OA’s office but “cannot [sic] remember the reason why [he] didn’t go there at that time”146Foot Note 146×See transcript for 5 September 2019 at p 84 line 25 to p 85 line 14.. 143 Given the importance which OHC claimed the consolidated accounts held in terms of their being able to shed light on the Company’s financial health, his own apathy about obtaining – and disclosing – a copy of these accounts spoke volumes about thebona fidesof his claims.  Since he was the one claiming that “the failure to produce consolidated accounts of the company provides a distorted view of the financial status of the Company and the Tong Garden Group”147Foot Note 147×[249] of the Plaintiff’s Closing Submissions., the onus was on him to produce some evidence to support this claim.  Quite apart from failing to adduce in evidence the consolidated accounts, as I noted earlier, OHC failed to explain what sort of different picture such consolidated accounts would present of the Company’s financial status.  Certainly there was no evidence to suggest that consolidated accounts would result in a change in the negative NTA values recorded throughout the years in the Company’s audited financial statements. 144 In the circumstances, I did not find it credible for OHC to argue that the absence of consolidated accounts precluded any finding of balance sheet insolvency based on the Company’s audited financial statements. The provisions for impairment 145 I next address OHC’s other arguments for objecting to a finding that the Company was balance sheet insolvent prior to and at the time the allegedly oppressive acts took place.  These concerned his objections to provisions for impairments which were made in the Company’s accounts. 146 At the outset, it must be highlighted that OHC’s position at trial regarding the questionable nature of the provisions for impairments was something which he had never pleaded in his statement of claim.  He should have pleaded it.  The alleged lack of basis for these provisions was a material fact on which OHC’s case depended.  It was critical to his case theory about the Company having been in good financial health and thus having been in no need of the 2008 restructuring exercise.  In my view, even if one were to overlook OHC’s procedural lapse in failing to plead this material fact, such failure – and the failure too to bring up the issue in his AEIC – must bespeak a certain lack ofbona fidesin the objections he subsequently raised at trial to the provisions for impairment.  Nevertheless, given that counsel for OTC and OBC addressed OHC’s arguments on these provisions at some length in their closing submissions, I will deal with the key points which were raised. 147 It is not disputed that the $11m provision in June 1999 was what caused the Company to record negative NTA in that year, whereas in June 1998, the Company’s NTA had shown a positive value.  For ease of reference, I reproduce below the table from paragraph 3.2.3 of Mr Abuthahir’s expert report which set out the components of this $11m provision: Name of subsidiariesCountry of IncorporationPercentage heldCompany’s cost of investmentTotal Provision made as at 30 June 1999Tong Garden Holdings Pte Ltd and its subsidiariesSingapore100%8,862,9298,862,929Tong Garden Food Products Co LtdChina100%1,174,0001,174,000N.O.I. Food Products Co. LtdChina100%1,065,2451,065,245Tekfront Engineering Pte LtdSingapore100%30,00030,00011,132,17411,132,174 148 At trial, OHC sought to challenge the basis for these provisions.  At first, in OHC’s cross-examination of OSA148Foot Note 148×See transcript for 19 September 2019 at p 24 line 22 to p 26 line 14., it was repeatedly suggested to OSA that the provisions for impairments in the Company’s accounts had to be made because of debts owed by Tong Garden (T) to Food Products (S) which the former failed to pay.  It was also suggested to OSA that Tong Garden (T)’s negative NTA – which OSA said was the factor leading her to propose to OBC a provision for the amount owed by Tong Garden (T) to Food Products (S) – “doesn’t mean anything” if Tong Garden (T) “actually had the ability to pay”149Foot Note 149×See transcript for 19 September 2019 at p 26 lines 8 to 12..  These suggestions were surprising, not least because they surfaced for the first time in the cross-examination of OSA.  Equally surprisingly, in her closing submissions, OSA also sought to suggest that the provisions for impairment were caused purely by Tong Garden (T)150Foot Note 150×See eg [169] of the 3rd Defendant’s closing submissions.. 149 In my view, these suggestions came to naught.  Despite her agreement with these suggestions during cross-examination by OHC’s counsel, when cross-examined by OTC’s counsel, OSA conceded that the inability of the Thai entities to pay the debts to Food Products (S) was not the only reason for the provision for impairment in June 1999.  OSA agreed with OTC’s counsel that in fact, “the biggest impairment for [the Company] was in respect of [TGHPL]”; and that in respect of the provisions made for doubtful debts owing to TGHPL, the largest sum was in respect of an amount due from the Company to TGHPL151Foot Note 151×See transcript for 19 September 2019 at p 150 line 6 to p 153 line 12.. 150 In any event, in the closing submissions made on his behalf, OHC appeared to abandon the suggestions made to OSA in cross-examination.  Instead, OHC argued in his closing submissions that there was a “lack of clarity” as to whether it was the Company that was insolvent, or its subsidiaries – or even the entire Tong Garden Group152Foot Note 152×See eg [233]-[235] of the Plaintiff’s Closing Submissions..  It was also submitted that the provisions for impairments in the Company’s accounts were simply “unexplained”153Foot Note 153×See eg [246] of the Plaintiff’s Closing Submissions., that the auditors had qualified their opinion on the accounts, and that there was thus no reliable evidential basis on which to make a finding of balance sheet insolvency. 151 Firstly, there was no merit in OHC’s submission that there was no clarity as to which entity it was that was “insolvent”.  Indeed, with respect, I found a lack of clarity in OHC’s own submissions on the issue of the Company’s insolvency, because it was not made clear in those submissions whether references to “insolvency” were intended to be references to balance sheet insolvency, or cash flow insolvency – or both.  In so far as balance sheet insolvency was concerned, there was no dispute that the Company would be balance sheet insolvent if the value of its assets was less than the amount of its liabilities, taking into account the contingent and prospective liabilities (Parakouat [64]).  Judging from the evidence he put forward and his counsel’s cross-examination of the defendants and the defence expert Mr Timothy James Reid (“Mr Reid”), it also did not appear to me that OHC was at all confused as to what parties were talking about when they referred to balance sheet insolvency. 152 In his closing submissions, OHC also harped at some length on the profitability of subsidiaries such as Food Products (S), Food Products (M) and Snack Food (M)154Foot Note 154×See eg [237] of the Plaintiff’s Closing Submissions..  It was not clearly explained how the profitability of certain subsidiaries might be relevant to the issue ofbalance sheet insolvency.  The suggestion appeared to be that the profitability of these three entities cast doubt on the provisions for impairment of the Company’s investments in its subsidiaries155Foot Note 155×See eg [247]-[248] of the Plaintiff’s Closing Submissions.. 153 I did not consider this suggestion to be of any merit.  The fact that these entities were making profit at some point did notper sepreclude an assessment that the business of these entities was not viable.  Indeed, the fact that they were making profit did not even necessarily mean they were able to meet their debts as and when these fell due.  This is a point I will come to in the next section concerning cash flow insolvency.  In relation to the issue of the provisions for impairment, the short answer to any suggestion about the validity of these provisions is this: as seen from the table reproduced below, the evidence of Mr Abuthahir (OHC’s expert)156Foot Note 156×[3.1.18] of Mr Abuthahir’s expert report.revealed that even if the impairments were reversed, the Company’s accounts would still show steadily declining NTA values over the years from 1999 onwards – and negative NTA for the financial years ending 31 December 2007, 31 December 2008 and 31 December 2009.  In other words, Mr Abuthahir’s evidence actually supported OTC’s and OBC’s evidence that the Company’s financial performance was deteriorating over the years, to the point where it was balance sheet insolvent prior to and at the time OTC started the 2008 restructuring exercise. DateTotal Assets (S$)Provision for ImpairmentTotal Assets (prior to provision for impairment)Total Liabilities (S$)Net Asset (S$)30/6/199812,989,20030,00013,019,20011,178,2681,840,93230/6/19992,211,89411,132,17413,344,06812,791,127552,94131/12/19992,426,22011,132,17413,558,39410,767,2602,791,13431/12/20001,458,68211,824,57413,283,25610,635,3462,647,91031/12/20011,137,29015,840,21816,977,50814,433,9832,543,52531/12/20021,696,63015,840,21817,536,84815,339,2742,197,57431/12/20031,151,07715,324,57416,475,65114,966,6081,509,04331/12/2004663,06215,324,57415,987,63614,605,1261,382,51031/12/2005665,50915,324,57415,990,08314,677,4231,312,66031/12/2006665,32415,324,57415,989,89814,717,5251,272,37331/12/2007652,03712,392,92913,044,96614,733,496(1,688,530)31/12/2008551,54312,392,92912,944,47213,917,557(973,085)31/12/2009354,16312,392,92912,747,09213,751,008(1,003,916)31/12/2010289,57012,392,92912,682,4998,447,0504,235,499 154 I make two final points on the issue of the Company’s balance sheet insolvency.  Firstly, OHC alleged that the Tong Garden Group owned numerous properties which would surely have constituted assets of some considerable value.  He relied on the list of properties set out in the Operational and Financial Review conducted on TGHPL by Stone Forest in September 2000.  Regrettably, however, he did not produce any evidence of the alleged value of these properties.  There was no evidence that these properties were unencumbered.  Nor was there any evidence of the status and the value of each of these properties as at end-2007.  Indeed, on the face of it, as the defence expert Mr Reid pointed out, at least several of the larger properties listed by Stone Forest in 2000 appeared to show market values that were well below their purchase price.  In the circumstances, there was no evidential basis for me to conclude that as at end-2007 (that is, just before the allegedly oppressive acts occurred), all these properties were still owned by the Tong Garden Group and that they would have tilted the balance in the Company’s favour in so far as its NTA was concerned. 155 Secondly, I noted that OHC had relied on the declarations of solvency made by OTC for Food Products (M), Snack Food (M) and TGHPL – and on the fact that Food Products (S) underwent a members’ voluntary liquidation – as evidence that “the Tong Garden Business was always a healthy, profitable one”, and that there was “no commercial justification for implementation of the 2008 Restructuring”157Foot Note 157×See eg [274]-[275] of the Plaintiff’s Closing Submissions.. With respect, however, this argument was misconceived – and somewhat misleading.  It must be remembered that under 293(1) of the Companies Act, the declaration of solvency is really a statement of the directors’ opinion that “the company will be able to pay its debts in full within a period not exceeding 12 months after the commencement of the winding up”.  The various subsidiaries mentioned by OHC were wound up between 2012 and 2016 – that is, several years after the implementation of the 2008 restructuring.  The declarations of solvency for Food Products (M) and Snack Food (M) were filed on 6 November 2013158Foot Note 158×9AB 4538 and 4534.; whereas the declaration of solvency for TGHPL was filed on 1 November 2016159Foot Note 159×10AB 5082..  For Food Products (S), the members’ resolution for voluntary liquidation was passed in February 2012160Foot Note 160×9AB 4413.. 156 The declarations of solvency for the Malaysian entities and TGHPL – and the fact that Food Products (S) underwent a members’ voluntary liquidation – thus bore out OTC’s assertion that a key objective in the 2008 restructuring exercise was to ensure that the creditors of the Tong Garden Group would be paid even as the late Mr Ong’s Tong Garden Business wound down operations. Cash flow insolvency 157 I next address the issue of cash flow insolvency.  As alluded to earlier, OHC attempted in his closing submissions to draw a clear distinction between the financial position of the Company and that of its subsidiaries: in particular, he claimed that of all the subsidiaries, only Food Products (S) faced any financial difficulties, whereas there was “no evidence of the Company facing claims from creditors at the material time, i.e. 2007 to 2008”161Foot Note 161×[238] of the Plaintiff’s closing submissions..  OHC also attempted to downplay the financial difficulties faced by Food Products (S) as being temporary, even insignificant (“mere bump in the road”162Foot Note 162×[275] of the Plaintiff’s closing submissions.). 158 In the first place, OHC’s claim about Food Products (S) being the only subsidiary to face any financial difficulties was incorrect.  It would not be unfair to say that the financial health of the Tong Garden Group began a visible deterioration around the period 1998 to 2001; and that during this period, it was largelyTGHPL(the Company’s wholly-owned subsidiary) which was beset by claims – and at one stage, litigation – brought by UOBVI and UOB.  In her AEIC163Foot Note 163×See eg [38] and [66] of OSA’s AEIC., OSA detailed these claims by UOBVI and UOB, and estimated that the total sum paid to them between March 1999 and mid-2001 came to $7,464,431.  The breakdown of the payments to UOBVI and UOB has been tabulated in the closing submissions tendered by OBC’s counsel164Foot Note 164×[17] of the 2nd Defendant’s closing submissions..   What was noteworthy about this table – quite apart from the total amount paid – was the revelation that a sizeable chunk of the moneys used to pay UOBVI and UOB had come out of the working capital of Food Products (S).  For example, between 1999 and 2001, more than $1.5m of Food Products (S)’s working capital was diverted to paying off UOB in respect of loan recalls.  As another example, UOBVI’s claim for the Redemption Price (plus interest) of the Preference Shares under the 1995 UOB Agreement was eventually settled by the payment of a total sum of $4,015,919 – of which more than $1.2m came from the working capital of Food Products (S).  Another $1.5m came from a loan taken out with another bank (Bangkok Bank), while the remainder came from a rights issue and the sale of the Tong Garden Group’s trademarks. 159 I say this was noteworthy because on the evidence available, the satisfaction of the substantial liabilities owed to UOBVI and UOB left the Tong Garden Group financially strapped.  This was acknowledged by OHC himself in an e-mail he sent to OSA (then the Tong Garden Group’s financial controller) on 4 March 2002165Foot Note 165×4AB 1950., in which he berated the latter for not having better managed their finances: … U should foreseen that we will face cash flow problems after paying approx 6-7 millions to UOBVI n UOB bank during 99 to 2000,  if u are a smart Group Financial Controller.  And i told u to arrange new banking facilities in 2000, but u insist of collecting the debt from our subsidiaries which they also need fund to operate. 160 In respect of Food Products (S), it would seem that it was (at least to a large extent) the multiple diversions of its working capital towards the payment of TGHPL’s liabilitiesvis-à-visUOBVI and UOB between 1999 and 2001 that created a vicious cycle of indebtedness for Food Products (S) in the years that followed.  Counsel for both OTC and OBC took Mr Abuthahir through the extensive evidence of Food Products (S)’s indebtedness during cross-examination.  Surprisingly, and rather disconcertingly, Mr Abuthahir had not previously received from OHC most of the documents concerned, but having been taken through the documentary evidence, he agreed with defence counsel that it showed Food Products (S) was unable to meet its debts as and when they fell due166Foot Note 166×See transcript for 27 August 2019 at p 147 line 18 to p 148 line 3.. 161Inter alia, the evidence showed different trade creditors chasing Food Products (S) for payment in the period between 2001 and 2008.  As early as 11 September 2001, OHC himself had forwarded to OTC a chaser for payment from a trade creditor (Meridian Nut Growers Alliance LLC) with the telling remark, “[t]hese kind of mail from supplier not the first time”167Foot Note 167×3AB 1266..  In some cases, the demands by trade creditors for payment escalated into litigation, resulting in judgments being entered in court for sums ranging from five figures to six figures: see for example the judgement obtained by Maya Systems Consultants for $51,000 on 13 August 2004168Foot Note 168×5AB 2627.and the judgment obtained by Munchy Food Industries Sdn Bhd for $317,890.69 plus interest on 26 January 2005169Foot Note 169×5AB 2653..  As at early 2008, just months before the 15 March 2008 agreement was entered into between OTC and OBC, Food Products (S) continued to be in such straitened financial circumstances that invoices totalling just US$49,922.30 from one trade creditor (General Mills) had gone unpaid for a period of more than a year, while the increasingly irate e-mails from the trade creditor were largely ignored by OSA170Foot Note 170×6AB 3021 to 3028.. 162 Food Products (S)’s inability to pay debts owing to trade creditors in the period between 2001 and 2008 was exacerbated by its outstanding liabilities to its bankers which it also struggled to pay.  As early as 19 July 2002, for example, OCBC was threatening to appoint judicial managers over Food Products (S)’s failure to settle overdue draft loans and trust receipts totalling over US$116,000171Foot Note 171×4AB 2126..  While this did not eventually come to pass, it will be seen from the 19 July 2002 letter that it was also within this period that OCBC appointed a Special Manager for Food Products (S).  It was also in the wake of this 19 July 2002 letter that OBC had to write to the creditor banks – OCBC, UOB and Bangkok Bank – to seek their support172Foot Note 172×4AB 2127..  The resulting protracted negotiations with the banks led to Food Products (S) agreeing in April 2003 to pay the creditor banks a total of $80,000 per month173Foot Note 173×5AB 2516.. 163 Unfortunately, Food Products (S)’s problems in paying its various loan instalments and other banking liabilities persisted in the ensuing years.  In fact, in June 2003, UOB rejected its debt restructuring proposal and terminated credit lines174Foot Note 174×5AB 2562..  On 15 August 2003, OSA was obliged to write to the creditor banks to ask yet again for their support175Foot Note 175×5AB 2579..  Food Products (S) continued to struggle and falter in its financial performance over the next few years.  In October 2006, further failure by Food Products (S) to repay overdue credit facilities led again to demands from UOB, which were eventually addressed by OBC stepping in to pay off UOB176Foot Note 176×5AB 2718, 2721..  On 12 January 2007, Food Products (S) was notified by Bangkok Bank that in respect of its short-term loan facility for $1m, it was in arrears of loan instalment and interest payments to the tune of $220,000.  In that same month, on 9 January 2007, OCBC sought to revise the credit facilities extended to Food Products (S), so as to require (inter alia) that OBC execute a Deed of Guarantee and Indemnity to secure these facilities177Foot Note 177×5AB 2770..  OBC refused to provide such a guarantee – and when Food Products (S) still had not accepted the facility letter on OCBC’s revised terms by May 2007, the bank wrote to put on record the outstanding debt of $3.69m and to demand immediate payment of overdrawn arrears in the sum of $474,713178Foot Note 178×6AB 2826..  When Food Products (S) failed to satisfy its demand, OCBC issued a formal demand through its lawyers on 24 May 2007, seeking payment of the total amount due under the credit facilities ($3,703,184) and giving notice of its intention to exercise the mortgage and debenture it held.  Eventually, the total amount owing to OCBC was settled only after OCBC agreed to withhold legal action to permit Food Products (S) to sell its factory at 33 Chin Bee Crescent179Foot Note 179×6AB 2914.. 164 As I noted earlier, after being shown the documentary evidence of these and numerous other instances of Food Products (S)’s inability to pay its debts as and when they fell due, Mr Abuthahir was prepared to accept that it was cash flow insolvent.  I make three points about the implications of Food Products (S)’s cash flow insolvency for the Company’s financial health. 165 Firstly, OHC’s insistence that the Company remained unaffected by its subsidiaries’ financial woes was in my view highly contrived and entirely unsustainable.  He himself had pleaded in his statement of claim180Foot Note 180×[22] of the Statement of Claim (Amendment No. 2).that – The Company is a pure holding company.  It does not conduct any business.  It derives revenue via its investments in the businesses of its subsidiaries and associated companies. 166 Given that the Company derived its revenue from its investments in the businesses of its subsidiaries and associated companies, it stood to reason that any financial troubles which impacted the businesses of these subsidiaries or associated companies would in turn have adverse repercussions on the Company’s financial position.  OHC’s expert Mr Abuthahir agreed as much when cross-examined by OBC’s counsel181Foot Note 181×See transcript for 29 August 2019 at p 71 lines 25.: Q. … [I]n the course of your examination, it is undisputed thatD4, the company, is a pure holding entity; correct? A.   That iscorrect. Q.The financial health in turn sits on the bedrock of subsidiaries, right? A.That’s right. Q. So if the subsidiaries are ailing and suffering, what does it speak about the value of the holding? A.The value is deteriorating. [emphasis added]   . 167 Secondly, OHC sought to persuade me that Food Products (S)’s financial problems were not really serious because by 2008, Food Products (S) had managed to pay off its debt to OCBC182Foot Note 182×[261] of the Plaintiff’s Closing Submissions..  This proposition seemed to me again highly contrived.  Any suggestion that Food Products (S)’s financial struggles ended with the eventual payment to OCBC would ignore the fact that payment was made possible only by OCBC agreeing to allow the company time to sell its factory183Foot Note 183×6AB 2914 at [4]..  Even more critically, any such suggestion would ignore the fact that in achieving the eventual settlement with OCBC, Food Products (S) was obliged to divest itself of the very premises it needed for its operations; and it would still have other bank loans and other liabilities to contend with even after having lost its operating premises. 168 Another point raised by OHC in his attempt to downplay Food Products (S)’s financial problems related to the large amount of unpaid taxes (some $1.5m) owed to IRAS, for which IRAS had appointed collection agents.  OHC argued that this claim by IRAS was resolved in the end.  However, he ignored the fact that the IRAS claim was resolved only after OSA had written to IRAS to put on record the company’s sizeable losses184Foot Note 184×6 AB 2979..  In particular, OSA had informed IRAS that the bad debts owing to the company were in excess of its estimated chargeable income.  OSA’s correspondence with IRAS thus confirmed the dire state of Food Products (S)’s finances; and the subsequent resolution of IRAS’ claim was no indication of any financial fortitude on the company’s part – indeed, quite the converse. 169 The third point is one I alluded to earlier.  In asserting that the Company was doing well financially and that it had no need of any restructuring in 2008, OHC placed considerable weight on the profitability of subsidiaries such as Food Products (S), Food Products (M) and Snack Food (M)185Foot Note 185×See eg [237] of the Plaintiff’s Closing Submissions..  However, as I noted earlier, the fact that these entities were making profit at some point did notper sepreclude an assessment that the business of these entities was not viable.  Nor did the fact that they were making profit necessarily mean they were able to meet their debts as and when these fell due: Food Products (S)’s inability to do so has been addressed above. 170 As for Food Products (M) and Snack Food (M), it should be remembered that to begin with, there was heavy dependence placed on these Malaysian companies to prop up the Singapore operations by means of monthly remittances.  As early as September 2002, Mr Tay Woon Teck (the Special Manager appointed by OCBC) had observed in an e-mail to OCBC that Food Products (S) relied on monthly remittances of $200,000 “from the Malaysian operating companies to support its Singapore working capital”186Foot Note 186×5AB 2233..  OSA herself admitted in cross-examination that “we depend on the Malaysian operation to finance Singapore operation”187Foot Note 187×See transcript for 20 September 2019 at p 3 lines 11 to 14..  Whilst Food Products (M) and Snack Food (M) showed net profit of RM268,350 and RM538,274 respectively as at end-2007, both had a negative position at end-2007 in terms of net cash and cash equivalents: -RM433,929 for Food Products (M) and -RM527,483 for Snack Food (M)188Foot Note 188×16AB 8772-8777, 8808-8809, 8812.. 171 In addition, although both Food Products (M) and Snack Food (M) had positive NTA as at end-2007, as both OBC189Foot Note 189×See transcript for 18 September 2019 at p 156 line 6 to p 158 line 16.and the defence expert Mr Reid190Foot Note 190×See transcript for 4 September 2019 at p 59 line 4 to p 60 line 20.pointed out, the bulk of their assets in the period 2006 to 2007 actually consisted of amounts owing from related companies.  In respect of Food Products (M), for example, of the RM10.488m shown as its total current assets as at end-2007, Mr Reid pointed out that the bulk of that amount came from RM9.133m owing from related companies; and the largest item of liability was RM4.268m in “bank short-term borrowings”.  The significance of this for Food Products (M)’s financial health, as Mr Reid noted, was as follows: … [S]hort-term borrowings are shown as current liabilities.  That means that the short-term borrowings are due to be repaid within the next 12 months in the balance sheet.The amount owing by related companies is 9 million. Given that it is the most significant asset on the balance sheet and some almost 50 per cent of that amount is shown as short-term borrowings, which by definition that is a current liability to be repaid within the next 12 months. If the amount owing by related companies is not received, and there are few other current assets, in fact it represents almost 90 per cent of the current assets, if that money is not paid, then one can expect that there will be difficulties in meeting the short-term borrowing payments required to be paid in the 12 months, based purely on this balance sheet. [emphasis added] 172 Equally significantly, when asked, OBC’s evidence was that as at 2007, the Company and its subsidiaries “were in no position” to repay an amount of RM9.133m.191Foot Note 191×See transcript for 18 September 2019 at p 158 lines 12 to 16.In this connection, I note Mr Abuthahir had at one point agreed with OBC’s counsel that the Tong Garden Group was “cash flow insolvent”192Foot Note 192×See transcript for 29 August 2019 at p 72 line 1 to p 74 line 15..  OHC has argued in his closing submissions that there is no concept in law of “group insolvency”.  This is strictly correct, but it appears to me counsel’s point was that there were very large intra-Group borrowings, and that OBC’s evidence showed there was no prospect of these liabilities being satisfied. 173 In light of the above reasons, I was of the view that even assuming OHC was correct in saying the Company itself did not face direct claims from creditors, the financial circumstances of the subsidiaries in which it had invested were such that its own financial viability was in serious doubt by the time of the 15 March 2008 agreement. 174 Indeed, this lack of viability could be seen from the reaction of the Ong siblings to whom OBC offered his shares in August 2007.  OTC, who met with these siblings (OSA, OSL and Ong Siew Kuan) prior to being approached by OBC himself, testified that they had concluded the Company “cannot be rescued”193Foot Note 193×See transcript for 16 September 2019 at p 54 line 21to p 55 line 12.; and that despite his offering them a loan of $1m to take up OBC’s shares, they declined to do so, even describing the Company disparagingly as “a Ferrari without engine”194Foot Note 194×See transcript for 12 September 2019 at p 81 line 5 to p 82 line 9..  Even OHC claimed that although in 2006 or 2007 he had been approached by his sister Ong Siew Hua with a purported request from OBC to return to the Tong Garden business, he had turned down the request because OBC could not meet the conditions he set (which included a demand he had made unsuccessfully in previous litigation for the “return” of certain shares)195Foot Note 195×See transcript for 6 September 2019 at p 80 line 4 to p 81 line 19..  In other words, by 2007 OHC himself had rejected the possibility of his own involvement in running the Company’s business. 175 In short, at the point in time just prior to the occurrence of the allegedly oppressive acts in 2008, the Company was either insolvent (having met the test for balance sheet insolvency), or at the very least in a parlous financial state. The consequences of my findings as to the state of the Company’s finances 176 It follows from the above findings that I accepted OTC’s and OBC’s explanation for the transactions complained of by OHC: namely, that far from being acts designed to divert “valuable” Company assets to OTC and/or OBC and thereby to oppress OHC’s rights as minority shareholder, these transactions were meant to address the Company’s financial problems and ultimately to ensure that its creditors could be paid even as its business was wound up. 177 I will deal next with the specific allegations made by OHC in respect of each of the allegedly oppressive acts.  I start with the issue of the Tong Garden trademarks.",
        "The disposal of the Tong Garden trademarks": "178 In respect of the Tong Garden trademarks, by way of recap: OHC claimed that OTC and OBC had breached their fiduciary duties to the Company in failing to ensure the trademarks were returned to the Tong Garden Group at the expiry of the ten-year licence granted to Food Products (S) and Snack Food (M), and in arranging instead for the trademarks to be transferred to OTC’s companies.  Critically, OHC’s case was premised on the proposition that the sale of these trademarks to Villawood on 13 March 2000 was not a genuine sale: Villawood never acquired – and was never intended to acquire – any beneficial interest in them.  The Company remained “the beneficial owner of the Registered Trademarks” and “of all the goodwill, intellectual property rights, title and interest in or arising from the use” of the unregistered “Tong Garden” and “NOI” trademarks “under common law”196Foot Note 196×[44B]-[44C] of the Statement of Claim (Amendment No. 2).; and the “intention was for the said trademarks [ie,the ‘Tong Garden’ and ‘NOI’ trademarks] to ultimately be returned to companies within the Tong Garden Group at a later stage”197Foot Note 197×[44] of the Statement of Claim (Amendment No. 2).. 179 I found OHC’s allegations to be entirely devoid of merit.  My reasons were as follows. 180 In the first place, there was nothing in the documentary evidence to support OHC’s assertion that the sale to Villawood was not a genuine sale or that the Company retained beneficial ownership of the trademarks post sale.  If anything, the documents pointed to the 13 March 2000 agreement having been a genuine sale.  As early as 12 November 1999, the minutes of an EGM of TGHPL had recorded a resolution that the directors be authorised to sell any of TGHPL’s assets to raise funds for the redemption of UOBVI’s Preference Shares, provided such sales took place at valuation price or market price as determined by a reputable accounting firm198Foot Note 198×1AB 384..  The minutes of a subsequent EGM on 6 March 2000 recorded the authorisation of the sale to Villawood at the price of $260,000199Foot Note 199×1AB 558-559.; and on 17 March 2000, a directors’ resolution (signed by OTCand OHC) was passed stating that it was in TGHPL’s best interests that the sale and purchase agreement with Villawood be accepted200Foot Note 200×1AB 642..  At no point was there any mention of the retention of beneficial ownership by the Company.  Indeed, in the decade following the sale to Villawood, no mention was ever made of the Company’s beneficial ownership of these trademarks or of the “intention” for them to be returned to the entities within the Tong Garden Group.   For that matter, nor was there any mention – whether at the time of the Villawood sale or in the years thereafter – of an obligation on anyone’s part to ensure that the companies of the Tong Garden Group would be licensed to use the trademarks in perpetuity. 181 Not only did the documents point to there having been a genuine, outright sale of the trademarks to Villawood, the circumstances in which the transaction took place were such that OHC and his siblings could hardly have intended anything else.  I have already referred earlier to the financial problems created – not just for TGHPL, but also for the ultimate holding company, the Company – when UOBVI moved to redeem its Preference Shares in 1999.  The minutes of the 12 November 1999 EGM showed that TGHPL was by that stage already contemplating the sale of all its assets to raise funds for the redemption.  There is no dispute that the $260,000 raised from the sale to Villawood went towards the settlement of TGHPL’s liabilitiesvis-à-visUOBVI. 182 On UOBVI’s part, it should be remembered that since it was looking to TGHPL at this stage for more than $3m in the redemption of its Preference Shares, it would have scrutinised any sale of assets by TGHPL with an eagle eye.  Indeed, records of subsequent meetings with the banks showed that other creditor banks such as OCBC were aware of the sale of the trademarks201Foot Note 201×5AB 2271..  The expected scrutiny by creditor banks would be the main reason why at the EGM on 12 November 1999, the shareholders of TGHPL took pains to stipulate that the trademarks must be valued by a reputable accounting form such as PWC or KPMG Peat Marwick. 183 Quite apart from the lack of any objective evidence to corroborate his claims, OHC himself could not keep his story straight as to why the sale to Villawood was not a genuine sale.  In the original version of his statement of claim, OHC had pleaded that the 13 March 2000 agreement with Villawood came about only because “certain entities in the Tong Garden Group were embroiled in litigation with third parties at the material time”, and “all shareholders” of the Company agreed to assign the trademarks to Villawood “to prevent these valuable assets from falling into the hands of possible execution creditors”202Foot Note 202×[42] of the original Statement of Claim at p 172 of the Setting Down Bundle..  Subsequently, OHC sought to amend the pleadings as he claimed that he had “refreshed” his memory and no longer believed that the plan among the shareholders had been to assign the trademarks to Villawood “to prevent these valuable assets from falling into the hands of possible execution creditors”: instead, “what was discussed was to generally protect the trademarks by transferring them offshore with a view to having the trademarks returned later on.  It was … more of a general asset protection strategy”203Foot Note 203×[24] of OHC’s affidavit dated 1 March 2019 in support of SUM 1060/2019.. 184 Unfortunately, this rendered OHC’s case even murkier, since he failed to explain why there was a need to “protect” the trademarks at all.  Indeed, in cross-examination, not only did OHC fail to explain the nature and purpose of the 13 March 2000 agreement, he proceeded to contradict his own pleaded position by putting forward at least two new allegations.  Despite having pleaded that the “intention was for the said trademarks to ultimately be returned to companies within the Tong Garden Group at a later stage”, in cross-examination OHC asserted that in fact, the shareholders had intended to transfer the trademarks to a new company to be incorporated in Mauritius, and that the assignment to Villawood had come about only because they were “anxious” about UOBVI’s demands for payment and the delay in the setting up of the Mauritian company204Foot Note 204×See transcript for 5 September 2019 at p 45 line 1 to p 47 line 21..  The “arrangement”, therefore – according to OHC – was for Villawood to hold the trademarks temporarily and to transfer them on a permanent basis to the new company in Mauritius once it was set up.  In this scenario, the Company would have no interest in the trademarks once they were sold to Villawood (which OHC himself admitted205Foot Note 205×See transcript for 5 September 2019 at p 62 lines 2 to 20.) – and if it had no interest in the trademarks post the Villawood sale, OHC had no basis to pursue a claim based on OTC’s and OBC’s failure to ensure their returnto the Company. 185 This was not the only new case theory which emerged from OHC’s testimony.  In cross-examination, he also claimed for the first time in these proceedings that the $260,000 paid by Villawood under the 13 March 2000 agreement was actually a loan “from OBC using the formality of the transfer of trademarks”206Foot Note 206×See transcript for 4 September 2019 at p 116 lines 4 to 10..  This was obviously an incredible proposition, made all the more so by OHC’s complete inability to describe any of the terms of the alleged loan207Foot Note 207×See transcript for 5 September 2019 at p 6 line 11 to p 7 line 6.– and his equally unhelpful response when asked why he had not mentioned this loan any earlier208Foot Note 208×See transcript for 4 September 2019 at p 123 line 15  to p 124 line 23.: … [W]e had the documents such as the sale of the trademark and the agreements, so how do you expect me to tell my lawyers about this?  I have no evidence to back it up … 186  OHC’s lament that there was “no evidence” to back up his story of a loan from OBC was certainly justified: not a scrap of evidence was to be found in any of the documents to show that the $260,000 was a loan which OBC had extended to the Company (or to some other entity within the Tong Garden Group).  It was moreover unclear exactly what role (if any) the assignment of the trademarks to Villawood played in this scenario of a loan by OBC.  Here again, OHC was unhelpful to the point of being obtuse, claiming vaguely – with no supporting evidence – that it was OBC who had “needed this contract” for the sale of the trademarks “to negotiate with UOBVI”. 187 I should also highlight that it was never explained exactly how OHC’s story of the loan by OBC “using the formality of the transfer of trademarks” could be reconciled with his other story of the intended permanent transfer to a Mauritian company – let alone with the position pleaded in his Statement of Claim (Amendment No 2).  In my view, the multiple shifts in OHC’s narrative – and his inability to explain them – showed clearly that he was making up his case as he went along. 188 The same slippery ambiguity afflicted OHC’s testimony regarding the alleged undervalue at which the trademarks were sold to Villawood.  In his bid to demonstrate that the sale to Villawood could not be a genuine sale, OHC claimed that the $260,000 sale price did not reflect the true value of the trademarks.  Regrettably, as with his story about the $260,000 being a “loan from OBC”, here again there was no evidence to support his claims about the trademarks being undervalued.  While OHC claimed that PWC was asked by “the management” to come up with a low valuation209Foot Note 209×[143]-[144] of OHC’s AEIC; see also transcript for 5 September 2019 at p 29 line 1 to p 30 line 5., this was a bare assertion uncorroborated by any objective evidence.  No attempt was made to call any witnesses from PWC.  Some attempt was made to rely on the fact that in the PWC report, the word “sale” was used within inverted commas – but in the absence of any evidence from the relevant PWC personnel and given that OHC was really claiming that PWC had deliberately undervalued the trademarks, this appeared to me to be very shaky ground from which to launch such grave allegations. 189 It must further be remembered that OHC himself was the main representative from the Tong Garden Group whom PWC communicated with in relation to the preparation of the valuation report210Foot Note 210×1AB 514 at [11]..  While there was an attempt by OHC and even OSA to suggest that OBC had given instructions to PWC211Foot Note 211×See eg transcript for 20 September 2019 at p 102 ., this was shown to be false by the PWC report212Foot Note 212×1AB 514.which referenced “discussions” between PWC on the one hand and OHC and OSA (as well as the Group Accountant) on the other.  When asked about his communications with PWC, however, OHC shifted between vague prevarication and a professed inability to remember anything of note.  When asked, for example, whether it was his position that “PWC did not carry out an accurate valuation of the trademarks because [he] had told them to undervalue the trademarks”, his response was: I think this was what we generally meant at that time. 190 Yet in the same breath, he also stated that he “can’t [sic] say for sure” whether they had told PWC “to value it at a low sum on purpose”.  Even more confoundingly, he claimed that he could not remember how PWC had responded to the request for a low valuation – and that he was not interested in their response213Foot Note 213×See transcript for 5 September 2019 at p 24 line 22 to p 30 line 5.. 191 In any event, it should be noted that having alleged that the sale to Villawood was conducted at an undervalued price, OHC failed to call any expert witness to establish this.  Instead, he appeared content to lob criticisms at the report put up by OTC’s expert witness Nicolas Konialidis.  In other words, he adduced no evidence to discharge the tactical burden that fell upon him for an issue he himself had raised. 192 In a final attempt to cast doubt on the validity of the sale to Villawood, OHC argued that the failure by the Tong Garden entities to make royalty payments to Villawood during the licence period made it “clear” that the sale “could not have been” genuine214Foot Note 214×[186] of the Plaintiff’s Closing Submissions..  This was a meritless argument because it was apparent from contemporary documents that cash flow problems on the part of the Tong Garden entities were the reason why royalties were not paid.  The minutes of a meeting between OBC, OSA and Food Products (S)’s bankers on 20 September 2002 recorded the bankers noting the lack of any royalty payments to Villawood and asking “whether [Villawood] would consider waiving the royalty feesgiven the current cashflow position of[Food Products (S)]” [emphasis added].  The minutes also recorded OBC informing the bankers that it would be difficult to secure a waiver altogether of the royalty fees because of minority interests in Villawood, but that he was prepared to allow Food Products (S) to defer the payment of 70% of the royalty fees (this being the percentage of his shareholding in Villawood) “as long as the existing creditor banks agree to hold their hands for the time being, and allow the existing debts to be restructured”215Foot Note 215×5AB 2272.. The Tong Garden trademarks: Summary 193 To sum up, therefore, OHC’s various claims about the nature of the transaction with Villawood were unsubstantiated – indeed, contradicted – by the objective evidence, while his own testimony on the subject was at best vague and at worst incredible.  I did not find it possible to give any weight to these claims.  I found that the objective evidence supported instead OTC’s and OBC’s assertion that the sale to Villawood was a genuine sale, and that there was no agreement or understanding of any sort for the trademarks to be returned to companies in the Tong Garden Group.  The sale price was based on a valuation produced by a reputable accounting firm; and no good reason has been shown to me to impute any impropriety to the valuation process.  Moreover, contemporaneous company records such as the minutes of TGHPL’s EGM on 12 November 1999 made it plain that there were legitimate commercial reasons for selling off the trademarks: the $260,000 paid by Villawood went towards paying off TGHPL’s liabilities, which meant that the Company – as the parent company of TGHPL – also benefited from the sale.  As for Villawood, it acquired both legal and beneficial ownership of the trademarks and could decide how to deal with them.  It was well within its rights to decide not to extend the ten-year licence given to the Tong Garden Group entities – and to assign the trademarks to other companies, including companies outside the Tong Garden Group. 194 Given the above, there was no basis for OHC to assert that OTC and OBC were obliged to ensure the return of the trademarks to the Tong Garden Group, or to prevent Villawood from transferring them to entities outside the Tong Garden Group.  There was thus no basis for finding a breach of fiduciary duties on their part when – at the expiry of the ten-year licence granted to the Tong Garden Group entities – the trademarks were transferred by Villawood to OTC’s companies. 195  The sale on 13 March 2000 effected the transfer to Villawood of the trademarks along with the goodwill of the business relating to the goods for which the trademarks were registered.  The goodwill of the business having been sold to Villawood, there was no basis for OHC to claim any wrongdoing on the former’s part in relation to its registration of the “Tong Garden” trademark via Trade Mark Registration No T0914609F.  It followed that there was no basis for OHC to assert that OTC and OBC should have prevented such registration; and thus no breach of fiduciary duties on their part when such registration was effected.",
        "Whether the alleged breaches of directors’ duties by OTC and OBC amounted to wrongs against OHC in his personal capacity as minority shareholder": "262 At [123]–[261] above, I have explained why I rejected OHC’s contention that OTC and OBC had breached their duties as directors of the Company.  However, even assuming the alleged breaches of directors’ duties by OTC and OBC had been proven, I would still have ruled against OHC because he was unable to show that such breaches amounted to wrongs against him in his personal capacity as a minority shareholder. 263 I earlier summarised the legal principles applicable to this issue, as laid down by the CA (see[99]–[105] above).  As a general proposition of law, OTC and OBC did not dispute that breaches of directors’ duties by the majority shareholder(s) in a company could – in addition to amounting to corporate wrongs – also amount to oppression of a minority shareholder: see for exampleLow Peng Boon v Low Janieand others and other appeals[1999] 1 SLR(R) 337,Ideal Design([97]supra), andSakae Holdings([115]supra).  It was also not disputed that the appropriate test in such “overlap” cases was that articulated by the CA inHo Yew Kong([99]supra).  To recap, the question to be asked in such cases is whether the plaintiff who brings an oppression action under s 216, instead of seeking leave to commence a statutory derivative action under s 216A, is abusing the process; and “the appropriate analytical framework to ascertain whether a claim that is being pursued under s 216 is an abuse of process is as follows” (at [116]): (a)Injury (i) What is the real injury that the plaintiff seeks to vindicate? (ii) Is that injury distinct from the injury to the company and does it amount to commercial unfairness against the plaintiff? (b)Remedy (i) What is the essential remedy that is being sought and is it a remedy that meaningfully vindicates the real injury that the plaintiff has suffered? (ii) Is it a remedy that can only be obtained under s 216? 264 I will deal first with the issue of the injury claimed by OHC in these proceedings.  As noted earlier, the CA inHo Yew Kong([99]supra) has explained how – in respect of the element of injury – the test it had articulated was to apply.  The CA held that while the abuse committed by Andy Ong and Ong Han Boon in relation to the management of Griffin’s affairs constituted a wrong against Griffin, this misconduct also separately constituted a personal wrong against the minority shareholder Sakae because of several factors.  In particular, the CA noted that Sakae had invested in the joint venture by providing funding; also, that Sakae had let Andy Ong and his team manage Griffin’s affairs because of the friendship which the chairman of Sakae’s board, Foo, had with Andy Ong and the trust he reposed in Andy Ong.  Noting that Andy Ong and Ong Han Boon had systematically misappropriated large sums from Griffin and fabricated documents to cover their tracks, the CA found that the real injury which Sakae had suffered was the injury to its investment in the joint venture and the breach of its legitimate expectations as to how Griffin’s affairs generally and its financial investment in Griffin in particular would be managed (see [125]). 265 In this connection, the findings of fact made by the trial judge – which the CA upheld – were instructive.  Thus, for example, in respect of the payment of excessive management fees to GCM (a company incorporated for the purposes of managing Griffin’s real estate investment, of which Andy Ong and Ong Han Boon were the directors), the trial judge had noted the express negotiations on the management fee which took place between the parties at the time of the JVA.  She found thatat the time of the JVA, Sakae had clearly indicated the amount of management fees it was willing to accept being paid; and yet AndyOng and Ong Han Boon had purposely disregarded Sakae’s position as to the proper amount of remuneration for GCM and gone behind its back to put in place an arrangement they knew Sakae would never agree to(seeSakae Holdings([115]supra)at [69]–[72]). 266 As another example, in respect of a loan of $10m which Andy Ong and Ong Han Boon had caused Griffin to disburse to ERC Unicampus (a company of which Ong Han Boon was sole director), the trial judge found that Andy Ong’s and Ong Han Boon’s conduct in relation to this loan was oppressive to Sakae because quite apart from the loan transaction being unlawful under s 163 of the Companies Act, it alsobreached specific clauses in the JVA which mandated Sakae’s prior approval before any loan exceeding $2m could be made by Griffin.  In addition, when Sakae was on the brink of discovering these misdeeds, Andy Ong and Ong Han Boon engaged infalsification ofGriffin’s accounts to deceive Sakae into believing no loss had been incurred by Griffin.  As the trial judge put it, the chain of events evidenced “a pattern of disregard for Sakae’s interests and a tendency on the part of the defendants to flout the norms expected of them in order to mask the extent of their wrongdoing” (seeSakae Holdings([115]supra) at [101]). 267 In each of the above examples, a real injury to the minority shareholder Sakae could be identified which was clearly distinct from the injury suffered by the company. 268 In the present case, in respect of theinjuryalleged by OHC, it will be remembered that he claimed there were essentially three sets of oppressive acts by OTC and OBC.  The first was their alleged failure to preserve the Company’s beneficial ownership of the Tong Garden trademarks which resulted in the transfer of these trademarks to entities outside the Tong Garden Group – entities in fact owned and controlled by OTC.  The second was the 2008 restructuring exercise which resulted in the alleged transfer of assets, manpower, infrastructure, information and logistics away from the Singaporean and Malaysian subsidiaries within the Tong Garden Group, again to entities owned and controlled by OTC.  This alleged transfer was said to have been done “without adequate consideration being paid and without the knowledge of [OHC]”290Foot Note 290×[52] of the Statement of Claim (Amendment No. 2)..  The third was the alleged “scheme” in 2009 to complete “surreptitiously” the sale of the Thai entities to OTC at an “immense undervalue”. 269 These acts were said to be oppressive of OHC’s rights as a minority shareholder because they represented a diversion of the Company’s assets to OTC and/or OBC, either for no adequate consideration or at an undervalue291Foot Note 291×[57]-[58], [88]-[89] of the Statement of Claim (Amendment No. 2)..  Their actions were “improper and dishonest”, “in breach of their fiduciary duties”, and “in fraudulent breach of trust”292Foot Note 292×[57]-[58], [88]-[89] of the Statement of Claim (Amendment No. 2).. 270 As pleaded, and as presented at trial, OHC’s case really amounted to allegations ofbreaches by OTC and OBC ofthefiduciary duties they owed as directors to the Company.  It followed that the loss he claimed was really the resulting diminution in the value of his shareholding in the Company.  Critically, in his statement of claim (at paragraphs 58 and 88), OHC asserted that in diverting the Company’s assets to themselves, OTC and OBC had effectively misused their powers and made improper use of their positions to gain an advantage for themselves, “thereby causing loss and detriment to the Company” [emphasis added].  This assertion was repeated and amplified at paragraph 92 of the statement of claim, in which it was pleaded that OTC’s and OBC’s conduct “hadresulted in the Company being stripped of its valuable assets and businessin Singapore, Malaysia and Thailand” [emphasis added]. 271 In short, nowhere in his pleadings nor in his evidence was OHC able to articulate an injury done to him as minority shareholder which was different from or in addition to the wrongs allegedly done to the Company.  It appeared to me, therefore, that as pleaded and as presented at trial, the breaches complained of by OHC were corporate wrongs; and the loss he sought to recover was reflective loss. 272 In arguing that he had suffered a personal wrong as shareholder which was distinct from any wrong done to the Company, OHC invoked the doctrine of “legitimate expectations”.  As pleaded293Foot Note 293×[36] of the Statement of Claim (Amendment No. 2)., OHC’s case was that because the directors of a company owe legal duties to the company such as the duty to act honestly and to use reasonable diligence in the discharge of their duties, he – as a shareholder – had “legitimate expectations” that the directors of the Company would discharge the legal duties they owed to it.  Breaches by the directors of their legal duties to the Company would then amount to breaches of his “legitimate expectations” – and thus amount to a personal wrong against him for the purposes of s 216294Foot Note 294×[38] of the Statement of Claim (Amendment No. 2).. 273 I found OHC’s invocation of the doctrine of legitimate expectations – in the terms pleaded in his statement of claim – to be misconceived. With respect, he did not seem to be clear what the doctrine stood for. 274 In the context of minority oppression actions, shareholders’ legitimate expectations may provide the basis for the imposition of equitable considerations on the relationship between the majority and the minority, such that the former’s exercise of its legal rights is restrained in some way or other.  Critically, this generally arises where the relationship between the parties is one of mutual trust and confidence – that is, a quasi-partnership.  This was made clear by the CA inTeo Chong Nghee Patrick andothers v Han Cheng Fong and another appeal[2014] 3 SLR 595 (“Teo Chong Nghee Patrick”).  In this case, the respondent (a Dr Han) was removed from his position in a joint venture company.  He sued his former joint venture partners,inter alia, for oppression, claiming that a document signed on 1 March 2010 constituted an agreement between the shareholders in the joint venture giving him an enforceable right to remain in his position.  At first instance, the High Court found in Dr Han’s favour.  One of the grounds on which the High Court found in his favour was the doctrine of legitimate expectations: the court held that the 1 March 2010 document and the surrounding circumstances gave rise to a legitimate expectation that Dr Han would not be removed from his posts, and that this legitimate expectation had been breached.  On appeal, however, the CA reversed the High Court’s decision.  The CA held that the 1 March 2010 document was not a shareholders’ agreement but a piece of “legal nonsense” devoid of any binding effect.  Over and above this, the High Court’s finding that Dr Han had a legitimate expectation to be allowed to remain in his posts was held to be “unsustainable given the nature of the relationship between the parties” (at [23] and [34]).  As the CA explained (at [35]): The doctrine of legitimate expectations arises in the context of a relationship of trust and mutual confidence – a quasi-partnership, in other words – such that equity would intervene to suspend the otherwise oppressive exercise of legal rights: see our decision inOver & Over Ltd v Bonvests Holdings Ltd[2010] 2 SLR 776 at [78]–[80].  The present case was not such an association: this was not a case of persons who had a close relationship of mutual trust who had come together on the basis of informal understandings and expectations.  The undisputed evidence was that the appellants [ie, Dr Han’s former partners] had brought Dr Han in because he had expertise in projects of such nature.  There was no room for the operation of any doctrine of legitimate expectations and it followed that Dr Han was not wrongfully dismissed on this basis. 275 That the doctrine of legitimate expectations operates in the context of a quasi-partnership was again made clear by the CA inTomolugen([95]supra).  This case involved an application to stay proceedings which had been brought by the plaintiff (Silica Investors Ltd) for relief under s 216 from oppressive or unfairly prejudicial conduct towards it as a minority shareholder in the first defendant company.  In considering the nature of s 216 proceedings, the CA cited the judgment of Lord Hoffmann inO’Neill v Phillips[1999] 1 WLR 1092 (at 1098–1099), in which Lord Hoffmann had said in relation to proceedings under s 459 of the Companies Act 1985 (c 6) (UK), which was the English equivalent of our s 216: … [A] member of a company will not ordinarily be entitled to complain of unfairness unless there has been some breach of the terms on which he agreed that the affairs of the company should be conducted.  But … there will be cases in which equitable considerations make it unfair for those conducting the affairs of the company to rely upon their strict legal powers.  Thus unfairness may consist in a breach of the rules or in using the rules in a manner which equity would regard as contrary to good faith. 276 In the present case, OHC had made it emphatically clear from the outset that he wasnotalleging the existence of a quasi-partnership between the shareholders of the Company.  Accordingly, there was no basis for him to claim reliance on the doctrine of legitimate expectations.  This was plainly not a case where he was claiming that the existence of a relationship of mutual trust and confidence as between him on the one hand and OTC and OBC on the other had given rise to some sort of equitable constraint based on “legitimate expectations”. 277 Indeed, on closer scrutiny, the legal proposition underlying OHC’s case was essentially this: for the purposes of s 216 proceedings, a minority shareholder should be able to establish a personal wrong against himself merely by characterising the majority’s breaches of their directors’ duties as breaches of his own “legitimate expectation” that directors should fulfill their legal duties to the company.  I did not think this proposition could be correct.  If it were, it would make nonsense of the proper plaintiff rule and the reflective loss principle, which underpin the conceptual distinction between personal rights and corporate rights, and the mechanism provided in s 216A for derivative actions would become otiose. 278 In advancing his case, OHC relied heavily on the High Court’s decision inIdeal Design([97]supra).  In that case, the High Court stated the following at one point in its judgment (at [65]): … [T]he directors of a company have a fiduciary duty to act in its best interests.  It follows from this that shareholders have a legitimate expectation that those in control of the company will actbona fidein the best interests of the company.  That is especially so when the majority shareholders are themselves the directors. … 279 In my view,Ideal Design([97]supra) did not actually assist OHC’s case.  In the same passage cited above, the learned judge had referenced the case ofRe Saul D Harrison& Sons plc[1995] 1 BCLC 14 (“Re Saul D Harrison”), noting that in that case, Hoffmann LJ had held that “as a starting point”, the legitimate expectations of shareholders must be analysed against the company’s constitution and the fiduciary duties imposed by the law.  However, while the “starting point” was to ask “whether the conduct of which the shareholder complains was in accordance with the articles of association” [emphasis in original omitted], compliance with the articles of association “[did] not necessarily prevent [the directors’] conduct from being unfair within the meaning of s 459 [ie, the then English equivalent of our s 216]” (cited inIdeal Designat [65]). 280 It is worth looking at the rest of Hoffmann LJ’s judgment inRe Saul D Harrison, because he went on,inter alia, to explain the circumstances in which a shareholder might have legitimate expectations of the company’s directors going beyond what was stipulated in the articles of association (at 19): …[T]here are cases in which the letter of the articles does not fully reflect the understandings upon which the shareholders are associated.  Lord Wilberforce drew attention to such cases in a celebrated passage of his judgement inEbrahimi v Westbourne Galleries Ltd[1972] 2 All ER 492 at 500 … … Thus the personal relationship between a shareholder and those who control the company may entitle him to say that it would in certain circumstances be unfair for them to exercise a power conferred by the articles upon the board or the company in general meeting.  I have in the past ventured to borrow from public law the term ‘legitimate expectation’ to describe the correlative ‘right’ in the shareholder to which such a relationship may give rise.  It often arises out ofa fundamental understanding between the shareholders which formed the basis of their association but was not put into contractual form, such as an assumption that each of the parties who has ventured his capital will also participate in the management of the company and receive the return on his investment in the form of salary rather than dividend … [I]nEbrahimi v Westbourne Galleries Ltd([1972] 2 All ER 492 at 500) Lord Wilberforce went on to say: ‘It would be impossible, and wholly undesirable, to define the circumstances in which these considerations may arise.  Certainly the fact that the company is a small one, or a private company, is not enough.  There are very many of these where the association is a purely commercial one, of which it can safely be said that the basis of association is adequately and exhaustively laid down in the articles.  The superimposition of equitable considerations requires something more…’ Thusin the absence of ‘something more’, there is no basis for a legitimate expectation that the board and the company in general meeting will not exercise whatever powers they are given by the articles of association. [emphasis added] 281 In short, Hoffmann LJ inRe SaulD Harrisonwas saying the same thing that the CA inTeo Chong Nghee Patrick([274]supra)andTomolugen([95]supra)had said – namely, that the doctrine of legitimate expectations would arise in the context of a quasi-partnership.  The learned judge inIdeal Design([97]supra) having referencedRe SaulD Harrison, it did not appear to me he intended to say anything different. 282 InIdeal Design([97]supra), it was accepted that the company in question (Ideal Design Studio Pte Ltd) was not a quasi-partnership.  Nevertheless, the High Court held that the breach of fiduciary duties by the defendant directors (who were the majority shareholders) – in incorporating five new companies and diverting business from Ideal Design Studio Pte Ltd to these five new companies – constituted a valid ground of oppression under s 216.  It should be noted that while the court remarked that acts involving the diversion of business were “[p]erhaps the most singularly censurable form of oppressive conduct”, even such acts of diversion would not invariably provide a valid ground for s 216 proceedings in every case: rather, “itcanbe oppressive conduct under s 216 of the [Companies] Act for a majority shareholder to favour another company to the detriment of the company in which a minority has his shareholding” [emphasis added] (at [67] ofIdeal Design).  In this connection, it is necessary to examine the reasoning which the court followed in arriving at the conclusion that there had been oppression on the facts before it. 283 The defendants had cited what they claimed were valid commercial reasons for the incorporation of the five new companies and the diversion of business: the need to give their customers more choice, for instance, and the desire to keep their prices competitive.  The court rejected their explanation, holding that these were not the true reasons for their conduct.  In the court’s view, “the timing and circumstances under which the five companies were incorporated [were] noteworthy” (at [74]).  In gist, the court found that there had been an understanding between the parties that the plaintiff would resign as director of Ideal Design Studio Pte Ltd and sell his shares back to the second defendant if he failed to achieve $200,000 in sales within his first six months.  The plaintiff apparently refused to sell back his shares despite failing to achieve $200,000 in sales within the first six months.  Following his refusal, the defendants convened an EGM where the plaintiff was removed from his directorship.  A month after his removal as director, and about two months after his refusal to sell back his shares, the defendants incorporated the five companies.  They did so secretly: the plaintiff was not told of the incorporation of these companies and did not find out about their existence till more than two years later. 284 Based on the above facts, the court found that the defendants had adopted a “tit-for-tat approach to shareholder relations”: having failed to get the plaintiff to sell back his shares in Ideal Design Studio Pte Ltd, they had proceeded in effect to “devalue his shareholding by diverting commercial opportunities, which should have been exploited by Ideal Design Studio for the benefit of all of its shareholders, to five companies in which they alone had an interest”  (at [76]).  The diversion was thus not only a breach of the defendants’ fiduciary duties to Ideal Design Studio Pte Ltd; it “was grossly commercially unfair to the plaintiff as a minority shareholder”.  The court further noted that the plaintiff was seeking in his s 216 action a buyout of his shares at a price which assumed the diversion had not taken place.  While acknowledging that part of this purchase price would reflect a part of the loss of profits suffered by Ideal Design Studio Pte Ltd as a result of the defendants’ breach of their fiduciary duties, the court held that this did not bar the plaintiff’s entitlement to relief under s 216 because the plaintiff was not relying on their breach of fiduciary dutiesper seto found his cause of action: instead, he relied on these breaches as “evidence of [the defendants’] complete disregard of [his] interest as a minority shareholder” (at [87]–[91]).  Further, since his “ultimate complaint” was not the breach of fiduciary dutiesper sebut the deliberate disregard of his interests as minority shareholder, a derivative action under s 216A would not have afforded him the relief he sought, which was “to be allowed to withdraw his capital and exit Ideal Design Studio by having his shares bought out by the defendants” (at [91]). 285 Much as OHC tried to borrow the terminology used inIdeal Design([97]supra) in presenting his case, it was clear that the factors which justified the court in that case finding oppression simply did not exist in OHC’s case.  I have explained earlier my findings to the effect that OTC and OBC acted for valid commercial reasons in relation to the disposal of the Tong Garden trademarks, the 2008 restructuring, and the completion of the sale of the Thai entities (see [178]–[261] above).  Even assuming, however, that there were breaches by OTC and OBC of their directors’ duties, it did not appear to me that they had set out deliberately to disregard or to undermine OHC’s interests as a minority shareholder.Inter alia, in contrast with the defendants inIdeal Designwho incorporated the five companies in secret and concealed the diversion of business from the plaintiff, I found that OTC and OBC were open about what they were doing: there was no attempt on their part to conceal from OHC the disposal of the trademarks and other assets and business to OTC’s companies, and the completion of the sale of the Thai entities to OTC. 286 In short, despite dressing up his claim in the language of oppression, OHC’s “ultimate complaint” clearly began and ended with the alleged breaches of directors’ duties by OTC and OBC: he was unable to identify any other injury which was distinct from the wrong done to the Company by such alleged breaches (seeHo Yew Kong([99]supra)at [120]). 287 An examination of the reliefs prayed for by OHC put it beyond doubt that his real complaint was never about the oppression of his rights as a minority shareholder.  In cases of genuine oppression such asIdeal Design([97]supra), the remedy sought by the plaintiff generally involves his exit from the company through an order for the buyout of his shares, with appropriate safeguards built in to the valuation process.  As Millett J said of the petitioners inRe Charnley Davies Ltd (No 2)[1990] BCLC 760 (at 784): … [T]hey wanted to be bought out.  They wanted relief from mismanagement, not a remedy for misconduct. [emphasis in original omitted] 288 In the present case, if the oppression of his rights as minority shareholder had been OHC’s real concern, the appropriate remedy would have been for him to be bought out at a price which assumed the acts of diversion he complained of had not happened.  In this connection, it was revealing that OHC was actually presented with numerous opportunities to have his shares in the Company bought out.  It will be remembered, for example, that in early 2010, OTC had made an offer to buy OHC’s shares for $50,000 – and after OHC had responded to the offer with indignant disdain, OTC had replied295Foot Note 295×8AB 4115-4117.: … Or give me your valuation report to your value of your share, I will revise my offer. 289 OHC never got back to OTC with his own valuation of the shares.  In fact, in the years which followed, OTC made several offers to buy OHC’s shares. On 29 December 2015, for example, OTC wrote to the OA offering to buy OHC’s shares and proposing that the shares be valued by RSM Chio Lim as the independent valuer296Foot Note 296×22AB 12419..  Neither the OA nor OHC responded to OTC. 290 On 19 August 2016, OTC wrote again to the OA with another offer to purchase OHC’s shares.  OTC proposed that “an independent valuator [sic] (e.g. RSM Corporate Advisory Pte Ltd or Ng, Lee & Associates)” be appointed at his expense, to determine the market value of the shares, following which he would purchase the shares either at market value or at the price of $230,000 – whichever was the higher.  Again, neither the OA nor OHC responded to OTC. 291 In cross-examination297Foot Note 297×See transcript for 5 September 2019 at p 88 line 25 to p 90 line 8., OHC said he was not willing to sell his shares unless he had the consolidated accounts of the Tong Garden Group to enable him to assess the “true” NTA of the Company.  This was in my view a plainly nonsensical objection, because – as seen at [142] above – the evidence showed that OHC had been informed by the OA’s office on 17 June 2013 that they had the consolidated accounts ready for him – and yet OHC never followed up on this.  OHC also eventually admitted in cross-examination that OTC’s proposal of 19 August 2016 was reasonable – but he sought to cavil at the fact that OTC’s letter had not mentioned “the years of the accounts that they were going to rely on”.  When asked if he had pointed out to the OA the need to clarify “the years of the accounts” to be relied on, he was obliged to concede that he had not.  Indeed, he conceded that he had ignored OTC’s proposalbecause he simply did not want to sell his shares to OTC298Foot Note 298×See transcript for 5 September 2019 at p 88 line 25 to p 90 line 8.. 292 OBC too made offers to purchase OHC’s shares, even after proceedings were commenced.  On 2 July 2018, OBC offered to purchase the shares either for $500,000 or at a price based on an independent professional valuation.  OBC offered to let OHC appoint the accounting firm which would carry out the valuation, with the caveat that he (OBC) would not bear any of the cost of the valuation should the valuation amount be less than $500,000, whereas both of them would bear the costs equally if the valuation exceeded $500,000.  OBC’s offer was not taken up by OHC.  In closing submissions, OHC put forward a few reasons for why he thought OBC’s offer was not reasonable.  I found OHC’s reasons to be contrived and implausible.  For example, OHC objected to OBC’s suggestion that the shares should be valued as at 31 December 2007: he alleged,inter alia, that this valuation date would not take into account the possible profits made by OTC’s companies in the years since, which profits he claimed should be attributable to the Company299Foot Note 299×[505] of the Plaintiff’s Closing Submissions..  I did not think OHC’s objection had any merit.  Based on OHC’s own case, the allegedly oppressive acts would have started in 2008: prior to 2008, OTC was still in Thailand running the Thai companies; and it will be recalled that I found he became ade factodirector of the Company only from 14 January 2008 onwards.  Since the allegedly oppressive conduct by OTC and OBC would only have started from 2008 onwards, it was reasonable for OBC to suggest that the valuation date be taken as the last day of 2007. 293 I have mentioned these examples of offers by OTC and OBC to purchase OHC’s shares, firstly, because the fact that there were these offers – and that OHC either ignored them or rejected them on flimsy grounds – militated against his assertion that he wanted to have his shares bought out.  I should add that despite claiming he wanted to be bought out and despite decrying OTC’s and OBC’s various offers as being unreasonable, OHC himself has been remarkably coy about putting forward his own proposals as to the appropriate purchase price for his shares and/or the appropriate valuation date. 294 Beyond the reasons he purported to offer for his objections, however, what OHC’s objections betrayed was his real preoccupation: namely, his desire to participate in the profits made by OTC’s companies.  This brings me to my second point about the relief sought by OHC in this s 216 action.  Despite claiming that he wanted to be bought out, OHC found it necessary to include – alongside the prayer for a buyout of his shares – analternative prayer that OTC be ordered to procure“the transfer of the requisite number of shares (to be determined) in Tong Garden Co., Ltd, N.O.I Food Industry Co., Ltd, Tong Garden Food (Singapore) Pte Ltd and Tong Garden Food (Malaysia) Sdn Bhd to [OHC] at the price of S$1 within 14 days”300Foot Note 300×[93(e)] of the Statement of Claim (Amendment No. 2).[emphasis added]. 295 In other words, OHC wanted to become a shareholder in the companies owned or controlled by OTC – the very man he had denounced as a fraudster given to riding roughshod over minority shareholders’ interests.  This was not a case of a plaintiff who “seeks an essential remedy directed at bringing to an end the oppressive conduct which it has been subjected to as a shareholder” (seeHo Yew Kong([99]supra)at [119]). 296 From the above, I inferred that OHC’s concern was never really about remedying any personal wrongs he had suffered as minority shareholder.  Rather, it would seem what he was really interested in was finding a way to profit from the good performance of OTC’s companies over the last several years. 297 To sum up, therefore: applying the analytical framework set out by the CA inHo Yew Kongand having regard to the reasoning in [268]–[296] herein, I was satisfied that OHC was unable to demonstrate any distinct personal wrong which would justify his resort to s 216.  In the circumstances, his pursuit of an oppression claim was an abuse of process. 298 That the desire to participate in the improved fortunes of OTC’s companies was OHC’s real agenda would also explain why, despite having been aware for nearly a decade of the facts he cited in support of his oppression action, he made no move to file the action any earlier.",
        "Whether OHC was barred in any event by the doctrine of laches from claiming the reliefs sought and/or time-barred under the Limitation Act": "299 This leads me to the fourth and last of the contested issues: namely, whether OHC was barred in any event by the doctrine of laches from claiming the reliefs sought and/or time-barred under the Limitation Act. 300 OHC’s case was that he had found out only around December 2015 about the acts he alleged to be oppressive of his rights as minority shareholder.  As alluded to earlier, I found this to be untrue. 301 In respect of the Tong Garden trademarks, OHC claimed in cross-examination301Foot Note 301×See transcript for 6 September 2019 at p 80 line 4 to p 81 line 19.that in 2007, his sister Ong Siew Hua had told him OBC wanted him to return to manage the Company, and that he had asked her to convey to OBC several conditions for his return – including a condition that the trademarks “be returned to Tong Garden”.  This showed that as at 2007, OHC was well aware that the Tong Garden trademarks were still being held by OBC or his company, and had not yet been returned to the Tong Garden Group. 302 In respect of the 2008 restructuring, the e-mail exchange between OHC and OTC showed that by 4 February 2010302Foot Note 302×8AB 4115., OHC was aware that OTC had entered into an agreement with OBC, and that OTC had taken over the Tong Garden Group’s Singapore and Malaysia business. 303 In respect of the sale of the Thai entities to OTC, the documentary evidence available showed that a notice of EGM was served on the OA (OHC’s trustee in bankruptcy) on 21 September 2009, giving notice of the EGM on 8 October 2009 and of the resolution being tabled to seek approval of the Variation Agreement that would enable completion of the said sale303Foot Note 303×8AB 4046-4048..  OHC hasnotalleged that the OA failed to receive the notice of EGM.  OHC did not attend the EGM, nor did anyone from the OA’s office attend. 304 In short, therefore, the objective evidence available – as well as OHC’s own testimony – showed that he was aware of all the matters complained of in his oppression suit by early 2010 at the very latest; and yet there was no evidence of any attempt by him to bring a suit against OTC and OBC.  There was certainly no evidence that he had sought leave from the OA to file an oppression action at any time up to his discharge from bankruptcy in September 2016. 305 In my view, this delay by OHC in bringing his oppression action was yet another piece of evidence which cast doubt on his true motivation – and hisbona fides– in eventually filing the present suit in end-2017.  I should make it clear, however, that I did not eventually make a finding that the defence of laches had been made out.  This was because although the closing submissions filed on behalf of OTC dealt in detail with the evidence of OHC’s delay in filing the suit and the prejudice caused to OTC as a result, the submissions did not deal with the legal principles applicable.  In brief, it has been held in cases such asDynasty Line Ltd (in liquidation) v Sia Sukamto &another[2013] 4 SLR 253 (“Dynasty Line”) that laches is an equitable defence which operates only to bar the grant of equitable relief such as an injunction, but it does not extinguish a claimant’s legal right, nor bar its enforcement by (for example) an award of common law damages: [32]–[33] ofDynasty Line.  The closing submissions filed on behalf of OTC did not explain how the defence of laches would operate so as to bar OHC from seeking the statutory reliefs provided for in s 216. 306 As for the time-bar defence, neither OTC nor OBC took this up in closing submissions.  I did not make a finding that the defence of time bar had been made out because as counsel for OHC rightly pointed out, there is clear authority to the effect that s 6 of the Limitation Act does not apply to oppression actions under s 216 of the Companies Act, such actions being “statutory in nature and not founded on a contract, or on tort, or on any other limb under s 6 of the Limitation Act”:Tan Yong San v Neo Kok Engand others[2011] SGHC 30 at [95]; alsoLim Seng Wahand another v Han Meng Siew and others[2016] SGHC 177 at [163]. 307 In any event, given the findings I made in relation to the acts of oppression alleged by OHC, OTC’s and OBC’s failure to prevail on the pleaded defences of laches and time bar did not have any impact on my decision to dismiss OHC’s oppression claim.",
        "A brief note on OSA’s role in these proceedings": "308 In respect of OSA, OHC had always made it clear that she was added purely as a nominal defendant and that he made no claims against her. OTC and OBC too had taken the position quite early on that she was a nominal defendant.  Prior to the start of the trial, OSA did not take an active part in the proceedings, and in fact discharged her counsel midway.  Surprisingly, at a pre-trial conference before me on 29 July 2019 (only a few weeks before the start of the trial), OSA appeared for the first time in person and sought leave to file an AEIC.  She also filed closing submissions. 309 With respect, I found the arguments advanced by OSA to be largely irrelevant to the issues in contention.  Many of the arguments she put forward had nothing to do with OHC’s oppression claim.  For example, she devoted a fair amount of time to questioning the extent of OTC’s and OBC’s shareholding in the Company304Foot Note 304×See e.g. [33]-[42] of the 3rd Defendant’s Closing Submissions.even though this was not even an issue raised by OHC as part of his case.  While I did consider her evidence where it touched on matters relevant to OHC’s oppression claim, I did so with circumspection as I found that on more than one occasion, she presented a one-sided perspective which left out inconvenient facts.  Thus for example, she attacked OTC and OBC for allegedly being the ones who had failed to consolidate the accounts of the Tong Garden Group305Foot Note 305×See e.g. [160]-[164] of the 3rd Defendant’s Closing Submissions.– despite the fact that she herself had been a director for nearly a decade up till 2008 and had been deeply involved in the Tong Garden Group’s financial and accounting affairs during that time.  Regrettably, it appeared that OSA had a deep-seated sense of resentment against both OTC and OBC, and saw the trial as an opportunity to ventilate her grievance.",
        "Costs": "310 In dismissing the present action, I awarded OTC and OBC the costs of the action.  As parties were unable to agree on costs, they requested that I fix the amount of costs and filed written submissions for that purpose. 311 OHC argued that OTC and OBC should only be allowed one set of costs.  Having regard to the guidelines articulated by V K Rajah JA inNg Eng Gheeand others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd, intervener) and another appeal[2009] 4 SLR(R) 155, I was satisfied that OTC and OBC should each be awarded a separate set of costs.Inter alia, I noted in particular that the manner in which OHC’s case was pleaded and pursued in the course of these proceedings meant that OTC and OBC were not only entitled to adopt differing positions on key issues, they actually were obliged – by virtue of their differing interests and different involvement in the Company at different stages – to take differing positions on key issues (such as the sale of the trademarks to Villawood and the 2008 restructuring).  I also observed that throughout the trial, counsel for OTC and OBC did their best not to duplicate each other’s cross-examination and submissions.  There was some degree of overlap in the cases presented on behalf of OTC and OBC respectively, but this was mostly unavoidable.  Having had the benefit of examining first-hand the evidence adduced by each of them and the submissions made by each counsel, I would say the degree of overlap was modest; and I accounted for it with the appropriate calibration in the quantum of costs awarded to each of them. 312 OTC and OBC submitted that OHC should be ordered to pay costs on an indemnity basis. Having considered all material circumstances, including the sadly broken state of the relationships which has subsisted for many years between the siblings of this family, I declined to make such an order.  I ordered instead that OTC and OBC should each get his costs on a standard basis. 313 In so far as disbursements were concerned, these were for the most part not controversial. However, I note that both OTC and OBC claimed the costs of the real-time transcription services they engaged for the duration of the trial.  I did not think it was reasonable for the OHC to have to bear the costs of the real-time transcription, so I did not allow this item of disbursement in respect of both OTC and OBC. 314 In respect of OTC, I fixed costs in the sum of $230,000. In addition, I allowed OTC the disbursements set out in his Costs Schedule dated 29 January 2020, save for the amount of $20,807.92 attributable to the costs of the transcription services.  In respect of OBC, I fixed costs in the sum of $190,000.  In addition, OBC was allowed the disbursements set out in his Costs Schedule dated 29 January 2020, save for the amount of $20,807.92 attributable to the costs of the transcription services.  The costs awarded to OTC were higher than the costs awarded to OBC because OTC called two expert witnesses whereas OBC did not call any experts. While I appreciated that OBC’s counsel would also have had to address the evidence of the expert witnesses, I was of the view that additional costs were due to OTC whose counsel would have had to expend additional time and effort instructing the expert witnesses. 315 In respect of OSA, as mentioned earlier, OHC, OTC and OBC all took the position in these proceedings that she was a nominal defendant. While OSA herself chose belatedly to file an AEIC and took it upon herself to cross-examine the other parties and their witnesses, she did not put in any submissions regarding costs, despite having been invited to do so. As none of the other parties sought any costs from her, I did not make any order on costs in respect of OSA. Mavis Chionh Sze ChyiJudicial Commissioner Pradeep Pillai, Simren Kaur Sandhu and Caleb Tan (PRP Law LLC) for the plaintiff; Tan Gim Hai Adrian, Ong Pei Ching, Hari Veluri, Yeoh Jean Ann, David Aw and Lim Jian Wei Joel (TSMP Law Corporation) for the first defendant; Andy Chiok Beng Piow and Margaret Lee Hui Zhen (JHT Law Corporation) for the second defendant; The third defendant in person.",
        "": ""
    }
}