{
    "case_title": "Tractors Singapore Ltd vPacific Ocean Engineering & Trading Pte Ltd",
    "ncitation": "[2020] SGHC 60",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 The defendant ordered shipbuilding equipment from the plaintiff under several contracts. The terms of these contracts permitted the defendant to advise the plaintiff on a delivery date and/or a port of destination for the equipment ordered. Subsequently, the equipment which had been contracted for was never delivered. The plaintiff alleges that its failure to deliver was caused by the defendant’s repudiatory breaches of implied terms of the contracts in dispute. The alleged implied terms include (a) a term requiring the defendant to advise the plaintiff on a delivery date within a reasonable time; and (b) a term requiring the defendant to nominate a port of destination within a reasonable time, that was sufficiently early to allow the plaintiff to effect delivery by the agreed delivery date. The defendant counterclaims that the plaintiff had wrongly terminated the contracts in question. 2The key questions in this case, therefore, are whether the alleged implied terms exist, whether the defendant was in breach of these terms and whether the defendant’s breach of these implied terms entitled the plaintiff to terminate the contracts. Having considered the evidence and the submissions before me, I find that the plaintiff succeeds in its claim, and I dismiss the defendant’s counterclaim in its entirety.I set out the reasons for my decision below.",
        "Facts": "",
        "The parties": "3 The plaintiff is a Singapore-incorporated company. Its principal business is to distribute and provide services in relation to “Caterpillar”-brand machines, engines, propulsion systems and lift trucks.1Foot Note 1×Statement of Claim (Amendment No. 1) (“SOC (1)”), p 1, paras 1-2 4 The defendant is a Singapore-incorporated company engaged in the business of building and selling ships.2Foot Note 2×Quah Peng Wah’s Affidavit of Evidence-in-Chief (“AEIC”) dated 3 September 2019 (“Quah’s AEIC”) at p 2, para 3As part of its business strategy, the defendant would sometimes build ships without a ready buyer or charterer for them.3Foot Note 3×Notes of Evidence (1 November 2019) at p 61, lines 3-19This allowed the defendant to enjoy a competitive advantage by being able to offer its ships to buyers or charterers within a shorter period of time.",
        "Background to the dispute": "5 Prior to the commencement of this suit, the defendant had been the plaintiff’s customer for sixteen years. During this period, the defendant only purchased “off-the-shelf” equipment,iestandard production models, from the plaintiff.4Foot Note 4×Quah’s AEIC at p 3, para 6The procedure followed in respect of each these orders was usually as follows: (a) Mr Gary Koh Teck Seng (“Koh”), a sales manager employed by the plaintiff, would prepare the plaintiff’s quotation for the equipment ordered on a standard template.5Foot Note 5×Notes of Evidence (30 October 2019) at p 32, lines 10-19This quotation would set out the approximate period during which the plaintiff expected the defendant to take delivery, as well as the plaintiff’s conditions of sale. (b) Koh would then present the plaintiff’s quotation to Mr Quah Peng Wah (“Quah Peng Wah”), the defendant’s managing director.6Foot Note 6×Notes of Evidence (30 October 2019) at p 32, line 15-17 (c) Quah Peng Wah would sign the plaintiff’s quotation.7Foot Note 7×Notes of Evidence (30 October 2019) at p 37, lines 10-16 (d) The defendant would then issue a Purchase Order (“PO”) in respect of the said quotation.8Foot Note 8×Notes of Evidence (30 October 2019) at p 51, line 25-28The PO typically provided that the delivery date was “TBA”,ieto be advised by the defendant.9Foot Note 9×Quah’s AEIC at p 3, para 6 6 The defendant’s evidence is that it regarded the plaintiff’s quotations as contracts10Foot Note 10×Notes of Evidence (1 November 2019) at p 51, lines 21-28which it would confirm in writing through the issuance of POs.11Foot Note 11×Quah’s AEIC at p 3, para 6In accordance with this method of contracting, the plaintiff and the defendant entered into the ten contracts which form the subject-matter of this suit.12Foot Note 12×Plaintiff’s Closing Submissions (“PCS”) at pp 13-16The key terms of these contracts are as follows: S/NHull Number/PO NumberPO DateDescription of EquipmentPriceDelivery Date/Port (as stated in PO)1Hull 1610/PO 99683 January 20141 shipset of 3516C Main Propulsion Engine, C18 Main Generator Set, Azimuth Thruster CP Equipment, Xeropoint Hybrid Propulsion System, and Central Monitoring SystemS$5,300,000“TBA by POET” / “CIF China Major Port”13Foot Note 13×Agreed Bundle Vol 1 (“AB1”) at p 1072Hull 1611/PO 99693 January 20141 shipset of 3516C Main Propulsion Engine, C18 Main Generator Set, Azimuth Thruster CP Equipment, Xeropoint Hybrid Propulsion System, and Central Monitoring SystemS$5,300,000“TBA by POET” / “CIF China Major Port”14Foot Note 14×AB1 at p 1093Hull 1630/PO 99925 August 20141 shipset of 4 C18 Main Generator Sets and 1 shipset of 1 C9 Emergency Generator SetS$805,000“March 2015 (Any change of date TBA by POET)” / “CIF China Major Port Only”15Foot Note 15×Agreed Bundle Vol 3 (“AB3”) at p 15074Hull 1631/PO 106005 August 20141 shipset of 4 C18 Main Generator Sets and 1 shipset of 1 C9 Emergency Generator SetS$805,000“April 2015 (Any change of date TBA by POET)” / “CIF China Major Port Only”16Foot Note 16×AB3 at p 15105PO 106015 August 20141 shipset of 2 units of Caterpillar C18 Generator SetsS$347,000“TBA” / “a shipyard in China”17Foot Note 17×AB3 at p 15116Hull 1539/PO 112893 July 20151 shipset of 2 units of Caterpillar 3512C Main Propulsion EnginesUS$860,000“Jan 2016 (Any change of date TBA by POET)” / “CIF China Port”18Foot Note 18×Agreed Bundle Vol 5 (“AB5”) at p 29017Hull 1540/PO 112903 July 20151 shipset of 2 units of Caterpillar 3512C Main Propulsion EnginesUS$860,000“Feb 2016 (Any change of date TBA by POET)” / “CIF China Port”19Foot Note 19×AB5 at p 29038Hull 1540/PO 1165125 July 20161 shipset (2 units) of Caterpillar C7.1 Packaged Generator SetUS$136,000“Jan / Feb 2017 (TBA)” / “CIF China Port”20Foot Note 20×Agreed Bundle Vol 8 (“AB8”) at p 46989Hull 1517/PO 887426 November 20121 shipset (4 units) of C32 Main Generator Set EngineS$1,008,000“September 2013 (Any change of date TBA by POET)” / “CIF China”21Foot Note 21×AB1 at p 5010Hull 1518/PO 887526 November 20121 shipset (4 units) of C32 Main Generator Set EngineS$1,008,000“October 2013” (Any change of date TBA by POET)” / “CIF China”22Foot Note 22×AB1 at p 52 7 In order to fulfil its obligations under the contracts evidenced by POs 9968 and 9969, the plaintiff contracted with a sub-vendor, Aspin Kemp & Associates (“AKA”), to supply it with two battery-powered Xeropoint Hybrid Propulsion Systems (“the Hybrid Propulsion Systems”).23Foot Note 23×Ng Mon Foo’s AEIC dated 2 September 2019 (“Ng’s AEIC”) at p 77 8 Based on the terms of all ten contracts, the defendant was required to make a 10% down-payment upon the confirmation of each order and was only obliged to pay the remaining 90% of the contract price upon delivery of the equipment ordered. It is undisputed that the defendant paid the 10% down-payment for each of the ten contracts. However, due to events which subsequently transpired, the equipment ordered was never delivered to the defendant.",
        "The parties’ cases": "",
        "The plaintiff’s claim": "The plaintiff’s case 9 The plaintiff’s case is simple. In respect of the contracts evidenced by POs 9968 and 9969, the plaintiff alleges that the parties agreed, during a meeting which took place on 9 April 2016, that delivery of the equipment ordered under these contracts would take place in May 2017 and July 2017 respectively.24Foot Note 24×PCS at p 24, para 37; SOC (1) at p 3, para 10; SOC (1) at p 6, para 21In respect of the contracts evidenced by POs 9992, 10600, 11289, 11290 and 11651, the plaintiff submits that the parties had agreed during a meeting which took place on or about 10 December 2015 that delivery of the equipment ordered under these contracts would take place by end 2016/January 2017.25Foot Note 25×PCS at p 30, para 50; SOC (1) at p 9, para 31; SOC (1) at p 11, para 42; SOC (1) at p 17, para 65; SOC (1) at p 19, para 76; SOC (1) at p 21, para 81 10 The plaintiff further contends that the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290 and 11651 should each be subject to an implied term that the defendant would nominate a port of destination within a reasonable time, which had to be sufficiently early to enable the plaintiff to effect delivery of the equipment by the agreed delivery date.26Foot Note 26×PCS at p 18, para 22; SOC (1) at p 3, para 8; SOC (1) at p 6, para 19; SOC (1) at p 8, para 29; SOC (1) at p 11, para 40; SOC (1) at p 16, para 63; SOC (1) at p 19, para 74; SOC (1) at p 21, para 79By failing to do so, the defendant was in repudiatory breach of these seven contracts. 11 The plaintiff acknowledges that the parties did not mutually agree on a delivery date for the contract evidenced by PO 10601. However, it submits that this contract should be read subject to an implied term that the defendant would advise on a delivery date within a reasonable time from the date of contract.27Foot Note 27×PCS at p 22, para 32; SOC (1) at p 13, para 50As the defendant failed to select a delivery date and/or inform the plaintiff of the same, the defendant was also in repudiatory breach of the contract evidenced by PO 10601. 12 On 13 October 2017, the plaintiff purported to accept the defendant’s repudiatory breaches and terminated the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651.28Foot Note 28×AB8 at pp 4877-4895The plaintiff now claims the remaining 90% of the price of these eight contracts, less the amounts which it has recovered in mitigation. The defendant’s case 13 The defendant argues that the two contracts evidenced by POs 9968 and 9969 were mutually terminated during a meeting between the parties on 9 April 2016.29Foot Note 29×Defence and Counterclaim Amendment No.3 (“Defence (3)”) at p 3, para 6 14 The defendant avers that, even if these two contracts were not mutually terminated, its conduct did not amount to a repudiatory breach because of the following facts: (a) It had in fact nominated a port of destination.30Foot Note 30×Defendant’s Closing Submissions (“DCS”) at p 4, para 8 (b) It was theplaintiffwho had first evinced an intention to “hold back” performance on both contracts.31Foot Note 31×DCS at p 22, para 57 (c) Further or alternatively, the defendant was permitted, by way of an implied term or a “course of dealing”, to postpone delivery for both contracts in accordance with its ship construction schedule. (d) In any event, the plaintiff was in breach of these two contracts because (i) it had failed to provide the defendant with American Bureau of Shipping (“ABS”)-approved drawings of the Hybrid Propulsion Systems; and/or (ii) it had failed to design, manufacture or procure the Hybrid Propulsion Systems in compliance with the contractual specifications.32Foot Note 32×Defence (3) at p 4, para 13(a)Accordingly, the defendant was not obliged to take delivery of the equipment ordered under these two contracts. 15 The defendant also posits that the plaintiff, by failing to insist on timely delivery of the equipment ordered, had either waived its right to, or was estopped from insisting, on strict adherence to the agreed delivery dates for the two contracts evidenced by POs 9968 and 9969. As such, it could not discharge or terminate the two contracts without giving the defendant reasonable prior notice of the same.33Foot Note 33×Defence (3) at p 3, para 11 16 In respect of the contract evidenced by PO 10601, the defendant contends that there was no express or implied delivery date because the equipment ordered had been expressly purchased as “stock”. Instead, the plaintiff was obliged to deliver the equipment to the defendant as and when the defendant required delivery.34Foot Note 34×Defence (3) at p 8, para 25 17 In relation to the contracts evidenced by POs 9992, 10600, 11289, 11290 and 11651, the defendant makes the following submissions. (a) The delivery dates for the equipment purchased under these contracts were “TBA” or “to be advised” by the defendant, which meant that the defendant was free to postpone the delivery dates from time to time.35Foot Note 35×Defence (3) at p 6, para 18; Defence (3) at p 9, para 31; Defence (3) at p 11, para 38. (b) Alternatively, the defendant was permitted, by way of an implied term or a “course of dealing”, to postpone delivery in accordance with its ship construction schedule.36Foot Note 36×Defence (3) at p 7, para 20; Defence (3) at p 10, para 33; Defence (3) at p 11, para 40. (c) By failing to insist on timely delivery of the equipment ordered, the plaintiff had waived its right to, or was estopped from, insisting on strict adherence to the agreed delivery dates. As such, it could not discharge or terminate the contracts without giving the defendant reasonable prior notice of the same.37Foot Note 37×Defence (3) at p 7, para 21; Defence (3) at p 10, para 34; Defence (3) at p 12, para 41. 18 Moreover, the defendant submits that even if it is found to be in repudiatory breach of the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651, the plaintiff had failed to reasonably mitigate its losses and therefore should not be entitled to its full claim.38Foot Note 38×Defence (3) at p 6, para 15; Defence (3) at p 8, para 23; Defence (3) at p 9, para 29; Defence (3) at p 10, para 36; Defence (3) at p 12, para 43.",
        "The defendant’s counterclaim": "The defendant’s case 19 The defendant’s counterclaim rests on two key contentions. Firstly, the defendant avers that by discharging and/or terminating the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651 on 13 October 2017, the plaintiff was itself in repudiatory breach and is thus liable to refund the down-payments made by the defendant under these contracts.39Foot Note 39×Defence (3) at p 14, para 52 20 Secondly, the defendant also claims that the plaintiff is in repudiatory breach of two further contracts evidenced by POs 8874 and 8875. According to the defendant, the parties mutually agreed that delivery of (and payment for) the C32 generators ordered under these contracts could be deferred under certain circumstances.40Foot Note 40×Defence (3) at p 13, para 47However, on 7 August 2017, the plaintiff alleged that the defendant was in repudiatory breach of the contracts evidenced by POs 8874 and 8875 and unilaterally terminated them.41Foot Note 41×AB8 at pp 4867-4869The defendant submits that the plaintiff, in so doing, was itself in repudiatory breach and is thus liable to refund the down-payments made by the defendant under these contracts. The plaintiff’s case 21 The plaintiff’s defence to the counterclaim mirrors its claim against the defendant. In essence, the plaintiff alleges that it was an implied term of the contracts evidenced by POs 8874 and 8875 that the defendant had to nominate a port of destination within a reasonable time, which was sufficiently early to allow the plaintiff to effect delivery of the equipment ordered by September 2013 (for the contract evidenced by PO 8874) and October 2013 (for the contract evidenced by PO 8875), or such other time of delivery as was agreed between the plaintiff and the defendant. By failing to do so, the defendant had committed a repudiatory breach and this entitled the plaintiff to discharge the contracts evidenced by POs 8874 and 8875.42Foot Note 42×Reply and Defence to Counterclaim Amendment No. 2 at p 14, paras 40-42",
        "Issues to be determined": "22 Therefore, the ten contracts in this case can be divided into two broad groups. The first group – comprising seven contracts brought into issue by the plaintiff’s claim (POs 9968, 9969, 9992, 10600, 11289, 11290, 11651) and two contracts brought into issue by the defendant’s counterclaim (POs 8874 and 8875) – consists of contracts for which there are, allegedly, mutually-agreed delivery dates. The second group consists only of the contract evidenced by PO 10601, for which it is undisputed that there isnomutually agreed delivery date. In my judgment, the key issues to be determined in relation to the first group of contracts – contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875 – are as follows: (a) Were the contracts subject to an implied term that the defendant would nominate a port of destination within a reasonable time, which was sufficiently early to enable the plaintiff to effect delivery of the equipment by the agreed delivery dates? (b) If the answer to the above issue is “yes”, was the defendant in breach of the said term? (c) If the answer to the above issue is “yes”, would a breach of the said term have entitled the plaintiff to terminate the contract? (d) By failing to insist on timely delivery of the equipment ordered, did the plaintiff waive its right to, or was it estopped from insisting on strict adherence to the agreed delivery dates, such that it could not discharge or terminate the contracts without giving the defendant reasonable prior notice of the same? 23 The issues to be determined in relation to the second group – the contract evidenced by PO 10601 – are as follows. (a) Was the contract subject to an implied term that the defendant would advise the plaintiff on a delivery date within a reasonable time from the date of contract? (b) If the answer to the above issue is “yes”, was the defendant in breach of the said term? (c) If the answer to the above issue is “yes”, would a breach of the said term have entitled the plaintiff to terminate the contract? 24 Finally, if the plaintiff succeeds in establishing the defendant’s liability, the issue of whether it had reasonably mitigated its losses in relation to the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651 must be determined. 25 I now deal with each of these issues in turn.",
        "My decision": "",
        "Issues concerning the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875": "Whether the contracts were subject to an implied term to nominate a port of destination within a reasonable time 26 I first address the plaintiff’s contention that the contracts were subject to an implied term that the defendant would nominate a port of destination within a reasonable time. According to the plaintiff, a “reasonable time” referred to a point in time which was sufficiently early to ensure that the plaintiff could deliver the ordered equipment by the agreed delivery dates. This proposition, though uncontested by the defendant, is critical to the plaintiff’s claim. 27 The law concerning the implication of terms in fact was settled by the Court of Appeal inSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp”) at [101]: (a) The first step is to ascertain how the gap in the contract arises. Implication will be considered only if the court discerns that the gap arose because the parties did not contemplate the gap. (b) At the second step, the court considers whether it is necessary in the business or commercial sense to imply a term in order to give the contract efficacy. (c) Finally, the court considers the specific term to be implied. This must be one which the parties, having regard to the need for business efficacy, would have responded “Oh, of course!” had the proposed term been put to them at time of the contract. If it is not possible to find such a clear response, then, the gap persists and the consequences of that gap ensue. 28 The three-stage test outlined above was more recently reaffirmed by the Court of Appeal inCAA Technologies Pte Ltd vNewcon Builders Pte Ltd[2017] 2 SLR 940 at [66]. 29 In the present case, the plaintiff’s primary argument is that where a contract for the sale of goods gives the buyer the option of nominating the port of destination, it is necessary, for the efficacy of the contract, to imply a term that the buyer is obliged to nominate a port of destination within a reasonable timebeforethe agreed delivery date. Otherwise, the seller would be unfairly prevented, by the buyer’s actions, from effecting timely delivery of the goods contracted for.43Foot Note 43×PCS at p 33, para 31 30 The plaintiff relies on two English cases in support of this argument. In the first case,Tsakiroglou& Co Ltd v Transgrains, SA[1958] 1 Lloyd’s Rep 562 (“Tsakiroglou”), the sellers contracted to sell 500 tons of groundnuts to the buyers. Shipment was to take place in November 1956, on a “c.i.f. basis freight rate Hamburg/Rotterdam”. Both the sellers and the buyers understood this to mean that the buyers had the option of choosing Hamburg or Rotterdam as the port of destination. However, the buyers only informed the sellers of its nomination on 5 November 1956, whereupon the sellers cancelled the contract. When the buyers subsequently made a claim for non-delivery, the sellers submitted that the contract was subject to an implied condition that the buyers had to nominate the port to which the goods were to be shipped, and that this nomination had to be made known to the seller a reasonable timebeforethe first day of the shipment period. McNair J agreed with the sellers’ submissions and held (at 572): … [I]t seems to me to be abundantly plain that this contract simply will not work unless the sellers are informed by the buyers as to whether or not, and how, their option is going to be exercised … It is plain that, if the nomination … is not given to [the buyers] by a day or two before Nov. 1, they cannot perform, and they are really being deprived of part of their rights. 31 In the second case,ManselOil Ltd and another v Troon Storage Tankers SA (The “Ailsa Craig”)[2008] EWHC 1269 (Comm) (“ManselOil (HC)”), the defendant owners contracted to charter their vessel to the claimant charterers, and the agreed delivery date was 15 November 2007. When the owners failed to deliver the vessel by the agreed delivery date, the charterers brought a claim against them. One of the issues was whether the charterers were entitled to cancel the charterparty by reason of the owner’s failure to nominate a delivery port. Clarke J held (at [49]) that: … [O]wners and charterers would ordinarily understand that charterers’ option to select the delivery port was an option that they wereobligedto exercise. The expectation of the parties is that the chartererwilldeclare where the vessel is to be delivered, not that hemaydo so. Further, the nomination is necessary in order to complete the definition of the parties’ contractual obligations. [emphasis in original] 32 On the question ofwhensuch an obligation arose, the learned judge held (at [56]) that: … [I]t was for charterers to make their nomination within a reasonable time which would be such time as was (a) not so late as would mean that, because of the lateness of the nomination, the vessel could not make her cancelling; and (b) early enough to ensure that the vessel suffered no delay resulting from the absence of nomination. 33 These propositions were subsequently upheld on appeal (seeManselOil Limited, Vitol S.A. v Troon Storage Tankers SA[2009] EWCA Civ 425). 34 Having considered the authorities above, I agree with the plaintiff’s submission and find that the contracts evidenced by POs 9992, 10600, 11289, 11290, 11651, 8874 and 8875 were subject to an implied term that the defendant would nominate a port of destination within a reasonable time,ie,a point of time which was sufficiently early to enable the plaintiff to deliver the goods ordered by September 2013 (for PO 8874), October 2013 (for PO 8875) and January 2017 (for POs 9992, 10600, 11289, 11290 and 11651). AlthoughManselOil (HC)did not frame the charterer’s “obligation to nominate” as an implied term of the contract, I am of the view that the case is nevertheless helpful for the general proposition that a party to a contract who has been offered the option of nominating the port of destination must do so within a reasonable time in order to ensure the business efficacy of that contract. I also find that the plaintiff’s formulation of the term to be implied satisfies the officious bystander test (viz.,the third requirement of theSembcorptest outlined at [27] above). 35 The position in relation to the contracts evidenced by POs 9968 and 9969 is slightly more complex. As a matter of logic, a term of this nature can only be implied if the parties havein factagreed on a date of delivery. This is because the point of time at which the obligation to nominate arises must be defined by reference to an agreed delivery date. However, the parties have taken diametrically opposing positions regarding the existence of agreed delivery dates under POs 9968 and 9969. While the plaintiff alleges that the parties were able to agree on the delivery dates for both contracts during a meeting on 9 April 2016, the defendant argues that these dates were never agreed upon. Rather, its position is that both contracts were mutually terminated on that date, and that any subsequent allusions to delivery dates for Hulls 1610 and 1611 were made only in reference to aproposedrevised contract which the parties never concluded. 36 I find, on a balance of probabilities, that the contracts evidenced by POs 9968 and 9969 werenotmutually terminated on 9 April 2016. Rather, the contemporaneous evidence strongly suggests that the parties agreed on “May 2017” and “July 2017” as the delivery dates for the contracts evidenced by POs 9968 and 9969 respectively. 37 First, the defendant relies on an e-mail dated 6 April 2016 sent by one of its employees, Mr Gary Quah (“Gary Quah”), to Ho Kah Huat (“Ho”), the plaintiff’s General Manager of Power Systems. The e-mail states that “[Quah Peng Wah] had given an instruction to terminate [POs 9968 and 9969] with [the plaintiff]”.44Foot Note 44×Agreed Bundle Vol 7 (“AB7”) at p 4515However, I note that Ho replied to the e-mail: “We are considering our position relating to your purported termination and will revert. In the meanwhile, all our rights are reserved”.45Foot Note 45×AB7 at p 4514This meant that the plaintiff was still undecided on terminating the contracts. Therefore, I am unable to see how the 6 April 2016 e-mail supports the defendant’s contention that the contracts were “mutually” terminated on 9 April 2016. 38 Next, the defendant emphasises the fact that the plaintiff (a) did not follow up on the contracts by requesting the defendant to nominate a port of destination;46Foot Note 46×DCS at p 8, para 22and (b) did not update the delivery dates for the two contracts in its monthly project list which it sent to the defendant on various occasions between 13 April 2016 and 13 February 2017.47Foot Note 47×DCS at p 8, para 21I consider these facts to be inconclusive. Moreover, if (as the defendant alleges) the parties had mutually terminated the contracts on 9 April 2016, the terminated contracts should have been removed from the plaintiff’s project list altogether. 39 To demonstrate that a delivery date was indeed agreed upon for POs 9968 and 9969, the plaintiff relies primarily on an e-mail sent by Koh to Quah Peng Wah, and copied to Ho and Chua Ee Lang (the plaintiff’s Project Manager), on 13 April 2016. The relevant portion of the e-mail states:48Foot Note 48×AB7 at p 4513 Dear Raymond, Ref to our meeting on 9th April 2016, Poet brought up the following, 1. Delivery for H1610 will be in May 2017, and subsequence H1611 will be July 2017. 2. POET will like to re-contract the orders. 40 I agree with the plaintiff’s submission49Foot Note 49×PCS at pp 25-27, para 39that it is unlikely that the dates “May 2017” and “July 2017” were raised only in respect of a revised contract or quotation. Otherwise, Koh would not have internally broadcasted his agreement with Quah Peng Wah on these delivery dates to Ho or to Chua Ee Lang. I accept Ho’s explanation during cross-examination that the purpose of re-contracting the orders was not to negotiate the delivery dates, but to “remove the battery and the battery panel, and… to come up with a revised price”.50Foot Note 50×Notes of Evidence (17 October 2019) at p 50, lines 26-28The delivery dates had already been fixed at the meeting on 9 April 2016. 41 Tangentially, the defendant also contends that Ho’s credibility is doubtful because he claimed to have been absent at the meeting on 9 April 2016 even though other witnesses testified that he had been present.51Foot Note 51×DCS at p 31, para 88In my view, even if Hohadattended the meeting on 9 April 2016, his failure to state this fact was more likely due to imperfect recollection rather than an intention to deliberately conceal the truth. I found that, on the whole, Ho was candid and straightforward when giving evidence, and I saw no reason to disregard or accord less weight to the rest of his testimony since it was corroborated by documentary evidence such as the contemporaneous e-mail discussed at [37] above. 42 Having found that the parties did indeed reach an agreement on the delivery dates for the contracts evidenced by POs 9968 and 9969, I hold that both of these contracts were subject to an implied term that the defendant would nominate a port of destination within a reasonable time,iea point of time which was sufficiently early to enable the plaintiff to deliver the goods ordered by May 2017 and July 2017 respectively. Whether the defendant is in breach of the implied term to nominate a port of destination within a reasonable time (1) Contracts evidenced by POs 9968 and 9969 43 There are four subsidiary issues that I must consider in relation to the contracts evidenced by POs 9968 and 9969. In brief, they are as follows. (a) Did the defendant in fact nominate a port of destination for these two contracts? (b) Was it the plaintiff which first evinced an intention to ‘hold back’ performance on these two contracts? (c) Was the plaintiff in breach of these two contracts, thus relieving the defendant of its obligation to take delivery of the equipment ordered under the contracts? (d) Was the defendant was permitted, by way of an implied term or a “course of dealing”, to postpone delivery under the contracts in accordance with its ship construction schedule? (A) Whether a nomination was made 44 I first deal with defendant’s contention that it had nominated a port of destination, namely “Shanghai port”, for the contracts evidenced by POs 9968 and 9969. Notably, this contention was not pleaded by the defendant even though it amended its pleadings several times. 45 While a party is generally bound by its pleaded case, this rule is not absolute. As explained by the Court of Appeal inVNithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 at [38]–[40]: … the general rule is that parties are bound by their pleadings and the court is precluded from deciding on a matter that the parties themselves have decided not to put into issue. … Procedure is not an end in itself, but a means to the end of attaining a fair trial. The age of forms of action is long gone. Hence, a court is not required to adopt an overly formalistic and inflexibly rule-bound approach even in thoseclear casesthat to do so might lead to an unjust result. Nevertheless, it would be improper for a court to adopt the approach that “the ends justify the means” … Even when the desire to ensure the ends of substantive justice pulls in the opposite direction from the need to maintain procedural fairness to the opposite party, “a just outcome requires that neither consideration be made clearly subordinate to the other” … Thus the law permits the departure from the general rule in limited circumstances, where no prejudice is caused to the other party in the trial or where it would be clearly unjust for the court not to do so.… [emphasis in original in italics; emphasis added in bold italics] 46 This is supported by the Court of Appeal’s observations inOMG Holdings Pte Ltd vPos Ad Sdn Bhd[2012] 4 SLR 231 at [18]: … It is trite law that the court may permit an unpleaded point to be raised if no injustice or irreparable prejudice (that cannot be compensated by costs) will be occasioned to the other party. 47 Therefore, it is necessary to ascertain whether allowing the defendant to raise a previously unpleaded point,viz.its contention that it had nominated a port of destination for the contracts evidenced by POs 9968 and 9969, would cause injustice or irreparable prejudice to the plaintiff in this case. 48 I am satisfied that the defendant should be bound by its pleaded case. First, I note that the argument that a nomination had been made was raised rather late in the day. The contention was first brought to the court’s (and the plaintiff’s) attention in Quah Peng Wah’s AEIC (dated 3 September 2019), where it was alleged that the plaintiff “already knew the port of delivery (Shanghai)”.52Foot Note 52×Quah’s AEIC at p 33, para 50aTo support this point, Quah Peng Wah relies on an e-mail sent by him to Ng Mon Foo, the plaintiff’s project engineer, on 10 November 2014 stating “Shanghai port” (“10 November 2014 e-mail”). The 10 November 2014 e-mail was sent in response to Ng Mon Foo’s earlier query, “Can we anticipate goods will have to ship to one of the major Chinese port such as Shanghai, Xiamen and not to small port that without proper facilities to handle heavy equipment?”.53Foot Note 53×Quah’s AEIC at p 33, para 50a and Annex QPW-12However, as this point was not pleaded, the plaintiff’s witnesses – especially Ng Mon Foo – were not able to address it in their AEICs.54Foot Note 54×Notes of Evidence (16 October 2019) at p 46, lines 15-23Ng Mon Foo’s AEIC is dated 2 September 2019,beforeQuah Peng Wah’s AEIC was filed. 49 Further, I am not persuaded that the defendant will face injustice or irreparable prejudice if its submission on this point is disregarded because it was not pleaded. As the plaintiff has correctly pointed out, the 10 November 2014 e-mail was sent a year and a halfbeforethe delivery dates were agreed upon on 9 April 2016 (see [40] above). Moreover, Gary Quah subsequently sent the plaintiff an e-mail dated 6 April 2016 stating:55Foot Note 55×AB7 at p 4515 Dear Kah Huat, Our official delivery instruction of the equipment in our PO to you is clearly stated as “to be advised by POET” (refer docs attached)… … Delivery To: CIF China Major Port (Partial delivery; direct shipment from AKA and BERG factory) Delivery Date: TBA by POET Is there any further official delivery instruction given to you or agreed between the parties after the issuance of our PO to you? This e-mail suggests that the defendant did not regard itself as having nominated a port of delivery at that particular point in time. Otherwise, “CIF China Major Port” would have been updated to “Shanghai Port”. 50 Accordingly, I see no reason to depart from the general rule that parties are bound by their pleaded case. The defendant’s submission on this point therefore fails. (B) Whether the plaintiff ‘held back’ performance on the contracts 51 The defendant’s next argument is that it should be absolved of liability for any alleged breaches of the contracts evidenced by POs 9968 and 9969 because it was the plaintiff which first ‘held back’ performance on these contracts. According to the defendant, the “real reason” for the plaintiff’s failure to deliver under the contracts was that the defendant was unwilling to accede to the plaintiff’s proposed changes to the payment terms.56Foot Note 56×DCS at pp 16-18, paras 41-46; DCS at pp 20-22, paras 53-56 52 I am unable to accept this submission. First, it was not part of the defendant’s pleaded case. Second, and more importantly, the defendant has not explained how the plaintiff’s conduct of ‘holding back’ performance is relevant to the question of the defendant’s own liability. I therefore find that this submission is wholly irrelevant to the issues at hand. (C) Whether the plaintiff was in breach of the contracts 53 I now turn to the third subsidiary issue. The defendant alleges that it was not obliged to nominate a port of destination under the contracts evidenced by POs 9968 and 9969 because the plaintiff had breached the contracts in two material respects: first, by failing to provide the defendant with drawings of the Hybrid Propulsion Systems that were approved by the American Bureau of Shipping (“ABS”); and second, by failing to design, manufacture or procure the equipment ordered in compliance with the contractual specifications. 54 I note, as a preliminary matter, that the defendant’s pleadings did not adequately explicate the connection between a breach of contract on the plaintiff’s part and the defendant’s contractual obligation to nominate a port of destination. At trial, the defendant amended its position. It argued that providing the defendant with ABS-approved drawings of the Hybrid Propulsion Systems was acondition precedentto the defendant’s performance under the contracts evidenced by POs 9968 and 9969.57Foot Note 57×DCS at p 33, para 99It also argued that its obligation to take delivery “did not even arise” because the plaintiff was “‘off spec’ and not in conformity with the Contract Specifications”.58Foot Note 58×DCS at p 39, para 118 55 I first address the issue concerning the ABS-approved drawings. In this respect, the plaintiff’s key contention is that it was never contractually obliged to provide the defendant with ABS-approved drawings. 56 It is undisputed that all of the equipment ordered under POs 9968 and 9969 had to be “class approved” by ABS,iethe equipment supplied had to be designed and built in accordance with and under the supervision of ABS. This is evident from the plaintiff’s quotations themselves. It is also undisputed that obtaining ABS’ approval for the drawings of the Hybrid Propulsion System was a prerequisite to obtaining ABS class approval.59Foot Note 59×PCS at p 64, para 114What is contentious is whether the ABS rules required ABS-approved drawings of the equipment to be provided to theend customer(in this case, the defendant). 57 To bolster its contention, the defendant relies on page 29 of the plaintiff’s quotation for Hulls 1610/1611.60Foot Note 60×DCS at p 36, para 111The relevant portion of the quotation states:61Foot Note 61×AB1 at p 95 Engineer/modify the XeroPoint Hybrid power system to meet the classification and operational requirements of the end client. This item specifically includes the following; 1. Provision of a Functional Design Specification (high level); 2. Provision of power, control, interface and communication one-line drawings; 3. Short circuit and coordination study; 4. Major Component List (mechanical drawings of AKA supplied components); 5. Cable list; and THD calculation 58 I find that the extract quoted above does not support the defendant’s contention. Even if the items listed above had to be ABS-approved before they were provided to the defendant, there is nothing in the quotation which indicates that these items had to be sent to the defendantprior todelivery or as acondition precedentto the defendant’s obligation to take delivery. The fact that the items numbered “1”, “2”, “4” and “5” above werein factsent to the defendant before delivery62Foot Note 62×DCS at p 37, para 111cannot be taken as conclusive. 59 Furthermore, the chain of correspondence between the parties supports the plaintiff’s position that the defendant was only requesting ABS-approved drawings in a last-ditch attempt to delay delivery of the equipment ordered under POs 9968 and 9969. From June 2014 to April 2015, the defendant (a) neglected to provide the plaintiff with the information it required to complete the designs; (b) requested for various design changes which were outside the original scope of the plaintiff’s work; and (c) persistently refused to nominate delivery dates despite the plaintiff’s repeated requests for it to do so.63Foot Note 63×Ng’s AEIC at p 21, para 46 to p 36, para 85The defendant only began to ask for ABS-approved drawings in April 2015,more than a yearafter the parties had entered into the contracts evidenced by POs 9968 and 9969.64Foot Note 64×Ng’s AEIC at p 36, para 86There was no evidence to suggest that the plaintiff had been contractually obliged to provide the defendant with ABS-approved drawings from the outset. 60 The defendant also relies on several e-mails from the plaintiff to AKA (dated between 17 August 2015 and 29 November 2015) which state that delivery for POs 9968 and 9969 would take place onlyafterthe provision of the ABS-approved drawings.65Foot Note 65×DCS at p 35, para 106I find that these e-mails do not assist the defendant’s case for two reasons. 61 Firstly,allof these e-mail communications are post-contractual in nature. As the objective of interpreting a contract is to discern the parties’ intentionsat the time of entering into the contract, there is “not much assistance to be derived from the parties’ subsequent conduct… Indeed, there are dangers in placing too much weight on such evidence because it can, with the benefit of hindsight, be shaped to suit each party’s position” (seeY.E.S. F&B Group Pte Ltd v SoupRestaurant Singapore Pte Ltd (formerly known as Soup Restaurant (Causeway Point) Pte Ltd)[2015] 5 SLR 1187 at [74]). 62 Secondly, the latest of the e-mails relied on by the defendant is dated 29 November 2015. Thus,even ifthe parties had agreed, during this series of e-mail communications, that the delivery dates for POs 9968 and 9969 would take reference from the date on which the ABS-approved drawings were provided to the defendant, any such agreement would have been superseded by the parties’subsequent agreement on 9 April 2016 to amend the delivery dates to May 2017 and July 2017 respectively. 63 Finally, I turn to consider two other peripheral issues which, in my judgment, can be shortly disposed of: (a) First, the defendant asserts that it insisted on the plaintiff producing ABS-approved drawings for the Hybrid Propulsion Systems because it was aware that the plaintiff was contracting with AKA for the first time.66Foot Note 66×DCS at pp 28-29, paras 74-79In my view, the defendant’sreasonsfor requesting ABS-approved drawings from the plaintiff are irrelevant to the issue of whether and when the plaintiff wasobligedto produce these drawings to the defendant. It is therefore unnecessary for me to address this contention. (b) Secondly, the defendant avers that AKA should not have fabricated the DC Switchboards, which were components of the Hybrid Propulsion Systems, before obtaining ABS class approval to do so.67Foot Note 67×DCS at pp 31-33, paras 89-97However, as the defendant itself admits,68Foot Note 68×DCS at p 32, para 92this issue is not critical to the question of whether the plaintiff or defendant is to succeed in its claim. I therefore agree with plaintiff that it is not necessary for me to make a finding on this issue. 64 Having disposed of the issue concerning the ABS-approved drawings, I turn to the defendant’s contention that its obligation to deliver “did not even arise” because the plaintiff was “off-spec”. The defendant’s main complaint in this regard is that the Hybrid Propulsion Systems procured by the plaintiff were incomplete because they lacked batteries.69Foot Note 69×DCS at p 40, para 123 65 It is not disputed that the Hybrid Propulsion Systems which the plaintiff procured from AKA did, in fact, lack batteries. However, based on the evidence before me, I am satisfied that it was thedefendantwho had instructed the plaintiff to remove the batteries from the Hybrid Propulsion Systems.  This is supported by several contemporaneous e-mails from plaintiff’s employees confirming the defendant’s instructions to remove the batteries from the Hybrid Propulsion Systems.70Foot Note 70×PCS at p 71, para 128; AB5 at pp 2970, 2984, and 3157I also note that the defendant did not object to the absence of batteries in the plaintiff’s final drawings of the PO 9968 and 9969 equipment when these drawings were submitted to the defendant for approval in November 2015.71Foot Note 71×PCS at p 67, para 123; Ng’s AEIC at p 41; para 100; AB6 at pp 3384, 3380, and 3410 66 Therefore, I find that the plaintiff was not in breach of any of its obligations under the contracts evidenced by POs 9968 and 9969. (D) Whether the defendant was permitted to postpone delivery in accordance with its ship construction schedule 67 Finally, the defendant alleges that its actions did not amount to a breach because it was permitted, by way of an implied term or a “course of dealing”, to postpone delivery in accordance with its ship construction schedule. 68 In support of this contention, the defendant highlights that the plaintiff was “accommodating” towards the defendant’s delays in taking delivery, and that there was an “unwritten agreement, scheme, partnership, and win/win arrangement” between the plaintiff and the defendant.72Foot Note 72×DCS at p 41, paras 127(a)-128 69 The legal requirements for implying a term in fact have been set out earlier at [27]. With respect, I am unable to see how a contractual term which would permit the defendant to postpone deliveryindefinitely, based on its ship construction schedule, is necessary for (or even beneficial to) the efficacy of the contract. Likewise, the defendant has not satisfied me that a term to that effect has been incorporated by way of a course of dealing between the parties. At trial, both Koh and Quah Peng Wah testified that if the defendant required the delivery date for any contract to be extended, such an extension would only be allowed if the parties hadmutually agreedto it.73Foot Note 73×Notes of Evidence (30 October 2019) at p 48, lines 11-24; Notes of Evidence (30 October 2019) at p 58, lines 11-59 and line 21; Notes of Evidence (1 November 2019) at p 62, lines 4-21 and p 63, lines 1-13Clearly, this meant that the defendant could not unilaterally extend the delivery dates at its own discretion – its right to do so was subject to the plaintiff’s prior approval. 70 I accordingly find that, by failing to nominate a port of destination within a reasonable time, which was sufficiently early to allow the plaintiff to deliver the equipment ordered by the delivery date, the defendant is in breach of the contracts evidenced by POs 9968 and 9969. (2) Contracts evidenced by POs 9992, 10600, 11289, 11290, 11651, 8874 and 8875 71 There are two subsidiary issues that I must address in relation to the contracts evidenced by POs 9992, 10600, 11289, 11290, 11651, 8874 and 8875. They are as follows: (a) Whether the defendant was permitted, by way of an implied term or a “course of dealing”, to postpone delivery under the contracts in accordance with its ship construction schedule; and (b) Whether the inclusion of the phrase “TBA by POET” in the POs issued by the defendant meant that the defendant had an unfettered right to postpone the delivery date from time to time. 72 In respect of the first subsidiary issue, I echo my reasoning at [67]-[69] above. I find that the defendant has not discharged its burden of showing that there was any term (whether implied or incorporated by course of dealing) which allowed the defendant to unilaterally extend the delivery dates without the plaintiff’s prior consent. 73 I now turn to the second subsidiary issue, which concerns the legal effect of the phrase “TBA by POET”. In this regard, I find Vinodh Coomaraswamy J’s remarks inAero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd[2013] 4 SLR 409 (“Aero-Gate”) to be particularly instructive. The plaintiff in that case had sued the defendant for failing to meet a delivery deadline. Coomaraswamy J held (at [46]) that: … I acknowledge that the words “final date to be advised” are curious given the prior unequivocal statement that the delivery deadline would be changed to end-January 2012 … ButI am unable to accept the defendant’s contention that the words “final date to be advised”thereby negate the otherwise-clear agreement between the parties as at 31 May 2011 that the deadline for delivery would be end-January 2012, ie, 31 January 2012. At most, these words were intended to reassure the defendant that it would not unilaterally bring the delivery date forward and to indicate to the defendant a possibility that the plaintiff might at some future time agree with the defendant a further delay in the delivery deadline. The plaintiff never reached any such agreement with the defendant. [emphasis added] 74 I agree with the plaintiff that the inclusion of the phrase “TBA by POET” in the POs issued by the defendant did not negate the parties’subsequentunequivocal agreement that delivery for POs 9992, 10600, 11289, 11290, 11651, 8874 and 8875 would take place by January 2017. In my judgment, the phrase “TBA by POET” only indicated that the defendant had the right to elect a delivery date at some future time after the date of contract. It did not entitle the defendant to unilaterally postpone a delivery date which both parties had already agreed upon. 75 I thus find that, by failing to nominate a port of destination within a reasonable time, which was sufficiently early to allow the plaintiff to deliver the equipment ordered by the delivery date, the defendant is in breach of the contracts evidenced by POs 9992, 10600, 11289, 11290, 11651, 8874 and 8875. Whether the plaintiff was entitled to terminate the contracts 76 When a breach of contract occurs, the innocent party is entitled to terminate the contract in the following four situations (RDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltdand another[2007] 4 SLR(R) 413 (“RDC Concrete”) at [113]). (a) The first situation is where the contract clearly and unambiguously states that, in the event of a certain event or events occurring, the innocent party will be entitled to terminate the contract (RDC Concreteat [91]). This is known as a “Situation 1” breach; (b) The second situation is where the contract-breaker, by his words or conduct, clearly conveys to the innocent party that it will not perform its contractual obligationsat all(RDC Concreteat [93]). This is known as a “Situation 2” breach; (c) The third situation is where the term breached is a condition of the contract,iea term which the parties have designated as being so important that any breach, regardless of its actual consequences, would entitle the innocent party to terminate the contract (RDC Concreteat [97]). This is known as a “Situation 3(a)” breach; and (d) The fourth situation is where the breach in question would give rise to an event which would deprive the innocent party of substantially the whole benefit which it was intended that the innocent party would obtain from the contract (RDC Concreteat [99]). This is known as a “Situation 3(b)” breach. 77 The plaintiff pleaded that the defendant had, through its conduct, committed a repudiatory breach by “evinc[ing] an intention to no longer be bound by” and/or “evinc[ing] an inability to comply with” the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875. The plaintiff’s pleadings did not specify whether it was relying on any of the four situations set out at [76] above. In its closing submissions, however, the plaintiff’s case became clearer: it advanced the argument that the implied term requiring the defendant to nominate a port of destination within a reasonable time was aconditionof the contract. The defendant’s actions thus constituted a “Situation 3(a)” breach which entitled the plaintiff to terminate the contract.74Foot Note 74×PCS at p 20, para 27 78 In support of this contention, the plaintiff relies on McNair J’s holding inTsakiroglouat 572 that: [I]t was a necessary implication that the buyers should make known to the sellers the exercise of their option as to the port of c.i.f. destination within a reasonable time before the earliest date for shipment under the contract and that the buyer’s failure to notify the sellers of the exercise of such option within a reasonable time as aforesaid was a breach of condition entitling the sellers to treat the contract as determined … 79 The defendant objects to the plaintiff’s analysis for two reasons. First, the defendant avers that the plaintiff’s pleaded case is that the defendant committed a “Situation 2” breach. Since a party is bound by its pleaded case, the plaintiff should not be allowed to rely on its submission that the defendant committed a “Situation 3(a)” breach.75Foot Note 75×Defendant’s Reply Submissions (“DRS”) at p 4, para 12Second, and in any event, the addition of the words “TBA by POET” meant that the implied term to nominate a port of destination within a reasonable time could not be regarded as a condition of the contract.76Foot Note 76×DRS at p 5, para 13 80 I do not think that the plaintiff’s pleaded case is that the defendant had committed a “Situation 2” breach.  Firstly, although “Situation 2” breaches are sometimes referred to as “repudiatory” breaches (see for example,San International Pte Ltd (formerly known as San Ho Huat Construction Pte Ltd) v Keppel Engineering Pte Ltd[1998] 3 SLR(R) 447 at [20]), I am of the view that the plaintiff intended for the term “repudiatory breach” to be interpreted in its broader sense,ieas a type of breach which would entitle the plaintiff to terminate the contract. In other words, the plaintiff was simply characterising the defendant’s breach as one which fell withinanyof the four situations set out at [76] above. 81 Furthermore, a “Situation 2” breach entails acompleterenunciation of the contract by the party in breach. This was elaborated upon in the following passage fromChitty on Contracts, vol 1 (Hugh Beale ed) (Sweet & Maxwell, 30th Ed, 2008) (at 24-018), which was cited with approval inEcon Piling Pte Ltd v GTE Construction Pte Ltd[2009] SGHC 213 (at [30]): … Anabsolute refusalby one party to perform his side of the contract will entitle the other party to treat himself as discharged, as will alsoa clear and unambiguous assertion by one party that he will be unable to performwhen the time for performance should arrive. Short of such an express refusal or declaration, however, the test is to ascertain whether the action or actions of the party in default are such as to lead a reasonable person to conclude that heno longer intends tobe bound by its provisions … [emphasis added] 82 In my judgment, “evinc[ing] an inability to comply with” a contract cannot be equated with an “absolute refusal” by one party to perform his side of the contract. Nor can it be regarded as a “clear and unambiguous assertion” by the contract-breaker that he will be unable to perform the contractin its totality, or that he no longer intends to be bound by the contractual provisions. Thus, I disagree that the plaintiff’s pleaded case is that the defendant had committed a “Situation 2” breach. 83 The defendant’s second objection rests on the following passage inAero-Gate([73]supra) (at [54]): I am also satisfied that this was not a breach of a condition. I find that the varied delivery deadline was not a condition because of the words “final date to be advised” in the e-mail dated 31 May 2011. As I have said at [47] above, these words do not negate a finding that the delivery deadline was end-January 2012. Butthey do indicate that the parties at the time did not view the deadline as a term so important that exceeding it by even a day would entitle the plaintiff to terminate the contract. Those words suggest a mutual understanding at the time that there was a more than fanciful possibility of the parties agreeing to a further delay in delivery at some future time. To that extent, parties did envisage at the time a degree of flexibility in the deadline, such flexibility to be achieved by future agreement. For this reason, the stipulated delivery deadline could not have been of such importance to the parties at the time as to qualify as a condition of PO 1. [emphasis added] 84 These remarksmust be understood in their proper context. InAero-Gate, the words “final date to be advised” were mentioned in thesame e-mailas the agreed delivery date. The relevant portions of the e-mail read as follows (at [46]): Hi Mr Tanabalan, … Please note! We will issue you with an amendment to [PO 1]changing the delivery datesfor the 4 units for [PO 1] toend January 2012. … This means that partial payment will have been made for all 10 units; 6 units for [PO 2] with delivery dates of 1st November 2011 (4) and 1st January 2012 (2) and 4 units for [PO 1]withdelivery date end January 2012 (final date to be advisedbut not before end January 2012) [emphasis in original] 85 As the words “final date to be advised” were added immediately after “delivery date end January 2012”, the natural inference was that the agreed delivery date,ieend January 2012, was flexible in the sense that it could be varied at some future time. This was so notwithstanding the prior unequivocal statement (in the earlier portion of the e-mail) that the delivery dates had been “chang[ed]… to end January 2012”. 86 In the present case, however, the words “TBA” were incorporated into the POs which had been issuedbeforethe parties’ subsequent confirmation of the delivery dates. There was nothing in the POs or in the parties’ subsequent correspondence which suggested that either party could amend the delivery dates once they had been agreed upon. 87 Thus, I find that the defendant’s objections are without merit. I accept the plaintiff’s submission that the implied term to nominate a port of destination was a condition of each of the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875, the breach of which would entitle the plaintiff to terminate the contract in question. Whether the plaintiff had waived its right to or was estopped from terminating the contracts without giving the defendant reasonable notice of the same (1) Whether the plaintiff had waived its right to terminate the contracts 88 When a repudiatory breach of contract occurs, the innocent party is given an election between terminating the contract and affirming it. If the innocent party chooses to exercise this right byaffirmingthe contract, he is said to have waived his right to terminate the contract on the grounds of the same breach. This is the concept of waiver by election (seeChai Cher Watt (trading as Chuang Aik Engineering Works) v SDL Technologies Pte Ltd and another[2012] 1 SLR 152 at [33];Aero-Gate([73]supra) at [41]). 89 The test for waiver by election is well-established. There are three requirements which must be satisfied: (a) first, the innocent party must have acted in a manner consistent only with affirming the contract,ietreating the contract as still alive (Aero-Gateat [42];The “Pacific Vigorous”[2006] 3 SLR(R) 374 at [15]); (b) second, the innocent party must have communicated his choice to affirm the contract to the party in breach in clear and unequivocal terms (Aero-Gateat [42]) and the conduct constituting affirmation may be express or implied (Strait Colonies Pte Ltd v SMRT Alpha Pte Ltd[2018] 2 SLR 441 (“Strait Colonies”) at [42]); and (c) third, the innocent party must have sufficient knowledge of thefactsgiving rise to its legal right to terminate the contract (Aero-Gateat [42];Strait Coloniesat [64]). 90 In the present case, the defendant has not led evidence to show that the plaintiff had communicated its choice to affirm the contract in “clear and unequivocal” terms. Even if it is true that the plaintiff was “very accommodating” or “indulgent” towards the defendant up to and evenbeyondthe agreed delivery dates, as the defendant alleges,77Foot Note 77×DRS at p 30, para 111I am not satisfied that such conduct constitutes anunequivocalrepresentation by the plaintiff that it had elected to affirm the contracts. 91 In this regard, I draw guidance from the Court of Appeal’s remarks inAudi Construction Pte Ltd v KianHiap Construction Pte Ltd[2018] 1 SLR 317 (at [58]): Next, it is well established that mere silence or inaction will not normally amount to an unequivocal representation:Fook Gee Finance Co Ltd v Liu Cho Chit[1998] 1 SLR(R) 385 (“Fook Gee Finance”) at [36]. However, as we also observed inFook Gee Finance(at [37]), “in certain circumstances, particularly where there is a duty to speak, mere silence may amount to [such] a representation”. … The Court of Appeal then elaborated on the circumstances in which a “duty to speak” might arise (at [61]): …The expression “duty to speak” does not refer to a legal duty as such, but to circumstances in which a failure to speak would lead a reasonable party to think that the other party has elected between two inconsistent rights or will forbear to enforce a particular right in the future, as the case may be. We emphasise that this is not the subjective assessment of the other party but an objective assessment made by reference to how a reasonable person apprised of the relevant facts would view the silence in the circumstances, though unsurprisingly, the parties’ relationship and the applicable law which governs it will be a critical focus of the court’s assessment of whether those circumstances exist. [emphasis added] 92 It must be emphasised that cases in which a “duty to speak” arises are the exception and not the norm. Although the parties in the present case shared a longstanding business relationship, they were ultimately no more than commercial entities engaged in a series of arms-length transactions. In my assessment, there was nothing exceptional about their relationship or course of dealings which gave rise to a “duty to speak” on the plaintiff’s part, and the defendant did not adduce any evidence to persuade me otherwise. As such, I find that the plaintiff’s “accommodating” conduct alone cannot be regarded as conclusive evidence of its intention to affirm the contract. 93 The defendant also submits that the plaintiff, through e-mails dated 13 and 16 February 2017, made “clear unequivocal written and express representations” that delivery of the equipment under the contracts could be discussed as long as the defendant settled its other outstanding sums. In particular, it relies on an e-mail from Ho to Koh, dated 13 February 2017, which stated:78Foot Note 78×Quah’s AEIC at p 38, para 56 and p 375 Dear Gary, I have already spoken to him to settle the outstanding as soon as possible which has been long overdue and after that we can discuss about the delivery of other projects which will be subject to our management approval. … 94 I agree that this e-mail suggests that the plaintiff was willing toconsideran extension of the agreed delivery dates. However, Ho’s statements in this e-mail cannot, in my view, be regarded as an unequivocal representation of the plaintiff’s election to affirm the contract. Notably, Ho did not expressly commit to an extension of the existing delivery dates – he merely indicated that the plaintiff was willing to “discuss about the delivery of other projects”. Moreover, Ho caveated that the outcomes of these discussions would be subject to the plaintiff’s management’s approval. This should have alerted the defendant to the fact that the plaintiff’s management had yet to make a final decision on the continuation of the relevant contracts. 95 Thus, the defendant’s submission on this point fails. (2) Whether the plaintiff was estopped from terminating the contracts 96 The defendant also submitted that the plaintiff was estopped from terminating the contracts because its conduct was equivalent to a representation that it would not enforce its strict legal rights against the defendant. 97 In order to successfully make out a defence of promissory estoppel, the defendant must prove three elements: (a) a clear and unequivocal promise by the promisor, whether by words or conduct; (b) reliance on the promise by the promisee; and (c) detriment suffered by the promisee as a result of the reliance (Aero-Gate([73]supra) at [37];Oriental Investments (SH) Pte Ltd vCatalla Investments Pte Ltd[2013] 1 SLR 1182 at [83]). 98 I note that the defendant did not expressly plead estoppel, and that its submissions on this defence appear to conflate it with the legally distinct concept of waiver by election. Nevertheless, I am of the view that the defendant cannot avail itself of this defence even if its case is taken at its highest. Firstly, as stated at [90] above, I am not satisfied that the plaintiff had clearly and unequivocally represented to the defendant that it would not discharge the contracts. Secondly, even if the first element is made out, the defendant has neither particularised nor led evidence to prove the detriment which it has allegedly suffered in consequence of its reliance on the plaintiff’s conduct. Accordingly, it is not necessary for me to consider this submission further. (3) Whether the plaintiff was required to give the defendant reasonable notice before terminating the contracts 99 Finally, I come to the defendant’s contention that the plaintiff could not terminate the contracts without providing the defendant with reasonable prior notice of its intention to do so. 100 This argument rests on two limbs. First, the defendant relies on Clause 17 of the Orgalime S2000 General Conditions for the Supply of Mechanical, Electrical and Electronic Products which were incorporated into the quotations corresponding to POs 9968 and 9969.79Foot Note 79×AB1 at p 68This clause reads as follows: Unless the Purchaser’s failure to accept delivery is due to any such circumstance as mentioned in Clause 39, the Supplier may by notice in writing require the Purchaser to accept delivery within a final reasonable period. If, for any reason for which the Supplier is not responsible, the Purchaser fails to accept delivery within such period, the Suppliermayby notice in writing terminate the contract in whole or in part. … [emphasis added] 101 I note that this point does not form part of the defendant’s pleadings. In any event, I agree with the plaintiff that the defendant’s reliance on this clause is misplaced. This clause merely specifies an optionalmodeby which the suppliermaychoose to terminate the contract,ie“by notice in writing”. It does not suggest that the supplier must give priornotice to the defendant before terminating the contract. 102 The defendant also relies onCharles Rickards vOppenhaim[1950] 1 K.B. 616 (“Charles Rickards”) for the proposition that the plaintiff was obliged to provide it with reasonable notice before terminating the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875. In that case, the defendant buyer ordered a Rolls Royce Silver Wraith chassis from the plaintiff suppliers. When the car was not delivered on the agreed delivery date, the buyer did not cancel the contract but continued to press for delivery. Eventually, the buyer gave a notice to the supplier stating that he would not accept the car unless it was delivered by 25 July 1948. 103 Denning LJ (as he then was) held (at 623) that the buyer was estopped, by its initial conduct, from terminating the contract on the grounds of the supplier’s late delivery: If the defendant, as he did, led the plaintiffs to believe that he would not insist on the stipulation as to time, and that, if they carried out the work, he would accept it, and they did it, he could not afterwards set up the stipulation as to the time against them. Whether it be called waiver or forbearance on his part, or an agreed variation or substituted performance, does not matter. It is a kind of estoppel. By his conduct he evinced an intention to affect their legal rights. He made, in effect, a promise not to insist on his strict legal rights. … 104 However, Denning LJ also went on to stress that if the buyer subsequently gave notice to the supplier fixing a reasonable time for delivery, thus making time of the essence once again, it would be entitled to terminate the contract if delivery was not fulfilled by the new time stipulated (at 624): It would be most unreasonable if the defendant, having been lenient and waived the initial expressed time, should, by so doing, have prevented himself from ever thereafter insisting on reasonably quick delivery. In my judgment he was entitled to give a reasonable notice making time of the essence of the matter. Adequate protection to the suppliers is given by the requirement that the notice should be reasonable. 105 In my view,Charles Rickardsonly assists the defendant’s case if it succeeds in proving that the plaintiff had waived its right to, or was estopped from, terminating the contract by reason of the defendant’s failure to nominate a port of destination within a reasonable time. As established above, however, neither waiver nor estoppel are made out in the present case. I thus find that the plaintiff had validly exercised its right to terminate the contracts evidenced by POs 9968, 9969, 9992, 10600, 11289, 11290, 11651, 8874 and 8875.",
        "Issues concerning the contract evidenced by PO 10601": "Whether the contract was subject to an implied term that the defendant would advise the plaintiff on a delivery date within a reasonable time 106 I now turn to the issues surrounding the contract evidenced by PO 10601. The plaintiff acknowledges that the parties did not, at any point in time, agree on a delivery date for this contract. Instead, its case is that the contract was subject to an implied term that the defendant would advise the plaintiff on a delivery date within a reasonable time from the date of contract. It further submits that a “reasonable time” would have been a maximum of 2 years from the contract, based on the previous course of dealings between the plaintiff and the defendant.80Foot Note 80×PCS at p 23, para 35 107 In support of this contention, the plaintiff relies on the judgment of the Supreme Court of South Australia inAgseedPty Ltd v Broad(1990) BC9100416 (“Agseed”). In that case, the defendant ordered ryecorn from the plaintiff, and the delivery date for the ryecorn was expressed as “to be advised”. Matheson J affirmed the trial judge’s finding that: … Clearly, the defendant was in breach of his contractual arrangement with the plaintiffs by reason of his failure to take delivery of the crop within the represented or reasonable time… 108 Matheson J then cited the following passage by the High Court of Australia inPerriv Coolangatta Investments Pty Ltd(1982) 149 CLR 537 (“Perri”): An implication of a reasonable time when none is expressly limited is, in general, to be made unless there are indications to the contrary. 109 In response, the defendant submits that the equipment purchased under PO 10601 did not have an express or implied delivery date because it had been expressly purchased as “stock”.81Foot Note 81×DCS at p 6, para 17; Defence at [25]; Quah’s AEIC at p 34, para 51(c) 110 I agree with the plaintiff that the contract evidenced by PO 10601 was subject to an implied term that the defendant would advise the plaintiff on a delivery date within a reasonable time. In my view, the implication of such a term meets the requirements of the three-stepSembcorptest for the implication of terms set out at [27] above. As the plaintiff has pointed out, the terms of the contracts were such that 90% of the contract price would only become payable upon delivery of the equipment ordered. Thus, for as long as the defendant withheld advising the plaintiff on a delivery date, the plaintiff would not have been able to deliver and therefore would not have become entitled to the remaining 90% of the contract price. In my view, this was clearly a “gap” which the plaintiff and the defendant had failed to contemplate, and which needed to be addressed in order for the contract to make commercial sense. 111 I am also unable to accept the defendant’s allegation that the equipment purchased under PO 10601 had been expressly purchased as “stock”. I accept Koh’s evidence that the word “stock” was not intended to mean that the plaintiff would purchase and store equipment for the defendant. Rather, it was used to signify a particular engine which had been ordered under a previous PO, but which had been transferred to a new hull and designated under a new PO with the plaintiff’s agreement.82Foot Note 82×PCS at p 73, para 132; Notes of Evidence (30 October 2019) at p 135, lines 1-22 112 As to the specific term to be implied, I am guided by the High Court of Australia’s remarks inPerri([108]supra): as there was no other indication to the contrary, an implication of a reasonable time is appropriate in the present case. Whether the defendant was in breach of the contract 113 I next consider whether the defendant was in breach of the implied term to advise the plaintiff on a delivery date within a reasonable time. To address this issue, I must determine what constitutes a “reasonable” time in the present case. 114  In this regard, I refer to Olsson J’s helpful pronouncement inAgseed([107]supra): … [T]he limit of what is reasonable “is determined by reference to what is fair to both parties”. It necessarily requires consideration both of what was in the contemplation of the parties at the time of entry into the contract and prompted their subsequent actions and also those subsequent circumstances which reasonably ought to be taken into account as a matter of fairness and equity. 115 In my judgment, what was “in the contemplation of the parties at the time of entry into the contract” may be assessed by reference to various factors, including normal industry practice and the course of dealings between the parties, if any. In the present case, however, neither party has adduced any evidence of industry custom and/or practice. Nor have they highlighted any post-contractual circumstances which ought to have been taken into consideration “as a matter of fairness and equity”. Thus, I must look to the course of dealings between the plaintiff and the defendant in order to ascertain their intentions at the material time. 116 The plaintiff submits that based on past practice between the plaintiff and the defendant, the equipment that the plaintiff sold to the defendant would usually be delivered within two years (at the latest) from the conclusion of the contract.83Foot Note 83×Chuah Swee Choo’s AEIC dated 2 September 2019 (“Chuah’s AEIC”) at p 6, para 15(b); Ho Kah Huat’s AEIC dated 2 September 2019 (“Ho’s AEIC”) at p 2, para 6The defendant did not put forward any evidence to rebut this contention. Accordingly, I am of the view that a “reasonable” time in the present case would have been a maximum of two years from the date on which PO 10601 was issued,ieby 5 August 2016. Given that the defendant had failed to advise the plaintiff on a delivery date for the equipment under PO 10601 by 5 August 2016, I find that the defendant was in breach of the contract evidenced by PO 10601. Whether the plaintiff was entitled to terminate the contract 117 Finally, I consider the issue of whether the plaintiff was entitled to terminate the contract evidenced by PO 10601 in response to the defendant’s breach. 118 In its Statement of Claim, the plaintiff asserts that the defendant’s failure to advise on a delivery date for the contract evidenced by PO 10601 was a repudiatorybreach.84Foot Note 84×SOC at p 14, para 55However, submissions on this point were lacking. As such, I directed the parties to file further submissions on whether the breach of an implied term to advise on a delivery date within a reasonable time would entitle the aggrieved party to terminate the contract. 119As stated at [76] above, an innocent party’s right to terminate the contract in the event of a breach only arises in four situations. The plaintiff submits that it was contractually entitled to terminate the contract evidenced by PO 10601 by virtue of Clause 11 of its Conditions of Sale, which had been incorporated into all of its contracts with the defendant.85Foot Note 85×Plaintiff’s Further Written Submissions (“PFS”) at p 2, para 2; AB1 at p 300Further or alternatively, it argues that the implied term to advise on a delivery date within a reasonable time was a condition of PO 10601,86Foot Note 86×PFS at p 3, para 7and/or that a breach of the said implied term deprived the plaintiff of substantially the whole benefit of the contract.87Foot Note 87×PFS at p 2, para 4 120I first address the plaintiff’s submission regarding Clause 11 of its Conditions of Sale,88Foot Note 88×AB1 at p 300which states as follows: 11. If the buyer fails to furnish evidence of his credit worthiness or security for payment to the seller’s satisfaction within sixty (60) days from the date of the seller’s acceptance,or the buyer shall make default in or commit a breach of the contract or of any other of his obligations to the seller, or if any distress or execution shall be levied upon the buyer’s property or assets, or if the buyer shall make or offer to make any arrangement or composition with creditors, or commit any act of bankruptcy, or if any petition or receiving order in bankruptcy shall be presented or made against him, or if the buyer is a limited company and any resolution or petition to wind up such company’s business (other than for the purpose of amalgamation or reconstruction) shall be passed or presented, or if a receiver of such company’s undertaking, property or assets or any part thereof shall be appointed, the seller shall have the right forthwith to terminate any contract then subsisting and upon written notice of such terminations being posted to the buyer’s last known address any subsisting contracts shall be deemed to have been terminated without prejudice to any claim or right the seller may otherwise make or exercise. [emphasis added] 121 It is undisputed that, pursuant to Situation 1 inRDC Concrete([76]supra), an aggrieved party can terminate a contract under specified circumstances if the contractual terms “clearly and unambiguously” entitle it to do so (seeRDC Concreteat [91]). However, the defendant argues that since Clause 11 primarily deals with credit default and insolvency-related events, it should be construedcontraproferentem, and be limited in its application to insolvency-related events only.89Foot Note 89×Defendant’s Further Submissions (“DFS”) at p 1, para 3Furthermore, it suggests that the scope of the phrase “breach of the contract” should be restricted to breaches ofexpresscontractual terms.90Foot Note 90×DFS at p 2, para 3Otherwise, Clause 11 would have the practical effect of “turn[ing] every provision in the Contract into a condition”.91Foot Note 91×DFS at p 2, para 4 122 I am unable to accept the defendant’s submissions. InFu Yuan Foodstuff Manufacturer Pte Ltd v Methodist Welfare Services[2009] 3 SLR(R) 925 (“Fu Yuan Foodstuff”), the Court of Appeal opined (at [31]) that “if a termination clause isclearlydrafted, itsliterallanguageought to accurately reflect the intentions of the parties” (emphasis in original). It went on to state (at [36]) that: [E]ach termination clause must be analysed by reference to the precise language utilised by the parties in the context in which they entered into the contract, bearing in mind the fact that the ultimate aim of the court is togive effect to the intentions of theparties as embodied within the wording of the termination clause in question. [emphasis added] 123 Therefore, the Court of Appeal held that the circumstances ofFu Yuan Foodstufffell “squarely” within “Situation 1” ofRDC Concretebecause clause 3.292Foot Note 92×This clause stipulated that “[The respondent] may terminate [the] Agreement without notice should the [appellant] breach any item under Clauses 1.4, 3.2 and 2.7”.of the disputed contract in that case “expressly stipulated” that the respondent would be entitled to terminate the contract should the appellant in that case breach any item under clause 2.7. Since the appellant had breached clause 2.7.2 of the contract, the respondent’s right to terminate the contract “immediately arose” (seeFu Yuan Foodstuffat [28]). 124 The Court of Appeal also distinguished the English Court of Appeal’s decision inRice v Great Yarmouth Borough Council[2003] TCLR 1 (“Rice”).  InRice, the issue was whether a local council was entitled to terminate two maintenance contracts with a contractor on the basis of the following contractual term: 23.2 If the contractor: 23.2.1 commits a breach of any of its obligations under the Contract; … … the Council may, without prejudice to any accrued rights or remedies under the Contract, terminate the Contractor’s employment under the Contract by notice in writing having immediate effect. 125 Hale LJ (as she then was) (with whom Peter Gibson and May LJJ agreed) remarked that, on its face, the clause ostensibly “visit[ed] the same draconian consequences upon any breach, however small, of any obligation, however small”. In her view, “the notion that this term would entitle the council to terminate a contract such as this at any time for any breach of any term fl[ew] in the face of commercial common sense”. Accordingly, she affirmed the decision of the judge at first instance that Clause 23.2.1 only accorded a right to terminate in the event of a repudiatory breach, or an accumulation of breaches which, as a whole, could properly be described as repudiatory. 126 The Court of Appeal inFu Yuan FoodstuffcharacterisedRiceas a case where a termination clause was artificially “read down” in order to control its legal effect. It declined to adopt the reasoning inRicebecause the contested termination clause inFu Yuan Foodstuffwas “consistent with the commercial reality between the parties” (at [36]). 127 In my view, the approach inRiceis similarly inapplicable in the present case. InRice, the contractor operated a small-scale horticultural business and was contracting with the local council for the first time. In addition, the contracts were intended to last for four years (a substantial duration) and involved a myriad of obligations of differing importance and varying frequency. By contrast, the defendant in this case is an established business entity which was involved in a longstanding commercial relationship with the plaintiff. The defendant was well-acquainted with the plaintiff’s Conditions of Sale, which were annexed to all of the plaintiff’s quotations. Moreover, the contract in dispute was not a long-term service contract, but a straightforward arms-length transaction for the purchase and delivery of shipbuilding equipment. 128 In light of these circumstances, I am satisfied that the literal meaning of Clause 11, whichexpresslyandunambiguouslyentitles the plaintiff to terminate the contract evidenced by PO 10601 if the defendant breaches “any” of its obligations (ie, whether express or implied) to the plaintiff, accurately represented the parties’ intentions at the time of their entry into the contract. LikeFu Yuan Foodstuff, the present case falls within “Situation 1” ofRDC Concrete([76]supra). 129 Additionally, thecontraproferentemrule is only applicable in cases where there is doubt or ambiguity about the meaning of a particular contractual provision, and therefore does not assist the defendant in the present case (seeHewlett-Packard Singapore (Sales) Pte Ltd v Chin Shu Hwa Corinna[2016] 2 SLR 1083 at [47]), since there is no ambiguity within Clause 11 itself. 130 I note in passing that the approach adopted inRice([124]supra)has been widely critiqued (see for example, Simon Whittaker, “Termination Clauses” inContract Terms(Andrew Burrows & Edwin Peel eds) (Oxford University Press, 2007) at pp 277–283; Ewan McKendrick,Contract Law: Text, Cases and Materials(Oxford University Press, 5th Ed, 2012) at pp 792-793). Furthermore, recent English decisions appear to suggest that contractual terms which expressly provide for a right of termination are effective even if the events on which those rights are exercisable do not amount to repudiatory breaches (seeKasonKek-Gardner Ltd v Process Components Ltd[2017] EWCA Civ 2132;FirodiShipping Ltd v Griffon Shipping LLC[2013] EWCA Civ 1567). Nevertheless, it is not necessary for me to discuss the legal merits of the approach inRice, and I do not propose to do so here. 131 Although the analysis above is sufficient to dispose of this issue in its entirety, I will cursorily address the parties’ other submissions for completeness. These relate to the questions of (a) whether the implied term to advise on a delivery date within a reasonable time is a condition under Situation 3(a) inRDCConcrete; and (b) whether breaching such a term would deprive the plaintiff of substantially the whole benefit of the contract, pursuant to Situation 3(b) inRDC Concrete. 132 Parties referred me to the English case ofShawtonEngineering Ltd v DGP International Ltd[2006] BLR 1 (“Shawton”), which Coomaraswamy J discussed at length inAero-Gate([73]supra).The relevant portion ofShawtonreads as follows: … In the present case, there were originally fixed dates for completion, but it is correctly agreed that variations had rendered those dates inoperable.Instead, the obligation was to complete within a reasonable time.That obligation did not depend on Shawton giving any notice. But such an obligation was not a condition such that breach of it would automatically entitle Shawton to determine the contracts. Shawton could only in law legitimately determine the contracts for delay if either (a) they gave reasonable notice making time of the essence; or (b) DGP’s failure to complete within a reasonable time was a fundamental breach such that the gravity of the breach had the effect of depriving Shawton of substantially the whole benefit which it was the intention of the parties that they should obtain from the contracts. Where time is not of the essence and where the party said to be in breach by delay is nevertheless making an effort to perform the contract, it is intrinsically difficult for the other party to establish a fundamental breach in this sense.So here, I think, where on any view DGP were performing at least in part. [emphasis added] 133 In my judgment,Shawtonstands for the following proposition: where a party is in breach by delay, and time is not of the essence, timely performance cannot be regarded as a condition of the contract. As such, the aggrieved party can only terminate the contract if it has given reasonable notice making time of the essence, or if the breach was of such a nature as to deprive it of substantially the whole benefit of the contract (ie,a Situation 3(b) breach). However, it will beintrinsically difficultfor the aggrieved party to establish a Situation 3(b) breach if the party in breach is making an effort to perform the contract. 134 The approach inShawtonis supported by the Ontario Superior Court of Justice’s decision inDanswayInternational Transport Ltd v Lesway and Sons Inc.[2001] O.T.C 880 (“Dansway”). In that case, McKinnon J opined (at [50] and [55]): I apprehend the law to be this: where the seller believes that the buyer is not taking delivery of goods within a reasonable time, the seller must give notice requiring the buyer to take delivery before he may terminate the contract; and the time stipulated for taking delivery must itself be reasonable. … … This principle of law, requiring a duty to warn before termination of a contract where time is not of the essence, is both sound and equitable. It dissuades contracting parties from acting capriciously. It recognizes and fosters the sanctity of contract and assumes the good faith of contracting parties. It encourages continuing negotiation to settle unresolved details that arise in contractual relations. Ultimately, it avoids lawsuits. 135 I agree with the defendant that the principles inShawtonandDanswayare equally applicable to the present case. The pivotal question is whether time was of the essence of the contract evidenced by PO 10601. In my view, it was not: the parties did not expressly agree on a delivery date, and the implied term merely required the defendant to advise on a delivery date within a “reasonable” time from the date of the contract. 136 Although the defendant expressly informed the plaintiff, through an e-mail dated 30 November 2015, that there was no scheduled delivery date for the equipment ordered under PO 10601,93Foot Note 93×AB7 at p 4257the plaintiff did not attempt to fix a delivery date or notify the defendant of its intention to make time of the essence. I also find, based on the passage inShawtonabove, that it is intrinsically difficult for the plaintiff to establish a Situation 3(b) breach since the defendant paid the 10% down-payment required under the contract94Foot Note 94×SOC (1) at para 51and expressly announced that it was prepared to discuss delivery dates with the plaintiff’s Gary Quah.95Foot Note 95×AB7 at p 4257In the circumstances, I find that the plaintiff was not entitled to terminate the contract under Situations 3(a) or 3(b) inRDC Concrete([76]supra).Nonetheless, it succeeds on this issue because of my findings in [127]-[128] above.",
        "Whether the plaintiff reasonably mitigated its losses": "137 Having established that the defendant is in repudiatory breach of the contracts brought up by the plaintiff’s claim (iethe contracts evidenced by POs 9968, 9969, 9992,10600, 10601, 11289, 11290and 11651), and that the plaintiff validly exercised its right to terminate these contracts, I will now deal with the quantification of damages in the present case. 138 The plaintiff seeks damages equivalent to the expectation loss which it has suffered by virtue of the defendant’s contractual breaches. It argues that this expectation loss would constitute the remainder of the prices ofall eightcontracts, less the amounts it hasactuallyrecouped in mitigation.96Foot Note 96×PCS at p 43, para 82 139 The defendant’s pleaded case is that the plaintiff failed to reasonably mitigate its losses arising from the breaches of the contracts in dispute. In its reply submissions, however, the defendant appeared to advance a different argument,iethat the plaintiff’smethodof quantifying the damages was incorrect. It averred that theproper measure of the plaintiff’s expectation losswas the remainder of the prices of all eight contracts,less the resale price ofallthe equipment on reasonable resale terms.97Foot Note 97×DRS at p 11, para 35 140 In my view, this argument obfuscates the issue. The critical question remains: did the plaintiff reasonably mitigate its losses? If so, the plaintiff is entitled to recover damages equivalent to the remainder of the prices ofall eight contracts, less the amounts it hasactuallyrecouped in mitigation. If not, theplaintiff’s quantum of damages must be reduced by the amount of losses which it had failed to reasonably mitigate. This is clear from the Court of Appeal’s judgment inThe “Asia Star”[2010] 2 SLR 1154 (“Asia Star”) (at [24]): The basic rules relating to mitigation are well settled. First, the aggrieved party must take all reasonable steps to mitigate the loss consequent on the defaulting party’s breach, andcannot recover damages for anyloss which it could have avoided but failed to avoid due to its own unreasonable action or inaction. [emphasis added] 141 The Court of Appeal inAsia Staralso provided guidance on the standard of reasonableness imposed on a successful claimant. It observed (at [32]) that: The many sub-rules, qualifications and nuances that have built up around the reasonableness inquiry may not infrequently appear to be confusing and unwieldy. Nevertheless, when one takes a step back to look at the object of this inquiry as a whole, it becomes clear that the inquiry amounts to nothing more than the common law’s attempt to reflectcommercial and fact-sensitive fairnessat the remedial stage of a legal inquiry into the extent of liability on the defaulting party’s part. The concept of reasonableness in the context of mitigation is a flexible one. In essence, it bars an aggrieved party from profiting or behaving unreasonably at the expense of the defaulting party, and encapsulates complex interplaying notions of responsibility and fairness. As with any principle of law that encapsulates notions of fairness, the principle of mitigation confers on the courts considerable discretion in evaluating the facts of the case at hand in order to arrive at a commercially just determination. The principle embodies a fact-centric flexibility which, whilst remaining in harmony with sound business practice, stands in vivid contrast to the strictness with which rules in other areas of contract law are applied. [emphasis in original] 142 The plaintiff has led evidence by Ho to illustrate the steps which it has taken to sell the equipment under the contracts in dispute.98Foot Note 98×Ho’s AEIC at p 33, para 82These are as follows: (a) On or about 31 December 2015, the plaintiff sold part of the PO 9992 equipment, namely, one unit of C18 engine ESE 14965, for US$130,455; (b) On or about 19 December 2017, the plaintiff sold part of the PO 9968 equipment, namely, one unit of 3516C engine ESE 14743, for US$388,000; (c) On or about 26 March 2019, the plaintiff sold part of the PO 9968 equipment, namely, one unit of C18 engine ESE 1475, for S$127,000; (d) On or about 13 May 2019, the plaintiff sold part of the PO 10601 equipment, namely, one unit of C18 engine ESE 14724, for US$107,000; (e) On or about 13 August 2019, the plaintiff sold part of the PO 9969 equipment, namely, one unit of 3516CHD Caterpillar marine propulsion engine ESE 14819, for US$380,000; and (f) On or about 17 October 2019, the plaintiff sold part of the PO 9992 equipment, namely, one unit of C18 engine ESE 14967, for US$128,000. 143 The defendant submits that the plaintiff could easily have resoldallthe equipment under the contracts in dispute, “even at 10-20% discount”, and that it would have suffered no or minimal loss as a result.99Foot Note 99×DRS at p 12, para 40To demonstrate that there was a ready market for such equipment, the defendant led evidence from Koh who stated, during his examination-in-chief, that C18 and C32 generators were “very common model[s]”.100Foot Note 100×Notes of Evidence (30 October 2019) at p 5, lines 1-3It also argues that “the fact that the plaintiff could resell the C18, 3512 and 3516 main engines is evidence in itself that these equipment had a ready market”.101Foot Note 101×DRS at p 12, para 44 144 It is uncontroverted that the burden of proving that the aggrieved party has failed to fulfil its duty to mitigate falls on the defaulting party (Asia Starat [24]). In the present case, I am not satisfied on the evidence before me that the defendant has discharged its burden of proving that the plaintiff has failed to reasonably mitigate its losses. First, apart from a bare assertion by Quah Peng Wah that the equipment was “of wide application in the marine industry”,102Foot Note 102×Quah’s AEIC at p 41, para 68the defendant has not adduced any other evidence to show that there was a ready market for the undelivered equipment. Second,even ifa ready market did exist, the plaintiff’s inability to resell part of the undelivered equipment cannot be viewed as a conclusive indication of its failure to mitigate. As emphasised inAsia Star, the reasonableness of the plaintiff’s mitigatory efforts must be examined by reference to the circumstances of the caseas a whole. 145 Finally, I note in passing that the defendant has referred me toBulsingLtd v Joon Seng & Co[1972] 2 MLJ 43 (“Bulsing”) as an example of a case where the existence of a “ready market” was in issue.103Foot Note 103×DRS at p 11, para 38However, the defendant has not explained howBulsingis relevant or what proposition inBulsingit seeks to rely on. I am therefore unable to place any reliance on this case. 146 In light of the above, I find that the plaintiff is entitled to damages equivalent to the remainder of the prices of the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651, less the amounts stated in [142] above which it has successfully recovered in mitigation.",
        "Conclusion": "147 In summary, my decision is as follows. (a) The plaintiff succeeds in its claims relating to the contracts evidenced by POs 9968, 9969, 9992, 10600, 10601, 11289, 11290 and 11651. Accordingly, the plaintiff is entitled to a declaration that the defendant has breached these eight contracts, and to damages of S$11,174,300 and US$536,945. (b) The defendant’s counterclaim is dismissed in its entirety. 148 Judgment will therefore be entered for the plaintiff against the defendant for the sum of S$11,174,300 and US$536,945 and interest thereon under s 12 of the Civil Law Act (Cap 43, 1999 Rev Ed). Interest under the Civil Law Act will run on the S$11,174,300 and US$536,945 from 16 March 2018, the date on which the plaintiff issued the writ in this action, to the date of this judgment at the usual rate of 5.33% per annum. 149 I will hear parties on the issue of costs at a later date. Parties are to file their submissions on costs, limited to ten pages each, within fourteen days from the date of this judgment.  Vincent HoongJudge Kirpalani Rakesh Gopal, Teo Wei Ling (Zhang Weiling), Oen Weng Yew Timothy (Drew & Napier LLC) for the plaintiff;Ong Sie Hou Raymond, Koh Kok Kwang, Karin Lee (CTLC Law Corporation) for the defendant."
    }
}