{
    "case_title": "CDM and others vCDP",
    "ncitation": "[2020] SGHC 141",
    "coram": "S Mohan JC",
    "sections": {
        "Introduction": "1 In Originating Summons 1307 of 2019 (“OS 1307/2019”), [CDM] (“CDM”), [CDN] (“CDN”) and [CDO] (“CDO”) are the Plaintiff applicants while [CDP] (“CDP”) is the Defendant andvice versain Originating Summons 1124 of 2019 (“OS 1124/2019”). CDM, CDN and CDO were the respondents in arbitration proceedings seated in Singapore and CDP was the claimant. For consistency and to avoid confusion, I will, throughout these grounds of decision, refer to CDM, CDN and CDO as the “1st Plaintiff”, “2nd Plaintiff” and “3rd Plaintiff” respectively (collectively, the “Plaintiffs”), and to CDP as the “Defendant”. 2 The applications before me arose out of a contract for,inter alia, the construction of an offshore drilling rig or more precisely, a Self-Erected Tender Rig and Derrick Equipment Set. Disputes arose between the parties in the course of performance of the contract and arbitration proceedings ensued in Singapore. The arbitration proceedings culminated in a partial arbitration award rendered in the Defendant’s favour. The Defendant sought to enforce the award in OS 1124/2019 and in response, the Plaintiffs applied to set it aside in OS 1307/2019. Whether the arbitral tribunal acted in excess of its jurisdiction or breached the rules of natural justice in the making of the award were among the issues that I had to determine. 3 The Plaintiffs are companies incorporated in Singapore. The Defendant, a shipbuilder, is a company incorporated in the People’s Republic of China.1Foot Note 1×Award at paras 1.1–1.5The 1st and 2nd Plaintiffs entered into contracts with the Defendant, under which the Defendant agreed to design, build, launch, equip, commission, test, complete, sell and deliver to each of the 1st and 2nd Plaintiffs a Self-Erected Tender Rig and a Derrick Equipment Set.2Foot Note 2×Award at para 3.1The 3rd Plaintiff, which is the holding company of the 1st and 2nd Plaintiffs,3Foot Note 3×Affidavit of Svein Nodland dated 17 October 2019 (“1st Affidavit of Svein Nodland”) at para 10issued a Guarantee to the Defendant on behalf of the 1st and 2nd Plaintiffs as security for the performance of the 1st and 2nd Plaintiffs’ obligations under the contracts.4Foot Note 4×Plaintiff’s Submissions at para 4 4 The underlying disputes between the parties arose out of the following agreements (the “Agreements”), the details of which have been anonymised to maintain confidentiality:5Foot Note 5×Award at para 1.9 (a) a Contract for the Design, Construction and Completion of a Self-Erected Tender Rig and Derrick Equipment Set (“Hull No. X”) between the 1st Plaintiff and the Defendant dated 9 June 2013 as subsequently amended (“Contract X”); (b) a Guarantee furnished to the Defendant by the 3rd Plaintiff on 9 June 2013 in respect of Contract X (“X Guarantee”); (c) a Contract for the Design, Construction and Completion of a Self-Erected Tender Rig and Derrick Equipment Set (“Hull No. Y”) between the 2nd Plaintiff and the Defendant dated 9 June 2013 as subsequently amended (“Contract Y”); and (d) a Guarantee furnished to the Defendant by the 3rd Plaintiff on 9 June 2013 in respect of Contract Y (“Y Guarantee”). 5 After entering into Contract X, the Defendant and the 1st Plaintiff entered into various addenda. Addendum No. 1 was entered into on 15 April 2014 by the 1st Plaintiff and Defendant. Nothing turns on this addendum. Of relevance to the applications before me was Addendum No. 2 which was entered into by, amongst other parties, the 1st Plaintiff and Defendant on 24 September 2014 (“Contracts Addendum No. 2”). Article 6 of Contracts Addendum No. 2,inter alia, varied the payment terms in Contract X and in particular provided as follows:6Foot Note 6×Award at para 3.2(h)  6. Article 18.3 in [Contract X] shall be automatically replaced by and changed to the following:  … (d) 10% (Ten [percent]) shall be paid upon launching and receipt of invoice issued by the BUILDER. Within 30 banking day before launching, BUILDER shall pay refund guarantee to the BUYER (“Refund Guarantee”) of 10% (Ten percent) of the CONTRACT Price. …  However (c), (d) and (e) is subject that [Defendant] shows the following commitments:  (1) Quality of workmanship and system in conformance with the CONTRACT.  (2) Mutual cooperativeness between [Defendant] and Owner and Owner’s site teams.  (3) Commit on schedule as per Annex 1.  (4) Launching subject to prior approval by CLASS, Owner and [Defendant] collectively as per CONTRACT.  (5) [Contract X] payment amendments shall come into effect after [Defendant] placing the order of DES and Main Crane for [Hull No. Y] … 6 Disputes arose in relation to the Agreements and the Defendant commenced arbitration in Singapore, in accordance with the arbitration provisions in the Agreements, under the auspices of the Singapore International Arbitration Centre (“SIAC”) and its rules (the “Arbitration”).7Foot Note 7×Award at paras 1.11–1.14Following an oral hearing and parties submitting written closing submissions, the Tribunal rendered a Final Partial Award (“the Award”) in the Defendant’s favour on 15 August 2019. The Award dealt with the claims and counterclaims made under both Contract X and Contract Y. 7 OS 1307/2019 was filed by the Plaintiffs on 18 October 2019, essentially seeking an order that the Award be set aside. Whilst Prayer 3(a) of OS 1307/2019 prayed for the Award to be “reversed and/orwhollyset aside”, counsel for the Plaintiffs, Mr Navinder Singh, confirmed in his submissions that the challenge by his clients was confinedonlyto that part of the Award relating to the Defendant’s claim under Contract X and the X Guarantee. Contract X and the X Guarantee only involved the 1st and 3rd Plaintiffs. That the challenge was so limited was also apparent from the affidavit filed by the Plaintiffs in support of OS 1307/2019,8Foot Note 8×Seeeg1st Affidavit of Svein Nodland at para 13and was also a point made by counsel for the Defendant, Mr Daniel Chia.9Foot Note 9×Defendant’s Written Submissions at para 7Therefore, the present grounds only concern that part of the Award pertaining to the Defendant’s claim under Contract X and the X Guarantee. In light of this, hereafter, all references to the Plaintiffs will exclude the 2nd Plaintiff.  The 2nd Plaintiff was only a party to Contract Y, in respect of which the Award is not being challenged. 8 In OS 1124/2019, the Defendant applied for leave to enforce the Award as a judgment of this court. An order (HC/ORC 6180/2019) was madeexparteon 9 September 2019 granting the Defendant leave (the “Leave Order”). Subsequent thereto, orders were also made on the back of various applications filed by the Defendant (a) ordering the Plaintiffs to produce books or documents and to allow the Defendant to examine the Plaintiffs’ officers (HC/ORC 7550/2019) and (b) ordering a Garnishee bank to pay to the Defendant any debts due from the Garnishee to the Plaintiffs (HC/ORC 7548/2019) (collectively, the “Enforcement Orders”). 9 In SUM 5816/2019 filed in OS 1124/2019 by the Plaintiffs on 19 November 2019, the Plaintiffs applied,inter alia, for a stay of enforcement of the Award and any further proceedings in relation to such enforcement, and/or for a stay of execution of the Leave Order and Enforcement Orders pending the disposal of OS 1307/2019 (collectively, the “Stay Application”). 10 As foreshadowed at [7], in OS 1307/2019, the Plaintiffs applied to set aside the Award pursuant to the provisions of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the Act”) (the “Setting Aside Application”). The Plaintiffs relied on the following grounds:10Foot Note 10×1st Affidavit of Svein Nodland at para 35 (a) that the Award was made in excess of the Tribunal’s jurisdiction, in breach of Article 34(2)(a)(iii) of the UNCITRAL Model Law on International Commercial Arbitration (“the Model Law”) as set out in the First Schedule (“Sch 1”) to the Act; and (b) that the Award was made in breach of the Plaintiffs’ right to present its case, in violation of Article 34(2)(a)(ii) of the Model Law and/or in breach of the rules of natural justice, in violation of s 24(b)of the Act. 11 I heard the parties on both OS 1307/2019 and the Stay Application on 5 and 6 February 2020. I dismissed the Stay Application on 6 February 2020 and reserved my decision on OS 1307/2019 and the issue of the costs of the Stay Application pending my decision on OS 1307/2019. On 28 February 2020, I delivered oral grounds for my decision in OS 1307/2019 and dismissed it. After hearing parties, I awarded costs of OS 1307/2019 and of the Stay Application to the Defendant on the standard basis and fixed those costs. The Plaintiffs have since appealed against my decisions in OS 1307/2019 and the Stay Application. These are the full grounds of my decision.",
        "Summary of factual background to the Defendant’s claim and the Award": "12 I take most of the background facts from the Award. In summary, the Defendant as the builder of Hull No. X claimed that it had fulfilled all the conditions for payment under Article 6(d) of Contracts Addendum No. 2 (see [5] above) and was therefore entitled to payment of a Fourth Instalment in respect of the construction of Hull No. X.11Foot Note 11×Award at para 4.2The Fourth Instalment amounted to US$13.9 million.12Foot Note 12×Award at para 4.4(b)The Plaintiffs, on the other hand, contended that they were not liable to pay the Defendant as the Defendant had failed to fulfill the conditions precedent necessary for liability on the part of the Plaintiffs to arise. The Plaintiffs further contended that the Defendant was itself in breach of its contractual obligations to complete and deliver Hull No. X to the 1st Plaintiff, and that this gave rise to a counterclaim against the Defendant.13Foot Note 13×Award at para 4.5(b) 13 Under Contract X (and specifically under Article 6(d) of Contracts Addendum No. 2), the Defendant was required to,inter alia,launch Hull No. X as one of the conditions to obtain payment of the Fourth Instalment.14Foot Note 14×Award at para 3.1It is undisputed that on 20 January 2015, the Defendant purported to launch Hull No. X into the water.15Foot Note 15×Award at paras 6.8–6.9(c)(i)On the same day, the 1st Plaintiffs’ project manager emailed the Defendant stating,inter alia, that they “[did] not consider the floating as launching”.16Foot Note 16×Award at para 6.9(c)(i)Whether that launch was proper or valid and whether prior approval had been given by the 1st Plaintiff for the launch (which was another condition under Article 6(d) of Contracts Addendum No. 2) were matters that were hotly contested in the Arbitration. On 7 February 2015, pursuant to Article 6(d) of Contracts Addendum No. 2, the Defendant issued an invoice for the Fourth Instalment.17Foot Note 17×Award at paras 3.2(i), 8.6 14 After the purported launch on 20 January, various meetings involving the parties’ representatives were held on 21 January, 7 April and 28 April 2015 (“Construction and Progress Meetings”). The purpose of the Construction and Progress Meetings was, among others, to iron out and update various outstanding items or deficiencies in the construction of Hull No. X that the 1st Plaintiff required the Defendant to remedy. These meetings were minuted and the minutes contained the following question - “Launching Condition: [Defendant] asked what items remaining to be considered Launching condition and not Floating condition?” Immediately under this question was a notation “Owner [1st Plaintiff] reply the following remaining items must be completed before can consider to be Launching condition”. The minutes then listed a number of items that the 1st Plaintiffs required the Defendant to complete. 15 Simply put, the abovementioned question in the meeting minutes contained under it a list of outstanding items or deficiencies that had to be rectified by the Defendant following the purported (and disputed) launch of Hull No. X on 20 January 2015.18Foot Note 18×Award at para 6.9(c)(ii)In the minutes of each of the Construction and Progress Meetings, the list was updated to reflect items that had been rectified and items that were still outstanding. This list would feature significantly, not just in the Arbitration, but as will be seen below, also in the Plaintiffs’ application in OS 1307/2019. 16 The minutes of the meeting held on 28 April 2015 were of particular importance. These minutes contained the notations “Undocking is planned for 3rd May” and “Undocking on 13:30, 3rd of May, 2015” after the list of items.19Foot Note 19×Award at para 6.9(c)(ii)In the Award, the Tribunal found that by that date (ie.28 April 2015), all outstanding items in the list had been resolved and the 1st Plaintiff had approved that Hull No. X was in launching condition (see [25] below). Hull No. X was undocked and launched a second time on 3 May 2015.20Foot Note 20×Award at para 6.13As I mentioned at [13], apart from physically launching Hull No. X, the prior approval of the 1st Plaintiff to launch Hull No. X was another condition that needed to be met under Article 6(d) of Contracts Addendum No. 2 before the Defendant would be entitled to payment of the Fourth Instalment. For completeness, under Article 6(d) of Contracts Addendum No. 2, in addition to the 1st Plaintiff’s prior approval, the prior approvals of the Defendant and the Classification Society of Hull No. X were also required for the launching of Hull No. X. 17 Following the second launch on 3 May 2015, the Defendant again demanded payment of the Fourth Instalment on 5 May 2015.21Foot Note 21×Award at para 8.6As payment was not forthcoming, the Defendant issued a default notice on 3 August 2016 pursuant to the terms of the X Guarantee requesting that the Plaintiffs pay the Fourth Instalment. Payment was still not forthcoming. That led to the Defendant commencing the Arbitration against the Plaintiffs.22Foot Note 22×Award at paras 3.2(i), 8.7–8.8The Defendant issued its Notice of Arbitration (“NOA”) on 26 September 2016.23Foot Note 23×Award at para 2.2 18 The 1st Plaintiff subsequently sought to terminate Contract X by a letter dated 27 October 2016, approximately a month after the Arbitration had been commenced. The 1st Plaintiff accused the Defendant of repudiatory breach of Contract X and purported to accept its repudiation.24Foot Note 24×Transcript (21 May 2018) at p 29 ln 9 to p 30 ln 3 (Affidavit of Cheng Huanmin at pp 577–578)In response to this, by its letter of 4 November 2016, the Defendant treated the 1st Plaintiff’s letter as itself a repudiation of Contract X by the 1st Plaintiff. The Defendant accepted the 1st Plaintiff’s repudiation as “bringing [Contract X] to an immediate end without prejudice to all [the Defendant’s] rights under the Contract and in law including [the Defendant’s] right to damages for wrongful repudiation”.25Foot Note 25×Award at para 9.8 19 Following the constitution of the Tribunal, the Arbitration progressed to an oral hearing which took place between 21 and 25 May 2018.26Foot Note 26×Award at para 2.23Both parties called factual and expert witnesses. After the conclusion of the oral hearing, the parties submitted to the Tribunal detailed written closing and reply submissions. 20 In the Arbitration, the Defendant’s case was that Hull No. X was launched on 20 January 2015 in accordance with Contract X. The 1st Plaintiff, having witnessed and not objected to the launch, was not entitled to claim that it did not approve it. Further, the 1st Plaintiff was not entitled to unreasonably withhold approval for the launch since the launch conditions had been met.27Foot Note 27×Award at para 6.2(c)(i)In any event, the Defendant had worked with the Plaintiffs to resolve the outstanding issues that the Plaintiffs had raised in relation to the launch, and these issues were resolved by the time of the second launch on 3 May 2015.28Foot Note 28×Award at paras 6.1(b) and 6.2(c)(vi)Accordingly, the Plaintiffs were liable to pay the Fourth Instalment.29Foot Note 29×Award at para 6.2(h) 21 As for the Plaintiffs, the essence of their case in the Arbitration was that Hull No. X had not been launched by the Defendant on 20 January 2015, 3 May 2015 or at all. Further, the Defendant, the 1st Plaintiff and the Classification Society of Hull No. X had not collectively approved the launch of Hull No. X.30Foot Note 30×Award at para. 6.3(c)Specifically, the 1st Plaintiff did not give its prior approval for the launch on 20 January 2015. Further, even if the Defendant had completed the outstanding works and launched Hull No. X in May 2015, the Defendant had still failed to request and obtain the 1st Plaintiffs’ prior consent or approval for that second launch.31Foot Note 31×Award at paras 6.3(d), 6.3(d)(vii)Therefore, the Plaintiffs were not obliged to pay the Fourth Instalment as the conditions precedent in Article 6(d) of Contracts Addendum No. 2 were never complied with by the Defendant. 22 Before delving into the finer details of the parties’ pleadings, submissions and their conduct of the Arbitration culminating in the Award which I cover later in these grounds, it would be useful at this point to set out briefly, as anaide memoire, the key issues the Tribunal considered in the Arbitration and its conclusions on those issues. 23 In the Award, the Tribunal set out 17 issues which it had to determine in relation to the claims for both Hull No. X and Hull No. Y, having regard to the parties’ Agreed List of Issues (the “ALOI”).32Foot Note 32×Award at para 4.7(1)–(17)Issues 1 to 3, which bear specific relevance to the Defendant’s Hull No. X claim and the Plaintiffs’ application in OS 1307/2019, are reproduced below:33Foot Note 33×Award at para 4.7(1)–(3) (1) In respect of [Contract X], what are the conditions that must be satisfied before [the Defendant] is entitled to payment of the Fourth Instalment in the sum of USD13.9 million pursuant to Article 6(d) of Contracts Addendum No. 2? [Issue 1]; (2) In respect of [Contract X], did [the Defendant] satisfy the conditions for payment of the Fourth Instalment in the sum of USD13.9 million pursuant to Article 6(d) of Contracts Addendum No. 2? [Issue 2]; (3) In respect of [Contract X], was there any valid reason for [the 1st Plaintiff] to withhold payment of the Fourth Instalment in the sum of USD13.9 million? [Issue 3]; 24 On Issue 1, the Tribunal found that one of the conditions that must be satisfied before the Defendant would be entitled to payment was for the Defendant, the 1st Plaintiff and the Classification Society of Hull No. X (namely, the American Bureau of Shipping or “ABS”) to collectively approve the launch of Hull No. X. The Tribunal came to this conclusion “in light of the clear wording of Article 6(4) of Contracts Addendum No. 2”.34Foot Note 34×Award at para 5.11 25 On Issue 2, the Tribunal found that the Defendant, the 1st Plaintiff and ABS had collectively given their approval for the launch of Hull No. X, with the 1st Plaintiff having given its approval on 28 April 2015 for the second launch on 3 May 2015.35Foot Note 35×Award at paras 6.9(a), (b), (c)The Tribunal found that the minutes of the Construction and Progress Meetings that took place on 7 and 28 April 2015 recorded that the Defendant had resolved all the remaining items in the list which the 1st Plaintiff required the Defendant to remedy before Hull No. X was considered to be in “Launching Condition”. The Tribunal also found that the minutes recorded the 1st Plaintiff’s clear acceptance that the outstanding requirements had been met. By its acceptance that the outstanding issues had been resolved, the Tribunal found that the 1st Plaintiff had also given its approval for the second launch.36Foot Note 36×Award at para 6.9(c)(ii) (at pp 260–261)Even if the minutes did not show that the 1st Plaintiff had given its approval for the launch of Hull No. X, the 1st Plaintiff would be treated as having approved it.37Foot Note 37×Award at para 6.9(c)(ii) (at pp 261–262) 26 In reaching the conclusions at [25] above, the Tribunal accepted the Defendant’s submission that it would have been unreasonable for the 1st Plaintiff to withhold approval for the launch after it had approved Hull No. X as being in “Launching Condition”.38Foot Note 38×Award at para 6.9(c)(ii) (at pp 261–262)The Tribunal made clear that its finding that the launch of Hull No. X was approved was based on the 1st Plaintiff having given its approval on 28 April 2015, and not based on any argument of estoppel.39Foot Note 39×Award at para 6.14 (at p 273)The Tribunal therefore found, in respect of Issue 2, that the Defendant had satisfied the conditions for payment of the Fourth Instalment. 27 Following from the Tribunal’s conclusions on Issues 1 and 2, the Tribunal found, on Issue 3, that there was no valid reason for the Plaintiffs to withhold payment of the Fourth Instalment.40Foot Note 40×Award at para 8.3Accordingly, the Tribunal ordered the Plaintiffs to pay the Defendant the sum of US$13.9 million including interest at the rate of seven percent per annum from 20 June 2015 to the date of full and final payment.41Foot Note 41×Award at para 22.6For completeness, the Tribunal also found that the 1st Plaintiff’s purported termination of Contract X (see [18] above) was wrongful and amounted to a  repudiation of Contract X,  entitling the  Defendant to  damages to be assessed.42Foot Note 42×Award at paras 9.8, 10.11",
        "The Stay Application": "",
        "Whether the Stay Application should have been granted": "28 Given the terms in which the Stay Application was crafted, I will first explain my decision on the Stay Application before moving on to the substantive issues in OS 1307/2019. 29 There are three possible permutations as far as the ambit of the Stay Application is concerned: the first being a stay pending the hearing of OS 1307/2019; the second being a stay between 6 February 2020 (the date on which I reserved my decision in OS 1307/2019) and the date on which I delivered my decision,ie.28 February 2020, and the third being to construe the Stay Application as one seeking a stay of execution pending thefinaldisposal of OS 1307/2019 (including any appeals therefrom). 30 The first permutation was rendered otiose by the time OS 1307/2019 was heard for the simple reason that the Stay Application first came up for hearing before me on 5 February 2020togetherwith the hearing of OS 1307/2019. At a pre-trial conference on 28 November 2019, both OS 1307/2019 and the Stay Application were (with the agreement of both parties’ counsel) fixed to be heard before me on the same day.43Foot Note 43×Minute Sheet of Pre-Trial Conference (28 November 2019) (HC/SUM 5816/2019)Thus, by the time OS 1307/2019 came to be heard by me on 5 February 2020, the entire basis, if any, of seeking a stay or adjournment of the Leave Order and/or Enforcement Orderspending the hearing of OS 1307/2019had disappeared. 31 As for the third possible permutation of the Stay Application, I did not read the Stay Application as being so wide as to encompass even a stay of execution pending appeal, as opposed to an application for a more limited interim stay until OS 1307/2019 was heard and determined by me. It is clear from the affidavit filed by the Plaintiffs in support of the Stay Application that they were only seeking a stay or adjournment of enforcement proceedings until OS 1307/2019 was heard and determined at first instance. The supporting affidavit stated that the Plaintiffs were seeking a “stay of the enforcement of the Final Partial Award and the execution of the judgments or Orders of Court…pending the hearing of the [Plaintiffs’] setting aside application,which has been fixedby the Court tentatively on 18 February 2020 at 10.00 am” (emphasis added).44Foot Note 44×Affidavit of Svein Nodland (HC/OS 1124/2019) at para 9The affidavit then went on to state as follows: 10. I wish to highlight to this Honourable Court the necessity for the [Plaintiffs’] stay application to be heard urgently and humbly pray for the Honourable Court to suspend and/or stay the [Defendant’s] enforcement proceedings and the execution of judgment or Orders of Court,pending the hearing ofthe [Plaintiffs’] setting aside application. 11. I wish to state that in the event the stay of the [Defendant’s] enforcement proceedings is not grantedor determined laterat the hearing of the[Plaintiffs’] setting aside application, it would inevitably render the outcome of the application to set aside nugatory. Therefore, I verily believe that there is a significant risk that the [Plaintiffs’] application to set aside the Final Partial Award, which I wish to highlight that it is the [Plaintiffs’], as a party to the arbitration, only exclusive right of recourse against an arbitration award by applying to the High Court to set it aside, would otherwise be rendered nugatory.  [emphasis added] 32 Further, in its written submissions, the Defendant contended that the Plaintiffs had “not made any application for a stay of execution pending appeal”; this contention was not challenged or objected to by the Plaintiffs during the course of the hearing before me.45Foot Note 45×Defendant’s Submissions at para 82In fact, Mr Singh for the Plaintiffs did not advance any submissions, following my dismissal of OS 1307/2019 on 28 February 2020, seeking a stay of the Leave Order and/or Enforcement Orders pending any appeal by the Plaintiffs. 33 In the circumstances, given the Plaintiffs’ clear intention that the orders applied for in the Stay Application were intended to be interim ones pending the hearing and disposal of OS 1307/2019 by me at first instance, there is, in my view, no basis on which to construe the application more widely than what is evinced from the Plaintiffs’ supporting affidavit or counsel’s submissions made during the hearing. 34 This then leaves the second permutation of the Stay Application,ie,whether a stay should have been granted between 6 February 2020 and 28 February 2020. The Defendant relied on its written submissions and, unsurprisingly, objected to the Stay Application.46Foot Note 46×Minute Sheet (6 February 2020) at p 15In its submissions, the Defendant cited the legal principles relating to a stay of execution of a judgment or order pending appeal and submitted, by analogy, that there were no special circumstances in this case which indicated that the Plaintiffs’ application in OS 1307/2019 would be rendered nugatory by a refusal of the Stay Application.47Foot Note 47×Defendant’s Submissions at pp 45–50 35 The legal principles governing a stay of execution pending appeal have been pithily summarised by Justice Quentin Loh inStrandoreInvest A/S and others v Soh Kim Wat[2010] SGHC 174 (“Strandore Invest”) at [7], referencing the Court of Appeal’s decision inLian Soon Construction Pte Ltd v Guan Qian Realty Pte Ltd[1999] 1 SLR(R) 1053 (“Lian Soon Construction”), as follows: (a) While the court has the power to grant a stay, and this is entirely at the discretion of the court, the discretion must be exercised judicially,ie,in accordance with well-established principles. (b) The first principle is that, as a general proposition, the court does not deprive a successful litigant of the fruits of his litigation, and lock up funds to which he isprima facieentitled, pending an appeal. There is no difference whether the judgment appealed against was made on a summary basis or after a full trial. (c) This is balanced by the second principle. When a party is exercising his undoubted right of appeal, the court ought to see that the appeal, if successful, is not nugatory. Thus a stay will be granted if it can be shown by affidavit that, if the damages and costs are paid, there is no reasonable probability of getting them back if the appeal succeeds. (d) The third principle follows, and is an elaboration of the second principle, that an appellant must show special circumstances before the court will grant a stay. 36 InStrandoreInvest, Loh Jelaborated on the abovementioned principles in the following terms (at [7]): All other rules follow and are derived from the application of these three principles to the individual circumstances and facts of each case. For example, the likelihood of success is not by itself sufficient, and a bald assertion of the likelihood of success in an affidavit is inadequate. Otherwise, a stay would be granted in every case because every appellant must expect that his appeal will succeed. Finally, it is neither possible, nor desirable, to give a catalogue of all the circumstances that would qualify to be considered as special. The court in every case will have to examine the facts to see if special circumstances justifying the grant of a stay of execution exist based upon the application of the three principles. 37 InStrandoreInvest, the respondent applied for a stay of execution pending its appeal against the High Court’s decision to grant the applicants leave to enforce a foreign arbitral award.Lian Soon Constructioninvolved an application for a stay of execution pending an appeal against the lower court’s decision to grant summary judgment. Neither case involved a stay on terms similar to the Stay Application. 38 What, then, are the principles that should be applied when the court considers an application by an award debtor to (a) temporarily stay an order granting leave to the award creditor to enforce the award in its favour and/or (b) stay the various enforcement proceedings prosecuted by the award creditor, pending the court hearing and disposing of the award debtor’s setting aside application? 39 In my view, conceptually, it is logical that the principles governing applications for stay of execution of judgments or orders pending appeal should also generally be applicable to the more limited type of stay application mentioned at [38] above. In substance, similar considerations arise in both situations: the court seeks, on the one hand, to balance the interests of a successful judgment (or award) creditor in enjoying the fruits of its litigation (or arbitration as the case may be), and on the other, the interests of a judgment (or award) debtor such that the appeal (or setting aside application), if successful, is not rendered nugatory. 40 The High Court inMan Diesel Turbo SE v IM Skaugen Marine Services Pte Ltd[2019] 4 SLR 537 (“Man Diesel Turbo”) alluded to this similarity in the applicable legal principles. InMan Diesel Turbo,Man Diesel Turbo obtained leave of the Singapore High Courtexparteto enforce an arbitral award issued in arbitration proceedings prosecuted in Denmark. IM Skaugen sought to challenge the enforcement of the award and sought, as an alternative prayer, to adjourn enforcement of the award pending the determination of its application to set aside the award which had been filed in the Danish courts. The High Court stated at [37] in relation to s 31(5) of the Act (which applies to enforcement of a foreign award) that: … Significantly, after a judgment on the foreign award is affirmed, the enforcing court has no power to adjourn under s 31(5)(a).After entry of judgment, the judgment is much like any other judgment rendered by the court and the plaintiff would seek an execution order.The other party seeking a stay of the execution order would have to turn to the procedural principles of stay of execution of a civil judgment.[emphasis added] 41 AlthoughMan Diesel Turbowas a case concerning enforcement of a foreign award, the procedure to enforce a foreign award is largely the same as that which applies to domestic international awards (seeArbitration in Singapore: A Practical Guide(Sundaresh Menon CJet al) (Sweet & Maxwell, 2nd ed, 2018) at para 14.042). Section 19 of the Act provides that “an award on an arbitration agreement may, by leave of the High Court or a Judge thereof, be enforced in the same manner as a judgment or an order to the same effect and, where leave is so given, judgment may be entered in terms of the award”. 42 Reverting to the facts of this case, as the Plaintiffs did not, in OS 1124/2019, apply to set aside the Leave Order, it became final after 14 days following service of the Leave Order upon the Plaintiffs.48Foot Note 48×Notice under Order 69A, Rule 6 of the ROC in HC/ORC 6180/2019In my view, the legal principles that apply when a stay of execution of a judgment or order is sought pending appeal would, therefore, also apply to the Stay Application. 43 My conclusion at [42] above finds support in the Hong Kong decision ofIsrael Sorin (Izzy)Shohat v Balram Chainrai[2017] 6 HKC 174. The Hong Kong Court of First Instance held that the court had the discretion to grant a stay of an enforcement order, which enabled an arbitral award to be enforced in Hong Kong in the same manner as a judgment of the court (at [14]). The arbitral award would be given the same effect as a judgment, and the enforcement of the award would therefore be “subject to the same regime governing the stay of execution of an ordinary judgment” (at [16]). 44 A similar analysis was adopted by the English High Court inBSG Resources Ltd v Vale SA and others[2019] EWHC 2456 (Comm) (“BSG Resources”). InBSG Resources, an order was granted to Vale SA by the English High Court under section 66 of the Arbitration Act 1996 (c 23) (UK) for leave to enforce an arbitral award. Subsequently, BSG Resources applied to challenge the award. Prior to the hearing of the challenge application, BSG Resources applied,interalia, to stay enforcement of the award. The court held that it had the power to grant a stay of enforcement, and considered that there were two lines of case authorities setting out the principles which a court could take into account in exercising its discretion to grant a stay. In that particular case, either set of principles would lead to the same outcome (at [54] and [55]). 45 The first line of authority was found inFar East Shipping v AKPSovcomflot[1995] 1 Lloyd’s Rep 520 (which was also cited inStrandoreInvest([35]supra) at [16]). In that case, Potter J noted that, having elected to convert an award into an English judgment, the plaintiff ought in principle to be subject to the same procedural rules and conditions as generally apply to the enforcement of such judgments (seeBSG Resourcesat [50]). The second line of authority was found inSocadecSA v Pan Afric Impex Co[2003] EWHC 2086 (Comm) (“Socadec”), where the English court held that the principles which a judge should apply were (a) firstly, the strength of the argument that the award was invalid, assessed on a “brief consideration” and not a mini trial; and (b) secondly, the ease or difficulty of the enforcement of the award and whether if enforcement was withheld or delayed it could become more difficult by the movement of assets, problems of trading, disappearance of the defendant (seeBSG Resourcesat [52]). 46 In light of the authorities referred to above, I am of the view that once the Leave Order was made final, any application for a stay of execution of that order (and of any enforcement proceedings flowing from that order) would be subject to the same legal principles as those which govern an application to stay the execution of a court judgment or order pending appeal. In substance, the various prayers in the Stay Application seek to achieve the same overarching outcome,ie.to stay the enforcement of the Award which the Defendant could now enforce by virtue of the Leave Order granted to it.  Finally, as the court has a discretion and should consider all relevant circumstances in an application of this nature, the factors set out atSocadecare also, in my opinion, useful and relevant factors that should be thrown into the mix. Those factors can be comfortably considered within the framework set out inStrandoreInvest. 47 Returning to the case at hand, the Defendant pointed out that the following factors militated against the grant of a stay. First, there was no evidence that the Defendant would be unable to return the monies paid to it under the Award. On the contrary, the Defendant was a shipyard of means. Second, the Plaintiffs have displayed conduct that showed its attempts to delay and frustrate the enforcement of the Award. This included the fact that the 2nd and 3rd Plaintiffs had not paid the sums awarded to the Defendant under that part of the Award concerning the Contract Y claim which was not being challenged. Third, there were no special circumstances present to justify granting a stay. 48 As for the Plaintiffs, their supporting affidavit contained a bare assertion that if a stay was refused prior to the disposal of OS 1307/2019 or if the Stay Application was only to be heard at the same time as OS 1307/2019, it would render a successful outcome in OS 1307/2019 nugatory (see [31] above).49Foot Note 49×Affidavit of Svein Nodland (HC/OS 1124/2019) at para 11The Plaintiffs also stated in their affidavit that their application to set aside the Award had a reasonable prospect of success, and that a stay would not be prejudicial to the Defendant as it could proceed with the enforcement proceedings after the determination or disposal of the Setting Aside Application.50Foot Note 50×Affidavit of Svein Nodland (HC/OS 1124/2019) at paras 12–13 49 Applying the principles at [46] above and considering the circumstances of this case, I did not find any basis on which to allow even the second permutation of the Stay Application. 50 First, as submitted by the Defendant, the Defendant was a shipyard of means and there is no evidence that the Defendant would be unable to repay any amount paid to it under the Award should the Plaintiffs prevail in OS 1307/2019. This was not challenged by the Plaintiffs. Second, even on a brief assessment of the Plaintiffs’ application in OS 1307/2019, it could not be said that the Plaintiffs’ case was of such merit that a temporary stay of enforcement should be granted. 51 Finally, there were no special circumstances that militated in favour of granting such a stay. In fact, no evidence was adduced by the Plaintiffs of any special circumstances. 52 As for the order granted for the examination of the Plaintiffs’ officers, as at 5 February 2020, it had not yet been served on a director of the Plaintiffs.51Foot Note 51×Minute Sheet (5 February 2020) at p 5; HC/ORC 1145/2020 in HC/SUM 680/2020; 4th Affidavit of Cheng Huanmin (HC/SUM 680/2020)On 16 February 2020, the Defendant obtained an order for substituted service52Foot Note 52×HC/ORC 1145/2020 in HC/SUM 680/2020of the order for examination of the Plaintiffs’ officers as the Defendant had been unable to effect personal service on a director of the Plaintiffs. As for the garnishee proceedings, during the hearing before me on 5 February, I was informed by Mr Chia that the Defendant would be withdrawing the garnishee proceedings as the garnishee had confirmed that there were no monies in the garnished account.53Foot Note 53×Minute Sheet (5 February 2020) at p 5 53 Finally, as highlighted at [30] above, the Plaintiffs had agreed for the Stay Application and OS 1307/2019 to be heard together. The Plaintiffs did not request for the hearing of the Stay Application to be brought forward and heard before the hearing of OS 1307/2019. This was, in my view, indicative that there was little merit in the Stay Application and that it had been filed merely as a tactical move to try and stall the enforcement proceedings instituted by the Defendant. For the foregoing reasons, I dismissed the Stay Application. 54 I now turn to OS 1307/2019.",
        "OS 1307/2019 - The Setting Aside Application": "55 As summarised at [10] above, the Plaintiffs applied to set aside the Award on two grounds: first, that the Award was made in excess of the Tribunal’s jurisdiction, and second, that it was made in breach of the Plaintiffs’ right to present its case and/or in breach of the rules of natural justice.54Foot Note 54×1st Affidavit of Svein Nodland at para 35I shall address each of these grounds in turn.",
        "Preliminary Issue - Time Limit for making the application": "56 The Defendant initially asserted that the Plaintiffs had filed OS 1307/2019 out of time.55Foot Note 55×Affidavit of Cheng Huanmin at para 19This was incorrect. 57 It is common ground that the parties received the Award on 16 August 2019.56Foot Note 56×Plaintiff’s Submissions at para 12As stipulated in Article 34(3) of Sch 1 to the Act and O 69A r 2(4) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”), any application to set aside an award must be filed (barring any request made under Article 33 for an award to be corrected) within three months after the parties receive the award. OS 1307/2019 was filed by the Plaintiffs on 18 October 2019, well before the three-month time limit expired. 58 I would also mention briefly that while the Plaintiffs’ supporting affidavit made a passing reference to the Plaintiffs also seeking to set aside the Leave Order,57Foot Note 57×1st Affidavit of Svein Nodland at para 6no such order was sought in OS 1307/2019 or OS 1124/2019. Nor were any submissions advanced by the Plaintiffs in this regard. As explained at [42] above, the Leave Order became final after the expiry of 14 days following its service on the Defendant.",
        "Did the Tribunal act in excess of its jurisdiction and determine matters that were outside the scope of submission to arbitration?": "Legal Principles 59 When a party seeks to challenge an arbitral award on the ground that the award (or part thereof) determined matters that were not within the scope of submission to arbitration, as noted inSuiSouthern Gas Co Ltd v Habibullah Coastal Power Co (Pte) Ltd[2010] 3 SLR 1 at [34], the task of the court is to ascertain: (a) the matters which were within the scope of submission to the arbitral tribunal; and (b) whether the arbitral award (or the part being impugned) involved such matters, or whether it was a “new difference” which would have been “irrelevant to the issues requiring determination” by the arbitral tribunal. 60 InPT Prima International Development v Kempinski Hotels SA and other appeals[2012] 4 SLR 98 (“PT Prima”), the Court of Appeal explained that the “role of pleadings in arbitral proceedings is to provide a convenient way for the parties to define the jurisdiction of the arbitrator by setting out the precise nature and scope of the disputes in respect of which they seek the arbitrator’s adjudication” (at [33]).  The Court of Appeal also noted, at [34], that in order to determine whether an arbitral tribunal had jurisdiction to adjudicate on and render an award on a particular dispute, “it is necessary to refer to the pleaded case of each party to the arbitration and the issues of law and fact that are raised in the pleadings to see whether they encompass that dispute.” 61 In addition to the pleadings of the parties, the court may also refer to the list of issues agreed by the parties, as a reference point for determining what issues or matters were within the scope of submission (see for example,GDMidea Air Conditioning Equipment Co Ltd v Tornado Consumer Goods Ltd and another matter[2018] 4 SLR 271 at [43]). Application and analysis 62 The Plaintiffs submitted that the Tribunal had exceeded its jurisdiction in finding that the 1st Plaintiff had, on 28 April 2015, approved the launch of Hull No. X thereby fulfilling that condition precedent that the Defendant needed to fulfill prior to the (second) launch on 3 May 2015.58Foot Note 58×Plaintiffs’ Written Submissions at para 65The Plaintiffs contended that this was not the Defendant’s pleaded case in the Arbitration. The Plaintiffs submitted that, based on the NOA and the Defendant’s Statement of Claim, the Defendant’s pleaded case was that the launch had taken place on 20 January 2015. It did not mention any other event or launch date.59Foot Note 59×Plaintiffs’ Written Submissions at para 48It was also contended by the Plaintiffs that the Tribunal, in arriving at its conclusion that the condition precedent for the launch had been met, in effect found that the 1st Plaintiff had given its approval on 28 April 2015 for the launch of Hull No. X and then transposed that approval as retrospective consent to the earlier launch that had taken place on 20 January 2015.60Foot Note 60×Minute Sheet (5 February 2020) at pp 5–6This, according to the Plaintiffs, was not the Defendant’s case in the arbitration, was not a case that the Plaintiffs were asked to meet and was not an issue placed before the Tribunal for determination.61Foot Note 61×Minute Sheet (5 February 2020) at p 5 63 The Defendant, on the other hand, submitted that the Tribunal’s decision was clearly within the scope of submission. The parties had placed the issue of whether the Defendant was entitled to payment of the Fourth Instalment before the Tribunal. In order to determine this issue, the Tribunal necessarily had to consider the defence put forth by the Plaintiffs, namely,whether the Defendant had satisfied the conditions for payment of the Fourth Instalment pursuant to Article 6(d) of Contracts Addendum No. 2. As one of the conditions required the 1st Plaintiff to have approved the launch of Hull No. X (be it the first launch on 20 January 2015 or the second launch on 3 May 2015), the Tribunal’s finding on when the launch was approved was within the scope of submission.62Foot Note 62×Defendant’s Written Submissions at paras 43–44The Defendant further argued that the parties had addressed the issue of whether approval for the launch was given by the 1st Plaintiff on 28 April 2015 in their pleadings, written witness statements and submissions. Finally, the Defendant contended that the Tribunal’s finding could not be “irrelevant to the issues requiring determination”, since both parties had addressed the Tribunal on the relevance of the meeting held on 28 April 2015 and had led evidence on it.63Foot Note 63×Defendant’s Written Submissions at para 46 64 I have carefully considered the record in the Arbitration that was put into evidence in OS 1307/2019, including the parties’ pleadings and the ALOI. I am satisfied that the Tribunal did act within the scope of submission and the Award rendered by it did not exceed its jurisdiction. I say this for a number of reasons set out below. (1) The NOA and Pleadings 65 First, taking the NOA and the pleadings collectively, whether Hull No. X was launched and whether approval for the launch of Hull No. X was given by the 1st Plaintiff were issues squarely before the Tribunal and which it could (indeed, had to) consider. In this regard, I accept that based purely on the NOA and the Statement of Claim, it would appear that the Defendant’s claim was premised only on the first launch that took place on 20 January 2015.64Foot Note 64×Notice of Arbitration at paras 17–23; Statement of Claim at paras 48–50However, the examination does not end there. As submitted by Mr Chia for the Defendant, the pleadings did evolve as the proceedings developed such that the Plaintiffs were put on notice of the Defendant’s position that all conditions precedent, including the approval of the 1st Plaintiffs, were met prior to the second launch on 3 May 2015.65Foot Note 65×Minute Sheet (5 February 2020) at p 14; Minute Sheet (6 February 2020) at pp 2–3When all of the pleadings are considered compendiously, both parties were, in my view, aware that the issue of whether approval had been given by the 1st Plaintiff prior to and for the second launch on 3 May 2015 was in play. I elaborate below and start with the Plaintiff’s Statement of Defence and Counterclaim (“SDC”). 66 As early as the SDC, the Plaintiffs themselves had already made various references toboththe first and second launches and denied that the 1st Plaintiff had given its approval toeitherlaunch. This was despite the fact that in the Statement of Claim, the Defendant had only pleaded thefirstlaunch as part of its case on compliance with the conditions precedent in Article 6(d) of Contracts Addendum No. 2. This was, to my mind, a clear indication that the Plaintiffs were, from very early on, alive to the relevance of the second launch and the Construction and Progress Meetings that preceded it. Indeed, it appeared to me that the Plaintiffs were seeking to pre-empt the Defendant. I reproduce the relevant parts of the SDC below: 48. It is important to emphasize the terms relating to payment of the fourth instalment by [the 1st Plaintiff]. Article 5 of the Contracts Addendum No. 2 provided that the fourth instalment shall be paid upon launch and upon receipt of invoice issued by the [Defendant]. However, more importantly, it was further provided that the launch was subject to the [Defendant’s] compliance with [Contract X] with regards to the quality of workmanship and system, and the prior approval by CLASS, [the  1st Plaintiff], and the [Defendant]collectively.No approval was granted by [the 1st Plaintiff] on 20 January 2015, or at all.In the premises, [the 1st Plaintiff] did not become and is not liable to the [Defendant] for the alleged sum of US$13.9 million. … 50.Prior to the alleged 1st Launch, and on 20 January 2015 itself, being the date of the alleged launch, [the 1st Plaintiff] had made it known to the [Defendant] that [the 1st Plaintiff] did not agree and/or consider [Hull No. X] to be ready for the launch.It is and was therefore [the 1st Plaintiff’s] position that the [Defendant] did not launch [Hull No. X] in accordance with the terms of [Contract X] on 20 January 2015, or at allto quantify for the fourth instalment, being 10% of the contract price. … 53. The [Defendant] had agreed to make the necessary modifications and/or rectifications to [Hull No. X],andhad subsequently arranged for a launch to take place on 3 May 2015 (the “2nd Launch”)[RBOD Vol 2 Page 481]. 54.Despite the [Defendant’s]attempt at the 2nd Launch, [the 1st Plaintiff] was still not satisfied with the quality and workmanship of the construction of [Hull No. X], and still did not consider the launch to have been effectively carried out. Numerous Non-Conformance Reports and Punch Lists were still outstanding, and the defects had not been rectified by the [Defendant] as at 20 January 2015 and/or 3 May 2015, or at all.It was therefore unacceptable for the [Defendant] to proceed for the launch of [Hull No. X], and inconceivable for the [Defendant] to believe that [the 1st Plaintiff] agreed to the same. 55.  Given that the Contracts Addendum No. 2 clearly stipulates that payment of the fourth instalment is subject to the quality of workmanship and system being in conformance with [Contract No. X], and the approval by CLASS, [the 1st Plaintiff] and the [Defendant]collectivelycoupled with the fact that [the 1st Plaintiff] had refused to consider the [Hull No. X]as being launched on 20 January 2015, 3 May 2015, or at all,it is evident that [the 1st Plaintiff] is not obliged to make payment for the fourth instalment, and any demand made for the same by the [Defendant] was baseless. The [Defendant’s] assertion that the launch was confirmed by American Bureau of Shipping (ABS), on 20 January 2015 is and was flawed as the [Defendant] themselves was aware that the launch on 20 January 2015 was improper and not in accordance with the General Specifications and/or terms of [Contract X],as they had attempted to carry out the necessary modifications to rectify the defects, and had attempted to perform a second launch on 3 May 2015.If they had truly considered [the 1st Plaintiff] to be bound by the alleged 1st Launch on 20 January 2015, the [Defendant] would not have taken steps to rectify the defects found and/or made steps to prepare for the 2nd Launch. 56. The [Defendant] did not launch [Hull No. X] in accordance with the terms of [Contract X], which required the consent of [the 1st Plaintiff],on 20 January 2015 or at allto qualify for the fourth instalment, being 10% of the contract price. It was a clear contingent precedent that was not met by the [Defendant] and for this reason alone, their claim should be dismissed. It also bears mentioning that incredulously the [Defendant] failed to paint [Hull No. X] in accordance with the General Specifications before launching; its bare steel hull was launched into water. This, amongst other factors, rendered [Hull No. X] unfit for launch at the time. [emphasis in original in bold, emphasis added in italics] 67 From the paragraphs in the SDC quoted above, it was apparent that the Plaintiffs themselves were alive, at a very early stage in the Arbitration, to the relevance and significance of the Construction and Progress Meetings following the first launch on 20 January 2015, and of the second launch on 3 May 2015. In proactively addressing those issues in the SDC, the Plaintiffs were, in my judgment, clearly aware that they were very much a central part of the dispute. By their own pleadings, the Plaintiffs had placed these issues in the arena. Therefore, based on just the SDC, it was clear to me that those issues were before the Tribunal and would need to be considered and decided by it. 68 I next considered the Defendant’s Statement of Reply and Defence to Counterclaim (“SRDC”). In the SRDC, the Defendant pleaded that the launch of Hull No. X had been successfully completed on 20 January 2015, and in any event, the Defendant had resolved all outstanding issues in relation to the launch by May 2015.66Foot Note 66×Statement of Reply and Defence to Counterclaim at p 11The Defendant specifically referred to 28 April 2015 as the date on which parties had come to an understanding that all outstanding issues had been resolved67Foot Note 67×Statement of Reply and Defence to Counterclaim at para 15and referenced the minutes of the Construction and Progress Meetings in support of its contention.68Foot Note 68×Statement of Reply and Defence to Counterclaim at pp 7–11The Defendant’s position was thus also placed before the Tribunal during the arbitral proceedings, and it was within the Tribunal’s jurisdiction to make a finding on that position. 69 Finally, the Plaintiffs’ Rejoinder was a further indicator that they were aware of the Defendant’s position on the Construction and Progress Meetings and the second launch. I reproduce below the relevant paragraphs of the Rejoinder that demonstrate this: 70. The [Defendant]’s understanding that by 28 April 2015, parties had reached an understanding that all outstanding issues related to [Hull No. X]’s launch were resolved, and that they managed to resolve the outstanding issues highlighted by [the 1st Plaintiff] in relation to [Hull No. X]’s launch meant that they were entitled to payment of the 4th instalment is entirely misconceived. The [Plaintiffs] had at no point in time, limited the launch to the outstanding issues raised and expounded in paragraph 68 above, for the reasons set out below. The [Defendant] is here attempting to re-write the terms of the launch as agreed. … 76. In any event, it was merely agreed from a technical perspective that the following outstanding issues raised were to be completed prior to [Hull No. X] being considered [sic]launching condition, instead offloating condition. There was no agreement and/or understanding reached between the technical teams at the meeting that [Hull No. X]would be validly launched after the outstanding issues were resolved.The project managers who had attended the meetings, had at no point in time ever represented that the launch would be successful, and/or that the [Defendant] would obtain the [Plaintiffs’] approval after the outstanding issues raised at the meeting on 21 January 2015 were closed. The minutes of meeting merely provided that the remaining items must be completed prior to [Hull No. X] being considered to be in a “launching condition”. In no way did the [Plaintiffs’] Supervisors and/or the [Plaintiffs] agree that [Hull No. X] was in fact to be considered launched once aforesaid defects had been rectified or closed. The [Defendant’s] understanding was and is clearly misconceived. 77. In addition, the simple fact of the matter remains that the [Defendant] had not, as at the date of the repudiation of the Contract, obtained the [Plaintiffs’] prior approval for the launch of [Hull No. X], and/or met the conditions precedents set out in Article 6(d) of Contracts Addendum No. 2. … [emphasis in original in italics, emphasis added in bold] 70 As can be seen from the paragraphs quoted above, the Plaintiffs sought to undermine the importance of the Construction and Progress Meetings. The Plaintiffs argued that they had not limited their withholding of approval for the launch to only the outstanding issues stated in the meeting minutes. They also contended that the meeting on 28 April 2015 was merely a technical one (as opposed to a meeting attended by representatives with authority to make binding representations) such that any decisions or agreements reached at that meeting were not binding on the Plaintiffs.69Foot Note 69×Rejoinder at paras 70–76The Plaintiffs specifically referred to the Defendant’s secondary position in the Rejoinder and declared it as “misconceived”. In particular, the Plaintiffs expressly rejoined that there was “no agreement and/or understanding reached between the technical teams at the meeting that [Hull No. X]would be validly launched after the outstanding issues were resolved.”70Foot Note 70×Rejoinder at para 76The use of the words “would be validly launched” was a reference to a future event, namely, the second launch which eventually took place on 3 May 2015. 71 Before me, the Plaintiffs asserted that the Defendant’s casewas advanced solely on the basis that the launch of Hull No. X had taken place on 20 January 2015, and that any reliance the Defendant placed on the undocking and second launch on 3 May 2015 was only in support of its argument that the Plaintiffs wereestoppedfrom withholding consent to the launch.71Foot Note 71×Minute Sheet (5 February 2020) at pp 8–9 72 The Defendant’s alternative case, on a strict reading of its pleadings, did appear to be one based on estoppel. However, this did not, in my view, detract from its consistent position within its alternative case, namely, that all the conditions precedent for launching Hull No. X had been met by 28 April 2015 prior to the second launch on 3 May 2015 and that it was, thereafter, entitled to payment of the Fourth Instalment.72Foot Note 72×See, eg, Defendant’s Closing Submissions at para 137.4 (Affidavit of Svein Nodland at p 471)The SRDC stated this position. 73 Further, from the SDC and Rejoinder which I have referred to above, the Plaintiffs were undoubtedly alive, not just to the relevance of the meeting on 28 April 2015 and the second launch on 3 May 2015, but to their contractual relevance as conditions precedent to be met by the Defendant under Article 6(d) of Contracts Addendum No. 2. Thus, by the time the parties had servedallof their pleadings, the battle lines in relation to both the first and second launches and the Construction and Progress Meetings had been clearly drawn. Therefore, the Tribunal was in a position, legitimately, to decide whether the conditions precedent in Article 6(d) of Contracts Addendum No. 2 were met prior to the second launch of Hull No. X on 3 May 2015. 74 Considering all of the pleadings submitted by the parties in the Arbitration compendiously, the Tribunal did, in my judgment, act within the scope of submission and did not exceed its jurisdiction in the Award. (2) The ALOI 75 My conclusion at [74] above based on the parties’ pleadings was fortified when I considered the ALOI. On a plain reading of the ALOIincludingthe sub-issues as framed by the parties, whether the 1st Plaintiff had approved the launch on or by 28 April 2015 and whether the Defendant had launched Hull No. X on 20 January 2015, 3 May 2015 or at all were issues which were clearly placed before the Tribunal by the parties. 76 The first overarching issue in the ALOI was for the Tribunal to determine what conditions had to be satisfied before the Defendant would be entitled to payment of the Fourth Instalment pursuant to Article 6(d) of Contracts Addendum No. 2 (see [23] above). 77 In response to the first overarching issue, the Plaintiffs and Defendant set out their respective positions as sub-issues in the ALOI. Among the sub-issues to be considered under this overarching issue, the Plaintiffs stated,inter alia, (i) that the Defendant had to launch Hull No. X and (ii) that the 1st Plaintiff, the Defendant and the Classification Society (ABS) had to collectively approve the launch.73Foot Note 73×Agreed List of Issues at p 2 78 The second overarching issue in the ALOI was whether the Defendant had satisfied the conditions necessary for payment.74Foot Note 74×Agreed List of Issues at p 3On this issue, the parties again stated their respective positions as sub-issues in the ALOI. It would be apposite to set out here the relevant parts of the parties’ respective positions: 2(a)  The [Defendant] takes the position that the [Defendant] satisfied the conditions necessary for payment of US$13.9 million because: (i) The [Defendant] procured a “Refund Guarantee” for 10% of the Contract Price of [Hull No. X] on 29 April 2015; (ii) The [Defendant] launched [Hull No. X] on 20 January 2015; (iii) The timing of the launch of [Hull No. X] was in line with the delivery schedule agreed between the [Defendant] and [the 1st Plaintiff]; and (iv) The Classification Society (“ABS”) released a statement certifying the launch of [Hull No. X]. (b) The [Plaintiffs] take the position that the [Defendant] did not satisfy the conditions necessary for payment of US$13.9 million because: … (iii) The [Defendant], [the 1st Plaintiff] and the Classification Society had not collectively approved the launch of [Hull No. X]. In particular, the [Defendant] had not obtained [the 1st Plaintiff’s] approval for the launch of [Hull No. X]. It is in fact not in dispute that the [Defendant] did not obtain the approval of the [Plaintiffs] to launch; (iv) The [Defendant] did not launch [Hull No. X] on 20 January 2015, or 3 May 2015, or at all. … 79 The third overarching issue in the ALOI was whether there was any valid reason for the 1st Plaintiff to withhold payment of the Fourth Instalment. The Plaintiffs’ position in response to this issue (which was, again, set out as a sub-issue in the ALOI) was that the Defendant was not entitled to payment because, among other reasons, the Defendant had not obtained the 1st Plaintiff’s approval for the launch of Hull No. X and failed “to launch [Hull No. X] on 20 January 2015, or 3 May 2015, or at all”.75Foot Note 75×ALOI at para(3)(b)(iii)–(iv) 80 In my view, based on the ALOI and the sub-issues enumerated by the parties under Issues 1, 2 and 3, whether Hull No. X was launched on 20 January 2015 or on 3 May 2015 and whether,prior to each of these launchdates, the 1st Plaintiff’s approval had been obtained were clearly placed by the parties as issues to be decided by the Tribunal. Therefore, the Tribunal’s finding that on 28 April 2015, the 1st Plaintiff had approved the second launch cannot be said to be new, irrelevant or outside the scope of submission.  Similarly, whether Hull No. X was or was not launched with the 1st Plaintiff’s approval on 20 January 2015 or 3 May 2015 was also not a new or irrelevant issue and did not fall outside the scope of submission either. Conclusion on the scope of submission objection 81 In the circumstances, having considered all the pleadings filed by both parties in the Arbitration (followingPT Prima([60]supra) at [33]–[34]) and the ALOI (followingGDMidea([61]supra) at [43]), I found that the Tribunal was acting well within the scope of submission to arbitration. In rendering the Award following its findings in the Defendant’s favour on Issues 2 and 3 (see [23]–[27] above), the Tribunal did not, in my judgment, exceed its jurisdiction. 82 In addition, I was also of the view that there was in any event no prejudice suffered by the Plaintiffs as they had ample notice of all of the issues that were in the arena, at the latest, prior to the commencement of the oral hearing (seePT Prima([60]supra) at [51]). For the foregoing reasons, there was, in my judgment, no basis for the Award to be set aside pursuant to Article 34(2)(a)(iii) of the Model Law. I dismissed this ground of the Plaintiffs’ application accordingly.",
        "Was there any breach of the Defendant’s right to present its case and/or a breach of natural justice?": "Legal Principles 83 I start with a summary of the relevant legal principles. 84   It is a well-entrenched principle in our arbitration jurisprudence that any party seeking to challenge an arbitral award on the ground that there has been a breach of natural justice must establish the following (LW Infrastructure Pte Ltd v Lim Chin San Contractors Pte Ltd[2013] 1 SLR 125 (“LW Infrastructure”) at [48], affirmingSohBeng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007] 3 SLR(R) 86 (“SohBeng Tee”) at [29]): (a) which rule of natural justice has been breached; (b) how it was breached; (c) in what way the breach was connected to the making of the award; and (d) how the breach prejudiced the rights of the challenging party. 85 A complaint that there has been a breach of natural justice comprises, broadly, two facets. The first is that an arbitral tribunal was biased against a party thereby contravening the rule of equality of treatment of the parties. The second facet is commonly referred to as the fair hearing rule, encapsulated in the well-known Latin maximaudialteram partem. When the fair hearing rule is invoked, the aggrieved party’s complaint is that it was not given a fair or reasonable opportunity to be heard or to otherwise present its case. The fair hearing rule forms the second ground of objection relied on by the Plaintiffs in this case. 86  In relation to the fair hearing rule, the Court of Appeal, in its oft-cited decision inSohBeng Tee, held that parties have, in general, a right to be heard and an arbitrator “should not base his decision(s) on matters not submitted or argued before him”. In other words, the arbitrator “should not make bricks without straw” (at [65(a)]). In essence, an arbitral tribunal should not surprise the parties with its own ideas (at [44]). However, consistent with the policy of limited curial intervention, the courts should only intervene in arbitral awards in limited circumstances. For example, where the “impugned decision reveals a dramatic departure from the submissions, or involves an arbitrator receiving extraneous evidence, or adopts a view wholly at odds with the established evidence adduced by the parties or arrives at a conclusion unequivocally rejected by the parties as being trivial or irrelevant” (at [65(c)–(d)]). Whilst a tribunal should not make bricks without straw, where the factual basis or “building blocks” of the award were present during the arbitral proceedings, it cannot be said that a tribunal reached its own conclusions in breach of natural justice (at [67]). 87 In addition, a particular chain of reasoning would be open to a tribunal, even if not specifically argued by the parties, if it flows reasonably from a premise argued or actually advanced by either party (TMM DivisionMaritima SA de CV v Pacific Richfield Marine Pte Ltd[2013] 4 SLR 972 (“TMMDivision”) at [65]). Finally, it is also a well-entrenched principle that the court will not set aside an award under the Act simply because an arbitrator made an error of law or of fact. The court should not allow an aggrieved party a second bite of the cherry by engaging the court on what is, in substance, an appeal on the legal merits of the arbitral award disguised as a breach of natural justice challenge (AKNand another v ALC and others and other appeals[2015] 3 SLR 488 at [39]). Application and analysis 88 The complaints of the Plaintiffs here were, save for some additional objections summarised at [112] below, largely similar to those raised in relation to the scope of submission objection which I considered earlier in these grounds and dismissed. For similar reasons, I was of the view that the Plaintiffs’ objections were without merit. 89 The record of the Arbitration shows that the Plaintiffs were aware of the Defendant’s case and had, not just reasonable, but ample opportunity to respond to it. Further, the Tribunal’s reasoning and decision in the Award were based on the issues placed before it and arguments advanced by the parties. 90 With regard to the pleadings and the ALOI, I have already discussed this at length (at [65]–[80] above) and do not propose to say any more than I already have. 91 Apart from the pleadings and the ALOI, I also considered the Plaintiffs’ and Defendant’s Opening Statements and the conduct of the case by the Plaintiffs in the course of the Arbitration (including the evidence adduced during the oral hearing). When all of these were viewed in the round, it was clear to me that the Plaintiffs were keenly aware that the Defendant was also putting forward a position that approval had been obtained from the 1st Plaintiff on or by 28 April 2015 such that a qualifying launch pursuant to Article 6(d) of the Contracts Addendum No. 2 had taken place when the second launch occurred on 3 May 2015. 92 Mr Singh accepted, during the hearing before me, that by the time the Defendant had filed its Opening Statement, the Defendant had made known its position,ie.that an agreement or understanding had been reached on 28 April 2015 for the launch on 3 May 2015. I reproduce the relevant extract of the transcript:76Foot Note 76×Minute Sheet (6 February 2020) at p 11 Ct: Mr Singh, do you accept that at least by the time the [Defendant’s] Opening Statement had been filed, the point about the vessel being launched on 20 Jan and if not by 5 May (date of the second invoice following the launch on 3 May 2015) and that there was agreement from [the 1st Plaintiff] for that subsequent launch was raised in the [Defendant’s] Opening Statement? PC: Yes, they do say it. 93 Further, during the oral hearing, the Defendant’s counsel had cross-examined the Plaintiff’s witness on whether an agreement or understanding on the unresolved issues was reached on 28 April 2015.77Foot Note 77×Transcript (23 May 2018) at p 140 ln 14 to p 143 ln 10 (Affidavit of Cheng Huanmin at pp 1061–1064)The Plaintiffs therefore had a clear opportunity to address the issues surrounding this meeting and the second launch during the evidentiary hearing. Those areas of contention had already been laid out in the parties’ pleadings and the ALOI. 94 Even in the Plaintiffs’ Closing Submissions and Reply Submissions, the Plaintiffs did address their minds to the Defendant’s position on the second launch. In the Plaintiffs’ Closing Submissions, they reiterated that the meetings held on 21 January, 7 April and 28 April 2015 were merely technical in nature and had no contractual significance. As such, the Plaintiffs asserted that the Defendant could not claim that all outstanding matters relating to the launch were resolved in May 2015.78Foot Note 78×Plaintiffs’ Closing Submissions at pp 155–156 95 In the Plaintiffs’ Reply Submissions, the Plaintiffs specifically argued that “even if [the Defendant] say [sic] they launched [Hull No. X] correctly in May 2015, after having completed all the outstanding works, [the Defendant] had still failed to request and obtain the [Plaintiffs’] consent to launch, and compliance withallthe conditions precedent under Article 6 of Addendum No. 2 had still not been satisfied” (emphasis in original).79Foot Note 79×Plaintiffs’ Reply Submissions at para 52 96 It was plainly evident that the Plaintiffs were aware of the Defendant’s position on the second launch and sought to debunk it in the course of their closing and reply submissions. It was also evident that the Plaintiffs did not, contrary to their contentions, limit their response to the Defendant’s alternative case to oneonlybased on estoppel (see [71]–[72] above).80Foot Note 80×Minute Sheet (5 February 2020) at pp 8–9 97 In the Award, the Tribunal noted and rejected the Plaintiffs’ contention that the Construction and Progress Meetings were merely technical in nature. The Tribunal also rejected the Plaintiffs’ submission that any agreement or approval given during those meetings had no contractual relevance or significance and did not constitute approval by the 1st Plaintiff for the launch for purposes of Article 6(d) of Contracts Addendum No. 2.81Foot Note 81×Award at p 85I reproduce the relevant parts of the Award:82Foot Note 82×Award at p 85–86 … In the Tribunal’s view, there is also no merit in the [Plaintiffs’] contentions that: 1. since the meetings on 21 January 2015, 7 April 2015 and 28 April 2015 were ‘Project and Construction Meetings’ involving only the Parties’ technical teams and dealt primarily with the technical aspects of the construction, any agreement, decision or understanding reached at such meetings were purely technical in nature and would not be contractually binding on the Respondents particularly so because the attendees at such meetings were the Respondents’ Supervisors who had no authority to bind the Respondents vis-à-vis any financial, commercial or contractual decisions; … This is because the questions as to whether [Hull No. X] was in“Launchingcondition”(emphasis added by the Tribunal) and whether therefore [the 1st Plaintiff] had approved [Hull No. X] as having been launched, are purely technical in nature. These do not concern any financial or legal issues. The [Plaintiffs] have also not identified what financial, contractual, commercial or legal issues would need to be resolved- with Mr [Z]’s involvement- before [Hull No. X] could be considered in“Launchingcondition”.In the Tribunal’s view, there were none. Whether [Hull No. X] wasin“Launchingcondition”- and hence whether its launch was approved by [the 1st Plaintiff]- turned entirely on a determination from a technical point of view. Even on the [Plaintiffs’] case, the Parties’ technical teams did deal with and were authorised to deal with the technical aspects of the construction. In addition, it would be strange indeed if the Construction and Progress Meetings [relating to Hull No. X] did not import any contractual significance, as the [Plaintiffs] now allege. … From the extract above, it was, again, plainly evident that the Plaintiffs were aware of the Defendant’s alternative case and were seeking to meet it. On its part, the Tribunal met the parties’ competing arguments head-on and dealt with them as it was entitled to. 98 In my view, all of the factual “building blocks” for the Tribunal’s findings and its decision were clearly very much in play, having been placed before it in the parties’ pleadings, in the ALOI and during the oral hearing. The Plaintiffs were sensitised to the Defendant’s arguments and were well aware where the battle lines lay in relation to both launches and the Construction and Progress Meetings. 99 In my judgment, it could hardly be said that in this case, the Tribunal made bricks without straw. On the contrary, it is clear that the Tribunal did so with solid raw materials that were laid out before it during the course of the Arbitration by both parties.  This was also not a case where one could conclude that the Tribunal had “conjured up facts or reached a view inconsistent with the facts presented.” (SohBeng Tee([84]supra) at [67]). Neither was this a case where the Tribunal’s decision could be said to involve a dramatic departure from the parties’ submissions, or to be at odds with the established evidence. 100 Furthermore, given that the parties had traversed the facts and evidence pertaining to both launches, the Construction and Progress Meetings and whether the 1st Plaintiff had given its prior approval to either launch, the Tribunal’s reasoning and conclusion, at the very least, reasonably flowed from the arguments that were advanced by the parties in their closing submissions. For this reason also, there was, in my view, no need for the Tribunal to have notified the parties of its thinking or invited further submissions from them (seeTMMDivision([87]supra) at [65]). 101 I turn now to deal with a slightly different aspect of the Plaintiffs’ case on breach of natural justice. As can be seen from the discussion above, the nub of the Plaintiffs’ complaint was that the Tribunal’s decision significantly departed from the Defendant’s case pleaded before it.  In substance, the Plaintiffs’ argument was as follows (see [62] above) – that the Tribunal had, in effect, transposed the approval which it found had been given by the 1st Plaintiff on 28 April 2015to an earlier time, to reach the conclusion that the condition precedent was satisfied when Hull No. X was launched on 20 January 2015. The Plaintiffs argued that this must be the conclusion arrived at by the Tribunal since the Defendant’s entire pleaded case hinged only on the first launch date. 102 According to the Plaintiffs, this conclusion of “retrospective approval” having been given by the 1st Plaintiff would amount to rewriting the contract terms since under Article 6(d) of Contracts Addendum No. 2, approval by the 1st Plaintiff had to be givenpriorto the launch of Hull No. X. If, the Plaintiffs argued, the Tribunal was going down the path of reasoning as described at [101] above, it should have given the parties (or at least the Plaintiffs) notice of its thinking in order to afford them the opportunity to respond, both in terms of evidence and submissions on the law. The Tribunal’s conclusion, so the Plaintiffs contended, was surprising and shocking, and the Plaintiffs were not given any opportunity to respond to it.83Foot Note 83×Plaintiffs’ Written Submissions at paras 50–51; Minute Sheet (5 February 2020) at p 6 103 In further arguments submitted by the Plaintiffs’ solicitors’ letter dated 13 February 2020, the Plaintiffs also belatedly argued, relying onTMMDivision([87]supra) at [89]–[91], that the Tribunal’s decision demonstrated that it had failed to try to understand the essential issues in the case and the submissions advanced on those issues. According to the Plaintiffs, if the Tribunal had tried to understand the issues before it, it would have come to the conclusion that the Defendant was not relying on the second launch to claim payment of the Fourth Instalment.84Foot Note 84×Letter to Court dated 13 February 2020 at paras 10–11 104 The arguments summarised at [100]–[103] above were, in my view, misconceived and involved a misreading of the Award.  I am mindful of the Court of Appeal’s guidance inSohBeng Tee([84]supra) that an award “should be read supportively… [and] given a reading which is likely to uphold it rather than to destroy it.” (at [59], quotingWeldon Plant Ltd v The Commission for the New Towns[2001] 1 All ER (Comm) 264 at [22]). I am also mindful that the court should read an award in a reasonable and commercial way, and not nit-pick at an award (TMMDivisionat [45], citingZermaltHoldings SA v Nu-Life Upholstery Repairs Ltd[1985] 2 EGLR 14 at [14]). 105 In this case, it was not necessary for me to give the Award a generous reading. Based on a plain, reasonable reading of the Award in its proper context and bearing in mind all of the pleadings and the ALOI, it was clear that the Tribunaldid notmake any such finding or arrive at the conclusion as contended by the Plaintiffs at [101] above. 106 The Tribunal did not hold that the approval given by the 1st Plaintiff on 28 April 2015 satisfied,retrospectively, the condition precedent for the first launchon 20January 2015. From the Tribunal’s analysis, it was amply clear that the Tribunal concluded that the approval given by the 1st Plaintiff on 28 April 2015 was sufficient to satisfy that condition precedent forthe second launchof Hull No. X which the parties had agreed (in the minutes of the 28 April 2015 meeting) would take placeon 3May 2015. The Tribunal reasoned that a conclusion could be drawn from the minutes placed before it that the 1st Plaintiff had certified Hull No. X as being in “Launching Condition”, and therefore, the 1st Plaintiff had, on 28 April 2015, approved the launch. That launch was to, and did, take placeon 3May 2015. The Tribunal then found that by then,the Defendant, 1st Plaintiff and the Classification Society had collectively given their prior approval for that second launch, thereby also fulfilling that condition precedent in Article 6(d) of Contracts Addendum No. 2. I reproduce the relevant parts of the Award:85Foot Note 85×Award at pp 84–87; 96–98 6.9(c)(ii)…It is clear from the minutes of the Construction and Progress Meetings [relating to Hull No. X] held on 7 and 28 April 2015 that the [Defendant] had completed all remaining items which [the 1st Plaintiff] considered must be completed before [Hull No. X] was considered to be in“Launching condition”and that“Undocking”had been planned for“13:30, 3rd May, 2015”.In light of [the 1st Plaintiff]’s clear acceptance, the Tribunal is of the view that on 28 April 2015, [the 1st Plaintiff] had also given its approval to the launch of [Hull No. X].[The 1st Plaintiff] cannot now resile from its approval as expressed in the minutes of 7 and 28 April 2015 … … The Tribunal is also not persuaded by the [Plaintiffs’] contentions that [the 1st Plaintiff] had not limited the outstanding issues for approval of [Hull No. X]’s launch to the outstanding issues raised in the meetings on 21 January 2015 and 7 April 2015. It is clear from the minutes of the relevant meetings set out above that the matter discussed was “what itemsremain[ed] to be considered launch condition and not floating condition?”(emphasis added by the Tribunal). There was no reservation in these minutes to the effect that the list of items would not be exhaustive. It clearly was. As stated earlier, [the 1st Plaintiff] cannot now resile from its clear agreement as expressed in the minutes of 7 and 28 April 2015 above that the items listed under the heading “what itemsremain[ed] to be considered launch condition and not floating condition?”were the only items which [the 1st Plaintiff] had requested be remedied before it considered [Hull No. X] to be in“Launching condition”. … For the reasons set out above, the Tribunal considers that the minutes of 7 and 28 April 2015, in showing that [the 1st Plaintiff] considered [Hull No. X] as being in“Launching condition”, do show [the 1st Plaintiff]’s approval of the launch of [Hull No. X].Even if the minutes did not show [the 1st Plaintiff’s] approval of the launch of Hull No. X, [the 1st Plaintiff] has to be treated as having approved the launch of [Hull No. X]: in this regard, the Tribunal accepts the [Defendant]’s submission that a builder should not be prejudiced by unfair or improper conduct on the part of the buyer’s representative in unreasonably withholding consent (see Simon Curtis,Law of Shipbuilding Contracts(4th ed., 2012) at paragraph 6). Accordingly, when [the 1st Plaintiff] confirmed [Hull No. X] as being in“Launching condition”, it could not thereafter withhold approval of the launch as doing so, would have been unreasonable. … 6.13Pursuant to the minutes of the Construction and Progress Meetings [relating to Hull No. X] of 28 April 2015,“Undocking”had been planned for“13:30, 3rd May, 2015”.By that time, the [Defendant], ABS and [the 1st Plaintiff] had collectively given their approval for the launch of [Hull No. X]: the [Defendant] and ABS on 20 January 2015 and [the 1st Plaintiff] on 28 April 2015. A launch involves the filling of the drydock with water.Consequently, with the undocking on 3 May 2015, [Hull No. X] was launched with the prior collective approval of the [Defendant], ABS and [the 1st Plaintiff]. These conditions for payment of the Fourth Instalment were therefore also fulfilled. 6.14...the Tribunal’s conclusion in paragraph 6.9c aboveis not based on there being an estoppel but is based on the fact that [the 1st Plaintiff] on 28 April 2015 had given its approval to the launch of [Hull No. X]. [emphasis in original in italics and underline, emphasis added in bold] 107 The Plaintiffs were insistent that the Tribunal, by its reasoning and conclusion reproduced above, had rewritten the terms of the contract for the parties. When asked by me to point out where in the Award the Tribunal had reached the conclusion at [101], Mr Singh referred me to page 86 of the Award.86Foot Note 86×Minute Sheet (6 February 2020) at p 13I have, at [106] above, quoted the relevant extracts from page 86 of the Award, and specifically, from paragraph 6.9(c)(ii) of the Award which contained the Tribunal’s reasoning and conclusions the Plaintiffs took issue with. 108 The Award and the Tribunal’s reasoning in the Award have to be read as a whole. It is abundantly clear to me that the Tribunal in fact found, based on the minutes of the Construction and Progress Meetings, that approval had been given by the 1st Plaintiff on 28 April 2015 for thesecondlaunch on 3 May 2015, such that thesecondlaunch took place with the requisite prior collective approval of the Defendant, 1st Plaintiff and the Classification Society. Nowhere did the Tribunal find or conclude that the 1st Plaintiffs’ approval on 28 April 2015 constituted its prior approval for the first launch on 20 January 2015. In my view, this entire line of argument by the Plaintiffs completely missed the mark. 109 If I required any fortification of the conclusion I reached at [106] above, no clearer statement of the Tribunal’s reasoning could be found than in a later section of the Award when the Tribunal dealt with the Defendant’s claim against the 3rd Plaintiff under the X Guarantee. At paragraph 8.6 of the Award, this is what the Tribunal said: The [Defendant] sent an invoice to [the 1st Plaintiff] on 7 February 2015. Pursuant to Article 18.9 of [Contract X], this invoice was to be paid within forty-five (45) days of receipt of the invoice, i.e. on or before 24 March 2015.However, as [the 1st Plaintiff] only gave its approval for the launch of [Hull No. X] on 28 April 2015 which was then launched on 3 May 2015, the conditions for the payment of the Fourth Instalment were only fulfilled on 3 May 2015.On 5 May 2015, the [Defendant] again demanded payment of the Fourth Instalment. The Tribunal accordingly concludes that the [Defendant’s] demand of 5 May 2015 for payment of the Fourth Instalment had to be paid within forty-five (45) days of its receipt, i.e. on or before 19 June 2015 (see Article 18.9 of [Contract X]). This notwithstanding, [the 1st Plaintiff] failed to pay the Fourth Instalment when this fell due or any time thereafter. [emphasis added] 110 There was also no merit in the Plaintiffs’ argument (at [103] above) that the Tribunal did not attempt to understand the issues before it or the arguments advanced. As noted inTMMDivision([87]supra) at [90], the “central inquiry” is “whether the award reflects the fact that the arbitral tribunalhad applied its mindto the critical issues and arguments” (emphasis added). On any reading of the Award and from the passages in the Award reproduced at [106] and [109] above, there was no doubt in my mind that the Tribunal did apply its mind to the issues and arguments advanced by the parties pertaining to the first launch, as well as the subsequent events leading up to and including the second launch and their relevance to Article 6(d) of Contracts Addendum No. 2. 111 For all of the reasons above, it rang somewhat hollow, in my view, for the Plaintiffs to now complain that they were taken by surprise by the Tribunal’s findings and decision. It appeared to me that the Plaintiffs’ complaints of breach of natural justice were nothing more than Trojan horses deployed to disguise the Plaintiffs’ attempts to challenge the decision of the Tribunal on its legal merits. This was not permissible. 112 The Plaintiffs raised two further, secondary objections in relation to the Award. First, that the Tribunal had found that the Plaintiffs had unreasonably withheld their approval of the launch of Hull No. X, and that the 1st Plaintiff had to be treated as having retrospectively approved the launch on 20 January 2015.87Foot Note 87×Plaintiffs’ Written Submissions at paras 59–60The Plaintiffs submitted that they could not have addressed this finding as it was not pleaded. Second, that there was a breach of natural justice as the Plaintiffs were prevented from cross-examining the Defendant’s expert witness, Mr Simon Burthem (“Mr Burthem”), on matters concerning certain contractual issues in relation to Contract X and Contracts Addendum No. 2.88Foot Note 88×Plaintiffs’ Written Submissions at para 70 113 I found both objections to be without merit. 114 In relation to the first further objection, I have already addressed, in brief, the Tribunal’s holdings at [23] to [27] and [106] above. First, the Tribunal did not make any finding that the 1st Plaintiff had given its approval for the launch on 20 January 2015 retrospectively. Nor did it hold that the 1st Plaintiff had unreasonably withheld its approval for that launch. 115 As explained at [106] above, the Tribunal found that the 1st Plaintiff had, on 28 April 2015, approved the launch which was to, and did, take place on 3 May 2015. The Award then stated thateven ifthe meeting minutes did not show that the 1st Plaintiff had approved the launch (ie.the second launch), the 1st Plaintiff would be treated as having given its approval on 28 April 2015 as it would otherwise be unreasonable for the 1st Plaintiff to withhold its approval for the launch after having given its certification in the meeting minutes.89Foot Note 89×Award at para 6.9(c)(ii)This conclusion was, in my view, subsidiary to and not dispositive of the Tribunal’s decision. The Tribunal’s dispositive conclusion was based on its finding that on 28 April 2015, the 1st Plaintiff did give its approval for the second launch. 116 It is therefore clear to me that the Plaintiffs’ reading of the Award is not supported by an examination of the Award and the Tribunal’s reasoning. 117 Further, the point on unreasonably withholding consentwasraised by the Defendant in its Supplementary Opening Statement in response to the Plaintiffs’ Opening Statement.90Foot Note 90×Defendant’s Supplementary Opening Submissions at paras 37–40 118 Paragraph 37 of the Defendant’s Supplementary Opening Statement expressly asserted that a “discrete issue which arises in respect of the launch of [Hull No. X] is whether the [Plaintiffs] are entitled to unreasonably withhold approval of the launch for [Hull No. X], in light of Article 6 of Contracts Addendum No. 2 which provides that the Fourth Instalment is subject that [sic] the [Defendant] “shows the following commitments:…Launching subject to prior approval byCLASS, Owner and [the Defendant]””. The Defendant went on to state (at [37]) that “[b]ased on a construction of this clause, the [Defendant] is only required to show that it has committed to the stipulated requirements and the [Plaintiffs] are not entitled to unreasonably deny approval of launching”. The Defendant cited the legal proposition that a “builder should not be prejudiced by unfair or improper conduct on the part of the buyer’s representative” and concluded as follows (at [40]):91Foot Note 91×Defendant’s Supplementary Opening Submissions at paras 37–40 Likewise, in the present case, given that ABS had issued the Statement of Fact certifying the launch of [Hull No. X] and the [Defendant] had met all the launch conditions (as of 20 January 2015 and/or 3 May 2015), the [Plaintiffs] are not entitled to rely on their purported lack of approval to avoid payment of the Fourth Instalment. Thus, the Plaintiffs were or ought to have been aware, before the oral hearing began, that this discrete point was being raised by the Defendant. Therefore, no prejudice could be complained of by the Plaintiffs. 119 Turning to the second further objection raised by the Plaintiffs, I accept the Defendant’s submission that the Plaintiffs were given the opportunity to cross-examine Mr Burthem on the issues within his expertise, that is, the technical issues for which he was called to opine on.92Foot Note 92×Defendant’s Submissions at paras 79–80There was, in my opinion, no breach of natural justice to speak of. 120 The Plaintiffs contended that they were restricted by the Tribunal to cross-examining Mr Burthem on technical matters, even though Mr Burthem had opined on contractual issues in his witness statement and responsive report.93Foot Note 93×Plaintiffs’ Submissions at para 70In support of its submission that Mr Burthem had expressed his opinion on contractual issues, the Plaintiffs highlighted in particular paragraph 16(b) of Mr Burthem’s witness statement. In that paragraph, Mr Burthem stated that he had been “instructed to consider and provide [his] expert opinion” in respect of:94Foot Note 94×Affidavit of Svein Nodland at para 89; Witness Statement of Simon Burthem at p 4–5 (Affidavit of Svein Nodland at pp 1321-1322(Tab 22)) 16(b)The validity and the seriousness of the alleged failed/disputed launch and launch conditions of [Hull No. X]; (i) Whether the conditions set out in Article 6 of Addendum No. 2 were complied with prior to the launch of [Hull No. X] on 20 January 2015 1. Whether the quality of workmanship and system of [Hull No. X] were in conformance with [Contract X] 2. Whether [the Defendant] had committed on schedule as per Annex 1 of [Contract X] 3.  Whether the American Bureau of Shipping (“ABS”) had given its approval prior to the launch of [Hull No. X] 121 The Plaintiffs highlighted that Mr Burthem had given his opinion in his Witness Statement as follows:95Foot Note 95×Affidavit of Svein Nodland at para 90; Witness Statement of Simon Burthem at para 31 (Affidavit of Svein Nodland, Tab 22) 31On an examination of the documents, it is my opinion that the conditions set out in Article 6 of Contracts Addendum No. 2 were complied with prior to the launch of [Hull No. X] on 20th January 2015. There was no breach of quality of workmanship, lack of cooperativeness on the part of the [Defendant] or failure to commit to schedule that prevented the launch. In my opinion, the ABS Statement of Fact is evidence that ABS assented to the launch. Finally, I understand that [Hull No. X] was indeed physically launched on 20th January 2015. According to the Plaintiffs, the opening sentence in that paragraph of Mr Burthem’s witness statement entitled them to cross-examine him on it.96Foot Note 96×Plaintiffs’ Submissions at paras 70-71 122 To put matters into context, it would be helpful to examine the transcript of the hearing at the point at which the Defendant objected to the line of cross-examination of Mr Burthem by Plaintiffs’ counsel and where the Tribunal intervened:97Foot Note 97×Certified Transcript (24 May 2018), p 179 ln 12 to p 183 ln 4 (Affidavit of Svein Nodland at pp 1058-1062 (Tab 17)) PC: … On issue 2, issue 2 in [the Joint Expert’s Memo] states: “The validity and the seriousness of the alleged failed/disputed launch and launch conditions of [Hull No. X] as at 20 January 2015: (a) Whether the conditions set out in article 6 of addendum No. 2 were complied with prior to the launch of [Hull No. X] on 20 January 2015.” … … So (b)(i), you have stated: “The validity and the seriousness of the alleged failed/disputed launch and launch conditions of [Hull No. X]; (i) Whether the conditions set out in article 6 of addendum number 2 were complied with prior to the launch of [Hull No. X] on 20 January 2015.” What you have considered is three items, am I right? Mr Burthem: That’s correct. That would be my instructions. PC: Did you lift this from addendum number 2? Mr Burthem: I believe this wording would have come from any instructions, actually. PC: Does this accord – because you are commenting on the conditions set out in article 6. So I need to ask you, does this accord exactly with what article 6 stays in relation to the conditions? Mr Burthem: Typically, if I’m making a quote, I would have put it in quotation marks. In this case, the wording, I think, would have come from my instructions, so I can’t say whether the wording exactly accords or not unless you show me a copy of addendum number 2. PC: Apart from your instructions, did you have a look at addendum number 2 yourself? Mr Burthem: Yes, I confirmed that a moment ago. PC: Do you also confirm that you have not addressed all the conditions or addendum number 2 in this paragraph? DC: Mr Chairman, I need to object to that question. Mr Burthem is here to give evidence on the technical matters not on the contractual basis for addendum number 2. If the tribunal looks at topic 2, 2(a), you will then see – and that is on page – I’m sorry, it’s topic 2, 2(a) you will then see at 2(a), that as an issue is broken down into further technical issues, 2(a)(i), 2(a)(ii), 2(a)(iii), 2(a)(iv) before it goes into 2(b).MrBurthem has answered the technical issues in respect of those. Mr Burthem has not responded on whether the conditions set out in article 6 of addendum 2 were complied to, as suggested to by my learned friend, which he can’t because he’s a technical expert. So it’s not really a fair question to suggest that he has – or she [sic] should have or he did look at whether the conditions in addendum 2 are satisfied. PC: I’ll tell you why it’s fair. It’s because of the way the report has been phrased. (i) says generally, without qualification: “Whether the conditions set out in article 6 of addendum number 2 were complied with prior to the launch of [Hull No. X] on 20 January 2015.” So I’m perfectly entitled to ask him whether he’s considered all of the requirements in addendum number 6 (sic) because he has made a general statement on it. DC: Mr Chairman,surely that must be caveated by if you look at what the technical matters are from 1, 2 and 3, and further, I can’t even see how that would be relevantsince Mr Burthem wasn’t a witness at the time and he’s not a legal expert that can quite actually state what are the conditions in addendum number 2. So even if my learned friend asked these questions, what will the response be? It won’t be useful for this tribunal. … Chairman: … Mr Singh (Plaintiffs’ counsel), we’ve conferred.Youhave to restrict your questions to the specific items set out in 2(a)(i), (ii), (iii) and (iv). So not a general question, please. In relation to what – whether or not it complied with the conditions set out in addendum number 2. [emphasis added] 123 The oral hearing continued and on the following day, the Plaintiffs’ counsel Mr Singh sought clarification from Mr Burthem on whether he was giving his opinion only in relation to technical matters and not on contractual matters:98Foot Note 98×Certified Transcript (25 May 2018) at p 5 ln 5 to p 6 ln 21 (Affidavit of Svein Nodland at pp 1505-1506 (Tab 24)) PC: … I just have one question for you following on from yesterday, a general question. Just to confirm for the record that your evidence given in the reports only relate to technical matter and you don’t form any sort of opinion in relation to the contract and contractual matters? Mr Burthem: I don’t profess to give any legal opinion, no. I mean,inevitably there is an interrelation between some technical matters in the contract, because some of the contractual terms have a direct bearing on certain technical matters, but I certainly don’t profess to give a legal interpretation. ….. PC: But in terms of the main issues on breach, and so on and so forth, can I confirm your report does not relate to that but only to potential matters? Mr Burthem: I have looked at the issue from a technical point of view, which is to say if I were in the shipbuilder’s or buyer’s shoe I would be looking a [sic] that the particular term which had a direct bearing on the construction of the barge or on the DES and deciding whether the contractual standard was met, so in that respect I have. PC: I’m not talking about you putting yourself in their shoes. I’m saying, as an expert, you have not alluded to any sort of contractual breaches and given an opinion in relation to whether what they did under the contract was right of wrong; am I right. Mr Burthem: No, that’s incorrect. As I have said, I think my report is fairly clear.What I have done, where there’s aparticular standard or test I believe set out which relates to an issue of construction, then I have given an opinion on that because I believe that was my duty as an expert to assist the tribunal. [emphasis added] 124 The Plaintiffs contended that as Mr Burthem had acknowledged the interrelation between technical matters and the contract, the Tribunal should not have restricted the Plaintiffs’ cross-examination of Mr Burthem as it did. There was, therefore, a breach of natural justice in the making of the Award as the Tribunal had relied on the evidence of Mr Burthem which was not thoroughly challenged through cross-examination.99Foot Note 99×Plaintiffs’ Submissions at paras 71–73 125 The Defendant, on the other hand, argued that the Tribunal did not hold that the Plaintiffs could not cross-examine Mr Burthem beyond technical matters. The Tribunal had merely stated that the Plaintiffs’ counsel should limit his questions to the items set out in the Joint Expert’s Memo (“the Memo”), which referred to the conditions set out in Article 6 of Addendum No. 2 (see [5]). For easy reference, the Memo listed issue 2 as follows:100Foot Note 100×Affidavit of Cheng Huanmin at pp 525–529 2. The validity and the seriousness of the alleged failed/disputed launch and launch conditions of [Hull No. X] as at 20 January 2015: (a) Whether the conditions set out in Article 6 of Addendum No. 2 were complied with prior to the launch of [Hull No. X] on 20 January 2015; (i) Whether the quality of workmanship and system of [Hull No. X] were in conformance with [Contract X]? (ii) Whether there was mutual cooperativeness between the [Defendant], the [Plaintiffs], and the [Plaintiffs]’ site teams? (iii) Whether the [Defendant] had committed on schedule as per Annex 1 of [Contract X]? (iv) Whether the American Bureau of Shipping (“ABS”) had given its approval prior to the launch of [Hull No. X]? (b) Whether [Hull No. X] was in a condition fit for launch on 20 January 2015? 126 The Defendant submitted that the Tribunal had in fact expressly allowed the Plaintiffs’ counsel to cross-examine Mr Burthem on the launch conditions at Issues 2(a)(i) to (iv) in the Memo, which encompassed the technical items in dispute. Further, as Mr Burthem was a technical expert, there was no reason for the Plaintiffs to seek to cross-examine him on his interpretation of the contract.101Foot Note 101×Defendant’s Submissions at paras 79–80 127 I agreed with the Defendant’s submissions. Given the manner in which the Memo was structured, where each party’s appointed expert weighed in on each sub-issue in dispute, it was clear that Mr Burthem was not addressing the general question of whether the conditions set out in Article 6 of Contracts Addendum No. 2 were complied with. Rather, he was responding to each sub-issue in the Memo, as instructed. The Tribunal was not remiss in directing the Plaintiffs’ counsel, in his cross-examination, to keep to the sub-issues and within the remit of the Memo. At the point where the Tribunal intervened, the Plaintiff was, in effect, asking Mr Burthem to interpret Contracts Addendum No. 2. That was not Mr Burthem’s role as a technical expert. 128 Mr Burthem explained that the contractual and technical requirements could be inter-related, and that he would give his view when a technical standard potentially impacted upon whether a contractual requirement was met. This did not mean that the Plaintiffs should have therefore been given a free hand and allowed to cross-examine Mr Burthem on the contract itself or the interpretation of its terms. Where there were contract terms and technical standards that were linked, they would conceivably be covered under the appropriate listed technical sub-issues in the Memo. 129 It is, in my view, clear that the Plaintiffs were not in any way denied the opportunity to cross-examine Mr Burthem on the issues as stated in the Memo and on paragraph 16(b) of his witness statement. In any event, following the Tribunal’s intervention and its direction to the Plaintiffs’ counsel (see [122]), there was no objection raised by the Plaintiffs and the oral hearing continued.102Foot Note 102×Certified Transcript (24 May 2018) at p 183 (Affidavit of Svein Nodland at p 1062 (Tab 17))In the circumstances, I did not find any basis for this aspect of the Plaintiffs’ complaint that there was a breach of natural justice. No prejudice suffered by the Plaintiffs 130 Even if there had been any breach of natural justice, the Plaintiffs were not able to demonstrate to me that they had been prejudiced by the breach and if so, how. In order to show that prejudice resulting from a breach of natural justice, the Plaintiffs would need to demonstrate that the material it would have presented “could reasonably have made a difference to the arbitrator” (seeLW Infrastructure([84]supra) at [54]). 131 As pointed out by the Defendant, the Tribunal considered all of the evidence and arguments placed before it by the parties in relation to the first launch, the Construction and Progress Meetings and the second launch on 3 May 2015. The Plaintiffs did not elucidate what material they would have placed before the Tribunal that would have had a real as opposed to a merely fanciful chance of making any difference to its deliberations.",
        "Conclusion": "132 For the reasons given above, I disagreed with the Plaintiffs that they had been denied an opportunity by the Tribunal to present their case or that there had been any breach of natural justice in the making of the Award.  There was, in my judgment, no basis for the Award to be set aside pursuant to Article 34(2)(a)(ii) of the Model Law and/or s 24(b)of the Act. This ground of the Plaintiffs’ application also failed. 133 As neither ground raised by the Plaintiffs in their application had been made out, I dismissed OS 1307/2019 accordingly.",
        "Costs": "134 Finally, the Plaintiffs appealed against my cost orders in both OS 1307/2019 and the Stay Application. For both OS 1307/2019 and the Stay Application, as costs should follow the event, I awarded costs to the Defendant on the standard basis. After hearing the parties, I fixed costs for OS 1307/2019 at $13,500 and disbursements at $12,406.25 to be paid by the Plaintiffs to the Defendant. For the Stay Application, I fixed costs at $3,000 (inclusive of disbursements) to be paid by the Plaintiffs to the Defendant.103Foot Note 103×Minute Sheet (28 February 2020) at p 17–18 135 The Defendant sought to persuade me to award costs on an indemnity basis104Foot Note 104×Minute Sheet (28 February 2020) at p 15and relied on two decisions from Hong Kong. The first wasPacific China Holdings Ltd (inliq) v Grand Pacific Holdings Ltd (No 2)[2012] 6 HKC 40 which held that a party who was unsuccessful in an application to set aside an arbitral award should, in the absence of special circumstances, be ordered to pay costs on an indemnity basis. The second wasChimbuscoInternational Petroleum (Singapore) Pte Ltd v Fully Best Trading Ltd[2016] 1 HKC 149, where the Hong Kong Court of First Instance stated that the basis of awarding costs on an indemnity basis was that parties had consensually agreed to submit their dispute to arbitration and accept the arbitral award as final and binding on them (at [10]).105Foot Note 105×Defendant’s Submissions at paras 94–98The Defendant contended that given Singapore’s pro-arbitration policy, the courts here should similarly award costs on an indemnity basis as the default position.106Foot Note 106×Minute Sheet (28 February 2020) at p 16Further, the Defendant was of the view that the Plaintiffs had acted unreasonably as the grounds relied upon by the Plaintiffs to set aside the Award were weak, and indemnity costs were therefore appropriate.107Foot Note 107×Defendant’s Submissions at para 98 136 The Plaintiffs, on the other hand, argued that the courts here did not order indemnity costs as a matter of course when an award or its enforcement was unsuccessfully challenged. As an example, inTriulziCesare SRL v Xinyi Group (Glass) Co Ltd[2015] 1 SLR 114 (“Triulzi”), where the court dismissed an application to set aside an arbitral award, it did not order costs on an indemnity basis. The Defendant pointed out that it was not apparent from the reported decision inTriulziwhether indemnity costs were awarded or not. The Plaintiffs also contended that the Act allowed parties to challenge an award which the Plaintiffs did, and the application was not frivolous or devoid of any merit. If costs were awarded on an indemnity basis as a matter of course, it would act as a fetter on future applications before the courts.108Foot Note 108×Minute Sheet (28 February 2020) at p 16 137 The position adopted by the Hong Kong cases mentioned above has not, as far as I am aware, been adopted by our courts and counsel did not point me to any authority where the position articulated in the Hong Kong cases has been endorsed by our courts. As forTriulzi,I note from the minute sheet for the costs hearing that the court theredeclinedto award costs on indemnity basis, although this is not apparent from the reported decision.109Foot Note 109×Minute Sheet (29 July 2015) (HC/OS 1114/2013) 138 Leaving aside the Hong Kong position, it is indisputable that this court has the discretion to award indemnity costs in appropriate cases. However, as stated by Justice Chan Seng Onn inAirtrust(Hong Kong) Ltd v PH Hydaulics & Engineering Pte Ltd[2016] 5 SLR 103 (“Airtrust”) at [17], an order of costs on an indemnity basis is “the exception rather than the norm and requires justification”. Chan J went on to state at [18] that the starting point to determine whether it would be appropriate to order indemnity costs is O 59 r 5 of the ROC. That rule allowed the court to have regard to, among others, the conduct of the parties before and during the proceedings. 139 As noted inAirtrustat [23], the following “broad categories of conduct” may provide a basis for ordering indemnity costs: (a) where the action is brought in bad faith, as a means of oppression or for other improper purposes; (b) where the action is speculative, hypothetical or clearly without basis; (c) where a party’s conduct in the course of proceedings is dishonest, abusive or improper; and (d) where the action amounts to wasteful or duplicative litigation or is otherwise an abuse of process. 140 I was not persuaded that the position on costs adopted in the Hong Kong cases cited at [135] above should represent the default position in Singapore for unsuccessful challenges to arbitral awards. I therefore exercised my discretion in accordance with the guidelines set out inAirtrust. 141 OS 1307/2019 was the first application which the Plaintiffs had taken out. Whilst I found the application unmeritorious, it could not be said to have been made without any basis whatsoever. Nor was it frivolous. There was also no evidence of any improper conduct or bad faith in the Plaintiffs’ conduct of the proceedings. In my view, this was not a case where indemnity costs should be ordered. I therefore awarded costs to the Defendant on the standard basis. 142 As for quantum, the Defendant submitted that for OS 1307/2019, costs in the sum of $13,500 were appropriate based on the guidelines set out in Appendix G of the Supreme Court Practice Directions (“Appendix G”) as the hearing spanned two half-days (effectively, a full-day hearing). As for disbursements, the Defendant tendered to me a breakdown of the total disbursements incurred amounting to $12,406.25. The Defendant submitted that the disbursements included filing fees and that it had to exhibit, in the supporting affidavit, the entire voluminous record of the arbitration proceedings. As the Defendant was based in China, its counsel also had to file a cover affidavit first followed by the actual affidavit by the Defendant’s representative. For the Stay Application, the Defendant submitted that a sum of $4,000 would be appropriate based on the guidelines for stay applications in Appendix G. The parties had also attended various Pre-Trial Conferences in relation to the Stay Application.110Foot Note 110×Minute Sheet (28 February 2020) at p 17 143 For the Plaintiffs, Mr Singh submitted that for OS 1307/2019, costs of $12,000 would be more appropriate. As for disbursements, Mr Singh took issue with the photocopying charges in the breakdown tendered by Mr Chia. Mr Singh submitted that the photocopying charges should be reduced to $2,000 as it was not necessary to prepare two sets of all the documents. As for the Stay Application, it was submitted that a sum of $2,000 would be appropriate.111Foot Note 111×Minute Sheet (28 February 2020) at p 17  144 I agreed with the Defendant that a sum of $13,500 for costs was appropriate for OS 1307/2019 as the two half-days were largely spent dealing with OS 1307/2019. As for disbursements, I found the breakdown tendered by the Plaintiffs (including for photocopying charges) reasonable and fixed the disbursements at $12,406.25. As for the Stay Application, I found that a sum of $3,000 (including disbursements) was reasonable in the circumstances and within the guidelines set out in Appendix G, and I so ordered. S MohanJudicial Commissioner Navinder Singh and Farah Nazura Binte Zainudin (KSCGP Juris LLP) for the 1st and 3rd plaintiffs; Daniel Chia Hsiung Wen, Ker Yanguang (Ke Yanguang) and Annette Liu Jia Ying (Morgan Lewis Stamford LLC) for the defendant.",
        "": ""
    }
}