{
    "case_title": "Public ProsecutorvMurugesan a/l Arumugam",
    "ncitation": "[2020] SGHC 203",
    "coram": "Dedar Singh Gill J",
    "sections": {
        "Introduction": "1 The accused pleaded guilty to and was convicted on one charge of trafficking in not less than 14.99g of diamorphine under s 5(1)(a) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”). The punishment is prescribed under s 33(1) of the MDA. I imposed a sentence of 25 years’ imprisonment and 15 strokes of the cane. I backdated the sentence to 26 March 2016, the date of the accused’s remand. The accused has appealed against his sentence. I now set out my grounds for the decision.",
        "Statement of Facts": "2 The accused is Murugesan a/l Arumugam, a 32-year-old male Malaysian. The co-accused is Mohamed Ansari bin Mohamed Abdul Aziz (“B2”), a 47-year-old male Singaporean. 3 On 24 March 2016, at or around 12.10pm, the accused rode a motorcycle (bearing licence plate number JQR5667) (“the Motorcycle”) into the HDB carpark located at Lengkong Tiga, Singapore. Around ten minutes later, at about 12.20pm, one Jufri bin Mohd Alif (“B3”) drove a car (bearing licence plate number SGF6111J) (“the Car”) into the same carpark. B2 and his then-girlfriend, Bella Fadila (“B4”), were seated in the Car at the front passenger seat and the rear passenger seat respectively. 4 B2 and B4 alighted from the Car and met the accused at the void deck of Block 106 Lengkong Tiga. The accused gave B2 a white plastic bag containing two plastic packets of brown granular substance. In exchange, B2 gave the accused $5,880. B2 and B4 then returned to the Car and headed towards the exit of the HDB carpark. At or around 12.25, officers from the Central Narcotics Bureau (“CNB”) apprehended and arrested the accused, B2, B3 and B4. 5 Subsequently, a search was conducted on the Car. A white plastic bag containing two plastic packets of brown granular substance was recovered from the floorboard under the front passenger seat. These items were seized as exhibits. They are set out in the table below:  DescriptionMarkingWhite plastic bagE1One plastic packetE1AOne plastic packet containing granular/powdery substanceE1A1One plastic packetE1BOne plastic packet containing granular/powdery substanceE1B1 6 In addition, a search was conducted on the Motorcycle. One dark green sling bag was retrieved from the front basket. The bag contained $5,880. 7 Thereafter, the accused was escorted to the Woodlands Checkpoint and to his workplace at Tuas South before being taken to CNB Headquarters for further investigations. In the course of the investigations, the accused admitted that a friend located in Johor Bahru, who the accused knew as “Ismail” (“B5”), told the accused to collect illegal drugs from an Indian male at Jurong Bird Park. The accused was instructed to give the drugs to a “Malay guy”, B2, at Block 106 Lengkong Tiga. According to the accused, B5 told him to collect money from B2 and that the accused would be given RM500 for delivering “a packet or two”. 8 The accused further admitted that, on 24 March 2016, he had indeed collected a white plastic bag from an Indian male at Jurong Bird Park before passing it to B2 at Block 106 Lengkong Tiga in exchange for S$5,880. The accused explained that the promised sum of RM500 was a lot of money given that he was facing financial difficulties at the time. 9 On 28 March 2016, the exhibits marked “E1A1” and “E1B1”, each sealed in a tamper-proof bag, were submitted to the Illicit Drugs Laboratory of the Health Sciences Authority (“HSA”) for analysis. The results of the analysis, as disclosed in two certificates dated 11 July 2016, are set out in the table below:  ExhibitResultE1A1One plastic packet containing not less than 457.7g of granular/powdery substance, which was analysed and found to contain not less than 20.51g of diamorphineE1B1One plastic packet containing not less than 457.5g of granular/powdery substance, which was analysed and found to contain not less than 19.17g of diamorphine 10 In total, the exhibits contained not less than 14.99g of diamorphine, which is a Class A controlled drug listed in the First Schedule to the MDA. 11 By physically delivering the exhibits marked “E1A1” and “E1B1” to B2, the accused had trafficked in not less than 14.99g of diamorphine. He had the exhibits in his possession, and he knew that the exhibits marked “E1A1” and “E1B1” contained diamorphine. At no time was the accused authorised under the MDA or the regulations made thereunder to have in his possession controlled drugs for the purpose of trafficking.",
        "Decision on conviction": "12 Having regard to the accused’s plea of guilt and the admission to the Statement of Facts without qualification, I convicted the accused of one count of trafficking under s 5(1)(a) and punishable under s 33(1) of the MDA",
        "Sentencing": "",
        "The accused’s antecedents": "13 The accused admitted to his antecedents for the purpose of sentencing. On 3 February 2016, the accused was convicted of two driving-related offences, for which he paid a fine totalling S$2,500.00 and was disqualified from driving for 24 months.",
        "The Prosecution’s submission on sentence": "14 The Prosecution submitted that the appropriate sentencing range for trafficking not less than 14.99g of diamorphine was 26–29 years’ imprisonment, based on the sentencing range for cases of trafficking between 13.01g and 14.99g of diamorphine as set out inPublic Prosecutorv Tan Lye Heng[2017] 5 SLR 564 (“Tan Lye Heng”) at [125]. The High Court inPublic Prosecutor v Lai Teck Guan[2018] 5 SLR 852 (“Lai Teck Guan”) at [42] andAmin bin Abdullah v Public Prosecutor[2017] 5 SLR 904 (“Amin”) at [100] held that 26–29 years’ imprisonment was the indicative sentencing range for a first-time offender trafficking 13g to 14.99g of diamorphine. 15 Having arrived at an indicative sentencing range of 26–29 years’ imprisonment, the Prosecution considered several aggravating factors, namely (a) the accused’s involvement in a larger network of drug supply; (b) the accused’s knowledge that the drug-trafficking network involved crossing the Malaysian and Singaporean border; and (c) the accused’s facilitation of drug distribution within Singapore and contribution to drug syndicates. 16 The Prosecution also contended that the accused’s plea of guilt had to be seen in light of the fact that the accused was caught red-handed in the act of trafficking drugs, and it had been held that a sentencing discount would not be warranted where the Prosecution would have no difficulty in proving the charge against the accused:Public Prosecutorv Tay Beng Guan Albert[2000] 2 SLR(R) 778 at [16]. Notwithstanding its submissions favouring a higher sentence, the Prosecution submitted for a sentence of at least 26 years’ imprisonment.",
        "The Defence’s plea in mitigation": "17  The Defence cited the accused’s cooperation with the authorities and frank disclosure of all the material events. The Defence also noted that the accused did not consume drugs. And, although he was traced for two driving offences, the accused had no antecedents for drug-related offences. Neither was he traced in Malaysia. 18 The Defence did not dispute the indicative starting range of 26–29 years’ imprisonment for a notional first-time offender trafficking 14.99g of diamorphine underLai Teck Guan(supra[14]) at [42] andAmin(supra[14]) at [100]. However, the Defence contended that the culpability of the accused was limited to that of a mere courier. In particular, the Defence relied on a series of cases, namelyPublic Prosecutorv Vashan a/l K Raman[2019] SGHC 151 (“Vashan”),Public Prosecutorv Muhammad Nor Haiqal bin Shaman[2017] SGHC 292 (“Haiqal”), andPublic Prosecutor v Esvaran A/L Mohamet Mustaffa and two othersHC/CC 74/2017 (28 November 2017) (“Esvaran”), wherein the sentencing courts took into account the accused’s limited role and imposed sentences that fell below 26 years’ imprisonment. Accordingly, the Defence submitted for a sentence of below 26 years’ imprisonment.",
        "Decision on sentence": "19 Under the Second Schedule of the MDA, the unauthorised trafficking of a controlled drug containing such quantity of diamorphine being not less than 10g and not more than 15g attracts a maximum sentence of 30 years’ imprisonment and 15 strokes of the cane and a mandatory minimum sentence of 20 years’ imprisonment and 15 strokes of the cane. 20 There was no dispute thatVasentha d/o Joseph vPublic Prosecutor[2015] 5 SLR 122  (“Vasentha”) at [44] sets out the appropriate sentencing framework for drug trafficking offences involving diamorphine. This sentencing framework was affirmed inSuventher Shanmugam vPublic Prosecutor[2017] 2 SLR 115 at [28]. First, the sentencing court identifies the indicative starting point within the appropriate sentencing range based on the quantity of diamorphine. Second, the court calibrates the sentence based on the offender’s culpability and the presence of relevant aggravating or mitigating factors. Finally, the court takes into account any time spent in remand prior to conviction. 21 It was also common ground thatLai Teck Guan(supra[14]) at [42] establishes the indicative sentencing range for a first-time offender trafficking 13 to 14.99g of diamorphine. Both the Prosecution and the Defence agreed that 26–29 years’ imprisonment was the appropriate indicative starting range given that the accused had trafficked no less than 14.99g of diamorphine. Given that the quantity of diamorphine involved in this case was at the highest end of the range, I took 29 years’ imprisonment to be the indicative starting point. 22 With the indicative starting point in mind, I considered the culpability of the accused. In my judgment, the accused, a mere courier who acted on the instructions of another, possessed a low degree of culpability. 23 I then considered the aggravating factors cited by the Prosecution. In my judgment, there were no aggravating factors present. The Prosecution relied on the accused’s involvement in a larger network of drug supply. But this, without more, cannot constitute an aggravating factor, since I can scarcely imagine a situation where a mere courier would not be part of a larger network of drug supply. The role of a courier is simply to transport the drugs and he necessarily acts on instructions. In addition, the fact that the accused knew that the drug-trafficking network involved crossing the Malaysian and Singaporean borders was not an aggravating factor given that he played no role in that transaction. Finally, the accused’s facilitation of drug distribution within Singapore was simply too generic as such a factor would be present in every instance of drug trafficking where the drug is delivered from one point to another. I also noted that the accused’s antecedents were not drug-related, and this therefore did not merit any uplift on the indicative starting sentence. 24 Next, I assessed the mitigating factors raised by the Defence. Both the Prosecution and the Defence accepted that the accused had pleaded guilty and was genuinely remorseful. The Prosecution, however, contended that the plea of guilt had to be assessed in light of the fact that the accused was caught red-handed. Nevertheless, I was inclined to give weight to the accused’s admission of guilt given that the Prosecution had accepted that the accused was genuinely remorseful. As stated inVasentha(supra[20]) at [71], “[m]itigating weight should only be given in deserving cases where it is clear that the admission of guilt was genuinely made out of remorse”. This was a deserving case. 25 I then considered three cases that the Defence relied upon in support of a downward adjustment of the indicative starting sentence. 26 InEsvaran(supra[18]), the 1st accused was to deliver two packets of drugs from Malaysia to two individuals at two different locations in Singapore. He was sentenced to 24 years’ imprisonment and 15 strokes of the cane for possessing 14.99g of diamorphine for the purpose of trafficking. In arriving at this sentence, the High Court observed that the 1st accused was a mere courier acting under the instructions of a co-accused. He had pleaded guilty at an early stage and had no antecedents. In addition, the court had regard to the fact that the accused substantially assisted the CNB to cripple a drug trafficking syndicate that was bringing large quantities of heroin into Singapore and collecting payments of between $10,000 to $20,000 from various customers in Singapore. The 1st accused’s assistance eventually led to the arrests of the 2nd and 3rd accused. 27 Next, inHaiqal(supra[18]), the accused was convicted of three drug-related offences. On the first charge, the accused was sentenced to 23 years’ imprisonment and 15 strokes of the cane for possessing not less than 249.99g of methamphetamine for the purpose of trafficking. In arriving at this sentence, the High Court had regard to the accused’s limited role in the drug syndicate and the accused’s lack of knowledge regarding the operation. Although the drug trafficked inHaiqalwas methamphetamine, the High Court inLoo Pei Xiang Alan vPublic Prosecutor[2015] 5 SLR 500 at [17] held that, given the identical minimum and maximum punishments imposed for both types of drugs under the MDA, “an offender who traffics between 10g and 15g of diamorphine is to be considered as culpable as a person who traffics between 167g and 250g of methamphetamine”. The High Court inVashan(supra[18]) at [22] later remarked that the offender’s young age of 20 years inHaiqal“was a key distinguishing factor”. 28 Finally, I consideredVashan, where the accused pleaded guilty to a charge of importing into Singapore not less than 14.99g of diamorphine under s 7 of the MDA. There, the accused cooperated with the authorities and was genuinely remorseful in pleading guilty. Notwithstanding the fact that the accused concealed the drugs inside his underwear as he entered Singapore, the High Court considered this to be “unsophisticated” and imposed a sentence of 25 years’ imprisonment.  This was lower than the indicative sentencing range for importation or trafficking offences involving 14.99g of diamorphine. An appeal to the Court of Appeal by the accused was dismissed. AlthoughVashanwas technically a case concerning s 7 of the MDA, it was observed inK SaravananKuppusamy v Public Prosecutor[2016] 5 SLR 88 at [4] that “the overall tenor of the punishment provisions for ss 5 and 7 of the Act is similar”. 29 BothEsvaran(supra[18]) andHaiqalwere decided before the appeal inVashan. I consideredVashanto be a more relevant precedent. Having regard to the accused’s culpability, the absence of aggravating factors and the presence of one mitigating factor, I adjusted the custodial sentence downwards to a sentence of 25 years’ imprisonment.",
        "Conclusion": "30 For the reasons above, I imposed a sentence of 25 years’ imprisonment and 15 strokes of the cane and backdated the imprisonment sentence to the date of remand, 26 March 2016. Dedar Singh Gill Judge Terence Chua, Regina Lim and Lu Yiwei (Attorney-General’s Chambers) for the Prosecution;Chia Soo Michael and Soh Hui Bin Hany (MSC Law Corporation) and Sankar s/o Kailasa Thevar Saminathan (Sterling Law Corporation) for the accused."
    }
}