{
    "case_title": "3 Corporate Services Pte LtdvGrabtaxi Holdings Pte Ltd",
    "ncitation": "[2020] SGHC 17",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "Introduction": "1 In Suit No. 682 of 2018 (“this Suit”), 3 Corporate Services Pte Ltd (“the plaintiff”) is suing Grabtaxi Holdings Pte. Ltd. (“the defendant”) for specific performance, alleging that the defendant reneged on an agreement to buy over a domain name “grab.co.id”’ (“the Domain Name”) from the plaintiff for US$250,000. 2 The plaintiff is a Singapore company incorporated on 18 April 2013, whose business (according to searches done with the Accounting and Regulatory Authority) is to provide management consultancy services and the management of web portals. The plaintiff’s sole shareholder and director is Ho Qiyang Mark (“Mark”), who describes himself as an entrepreneur.1Foot Note 1×Mark’s affidavit of evidence in chief dated 3 May 2019 (“Mark’s AEIC”), para 1.Mark is also a director and 50% shareholder of another Singapore registered company called Top3 Media Pte. Ltd. (“Top3”), which was incorporated on 30 July 2009. The other director and 50% shareholder of Top3 is Ho Junyang Michael (“Michael”), who is Mark’s younger brother. According to the plaintiff, Top3’s business is that of a domain registrar and it also designs and develops websites and digital marketing strategies.2Foot Note 2×Mark’s AEIC, para 10. 3 The defendant is part of a group of companies engaged in the business of providing ride-hailing and logistics services under the name GRAB. 4 The defendant was initially a start-up business with an underlying technology platform created for ride-hailing services, and was originally funded by “angel investors”. The genesis of the defendant’s business was the launch of its ride-hailing mobile application (“mobile app”) in Malaysia in June 2012. 5 Subsequently, the defendant secured seed funding from venture capital firms and with its rapid expansion, it has now achieved “unicorn” status (ie, a start-up that is valued at over S$1 billion). 6 The defendant entered the Philippines market on 4 March 2013, Singapore on 14 June 2013, Vietnam on 14 February 2014 and Indonesia on 21 July 2014. The defendant currently operates in 336 cities in eight markets and says it was the leading ride-hailing company in South East Asia by 2013. 7 In Malaysia and the Philippines, the defendant initially operated under the MY TEKSIbrand, while in Singapore, Vietnam and in Indonesia, it operated under the GRABTAXI brand, and now GRAB,using the GRABmobile app as the platform. Presently, the defendant uses the name GRABfor all its ride-hailing operations. The pictures below show the differences between the defendant’s previous GRABTAXI logo (on the left) and the current GRAB logo (on the right).  8 In Indonesia, the defendant has to contend with a competitor in Go Jek,which ride-hailing service was in operation well before the defendant entered the Indonesian market. Go Jek played a role in this Suit as will become apparent from the events narrated below. 9 The defendant registered its GRAB trademarks in the Philippines, Thailand and Malaysia in 2013 and in Indonesia in 20143Foot Note 3×Joyce Agnes Tan Sok Kheng’s affidavit of evidence in chief dated 9 May 2019 (“Joyce’s AEIC”), para 3.2.2.. The registered GRAB trademarks are in various versions and formats including plain and stylised form with and without suffixes added4Foot Note 4×The defendant’s Supplementary Bundle of Documents (“SBOD”), p 42. To-date, the defendant has registered or applied for registration of about 576 trademarks worldwide for the GRAB name.",
        "The facts": "10 The facts set out hereinafter are extracted from the affidavits of evidence in chief (“the AEICs”) of the witnesses of the parties for this Suit and in particular from those of Mark and the defendant’s regional head of business development, Heng Yew Keng Shawn (“Shawn”). 11 Sometime before 19 July 2017, according to the defendant, Mark’s friend (who is also a friend of the defendant’s chief executive officer, Anthony Tan [“Anthony”]) by the name of Priscilla5Foot Note 5×Whom Mark described in court as his “intermediary” (see transcripts of the hearing (“Transcripts”) on 12 June 2019, p 123)approached and informed Anthony that Mark’s company owned the Domain Name which had been registered on 13 May 2014. 12 On or about 21 July 2017, Priscilla sent a WhatsApp message6Foot Note 6×At 2AB10-11.to Anthony to say that her “friend” was willing to sell the Domain Name to the defendant and if not, her “friend” was prepared to sell to “the advertising agency”7Foot Note 7×Shawn’s AEIC dated 6 May 2019 (“Shawn’s AEIC”), paras 20 to 23 and Exhibit “HS-1”.. Anthony responded to Priscilla’s WhatsApp message to say that his team would like to consider the matter, whereupon Priscilla gave him Mark’s contact and followed up with a message that Mark would let it go for US$150,000. She added that “He [ie,Mark] thinks Rajwali [ie,the advertising agency] is going to try and sell the domain to you guys afterwards”, although Mark denied saying this. To put Priscilla’s message in its context, an Indonesian company called PT Rajwali (“Rajwali”) has a substantial interest in Go Jek. Shawn informed the court8Foot Note 8×Transcripts on 14 June 2019, p 430.that Rajwali also owns a taxi business called Rajwali Express. 13 On the same day, Anthony called Shawn. Anthony sent to Shawn a screen shot of his WhatsApp exchanges with Priscilla and told Shawn to prevent the Domain Name from being appropriated by a competitor. Anthony was also concerned that Rajwali might buy the Domain Name and resell it to the defendant at a higher price. Anthony said that if the price that Mark wanted was not unreasonable, the defendant should just purchase the Domain Name. 14 After his conversation with Anthony, Shawn telephoned Mark together with Matias Singers (“Singers”), who is the defendant’s head of marketing technology and operations. By then, Singers had conducted searches and he told Mark that the Domain Name was registered in the name of one Ashwyn Denzil (“Ashwyn”). Mark explained that Ashwyn is an employee of Top3. Mark added that Top3 was related to him and he was one of its directors and shareholders. In the conversation, Mark claimed that he had negotiated with Rajwali to sell the Domain Name to the latter, which negotiations were at an advanced stage, and that the sale was imminent. 15 Mark said that if the defendant was interested, he could offer the Domain Name to it at the indicative price of US$250,000. According to the defendant (but contrary to Mark’s account), Mark had explained that the original price was US$150,000 but he needed the additional US$100,000 as “undertable”money as his Indonesian counterpart had a deal with Rajwali9Foot Note 9×Shawn’s AEIC, para 32.. 16 Mark made it clear to Shawn that the deal had to be closed by the following day (ie, 22 July 2017) as otherwise, Rajwali would make a counter-proposal to Mark’s Indonesian counterpart after which “we may not be able to sway him”10Foot Note 10×Shawn’s AEIC, para 33.. Shawn told Mark he would revert after speaking to Anthony. 17 Shawn then had internal discussions with Anthony, Singers and others via a WhatsApp chat group. Shawn asked Anthony if he was comfortable with Mark’s indicative price of US$250,000, to which Anthony indicated he wanted to understand the situation more. Singers was of the view that Rajwali’s intention to acquire the Domain Name was adverse to the defendant but he also felt that Mark was trying to “squeeze” the defendant.11Foot Note 11×Shawn’s AEIC, para 39.Singers thought it best to “bite the bullet” and to have nothing to do with Mark or his companies12Foot Note 12×Shawn’s AEIC, para 39.. 18 After hearing all the views expressed by the others, Anthony instructed Shawn to close the deal. Shawn texted Mark to say the defendant was prepared to pay US$250,000 for the Domain Name. Shawn indicated the defendant would prepare the paperwork and arrange for payment in the following week. In order to prepare the paperwork, Shawn inquired of Mark if the transaction would be with Top3; Mark replied it would be with the plaintiff. 19 Shawn and Mark continued with their WhatsApp discussions on the following day. Thereafter, the defendant prepared a letter of offer (“the Offer Letter”) signed by Shawn, addressed to the plaintiff13Foot Note 13×Plaintiff’s Agreed Bundle of Documents (“1AB”), pp 237-238.on the same day in the following terms: OFFER TO PURCHASE DOMAIN NAME : GRAB.CO.ID We refer to the matter above and the recent discussions between you and our Mr. Shawn Heng. In view of the necessary formalities involved in a transaction for the purchase and transfer of a domain name, this letter serves to confirm our intention to purchase the Domain Name from you for the agreed sum of USD250,000, inclusive of tax (the “Purchase Sum”). This letter shall be followed by:- (a) A formal sale and purchase agreement between us to formalize the transaction; (b) An escrow agreement to transfer the Purchase Sum to a counsel of your choice as escrow, with the instruction to release it fully to you upon the complete verification of the Domain Name AND the transfer of the Domain Name to us. Our offer to purchase as stated above shall be subject to the following terms and conditions:-  (1) A satisfactory verification process with the relevant agency/body as stated in para (b) above evidencing that the Domain Name is unencumbered and registrable to us; (2) Successful transfer of the Domain Name to us; (3) Upon your acceptance of this offer to purchase you shall not nor permit any of your Subsidiaries or affiliates or any of its or their directors, officers, employees, agents or representatives to negotiate, authorize, recommend, enter into or propose to enter into, with any person other than the Purchaser a sale and purchase transaction or assignment of the Domain Name; and (4) You shall keep the terms herein strictly confidential. We affirm that this offer to purchase is a binding offer subject to the preceding paragraphs. Please confirm your acceptance of the terms above by signing the duplicate copy of this letter. I will refer to sub-paragraphs (1), (2), (3) and (4) of the Offer Letter as the “first”, “second”, “third” and “fourth preconditions” respectively. 20 On 23 July 2017, Ashwyn on behalf of the plaintiff signed the acceptance portion of the Offer Letter as “Regional Manager”. Mark then returned the Offer Letter to Shawn. 21 Shawn did not sign and give a copy of the Offer Letter immediately to Mark. He sensed that Mark was pushing for the deal to be closed urgently so he withheld the document. 22 On 25 July 2017, Mark messaged Shawn at 6.48am to say, “Need the document signed before I go to jkt? Possible?” Shawn responded saying he was sending the Offer Letter to Mark and which he did. 23 Thereafter, Shawn requested his in-house legal counsel Alex Lee Kok Hoong (“Alex Lee”) to send the matter to lawyers to prepare the sale and purchase agreement (“SPA”) and the escrow agreement. 24 Having received draft copies of the SPA and the escrow agreement, Shawn inquired of Mark his email address on 28 July 2017 so that he could forward the documents to Mark. Mark responded saying his email address was “13@1318.com.sg” which Shawn thought was rather suspicious as the email address had neither Mark’s name nor the plaintiff’s name.14Foot Note 14×Shawn’s AEIC, paras 61-62.Mark also requested for the transaction to be “closed sooner” as he was selling his company. Shawn emailed the draft documents to Mark that evening. 25 On 7 August 2017, Mark called Shawn stating that due to clause 7 of the draft SPA, Mark would have to stop using and change various GRABdomain names that he had registered in other countries. The relevant extracts of clause 7 of the draft SPA state15Foot Note 15×1AB, p 269.: 7. PROTECTIVE COVENANTS (a) In order to assure the Buyer of the full benefit of the Domain Name, the [plaintiff] covenants with the [defendant] that it shall not and shall procure that no other member of the [plaintiff’s] Group for the time being shall after Completion use or (insofar as it can reasonably do so) allow to be used: (i) any trade name, trade or service mark, business or domain name, design or logo used by the [defendant’s] Group as at Completion; (ii) any other name, mark, domain name, design or logo intended or likely to be confused with any trade name, trade or service mark, business or domain name, design or logo used by the [defendant’s] Group as at Completion; or (iii) any other trade name, trade or service mark, business or domain name, design or logo that is intended or likely to be confused with the Domain Name. 26 As such, Mark offered to sell to the defendant all the GRAB domain names in the other countries as well. 27 Shawn texted Mark to inquire his asking price for the domain names registered in Philippines and Vietnam. Mark responded that the plaintiff controlled the following domain names: (a)“www.grab.com.sg” (registered in Singapore); (b)“www.grab.com.vn” (registered in Vietnam); and (c) “www.grab.ph” (registered in the Philippines). (hereinafter collectively referred to as “the Other Domain Names”). Mark offered to sell each of the Other Domain Names for US$250,000, or US$1m for all four domain names. Shawn indicated he would discuss Mark’s proposal internally and revert. 28 Shawn discussed Mark’s offer with Singers and Anthony via WhatsApp chats. Searches that the defendant conducted, however, found no trace of the plaintiff as the registrants for the domain names registered in Philippines and Vietnam, or in fact, of any registrants at all for the said domain names. 29 Shawn proposed the following options for the defendant16Foot Note 16×Shawn’s AEIC, para 70.: (a) Accept Mark’s offer to sell the Domain Name along with the Other Domain Names, amend the SPA accordingly and include a provision that Mark cannot sell his agency to Rajwali and must sign the SPA by 14 August 2017; or (b) Call Mark’s bluff and walk away from the deal. 30 The upshot of the WhatsApp discussion was that it was agreed that the defendant would hold off on the transaction on the Other Domain Names until it could verify that the plaintiff was indeed the registrant of the Other Domain Names. Ultimately, Anthony decided not to proceed with the purchase of the Other Domain Names. 31 On 11 August 2017, Shawn conveyed Anthony’s decision to Mark, who responded on the same day by reducing the price of the Other Domain Names to a total sum of “100k” as “the [SPA] has a clause that will effectively mean [the plaintiff] can’t use those other 3 domains in future”17Foot Note 17×Shawn’s AEIC, para 74 and Exhibit “HS-14”.. 32 Shawn responded on 14 August 2017 to say he could not make any promises on the Other Domain Names and requested that Mark sign the SPA first. On 16 August 2017, Mark informed Shawn that the SPA had been signed by Ashwyn and sent back to Shawn. 33In the interval, Singers discovered that the plaintiff and/or Top3 had registered more than 1,000 domain names, including: (a) “www.go-jek.com.sg”, (b) “www.toyotaharrier.com.sg”, (c) “www.ubereats.com.sg” and (d) “www.amyswinehouse.com”. 34 Sometime on or around 8 September 2017, Priscilla contacted Anthony via WhatsApp to find out the progress of the matter. She volunteered the information that the plaintiff and/or Mark also owned the domain name “grab.co” in Singapore, Philippines, Vietnam and possibly Malaysia. 35 The defendant felt that Mark’s dealings raised too many questions. Hence, on 12 September 2017, it decided not to proceed with the purchase of the Domain Name. Shawn called to inform Mark of the defendant’s decision on 13 September 2017. Mark expressed his disappointment and explained that because of his gentlemen’s agreement with the defendant, the plaintiff never proceeded with and had lost its potential deal with Rajwali. 36 Shawn followed up on his conversation with Mark on 13 September 2017 by sending a formal letter of termination on the same day to the plaintiff.18Foot Note 18×1AB, p 371.The plaintiff gave a lengthy reply dated 22 September 201719Foot Note 19×1AB, pp 382-385.signed by Ashwyn. In essence, the plaintiff said: (a) By the second main paragraph of the Offer Letter, there was a final and binding agreement for the plaintiff to sell and for the defendant to purchase the Domain Name; (b) The Offer Letter was followed by the plaintiff’s signing of the SPA; (c) The only conditions applicable to the sale and purchase transaction were those set out under sub-paragraphs (1) to (4) of the Offer Letter20Foot Note 20×See [19] above.; (d) The Offer Letter did not require that the Domain Name must be registered to the plaintiff, only that it must be unencumbered and registrable to the defendant. The Domain Name was in fact unencumbered and registrable to the defendant; and (e) The plaintiff was willing, ready and able to assign or transfer the Domain Name, but the inference to be drawn from the defendant’s letter of 13 September 2017 was that the defendant was not able or willing to complete the sale. The plaintiff then gave a deadline of 27 September 2017 for the defendant to confirm it would comply with its obligations under the Offer Letter, failing which the plaintiff would take the necessary steps to enforce its rights. 37 The plaintiff’s above letter is so well crafted that the court was certain21Foot Note 21×Transcripts on 14 June 2019, p 526.(with which surmise the plaintiff’s counsel did not disagree) that Ashwyn was not the author and that it must have been drafted by Mark’s solicitors. 38 The defendant did not comply with the deadline given by the plaintiff in its letter at [36]. Consequently, the plaintiff’s solicitors wrote to the defendant on 13 October 2017 demanding compliance within seven days from the defendant with the Offer Letter, failing which proceedings would be commenced to enforce the plaintiff’s rights. 39 The defendant decided that it would let its solicitors take over conduct of the matter since the plaintiff had appointed solicitors. Accordingly, on 26 October 2017, the defendant’s solicitors responded by pointing out that their clients’ Offer Letter was subject to four preconditions22Foot Note 22×See [19] above.of which the third presupposed that the plaintiff already owned the Domain Name as that precondition prevented the plaintiff from selling the same to anyone else pending completion of the sale to the defendant. Further, the verification process under the first precondition was not satisfactory because the defendant discovered that the plaintiff did not own the Domain Name. 40 The defendant’s solicitors said the defendant’s Offer Letter was not accepted by the plaintiff and the defendant had withdrawn the same. They added that the defendant’s view was reinforced by the fact that after the sale of the Domain Name fell through, the plaintiff made a fresh offer to sell to the defendant the four domain names for Singapore, Vietnam and Philippines, as well as the Domain Name for Indonesia, which the plaintiff would not have done if there was already a contract for the sale of the Domain Name. 41 In the reply dated 30 November 2017 from the plaintiff’s solicitors to the above letter, the plaintiff denied the defendant’s allegations. Nothing concrete resulted from the correspondence exchanged between the parties’ solicitors. 42 Subsequently, Shawn discovered that the domain name “Gojek.com.sg” was or is registered in the name of a company, 3RR Capital Investment Ltd (“3RR”) and that the administrative contact person of 3RR is Yan Li Jan Lee (“Lee”) who is the wife of Mark’s brother Michael. As for “www.grab.com.sg”, Shawn discovered that this domain name was registered by Clay Branding Pte Ltd (“Clay”), whose administrative contact is Michael and whose sole shareholder is Lee.",
        "The pleadings": "43 The plaintiff filed Originating Summons No. 210 of 2018 on 14 February 2018 (“the OS”) against the defendant praying, inter alia, for the following reliefs: (a) a declaration that there is a binding contract between the plaintiff and the defendant for the transfer of the Domain Name to the defendant for a sum of US$250,000 to be paid by the defendant to the plaintiff; (b) a declaration that the defendant has breached the said contract by refusing/failing to pay the sum of US$250,000 to the plaintiff; and (c) an order that the defendant does forthwith pay to the plaintiff the sum of US$250,000. 44 The defendant was of the view that an originating summons procedure was inappropriate to determine the dispute between the parties and that a trial was necessary. As such, the defendant’s solicitors wrote to the plaintiff’s solicitors on 2 March 2018 to inquire whether the plaintiff would voluntarily agree to convert the OS to a writ form. The plaintiff’s solicitors’ reply dated 13 March 2018 disagreed with the defendant’s position. 45 Consequently, the defendant applied to court on 19 March 2018 (“the Stay Application”) with a supporting affidavit from Alex Lee and obtained on 18 April 2018, an order that the OS be continued as if it were begun by Writ of Summons. The plaintiff’s appeal against the granting of the Stay Application was dismissed on 18 June 2018. 46 The plaintiff consequently filed its statement of claim on 5 July 2018.  In the statement of claim, the plaintiff alleged that the Offer Letter constituted a binding agreement for the defendant to buy over the Domain Name from the plaintiff for US$250,000. The plaintiff also referred to several WhatsApp messages exchanged between Mark and Shawn to support its position that there was a binding agreement between the parties. 47 The plaintiff added that the Offer Letter was followed by the SPA from the defendant which the plaintiff also signed. 48 The plaintiff alleged that the defendant wrongfully repudiated the agreement reached between the parties by their letter dated 13 September 2017. The plaintiff averred that the plaintiff and Top3 remained ready, willing and able to do all things necessary to effect the transfer of the Domain Name to the defendant. 49 The plaintiff claimed specific performance from the defendant of the agreement incorporated in the Offer Letter, and in the alternative, damages for breach of contract in the sum of US$250,000. 50 The defendant put up a robust defence to the plaintiff’s statement of claim. In the defence, the defendant denied it was in breach of contract and pleaded that: (a) The plaintiff has an issued and paid-up capital of just S$100; (b) Unknown to the defendant, the plaintiff’s sole director and shareholder Mark at all material times owned 500,000 shares in Top3 with his brother, Michael, owning the balance 500,000 shares; (c) The defendant at all material times did not know that the Domain Name was not owned by the plaintiff but by Top3; (d) There were discussions, including but not limited to, WhatsApp messages between Mark (on behalf of the plaintiff) and Shawn (on behalf of the defendant) between 21 and 22 July 2017 with regard to the proposed sale of the Domain Name by the plaintiff to the defendant; and (e) Following the discussions, the defendant drafted the Offer Letter to purchase the Domain Name from the plaintiff for US$250,000. 51 The defendant averred that the Offer Letter was subject to four preconditions and the third precondition required the plaintiff to own the Domain Name at the time the Offer Letter was accepted by the plaintiff. Only if all the preconditions were satisfied would the parties draw up a formal SPA. 52 The defendant contended that the plaintiff did not satisfy the third precondition as the Domain Name was at all material times (including 22 July 2018, which is the date of the Offer Letter, and 23 July 2018, when the plaintiff purported to accept the Offer Letter) owned by Top3 and not the plaintiff. 53 The defendant contended that when it became clear that the plaintiff did not satisfy the preconditions, terms and conditions of the Offer Letter, no question of entering into a formal SPA arose and the defendant declined to do so. The defendant cannot therefore be in breach of contract and the plaintiff could not have suffered any loss and/or damage for breach of contract. 54 The defendant went further to allege that the plaintiff was engaged in cybersquatting, which is contrary to public policy, and any contract entered into between the plaintiff and the defendant is unenforceable. In elaborating on this allegation, the defendant averred that: (a) The plaintiff uses or otherwise benefits or seeks to benefit from the Domain Name, which is identical or confusingly similar to a name, trademark or service mark of the defendant. The plaintiff must have known that the name GRAB is associated with the ride-hailing and other services provided by the defendant; and (b) The plaintiff is engaged in a scheme with Top3 to be registered as the owner of numerous domain names, which include well-known names of companies or personalities, as a pre-emptive measure to hold the names and demand extortionate amounts from these companies and personalities at a later date. In furtherance of the scheme, Top3 had registered domain names such as “Go-Jek.com.sg”, “Amyswinehouse.com.sg”, “ToyotaHarrier.com.sg” and “f1Auto.sg”. 55 The defendant referred to the plaintiff’s attempts in late July/early August 2017 to sell to the defendant the GRAB domain names for Singapore, Vietnam and the Philippines as further evidence of the plaintiff being cybersquatters.",
        "The evidence": "56 Mark was the plaintiff’s principal witness. Its other factual witness was Ashwyn. Shawn and Singers were the defendant’s factual witnesses while their last and expert witness was Joyce Agnes Tan Sok Kheng (“Ms Tan”). The plaintiff did not have a comparable expert witness.",
        "(a) The plaintiff’s case": "57 In his AEIC dated 3 May 2019 (“Mark’s AEIC”), Mark deposed that his business entered the Indonesia market through an Indonesian friend Deddy Johari (“Deddy”) who introduced him to Tommy Fabianus (“Tommy”). He deposed it was Tommy who came up with the idea of using “Grab!” as a tagline for branding purposes. Although it is a generic word, Mark agreed as it sounded “catchy” and “vibrant”. The court notes, however, that the “catchy” and “vibrant” “Grab!” tagline does not appear on the plaintiff’s website in Singapore.23Foot Note 23×Ashwyn’s AEIC dated 3 May 2019, Exhibit AD-1. 58 In cross-examination24Foot Note 24×Transcripts on 12 June 2019, p 70., Mark claimed that the plaintiff’s registration of “Grab” had nothing to do with the defendant’s GRAB mark. Mark was unaware (until told by the defendant’s counsel in the course of cross-examination) that the defendant had registered their trade name and trademark GRABTAXI in Singapore on 26 March 2014. 59 Tommy and Mark incorporated PT MMT International Indonesia (“PT MMT”) on 28 August 2014. The company’s focus was on design work for advertising campaigns and it used as brands GRAB and/or GRAB ESSENTIALS! for that purpose, with the latter being used for smaller budget projects and clients. 60 After Top3 registered the Domain Name (on 13 May 2014), it set up in or about November 2014, two websites both using the Domain Name, one for the brand GRAB and the other for GRAB ESSENTIALS! Top3 also set up social media accounts on the Twitter, Facebook and Instagram applications. 61 Mark deposed that with a local partner, Top3 established a Vietnamese office in 2014-2015 in Ho Chi Minh City and registered the domain name “grab.com.vn”. Unfortunately, the business failed due to issues with the Vietnamese partner. He exhibited in his AEIC two photos that purportedly showed Top3’s office in Ho Chi Minh City. However, the court pointed out to Mark that the office could well have been the plaintiff’s Singapore office or anywhere else as there was no signage or street front shown to prove that it was indeed located in Ho Chi Minh City. 62 Mark claimed that Anthony had made the initial approach to him through Priscilla, a mutual friend, and not vice versa25Foot Note 25×Mark’s AEIC, para 94.. By then (in June or July 2017), Tommy had orally informed him that an Indonesian company Rajwali, through another company Rajwali Advertising, wanted to purchase the GRAB ESSENTIALS! business, as well as its intellectual property, from PT MMT.  Mark exhibited in his AEIC a draft letter of intent in the Indonesian language26Foot Note 26×The English translated version can be found at Mark’s AEIC, pp 308-309.from Rajwali Advertising dated 16 August 2017. The purchase price offered by Rajwali Advertising for GRAB ESSENTIALS! was S$75,000.  The court will return to this letter of intent later in its findings. 63 Not surprisingly, Mark in his AEIC27Foot Note 27×Mark’s AEIC, paras 69-84.alleged that the defendant reneged on the Offer Letter and their purchase of the Domain Name. 64 When cross-examined on the reason(s) he, his brother and his brother’s wife registered more than 1,000 domain names, Mark said it was part of Top3’s domain investment activities and partly for internet traffic. He added that Top3 buys generic names. However, that would certainly not include “go-jek.com.sg”. According to the defendant’s submissions28Foot Note 28×The defendant’s submissions dated 4 September 2019 (“defendant’s submissions”), para 241., “gojek” is a portmanteau consisting of “go” and “Ojek” which is the Indonesian word for “motorcycle taxi”. 65 Counsel for the defendant pointed out to Mark that “Amy Winehouse” isnota generic name, but that of a famous British singer who died on 23 July 2011.  The domain name “amyswinehouse.com.sg” deliberately misspelt the late singer’s name as “Amys Winehouse”. In his AEIC,29Foot Note 29×Mark’s AEIC, paras 109-110.Mark deposed as follows on the misspelt name of the late singer: 109. [Top3] registered the domain name “amyswinehouse.com.sg” on 12 June 2016. [Top3] registered this domain because it had the potential to generate internet traffic when fans searched for information or fan pages on Amy Winehouse, especially if they misspelled “Amy Winehouse” as “Amys Winehouse”. This would be useful for pay per click advertising. ... 110 However, there was no scheme to demand extortionate amounts from, or pass off as, Ms. Winehouse’s estate. Ms Winehouse had passed awayfive (5) yearsbefore [Top3] even registered the domain name “amyswinehouse.com.sg”.  [Top3] has never tried to sell or monetize this domain name. I do not think her estate would be interested in a Singapore domain name but if there were a legitimate request by the estate to transfer the domain name, we would have complied. [emphasis in original] 66 The above paragraphs from Mark’s AEIC were a direct response to the defendant’s defence30Foot Note 30×See [53(b)].and the supporting affidavit filed by the defendant’s witness Alex Lee31Foot Note 31×See [44] .on 19 March 2018 in support of the Stay Application where he deposed that the plaintiff appears to be in the business of cybersquatting. Alex Lee considered32Foot Note 32×Alex Lee’s affidavit dated 19 March 2018, paras 14-17.cybersquatters a nuisance who generally have no interest in developing the domain names they squat on, and the sole reason that cybersquatters acquire domain names is to allow them to transfer or rent it to the owners of the relevant businesses bearing the names they cybersquat on for profit. 67 When Mark was first questioned on the misspelling of the domain name “amyswinehouse.com.sg”, he initially claimed33Foot Note 33×Transcripts on 12 June 2019, p 51.that the person who registered it made a mistake until he was confronted with paragraph 109 of his own AEIC. It was during Ashwyn’s cross-examination34Foot Note 34×Transcripts on 13 June 2019, p 300.that the court was told that the domain name “amyswinehouse.com.sg” generated “up to maybe half a million clicks” before Top3 decided to shut it down. 68 The court notes that other non-generic domain names35Foot Note 35×Shawn’s AEIC, Exhibit “HS-16”.registered by Top3 or the plaintiff included “toyotaharrier.com.sg” and “toyotaharrier.sg”. In regard to “toyota.harrier.com.sg”, Mark claimed it was to assist his car servicing and repair business known as F1 Autos Pte Ltd (“F1 Auto”). His answer would not explain why “ubereats.com.sg” is registered in the name of F1 Auto.  UberEats is part of the world-wide Uber ride-hailing group (whose South East Asian operations were taken over by the defendant in early 2018).  Nor would it explain why one of Mark’s or Michael’s companies36Foot Note 36×Singers’s AEIC, para 48 and Exhibit at p 137registered the domain names “morphyrichards.com.sg” and “morphyrichards.sg”.  Morphy Richards is a well-known British manufacturer of kitchen appliances (such as kettles and toasters) and home appliances (such as irons) with a market presence in Singapore. Its name is a registered mark worldwide. 69 The domain names set out in [68] have nothing to do with the businesses of Top3 or the plaintiff either. Neither would such domain names as “crowdfunding.com.sg” and “newbmw7series.com.sg” registered by Top3 on 14 May 2016 and 12 May 2017 respectively37Foot Note 37×Singer’s AEIC, exhibits at pp 108 and 41.. It is debatable whether F1 Auto can be said to have an honest intent in registering the domain name “newbmw5series.com.sg” on 19 May 2017. The court surmises that registration of this domain name was probably tied to the German automobile manufacturer’s launch and sale of its new 5 series models in 2016/2017. 70 The court further notes that another misspelt domain name registered by Mark on 19 March 2017 is “gooogle.com.sg”, obviously to ride on the popularity of the world’s leading search engine Google, and to take advantage of internet users who inadvertently misspell the word “google”. The court can only surmise that Mark did it for the same reason that he misspelt Amy Winehouse’s name,ie,to charge internet users on a “pay per click” basis should they inadvertently access the website (see [65] above). 71 Questioned by the court as to why Michael registered the domain name “Go-jek.com.sg” as it is well known that Go Jek is the biggest raid-hailing company in Indonesia, Mark (after first saying Michael did not inform him) finally admitted that Michael thought “maybe Go-jek would approach him”38Foot Note 38×Transcript on 12 June 2019, p 28.. He agreed with the court that that would have been a good opportunity. 72 Mark added that although he started Top3, it is Michael, not he, who runs the company39Foot Note 39×Transcripts on 12 June 2019, p 29. In its reply to the defendant’s defence, the plaintiff had pleaded that Top3 set up PT MMT as an Indonesian arm to its business.40Foot Note 40×Plaintiff’s Reply dated 3 August 2018 (“Reply”), para 7(b).By the time the trial came on, however, it appeared that Mark and/or his brother had fallen out with PT MMT41Foot Note 41×Transcripts on 12 June 2019, p 35-37.. Apparently, PT MMT wanted to sell the Domain Name to Rajwali whereas Mark had agreed to sell it to the defendant before the deal was terminated. 73 Mark claimed that Top3 had built up GRAB as a brand for its business in Indonesia. He also said that for a short time, Top3 used the domain name “grab.com.sg” for a few months in Singapore on a “pay per click” basis but stopped when the website did not take off. Mark agreed that Top3’s business in Indonesia and Singapore has nothing to do with ride-hailing. 74 I turn next to Ashwyn’s evidence. In his AEIC dated 3 May 2019 (“Ashwyn’s AEIC”), Ashwyn who is the sales director of Top3, deposed that Top3 was a Google partner and Google Advertisements (“Ads”) accredited entity between 2015 and 2017. As a Google partner and an accredited Google Ads entity, Top3 acted as an intermediary between Google and Top3’s clients who wished to utilise Google Ads’ services. He disclosed that Top3 employed “pay per click marketing” independently of Google. Further, Top3 would register domain names and/or develop websites that were likely to generate traffic. Top3 would allow entities and/or clients to advertise on these domain names which were usually charged based on the number of “clicks” from the public that originate from the domain names. It could also employ such advertisements on other websites as part of a marketing strategy for its clients. 75 Ashwyn deposed that Top3 is also an accredited registrar of the Singapore Network Information Centre (“SGNIC”), the official body of the Infocomm Development Authority which is responsible for authorising and regulating the registration, administration and management of domain names in Singapore. When a party wishes to purchase and register a domain name in Singapore, it will approach an accredited registrar like Top3 in order to purchase the domain name from SGNIC which is the registry. As a SGNIC registrar, Ashwyn deposed that Top3 had registered hundreds of domain names both for and/or on behalf of companies and individuals. It was Ashwyn’s evidence that besides being the registrar, Top3 can also be an applicant and register domain names in its own right. 76 Ashwyn said that Top3 has also registered various “sg” domain names as a form of investment. The court views this statement as a gross understatement as Top3 registered (according to Singers’ AEIC dated 6 May 2019 (“Singers’ AEIC”))42Foot Note 42×Singer’s AEIC, para 48.1,232 domain names in its own right. 77 There is one aspect of Ashwyn’s evidence which the court finds most illuminating. In his AEIC43Foot Note 43×Ashwyn’s AEIC, para 26., Ashwyn quoted the following extract from an article (which he exhibited) from Forbes Technology Council dated 29 May 2018, titled “Exact-Match Domain Names And Why Investors Value Them”: When selecting your domain, it’s also wise to consider an exact-match domain. What are these? They are domains that use the exact keywords that best represent your brand or products. Obviously, the best exact match domain names end in .com. Good examples of this are Hotels.com, Cars.com or Apartments.com. In fact, the Hotels.com domain was one of the most expensive domain name purchases of all time, according toBusiness Insider-- it sold in 2003 for $11 million. A visit to this domain quickly reinforces that it’s an exact match for the product it offers: The website helps users find a hotel room at a competitive price in any city across the world. The search engine benefits of this domain are omnipresent. A quick Google search for “hotels” reveals that Hotels.com is the top organic result, which leads to hundreds of millions of free, new users for their brand each year. … Another example is Insurance.com, which sold for $35.6 million in 2010. Run a Google search for “insurance” and it’s the top organic result. 78 Ashwyn then dealt with cybersquatting. He said44Foot Note 44×Ashwyn’s AEIC,paras 30-32.the word “commonly refers to the practice of registering well-known trademarks as domain names, withnointentionof creating a legitimate website, in order to sell the domain name to the trademark owner at an exorbitant price” [emphasis in original]. He stated that there is a distinction between cybersquatting and domain investing. As he is not an expert on this area, Ashwyn referred to articles he had searched on, and downloaded from, the internet – namely, extracts from Wikipedia and from two US websites (one of which appeared to be maintained by Colorado lawyers) on domain speculation, domain investment and cybersquatting. Ashwyn added that cybersquatting is not illegal in Singapore or Indonesia but it can be the basis for disputing the registration of a domain name. In Singapore, the dispute resolution procedures for domain name disputes come under the auspices of SGNIC whilst in Indonesia, the equivalent authority is known by its acronym “PANDI”. 79 In regard to the unsuccessful sale of the Domain Name to the defendant, Ashwyn deposed he signed the Offer Letter on behalf of the plaintiff as instructed by Mark on or about 23 July 2017. 80 During cross-examination45Foot Note 45×Transcripts on 13 June 2019, pp 252-276, Ashwyn told the court that not being legally qualified, he was only making a statement (and not offering his opinion) on the provisions for dispute resolution under PANDI or Indonesian law pertaining to cybersquatting. He agreed he was a factual witness for the plaintiff. That being the case, the court will ignore Ashwyn’s testimony where he expressed his views on the law in Indonesia or in Singapore – he is not qualified to give his opinion. 81 Ashwyn confirmed he was never employed by the plaintiff. Questioned by the defendant’s counsel why he had accepted the Offer Letter as “Regional Manager” on behalf of the plaintiff, Ashwyn said he was appointed as an authorised representative for that particular transaction only. The court pointed out to Ashwyn that his signature along with the stamp of the plaintiff affixed thereon seemed to suggest that he was accepting the defendant’s offer on behalf of the plaintiff. Ashwyn’s unhelpful answer was that he was following Mark’s instructions when he signed and put his designation on the document. 82 Ashwyn’s attention was then drawn to the plaintiff’s letter dated 22 September 201746Foot Note 46×See [36] above.that he had also signed. He testified that again it was Mark who requested him to sign the letter. In the SPA, Ashwyn also signed on behalf of the plaintiff, again at Mark’s request. 83 Although his name appeared as the registrant for the Domain Name, Ashwyn explained that only corporate entities, not individuals, can be registrants in Indonesia for domain names. His name was on the register as the contact person as at 21 July 2017, succeeding Deddy. 84 Ashwyn’s attention was also drawn to an extract from a Wikipedia article titled “Domain name speculation” (that he exhibited at pages 242 to 249 of his AEIC) and to the following passage in particular:47Foot Note 47×Ashwyn’s AEIC, pp 242-249. Cybersquatting is defined as registering, trafficking in, or using a domain name with bad faith intent to profit from the goodwill of a trademark belonging to someone else. The key element in this definition is that the intellectual property rights of another’s trademark are infringed by the cybersquatter. He agreed with the defendant’s counsel48Foot Note 48×Transcripts on 13 June 2019, p 283.that using someone else’s trade mark and registering it as a domain name would amount to cybersquatting. 85 Ashwyn’s attention was further drawn to other extracts from articles he had exhibited to his AEIC, including the following extract from an article dated 25 August 2018, titled “Our Colorado IP Lawyers Discuss Domain Name Disputes & Cybersquatting”, published at a website which appeared to be maintained by Colorado lawyers:49Foot Note 49×Ashwyn’s AEIC, pp 262-263. … Cybersquatting is not to be confused with legal domain investing, though there is certainly a fine line between them. Those in the business of domain investing liken the practice to the buying and selling of physical real estate. In a nutshell, domain investors buy and sell nontrademarked domain names, monitoring global trends and consumer patterns to help them learn what to buy, when to buy it and when to sell it. Cybersquatters by comparison intentionally buy domains for trademarked names or a variation of a trademarked name, for example, the trademark name spelled with a typo. Again, there is a fine line between legal domain investing and cybersquatting, so those participating in an honest investing business should be well versed in the regulations and policies laid out in the ACPA, by the World Intellectual Property Organization (WIPO) and by the Internet Corporation for Assigned Names and Numbers (ICANN). 86 Ashwyn agreed with counsel during cross-examination that:50Foot Note 50×Transcripts on 13 June 2019, pp 289-290. (a) A cybersquatter would use names of famous businesses or personalities to register domain names; (b) Sometimes, the cybersquatters would also use trademarked names; and (c) When the opportunity arises, they will sell the domain names at a profit. 87 Ashwyn however defended the behaviour referred to in [86(c)] above as “an allowed [domain] speculation”.51Foot Note 51×Transcripts on 13 June 2019, pp 291-297.He contended it was not illegal – the domain owner can transfer the domain name to the trademark owner when approached to do so by the latter. If the trademark owner is unaware of the registered domain name bearing its trademark, Ashwyn said the domain name can be used by the registrant to generate traffic and revenue on a “pay per click basis”. Applying his answer to Top3’s registration of the domain name “Go-jek.com.sg”, Ashwyn saw nothing wrong in Top3’s action, maintaining it was domain speculation on the part of Top3 and not “predatorial cybersquatting” as the defendant’s counsel suggested to him52Foot Note 52×Transcripts on 13 June 2019, pp 295.. Ashwyn countered that it would amount to cybersquatting only if Top3 tried to sell the domain name to Go Jek when the opportunity arose, which it never did. 88 Despite the fact that the defendant’s trade name GRAB is ubiquitous in Singapore (where he is based) as well as in South East Asia, Ashwyn claimed that he is only aware of the defendant’s raid-hailing business being operated as GRABTAXI. He seemed unaware that GRABTAXI was rebranded as GRAB on 28 January 201653Foot Note 53×1AB, p 83.and all the defendant’s then services encompassing taxis, private car services and motorcycle taxis came under the GRAB umbrella brand.",
        "(b) The defendant’s case": "89 The defendant’s first witness Singers is the company’s current head of marketing technology and operations. His responsibilities include the acquisition of domain names for the defendant, which explains his involvement in the aborted SPA with the plaintiff. His testimony was uncontroversial. 90  Singers deposed in his AEIC54Foot Note 54×Singers’ AEIC, paras 26-27.that the defendant’s initial willingness to buy the Domain Name from the plaintiff was not because the defendant intended to use the Domain Name itself but more for brand protection and to stop the Domain Name from going to a competitor like Rajwali or Go Jek. Singers explained that the defendant already owns what can be termed the primary domain name,ie,“grab.com” (“the Primary Domain Name”). It did not need the Domain Name in any case as the ride-hailing service and business was generated through the defendant’s mobile app. 91 Singers explained that if the defendant did own the Domain Name, internet users who clicked on it would be re-directed to the Primary Domain Name. The same scenario would apply if the defendant own the domain name “grab.com.sg” registered by Clay. 92 Nothing turns on the testimony of Shawn.  As stated earlier55Foot Note 55×See [10] above., the facts leading to the OS and this Suit were mainly extracted from his AEIC. Shawn’s cross-examination did not cast doubts on or change the defendant’s case. He explained why the defendant decided to terminate the Offer Letter. He testified that there were a number of red flags that caused the defendant to feel uneasy about the transaction, the chief of which were: (a)the defendant had no way of verifying Mark’s claim that Rajwali had made an offer to buy the Domain Name; (b)the fact that the registered owner of the Domain Name was changed from Deddy to Ashwyn on the very day he was negotiating terms with Mark; (c)the defendant was asked to contract with the plaintiff which was not related to Top3 (save for the fact they had a common director in Mark) nor was it related to Ashwyn who was signing on behalf of the plaintiff; (d)Mark had used an email address ending in “1318.com.sg” which had nothing to do with Top3 or the plaintiff; (e)the fact that Mark was pressing for the parties to sign and conclude the agreement within a matter of days; (f)the fact that Mark asked for US$1m for the Other Domain Names which existence the defendant was unaware of until 9 August 2017, which made Shawn feel that the defendant was being fleeced; (g)the defendant’s distrust of Mark increased when he quickly dropped his price of US$750,000 for the Other Domain Names to US$100,000; it felt that he was trying his luck; (h)the defendant was never satisfied that ultimately the plaintiff was the right contracting party and that the plaintiff could actually transfer the Domain Name to the defendant; and (i)the re-emergence of Priscilla after Mark had offered to sell the Other Domain Names. She had never been part of the process after her initial introduction of Mark to Anthony, and the defendant started to question what her role was in the entire situation given she had no interest in the matter. 93 The court next turns its attention to the testimony of the defendant’s expert and last witness. Ms Tan is a lawyer with 35 years’ of experience whose practice focusses on intellectual property and technology. Her credentials include being: (a) a panellist of Dispute Resolution Service under the Singapore Domain Name Dispute Resolution Policy” (“SDRP”); (b) a neutral of the World Intellectual Property Organisation (“WIPO”); (c) a neutral of the Trademark Mediators Network and International Trademark Association; and (d) an author or co-author of innumerable articles and/or papers pertaining to intellectual property and technology. 94 She is eminently qualified to be an expert under O 40A of the Rules of Court (Cap 322, R5, 2014 Rev Ed). 95 Ms Tan’s brief from the defendant was to address these issues: (a) On the assumption that the disputed Offer Letter is an enforceable agreement, whether the agreement may be rendered unenforceable for public policy considerations; and (b) What is cybersquatting and has the plaintiff engaged in cybersquatting? 96 In the course of preparing her expert’s report dated 9 May 2019 (“the Expert Report”), Ms Tan conducted her own searches and ascertained therefrom that 3RR currently owns the domain name “Go-Jek.com.sg” as well as “Gojek.sg”, “Go-jek.com.ph”, “Go-jek.ph” and “Gojek.com.ph”. 97 In the Expert Report, Ms Tan explained the functions of bodies such as Internet Corporation for Assigned Names and Numbers (“ICANN”) and the Internet Assigned Numbers Authority (“IANA”). She added that the Domain Name System (“DNS”), which functions as the “address book” of the Internet, operates on the basis of a hierarchical naming system at the top of which is the root domain containing all top-level domains of the Internet,ie,the generic top-level domains such as “com”, “org” and “edu” and country code top-level domains such as “id” (for Indonesia), “sg” (for Singapore) and “ph” (for the Philippines). 98 The DNS is managed by ICANN while the IANA manages the root zone files of the DNS, the allocation of Internet numbering resources, the co-ordination of technical standards or protocols that drive the Internet. IANA is also responsible,inter alia,for establishing policies on creating, editing or removing top-level domains. Ms Tan very helpfully produced in court56Foot Note 56×As exhibit D1a flowchart showing the hierarchical structure between DNS, ICANN and ICANN’s predecessor IANA, as well as the registry for domain names.  A copy the flowchart is attached to this judgment as Annexure A. 99 Ms Tan added that among the policies formulated and implemented by ICANN is the Uniform Domain Name Dispute Resolution Policy (“UDRP”) adopted by ICANN on 26 August 199957Foot Note 57×Which Ashwyn referred to in his testimony.. 100 On its part, Singapore’s SGNIC established SDRP in almost identical terms as the UDRP. The function of the SDRP (like UDRP) is to resolve disputes involving “.sg” domain names, including the illegitimate (ie,bad faith or abusive) registration or use of such domain names (eg,cybersquatting), and to regulate the appointment and decision-making powers of panellists in the cancellation, suspension or transfer of disputed “sg” domain names. 101 Ms Tan dealt with various types of domain name uses in the Expert Report including: (a) “Typosquatting / URL hijacking / Brandjacking / Sting site / Fake URL” – these operations target Internet users who incorrectly type a website address into their web browser (eg,“gooogle.com” instead of “google.com”), who will then be led to an alternative website owned by a hacker that is usually designed for malicious purposes;58Foot Note 58×Expert Report, para 4.4.5. (b) “Domain Name Front Running”59Foot Note 59×Expert Report, para 4.4.7(iii).where: (1) a domain name registrar uses insider information to register a domain name for the purpose of re-sale or earning revenue via ads placed on the landing page of such domain name; and (2) by registering the domain name, the registrar locks out other potential registrars from selling it, typically taking advantage of the grace period (during which a registrant may not need to pay or may cancel the registration and be fully refunded for the registration fee) to lock the domain name with the intention of selling it to the searcher of the domain name at a later date and for a higher price; (c) “Domain Name Speculation”60Foot Note 60×Expert Report, para 4.4.10., which involves identifying and registering or acquiring domain names as investments, with the intent of selling them later for a profit. Targets may include generic words which can be valuable for type-in traffic and for the dominant position they would have in any field due to their descriptive nature (for example, generic words and phrases such as poker, insurance, travel, credit cards, loan and others are attractive targets of domain speculation in any top-level domain); and (d) “Passive Domain Name Holding”61Foot Note 61×Expert Report, para 4.4.11., where a domain name is registered but not used,eg, the domain resolves to a blank or “coming soon” page, which is also referred to as “Domain Name Parking”. 102 With regards to cybersquatting activities, the Expert Report pointed out that there is no statutory definition of cybersquatting in Singapore nor is there a universal definition.62Foot Note 62×Expert Report, para 4.6.However, in the Final Report of the WIPO Internet Domain Name Process titled“The Management of Internet Names and Addresses: Intellectual Property Issues”dated 30 April 1999 (“WIPO Final Report”), the WIPO, in referring to cybersquatting, stated that cybersquatting is “the term most frequently used to describe the deliberate, bad faith abusive registration of a domain name in violation of rights in trademarks and service marks”. It stated that the WIPO established that the registration of a domain name shall be considered to be abusive when all the following conditions are met: (a) the domain name is identical or misleadingly similar to a trade or service mark in which the complainant has rights; (b) the holder of the domain name has no rights or legitimate interests in respect of the domain name; and (c) the domain name has been registered and used in bad faith, and the following shall be evidence of this: (1) an offer to sell, rent or otherwise transfer the domain name to the owner of the trade or service mark, or to a competitor of the owner of the trade or service mark for valuable consideration; (2) an attempt to attract, for financial gain, Internet users to the domain name holder’s website or other online locations, by creating confusion with the trade or service mark of the complainant; (3) the registration of the domain name in order to prevent the owner of the trade or service mark from reflecting the mark in a corresponding domain name, provided that a pattern of such conduct has been established on the part of the domain name holder; or (4) the registration of the domain name in order to disrupt the business of a competitor. 103 After reviewing decisions of the UDRP and SDRP, the Expert Report considered whether the plaintiff had engaged in cybersquatting63Foot Note 63×Expert Report, para 5..  Ms Tan looked at the fact that Mark, Michael and/or Michael’s wife Lee have interests in the companies Top3, 3RR, the plaintiff, F1 Auto and Clay, all of which registered more than 1,232 domain names amongst themselves. 104 The Expert Report set out the chronology of the defendant’s expansion of its operations since it started its ride-hailing business in Malaysia in June 201264Foot Note 64×Expert Report, para 5.4.as follows: Date/PeriodACTION TAKEN BYDefendantPlaintiff/DeddyJune 2012Launch of mobile app and commenced business in Malaysia-4 March 2013Commenced GRAB business in Philippines-14 May 2013Filed application in Philippines for registration of GRAB-related trade mark-14 June 2013Commenced GRAB business in Singapore-9 July 2013Filed applications in Thailand for registration of GRAB-related trade mark-11 July 2013Filed applications in Malaysia for registration of GRAB-related trade mark-14 February 2014Commenced GRAB business in Vietnam-13 May 2014-Domain Name registered in the name of Deddy10 June 2014Filed applications in Indonesia for registration of GRAB-related trade mark-21 July 2014Commenced GRAB business in Indonesia-15 May 2015-Registered “grab.com.vn” (one of the Other Domain Names)12 August 2015-Registered “grab.ph” (one of the Other Domain Names)24 March 2017-Registered “grab.com.sg” (one of the Other Domain Names)19 July 2017-Approached Defendant on the Domain Name21 July 2017-Acquired the Domain Name with Ashwyn as the registrantJuly–August 2017Parties’ discussions on the Domain NameLate July 2017-Offer of the Other Domain Names to the defendantAugust 2017Parties’ discussions on the Other Domain Names 105 The Expert Report also considered65Foot Note 65×Expert Report, paras 5.5.1-2.the plaintiff’s evidence that the Domain Name and Other Domain Names were acquired for legitimate business purposes, the registration history of the Domain Name, as well as the fact that when the Domain Name was first registered in Deddy’s name (on 13 May 2014), the defendant had commenced its business under the GRAB name in various countries in South East Asia, had an online presence because of its mobile app, had filed its first of numerous applications for registration of a GRAB-related trademark and was just a few months away from commencing its business in Indonesia (on 21 July 2014). 106 The Expert Report noted that by the time the defendant was approached to buy the Domain Name, it had commenced operations in Indonesia and had taken steps to protect and file applications for registration of GRAB-related trade marks in multiple countries in the region. 107 The Expert Report further noted that the plaintiff and its related companies held 1,232 domain names (including the famous ones listed at [68] above) for which the plaintiff provided no reasons.66Foot Note 66×The Expert Report, para 5.5.2.The Expert Report then cited the UDRP case ofCompagnieGénérale des Etablissements Michelin v Cameron Jackson(WIPO Case No. D2016-2392)where the panellist found a pattern of abusive registration was established by the respondent having registered more than 1,000 domain names, many of which included third party marks (as in this case). The panellist there found that it was highly likely that the respondent was well aware of the complainant and its mark MICHELIN, and the substantial reputation, goodwill and fame which the mark acquired when the respondent registered each of the disputed domain names. Yet, the respondent intentionally registered each of the domain names for its potential to opportunistically exploit that reputation and goodwill for the respondent’s own pecuniary benefit by subsequently offering to sell each domain name to the complainant at a profit,ie, an amount exceeding its out-of-pocket cost of registration for US$250. Ms Tan contrasted this figure with the US$250,000 and US$100,000 offered by the plaintiff in relation to the Domain Name and the Other Domain Names. 108 The Expert Report concluded from the facts that, in Ms Tan’s opinion, the substantive conduct of the plaintiff is tantamount to cybersquatting of the sort intended to be suppressed in the use of the DNS, based on the policies and principles established by ICANN and subscribed to by the proper Internet community for the public interest. 109 The Expert Report then went on to consider the issue of whether public policy should be invoked to deny enforcement of the agreement. CitingTing Siew May v Boon Lay Chooand another[2014] 3 SLR 609 andOchroid Trading Ltdand another v Chua Siok Lui (trading as VIE Import & Export)and another[2018] 1 SLR 363, Ms Tan said the appellate court in both cases recognised that contracts that were not themselves illegal but that were entered into to achieve an illegal purpose or object, may vary in degrees of such illegality, such that a “balancing exercise” is required to determine if the contract is enforceable despite the illegal object underlying it. 110 The Expert Report suggested certain factors for consideration by the court in the balancing exercise. The court will return to some of the factors raised in the Expert Report later in the findings. 111 The Expert Report arrived at the following conclusions: (a) Based on Ms Tan’s analysis and observations and subject to proof of the facts (to the court’s satisfaction) that she relied on in her observations and analysis, the facts showed that: (1) the plaintiff is seeking to enforce the agreement in the Offer Letter which relies directly on its cybersquatting activities; (2) such cybersquatting activities are sought to be eradicated by the proper Internet community because: (A) they undermine public interest in the Internet and run contrary to the established expectations of the legitimate use of domain names and the DNS; and (B) they contravene stated ICANN principles and policies which prohibit profiteering from the registration of domain names. They are therefore illegal under such principles and policies. (b) The court’s assistance in enforcing the agreement may have a negative impact by sending the message that cybersquatting activities couched under a scheme such as that perpetrated by the plaintiff would be enforceable in Singapore, and may reverberate beyond our shores to potentially spark an unwelcomed hub of similar activities centred around Singapore; and (c) In so far as denying enforceability of the agreement is based on it being tainted with illegality: (1) the nature of such illegality is the contravention of ICANN principles and policies; and (2) the court must assess the significance of the mischief that the ICANN principles and policies seek to prevent when it determines the issue of illegality tainting the agreement. 112 During cross-examination, counsel for the plaintiff took Ms Tan through the provisions of the UDRP and the differences with those in the SDRP. The plaintiff’s closing submissions67Foot Note 67×Plaintiff’s closing submissions, paras 147-149.criticised Ms Tan’s evidence and the Expert Report on the basis that her definition of cybersquatting was markedly different from those in the SDRP and the UDRP.  There was a suggestion by the plaintiff that Ms Tan chose not to disclose the SDRP and the URDP to the court and it was the plaintiff who did so after discovering their omission from the Expert Report. 113 During cross-examination, Ms Tan confirmed68Foot Note 68×Transcripts on 19 July 2019, p 584.that in the WIPO Final Report, the terms “abusive registration” and “cybersquatting” were intended to be used interchangeably, with “cybersquatting” being the popular terminology for the former term. The court will address the plaintiff’s criticism of Ms Tan’s testimony later.",
        "The issues": "114 For this Suit, the court’s task is to determine the following issues: (a) Is the Offer Letter a valid and enforceable agreement as the plaintiff asserts? (b) If the Offer Letter is valid and enforceable, what loss has the plaintiff suffered so as to be entitled to damages? Can the plaintiff be awarded specific performance in lieu of damages? (c) Is the plaintiff a cybersquatter as the defendant alleged? If the plaintiff is a cybersquatter, is the Offer Letter non-enforceable as being contrary to public policy?",
        "The parties’ submissions": "115 Before I set out the findings, the court would like to refer briefly to the closing submissions that were tendered by the parties. 116 On the plaintiff’s part, it was submitted that the Offer Letter is an enforceable agreement and the defendant’s reliance on the first precondition was not pleaded. It was also submitted that the Offer Letter was unqualified and not made “subject to contract”. As for the third precondition, the plaintiff submitted that it did not require the plaintiff to own the Domain Name at the time of acceptance or at all. All that was required (and admitted by Shawn69Foot Note 69×Transcripts on 14 June 2019, pp 505-506.) was that once the defendant had accepted the plaintiff’s offer, the plaintiff can no longer sell the Domain Name to the Rajwali group. 117 The plaintiff surmised that the defendant walked away from the deal because it felt the price of US$250,000 was too high – it was a case of buyer’s remorse. 118 The plaintiff submitted that the court should ignore the registration of the domain names70Foot Note 70×See [64] and [68] above.“Go-Jek.com.sg” and “ubereats.com.sg” because they took place in August 2017,afterthe defendant had agreed to purchase the Domain Name in July 2017. The plaintiff conceded however that “there is undoubtedly an element of cybersquatting here”71Foot Note 71×Plaintiff’s submissions, para 202.. The plaintiff then admitted that either Mark or Michael “obviously felt the desire to earn a profit by selling these two domain names as well”. The court takes judicial notice of the fact that Uber, the forerunner of all ride-hailing operations, started off in San Francisco in 2010 and launched Ubereats there in August 2014. 119 I should point out that the plaintiff’s above submission does not explain the domain name “gooogle.com.sg” that was registered on 19 March 2017 which was monthsbeforethe defendant agreed to purchase the Domain Name. Again, the court takes judicial notice of the fact that Google, the world’s dominant internet search engine, was launched in September 1998. It is noteworthy that the plaintiff registered “amyswinehouse.com.sg” on 23 July 2017,the very dayAshwyn signed the Acceptance portion of the Offer Letter. 120 Tellingly, the plaintiff’s submissions gave no explanation for the 1,232 or more domain names that were registered by Mark or his brother or his brother’s wife, using the five companies they have between themselves. The court considers this a significant omission. 121 As for the defendant, it pointed to the fact that the Offer Letter required as a follow-up a formal SPA together with an escrow agreement for the transfer of the purchase price and compliance with the four preconditions. There was no binding agreement as the defendant did not execute any formal SPA and escrow agreement while the first and third precondition were not satisfied. Consequently, the defendant argued, the Offer Letter can be construed as being “subject to contract” notwithstanding the absence of the phrase in the Offer Letter. 122 Relying on Ms Tan’s testimony and the Expert Report, the defendant submitted that the plaintiff came within WIPO’s definition (which Ms Tan adopts) of a cybersquatter,ie,the deliberate, bad faith and abusive registration of a domain name in violation of rights in trademarks and service marks. The defendant added that cybersquatting is universally condemned throughout the WIPO process as an indefensible activity that should be suppressed. It then cited the leading English cases ofBritish Telecommunicationsplc v One In A Million Ltd[1999] 1 WLR 903(“BT v One In A Million”)andMarks & Spencerplc and Others v One In A Million Ltd and Others[1997] 42 IPR 21 (“Marks & Spencerv One In A Million”)in support of its position. 123 The defendant contended that the plaintiff engaged in cybersquatting activities, relying on the facts set out earlier at [67] to [70]. The defendant added that when Mark registered the Domain Name in Indonesia, the defendant had already commenced business in Indonesia using the GRAB brand name and had registered the GRAB-related trademarks in multiple countries in the region.72Foot Note 72×Plaintiff’s submissions, para 325. 124 The defendant pointed to the fact that the Domain Name was transferred from Deddy to Ashwyn at about the time the plaintiff offered to sell the Domain Name to the defendant and this (according to Mark’s evidence) was to enable the plaintiff to be able to control the sale of the Domain Name to the defendant. Mark’s testimony73Foot Note 73×Transcripts on 14 June 2019, pp 245-246.was that Ashwyn held the login details and password of the control panel to gain access to and control the Domain Name; so too Mark although he had never operated the control panel leaving it instead to Ashwyn. 125 It was Ms Tan’s evidence that bad faith registration can also be established where the plaintiff’s intent in registering was to unfairly capitalise on the defendant’s nascent trademark rights74Foot Note 74×Defendant’s submissions, paras 208-213.. Accordingly, the defendant submitted that at the time when the Domain Name was registered in Indonesia (on 13 May 2014), Mark knew or must have known that the defendant was operating as a ride-hailing business under the name GRAB throughout South East Asia, including Singapore. It described Mark’s evidence under cross-examination in this regard as evasive75Foot Note 75×Transcripts on 12 June 2019, pp 40-43.. In any case Mark eventually conceded76Foot Note 76×Transcripts on 12 June 2019, p 68.that by 2014, it would not have escaped his attention that the defendant was already using the GRAB brand for its mobile app in respect of its ride-hailing business in South East Asia.",
        "The findings": "",
        "(a) Is the Offer Letter a valid and enforceable agreement as the plaintiff asserts?": "126 Granted, the Offer Letter was addressed to the plaintiff but it was accepted by Ashwyn, who isnotan employee of the plaintiff, but the regional manager of Top3, which is neither the parent company nor a subsidiary of the plaintiff. The two companies have a common shareholder in Mark but at law, that is not a good enough reason to lift the corporate veil – Ashwyn is alsonota shareholder or director of either company. 127 To add to the legal confusion, Ashwyn holds the Domain Name in his own name. In answer to the court’s question77Foot Note 77×On 13 June 2019 at pg 182, Mark had confirmed he did not get a declaration of trust from Ashwyn that Ashwyn was holding the Domain Name on behalf of Mark or the plaintiff.  There was not even a director’s resolution from the plaintiff authorising Ashwyn to execute the Offer Letter on its behalf. It is all very well for Mark to assure the defendant that Ashwyn would transfer the Domain Name to it on his instructions but what if Ashwyn refused? It bears noting that Ashwyn controls the Domain Name because he has the login details and password. The defendant only had Mark’s word that Ashwyn would transfer the Domain Name to it, for which the defendant was expected to part with US$250,000. The court can understand the defendant’s concerns. 128 Looking at the Offer Letter, it does not seem possible for the plaintiff to enforce it as it is not the Domain Name owner.",
        "(b)If the Offer Letter is valid and enforceable, what loss has the plaintiff suffered so as to be entitled to damages? Can the plaintiff be awarded specific performance in lieu of damages?": "129 Assumingarguendothat the Offer Letter is indeed a valid contract enforceable by the plaintiff, the next question the court has to answer is, what loss has the plaintiff suffered so as to be entitled to damages? Attendant to this question is the other question, can the plaintiff be awarded specific performance in lieu of damages? What the plaintiff wants is for the court to order the defendant to take over the Domain Name in exchange for payment of US$250,000. 130 Dealing with the issue of specific performance first, it bears remembering that specific performance is an equitable remedy. It is trite law that he who comes to equity must come with clean hands. It is this court’s view that the plaintiff/Mark did not come to court with clean hands as can be seen from the findings in the paragraphs below. 131 When Mark first approached the defendant through Priscilla (and notvice versaas Mark sought to persuade the court), he had said that he was in negotiations with Rajwali and was close to a deal. This was untrue as the letter of intent from Rajwali was made wellafterthe Offer Letter, namely 16 August 201778Foot Note 78×1AB368-369 (letter of offer in Indonesian language)., with an offer price of S$75,000. 132 The court is reinforced in its dim view of Mark’s conduct by the fact that he, his brother and his brother’s wife had registered 1,232 domain names through the plaintiff and its related companies. It would be stretching the limits of credulity to expect the court to believe that the plaintiff are domain investors, bearing in mind the definition of a domain investor set out at [85] above from an article that Ashwyn himself produced. The plaintiff cannot even be considered domain name speculators79Foot Note 79×See [101(c)] for the explanation of domain name speculation put forward by Ms Tan.as it registered not only generic names, but also innumerable non-generic names. 133 There is little doubt what Mark, Michael and Michael’s wife wanted to achieve by registering 1,232 domain names indiscriminately – they hoped to find amongst those domain names gems like the next “Hotels.com” or the next “Insurance.com” which they could then flip to buyers for handsome returns. 134 Turning to the next issue, what has the plaintiff lost by the defendant withdrawing the Offer Letter? The plaintiff is claiming (as an alternative to specific performance) damages in the sum of US$250,000 for the defendant’s alleged breach of contract, which is the sale price of the Domain Name under the Offer Letter. Based on the available evidence however, I am not satisfied that the plaintiff has sufficiently proved that it has suffered any loss. In fact, during Mark’s cross-examination, when it was put to him that across the entire proceedings and all the evidence adduced before the court, the plaintiff had not shown that it had suffered any loss, Mark simply agreed.80Foot Note 80×Transcripts on 13 June 2019, p 223.Further, given that the plaintiff does not actually own the Domain Name, and the Domain Name would continue to remain with its current owner, it cannot be that the plaintiff is entitled to recover the original sale price of US$250,000 even if the Offer Letter is enforceable.",
        "(c) Is the plaintiff a cybersquatter as the defendant alleged? If the plaintiff is a cybersquatter, is the Offer Letter non-enforceable as being contrary to public policy?": "135 Having looked at the definition of a cybersquatter in [102] above, I have no doubt that the plaintiff is a cybersquatter because it engaged in “the deliberate, bad faith abusive registration of domain names in violation of rights in trademarks and service marks”. 136 When analysing this issue, it is apposite to refer to three English cases on passing off and trademark infringement involving cybersquatting on domain names. The first case isGlobal Projects Management Ltd v Citigroup Inc and others[2005] EWHC 2663 (Ch)(“Global Projects”), where the English court (at [12]) described the phenomenon of cybersquatting in the following terms: Persons with no connection with a well-known business name would find some permutation containing the name and a suffix, but where that particular permutation had not been registered by the real owner of the business. The person concerned would then register that permutation himself and try to make money through being bought out by the true owner. 137 The other two cases are the leading English authorities ofMarks & Spencer v One In A MillionandBT v One In A Million,both ofwhich the defendant cited in its submissions (see [122] above). 138 InMarks & Spencer v One In A Million, the defendants specialised in registering Internet domain names comprising or incorporating the names or trademarks of well-known companies. Having registered numerous such domain names, the defendants then attempted to sell the rights to these names for large sums of money to the companies concerned. None of the websites involved were active. Some of the companies then commenced legal proceedings against the defendants, alleging passing off and infringement of their trademarks. They applied for injunctive relief (to require the defendants to assign the relevant domain names to them), which was granted by the English High Court. 139 The facts ofBT v One In A Millionare similar. The defendants there specialised in registering for sale domain names incorporating well-known names and trademarks. The plaintiffs were large companies whose household names had been registered and offered for sale by the defendants. The court granted the plaintiffs an injunction to restrain the defendants’ use of the relevant domain names, on the basis of passing off and breach of the plaintiffs’ registered trademarks. 140 Suffice to say that the plaintiff’s acts in the present case (such as the registration of “ubereats.com.sg”, “gooogle.com.sg” as well as “amyswinehouse.com.sg”, as discussed in [118]-[119] above) would fall within the meaning of “cybersquatting” as set out above inGlobal Projects, and are highly similar to the sort of conduct which the English courts have frowned upon and against which they have granted injunctive relief. 141 The court’s finding that the plaintiff is a “cybersquatter” is reinforced by the extract from WIPO’s Final Report setting out the indicia of abuse of registration of domain names, mentioned at [102(a)-(c)] above. 142 While the Domain Name may not be identical, it is similar to the defendant’s registered trademarks and is likely to cause confusion to the public.  Indeed, the plaintiff’s/Mark’s attempt to sell the Domain Name to the defendant falls squarely within [102(c)(1)]. 143 In its closing submissions, the plaintiff argued81Foot Note 81×Plaintiff’s submissions, para 208-209.that it is not appropriate to establish cybersquatting or abusive registration as a new head of public policy at common law and the court should be cautious of minting new rules of public policy when the legislature has not considered the matter, citingLancashire County Council v Municipal Mutual Insurance Ltd.[1997] 1 QB 897. The short answer to this submission is that in the current world where the reach of the Internet is so wide, and the use of Internet websites is so pervasive, the abusive and/or illegal usage of domain names needs to be controlled and/or curbed. The court takes judicial notice of the fact that the world wide web was invented by Tim Berners-Lee back in 1989;he wrote the first web browser in 1990. When the UK appellate court decidedLancashire County Council v Municipal Mutual Insurance Ltd[1997] 1 QB 897in 1997, the web browser was only in its infancy. The use of the internet has expanded exponentially since with its attendant abuse.  Such abuse must be arrested. 144 Despite the evidence of Mark and Ashwyn claiming the words “Grab” and “Grab Essentials!” were part and parcel of their operations, the court is not convinced that the plaintiff (through its Indonesian arm PT MMT) used/uses the words to such an extent that they were an integral part of Mark’s design business in Indonesia, or that the words were/are used in the company’s advertising campaigns. The court’s view is reinforced by the picture that the plaintiff produced in court, headed “Lady’s Card Revamp Creative Design”, a project undertaken for UOB Indonesia82Foot Note 82×1AB, p 42.. Moreover, it was the plaintiff’s evidence that Top3 only used the domain name “grab.com.sg” for a few months in Singapore. It was also not disputed that the business of the plaintiff and Top3 have nothing to do with ride-hailing. 145 In addition, the chronology set out at [104] shows that by 21 July 2014, the defendant was operating its ride-hailing business in Indonesia. The Domain Name registration may have preceded the defendant’s Indonesian operations by two months but Mark being a Singapore resident, would have known of the defendant’s ride-hailing business by then as it was commenced in Singapore on 14 June 2013. In fact, even before that date, namely on 26 March 2014, the defendant had registered their GRAB-related trademarks. 146 I had earlier83Foot Note 83×See [112]-[113] above.briefly referred to the plaintiff’s criticisms of Ms Tan’s evidence and the Expert Report. If the plaintiff’s suggestion is that Ms Tan deliberately failed to disclose the provisions of the SDRP and UDRP (which the plaintiff felt were more relevant than WIPO’s Final Report), I am of the view that the allegation is unfounded. The provisions in both pertain to domain name disputes and the procedure on how to resolve them. It is the court’s view that the provisions touching on bad faith registration of domain name and usage are similar if not common in both.  As examples, both set out procedures that require a complainant to prove the following elements against the registrant of a domain name: (a) The registered domain name is identical or confusingly similar to a name, trademark or service mark in which the complainant has rights; (b) The registrant has no rights or legitimate interests in respect of the domain name; and (c) The registrant’s domain name has been registered or is being used in bad faith (under the SDRP), or it has been registered and is being used in bad faith (under the UDRP). 147 The four elements of bad faith spelt out in both the UDRP and the SDRP are similar if not almost identical in wording and are not dissimilar to those of the WIPO Final Report as spelt out in [102(c)(1) to (4)]. Accepting the plaintiff’s argument that the applicable criteria for cybersquatting should be those stated in the UDRP84Foot Note 84×At 5AB1, p 3., the court does not see how that would advance the plaintiff’s case that it is not a cybersquatter. The criteria are no different from those set out in the WIPO Final Report, namely that: (a) The Domain Name of the plaintiff is identical or confusingly similar to a trademark or service mark in which the defendant has rights (“first criterion”); (b) The plaintiff has no rights or legitimate interests in respect of the Domain Name (“second criterion”); and (c) The Domain Name has been registered and is being used in bad faith (“third criterion”). 148 With regard to the first criterion, it has already been noted that the Domain Name is strikingly similar to the defendant’s many registered trademarks using the GRAB logo. As for the second criterion, it is undisputed that the plaintiff’s business is not in ride-hailing. 149 As for the third criterion, the court’s view is that the plaintiff’s usage of the Domain Name (if it can be considered usage at all) has all the markings of bad faith and the insignia of cybersquatting. This view is based on the same observations as set out at [144] above. The only point to add is that if indeed the word “Grab” is so “catchy” and “vibrant” (as Mark claimed were the factors that prompted Tommy to adopt them for PT MMT’s business), as noted earlier,85Foot Note 85×See [57] above.why do they not appear in the plaintiff’s website? 150 When it was put to Mark in cross-examination86Foot Note 86×Transcripts on 12 June 2019, p 135.that hismodus operandiin the transaction with the defendant had the mark of a cybersquatter, Mark disagreed. However, it is the finding of this court that Mark alone or with his brother Michael and/or Michael’s wife and/or their companies (Top3, the plaintiff, Clay, F1 Auto and 3RR) is/are serial cybersquatters or “consummate cybersquatters” (to use the defendant’s description)87Foot Note 87×Defendant’s submissions, para 256.. 151 To recapitulate, the evidence adduced at the trial shows: (a) The indiscriminate registration of generic and non-generic domain names by Mark, the plaintiff, Clay, Top3, F1 Auto, 3RR Michael and/or Lee, which they failed to explain at all, let alone to the court’s satisfaction. They were passive domain name holders who had no intention of using the 1,232 domain names they had registered; (b) The deliberate misspelling by Top3 of registered domain names like “gooogle.com.sg” and “www.amyswinehouse.com” shows all the traits of being typosquatters; and (c) Save for the short term usage of “grab.com.sg”, the plaintiff had never used or have not substantiated their usage of any of the Other Domain Names. 152 In the event, the plaintiff has failed to prove: (a) There was an enforceable and valid contract by way of the Offer Letter; (b) Even if the Offer Letter is a valid and enforceable contract, it is entitled to damages, or specific performance in lieu of damages; and (c) That it is not a cybersquatter, and is not precluded by public policy considerations from enforcing the Offer Letter. 153 Consequently, the court dismisses the plaintiff’s claim with costs on a standard basis to the defendant. Lai Siu ChiuSenior Judge Soo Ziyang Daniel, Lee Wen Rong Gabriel (Selvam LLC) for the plaintiff;Liew Teck Huat, Alex Yeo Sheng Chye, Benjamin Ow, Lee Yi Wei Sean (Niru & Co LLC) for the defendant.",
        "Annexure A": ""
    }
}