{
    "case_title": "OUE Lippo Healthcare Ltd (formerly known as International Healthway Corp Ltd) and another vCrest Capital Asia Pte Ltd and others",
    "ncitation": "[2020] SGHC 142",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 In this suit, the plaintiffs claim against the defendants for their roles in causing the first plaintiff, OUE Lippo Healthcare Ltd (formerly known as International Healthway Corp Ltd) (“IHC”), to enter into a credit facility (to be referred to as the “Standby Facility”), and to use the funds to indirectly acquire its own shares. 2 The plaintiffs rely on three causes of action. First, the plaintiffs claim that as officers of IHC, the sixth defendant, Mr Fan Kow Hin (“Mr Fan”) and the eighth defendant, Ms Lim Beng Choo (“Ms Lim”), acted in breach of their duties to IHC. Second, the plaintiffs claim that the first to fifth defendants (the funding entities which are collectively referred to as the “Crest entities”), the seventh defendant, Mr Andrew Ah Kong Aathar (a substantial shareholder of IHC whom I shall refer to as “Mr Aathar”) and Ms Lim provided dishonest assistance to Mr Fan. Third, the plaintiffs claim that all the defendants engaged in a conspiracy by unlawful means to injure IHC. As a result of the defendants’ conduct, the plaintiffs suffered losses in connection with the Standby Facility, as well as another credit facility known as the “Geelong Facility”. 3 The Crest entities and Mr Lim defend the claims on various grounds. They also brought counterclaims against the plaintiffs. Although Mr Fan is a bankrupt, the plaintiffs obtained leave to continue with the action against him. Mr Fan, however, did not file a defence. He is not represented in the proceedings. Mr Aathar filed a bare defence. However, by the time of the trial, there was a stay of the proceedings against him. This was pursuant to a voluntary arrangement approved by Mr Aathar’s creditors under the Bankruptcy Act (Cap 20, 2009 Rev Ed). Nonetheless, Mr Aathar, as well as Mr Fan, gave evidence before me. 4 The trial concerns both liability and quantum, save that there is bifurcation in relation to the quantification of one category of loss,ie,loss arising from the termination and sale of the plaintiffs’ Australian business. 5 I pause to highlight that after the trial, but before the parties filed their closing and reply submissions, the Court of Appeal releasedThe Enterprise Fund III Ltd and others v OUE Lippo Healthcare Ltd(formerly known as International Healthway Corp Ltd)[2019] 2 SLR 524 (“The Enterprise Fund III”), and determined that the Standby Facility which funded the indirect acquisition by IHC of its own shares is void under by s 76A(1)(a) of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”) for contravention of s 76(1A)(a)(i) of the same. This determination, as well as some of the observations within the Court of Appeal’s judgment, are pertinent to this case. 6 Having heard the evidence, and considered the closing and reply submissions of the parties, this is my judgment.",
        "Background": "",
        "The parties": "7 IHC is a Singapore-incorporated company listed on the Catalist board of the Singapore Exchange (“SGX”).1Foot Note 1×Yet Kum Meng’s Affidavit of Evidence-in-Chief (“AEIC”) at [5].The second plaintiff, IHC Medical Re Pte Ltd (“IHC Medical Re”), is a wholly-owned subsidiary of IHC. IHC Medical Re is the ultimate holding company for IHC’s Australian business through IHC Healthcare REIT (Singapore Trust).2Foot Note 2×Yet’s AEIC at [64].The Australian business consisted primarily of three properties in Australia (the “Australian properties”) as follows:3Foot Note 3×Yet’s AEIC at [63]. (a) two properties at 541 and 553 St Kilda Road, Melbourne, Victoria, Australia (the “St Kilda properties”); and (b) a property at 73 – 79 Little Ryrie Street, Geelong, Victoria, Australia (the “Geelong property”). 8 IHC is also the holding company of two other subsidiaries, namely IHC Management Pte Ltd (“IHCM”) and IHC Management (Australian) Pty Ltd (“IHCM(A)”).4Foot Note 4×Yet’s AEIC at [64]. 9 Mr Fan and Mr Aathar were founders of IHC. Both held large shareholdings in IHC, reported as 23.67% and 8.73% respectively in the Annual Report of 2015.5Foot Note 5×Yet’s AEIC at [7].On 17 May 2015, by way of a service agreement,6Foot Note 6×Fan Kow Hin’s AEIC at p 841.IHC appointed Mr Fan as its Group Chief Executive Officer (“Group CEO”). On 30 June 2015, upon the departure of the previous CEO, Mr Chia Kwok Ping (“Mr Chia”), Mr Fan was re-designated as Chief Executive Officer (“CEO”).7Foot Note 7×Fan’s AEIC at [2.24].He remained in this position until 31 January 2016.8Foot Note 8×Fan’s AEIC at [2.54].Mr Aathar did not hold any formal position in IHC.9Foot Note 9×Aathar Ah Kong Andrew’s AEIC at [2.6]. 10 From 30 October 2013 to January 2015, Ms Lim was the Financial Controller (Corporate Finance and Real Estate Investment Trusts) of OUELH Medical Assets Pte Ltd (formerly known as IHC Medical Assets Pte Ltd).10Foot Note 10×Lim Beng Choo’s AEIC at [3].From January 2015, she was appointed IHC’s Vice-President (Investments), and maintained that position until 6 January 2016.11Foot Note 11×Lim’s AEIC at [4].On 7 January 2016, Ms Lim was appointed IHC’s CEO and Executive Director. She held those positions until 23 January 2017.12Foot Note 12×Lim’s AEIC at [33] and [37]. 11 Turning to the Crest entities, the first defendant, Crest Capital Asia Pte Ltd (“Crest Capital”), is a fund administration company.13Foot Note 13×Tan’s AEIC at [1].It is the holding company of the second defendant, Crest Catalyst Equity Pte Ltd (“Crest Catalyst”), which is a fund management company that manages affiliated private equity funds. The third to fifth defendants, The Enterprise Fund III Ltd (“EFIII”), VMF3 Ltd (“VMF3”) and Value Monetisation III Ltd (“VMIII”), are three such funds administered and managed by Crest Capital and Crest Catalyst.14Foot Note 14×Tan’s AEIC at [1]. See also the Crest entities’ Defence (Amendment No 6) and Counterclaim (Amendment No 3) (the “D6CC3”) at [5]. 12 Mr Tan Yang Hwee, also known as Glendon Tan (“Mr Tan”), is the Investment Director of Crest Capital.15Foot Note 15×Tan’s AEIC at [1].Mr Tan was the main representative handling Crest Capital’s business deals with IHC since its incorporation in 2013, including the deals that resulted in the Standby Facility and the Geelong Facility. Prior to that, Crest Capital had business dealings with a group of companies, which included Healthway Medical Development Pte Ltd, founded by, amongst others, Mr Fan and Mr Aathar.16Foot Note 16×Tan’s AEIC at [16] and [19].IHC was incorporated to expand the healthcare services offered by the group internationally.17Foot Note 17×Tan’s AEIC at [19].",
        "The Standby Facility and the Geelong Facility": "13 The Standby Facility was a short-term credit facility of up to S$20m granted to IHC by EFIII, VMF3 and VMIII. The Standby Facility agreement was executed on 30 July 2015,18Foot Note 18×Yet’s AEIC at [16].and the facility was to be used as “general working capital”.19Foot Note 19×Agreed Core Bundle (“ACB”), Vol. 1 (“1ACB”) at p 243 at (J).It provided for fixed interest (termed “standby fees”) on the full sum of S$20m at 3.5% per month for a minimum of five months20Foot Note 20×3ACB at p 1283.with default interest being levied on any sums due and unpaid at an additional rate of 2% per month.21Foot Note 21×3ACB at p 1285. 14 I should add that an initial facility agreement was fully executed on or around 21 July 2015,22Foot Note 22×Lim’s AEIC at [46h].and backdated to 16 April 2015 (with the maturity date falling two months from the date of disbursement of 16 April 2015,ie,15 June 2015)23Foot Note 23×Tan’s AEIC at [21]-[22]; Lim’s AEIC at [46h].. At that time, the three funds involved were EFIII, VMIII and The Enterprise Fund II Ltd (“EFII”). Essentially, the Standby Facility agreement was executed to supersede the initial facility agreement, and to extend the tenure of the facility to five months from 30 July 2015.24Foot Note 24×1ACB at p 245.Additionally, VMF3 replaced EFII as an investing party.25Foot Note 25×Tan’s AEIC at [45]. 15 The Geelong Facility was a mezzanine loan of S$11.5 million granted to IHC Medical Re by EFIII and VMIII, with the agreement dated 17 June 2015.26Foot Note 26×ACB, Vol. 1 (“1ACB”) at p 159.The purpose was to partially finance the acquisition of the Australian properties.27Foot Note 27×Tan’s AEIC at [53].It provided for interest at the rate of 3.35% per month on the outstanding principal,28Foot Note 28×1ACB at p 171.with default interest on any sums due and unpaid at an additional rate of 3% per annum.29Foot Note 29×1ACB at p 171. 16 The payments of sums due under both facilities were secured by personal guarantees from Mr Fan and Mr Aathar, as well as charges granted by IHC overallthe shares of IHC Medical Re, IHCM and IHCM(A) (the “Charged Shares”).30Foot Note 30×Tan’s AEIC at [50] and [57].This was done by two Deeds of Share Charges dated 17 June 201531Foot Note 31×1AB at p 305.and 30 July 2015,32Foot Note 32×1ACB at p 278.which secured payment of sums due under the Geelong Facility and the Standby Facility respectively. For convenience, I shall refer to these Deeds of Share Charges as the “17 June Deed of Charge” and the “30 July Deed of Charge”. 17 Subsequently, there was a dispute over the Standby Facility.33Foot Note 33×Tan’s AEIC at [65].According to IHC, this triggered its default on the Geelong Facility,34Foot Note 34×3ACB at p 1824.which in turn led to IHC incurring further consequential losses. As mentioned at [1] above, IHC took issue with the defendants’ respective roles in causing IHC to enter into the Standby Facility in the first place.",
        "The genesis of the Standby Facility": "18 In this connection, the relevant events began on 3 April 2015 when Mr Tan, Mr Fan and Mr Aathar met at Serangoon Gardens, pursuant to arrangements made by Mr Aathar.35Foot Note 35×Aathar’s AEIC at [3.2] to [3.3]. 19 On 4 April 2015, at 9.06am, Mr Aathar sent Mr Tan an email, copied to Mr Fan, with the subject stated as “Standby Facility” (the “first 4 April 2015 email”). The email provided a “recap” of the group’s discussion at the meeting and contained a formal request for “a standby line” of S$20m from the Crest entities to combat an imminent short seller’s attack on IHC’s shares. The material portions of the email are reproduced as follows:36Foot Note 36×1ACB at p 393. Dear Glendon, Wespoke yesterday and recap the following: a.Wenoticed an unusual sale pattern on Thursday 2/4/15, particularly from one single account. Wethen analysed the transactions with industry specialist… The pattern is that of a shortist and they now have between 71-75m shares. There is a high probability that this stealth plot would lead to an imminent shorting of IHC shares this coming Monday given that they commenced activity last week. The shortist have about 75m shares ($21.3m). This is probably being carried out by a small fund given the amount they held. b.Welook to Crest to provide a standby line of $20m for use against this activity. The terms could be the following: 1.Short term of 1-2months. 2.Interest of 3.5% per month. 3.Shares can be bought and held by Crest directly. c. As time is of essence,welook to putting facility into place as soon as possible with a very small amount available ($3-$5m) on Monday morning 9am for standby. Weare most grateful for your support. [emphasis added] 20 At 1.08pm, Mr Aathar sent another email to Mr Tan, copied to Mr Fan, again with the subject stated as “Standby Facility” (the “second 4 April 2015 email”).37Foot Note 37×1ACB at p 548.In it, Mr Aathar stated that, “[he] can give [Tan] a firm undertaking from IHC that all security arrangements will be restored and reinstated by IHC promptly, in the same terms and conditions, to the satisfaction of Crest.” 21 I now go to four emails dated 9 April 2015, which continue to deal with the subject of “Standby Facility” as follows: (a) At 9.29am, Mr Tan sent an email38Foot Note 38×1ACB at p 546.to Mr Aathar and Mr Fan, asking them both to review, sign and return an enclosed term sheet dated 6 April 2015. The term sheet provided for a loan amount of “up to S$20 million”, for a tenure of “2 months from first drawdown date”, to be used for “general working capital” and with an “interest coupon of 3.5% p.m.” after the “first draw down date”. It also expressly stated that the facility would be secured,inter alia, by joint and several personal guarantees by Mr Aathar and Mr Fan, as well as a “[p]ledge of IHC shares purchased through Fund”.39Foot Note 39×1ACB at pp 550 - 551. (b) At 12.52pm, Mr Tan sent a further email to Mr Aathar and Mr Fan, asking them to provide him with “the contact point details, email address for the person in charge of IHC for documentation” in order to complete the legal documents for the facility. This was copied to Mr Lim Chu Pei (“Mr CP Lim”), an Investment Analyst with Crest Capital.40Foot Note 40×1ACB at p 547. (c) Shortly after, at 12.57pm, Mr Fan replied to Mr Tan, and informed him that the relevant persons in charge were Mr Chia and Ms Lim. The email was also addressed to Mr Aathar, Ms Lim and Mr Chia, and was copied to Mr CP Lim.41Foot Note 41×1ACB at p 558. (d) I should add that Mr Tan had included the first and second 4 April 2015 emails sent by Mr Aathar to his first email at 9.29am, and they remained a part of the chain below Mr Fan’s 12.57pm email.42Foot Note 42×1ACB at pp 559-560. (e) In response, at 1.36pm, Mr Tan forwarded the term sheet and draft loan documents, namely,loan agreement, personal guarantees, deeds of undertaking, share charges,to Mr Chia and Ms Lim for their review, copying Mr Aathar, Mr Fan and Mr CP Lim.43Foot Note 43×1ACB at pp 561-684. 22 According to the plaintiffs and the Crest entities, Mr Aathar’s request for the standby line made (on behalf of IHC) at the 3 April 2015 meeting was the genesis of the Standby Facility.44Foot Note 44×Plaintiffs’ Closing Submissions (“PCS”) at [103]; 1st to 5th Defendants’ Closing Submissions (“1DCS”) at [83]-[87].The term sheet captured the three key terms as set out in the first 4 April 2015 email.45Foot Note 45×1ACB at p 550.Thereafter, the parties worked towards the finalisation of the legal documents for the Standby Facility.46Foot Note 46×PCS at [44]-[47]; 1DCS at [87]-[92]. 23 Mr Fan and Mr Aathar provided a completely different explanation for these events. Mr Aathar asserted that at the meeting and in the first 4 April 2015 email, he merely raised apersonalrequest for the Crest entities to invest in IHC shares to combat a short seller’s attack, with Mr Aathar agreeing to pay the Crest entities a return for doing so. After checking with the Crest entities, Mr Tan informed Mr Aathar that they were not agreeable to the risky private arrangement. Nonetheless, the Crest entities were prepared to extend a working capital facility to IHC, provided that IHC reinstated the security arrangements that it had furnished for a previous facility.47Foot Note 47×Aathar’s AEIC at [3.5]-[3.10] and [3.12].In response, Mr Aathar sent the second 4 April 2015 email giving the “firm undertaking from IHC” to reinstate the security arrangements. He was merely giving the “firm undertaking” from the personal guarantors,ie,Mr Fan and himself, and not IHC.48Foot Note 48×NE, 23 July 2019, p 161 line 2 to p 163 line 12In any event, the IHC deal was still “exploratory” in nature.49Foot Note 49×Aathar’s AEIC at [3.12]-[3.13].Subsequently, the Crest entities then proposed to IHC, and IHC agreed to, the Standby Facility – a deal quite separate from the private arrangement that did not materialise.50Foot Note 50×Aarthar’s AEIC at [3.14]. 24 Mr Fan’s evidence was largely similar.51Foot Note 51×Fan’s AEIC at [2.15]-[2.17].However, Mr Fan said that while Mr Aathar purported to give a firm undertaking on behalf of IHC, he was clearly not authorised to do so.52Foot Note 52×NE, 10 July 2019, p 77 lines 14-25. 25 As for Ms Lim, she acknowledged that the first 4 April 2015 email was forwarded to her as part of Mr Fan’s email on 9 April 2015. However, she did not see it as it was at the bottom of the chain.53Foot Note 53×Lim’s AEIC at [46a].As far as she was concerned, the proposed facility was one for “general working capital”.54Foot Note 54×Lim’s AEIC at [65].",
        "Events leading to the execution of the Standby Facility": "26 On 10 April 2015, Mr Chia, Mr Aathar and Mr Fan signed the term sheet, as CEO and the two personal guarantors respectively. This signed term sheet was sent via email to Mr Tan.55Foot Note 55×ACB, Vol. 2 (“2ACB”) at p 690.Later the same day, Mr CP Lim sent the term sheet, now duly signed by Mr Tan via email to Mr Chia and Ms Lim, copying Mr Tan, Mr Aathar and Mr Fan.56Foot Note 56×2ACB at pp 694, 701.Separately, in accordance with the term sheet, Mr Aathar and Mr Fan also executed personal guarantees dated 10 April 2015.57Foot Note 57×2ACB at p 715. 27 On 17 May 2015, Mr Fan was appointed Group CEO. Subsequently, Mr Fan vetted a board paper prepared by Ms Lim. The board paper was dated 29 May 2015 and was meant to be put before the IHC’s board of directors to obtain their approval for the Standby Facility,58Foot Note 58×3ACB at p 1308.together with the legal documents prepared based on the draft documents sent by Mr Tan.59Foot Note 59×3ACB at p 1271. 28 On 29 May 2015, the board paper was circulated by email to the members of the IHC board. The email and the board paper stated that the Standby Facility was to be “utilised for general working capital” and “[f]or general working capital purpose[s]” respectively.60Foot Note 60×3ACB at pp 1270, 1308.The only securities listed in the covering email and the board paper were the Charged Shares and the personal guarantees provided by Mr Aathar and Mr Fan. There was no mention of a pledge of IHC shares acquired by drawing down on the Standby Facility. 29 At the material time, the IHC board of directors consisted of Dr Jong Hee Sen (“Dr Jong”) (who was the Non-Executive Chairman), Mr Dennis Siew Teng Kean (“Mr Siew”) (who was the lead independent director)61Foot Note 61×1ACB at p 370.and Mr Ong Lay Khiam (“Mr Ong”) (also an independent director). Board approval was obtained through a two-thirds majority on 3 June 2015.62Foot Note 62×Fan’s AEIC at [2.33]. 30 Essentially, Dr Jong and Mr Siew approved IHC’s entry into the Standby Facility by way of a written resolution backdated to 29 May 2015.63Foot Note 63×1ACB at p 370.Importantly, Mr Siew’s approval was on the premise that the Standby Facility “with the accompanying interest charge [was] essential for the continued operations of the company”.64Foot Note 64×5AB at p 2324.Mr Ong, however, declined to approve the matter, explaining in an email dated 29 May 2015 that he “[found] it difficult to justify approving a credit facility bearing the proposed high interest rate and fee”. He also questioned whether IHC was “so much in need of funds to raise this type of financing”.65Foot Note 65×5AB at p 2326. 31 Eventually, as described at [14] above, the initial facility agreement was fully executed on 21 July 2015, but backdated to 16 April 2015.66Foot Note 66×3ACB at p 1309.More specifically, 21 July 2015 was the date on which Mr CP Lim returned all documents, duly executed by the Crest entities, to IHC.67Foot Note 67×3ACB at p 1309.Upon the request of IHC, by way of a letter dated 28 July 2015, the Crest entities agreed to extend the tenure of the facility, and to enter into a second facility agreement in order to do so.68Foot Note 68×2ACB at p 1559.Thereafter, the Standby Facility agreement was executed, and this extended the arrangement to five months from the date of execution,ie,30 July 2015.69Foot Note 69×1ACB at pp 242 and 245.Dr Jong signed both the initial facility and Standby Facility agreements on behalf of IHC, while Mr Fan and Mr Aathar signed as personal guarantors.70Foot Note 70×1ACB at pp 67 and 275.",
        "Drawdowns on the Standby Facility to acquire IHC shares": "32 Meanwhile, according to the plaintiffs and the Crest entities, between 16 April 2015 and 24 August 2015, a total sum of S$17,332,081.15 was drawn down from the Standby Facility on 14 separate occasions by the Crest entities to purchase 59,304,800 IHC shares. The mechanism was that the shares were purchased by EFIII through EFIII’s brokerage accounts but were held in the name of VMIII.71Foot Note 71×D6CC2 at [16] and [16A] and Reply (Amendment No 3) to the 1st to 5th Defendants’ Defence (Amendment No 5) and Defence to the 1st to 5th Defendants’ Counterclaim (Amendment No 2) at [2.2.5]. 33 Of these 14 occasions, eight occurred before the board paper had even been put to the IHC board of directors for their approval on 29 May 2015 and involved the sum of S$12,833,234.40. A further five drawdowns, amounting to S$2,788,556.13, had been made before the legal documents were formally executed on 21 July 2015.72Foot Note 72×Yet’s AEIC at [24].The transactions were made on Mr Aathar’s instructions to Mr Tan (which Mr Tan asserted were given through telephone calls, SMS messages and WhatsApp text messages).73Foot Note 73×Yet’s AEIC at [24]; AB, Vol. 7 (“7AB”), pp 3478 to 3488. 34 In relation to these events, the consistent position of Mr Aathar, Mr Fan and Ms Lim was that there was no drawdown on the Standby Facility at all, and certainly not to purchase shares on IHC’s behalf.74Foot Note 74×Aathar’s AEIC at [3.32]; Fan’s AEIC at [5.9]; Lim’s AEIC at [55].Instead, Mr Aathar claimed that the Crest entities had used their own funds to purchase IHC shares for themselves. To explain the messages exchanged with Mr Tan concerning share purchases, Mr Aathar said that from time to time, he advised Mr Tan in relation to investing in IHC’s shares.75Foot Note 75×Aathar’s AEIC at [3.23] to [3.27].",
        "Negotiations for repayment": "35 On 9 September 2015, SGX announced that investors should exercise caution when dealing with IHC’s shares. Its investigations revealed that from April to August 2015, 60% of IHC’s traded share volume was conducted by a handful of individuals.76Foot Note 76×Yet’s AEIC at [29]; 3ACB at p 1893.This triggered a plunge in IHC’s share prices down to S$0.10 per share.77Foot Note 77×Yet’s AEIC at [31]. 36 On 19 October 2015, Crest Capital demanded repayment of sums due under both the Standby Facility and the Geelong Facility. In the letter of demand to IHC for the Standby Facility addressed to Dr Jong, and copied to Mr Fan and Mr Aathar, Crest Capital requested repayment of standby fees due and owing in the sum of S$2,754,850 for 16 June to 15 October 2015.78Foot Note 78×Tan’s AEIC at [70]; 3ACB at pp 1562 - 1563.While it stated that the disbursement was made on 16 April 2015, there was no mention of the principal sum due under it.79Foot Note 79×3ACB at p 1562.I should add that the standby fees were paid for the period of 16 April to 15 June 2015.80Foot Note 80×Tan’s AEIC at [65], 1ACB at pp 237, 363; 8AB at pp 4103, 4104. 37 In the letter of demand to IHC Medical Re for the Geelong Facility, addressed to Ms Lim, and copied to Mr Fan and Mr Aathar, Crest Capital requested for payment of S$11,885.250, comprising of the principal of S$11,500,000, together with interest of S$385,250 accruing from 19 September 2015 (which was the maturity date of the facility).81Foot Note 81×3ACB at p 1565. 38 On 23 October 2015, Mr Aathar wrote an email to Crest Capital, as well as Mr Fan and Ms Lim, stating as follows82Foot Note 82×3ACB at p 1577.: We refer to your 3 letters namely in respect ofGeelong, IHC Placement and the Standby Facility. We are putting together the different proposals for these respective accounts. We hope these proposals will lead to a workable solution to repay or restructure some of these funding. Please avail us the weekend to sort out the details and I will put forth next Tuesday our proposals for your consideration. [emphasis added] 39 I should explain that the term “IHC Placement” refers to 20.83m IHC shares purchased by EFII prior to IHC’s listing in 2013, for which Mr Aathar, Mr Fan and Dr Jong had given a profit warranty (the “placement shares”). This transaction gave rise to a separate set of proceedings in which EFII obtained judgment against Dr Jong for the profit: seeThe Enterprise Fund II Ltd v Jong Hee Sen[2020] 3 SLR 419. 40 Negotiations over repayment involving Mr Aathar, Mr Fan and Mr Tan commenced on 27 October 2015. In an email to Mr Tan, copied to Mr Fan, Mr Aathar set out proposals concerning the placement shares, “market shares of $17.2m or 59.3m shares” and “Geelong loans” (referring to the amount outstanding under the Geelong Facility).83Foot Note 83×3ACB at p 1591.The exchange of emails with Mr Tan continued until end 2015,84Foot Note 84×3ACB at p 1591-1756.which consistently included discussions on the sum of S$17m used to purchase the 59,304,800 IHC shares. No other IHC representatives appear to have been privy to these settlement discussions. 41 In the course of the negotiations, there was never any dispute over the intent and purpose of the Standby Facility, as Mr Fan and Mr Aathar well knew about the drawdowns. This was the position of IHC and the Crest entities. However, Mr Aathar asserted that after suffering losses in their investments in IHC shares, the Crest entities decided to pin their losses on IHC, by claiming that there were disbursements under the Standby Facility. By way of his proposals, he was merely assisting the Crest entities to find an “exit plan”.85Foot Note 85×Aathar’s AEIC at [3.37] to [3.46].As for Mr Fan, he said that he found out only on 21 October 2015 that Mr Tan had improperly used funds from the Standby Facility to purchase IHC shares.86Foot Note 86×Fan’s AEIC at [2.47].",
        "Dispute over the Standby Facility": "42 In December 2015, IHC made two payments to the Crest entities. The first payment of a sum of S$3.5m was made on 4 December 2015. It was applied towards the Geelong Facility (which IHC did not take issue with).87Foot Note 87×3ACB at p 1801.The second payment of S$3,883,950 was made on 18 December 2015.88Foot Note 88×3ACB at p 1778.The Crest entities applied this payment towards the Standby Facility.89Foot Note 89×3ACB at p 1782.IHC took issue with this, and contended that the payment was always intended for and should have been applied to the Geelong Facility, and not the Standby Facility. 43 From 11 February 2016, a flurry of correspondence between the finance team of IHC (represented by Ms Tan Siew Yee) and the finance team of the Crest entities (represented by Ms Evelyn Ordinario) took place. In general, IHC denied having drawn down on the Standby Facility, and requested the Crest entities to provide supporting evidence of any alleged drawdowns. In response, the Crest entities generally asserted that drawdowns had taken place, while refusing to provide further particulars to IHC. Instead, IHC was asked to check with Mr Fan and Mr Aathar for the details.90Foot Note 90×3ACB at pp 1815 to 1819. 44 On 7 April 2016, the solicitors for the Crest entities, WongPartnership LLP (“WongPartnership”) served a letter of demand on IHC to claim for sums due under the Standby Facility91Foot Note 91×3ACB at p 1822.and a letter of demand on IHC Medical Re to claim for sums due under the Geelong Facility.92Foot Note 92×3ACB at p 1820.These claims were resisted by IHC’s then solicitors, Pinnacle Law LLC (“Pinnacle”), responding by way of a letter to state that IHC did not record any liability under the Standby Facility.93Foot Note 93×3ACB at p 1824.IHC also stated that the Crest entities had wrongly attributed the payment of S$3,883,950 to the Standby Facility instead of the Geelong Facility, and asked the Crest entities to rectify that error. IHC also stated that unless the Crest entities did so, it would not be making any further repayments toward the Geelong Facility.94Foot Note 94×3ACB at p 1825. 45 On 13 April 2016, WongPartnership replied by way of a letter stating that the Crest entities would provide “their substantive response shortly”.95Foot Note 95×3ACB at p 1826.However, on 15 April 2016, pursuant to cl 8 of the 17 June Deed and the 30 July Deed, the Crest entities appointed receivers over the Charged Shares (the “Crest Receivers”),96Foot Note 96×3ACB at p 1827.thereby gaining control over IHC Medical Re and the Australian properties.",
        "The present action": "46 On 28 April 2016, the present action was commenced by IHC seeking,inter alia,to remove the Crest Receivers. 47 On 23 January 2017, IHC held an extraordinary general meeting in which the then incumbent board of IHC (which included Ms Lim) were removed.97Foot Note 97×Lim’s AEIC at [38]-[39]. 48 Since then, there have been two significant developments in the proceedings. On 7 June 2017, IHC departed from its initial stance that there were no drawdowns from the Standby Facility to purchase IHC shares, and agreed with the Crest entities that IHC shares were acquired on the instructions of Mr Aathar for IHC using the funds. The plaintiffs also brought in Mr Fan and Mr Aathar as the sixth and seventh defendants.98Foot Note 98×Statement of Claim (Amendment No 2).Thereafter, on 8 May 2018, Ms Lim was joined as the eighth defendant.99Foot Note 99×Statement of Claim (Amendment No 3).",
        "Some related proceedings": "49 I should also mention some related proceedings. 50 On 28 April 2016, the same day this action was commenced, IHC transferred IHC Medical Re’s sole unit in IHC Healthcare REIT (Singapore Trust) (which held the Australian properties) to IHC Japan for S$1. Upon discovering this, on 5 August 2016, the Crest entities commenced High Court Suit No 856 of 2016 (“Suit 856”) against,inter alia,IHC, Mr Fan, Mr Aathar and Ms Lim for unlawful conspiracy in relation to the transfer.100Foot Note 100×Statement of Claim in HC/S 856/2016 at [45].On 8 August 2016, the Crest entities obtained injunctive relief to prevent IHC from interfering with the Crest entities’ security. On 16 August 2016, the asset was transferred back to IHC Medical Re.101Foot Note 101×HC/ORC 5440/2016 in HC/S 856/2016. 51 Shortly after, on 25 August 2016, the Australian properties were placed in receivership.102Foot Note 102×Yet’s AEIC at [75(n)], [76(l)].The Australian properties were subject to senior mortgages held by three Australian financial institutions, National Australia Bank Limited (“NAB”), Westpac Banking Corporation Limited (“Westpac”) and Qualitas Real Estate Finance Pty Ltd (“Qualitas”).103Foot Note 103×Yet’s AEIC at [75(a)], [76(a)].According to the plaintiffs, the appointment of the Crest Receivers triggered notices of default under these mortgages.104Foot Note 104×Yet’s AEIC at [75(b)], [76(c)].NAB and Westpac then appointed their own receivers from KPMG Australia and KordaMentha (the “Australian Receivers”) over the Australian properties.105Foot Note 105×Yet’s AEIC at [75(n)], [76(l)].Eventually, the Australian Receivers proceeded to sell the Australian properties.106Foot Note 106×Yet’s AEIC at [80]. 52 Upon the application of IHC in Suit 856 to set aside the injunction, on 20 October 2016, Andrew Ang J ordered that the surplus sale proceeds from the Australian properties were to be applied towards repayment of the undisputed amount of the principal outstanding under the Geelong Facility (inclusive of interest up to the date of payment). Thereafter, the quantum representing the principal amount of the disputed Standby Facility, the disputed portion of the Geelong Facility and all costs, fees and expenses incurred by the Crest entities in respect of or in connection with the receivership, was to be held in escrow in a bank account and secured by a banker’s guarantee to be issued in favour of IHC.107Foot Note 107×Yet’s AEIC at [79].I shall refer to this as the “20 October Court Order”. As the Crest entities discontinued the action on 2 July 2019, by consent, I granted an order in the present action which replicated the terms of the earlier order.108Foot Note 108×HC/SUM 3659/2019, HC/ORC 6101/2019. 53 In the meantime, on 6 April 2017, under its new management, IHC commenced the proceedings against the Standby Facility investors in High Court Originating Summons No 380 of 2017 (“OS380”) which culminated inThe Enterprise Fund III([5]supra), where the Court of Appeal held that the Standby Facility, as well as the acquisition of shares using the funds drawn down from it, were void by virtue of s 76A(1)(a) of the Companies Act, and that IHC did not owe any contractual liability under the Standby Facility (at [134]). 54 With this context in mind, I turn to the parties’ cases.",
        "The parties’ cases": "",
        "The plaintiffs’ case": "55 As pleaded in Statement of Claim (Amendment No 4) (the “SOC4”), there are three causes of action against the defendants. 56 First, the plaintiffs allege breach of duties by Mr Fan and Ms Lim. Mr Fan was the Group CEO of IHC from 17 May 2015 to 30 June 2015 and subsequently acted as CEO of IHC from 30 June 2015 to 31 January 2016. He was also, at all material times, the shadow director of the plaintiffs. He thus owed the following six duties to the plaintiffs:109Foot Note 109×Statement of Claim (Amendment No 4) (the “SOC4”) at [1.6] - [1.7]. (a) A duty to actbona fidein their best interests; (b) A duty to exercise his powers for proper purposes; (c) A duty of fidelity; (d) A duty to avoid any conflict between his duties and his personal and other interests; (e) A duty to exercise due skill, care and diligence in the discharge of his duties; and (f) A statutory duty under s 157(1) of the Companies Act imposed on directors to act honestly and use reasonable diligence in discharging the duties of office. 57 As an officer of IHC during the material period of time, Ms Lim owed the first five duties as set out above at [56(a)] - [56(e)] to IHC.110Foot Note 110×SOC4 at [1.8] – [1.9]. 58 At all material times, the defendants intended, and in fact, used the Standby Facility for the purpose of acquiring IHC shares for IHC in contravention of s 76 of the Companies Act.111Foot Note 111×SOC4 at [2.2.4].There was no commercial purpose for the Standby Facility, and it served mainly to benefit the substantial shareholders, namely, Mr Fan and Mr Aathar.112Foot Note 112×SOC4 at [2.2.6]In addition, the terms of the Standby Facility were disadvantageous to IHC.113Foot Note 113×SOC4 at [2.2.7] - [2.2.8]. 59 In breach of their duties, Mr Fan and Ms Lim caused IHC to enter into and draw down on the Standby Facility to purchase IHC shares.114Foot Note 114×SOC4 at [2.2.9] – [2.2.13].I pause to observe that while the plaintiffs pleadthat Mr Fan owed IHC Medical Re duties, they only allege breach of duties towards IHC. 60 Second, the Crest entities, Mr Aathar and Ms Lim knew or ought to have known that Mr Fan was acting in breach of his duties to IHC. They dishonestly assisted in his breach of duties as follows:115Foot Note 115×SOC4 at [2.2.10] – [2.2.11]. (a) The Crest entities agreed to extend the Standby Facility to IHC. (b) Mr Aathar negotiated with the Crest entities on the Standby Facility with the knowledge and authority of Mr Fan, and extended his personal guarantee to the Crest entities to facilitate the grant of the Standby Facility. (c) Ms Lim prepared and finalised the Standby Facility documents, and prepared and circulated the board paper to recommend IHC’s approval of the Standby Facility. 61 Third, all the defendants engaged in an unlawful means conspiracy to injure IHC by means of Mr Fan’s breach of duties and the contravention of s 76 of the Companies Act, in causing IHC to enter into and draw down on the Standby Facility.116Foot Note 116×SOC4 at [2.2.14]. 62 Accordingly, the defendants are jointly and severally liable by way of damages and/or equitable compensation for losses sustained by IHC and/or IHC Medical Re as a result of entering into and drawing down on the Standby Facility, and consequential losses connected with the Geelong Facility.117Foot Note 117×SOC4 at [4.1.1], [4.1.2], [4.1.2A] and [4.1.2B].I shall set these out in detail at [219] below.",
        "The Crest entities’ case": "63 In the Crest entities’ Defence (Amendment No 6) and Counterclaim (Amendment No 3) (the “D6CC3”), they plead that the Standby Facility was for general working capital, and was widely worded to allow the IHC to use the funds for any purpose (including the purchase of IHC’s own shares).118Foot Note 118×D6CC3 at [13]. 64 Thus, the Crest entities deny that they had “intended” to use the Standby Facility for the specific purpose of IHC acquiring its own shares. They admit, however, that Mr Fan and Mr Aathar had indicated that they intended for the funds to be used to acquire IHC’s shares, and eventually that the funds were disbursed for such a purpose. They granted the Standby Facility because of the long-standing business relationship with IHC (and its associated companies), as well as IHC’s ability and willingness to provide sufficient security.119Foot Note 119×D6CC3 at [15B]. 65 The Crest entities deny that the terms of the Standby Facility were disadvantageous to IHC, and assert that given the short-term and urgent nature of the facility, its terms (eg,the high interest rates imposed) are not out of line with comparable short-term working capital loan facilities of a similar nature.120Foot Note 120×D6CC3 at [15H] - [15I]. 66 Further, the Crest entities claim that they were not obliged to enquire into whether there was any non-compliance with the Companies Act, and were not alerted to any contravention in relation to the Standby Facility. They were not aware of any contravention of s 76 of the Companies Act by IHC.121Foot Note 121×D6CC3 at [15C]. 67 Also, the Crest entities claim that they relied on IHC’s actions and representations that all necessary actions or steps to ensure that the obligations in the Standby Facility would be legally enforceable, and that the performance of the obligations would not violate any law or regulation.122Foot Note 122×D6CC3 at [15D]. 68 As such, the Crest entities were not aware of any breach of duty by Mr Fan to IHC. They did not dishonestly assist in any such breach of duty by Mr Fan. Also, they did not conspire with Mr Aathar and Ms Lim to injure IHC by unlawful means.123Foot Note 123×D6CC3 at [15K] and [15O].At all material time, there were other officers and employees of IHC who were involved in the transaction, including Mr Chia and Dr Jong, which only reinforced the impression given to the Crest entities that there could not have been anything amiss.124Foot Note 124×D6CC3 at [15KA]. 69 Turning to the losses allegedly suffered by the plaintiffs, the Crest entities deny such losses.125Foot Note 125×D6CC3 at [29B]. 70 In the counterclaim, the Crest entities seek a set-off and/or an indemnity from IHC under cl l0.1 of the Standby Facility and/or cl 10.1 of Geelong Facility to recover the sums drawn down from the Standby Facility amounting to S$17,332,081.15, as well as legal fees of S$21,614 in respect of the Standby Facility.126Foot Note 126×D6CC3 at [42]-[44], read with [29E] – [29G].It seems to me that the claim has been abandoned altogether as there are no submissions on the matter. Indeed, in light of the Court of Appeal’s judgment inThe Enterprise Fund III([5]supra), the Crest entities cannot enforce cl 10.1 of the Standby Facility. Also, there is no basis for the Crest entities’ reliance on cl 10.1 of the Geelong Facility to claim the losses under the Standby Facility. I note, however, that the Crest entities prayed and submitted forcostson an indemnity basis based on the provision.127Foot Note 127×D6CC3 at [47(f)]. 1DCS at [404]. 71 In the alternative, the Crest entities seek to recover the drawdowns on the Standby Facility on the ground of unjust enrichment.128Foot Note 128×1DCS at [323]. 72 Finally, on the ground of mistake, the Crest entities seek to rectify the default interest clause in the Geelong Facility which expressly provided for default interest charge at 3% per annum to 3% per month.129Foot Note 129×D6CC3 at [46].",
        "Ms Lim’s case": "73 In her Defence (Amendment No 2) and Counterclaim (the “D2CC”), Ms Lim admits that she owed the same duties to IHC as Mr Fan allegedly did (as per the plaintiffs’ pleadings).130Foot Note 130×Lim Beng Choo’s Defence (Amendment No 2) and Counterclaim (“D2CC”) at [8].However, she pleads that there were,inter alia,two implied terms of her employment:131Foot Note 131×D2CC at [10]–[11]. (a) that she would obey and co-operate with IHC to carry out all lawful and reasonable directions given by IHC; and (b) that IHC would not cause Ms Lim to carry out any order, instruction or direction other than lawful or reasonable ones. 74 As far as Ms Lim was concerned, at the material time, the Standby Facility was a credit facility for IHC’s working capital.132Foot Note 132×D2CC at [17], [18] and [20].There was no drawdown on the Standby Facility for any purpose in which she was involved or of which she had any knowledge.133Foot Note 133×D2CC at [28] and [33].The Crest entities had bought the IHC shares with the funds drawn down from the Standby Facility for themselves without the authority of IHC.134Foot Note 134×D2CC at [36D]. 75 Therefore, Ms Lim’s case is that she did not dishonestly assist or procure Mr Fan’s breach of his fiduciary duties. She prepared and finalised the legal documents for IHC’s entry into the Standby Facility and circulated the board paper to the IHC board of directors for the purpose of seeking their approval for the Standby Facility upon the instructions of Mr Chia (and then Mr Fan). She acted honestly and reasonably in carrying out the assigned tasks, taking into account fiscal considerations (eg,repayment, security and other requirements), and IHC’s cash flow situation.135Foot Note 135×D2CC at [30]. 8th Defendant’s Closing Submissions (“8DCS”) at p 35, [20(a)].She also denies that she had engaged in an unlawful means conspiracy with the other defendants to injure IHC.136Foot Note 136×D2CC at [34]. 76 Ms Lim also avers that IHC had paid money erroneously toward the Standby Facility, and therefore she was not liable for principal, standby fee or default interest claimed by it as losses under the Standby Facility.137Foot Note 137×D2CC at [44A]. 77 As for losses under the Geelong Facility, Ms Lim avers that IHC had sufficient means to pay off the outstanding amount and interest under the Geelong Facility, even after erroneously paying down the Standby Facility. IHC could and ought to have deployed available funding to do so. In the alternative, liability was incurred solely because of IHC’s impecuniosity.138Foot Note 138×D2CC at [44B] – [44C]. 78 Ms Lim denies liability for the remaining categories of losses.139Foot Note 139×D2CC at [44D] – [44E]. 79 In her counterclaim, Ms Lim seeks an indemnity against IHC for any sums she might be found liable for on the basis of Art 153 of IHC’s Articles of Association, or alternatively, an implied indemnity arising out of the terms of her employment with IHC.140Foot Note 140×D2CC at [47].She also seeks relief under ss 391(1) and 391(3) read with s 76A(13) of the Companies Act.141Foot Note 141×D2CC at [49].",
        "The positions of Mr Fan and Mr Aathar": "80 Mr Fan did not file a defence to the action, while Mr Aathar filed a four-page defence comprising mainly of bare denials on 18 April 2018. They each filed an affidavit of evidence-in-chief (“AEIC”), and testified at the trial. I have set out their evidence on the key matters above at [23]–[24], [34] and [41]. Their general position is that the Standby Facility was not intended for, and was not used to purchase IHC shares.",
        "Issues to be determined": "81 Based on the above, the following issues fall for determination in relation to each of the plaintiffs’ claims: (a) Breach of duties towards IHC (i) whether Mr Fan owed and breached any duties to IHC; and (ii) whether Ms Lim owed and breached any duties to IHC. (b) Dishonest assistance (i) if Mr Fan acted in breach of his duties to IHC, whether the Crest entities, Mr Aathar and/or Ms Lim assisted in such breach; and (ii) whether such assistance was dishonest. (c) Conspiracy by unlawful means (i) whether the contravention of s 76 of the Companies Act for IHC to enter into and draw down on the Standby Facility to purchase its own shares and/or Mr Fan’s breach of duties are/is unlawful for the purposes of the tort of unlawful means conspiracy; (ii) whether the Crest entities, Mr Fan, Mr Aathar and/or Ms Lim had acted in combination with and/or in furtherance of an agreement to cause IHC to enter into and draw down on the Standby Facility to purchase its own shares and/or Mr Fan’s breach of duties; and (iii) whether the Crest entities, Mr Fan, Mr Aathar and /or Ms Lim had the intention to cause loss or damage to IHC. 82 Should any party be found liable for any of the three causes of action, further issues arise as to whether such party caused any of the losses, as well as the proof and quantification of such losses (save for the quantification of any loss of the Australian business held through IHC Medical Re which will be dealt with separately). 83 As for the counterclaim by the Crest entities, the issues are: (a) whether IHC is liable for the claim for unjust enrichment for the sums disbursed by them pursuant to the Standby Facility, which was void for illegality by virtue of s 76A(1)(a) of the Companies Act; (b) whether the default interest clause under the Geelong Facility should be rectified; and (c) whether the Crest entities are entitled to an indemnity from IHC. 84 In relation to Ms Lim’s counterclaim, the issue is whether IHC should indemnify her in respect of any loss she may be found liable for.",
        "The underlying factual disputes": "85 Prior to dealing with the issues, it is necessary to resolve two underlying factual disputes between the plaintiffs and the Crest entities (on the one hand), and Mr Fan, Mr Aathar and Ms Lim (on the other hand). These concern the purpose of the Standby Facility, and whether IHC shares were acquired on behalf of IHC using funds from the Standby Facility on the instructions of Mr Aathar. 86 I should add thatThe Enterprise Fund III([5]supra) proceeded on a factual premise agreed upon by IHC and the Standby Facility investors (ie,EFIII, VMF3 and VMIII) that the Standby Facility was meant to fund IHC in its acquisition of its shares, and that IHC shares were purchased for IHC using such funds. This is also the position of the plaintiffs and the Crest entities here. However, I agree with Ms Lim thatres judicata,specifically issue estoppel, does not applyvis-à-visMr Fan, Mr Aathar and Ms Lim on these issues. Four elements must be established in order to give rise to issue estoppel, including the requirement that the two actions must involve the same parties:Turf ClubAuto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal and other matters[2017] 2 SLR 12 (“TurfClub”) at [87]. There is no identity of parties between the two sets of proceedings.142Foot Note 142×8DCS at [22].",
        "Purpose of the Standby Facility": "87 To reiterate, according to the Crest entities, the Standby Facility came about because of Mr Aathar’s request made to Mr Tan at the 3 April 2015 meeting, followed up by the two 4 April 2015 emails, for up to S$20m to combat a short-selling attack on IHC’s shares.143Foot Note 143×Tan’s AEIC at [23]-[27].To that end, the Crest entities could directly buy and hold the IHC shares as security.144Foot Note 144×Tan’s AEIC at [32].The plaintiffs adopt Mr Tan’s account. 88  Mr Fan and Mr Aathar, however, contend that the discussion on 3 April 2015 and Mr Aathar’s first email of 4 April 2015, related to Mr Aathar’s personal request for the Crest entities to invest directly in IHC shares. Mr Aathar said that the second 4 April 2015 related to the Standby Facility which was proposed by Mr Tan, after the Crest entities refused to invest directly in IHC shares: see [23]–[24] above. Thereafter, it was the board of directors who approved the entry into the Standby Facility.145Foot Note 145×Aathar’s AEIC at [4.13]. 89 While Ms Lim did not throw light on the 3 April 2015 meeting or the two 4 April 2015 emails, she agrees with Mr Fan and Mr Aathar that the Standby Facility had nothing to do with the acquisition of IHC shares, and was one for “general working capital” only: see [25] above. 90 Having reviewed the evidence, I accept Mr Tan’s version of events, and reject that given by Mr Aathar and Mr Fan for these reasons: (a) Mr Tan’s version is consistent with the contents of the first 4 April 2015 email which I reproduced at [19] above. Throughout the email, Mr Aathar used “we” instead of “I”. Specifically, he wrote that “[w]e look to Crest to provide a standby line of $20m for use against this activity.” As one of the terms of the standby line, he added that “[s]hares can be bought and held by Crest directly.” Three points are evident: (i) First, Mr Aathar did not make the request in his personal capacity. His explanation that “we” referred to Mr Tan and himself makes no sense. It was clearly a request by Mr Fan and him, on behalf of IHC. (ii) Second, the request was to avail IHC of funds by way of a standby line to combat the short-selling activity. (iii) Third, there was no mention of the Crest entities investing in the shares. The Crest entities were being asked to buy and hold the shares pursuant to the standby line. (b) Mr Tan’s evidence is also consistent with the contents of the second 4 April 2015 email. Given the proximity in time of the two emails, it seems to me they concerned the same deal. Indeed, they both carried the same subject title of “Standby Facility”. In it, Mr Aathar gave a firm undertaking on behalf of IHC in respect of the security arrangements for the facility, once again reinforcing the position that at all times, the request was for IHC. (c) Subsequently, the term sheet and the Standby Facility captured the key terms within the first 4 April 2015 email, and required the security arrangements set out in the second 4 April 2015 email. (d) Moreover, as I shall discuss later, in accordance with the first 4 April 2015 email, the Crest entities proceeded to purchase IHC shares and hold them as security. 91 In contrast, the version proffered by Mr Fan and Mr Aathar would require a strained reading of the emails, and is inconsistent with the surrounding facts and circumstances. Therefore, I find that the Standby Facility originated from the 3 April 2015 meeting and the two 4 April 2015 emails. Its purpose was to avail IHC of funds for the acquisition of IHC shares. The Crest entities, Mr Fan and Mr Aathar well knew of this purpose for the standby line – which was eventually formalised as the Standby Facility. 92 While I thus reject Ms Lim’s position that the Standby Facility was merely one for “general working capital”, her knowledge of the state of affairs remains to be considered. In due course, at [197] below, I shall also consider the Crest entities’ arguments that, in any event, they did notintendthe acquisition of the shares to be thesolepurpose for the Standby Facility,146Foot Note 146×Tan’s AEIC at [25].and that they did not know of any contravention of the Companies Act.147Foot Note 147×Tan’s AEIC at [39].",
        "Whether IHC shares were acquired for IHC with funds from the Standby Facility": "93 According to the Crest entities, from April to August 2015, Mr Aathar instructed Mr Tan to purchase IHC shares. A total sum of S$17,332,081.15 from the Standby Facility was used to purchase 59,304,800 IHC shares (which were held on behalf of IHC). Again, the plaintiffs adopt this account: see [32] above. However, Mr Fan and Mr Aathar assert that the Crest entities invested in IHC shares for themselves, but decided to pin the losses on IHC by claiming that there were drawdowns from the Standby Facility. Similarly, Ms Lim says that there were no drawdowns: see [34] above. 94 Once again, it is the Crest entities’ version that I accept for these reasons: (a) The WhatsApp exchanges from Mr Aathar to Mr Tan clearly showed Mr Aathar activating the standby line, and giving instructions for Mr Tan to buy shares. As highlighted by the plaintiffs, these are some key messages:148Foot Note 148×PCS at [118]. (i) On 15 April 2015: “Yes, very very very stressful...If cannottahan, I may need to activate your line tomorrow. It is the same group selling as what we briefed you.” (ii) On 15 April 2015: “Thank you. Fan and me also feel if pressure we may have no choice but to seek your lines. Thanks.” (iii) 16 April 2015: “Hi Glendon, can queue to buy 5 million shares of IHC at 28.5c?” (iv) 6 July 2015: “Hi Glendon can assist on purchase? Can do 4m at 30c.” These messages completely undermined Mr Aathar’s explanation that he was simply giving advice to the Crest entities on their investments in IHC shares (see above at [34]). (b) On 8 May 2015, Mr Tan sent Mr Aathar and Mr Fan a spreadsheet showing the shares “bought on behalf” of IHC which indicated that around 18m IHC shares were bought in three transactions from 16 April to 8 May 2015.149Foot Note 149×4AB at p 2074. (c) Even though the legal documents were not fully executed until 21 July 2015, Mr Fan approved the payment of standby fees for the one-month period of16 April to 15 May 2015, made by way of two cheque payments of S$255,850 and S$399,000 dated 17 June 2015 and 2 July 2015 respectively.150Foot Note 150×1ACB at pp 237 and 363.In this connection, Mr Fan tried to explain that he signed the payment vouchers, which were “cleared by several set of people”, in error.151Foot Note 151×NE, 10 July 2019, p 163 lines 10-19.The explanation is not believable. As pointed out by the plaintiffs, on 2 July 2015, when the second cheque payment was made, Mr Tan had emailed Mr Fan and Mr Aathar to chase for the outstanding standby fees, and Mr Fan had forwarded the email to Mr Aathar for discussion. Mr Fan knew that the request for standby fees was in relation to the Standby Facility which had been drawn down.152Foot Note 152×5AB at pp 2466 – 2467. (d) After Mr Fan insisted that IHC would not pay for the standby fees for 16 May to 15 June 2015, Mr Aathar paid for the standby fees of S$700,000 out of his own pocket on 31 July 2015.153Foot Note 153×8AB at pp 4103-4104. (e) The subsequent conduct of Mr Fan and Mr Aathar in engaging in negotiations for the repayment of the Standby Facility and the Geelong Facility also amply demonstrated that they knew about the drawdowns on the Standby Facility. As stated above at [36], on 19 October 2015, the Crest entities sent Dr Jong (with Mr Fan and Mr Aathar copied) a request for payment for the standby fees of the Standby Facility.154Foot Note 154×AB, Vol. 6 (“6AB”) at p 2924.In the negotiations, Mr Aathar proposed to the Crest entities, in which Mr Fan must have acquiesced, to restructure the “market shares of S$17.2m or 59.3m shares”.155Foot Note 155×6AB at pp 2946 – 2947.This figure is broadly in accord with the drawdowns on the Standby Facility totalling S$17,332,081.15, which were used to purchase the 59,304,800 IHC shares. Mr Aathar’s explanation (set out at [41] above) was that in the course of the negotiations, he was merely assisting the Crest entities to find an exit strategy. This simply did not ring true. 95 Thus, the evidence points inexorably towards Mr Fan and Mr Aathar knowing about the drawdowns from the Standby Facility from 16 April 2015 to acquire IHC shares. I should add that Mr Aathar and Ms Lim argue that Mr Aathar was only a shareholder. He did not have the authority to instruct the drawdowns on behalf of IHC.156Foot Note 156×Aathar’s AEIC at [5.2]. 8DCS at [21].In relation to the claims and the counterclaims, Mr Aathar’s authority is not a relevant legal issue, and would not affect any factual findings I have to make. Whether or not he was authorised to do so (which may be a matter for another day), the evidence showed that Mr Aathar gave the instructions to Mr Tan on the share acquisitions. 96 Here, again, while I reject Ms Lim’s contention that there was no drawdown on the Standby Facility to acquire IHC shares, the question of her knowledge of these matters remains to be analysed below.",
        "Conclusion": "335 From the above, I summarise my findings on liability as follows: (a) Mr Fan acted in breach of his core fiduciary duties to IHC. (b) Ms Lim acted in breach of her duty to IHC to act with skill, care and diligence. (c) The Crest entities and Mr Aathar dishonestly assisted Mr Fan in his breach of duties to IHC. Ms Lim is not liable for this cause of action. (d) The Crest entities, Mr Fan and Mr Aathar engaged in an unlawful means conspiracy to injure IHC. Again, Ms Lim is not liable for this cause of action. 336 In terms of remedies and reliefs, I grant judgment as follows: (a) Against the Crest entities, Mr Fan and Ms Lim, jointly and severally, for the sums paid by IHC towards the Standby Facility, totalling $4,538,800 to IHC. (b) Against the Crest entities and Mr Fan, jointly and severally, for interest representing loss of use of the S$4,538,800, amounting to S$4,440,780.77 to IHC. (c) Against the Crest entities and Mr Fan, jointly and severally, on the basis that the plaintiffs would have paid off the outstanding Geelong Facility liability on its maturity date of 28 February 2016, in favour of the plaintiffs: (i) the sum of S$3,615,066.07, as post-maturity interest and default interest; and (ii) loss of the Australian business, the quantification of which will be determined in separate proceedings. 337 In addition, I make an order that the Crest entities are not to charge the plaintiffs for any costs, expenses or fee relating to the Crest receivership, or to deduct any such costs, expenses or fees from the monies held in the escrow account pursuant to the 20 October Court Order and/or the order of court dated 1 July 2019 in these proceedings. 338 I do not, however, award damages for two losses connected to the 20 October Court Orderie,the cost of the banker’s guaranteeand the interest, default interest and exchange rate difference. I also do not award damages for a claim of overcharged default interest amounting to S$90,816 (as a form of loss of use of payments made towards the Standby Facility). 339 While I am of the view that Mr Aathar is liable, jointly and severally with the Crest entities and Mr Fan, for the above amounts, I am not in the position to grant judgment against him. The plaintiffs are at liberty to take any necessary action against Mr Aathar. 340 I dismiss the Crest entities’ counterclaims, as well as Ms Lim’s counterclaims. 341 Parties are to provide their costs submissions, and apply for other consequential orders (if any), within two weeks of this judgment. Hoo Sheau PengJudge Lee Eng Beng SC, Cheng Wai Yuen Mark, Chow Chao Wu Jansen, Danitza Hon Cai Xia and Sasha Gonsalves (Rajah & Tann Singapore LLP) for the plaintiffs; Manoj Pillay Sandrasegara, Chng Zi Zhao Joel, Tan Kai Yun and Wong Zheng Hui Daryl (WongPartnership LLP) for the first to fifth defendants; The sixth defendant unrepresented; Goh Kok Leong, Ng Weiting and Daniel Tan An Ye (Ang & Partners) for the eighth defendant.",
        "Breach of duties by Mr Fan": "98 According to the plaintiffs, Mr Fan owed IHC six duties as set out at [56] above, either as an officer of IHC from 17 May 2015 and/or as a shadow director at all material times.157Foot Note 157×PCS at [210]. See also 7AB at pp 3482 – 3484 and 3488.Mr Fan denies that he was a shadow director. While he denies that he breached “any duty [he] owed to IHC as a CEO”, he does not clearly concede that he owed IHC such duties as alleged by the plaintiffs.158Foot Note 158×Fan’s AEIC at [3] and [4].Meanwhile, Ms Lim argues that Mr Fan owed certain (unspecified) fiduciary duties as CEO, but not in relation to the entry into the Standby Facility.159Foot Note 159×8DCS at [20(c)(xix)]. 99 I pause to observe that fiduciary duties are owed by directors of a company, and imposed on those employees considered to be fiduciaries of a company.The duties of honesty, fidelity and loyalty are core fiduciary obligations, but the duty to exercise due skill, care and diligence is not:Bristol and West Building Society v Mothew[1998] Ch 1 (“Mothew”) at 16C; andThen Khek Koon v Arjun Permanand Samtani[2014] 1 SLR 245 (“Then Khek Koon”) at [104]. As for the statutory duty pursuant to s 157(1) of the Companies Act, it is imposed on directors. 100 Therefore, in order to impose all six duties on Mr Fan, the plaintiffs have to prove that he was a shadow director. It is to this question that I now turn.",
        "Whether Mr Fan owed duties to IHC as a shadow director": "101 A shadow director is defined by s 4(1) of the Companies Act as “a person in accordance with whose directions or instructions the directors or the majority of the directors of a corporation are accustomed to act”. The policy impetus behind holding a person liable as a shadow director is that persons who are actually responsible for the important corporate decisions of a company should be held accountable regardless of what they are called and their motives or manner in making such corporate decisions:Raffles Town Club Pte Ltd v Lim Eng Hock Peter and others (Tung Yu-Lien Margaret and others, third parties)[2010] SGHC 163 (“Raffles Town Club”)at [47]. 102 To prove a shadow directorship, all that is required is evidence of a “discernible pattern of compliance with the shadow director’s instructions or directions”, with allowances for occasional departures from this pattern “for whatever reason”. It is not necessary for the court to find that thede factoandde juredirectors of the company “did not exercise any discretion or judgment” of their own:Raffles Town Clubat [45] and [47]. 103 The plaintiffs argue that Mr Fan was a shadow director of  IHC based on the following: (a) Mr Tan’s evidence that he perceived Mr Fan and Mr Aathar to be the “decision-makers” for IHC throughout the Crest entities’ business dealings with IHC.160Foot Note 160×PCS at [219]. NE, 13 August 2019, p 129 (lines 1-25) and p 130 (lines 1-18). (b) Mr Fan was privy to information on IHC’s financial position and business operations beyond that normally available to a substantial shareholder, owing to his regular meetings (once every three weeks) with Dr Jong.161Foot Note 161×PCS at [220].The plaintiffs contend that this, combined with the fact that Mr Fan had control over IHC’s management, explained his willingness to provide contractual warranties relating to the operational and management aspects of IHC.162Foot Note 162×PCS at [222]; 1st to 5th Defendants’ Supplementary Bundle of Documents (“CESCB”) at pp 175 to 176 and 188 to 190. (c) On 4 April 2015, Mr Aathar had, after checking with Mr Fan, purported to give the Crest entities a “firm undertaking from IHC” that all security arrangements would be promptly restored. This was in Mr Aathar’s second 4 April 2015 email. This indicated Mr Fan’s decision-making powers over IHC.163Foot Note 163×PCS at [230]. (d) The fact that Mr Chia and Ms Lim, as senior members of IHC’s management, had simply followed up to execute and complete the legal documentation for the Standby Facility without raising further queries after Mr Fan had instructed them to do so indicated that they were accustomed to acting on Mr Fan’s instructions.164Foot Note 164×PCS at [231]. 104 Even taking all of the above at the highest, they do not demonstrate the existence of a pattern of conduct in which the directors of IHC, or a majority thereof, were accustomed to act on Mr Fan’s instructions. There was no evidence showing that Mr Fan had even issued any instructions or directions to any of the directors of IHC. The fact that Mr Fan and Mr Aathar might have held themselves out as authorised deal negotiators whose negotiated terms were accepted by IHC, as Mr Tan alleged,165Foot Note 165×PCS at [233].did not in any way suggest that IHC’s directors were accustomed to act on their instructions. In particular, the directors of IHC did not accept or approve the Standby Facility deal blindly, but questioned the basis for it before making their decision. As observed at [30] above, both  Mr Siew and Mr Ong queried the need for the Standby Facility given the high interest rates, with Mr Siew approving the Standby Facilityonlyif it was necessary for the continued operations of IHC. Mr Ong rejected the deal. These were plainly not the actions of directors who were accustomed to acting on the instructions of Mr Fan. 105 Accordingly, I do not think that IHC has successfully proved that Mr Fan was a shadow director of IHC, or that he owed any duties as a shadow director. It follows that Mr Fan did not owe IHC the statutory duty imposed on directors under s 157(1) of the Companies Act.",
        "Whether Mr Fan owed duties to IHC as CEO": "106 I next turn to the question of whether from 17 May 2015, as Group CEO, and then later as CEO, Mr Fan owed the other five duties to IHC. In this connection, I do not find the cases cited by the plaintiffs in the closing submissions to be of assistance, as they involve the imposition of such duties on directors and/or shadow directors of companies (and not on other officers/employees of the companies): seeHo Kang Peng v Scintronix Corp Ltd (formerly known as TTL Holdings Ltd)[2014] 3 SLR 329 (“Ho Kang Peng”);Ng Eng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd,intervener) and another appeal[2009] 3 SLR (R) 109;Lim Weng Kee v Public Prosecutor[2002] 2 SLR (R) 848. 107 The starting point is that an employee may owe fiduciary duties to his employer in certain circumstances. For this principle, I turn toNottingham University v Fishel and another[2000] IRLR 471 (“Nottingham University”) where Elias J said at [97]: … [in] determining whether a fiduciary relationship arises in the context of an employment relationship, it is necessary to identify with care the particular duties undertaken by the employee, and to ask whether in all the circumstances he has placed himself in a position where he must act solely in the interests of his employer. It is only once those duties have been identified that it is possible to determine whether any fiduciary duty has been breached … 108 Thus, whether a fiduciary relationship arises in the context of an employment relationship is heavily fact-dependent:Quality Assurance Management Asia Pte Ltd v Zhang Qing and others[2013] 3 SLR 631 (“Quality Assurance”) at [25]. InClearlab SG Pte Ltd v Ting Chong Chai[2015] 1 SLR 163 (“Clearlab”), a case cited by Ms Lim, Lee Seiu Kin J set out a framework for applying theNottingham Universitytest as follows: (a) The court will only regard an employee as a fiduciary if he is placed in a position where he must act solely in the interests of his employer. A mere employment relationship does not support the existence of a fiduciary relationship. It must be shown that there are particular functions of the employee, which requires him to pursue the interests of his employer to the exclusion of other interests, including his own (at [272]). (b) The conditions for the imposition of fiduciary obligations on an employee are (at [275]): (i) The employee has scope for the exercise of some discretion or power. (ii) The employee can unilaterally exercise that power or discretion so as to affect the company’s legal or practical interests. (iii) The company is peculiarly vulnerable to or at the mercy of the employee holding the discretion or power. (c) An employee will not owe fiduciary duties in respect of all aspects of his employment. There is no wholesale importation of every kind of fiduciary duty into each case. The fiduciary duties that arise are context-dependent and must be accommodated within the terms of the employment contract without altering its intended operation. The real question is whether the employee owed specific fiduciary duties in the particular circumstances in which it is alleged that he had acted against the interests of the employer (at [278]). 109 It is a question of fact whether senior employees will owe the same fiduciary duties as that of directors. Applying the test inClearlab,a senior employee who owes such fiduciary duties would need to be vested with broad discretionarypowers of management over the company. Thus, inCanadian Aero Service Ltd v O’Malley(1973) 40 DLR (3d) 371 (“Canadian Aero”), the defendants, a president and executive vice-president of a company, were held to owe fiduciary duties similar to directors because they were “top management” employees: at 381. 110 Similarly, inABB Holdings Pte Ltd and others v Sher Hock Guan Charles[2009] 4 SLR(R) 111 (“ABB”), the High Court held that the defendant owed fiduciary duties akin to those owed by directors to the third plaintiff which he had breached by failing to inform the third plaintiff of the competitive intentions of potential competitors. This was because the defendant was in charge of all aspects of the third plaintiff’s business, being responsible for its general management as well as business development, marketing and sales. He was also in a position to hire and fire employees, and attended meetings of the Country Management Team where the plaintiffs’ various businesses were discussed. As such, at [42], he was found to have been “a very senior employee indeed” and therefore owed fiduciary duties which “have been formulated in various authorities as the duties owed by a director to his company and there is no reason to formulate the fiduciary duties of a senior employee any differently.” 111 Fiduciary duties will not be imposed on an employee who is subject to a high degree of supervision and review by a more senior employee. That was the case inNagase Singapore Pte Ltd v Ching Kai Huat and others[2007] 3 SLR(R) 265 (“Nagase”) where two employees, even though they had some authority to negotiate contracts on the company’s behalf or authorize the payment of invoices, were not held to be fiduciaries because they were members of the company’s middle management and had to obtain their superiors’ sanction for their decisions (at [29]). Similarly, inGriffin Travel Pte Ltd v Nagender Rao Chilkuri and others[2014] SGHC 205 (“Griffin Travel”), the employees in question were heads of their respective departments (one of them being the company’s Chief Financial Officer). Nevertheless, they were not held to be fiduciaries because they had to report to two more senior employees and obtain their sanction for many of their decisions. 112 It is clear from the authorities that fiduciary duties will likely only be imposed on an employee who is, effectively, the “ruler in his own domain”, subject to minimal levels of supervision and having a wide discretion over critical aspects of the company’s business. Fiduciary duties akin to those owed by a director would likely be imposed on senior employees whose domain extended to all or substantially all of the business of the company, as inABBandCanadian Aero. 113 Returning to the present case, I find that, Mr Fan, as Group CEO and subsequently CEO of IHC, was, from 17 May 2015, a member of IHC’s senior management. Indeed, his evidence at trial was that he was the leader of its management:166Foot Note 166×NE, 10 July 2019, p 134, lines 14 to 19. Q. That’s because on 17 May you had been appointed as group CEO? A. That’s correct. Q. So now you were in the management of the company, you were the leader of the management team? A. That’s correct. 114 In my view, this clearly shows that Mr Fan stood in a position analogous to the defendant inABBin that he had broad powers of management over IHC. Indeed, Mr Fan was not only part of IHC’s top management, he was its top executive. This is a case in which the full range of fiduciary duties owed by the directors of IHC ought to be imposed on Mr Fan, similar to the approach taken inABBandCanadian Aero. 115 Imposing fiduciary duties on Mr Fan in respect of IHC would not be inconsistent with the terms of his service agreement with IHC dated 17 May 2015 which requires him to act to promote the interests of the company. I set out the relevant extracts as follows:167Foot Note 167×Fan’s AEIC at p 841. 3. Duties 3.1 The Executive shall undertake such responsibilities, diligently perform such duties and exercise such powers in relation to the Company and its business as may form from time to time be assigned to him by or under the authority of the Board of Directors of the Company or vested in the Executive and shall comply with all regulations and directions made by or under the authority of the Board of Directors of the company from time to time. 3.2 During the Appointment, the Executive shall faithfully serve the Company and use his utmost endeavours to promote the interests of the Company and shall devote his full time, attention, abilities and skill to the affairs of the Company. [emphasis in original] 116 By the above, I find that upon his appointment as Group CEO and subsequently as CEO, Mr Fan owed to IHC the duties as pleaded (other than the statutory duty under s 157(1) of the Companies Act),ie,a duty to actbona fidein the best interest of IHC; a duty to exercise power for a proper purpose; a duty of fidelity; a duty to avoid any conflict; and a duty to exercise due skill, care and diligence.",
        "Whether Mr Fan breached his duties to IHC": "117 I now consider whether Mr Fan breached his duties to IHC. According to the plaintiffs, he did so by: (a) procuring IHC to enter into and draw down on the Standby Facility to purchase IHC shares, which was a contravention of s 76 of the Companies Act;168Foot Note 168×PCS at [241].and (b) actively concealing the illegal nature of the Standby Facility from others at IHC, including IHC’s board.169Foot Note 169×PCS at [242]. 118 Contrary to the assertions of Mr Fan, Mr Aathar and Ms Lim, as I found above (at [90]), the purpose of the Standby Facility was for IHC to acquire its own shares. Mr Fan was, alongside Mr Aathar, one of the two key persons involved in negotiating the terms of the Standby Facility with the Crest entities. Furthermore, I also found (at [95]) that Mr Fan knew about the drawdowns of the funds from 16 April 2015 to acquire IHC shares. I should add that in his evidence, Mr Fan admitted that he was aware of the prohibition against a company buying its own shares without a proper share buy-back mandate.170Foot Note 170×NE, 23 July 2019, p 46 line 20 to p 47 line 4.Indeed, Mr Aathar admitted to the same.171Foot Note 171×NE, 13 August 2019, p 20 lines 15-20. 119 Not only was such an arrangement illegal, it wasprima facieinimical to IHC’s interests, as IHC’s future resources would be diminished by such acquisitions of its own shares:Public Prosecutor v Lew Syn Pau[2006] 4 SLR(R) 210 (“Lew Syn Pau”) at [126]. Indeed, Mr Fan’s conduct demonstrated that he knew that it was illegal and detrimental to IHC’s interests. 120 With such background knowledge in mind, as Group CEO and subsequently CEO of IHC, Mr Fan vetted, approved and submitted the board paper to the IHC board of directors for their consideration.172Foot Note 172×5AB at p 2322.This board paper did not mention that funds drawn down on the Standby Facility would be used to purchase IHC shares. Instead, the board paper simply (and misleadingly) characterised the Standby Facility as being a loan facility for “generalworking capital purposes” (emphasis added).173Foot Note 173×5AB at p 2322.In my view, there would be no reason for Mr Fan to omit all mention of the purchase of shares if, to his mind, that was perfectly legal or in IHC’s interests. 121 This action was significant in causing IHC to enter into the Standby Facility. As I observed at [104], Mr Siew’s vote in favour of the Standby Facility, which broke the tie between the votes cast by Dr Jong and Mr Ong, was given on the basis that the Standby Facility was necessary for operational purposes. As such, it is questionable whether his approval would have been given had he been aware that the Standby Facility would be used to purchase IHC shares, with the result that IHC would likely not have entered into the Standby Facility in the first place. 122 By entering into the Standby Facility, IHC then incurred substantial liabilities in the form of the standby fees and drawdowns used to purchase its own shares. The plaintiffs argue that, from IHC’s perspective, there really was no commercial purpose at all for IHC to enter into the Standby Facility.174Foot Note 174×PCS at [13].Whether or not there was any purpose for IHC to prop up its share price, it was clear that the substantial shareholders (ie, Mr Fan and Mr Aathar) potentially stood to gain from the market interventions by such means. Mr Fan would have been well aware of this. 123 The above shows that, in breach of his duty to actbona fidein IHC’s interests, Mr Fan caused IHC to pursue a course of action that was inimical to its interests. His duty of fidelity required him to not act for his own benefit or the benefit of any third party without the informed consent of IHC. However, he failed to disclose to IHC’s board of directors that the funds had already been used from the Standby Facility to acquire IHC shares (which was the true purpose of the facility), and that this course of action may be of benefit to Mr Aathar and him. Along the same vein, he also put himself in a position of conflict, resulting in the breach of his duty to avoid conflicts of interest. I, therefore, find that Mr Fan had breached these core fiduciary duties he owed to IHC.",
        "Breach of duties by Ms Lim": "",
        "Whether Ms Lim owed duties to IHC": "124 The law on the imposition of duties on an employee are set out above: see [107]–[112]. From January 2015 to 6 January 2016, inclusive of the date on which IHC entered into the Standby Facility, Ms Lim was the Vice-President (Investments) of IHC. In that capacity, she was mainly involved with asset management, financing and disposition activities around a portfolio of overseas medical real estate. She also assisted the Chairman (who was Dr Jong at the material time) with loan reviews and cash flow management for IHC.175Foot Note 175×Lim’s AEIC at [22].In D2CC, Ms Lim admits to owing IHC the duties as pleaded by the plaintiffs.176Foot Note 176×D2CC at [8] and Lim’s AEIC at [34].Comparing Ms Lim’s role and functions with those of the employees inNagase([111]supra) andGriffin Travel([111]supra),I have some reservations as to whether Ms Lim was in such a senior position within IHC (especially in relation to entry into loans) as would justify imposing on her the core fiduciary duties owed by directors. Nonetheless, given the concession, I proceed on the basis that Ms Lim owed such duties to IHC.",
        "Whether Ms Lim breached her duties to IHC": "125 IHC argues that Ms Lim breached her duties to it for the following reasons: (a) Ms Lim was aware of the purpose of the Standby Facility, and that it had been used to purchase IHC shares in contravention of the Companies Act.177Foot Note 177×PCS at [138]-[152]. (b) While knowing that the true purport of the Standby Facility was to finance an illegal acquisition of shares, Ms Lim was instrumental in procuring IHC to enter into and draw down on the Standby Facility, by finalising the legal documents and preparing the board paper for the consideration of IHC’s board of directors.178Foot Note 178×PCS at [241]. 126 Ms Lim takes the primary position that the Standby Facility was not intended to be used (and was not used) to purchase IHC’s shares. She was aware that to acquire its own shares, IHC would have required an approval for share buyback (or be in contravention of s 76 of the Companies Act).179Foot Note 179×Lim’s AEIC at [55].Underlying this is a denial that she knew of the true state of affairs. In addition, Ms Lim contends that she had not breached her duties to IHC for four reasons:180Foot Note 180×8DCS at p 118, [(E)(h)(ii)]]. (a) She had acted in accordance with her superiors’ instructions. (b) She acted honestly. (c) She had reason to consider the Standby Facility to be in the interest of IHC. (d) She stood to make no personal gain. 127 I turn to the question of Ms Lim’s knowledge. In the main, the plaintiffs rely on six pieces of evidence to prove that Ms Lim knew of the true state of affairs:181Foot Note 181×PCS at [139]-[152]. (a) First, on 9 April 2015, Mr Fan forwarded the first 4 April 2015 email to Ms Lim as part of the chain of emails. To recapitulate, this was the email capturing the key terms of the standby line – including the term “[s]hares can be bought and held by Crest directly”. Shortly after, the term sheet, which stated that the Standby Facility would be secured by a pledge of IHC shares “purchased through Fund” was sent by Mr Tan to Ms Lim. Ms Lim had been informed of the purpose of the standby line. (b) Second, on 12 May 2015 at 6.15pm, Mr CP Lim sent Ms Lim an email requesting her to follow-up on the preparation of the “loan documents for the standby facility”.182Foot Note 182×2ACB at p 1067.For her reference, he attached “the SGX statement on the purchase of shares till date”.183Foot Note 183×2ACB at p 1068.The SGX statement, dated 16 April 2015, reflected the purchase of 11,100,000 IHC shares at the price of S$0.285 per share for the sum of S$3,173,316.34. In the same email, Mr CP Lim also stated that the Crest entities’ account team had sent out the debit note to IHC’s finance staff and that as the “first drawdown date is 16 Apr 2015”, “the full interest and principal repayment shall be 15 June 2015”. Ten minutes later, at 6.25pm, Mr CP Lim “recalled” the email.184Foot Note 184×2ACB at p 1069. On 13 May 2015, Mr CP Lim sent another email to Ms Lim, without any mention of the purchase of IHC shares and without attaching the SGX statement.185Foot Note 185×8th Defendant’s Supplementary Bundle of Documents (“8DSB”) at p 18.This email, however, retained the references made in his 12 May 2015 email to the first drawdown date (16 April 2015) and the full interest and principal repayment date (15 June 2015). (c) Third, Ms Lim knew about the two payments that were made to the Crest entities for the standby fees that were accrued from 16 April to 15 May 2015. Again, this pointed to her knowledge of a drawdown on the Standby Facility.186Foot Note 186×NE, 20 August 2019, p 103 line 5 to p 105 line 1. (d) Fourth, Ms Lim was content for the initial facility agreement to be backdated to 16 April 2015, even before the legal documents were finalised. (e) Fifth, in December 2015, the Crest entities sought to direct IHC’s repayment of S$3,883,000 towards the Standby Facility. In her WhatsApp message to Mr Fan on or about 18 December 2015, Ms Lim stated as follows:187Foot Note 187×8D2SB, 6. Mr Fan, Chu Pei said the $3.88m payment to Crest is for the standby facility. IHC’s books did not record any drawdown of the standby facility, hence we can’t be paying for tat [sic]. We need to discuss how we can reconcile tat [sic]. Ms Lim did not raise any concerns as to whether the claim was legitimate. (f) Sixth, as described at [43] above, in February and March 2015, when the finance teams from IHC and the Crest entities were engaged in the dispute regarding the outstanding amounts due under the Standby Facility and the Geelong Facility, the Crest entities repeatedly asked IHC to check with Mr Fan and/or Mr Aathar, Ms Lim merely forwarded the email chain to the latter two stating “FYI”.188Foot Note 188×6AB at p 3199.Ms Lim did not ask for any clarification. Implicit in her “FYI” email was the fact that she knew of the drawdowns to acquire IHC shares. 128 I note that on the first piece of evidence, Ms Lim’s explanation is that she did not pay any particular attention to the other emails attached to the thread sent by Mr Fan on 9 April 2015. She did not know of the existence of the first 4 April 2015 email – which was the last email in the chain.189Foot Note 189×Lim’s AEIC at [46a].She was more concerned about the legal documents, but there were no documents attached to Mr Fan’s email. As for the term sheet, even though she read it, she did not notice the mention of the pledge of the IHC shares.190Foot Note 190×NE, 16 August 2019, p 87 lines 7-9, and p 95 line12 to p 96 line 7.In response, the plaintiffs argue that it is unbelievable that Ms Lim, as the person in charge of the legal documents, would not have familiarised herself with the underlying details of the proposed transaction by reading the email and the term sheet. 129 In my view, Mr Fan’s email of 9 April 2015 was meant to introduce Mr Chia and Ms Lim to Mr Tan, so as to kick-start the process to formalise the transaction. As CEO, I would have expected Mr Chia to be more concerned about the purpose of the proposed transaction. As for Ms Lim, it is not unbelievable that she did not pay attention to the email right at the bottom of the chain because it is not entirely surprising that her focus would have been on the legal documents – which arrived via a subsequent email sent by Mr Tan. 130 As for the term sheet, when she received it, Ms Lim noted that the purpose was for “general working capital”. Even if she were to read the security term about the pledge of the IHC shares, the significance might not have been entirely clear to her without the necessary background information. In this connection, it is undisputed that Ms Lim was not involved in the initial negotiations over the Standby Facility, and that Mr Fan did not brief her on the deal.191Foot Note 191×NE, 10 July 2019, p 108, lines 13-17; 16 August 2019 at p 85 lines 19 to 25, and p 86 line 1. 131 Even taking into account the other pieces of evidence, I do not find that it has been proved on a balance of probabilities that Ms Lim knew or ought to have known that the very purpose of the standby facility was to acquire IHC shares, and that funds were used to purchase the IHC shares. The fact that Mr CP Lim withdrew the 12 May 2015 email with the SGX statement showed that Ms Lim was not meant to be privy to the share acquisitions.192Foot Note 192×2ACB at p 403.Ms Lim’s role was intended to be peripheral in nature,ie, limited to the preparation of documents and the making of payments due under the Standby Facility. That said, I am of the view that the surrounding circumstances would have alerted Ms Lim to the existence of the drawdowns on the Standby Facility beginning on 16 April 2015 (albeit for unknown purposes). 132 Although the 13 May 2015 email by Mr CP Lim removed all mention of any shares bought with the Standby Facility, it clearly referred to a first drawdown on the Standby Facility on 16 April 2015. At trial, Ms Lim attempted to explain away this email by asserting that the drawdown referred to was the Crest entities’ own drawdown from their own investors, and not a drawdown made by IHC. In fact, Ms Lim gave the same explanation for the fourth piece of evidence, as to why she accepted that the legal documents could be backdated to 16 April 2015.193Foot Note 193×NE, 20 Aug 2019, p 78, lines 20-25 to p 79, lines 1-17. Lim’s AEIC [46h(iii)].I do not find the explanation believable. 133 Seen in this context, the only reasonable conclusion Ms Lim could reach was that IHC had drawn down on the Standby Facility on 16 April 2015. The drawdown was for unknown purposes, and done without full and proper documentation. However, Ms Lim did not discuss the matter with Mr Fan, or highlight that fact to the board of directors. Instead, it seems to me that she acted unquestioningly to prepare the legal documents for the Standby Facility and the board paper without querying the circumstances that should have alerted her to the presence of irregularities in the use of the Standby Facility. 134 As for the payment of standby fees, Ms Lim explains that both Mr Fan and she took the “mistaken view” that the minimum sum of two months’ standby fees had to be paid to the Crest entities for the Standby Facility, and that it was payable from 16 April 2015,ie,when the Standby Facility had been put in place.194Foot Note 194×Lim’s AEIC at para 58.This was not a credible explanation. This, taken together with the fifth and sixth pieces of evidence on how she reacted when the Crest entities demanded for payment, reinforces my view that she was aware of the drawdowns from 16 April 2015. However, the evidence does not go further to show that she knew or ought to have known that the funds had been used for the acquisition of shares. 135 On the basis of the above, I find that Ms Lim breached her duty to IHC by failing to exercise due skill, care and diligence in the discharge of her duties. I accept that in her position, she remained answerable to Mr Chia, Mr Fan and Dr Jong, and had to take instructions from them. However, she should have made, but did not make, further enquiries as to the reasons for the drawdown on the Standby Facility, and to raise the matter to the board of directors before the signing of the legal documents had such reasons been unsatisfactory. As a result, IHC formally entered into the Standby Facility and incurred substantial liabilities to purchase its own shares. 136 Based on these findings, I do not think that Ms Lim breached the other duties. Without the requisite knowledge that the Standby Facility was for the illegal purpose of IHC acquiring its own shares, she would have thought that it was a facility for “general working capital”, and thus could have been used for that purpose. There are insufficient grounds to say that Ms Lim had not actedbona fide, that she had acted for improper purposes, or that she had taken into account the interests of the substantial shareholders to the detriment of IHC’s interests. Further, it was not seriously contended that Ms Lim stood to gain from the transaction. She did not put herself in a position of conflict of interests. 137 Having established that Mr Fan and Ms Lim owed and breached duties to IHC, I shall deal with the equitable compensation claimed by IHC later.",
        "Whether Mr Tan’s state of mind could and should be attributed to the Crest entities": "138 To hold the Crest entities liable for the substantive causes of action, the plaintiffs have to show dishonesty and/or an injurious intent on the part of the Crest entities. Before addressing these substantive claims, as alluded to above at [97], I deal with the question of whether Mr Tan’s state of mind could and should be attributed to the Crest entities. 139 A company, not being a natural person, cannot possess a mental state. As such, the mental state of a natural person must be attributed to the company for it to be so liable:Ho Kang Peng([106]supra) at [47]. The principles of attribution are well-settled, and are derived from Lord Hoffmann’s analysis inMeridian Global Funds Management Asia Ltd v Securities Commission[1995] 2 AC 500 (“Meridian”). 140 As summarised by Vinodh Coomaraswamy J inOng Bee Chewv Ong Shu Lin[2019] 3 SLR 132 at [140], Lord Hoffmann inMeridiangrouped the rules of attribution into three sets. (a) The first set comprises the primary rules of attribution which are found in the company’s constitution or implied by company law which deem certain acts by certain natural persons to be the acts of the company (at 506D). (b) The second set comprises the general rules of attribution by which a natural person may have the acts of another attributed to him,ie, the principles of agency; and by which a natural person may be held liable for the acts of another, such as estoppel, ostensible authority and vicarious liability (at 506F). (c) The third set comprises special rules of attribution which the court must fashion in exceptional cases where applying the first or second set of principles would defeat the policy underlying a particular provision of the substantive law as it was intended to apply to a company (at 507D–F). Lord Hoffman’s analysis was endorsed inHo Kang Peng(at [47]–[48]). 141  The Crest entities submit that the plaintiffs have proceeded on the basis that each of the Crest entities could (and should) be affixed with any dishonesty and/or any injurious intent on the part of Mr Tan.195Foot Note 195×1DCS at [165]-[168].However, on the facts, Mr Tan was only an employee of Crest Capital, and a director (who sits on the investment committee) of EFIII only.196Foot Note 196×1DCS at [169].As the plaintiffs do not specifically identify the basis of such attribution in the pleadings, this renders the plaintiffs’ case defective.197Foot Note 197×1DCS at [163].Further, the plaintiffs cannot proceed on the basis of agency as it was not pleaded. The plaintiffs have also not established that Mr Tan acted within the scope of authority given by the Crest entities in carrying out the unlawful means conspiracy.198Foot Note 198×1DRS at [82]. 142 Having considered the Crest entities’ submission, I agree with the plaintiffs that it is unmeritorious. At all times, the Crest entities understood the case against them to be based on Mr Tan’s acts in the transaction, as the authorised representative of each of the Crest entities. Indeed, the Crest entities rely on the acts of Mr Tan; they do not dispute that he had acted with authority. 143 To elaborate, at paras 2.2.4, 2.25 and 2.2.17(e) of SOC4, the plaintiffs plead Mr Tan’s role and involvement in the Standby Facility, as “admitted to” by Mr Tan, the Investment Director of Crest Capital, in his affidavit filed in these proceedings on 10 May 2016 on behalf of the Crest entities. These material facts concerning Mr Tan thus form the basis of the plaintiffs’ allegations of dishonesty and/or injurious intent on the part of the Crest entities. 144 In D6CC3, at para 5, the Crest entities plead that the Standby Facility investors (ie,EFIII, VMF3 and VMIII) were “managed in all aspects” by Crest Capital and Crest Catalyst. At paras 15A, 15B and 16 of D6CC3, the Crest entities do not dispute the events involving Mr Tan. None of the Crest entities disassociated themselves from Mr Tan’s acts. 145 Therefore, I do not think that the plaintiffs’ pleading is deficient. The material facts have been sufficiently pleaded. In fact, I agree with the plaintiffs that it was “curious” that the Crest entities raises this argument in the closing submissions.199Foot Note 199×PRS at [5]-[10].This point is inconsistent with the Crest entities’ pleaded case, as well as the position taken by the Crest entities in the proceedings. Specifically, the Crest entities rely on the acts of Mr Tan throughout the negotiations, during entry into the Standby Facility, and in respect of the subsequent drawdowns on the Standby Facility. 146 From all the facts and circumstances described above, Mr Tan’s actual authority as agent is also plain to see. I only wish to add that in the term sheet sent by Mr Tan to Mr Fan and Mr Aathar via email on 9 April 2015, it was stated expressly as follows:200Foot Note 200×1ACB at p 550. … [that it] summarizes the principal terms with respect to a potential funding into International Healthway Corporation Limited or its subsidiaries (“IHC”) by Crest Capital Asia Pte Ltdand/or its designated funds(“Lender”). [emphasis added] 147 The Crest entities cannot adopt the position that Mr Tan’s acts were authorised on the one hand, and yet on the other hand, disavow his state of mind. For completeness, I should add that there is no dispute by the Crest entities that the agreements,ie,the initial facility agreement and the Standby Facility agreement, were properly executed by the investing funds. 148 To round off, the claim for dishonest assistance lies in equity, and that of unlawful means conspiracy lies in tort. For these claims, I do not know of any reason (nor was any offered by the Crest entities) to exclude attribution on the general principles of agency. As observed by Lords Walker and Hodge JJSC inBilta (UK) Ltd v Nazir (No 2)[2015] 2 WLR 1168 at [205], “where a third party makes a claim against the company, the rules of agency will normally suffice to attribute to the company not only the act of the director or employee but also his or her state of mind, where relevant.” Mr Tan was the agent of each of the Crest entities in relation to the Standby Facility. Hence, his knowledge, state of mind and intention could (and should) be attributable to the Crest entities.",
        "Dishonest assistance": "149 I now turn to the substantive claim for dishonest assistance against the Crest entities, Mr Aathar and Ms Lim in respect of Mr Fan’s breach of duties.",
        "The elements of the cause of action": "171 I move on to the claim in unlawful means conspiracy. InEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd[2014] 1 SLR 860 (“EFT Holdings”), the Court of Appeal set out the elements of the tort of unlawful means conspiracy as follows at [112]: (a) there was a combination of two or more persons to do certain acts; (b) the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts; (c) the acts were unlawful; (d) the acts must be performed in furtherance of the agreement; and (e) the plaintiff suffered loss as a result of the conspiracy. 172 Unlawful acts have been found to encompass criminal acts, intentional tortious acts, breaches of contract and breaches of fiduciary duties. IHC alleges that the unlawful means forming the basis for its claim are:217Foot Note 217×PCS at [276]. (a) the entry into and drawdowns on the Standby Facility, which contravened s 76(1A) of the Companies Act;and (b) the breaches of Mr Fan’s fiduciary duties owed to IHC. 173 In response, the Crest entities and Ms Lim do not seriously dispute that if established, these would constitute unlawful acts. Their contentions relate to the remaining four elements, and I shall go through those shortly. Over and above the elements set out above, the Crest entities submit that actual knowledge of the unlawful nature of the act is a requirement of the claim.218Foot Note 218×1DCS at [182].In relation to the factual dispute as to whether Mr Tan (and thus the Crest entities) knew of the legal prohibition against a company buying its own shares, I had already made certain findings: see [161] above. I proceed now to deal with the Crest entities’ contention that ignorance of the legal prohibition would absolve the Crest entities of liability.",
        "Whether the Crest entities, Mr Aathar and Ms Lim rendered assistance": "154 IHC’s case against the Crest entities, Mr Aathar and Ms Lim is based on the following acts of assistance:201Foot Note 201×SOC at [2.2.10] to [2.2.11]. (a) The Crest entities extending the Standby Facility to IHC, and carrying out drawdowns on the Standby Facility to purchase IHC’s shares. (b) Mr Aathar negotiating with the Crest entities on the Standby Facility with Mr Fan’s knowledge, and extending his personal guarantee to the Crest entities to facilitate IHC’s entry into the Standby Facility. (c) Ms Lim preparing and finalising the legal documents for the Standby Facility, as well as the board paper which was vetted by Mr Fan, to recommend the approval of the Standby Facility to IHC’s board. 155 The Crest entities and Ms Lim do not deny the acts concerned. Their main contention is that they did not act dishonestly. Turning to Mr Aathar, at [118] above, I found that along with Mr Fan, he negotiated the terms of the Standby Facility. It is undisputed that Mr Aathar signed the personal guarantee thereafter, and executed the Standby Facility agreement as the personal guarantor. Therefore, I accept that all the alleged acts were carried out. 156  I am mindful that Mr Fan was not a shadow director of IHC, and did not owe IHC any fiduciary duties before 17 May 2015: see [116] above. Some of the acts of the Crest entities and Mr Aathar,eg,in negotiating the deal, and in respect of six out of 14 drawdowns and acquisitions of IHC shares, took place before 17 May 2015. Nonetheless, their conduct put in place the particular state of affairs that allowed Mr Fan to act in breach of his fiduciary duties from 17 May 2015, in order for IHC to formally enter into the Standby Facility. Thus, I am of the view that all the acts (including those before 17 May 2015) had a causative effect on Mr Fan’s breach of fiduciary duties, and therefore assisted the same. With that, I turn to consider if any of the parties acted dishonestly.",
        "Whether the Crest entities acted dishonestly": "157 The Crest entities argue that while they were aware that the Standby Facility would involve IHC incurring liabilities to purchase its own shares, the Crest entities were ignorant of the fact that it was illegal to do so.202Foot Note 202×1DCS at [217].They did not know about any irregular shortcomings in the arrangements. Their case rests on the following grounds: (a) Mr Tan had not been aware of the prohibition against public companies purchasing their own shares,203Foot Note 203×1DCS at [218].and had claimed that the Crest entities would not have participated in the scheme if he had known;204Foot Note 204×1DCS at [219].and (b) the Crest entities did not know that IHC was unable to lawfully enter into the Standby Facility, and to draw down on the Standby Facility to purchase its own shares,205Foot Note 205×1DCS at [217].given the contractual warranties given by IHC (in cll 3.2(e), 3.2(f) and 3.2(g) of the Standby Facility agreement)206Foot Note 206×1ACB at p 40.which were to the effect that the Standby Facility was lawful, that IHC had taken the necessary steps to ensure that the Standby Facility was valid, and that the performance of the obligations would not be in breach of any law.207Foot Note 207×1DCS at [316]. 158 I deal with the second point first. InThe Enterprise Fund III([5]supra) at [131], the Court of Appeal noted that considerable caution must be taken before generic representations and warranties of the sort in the Standby Facility agreement can be relied on to establish an estoppel that would allow the Crest entities to simply sidestep the stringent statutory requirements in ss 76B to 76G of the Companies Act for effecting a “whitewash” of a company’s acquisitions of its own shares. Such representations and warranties are commonplace in commercial contracts, and to allow reliance on such terms would dilute the significance of the statutory prohibitions in s 76(1A)(a)(i) of the Companies Act.Vis-à-visthe Crest entities, the Court of Appeal held that IHC was not estopped from voiding the Standby Facility: see [125]–[126]. 159 I note that in D6CC3, the Crest entities plead that IHC was estopped from asserting that it had not obtained the necessary consents and approvals to purchase its own shares.208Foot Note 208×D6CC3 at [15D]-[15E].Given the ruling inThe Enterprise Fund III([5]supra),the Crest entities no longer rely on this point. However, they continue to rely on the representations and warranties to deny the Crest entities’ knowledge of any contravention of the Companies Act. For the same reasons stated by the Court of Appeal, I do not find the Crest entities’ explanation persuasive. 160 On the first point, I am not convinced that Mr Tan did not know of the prohibition under s 76 of the Companies Act for the following reasons: (a) First, Crest Capital and Crest Catalyst are professional fund administrators and managers. Mr Tan is the Investment Director of Crest Capital, and is the licence holder under the regime by the Monetary Authority of Singapore.209Foot Note 209×NE, 13 August 2019 p 111 lines 15-17.It seems to me far-fetched for Mr Tan to claim that he would not know of the legal prohibition. (b) Second, when the Crest entities prepared the legal documents for the Standby Facility which were sent by Mr Tan to IHC, the security in the form of the IHC shares held by the Crest entities was completely omitted despite it being a term stated in the term sheet. This was a glaring omission which pointed to an awareness of something amiss regarding the share purchases. (c) Third, from April 2015 to 5 February 2016, the Crest entities did not send any confirmation of the principal drawn down from the Standby Facility to IHC, despite their requests for the standby fees. During that period, there were at least five statements of accounts and over 20 debit notes issued, but it was not until 5 February 2016 that the statements/debit notes reflected that the principal was drawn down under the Standby Facility.210Foot Note 210×PCS at [80].Mr Tan was unable to give an explanation for this. (d) In all, there were only two emails which suggested that the Crest entities had purchased IHC shares on IHC’s behalf using the funds from the Standby Facility: (i) The first email was a summary table sent by Mr Tan to Mr Fan and Mr Aathar by way of an email of 8 May 2015, containing details of the purchase of IHC shares.211Foot Note 211×PCS at [119]; 4AB at p 2074.However, this was a personal update to Mr Fan and Mr Aathar, and Mr Tan did not provide any official update to IHC. (ii) The second email was the 12 May 2015 email from Mr CP Lim to Ms Lim, containing the SGX statement showing one purchase of IHC shares. Even then, it was recalled barely ten minutes later with Mr CP Lim asking Ms Lim to ignore it. Once again, the failure by Mr Tan (and anyone else from the Crest entities) to update IHC on the purchase of the shares is telling. Apart from Mr Fan and Mr Aathar, Mr Tan could not identify anyone else in IHC who might have known about the purchase of 59,304,800 IHC shares on IHC’s behalf.212Foot Note 212×NE, 14 August 2015, p129, line 7 to p 130 line 25. (e) For the drawdowns, Mr Tan did not follow the mandatory procedure that was laid down in the Standby Facility agreement (which the Crest entities drafted and which he communicated to IHC) for drawdowns to be made. In accordance with cl 7 of the Standby Facility agreement, the requirements for a disbursement were as follows:213Foot Note 213×3ACB at p 1282. 7. DISBURSEMENT 7.1 Subject to theDisbursement Request being in orderand to the terms of the Disclosure Letter, if any, and the results of the Investors’ due diligence on the Group, the Properties and/or the Geelong Property being acceptable to the Investors,the Investors will procure the Disbursement of the Facility, by way of bank transfer, directly to the Company Account, as soon as practicable and in any event not later than 3 Business Days following receipt of the Disbursement Request.” [emphasis added] A “Disbursement Request”, defined in cl 6.1(j) as a written request for disbursement furnished by IHC to the Standby Facility investors (ie,EFIII, VMF3 and VMIII) is, therefore, a prerequisite for effecting any drawdown. Furthermore, if the drawdowns were made properly in accordance with the Standby Facility agreement, the funds would have to be disbursed, by way of bank transfers to IHC’s bank account. The funds thus obtained couldnotbe used directly by the Crest entities to purchaseanyshares at all. Despite this, Mr Tan allowed Mr Aathar to instruct him to draw down on the Standby Facility to purchase IHC shares.214Foot Note 214×7AB at pp 3478 to 3488.This flagrantly contravened the procedure set out in the Standby Facility agreement, and Mr Tan was unable to provide a satisfactory explanation why he permitted this course of action. (f) Even after the dispute arose in February 2016, the Crest entities did not provide IHC with information about the drawdowns. As stated at [43], IHC’s finance team had asked the Crest entities’ finance team for supporting documents for the drawdowns, contending that there had not been any drawdown. Instead of providing the details, the Crest entities responded by asking IHC to check with Mr Fan or Mr Aathar. 161 Contrary to the position argued by the Crest entities, I do not consider actual knowledge of the statutory prohibition a requirement for proving dishonesty. However, as the point arises again in the context of the unlawful means conspiracy, I will address the factual dispute. Based on the various strands of evidence set out above, on a balance of probabilities, I find that at the very lowest, Mr Tan ought to have known of the prohibition under the Companies Act. There is no other conceivable reason for him to disregard the procedural safeguards in the Standby Facility agreement on disbursements, and for the conduct displayed by the Crest entities above. In fact, I am prepared to conclude that he had actual knowledge of this fact. 162 That said, to reiterate, the test of dishonesty is an objective one – that a defendant knew at the material time the assistance is given of the “irregular shortcomings of the transaction that ordinary honest people would consider it to be a breach of the standards of honest conduct if he failed to adequately query them”. Even leaving aside the question of the knowledge of the statutory provision, Mr Tan (and thus the Crest entities) well knew about the serious irregularities in the various drawdowns from the Standby Facility (especially prior to its formalisation). They did not query these irregularities but allowed the arrangement to continue and even formalised the Standby Facility with IHC. Their participation involved a breach of the standards of honest conduct. 163 For completeness, I note that the plaintiffs plead that the Crest entities knew or ought to have known of Mr Fan’s breaches of fiduciary duties.215Foot Note 215×SOC4 at [2.2.10].The Crest entities deny this. While the parties’ closing and reply submissions do not address this issue substantively, I think it is necessary to discuss this, as it has some relevance in the claim for unlawful means conspiracy. 164 Turning to the law, it is not necessary for the Crest entities to know specifically that Mr Fan owed and breached fiduciary duties. InBarlow Clowes([153]supra), Lord Hoffmann observed that it was not necessary for it to be proved that the defendant had actual knowledge that monies disposed (in breach of trust) were actually held in trust, saying at [28]: First, it was not necessary … that Mr Henwood should have concluded that the disposals were of moneys held in trust. It was sufficient that he should have entertained a clear suspicion that this was the case. Secondly, it is quite unreal to suppose that Mr Henwood needed to know all the details to which the court referred before he had grounds to suspect that Mr Clowes and Mr Cramer were misappropriating their investors’ money. … InBrinks Ltd v Abu-Saleh[1996] CLC 133, 151 Rimer J expressed the opinion that a person cannot be liable for dishonest assistance in a breach of trust unless he knows of the existence of the trust or at least the facts giving rise to the trust.But their Lordships do not agree. Someone can know, and can certainly suspect, that he is assisting in a misappropriation of money without knowing that the money is held on trust or what a trust means… [emphasis added]  165 On the evidence, it seems clear to me that Mr Tan ought to have known (or certainly suspected) that IHC’s entry into and drawing down on the Standby Facility to purchase its own shares were against IHC’s interests in some way, and that he was assisting Mr Fan in breaching the duties that Mr Fan owed to IHC. Again, I rely on the matters at [160]. I would also add a few more facts to the mix. First, Mr Tan knew that Mr Fan and Mr Aathar were substantial shareholders of IHC, and had their own interests to protect as shareholders which were separate and distinct from IHC’s interests. Second, there was a fairly long delay in the formal execution of the Standby Facility, from the time the draft documents were sent to IHC on 9 April 2015 to 21 July 2015 when the duly executed documents were returned by Mr CP Lim to IHC. I compare this with the Geelong Facility which was fully executed by 17 June 2015, but for which negotiations started later in time. Third, it took the changeover from Mr Chia as CEO to Mr Fan as Group CEO and then CEO before the process was completed. Despite all these circumstances, Mr Tan allowed the drawdowns and acquisitions of shares on the instructions of Mr Aathar, in non-compliance with the proper procedure provided in the Standby Facility agreement (and only furnished updates to Mr Aathar and Mr Fan).",
        "Whether Mr Aathar acted dishonestly": "166 As I found above at [93] and [95], Mr Aathar knew that the purpose of the Standby Facility was for IHC to incur liabilities to purchase its own shares, but still gave the instructions to the Crest entities to acquire the shares. At the trial, he admitted that he knew of the prohibition against a company buying its own shares without a proper share buyback mandate.216Foot Note 216×NE, 13 August 2019, p 20 lines 15-20.With such knowledge while negotiating the deal, Mr Aathar facilitated IHC’s entry into the Standby Facility by giving a personal guarantee. He also executed the Standby Facility agreement (as a personal guarantor). I have no doubt he knew that Mr Fan (who had taken over as Group CEO and then CEO) dealt with the process in breach of his duties. Mr Aathar had clearly breached the ordinary standards of honest conduct.",
        "Whether Ms Lim acted dishonestly": "167 Ms Lim was not involved in negotiating the Standby Facility, or drawing down on it. As I found at [135]–[136] above, her conduct was negligent. However, she was not necessarily also dishonest. For her to be dishonest, she must be shown to have suspected that something was wrong but chose not to want to know the truth:MKC Associates([153]supra) at [272]. 168 On the facts, Ms Lim’s purported knowledge of any impropriety in the Standby Facility could only come from her knowing that the purpose of the Standby Facility was to purchase IHC shares, and that funds had been used to do so. 169 While I accept that Ms Lim acquired some knowledge that the Standby Facility had been drawn down for unknown purposes, this could well have included drawdowns for working capital. Relying on what I have previously found at [131]–[135] above, Ms Lim owed it to IHC to investigate further but did not. However, there is insufficient evidence for me to conclude on a balance of probabilities that Ms Lim knew that the Standby Facility had been drawn down for the acquisition of IHC’s own shares. There is no doubt Ms Lim was negligent. I do not, however, consider her negligence to rise to the level of dishonesty. She is not liable for dishonest assistance.",
        "Unlawful means conspiracy": "",
        "Whether knowledge of the illegal nature of the acts is required": "174 The starting point isMulti-Pak Singapore Pte Ltd (in receivership) v Intraco Ltd and others[1994] 1 SLR(R) 513 (“Multi-Pak”), which endorsed the legal position inBelmont Finance Corporation Ltd v Williams Furniture Ltd and others[1979] 1 Ch 250 (“Belmont Finance”), and held that ignorance of the illegality of the act is not a defence to an unlawful conspiracy claim. 175 Knowledge of the alleged conspirators features, however, in relation to two elements of the tort. First, as stated inEFT Holdings([171]supra),proof of a mere intention to injure suffices to succeed in a claim founded on unlawful means conspiracy, whereas for a lawful means conspiracy, a predominant intention to injure must be proved. If the defendants are tointendthe damaging consequences of their actions, they must necessarily also actuallyknowthat such an act carries the damaging consequences alleged: at [73], [99]–[101]. 176 Second, the element of combination requires proof of two or more persons and an agreement between or among them to do certain acts:NagaseSingapore Pte Ltd v Ching Kai Huat[2008] 1 SLR(R) 80 at [23]. Agreement is often inferred from the circumstances and acts of the alleged conspirators, provided that the alleged conspirators must have been “sufficiently aware of the surrounding circumstances and share the object for it properly to be said that they were acting in concert at the time of the acts complained of”:EFT Holdingsat [113]. To reframe this, an agreement may be inferred from the parties’ knowledge of the facts on which the conspiracy is founded, even if they did not appreciate the legal effect of those facts: see Gary Chan Kok Yew,The Law of Torts in Singapore(Academy Publishing, 2011) at [15.054]. 177 The Crest entities are essentially arguing for proof of a further mental state –ie,that of actual knowledge by the alleged conspirators of the unlawful nature of the means deployed – before a claimant can succeed in an unlawful means conspiracy claim. Thus, they contend that the Crest entities must be proven to have actual knowledge of the illegality of the Standby Facility. While the Crest entities do not submit specifically on this, it seems to follow that their position is that it must also be proven that they knew of Mr Fan’s breaches of his fiduciary duties. While the Crest entities acknowledged the position established inMulti-Pak, they relied on a trio of subsequent cases, namely,Douglas v Hello! Ltd[2006] QB 125 (“Hello!”),Beckkett Pte Ltd v Deutsche Bank AG[2008] 2 SLR(R) 189 (“Beckkett”) andMeretz Investments NV and another v ACP Ltd and others[2008] 2 WLR 904 (“Meretz”)219Foot Note 219×1DCS at [183]-[186].to support their proposition that the position has changed. In response, the plaintiffs submitted that as a matter of law, this is wrong.220Foot Note 220×Plaintiffs’ Reply Submissions (“PRS”) at [26]. 178 I return toBelmont Finance, an instructive case where the unlawful means consisted of a breach of a UK statutory prohibition against a company providing financial aid to third parties to purchase its shares. Buckley LJ said, at 269-270: … Dishonesty was not a necessary ingredient of the claim of conspiracy; all that would be necessary to support that claim would beactual, or possibly imputed, knowledge of the facts which rendered the transaction an illegal one. ‘Crime’ and ‘fraud’ are not synonymous; a criminal act may well be committed without any fraud or dishonesty. [emphasis added] 179 Concurring with this view, Goff LJ citing the speech of Viscount Dilhorne inR v Churchill[1967] 2 AC 224 at 237, said that (at 271): … In answer to the question posed by the Court of Criminal Appeal in this case, I would say that mens rea is only an essential ingredient in conspiracy in so far as there must be an intention to be a party to an agreement to do an unlawful act;that knowledge of the law on the part of the accused is immaterial and that knowledge of the facts is only material in so far as such knowledge throws a light on what was agreed. … The question is, ‘What did they agree to do?If what they agreed to do was, on the facts known to them, an unlawful act, they are guilty of conspiracy and cannot excuse themselves by saying that, owing to their ignorance of the law, they did not realise that such an act was a crime… [emphasis added] 180Multi-Pakwas a case where unlawful means conspiracy was alleged against the defendant and the directors of the company for breach of directors’ duties under s 157 of the CA. Chao Hick Tin J (as he then was) held at [50]–[51] that: 50 In the present case, in order to succeed in conspiracy, it must be shown that there was a conspiracy to do an unlawful act which caused damage to the plaintiffs. On the facts as discussed before, I am of the view that a case has been made out. Intraco and the two directors were working very closely to effect the assignment. Intraco knew the full facts.If, as I hold it is, that the directors had acted in breach of their fiduciary duties when they agreed with Intraco to take an assignment of the receivables, it seems to me to follow that Intraco and the directors had acted in concert to do an unlawful act: to cause a breach of s 157(1) of the Act, which is an offence under s 157(3). … 51The fact that Intraco might not have known that the directors of Multi-Pak would be acting in breach of s 157(1) isbeside the point so long as Intraco was aware of all the relevant facts. … [emphasis added] 181 I go toHello!([177]supra).As the Crest entities submit, its reasoning was adopted byEFT Holdings([171]supra), in that the Court of Appeal accepted that actual knowledge as to the consequences is required to establish the tort of unlawful means.221Foot Note 221×1st to 5th Defendants’ Reply Submissions (“DRS”) at [99].I have set this out at [175] above. I agree with the plaintiffs thatHello!analyses the various states of mind that could amount to an intention to injure, and decided that knowledge of the consequences is required. However,Hello!does not stand for the proposition that knowledge of the illegality of the act is required, or that ignorance of the illegality is a defence. 182 Turning toBeckkett([177]supra), the case concerned both lawful and unlawful means conspiracy in a forced sale of shares. In relation to the intention to injure, at [121]–[122],  Kan Ting Chiu J (as he then was) held as follows: If Deutsche Bank and DSM did not knowingly fix the price at an undervalue, there can be no agreement to cause Beckkett injury by transacting at an undervalue. Taking the argument a step further, even if DSM had known that US$46m was an undervalue, that is not evidence of a predominant intention on its part to injure Beckkett because its primary interest was to purchase the shares at the lowest price, and not to injure Beckkett, and it cannot be said that the predominant intention of the combination was to cause injury. Beckkett also relied on the agreement to seek court approval for the sale by thepenetapansas evidence of the conspiracy to injure.Prima facie,the agreement to obtain the court approvals ex parte was to facilitate the transaction.There was no evidencethat Deutsche Bank or DSM knew at that time that penetapans were inappropriate and that putusans were required.There can be no inference that theyintendedto do somethingunlawful. It would of course be different if they had agreed to do something they knew to be wrong,eg, to under-declare the sale price. [emphasis in original in italics; emphasis added in bold italics] 183 Read in context, again, it seems to me thatBeckkettis concerned with actual knowledge that goes towards proving the combination/agreement, and/or towards proving the intention to injure. Indeed,Multi-Pakis not discussed inBeckkett, and I do not agree thatBeckkettmarked a departure from the former. 184 Along the same vein, inMeretz([177]supra),Arden LJ held, in the context of the tort of inducing breach of contract, that a person does not have therequisite intention to injureanother as a means to further his own interests if the causative act is something which that person believes he was entitled to do, because all that he intends is to produce a result which he believed he was entitled to produce: at [127]. Toulson LJ expressed the view (albeitobiter) that this could be extended to the tort of unlawful means conspiracy, such that it was a defence if the defendant not only acted to protect his own interests but did so in the belief that he had a lawful right to act as he did: at [174]. Once again, the concern is with proof of the intention to injure. 185 Accordingly, I do not agree with the Crest entities that knowledge of illegality is a distinct requirement of unlawful means conspiracy, or that ignorance of illegality is a defence. However, knowledge of the facts and surrounding circumstances is relevant, insofar as knowledge goes to prove the combination/agreement of the alleged conspirators, and/or the intention to injure.",
        "Whether there was an agreement to do certain acts": "186 I have set out the law on the element of combination at [171] above. To summarise, there must be an agreement by the alleged conspirators to pursue a particular course of action. I should add that alleged conspirators need not have participated in the alleged conspiracy at the same time, nor do they need to know what they have each agreed to do. All that is necessary is for a plaintiff to establish that the conspirators are “sufficiently aware of the surrounding circumstances and share the same object”:EFT Holdings([171]supra)at [113]. 187 I am satisfied that the Crest entities, Mr Fan and Mr Aathar formed an agreement to cause IHC to enter into and draw down on the Standby Facility to purchase IHC shares. The backdrop of their agreement was a potential short-seller’s attack on IHC shares, and a desire on the part of Mr Aathar and Mr Fan to stabilise IHC’s share price. After the three of them discussed the matter on 3 April 2015, they followed up with a series of emails the next day regarding the precise terms of the Standby Facility. The parties envisaged that IHC would be able to avail itself of funds under the Standby Facility to purchase its own shares, and this was the common object. 188 Turning to Ms Lim, she entered the picture later. As I found above, she acted negligently in her role in the preparation and finalisation of the legal documents. However, there is insufficient evidence to find that she knew the true purpose of the Standby Facility, or that there had been drawdowns for the acquisition of IHC shares. Indeed, Mr Fan did not brief her on the deal. I am unable to infer from the surrounding circumstances that she acted in combination with the Crest entities, Mr Fan and Mr Aathar.",
        "Whether acts were performed in furtherance of the agreement, and whether the acts were unlawful": "189 I also find that the Crest entities, Mr Fan and Mr Aathar furthered their common object through procuring IHC’s entry into and subsequent drawdowns on the Standby Facility. At the risk of repetition, Mr Aathar gave Mr Tan instructions to draw down on the Standby Facility, and to acquire IHC shares on IHC’s behalf. Mr Fan was instrumental in obtaining approval from the IHC board for the Standby Facility, namely by clearing and endorsing the board paper. Both Mr Fan and Mr Aathar personally guaranteed the Standby Facility, which further facilitated IHC’s entry into the Standby Facility. Without their involvement, IHC would not have entered into the Standby Facility, nor would it have used the facility to purchase its own shares. 190 The Standby Facility was illegal for contravention of the Companies Act, while Mr Fan breached his fiduciary duties by virtue of his role in the transaction. The Crest entities well knew of all the surrounding facts regarding IHC’s purchase of its own shares using the Standby Facility. Any claim of ignorance of the statutory provision is not a defence. Admittedly, Mr Tan might not have been fully aware of how Mr Fan acted in breach of his fiduciary duties to procure IHC’s formal execution of the Standby Facility. However, it is not a requirement to show that a conspirator knew exactly what each co-conspirator had agreed to do (or had then proceeded to do).",
        "Whether there was any intention to injure": "191 On the issue of the intention to injure on the part of the alleged conspirators, it is insufficient for IHC to simply show that harm to IHC would be a likely, probable or even inevitable consequence of the conduct. That the conspirators intended injury to IHC as a means to an end or an end in itself must be established. Additionally, if the conspirators are tointendthe damaging consequences of their actions, they must necessarily also actuallyknowthat such an act carries the damaging consequences alleged:EFT Holdings([171]supra) at [99]–[101]. 192 IHC argues that the requisite intention to injure IHC on the part of the Crest entities, Mr Fan, Mr Aathar and Ms Lim was made out on the following bases: (a) The conspiracy to cause or procure IHC to enter into and draw down on the Standby Facility to purchase IHC shares was clearly targeted and directed at inflicting injury to IHC. As IHC was the contractual party to the Standby Facility, it was certain to be saddled with substantial liability for the principal drawn down, interest/standby fees (which IHC submits are exorbitant) and price fluctuations for the shares. IHC also stood to lose its Australian business if the liabilities were not discharged.222Foot Note 222×Plaintiffs’ Reply Submissions (“PRS”) at [14] to [15]. (b) With regard to the Crest entities in particular, the standby fees were the means by which the Crest entities intended to achieve their end objective of profiting from the transaction.223Foot Note 223×PRS at [17]. The Crest entities 193 It seems to me that as against the Crest entities, there is a clear intention to injure. On the facts, the Crest entities well knew that IHC would incur substantial liabilities upon entry into the Standby Facility. The standby fees amounted to S$700,000 per month, and there was a guaranteed minimum of seven months of such fees. 194 The Crest entities stressed that this was purely a commercial deal. They enjoyed a long business relationship with IHC.224Foot Note 224×1DCS at [196].When Mr Fan and Mr Aathar requested for them to grant the facility to IHC,225Foot Note 225×1DRS at [147].they agreed to do because of their good business relationship with IHC and the sufficiency of security provided by IHC. The standby fees charged under the Standby Facility of 3.5% per month were comparable to other commercial deals with other IHC entities.226Foot Note 226×1DRS at [148]. 195 Further, the Crest entities argue that there was nothing to incentivise them to embark on the deal with an intention to injure IHC.227Foot Note 227×1DCS at [198].They could not have intended to injure IHC economically, as IHC’s financial health would have had a direct impact on the extent to which the Crest entities would be able to recover the principal sum extended to IHC under the Standby Facility.228Foot Note 228×1DCS at [199]-[200]. 196 I am mindful that a predominant intention to injure is not required. It could well be that in granting the facility, the Crest entities had all the other commercial considerations in mind and were also motivated by the returns from the transaction. However, unlike other commercial deals, the Standby Facility was intended for IHC to acquire its own shares (which the Crest entities knew or ought to have known to be in contravention of the Companies Act). This was sufficient, in and of itself, to show an intention to injure on the part of the Crest entities. Put in another way, the intended injury is simply the imposition of the liability – including the standby fees – on IHC for the purchase of its own shares. 197 Linked to the above is the Crest entities’ argument that the acquisition of shares was not the sole purpose of the Standby Facility, and that the Standby Facility was broadly framed as a loan for “general working capital”. However, given that Mr Tan proceeded to take instructions from Mr Aathar and to acquire IHC shares, he well knew that the Standby Facility was for theverypurpose of share acquisitions. Indeed, as highlighted by the plaintiffs, this was tantamount to arguing that the Standby Facility was a plain vanilla credit facility while the acquisition of shares was a separate agreement. Such an argument had been rejected inThe Enterprise Fund III([5]supra) at [83].229Foot Note 229×PCS at [255]. 198 In my judgment, therefore, the Crest entities possessed the requisite intention to injure IHC. IHC’s claim of unlawful means conspiracy against them is made out. Mr Fan and Mr Aathar 199 Apart from being the ones who procured the Standby Facility from the Crest entities, both Mr Fan and Mr Aathar knew and intended that IHC would incur substantial liabilities for the prohibited purpose of purchasing its own shares. The Standby Facility was the means to the end of supporting the IHC share price. As major shareholders of IHC, they had an interest in maintaining the IHC share price. Viewed in the round, Mr Fan and Mr Aathar had the requisite intention to injure IHC. Ms Lim 200 Given my finding that Ms Lim was not part of the conspiracy, it is strictly speaking unnecessary for me to deal with this. For completeness, I should state there is no basis for me to conclude that Ms Lim prepared the legal documents for the Standby Facility and the board paper intending thereby to injure IHC. There is nothing to suggest that Ms Lim expected to benefit from the transaction. She was IHC’s senior employee, and her employment security depended in part on IHC’s financial health. I do not see how Ms Lim could have had any conceivable interest in inflicting injury on IHC.",
        "Damage": "201 On the last element of this claim, it cannot be disputed that IHC suffered damage as a result of its entry into the Standby Facility. IHC had already paid standby fees on 17 June and 2 July 2015,230Foot Note 230×1ACB at pp 237 and 363.and an amount of S$3,883,950 was paid towards the principal on 18 December 2015.231Foot Note 231×3ACB at p 1779.",
        "Miscellaneous issues": "",
        "Sufficiency of pleadings": "203 Before I close the discussion on liability, I touch briefly on two matters raised by the Crest entities. 204 The first is a point on pleadings. The Crest entities submit that the plaintiffs have ventured beyond their pleadings by relying on acts of the Crest entities in concealing and/or camouflaging the nature of the Standby Facility (especially as part of the unlawful means conspiracy claim).232Foot Note 232×1DCS at [143], [146]-[154].They argue that this is an impermissible expansion of their case. 205 In response, the plaintiffs contend that the unlawful acts relied on (and pleaded) were the entry into and drawdowns on the Standby Facility (which was in contravention of the Companies Act) and Mr Fan’s breach of duties. These have been pleaded. The omissions, concealment or acts of camouflaging were merely evidential matters surrounding the unlawful acts. 206 I agree. For instance, as set out above at [160] above, the plaintiffs rely on what the Crest entities did not do,eg,the pledge of shares was not mentioned in the facility documents, the failure to provide updates of share purchases to IHC,etcetera, as evidence that the Crest entities knew of the contravention of the Standby Facility. There has not been a failure to plead the material facts.",
        "Adverse inferences to be drawn from failure to call witnesses": "207  The second point relates to the complaint that the plaintiffs failed to call Dr Jong and Mr Chia as witnesses for the trial. It is argued that this should attract a range of adverse inferences, especially the adverse inference that the IHC board knew of the purpose of the Standby Facility, and that there were drawdowns under it.233Foot Note 233×1DCS at [40]-[50]. 208 By s 116(g) of the Evidence Act (Cap 97, 1997 Rev Ed), the court may presume “that evidence which could be and is not produced would if produced be unfavourable to the person who withholds it”. The law on making adverse inferences in civil matters for a party’s failure to call material witnesses was stated by the Court of Appeal inTribune Investment Trust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407 at [50], and followed inARS v ART and another[2015] SGHC 78 at [135]: … The regime of drawing adverse inferences is derived from s 116(g) of the Evidence Act (Cap 97). Whether or not in each case an adverse inference should be drawn depends on all the evidence adduced and the circumstances of the case. There is no fixed and immutable rule of law for drawing such inference… 209 I am doubtful that Mr Chia and Dr Jong would have been able to give material evidence for this case. Mr Chia was the CEO for only a brief period from 2 March 2015 to 17 May 2015, and in fact, he indicated that he intended to leave by end of April 2015.234Foot Note 234×Lim’s AEIC at [19].His role in the Standby Facility was not substantial. 210 Similarly, from the evidence before me, it appears that Dr Jong was not substantially involved in the events of concern,ie,the negotiations leading into the entry of the Standby Facility, the drawdowns and the subsequent negotiations for repayment involving Mr Fan, Mr Aathar and Mr Tan. Furthermore, the board paper did not mention the drawdowns to purchase the IHC shares. From the responses of the directors, Mr Ong and Mr Siew, the true purpose of the Standby Facility, and the drawdowns under it, were not formally disclosed to Mr Ong and Mr Siew. Therefore, I am not sure what material evidence Dr Jong would have given on this. 211 I do not think, therefore, that the failure to call either Dr Jong and/or Mr Chia warrants the drawing of adverse inferences against the plaintiffs.",
        "Damages and/or equitable compensation for losses suffered": "212 The plaintiffs claim that the defendants are jointly and severally liable for damages and/or equitable compensation for the alleged losses. In this connection, I set out briefly the applicable principles in relation to each cause of action. 213 InSim Poh Ping v Winsta Holding Pte Ltd and another and other appeals[2020] SGCA 35 (“Winsta”), the Court of Appeal affirmed that the court has jurisdiction to make an award of equitable compensation for a breach of fiduciary duty (at [129]). More importantly, the Court of Appeal settled the controversy on the applicable test of causation, and set out the approach in relation to the breach of core fiduciary duties as follows (at [254]): (a) In a claim for a non-custodial breach of the duty of no-conflict or no-profit or the duty to act in good faith, the plaintiff-principal must establish that the fiduciary breached the duty and establish the loss sustained. (b) If the plaintiff-principal is able to meet the requirements of (a), a rebuttable presumption that the fiduciary’s breach caused the loss arises. The legal burden is on the wrongdoing fiduciary to rebut the presumption, to prove that the principal would have suffered the loss in spite of the breach. (c) Where the fiduciary is able to show that the loss would be sustained in spite of the breach, no equitable compensation can be claimed in respect of that loss. (d) Where the fiduciary is unable to show that the loss would be sustained in spite of the breach, the upper limit of equitable compensation is to be assessed by reference to the position the principal would have been in had there been no breach. 214 As I found above, Mr Fan breached his core fiduciary duties to IHC,ie,his duty to actbona fide, duty of fidelityand duty to avoid conflict. Thus, the approach set out above is applicable in considering whether Mr Fan is liable for any of the alleged losses. I note, however, that the parties’ closing and reply submissions were filed beforeWinsta.Without the benefit of the extensive analysis inWinsta,the plaintiffs briefly submitted that they may claim equitable compensation to restore them to the position they would have been inif notfor the breach, citing the line of cases ofQuality Assurance([108]supra), Then Khek Koon([99]supra) andTongbao (Singapore) Shipping Pte Ltd and anotherv Woon Swee Huat and others[2018] SGHC 165 (“Tongbao”).235Foot Note 235×PCS at [281].The Crest entities also relied on the same line of cases, submitting (perhaps more completely than the plaintiffs) that the approach within such cases is that where a fiduciary had breached his duty of honesty and fidelity, a plaintiff should still prove that the breach was in some way connected to the loss, so as to shift the burden to the fiduciary to prove that the principal would have suffered the loss regardless of the fiduciary’s breach.236Foot Note 236×1DRS at [165].In my analysis below, where necessary, I recast the parties’ arguments within the framework set out inWinsta. 215 I should add that in relation to two areas of loss, I thought it necessary to consider whether the chain of causation had been broken by intervening events. Thus, I invited parties to submit specifically on the question whether other common law limiting doctrines, especially intervening causes, apply to equitable compensation. This question was left open inWinsta(at [216]). I shall deal with this point from [276] below. 216 Unlike Mr Fan, I found that Ms Lim breached her duty of due skill, care and diligence. This is not a core fiduciary duty (seeWinstaat [253]) and, accordingly, the presumption of causation does not apply. Instead, her liability for equitable compensation is subject to the common law doctrines of foreseeability, causation and remoteness:Mothew([99]supra) andThen Khek Koonat [108]. 217 Liability for dishonest assistance is secondary in nature. Thus, a party who is a dishonest accessory to another’s breach of fiduciary duty is made jointly and severally liable for equitable compensation to the plaintiff for the losses suffered in respect of that breach. Thus, there is no need for causation to be established between the assistance rendered and the loss suffered:Tongbaoat [131]. It follows that the Crest entities and Mr Aathar, as dishonest accessories, are jointly and severally liable with Mr Fan for any losses that would not have been suffered by IHC but for Mr Fan’s breaches of fiduciary duties. Given this position, it is unsurprising that the Crest entities made substantive arguments in relation to the losses Mr Fan should be liable for (which I duly consider below). 218 In the case of unlawful means conspiracy, joint and severalprimaryliability attaches to the tortfeasors in respect of loss that would not have been sustained “but for” their commission of the tort:Turf ClubAuto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal[2018] 2 SLR 655at [387]–[388]. This applies to the Crest entities, Mr Fan and Mr Aathar. Such damages in tort are generally intended to place the plaintiff in the same position as he would have been in had the tort not been committed. 219 Adopting the approaches and tests above, I will assess the defendants’ liability for the losses claimed by the plaintiffs. The losses are set out in the AEIC of Ng Chuan Tee (“Mr Ng”), the Group Senior Finance Manager of IHC,237Foot Note 237×AEIC of Ng Chuan Tee at [32]-[66] read with NCT-9with some updates on the quantification in the closing submissions and include the following: (a) The sums paid by IHC towards the Standby Facility totalling S$4,538,800 (“Payments towards the Standby Facility”).238Foot Note 238×PCS at [291]. (b) The interest which would not have accrued on the Geelong Facility if the sums in (a) had been applied towards the Geelong Facility until its eventual repayment date on 26 February 2018239Foot Note 239×PCS at [298].amounting to S$4,531,596.97 (“Loss of use of payments made towards the Standby Facility”).240Foot Note 240×PCS at [296] to [298]; [299]. (c) On the basis that the outstanding liability under the Geelong Facility would have been fully satisfied on its maturity date of 28 February 2016 (“Losses in default of the Geelong Facility”): (i) The post-maturity interest and default interest accrued on the Geelong Facility,ie, after 28 February 2016, amounting to S$3,615,066.07. The alternative figure of S$3,799,783 is erroneous.241Foot Note 241×PCS at [334]. (ii) The costs and expenses of the Crest Receivers.242Foot Note 242×PCS at [358]. (iii) The loss which is equivalent to the value of IHC’s Australian business, the quantification of which has been bifurcated and which will be determined in separate proceedings.243Foot Note 243×PCS at [372]. (d) The losses connected with the 20 October Court Order as follows: (i) The cost of the banker’s guarantee taken out pursuant to the 20 October Court Order in the sum of A$423,912.97.244Foot Note 244×PCS at [402]. (ii) The Crest entities’ overcharging of interest, default interest and foreign exchange difference amounting to S$1,930,423.60, due to the delay in applying the surplus proceeds from the sale of the Australian properties (which were remitted to them in February 2018) towards the Geelong Facility until July 2018.245Foot Note 245×PCS at [343]; [356].",
        "Mr Fan’s liability for breach of fiduciary duties": "",
        "Payments towards the Standby Facility": "301 I have set out the applicable legal principles above at [216] onwards. In my view, it was entirely foreseeable that upon entry into the Standby Facility, IHC would make payments towards it (which it should not have been liable for). Accordingly, this type of loss was foreseeable and not remote:Fong Maun Yee v Yoong Weng Ho Robert[1997] 1 SLR(R) 751 at [57] (in the context of the tort of negligence, which is closely related to the breach of a duty of skill and care in this case). The requirement of causation is also, in my view, made out. If Ms Lim had exercised due skill, care and diligence in recognising that the Standby Facility had been drawn down even before IHC had formally entered into it, and made further inquiries, she would have been alive to the risk that the Standby Facility was drawn down in an irregular manner. Having known this, it was incumbent on her to exercise due skill, care and diligence in escalating the matter to the IHC board of directors, and if she had done so, it is unlikely that approval would have been given. Mr Siew, who cast the deciding vote, did soonlyon the basis that the Standby Facility was essential for IHC’s operations. In other words, IHC would not have entered into the Standby Facility, and would not have been held liable for any sum arising under the Standby Facility. 302 I accordingly find that Ms Lim is jointly and severally liable (together with the Crest entities, Mr Fan and Mr Aathar) for the sum of S$4,538,800.",
        "Loss of use of payments made towards the Standby Facility": "224 IHC’s claim for loss of use of the total sum of S$4,538,800 is premised on the assumption that had it not entered into the Standby Facility, the sum would have been available to pay off the liabilities under the Geelong Facility, which would have prevented interest from accruing thereon up to 26 February 2018 (the date at which the Geelong Facility was fully repaid). While IHC Medical Re was the contracting party for the Geelong Facility, the liabilities it incurred thereunder were eventually satisfied out of the security furnished by IHC (ie,the Charged Shares by way of the 17 June Deed of Charge). The Crest entities had “helped themselves” to the interest accrued out of the surplus proceeds from the sale of the Australian properties.253Foot Note 253×PCS at [298]. 225 Mr Fan’s response is the same as set out at [221] above,ie,he denies that he was responsible for those payments in the first place. For the same reasons, I dismiss his contentions. Here, it is necessary to set out the Crest entities’ detailed submissions to the effect that the loss would have been sustained in any event. While the Crest entities do not dispute the quantum of the interest claimed on this basis, they argue that:254Foot Note 254×1st to 5th Defendants’ Reply Submissions (“1DRS”) at [154]. (a) There was nothing that prevented IHC from making full repayment of the Geelong Facility, and that IHC’s failure to repay the Geelong Facility was not caused by the Standby Facility. (b) IHC has failed to lead any evidence on why it did not repay the Geelong Facility on time but for the Standby Facility. (c) IHC had never once offered to repay the undisputed portion of the Geelong Facility in order to stop the contractual and default interest from further accruing. (d) The payment of $3,883,950 was not unequivocally intended for the Geelong Facility, and the WhatsApp message from Ms Lim to Mr Fan showed that IHC had every intention of using that sum to repay the Standby Facility. This WhatsApp message is set out at [127(e)] above. 226 On point (d), I observe that the WhatsApp message referred to does not show that IHC clearly intended to use the sum to repay the Standby Facility. This message shows that Ms Lim was raising the concern that there was no record in IHC’s books of any drawdown on the Standby Facility justifying payment. This is consistent with the fact that the IHC finance team was querying the drawdowns on the Standby Facility alleged by the Crest entities at the time. I shall deal with points (a) to (c) in relation to the next area of loss. 227 For now, it suffices for me to say that the Crest entities’ arguments miss the point for this category of losses. To rebut the presumption of causation, the issue is whether in any event, the funds wouldnothave been applied towards the Geelong Facility. Having found that the S$4,538,800 represented otherwise available funds that could have been applied towards the Geelong Facility, the question is whether IHC would or would not have applied such funds to the Geelong Facility. Whether they would or would not have paid off the Geelong Facility in full, or whether they intended the S$3,883,950 for the Standby Facility, are irrelevant considerations. I do not see any reason why, if the Standby Facility had not been entered into in the first place, IHC would not have used these funds to partially satisfy the Geelong Facility. The S$3,500,000 payment it made towards the Geelong Facility on 4 December 2015 demonstrates this.255Foot Note 255×3ACB at p 1801.Clearly, the presumption of causation has not been rebutted. 228 The plaintiffs’ claim for such losses is computed as follows:256Foot Note 256×PCS at [299]. Payment DatePayment Sum (S$)DescriptionInterest Accrued (S$)17 June 2015255,850Interest at 3.35% per month from 17 June 2015 to 26 February 2018277,992.81Default interest at 3.00% per annum from 19 September 2015 to 26 February 201818,714.922 July 2015399,000Interest at 3.35% per month from 2 July 2015 to 26 February 2018426,295.88Default interest at 3.00% per annum from 19 September 2015 to 26 February 201829,187.1218 December 20153,883,950Interest at 3.35% per month from 18 December 2015 to 26 February 20183,432,568.57Default interest at 3.00% per annum from 18 December 2015 to 26 February 2018256,021.47Total4,440,779.85(see below) 229 As the Crest entities deducted the amount of accrued interest from the surplus sale proceeds of the Australian properties (which should be released to IHC), this represented a loss to IHC. Having found that such interest would not have accrued but for Mr Fan’s breach of duties, he is liable to pay the sum to the plaintiffs. I note that in Mr Ng’s AEIC, the amount claimed was a higher sum of S$4,446,212.23.257Foot Note 257×Ng’s AEIC at [40].In the closing submissions, the plaintiffs claimed for a total sum of S$4,440,779.85 (as shown above). However, there is an error in the addition by the plaintiffs. Having verified the addition of the figures within the closing submissions, the amount I award is S$4,440,780.77. 230 I note that the plaintiffs also claim that the Crest entities had unjustifiably overcharged default interest amounting to S$90,816 on the outstanding principal of S$8,735,325 from 19 September 2015,258Foot Note 258×PCS at [299].given that the Crest entities’ position was that the Geelong Facility matured on 28 February 2016.259Foot Note 259×D6CC3 at [26(c)].This claim, however, is not supported by any evidence. Mr Ng’s AEIC is silent on this claim, apart from stating the fact that the Geelong Facility matured on 18 September 2015 and was extended to 18 December 2015 and again to 28 February 2016.260Foot Note 260×Ng’s AEIC at NCT-9 at [5],It is raised only in closing submissions. Therefore, I reject this claim.",
        "Losses in default of the Geelong Facility": "304 I am also unable to agree that the default on the Geelong Facility was a foreseeable consequence of Ms Lim’s breach. The default was attributable to a combination of factors. A major factor was the confusion caused by the Crest entities’ application of the sum of S$3,883,950 towards the Standby Facility instead of the Geelong Facility. This was not foreseeable by Ms Lim.319Foot Note 319×3ACB at pp 1815 to 1818.I therefore do not find Ms Lim liable for any of the losses sustained by IHC’s default on the Geelong Facility.",
        "Losses connected to the 20 October Court Order": "305 Finally, I am also unable to find Ms Lim liable for the losses connected to the 20 October Court Order. As I observed at [300], these were the result of the conduct of IHC and the Crest entities, and cannot be said to have been foreseeable by Ms Lim. With that, I proceed to consider whether Ms Lim is entitled to an indemnity for the losses for which I have found her liable.",
        "Accessory liability for dishonest assistance": "299 From the legal principles discussed at [217] above, it follows that the Crest entities and Mr Aathar, as dishonest accessories to Mr Fan’s breach, are jointly and severally liable for the losses that would not have been suffered by the plaintiffs but for Mr Fan’s breach. For completeness, I should add that in his evidence, Mr Aathar did not challenge the amounts claimed by the plaintiffs.",
        "Liability for unlawful means conspiracy": "300 The extent of the liability of the Crest entities, Mr Fan and Mr Aathar for the tort of unlawful means conspiracy is only in issue to the extent that it covers additional losses for which they have not already been found jointly and severally liable,ie, the losses connected with the 20 October Court Order. The question is whether these losses were caused by the Crest entities, Mr Fan and Mr Aathar conspiring to cause IHC to enter into and incur substantial liabilities under the Standby Facility. In my view, the plaintiffs have not proven that the losses are caused by the unlawful means conspiracy. In any event, these losses are directly linked to the parties’ conduct in the course of the dispute over the Geelong Facility. Thus, I do not think that this is the rightful basis to claim for the losses against the Crest entities, Mr Fan and Mr Aathar.",
        "Ms Lim’s liability for breach of her duty of skill and care": "",
        "Loss of use of payments towards the Standby Facility": "303 I do not think that the interest which accrued on the Geelong Facility as a result of the application of the payments totalling S$4,538,800 towards the Standby Facility would be a foreseeable consequence of Ms Lim’s negligent failure to identify the true nature of the Standby Facility. Specifically, Ms Lim could not have foreseen that this would have led to a failure to pay the same amounts towards the Geelong Facility. Since Ms Lim’s knowledge of such consequences is not proved, I do not find her liable for this loss.",
        "Ms Lim’s counterclaim": "",
        "Article 153 of the articles of association": "306 In the main, Ms Lim’s counterclaim against IHC is for an indemnity pursuant to Art 153 of IHC’s Articles of Association, which reads:320Foot Note 320×1AB at p 446. Indemnity 153. Subject to the provisions of and so far as may be permitted by the Statutes, every Director, Auditor, Secretary or other officer of the Company shall be entitled to be indemnified by the Company against all costs, charges, losses, expenses and liabilitiesincurred by him in the execution and discharge of his duties or in relation thereto including any liability by him in defending any proceedings, civil or criminal, which relate to anything done or omitted or alleged to have been done or omitted by him as an officer or employee of the Company and in which judgment is given in his favour (or the proceedings otherwise disposed of without any finding or admission of any material breach of duty on his part)or in which he is acquitted or in connection with any application under any statute for relief from liability in respect of any such act or omission in which relief is granted to him by the court. … [emphasis added] 307 Plainly, even if Ms Lim fell within the ambit of Article 153, it cannot assist her in her claim for an indemnity in any way. In order to be indemnified for any liability attaching to her in respect of civil proceedings, judgment must have been given in Ms Lim’s favour, or the proceedings otherwise disposed of without any finding or admission of any material breach of duty on her part. This is not the case here, as I have found that Ms Lim was in breach of her duty of due skill, care and diligence. She, therefore, cannot not avail herself of the indemnity under Art 153.",
        "Implied indemnity": "308 Alternatively, Ms Lim seeks an implied indemnity under the terms of her employment contract. 309 InLoh Siok Wah v American International Assurance Co Ltd[1998] 2 SLR(R) 245 at [29]–[34], Chan Seng Onn JC (as he then was) modified the test for implication of contractual terms laid down by the Privy Council inBP Refinery (Westernport) Pty Ltd v Shire of Hastings(1978) 52 AJLR 20. Under Chan JC’s modified test, for a term to be implied, the following conditions must be fulfilled: (a) the term must be reasonable and equitable; (b) it must be necessary to give business efficacy to the contract, or it must have been so plain and obvious to the parties that “it goes without saying”; (c) it must be capable of clear expression; and (d) it must not contradict any express term of the contract. 310 Relying on the above, Ms Lim argues that the following terms should be implied into the contract: (a) that Ms Lim would obey and co-operate with IHC to carry out all lawful and reasonable directions given by IHC; and (b) that IHC would not cause Ms Lim to carry out any order, instruction or direction other than lawful or reasonable ones. 311 On the basis that such terms could be implied into Ms Lim’s employment contract, Ms Lim then argues that she had merely acted on the instructions of Mr Chia or Dr Jong in relation to the Standby Facility, hence complying with the first implied term. IHC had, in instructing her to assist in preparing the documentation for what turned out to be an illegal arrangement, breached the second implied term. Ms Lim then made a leap of logic by asserting that this somehow entitled her to an implied indemnity from IHC in respect of any and all liability she might incur as a result of her compliance with such instructions. 312 However, as I have found, Ms Lim’s liability rested on her failure to exercise due skill, care and diligence in not recognising that the Standby Facility had been drawn down irregularly and thus failing to escalate the matter to the board of directors. It was not good enough for her to claim that she had acted under instructions. In any event, I do not think that an indemnity in respect of such negligent breaches of duty can be implied into the terms of Ms Lim’s employment with IHC. It is eminently reasonable, indeed desirable, for a company to expect their officers or employees to act with due skill, care and diligence.",
        "The Crest entities’ counterclaims": "",
        "Unjust enrichment": "314 The Crest entities counterclaim against IHC for the amount drawn down by IHC under the Standby Facility, amounting to S$17,332,081.15, on the ground that IHC had been unjustly enriched. They argue that the four elements of an unjust enrichment claim, as set out inMSP4AGE Asia Pte Ltd and another v MSP Global Pte Ltd and others[2019] 3 SLR 1348 at [139], are satisfied on the facts because: (1) IHC had been enriched; (2) at the expense of the Crest entities; (3) the circumstances made the enrichment unjust; and (4) that there are no defences.321Foot Note 321×1DCS at [328]. 315 IHC briefly argues that the first three elements had not been made out.322Foot Note 322×PCS at [419]-[427].I am inclined to agree with IHC that on the unique facts of this case, IHC had not been enriched at all. The outcome ofThe Enterprise Fund III([5]supra) is that the Standby Facility investors are the legal and beneficial owners of the 59,304,800 IHC shares which they bought and held using the sum of S$17,332,081.15 drawn down from the Standby Facility. On this basis alone, I am of the view that the claim fails. However, the parties’ focus was on the defence premised on illegality and public policy, and I turn to the question whether the court should allow the unjust enrichment claim brought to recover monies paid pursuant to the illegal Standby Facility. The defence of illegality and public policy 316 InOchroid Trading Ltd and another v Chua Siok Lui[2018] 1 SLR 363 (“Ochroid”) at [132], the Court of Appeal stated categorically and emphatically that under Singapore law, “there could be no recovery whatsoever pursuant to the illegal contract” (emphasis in original). However, restitution of sums paid under the illegal contract on the grounds of unjust enrichment could be permitted provided that the ordinary requirements of unjust enrichment could be made out notwithstanding the illegality of the underlying contract, andsubject to the defence of illegality and public policy: at [139]. 317 The Court of Appeal grounded the defence of illegality and public policy on the concept ofstultification.Citing Professor Peter Birks inPeter Birks, “Recovering Value Transferred Under an Illegal Contract”(2000) 1 Theoretical Inquiries in Law 155 (“Birks”) at 160, the Court of Appeal explained that “[t]o stultify” is to “make nonsense of”. An unjust enrichment claim should not “make nonsense of the law’s condemnation of the illegal contract in question and of its refusal to enforce the illegal contract”. Therefore, a claim in unjust enrichment is precluded if to do so would undermine the fundamental policy that rendered the underlying contract void and unenforceable in the first place: at [147]–[148]. 318 In this connection, the Court of Appeal endorsed (at [158]) Professor Birks’ identification of two relevant factors which the court would take into account to determine whether allowing such recovery would stultify the policy that rendered the underlying agreement illegal. Firstly, allowing such recovery might provide a lever which future claimants in similar cases can use for the purpose of getting the other to perform the contract (the “lever argument”). Secondly, this might also stretch out a safety-net below all those minded either to engage in similar illegality or to abstain from diligently inquiring whether their proposed course of conduct would run afoul of the statutory provision or rule of law rendering the transaction illegal (the “safety-net argument”): seeBirksat 162. Application to the facts 319 As highlighted by the plaintiffs, inThe Enterprise Fund III([5]supra) at [53],the Court of Appeal explained that the rationale for the statutory prohibition within s 76 of the Companies Act comprises two core strands: first, the historical origins in maintaining a company’s share capital, and second, the wider concern of protecting the assets of the company. To allow the Crest entities to recover even the principal sum of S$17,332,081.15 would reduce IHC’s capital and assets, to the prejudice of the innocent shareholders and creditors. The plaintiffs argue that such a claim stultifies the fundamental policy of the statutory prohibition.323Foot Note 323×PCS at [434]-[435]. 320 The Crest entities accept that the underlying policy of the statutory prohibition is to prevent the depletion of the company’s financial resources, including its future resources, in acquiring its own shares:Lew Syn Pau([119]supra)at [126].324Foot Note 324×1DCS at [386].However, s 76A(4) of the Companies Act expressly permits a claimant to seek just and equitable relief against the company in the event that the contract was declared void under s 76A(1) for breaching the s 76 prohibition. This, argue the Crest entities, suggested that allowing a claim for restitution in respect of sums paid out to a company to purchase its own shares does not stultify the policy underlying s 76 because Parliament clearly intended that restitution be available against the company.325Foot Note 325×1DRS at [172].Also, the lever argument and the safety net arguments should be ruled in favour of the Crest entities. 321 As I observed at [223], s 76A(4) of the Companies Act merely allows the court to grant just and equitable relief against a company. While it does not expressly preclude a claim against a company in respect of the sums paid out to the company to purchase its own shares, in the exercise of its discretion whether and what relief to grant, the underlying policy of the prohibition would certainly be considered by the court. What is clear to me is that statutory relief does not mean that stultification is rendered otiose (as suggested by the Crest entities). I turn to consider whether if allowed, the Crest entities’ claim for restitution would provide a lever for parties to enforce a contract which is illegal by virtue of s 76 of the Companies Act, or would provide a safety-net for parties neglecting to do their due diligence in determining whether the transaction is one that would run afoul of s 76 of the Companies Act. 322 The Crest entities’ case is that these two considerations did not arise. Firstly, they argue that allowing their unjust enrichment claim would not create a lever for future parties to a transaction illegal by s 76 of the Companies Act to enforce that illegal agreement, because it was not pleaded in such a manner as to recover the fullest extent of what they were entitled to under the Standby Facility, had it not been void.326Foot Note 326×1DRS at [174]. 323 I am not sure I follow this argument. The Crest entities’ claim is for the full principal sum of S$17,332,081.15. It seems to me clear that allowing the unjust enrichment claim would create a lever for future parties (to a transaction illegal by virtue of s 76 of the Companies Act) to enforce that illegal agreement. This is the precise effect of allowing such a claim. It seems to me that a claimant seeking statutory relief within s 76A(4) of the Companies Act would also have to strive to overcome the same obstacleie,that relief may actually undermine the underlying policy of the statutory prohibition. 324 Secondly, the Crest entities argue that their claim would not create a “safety-net” for other financiers in similar situations because IHC had provided representations and warranties as to the legality of the transaction, on the faith of which the Crest entities had entered into the Standby Facility. Also, allowing recovery in this specific case would not set a precedent which removed the disincentives against future financiers entering into such agreements by simply relying on general representations and warranties without conducting further due diligence, as the Court of Appeal’s finding inThe Enterprise Fund III([5]supra)would govern future conduct.327Foot Note 327×1DRS at [175]. 325 The Crest entities’ position on the safety-net argument is, in my view, unsatisfactory. The argument is essentially premised on the assumption that the sole source of the Crest entities’ responsibility for the breach of s 76 of the Companies Act was its failure to do due diligence. Even if I were to accept the argument, the illegal transaction did not only consist of the parties’ entry into the Standby Facility. It also included the drawdowns on the Standby Facility to acquire IHC shares and the holding of the IHC shares by Crest as security for repayment:The Enterprise Fund III([5]supra)at [134]. The Crest entities had effected the drawdowns on Mr Aathar’s instructions to purchase IHC shares directly. This completely bypassed the contractual safeguards in the Standby Facility agreement that would have prevented unauthorized drawdowns. As such, I take the view that allowing the unjust enrichment claim would indeed stretch out a safety-net to absolve the Crest entities and other similar claimants in its position from the consequences of its risky conduct. It is eminently desirable that parties do the requisite due diligence in both entering into as well as executing any arrangement involving a company’s direct or indirect acquisition of its own shares. 326 Accordingly, I do not allow the Crest entities’ counterclaim in unjust enrichment.",
        "Rectification of the default interest clause in the Geelong Facility": "327 The Crest entities also sought to rectify cl 9.3, the default interest clause in the Geelong Facility, on the ground that it was erroneously expressed as 3%per annumabove the contractual interest rate instead of 3%per monthabove the contractual interest rate.328Foot Note 328×1DCS at [389]. 328 Rectification is an equitable remedy. InKok Lee Kuen and another v Choon Fook Realty Pte Ltdand others and another application[1996] 1 SLR(R) 688 at [38]–[39], Lai Siu Chiu J (as she then was) held that to rectify the terms of a contract based on a common mistake, it is necessary to show that the parties were in complete agreement on the terms in question, but by an error wrote them down wrongly. This is ascertained on an objective basis, by looking at “their outward acts, that is, at what they said or wrote to one another in coming to their agreement, and then comparing it with the document which they have signed.” Where a party relies on a unilateral mistake, he must show that he believed that the agreement contained all the correct terms, and that the other party being aware of the mistake, did nothing to draw it to his attention. 329 I do not think that the Crest entities have proven either a common mistake and/or a unilateral mistake which the plaintiffs did nothing to correct. There was nothing produced before me, by way of correspondence, documents or evidence of any discussion, to show that the parties specifically agreed for default interest to be charged on a per month basis. The Crest entities seek to rely on the surrounding circumstances,ie,that the previous facilities provided for default interest on a per month basis, that the default interest on a per annum basis is but a negligible increase over the contractual interest rate which does not reflect the potential losses of the Crest entities, and that IHC never raised any dispute as to the default interest payable indicated in the statements of account sent to them after they had defaulted on the Geelong Facility agreement (which was calculated on a per month basis).329Foot Note 329×1DCS at [393].However, these matters far fall short of proving an agreement of the parties in relation to the default interest for the Geelong Facility. There is also no evidence that IHC Medical Re knew that it was the intention of the Crest entities to charge default interest on a per month basis, or that it knew that there was a mistake in the document but did not point it out. Again, the surrounding circumstances simply do not support this. 330 Accordingly, I dismiss the claim for rectification.",
        "Costs on an indemnity basis": "331 On the claim for an indemnity under cl 10.1 of the Geelong Facility, the Crest entities seem to have abandoned its claim for other losses and expenses under the Standby Facility and/or the Geelong Facility as originally pleaded.330Foot Note 330×1DCS at [403].There was no substantive submission at all on such matters. 332 Instead, the Crest entities ask the court to exercise its discretion to award costs on an indemnity basis. Presumably, this is the costs of the action. I begin with cl 10.1 of the Geelong Facility, which states:331Foot Note 331×1ACB at p 171. The Warrantors [including IHC, IHC Medical Re, Mr Fan and Mr Aathar] undertake to each [of the Crest entities] for itself and for [the Crest entities’] officers, employees and agents (each, together with [the Crest Entities], an ‘Indemnified Person’) to fully indemnify and keep fully indemnified on demand each Indemnified Person from and against any and all liabilities, losses, Claims, costs, charges and expenses of any nature whatsoever (including without limitation legal expenses on a full indemnity basis) which any Indemnified Person may incur or sustain or be subject to in consequence of any misrepresentation or alleged misrepresentation or any of the Warranties contained herein not being correct in any material respect at the time that they were made or repeated or for any breach of any term and condition herein. Such indemnity shall extend to include all charges and expenses which any of the Indemnified Persons may pay or incur in investigating, disputing or defending any Claim in respect of which the Warrantors are or may be liable to indemnify under this Clause 100 [sic] … 333 As a general rule, costs are in the discretion of the court and should follow the event unless it appears to the court that in the circumstances of the case some other order should be made:Tullio Planeta v Maoro Andrea G[1994] 2 SLR(R) 501at [24]. The court will, however, tend to depart from this rule and exercise its statutory discretion to award costs in such a manner as to uphold the contractual bargain entered into by the parties (eg, a contractual indemnity for costs) unless it would be manifestly unjust to do so:Telemedia Pacific Group Ltd v Credit Agricole (Suisse) SA (Yeh Mao-Yuan, third party)[2015] 4 SLR 1019 at [29];Abani Trading Pte Ltd v BNP Paribas and another appeal[2014] 3 SLR 909 at [93]. 334 As I have not heard the parties on costs, I will deal with this together with all costs matters after the delivery of this judgment."
    }
}