{
    "case_title": "On Line Mobile Pte Ltd (in compulsory liquidation)vTan Mei Lian and another matter",
    "ncitation": "[2020] SGHCR 5",
    "coram": "Bryan Fang AR",
    "sections": {
        "The facts and the parties’ positions": "3 Bankruptcy Nos 1995 and 1997 of 2019 are applications filed by On Line Mobile Pte Ltd (“OLM”), a company in liquidation, for bankruptcy orders to be made respectively against Tan Mei Lian (“Tan”) and Neo Kian Soon (“Neo”). The relevant facts out of which these applications arise may be shortly stated. 4 OLM was in the business of retailing and supplying telecommunication products such as mobile phones and servicing the same. Tan was a director and shareholder of OLM while Neo, his wife, was its general manager. In 2016, OLM commenced Suit No 1139 of 2016 (“S 1139/2016”) against them in the High Court for, among other things, breaches of fiduciary duties, wrongful misappropriation of monies belonging to OLM, and wrongful manipulation of OLM’s accounts. Midway through the suit, in December 2018, a winding up order was made against OLM in Companies Winding Up No 289 of 2018 (“CWU 289/2018”). 5 In March 2019, the High Court delivered its judgment in S 1139/2016, finding in OLM’s favour on the aforementioned claims and ordering, among other things, that Tan and Neo pay OLM on a joint and several basis damages amounting to $1,163,346, costs and disbursements fixed at $300,000 and $270,000 respectively, and pre-judgment and post-judgment interest. This judgment debt formed the basis of statutory demands that OLM served on Tan and Neo in July 2019, and when those demands were not satisfied, OLM filed these bankruptcy applications in August 2019. 6 Tan and Neo applied to stay these bankruptcy proceedings pending an appeal they had filed against the High Court judgment in Civil Appeal No 89 of 2019 (“CA 89/2019”). The application, however, was resolved when parties recorded a consent order under which it was agreed that “[i]n respect of the sums ordered to be paid by [Tan and Neo] in HC/S 1139/2016”, Tan and Neo “shall offer security to [OLM] in the form of all of [Neo’s] shares in [OLM]” in the manner set out in the consent order. The consent order also provided that these bankruptcy applications would be adjourned pending the final determination of CA 89/2019, with liberty to OLM to restore the bankruptcy hearings should that appeal be dismissed. 7 The Court of Appeal dismissed CA 89/2019 in January 2020, save that it reduced the sum payable by Tan and Neo as damages by $230,000 and consequentially varied the pre-judgment interest by ordering that it accrue on the reduced sum. These bankruptcy applications were then restored for hearing and OLM proceeded to file several affidavits affirmed by one of its liquidators on the liquidators’ behalf, stating that OLM would be proceeding to obtain bankruptcy orders against Tan and Neo. The liquidators were of the view that the value of Neo’s shares were insufficient to secure the judgment debt as varied by the Court of Appeal. In the affidavit of non-satisfaction filed by the liquidators prior to the hearing before me, the outstanding debt was stated to be $1,716,692.03. 8 At the hearing, the parties proceeded on the basis that the central question to be determined was whether the value of Neo’s shares was sufficient to secure the debt in full. In this regard, it was not disputed that Neo owned 49.5% of OLM’s shares. OLM also acknowledged that it had accepted all of Neo’s 49.5% shareholding offered under the consent order but contended that these shares were unlikely to provide sufficient security. To be sure, OLM’s case was not that the value of Neo’s shares could be determinedconclusivelyat this point. It acknowledged that, at the present stage of the liquidation, the best it could do was to provide anapproximationof the value of Neo’s shares by reference to the overall state of OLM’s assets and liabilities. Counsel for OLM, Ms Lee, nevertheless submitted that even on that basis, it could confidently be concluded that Neo’s shares would be insufficient and that bankruptcy orders should therefore be made in both applications. Counsel for Tan and Neo, Mr Lim, submitted on the other hand that these applications should be dismissed as Neo’s shares were likely to be at least equivalent to or exceed the full amount of the debt. The gist of his submissions was that OLM’s estimates were premature and had unfairly overstated the company’s liabilities with the corresponding effect of deflating the value of Neo’s shares. In the alternative, he submitted that these applications should be stayed until such time as the value of Neo’s shares had been determined. 9 In my judgment, the present uncertainty surrounding the value of Neo’s shares prevented the court from reasonably concluding if they would either be sufficient or insufficient to secure the debt in full. I therefore found it neither appropriate to grant the bankruptcy orders nor to dismiss the bankruptcy applications outright. In my view, a stay of these applications until Neo’s shares had been determined was the fair order to make in all the circumstances. These are my reasons.",
        "Analysis": "10 Section 65(1) of the Bankruptcy Act provides that the court “shall not” make a bankruptcy order unless it is satisfied that, among other things, the debt in respect of which the bankruptcy application was made has neither been paid nor secured or compounded for. As explained earlier, the central question in these applications was whether Neo’s shares were sufficient to secure the debt in full and, to satisfy me either that they were or that they were not, both parties’ submissions turned to examine the overall state of OLM’s assets and liabilities. 11 There was no dispute surrounding the assets of OLM. Both parties relied on an account of receipts and payments which OLM’s liquidators had lodged with the Official Receiver under s 317 of the Companies Act (Cap 50, 2006 Rev Ed), which stated that OLM had assets amounting to $5,728,422.32 as at December 2019. OLM accepted that these were OLM’s current available assets for the purposes of the hearing, but said that the approximate value of Neo’s shares was not simply 49.5% of this sum. Ms Lee highlighted that OLM had substantial “contingent and prospective” liabilities that amounted potentially to around $3.6m and, once these had been taken into account, the value of Neo’s shares would be shown to be insufficient to secure the debt in full. The figures which Ms Lee relied on were presented in a table annexed to her written submissions which I shall refer to as “OLM’s Table”. 12 It bears setting out OLM’s account of how these potential liabilities amounted to some $3.6m in total. In this regard, OLM categorised the potential liabilities under four distinct heads. (a)Costs of restating the accounts: Given that Tan and Neo were found to have manipulated OLM’s accounts in S 1139/2016, the liquidators anticipated that it might be necessary to restate the accounts at the estimated cost of between $80,000 and $100,000. In OLM’s Table, these costs were recorded as$100,000. (b)Potential claims by third parties: Given that Tan and Neo were also found in S 1139/2016 to have diverted cash sales from OLM amounting to $821,965 (“the Diverted Sum”), the liquidators said that this exposed OLM to potential claims from various third parties as had been recognised by the High Court in its judgment. The liquidators considered that the potential third party claims were likely to be made in respect of the following. (i) First, evaded income tax. As the diverted cash payments resulted in OLM underpaying its taxes, the liquidators considered that OLM would be liable to enforcement action under s 96A of the Income Tax Act (Cap 134, 2014 Rev Ed) for serious fraudulent tax evasion and made to pay the mandatory penalty of four times the evaded tax. According to the liquidators, OLM thus faced a penalty amounting to four times of 17% (being the corporate tax rate) of the Diverted Sum, which OLM’s Table recorded as a liability amounting to$558,936.20. (ii) Second, undercharged goods and services tax (“GST”). This was also said to arise from the diverted cash sales. Here, the liquidators considered that OLM would be liable to enforcement action under s 62 read with s 48 of the Goods and Services Tax Act (Cap 117A, 2005 Rev Ed), such that it would have to pay a penalty of potentially three times the amount of undercharged GST. According to the liquidators, OLM thus faced a penalty amounting to three times of 7% (being the GST rate) of the Diverted Sum, which OLM’s Table recorded as a liability amounting to$161,320.23. (iii) Third, underpaid Central Provident Fund (“CPF”) contributions. Tan and Neo were found to have caused OLM to pay bonuses to employees without making CPF contributions, thus making it liable to enforcement action by the CPF Board. According to the liquidators, the bonus payments in question amounted to at least $300,682 and 17% of this sum (being the employer’s CPF contribution rate) would represent the total underpaid CPF. This was recorded in OLM’s Table as a liability amounting to$51,115.94. (iv) Fourth, concealed turnover rent. OLM had entered into several leases with landlords which typically included as a component of the payable rent a certain percentage of the gross turnover for the rented space. Given that the diverted cash sales artificially reduced the gross turnover and correspondingly the rent payable, the liquidators anticipated that OLM’s former landlords would bring claims against it to recover the concealed turnover rent. The liquidators calculated that the average percentage of gross turnover rent that was payable across OLM’s various leases was 4% and thus this percentage of the Diverted Sum gave rise to the total likely concealed turnover rent. This was recorded in OLM’s Table as a liability amounting to$32,878.60. (c)Professional fees: OLM’s Table also recorded$2.4min liabilities for professional fees, of which $1.1m represented OLM’s estimated legal fees incurred since January 2018 while the remaining $1.3m represented the total estimated liquidators’ fees up to the completion of the liquidation. (d)Proofs of debt: Finally, OLM’s Table also recorded$294,894.53in liabilities based on the proofs of debt that had been filed with the liquidators but which had yet to be adjudicated. 13 This suite of potential liabilities was the lens through which OLM invited the court to see that the value of Neo’s shares would fall comfortably short of securing the debt in full. According to OLM’s Table, this deficit stood at approximately $227,000. However, I had considerable difficulty agreeing with OLM that this would likely be the proper margin of the deficit, or that there would be any deficit at all. I make two preliminary observations. 14 First, OLM’s position was belied by numerous qualified statements in the liquidators’ affidavits which revealed the tentative and provisional nature of their estimates. For example, so far as the potential third party claims were concerned, the liquidators’ second affidavit hinted at this when they stated that their estimates here were based only upon a “preliminary assessment”. They then went on in their third affidavit to acknowledge that, while the potential third party claims were “real and also expected to be significant”, there was an “element of uncertainty in determining the relevant exposure”. But most telling, perhaps, was how the liquidators concluded that affidavit. There, they frankly admitted that the quantum of the potential third party claims was “fluid andcannot be ascertained with reasonable accuracyat this juncture” [emphasis added]. With respect, if the liquidators could not determine this substantial head of liability withreasonableaccuracy, how could the court have the confidence to rely on their estimates in this connection to grant such draconian relief as the bankruptcy orders sought? 15 To be clear, none of this is to say that I took an adverse view of the liquidators. In fairness to them, they appeared to be doing their best in good faith to project what OLM’s liabilities might be. But it was equally apparent from what they said that, despite their best efforts, they were handicapped in making reasonable assessments given the overall state of flux. 16 Second, a cursory look at OLM’s Table also immediately demonstrated that the “element of uncertainty” described by the liquidators was not confined to the potential third party claims; it in fact formed the overall backdrop against whichallthe potential heads of OLM’s liabilities had to be evaluated. The costs of restating the accounts, as well as the claims by third parties, were spoken of in terms of their “potential”; the substantial legal fees were said to be “approximate and subject to taxation”; the equally substantial liquidators’ fees were likewise “approximate and subject to approval / taxation”; and the proofs of debt were said to be “subject to adjudication”. 17 The point which I suggest can already be appreciated from taking a broad view of OLM’s applications is that they were clouded in uncertainty. Indeed, this impression was strengthened when one turned to examine the four potential heads of liability in greater detail. 18 First, the liquidators could not even be sure if the exercise of restating OLM’s accounts would be undertaken at all. The liquidators’ second affidavit stated that they were undecided “whether it is worthwhile or even possible to remedy and restate the accounts”. Their third affidavit was similarly equivocal, stating that the accounts “may” have to be restated and, indeed, that the liquidators “willcontinue to explore if it is possiblenotto re-state the accounts so as to save time and costs for everyone concerned” [emphasis added]. It therefore seemed that while there was a possibility that the costs of restating the accountsmightbe incurred, the liquidators’ preferred course – a course they werecommittedto pursuing – was in factnotto incur those costs. Ms Lee had stated in her written submissions that a restatement of the accounts appeared “unavoidable”, but the liquidators’ evidence certainly did not give me that impression. Moreover, there was also little attempt by OLM to provide a breakdown of how the estimated cost of $100,000 had been arrived at, should the accounts be restated. The liquidators’ evidence on this point did not go further than merely saying that the exercise of restating the accounts would be “intensive” as there would be a need to “go back several years” to reconstruct the accounts. This was not the basis on which I was prepared to accept that the costs of restating the accounts, even if just an estimate, would come up to the considerable sum of $100,000. 19 The unsatisfactory state of the accounts created a second difficulty for OLM because, as explained by the liquidators, this affected their ability to determine “with a fair degree of certainty” what OLM’s exposure might be in respect of the potential third party claims: see also [14] above. The liquidators further explained that this was also why they had yet to engage with the relevant authorities on the potential claims. OLM nevertheless proceeded to record more than $820,000 as liabilities under this head. However, this estimate rested on several layers of assumptions which made it seem premature. First of all, there was no indication of any third party actions being contemplated against OLM, or that these would be forthcoming. And even if I accepted that such actions would likely be taken at some point, either by the relevant authorities or OLM’s former landlords, OLM’s estimates were doubtful in several other respects. I considered the following. (a) Regarding the potential claim for evaded tax, it was not certain that the tax authorities would necessarily proceed against OLM under s 96A of the Income Tax Act. Ms Lee fairly accepted during the hearing when her attention was drawn to s 96 of that legislation that it was equally possible for enforcement action to be taken under that provision. Section 96 prescribes an offence with a lower culpability and, importantly for present purposes, a penalty that was treble, rather than quadruple, the amount of tax evaded. Based on OLM’s own estimates, this would reduce the liability under this head by some $140,000. (b) Regarding the potential claim for undercharged GST, Ms Lee also accepted during the hearing that since the Comptroller had discretion under s 48 of the Goods and Services Tax Act to impose a penalty “not exceeding” three times the undercharged tax, it would not necessarily be the case that the maximum penalty would be imposed, as was assumed in OLM’s Table. (c) Regarding the potential claim for concealed turnover rent, the liquidators’ own evidence was that this might be completely offset by certain outstanding sundry debts and deposits held by OLM’s former landlords that potentially amounted to $140,000. In other words, the liability under this head could very well end up being zero. 20 Third, doubts also persisted over OLM’s $2.4m estimate in lawyers’ and liquidators’ fees. The legal fees had yet to be billed and, according to the liquidators, both sets of fees would be taxed. Furthermore, only very thin descriptions of the work done by these professionals had been provided that seemed disproportionate to the potential size of the fees. In any event, I also noted that OLM’s solicitors had themselves indicated that they would be providing a discount on their fees. While it was not clear what that discount would be, it seemed that the estimated legal fees in OLM’s Table should at the very least be less than $1.1m to reflect the discount. 21 Fourth, it was also uncertain if the proofs of debt would amount to close to $300,000 as estimated by OLM, given that they had yet to be adjudicated. The adjudicated sums might end up being lower than the amount estimated in OLM’s Table, and this was also fairly acknowledged as possible by Ms Lee. 22 The short point is this: it seemed necessary to place an asterisk next to every item that appeared as a liability in OLM’s Table to denote either that they might not be incurred at all or that, if they were at some point, they might well be lower than OLM’s current estimates. At all events, it seemed plausible to imagine more conservative figures that would ultimately result in the value of Neo’s shares covering the shortfall estimated by OLM. Indeed, it was also not entirely clear whether OLM had further assets. In this regard, the liquidators stated that they were still “making enquiries” about a deposit that OLM had previously placed with Singtel amounting to $500,000. The liquidators averred that this deposit appeared to have already been set-off against amounts due from OLM to Singtel, but the correspondence between the liquidators and Singtel on this point was inconclusive. This was not to suggest that the Singtel deposit should have been recorded in OLM’s Table as an asset of $500,000, but only to underscore the preliminary nature of the liquidators’ assessment of OLM’s assets and liabilities at this time. 23 Finally, the entire exercise of attempting to value Neo’s shares also had to be viewed in light of the consent order which parties entered into to resolve the stay application. That consent order was at leastsomeindication to me that Neo’s shares were believed by the parties at the time to be sufficient to secure the judgment debt in S 1139/2016, which it should further be noted was then reduced by some $230,000 on appeal. 24 For all these reasons, I did not see how it was possible to safely conclude that the value of Neo’s shares would be insufficient to secure the debt in full. I therefore declined to make the bankruptcy orders sought by OLM. To be clear, OLM did not have to eliminate all doubts, no matter how small, inconsequential or implausible, before it would have been appropriate in my view to proceed to obtain bankruptcy orders. But this case had a different complexion. As described at [16] above, the “element of uncertainty” which the liquidators admitted to being present was a central and unavoidable feature of this case. It gave rise to the overriding sense that the value of Neo’s shares simply could not reasonably be estimated at this juncture. In my judgment, these were plainly not the circumstances in which bankruptcy orders could be made. To do so would not be in keeping with the court’s careful approach when granting such relief. 25 At the same time, I also found it inappropriate to dismiss the bankruptcy applications. For that to have happened, Tan and Neo needed to satisfy me that that the value of Neo’s shares would be equivalent to or exceed the full amount of the debt: see r 127 read with r 98(2)(c) of the Bankruptcy Rules (Cap 20, R 1, 2006 Rev Ed). To that end, Mr Lim sought to argue in his written submissions that “the value of Neo’s Shareswillmore than cover the debt payable to OLM” [emphasis added] because it was reasonable to assume that the professional fees would be reduced by a third on taxation. But there was, with respect, no basis provided for this argument. In any event, Mr Lim’s own submissions made in resisting these applications at the hearing repeatedly sought to emphasise the difficulty of valuing Neo’s shares at this stage of the liquidation. Those submissions cut both ways – just as they persuaded me that it was not possible safely to conclude that Neo’s shares would be insufficient to secure the debt, so did they also lead me away from saying with any degree of confidence that those shares would be sufficient. Finally, I also noted that the liquidators had postulated that the potential third party claims against OLM “may actually even be higher” than their present estimates. They explained that Tan and Neo were found in S 1139/2016 to have disposed of documentation that would have been relevant to the suit and, accordingly, OLM’s exposure under these potential claims might be greater when more information came to light. I could not reasonably discount such a possibility at this point. 26 In the final analysis, I considered that the fair order to make in all the circumstances was neither to grant nor dismiss the bankruptcy applications, but to maintain thestatus quoin these proceedings until such time as the liquidation reached a stage where the overall picture of OLM’s assets and liabilities, and consequently the value of Neo’s shares, had become clear. I thereforeordered, pursuant to the court’s power under s 64 of the Bankruptcy Act, and as suggested by Mr Lim in the alternative, that these bankruptcy applications be stayed until the value of Neo’s shares had been determined.      Bryan FangAssistant Registrar William Ong, Lee Bik Wei and Laura Ngiam (Allen & Gledhill LLP) for the plaintiff;Adrian Tan, Hari Veluri and Joel Lim (TSMP Law Corporation) for the defendants."
    }
}