{
    "case_title": "Tan You Cheng vNg Kok Hin",
    "ncitation": "[2020] SGHC 237",
    "coram": "Andre Maniam JC",
    "sections": {
        "Introduction": "1 An expressway is no place for a pedestrian. 2 The plaintiff was standing in the middle of the Pan Island Expressway (“PIE”) in the early hours of the morning1Foot Note 1×Notes of evidence (“NE”), 15 July 2020, 52:8-10.when the defendant’s car collided into him. 3 The plaintiff sued the defendant for negligence. The defendant denied liability and asserted contributory negligence on the part of the plaintiff. The matter proceeded to trial on the issue of liability, with the issue of quantum to be determined at a later stage (if necessary).",
        "The accident": "",
        "The witnesses": "4 The plaintiff testified on his own behalf and called his colleague Mr Chew Yi Le (“Mr Chew”) as a witness. Mr Chew too was on the road with the plaintiff. 5 The defendant testified on his own behalf and called Mr David James Hunter (“Mr Hunter”), an accident reconstructionist, as an expert witness. 6 None of the witnesses saw the collision: the plaintiff was not looking at oncoming traffic, Mr Chew was not looking in the direction of the accident, and the defendant did not see the plaintiff.",
        "The evidence from the plaintiff and Mr Chew": "7 At around midnight on 16 January 2017, the plaintiff was driving a lorry laden with goods. Mr Chew was a passenger in the lorry. They were travelling along the PIE in the direction of Tuas, just before the Stevens Road exit, when they heard some of the goods fall off the back of the lorry and on to the road. 8 The plaintiff stopped the lorry and switched on its hazard lights, and he and Mr Chew alighted from it. The lorry was left at rest in lane 3 (counting from the right) of the four lanes in the direction the lorry was travelling. The speed limit was 80 km/h at that part of the road, and it was a straight stretch of road for over 300m leading up to the lorry.2Foot Note 2×Mr Hunter’s report, p 15 (Plaintiff’s Bundle of Documents (“PB”) at p 44). 9 The plaintiff and Mr Chew acknowledged that the goods had fallen from the lorry because they had not properly been secured by ropes or a canvas sheet.3Foot Note 3×NE, 15 July 2020, 38:18-29, 16:15-18:4. 10 Rule 18 of the Road Traffic Rules (Cap 276, R 20, 1999 Rev Ed) provides: Load on vehicles to be secured by ropes or other proper material 18.Whenever it is necessary to prevent the contents from falling out, the load on any vehicle on a road shall be secured by ropes or other proper material. 11 The plaintiff was issued a warning by the traffic police for conveying goods not secured by ropes or proper appliances to prevent the goods from falling out, and he did not challenge the warning.4Foot Note 4×PB 5; NE, 15 July 2020, 42:4-12. 12 When the lorry was stopped, the fallen goods were some 10–15m behind it – they included two folding chairs and a baby pram, each shrink-wrapped, which were still on the road as shown in photographs of the accident scene.5Foot Note 5×NE, 15 July 2020, 16:2-14, 19:15-28, 39:9-22. 13 The plaintiff acknowledged that it was wrong of him to stop and leave the lorry at rest in lane 3; it was an obstruction to oncoming traffic. He agreed that he was required by highway traffic rules to drive his lorry over to the shoulder but did not do so.6Foot Note 6×NE, 15 July 2020, 41:21-42:3, 52:8-53:7. 14 Rule 6 of the Road Traffic (Expressway Traffic) Rules (Cap 276, R 23, 1990 Rev Ed) provides: Restriction on stopping 6.—(1) Subject to this rule, no vehicle shall stop or remain at rest on a carriageway. (2)  Where it is necessary for a vehicle to stop or remain at rest while it is on an expressway — (a) by reason of a breakdown or mechanical defect or lack of fuel, oil or water required for the vehicle; (b) by reason of any illness, accident or emergency; (c) to permit any person in or on the vehicle to recover or remove any object which has fallen on the expressway; or (d) to permit any person in or on the vehicle to give help to any other person in any of the circumstances specified in this paragraph, the vehicle shall, as soon as is practicable, be driven or moved off the carriageway to the shoulder or verge on the left or near side of the vehicle. (3)  A vehicle which is at rest on a shoulder or verge in any of the circumstances specified in paragraph (2) — (a) shall, as far as is reasonably practicable, remain at rest on that shoulder or verge in such a position that no part of it or of any load carried obstructs or is a cause of danger to any other vehicle using the carriageway; and (b) shall not remain at rest on that shoulder or verge longer than is necessary in those circumstances. … 15 The plaintiff was issued a warning by the traffic police for stopping or remaining at rest on the carriageway of the expressway; he did not challenge it.7Foot Note 7×PB 5; NE, 15 July 2020, 42:4-12. 16 At the time, however, the plaintiff regarded leaving the lorry in lane 3 as being the lesser of two evils as compared to driving it to the road shoulder or verge, and then returning to collect the goods on the road. He considered that the lorry, with its hazard lights on and the fallen goods in front of it, would be more noticeable to oncoming traffic than just the goods on the road, with the lorry moved away to the shoulder or verge.8Foot Note 8×NE, 15 July 2020, 39:23-40:15, 47:1-22, 50:33-52:2, 60:3-28.As such, the plaintiff and Mr Chew left the lorry in the middle of the road whilst picking up the goods. 17 The plaintiff did not put up a warning sign to alert oncoming traffic.9Foot Note 9×NE, 15 July 2020, 19:15-21:31, 39:14-18, 44:19-46:32.Neither did the plaintiff or Mr Chew act as a lookout, or wave to draw attention to the goods, the stationary lorry, or the plaintiff who was standing beside the lorry, all of which were obstructing oncoming traffic.10Foot Note 10×NE, 15 July 2020, 46:26-32, 53:8-13. 18 The plaintiff thought that he and Mr Chew could quickly address the situation.11Foot Note 11×NE, 15 July 2020, 39:23-40:15.From Mr Chew’s evidence, however, some 15–30 minutes passed from the time the goods fell from the lorry to the time of the accident (when there were still goods on the road – at least two folding chairs and a baby pram, as noted above at [12]).12Foot Note 12×NE, 15 July 2020, 9:11-18. 19 While Mr Chew was still picking up goods from the road, the plaintiff turned his attention to securing the canvas sheet to the lorry using a rope. At some point, the plaintiff made his way to the back of the lorry, near its rear right corner.13Foot Note 13×NE, 15 July 2020, 45:21-46:19.That was where Mr Chew last saw him, before the accident occurred.14Foot Note 14×NE, 15 July 2020, 12:18-14:22; Exhibit D1.Mr Chew said the accident happened some ten seconds later.15Foot Note 15×NE, 15 July 2020, 14:29-15:2. 20 During those ten seconds, the plaintiff moved from the back of the lorry to the right side of the lorry, securing the canvas sheet to the lorry as he went.16Foot Note 16×NE, 15 July 2020, 36:4-38:10.This entailed the plaintiff stepping into lane 2,ie, the lane to the right of lane 3 where the lorry was stopped, with the lorry close to the lane markings separating lane 3 from lane 2.17Foot Note 17×NE, 15 July 2020, 42:22-47:24, 15:10-23, 20:13-31. 21 The plaintiff claimed that when he was at the back of the lorry,ie, where Mr Chew last saw him, he had checked for oncoming traffic, but thereafter he had been focused on securing the canvas sheet to the lorry. When the accident happened, he was facing the lorry and not facing oncoming traffic. In any event, he never saw the defendant’s car.18Foot Note 18×NE, 15 July 2020, 49:6-19. 22 At the time of the accident, the plaintiff was standing in the shadow of the lorry, with the lorry blocking the nearest street lamp from illuminating the area where the plaintiff was standing.19Foot Note 19×NE, 15 July 2020, 38:15-17; Exhibit D2. 23 Mr Chew heard, but did not see, the accident.20Foot Note 20×NE, 15 July 2020, 10:1-13, 14:27-28, 21:17-18.His attention was focused on retrieving the fallen goods, and he did not see the defendant’s car approaching.21Foot Note 21×NE, 15 July 2020, 21:1-20.",
        "The evidence from the defendant": "24 In the lead-up to the accident, the defendant was driving along the PIE in the same lane as the stationary lorry,ie, lane 3.22Foot Note 22×NE, 16 July 2020, 6:2-9:4; 15:1-18:22, 36:3-26.He was a part time private-hire car driver, and he said that he had been driving the whole day leading up to the accident.23Foot Note 23×NE, 16 July 2020, 3:7-11, 29:30-32.Earlier in the day, he had dinner with a friend in Johor Bahru, Malaysia, and had dropped his friend off in Bedok before making his way home to Choa Chu Kang.24Foot Note 24×Mr Hunter’s report, p 5 (PB 34). 25 It was around 1am by then, and the defendant admitted that he had been sleepy.25Foot Note 25×NE, 16 July 2020, 10:17-28, 29:30-30:4, 30:10-12. 26 According to the defendant, he had been keeping within the speed limit.26Foot Note 26×NE, 16 July 2020, 10:17-11:30.He said that as he approached the fallen goods and the lorry, he suddenly saw a “big thing”27Foot Note 27×NE, 16 July 2020, 27:25.on the road,ie, the fallen goods, when he was just one to two car lengths away; to avoid the obstructions in lane 3, he swerved to the right and checked his mirrors, only to end up hitting the plaintiff (who was by then standing beside the lorry, in lane 2).28Foot Note 28×NE, 16 July 2020, 16:12-18, 36:16-22. 27 However, the defendant stated that he did not see either the plaintiff or the lorry.29Foot Note 29×NE, 16 July 2020, 15:4-17:7, 29:1-14.He only saw the object(s) in front of him which had caused him to take evasive action to avoid a collision. 28 The defendant felt that he had hitsomething. He drove his car to the road shoulder and was then told by a taxi driver that he had hitsomeone. Only then did the defendant realise that there was a stationary lorry in lane 3 and that he had hit the plaintiff. The plaintiff had been thrown forward by the impact of the collision and was lying on the ground beside the front right wheel of the lorry.30Foot Note 30×NE, 15 July 2020, 21:21-26; NE, 16 July 2020, 7:16-26, 15:4-17:7, 29:1-14.",
        "The defendant’s plea of guilt and conviction": "29 The defendant pleaded guilty to a charge under s 65(a) of the Road Traffic Act (Cap 276, 2004 Rev Ed) of: … [driving] without due care and attention, to wit, by failing to keep a proper lookout ahead resulting in a collision with a pedestrian who was then standing on the right side of his stationary vehicle ... He was convicted, fined $800 and disqualified from driving all classes of vehicles for six months.31Foot Note 31×PB 6-11. 30 In pleading guilty, the defendant admitted to the following Statement of Facts (“SOF”):32Foot Note 32×PB 8-9. … 3 … the defendant did drive motor car, SGJ4432M, along Pan Island Expressway towards Tuas, Singapore, without due care and attention, to wit, by failing to keep a proper lookout ahead resulting in a collision with the victim who was standing on the right side of his stationary vehicle. … 6 At the time of accident, weather was fine, road surface was dry and the visibility was clear. The traffic flow was light. … 31 However, concerning his plea of guilt, the defendant testified in para 10 of his affidavit of evidence-in-chief (“AEIC”) that: … I had pleaded guilty as I acknowledge that I did not see the Plaintiff and did not note his presence on the road prior to the impact. However, I feel that I am not fully to blame for this accident. The Plaintiff should not have stopped the lorry in the middle of the road to retrieve items which had fallen off due to his failure to secure them on his vehicle properly prior to the journey. 32 The defendant was questioned about his plea of guilt.33Foot Note 33×NE, 16 July 2020, 21:10-25:12, 30:24-35:22.He said he had pleaded guilty “[b]ecause I bang him”34Foot Note 34×NE, 16 July 2020, 22:3.and “because I hit him”.35Foot Note 35×NE, 16 July 2020, 35:11-14; see also 21:31-22:30, 31:29-30, 35:7-14.However, he maintained that he was not fully to blame; he testified that he was “not the only person cause the thing [sic]”36Foot Note 36×NE, 16 July 2020, 22:23-23:12.and that the plaintiff was “also responsible for this accident”.37Foot Note 37×NE, 16 July 2020, 31:12.He also testified that he had wanted to “clear this thing” which had been “[h]overing for … very long” and “dragging and dragging”, and that pleading guilty would “save [him] trouble”.38Foot Note 38×NE, 16 July 2020, 22:25-27, 23:10. 33 The defendant denied that he had pleaded guilty because he had failed to pay due care and attention or to keep a proper lookout, thereby causing the accident.39Foot Note 39×NE, 16 July 2020, 35:7-22. 34 I will evaluate the defendant’s plea of guilt and conviction in arriving at my findings on liability (see below at [56]–[60]).",
        "Visibility": "35 The SOF which the defendant pleaded guilty to stated: “At the time of accident, weather was fine, road surface was dry and the visibility was clear.”40Foot Note 40×PB 8-9 at 9.The defendant’s accident statement similarly stated that weather conditions were “clear”,41Foot Note 41×PB 13-16 at 14.and the police reports filed by both the plaintiff and the defendant stated that the weather was “clear”.42Foot Note 42×PB 1-4 at 1; PB 17-19 at 17.In the Defence, however, the defendant pleaded that visibility at the time of the accident was “poor”,43Foot Note 43×Defence at para 4.but he did not later mention this in his AEIC. Under cross-examination, he said that when he was in the car, the road appeared “misty” and he felt visibility was “blur”.44Foot Note 44×NE, 16 July 2020, 14:2-32, 24:12-18.However, he testified that when he came out of the car, the weather was clear and that was why he had put “clear” in his police report.45Foot Note 45×NE, 16 July 2020, 14:21-27. 36 The defendant’s expert Mr Hunter testified in cross-examination that there was a potential for “road mist”, and if the air-conditioning was incorrectly set, it could cause condensation and a mist effect of the windscreen.46Foot Note 46×NE, 16 July 2020, 53:3-23.Poor visibility in terms of mist was, however, not mentioned by Mr Hunter in his report, and the defendant’s closing submissions made no reference to this point. In the circumstances, I considered the weather conditions to be clear and not adversely affecting visibility. 37 I did, however, accept Mr Hunter’s opinion that visibility under street lighting at night is generally not as good as visibility under normal daylight,47Foot Note 47×NE, 16 July 2020, 46:29-49:17.a point which Mr Hunter illustrated with photographs of the relevant stretch of the PIE taken in the day, and at night.48Foot Note 48×Mr Hunter’s report, pp 18-22 (PB 47-71).",
        "The parties’ submissions": "38 The parties cited various precedents concerning collisions into stationary vehicles/objects.",
        "The plaintiff’s submissions": "39 It was submitted on behalf of the plaintiff that he ought only to bear 20% liability, and the defendant 80% liability.49Foot Note 49×Plaintiff’s written submissions dated 9 October 2020 (“PWS”) at para 42.That was also the outcome inYang Xi Nav Lim Chong Hong and another (Ong Ah Seng, third party)[2006] 3 SLR(R) 459 (“Yang Xi Na”),50Foot Note 50×PWS at para 33.where a bus conveying the plaintiff and other workers to work collided with a stationary tipper lorry that was illegally parked along the left lane. The collision took place at night on a road that was not brightly lit, and the lights of the lorry were not turned on. Justice Kan Ting Chiu found the driver of the illegally parked lorry to be 20% liable for the accident. 40 Kan J considered two previous decisions (Yang Xi Naat [17]) –Dymondv Pearceand others[1972] 1 QB 496 (“Dymond”) andChop Seng Heng vThevannasan and others[1975] 2 MLJ 3 (“Chop Seng Heng”).  InDymond,a lorry was parked beneath a street lamp; the width of the lorry was just under 1/3 of the width of the carriageway, and the tail lights of the lorry were switched on. A motorcyclist collided into the lorry. At first instance and on appeal, the accident was found to be wholly attributable to the negligence of the motorcyclist, and the motorcyclist’s claim against the lorry driver failed. A majority in the Court of Appeal regarded the parked lorry to be a nuisance, but the court unanimously found that it was not the cause of the accident. 41Chop Seng Hengwas a decision of the Privy Council on appeal from the Federal Court of Malaysia. A moving lorry collided into a stationary lorry at 3am. The stationary lorry was parked along a winding road, with its lights on; conditions were misty with reduced visibility at the time. The trial judge found that the primary cause of the accident was the driver of the stationary lorry having parked it too near the exit of a blind corner, but he also found that the driver of the moving lorry had driven it around that blind corner “a bit fast in the circumstances”. The trial judge thus found the driver of the parked lorry and his employer 75% liable, and the driver of the moving lorry and his employer 25% liable. That was reversed on appeal to the Federal Court, with a majority finding that the driver of the moving lorry and his employer were wholly liable. However, Ong Hock Thye CJ dissented – he would instead have held the obstructionists wholly liable. 42 The Privy Council reversed the Federal Court’s decision and restored the trial judge’s finding. Lord Edmund-Davies, delivering the decision of the court, affirmed the dissenting judgment of Ong CJ inChan LooKhee v Lai Siew San and others[1971] 1 MLJ 253 at 254–255: If parking a car, however recklessly, so as to cause needless obstruction to other road-users, were to be held blameless, merely because other motorists could still have room to pass,provided they kept a proper look-out, then it would appear that the deliberate park of a car anywhere, even in the middle of the highway, should be considered equally excusable, if not justifiable, regardless of the fact that, by reason of such obstruction, other motorists had come to grief by reason of their being not fully alert. In such cases there should, in my opinion, be proper apportionment of blame, depending on the circumstances. But, to exonerate the obstructionist completely – when it is undeniable that, but for the presence of the obstruction, there could not possibly been an accident – is to ignore the principle of placing the blame fairly on those to be blamed for their acts or omissions. In this age of fast motor transport I think it is the duty of the courts to eschew excessive legalism and to require that every motorist should observe the golden rule of shewing due consideration for other road-users, or suffer the consequences of his failure to do so. … [emphasis in original]",
        "The defendant’s submissions": "43 The defendant submitted that the plaintiff’s claim should be dismissed, but in the alternative, that he should not bear more than 10%–20% liability if there was some delay in his reaction on account of his being admittedly sleepy at the time. 44 The defendant relied onLim Kar Bee v Abdul Latif Bin Ismail[1978] 1 MLJ 109 (“Lim Kar Bee”), where a motorcyclist who had swerved left to avoid a child who had stepped into his path collided into steel pipes that had been left by the defendant close to the side of the road for some two years. The trial judge found that the motorcyclist had not been negligent and that the defendant was wholly liable. That decision was upheld by a majority in the Federal Court, with Ong Hock Sim FJ dissenting – he would instead have held the motorcyclist wholly liable.",
        "Findings on liability": "45 The judicial opinions in these cases range from the driver of the moving vehicle being wholly liable, to him not being liable at all. As Kan J observed inYang Xi Na([39]supra)at [29], the liability of the parties is ultimately determined by a consideration of the facts of the particular case. 46 In deciding on liability as between the plaintiff and the defendant, I considered their relative responsibility for the accident in terms of causation and blameworthiness. 47 Had the plaintiff ensured that the goods were properly secured, the accident would not have occurred in the first place. The rear of the lorry had not been covered up with the canvas sheet, and the goods in the lorry were not properly secured by ropes either. The plaintiff then stopped the lorry and left it stationary in lane 3 for quite some time (about 15–30 minutes; see [18] above), while he and Mr Chew went about retrieving the goods. It was only after the plaintiff and Mr Chew had spent some time retrieving the goods that the plaintiff started securing the canvas sheet to the lorry. 48 It appears that the plaintiff regarded the lorry with its hazard lights on and the goods as sufficient warnings to oncoming traffic. However, the lorry was in lane 3 and so were the goods that had fallen behind it, whereas the plaintiff had been standing in lane 2 at the time he was hit, and there was nothing to warn oncoming traffic approaching on that lane.51Foot Note 51×NE, 15 July 2020, 47:18-48:3.The plaintiff worsened the situation by standing in the shadow cast by the lorry, which made him more difficult to spot from the perspective of a driver of an oncoming vehicle. 49 Even if the plaintiff had intended to use the lorry to warn oncoming traffic of the goods on the road, he ought to have set up a warning sign as well, but he did not. Moreover, the plaintiff could have served as a lookout, or he could have asked Mr Chew to alert oncoming traffic or at least watch out for their own safety, but that was not done. Instead, they apparently thought they were quite safe, even though they were walking about in the middle of an expressway. 50 The lorry and the fallen goods obstructed lane 3 of a four-lane highway, and were a hazard not only to oncoming traffic, but also to the plaintiff himself, as oncoming traffic in lane 3 (like the defendant’s car) might move into lane 2 (where the plaintiff eventually stood) to avoid the obstructions in lane 3. 51 The plaintiff claimed to have checked for oncoming traffic before he stepped out into lane 2, but this was not stated in his AEIC or his police report.52Foot Note 52×NE, 15 July 2020, 48:4-19.As such, I doubt that the plaintiff had checked for oncoming traffic, as he claimed. But even if he had checked for oncoming traffic, after he last did so, he was focused on securing the canvas sheet to the side of the lorry and was not looking out for oncoming traffic. Mr Chew estimated that some ten seconds elapsed after he last saw the plaintiff at the back of the lorry; in that time, a car travelling at 80km/h (the speed limit there) would cover around 222m (at 22.22m/s). 52 Mr Hunter’s opinion was that at night, under street lighting conditions, one would have at best 60m of clear visibility.53Foot Note 53×NE, 16 July 2020, 46:29-49:17.A car travelling at 80km/h would cover that in under three seconds. 53 In the circumstances, evenifthe plaintiff had checked for oncoming traffic before stepping into lane 2, he would not have seen the defendant’s car, which must have been at least 200m away at that time. Furthermore, as the plaintiff admitted in cross-examination, he really only made a cursory glance for oncoming traffic lasting for about one second.54Foot Note 54×NE, 15 July 2020, 43:30-44:18. 54 Under cross-examination, the plaintiff conceded that he bore some responsibility for the accident:55Foot Note 55×NE, 15 July 2020, 55:25-29. Q Mr Tan, I put it to you that you had caused this accident by dangerously and negligently stopping your lorry on lane 3 and you personally proceeded to stand on lane 2 without giving proper or reasonable warning to oncoming traffic coming along lane 2 including the defendant’s car. Agree? A Agree. 55 On the other hand, the defendant had admittedly been sleepy, and Mr Hunter fairly accepted that the defendant had reacted late to seeing what he saw on the road.56Foot Note 56×NE, 16 July 2020, 47:22-28.The fact that the defendant did not notice the stationary lorry at all, although the lorry was illuminated by a nearby street lamp and the lorry’s hazard lights were on, also supports the conclusion that he had failed to keep a proper lookout (whether because he was sleepy or otherwise). I do not accept the defendant’s submission that his failure to notice the lorry was irrelevant just because he had not collided into the lorry. 56 Further, the defendant had pleaded guilty to, and was convicted of, an offence of driving without due care and attention. He admitted that he had failed to keep a proper lookout ahead, resulting in the collision with the plaintiff. 57 Under s 45A(1) of the Evidence Act (Cap 97, 1997 Rev Ed), the fact of the defendant’s conviction is admissible for the purpose of proving, where relevant to any issue in the proceedings, that he committed that offence; under s 45(3) of the Evidence Act, unless the contrary is proved, he shall be taken to have committed the acts and to have possessed the state of mind which at law constitute that offence. 58 Moreover, the defendant’s plea of guilt amounts to an admission by him. A court can, however, examine the reasons behind a party deciding to admit to an offence –Ong Bee Nah v Won Siew Wan (Yong Tian Choy, third party)[2005] 2 SLR(R) 455 at [67]–[83], a case which similarly concerned an offence of driving without due care or consideration. 59 Here, the defendant was fined $800 and disqualified from driving all classes of vehicles for a period of six months, which would have affected his part-time employment as a private-hire driver. The defendant would not have lightly pleaded guilty if he considered himself blameless. 60 Although the defendant gave various reasons for pleading guilty, he acknowledged that he should bear some, but not full, responsibility for colliding with the plaintiff (see [31]–[33] above). 61 Had the defendant not been sleepy and had he kept a proper lookout, he might very well have noticed the goods and the lorry earlier, reacted sooner, given the obstructions a wider berth, and avoided colliding with the plaintiff. 62 Nevertheless, in taking evasive action to avoid the goods on the road, the defendant also avoided the lorry (even though he did not notice the lorry at the time). Unfortunately, that took him on a collision course with the plaintiff. The plaintiff’s presence in the next lane, in the shadow of the lorry, played a crucial part in the accident. 63 At an earlier point in the proceedings, the plaintiff alleged that the defendant had been speeding,57Foot Note 57×Statement of Claim (Amendment No 1) dated 22 May 2019 at para 6(a).but this was only based on the plaintiff’s speculation that given the injuries he had suffered, the defendant must have had been speeding. The plaintiff did not adduce any evidence, whether from an expert or otherwise, on this point.58Foot Note 58×NE, 15 July 2020, 48:20-49:14.In cross-examination of the defendant, it was not suggested to him that he had been speeding, and the point was not pursued in the plaintiff’s closing submissions. In the circumstances, I do not find that the defendant had been speeding.",
        "Conclusion": "64 Considering all the circumstances, I would apportion liability such that the defendant bears 20% liability and the plaintiff bears 80% liability. That is slightly less (to the driver of the moving vehicle) than the 25%–75% apportionment inChop Seng Heng([40]supra; see [41]–[42] above), and I consider that to be appropriate here. 65 I will hear the parties further on costs. Andre ManiamJudicial Commissioner A Revi Shanker s/o K Annamalai (ARShanker Law Chambers) for the plaintiff; Yeo Kim Hai Patrick and Lim Hui Ying (Legal Solutions LLC) for the defendant."
    }
}