{
    "case_title": "CDV vCDW",
    "ncitation": "[2020] SGHC 61",
    "coram": "Dedar Singh Gill JC",
    "sections": {
        "Facts": "2 The Husband and the Wife were married on 12 August 1973. During the course of divorce proceedings both parties recorded the Order on 24 March 1994.1Foot Note 1×Husband’s Affidavit dated 31 July 2019, p 12.The Order provides: UPONthe questions regarding the maintenance for the [Wife] and the disposal of the matrimonial property coming on for hearing this day andUPONhearing Counsels for the [Wife] and the [Husband],BY CONSENT,IT IS ORDEREDthat : - 1) the [Husband] do pay the [Wife] maintenance in the sum of $2,500.00 per month up to a total of $252,000.00. 2) the [Husband]’s liability to pay maintenance shall cease when :- a) the [Wife] remarries; or b) the [Husband] reaches the age of 55; or c) the [Husband] is unable to work or secure employment at a salary which will enable him to pay maintenance in the sum of $2,500.00 3) The existing joint tenancy in the matrimonial home known as [the Matrimonial home] be severed and the [M]atrimonial home be held by the [Wife] and the [Husband] as tenants in common in equal shares. 4) The [Wife] do have exclusive occupation and control of [the Matrimonial home] during her lifetime after the severance of the joint tenancy. 5) [The Matrimonial home] will not be sold during the [Wife]’s lifetime. 6) If the [Wife] does remarry during her lifetime, she will not be entitled to occupy [the Matrimonial home] and the [M]atrimonial home shall be sold and the proceeds of sale divided equally between the [Wife] and the [Husband]. … 3 The decreeabsolutewas granted on 21 June 1994.2Foot Note 2×Husband’s Affidavit dated 31 July 2019, p 3. 4 After the divorce, the Husband remarried another woman (“the present Wife”). For a time, the Husband and the present Wife rented a property in Johor Bahru.3Foot Note 3×Husband’s Affidavit dated 31 July 2019, para 6. 5 In 1998, they bought a HDB flat (“the HDB flat”), which they co-own.4Foot Note 4×Husband’s Affidavit dated 31 July 2019, para 6.Both the Husband and the present Wife have a son together (“the Son”). 6 At the time of the divorce in 1994, the Husband was earning a salary of $2,000.00.5Foot Note 5×Husband’s Affidavit dated 31 July 2019, para 7.In 1997, he earned an annual salary of $72,000.00.6Foot Note 6×Husband’s Affidavit dated 31 July 2019, para 7.In 2013, his annual salary reached $98,933.00.7Foot Note 7×Husband’s Affidavit dated 31 July 2019, para 7.In 2015, the Husband was offered around $7,000.00 per month as a director in a company.8Foot Note 8×Husband’s Affidavit dated 31 July 2019, para 8.He, however, claimed to have received only $3,000.00 per month from his directorship.9Foot Note 9×Husband’s Affidavit dated 31 July 2019, para 8.Thereafter, he left his position as a director and joined another company where he earned between $2,000.00 to $3,000.00 a month.10Foot Note 10×Husband’s Affidavit dated 31 July 2019, para 8.Since then, the Husband has fallen on tough times. The company in question did not pay him on time. The Husband sent several WhatsApp messages to his employer asking for transfers of various sums of money, some of which include:11Foot Note 11×Husband’s Affidavit dated 31 July 2019, pp 27–32. (a) “please tt urgently 150 to me” (dated 15 December 2018); (b) “please tt $2000 to me for my son’s trip tomorrow” (dated 28 December 2018); (c) “is there any way you can tt 200 to me urgently. appreciate…” (dated 21 January 2019); and (d) “I have only $3 left in my wallet. please SMS after you have tt many thanks” (dated 5 April 2019). 7 The Wife did not challenge the veracity of these WhatsApp messages. 8 Given his financial difficulties, the Husband was unable to pay his monthly mortgage instalments on the HDB flat for three years.12Foot Note 12×Husband’s Affidavit dated 31 July 2019, para 9.He resorted to using credit cards, including from OCBC, to pay his monthly mortgage instalments on the HDB flat.13Foot Note 13×Husband’s Affidavit dated 31 July 2019, para 12(i). 9 The Husband also used a credit card to pay his household expenses.14Foot Note 14×Husband’s Affidavit dated 31 July 2019, para 12(i).In addition, he faced difficulties in paying the Son’s university fees. In his own words, he was not “able to discharge [his] duty as a father to [the Son] since he entered [u]niversity”.15Foot Note 15×Husband’s Affidavit dated 31 July 2019, para 12(iii).The Son’s university fees amounted to $5,000.00 per semester and were payable upfront.16Foot Note 16×Husband’s Affidavit dated 31 July 2019, para 12(iii).As the Husband was unable to pay the fees, the Son’s aunt paid some of the fees.17Foot Note 17×Husband’s Affidavit dated 31 July 2019, para 12(iii). 10 As it turned out, the Husband was unable to pay the outstanding credit card debts. On 13 March 2019, OCBC served a statutory demand under s 62 of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“the Bankruptcy Act”) for outstanding debts of $58,352.85 on various credit card accounts.18Foot Note 18×Husband’s Affidavit dated 31 July 2019, pp 40–43.As at the date of my decision, this figure had risen to $69,314.44.19Foot Note 19×Husband’s Affidavit dated 13 December 2019, p 2. 11 Further, as the Husband was unable to keep up with his monthly mortgage instalments on the HDB flat, he faced the possibility of its compulsory acquisition. There remained a large outstanding mortgage on the HDB flat totalling $194,979.62, including instalment arrears of $58,992.00.20Foot Note 20×Husband’s Affidavit dated 13 December 2019, p 8.His failure to pay the monthly mortgage instalments led HDB to issue a notice of repossession.21Foot Note 21×Husband’s Affidavit dated 31 July 2019, para 12(i).Subsequently, the Ministry of National Development sent to the Husband a letter requesting him to submit representations in order to “appeal” against the compulsory acquisition of the HDB flat.22Foot Note 22×Husband’s Affidavit dated 13 December 2019, p 45.It was not known whether he proceeded to submit the letter as requested. 12 As at 3 July 2019, the Husband only had $10,956.59 in his CPF Retirement Account.23Foot Note 23×Husband’s Affidavit dated 31 July 2019, pp 50–54.As a result of his financial predicament, he intended to sell his half-share in the house referred to in the Order (“the Matrimonial home”) either to the Wife or a third party in the open market at the prevailing market price.24Foot Note 24×Husband’s Affidavit dated 31 July 2019, para 13.In this regard, he wrote the following letter to the Wife:25Foot Note 25×Husband’s Affidavit dated 31 July 2019, p 55. Dear [Wife] I am writing to you after so many years to appeal for some help and to enquire about the state of [the Matrimonial Home]. I have fell into some difficult times during the last few years which have resulted in the accumulation of a large amount of debt among a few creditors. It has been especially difficult as I still have to continue working for $2,000 a month even in my retirement years – resulting in me being unable to pay off the creditors and to support my son who is currently undergoing his university education. There is a high chance that the creditors will force the sale of the [Matrimonial home]as it is my last and only asset available for me to repay my debt.… As such, I am hoping that you will be open to a discussion to work out possible solutions together. … Thus, I hope you and I can come to an agreement as it is not in my best interest to implicate you in this matter. … [emphasis added] 13 Notably, the Husband had highlighted in his letter to the Wife his fear that there would be a forced sale of the Matrimonial home given the extent of his debts. The Husband claimed that this letter was delivered to the Wife through the Son on 13 July 2019.26Foot Note 26×Husband’s Affidavit dated 31 July 2019, para 14.The Wife did not deny that this letter was delivered to the Matrimonial home. In an attempt to discuss the letter’s contents with the Wife, the Husband and the Son visited the Matrimonial home at least three times in July 2019. During their visits, they found the Matrimonial home to be deserted.27Foot Note 27×Husband’s Affidavit dated 31 July 2019, paras 15 to 18. 14 Subsequent attempts to effect personal service of Summons No 600205 of 2019,ie, the present summons, on the Wife through the court clerk proved unsuccessful. The court clerk visited the Matrimonial home on 14 August 2019 and 18 August 2019. On both occasions, all the doors and windows were shut. The gate was padlocked.28Foot Note 28×Zulkipli Bin Lahom’s Affidavit dated 28 August 2019, p 3.Thereafter, the Husband successfully applied for substituted service and served the papers by posting them on the gate of the Matrimonial home.29Foot Note 29×Order of Court dated 3 September 2019. 15 Eventually, the Wife filed an affidavit on 29 October 2019 claiming that she was still living in the Matrimonial home.30Foot Note 30×Wife’s Affidavit dated 29 October 2019, para 19. 16 As at the date of the first hearing on 2 December 2019, the Husband and the Wife were 73 and 70 years of age respectively.31Foot Note 31×Husband’s Affidavit dated 31 July 2019, para 10.Pursuant to s 112(4) of the WC, the Husband sought to vary sub-orders 4 and 5 of the Order so that the Matrimonial home would be sold on the open market.32Foot Note 32×Husband’s Affidavit dated 31 July 2019, para 4.In particular, the Husband claimed that the Wife no longer lived in the Matrimonial home and that he would probably face bankruptcy proceedings resulting in a forced sale of the Matrimonial home at an undervalued price.33Foot Note 33×Husband’s Affidavit dated 31 July 2019, paras 13-19. 17 On 2 December 2019, I informed the Wife’s counsel, Mr Liaw Jin Poh (“Mr Liaw”), that there appeared to be insufficient evidence that the Wife was still living in the Matrimonial home. The Husband and the Son had not been able to speak to the Wife during their visits. The court clerk’s attempts to effect personal service also proved unsuccessful. The Wife’s only explanation was that her relatives had been suffering from a “slew of medical emergencies” which required her assistance and diverted her attention away from the Matrimonial home.34Foot Note 34×Wife’s Affidavit dated 29 October 2019, para 10(c). 18 Concurrently, I impressed on Mr Liaw that it might be in the Wife’s own interests to consider the Husband’s offer to sell his half-share especially since there was evidence that the Husband was facing probable bankruptcy. Furthermore, the Husband had stated that he was willing to pay the Wife $192,000.00 in maintenance arrears from the sale proceeds of the Matrimonial home.35Foot Note 35×Minute Sheet dated 2 December 2019; Husband’s Affidavit dated 12 November 2019, para 16.I granted an adjournment for Mr Liaw to take further instructions and fixed the matter for hearing on 10 December 2019. 19 Prior to the hearing on 10 December 2019, both parties filed one additional affidavit without leave of court. I allowed the admission of both affidavits, but cautioned against the filing of further affidavits without leave of court. In her second affidavit, the Wife attempted to supplement her assertion that she was living in the property by exhibiting,inter alia, utility and property tax bills.36Foot Note 36×Wife’s Affidavit dated 6 December 2019.The Husband’s response was that the Wife’s rates of usage of water and electricity fell below the average.37Foot Note 37×Husband’s Affidavit dated 9 December 2019, paras 7 and 12.The Husband further claimed that it appeared that the Wife would only go the Matrimonial home to water the plants and perform some minimal cleaning.38Foot Note 38×Husband’s Affidavit dated 9 December 2019, para 7.At the hearing, I directed the Husband to file another affidavit to update the court on his present financial state,39Foot Note 39×Minute Sheet dated 10 December 2019.especially in relation to his outstanding debt with OCBC. 20 On 11 December 2019, the Husband’s solicitors wrote to OCBC’s solicitors, informing them that the Husband would settle the outstanding debt owed to OCBC if he was able to sell his half-share in the Matrimonial home.40Foot Note 40×Husband’s Affidavit dated 13 December 2019, p 25.The solicitors also asked whether OCBC would commence bankruptcy proceedings against the Husband and if OCBC would be prepared to stay the bankruptcy proceedings pending the hearing of the present summons.41Foot Note 41×Husband’s Affidavit dated 13 December 2019, p 25.OCBC’s response was as follows:42Foot Note 42×Husband’s Affidavit dated 13 December 2019, p 26. … Please also let us have copies of the duly exercised option to purchase and/or the Sale and Purchase agreement [of the Matrimonial home] by 31 December 2019 and a letter of undertaking from the solicitors acting for your client in the conveyance of [the Matrimonial home] by 15 January 2020. Please note that if your client is unable to fulfil the above, we have firm instructions to commence legal action against your client without further notice. … [emphasis added in bold italics] 21 In his latest affidavit, the Husband provided details on whether he would be able to discharge his existing debts by selling the HDB flat.43Foot Note 43×Husband’s Affidavit dated 13 December 2019, p 2.In the event that the HDB flat was compulsorily acquired, he would receive $585,992.00 from the HDB.44Foot Note 44×Husband’s Affidavit dated 13 December 2019, p 3.After paying the outstanding mortgage of $197,052.62 on the flat,45Foot Note 45×Husband’s Affidavit dated 13 December 2019, p 2.and assuming an equal split of the remainder (with the other half going to the present Wife), the Husband would have to refund $192,489.34 to his CPF retirement account. He would then be left with $1,980.35 in cash.46Foot Note 46×Husband’s Affidavit dated 13 December 2019, p 3.The Husband pointed out that this cash balance would be wiped out by the time HDBactuallyacquired the HDB flat. 22 Apart from OCBC, Standard Chartered Bank (Singapore) Limited (“SCB”) was also pursuing the Husband for an outstanding debt. In this regard, SCB had obtained a writ of seizure and sale against certain items in the HDB flat.47Foot Note 47×Husband’s Affidavit dated 12 November 2019, pp 24-30.Pursuant to the writ of seizure and sale, on 30 October 2019, the bailiff seized various items, including a two-door fridge and a television.48Foot Note 48×Husband’s Affidavit dated 12 November 2019, p 27.Collectively, all of these items were valued at a paltry sum of $660.00.49Foot Note 49×Husband’s Affidavit dated 12 November 2019, pp 22–30. 23 As a result of his financial troubles, the Husband also claimed that he was estranged from the present Wife for 10 years50Foot Note 50×Husband’s Affidavit dated 12 November 2019, paras 23, 25 and 37.and that he was the sole breadwinner taking care of the Son and mother-in-law, who resided with him in the HDB flat.51Foot Note 51×Husband’s Affidavit dated 12 November 2019, para 37.The present Wife was a bankrupt and had not made significant payments towards the outstanding mortgage on the HDB flat.52Foot Note 52×Husband’s Affidavit dated 12 November 2019, para 37.",
        "Parties’ arguments": "24 The Husband submitted that he did not have sufficient funds to pay off his debts, faced imminent bankruptcy and was applying for a variation of the Order to avoid a forced sale of the Matrimonial home. He further argued that the Wife was no longer living in the Matrimonial home. 25 The Wife contended that the Husband may not actually be on the verge of bankruptcy. In particular, she submitted that the Husband’s actual means and assets were unclear as he had failed to produce information relating to,inter alia, his bank accounts and payslips from his employer.53Foot Note 53×Wife’s Supplementary Skeletal Arguments (No.2), pp 3-4.The Wife also pointed to the contents of OCBC’s letter, emphasising that OCBC had said that it would commence “legal action” and not bankruptcy proceedings.54Foot Note 54×Wife’s Supplementary Skeletal Arguments (No.2), p 5.As the evidence did not show that the Husband would “conclusively” be made a bankrupt, the Wife submitted that the Order ought not to be disturbed.55Foot Note 55×Wife’s Supplementary Skeletal Arguments (No.2), p 5.The Wife also denied that that she was no longer living in the Matrimonial home.",
        "My decision": "26 On 16 December 2019, I granted the Husband’s application to vary the Order in the following terms (“the varied Order”):56Foot Note 56×Order of Court dated 16 December 2019. (i) [The Matrimonial home] shall be sold in the open market within 3 months from the date of this order and the sale proceeds after deducing all expenses of sale be divided equally between the [Wife] and the [Husband]. Parties shall refund their respective CPF moneys withdrawn for the purchase plus accrued interest. (ii) Parties shall have joint conduct of the sale of the [Matrimonial home]. (iii) The [Wife] shall be entitled to continue to stay in the [Matrimonial home] until the date of completion of the sale but [the Wife] will cooperate in the sale by allowing parties’ appointed property agents and all potential buyers to view the [Matrimonial home] for the purpose of the sale. … 27 My decision was based on the Husband’s probable bankruptcy and its implications on the Matrimonial home. Accordingly, I did not make any finding on whether the Wife was living in the Matrimonial home.",
        "General principles": "28 Section 112(4) of the WC governs the variation of an order for the division of matrimonial assets. It provides as follows: (4) The court may, at any time it thinks fit, extend, vary, revoke or discharge any order made under this section, and may vary any term or condition upon or subject to which any such order has been made. 29 The Court of Appeal’s decision inAYM v AYL[2013] 1 SLR 924 (“AYM”) is the leading authority on the operation of s 112(4) of the WC. InAYM, the husband sought to vary a consent order which provided,inter alia, that the property was to be sold within six years and the proceeds were to be divided in the proportions of 80% to the wife and 20% to the husband if the sale price was equal to or less than $2.5 million. Should the sale price be more than $2.5 million, the proceeds would be divided in the proportions of 70% to the wife and 30% to the husband (at [2]). The basis of the husband’s application was his deteriorating financial situation. In brief, the husband’s business had begun to fail and he was suffering from a loss in income. The husband sought to vary the order such that he would receive anequalproportion of the asset. The court refused the husband’s application for a variation. 30 The court laid down several important principles to guide the exercise of discretion under s 112(4) of the WC. These include the following: (a) Although the language utilised in s 112(4) of the WC is broad, the provision has a limited operation (AYMat [22]), especially because of the consideration offinalityunderpinning s 112 of the WC (AYMat [22]). (b) Where an order has been completely implemented,ie, where the assets have been distributed to the parties, the court does not have the power to reopen the order (AYMat [22]). (c) Where an order for division has not been completely effected, the court can make necessary variations only where the order was unworkable or has become unworkable (AYMat [23]). (d) New circumstances may emerge since the order which so radically change the situation such that to implement the order as originally made would be to implement something radically different from what was originally intended. This would amount to unworkability (AYMat [25]). (e) Unworkability may also arise in the context of an order of a continuing nature (AYMat [27]). (f) A change in circumstancesinvalidating the very basis on which the court made a continuing order, amounts to a radical change in circumstances constituting unworkability (AYMat [27]). 31 On the facts ofAYM, the court held that the husband’s business failure and loss of income were not sufficient to justify a variation of an order under s 112 of the WC (at [33]). Further, it was observed that the husband was merely attempting to obtain a greater amount (as compared to what he would have received under the original consent order) as the property had become worth more. In other words, the husband was seeking to undermine the finality of the consent order (at [33]). 32 I also considered the District Court decision inCTv CU[2004] SGDC 164 (“CT”), which was cited with approval by the Court of Appeal inAYM(at [24] and [25]). InCT, the husband and wife had recorded a consent order which provided for the matrimonial flat to be sold within 18 months of the date of the order, with the amounts utilised from the parties’ CPF accounts to be refunded and the outstanding housing loan and costs of the sale to be paid (at [1]). The court observed that the basis of the consent order was that there wouldbe sufficient proceedsto pay off the outstanding housing loan, refund the parties’ CPF monies utilised by them for the purchase of the flat, and pay the costs of sale(at [13]). Unfortunately, the value of the matrimonial property had fallen such that the sale proceeds would be insufficient to pay off the housing loan, refund the parties’ CPF monies and pay for the costs of sale (at [14]). If the property was indeed sold and the CPF monies refunded first, a sum of $258,020.76 would still be required to pay the outstanding mortgage on the property (at [16]). Both the husband and the wife did not have the capacity to pay off the outstanding mortgage. In the circumstances, bankruptcy proceedings would likely have been commenced against both of them. Having regard to a number of factors, including the extent of shortfall between the sale proceeds and the outstanding loan, as well as the likelihood of the husband’s bankruptcy if the sale proceeds were used to refund the parties’ CPF moniesfirst, the court varied the consent order such that the sale proceeds would be used to pay off the outstanding housing loan in preference to the parties’ CPF monies (at [22]). In doing so, the court observed that it was not unreasonable for the husband not to want to be a bankrupt and that it would not be just and equitable to make an order of court which would doom one or both parties to bankruptcy (at [21]). 33 InTYA v TYB[2018] 3 SLR 1170, the wife sought to vary the following consent order (at [5]): a) Delayed sale of matrimonial flat at [address redacted] until the youngest child turns 21 years old. Upon sale, the proceeds of sale shall be used to repay any outstanding mortgage thereafter to repay to the parties respective CPF accounts the sum used towards the purchase of the flat including accrued interest and the balance sum after paying for the cost of the sale shall be divided equally between the parties. … 34 The wife argued that there should be an immediate sale of the property as the order had been rendered unworkable by the husband’s failure to contribute to mortgage payments. According to the wife, this failure went against the parties’ common understanding at the time they agreed to the consent order that the husband would be solely responsible for making the mortgage payments (at [14]). The husband agreed that the property should be sold immediately but disagreed on the basis on which the consent order was rendered unworkable (at [15] and [16]). 35 The court identified the basis of the order to be one where “any contribution that any party might make to the mortgage payments would be refunded before the profits of the sale are divided equally” (at [43]). However, given that the consent order only provided forCPF moneys to be refundedand, since the husband had made payments incash, the order had become purposively unworkable (ie, the order would not permit the refunding of the parties’ mortgage payments made in cash). Furthermore, the court noted that the wife was willing to move out of the flat in order to facilitate the return of her cash contributions. This undermined another aspect of the fundamental basis of the order (at [44]). The wife had also made contributions using CPF monies (at [50]). Accordingly, the court varied the earlier order such that the property was to be sold within six months, parties’ respective CPF contributions refunded and cash to be divided equally between the parties (at [51]). 36 In addition to the principles described above at [28]–[32], I was also cognisant of the observation inAYMthat “the nature of an order for the division of matrimonial assets demands that finality and certainty are of paramount importance” (at [26]). In my view, the high threshold for invoking s 112 of the WC (ie, a radical change in circumstances amounting to unworkability) strikes the appropriate balance betweenfinalityand the need to achieve ajust and equitable resultwhere the facts of the case warrant it. 37 Next, in granting any application for variation of an order under s 112 of the WC, the court must be alive to the possibility of abuse. In deciding to grant a variation application, the court should scrutinise the precise facts and circumstances to determine whether an applicant is bringing the application in good faith or simply re-opening old wounds and concluded orders. In general, any attempt to obtain a better deal in the guise of a variation application should be frowned upon. This point was emphasised inAYM, where the court cautioned against frivolous applications that would constitute an abuse of the process of court (at [23]).",
        "Analysis": "38 It was common ground between the parties that sub-orders 4 and 5 were “continuing orders”.57Foot Note 57×Wife’s Submissions dated 27 November 2019, para 34.I therefore applied the test inAYMat [27] and sought to determine whether there were new circumstances that had emerged since the Order which so radically changed the situation so that to implement it as originally made would be to implement something radically different from what was originally intended (AYMat [25]). More specifically, my analysis focussed on whether these circumstances invalidated the very basis on which the Order was made, this being an instance of radical change amounting to unworkability (AYMat [27]). 39 Examining the language of sub-orders 4 and 5, I found that their basis was to provide the Wife with a place to live in by giving her exclusive occupation and control of the Matrimonial home. Hence, the question arising in this case is whether the circumstances raised by the Husband invalidated this basis. In my judgment, there was sufficient evidence of the Husband’s probable bankruptcy which would result in the forced sale of the Matrimonial home. This would undermine the basis of sub-orders 4 and 5 and thereby constitute a radical change in circumstances amounting to unworkability as required underAYM. 40 At the outset, I was of the view that although bankruptcy proceedings had not yet commenced, there was no reason to wait for OCBC toactuallycommencebankruptcy proceedings before I exercised my discretion to vary the Order. Given the state of the Husband’s finances, it was only a matter of time before he faced bankruptcy proceedings.In my view, it was in both their interests, given their advanced age, for the matter to conclude expeditiously instead of waiting for bankruptcy to actually commence. Further, there is nothing inAYMwhich suggests that the court cannot consider a contingency, having regard to its probability in the overall circumstances of the case, in determining whether there will in all probability be a radical change in circumstances warranting variation. I also note that inCT, the court took into account the likelihood of bankruptcy in determining whether the consent order ought to be varied. 41 I now detail my reasons for finding that the Husband would probably face bankruptcy proceedings. First and foremost, OCBC knew of his half-share interest in the Matrimonial home. Even if it did not already know, it would inevitably have found out. The “legal action” that OCBC appeared to contemplate in its letter to the Husband is, in my view, wide enough to cover bankruptcy proceedings. This must be so given that he appeared not to have other substantial assets which could be used to discharge his mounting debts. I also did not regard the Husband as exaggerating the poor state of his finances. Given his advanced age, the fact that the HDB Flat was potentially the subject of compulsory acquisition and SCB’s execution of a writ of seizure and sale against items of minor value in the HDB Flat, the Husband was clearly facing extreme financial difficulty. 42 Although the Husband did not provide payslips from his employer (as pointed out by the Wife), this was not entirely unreasonable given that he was not being paid regularly by his employer (see above at [6]). All things considered, I found that there was sufficient evidence to show that the Husband did not have any substantial assets. Having regard to the circumstances set out above at [4]–[13], I was also of the view that the Husband’s application was made in good faith. Given the Husband’s lack of funds, it was clear to me that he would probably be made a bankrupt by OCBC. 43 Nonetheless, it was not bankruptcyper sewhich caused the Order to become practically unworkable. Instead, it was the likelihood of a forced sale of the Matrimonial Home. Upon the making of a bankruptcy order, the property of the bankrupt vests automatically in the Official Assignee by virtue of s 76(1)(a)(i) of the Bankruptcy Act. The Official Assignee is empowered under s 111(a) read with s 112(b) of the Bankruptcy Act to apply to court for an order of sale of the property in question. InSu Emmanuel v EmmanuelPriya Ethel Anne and another[2016] 3 SLR 1222, the property was held by the husband, the wife, and the husband’s sister as tenants-in-common. The husband’s sister, who was facing bankruptcy proceedings (although these proceedings were not before the court), applied to court pursuant to s 18(2) read with the First Schedule of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) to sell the property. The Court of Appeal observed (at [76]) that if no order of sale was granted in her favour, “it would likely be the Official Assignee who would be seeking an order for the sale … in order to meet the claims of [her] creditors”. Similarly, in my judgment, upon the Husband’s bankruptcy, the Official Assignee would likely seek and obtain an order of sale of the Matrimonial home. 44 The order of sale of the Matrimonial home would undermine or invalidate the very basis of the Order, which was to provide the Wife with a home to live. This would constitute a radical change in circumstances amounting to unworkability. 45 In the alternative, even ifbankruptcy per sedid not ensue, OCBC would likely be entitled to obtain judgment against the Husband and seek an execution of its judgment debt against his half-share of the Matrimonial home, particularly as he did not have any other substantial assets. Similarly, as in the case of bankruptcy (see above at [43]), such action would undermine the basis of the Order. This would equally be a radical change in circumstances resulting in unworkability. 46 Another important consideration that I bore in mind was that the Husband was not seeking to vary the Order to have a second bite of the cherry. Unlike the applicant inAYM, the Husband was not seeking to increase the size of his existing share of the Matrimonial home. In essence, this was an application to facilitate a voluntary sale of the Matrimonial home on the open market before the consequences of the Husband’s probable bankruptcy began to bite. 47 In arriving at my decision, I carefully considered matters from the Wife’s perspective. I appreciated that she has been living in the Matrimonial home since 1994 and that the sale would inevitably cause her distress. Nonetheless, I paid due regard to the fact that the value of the Matrimonial home had risen considerably from the time of its purchase. It is now valued at between $5 to $6 million.58Foot Note 58×Husband’s Affidavit dated 31 July 2019 at para 10.The Matrimonial Home has also been fully paid for.59Foot Note 59×Wife’s Affidavit dated 29 October 2019, para 10(b).There will be sufficient funds from the sale of the Matrimonial home for the Wife to buy another home to live. The Matrimonial home will fetch a higher price in the event of a voluntary sale. The sale proceeds could be used to give effect to the basis of the Order, which was to provide the Wife with a roof over her head. In this case, the Husband has fallen into financial hardship. Unfortunately, for both parties, bankruptcy was the probable outcome which would likely result in the forced sale of the Matrimonial home. Finally, I note that both the Husband and the Wife are already in their 70s. Life is finite and fragile. Having regard to all of these circumstances, it was in the interests of both parties for the sale to take place sooner rather than later.",
        "Conclusion": "48 For the above reasons, I allowed the Husband’s application for variation.   Dedar Singh GillJudicial Commissioner Liaw Jin Poh (Tan Lee & Choo) for the plaintiff;Seenivasan Lalita and Tay Min Hui (Virginia Quek Lalita & Partners) for the defendant."
    }
}