{
    "case_title": "Lim Hong Liang vPublic Prosecutor",
    "ncitation": "[2020] SGHC 175",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The Applicant sought to have a statement bought to the Court’s attention and consideration in his appeal against conviction and sentence on a charge of conspiracy to voluntarily cause grievous hurt by means of an instrument for stabbing or cutting, contrary to s 326 read with s 109 of the Penal Code (Cap 224, 2008 Rev Ed) (the “Appeal”).  The Appeal had originally been heard on 20 January 2020 with judgment reserved, but before judgment was given, the Applicant sought to make further arguments in light of the decision of the Court of Appeal inMuhammadNabill bin Mohd Fuad v Public Prosecutor[2020] SGCA 25 (“Nabill”).  The matter was thus fixed for such further arguments; subsequently, the present application was filed.",
        "Background": "2 The Applicant was charged with engaging in a conspiracy with several others to voluntarily cause grievous hurt to one Joshua Koh Kian Young; on 30 April 2016 in the early hours of the morning, one of the conspirators used a penknife to slash Mr Koh, causing lacerations and the permanent disfiguration of his face.  After a trial in the District Court, the Applicant was convicted on 2 April 2019 and sentenced to six years’ imprisonment. 3 An issue that arose at the Appeal was the first instance court having declined to order a statement which had been given by one Edwin or “San Mao”, who was not a witness at trial, to be given to the Defence. One of the conspirators, Lim De Mai Ron, had said in his statement that this Edwin would support his testimony that the Applicant was involved in the conspiracy to attack the victim. 4 The trial judge refused to order the production of the statement, but made, according to the Applicant, observations that were adverse to the Applicant 5 At the hearing of the Appeal, the Prosecution resisted the adducing of Edwin’s statement, arguing that it was likely that the statement implicated the Applicant, and would not have led to a real line of inquiry for the defence to pursue,i.e.that it did not meet the criteria for disclosure established inMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205 (“Kadar”). It was also argued that it was open to the Defence to have called this Edwin, as he had been offered to them as a witness.  It was further said that the District Judge was correct in not drawing any adverse inference against the Prosecution. 6 As it was, this Court reserved judgment on the Appeal. However, after arguments had been heard but before this Court gave judgment, the Court of Appeal issued its decision inNabill. Leave to make further arguments in the Appeal was sought by the Applicant. Such leave was granted, with directions then given for sequential filing of submissions.  In April 2020, the Prosecution concluded and communicated that Edwin’s statement was disclosable under the disclosure regime inNabill, and ought to have been disclosed under itsKadardisclosure obligations. 7 The present application was filed as the parties have disagreed on whether the statement can be showed to the Court, with the Prosecution arguing that the evidential requirements set out in the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) should be met first.",
        "The Application": "8 The Applicant argued that if breach ofKadardisclosure obligations occurs, such breach could amount to an irregularity rendering the conviction unsafe, citing bothKadarand various English authorities. There was no need to make an application to adduce further evidence, as all that needs to be done is to bring the statement and error to the Court’s attention. The contents of the statement would need to be viewed to determine the extent of the breach of theKadarandNabillobligations. 9 It was further argued that the failure to disclose the statement was deliberate and egregious, amounting to a material irregularity that rendered the conviction unsafe. Further such material irregularities included the District Judge’s error in failing to order the disclosure of Edwin’s statement, as well as his failure to draw an adverse inference against the Prosecution for not calling the maker of the statement as a witness, and instead making an adverse finding against the Applicant. 10 Costs were sought against the prosecution under s 356(2) of the CPC, as the refusal to give the statement was alleged to have been frivolous and vexatious conduct.",
        "The Prosecution’s Case": "11 The Prosecution accepts that there had been a breach of its obligations underKadarandNabill, and that the District Judge erred in concluding that the statement was likely to implicate the Applicant and was not liable to be disclosed underKadar. 12 The Prosecution argues that the statement cannot be used as evidence as it is inadmissible under s 259(1) of the CPC.  Such rules on admissibility apply even in the context of the disclosure obligations at common law, as was recognised inKadaritself at [120]. If, however, the statement is not relied upon as evidence, then it is not necessary for the Court to have sight of the statement, as inadmissible material should not be placed before the Court. 13 Insofar as the Applicant seeks to have the Court examine the statement to conclude that his conviction was unsafe and that there has been a failure of justice, the evidential impact of the undisclosed statement is clear. But, if the statement’s contents are to be relied upon for their truth or falsity, the statement should be properly adduced. The Prosecution intends to argue in the Appeal proper why the conviction should be upheld despite the District Judge’s error in finding that the statement would be likely to inculpate the Applicant. 14 The Prosecution denied that there was any deliberate breach of its disclosure obligations; rather the prosecutors at trial had made a genuine error in assessing that the statement was neutral, and had been of the view that it was open to the Applicant to have called the maker of the statement to give evidence. 15 The Prosecution also strongly resisted the application for costs to be ordered against it; its actions were not vexatious and had been taken on a principled basis.",
        "The Decision": "16 I am satisfied that insofar as the statement is to be used for indicating a possible breach of disclosure obligations and the consequences that should flow from such breach, it should be placed before this Court; however, as the law stands, the statement cannot be used at this time as evidence of the truth of its contents.  To do so, the Defence would have to apply to have the statement admitted.",
        "The Analysis": "17 As the Prosecution has accepted that the statement should have been disclosed, the question that remains is the effect of its earlier non-disclosure.",
        "Consequences of breach of disclosure obligations": "18 The consequences of breach of disclosure obligations have been laid out by the Court of Appeal inKadar, Nabill, andPublic Prosecutor v Wee Teong Boo and another appeal and another matter[2020] SGCA 56 (“WeeTeong Boo”). 19 The Court of Appeal inKadarobserved at [120] that: In our view, there is no reason why a failure by the Prosecution to discharge its duty of disclosure in a timely manner should not cause a conviction to be overturned if such an irregularity can be considered to be a material irregularity that occasions a failure of justice, or, put in another way, renders the conviction unsafe … not all non-disclosures will be attributable to fault on the part of the Prosecution (or a lack ofbona fides); nevertheless, as pointed out inLee Ming Tee, where such non-disclosures result in a conviction being unsafe the result will still be the overturning of that conviction… In considering whether to order a retrial, the following passage fromBehChai Hockshould be noted: When exercising its discretion whether to order a retrial, the court must have regard to all the circumstances of the case. The court must also have regard to two competing principles. One is that persons who are guilty of crimes should be brought to justice and should not be allowed to escape scot-free merely because of some technical blunder by the trial judge in the course of the trial. The countervailing principle is one of fairness to the accused person. The Prosecution has the burden of proving the case against the accused person; if the Prosecution has failed to do so once, it should not ordinarily get a second chance to make good the deficiencies of its case. These principles are summarised inCheeChiew Heong v PP[1981] 2 MLJ 287. [References omitted] Thus, a failure to disclose could lead to the conviction being overturned if such failure amounted to a material irregularity occasioning a failure of justice or rendering the conviction unsafe:Kadarat [120]. The alternative outcome would be the ordering of a retrial, though the Court would have to weigh the circumstances of the case, as well as on the one hand, the need to ensure justice by not allowing those guilty to escape by way of a technicality, and on the other, the need to ensure fairness to the accused:Kadar,BehChai Hock v Public Prosecutor[1996] 3 SLR(R) 112. 20 For the moment, however, the Court need not determine which of these consequences, if any, are to follow. That issue will be determined at the hearing of further arguments in the Appeal proper. What is before the Court is whether the statement should be seen by the Court, and thus effectively whether it can be used in those arguments without being formally admitted. 21 The Court of Appeal’s remarks inKadaras cited above appear to contemplate that non-disclosure could constitute a material irregularity occasioning a failure of justice and/or that it could render the conviction unsafe. In determining whether the conviction is safe, the Court would need to consider all relevant and admissible material, including new evidence brought on appeal, which is at least in part why the Court of Appeal underlined that the usual rules and procedures governing the adducing of such evidence would be applicable. 22 Subsequently, inNabill, it was stated by the Court of Appeal that the failure to call specific persons as witnesses and to disclose their statements could lead to an adverse inference against the Prosecution.  The Applicant did not, however, rest his present application onNabill, and focused instead on the breach ofKadardisclosure obligations. Regardless, the serious consequences of non-disclosure of relevant material were reiterated inWeeTeong Boo, and should be borne in mind. 23 Essentially, then, there are three main potential consequences of a failure to disclose. The first potential consequence of non-disclosure: rendering the conviction unsafe because of misconduct 24 The first potential consequence of non-disclosure is a finding that there has been non-disclosure of such a degree that the conviction is rendered unsafe. In presenting its case, the Defence may rely on the circumstances surrounding the non-disclosure to indicate misconduct or suppression such as to cast doubt on the integrity of the prosecution process and on the evidence presented below which led to the challenged conviction. On this approach, the question of the admissibility of the undisclosed evidence does not always need to come into play. Specifically: (a) If the Defence is relying on inferences from the undisclosed evidence to show that the offence was not committed by the Accused, that would be relying on the undisclosed evidence as evidence as to the commission of the offence, and admissibility must be made out. (b) But, if the Defence is not relying on such inferences from the undisclosed evidence, and only instead on the mere fact that it was undisclosed, to show an error or misconduct by the Prosecution, then the inadmissibility or otherwise of that piece of undisclosed evidence is not material and need not be addressed. The second potential consequence: that the Prosecution’s case was not made out beyond a reasonable doubt 25 The second possible consequence is that the non-disclosed evidence, upon being admitted, shows that the Prosecution’s case was not in fact made out beyond a reasonable doubt. It is in respect of this line of argument that the criteria outlined inLadd v Marshall[1954] 1 WLR 1489 (“Ladd v Marshall”)and the rules on admissibility of evidence would come into play in relation to the non-disclosed evidence. 26 Insofar as the Defence seeks to use the undisclosed evidence as evidence showing that the Prosecution’s case was not made out beyond a reasonable doubt, that would require admissibility to be established. I must say that I do have concerns about this conclusion:  there may be an argument made that where material evidence is not disclosed, the other party should not be hampered byLadd v Marshallin adducing it on appeal, and that questions of admissibility should not bar the Court from looking at everything as a whole in concluding whether a conviction is safe or otherwise.  But, that argument is not open to me given the passages cited fromKadarat [120]. 27 The bar against admissibility relied upon by the Prosecution in the present case is s 259 (1) of the CPC, which reads: Any statement made by a person other than the accused in the course of any investigation by any law enforcement agency is inadmissible in evidence, except here the statement – (a) is admitted under s 147 of the Evidence Act (Cap 97); (b) is used for the purpose of impeaching his credit in the manner provided in section 157 of the Evidence Act; (c) is made admissible as evidence in any criminal proceeding by virtue of any other provisions in this Code or the Evidence Act or any other written law; (d) is made in the course of an identification parade; or (e) falls within section 32(1)(a) of the Evidence Act. All of these provisions are targeted at the use of the contents of the statement, rather than the fact that the statement was given. This is also reinforced by s 259(2) of the CPC, which allows the statement to be used as evidence when the maker is charged with an offence relating to the making or contents of the statement. That said, even as regards an offence relating to the making of the statement, what matters in such contexts is the truth or falsity of the contents. The third potential consequence: an adverse inference 28 The other possibility foreshadowed byNabillandWee Teong Boois that an adverse inference may be sought, in this case for the failure of the Prosecution to call Edwin as a witness.  In assessing whether such an inference is to be drawn, the Court will need to look at a number of factors as identified inNabill. What matters for the present discussion is that in making this assessment, it may be that the Court would not need to look at the withheld statement for the truth of its contents; rather, the Court may only need to determine whether in the circumstances, looking at the document without judging the veracity of its contents, the failure to call the maker of the statement may lead to an adverse inference.  It may be appropriate to look at the document without treating it as evidence of the contents, since the inquiry is as to whether the witness should have been called by the Prosecution, and the reasons which may explain his not having been called.  The role of the contents of the statement will vary from case to case, and whether an inference should be drawn will also vary.",
        "Determination": "29 In the present case, it sufficed for the motion to be allowed that the Applicant seeks to convince the Court that the non-disclosure was of such a degree or nature that it rendered the conviction unsafe, and/or that an adverse inference should be drawn for earlier non-disclosure. However, no reliance can be placed on the truth of the contents as such since the statement cannot, at present, be admitted.  If the Applicant does in fact seek to use the statement as evidence, the appropriate application will have to be made.",
        "Fulfilling the Duty to Disclose": "30 It must be reiterated that if there is any doubt about the potential relevance or impact of material, it should be disclosed: this has been consistently made clear by the Courts in,inter alia,Kadar,Nabill, andWeeTeong Boo. There may be various reasons why a statement is held back, some of which may be thought to go to legitimate litigation strategy.  But, as was observed inKadarat [109], prosecutors are ministers of justice, meaning that wider considerations are paramount even at the expense of obtaining a conviction. Litigation strategy must give way to those considerations. It would not in my view be appropriate to hold back the disclosure of a statement just so as to use it as a check on the oral testimony of the putative witness, with a view to either impeachment under s 147(5) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) or admission of the contents under s 147(3) of the said Act.  Such a motivation potentially infects the proper assessment and discharge of the duty stipulated byKadar, which embodies the highest obligations owed by prosecutors: the fair conduct of prosecutions without a view to conviction by any means. The proper ambit and use of s 147 of the EA has been noted by the Court of Appeal  as an issue to be canvassed more fully in an appropriate case (see,inter alia,Nabillat [45] and [54], andKadarat [43] and [44]), but I have my doubts about its invocation in many instances, and the proper use of its sub-provisions.  Both impeachment and the use of a statement for the truth of its contents are perhaps justifiable in certain situations, but not, to my mind, as widely as previously thought. 31 For the avoidance of doubt, I should emphasise that I am not suggesting that the statement in question here was held back for possible use in impeachment.",
        "Costs": "32 The Applicant sought costs, alleging that the Prosecution had been vexatious and frivolous in resisting this application. I do not find that the circumstances call for costs to be imposed: this is a case of first impression, with the conduct of the Prosecution in this application not being unreasonable or unwarranted.",
        "Conclusion": "33 The motion is allowed, but no costs are ordered against the Prosecution.  The Applicant’s appeal has been tied to that of an appeal against sentence by a co-accused, Ong Hock Chye; the two matters may need to be separated as that other appeal should be dealt with before too long.  Directions will be given at a case management conference to determine the posture of the parties and how best the appeals should be managed going forward. Aedit AbdullahJudge Narayanan Sreenivasan SC and Partheban s/o Pandiyan (K&L Gates Straits Law LLC) for the applicant; Lee Lit Cheng and Li Yihong (Attorney-General’s Chambers) for the respondent.",
        "": ""
    }
}