{
    "case_title": "Zhang Hong En Jonathan vPrivate Trustee in Bankruptcy of Zhang Hong’En Jonathan",
    "ncitation": "[2020] SGHC 262",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 Zhang Hong En Jonathan (the “Applicant”), a bankrupt, sought the approval of the respondent, his private trustee in bankruptcy (the “Private Trustee”) to defend a third-party action filed against him. The Private Trustee initially granted his sanction, on certain conditions being met, but later rescinded that sanction, requiring further conditions to be complied with. The Applicant then filed the present application, essentially to obtain sanction to defend the third-party proceedings.",
        "Background": "2 Pursuant to a Bankruptcy Order (HC/B 1945/2018) (the “Bankruptcy Order”) made on 1 November 2018, the Applicant was made bankrupt, with monthly contributions and target contributions fixed at S$100 and S$5,200 respectively. Since the making of the Bankruptcy Order, the Applicant had attempted without success to seek gainful employment. This lack of success was primarily because of various medical and physical conditions which the Applicant suffered from. Bearing the Applicant’s ability to obtain gainful employment in mind, the monthly contributions and target contributions were determined at a lower level. 3 The third-party proceedings which the Applicant is seeking sanction to defend arise out of a suit by various persons against a company (the “Company”) and a number of other defendants who are said to be those in control of that company, for fraud and conspiracy (the “suit”). Third-party proceedings were commenced by some of the defendants in that suit against,inter alia, the Applicant, who was involved in starting the Company and was one of the directors of an associated company. 4 When the third-party notice was served on the Applicant, sanction was sought from the Private Trustee by the Applicant for him to defend the third-party proceedings. The Applicant contended that it was important that he defend those proceedings as findings in the suit could lead to criminal liability on his part. Following an exchange of correspondence about the appropriate conditions, the Private Trustee granted sanction by way of letter on 5 May 2020. However, this was revoked in June 2020, with additional conditions imposed before sanction would be granted. The Applicant argues that these additional conditions are unduly onerous and sought the reasons for their imposition from the Private Trustee. The Private Trustee refused to provide reasons. A request for the Private Trustee to reverse his decision was also turned down.",
        "The Applicant’s Submissions": "5 The Applicant’s summons sought (a) the reversal of the Private Trustee’s decision to revoke sanction for the Applicant to defend the third-party proceedings against him in the suit, and (b) that the Private Trustee be directed to sanction the defence of those proceedings on the basis of the conditions set out in the Private Trustee’s letter of 5 May 2020 when the original grant of sanction was made. 6 In his written arguments, the Applicant argued that s 43 of the Insolvency, Restructuring and Dissolution Act (No 40 of 2018) (“IRDA”) imported a judicial review standard, namely irrationality orWednesburyunreasonableness (seeAssociated Provincial Picture Houses Ltd v Wednesbury Corpn[1948] 1 KB 223), in determining the reasonableness of a private trustee in bankruptcy’s actions.  The Private Trustee had acted in an irrational and/orWednesburyunreasonable manner in revoking the sanction that had been previously granted. While the Private Trustee now referred to five factors that had allegedly been considered, it was doubtful that these factors were in fact considered in the Private Trustee’s decision. 7 Moreover, unlike the situation inSingapore TelecommunicationsLtd v Official Assignee[2001] 2 SLR(R) 525 (“Singapore Telecommunications”), the Private Trustee will not be stepping into the shoes of the Applicant in the suit. No risk thus accrues to the Private Trustee in these circumstances. 8 In oral arguments, the Applicant also referred to a number of cases from England and Australia, arguing that they applied a test similar toWednesburyunreasonableness. It was reiterated in the oral submissions by the Applicant’s counsel that the Private Trustee’s supposed reasons were contrived and an afterthought.",
        "The Private Trustee’s Submissions": "9 The Private Trustee’s primary argument was that there is an absolute bar under s 131(1)(a) of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“Bankruptcy Act”) on the bankrupt commencing, continuing, or defending legal actions. The Private Trustee cited as authority the decision inStandard Chartered Bank v Loh Chong Yong Thomas[2010] 2 SLR 569 (“Loh Chong Yong”). 10 The Private Trustee also explained that his decision to initially grant the sanction, and then to later revoke it, was justified by the circumstances. In particular, the Private Trustee indicated that he had initially granted sanction on 5 May 2020 because,inter alia, he was informed that (a) time was of the essence to prepare the Applicant’s defence, (b) the third-party proceedings in the suit were without merit and the Applicant thus had a high chance of success in his defence, (c) the Applicant’s father had undertaken to bear the Applicant’s legal costs, and (d) the Applicant’s counsel had confirmed that they would not claim their legal costs against the bankrupt estate and/or the Private Trustee. In deciding to revoke his grant of sanction, the Private Trustee considered four factors to be material in his considerations.  First, the grant of sanction would not benefit the estate. Second, there was insufficient basis to find that not allowing the defence would result in criminal liability. Third, while it was accepted that the costs of defending the suit would not be borne by the estate, the bankrupt would nonetheless need to give security to satisfy party-and-party costs. Fourth, there was also no basis given to the Private Trustee to determine the merits of the case for or against the Applicant in the suit. The case ofTan King Hiang v United Engineers (Singapore) PteLtd[2005] 3 SLR(R) 529 was cited as an example of an instance where the Official Assignee had revoked previously-granted sanction when the bankrupt failed to fulfil conditions which had been subsequently imposed. 11 Further, the Private Trustee asserts that s 131 of the Bankruptcy Act does not require him to give reasons for his determination of sanction.Loh Chong Yong,Singapore Telecommunications([7]supra), andOng Eng Kae and another v Rupesh Kumar and others[2015] SGHC 163 were cited as examples illustrating the breadth of the private trustee’s power and discretion under s 131 of the Bankruptcy Act. It was thus contended that full control and prerogative is given to the private trustee under s 131 of the Bankruptcy Act, and that the bankrupt should not be entitled to challenge that.",
        "The Decision": "12 I am satisfied that the approach to be taken is one of deference to the decision of the Private Trustee, unless the decision is so perverse that no reasonable trustee faced with the same facts would have come to the same conclusion. In calibrating what a reasonable trustee would do, one should bear in mind the need to protect the interests of the creditors and the estate, without unduly prejudicing the bankrupt. If all things are equal or if there is a realistic risk of both the interests of the creditors and of the bankrupt being prejudiced, one should prefer the interests of the creditors to those of the bankrupt.",
        "Analysis": "",
        "The Statutory Provision": "13 The starting point in determining the appropriate approach to reviewing the discretion of private trustees is the words of the legislation. InTan ChengBock v Attorney-General[2017] 2 SLR 850 (“Tan Cheng Bock”) at [43], the Court of Appeal emphasised that: … [I]n seeking to draw out the legislative purpose behind a provision, primacy should be accorded to the text of the provision and its statutory context over any extraneous material. The law enacted by Parliament is the text which Parliament has chosen in order to embody and to give effect to its purposes and objects. In line with this, the meaning and purpose of a provision should, as far as possible, be derived from the statute first, based on the provision(s) in question read in the context of the statute as a whole. This approach also coheres with the language of s 9A(1) [of the Interpretation Act], which suggests thepossibilityof the purpose or object of a statute being “expressly stated in the written law”. [Emphasis original] 14 Turning first to the IRDA, s 43 reads: Review by Court of trustee in bankruptcy’s act, omission or decision 43.–(1) The  Official Assignee, a bankrupt, any creditor of the bankrupt, or any other person, who is dissatisfied with any act, omission or decision of a trustee in bankruptcy in relation to the trustee’s administration of the bankrupt’s estate, may apply to the Court to review such act, omission or decision, and on hearing such an application the Court may – (a) confirm, reverse or modify any act or decision of the trustee; or (b) give such directions to the trustee or make such other order as the Court thinks fit. (2) A trustee in bankruptcy may apply to the Court for directions in relation to any particular matter arising under the bankruptcy. Sub-section (2) is of broad application, but is not material here. 15 Section 40 of the relevant predecessor legislation, the Bankruptcy Act, is largely worded in the same terms as s 43 of the IRDA, and reads: Review by court of trustee’s act, omission or decision 40.–(1) If the Official Assignee, a bankrupt, any of the bankrupt’s creditors or any other person is dissatisfied by any act, omission or decision of a trustee in relation to the trustee’s administration of the bankrupt’s estate, he may apply to the court to review such act, omission or decision and on hearing such an application the court may – (a) confirm, reverse or modify any act or decision of the trustee; or (b) give such directions to the trustee or make such other order as it may think fit. (2) A trustee may apply to the court for directions in relation to any particular matter arising under the bankruptcy. 16 The question of how the transitional provisions in the IRDA apply to the present application is considered below, but does not materially affect the analysis of this case. 17 The text of the legislation puts matters very broadly. In reviewing the Private Trustee’s decision, the Court can alter the decision, give directions, or make such order as it deems appropriate. What may be discerned about the legislative purpose from the plain wording of the statutory provisions is an intention to confer upon the Court broad powers and discretion. This does not say anything, though, about the approach to be taken by the courts in exercising that broad discretion. Nothing in the text of the two statutory provisions extracted above expressly imports any notion of judicial review. Nothing to my mind does so implicitly either. 18 The term ‘review’ does sometimes denote the exercise of the Court’s supervisory jurisdiction; in some contexts, that jurisdiction can refer to the control exercised by a superior court over inferior tribunals: see for example the discussion at [47] inNg Chye Huey v Public Prosecutor[2007] 2 SLR(R) 106 (“Ng Chye Huey”). As noted by the Court of Appeal, this supervisory jurisdiction traditionally found expression in practical terms through powers of judicial review: [49] ofNg Chye Huey. 19 Supervision and review of a decision may take place through various means. Just because a provision uses one or the other of such terms, or both, does not import the application of doctrines of judicial review without more. Consideration has to be given to the language of the statute and its purpose:Tan Cheng Bockfrom [42] to [45]. Where it is clear that the supervision by the Court is meant to be wide-ranging, that objective must be given due effect. The Singaporean authorities 20 The Applicant cited a District Court decision dealing with prosecution under the Bankruptcy Act, specifically for leaving the country without the Official Assignee’s permission:Public Prosecutor vS M Sukhmit Singh[2008] SGDC 197 (“Sukhmit Singh”). That decision in turn referred toChee Soon Juan v Public Prosecutor[2007] SGHC 155 (“Chee Soon Juan”), a Magistrate’s Appeal case. Neither stands as authority for the adoption of judicial review principles in the context of s 43 of the IRDA since in neither was the interpretation of that provision or its predecessor in issue. In fact, I do not think the characterisation ofChee Soon JuaninSukhmit Singhwas in fact correct: there was no discussion in the former of any form of judicial review, but only the question of whether a constitutional reference should have been made (see [3] ofChee Soon Juan). That question is a different matter altogether, and engages different principles. I should perhaps also note that I believe the decision on appeal inChee Soon Juanwas one of mine as a District Judge, and I do not recall discussing judicial review at first instance. 21 The Applicant’s arguments in favour of judicial review are thus built on what may be somewhat slender authority. I do not find that the Singapore courts have, even indirectly, invoked judicial review principles in a review of the decision of either the Official Assignee or a private trustee, whether under s 43 of the IRDA or its predecessor legislation. The point thus remains open. The Australian authorities 22 During the hearing of this application, the Applicant claimed that the Australian authorities adopt a judicial review approach in reviewing the decisions of trustees in bankruptcy. That is not correct. The Australian cases do not reflect the full panoply of the heads of judicial review and the accompanying doctrinal baggage, and instead adopt a perversity standard, following the approach adopted in England. In other words, the decision of the trustee is only disturbed if it is such that no reasonable trustee could have come to that same decision. 23 The currently applicable Australian provision governing the Australian courts’ powers in relation to the administration of a bankrupt estate is s 90-15 of Schedule 2 to the Australian Bankruptcy Act 1966 (Cth) (the “Australian Bankruptcy Act 1966”), which reads as follows: 90-15 Court may make orders in relation to estate administrations Court may make orders (1) The Court may make such orders as it thinks fit in relation to the administration of a regulated debtor’s estate. […] Matters that may be taken into account (4) Without limiting the matters which the Court may take into account when making orders, the Court may take into account: (a) whether the trustee has faithfully performed, or is faithfully performing, the trustee’s duties; and (b) whether an action or failure to act by the trustee is in compliance with this Act and the Insolvency Practice Rules; and (c) whether an action or failure to act by the trustee is in compliance with an order of the Court; and (d) whether the regulated debtor’s estate or any person has suffered, or is likely to suffer, loss or damage because of an action or failure to act by the trustee; and (e) the seriousness of the consequences of any action or failure to act by the trustee, including the effect of that action or failure to act on public confidence in registered trustees as a group. […] 24 The predecessor to s 90-15 of the Australian Bankruptcy Act 1966, the now-repealed ss 178 and 179 of the Australian Bankruptcy Act 1966, read: 178 Appeal to Court against trustee’s decision etc. (1) If the bankrupt, a creditor or any other person is affected by an act, omission or decision of the trustee, he or she may apply to the Court, and the Court may make such order in the matter as it thinks just and equitable. […] 179 Control of trustees by the Court (1) The Court may, on the application of … a creditor or the bankrupt, inquire into the conduct of a trustee in relation to a bankruptcy and may do one or both of the following: (a) …. (b) make such order as it thinks proper. The Australian cases considered below primarily refer to these since-repealed provisions. 25 InMacchia v Nilant(2001) 110 FCR 101; [2001] FCA 7 (“Macchia”),French J in the Federal Court surveyed a range of authorities on when a court would intervene in the decisions of a trustee in bankruptcy. These includedRe Peters; Ex parte Lloyd(1882) 47 LT 64, an English decision in which it was said that the requirement before a court would interfere with the trustee’s discretion was for the trustee to be acting in a way that was “so utterly unreasonable and absurd that no reasonable man could so act”. French J also consideredCummingsv Claremont Petroleum NL(1996) 185 CLR 124 at 133, a decision of the High Court of Australia stating that s 178 of the Australian Bankruptcy Act 1966 conferred a “supervisory jurisdiction over the conduct of the trustee”. However, there was nothing in that phrase, or in the rest of French J’s judgment, which indicated wholesale acceptance of a judicial review-centric approach to reviewing the decisions of trustees in bankruptcy. I note that there is discussion of both judicial and administrative functions which the Court’s supervisory jurisdiction might serve at [38] ofMacchia, but the main thrust of that paragraph’s analysis is in the last line of the paragraph: that there is wide-ranging supervision, in the interests of both creditors and bankrupts, by the Court, of trustees in bankruptcy.  I certainly see nothing in that paragraph, or in the rest of the judgment inMacchia, that imported a judicial review approach. 26In Moore v Macks[2007] FCA 10,a decision of Besanko J in the Federal Court, there was a reference at [28.1] to the supervisory role the court undertakes in the exercise of its powers under s 178 of the Australian Bankruptcy Act 1966.But again, there is nothing in that judgement that imports a judicial review approach. The only reference to the phrase “judicial review” is a brief reference at [28.1] where the Court uses the term to describe the judicial nature of the Court’s supervisory role, rather than to refer to the array of administrative law doctrines that concern judicial review. If anything, Besanko J’s reasoning pointed strongly against any incorporation of a judicial review approach to reviewing the acts of trustees since the judgment relied heavily on an assessment of the legal and commercial merits, rather than questions of procedure orvires, of the act of the trustees which was being challenged. There was no suggestion, for instance, that considerations of administrative law were imported into the jurisprudence, and the bankrupt’s bare assertion that the trustee was “biased” against him (at [47]) appeared to be a throwaway allegation which Besanko J did not view as a basis for making an order under s 178 of the Australian Bankruptcy Act 1966. 27 Then, there isYoung v Thomson(2017) 253 FCR 191; [2017] FCAFC 140, a decision of the Full Court of the Federal Court of Australia. The majority noted at [109] that the discretion conferred under s 178(1) of the Australian Bankruptcy Act 1966 is broad and must be exercised in the particular circumstances of each case.  On the facts, the majority found that the trustee had breached her duties by acting irresponsibly, with a conflict of interest and duty. The bankrupt had also argued that the trustee had denied her procedural fairness and that the principles of judicial review of administrative action applied “directly or analogously to a review of [the trustee’s] conduct as a trustee under s 178”. Noting that no authority was cited for this proposition, the majority declined to decide whether this “novel approach to the performance of the duties and functions of a trustee” was arguable or correct given their earlier findings. Instead, the majority disposed of that argument by observing that it “appeared to confuse administrative law considerations with the duty of a trustee in bankruptcy” under the applicable statutory provisions (at [145]). Flick J, in the minority, disagreed with the reasoning of the majority but not the result; he would have found grounds against the trustee simply on the broad language of s 178 which empowered the Court to “make such order as it thinks just and equitable”. As for the applicability of the principles of judicial review, Flick J expressly rejected such a contention. At [168], he observed that: […] Moreover, to impose upon a trustee in bankruptcy the additional requirement to comply with the rules of procedural fairness would also not sit comfortably with: •  the existing constraint upon the application of those rules generally to administrative decisions; or •  the constraint that judicial review is generally concerned with the exercise of “public power”. A conclusion that both a trustee in bankruptcy and a decision-maker entrusted with statutory power must (for example) both exercise their power in good faith and must not abuse their power, falls well short of a conclusion that the trustee is required to afford creditors affected by a decision an opportunity to be heard. So, too, the fact that liability may be avoided for what would otherwise be a breach by the trustee where there has been fully informed consent of a beneficiary does not carry with it the further conclusion that a trustee is otherwise obliged to afford procedural fairness to all those who may be affected by a decision made. In sum, neither the majority nor minority in this case indicated any acceptance of the application of the principles of judicial review in the context of a Court’s review of decisions by a trustee in bankruptcy. In fact, Flick J appears to flatly reject such a contention. 28 Overall, it is clear that the Australian cases referring to the Court’s supervisory jurisdiction under ss 178 and 179 of the Australian Bankruptcy Act 1966 did not in any way incorporate judicial review principles as bases for review of decisions by a trustee in bankruptcy. There is no endorsement in these Australianauthorities of theWednesburyprinciple or Australian judicial review doctrine. The present Australian position in s 90-15 of the Australian Bankruptcy Act 1966 also does not make reference to any such considerations. The English authorities 29 Just as in Singapore, there is nothing in the relevant English statutory provision which mandates the application of judicial review principles in the Court’s review of a private trustee’s decisions.  Section 303(1) of the Insolvency Act 1986 (c 45) (UK) (“IA 1986”) reads: General control of trustee by the court (1) If a bankrupt or any of his creditors or any other person is dissatisfied by any act, omission or decision of a trustee of the bankrupt’s estate, he may apply to the court; and on such an application the court may confirm, reverse or modify any act or decision of the trustee, may give him directions or may make such other order as it thinks fit. While s 303 of the IA 1986 is not exactly the same as s 131 of the Bankruptcy Act, it is sufficiently closely worded that guidance can be usefully obtained. The difference from the Bankruptcy Act lies primarily in the absence in s 303(1) of the IA 1986 of reference to a review by the Court. Instead, s 363 of the IA 1986 prescribes additional powers for the Court, which grant it general control of every bankruptcy. Section 363(3) of the IA 1986 specifically provides that the official receiver or the trustee of a bankrupt’s estate may at any time apply to the court for a direction, but does not go so far as to allow for the referral of an act for the Court’s review. Overall, however, I do not think that the differences between the two statutes are such as to create a material difference which renders the English case law altogether unhelpful. 30 The current leading authority on the application of s 303 of the IA 1986 isBramston v Haut[2013] WLR 1720 (“Bramston”), which adopts a perversity approach in reviewing a trustee in bankruptcy’s decisions.Bramstonwas followed in inMikki v Duncan[2017] 1 WLR 2907. Significantly for our present purposes,Bramstonexpressly discarded the application ofWednesburyin the control of trustees.  It is instructive to begin with the premises upon whichBramstonwas decided. Nourse LJ, inRe Edennote Ltd; Tottenham Hotspur plc and others v Ryman and another[1996] 2 BCLC 389, a case which was relied on and adopted inBramstonand which dealt with the control of liquidators, found it confusing to introduce language concerned with the control of administrative action (at 394): I sympathise with Mr Rayner James’s submissions to the extent that it is unnecessary, rather it may be confusing, to introduce into the court’s control of the acts and decisions of liquidators the language of its control of administrative action. In the latter case the court is usually concerned with supervision of public servants performing statutory functions; in the former with the supervision of persons who must, in most of what they do, act as prudent businessmen. In general there seems to be something unrealistic in judging the propriety of the acts and decisions of a businessman by asking whether he took into account something he ought not to have taken into account or failed to take into account something he ought to have taken into account. 31 In adopting a perversity standard, the Court of Appeal inBramstonnoted at 1737 that: The court is properly reluctant to interfere with the day to day administration by a trustee of the bankruptcy estate because, as Harman J explained inre A Debtor; Ex p The Debtor v Dodwell[1949] Ch 236,241, administration would be impossible if the trustee had to answer at every step to the bankrupt for the exercise of his powers and discretions in the management of and realisation of the property. So also in Inre Edennote Ltd[1996] 2 BCLC 389, 394 this court explained that, fraud and bad faith apart, the court will only interfere with the act of a liquidator if he has done something so utterly unreasonable and absurd that no reasonable man would have done it. Nourse LJ, with whom Millett LJ agreed, questioned whether it was helpful to introduce aWednesburytest … The Court inBramstonthen, at 1738, endorsed the approach inOsborne v Cole[1999] BPIR 251 (“Osborne”) at 255, that: It follows that it can only be right for the court to interfere with the decision the official receiver has taken if it can be shown that he has acted in bad faith or so perversely that no trustee properly advised or properly instructing himself could so have acted, alternatively if he has acted fraudulently or in a manner so unreasonable and absurd that no reasonable person would have acted in that way. 32 The Applicant, at one point in oral arguments before me, contended that theOsborneapproach is essentially a judicial review approach, similar toWednesburyunreasonableness. But, as observed inBramston, the perversity test is quite different both in genesis and effect (see [39] below). While there were some older English cases which did in fact apply judicial review principles, the English authorities have clearly moved away from that position. The English approach, abandoning any adoption of judicial review principles altogether, has much to commend it. Section 131 of the Bankruptcy Act 33 The Private Trustee argues that there is an absolute bar arising out of s 131 of the Bankruptcy Act, which confers upon him full control to decide whether the bankrupt should be allowed to take steps to maintain or engage in litigation. Thus, according to the Private Trustee, he is given wide-ranging powers and discretion to govern any legal action the bankrupt may be involved in. 34 The difficulty with the Private Trustee’s argument is that it does not give any effect to the Court’s powers under s 43 of the IRDA (or, for that matter, s 40 of the Bankruptcy Act). The effect of the Private Trustee’s approach would thus be that the Court will not have very much room to exercise its broad powers of review. That would defeat the plain text of the legislation, and even on a purposive reading, nothing that relates to the purpose of the statute requires that such an approach be adopted. The broad powers conferred for review by the Court are incompatible with the Private Trustee wielding such a broad, untrammelled remit. 35 In addition, I am not persuaded that s 131 of the Bankruptcy Act (and its IRDA equivalent), as well as the applicable case law, stand for any proposition in respect of the Private Trustee’s powers. The provision simply bars proceedings by the bankrupt without the Private Trustee’s prior sanction, and does not purport to delineate the Private Trustee’s discretion. The cases cited, particularly, the Court of Appeal decision inLoh Chong Yong([9]supra), do not address the issue either.",
        "The Proper Approach": "36 The legislation does not expressly or implicitly require the use of judicial review principles in determining the Court’s review of a trustee in bankruptcy’s decisions, and there is no reason to do so. Nothing in the relevant sections echoes or is even referable to a judicial review test.  If the legislature had indeed intended such an approach, it could readily and directly have stipulated it. 37 Critically, however, the whole doctrine of judicial review serves a different set of objectives: the court is primarily concerned with procedural propriety and will not typically delve into the merits of the decision. Singapore’s adoption of judicial review principles from English cases has generally been done in the context of the separation of powers enshrined in the Constitution, and due restraint has to be exercised to ensure that the judiciary does not encroach too readily into areas that are perhaps more appropriately dealt with by the legislature and the executive. Of course, this is not the appropriate point to extensively set out the jurisprudential nature of judicial review, but what is clear is that judicial review as a doctrine is founded upon several concerns and nuances which do not necessarily or typically apply to trustees in a bankruptcy situation. 38 In bankruptcy, it is inappropriate to impose primarily procedural rules without also looking at the substance of the decision if the circumstances demand it. Further, as noted inBramston([30]supra), it is not beneficial to ask whether a trustee took into account things he should not have, or failed to take into account things he should have. TheWednesburyprinciple is concerned primarily with process, while the perversity standard looks at the actual merits of the case, but only justifies interference if no reasonable person could have arrived at the same decision. 39 The two different approaches may seem to have a superficial resemblance because there is consideration of the reasonableness of factors in the decision-making matrix, but the perversity standard is significantly different fromWednesburyunreasonableness in that: (a) It looks to the merits and substance of the decision; and (b) It gives additional and substantial weight, deliberately, to the determination by the trustee. There is deference simply because the trustee must be largely left to get on with the job of administering the estate, exercising commercial and business judgment, and cannot be made to constantly look over his shoulder. (c) Further, as alluded to above, review of the trustee’s decisions does not entail considerations of scrutinising the exercise of executive (or legislative) power, unlike in the context of judicial review. 40 The Applicant has in effect conceded that the wholesale importation of judicial review principles may not be entirely appropriate by his arguing, essentially, that the court should look at both the procedural aspects as well as the substance of an impugned decision by the trustee. I caveat at this point for avoidance of doubt that it is not the case that judicial review principles only or exclusively deal with questions of procedure, nor is it my determination that judicial review can never deal with the substance of a decision. However, applying the entirecorpusof judicial review principles into the bankruptcy context would unduly and improperly focus the attention of the Court’s powers of review on questions of procedure, when the Court should instead have the power to examine the substance of a private trustee in bankruptcy’s decisions. 41 The primary concern of the Court in the context of reviewing a private trustee’s decisions is to balance (a) the need to ensure fairness in the process and result from the perspective of the bankrupt, (b) the interests of the creditors, and (c) the need to allow the private trustees to get on with their jobs, and to discourage frivolous applications which undermine their work. Thus, great deference will be given to private trustees in the discharge of their functions and their decision as a matter of business and commercial judgment, particularly where in their view a particular course of action will harm the creditors’ interests in the estate. 42 On one hand, the legislation gives broad powers to the Court to disturb the private trustee’s decision and substitute its own. This goes to the substance of the decision reached. The court is not merely concerned with questions of procedural propriety, and will examine the likely outcomes in making a holistic assessment. On the other hand, Parliament has chosen to give the private trustee the control and management of the estate, including the approval or otherwise of the commencement and maintenance of litigation. Private trustees are specifically regulated under ss 42 to 46 of the IRDA (ss 39 to 43 of the Bankruptcy Act), and I accept the view expressed inBramston([30]supra) that the private trustee must be allowed to do his or her job, and exercise business and commercial judgment without constantly looking over the shoulder to wonder if some complaint will be made. 43 The perversity standard adopted in England initially (and followed in the Australian cases) balances the abovementioned considerations adequately, and I respectfully adopt it. 44 The one difficulty I have with the perversity standard is that it may be prone to the perception that it postulates the consideration of the issue by a notional “reasonable” private trustee.  It is perhaps better to describe the process as one of assessing the general commercial and business judgment of the private trustee in furthering the protection of the estate for the benefit of the creditors, and without causing unnecessary prejudice to the bankrupt. Where the decision reached as a result of such general commercial and business judgment is not indefensible, bearing in mind the varying considerations to balance outlined at [41] above, the Court is unlikely to intervene. Further, where an action or decision may be taken without causing harm to the estate or the creditors, and correspondingly, harm might result to the bankrupt if that decision is not approved, then the general inclination of the Court would be to approve such a decision. Application to the Facts 45 Applying the reasoning above to the instant facts, two particular issues stood out as being important to consider: (a) First, what was the impact on the Applicant as contrasted with the impact, if any, on the estate in bankruptcy; (b) Second, in a bankruptcy situation, the primary concern is to ensure that the estate and creditors are not prejudiced, but the effect on the bankrupt himself may also be weighed and assessed. 46 Applying the perversity standard here, what must be asked is if no other private trustee would have done what the Private Trustee has done. In other words, was the Private Trustee’s decision such an untenable balance between the impact on the Applicant and the considerations of the creditors that no other private trustee would have come to a similar decision? In answering this question, reference must be had to the reasons underpinning the Private Trustee’s decision. I note for completeness that the Applicant has alleged that the Private Trustee did not in fact consider the reasons it purported to have, but that those reasons were insteadex post factorationalisations of its decision. I was of the view that there was insufficient evidence before me to sustain that contention, and that in any event, what mattered was whether or not the Private Trustee’s acts were defensible in an objective sense. Put another way, the subjective inclinations of a private trustee will be relevant in the sense of the private trustee not having actually held those views at the material time only if those went towards thebona fidesof the private trustee. 47 The Applicant took issue with the Private Trustee’s revocation of sanction on a number of grounds.  As indicated above, it was argued that it was doubtful that the Private Trustee had actually considered the five factors raised when he was making his decision to revoke sanction. The first reason, that there was detriment to the estate, was not properly considered, as the Private Trustee was really only concerned that there was no benefit to the estate. There was no proper consideration of whether the Applicant might be prejudiced through criminal liability being imposed on him. The third-party proceedings involved questions as to whether or not the Applicant had,inter alia, engaged in unlawful and/or wrongful dissipation and/or misappropriation of moneys, and the Applicant thus argued that his interests were not properly considered when the Private Trustee determined the potential benefits and detriments arising from granting sanction. It was also said that the Private Trustee had unfounded concerns about party-and-party costs, and that these concerns were unfounded given that the other defendants in the third-party proceedings (a) have not sought any contribution, indemnity, relief or remedy against the Applicant, and (b) would require the leave of Court and/or the permission of the Official Assignee under ss 327 and 345 of the IRDA in order to proceed against the Applicant in respect of any debt provable in bankruptcy. Finally, the merits and prospect of success by the Applicant in the third-party proceedings were said to be immaterial and irrelevant to the decision on whether or not sanction ought to be granted. 48 The Trustee responds that there were good reasons for him to be concerned about the risks and to protect the estate. I do note that there is no legal duty to give reasons, at least until the point of the matter being brought up for scrutiny by the Court. There is no duty imposed under the Bankruptcy Act or the IRDA for the private trustee to give reasons for his decisions, and none is imposed by case law. It would generally be conducive to good working relations for reasons to be given, but failing to do so would not in and of itself be a breach of the private trustee’s obligations. 49 Examining the facts holistically, I am of the view that the decision of the Private Trustee in this case should not be disturbed: (a) The Applicant argued that he would be exposed to potential criminal liability were he to not be permitted to defend the third-party action. I am doubtful that criminal liability would necessarily or even probably follow, and the standard of proof required in civil cases is not sufficient for, and does notipso factoindicate a likely criminal conviction. Rather, the fact of the matter is that his absence in the civil proceedings would be clearly because of the bankruptcy and failure to obtain sanction to defend. For the Applicant to succeed in his argument that criminal liability is a real and genuine prospect on the instant facts, something more would need to be established. (b) In any event, the Private Trustee should weigh the consequences that participation in the third-party proceedings may bring. These consequences include potential liability, not merely for the Applicant but also for himself, as well as adverse orders as to costs which may be made, and which may detract from the pool of assets in the bankruptcy estate. While the increase in the Applicant’s liabilities was deemed by the Private Trustee to be unlikely to meaningfully dilute the dividend distribution to the ordinary creditors of the Applicant, this was only the case because there was already a great likelihood that the body of ordinary creditors would not receive substantial dividends from the bankruptcy administration. In fact, the estimated amount of dividends available to the ordinary creditors is only S$1,388.25. In the circumstances, the Private Trustee was not convinced that any benefit would accrue to either the bankruptcy estate, or to the creditors. (c) Further, I note that the Private Trustee in this case is not flatly refusing to even consider the possibility of granting sanction to the Applicant to defend the third-party proceedings. Rather, he has imposed certain requirements, including,inter alia, a security deposit, before sanction will be granted. The amount sought is S$20,000 per day of trial, which coheres with the starting-point daily tariff in Appendix G of the Supreme Court Practice Directions under Part III, Part A, paragraph (i) for complex corporate/company law disputes. While I do accept that it may be unlikely that the Applicant would be called upon to bear the entirety of the daily tariff for the full duration of the trial, I note that the figure of the deposit sought by the Private Trustee, namely S$20,000 in cash per day of trial, is not altogether without basis. In fact, the Private Trustee had indicated that he may be able to consider an alternative amount of the security deposit, even if he might not be able to depart greatly from the suggested sum. It does not appear that a counter-proposal for an alternative sum was made. (d) In addition, there is nothing on the facts which would appear to preclude the Private Trustee from changing his mind and revoking sanction. There does not appear to have been detrimental reliance engendering loss placed on the revocation, nor can it be said that the Private Trustee is in some way barred from taking a different position. Put another way, there is nothing intrinsic about the Private Trustee revoking the grant of sanction which, on the facts, strikes me as being so improper or unreasonable that no Private Trustee would have made that decision. 50 I note for completeness that it was not contested that the law firm which the Applicant sought to instruct to defend the third-party proceedings would not look to the estate for its costs. Further, the Applicant’s father, Mr Teo Chiau Ming, has provided an undertaking to be responsible for the Applicant’s legal costs incurred in the third-party proceedings. However, in an email dated 28 April 2020, it was indicated to the Private Trustee by the law firm which the Applicant sought to instruct that the Applicant’s family is not in a financial position to provide a cash deposit. In fact, in a subsequent letter dated 19 June 2020, it was indicated that the Applicant’s father is impecunious and unable to provide any cash deposit. Thus, the Private Trustee formed the view that there was a real risk that the Applicant’s father, Mr Teo, would be unable to satisfy potential adverse cost orders. His inability to satisfy those cost orders would potentially expose the Private Trustee and the bankruptcy estate to liability for the payment of those cost orders. 51 Given the totality of the circumstances, I could not see anything on the facts that could be said to be so unreasonable that no trustee would have made the decision the Private Trustee had made. 52 Ultimately, there will be a spectrum of discretion, exercisable by the trustee, which the Court generally will not go behind unless it is so absurd or biased that intervention is called for.  The trustee’s primary consideration will be preservation of the estate, and the benefit of the (existing) creditors. In this regard, the Applicant argues that the additional burden of any loss from unsuccessfully defending would be marginal. That does not overcome the countervailing consideration that the existing creditors are entitled to expect that whatever small fraction they may get is not eroded further by any claim for costs or contributions that is allowed in the third-party suit. As for the third-party proceedings, the trustee is entitled to assess the likelihood or otherwise of success, and determine what is the better course of action – to defend or to not participate altogether. 53 The Applicant may feel that he has lost autonomy by virtue of the broad powers granted to the Private Trustee. But that is the very point of the trusteeship – a bankrupt does not have control of his affairs, and this loss of control may extend to matters including litigation, even where there are other consequences, including possible loss of reputation. The Private Trustee is entitled to make the call, bearing in mind the possible adverse effects on the estate and the interests of the creditors. 54 In this regard, private trustees are generally entitled to ask for security or an indemnity as to costs, should the bankrupt lose or be unsuccessful in the proceedings they wish to participate in. Further, the measure of costs payable may be fixed by reference to various measures, including the likely award under Appendix G to the Supreme Court Practice Directions, which is what the Private Trustee appears to have done. 55 Nothing in the present Private Trustee’s considerations can be seen as being unreasonable or even particularly objectionable. It really is only if it can be shown that the trustee’s decision was one that would not have been reached by any other trustee acting reasonably, that the bankrupt would succeed.  Reasonable actions in this context would generally cover actions with the objective of giving primacy to the protection of the estate, and in ascertaining the probabilities of various results eventuating, trustees would be expected to exercise caution and wariness in being engaged in anything that would add to the burden of the estate, even if the estate is already very far into the red. In other words, a reasonable trustee would include a cautious trustee.",
        "Transitional Provisions": "56 I make two final observations on this case. 57 First, nothing turns on whether the relevant sections of the IRDA or Bankruptcy Act apply to the present case given that the relevant sections are, for all intents and purposes, identical. However, since parties did make some limited submissions on this issue, I briefly set out my views below. 58 Section 525 of the IRDA disapplies its parts 3, 13 to 22, and s 450 to various matters governed under the Bankruptcy Act “before the appointed day”. For present purposes, the most relevant limb under s 525 is subsection 1(b), which provides that “any bankruptcy application” made before the appointed day will have the abovementioned segments of the IRDA disapplied. The phrase “bankruptcy application” is not defined, but appears primarily in Part 16, under the heading “Proceedings in Bankruptcy”. Part 16 concerns applications to make persons bankrupt. 59 It would seem therefore that the transitional provisions do not disapply the IRDA to review applications under s 43, and therefore that proceedings on or after the appointed day (of 30July 2020) seeking to review trustees’ decisions in relation to bankruptcies ordered before that day should be made under s 43 of the IRDA, rather than s 40(1) of the repealed Bankruptcy Act.",
        "Revocation": "60 Second, I pause to note that it is within the powers of a private trustee to revoke a prior determination he has made if further consideration does lead to a need to revisit the issue. Again, the Court will generally defer to the business judgment of the private trustee, but if steps had been taken by the bankrupt in the meantime in reliance of the earlier decision, the Court will then have to weigh any prejudice suffered by the bankrupt in any steps taken after the initial decision(s) conveyed by the private trustee and before the revocation. Specifically, the Court will have to consider whether the prejudice engendered will outweigh what detriment may be suffered by the estate or creditors. Further considerations which may be relevant in this regard include, but are not limited to, (a) the duration between the earlier determination and the later revocation, (b) whether or not the earlier determination was of an unqualified and unequivocal nature, and (c) whether the prejudice caused to the bankrupt extends to any third parties. As it was, there was no such detriment here, and the question should perhaps be explored more fully on another occasion.",
        "Conclusion": "61 For these reasons therefore, the application is dismissed.  The Court will give directions on the determination of costs. Aedit AbdullahJudge Lee Ee Yang, Eoon Zizhen, Benedict (Wen Zizhen) and Chin Yen Bing, Arthur (Covenant Chambers LLC) for the applicant; Koh Yeong Hung Sasha (Adsan Law LLC) for the respondent.",
        "": ""
    }
}