{
    "case_title": "Easybook.com Pte Ltd vOWW Investments III Ltd",
    "ncitation": "[2020] SGHC 259",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 In this Registrar’s Appeal, the plaintiff (the appellant in this appeal) sought to set aside the decision of the Assistant Registrar (“the AR”) striking out and dismissing its claim against the defendant (the respondent in this appeal). The underlying claim relates to various agreements under which Redeemable Convertible Preference Shares (“RCPS”) were issued by the plaintiff to the defendant. The plaintiff claimed that the defendant was not entitled to exercise its rights under the said agreements to redeem the RCPS.  The central question in the appeal was whether it was plain and obvious that the plaintiff’s claim was unsustainable in law or fact. 2 After hearing the parties’ submissions, I dismissed the appeal and delivered some brief oral remarks in doing so. The plaintiff has since appealed against my decision. I now set out my grounds of decision in full.",
        "Background facts": "3 The plaintiff is in the business of,inter alia, ticketing agencies. The defendant is a venture capital fund. Both companies are incorporated in Singapore.1Foot Note 1×Statement of Claim at para 1; Defence (Amendment No. 1) at para 3 4 The plaintiff and the defendant entered into three agreements: the Subscription and Shareholders Agreement dated 30 April 2014 (the “2014 SSHA”), the Convertible Loan Agreement dated 21 April 2015 (the “2015 CLA”) and the Subscription and Shareholders Agreement dated 26 January 2016 (the “2016 SSHA”). The terms of the 2014 SSHA and the 2016 SSHA are substantially similar and where appropriate, they will be referred to collectively hereinafter as “the SSHAs”. Pursuant to the 2014 SSHA, the plaintiff issued 29,623 RCPS to the defendant and pursuant to the 2016 SSHA, the plaintiff issued 48,531 RCPS to the defendant. Pursuant to the 2015 CLA, the defendant extended a convertible loan of US$500,000 to the plaintiff. The loaned amount outstanding was then converted to 15,166 RCPS issued by the plaintiff to the defendant.2Foot Note 2×Statement of Claim at paras 3, 6, 7 and 9; Defence (Amendment No. 1) at para 5In total, the plaintiff issued 93,320 RCPS to the defendant. 5 The RCPS constituted investments made by the defendant in the plaintiff. The defendant would be able to realise its investment upon the occurrence of a specified liquidity event and if not, after a stipulated cut-off date in the SSHAs.3Foot Note 3×1st affidavit of Tan Bien Chuan dated 31 March 2020 (“TBCA1”) at para 14, Bundle of Cause Papers (“BCP”) Tab 2 at p 8These specified liquidity events were listed in the Exit Events stated in Clause 1.1 of the SSHAs. Alternatively, the defendant could issue a redemption notice to compel the plaintiff to redeem its RCPS following a Default Event pursuant to Clause 2.4(g) of the 2014 SSHA and Clause 2.4(f) of the 2016 SSHA.4Foot Note 4×TBCA1 at paras 15–17, BCP Tab 2 at pp 8–10A Default Event is defined at Clause 1.1 of the SSHAs to include an Exit Event not being completed by the cut-off date of 31 March 2018 (for the 2014 SSHA) or 31 December 2018 (for the 2016 SSHA).5Foot Note 5×TBCA1, BCP Tab 2 at p 53 (TBC-1) (2014 SSHA); TBCA1, BCP Tab 2 at p 112 (TBC-3) (2016 SSHA) 6 The key terms in the SSHAs that are relevant to the present dispute are similar, save that the relevant cut-off date to procure an Exit Event in the 2014 SSHA is 31 March 2018 instead of 31 December 2018. Clause 6.7 of the 2015 CLA provides that the terms and conditions in the 2014 SSHA apply to the 15,166 RCPS issued under the CLA.6Foot Note 6×TBCA1, BCP Tab 2 at p 99 (TBC-2); Statement of Claim at para 8; Defence (Amendment No. 1) at para 7For reference, the relevant terms in the 2016 SSHA are set out as follows:7Foot Note 7×TBCA1, BCP Tab 2 at pp 112, 113, 120, 121 and 132 (TBC-3) 1. DEFINITIONS AND INTERPRETATION 1.1 In this Agreement, unless the context otherwise requires, the following expressions shall have the following meanings: … “Default Event”means any of (i) the Company and/or a Shareholder being in breach of any material term of any agreement entered into with the Investor (including but not limited to this Agreement, the 30 April 2014 Agreement, and the Convertible Loan Agreement) and such breach is not remedied to the Investor’s satisfaction (acting reasonably) within thirty (30) days of notice thereof by the Investor, (ii) an Exit Event is not completed by 31 December 2018, or (iii) the Founder Absence; … “Exit Event”means with the Investor’s written approval, any of (i) a Trade Sale, (ii) a sale by the Investor of its entire shareholding interests in the Company to a third party purchaser at a price acceptable to the Investor; (iii) an Asset Sale, (iv) an IPO Event, or (v) a RTO; … 2.4Terms of the Series A RCPS… … (f)Redemption (i) Following a Default Event and subject to any applicable laws and regulations, a Series A RCPS Holder may, but is not obliged, to give notice in writing to the Company to redeem all or part of its Series A RCPS (a “Redemption Notice”). The Redemption Notice shall state clearly the number of Series A RCPS to be redeemed (the “Redemption RCPS”). (ii) If the Company is required to redeem any Series A RCPS pursuant to thisClause 2.4, the redemption amount to be paid by the Company to a Series A RCPS Holder for its Redemption RCPS (the “Redemption Amount”) shall be calculated as follows: A2 = B2 + C2 where: ‘A2’means the Redemption Amount. ‘B2’ means the aggregate subscription price paid by the Series A RCPS Holder for the Redemption RCPS. ‘C2’ means the agreed return on B2, being ten per. cent. (10.0%) per annum compounded annually (based on a 360-day year) on B2 commencing from the First Completion Date or the Second Completion Date (as the case may be) up to and including the Redemption Date. … 7.3Exit Event Undertakings: (a) The Company and the Founder jointly and severally undertakes to use their best endeavour to procure or achieve the completion of an Exit Event by 31 December 2018. … 7 Sometime in or around June 2017, the plaintiff’s Managing Director Lee William (“Mr Lee”) found that the plaintiff did not have an easy working relationship with the defendant. Mr Lee proposed that the plaintiff could redeem the defendant’s RCPS such that the defendant could exit from its investment earlier.8Foot Note 8×2nd Affidavit of Lee William dated 12 May 2020 (“LWA”) at para 19, BCP Tab 3 at p 7; Plaintiff’s Written Submissions (“PWS”) at paras 9-–10In the minutes of an Extraordinary General Meeting held by the plaintiff on 30 June 2017 (“EGM”), it was recorded that Mr Lee “raised the matter on ‘redemption of the [RCPS]’” and that he would “[table] a proposal for [the defendant] to exit”.9Foot Note 9×Certified Transcript (17 August 2020) at p 8 ln 9–23; TBCA1, BCP Tab 2 at p 308 (TBC-17) 8 Negotiations then took place between 2017 and 2018 in relation to this proposed redemption. The plaintiff’s position was that the parties had reached an agreement in or around June 2017 for the plaintiff to redeem the defendant’s RCPS pursuant to a sixth Exit Event, whereas the defendant submitted that there was no such agreement. The parties disputed the import of the records of negotiations between them, primarily in relation to the key issue of whether there had been such an agreement. 9 On or around 30 December 2018, Mr Lee sent an email to Mr Louis Lou (“Mr Lou”), who was the defendant’s nominee director in the plaintiff, and Mr Tan Bien Chuan (“Mr Tan”) who was a director of the defendant,10Foot Note 10×TBCA1 at paras 1 and 9, BCP Tab 2 at pp 1 and 5stating that the plaintiff had managed to find a third party who was interested in investing in it, such that the plaintiff would have enough funds to redeem the defendant’s RCPS. The plaintiff also proposed an exit plan to the defendant, and stated that otherwise, the defendant could proceed to issue a Redemption Notice “as per [the] SHA”. The email stated as follows:11Foot Note 11×TBCA1, BCP Tab 2 at p 192 (TBC-9) … It had been hard to raise fund [sic] in the past months because the amount of money to be paid out to OWW for redemption is not confirmed. Finally, we manage to get a third party to indicate their interest to invest so that we have enough money for redemption. We hereby offer OWW a smooth exit before 31 December 2018. The exit plan is as follows: 1. OWW must sign and acknowledge the exit plan before the investor will start spending on lawyer fees to draft term sheet and conduct due diligence (a compulsory precondition from the new investor) 2. In the exit plan, Easybook must pay SGD 6 million to OWW by end of April 2019 (definitely sooner and the amount already higher than current capital + interest) We hope OWW can agree on this, and we can let you all sign ASAP. This is win-win for both OWW and Easybook. Otherwise OWW MAY GO AHEAD TO ISSUE A REDEMPTION NOTICE NOW as per SHA. Either way, we want a written commitment from OWW so we can assure the new investor. If OWW does not agree on the above 2 options, and we could not get investor due to this, we believe it is not good for OWW also. If this is the case, we are happy to have OWW continue as shareholder and we will not have to raise funds again. Please confirm that there will not be any breach of our agreement SHA. If you have a better suggestion let me know. … 10 It was undisputed that no Exit Event had been completed by 31 December 2018. The defendant therefore took the position that it was entitled to demand that the plaintiff redeem its 93,320 RCPS pursuant to Clauses 2.4(f) and 2.4(g) of the respective SSHAs.12Foot Note 12×TBCA1 at para 24, BCP Tab 2 at p 13However, the defendant did not issue a Redemption Notice at that point in time (ie, immediately after 31 December 2018). According to the defendant, it had, “[a]s a gesture of goodwill”, intended to give the plaintiff some time to raise funds to redeem the RCPS. The parties continued discussions between January and April 2019 over the possible redemption of the defendant’s RCPS.13Foot Note 13×TBCA1 at para 29, BCP Tab 2 at p 17; BCP Tab 2 at pp 194-200 (TBC-10) 11 On 11 April 2019, Mr Lou wrote to Ms Mandy Yang (“Ms Yang”), who was the plaintiff’s Finance Manager, to ask whether there was any update on the plaintiff’s fundraising efforts. However, as the defendant did not receive any reply,14Foot Note 14×TBCA1 at para 30, BCP Tab 2 at p 17it issued a Redemption Notice to the plaintiff on or about 23 April 2019, notifying the plaintiff that it intended for all of its RCPS to be redeemed.15Foot Note 15×TBCA1 at para 25, BCP Tab 2 at p 14; BCP Tab 2 at p 187 (TBC-7)On 24 April 2019, Ms Yang replied, stating that the “fundraising [was] still ongoing”.16Foot Note 16×TBCA1 at para 30, BCP Tab 2 at p 17; BCP Tab 2 at p 194 (TBC-10)On 2 May 2019, the plaintiff wrote to the defendant acknowledging the service of the Redemption Notice and stated that it was not yet able to make full payment of the redemption amount. The letter stated as follows:17Foot Note 17×TBCA1, BCP Tab 2 at p 202 (TBC-11) … 2. We note your service of the Redemption Notice. However, we are currently not ready to make a full payment of the redemption amount by 6 May 2019. 3. Nevertheless, we intend for the redemption of your RCPS to proceed as soon as possible, and are making preparations for it. We shall give you a favourable reply by 31 May 2019. 12 There was then continued correspondence between the plaintiff and the defendant’s then-solicitors, CTLC Law Corporation, in May 2019. The plaintiff then engaged Drew & Napier LLC as its solicitors, and the parties continued to exchange correspondence through their solicitors from May to July 2019.18Foot Note 18×TBCA1 at paras 33–34, BCP Tab 2 at pp 18–19; BCP Tab 2 at pp 207–215 (TBC-12)According to the defendant, in or around September 2019, the plaintiff learnt that the defendant would be taking steps to sell its RCPS to a third party purchaser.19Foot Note 19×TBCA1 at para 35, BCP Tab 2 at p 19 13 Shortly thereafter, the plaintiff commenced Suit 997 of 2019 (“S 997/2019”) on 4 October 2019. In S 997/2019, the plaintiff sought a declaration that the defendant was not entitled to exercise its rights of redemption under Clause 2.4(f) of the 2016 SSHA and Clause 2.4(g) of the 2014 SSHA. In the plaintiff’s Statement of Claim (“SOC”), it was pleaded that there was no Default Event entitling the defendant to redeem the 93,320 RCPS. No Default Event had arisen as the plaintiff had not breached any material term of the SSHAs or the CLA, and even if there had been a breach, such breach had been remedied by the plaintiff to the defendant’s satisfaction.20Foot Note 20×Statement of Claim at para 15The plaintiff further averred that there was an implied term in the 2016 SSHA that the defendant had an obligation to cooperate with the plaintiff to achieve an Exit Event, and that the defendant had breached its implied duty to cooperate such that an Exit Event could not be procured by 31 December 2018.21Foot Note 21×Statement of Claim at paras 17–18The defendant was therefore “not entitled to rely on its breach of its implied duty to cooperate as a basis to exercise its rights of redemption under Clauses 2.4(f) and (g) of the [2016 SSHA]”.22Foot Note 22×Statement of Claim at para 22",
        "The AR’s decision in Summons 1514 of 2020": "14 In Summons 1514 of 2020 (“SUM 1514/2020”), the defendant applied under O 18 r 19 of the Rules of Court (Cap 322, R5, 2014 Rev Ed) to strike out,inter alia, the plaintiff’s pleadings and its claim in its entirety. The defendant relied on O 18 r 19(1)(b) and/or (d) and averred that the plaintiff’s claim was scandalous, frivolous or vexatious (r 19(1)(b)), or that it was otherwise an abuse of the process of the court (r 19(1)(d)). The AR granted the defendant’s application and struck out the plaintiff’s claim. The AR made the following key findings: (a) The plaintiff’s contention that the defendant was under a duty to cooperate with the plaintiff to achieve an Exit Event was factually and legally unsustainable. The alleged efforts on the plaintiff’s part to redeem the defendant’s RCPS appeared to be directed toward a redemption of the RCPS, and not toward the achievement of an Exit Event which, as defined in the SSHAs, did not include redemption. The plaintiff’s claim is legally unsustainable as even if it succeeds in showing that the defendant failed to cooperate to achieve redemption, it would not succeed in showing that the defendant was in breach of an alleged duty to cooperate to achieve an Exit Event.23Foot Note 23×Certified Transcript (SUM 1514/2020) at pp 5–7 (b) The plaintiff’s submission that the parties had come to an agreement sometime in or around June 2017 that an Exit Event would include the redemption of the RCPS was not factually sustainable. There was no mention of such an agreement in the pleadings. The correspondence between the parties showed that the discussion was centred on the possibility of redemption pursuant to Clause 2.4(f) (of the 2016 SSHA) rather than separately from it. There was also a distinct lack of clarity and certainty as to the nature and terms of this separate agreement, which the plaintiff claimed existed. Further, it was not clear why any alleged agreement had to be framed in terms of the amendment or expansion of an “Exit Event” as defined in the SSHAs, as opposed to a separate or collateral agreement between the parties.24Foot Note 24×Certified Transcript (SUM 1514/2020) at pp 7–10 (c) Even if there had been sufficient evidence of an agreement between the parties that redemption constituted an Exit Event within the meaning of the SSHAs, the plaintiff’s submission that the defendant had an implied duty to cooperate with the plaintiff to achieve an Exit Event would still be legally unsustainable. The court could not imply such a term as the parties did contemplate the issue of which parties would have to work towards procuring an Exit Event, as seen at Clause 7.3(a) of the SSHAs. There was therefore no gap in the SSHAs for the court to imply a term in fact, following the test set out inSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp Marine”). (d) Further, the plaintiff’s claim that the defendant acted in breach of its implied duty by acting unreasonably was factually unsustainable. (e) However, on the assumption that there was such an implied duty and the defendant had breached such duty, it would have beenprima facieopen to the plaintiff to argue that the defendant should not be entitled to claim that it could exercise its right of redemption. (f) Finally, the defendant made an alternative submission that it was entitled to exercise its right of redemption in any event because the plaintiff had breached material terms resulting in a Default Event. It was not clear that the plaintiff’s position was unsustainable or that the defendant’s position could be readily accepted, as further evidence as to what parties intended by the reference to “material term” would have been required.",
        "The issues on appeal": "15 The plaintiff’s arguments on appeal revolved around two main issues. The first issue was whether there was an agreement in or around June 2017 between the plaintiff and the defendant that redemption of the RCPS would amount to asixth“Exit Event”, over and above thefiveExit Events expressly defined in Clause 1.1 of the SSHAs (“the first issue”).25Foot Note 25×TBCA1, BCP Tab 2 at p 53 (TBC-1) – this contains the 2014 SSHA but the terms are substantially similar in the 2016 SSHAThe second issue was, if such an agreement was in place, whether the defendant was under an implied duty to cooperate with the plaintiff to achieve redemption of the RCPS by 31 December 2018 (“the second issue”). The plaintiff argued that there was evidence that the parties had agreed that the redemption of the RCPS would be an additional Exit Event,26Foot Note 26×PWS at para 32and that the AR had erred in his analysis that the duty to cooperate could not be implied into the SSHAs.27Foot Note 27×PWS at para 33As the defendant had breached this implied duty, it was not entitled to demand that its RCPS be redeemed on the basis that an Exit Event had not been achieved, thereby triggering a Default Event under Clauses 2.4(f) and 2.4(g) of the respective SSHAs. 16 I was of the view that if the plaintiff were to fail on the first issue, it would necessarily follow that there was no basis for any of the corresponding arguments the plaintiff had raised on appeal. In addition to the second issue, these arguments included whether the defendant had allegedly breached the implied duty to cooperate, whether the defendant was estopped from maintaining that the only means of exit from its investment in the plaintiff was through the five defined Exit Events, and whether amendment of the plaintiff’s pleadings could remedy any defects insofar as the pleadings did not contain any specific averment as to the existence of an agreement in or around June 2017 and any specific averment that the defendant was estopped by its conduct from denying that redemption of the RCPS would amount to an Exit Event. 17 The defendant’s primary argument was that it was entitled to exercise its express right of redemption of its RCPS as no Exit Event had been completed by 31 December 2018. Separately, the defendant argued in the alternative that the plaintiff had breached material terms of the SSHAs and that it was therefore entitled to exercise its right of redemption. The AR had found that it was not plain and obvious that the plaintiff had breached material terms to trigger the defendant’s right of redemption given that the phrase “material term” was not defined in the SSHAs and its meaning was disputed between the parties (see [14(f)] above). Notwithstanding this, if the plaintiff were to fail on the first issue, it was immaterial whether the defendant could rely on the argument of breach of material terms. 18 The key question on appeal was whether the plaintiff’s claim was unsustainable in law or in fact such that it should be struck out. In this regard, I address in turn the following issues that arose on appeal: (a) whether there was an agreement reached in 2017 that redemption of the RCPS would be a sixth Exit Event; (b) whether the defendant was under an implied duty to cooperate with the plaintiff to achieve redemption of the RCPS by 31 December 2018; (c) if there were such an implied duty, whether the defendant had breached its duty; and (d) whether the plaintiff had breached material terms of the SSHAs such that the defendant was entitled to exercise its right of redemption of its RCPS.",
        "Whether there was an agreement that redemption of the RCPS would be a sixth Exit Event": "",
        "Parties’ submissions": "66 The defendant submitted that it was additionally entitled to exercise its redemption right on the basis that the plaintiff had breached several material terms, such that a Default Event under Clause 1.1 had occurred.83Foot Note 83×DWS at para 90The defendant argued that Clauses 10.1(dd), 10.1(e) and 7.4 of the 2016 SSHA were material terms. 67 Clause 10.1(dd) provided that specific approval was required for the appointment of and/or change to the authorised bank signatories of the plaintiff; while Clause 10.1(e) provided that specific approval was required for the payment of any director’s fees or other remuneration to any of the directors of the plaintiff. The defendant submitted that Clause 10.1 effectively “grants [the defendant] special voting and veto rights” despite its status as a minority shareholder, such that it could safeguard its investment in the plaintiff.84Foot Note 84×DWS at para 98(1)As a shareholder’s voting right was fundamental, these clauses had to be material terms. Clause 10.1(dd) had been breached as Mr Lou had been removed as an authorised bank signatory without the defendant’s approval, and Clause 10.1(e) had been breached as the plaintiff and Mr Lee had increased the directors’ salaries and allowances paid to Mr Lee and his wife Ms Loi (who was also a director of the plaintiff) without prior shareholder approval. 68 Clause 7.4 provided that the plaintiff and Mr Lee had an obligation to procure and supply to the defendant financial documents within stipulated time periods. The defendant submitted that this clause was a material term as Clause 19.1 provided that “time shall be of the essence … as regards any dates and periods mentioned”. This clause had been breached as the plaintiff frequently failed to meet the deadlines for information submission stipulated under Clause 7.4. 69 The plaintiff took the position that these clauses were not material terms. According to the plaintiff, a “material term” is to be interpreted as a “condition” within the meaning of the condition/warranty approach set out inRDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltd and another appeal[2007] 4 SLR(R) 413. According to the plaintiff, Clauses 10.1(e), 10.1(dd) and 7.4(a) to (d) were not intended to be material terms. It argued that the defendant, a venture capital fund, would not have intended to participate in the day-to-day management of the plaintiff and its sole interest was to earn returns on its investments. Accordingly, “material” terms would be those that would undermine the value of the defendant’s shareholding if breached.85Foot Note 85×PWS at paras 108, 111 and 112It also offered various defences to the defendant’s claim, including waiver or estoppel, and that the defendant had failed to issue a notice of breach in respect of certain alleged breaches.",
        "My decision": "70 The phrase “material term” in Clause 1.1 of the SSHAs was not defined in the SSHAs. I agreed with the AR that additional evidence would need to be adduced as to what the parties had intended to be construed as material terms. In interpreting a contract, the court is to “determine and give effect to the intention of the parties, objectively ascertained” (HSBC Trustee (Singapore) Ltd v Lucky Realty Co Pte Ltd[2015] 3 SLR 885 at [30], referencingZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029). While the defendant had made various assertions as to whether the relevant clauses were fundamental or important terms in the SSHAs, the court would have to ascertain which terms should be deemed “material” such that a breach would amount to a Default Event, entitling the defendant to exit from its investment. 71 I did not think that the defendant’s position was so incontrovertibly made out that it would be dispositive of the main issue,ie, whether it had a right to demand that the plaintiff redeem its RCPS. As such, the plaintiff’s claim would not have been struck out on this basis without more. However, as noted at [17] above, whether the defendant could rely on the plaintiff’s alleged breaches of material terms is immaterial since I had found that the plaintiff failed on the first issue, which formed the core of its arguments on appeal.",
        "Whether the defendant had an implied duty to cooperate": "",
        "Whether the defendant had breached an implied duty to cooperate": "",
        "Whether the plaintiff had breached material terms": "",
        "Conclusion": "72 For the reasons I have set out above, the appeal was dismissed. 73 As for costs of the appeal, the defendant submitted that a sum of $10,000 would be appropriate, with an additional $1,090 for disbursements. The plaintiff submitted that a sum of $5,000 inclusive of disbursements would be appropriate, on the basis that there were no additional affidavits filed and the submissions and authorities were substantially similar to those canvassed at the hearing below.86Foot Note 86×Certified Transcript (28 August) at p 11 ln 3–10 74 I noted that almost an entire day had been taken for submissions. Considering the submissions on costs by both parties as well as the costs guidelines set out in Appendix G of the Supreme Court Practice Directions, I ordered costs of the appeal to the defendant, to be fixed at $9,000 inclusive of disbursements.87Foot Note 87×Certified Transcript (28 August) at p 12 ln 3–8 See Kee OonJudge Lim Qiu Yi, Regina and Woo Shu Yan (Drew & Napier LLC) for the plaintiff; Lee Bik Wei and Ngiam Hian San, Laura (Allen & Gledhill LLP) for the defendant."
    }
}