{
    "case_title": "Ma Wai Fong Kathryn vTrillion Investment Pte Ltd and others",
    "ncitation": "[2020] SGHC 79",
    "coram": "Valerie Thean J",
    "sections": {
        "Background": "2 The facts relevant to Datuk Wong Tuong Kwong (“Datuk Wong”)’s extensive business empire were detailed inMa Wai Fong Kathryn(CA). Trillion and Double Ace were part of this network of companies that spanned several jurisdictions. After Datuk Wong suffered a stroke in the 1990s,1Foot Note 1×WKY’s 1st Affidavit at para 12.the second of his three sons, Wong Kie Nai (“WKN”), ran these two companies. This arrangement continued after Datuk Wong’s death, until WKN’s death on 11 March 2013.2Foot Note 2×WKY’s 1st Affidavit at para 14; Kathryn Ma’s 1st Affidavit at para 11(b) (precise date). 3 After WKN’s death, the remaining directors of Trillion and Double Ace were Datuk Wong Kie Yik (“WKY”), Wong Kie Chie (“WKC”) (WKN’s older and younger brothers respectively) and Ong Kim Siong (“OKS”). WKC stepped down as a director of both companies in 2015. WKY and OKS remained the directors of Double Ace prior to its liquidation and are the present directors of Trillion (“the directors”).3Foot Note 3×WKY’s 2nd Affidavit at para 9(l); Kathryn Ma’s 1st Affidavit at para 11.The plaintiff is WKN’s widow and the executrix of his estate. Trillion has at present three equal shareholders: WKY, WKC, and the plaintiff, as the executrix of WKN’s estate, with each party holding 50,000 shares of $1 each.4Foot Note 4×WKY’s 2nd Affidavit at para 8 and pp 26–28.",
        "The present dispute": "4 The substantive dispute in this case centred on the collection of rental income that arose from Trillion’s rental of the Unit to Double Ace. Trillion, incorporated around 5 May 1979 in Singapore, had been acquired by WKY and his wife as an investment holding company in 1982.5Foot Note 5×WKY’s 1st Affidavit at paras 7–8.Around 1984, Trillion purchased the Unit for approximately $1.139 million. Its accounts record a loan from WKY of $942,065 for that purpose.6Foot Note 6×WKY’s 2nd Affidavit at para 9(e).Sometime in 1985, the Unit, which was and remains Trillion’s only asset, was rented out to Double Ace at $5,000 a month.7Foot Note 7×WKY’s 2nd Affidavit at para 9(g).Double Ace did not pay any rent. The rental income was instead reflected in Trillion’s accounts as a debt due from Double Ace. This practice, started by Datuk Wong, continued after WKN took over the management of Trillion and Double Ace.8Foot Note 8×WKY’s 2nd Affidavit at para 33(b).Double Ace gradually ceased trading from 2011 when WKN became ill, and it was common ground that by 2013 the company no longer traded.9Foot Note 9×WKY’s 2nd Affidavit at para 9(j); Kathryn Ma’s 1st Affidavit at para 21.Notwithstanding Double Ace’s cessation of business, the directors continued the same rental arrangement. The Unit continued to be rented to Double Ace for $5,000 per month with no rent collected. On 24 June 2019, the plaintiff filed the present application, seeking leave to commence an action on behalf of Trillion premised on the directors’ failure to collect rent from 2013.",
        "Issues in the application": "5 Under s 216A(3) of the Companies Act, three requirements must be met in order for leave to be granted for a derivative action to commence. The provision reads: (3)  No action or arbitration may be brought and no intervention in an action or arbitration may be made under subsection (2) unless the Court is satisfied that — (a) the complainant has given 14 days’ notice to the directors of the company of his intention to apply to the Court under subsection (2) if the directors of the company do not bring, diligently prosecute or defend or discontinue the action or arbitration; (b) the complainant is acting in good faith; and (c) it appears to be prima facie in the interests of the company that the action or arbitration be brought, prosecuted, defended or discontinued. 6 In this case, the requisite notice under s 216A(3)(a) has been furnished. The defendants disputed only the second and third conditions. The applicable legal standards are as follows.",
        "Good faith": "29 I come, then, to the issue of good faith, in the context that I have found that the claim is a valid one. The defendants argued that the plaintiff lacked good faith, relying on the following: (a) the animosity between parties; and (b) a miscellany of conduct alleged to point to the plaintiff’s bad faith. I deal with each in turn.",
        "Prima faciein the interests of the company": "12 In brief, the defendants argued that the claim was not legitimate for the following reasons: (a) The directors had simply carried on an existing practice that WKN also adopted when he ran the company. In this context they contended that the Court of Appeal’s decision inMa Wai Fong Kathryn (CA)([1]supra) precluded the claim from being brought. (b) The rental ought to be sought, in the first instance, from Double Ace in its winding up. Any action would be premature in view of the amount thus likely to be obtained as there would be no real damage sustained. (c) Even if damages were obtained after action, the benefit to Trillion was not sufficient because that sum would simply go towards paying off WKY’s loan to Trillion. (d) The costs of litigation, in terms of financial as well as non-monetary aspects, would be too high to justify the litigation when viewed against the benefit obtained. I deal with each in turn.",
        "Decision": "10 The focus of the second issue, that the proposed action isprima faciein the interests of the company, is an objective assessment of the legal merits of the claim (seeAng Thiam Sweeat [58]). That of the first issue, good faith, is the applicant’s honest or reasonable belief in the merits of the claim:Jian Li Investmentsat [43]. The two issues are related. The strength of the claim is relevant under both heads. An applicant would have difficulty proving an honest or reasonable belief in the merits of the claim if the claim is frivolous (Ang Thiam Sweeat [55]) while an applicant would likely (but not necessarily) satisfy that requirement more easily by showing that the claim is meritorious (seeAng Thiam Sweeat [29];Pang Yong Hockat [20]). Further, as the Court of Appeal noted inPang YongHockat [20], “[t]he best way of demonstrating good faith is to show a legitimate claim which the directors are unreasonably reluctant to pursue with the appropriate vigour or at all.” 11 For the above reason, I considered the requirement that the action beprima faciein the interests of the company first. In the present case, I found the claim to be a legitimate one. Because there was merit in the claim, I also found that the plaintiff was able to satisfy the requirement that she possessed a reasonable and honest belief in its merit. In this context, I took into account the family history of acrimony, which was not determinative of the issue. The various parties at hand were burdened with collateral interests in the positions that they took, but the plaintiff’s interests were aligned with those of the company, whereas the directors’ were not. I held therefore that the plaintiff was acting in good faith in her pursuit of the action. I detail below, the arguments dealing with each limb in turn.",
        "Merits of the proposed claim": "13 The plaintiff exhibited a draft Statement of Claim (“SOC”) in her third affidavit dated 9 December 2019 in response to arguments made by the defendants that the matter was precluded by the Court of Appeal’s findings inMa Wai Fong Kathryn (CA). The draft SOC characterises the non-collection of rent as breaches of the directors’ fiduciary duties to use reasonable diligence and to act in the company’s best interests. The proper discharge of these duties would have required WKY and OKS to review whether to maintain the rental arrangement with Double Ace and/or collect rental arrears owed from Double Ace to Trillion.10Foot Note 10×Draft SOC at para 8.On that basis, she argued, Trillion would be entitled to, at the minimum, rental arrears of $5,000 per month for the period between June 2013 and May 2019.11Foot Note 11×Draft SOC at p 7. 14 The directors made two arguments by way of defence to the claim. The first was that this non-collection of rent was a long-standing practice that began in 1985 when Datuk Wong was in charge and continued when Trillion was under the charge of WKN. They were, however, unable to articulate how a long-standing practice could, in legal terms, amount to a defence. Further, there was a change of circumstances once Double Ace ceased to trade. When WKN was in charge, Double Ace and Trillion were run as a single business, and while no rent was collected from Double Ace, Trillion’s operating expenses were run out of an active company whose income functioned as the lifeline of both companies. Once Double Ace was no longer active, notwithstanding that it was a related company, it was certainly arguable that WKY and OKS were under an obligation to review the rental arrangement, either by collecting rent and seeking the rental arrears, or by considering whether the Unit could otherwise be rented out to some other party. Their failure to do so could be characterised as a breach of the duty of care, skill and diligence, the duty to act with reasonable diligence, and/or the duty to act in the company’s best interests, as alleged by the plaintiff. This was a legitimate and arguable claim with a reasonable semblance of merit. 15 Associated with this, the directors argued that this arrangement was justified as Trillion and Double Ace were run as a single entity. Rent to be paid from Double Ace to Trillion would have been “akin to taking funds from a left pocket, and placing it into a right pocket”, needlessly increasing Double Ace’s cash outflow.12Foot Note 12×2nd and 3rd Defendants’ Written Submissions at para 28(5).This would have meant a build-up of cash in Trillion’s accounts, which would not have been used since Trillion was just an investment holding company. Further, when WKY took over Double Ace, he then started to give loans to cover Double Ace’s and Trillion’s operating expenses, and to require recovery of rent at that time would simply have meant shifting money from WKY to Double Ace to Trillion.13Foot Note 13×2nd and 3rd Defendants’ Written Submissions at para 28(7).There was no merit to this contention, because the situation arguably stemmed from the directors’ neglect of the affairs of Double Ace, which, prior to WKN’s demise, was a profitable trading company, and itself possessed an office unit with rental income. This unit became vacant in 2015: seeMa Wai Fong Kathryn (CA)at [71]. In any case, the extent to which Double Ace could be treated as a “single entity” with Trillion after WKN’s death and the transfer of shares to the plaintiff, the situation after Double Ace ceased trading, and the duties owed by Trillion’s directors who happened to be Double Ace’s directors as well, are all issues that should be ventilated and resolved at trial. 16 A last line of defence was that issue estoppel arose from the Court of Appeal’s findings inMa Wai Fong Kathryn (CA)([1]supra). The relevant portion of the Court of Appeal’s findings was at [48]: Fourth, in relation to the Appellant’s concern that the amount owing to Trillion as reflected in Trillion’s financial statement dated 30 September 2016 was different from the amount Double Ace owed to other related parties as reflected in Double Ace’s financial statement dated 30 September 2016, we considered that the Appellant’s concerns were misplaced. In examining whether there has been a lack of probity on the part of Trillion’s shareholders and directors, the court would only be concerned with Trillion’s affairs and whether they were properly handled. On this, we note that the amount owing to Trillion by Double Ace for the rental of the Trillion unit had been in Trillion’s financial statements since 2009. It continued to increase year on year culminating in $890,170 in 2016. The Judge found, and we agreed, that this sum was due to the rental income payable by Double Ace which Trillion had not collected and which continued to accrue. Given that this was a situation that had started on WKN’s watch and been permitted by him for years, we agreed with the Judge that it could not evidence a lack of probity on the part of the current management. 17 This argument fell away once the draft SOC was filed. The issue under consideration inMa Wai Fong Kathryn (CA)was whether the company’s business had been run in a fraudulent manner by the directors. The plaintiff failed to establish their lack of probity to ground her application for the company to be wound up on that basis: seeMa Wai Fong Kathryn (CA)at [37]–[38] and [40]–[43]. The draft SOC articulated a claim in the fiduciary duty of due care and diligence, a wholly different issue.",
        "Amount recoverable in the action": "18 The defendants also made various arguments in an attempt to show that Trillion would not stand to gain substantially in money or money’s worth:Jian Li Investments([7]supra) at [49]. Money to be recovered in Double Ace’s liquidation 19 The rental sum was owed by Double Ace, which was in liquidation, and against which the directors have filed a proof of debt. They argued that the ensuing dividend obtained from the liquidator would satisfy the rental debt in such a way that the proposed claim would not have any value. 20 Trillion has lodged a proof of debt in Double Ace’s liquidation for $942,800.90, being the amount of rental arrears owed by Double Ace, taking into account an alleged set-off for expenses paid by Double Ace on Trillion’s behalf.14Foot Note 14×WKY’s 2nd Affidavit at para 16(a).There are two other creditors who have filed proofs of debt. WKY has filed a proof of debt in the sum of $615,624.83 and the estate of Datuk Wong has filed a proof of debt for $1,058.53. On this account, the total debt would be $1,559,484.26. WKY was of the view that the rental arrears from the six-year period sought in the proposed claim would be repaid because the dividend from the sale of its asset, which WKY estimated at $850,000, would be paid out in proportion of the debt, as follows: Trillion at 60.456%, WKY at 39.476%, and the estate of Datuk Wong at 0.068%,15Foot Note 15×WKY’s 2nd Affidavit at para 16.and therefore, the sum paid to Trillion would exceed the $360,000 claimed. 21 Even on the face of WKY’s affidavit calculations, where the sale of the Double Ace unit was expected to garner $815,000, there would be a shortfall in dividend available for the total debt claimed by creditors. The amount the plaintiff claimed on behalf of Trillion for the six-year period was not analogous to the amount for which the proof of debt for $942,800.90 had been filed. Further, parties updated the court on 7 February 2020 that the liquidator had since clarified that the total dividend expected in Q2 of 2020 would be around $650,000, an even smaller sum than the $815,000 assumed by WKY in his calculations.16Foot Note 16×Minute Sheet 7 February 2020.It was clear, therefore, that even if money was recovered from Double Ace, there would still be a shortfall that could be recovered as damages from the directors. Set-off for expenses paid by Double Ace 22 In this context, the defendants argued that the sum of $360,000 claimed by the plaintiff failed to account for a set-off for sums expended by Double Ace on behalf of Trillion. WKY gave evidence in his 1st Affidavit that the expenses paid by Double Ace to Trillion totalled $157,841.55 between 2013 and 2018. After deducting this from $360,000, the defendants arrived at the sum of $202,158.45.17Foot Note 17×WKY’s 1st Affidavit at para 37. See also Tab 36 of the 1st Affidavit.The plaintiff denied the existence of these expense payments, in respect of which she would be entitled to put the defendants to proof in the subsequent action. She argued that, in any case, there was no reason why the expenses should be set-off against the rental proceeds year by year or month by month for the six-year period, when, as a mathematical matter, because these expenses were less than the rental proceeds, they should be set-off against the prior rental arrears due.18Foot Note 18×Kathryn Ma’s 2nd Affidavit at para 10.These were arguable matters to be left to trial, given the low threshold the leave application entailed. Whether the action is premature 23 At the time of the hearing, uncertainty remained as to the exact quantum of damages to which Trillion would be entitled because the proof of debt filed in Double Ace’s liquidation had not yet been adjudicated. For this reason, the defendants argued it was premature to grant leave. However, the limitation period continued to apply (see also [36] below). Increasing parts of the claim would be time-barred with the effluxion of time. Counsel for the plaintiff took the position that the plaintiff ought to be granted leave at this stage to file the writ on behalf of Trillion against WKY and OKS so that the action would not be time barred. 24 All of the facts relating to liability for breaches of directors’ duties had crystallised. It was also clear that some amount would be recoverable as damages. The adjudication of the proof of debt related only to the issue of quantum. In the light of the potential time-bar guillotine, it was more practicable grant leave to commence the action but to impose a condition under s 216A(5) of the Companies Act that no assessment of damages be conducted prior to any adjudication of debt in Double Ace’s liquidation.",
        "Is there sufficient benefit for Trillion?": "25 The defendants also raised arguments suggesting that even if there was a meritorious claim, there would not be sufficient benefit to Trillion to justify leave under s 216A of the Companies Act. First, WKY and OKS pointed to a debt allegedly owing to WKY to the sum of approximately $942,065.19Foot Note 19×2nd and 3rd Defendant’s Written Submissions at para 37(2). See also WKY’s 2nd Affidavit at para 9(e).They argued that any sum of money obtained by Trillion in the proposed action would be used to pay off that debt, and Trillion itself would not benefit from the action. The plaintiff countered that the issue was irrelevant, on the basis that the focus of the application for leave is on theinterests of the company, and the issue is whether the company “will stand to gain substantially in money or money’s worth”:Jian Li Investments([7]supra) at [49]. I agreed with the plaintiff. Here, WKY’s loan was for the purchase of the Unit. If his loan is repaid, there will be greater profit subsequently for the company when the Unit is subsequently sold. The plaintiff also disputed the debt, on the basis that it was not proved, and barred by the Limitation Act (Cap 163, 1996 Rev Ed) (“Limitation Act”). I should point out that the Court of Appeal found inMaWai Fong Kathryn (CA)([1]supra)at [46] that the plaintiff, suing as WKN’s executrix, could not take a position contrary to that adopted by WKN regarding this liability when he managed the company, in that he had not disputed it at the time.",
        "Whether the action would be detrimental to Trillion": "26 Costs of the proposed litigation, the defendants argued, would outweigh the quantum of the proposed claim. This objection could not be sustained in the light of the plaintiff’s undertaking, furnished on affidavit dated 9 December 2019, to ensure that Trillion would be entirely insulated from any costs of the action. In the event of success, the plaintiff was willing to undertake not to claim any costs from Trillion above whatever party-and-party (“P&P”) costs were ordered in its favour. In the event of failure, the plaintiff was willing to undertake to pay to WKY and OKS, on behalf of Trillion, whatever P&P costs were ordered in their favour.20Foot Note 20×Notes of Argument 7 February 2020 at p 15, ln 16–21; p 22, ln 18–20.There is therefore only the possibility of financial gain to Trillion in the proposed action. In order to give effect to those undertakings, conditions could be imposed under s 216A(5) of the Companies Act. 27 Costs, the defendants then argued, would also be incurred in terms of time and effort in order to prepare for the litigation. This concern was, in my view, overstated and not substantiated. Trillion is not an actively trading company but solely an investment holding company whose primary asset is the Unit. Because there are no other investments, focusing on the Unit would not result in distraction from other investments, and litigation would not disrupt any commercial relationships or any on-going enterprise. None of the other considerations in “the multi-factorial inquiry” (Jian Li Investmentsat [54]; see [9] above) suggested that there was any reason to doubt that the claim would be in Trillion’s interests. 28 Therefore, the action wouldprimafaciebe in the interests of Trillion.",
        "Animosity between parties": "30 The animosity between parties was common ground and accepted by the plaintiff in her affidavit in response to the application to cross-examine her. Since WKN’s passing in 2013, the extended Wong family has been involved in litigation in multiple jurisdictions. According to WKY, as of 31 July 2019, a total of 92 proceedings have been commenced across four jurisdictions, with the plaintiff responsible for commencing 57 of these proceedings (and six counterclaims). 31 What, then, was the effect of the animosity between the parties? Animosity is only relevant if the plaintiff may be said to be abusing the statutory remedy:Pang Yong Hock([9]supra) at [19]. In relation to the plaintiff’s alleged collateral purpose of pursuing a personal vendetta, the existence of a collateral purpose was not, in and of itself, a reason to find that the application for leave was not brought in good faith: seePang Yong Hockat [20]. Good faith is less dependent on motives and more on thepurposeof the proposed action:Ang Thiam Swee([7]supra) at [16]. That is to say, “it is not the questionable motivations of the applicantper sethat amounts to bad faith; instead bad faith may be established where questionable motivations constitute a personal purpose which will be pursuedat the expense of or in lieu of the company’s interests” [emphasis added]:Jian Li Investments([7]supra)at [47].  A collateral purpose will establish bad faith only if it is at odds with or runs counter to the company’s interests, that is, if the action is brought on the basis of “purelypersonal considerations” [emphasis added]:Pang Yong Hockat [20]. Where, however, as it is in the present case, there is an alignment between the company’s interests and the applicant’s interests, even if the applicant is pursuing a personal vendetta, the existence of that personal motive is not a sufficient basis for finding a lack of good faith. In the light of the objective merits of the claim, I found that the plaintiff possessed a reasonable belief that there is a good cause of action. Further, notwithstanding her dislike of WKY and OKS, her interests were sufficiently aligned with the interests of Trillion in the proposed action. She was not abusing the statutory remedy nor, by extension, the statutory corporate form. 32 Balanced against that was the question of whether the directors were unreasonably resisting the leave application because of their own collateral purposes in avoiding liability in the face of the distinct possibility that they have, since 2013, neglected their statutory duties.  Previously, the directors resisted the winding up of Trillion in the prior litigation on the basis that it is an investment company with an investment asset. This was the only reason for the Court of Appeal’s decision to not wind up the company, and the single distinguishing factor between this company and Double Ace:Ma Wai Fong Kathryn(CA)([1]supra) at [67]–[68]. But they had not recovered rent for this sole asset. The plaintiff was entitled to question this. Here was a claim for six years of rental arrears, to which there did not appear to be much of a defence. While the defendants contended that this is a small claim, there would nevertheless be financial benefit to Trillion because the plaintiff has undertaken to insulate it from all costs. I would add that the draft SOC contains claims for damages and equitable compensation, and it would be open to the plaintiff to argue that, with Double Ace no longer requiring the Unit, the directors ought to have exercised at least some effort to find a tenancy for the Unit at prevailing market prices, which could well be higher than the $5,000 rental set in 1985. 33 The requirement for leave under s 216A of the Companies Act is premised on the assumption that the management of a company is best placed to bring actions on behalf of the company. These particular directors clearly have no intention of bringing any action against themselves despite the claim being a clear one. As the Court of Appeal stated inPang Yong Hockat [20], one way to establish good faith is “to show a legitimate claim which the directors are unreasonably reluctant to pursue with the appropriate vigour or at all.” This was exactly the situation at hand.",
        "Is there otherwise abuse of the statutory remedy?": "34 I deal here in turn with various assertions made by the defendants to allege bad faith on the part of the plaintiff. That the plaintiff was “not genuinely aggrieved” 35 Trillion argued that the plaintiff could not be “genuinely aggrieved” because, as a shareholder, she stood to gain nothing from the intended action as the money would first be paid to the creditors.21Foot Note 21×1st Defendant’s Supplemental Written Submissions at para 2.In my judgment, this argument was misplaced. The requirement that the applicant must be “genuinely aggrieved” was first used inPang Yong Hock([9]supra) at [19] where Tay Yong Kwang J spoke of the protection of “genuinely aggrieved minority interests”. It was clear that the context was of company interests, albeit that of the minority. Subsequent use inAng Thiam Swee([7]supra) at [30], and byJian Li Investments([7]supra) at [44] also did not highlight any need for personal gain or personal benefit on the part of the plaintiff. In the Canadian case ofRichardson Greenshields of Canada Limited v Kalmacoff et al(1995) 22 OR (3d) 577 at 586–587 (quoted with approval inAng Thiam Sweeat [15]), Sydney Robins JA made the point that personal interests were irrelevant: [T]he extent of [the appellant shareholder’s] stake, monetary or otherwise, in the outcome of proceedings is of little weight in deciding whether it has met the good faith test applicable in the present circumstances. … Whether it is motivated by altruism, as the motions court judge suggested, or by self-interest, as the respondents suggest, is beside the point. Assuming, as I suppose, it is the latter, self-interest is hardly a stranger to the security or investment business. Whatever the reason, there are legitimate legal questions raised here that call for judicial resolution. That the plaintiff framed the claim to avoid liability on the part of WKN 36 The derivative action as framed by the plaintiff pertains only to the rental arrangement from June 2013 to May 2019. The defendants pointed out that this rental arrangement was put in place by Datuk Wong, and WKN in continuing the practice was equally in breach of his duties as WKY and OKS were in breach of theirs, and therefore that his estate should also be included as a defendant in the derivative action. They submitted that the failure to do so showed that the application was not brought in good faith. Even if this were true, it would not detract from the valid claim at hand. It fails in any event given the plaintiff’s explanation that any claim in relation to WKN would have been time-barred, as the proposed claim is for the lack of due care. A six-year limitation period would apply for such breaches of fiduciary duties under s 6(7) of the Limitation Act:Dynasty Line Ltd (in liquidation) v Sukamto Sia and another and another appeal[2014] 3 SLR 277 (“Dynasty LineLtd”) at [53]–[54];Yong Kheng Leong and another v Panweld Trading Pte Ltd and another[2013] 1 SLR 173 at [48]–[51]. It is only where the claim is one for “fraud or fraudulent breach of trust” that the exception under s 22(1)(a) of the Limitation Act applies:Dynasty Line Ltdat [53], and the draft SOC makes clear that fraud is not alleged. The plaintiff’s conduct in the lead-up to the application 37 The defendants also made three arguments concerning the plaintiff’s conduct in the lead-up to the application, which they alleged showed a lack of good faith. 38 First, the defendants argued that the issue of rental arrears had not been raised in the prior applications for winding up that culminated inMa Wai FongKathryn (CA)([1]supra) even though the plaintiff found out about the rental arrangement in October 2017 when affidavits were exchanged.22Foot Note 22×1st Defendant’s Written Submissions at paras 48–50; 2nd and 3rd Defendants’ Written Submissions at para 21.The plaintiff’s explanation for her actions was reasonable: if Trillion had been wound up, then the appropriate course of action would have been for the liquidators to investigate and pursue the claim if necessary.23Foot Note 23×Plaintiff’s Written Submissions at para 45. 39 Second, the defendants argued that the plaintiff failed to raise the issue at the Annual General Meeting on 26 March 2019 and at the Extraordinary General Meeting on 16 April 2019 after serving the s 216A notice on 25 March 2019. I did not see how this was relevant. What is significant here is that the plaintiff had in fact sent a letter to WKY seeking clarification on a number of matters on 8 March 2019,24Foot Note 24×Kathryn Ma’s 1st Affidavit at para 22 and Tab 12.before the Court of Appeal released its grounds of decision on 20 March 2019. The s 216A(3)(a) notice was sent thereafter, on 25 March 2019.25Foot Note 25×Kathryn Ma’s 1st Affidavit at para 24.There was no need for the plaintiff to raise the issue at the shareholders’ meetings. Compliance with s 216A(3)(a) of the Companies Act was sufficient. Its purpose was to provide an opportunity for the directors to respond prior to any application being brought:Fong Wai Lyn Carolyn v Airtrust (Singapore) Pte Ltd and another[2011] 3 SLR 980at [14]. 40  Third, the defendants argued that the plaintiff was abusing her position as executrix of WKN’s estate because although six years have passed after WKN’s death, she has not, as required by the will, transferred the shares to CIMB Commerce Trustee Berhad to hold as trustee for her two children and herself as beneficiaries.26Foot Note 26×See WKN’s will exhibited in WKY’s 2nd Affidavit at Tab 3, pp 52-54.This argument ignored the fact that the will empowered the plaintiff to defer the stipulated transfers. It includes a “power to postpone such sale, calling in and conversion for so long as [his] Trustee [viz., the plaintiff] shall in their absolute discretion think fit”.",
        "Applications for cross-examination of parties": "41 It would be appropriate for me to deal, before I conclude, with the applications filed by the parties for cross-examination in Summonses Nos 6097, 6098 and 6392 of 2019. When the matter first came before me, the plaintiff argued that without the benefit of cross-examination, the defendants could not question her assertion, made on oath in her affidavit, as to her good faith. Trillion and the directors then followed on with applications to cross-examine the plaintiff while the matter was adjourned for the plaintiff to file an affidavit to furnish the undertakings which her counsel had proposed at the hearing and to explain the proposed claim with a draft statement of claim. In response, the plaintiff filed a cross-application to cross-examine the directors. 42 After considering the various issues, I decided that cross-examination was not necessary. It was clear from the affidavits that each party filed in support of their own applications and in response to the other’s applications that the relationship between the plaintiff and the directors were extremely acrimonious. The burden of proving good faith was borne by the plaintiff. In the present case, I was satisfied that she had discharged that burden by affidavit and argument because an assessment of the claim and the undertakings she furnished showed that she possessed honest and reasonable grounds for belief in the financial benefit it would bring to Trillion. Further, any collateral purpose she may have was sufficiently consistent with Trillion’s interests such that the application could be said to have been made in good faith. There was no particular issue raised by the defendants that formed a sufficient basis to contradict or question that conclusion, and accordingly there was no need for the defendants to cross-examine the plaintiff. I should clarify that after consideration, I did not find myself in agreement with the plaintiff’s position that the defendants could not question her good faith without cross-examination. They could do so on the grounds of sufficient objective evidence that did not require explanation by cross-examination.  In the present case, however, such evidence was not raised. As for the plaintiff’s application to cross-examine the directors, it was contingent upon her being cross-examined, which I have found to be unnecessary. The three applications for cross-examination were dismissed with no order on costs.",
        "Orders": "43 Therefore, I concluded that the requirements under s 216A(3) of the Companies Act were satisfied. Leave was granted to the plaintiff to bring an action on behalf of Trillion against the directors for breach of duties. The plaintiff was authorised to have full charge and control over the conduct of the action and any execution proceedings thereafter. 44 The following conditions were imposed pursuant to s 216A(5) of the Companies Act. That in (a) was framed in view of the pending adjudication of Double Ace’s proofs of debt by its liquidator (see [23]-–[24] above); (b) and (c) were framed to give effect to the plaintiff’s undertaking, with reference to the conditions imposed by Court of Appeal inChong Chin Fookv Solomon Alliance Management Pte Ltd and others and another matter[2017] 1 SLR 348at [93], while taking into consideration the nature of the likely claim in the quantum of security set; and (d) arose from the plaintiff’s undertaking not to claim any costs from the company in excess of the P&P costs ordered if the litigation should be successful (see [26] above): (a) any assessment of damages should be conducted only after Double Ace’s liquidator has adjudicated Trillion’s proof of debt and determined the dividends to be paid to Trillion; (b) the plaintiff shall indemnify Trillion for all costs incurred in the action against WKY and OKS from the commencement of the suit till disposal in the event that Trillion is unsuccessful; (c) the plaintiff provides security for costs that Trillion would likely have to pay if it is unsuccessful in prosecuting the action in the substantive action, by solicitor’s undertaking or by such other method as the parties may agree (such security being set in the sum of $30,000 up to the end of the discovery stage); and (d) in the event that Trillion is successful in the substantive action, the plaintiff shall only be entitled to recover from Trillion an amount up to the amount of P&P costs ordered to be paid by WKY and/or OKS. 45 The directors were ordered to pay the plaintiff’s costs. In view of the multiple issues raised, these were fixed, inclusive of disbursements, at $18,000. Valerie TheanJudge Rethnam Chandra Mohan, Chia Xin Ran Alina, On Wee Chun Derek and Stella Ng Yu Xin (Rajah & Tann Singapore LLP) for the plaintiff; Nair Suresh Sukumaran and Yeo Guan Wei Joel (PK Wong & Nair LLC) for the first defendant; Palmer Michael Anthony, Reuben Tan Wei Jer, Amanda Chen and Joel Moosa (Quahe Woo & Palmer LLC) for the second and third defendants.",
        "": ""
    }
}