{
    "case_title": "Day, Ashley FrancisvYeo Chin Huat Anthony and others",
    "ncitation": "[2020] SGHC 93",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 This case revolved around a business venture (“Rock Business”) involving the sale of plant nutrients and associated products (“Rock Products”).1Foot Note 1×2nd, 3rd, 5th and 7th defendants’ closing submissions dated 30 April 2019 (“2 DCS”) at para 2The parties were all persons and entities related to this business. The plaintiff sued his former business partners and their related entities, on the grounds of breach of contract, proprietary estoppel, conspiracy and deceit. All the claims were dismissed and the plaintiff has appealed.",
        "Names of Parties": "2 As a preliminary point, I noted that counsels in their submissions referred to the parties and witnesses by their first names; this has also been done on some occasions in some judgments. I do not consider it appropriate to do so, and would discourage counsel, at least those before me, from doing so. 3 The first names used by counsels have been substituted with their last names in this grounds of decision. A table setting out the abbreviations of parties used in this grounds is set out here for ease of comparison with the submissions: RoleFull NameAbbreviation in this grounds of decisionPlaintiffAshley Francis Day“plaintiff”First DefendantAnthony Yeo Chin Huat“Yeo”Second DefendantShane Andrew Tainton“Tainton”Third DefendantWarren Tyler Reid“Reid”Fourth DefendantMichael O’Brien Biggs“Biggs”WitnessCherise Tainton“Mrs Tainton”WitnessCon Caracoussis“Caracoussis”WitnessKristopher Ryan Kaminski“Kaminski”WitnessMark Minczanowaski“Minczanowaski”Expert WitnessHugh Sutcliffe Martin“Mr Martin”Expert WitnessIain Cameron Potter“Mr Potter”",
        "Undisputed Facts": "4 Tainton and Reid own an Australian company named Rock Holdings (SA) Pty Ltd (“Rock Australia”), through which they sold Rock Products from around 2004.2Foot Note 2×2 DCS at paras 12–14, p 382Since then, the Rock Products have been manufactured by Biggs through his various entities in Australia, including through the 6th defendant (“Aoraki”), a company of which Biggs is the sole director.3Foot Note 3×2 DCS at para 15, p 382; Statement of Claim (Amendment No. 1) dated 27 February 2017 (“SOC”) at paras 13–14; Defence of the 4th and 6th defendants (Amendment No. 1) dated 31 March 2017 (“4 Defence”) at paras 14–15, 19; Defence of the 2nd, 3rd, 5th and 7th defendants (Amendment No. 1) dated 10 April 2017 (“2 Defence”) at para 14 5 The plaintiff had known Tainton and Reid for many years.4Foot Note 4×SOC at para 20; 2 Defence at para 19Around September 2010, Tainton and Reid asked the plaintiff to help market the Rock Products.5Foot Note 5×2 DCS at para 22; SOC at para 20Subsequently, the plaintiff roped in Yeo to help the venture.6Foot Note 6×Defence of the 1st defendant dated 15 October 2018 (“1 Defence”) at para 17Following discussions, around April 2011, the plaintiff, Tainton, Reid and Yeo (“the Principal Parties”) signed two documents (collectively “April 2011 Agreements”).7Foot Note 7×SOC at para 26; 2 Defence at para 21; Chronological Bundle of Documents Volume 1 dated 5 September 2018 (“1 CBD”) at pp 283 to 284Pursuant to the April 2011 Agreements, a company, Rock Nutrients Singapore Pte Ltd (“Rock Singapore”), was to be incorporated in Singapore.8Foot Note 8×SOC at para 26; 2 Defence at para 21; 1 CBD at p 283The plaintiff and Yeo were each to hold 50% of the shares in Rock Singapore for incorporation purposes and statutory disclosure, but Tainton and Reid were to be beneficial owners of 100% of the company.9Foot Note 9×2 DCS at para 29; SOC at para 26; 2 Defence at para 21; 4 Defence at para 22; 1 Defence at para 18; 1 CBD at pp 283 to 284The plaintiff was to promote and market the products in the US,10Foot Note 10×SOC at para 22; 2 DCS at para 16; Anthony Yeo Chin Huat’s affidavit of evidence-in-chief dated 28 September 2018 (“Yeo’s AEIC”) at para 24; 2 Defence at para 21; There was some dispute as to whether the plaintiff was also asked to market the products in countries apart from the US, but this was not material to the decision.whilst Yeo was to assist in the operations, corporate, financing and accounting matters in Rock Singapore.11Foot Note 11×2 Defence at para 21; SOC at para 25; Yeo’s AEIC at para 24; 2 Defence at para 21In return, the plaintiff and Yeo were to be paid 30% of the net profits of Rock Singapore as management fees.12Foot Note 12×SOC at para 26The April 2011 Agreements also stipulated that the plaintiff and Yeo were to bear the costs of running Rock Singapore from the management fees given to them.13Foot Note 13×1 CBD at p 284 6 Rock Singapore was incorporated as per the April 2011 Agreements, with the legal shareholding as per the agreement.14Foot Note 14×SOC at para 2; 2 Defence at para 3; 1 Defence at para 3; 4 Defence at paras 4–5In addition, Rock Holdings Pte Ltd (“Rock Holdings”) was incorporated shortly thereafter, with Yeo as the sole registered shareholder.15Foot Note 15×SOC at para 3; 1 Defence at para 5; 2 Defence at para 5; 4 Defence at para 7Several USA-registered trademarks of some Rock Products (“Rock Marks”) were transferred by Rock Australia to Rock Holdings.16Foot Note 16×SOC at para 37; 1 Defence at para 30; 4 Defence at para 25; SOC at para 3; 1 Defence at para 5; 4 Defence at para 7 7 Around April 2014, the Principal Parties fell into dispute with each other.17Foot Note 17×SOC at para 48; 2 Defence at para 34; 1 Defence at para 42; 4 Defence at para 34The plaintiff and Yeo appointed Biggs as their proxy in Rock Singapore, in an attempt to resolve the dispute.18Foot Note 18×SOC at para 50; 4 Defence at para 36;This failed, and the plaintiff withdrew his proxy shortly around December 2014.19Foot Note 19×SOC at para 51; 4 Defence at para 41Biggs then ceased to be involved in the running of the Rock Business.20Foot Note 20×4 Defence at para 41Subsequently around March 2015, Yeo informed the plaintiff that the plaintiff was no longer authorised to handle matters regarding the corporate affairs of Rock Singapore.21Foot Note 21×SOC at para 57; 2 Defence at para 41; 1 Defence at para 51Around the same time, Tainton and Reid incorporated the 7th defendant, (“Rock Nutrients International”).22Foot Note 22×SOC at para 60; 2 Defence at para 43About a month later, Tainton and Reid instructed Yeo to transfer the cash holdings and contractual rights of Rock Singapore to Rock Nutrients International.23Foot Note 23×SOC at para 61; 1 Defence at para 54In addition, Yeo was to transfer the Rock Marks from Rock Holdings to the 5th defendant (“Rock IP”).24Foot Note 24×SOC at para 61; 1 Defence at para 54; 2 Defence at para 44;The transfers were done accordingly.25Foot Note 25×SOC at para 61; 1 Defence at para 54 8 The plaintiff commenced these proceedings in May 2015.",
        "Parties’ cases": "9 The plaintiff claimed damages for breach of two agreements allegedly made in 2012 and 2014, which he claimed transferred beneficial ownership in Rock Singapore and Rock Business to him. The plaintiff alternatively claimed that he was entitled to such damages and/or shares due to the doctrine of proprietary estoppel, as he had detrimentally relied on representations by the defendants that he would have such shares.26Foot Note 26×SOC at para 66A–66CFinally, the plaintiff also claimed damages for conspiracy and/or deceit.27Foot Note 27×SOC at paras 67–69 10 The defendants denied all of these claims for reasons elaborated below.",
        "The Decision": "11 I found that that the plaintiff did not discharge his burden of proof of proving the various agreements pleaded, as the evidence did not show on a balance of probabilities that there was any such agreement actually formed. There was thus no breach, and no basis for the damages or sums claimed. The other claims put forward on grounds of proprietary estoppel, conspiracy or deceit, were similarly not made out against the relevant defendants. 12 The plaintiff may have been, in his own mind, convinced that the agreements were formed as he had said; his testimony and the various emails and messages he adduced showed that he of the view that the various defendants were subject to the various obligations he claimed. He also did clearly believe in the Rock Business and in his future in the endeavour. However, such subjective belief, no matter how strong, is not sufficient to lead to a verdict in his favour. 13 There were substantial differences in the accounts of facts proffered by the differing parties; extensive portions of the submissions, especially that of the plaintiff, traversed the various conversations, emails, and meetings between the parties. The plaintiff’s closing submissions ran to more than 340 pages,28Foot Note 28×Plaintiff’s closing submissions dated 30 April 2019 (“PCS”)most of which comprised extracting various parts of the testimony of the witnesses. The plaintiff’s description of the background facts alone already ran to about 188 pages. The total of the defendants’ closing submissions ran to   about 570 pages.29Foot Note 29×1 DCS; 2 DCS; 4 DCSEach party’s written reply to the closing submissions similarly went into many pages.30Foot Note 30×Plaintiff’s reply closing submissions dated 18 June 2019 (“PRCS”); 1st defendant’s reply closing submissions dated 18 June 2019 (“1 DRCS”); 2nd, 3rd, 5th and 7th’s defendants’ reply closing submissions dated 18 June 2019 (“2 DRCS”); 4th and 6th defendants’ reply closing submissions dated 18 June 2019 (“4 DRCS”)But in the end, despite the sheer volume of testimony covered, the plaintiff could not draw together enough to make out his case, even on a balance of probabilities. The sheer volume could not overcome the deficiency that none of the evidence, even looked at as a whole, established any agreement. As noted by the defendants, at its best, the plaintiff’s case appeared to primarily invoke statements which were cherry-picked and divorced from the context and background.31Foot Note 31×1 DRCS at p 12 14 In these grounds, some areas will receive greater attention, but it suffices to note that the lengthy testimony and affidavit evidence of the various meetings, email discussions, and conversations did not assist the plaintiff.    They were all in the end, assertions by the plaintiff, or statements reacting to the plaintiff’s one-sided proposals, plans or assumptions. There was nothing raised that could be taken as a positive statement of agreement, or of a representation of fact by any of the defendants.",
        "Issues": "15 Due to the overlap between the issues, they will be discussed in this sequence to minimise the repetition between the analysis: (a) Whether an agreement was formed in 2012, and if so, on what terms; (b) Whether an agreement was formed in 2014, and if so, on what terms; (c) Whether the plaintiff can rely on any estoppel arising out of representations made by the defendants; (d) Whether the claim in conspiracy is established; (e) Whether the claim in deceit is established; (f) If any of the above claims are established, what the quantum of damages should be; and (g) Notwithstanding the above, whether any successful claim should be barred due to illegality.",
        "Whether any agreement existed": "",
        "Plaintiff’s submissions": "2012 Agreement 16 The plaintiff claimed that there was an agreement made between the Principal Parties in 2012 (“2012 Agreement”).32Foot Note 32×SOC at paras 33–38This was allegedly an oral agreement made after a series of negotiations and meetings; as will be seen below, the plaintiff vacillated continually on the alleged date of formation.33Foot Note 33×SOC at paras 34--, 35; PCS at para 311The agreement was allegedly inspired in light of the plaintiff’s contributions of time and expense to growing Rock Singapore and the Rock Business; the need for the plaintiff to relocate from Australia to the US to expand the Rock Business; and for purposes of security that Rock Singapore would continue to have the use of the Rock Marks to carry on the business.34Foot Note 34×SOC at paras 33–38The material terms of the 2012 Agreement included,inter alia, that:35Foot Note 35×SOC at paras 33–38 (a) the plaintiff would have the authority to act as the Chief Executive Officer (“CEO”) of Rock Singapore and the Rock Business; (b) he would be granted equity in Rock Singapore by Tainton and Reid, proportionate to the value of services contributed or monies advanced by the parties to Rock Singapore; (c) the Rock Products would not be sold other than through Rock Singapore; and (d) the Rock Marks were to be transferred to Rock Holdings and remain registered in the name of Rock Holdings. 17 The plaintiff argued that the objective intention of the parties to enter the 2012 Agreement was supported by the relevant documentary evidence and contemporaneous conduct of the parties.36Foot Note 36×PCS at p 221The subsequent conduct of the parties were consistent with the existence of such agreement.37Foot Note 37×PCS at p 234Further, this was a legally binding agreement that was not subject to execution of a formal written document.38Foot Note 38×PCS at p 236In addition, the defendants were estopped from denying the existence of the 2012 Agreement, either due to estoppel by representation, or estoppel by convention.39Foot Note 39×PCS at pp 240–242The 2012 Agreement had not been tainted by illegality as it did not contravene any statute or established common law policy.40Foot Note 40×PCS at p 305 18 The terms of the 2012 Agreement had been breached, essentially due to the transfer of the assets of Rock Singapore to Rock IP and Rock Nutrients International, which diminished the value of the 30% of shares which the plaintiff beneficially owned, and which affected his right to receive past and future dividends of Rock Singapore.41Foot Note 41×SOC at paras 65–66 2014 Agreement 19 The plaintiff claimed that there was a further agreement in 2014 (“2014 Agreement”), made between the Principal Parties as well as Biggs.42Foot Note 42×SOC at para 47The 2014 Agreement was alleged to have been made at a meeting in Seattle around 6 April 2014 (“Seattle Meeting”).43Foot Note 43×SOC at paras 45, 47The material terms of the alleged 2014 Agreement were,inter alia, that:44Foot Note 44×SOC at para 47 (a) the plaintiff was to be paid a compensation amount of US$8,000 per month from April 2011 onwards, as compensation for his services to Rock Singapore; (b) a part of the US$8,000 was to be set aside and treated as a loan to Rock Singapore and to be applied to increase his beneficial shareholding in Rock Singapore’s shares; (c) after taking into account the injection of new capital, the proportion of shares that the plaintiff owns beneficially should be 30%; and (d) the balance of the US$8,000 should be paid to the plaintiff by Rock Singapore as and when funds became available. 20 The plaintiff argued that his account of the Seattle Meeting was more credible than the defendants’, and that it was supported by the documentary evidence.45Foot Note 45×PCS at paras 147, 148Further, the subsequent conduct of the parties had been consistent with the existence of such agreement.46Foot Note 46×PCS at p 271The defendants were estopped from denying the existence of the 2014 Agreement due to estoppel by representation and/or estoppel by convention.47Foot Note 47×PCS at pp 289–292The agreement was a legally binding document, not subject to the execution of a formal written document.48Foot Note 48×PCS at p 288 21 The 2014 Agreement was not tainted by illegality,49Foot Note 49×PCS at p 305and the plaintiff claimed breaches of the 2014 Agreement, for the same reasons as with regards to the 2012 Agreement (at [18]).50Foot Note 50×PCS at para 446 Clarification 22 At this juncture, it is important to clarify what the plaintiff meant when he pleaded that pursuant to both the 2012 Agreement and 2014 Agreement, he became the beneficial owner of 30% of shares in the Rock Business. It was not immediately evident what this meant as the Rock Business is not an entity, and was unable to issue shares. 23 The Rock Business was defined in the Statement of Claim (Amendment No. 1) (“Statement of Claim”) as such:51Foot Note 51×SOC at para 2(c) Rock Singapore is in the business of the supply and sale of agricultural nutrients and associated products outside of Australia under the brand name or in the style of ‘Rock’ (‘Rock Business’) 24 The definition offered in the Statement of Claim showed that Rock Singapore carried out the Rock Business, which supported that shares in the Rock Business referred to shares in Rock Singapore. 25 In addition, the context of the pleadings made clear that 30% shares in the Rock Business referred merely to 30% shares in Rock Singapore. One of the terms of the alleged 2012 Agreement was that “[t]he Plaintiff and Yeo became part beneficial owners of the Rock Business through the granting to them of equity in Rock Singapore by Reid and Tainton”.52Foot Note 52×SOC at para 35(c)This showed that the reference to ownership of Rock Business was only through the ownership of Rock Singapore. Another term reflected that:53Foot Note 53×SOC at para 35(e) The Plaintiff and Yeo were each respectively to remain entitled to the compensation owed to them for the services rendered, where the amounts were to be fixed if and when the Rock Business became profitable, which could then be applied (partially or in full) as equity in Rock Singapore. 26 These showed that the equity claimed under the 2012 and 2014 Agreements was only in Rock Singapore, and not the other Rock entities such as Rock Holdings, Rock IP or Rock Nutrients International. There was no mention in the pleadings that the plaintiff was to own shares in these other entities as a result of the 2012 or 2014 Agreements. The relevance of this clarification becomes clear especially during the discussion on remedies below. 27 Since the plaintiff continually made reference in the pleadings and submissions to his ownership in the Rock Business, similar reference may be made below, but it should be noted that this was regarded as merely a reference to shares in Rock Singapore.",
        "Defendants’ submissions": "28 The defendants argued that no agreement was objectively reached in respect of either the 2012 or 2014 Agreements, as parties were constantly in negotiations and there was no moment ofad idem.54Foot Note 54×2 DCS at para 43; 1st defendant’s closing submissions dated 30 April 2019 (“1 DCS”) at pp 59–62, p 95; 4th and 6th defendant’s closing submissions dated 30 April 2019 (“4 DCS”) at p 50The plaintiff’s evidence does not show where and when such agreement was made.55Foot Note 55×2 DCS at para 43Further, the plaintiff himself was uncertain as to when each of the alleged contractual terms were concluded, and how they were to operate.56Foot Note 56×2 DCS at para 43; 1 DCS at p 94, p 113 29 It was also emphasised that the plaintiff was not a credible witness in general and the veracity of his evidence should be doubted.57Foot Note 57×2 DCS at p 325; 4 DCS at para 55;",
        "The applicable general legal principles": "30 A binding contract is formed when there is an identifiable agreement that is complete and certain; consideration; as well as an intention to create relations (Gay Choon Ing v Loh Sze Ti Terence Peter[2009] 2 SLR(R) 332 (“Gay Choon Ing”) at [46]). Whether there was an identifiable agreement is an objective test, looking at whether there wasad idemof an offer and acceptance (Gay Choon Ingat [57] to [63]). 31 A contract must also be sufficiently complete. It may be binding even if some terms have yet to be agreed upon, as long as all material terms have been agreed (Grossner Jens v Raffles Holdings Ltd[2004] 1 SLR(R) 202 at [14];The“Rainbow Spring”[2003] 3 SLR(R) 362 at [21] to [22]). However, what will count as material will vary from situation to situation. The terms must also be certain; however, any possible gaps may be filled by a previous course of dealing between the parties or trade practice (Gay Choon Ingat [50]). 32 An oral agreement may similarly be binding, without the need for it to be reduced to written form. Parties were in agreement as to the principles of ascertaining the existence of an oral agreement, referring to [53] ofARS v ART[2015] SGHC 78:58Foot Note 58×PCS at para 311; 4 DCS at para 91; 2 DCS at para 42; 1 DCS at para 113 (a) in ascertaining the existence of an oral agreement, the court will consider the relevant documentary evidence (such as written correspondence) and contemporaneous conduct of the parties at the material time; (b) where possible, the court should look first at the relevant documentary evidence; (c) the availability of relevant documentary evidence reduces the need to rely solely on the credibility of witnesses in order to ascertain if an oral agreement exists; (d) oral testimony may be less reliable as it is based on the witness’ recollection and it may be affected by subsequent events (such as the dispute between the parties); (e) credible oral testimony may clarify the existing documentary evidence; (f) where the witness is not legally trained, the court should not place undue emphasis on the choice of words; and (g) if there is little or no documentary evidence, the court will nevertheless examine the precise factual matrix to ascertain if there is an oral agreement concluded between the parties.",
        "The 2012 Agreement": "33 Applying the principles, I found that there was no agreement reached in 2012. The evidence relied upon by the plaintiff was not enough to establish any agreement. The absence of any documented, express rejection; the fact that money was put in; and the subsequent conduct of the parties, did not show that there was a concluded agreement. Further, I agreed with the plaintiffs that the alleged terms were not certain. Insufficient evidence of agreement 34 Evidence must be put forward by the plaintiff to discharge his burden of proof on a balance of probabilities of showing that agreement exists (see [32] above). The evidential burden was a primary stumbling block for the plaintiff as the evidence was strongly contested, since the alleged agreement dated back to events several years in the past. 35 The evidential burden was heightened due to the extensiveness of the agreement pleaded. The 2012 Agreement as pleaded by the plaintiff was not simple, containing 12 terms,59Foot Note 59×SOC at para 35dealing with a range of issues (see [16] above) including: ownership rights; the plaintiff’s role as CEO; the loan agreement; and transfer of trademarks, amongst others. The plaintiff was unable to prove when each of the 12 terms were agreed upon, with the evidence barely touching upon some of these terms.60Foot Note 60×2 DCS at paras 69 to 79, 128, 133, 135. 36 The difficulty was compounded as the plaintiff pleaded that this was a purely oral agreement. The plaintiff did not adduce any objective direct evidence to corroborate his claim, such as voice or video recordings of the oral negotiations. There were also no proper minutes of the meetings. As will be seen below, the plaintiff relied solely on subjective testimony of various witnesses and circumstantial evidence. There was a dearth of details in the evidence adduced, which underlined the substantial uncertainty and lack of evidence about the various terms agreed and which showed that there was no agreement on these various matters. 37 Evidential burden aside, even as a matter of practicality and commercial reality, it is relatively more difficult for a relatively extensive agreement with 12 terms to be made completely orally. There is a chance that parties may forget one of those 12 terms, in addition to the risk that parties may easily renege or deny such an agreement. This decreases the likelihood that parties would intend to enter a legally binding contract of 12 terms simply orally, especially on a matter of such importance. (1) Whether there was a precise point where agreement was reached 38 The plaintiff had been unable to prove a particular point in time in which agreement was in fact reached, despite offering many inconsistent positions as to when the agreement was allegedly reached. 39 The plaintiff’s position vacillated a significant number of times. In the Statement of Claim, the plaintiff did not specify a reasonably certain date, merely stating that the 2012 Agreement was reached after a series of negotiations and meetings (at paras 34 to 35).  The negotiations and meetings referred to include various correspondences,61Foot Note 61×SOC at para 35Ecalls, and meetings in Docklands,62Foot Note 62×Plaintiff’s Affidavit of Evidence-in-Chief dated 10 September 2018 (“P AEIC”) at para 39Gold Coast,63Foot Note 63×P AEIC at paras 57, 81and Melbourne.64Foot Note 64×SOC at para 35C; P AEIC at para 63This was refined in the plaintiff’s further and better particulars, where the plaintiff claimed that the 2012 Agreement was made over the course of October 2011 to October 2012.65Foot Note 65×2 DCS at para 46; Plaintiff’s further and better particulars dated 27 August 2015 (“P FNBP”) at p 12However, in the plaintiff’s affidavit of evidence in chief dated 10 September 2018, the plaintiff seemed to be claiming that the 2012 Agreement was reached by phone call(s) around May 2012 (the “May 2012 Calls”), during which Tainton and Reid “agreed to [his] owning 30% of the business”.66Foot Note 66×P AEIC at para 59This changed again in court, where the plaintiff testified that an agreement was reached in late 2011 at a meeting in Docklands between Tainton, Reid and himself (“Docklands Meeting”).67Foot Note 67×Notes of Evidence dated 5 October 2018 (“NE 5 October 2018”) at p 109, lines 9 to 18; PCS at para 50This seems to have changed yet again in the plaintiff’s written closing submissions, where he did not seem to have identified a precise point when the 2012 Agreement was formed. The lack of a precise date was criticised by the defendants in their various written closing submissions,68Foot Note 68×1 DCS at para 134; 4 DCS at paras 125 to 132;to which the plaintiff responded in the reply closing submissions that the court should not be overly concerned about the date, but adopt a flexible and holistic approach.69Foot Note 69×PRCS at pp 12 to 20Finally, the plaintiff also made an alternative argument that the 2012 Agreement was actually two agreements, with some terms agreed during the May 2012 Call, and other terms during a meeting in June 2012 in Melbourne (“Melbourne Meeting”).70Foot Note 70×PRCS at p 24 (A) Whether a precise point of agreement is necessary 40 The plaintiff argued quite forcefully that the court should not be overly focused on the point of agreement, but adopt a flexible and holistic approach.71Foot Note 71×PRCS at pp 12 to 20He relied on the Court of Appeal case ofProjection Pte Ltd v The Tai Ping Insurance Co Ltd[2001] 1 SLR(R) 798 (“Tai Ping”) which seemed to have had departed from the strict analysis of offer and acceptance.72Foot Note 72×PRCS at para 17He argued that this should especially be the case for oral agreements based on continuing negotiations, since its nature is such that they may not consist of a single meeting or conversation where parties agree in no uncertain terms (see alsoNaughty G Pte Ltd v FortuneMarketing Pte Ltd[2018] 5 SLR 1208 at [57]).73Foot Note 73×PRCS at paras 15, 20It would be unduly onerous to insist that the contract will fail unless a precise point is identified, as this would be uncommercial and impractical.74Foot Note 74×PRCS at para 15Such a holistic approach is eminently sensible as oral agreements may be based on unspoken understandings.75Foot Note 75×PRCS at para 24This would also be wholly consistent with the overarching aim of contract law, to ensure that the reasonable expectations of honest men are not disappointed (Tribune Investments Trust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407 at [40]).76Foot Note 76×PRCS at para 12 41 The plaintiff also cited many foreign cases and academic texts in support of his proposition, including from Australia, British Columbia, New Zealand and UK.77Foot Note 77×PRCS at paras 12 to 24I found it unnecessary to deal in depth with these foreign cases and materials because, as will be further seen below, the offer and acceptance analysis is well established in Singapore, even for oral agreements and continuing negotiations. 42 The Court of Appeal case ofTai Pingprovided strong support for the plaintiff’s proposition, stating that the traditional analysis of offer and acceptance is not helpful in the case of continuing negotiations (at [16] to [17]): 16 In the present case, the parties were involved in continuing negotiations… over a period of time. In such cases, the traditional analysis of offer and acceptance is not really helpful in determining the true position. In this regard, we agree with the observation expressed by Lord Denning MR inPort Sudan Cotton Co v Govindaswamy Chettiar & Sons[1977] 2 Lloyd’s Rep 5 [(“PortSudan”)] at 10: … I do not much like the analysis in the text-books of inquiring whether there was an offer and acceptance, or a counter-offer, and so forth. I prefer to examine the whole of the documents in the case and decide from them whether the parties did reach an agreement upon all material terms in such circumstances that the proper inference is that they agreed to be bound by those terms from that time onwards. His Lordship repeated, in substance, his observation inButler Machine Tool Co Ltd v Ex-Cell-O Corporation (England) Ltd[1979] 1 All ER 965 where he said: I have much sympathy with the judge’s approach to this case. In many of these cases our traditional analysis of offer, counter-offer, rejection, acceptance and so forth is out-of-date... The better way is to look at all the documents passing between the parties and glean from them, or from the conduct of the parties, whether they have reached agreement on all material points, even though there may be differences between the forms and conditions printed on the back of them.  17 A similar view was also expressed inChitty on Contractsvol 1 (27th Ed, 1994) at para 2-017: Continuing negotiations. When parties carry on lengthy negotiations, it may be hard to say exactly when an offer has been made and accepted. As negotiations progress, each party may make concessions or new demands and the parties may in the end disagree as to whether they had ever agreed at all.The court must then look at the whole correspondence and decide whether, on its true construction, the parties had agreed to the same terms. If so, there is a contract even though both parties, or one of them, had reservations not expressed in the correspondence. [emphasis in original] 43 However, despite the Court of Appeal’s seeming eschewal of the offer and acceptance model, they had effectively still applied the offer and acceptance model on the facts of the case, finding that there were multiple offers made which was finally accepted via a crucial acceptance document made on a specific date, 31 March 1999: 19 … Finally the parties met on 9 March 1999. At that meeting, Mr Ong requested for an increase in the amount offered by Tai Ping. No agreement was reached at the meeting. Thereafter, sometime near the end of March 1999, Douglas again requested Mr Li to increase the amount. On 31 March 1999, Tai Ping wrote to OCW as follows: We refer to the previous correspondence and discussion in the above connection. We are pleased to advise that we agree to adjust the proportion borned [sic] by Insured under Section II, from 30% to 20% of the loss. After adjustment, the final figure payable is S$553,560.98. We enclose herewith a Discharge for your onward transmission for Insured’s signature. 20 … Viewed against that background, it is abundantly clear to us that by the letter of 31 March 1999, Tai Ping agreed to increase the payment to $553,560.98 sought by PPL in settlement of their claim. In our judgment, with the receipt of that letter the parties had arrived at a clear compromise on the amount to be paid in settlement of PPL’s claim. 44 Hence, despite the remarks inTaiPing, the court still found that there was a precise point where the acceptance was given, which was the letter on 31 March 1999. This was consistent with the offer and acceptance model. The remarks hence did not represent departure from the offer and acceptance model. 45 This issue was subsequently discussed again by the Court of Appeal inGay Choon Ing(above at [30]), where the court stated that the flexible approach was radical, and that the traditional offer and acceptance model was the approach in Singapore (at [62] to [63]). The court observed (at [63]) that inButler Machine Tool Co Ltd v Ex-Cell-O Corporation (England) Ltd[1979] 1 WLR 401, Lord Denning MR was alone in advocating the flexible approach, whereas the majority adopted the traditional offer and acceptance analysis. It further noted that Lord Denning MR himself had endorsed the traditional approach, despite advocating the flexible approach (at [63]). The Court of Appeal also noted that the flexible approach “has not really found favour with the [UK] courts and… appear to have been all but rejected” by the House of Lords inGibson v Manchester City Council[1979] 1 WLR 294 (at [63]). The Court of Appeal then concluded that the traditional offer and acceptance model should still apply, but less dogmatically, by considering the context in which the agreement was concluded, and examining the whole course of negotiations (Gay Choon Ingat [63]): Whilst it is true that the court concerned must examine the whole course of negotiations between the parties (see above at [53]), this should be effected in accordance with the concepts of offer and acceptance. Whatisrequired, however, is a less mechanistic or dogmatic application of these concepts and this can be achieved by having regard to thecontextin which the agreement was concluded. Looked at in this light, the traditional approach is not, in substance at least, that different from the broad approach advocated by Lord Denning. Indeed, the traditional approach is probably the approach that has hitherto been adopted in the Singapore context (see, for example, the Singapore Privy Council decision ofThe Master Stelios[1983–1984] SLR(R) 26 as well as the Singapore High Court decision ofPac-Asian Service Pte Ltd v Westburne International Drilling Ltd[1981–1982] SLR(R) 588) and, as just mentioned, we see no reason why it should not continue to be adopted (albeit with the context of the contract always being borne in mind). [emphasis in original] 46 The High Court in various local cases have also accepted that an agreement comes into being as an event, not a process, and there has to be a single point in time when the necessary consensusad idemis reached (Independent State of Papua New Guinea v PNG Sustainable Development Program Ltd[2019] SGHC 68 (“PNG”)at [149];Lipkin International Ltd v Swiber Holdings Ltd and another[2015] 5 SLR 962 (“Lipkin”)at [42]). 47 I accepted the guidance from these casesthat a flexible approach does not require departure from the offer and acceptance model, but simply requires a deeper appreciation of the context of the agreement, by looking through the whole course of negotiations. This can also be seen in the authorities relied on by the plaintiff. In Edwin Peel,Treitel: The Law of Contract(Sweet & Maxwell, 14th Ed, 2015) at para 2-017, it was observed that: Continuing Negotiations … The court will then look at the entire course of the negotiations to decide whether an apparently unqualified acceptance did in fact conclude the agreement. If it did, the fact that the parties continued negotiations after this point will not normally affect the existence of the contract… The text supported that an unqualified acceptance was necessary, and that there is a point where a contract is formed. 48 Having a precise point of formation is also important for many other reasons. The time of formation affects important matters such as the limitation period for contractual actions, the time when obligations begin and the time of expiry of contract. Without a point of formation, it would be impossible for the court to determine these auxiliary matters. 49 This requirement is also necessary in order to give commercial certainty to the parties that their continuing negotiations would not be taken to be a binding contract unless there was a clear acceptance at some point in time. There are two competing interests at play which have to be balanced. On one hand, the court needs to protect the party who subjectively views that there is a contract, and acts in reliance on this contract. On the other hand, the court needs to ensure that the other party who subjectively views that he is merely engaging in negotiations is not unfairly bound by a contract he did not subjectively intend to enter. The balance between these interests is met by requiring the plaintiff to be able to adduce some objective document or fact to objectively show that an agreement was definitively reached at a particular point. This could be as simple as a text stating “I agree to your terms”, or a phone call saying that “I accept”, or in some cases, based on the context, even a handshake at the end of a meeting. It is not desirable nor sufficient for a plaintiff to pool together a universe of emails, messages and conduct, and argue that the collective sum of these show that an agreement must have had been reached, without showing when the definitive point was. The court’s readiness to conjure up a binding contract from a series of equivocal negotiations and subsequent conduct may encourage litigation by hopefuls, and also create commercial uncertainty amongst parties engaging in negotiation. As the plaintiff rightly pointed out, continuing negotiations can be complicated, making it difficult to ascertain the subjective intentions of parties, which is precisely why the requirement of a precise point of agreement is needed to provide certainty as to when a court will find a negotiation to have crystallised into an agreement. It provides more certainty for the court to draw a clear a line, and for parties to strive to meet that standard, than for the court to have such a flexible standard that parties never know when it is met in each case. 50 Before addressing whether the plaintiff’s numerous alternative submissions proved a precise point of formation, I will first briefly address some issues on pleadings. (B) Whether the pleadings were reasonably certain as to the date of formation 51 The defendants argued in their written closing submissions that the plaintiff’s pleadings were not reasonably certain as to the date of formation, since they merely stated that the agreement was made over the course of October 2011 to October 2012 (see also above at [30], [38]).78Foot Note 78×2 DCS at para 46; 1 DCS at para 132They argued that although a party does not need to plead the precise date of formation, the date must be pleaded with reasonable certainty (seePNG([46] above) at [148]).79Foot Note 79×2 DCS at para 45 52 The plaintiff did not contest that the pleadings were not reasonably certain. Instead, the plaintiff argued that notwithstanding the lack of particularisation, the evidence specified when the agreement was reached.80Foot Note 80×PRCS at para 3`The plaintiff argued that defects in the pleadings can be allowed if it does not cause irreparable prejudice, and if it is not a radical departure, such that the defendants’ preparation of the case and conduct of the trial would not have had been different.81Foot Note 81×PRCS at paras 36, 39The plaintiff relied onNagase Singapore Pte Ltd v Ching Kai Huat and others[2007] 3 SLR(R) 265 (“Nagase”), amongst other cases, for these propositions. 53 I agreed with the defendants, and found that the requirement to plead a reasonably certain date of formation is a necessary corollary of the requirement that a contract has a precise point of agreement. The date must be pleaded with reasonable certainty to set the scope of the issue contested, and to give fair notice to the other party. 54 I agreed that the plaintiff’s pleadings were not reasonably certain and could have justified a striking out before commencement of the trial. InLipkin([46] above), the court struck out the plaintiff’s pleadings, finding that it was unarguable to plead that the oral contract was concluded over a two-month period, and that it was vexatious for the plaintiff to experiment by pleading different dates and different bases for the same contract (at [42], [49]). InPNG([46] above), it was held that pleadings identifying a 20 day period as the time where the agreement was formed was not reasonably certain (at [149]).A fortiori, in this case, it was untenable for the plaintiff to plead that the oral agreement was formed over a year. Indeed, a striking out action may have had saved both parties significant amounts of costs and time. The vagueness led to extensive resources having to be spent to deal with many alternative submissions as to when the contract was formed. Clarity on the precise point of formation being pleaded would have had reduced all these unnecessary costs. 55 Nevertheless, it was too late for the defendants to apply to strike out the pleadings when the trial had already concluded (Singapore Court Practice 2017(Jeffrey Pinsler gen ed) (Lexis Nexis, 2017) at para 18/19/8). The issue was merely whether the court should still consider the plaintiff’s submissions and decide on those issues, despite the defective pleadings. (C) Whether the court should adjudicate issues based on defective pleadings 56 It is trite that the function of pleadings is to give fair notice of the case which has to be met and to define the issues which the court will have to decide on so as to resolve the matters in dispute between the parties (Lee Chee Wei v Tan Hor Peow Victor[2007] 3 SLR(R) 557 (“Lee Chee Wei”) at [61]). They delineate the parameters of the case and shape the course of the trial (V Nithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) vButhmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 (“V Nithia”) at [36]). Claims not pleaded will generally not be considered by the court (V Nithiaat [38]). 57 However, the court is not required to adopt an overly formalistic and inflexibly rule-bound approach, and departure from the general rule is allowed where no prejudice is caused to the other party in the trial or where it would be clearly unjust for the court not to do so (V Nithiaat [39]- to [40]). Evidence given at trial, where appropriate, can overcome defect in the pleadings provided that the other party is not taken by surprise or irreparably prejudiced (OMG Holdings Pte Ltd v Pos Ad Sdn Bhd[2012] 4 SLR 231 at [18]). 58 I considered that it was appropriate to rule on the substantive issues although the pleadings were less than satisfactory. First, this was not a case where the submissions were out of the scope of the pleadings, but it was merely that the pleadings were vague. Although the argument evolved from formation over the course of a year to formation at various points in time, those alleged points in time all fell within the period of October 2011 to October 2012. They were not strictly speaking inconsistent with the pleadings. 59 This approach was also taken inPNG([46] above). There, the pleadings set out a 20 day period as the duration of formation, which the court found was not reasonably certain. However, the evidence, submissions and pleadings seen together presented three possibilities as to the date of formation (at [149]). The court held that the pleadings were less than satisfactory but nevertheless went on to rule on the substantive issues, finding that neither of those three possibilities proved formation (at [149] to [178]). 60Nagase, which the plaintiff relied on ([52] above),was not on point with respect to the present case, but the principles provided some guidance.Nagasestands for the proposition that a positive defence must be pleaded via a pregnant denial, but a positive defence may still be raised in relation to a bare denial if the contents to the positive defence in the defendant’s affidavit were not objected to by the plaintiff (at [167] to [177]). In such a scenario, the positive defence can be seen to be a mere development of the pleaded denial (at [175]). In the present case, it was similarly possible for the plaintiff’s evolved case to be seen as a development of the pleadings. 61 Second, I found that there was no irreparable prejudice to the defendants, and they were not taken by surprise, as to the arguments about the date of formation. Since the plaintiff originally pleaded that the 2012 Agreement was formed over October 2011 to October 2012, it would have in any event been necessary for the defendants to prove that no agreement was formed throughout the entirety of this time. Evolution of the plaintiff’s case such that the date of formation was a specific time within this period, thus did not materially change the defendants’ litigation strategy or burden at trial or in submissions. Indeed, the defendants were able to sufficiently raise evidence at trial and make arguments to deal with each of the plaintiff’s alleged points of formation. I was also able to deal with all the issues in relation to each of the alleged point of formation claimed. Further, the defendants did not object to the plaintiff’s evidence at trial and in the plaintiff’s affidavit of evidence-in-chief (“AEIC”).82Foot Note 82×PRCS at para 35 62 In contrast, not ruling on the issues would have been unjust to the plaintiff as he had already expended significant resources to carry the case through the entire trial. It was in the interest of justice to all parties that the issues were decided once and for all. Further, the challenge to the pleadings was not raised earlier, depriving the plaintiff of a chance to seek amendment of pleadings. (D) The Docklands Meeting 63 The plaintiff referred to the Docklands Meeting, as the starting point of negotiations leading to the alleged 2012 Agreement.83Foot Note 83×PCS at para 50;This was where the plaintiff first breached the topic to Tainton and Reid about him wanting equity in the Rock Business.84Foot Note 84×PCS at para 50 64 The plaintiff kept vacillating as to whether an agreement was reached at the Docklands Meeting. Initially, the plaintiff testified that an agreement was reached:85Foot Note 85×Notes of Evidence dated 5 October 2018 (“NE 5 October 2018”) at p 109, lines 9 to 18 Q: So your case is that in Docklands, [Tainton] and [Reid] agreed? A:  They agreed they were prepared. Q:  …. What is your case? Did they agree to give you 30 per cent or did they not agree to give you 30 per cent? A: They agreed. Q: So that is your case, that they agreed in Docklands to give you 30 per cent? A: Yes. 65 However, the plaintiff subsequently admitted under cross-examination that he thought that he only got beneficial ownership on 18 May 2012, which was subsequent to the Docklands Meeting: Q. Okay. Now, we have established that in 2011, and prior to the 2012 agreement, [Tainton] and [Reid] are 100 per cent beneficial owner, because the legal ownership lies in you and [Yeo]; you remember that? A. Yes. Q. Okay. So, prior to the 2012 agreement -- A. Yes, sir. Q. – [Tainton] and [Reid] are both 100 per cent beneficial owner so– A. I think -- I think May 18th was when I had beneficial own -- but yes. 66 The plaintiff’s closing submissions and AEIC were also equivocal on whether he was submitting that an agreement was reached during the Dockland Meeting. He argued that Tainton and Reid told him that “they were prepared to give [him] 30% equity in the business”, without stating that this was an agreement, instead characterising the statements as “assurances”.86Foot Note 86×PCS at paras 52 to 53; P AEIC at para 42 67 Finally, in the plaintiff’s reply closing submissions, he argued that the 2012 Agreement was actually two agreements, with some terms agreed during the May 2012 Call, and other terms during the Melbourne Meeting (above at [39]), which showed that no agreement was made during the Dockland Meeting. 68 From the above, it does not seem that the plaintiff is seriously arguing that the 2012 Agreement was formed at the Docklands Meeting. Indeed, the Docklands Meeting was not even mentioned in the Statement of Claim.87Foot Note 87×SOC at paras 33 to 35EIt is inconceivable that the plaintiff would have left this out of the pleadings if he genuinely believed that the agreement was formed at that time. 69 The plaintiff’s subsequent conduct also clearly showed that he did not believe that an agreement had been reached at the Docklands Meeting. He remained concerned and worried that he did not have any equity in the Rock Business, and continued asking Tainton and Reid for equity. This can be seen from the plaintiff’s testimony:88Foot Note 88×NE 5 October 2018 at p 125 Q. If they had agreed in Docklands, why were you saying this in April 2012, “with no equity in the business despite what we had discussed in the Docklands”? Why would you say such a thing to [Tainton]? A. I think I am making reference to the fact that I am not receiving any money and nothing has been recorded about equity and that I am meeting ongoing expenses which were growing. I am paying [Kaminski’s] salary out of my own pocket and I am concerned. I am feeling vulnerable that what we agreed on in the Docklands isn’t transpiring. 70 This can also be seen from the plaintiff’s correspondence to Tainton and Reid on 4 May 2012 where he said that: “I invest like an owner and work like a negro … but I have no ownership… Rock stock and Barrel Rock is 100% yours”,89Foot Note 89×2 DCS at para 60and that “It just bugs me a bit I am investing so much money and time but have no upside if the business gets sold”.90Foot Note 90×2 DCS at para 60The plaintiff would not have behaved this way if a legally binding agreement had been previously reached at the Docklands Meeting. 71 The plaintiff’s witness, Kaminski, a former employee of Rock Singapore,91Foot Note 91×Kristopher Ryan Kaminski’s affidavit of evidence-in-chief dated 10 September 2018 (“Kaminski’s AEIC”) at para 2also testified that he was never told about any agreement reached in 2011 (the Docklands Meeting happened in late 2011).92Foot Note 92×Notes of Evidence dated 11 October 2018 (“NE 11 October 2018”) at pp 30 to 31; 2 DCS at para 58 72 Finally, as argued by the defendants, there was no email communication referring to any agreement at the Docklands Meeting.93Foot Note 93×2 DCS at para 59Given the importance of the matter, it was strange that there was no follow up to put it in some kind of writing. 73 In comparison, Tainton and Reid had been consistent in their position that there was no agreement reached at all, whether at the Docklands Meeting or otherwise. 74 Given these reasons, I accepted the defendants’ version and found that there was no agreement made at the Docklands Meeting. (E) The May 2012 Calls 75 The plaintiff argued that an agreement was reached via the May 2012 Calls for him to become part beneficial owner of the Rock Business, although this was not stated in the pleadings.94Foot Note 94×SOC at paras 33 to 35E; 2 DCS at paras 62 to 65Instead, the pleadings referred to the May 2012 Calls merely as “representations”.95Foot Note 95×SOC at para 35BThis new position was taken in his AEIC,96Foot Note 96×P AEIC at para 59at trial, and in the reply closing submissions.97Foot Note 97×PRCS at para 32 76 Notably, the plaintiff himself was unclear as to whether the agreement was allegedly made over one call or multiple calls. He testified at trial that “I’m not sure if it was the same conversation or a separate conversation, but there were communications”.98Foot Note 98×NE 9 October 2018 at p 6; see also NE 5 October 2018 at pp 129 to 131The plural term, “May 2012 Calls”, was used for ease of reference. 77 The plaintiff did not provide much elaboration on the specific details of the May 2012 Calls. He argued that “[Tainton] said he and [Reid] had agreed to [the plaintiff’s] owning 30% of the business and were going forward on the basis we had discussed in the Docklands”.99Foot Note 99×P AEIC at para 59This seems to be arguing that the assurances made at the Docklands Meeting were made legally binding through the May 2012 Calls. The plaintiff then said that he had emailed Yeo to prepare documents to record the agreement accordingly.100Foot Note 100×P AEIC at para 59The plaintiff’s case seems to be that the agreement was made binding through the calls, but the documents were merely for documentation purposes. 78 On the other hand, Tainton and Reid denied ever making such statements over the phone.101Foot Note 101×2 DCS at para 144 79 I found that the plaintiff’s evidence failed to prove that any binding legal agreement was made during the May 2012 Calls. First, the plaintiff bore the burden of proof of showing that such statement was made, and he had not done so as there was nothing much to rely on apart from his oral evidence, which was flatly denied by the defendants. I accepted that that the defendant’s version was to be preferred, because the tenor and content of the emails adduced in evidence (see below) pointed against the allegations made by the plaintiff. 80 Second, the circumstances made it unlikely for a binding legal agreement to be made. The plaintiff’s testimony was that the calls were made over speakerphone as he was driving.102Foot Note 102×P AEIC at para 54The decision to transfer shares was an important one that was unlikely to have been made in such a casual and spontaneous manner. There were also 11 other rather important terms which were supposed to have had been made as part of the 2012 Agreement. In that context, the calls seemed more like a casual discussion, rather than a serious one with an intent to enter a binding agreement. 81 Third, and most importantly, the contemporaneous documents pointed against any agreement. If there had indeed been an agreement reached during the May 2012 Calls, the plaintiff would likely have referenced it in his emails. However, the plaintiff did not make any reference to the call in his contemporaneous emails to Yeo, Tainton or Reid.103Foot Note 103×2 DCS at para 153; Chronological Bundle of Documents Volume 3 dated 5 September 2018 (“3 CBD”) at pp 1314-1315Tellingly, in an email to Yeo made on 18 May 2012, which was shortly after the time of any alleged call, no mention was made of any agreement.104Foot Note 104×2 DCS at para 153; 3 CBD at pp 1314-1315 82 Instead, the plaintiffs’ various emails showed that there had been no such agreement. In the email on 18 May 2012, the plaintiff stated that “[t]he only agreement I know of is the side agreement that has [Reid] and [Tainton] listed with 50% each”.105Foot Note 105×2 DCS at para 153; 3 CBD at pp 1314-1315In a further email on 19 May 2012, the plaintiff stated that “I know the only way Tainton and [Reid] will agree is if it is presented with a ton of feathers”.106Foot Note 106×2 DCS at para 154; 3 CBD at pp 1313In addition, in an email on 24 May 2012 by the plaintiff to Yeo, the plaintiff states unequivocally that “[Tainton] and [Reid] do not want to part with any ownership”.107Foot Note 107×2 DCS at para 155; 3 CBD at p 1312Although the plaintiff tried to characterise that email as referring only to an unwillingness to part with further ownership, this went against the plain words.108Foot Note 108×2 DCS at para 155.2 83 There was thus a lack of consistency between the evidence of the plaintiff and the objective evidence in the form of the emails. These various inconsistencies showed that there was no such agreement reached. One would have expected the plaintiff to have relayed such agreement to Yeo. However, Yeo testified that he never heard such news from the plaintiff.109Foot Note 109×2 DCS at para 153.2There were other occasions in which the plaintiff would have been expected to make mention of such agreement, but did not do so.110Foot Note 110×2 DCS at para 153.4 (F) The Melbourne Meeting 84 After vacillating multiple times, the plaintiff seemed to rest on the position that the agreement was reached at the Melbourne Meeting. This was the position taken in the reply closing submissions, which was the last word of the plaintiff.111Foot Note 111×PRCS at paras 31 to 32As stated, this departed from the pleadings, which only mentioned that the Melbourne Meeting confirmed the representations made during the May 2012 Calls, but did not plead that an agreement was reached at the meeting.112Foot Note 112×SOC at paras 35 to 35E; 2 DCS at para 170 85 The problem with this submission is that it inherently admits that no binding agreement had been reached prior to the Melbourne Meeting. It also casts doubt on the evidence adduced to show that a binding agreement was reached at other times. Further, the fact that the plaintiff kept vacillating and submitting multiple conflicting positions showed that the plaintiff was not sure of his own case. This greatly weakened the plaintiff’s coherence and consistency, and hence his credibility. It was also observed inLipkins([54] above) that it is vexatious for the plaintiff to experiment by pleading different dates and different bases for the same contract. 86 Out of the various dates submitted, the plaintiff provided the most detail about the Melbourne Meeting. He argued that the parties discussed in detail about the capitalisation, that the parties agreed to hold shares in proportion to their investments, and that he would loan money to Reid to give him time to raise money for his shares, amongst other details.113Foot Note 113×PRCS at paras 31 to 33 87 The plaintiff also referred to emails to support that an agreement was reached at the Melbourne Meeting. There was an email sent by the plaintiff to Tainton with a proposal for capitalisation, asking him to consider this before the Melbourne Meeting.114Foot Note 114×PCS at para 77There was also an email the plaintiff sent to Tainton and Reid shortly after the Melbourne Meeting, setting out the respective proportions of shares to be owned by them, and the respective amounts they invested or were to invest.115Foot Note 115×PCS at para 81The plaintiff also relied on Yeo’s emails and testimony at trial.116Foot Note 116×PCS at paras 83 to 85 88 In response, the defendants argued that there were many inconsistencies in the plaintiff’s testimony as to what happened at the Melbourne Meeting, and that he had changed his position several times as to various facts.117Foot Note 117×2 DCS at paras 170 to 185Further, it was inconceivable that Reid, who originally beneficially owned 50% shares in Rock Singapore, would agree to reducing it to 0%.118Foot Note 118×2 DCS at para 182They also tried to argue that the subject of equity was not discussed at the Melbourne Meeting and that it was purely a casual dinner.119Foot Note 119×PCS at paras 77 to 78; Notes of Evidence dated 18 October 2018 (“NE 18 October 2018”) at p 175; Notes of Evidence dated 2 November 2018 (“NE 2 November 2018”) at pp 112 to 113 89 I found that it was more likely than not that the subject of equity was discussed. The plaintiff had emailed Tainton to consider his proposal on equity before the Melbourne Meeting, which clearly showed that he intended to broach the topic. The plaintiff had also been persistently asking about equity ever since the Docklands Meeting and the May 2012 Calls. It was clearly something he wanted to discuss. Reid also admitted that the subject may have had been discussed.120Foot Note 120×PCS at para 78It did not assist the defendants to try to deny that the subject was discussed, or characterise the meeting as purely social. 90 I also did not give much weight to the defendants’ argument that it was inconceivable for Reid’s beneficial ownership was to be substantially reduced in the alleged agreement. It was not wholly inconceivable, given the plaintiff’s efforts and investments in the business, and was a possible way to reach a fair capitalisation. 91 Nevertheless, the plaintiff failed to meet his burden of proof of showing that an agreement was concluded. The email the plaintiff sent to Tainton and Reid shortly after the Melbourne Meeting did not show that an agreement was concluded at the Melbourne Meeting. Instead, it seems to be more of a proposal, as it states: “Guys… I think we should run with this as a start… and work out the rest later. If you want to change the percentage then please do…”121Foot Note 121×PCS at para 81The email was clearly setting out the plaintiff’s opinion as to what he thought should be done as a start. Further, any proposal in the email was not confirmed, as the plaintiff explicitly stated in the email that Tainton and Reid could change the percentage if they wanted to. If the agreement had been confirmed at the Melbourne Meeting, the plaintiff would likely have had explicitly stated that in writing in the email. The fact that nothing was said about any agreement reached is a glaring omission. The email hence instead goes against the plaintiff, instead of assisting his case. 92 The plaintiff’s reliance on Yeo’s email and testimony was also not convincing. Yeo’s email on 25 June 2012 did not show that there was an agreement, but merely stated that he would “work out a schedule based on a [USD]500,000 capitalisation plan”.122Foot Note 122×PCS at para 84; The email stated “SGD500,000” but this was likely an error as the other correspondences showed that the capitalisation was intended to be in USD; see for example PCS at para 81 referring to 3 CBD at p 1358, the quote is hence amended to reflect USD500,000As described by Yeo, the negotiations were only a “plan”, and not shown to be a binding agreement. The plaintiff also tried to cherry-pick parts of Yeo’s evidence at trial to argue that Yeo agreed that there was an agreement formed at the Melbourne Meeting. This was disingenuous, as Yeo had unequivocally stated at trial that he did not agree that there was any agreement at the Melbourne Meeting.123Foot Note 123×Notes of Evidence dated 12 October 2018 (“NE 12 October 2018”) at p 81 93 Finally, even accepting the plaintiff’s testimony at its highest, it did not show that there was a concluded binding agreement. The plaintiff argued that “[Tainton] and [Reid] had agreed to move forward on that basis”, and that Reid “accepted that ownership would be determined in proportion to the percentage of expenses shareholders were prepared to carry moving forward”.124Foot Note 124×PCS at para 73However, these do not disclose that there was an intention to enter into a binding legal agreement. Any statement given could have been merely part of negotiations, indicative of willingness to enter a future contract on those terms. 94 The plaintiff argued that the parties had a past history of concluding deals and doing business without written agreements, which showed that any possible agreement reached was not intended to be subject to formalisation.125Foot Note 125×PCS at para 346This was not sufficiently proven. The parties had seen the need to enter into a written agreement vis-à-vis the April 2011 Agreements. It was not proven why the parties would depart from such practice in the 2012 Agreement, especially where, as stated above at [35], it was not a simple agreement, containing 12 terms, and which was of rather critical importance. (G) The Gold Coast Meeting 95 The plaintiff referred to a meeting in Gold Coast on 17 August 2012 between the Principal Parties, Biggs, Kaminski and Minczanowaski, who was Biggs’s former business partner (“Gold Coast Meeting”).126Foot Note 126×PCS at paras 89 to 94 and p2The plaintiff accepted that no agreement was reached at this meeting.127Foot Note 127×PCS at para 95Instead, the plaintiff argued that the conduct at the meeting suggested that there was an earlier agreement at some point in time.128Foot Note 128×PCS at para 91This is pursued further below. (H) San Francisco Meeting 96 The   plaintiff also mentioned a meeting in San Francisco, but this was not mentioned in the pleadings, AEIC or closing submissions and not strongly pursued.129Foot Note 129×NE 5 October 2018 at p 214 (I) Sub-conclusion 97 Even after going through all the various possible points of formation put forth by the plaintiff, I found that the plaintiff failed to prove that the agreement was formed at any of those points. In light of the earlier finding that it is necessary for the plaintiff to prove a precise point ofad idem(above at [40] to [49]), the plaintiff has failed in the claim and there was strictly no need to discuss the further issues in relation to the 2012 Agreement. (2) Notwithstanding that there was no precise point, whether an agreement was reached 98 A large amount of the evidence raised by the plaintiff were not tied to any precise point of formation. Instead, they were circumstantial evidence arising from subsequent conduct of parties, documentation over a long period of time, as well as testimony of various parties as to the continuing business negotiations. These did not seem to be used by the plaintiff to argue that there was agreement at a particular time, but were merely used to show that, seen holistically, there must have had been formation. Given the above finding that the plaintiff had failed to prove a precise point of formation, and that such a precise point was necessary, there is no need to discuss this, but I shall do so for completeness. In any case, contrary to the plaintiff’s allegations, some of these documents instead pointed against any agreement. 99 In gist, the plaintiff relied on the following evidence: (a)  The alleged fact that the plaintiff was granted the authority to act as the CEO of Rock Singapore and Rock Business, in accordance with an alleged term of the 2012 Agreement;130Foot Note 130×PRCS at para 49 (b) Various correspondences allegedly showing that the defendants accepted that the plaintiff beneficially owned 30% of the shares of Rock Singapore;131Foot Note 131×PCS at paras 339 to 341, and at pp 42 to 95 (c) The lack of any documentation by the defendants refuting that the plaintiff beneficially owned 30% of shares of Rock Singapore;132Foot Note 132×PCS at paras 324, 325 (d) The alleged fact that the parties, at the Gold Coast Meeting, discussed new investors’ investments in Rock Singapore in exchange for equity;133Foot Note 133×PCS at paras 89 to 94 (e) The fact that the Rock Marks were transferred from Rock Australia to Rock Holdings, in accordance with an alleged term of the 2012 Agreement;134Foot Note 134×PCS at paras 111 to 117 (f) The fact that Tainton and Reid had not repaid themselves the US$100,000 each of them loaned to Rock Singapore, showing that they had intended to capitalize it so as to increase their beneficial shareholding according to the terms of the 2012 Agreement;135Foot Note 135×PCS at paras 327 to 330 (g) Biggs’s testimony that he thought that the plaintiff held 30% ownership in the Rock Business even before the Seattle Meeting;136Foot Note 136×PCS at paras 90, 336and (h) A convertible loan agreement where Biggs loaned moneys to Rock Singapore in exchange for an option to convert the moneys to shares.137Foot Note 137×PCS at paras 127 to 132 100 I shall discuss these in turn, before looking at them cumulatively. (A) The plaintiff acting as CEO 101 The plaintiff argued that the fact that he was granted authority to act as CEO showed that there was an agreement, as one of the terms of the 2012 Agreement was for him to act as CEO.138Foot Note 138×PRCS at para 49He relied on Tainton’s evidence which showed that he had been effectively acting as CEO from March 2011.139Foot Note 139×PRCS at paras 51 to 54 102 I did not see the link between the plaintiff acting as CEO and the 2012 Agreement, since he was already acting as CEO in early 2011. Even if he began acting as CEO only after 2012, it was not shown that this must have been because of the existence of the 2012 Agreement. (B) Documents showing support of an agreement 103 The plaintiff adduced various documents showing support of an agreement, including: Yeo’s emails recording that the plaintiff beneficially owned 30% of the shares of Rock Singapore;140Foot Note 140×PCS at paras 109 to 111, 338emails showing that Yeo recorded various loans as investments;141Foot Note 141×PCS at para 122an email from Tainton and Mrs Tainton seemingly admitting the 2012 Agreement;142Foot Note 142×PCS at para 341and emails showing the parties raising funds for the investment.143Foot Note 143×PRCS at para 104 104 These emails showed clearly that there was some kind of proposal for capitalisation. However, they fell short of showing that there was agreement. Prior to and even up until October 2012, it was clear that there was no agreement. The plaintiff himself described the emails as showing that the parties were “working towards finalising the position on equity on 1 October 2012”.144Foot Note 144×PRCS at para 104The position had clearly not been finalised before October 2012. An email on 30 September 2012 sent by the plaintiff, where the plaintiff discusses with Yeo how to allocate an extra 10% of equity, also supports this:145Foot Note 145×3 CBD at pp 1542-1543; 1 DRCS at para 70 … I want it left open and unpaid for other than by us covering it for now with the view it will be used on an employee worth their sal[e] at some stage… but that decision should be one I/we make at the appropriate time… The matter was clearly left open. 105 Even subsequent to that email, the plaintiff was still discussing about the distribution of shares with the proposed investors. There were many different emails with many different proposed distributions, showing that the 2012 Agreement could not possibly have been agreed upon at that time since nothing was fixed. Further, the distribution of equity reflected in all the emails were different from the alleged 2012 Agreement. Some of these are reflected in the table: Source/ PartyEmail from plaintiff to Yeo on 30 September 2012146Foot Note 146×3 CBD at pp 1542 to 1543Proposal from Minczanowaski to plaintiff on 10 October 2012147Foot Note 147×3 CBD at pp 1581 to 1582, 1588Plaintiff’s reply to Minczanowaski on 12 October148Foot Note 148×3 CBD at p 1588Proposal from Yeo to plaintiff on 12 October 2012149Foot Note 149×3 CBD at p 1592Alleged 2012 Agreement150Foot Note 150×SOC at para 35Plaintiff30%30%30%45%30%Yeo10%10%10%10%30%Tainton20%20%20%15%20%Reid20%20%20%15%20%Minczanowaski10%20% (shared with Biggs)10% (shared with Biggs)15%-Extra10%0%10%0%- 106 In response to Yeo’s proposed breakdown sent on 12 October 2012, which was very different from all the earlier previous proposals, the plaintiff replied saying “Keep running [Yeo]… Very good thinking”.151Foot Note 151×3 CBD at p 1592This clearly showed that he accepted that no fixed agreement had been reached and the position was still shifting. 107 In an email on 17 October 2012, Yeo tells the plaintiff: “I am glad you had a good conversation with [Minczanowaski]… [Minczanowaski] is not going to be easy when we put the shareholders agreement together”,152Foot Note 152×3 CBD at p 1594showing that an agreement had yet to be reached and it was pending. Yeo further stated that: “I like to have the agreement agreed upon and signed off by the four of us before we let [Minczanowaski] in so what he will not have too much input in that document”,153Foot Note 153×3 CBD at p 1594which also evinced an intention that there should be a written and signed formal agreement. 108 The discussions continued even until the end of October 2012. In an email on 24 October 2012, Yeo sent Minczanowaski a complex shareholding proposal where Tainton and Reid would each have 20% shares of Rock Singapore, with the remaining 60% to be owned by Rock Holdings, which would be then in turn be owned by Yeo, Minczanowaski and the plaintiff.154Foot Note 154×3 CBD at pp 1605 to 1606On 25 October 2012, Yeo emailed Minczanowaski stating that “I spoke with [the plaintiff] about your proposal about you and Biggs having 50% and [the plaintiff] and I the other 50%... He wants to sleep on this for a few days”.155Foot Note 155×3 CBD at p 1617On 31 October 2012, Yeo forwarded the plaintiff an email from Minczanowaski regarding the shareholding discussions, and said “Talk to you soon”.156Foot Note 156×3 CBD at p 1617These correspondences unequivocally showed that discussions were continuing right until the very end of October 2012. This contradicted the plaintiff’s claim that the 2012 Agreement had been formed by October 2012, and that the extent of financial contributions was determined by 1 October 2012.157Foot Note 157×P FNBP at pp 12, 16 109 In fact, Yeo testified that the position kept changing even up till at least June 2013.158Foot Note 158×Yeo’s affidavit of evidence-in-chief dated 24 September 2018 (“Yeo’s AEIC”) at paras 42 to 43; 1 DCS at paras 136 to 145He referred to multiple emails between the plaintiff and himself,159Foot Note 159×Yeo’s AEIC at paras 42 to 43; 1 DCS at paras 136 to 145and also testified in trial, stating:160Foot Note 160×NE 12 October 2018 at p 130 … There are so many changes from one month before, one month after, there are so many phone conversations, there are so many suggestions of how we’re going to do it. In fact, from probably that period until 2014, we don’t know what the heck is happening, because there are so many changes, so many areas of investing directly, investing through a third vehicle, investing to hide [Tainton] and [Reid] because they were facing bankruptcy. So there were just too many and really nobody knew what was happening… 110 The emails showed that the discussion on the share distributions were clearly ongoing and not fixed.161Foot Note 161×Yeo’s AEIC at paras 42 to 43; 1 DCS at paras 136 to 145Further, the shareholders were also continually changing, with new potential investors being discussed from time to time. 111 In addition, the plaintiff did not explain how the shareholding distribution for the 2012 Agreement was reached. The alleged confirmed distribution contradicted the proposed shareholding breakdown in all the emails mentioned above. The distribution was also contrary to the contributions of the parties as at October 2012 (the date where the plaintiff pleaded the 2012 Agreement was finalised). For example, Yeo’s contributions were only made in December 2012 and not before October 2012.162Foot Note 162×1 DRCS at paras 87 to 89; NE 10 October 2018 at pp 4 to 7 112 I had also found that the plaintiff’s reliance on Yeo’s emails did not assist. Although Yeo, in various emails, recorded the plaintiff as having beneficial ownership and referred to him as a shareholder, these were not final but merely proposed. This was repeatedly explained by Yeo during his evidence at trial and also in his submissions.163Foot Note 163×1 DRCS at paras 66, 76 to 80The emails only reflected a mere starting point that was subject to further discussion and agreement.164Foot Note 164×1 DRCS at paras 66, 76 to 80The fact that Yeo referred to the loans as investments was also not conclusive of an agreement. They could have similarly merely been a starting point. Further, Yeo had admitted that he had used loose language in his emails, but explained that it was because everyone understood that it was merely a discussion and there was no need to be so precise with the language.165Foot Note 165×1 DRCS at para 52I agreed that despite the loose language, the plan could be objectively seen as merely tentative. 113 Finally, I disagreed that Tainton and Mrs Tainton’s email sent on 25 January 2015 was conclusive of an agreement.166Foot Note 166×PCS at para 341; Chronological Bundle of Documents Volume 8 dated 5 September 2018 (“8 CBD”) at pp 4675 to 4676To begin, this was more than two years after the duration when the alleged 2012 Agreement was formed and was of very weak relevance to the 2012 Agreement as it would have been influenced by factors happening between 2012 and 2015. In any case, Tainton testified that the reference to decrease in shares was not agreed, but merely a proposal.167Foot Note 167×NE 18 October 2018 at pp 206 to 207The plaintiff failed to prove that it was conclusive of an agreement. 114 The above reflected that the negotiations were ongoing, and any documents relied on by the plaintiff were merely proposals. (C) Absence of documented rejection 115 The plaintiff argued that despite all the emails he had sent to Tainton and Reid about equity, they had never once documented their rejection of his assertions that he had equity.168Foot Note 168×PCS at para 83The defendants argued that this was because they had called the plaintiff to express their refusal orally.169Foot Note 169×PCS at para 77The defendants also tried to argue that the emails by the plaintiff were part of an elaborate plot by him to plant a trail of emails to make out his case.170Foot Note 170×2 DCS at paras 159 to 160 116 I would not go so far as to say that the plaintiff was devising a plot. I found the plaintiff to have genuinely believed in his case and brought his case in good faith. Nevertheless, such subjective belief was not sufficient to meet the objective test of agreement required. While there was some force to the plaintiff’s argument that there was no protest or confrontation by Tainton and Reid, there is a well-established general rule that silence alone cannot be the foundation of an agreement (seeFelthouse v Bindley(1862) 142 ER 1037 endorsed inCAA Technologies Pte Ltd v Newcon Builders Pte Ltd[2016] SGHC 246 at [80]). This is because silence is ordinarily equivocal and cannot be construed as an acceptance. In the present context, the lack of response was similarly equivocal, possibly being due to the fact that the emails were merely proposals and negotiations, such that Tainton and Reid felt no need to respond. It could have also been because they were exasperated at the plaintiff’s persistence that they let him say whatever he wanted. It was also possible that Tainton and Reid had communicated their rejections orally. (D) Gold Coast Meeting 117 The plaintiff argued that the fact that there was a Gold Coast Meeting to discuss new investors’ investments in Rock Singapore in exchange for equity showed that an agreement had been concluded.171Foot Note 171×PCS at paras 89 to 94This argument was tenuous as it could have been equally plausible that the meeting was pursuant to plans and negotiations, and to further the discussion. (E) Transfer of Rock Marks 118 The plaintiff argued that the fact that the Rock Marks were transferred from Rock Australia to Rock Holdings, in accordance with an alleged term of the 2012 Agreement, showed that the 2012 Agreement must have had been concluded. 119 In response, the defendants argued that the transfer was done without their knowledge and consent.172Foot Note 172×2 DRCS at paras 73 to 77Even though the document was signed by Tainton, he thought that the transfer agreement only pertained to a specific Hydro Halo trademark and not the Rock Marks as a whole.173Foot Note 173×2 DRCS at para 75Further, none of the contemporaneous documents pertaining to the transfer mention that it was made in accordance with the alleged 2012 Agreement.174Foot Note 174×2 DCS at para 118 120 I found that there were some doubts pertaining to the circumstances of the transfer. At the point of signing, only one page of the full agreement was faxed to Reid for signing.175Foot Note 175×PCS at paras 114 to 115Although the plaintiff alleged that the full agreement had been sent separately via email,176Foot Note 176×PCS at para 115there was no evidence that Reid had read it. 121 Even assuming that Reid and Tainton had intended to transfer the Rock Marks, there is no evidence that this was done based on the 2012 Agreement.177Foot Note 177×2 DCS at paras 106 to 118Instead, the plaintiff’s email to Tainton and Reid explaining the rationale for the transfer mentioned that it was because the trademark had been registered illegally, and that it had to be cleaned up.178Foot Note 178×2 DCS at para 113; 3 CBD 1544 (F) Investment by parties 122 The plaintiff argued that the fact that the parties put in money into Rock Singapore and never asked for repayment showed that the money had been put in as investments pursuant to the 2012 Agreement.179Foot Note 179×PCS at paras 100, 122, 212In response, the defendants argued that the moneys were loans, and that there was no need for any repayment since they remained 100% owners of Rock Singapore and it would obviously not make any difference to them whether the moneys were repaid to them.180Foot Note 180×2 DRCS at para 175 123 I accepted the defendants’ arguments. The plaintiff failed to prove that those were investments, since it was equally plausible that the moneys put in were loans which did not have to be repaid. Even if they were investments, they could have been tentative, or a mere starting point, since no resolutions were passed and the required lodgements had not taken place.181Foot Note 181×NE 10 October 2018 at p 27They did not prove the existence of the 2012 Agreement. (G) Biggs’s testimony 124 The plaintiff relied strongly on Biggs’s testimony to show that there had been an agreement.182Foot Note 182×PCS at paras 89 to 95Biggs testified that he thought that the plaintiff owned 30% of beneficial shares.183Foot Note 183×PCS at paras 89 to 95Biggs also testified that the plaintiff had represented at the Gold Coast Meeting, in front of Tainton and Reid, that he had such beneficial ownership.184Foot Note 184×PCS at paras 89 to 95 125 I did not find that Biggs’s testimony proved that there was an agreement. As will be shown in this sub-section and the subsequent sub-section, Biggs’s opinion that the plaintiff owned beneficial shares arose because of the one-sided representations that the plaintiff had made to him. His opinion was not based on discussions or agreements between the parties. Hence, his opinion did not prove that there was agreement between the parties. 126 For example, the plaintiff’s reliance on Biggs’s testimony of what happened at the Gold Coast Meeting was insufficient. The plaintiff relied on this section of Biggs’s testimony during cross examination:185Foot Note 185×PCS at para 91; NE 7 November 2018 at pp 82 to 84 Q. So your position is that at the August 2012 meeting, which was attended by people such as [Tainton], [Reid], you and [the plaintiff], that is where [the plaintiff] represented to you that he was a 30% beneficial shareholder in the business, correct? A. Correct. Q. So when [the plaintiff] said to you at the August 2012 meeting that he was a 30% beneficial shareholder, you believed that to be true, correct? A. I had no reason to disbelieve it. Q. And you believed it to be true and you had no reason not to believe it, because [the plaintiff] said this to you in the presence of [Tainton] and [Reid], correct? A. They were there, yes. Q. And you knew that [Tainton] and [Reid] were the original owners of the business before [the plaintiff’s] involvement and yet [Tainton] and [Reid] did not disagree with what [the plaintiff] was saying, correct? A. They disagreed later. COURT: But at the meeting? A. At the meeting, no. MR QUEK: And is it correct to say that in fact [Tainton] and [Reid] agreed with [the plaintiff] when he said at the meeting that he was a 30% beneficial owner? A. No. Q. So your position is that [the plaintiff] said at the meeting he was a 30% beneficial shareholder and everyone at the meeting just kept silent; is that your evidence? A. Well, [the plaintiff] was actually talking to Minczanowaski and myself and there were other conversations going on as well. Q. But everybody was at the same meeting, correct? A. Everybody was at the same venue. COURT: Just to be clear, Mr Biggs, this wasn’t a large venue, everyone was around the same table basically? A. They were, yes, your Honour. 127 However, this extract shows precisely why Biggs’s testimony does not help the plaintiff. Biggs testified that it was the plaintiff who had represented to him that he owned 30% beneficial shares. He did not mention that he gained such an opinion from anyone else other than the plaintiff. Biggs believed the plaintiff, which was why he accepted that the plaintiff did own the shares. Hence, Biggs’s opinion was formed in a large part due to the plaintiff’s influence and merely reflects what the plaintiff subjectively thought, without objectively showing that Tainton and Reid had agreed. 128 Although the plaintiff had made the representation in front of Tainton, Reid, and the others who were present at the meeting, Biggs testified that the plaintiff was only talking to himself and Minczanowaski at that material time. There had been other conversations going on at that time, and Tainton and Reid may not have had heard what the plaintiff said. 129 In any case, even if Tainton and Reid had heard the representation, it was not the plaintiff’s case that they positively agreed to the representation. The plaintiff’s case seems to be that they merely kept silent. Such silence did not prove that there was an agreement. It has been established above that silence is ordinarily not an agreement (above at [116]), and the same is true in this case, where the plaintiff’s representation could have been interpreted by Tainton and Reid as merely a representation of the future position, or of negotiations. There could have been many reasons why they kept silent and the plaintiff did not prove that the silence meant that there was an agreement. (H) The convertible loan agreement 130 The plaintiff referred to a convertible loan agreement (“CLA”) where Biggs loaned moneys to Rock Singapore in exchange for an option to convert the moneys to shares.186Foot Note 186×PCS at paras 127 to 132The plaintiff relied on Biggs’s testimony that during the course of discussions leading towards the CLA, Biggs had thought that the plaintiff had beneficial ownership in Rock Singapore, and that Tainton had never given Biggs the impression that only Tainton and Reid were beneficial owners.187Foot Note 187×PCS at para 128 131 However, the discussions referred to by the plaintiff took place in 2013, which was after the period of time where the plaintiff alleged the 2012 Agreement was formed. Even assuming Biggs’s opinion was reflective of the truth, it does not prove that the agreement had been formed by 2012. In any case, although Biggs’s testimony is probative, it is only circumstantial evidence which does not sufficiently prove that agreement had been reached. His opinion that the plaintiff had beneficial ownership was in a large part influenced by the plaintiff. Although Tainton and Reid did not give him any contrary impression, this does not mean that Tainton and Reid had agreed to the terms alleged by the plaintiff. (I) The cumulative effect of the evidence 132 In certain cases, it may be that individual strands of evidence would not be sufficient to establish a case and a holistic view needs to be taken of the facts. However, in the present case, even taking all these strands of evidence as a whole did not assist the plaintiff.  The strength of each was too weak to gain weight when taken together, and there was no mutual reinforcement between them. The facts were equivocal and was not sufficient to discharge the plaintiff’s burden of proof. Many factors relied on could be explained in other ways that were just as plausible, and did not definitively point one way or another. More conclusive evidence than such will be needed to prove formation of a contract. Certainty 133 The defendants also argued that the terms of the alleged 2012 Agreement were not certain.188Foot Note 188×2 DCS at para 88, 91It is well established that a valid contract must have certain terms (Gay Choon Ing([30] above) at [38]).189Foot Note 189×2 DCS at para 92In light of the above, it was not necessary to discuss this but I make some remarks for completeness. Some of the pleaded terms of the agreement were that: … d. The extent of ownership of the Rock Business by the Plaintiff, [Yeo], [Tainton] and [Reid] was to be determined in proportion to the value of services contributed or monies advanced by each of them to Rock Singapore as at 1 October 2012 and from time to time thereafter; e. The Loan Amount owed to the Plaintiff and [Yeo] would be converted to equity in the Rock Business, and [Tainton], [Reid] and/or Rock Holdings Australia would be released from their obligations to repay the Loan Amount; f. The Plaintiff and [Yeo] were each respectively to remain entitled to the compensation owed to them for the services rendered, where the amounts were to be fixed if and when the Rock Business became profitable, which could then be applied (partially or in full) as equity in Rock Singapore or as a loan to be repaid by Rock Singapore if the Plaintiff and [Yeo] so wished … 134 These terms seemed to allow the plaintiff and Yeo to convert the value of their services to equity in Rock Singapore. However, the terms were uncertain as it was not pleaded how their services were to be valued, or if there is any standard market methodology for valuing such services.190Foot Note 190×2 DCS at para 91The plaintiff argued that the Principal Parties agreed that the value of services was to be “a fair amount of money when and if the business could afford it”.191Foot Note 191×NE 5 October 2018 at p 83However, a “fair amount of money” and “when… the business could afford it” are equally uncertain and subject to interpretation. The plaintiff alternatively argued that the value of services had been fixed when he started getting paid.192Foot Note 192×NE 5 October 2018 at p 83However, this was not proven, and all of these allegations were neither in the pleadings nor in his AEIC.193Foot Note 193×2 DCS at para 91; NE 5 October 2018 at pp 82 to 84Further, clause (d) seemed to contradict clause (f) as clause (d) purported to allow the value of services to be converted to equity as an absolute term, whereas clause (f) purported to allow the value of services to be converted to equity only where the Rock Business became profitable. The definition of “profitable” was also not pleaded or stated. The operation of clause (f) as also unclear since the plaintiff confessed to drawing a salary even though the business had been struggling.194Foot Note 194×2 DCS at paras 99 to 105 135 In addition, it was not specified what the loan amount owed to the plaintiff and Yeo was, and if it would encompass all future loans. “Loan amount” was defined in the Statement of Claim as beings tens of thousands of dollars which the plaintiff and Yeo allegedly lent to Tainton, Reid and Rock Australia for the purposes of meeting the expenses of the Rock Business and developing the USA Market for the Rock Products.195Foot Note 195×SOC at para 30However, no exact figures were pleaded, this was not mentioned in his AEIC, and there was a failure to adduce documents to support his claim on the loans.196Foot Note 196×2 DCS at para 95; NE 5 October 2018 at pp 62 to 64 136 In general, the terms seemed uncertain and haphazard, largely attributable to the fact that they were not formalised and were at best the result of a long period of back and forth oral communications with no clear point of crystallisation. Even if there had beenad idem, the validity of the contract was questionable due to lack of certainty. Formalities and other points 137 The 1st defendant argued that the 2012 Agreement and 2014 Agreement were both void for failing to comply with the formalities requirement under s 7(2) of the Civil Law Act (Cap 43, 1999 Rev Ed).197Foot Note 197×1 DCS at p 119For reference, s 7(2) provides: A disposition of an equitable interest or trust subsisting at the time of the disposition must be in writing signed by the person disposing of the same or by his agent lawfully authorised in writing or by will. 138 In response, the plaintiff argued that the defendants cannot rely on this argument as it was not pleaded in the Defence.198Foot Note 198×PRCS at para 199Alternatively, there was part performance of the alleged agreements which makes it unconscionable for the defendants to rely on the formalities requirement.199Foot Note 199×PRCS at para 204The plaintiff did not deny that the alleged oral agreements would have breached the requirement. 139 Given the finding that there was no agreement, there was no need for me to consider the formalities argument. 140 There were also a number of other points raised which were not to my mind material to the outcome. For example, the plaintiff argued that he had made great sacrifices for the company whilst working “like a dog”, relocating and living away from his family, and earning a low income for years.200Foot Note 200×PCS at para 137He also mentioned that his effort went to waste due to a stop-sale order made by the US regulators, which he argued was the fault of Minczanowaski.201Foot Note 201×PCS at para 136Whilst these showed his passion and dedication to the company, they were not relevant to whether an agreement was formed. 141 The plaintiff also took issue with the evidence of Tainton and Reid’s accountant, Caracoussis, arguing that he had attempted to give expert evidence on the accuracy of Rock Singapore’s financial records,202Foot Note 202×Caracoussis’ AEIC dated 6 September 2018 at paras 16 to 25when he was only called as a factual witness.203Foot Note 203×PCS at para 386; PRCS at paras 244 to 249 142 I agreed that Caracoussis’ testimony should have been limited to the factual evidence for which he was called, and not stray into other matters. I did not find that his evidence on these extraneous matters were material, and disregarded them.",
        "The 2014 Agreement": "Parties’ submissions 143 The plaintiff argued for similar reasons as with the 2012 Agreement that the 2014 Agreement had been validly formed. The plaintiff argued that the agreement was reached at a meeting in Seattle on 6 April 2014 between the Principal Parties and Biggs (“Seattle Meeting”). There had been objective intention to agree, and the subsequent conduct of the parties were consistent with and proved such agreement. Although parties differed as to their account of the Seattle Meeting, the evidence of the plaintiff should be accepted as the most likely version. For the same reasons as vis-à-vis the 2012 Agreement (above at [94]), the 2014 Agreement was not subject to execution via a formal written document.204Foot Note 204×PCS at paras 431 to 434 144 The plaintiff argued that the terms of the agreement, included,inter alia, that (see [19] above):205Foot Note 205×PCS at para 404; SOC at para 47 (a) the plaintiff was to be compensated US$8,000 per month for his services from April 2011 onwards; (b) this was to be set-off against the US$4,000 a month he had been receiving; (c) a part of the compensation was to be set-off as a loan to Rock Singapore, in exchange for equity to increase his shareholding to 30%; (d) Yeo was to be compensated, with a portion set aside as a loan in exchange for equity to increase his shareholding to 30%; (e) Tainton and Reid each beneficially owned 12.5% shares in Rock Singapore due to the US$100,000 that they had invested each; (f) Tainton and Reid had the option of investing more funds to increase their ownership to either 15% or 20%; and (g) Biggs owned 10% shares in Rock Singapore due to the US$80,000 that he had invested. 145 In response, the defendants all argued that no agreement was reached at the Seattle Meeting.206Foot Note 206×2 DCS at para 294; 4 DCS at para 99, 106; 1 DCS at para 214They pointed out that the plaintiff’s AEIC differed from his court testimony in various aspects. For example, the plaintiff in court stated that at the Seattle Meeting everyone stood up and shook hands to signify that a deal was made, but this extremely important fact was not mentioned in his AEIC.207Foot Note 207×2 DCS at para 303; NE 9 October 2018 at pp 27 to 32; 4 DCS at para 111Further, the plaintiff testified in court that Yeo mentioned during the Seattle Meeting that the plaintiff’s beneficial ownership was to be 30%, but this was not stated in his AEIC.208Foot Note 208×2 DCS at para 298; NE 9 October 2018 at paras 34 to 36These showed that the plaintiff was embellishing his testimony and that it was untruthful.209Foot Note 209×2 DCS at para 303The defendants also argued that the contemporaneous documents showed that there had been no acceptance at the Seattle Meeting.210Foot Note 210×2 DCS at paras 304 to 307; 4 DCS at para 104, 121; 1 DCS at paras 216 to 224 146 The defendants also argued that the circumstances after the Seattle Meeting also showed that there was no agreement. The paid up capital of Rock Singapore remained at S$100 even one year after the Seattle Meeting, and no resolution was passed to increase the paid up capital to the proposed capitalisation amount of US$800,000.211Foot Note 211×4 DCS at para 118; NE 10 October at pp 25 to 27This was a necessary requirement under the Companies Act (Cap 51, 2006 Rev Ed) (“Companies Act”) and failure to do so would render any purported issuance of shares and increase in share capital void.212Foot Note 212×1 DCS at para 234 147 Finally, the defendants argued that the alleged 2014 Agreement had uncertain terms.213Foot Note 213×4 DCS at para 115; 1 DCS at para 229 Whether an agreement was reached 148 I was not persuaded that there was any agreement reached in 2014; the plaintiff’s testimony of the Seattle Meeting failed to prove such agreement, and this was also not proven by the subsequent conduct of the parties. (1) Evidence of what happened at the Seattle Meeting 149 The plaintiff argued that the defendants’ testimonies as to what happened at the Seattle Meeting should be rejected because of inconsistencies and lack of support for their contentions. For example, although Reid testified that he had been very angry about the restructuring proposal, the other defendants did not corroborate this, and this was also not in Reid’s AEIC.214Foot Note 214×PCS at para 165, 169Tainton and Reid’s testimonies that they had walked out of the room in a rage were also not corroborated by the other defendants.215Foot Note 215×PCS at paras 168, 172Yeo’s AEIC did not give the impression that Tainton and Reid had been angry, but Yeo later changed his testimony on the stand to say that the meeting was very acrimonious.216Foot Note 216×PCS at para 158Tainton and Reid’s alleged anger was also inconsistent with their later conduct. For example, Reid had written a friendly email to the plaintiff one week after the Seattle Meeting.217Foot Note 217×PCS at para 170Tainton and Reid had also agreed at the Seattle Meeting to raise the plaintiff’s salary to US$8,000 to compensate him, which they would not have had done if they had been angry.218Foot Note 218×PCS at para 173This last point on compensation also contradicted Yeo and Biggs’s evidence, as they had testified that there was no agreement reached at the meeting, including compensation.219Foot Note 219×PCS at para 167 150 The plaintiff also pointed out that Tainton’s evidence that he was so angry that he had said that the plaintiff would never get the Rock Marks was contradictory to his own testimony that the Rock Marks were not mentioned at the meeting.220Foot Note 220×PCS at para 171Further, it contradicted Tainton’s testimony that Tainton did not think that the Rock Marks had been transferred to Rock Holdings.221Foot Note 221×PCS at para 171Tainton’s testimony that the first time he had heard that Biggs had invested US$80,000 into Rock Singapore was at the Seattle Meeting was also unbelievable, since the plaintiff had already told Tainton earlier in 2013. Further, given Tainton’s close relationship with Biggs, Biggs must have mentioned it to Tainton earlier.222Foot Note 222×PCS at para 174 151 The plaintiff sought to rely on Biggs’s testimony, arguing that Biggs had understood that the business had been capitalised and that shareholding was based on financial contributions. This was the 2012 Agreement, which formed the basis for the Seattle Meeting. 152 Finally, the plaintiff argued that it was not ridiculous to reduce Tainton and Reid’s ownership from 100% total to 12.5% each, since 100% of the business when it began was worth less than 25% of what it was worth now.223Foot Note 223×PCS at para 175Further, neither of them raised that the money put in were only loans instead of investments.224Foot Note 224×PCS at para 176 153 Despite the plaintiff’s lengthy arguments, I did not find that they proved that agreement was reached. I believed the unanimous and unwavering testimony of all the defendants that there was no agreement reached at the Seattle Meeting in relation to the share ownership and capitalisation (above at [145]). 154 In contrast, the plaintiff’s testimony was not sufficiently convincing at the crucial points. There was only one line in his AEIC explaining how the parties came to agree, namely, that: “while Yeo was speaking we all acknowledged and conveyed our agreement with what he had said”.225Foot Note 225×P AEIC at para 147There was no elaboration on how this acknowledgment or agreement was made, even though this was the most crucial portion of the evidence. At trial, the plaintiff sought to embellish this by testifying that everyone stood up and shook hands to signify that a deal was made.226Foot Note 226×NE 9 October 2018 at pp 27 to 32He acknowledged that this was an extremely important fact, and hence it was strange why this extremely important fact was not mentioned in his AEIC.227Foot Note 227×2 DCS at para 303; NE 9 October 2018 at pp 27 to 32; 4 DCS at para 111At trial, the plaintiff also embellished his AEIC and argued that the agreement was in the form of nodding and positive body language.228Foot Note 228×NE 9 October 2018 at pp 27 to 32When asked whether the nodding could have merely been to signify that they were listening, the plaintiff argued that the nodding was to signify agreement because the parties left the room on good terms.229Foot Note 229×NE 9 October 2018 at pp 27 to 32I did not find this to be sufficiently convincing. This was merely the plaintiff’s subjective view of what the nodding meant. Even accepting the plaintiff’s accounts as true, mere nodding and leaving the room on good terms are insufficient to prove agreement (see [116] above). 155 Further, many of the points raised by the plaintiff did not directly address the issue of agreement but were either irrelevant or tangential. For example, whether or not a person was angry and/or left the room may in certain situations be important indications if a version of events is the truth. However, in the present case, even if there were inconsistencies as to whether Tainton and Reid had been angry, and even taking the plaintiff’s position that they had not been angry, lack of anger is insufficient to prove acceptance of an agreement.  In any event, some inconsistency is understandable as recollection many years after the event may be hazy, inaccurate or incomplete. Further, the crucial issue at hand was not whether Tainton and Reid had been angry, but whether there had been agreement, and it may have been that the witnesses did not mention about the anger because they had chosen to focus on the latter issue in their AEICs. 156 The inconsistency regarding the plaintiff’s compensation was also not directly relevant or probative. Since Tainton and Reid admitted that they had agreed to pay the plaintiff US$8,000 a month from April 2014, this coincided with the plaintiff’s claim that there was an agreement to pay him that sum, and there was no dispute in that regard.230Foot Note 230×2 Defence at para 32However, the fact that Yeo and Biggs did not testify about the compensation agreement could be because it did not directly pertain to them and they may have missed out or not focused properly during that part of the discussion. They could have also forgotten it due to the passage of time. In any case, this inconsistency about the compensation did not prove that there was an agreement on the rest of the terms pertaining to share ownership and capitalisation. 157 In regards to compensation, I also noted that the plaintiff argued that the US$8,000 payment was agreed to be backdated and beginning from April 2011 ([143] above). This contradicted Tainton and Reid’s claim that the payment began only from April 2014,231Foot Note 231×2 Defence at para 32and was not sufficiently proven. 158 The other arguments raised by the plaintiff relating to the Seattle Meeting were also irrelevant as to whether there was agreement. These included Biggs’s understanding of the capitalisation until that point; the fact that Tainton only first knew about Biggs’s investment/loan at the meeting; and the plausibility of Tainton and Reid willing to reduce their shares to 12.5%. Even accepting the plaintiff’s account of these points, they did not prove agreement. Bigg’s conduct had also been addressed above at [124] to [131] and below at [173] to [177]. (2) Whether the conduct of the parties showed that an agreement had been reached 159 Both the plaintiff and defendants relied on the subsequent conduct of the parties and the contemporaneous documents to support their case. I found that these supported the defendants’ contention that no agreement was reached. The plaintiff’s points were not directly relevant or were equivocal. 160 I agreed with the defendants that the failure to pass a resolution increasing the capital shareholding was a fact which supported that there was no agreement, since this was a requirement of any capitalisation, failing which the capitalisation would be void under s 161(6) of the Companies Act (see [146]) above). The plaintiff pointed to a document between Yeo and Biggs, but was unable to confirm that it was a requisite resolution.232Foot Note 232×NE 10 October at p 27Biggs and Yeo both testified that no requisite resolution was passed.233Foot Note 233×4 DCS at para 118; 1 DCS at para 234 161 I also agreed that the contemporaneous documents post Seattle Meeting showed that no agreement was reached. For example, the plaintiff sent emails showing that the negotiations were still in flux. In an email on 15 April 2014 from the plaintiff to Yeo, he stated “[i]f they are not happy owning 12.5% each… it is time for me to start planning an exit”.234Foot Note 234×2 DCS at para 304; Chronological Bundle of Documents Volume 4 dated 5 September 2018 (“4 CBD”) at p 2297In an email on 21 April 2014 also from the plaintiff to Yeo, he stated: “This should be done within the next 14 days… I think it is fair this is done now. Let’s finalise this with no lose ends once and for all… Please, let’s finalise this”.235Foot Note 235×4 CBD at p 2306In an email on 30 June 2014, Yeo replies to the plaintiff stating: “until we have an agreement, this is still not a done deal and the capital base may be different from the attached”.236Foot Note 236×1 DCS at para 221; Chronological Bundle of Documents Volume 5 dated 5 September 2018 (“5 CBD”) at pp 2758 to 2759That same email attached various proposals for the equity position, labelled as “originally intended” and “restructured”, showing that the original plans had only been intended and not finalised, and that further restructuring was proposed.237Foot Note 237×5 CBD at p 2760There were also other emails similar to these.238Foot Note 238×1 DCS at para 221 162 Further, it was clear that the shareholding percentages had not been finalised at the Seattle Meeting, as there were numerous subsequent correspondences discussing the various permutations of percentages.239Foot Note 239×2 DCS at paras 304 to 307; 4 DCS at para 104, 121; 1 DCS at paras 216 to 224In an email from Yeo to the plaintiff on 21 April 2014, Yeo discussed with the plaintiff three possible permutations of shareholdings, with Tainton and Reid having:240Foot Note 240×2 DCS at para 305; 4 CBD at p 2304 to 2305(1) 12.5% each; (2) 15% each; or (3) 20% each. Further, in the attachment to the email, the plaintiff’s shareholding was reflected as at 25% or 27.5%, which differed from the plaintiff’s allegation that it was agreed that he had 30% shareholding.241Foot Note 241×2 DCS at para 305; 4 CBD at p 2304 to 2305Further proposals were sent by Yeo on 22 April 2014 and 25 April 2014, with differing permutations.242Foot Note 242×4 DCS at para 121; 4 CBD at p 2307 to 2310; 5 CBD at p 2431 to 2433 163 The changes continued even until October 2014, way past the Seattle Meeting, as reflected in this table:243Foot Note 243×1 DCS at p 199 to 200 Source/ PartyEmail from plaintiff to Yeo on 11 June 2014244Foot Note 244×5 CBD at p 2704Email from Yeo to plaintiff on 18 June 2014245Foot Note 245×5 CBD at pp 2738 to 2740Management report from Yeo to plaintiff on 20 October 2014246Foot Note 246×Chronological Bundle of Documents Volume 6 dated 5 September 2018 (“6 CBD”) at p 3718 to 3724Alleged 2014 Agreement247Foot Note 247×SOC at para 47Plaintiff27.5%41%42.9%27.5%30%Yeo27.5%40%42.9%30%30%Tainton15%0%0%15%12.5%Reid15%0%0%15%12.5%Minczanowaski and Biggs10%14%14.3%10%10% (Biggs)Extra5% (Berner)5% (Berner)0%2.5% (Berner) 164 These showed that nothing had been firmed up and negotiations were constantly underway. 165 The plaintiff’s points also did not assist and are dealt with as follows. (A) Yeo’s conduct and communications 166 The plaintiff argued that Yeo had reflected in various emails, contemporaneous documents and correspondences that the plaintiff owned 30% shares in Rock Singapore.248Foot Note 248×PCS at paras 408 to 411Further, Yeo had also accepted that the April 2011 Agreements no longer reflected what was agreed by the parties.249Foot Note 249×PCS at para 412Yeo’s explanation that the correspondences were only a starting point were not convincing.250Foot Note 250×PCS at pp 12 to 13 and para 411 167 In my view, these only showed that Yeo was trying to work towards what the plaintiff wanted,251Foot Note 251×1 DCS at para 148and was consistent with that; it did not conclusively show that Yeo was following up on a concluded agreement. For the same reasons as stated above at [112], these could have been merely proposals and contained loose language. These equally probable explanations meant that this evidence could not prove the plaintiff’s case. (B) Tainton and Reid’s conduct 168 The plaintiff argued that Tainton and Reid’s conduct reflected that they had accepted the 2014 Agreement. For example, when Tainton and Reid sought to sell their interest in the Rock Business, Tainton’s messages to Biggs showed that Tainton understood that the amount of equity Tainton and Reid had was 30%, and that they did not think of themselves as 100% owners.252Foot Note 252×PCS at para 415 169 However, these showed at most that they were willing to take the plaintiff’s assertion as a starting point or foundation for proposals, not that they accepted that the shareholding was fixed as alleged by the plaintiff. The evidence relied upon by the plaintiff did not go as far as the plaintiff alleged. 170 The plaintiff also argued that Tainton wanted to audit the shareholding because he wanted to see how much Rock Singapore owed to the plaintiff, in order to determine how much shares the plaintiff would own under the agreement.253Foot Note 253×PCS at paras 413 to 414He argued that although Tainton may have had doubts that the plaintiff had put in US$260,000, it did not mean that the capitalisation plan was not agreed to.254Foot Note 254×PCS at para 414 171 However, this was equivocal as the audit could equally have been simply for purposes of verifying the plaintiff’s claims as to how much he had loaned to the company, or perhaps in preparation for a future capitalisation agreement. 172 The plaintiff also alleged that Tainton and Reid wanted to sell their equity around June or July 2014,255Foot Note 255×PCS at para 211but these discussions, even if true, did not lead to or support any conclusion that any agreement or representations had been made which bound Tainton and Reid. (C) Biggs’s conduct 173 The plaintiff argued that Biggs’s conduct showed that he believed that the plaintiff was a shareholder.256Foot Note 256×PCS at paras 416 to 417In Biggs’s communications to Caracoussis, Tainton and/or Reid, Biggs recognised that the April 2011 Agreements had been overtaken by circumstances. Biggs also wrote to Yeo as well as external parties referring to the plaintiff as a shareholder.257Foot Note 257×PCS at paras 418 to 425Biggs’s reply that what he meant was “potential shareholder” was merely an afterthought, especially since Biggs had repeatedly referred to the plaintiff as a shareholder.258Foot Note 258×PCS at para 426The only occasion when Biggs mentioned that the plaintiff might not be a shareholder was when the plaintiff wanted to have an external party, Berner, join as a shareholder. However, Biggs mentioning that the plaintiff might not be a shareholder on that occasion was merely because Berner was an external party; such language was to avoid trouble in the future, and was pending the tying up of loose ends via a shareholders agreement.259Foot Note 259×PCS at para 427 174 I found that Biggs’s statements and communications did not support the conclusion that there was an agreement reached. Similar to Yeo, Biggs may have had used loose language in the communications (above at [112]). For example, Biggs’s statement that the April 2011 Agreements had been “overtaken by circumstances” did not mean that it had been replaced with a new agreement, but merely that the circumstances had changed from then.260Foot Note 260×2 DCS at para 306.5This could have also been indicative of a need for a new future agreement. While it would have been expected that Biggs would have been more circumspect about the use of the term “shareholder” to refer to the plaintiff, given his relatively greater experience in business matters,261Foot Note 261×Bigg’s AEIC dated 29 September 2018 at paras 6 to 12this was insufficient to conclude that there had been agreement. 175 Biggs’s emails showed that he did not think that there had been agreement. In an email sent by Biggs to Caracoussis on 24 April 2014, Biggs stated that “my impression is that both sides are genuine in trying to get an agreement”,262Foot Note 262×2 DCS at para 306; 5 CBD at p 2409; NE 7 November 2018 at pp 17 to 18showing that he did not think that there had been an agreement as of yet. In the same email, Biggs states that he had either bought a 10% share of the business or nothing,263Foot Note 263×5 CBD at p 2409which clearly indicated that Biggs was of the view that nothing was set or agreed.264Foot Note 264×2 DCS at para 306.6The email further refers to the need for an agreement to be reached, stating “I believe that an agreement must be reached”,265Foot Note 265×5 CBD at p 2409; 4 DCS at para 135(c)not that such an agreement had in fact been reached, and also discussed the parameters of the new agreement.266Foot Note 266×4 DCS at para 135(e); 5 CBD at p 2409The above was reinforced by a further email that Biggs sent to Yeo on 25 April 2014 where Biggs stated that Tainton and Reid were ready to take a lesser share, provided that they were shown where the plaintiff’s contributions were reflected in the financial documents, as they previously had not had a clear idea of it.267Foot Note 267×4 DCS at para 135(h); NE 7 November 2018 at pp 23 to 24; 5 CBD at p 2437This showed that no agreement had yet been reached. 176 The plaintiff also pointed to the use of the phrase “status quo” in an email sent by Biggs on 22 May 2014,268Foot Note 268×5 CBD at pp 2657–2659as indicating that there had been acceptance of the shareholdings and that that was the status quo.269Foot Note 269×PCS at para 197However, Biggs explained that the use of the phrase “status quo” was not referring to any accepted agreement but merely reflected the status quo of the difference in positions between the parties as to what they wanted.270Foot Note 270×4 DRCS at para 46 177 Finally, I accepted that Biggs was initially an outsider and only came on to mediate the issues between the plaintiff and Tainton and Reid. His statements had to be understood in light of his role as a mediator. In certain statements, he was merely repeating back to the plaintiff what the plaintiff’s claims were, and could not be seen as him endorsing the position.271Foot Note 271×PCS at para 13; NE 7 November 2018 at pp 41 to 44; NE 8 November 2018 at pp 4, 64 (D) Conduct and circumstances before the meeting 178 The plaintiff gave fairly extensive descriptive accounts of events between 2012 and 2014.272Foot Note 272×PCS at paras 118 to 146These included Tainton and Reid’s financial difficulties; the negotiations conducted with Biggs and Minczanowaski; the stop sale order issued by US regulators; the introduction of a new business product; and the discussions and correspondences that led to the Seattle Meeting. These were not raised by the plaintiff as arguments but seemed to be more narrative in nature. The defendants disputed the veracity of some of these narrations. In any case, even if they were taken as true, these events happened before the Seattle Meeting and none of these proved whether an agreement was reached at the Seattle Meeting itself. (E) External communications 179 Finally, the plaintiff argued that Yeo and Biggs did not correct him when he represented to external business partners that he was a shareholder, showing that they had accepted that he was a shareholder.273Foot Note 273×PCS at para 410However, as shown above, such silence cannot prove acceptance (see [116]). The silence was equivocal and could have been because they just let him say whatever he wanted to say, or because they did not want to correct him in front of the external partners, or other such possible reasons. It was not proven that the silence had to be because the agreement was accepted. 180 For the above reasons, I found that neither the evidence of the Seattle Meeting nor the subsequent conduct proved that the 2014 Agreement was formed and the plaintiff failed to discharge his burden of proof. Whether there was certainty of terms 181 The various terms pleaded and argued by the plaintiff were set out above at [143]. 182 Given the above, it was not necessary for me to decide if the terms were sufficiently certain. However, I was inclined to agree with the defendants that the percentage of shareholding lacked certainty as it was still fluctuating and not set in stone. As argued by the defendants, the various percentages of shareholding alleged by the plaintiff did not add up to 100%,274Foot Note 274×NE 10 October 2018 at pp 24 to 25; 2 DCS at para 301which put into considerable doubt the certainty of what was alleged to have been agreed. Further, Tainton and Reid had the option of increasing their ownership from the alleged 12.5% to either 15% or 20%, by injecting more capital.275Foot Note 275×4 DCS at para 122This showed that the shareholdings were not fixed. For example, if they were to both increase their shareholdings to 20%, the total shareholdings would add up to 110%. It was not explained how these inconsistencies were to be resolved. Formalities and other points 183 For the same reason as above (see [139]), there was no need for me to consider the formalities argument.",
        "Estoppel": "",
        "Parties’ submissions": "221 The plaintiff alleged a conspiracy by the defendants to deny him his beneficial shareholding in the Rock Business.305Foot Note 305×PCS at para 459He argued that the court should draw this inference from various collective facts, including that:306Foot Note 306×PCS at paras 460 to 470Biggs and Yeo had been talking negatively about the plaintiff behind his back since June 2014; Biggs and Yeo coordinated to induce the plaintiff to appoint Biggs as his proxy to act in Rock Singapore; Tainton and Reid realised that the Rock Business was becoming more profitable and tried means to obtain more shares, including getting Biggs’s help; Biggs stalled for time to delay any shareholder agreement by informing the plaintiff that a shareholding audit had to be done; during this period of stalling, the assets of Rock Business were being covertly transferred to Rock IP and Rock Nutrients International; the defendants got together and wanted the plaintiff out of the business; the defendants combined to take the position that the only legally binding agreements were the April 2011 Agreements, which meant that the plaintiff had no equity; threats of legal action were taken by the defendants against the plaintiff; after the asset transfer, returns from the Rock Business were paid into two family trusts owned by Tainton and Reid, to the exclusion of the plaintiff; and Tainton and Reid would bear the legal fees of all the defendants, in furtherance of the same position in these legal proceedings. 222 The plaintiff argued that the conspiracy was unlawful as the acts deriving from it were in breach of the 2012 Agreement and/or the 2014 Agreement, and was done for the intention of causing the plaintiff loss and injury.307Foot Note 307×PCS at paras 471 to 473Alternatively, even if it was lawful, the predominant purpose was to cause damage and injury to the plaintiff.308Foot Note 308×PCS at paras 471 to 473The acts were performed, causing the plaintiff to lose his beneficial shareholding in the Rock Business.309Foot Note 309×PCS at paras 471 to 473 223 In response, the defendants argued that they had no intention to cause harm to the plaintiff but were merely taking back control over what was rightfully theirs,310Foot Note 310×2 DCS at para 412and were each merely acting to protect their own interests.311Foot Note 311×2 DCS at p 317–320; 1 DCS at pp 142–143; 4 DCS at p 165Further, if the plaintiff was not a beneficial owner of 30% of the shares of Rock Singapore, he could not have had suffered any damage arising from the transfer of assets.312Foot Note 312×2 DCS at para 411",
        "Proprietary estoppel": "188 The parties did not dispute the applicable legal principles for proprietary estoppel. Proprietary estoppel is made out where there is a representation by the party against whom the estoppel is sought to be raised and detrimental reliance by the party seeking to raise the estoppel (Hong Leong Singapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 (“Hong Leong”) at [170]).283Foot Note 283×2 DCS at para 139; PCS at para 447; 4 DCS at para 197The underlying principle is unconscionability and the question is whether the representing party said or did something that led the relying party to take a certain course of action in circumstances that renders it unconscionable not to estop the representing party from resiling from his position (Hong Leongat [171]).284Foot Note 284×PCS at para 448; 2 DCS at para 139The representation must be objectively clear and unequivocal from the point of view of the representee (Neo Hui Ling v Ang Ah Sew[2012] 2 SLR 831 (“Neo Hui Ling”) at [54]). 189 Proprietary estoppel is a subset of promissory estoppel. The elements of both forms of estoppel are similar (Tong Seak Kan and another v Jaya Sudhir a/l Jayaram[2016] 5 SLR 887 at [37]). However, the former can operate as a sword (Low Heng Leon Andy v Low Kian Beng Lawrence(administrator of the estate of Tan Ah Kng, deceased)[2018] 2 SLR 799 (“Andy Low”) at [15]) whereas the latter only operates as a shield (Neo Hui Lingat [54]). The traditional distinction between the two doctrines is that proprietary estoppel usually only operated in relation to real property (Yeoman’s Row Management Ltd and another v Cobbe[2008] UKHL 55 (“Cobbe”) at [14];Neo Hui Lingat [54]; Ben McFarlane,The Law of Proprietary Estoppel(Oxford University Press, 2014) (“McFarlane”) at para 1.21 and footnote 63), whereas promissory estoppel extends to all promises, including non-proprietary promises such as a promise not to enforce a legal right (K. R. Handley,Estoppel by Conduct and Election(Sweet & Maxwell, 2nd Ed, 2016) at para 13-001). 190 In recent years, there has been an expansion of proprietary estoppel to cover property apart from land. For example, the UK House of Lords observed that proprietary estoppel could equally apply to chattels or choses in action (Cobbeat [14]). This was also done in several cases such asHarris v Kentand another[2007] All ER (D) 238 at [120] to [121],285Foot Note 285×PCS at paras 449 and 452Montalto v Popat[2016] 2 All ER (D) 118, andSutcliffe v Lloydand another[2007] 2 EGLR 13, where the court allowed an action in proprietary estoppel to claim shares. There have also been suggestions that proprietary estoppel should expand even outside the proprietary context (Mcfarlaneat paras 10.59 to 10.61). This would effectively be similar to using promissory estoppel as a sword. 191 The precise boundaries of proprietary estoppel have not been definitively established in Singapore jurisprudence. The plaintiff also adduced no local authority to support that proprietary estoppel applied to shares. I did not find it necessary to decide the issue in this case, as I found that the elements of proprietary estoppel were not made out. If it had been necessary, I would have agreed based on UK jurisprudence that proprietary estoppel could apply to property such as shares, but would have been hesitant to extend it to non-property as it would effectively erode the distinction with promissory estoppel. 192 I was of the view that the courts should not impose proprietary estoppel too willingly in the commercial context.286Foot Note 286×2 DCS at para 140There is much to be said for the proposition that a commercial setting would generally make it less likely for proprietary estoppel to be successfully claimed; parties dealing at arm’s length in such a setting would expect to have their dealings resolved through contractual arrangements more than anything else. Representations made in such a setting would be less likely to be relied upon, and representations would be less likely to be treated as operative representations that are effective in proprietary estoppel. 193 Hence, the proper space for proprietary estoppel should not normally include commercial situations, where parties would be expected to arrange their affairs through the prism of contract law. The risk of allowing proprietary estoppel full reign in a commercial setting is that it could engender uncertainty. Proprietary estoppel claims are intensely fact sensitive, and there are no bright line rules; it would require careful consideration of the facts, and careful sifting of the various allegations that are made to determine what the facts are (Andy Low(above at [189]) at [17]). The whole process is inimical to the sort of fast and robust determination that is required to ensure that commercial transactions are not hindered. 194 Finally, it was also noted inHalsbury’s Laws of Singaporevol 9(4) (Butterworths Asia, 2018 Reissue)at para 110.981 that in commercial cases, it seems insufficient for the representee to claim that what was expected would be a negotiated agreement which would contain the outstanding terms which had not been agreed. I agreed with this, as it would be a backdoor way of making claims where the negotiations produced no agreement. In other words, in the commercial context, negotiations falling short of agreement would likely not sufficiently constitute a representation making out proprietary estoppel. 195 For these reasons, I was not inclined to allow proprietary estoppel in the present case since there was an underlying contractual foundation in the form of the April 2011 Agreements, and since there were contractual negotiations in progress which had not crystallised into any agreement. In any case, there was no sufficient representation to make out any proprietary estoppel. Further, as will be shown below, there was no clear and unequivocal representation, and also no detrimental reliance.",
        "Estoppel by representation and convention": "Legal principles 196 Estoppel by representation requires a clear and unambiguous representation of fact; reliance; and detriment (Linkforce Pte Ltd v Kajima Overseas Asia Pte Ltd[2017] SGHC 46 at [18]). It requires representation of an existing fact, and must be distinguished from promissory estoppel, which applies to representations of the promisor’s intention as regards its future conduct (The Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) (“Phang”) at para 04.100). 197 On the other hand, estoppel by convention is not founded on any representation but on an agreed statement of facts, the truth of which has been assumed by the parties to be the basis of the transaction (MAE Engineering Ltd v Fire-StopMarketing Services Pte Ltd[2005] 1 SLR(R) 379 (“MAE Engineering”) at [44]). In other words, there must be a shared assumption as regards a particular interpretation of the parties’ contractual rights or liabilities (Phangat para 04.102). The requirements are that: there must be a course of dealing between two parties in a contractual relationship; the course of dealing must be such that both parties must have had proceeded on the basis of an agreed interpretation of the contract; and it must be unjust to allow one party to go back on the agreed interpretation (Singapore Island Country Club v Hillborne[1996] 3 SLR(R) 418 at [27];MAE Engineeringat [45]). 198 Both estoppel by representation and estoppel by convention are evidential doctrines that can aid in the construction of agreements (Phangat para 04.102).287Foot Note 287×4 DCS at para 195; PCS at paras 350 to 352Their primary purpose is to set up the facts against which the parties’ rights and liabilities will be determined (Phangat para 04.100). They are defensive doctrines that do not create new substantive rights (Phangat para 04.102). Non-applicability of the doctrines 199 The plaintiff argued that these doctrines estopped the defendants from denying the existence of the 2012 Agreement and 2014 Agreement.288Foot Note 288×PCS at pp 240 and 289This seemed to be wrongly using the doctrines as swords to claim contractual remedies. 200 As stated, estoppel by convention operates only where parties are in a contractual relationship. The function of the doctrine is to hold parties to a certain agreed interpretation of the contract. It cannot be used in this case to prove that there was a share ownership and capitalisation contract when there was none. It was also not argued that the share ownership and capitalisation terms were an agreed interpretation of the April 2011 Agreements.289Foot Note 289×PCS at paras 372 to 375 201 Similarly, estoppel by representation cannot be usedipso factoto prove that there was a contract. The doctrine only operates to establish certain facts, which in turn can be used as evidence to argue that a contract was formed. Some of the alleged representations raised by the plaintiff did not pertain to representations of facts, but should be properly characterised as promises. For example, it was alleged that Tainton and Reid represented that they both “agreed to reduce” their respective ownership, and that the plaintiff “would be” a 30% shareholder.290Foot Note 290×PCS at para 360These alleged representations deal with future intention and are not representations of existing fact, and thus fail to qualify as requisite representations under estoppel by representation. 202 Only the remaining alleged representations dealing with existing fact need to be considered, to show if these facts can be used to prove formation of a contract.",
        "Decision": "265 There were five main differences in the experts’ valuations which resulted in the different figures. These differences were: (a) Period of projected growth; (b) Base annual increase; (c) Expenses; (d) Working capital; and (e) Discount for risk. 266 I agreed with the defendants on all these issues and hence accepted Mr Potter’s final valuation. I found Mr Martin to be overly optimistic and too sanguine about the risks. Period of projected growth 267 I agreed with Mr Potter that the appropriate projection period should be five years instead of 10 years.349Foot Note 349×NE 20 February 2019 at pp 16 to 30I was not convinced that the projections could continue for 10 years as Mr Martin alleged; competition, the threat of new products, and changing trends, could all dampen the growth of the business.350Foot Note 350×NE 20 February 2019 at pp 16 to 30Mr Martin also acknowledged that it was a rapidly changing market,351Foot Note 351×NE 20 February 2019 at p 26and that made it difficult to be able to accurately predict what was going to happen in 10 years. Such threats would have driven the need for money to be spent on responses, including greater marketing, especially since the Rock Business was only a small business in a huge US market.352Foot Note 352×NE 20 February 2019 at pp 16 to 30The 10-year increase projected by the Mr Martin did not sufficiently address these concerns. Annual increase 268 I agreed with Mr Potter that the appropriate annual increase for 2015 should be US$590,000 instead of Mr Martin’s higher estimate of US$710,000.353Foot Note 353×Agreed List at p 8 269 Mr Martin’s estimate relied heavily on the Hydrofarm Agreement.354Foot Note 354×NE 20 February 2019 at pp 30 to 36However, as Mr Potter pointed out, as at 31 March 2015, the potential of the alleged Hydrofarm Agreement had not been proven.355Foot Note 355×NE 20 February 2019 at p 35Mr Martin also conceded that the potential of the agreement would only be known in the future, stating that “[the company] does not know the potential of this agreement… how good it will be will be realised further in the future”.356Foot Note 356×NE 20 February 2019 at p 34 270 Mr Martin claimed to have relied on the one month of results of the alleged Hydrofarm Agreement in making this estimate, since in just one month, the Rock Business hit a quarter of the previous year’s sales.357Foot Note 357×NE 20 February 2019 at p 33However, I found that it was unlikely to have been able to estimate five years of future growth from just looking at such a short period of results. This was overly speculative. I also accepted Mr Potter’s explanation that since the business was being valued as at 31 March 2015, only information that was known or knowable as at that date could be used for valuation.358Foot Note 358×NE 20 February 2019 at p 32Mr Potter alleged that Mr Martin could possibly have had relied on the growth of the Rock Business past 31 March 2015 in making his decision, since given the limited information as at 31 March 2015, it was difficult to predict how the alleged Hydrofarm Agreement would have turned out for the next five years.359Foot Note 359×NE 20 February 2019 at p 35To the extent this was done, it had to be disregarded. 271 For this same reason, I also disregarded the defendants’ reliance on Mrs Tainton’s testimony to show that there was a downturn in 2017. Since this was after the reference date of valuation, it had to be disregarded. 272 Finally, I noted that there was no conclusive evidence that the alleged Hydrofarm Agreement even existed, as the emails pertaining to it were mere proposals.360Foot Note 360×1 DRCS at paras 173 to 175The evidence relied upon, such as the fact that a deposit had been made by Hydrofarm in exchange for Rock Products, was not sufficient to show an actual agreement.361Foot Note 361×1 DRCS at para 175Hence, Mr Martin’s estimate which was based heavily on the alleged Hydrofarm Agreement had been overly optimistic. Marketing expenses 273 For the same reason as with the annual increase, I accepted Mr Potter’s evidence that the marketing expenses for 2015 should be US$690,000 instead of Mr Martin’s proposed US$310,000.362Foot Note 362×Agreed List at p 8Mr Martin’s evidence relied heavily on the alleged Hydrofarm Agreement, claiming that Hydrofarm would push the Rock Products to 2,500 distributors to help market them.363Foot Note 363×NE 20 February 2019 at pp 36 to 44In the absence of this, the low marketing expenses of US$310,000 could not be sustained. Working capital and discount 274 I agreed with Mr Potter that some amount of working capital had to be kept in the bank to anticipate unforeseen circumstances.364Foot Note 364×NE 20 February 2019 at pp 44 to 51I also agreed that a 20% discount was a reasonable estimate that should be granted due to the risk of needing to replace Aoraki,365Foot Note 365×NE 20 February 2019 at p 56since it was the sole supplier of the Rock Products and there would be loss or difficulty in having to find a replacement supplier.366Foot Note 366×1 DRCS at para 176; NE 20 February 2019 at pp 51 to 56 Conclusion 275 Hence, I accepted Mr Potter’s valuation of the Rock Business to be at best US$717,478 as at 31 March 2015. If the plaintiff had succeeded on proving an agreement and breach, he would have been entitled to 30% of this sum, which would be US$215,243.40.367Foot Note 367×2 DCS at para 490 276 The result would have been the same under the claim for conspiracy since the date of assessing damages would have been the date of the wrong (equivalent to the date of the breach of contract).",
        "Conspiracy": "217 I found that the plaintiff’s claim for conspiracy was also not made out. The defendants were merely acting in their own interests without intention to harm the plaintiff.",
        "Applicable legal principles": "218 It is well-established that the tort of conspiracy may be founded either on a lawful or unlawful act. The parties did not dispute the requirements to establish conspiracy,303Foot Note 303×PCS at para 455; 2 DCS at para 406which were set out by the Court of Appeal inGimpexLtdv Unity Holdings Business Ltd and others and another appeal[2015] 2 SLR 686 at [150] as follows: (a) A combination of two or more persons and an agreement between and amongst them to do certain acts. (b) If the conspiracy involves lawful acts, then the predominant purpose of the conspirators must be to cause damage or injury to the plaintiff. However, if the conspiracy involves unlawful means, then such predominant intention is not required; an intention to cause harm to the plaintiff should suffice. (c) The acts must actually be performed in furtherance of the agreement. (d) Damage must be suffered by the plaintiff. 219 In addition, it is not sufficient that harm to the plaintiff would be a likely, or probable, or even inevitable consequence of the defendant’s conduct (EFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”) at [101]). Injury to the plaintiff must have been intended as a means to an end, or as an end in itself (EFT Holdingsat [101]). 220 The plaintiff also conceded that the amount of proof required to prove conspiracy on a balance of probabilities is higher than that of other civil actions (Swiss Butchery Pte Ltd v Huber Ernst[2010] 3 SLR 813 at [17]).304Foot Note 304×PCS at para 456; 2 DCS at para 409",
        "Whether conspiracy was made out": "224 I found that the plaintiff failed to sufficiently prove conspiracy. 225 First, given the above finding that the plaintiff did not own beneficial shares in Rock Singapore, he failed to prove what his alleged loss was, even assuming that there was a conspiracy.313Foot Note 313×1 DCS at paras 329 to 332 226 Second, given the finding that there was no valid 2012 Agreement or 2014 Agreement, there was no unlawful act of breaching these alleged agreements. It was not shown what else would constitute an unlawful act.314Foot Note 314×1 DCS at paras 326 to 328 227 Third, there was no evidence of any combination among any of the defendants with the intention to cause harm to the plaintiff, let alone for the predominant purpose of causing harm to the plaintiff. The various facts that the plaintiff sought to rely on did not prove that the defendants intended to cause harm, as they could be explained on other plausible grounds, which were to be preferred to the plaintiff’s contentions. 228 While Biggs and Yeo may have expressed exasperation and unhappiness in relation to the plaintiff,315Foot Note 315×See emails at 4 DCS at paras 301 to 304and also coordinated what to say to the plaintiff at times,316Foot Note 316×4 DCS at para 301I was persuaded that they did not intend to cause damage or harm to the plaintiff but were genuinely trying to resolve matters. For example, in majority of Yeo’s emails regarding shareholding proposals, he had always proposed the plaintiff as a beneficial shareholder,317Foot Note 317×1 DCS at para 310, Annex 2;showing that he had the intention to help the plaintiff obtain shares.318Foot Note 318×1 DCS at para 306Further, I was convinced that Biggs genuinely wanted to mediate between the plaintiff and Tainton and Reid, trying to improve relations. For instance, in an email dated 3 September 2014 from Biggs to the plaintiff (referred to as “Ash”), Biggs stated:319Foot Note 319×4 DCS at para 304; 6 CBD at p 3101 … Ash, I don’t like this either, but we can’t go on the way we are, bleeding money and have [sic] your having shit relations with the shareholders. My getting in between you and them is the best answer to this problem … Are you going to work with me, get into the industrial side of it or go your own way? 229 Here, Biggs can be seen informing the plaintiff that the business was losing money, and that the plaintiff had poor relations with the shareholders. Biggs gave various suggestions to the plaintiff to try to resolve the problem, such as working with him, or moving into the industrial side of the business. These showed that Biggs had been trying to move things forward. 230 Further, in another email dated 4 December 2014 by Biggs to the plaintiff, Biggs explained to the plaintiff in detail the reasons why Tainton and Reid were upset with him, which seemed to be an attempt to mediate, by getting the plaintiff to understand Tainton and Reid’s concerns, so that the plaintiff could respond better to them.320Foot Note 320×4 DCS at para 308; Chronological Bundle of Documents Volume 7 dated 5 September 2018 at pp 4154 to 4155 231 Although Biggs and Yeo may have been blunt in pointing out the plaintiff’s shortcomings and certain aspects of their behaviour, and certain phrases used could have been better thought through,321Foot Note 321×1 DRCS at paras 149 to 154it was not proven that this was to harm the plaintiff. They could have been for the purposes of moving things forward. 232 As for the other defendants, I found that their actions were in their own interests, and it was not sufficiently proven that those acts were done with the intention to cause harm to the plaintiff. 233 Communications between the defendants were to be expected as they all disagreed with the direction that the plaintiff wanted to take and had a similar position on how to move the business forward. 234 The plaintiff also did not adduce sufficient evidence to prove that the audit was an attempt to stall the shareholder agreement while covertly transferring out the assets. Any lack of response by the defendants to the plaintiff’s queries was because Tainton and Reid had already told the plaintiff to refer all queries to Caracoussis, who was Tainton and Reid’s accountant. This was accepted to be true by the plaintiff.322Foot Note 322×1 DRCS at para 156; PCS at para 284 235 The fact that the returns of the Rock Business were to be paid to family trusts owned by Tainton and Reid did not show that they wanted to harm the plaintiff. They were merely advancing their own interests, especially since they were the beneficial owners pursuant to the April 2011 Agreements. 236 The fact that legal fees may be borne by Tainton and/or Reid did not prove that there was a combination or arrangement between the defendants to cause harm to the plaintiff. The dispute between the parties pertained to the business, and it was plausible that between the defendants, Tainton and Reid as the beneficial owners of the business could have had been asked or could have had offered to support the rest. Further, the defendants could have had perceived the plaintiff as their “common enemy” due to his commencement of the suit against them, but it did not follow that they had conspired to harm him. 237 Finally, although it was inevitable that the plaintiff would be harmed by the defendants’ actions, given that the defendants were arguing that the 2012 and 2014 Agreements did not exist, this was neither the means nor the end, but just an unintended consequence of the defendants’ goal of protecting their own interests. For the above reasons, the claim for conspiracy was not made out.",
        "Deceit": "238 The plaintiff pleaded in the Statement of Claim that the defendants deceived the plaintiff into executing a proxy as regards his voting rights as a member of Rock Singapore in Biggs’s favour, causing the transfer of the Rock Marks to be assigned from Rock Holdings to Biggs.323Foot Note 323×SOC at para 67He also pleaded that the defendants deceived him into believing that an audit was being conducted on Rock Singapore, when instead, during such time, the defendants were secretly transferring out the assets of Rock Singapore, and transferring the Rock Marks.324Foot Note 324×SOC at para 67 239 However, this ground of claim was not canvassed during the issues and arguments at trial, and I regarded it as largely having fallen away.325Foot Note 325×PCS, PRCS",
        "Remedies": "240 Given my decision that the plaintiff’s various claims were not made out, I will deal with the remedies for breach of agreement only briefly, assuming in the alternative that the 2012 and/or 2014 Agreement were breached. The plaintiff argued that the 2012 Agreement and/or 2014 Agreement were breached by the defendants by denying him 30% beneficial shareholding in the Rock Business, and by excluding him from the Rock Business as well as the profits derived from the Rock Business.326Foot Note 326×PCS at para 446 241 The alleged wrong committed via conspiracy was similarly that the defendants denied him his shareholding (above at [221]). The remedy for conspiracy would hence involve similar reasoning as the remedy for breach of contract and will only be briefly addressed later below. 242 I will not separately address remedies for proprietary estoppel, since that will involve a range of possible outcomes.",
        "Date of assessing damages": "243 The plaintiff sought damages in lieu of specific performance, which was argued to be assessable as at the date of judgment, or alternatively, the date of the closing submissions, 30 April 2019, which was the date where the plaintiff elected for damages in lieu of specific performance.327Foot Note 327×PCS at para 485He argued that specific performance shouldprima faciebe available where the subject matter of the contract was shares that were not purchasable on the open market.328Foot Note 328×PCS at para 477He argued that even for damagessimpliciter, the relevant date of assessing damages would still have been the date of judgment.329Foot Note 329×PCS at para 486 244 The defendants argued that the date of assessing damages for breach of contract and conspiracy should both be around March/April 2015, being the time of the breach, and the time the loss or wrong was sustained (Phangat para 22.002).330Foot Note 330×2 DCS at paras 483 to 484 245 I accepted the defendants’ contention that the date of assessing damages should be the date of the breach, but for slightly different reasons. 246 The key question in determining the date of assessing damages is to determine when the plaintiff ought reasonably to have mitigated the breach:Johnson v Agnew[1980] AC 367 (“Johnson”) at 400 (see alsoPhangat para 22.004): Damages were held measureable as at the date of hearing rather than at the date of the defendant’s breach, unless the plaintiff ought reasonably to have mitigated the breach at an earlier date … 247 This was also noted by the Court of Appeal inTay Joo Sing v Ku Yu Sang[1994] 1 SLR(R) 765 at [37], stating: “The key question in this appeal is whether the respondent ought to have mitigated his loss in the circumstances”. 248 The general rule is that the plaintiff is expected to mitigate his loss from the date of the breach, and hence damages are assessed at the time of breach (Johnsonat 400;Phangat para 22.004). However, where the innocent party reasonably tries to have the contract completed, or tries to seek specific performance where specific performance is a possible remedy, the damages should be assessed at the date where specific performance is no longer available.Johnsonat 400 states: In cases where a breach of a contract for sale has occurred, and the innocent party reasonably continues to try to have the contract completed, it would to me appear more logical and just rather than to tie him to the date of the original breach, to assess damages as at the date when (otherwise than by his default) the contract is lost … 249 This was similarly noted inLim Beng Cheng v Lim Ngee Sing[2015] SGHC 282 (“Lim Beng Cheng”)at [122]: … It would be fair to say that an innocent buyer in a contract for the sale of land, being generally entitled to specific performance, is not expected to mitigate his loss if he is pursuing specific performance. Put another way, the reasoning that damages should be assessed as at the date of breach because the innocent purchaser can purchase a replacement from the market on the date of the breach does not hold true for contracts for the sale of unique goods where specific performance is a possible (and, in fact, desired) remedy. Thus, where damages are awarded in lieu of specific performance, the principle that damages should be assessed as at the date of the breach do not normally apply; a buyer’s entitlement to such damages should be assessed from the date that specific performance is no longer available. 250 The rationale for this rule was explained inHo Kian Siang v Ong Cheng Hoo[2000] 2 SLR(R) 480 at [30] (see alsoPhangat 22.004), where the court stated that assessing damages in lieu of specific performance at the time of the breach would effectively render the right to seek specific performance worthless: 30 Mr Sreenivasan’s first submission is that damages should be assessed as of the date of breach which in the present case is the contractual date of completion… But it seems to me that apart from authority, if this be the law, then the right given to the innocent party to seek specific performance would be worthless. If the innocent party were required to mitigate his damages from the time of breach he would in effect be confined to seeking his remedy in damages. I shall illustrate this with the following example. X enters into a contract to purchase a property from Y. On the date of contract, X had taken the view that the property will rise in value. Y fails to complete on the contractual completion date. X decides to sue for specific performance. In a situation where damages, if awarded in lieu of specific performance, are assessed at the time of breach then X, having taken the view that the market is on the rise, would have to go into the market and purchase an equivalent property. But should X succeed in obtaining an order for specific performance and Y then completes the transaction, X would be saddled with 2 properties. This is all very well if the market has moved up. But if it moved down instead, it would have doubled his losses in a situation where he had bargained for only half the exposure. The other reason why the right would be futile is a practical one. X would have paid to Y a deposit of about 10% of the purchase price. If X seeks an order for specific performance, he is not entitled to ask for the refund of this deposit. Without that money he is not likely to be able to purchase another property to mitigate his damages. 251 Applying these principles, the question in the present case is whether it was reasonable for the plaintiff to have sought specific performance (although he ultimately elected for damages in lieu of specific performance). 252 The Court of Appeal inLee Chee Wei(above at [53]) established that specific performance is a special and extraordinary remedy that should only be granted discretionarily where it is just and equitable to do so (at [52] to [53]). The court will consider whether damages is an adequate remedy, and whether the person against whom specific performance is sought would suffer substantial hardship (at [53]). 253 However, the court observed that while a contract to transfer shares in a publicly listed company will generally not be specifically enforced, a contract to transfer shares in an unlisted company is entitled to be specifically enforced, relying on several cases (at [54]): … While a contract to transfer shares in apubliclylisted company will generally not be specifically enforced, a contract to transfer shares in an unlisted company on the other hand can be specifically enforced at the suit of either purchaser or vendor (seeJones & Goodhartat pp 161–162). InPamaron Holdings Sdn Bhd v Ganda Holdings Bhd[1988] 3 MLJ 346, it was unequivocally held (at [16]), that ‘a seller of shares not freely saleable in the open market is entitled to specific performance’. Similarly, inDuncuft v Albrecht(1841) 12 Sim 189, the court decreed specific performance for the sale of shares which were limited in number and not always available in the open market. [emphasis in original] 254 This approach makes sense as shares in an unlisted company are unique, and the loss of these shares cannot be easily mitigated since such shares cannot be bought off the market and are not readily substitutable. 255Lee Chee Weialso noted that the fact that the plaintiff’s interest in the contract is purely monetary should notper sepreclude the grant of specific performance (at [54]). 256 In the present case, (assuming there was breach of contract) it had been legally possible for the plaintiff to pursue a claim for specific performance to obtain beneficial ownership of 30% of the shares in Rock Singapore. Rock Singapore was a private limited company and the shares were only owned by Tainton and Reid. They were unique, and not purchasable on the open market. There was a reasonable chance for the claim in specific performance to have had succeeded. 257 However, even though it had been legally possible, it was practically useless for the plaintiff to obtain 30% shares in Rock Singapore as almost all the assets in Rock Singapore had been transferred to Rock Nutrients International.331Foot Note 331×PCS at para 300Rock Singapore also no longer carried out the sale of the Rock Products, which was taken over by Rock Nutrients International.332Foot Note 332×PCS at para 302Hence, 30% ownership of Rock Singapore had no practical value. 258 The more important question was whether the plaintiff could gain specific performance of the term in the 2012 Agreement requiring that sale of the Rock Products would not be carried out other than through Rock Singapore (see [16] above). This would require the defendants to transfer the assets from Rock Nutrients International back to Rock Singapore and conduct business there again, which would give value to the plaintiff’s 30% beneficial ownership in Rock Singapore. 259 Applying the principles of specific performance, it is clear that this was highly unlikely to have succeeded. This was not an extraordinary situation where the discretion to grant specific performance had to be exercised to achieve justice. Further, it would cause hardship to the defendants, who had clearly fallen out with the plaintiff for business reasons, and who wanted to carry on their own business with nothing to do with the plaintiff. Tainton and Reid were furious that the plaintiff purported to represent the Rock Business at an event known as the High Times Cannabis Cup, which was a decision they did not agree with.333Foot Note 333×PCS at para 272Tainton, Yeo and Biggs then drafted a proposal which was sent to the plaintiff, informing him that “[i]t would be in the best interest of the company if [he] played no part in the future o[f] the company, not even as a minority shareholder”.334Foot Note 334×PCS at para 274; 8 CBD 4796 to 4798It was clear that their relationship had come to an end, and ordering specific performance in light of these would be to force hostile parties to work together in the same business. Avoiding such stalemate caused by hostile relationship between the parties was a reason why specific performance was not granted inLim Beng Cheng(above at [249]) at [112]. All these must have been clear to the plaintiff and it was reasonable for him to have had started mitigating his losses from the time that the assets were transferred out of Rock Singapore around March to April 2015. 260 Hence, I found that the date of assessing damages should have been the date of the breach. Since the parties both submitted assessments of damages with reference to 31 March 2015, this will be taken to be the approximate date of the breach.",
        "Quantum of damages": "261 The plaintiff and defendants both made alternative submissions for quantum of damages as of the date of breach (roughly taken to be 31 March 2015), and the date of most recent financial information, 30 June 2018, which was the closest date to when the plaintiff elected to seek damages in lieu of specific performance.335Foot Note 335×PCS at para 494; 2 DCS at para 535In light of the above, it was only necessary to discuss the quantum for 31 March 2015. 262 The plaintiff’s expert witness, Mr Martin,336Foot Note 336×PCS at p 2valued the Rock Business at US$3,098,946 as at 31 March 2015.337Foot Note 337×List of Agreed Issues dated 15 February 2019 (“Agreed List”) at p 11; Mr Martin’s AEIC at p 73This was based on cash flow projection relying on the increase in sales and taking into account projected expenses, even accounting for appropriate discounts. This was also based on a 10 year projection period from 2015 to 2025 which showed that there would be a terminal value of sales of about US$9 million in 2025.338Foot Note 338×PCS at paras 498 to 505Such projection accounted for a significant increase in sales due to the new business model arising from an agreement with Hydrofarm Inc (“Hydrofarm Agreement”),339Foot Note 339×PCS at p 1which was producing significant positive results.340Foot Note 340×PCS at paras 507 to 508Hence, Mr Martin projected the annual increase in sales for 2015 to be US$710,000,341Foot Note 341×Notes of Evidence dated 20 February 2019 (“NE 20 February 2019”) at p 31; PCS at para 506; Agreed List at p 8which provided the starting point for the 10 year valuation. 263 The defendant’s expert, Mr Potter,342Foot Note 342×PCS at p 2valued the Rock Business at between US$0 to US$717,478.343Foot Note 343×Agreed List at p 11He gave evidence that a five-year projection was more appropriate,344Foot Note 344×2 DCS at paras 501 to 505with the annual increase for 2015 to only be US$590,000.345Foot Note 345×NE 20 February 2019 at p 30Cash would have to be kept in hand to cover downturns or other unexpected events. Discounting would also have to be made for various risks.346Foot Note 346×2 DCS at paras 493 to 498The defendants also relied on the evidence of Mrs Tainton to argue that there was a downturn which was likely to continue.347Foot Note 347×2 DCS at para 532 264 It is important to note that there was a discrepancy between the valuation and the remedy that should be awarded. Based on the pleadings, the plaintiff’s proper remedy should only have had been damages in lieu of 30% of shares of Rock Singapore, if he had succeeded (see above at [22] to [27]). However, the valuation did not only specifically pertain to Rock Singapore, but was a valuation of the entire Rock Business, covering all sales of Rock Products outside of Australia.348Foot Note 348×Agreed List at p 1This discrepancy had likely occurred because the pleadings did not clearly define what 30% shares in Rock Business referred to, which was unclear especially since Rock Business was not an entity (see above at [22] to [27]). In any case, since parties were in agreement that the appropriate valuation should be that of the Rock Business, I used it as a proxy for the value of shares in Rock Singapore, reaching the same outcome.",
        "Illegality": "277 I had some concerns as to whether the doctrine of illegality barred the claims, but these were dispelled. 278 The Rock Products were mainly plant nutrients, which were particularly effective for growing cannabis.368Foot Note 368×Mr Hugh Sutcliffe Martin’s affidavit of evidence-in-chief dated 22 January 2019 (“Mr Martin’s AEIC”) at para 6.1.1Cannabis and cannabis mixture are Class A controlled drugs listed in the First Schedule to the Misuse of Drugs Act (Chapter 185, 2008 Rev Ed) (“MDA”), and trafficking, importing or exporting more than a certain specified amount of them attracts the mandatory death penalty under the Second Schedule of the MDA. The MDA has extraterritorial application and also criminalises the aiding, abetting, counselling or procuring of the commission of any offence under the MDA within Singapore, even if all of the acts were done outside Singapore, and also criminalises acts done outside Singapore which if committed in Singapore would be an offence under the MDA (see s 13 MDA). This raised a question of whether the purported contract was tainted by illegality such that the claim should not be allowed to proceed, or whether the claim was contrary to public policy. 279 The plaintiff argued that no issue of illegality arises, and took note that it was also not raised by the defendants.369Foot Note 369×PCS at paras 474 to 476 280 There was no dispute as to the applicable principles, which have been laid down by the Court of Appeal inOchroid TradingLimited and another v Chua Siok Lui (trading as VIE Import & Export) and another[2018] 1 SLR 363. There can be no recovery pursuant to an illegal contract which is prohibited either under a statute (expressly or impliedly), and/or under an established head of common law public policy (at [176]). As for contracts which are not unlawfulper sebut entered into with the object of committing an illegal act, a proportionality test will apply to determine if the contract is enforceable (at [176]). 281 I was satisfied that in the present case, the activities of the Rock Business were not prohibited by any statute or established head of public policy. It was not shown that cannabis was ever brought to Singapore through the parties, or that the parties even dealt in cannabis. The supply of Rock Products that are useful to cannabis cultivation would not to my mind have amounted to any unlawful act occurring in Singapore. Although the projected growth in revenue of the business was premised on and driven by growth in demand for cannabis,370Foot Note 370×Mr Martin’s AEIC at pp 15 to 16this was only one possible use of the Rock Products and not the only one. I did not thus consider that the doctrine of illegality militated against allowing the proceedings to continue.",
        "Conclusion": "282 For the reasons above, the claims of the plaintiff were dismissed. Aedit AbdullahJudge Quek Yi Zhi, Joel and Jonathan Wah Yi Liang (Wongpartnership LLP) for the plaintiff; Eileen Tok See Teng, Richard Yeoh Kar Hoe and Hsu Sheng Wei, Keith (David Lim & Partners LLP) for the first defendant; S Selvam s/o Satanam, Choo Xiuhui, Gladys and Dawn Tan Si Jie (Ramdas & Wong) for the second, third, fifth and seventh defendants; Koong Len Sheng and Yvonne Mak Hui-Lin (TSMP Law Corporation); subsequently, Koong Len Sheng (David Lim & Partners LLP) for the fourth and sixth defendants."
    }
}