{
    "case_title": "National Bank of Oman SAOG Dubai Branch vBikash Dhamala and others",
    "ncitation": "[2020] SGHC 199",
    "coram": "Tan Siong Thye J (delivering the judgment of the courtex tempore)",
    "sections": {
        "Introduction": "1 The plaintiff, National Bank of Oman SAOG Dubai Branch (“NBO”), is the Dubai branch and wholly owned subsidiary of the National Bank of Oman, a bank headquartered in the Sultanate of Oman.1Foot Note 1×Statement of Claim (Amendment No 2) (“SOC”), at para 1; Agreed Statement of Facts (“ASOF”), at para 1. 2 The NBO listed 15 defendants in Suit No 515 of 2017 (the “Suit”). However, only the NBO’s claims against five defendants are the subject matters of this trial. These defendants are the second, fourth, tenth, 14th and 15th defendants. The second defendant, Kismat International FZC (“Kismat FZC”), is a company incorporated in Sharjah, United Arab Emirates (“UAE”). The owners of Kismat FZC are the first and third defendants, Bikash Dhamala (“Bikash”) and Prakash Dhamala (“Prakash”). They were the masterminds of a conspiracy to defraud the NBO on oil transactions. Bikash and Prakash had earlier consented to judgments entered against them. The fourth defendant, Kismat Singapore Pte Ltd (“Kismat Singapore”) is a Singapore-incorporated company. The tenth defendant, Hla Myint Zu Lwin (“Zu Lwin”), is a Myanmar national and had been the director and 10% shareholder of Kismat Singapore since 19 May 2017. The 14th defendant, Joshi Trading Pte Ltd (“Joshi Trading”), is a Singapore-incorporated company whose director and sole shareholder is Bikash’s and Prakash’s nephew, Abishek Joshi. The 15th defendant, Madhu Dewan (“Madhu”), is Prakash’s wife and a Nepalese national.2Foot Note 2×ASOF, at paras 4, 7, 11, 27 and 28.I shall refer to the abovementioned five defendants collectively as “the Defendants”.",
        "Brief facts": "",
        "The Credit Facilities": "3 The NBO offered an invoice discounting credit facility to Kismat FZC by way of a General Facilities Agreement and a facility letter, both of which were dated 12 February 2015 (“the Credit Facilities”).3Foot Note 3×ASOF, at para 29; 1 Core Bundle of Documents (“CBD”) 63–82.The Credit Facilities were for discounting invoices drawn in favour of Shell International Trading Middle East (Shell) (“Shell”) and BP Singapore Pte Ltd (“BP Singapore”). The expiry date indicated for the Credit Facilities was 31 January 2016. 4 On 21 August 2016 the NBO issued a facility letter that renewed the Credit Facilities. This letter also stipulated that in addition to BP Singapore and Shell, the Credit Facilities could also be used for discounting invoices in favour of Abu Dhabi National Oil Company, Emirates National Oil Co Pte Ltd and Total Singapore Pte Ltd.4Foot Note 4×ASOF, at para 29; 1 CBD 101–104.On 30 September 2015, the NBO issued another facility letter to Kismat FZC to extend the Credit Facilities to include letters of credit and loans against trust receipts.5Foot Note 5×ASOF, at para 29; 1 CBD 96–100. 5 On 20 November 2016, Zu Lwin, acting on the instructions of Prakash, incorporated British Petroleum Company Pte Ltd (“BPCPL”). It is undisputed that BPCPL was incorporated to impersonate BP Singapore, the real McCoy which is a multinational oil trader.6Foot Note 6×ASOF, at paras 10–11; DCS, at paras 22 and 24.On 8 March 2016, Total Singapore Pte Ltd (“TSPL”) was similarly incorporated by Zu Lwin to impersonate a Singapore company related to another real McCoy, Total SA (“Total-related company”).7Foot Note 7×ASOF, at paras 17–18; DCS, at paras 22 and 25.Zu Lwin was the director of TSPL at all material times and she was also the director of BPCPL from 20 November 2015 to 21 March 2017.8Foot Note 8×ASOF, at para 20. 6 Between 1 March 2017 and 20 March 2017, the NBO disbursed four loans to Kismat FZC pursuant to the Credit Facilities (“the Loans”), as follows:9Foot Note 9×Plaintiff’s Closing Submissions (“PCS”), at para 5. S/NDescription of facilityOutstanding loan (excluding interest and commission)1Invoice discounting of invoice number 5421 issued by Kismat FZC to BPCPL (“Invoice 5421”).US$3,824,787.942Invoice discounting of invoice number 5492 issued by Kismat FZC to BPCPL (“Invoice 5492”).US$3,485,001.633Invoice discounting of invoice number 5548 issued by Kismat FZC to BPCPL (“Invoice 5548”).US$2,640,0004Letter of credit based on invoice issued by Universal Lubricants FZE to Kismat FZC, and loan against trust receipt for invoice number 5529 issued by Kismat FZC to TSPL (“Invoice 5529”).US$4,716,183.29TotalUS$14,665,972.86 7 For Invoices 5421, 5492 and 5548, the NBO received e-mails from BPCPL sent from the following e-mail address: finance.BP@se2bp.com, confirming that payment would be made by BPCPL to the NBO pursuant to the respective Invoices. For Invoice 5529, the NBO was copied in an e-mail from Prakash to TSPL instructing TSPL to remit payment to Kismat FZC’s account with the NBO. The e-mail address used for TSPL was Dong.Dan@sngtotal.com.10Foot Note 10×ASOF, at paras 34, 38, 43 and 47.Thus, the NBO was deceived into believing that it was dealing with the real McCoys. 8 Between 26 March 2017 and 16 April 2017, Kismat FZC defaulted on the Loans. There were several other transactions, besides the Loans, in which the NBO had granted loans under the Credit Facilities and these other loans were fully redeemed by Kismat FZC. The NBO is not pursuing these other loans in the present action as it had been paid for those loans. Thus, the NBO was not alerted to Bikash’s, Prakash’s and the Defendants’ conspiracy to defraud the NBO until the Loans were defaulted on and the conspiracy exposed.",
        "The bank transfers, Mareva injunctions and gold bars": "9 Between 1 March 2017 and 11 June 2017, Kismat Singapore received moneys via bank transfer from Kismat Energy DMCC (“Kismat Energy”), TSPL, Impex Gulf FZC (“Impex”) and Kismat FZC. Kismat Singapore, around the same period, also remitted various sums to TSPL, Universal Lubricants FZE (“Universal”), Impex, Bikash and Prakash. These numerous transfers ranged from US$12,000 to more than US$3m. On 21 April 2017, Kismat Singapore also purchased over US$6m worth of gold bars in ten equal transactions.11Foot Note 11×PCS, at para 27; Annex 1. 10 On 9 June 2017, Kan Ting Chiu J granted a Mareva injunction restraining Bikash, Kismat FZC, Prakash and BPCPL from disposing of, dissipating, pledging, charging, assigning or otherwise dealing with any of their assets worldwide up to the value of US$14,831,141.53 (“the First Mareva Injunction”).12Foot Note 12×ASOF, at para 54; HC/ORC 3715/2017. 11 However, between 12 June 2017 and 15 June 2017, Kismat Singapore transferred a total of US$7,130,000 to Joshi Trading via four transactions. Between 15 June 2017 and 8 August 2017, Joshi Trading purchased US$5,222,362.88 worth of gold bars in eight transactions and remitted a total of US$35,000 to a bank account held by Madhu. On 23 August 2017, Zu Lwin leased 16 safe deposit boxes (“the Safe Deposit Boxes”) from Certis Cisco Security Pte Ltd (“Certis Cisco”), with Madhu listed as a second additional licensee. On 24 August 2017, Joshi Trading issued an invoice for the sale of 128kg of gold bars to Zu Lwin and Madhu for US$7,250,517.76.13Foot Note 13×ASOF, at paras 57–65. 12 On 30 August 2017, Lai Siu Chiu SJ granted an order of committal against Bikash and Prakash for breaching the First Mareva Injunction, and sentenced them to four months’ imprisonment each. On 13 September 2017, Andrew Ang J granted a Mareva injunction against Kismat Singapore, Zu Lwin, Joshi Trading and Madhu restraining each of them from disposing of, dissipating, pledging, charging, assigning or otherwise dealing with any of their assets worldwide up to the value of US$14,831,141.53 (“the Second Mareva Injunction”).14Foot Note 14×ASOF, at paras 66–67. 13 The next day, on 14 September 2017, Zu Lwin was served with the Second Mareva Injunction. The same day, Zu Lwin attempted to access the Safe Deposit Boxes to remove the gold bars. When Zu Lwin was denied access to the Safe Deposit Boxes, she asked Certis Cisco whether Madhu could access the Safe Deposit Boxes instead. Presently, there is an outstanding committal proceeding (Summons No 4223 of 2018) against Bikash, Prakash, Zu Lwin and Madhu for breach of the Second Mareva Injunction. 14 On 21 June 2018, the Sheriff seized the 128kg of gold bars contained in the Safe Deposit Boxes. The proceeds of sale of the gold bars amounted to approximately US$5,809,718 (after setting off the expenses incurred in the sale).15Foot Note 15×ASOF, at paras 68–72.",
        "The present claims": "15 In the three years since the Suit was commenced, save for the two defendants against whom the NBO discontinued the Suit, namely Meenachi d/o Velu Krishnasamy and Vijayalakshmi Jagadeesh, the other defendants (including BPCPL, TSPL and their sole directors/shareholders) have had final or default judgment entered against them.16Foot Note 16×ASOF, at paras 9, 12, 14, 16, 19, 22, 24 and 26.In particular, final judgment by consent was entered against Bikash and Prakash on 5 April 2018.17Foot Note 17×HC/ORC 1943/2018; ASOF, at paras 3 and 6.Hence, only the NBO’s claims against the Defendants remain up till today.",
        "My decision": "",
        "The issues": "16 The issues that arise for my determination are as follows: (a) Whether Kismat FZC is liable for fraudulent misrepresentation in so far as it fraudulently misrepresented to the NBO that it transacted with and was owed genuine trade receivables by the major oil companies, BP Singapore, the Total-related company and/or their related entities. (b) Whether the Defendants conspired by unlawful means to induce the NBO to extend the Loans to Kismat FZC and to receive, dissipate, conceal and/or wrongfully retain the moneys so disbursed, with the intention of thereby causing loss to the NBO. (c) Whether Kismat Singapore, Joshi Trading and Madhu are constructive trustees of the moneys they received from Kismat FZC, which had been acquired pursuant to the conspiracy to defraud the NBO. (d) Whether Kismat Singapore, Joshi Trading and Madhu are liable for knowing receipt of the moneys they received from Kismat FZC, which had been acquired pursuant to the conspiracy to defraud the NBO. (e) Whether Kismat Singapore, Joshi Trading and Madhu are liable for unjust enrichment, having received moneys from Kismat FZC which had been acquired pursuant to the conspiracy to defraud the NBO.",
        "Submission of no case to answer": "17 Long before the commencement of the trial, the Defendants applied for Bikash and Prakash to give evidence by way of video-link in this trial. Bikash and Prakash did not wish to give evidence in person as they feared that they would be arrested upon arrival in Singapore as they had been sentenced to four months’ imprisonment for contempt of court. The NBO opposed the application and I ruled in favour of the NBO. The Defendants sought leave to appeal against my decision.18Foot Note 18×HC/ORC 6012/2018; HC/SUM 4326/2018. 18 However, due to the COVID-19 pandemic which resulted in worldwide travel restrictions, the testimonies of witnesses have to be given via video-link. As a corollary, the application for leave to appeal against my decision became unnecessary as the NBO and the Defendants agreed for their witnesses to give evidence by video-link. Despite this opportunity for the Defendants to call Bikash and Prakash to testify on their behalf, the Defendants nevertheless decided not to testify and call any witnesses. They elected to submit that there is no case to answer. 19  In this situation, the NBO need only to establish its claim on aprima faciebasis.19Foot Note 19×PCS, at paras 7–9; 2nd, 4th, 10th, 14th and 15th Defendants’ Closing Submissions (“DCS”), at para 4.As the Court of Appeal explained inLena Leowardi v Yeap Cheen Soo[2015] 1 SLR 581 (“Lena Leowardi”)at [23]–[24]: 23 … The test of whether there is no case to answer is whether the plaintiff’s evidence at face value establishes no case in law or whether the evidence led by the plaintiff is so unsatisfactory or unreliable that its burden of proof has not been discharged … 24 Three important implications flow from this submission. First, the Appellant only had to establish aprima faciecase as opposed to proving her case on a balance of probabilities … Second, in assessing whether the Appellant has established aprima faciecase, the court will assume that any evidence led by the Appellant was true, unless it was inherently incredible or out of common sense … Third, if circumstantial evidence is relied on, it does not have to give rise to an irresistible inference as long as the desired inference is one of the possible inferences … 20 As observed by Jeffrey Pinsler, SC inSingapore Court Practice(LexisNexis Singapore, 2020)at para 35/4/10, a “defendant who elects not to adduce evidence will lose if the plaintiff has adduced sufficient evidence to establish his claim”. This was explained by S Rajendran J inCentral Bank of India v Bansal Hemant Govindprasad and others and other actions[2002] 1 SLR(R) 22 at [21]: A decision by a defendant not to adduce evidence in his defence is a decision that ought not to be lightly taken. Where a defendant makes such an election, the result will be that the court is left with only the plaintiff’s version of the story. So long as there is someprima facieevidence that supports the essential limbs of the plaintiff’s claim(s), then the failure by the defendant to adduce evidence on his own behalf would be fatal to the defendant.",
        "Fraudulent misrepresentation": "21 The elements of fraudulent misrepresentation are as follows (see the Court of Appeal decision inPanatron Pte Ltd v Lee Cheow Lee[2001] 2 SLR(R) 435, recently cited by the High Court inMSP4GE Asia Pte Ltd and another v MSP Global Pte Ltd and others[2019] 3 SLR 1348 at [151]):20Foot Note 20×PCS, at para 11.(a) there must be a representation of fact made by words or conduct; (b) the representation must be made with the intention that it should be acted upon by the plaintiff; (c) the plaintiff acted upon the false statement; (d) the plaintiff suffered damage by acting upon the false statement; and (e) the representation was made with the knowledge that it is false, or at least made in the absence of any genuine belief that it is true. 22 I find that the NBO has shown aprima faciecase in respect of all the requirements of fraudulent misrepresentation. As regards the first requirement, Bikash and Prakash represented to the NBO that they had dealings with a number of multinational oil companies, the real McCoys. This is clearly supported by the testimony of the NBO’s employees Khalifa Sahloof Al Riyami (“Mr Khalid”) and Mr Johnson Romesh Absalom (“Mr Johnson”).21Foot Note 21×Affidavit of Evidence-in-Chief (“AEIC”) of Johnson Romesh Absalom (“JRA”), at para 16(a)–(b); AEIC of KKSAR, at para 19; PCS, at para 12(b).This is also confirmed by the General Facilities Agreement dated 12 February 2015, which expressly states that the NBO would only discount invoices drawn in favour of Shell and BP Singapore.22Foot Note 22×1 CBD 64; PCS, at para 12(b). 23 Bikash and Prakash also represented to the NBO that there were trade receivables owed to Kismat FZC by BP Singapore and a Total-related company. The Defendants themselves admit that BPCPL and TSPL were incorporated to impersonate BP Singapore and a Total-related company respectively.23Foot Note 23×ASOF, at paras 10 and 17.Similarly, the invoices and related transaction documents used the registered addresses of BP Singapore and Total Oil Asia-Pacific Pte Ltd, instead of BPCPL and TSPL’s own registered addresses.24Foot Note 24×1 CBD 45, 51, 54, 57; PCS, at paras 12(d)(i) and 12(e)(i).Forged authorisation letters were issued under BP Singapore’s letterhead and set out BP Singapore’s registered address.25Foot Note 25×2 CBD 711; PCS, at para 12(d)(iii).Even the e-mail domains used for BPCPL and TSPL closely resembled those of BP Singapore and the Total-related company respectively.26Foot Note 26×AEIC of KKSAR, at para 30(c); PCS, at paras 12(d)(ii) and 12(e)(ii).The Defendants admit that Kismat FZC created these e-mail domains to resemble closely the e-mail domains of the real McCoys (ie, BP Singapore and the Total-related company).27Foot Note 27×DCS, at para 26. 24 Thus, Kismat FZC represented that it had contacts with multinational oil companies, and was owed trade receivables by BP Singapore and a Total-related company. Flowing from this, the other requirements of fraudulent misrepresentation are satisfied. Having gone to such lengths, the goal shared by Bikash and Prakash must have been to induce the NBO to disburse loans to Kismat FZC. The NBO acted upon the representations, granted the Credit Facilities and disbursed the Loans.28Foot Note 28×PCS, at paras 13 and 14.The reliance placed by the NBO on Kismat FZC’s representations is evident from the references to BP Singapore and TSPL in the facility letters (see [3] and [4] above) and Mr Khalid’s and Mr Johnson’s testimony.29Foot Note 29×NE, 4 August 2020, p 50, line 21 to p 51, line 13; p 57, lines 12–24; 5 August 2020, p 96, lines 3–6.Further, there is the admission that Bikash and Prakash knew about the establishment of entities to impersonate the real McCoys (ie, the realmultinational oil companies) to create false and fraudulent representations to deceive the NBO. When Kismat FZC defaulted on the Loans, the NBO suffered losses.30Foot Note 30×PCS, at para 15. 25 At all times, Bikash and Prakash were the directing minds of Kismat FZC. Therefore, their actions can be attributed to Kismat FZC (seeHalsbury’s Laws of Singapore(LexisNexis Singapore) (“Halsbury’s Laws of Singapore”) at para 70.072). 26 In response, the Defendants allege that the NBO’s senior officers, namely Mr Khalid and Mr Johnson, had colluded with Bikash, Prakash and Kismat FZC to incorporate BPCPL and TSPL so that the Credit Facilities could be fully utilised for prohibited trades in Iranian oil. According to the Defendants, Mr Khalid and Mr Johnson suggested incorporating fake companies, assuring Bikash and Prakash that the drawdown would be approved. It was also further alleged that the supporting documents should not show the oil’s country of origin, as trades in Iranian oil using US currency were prohibited in the UAE at the time.31Foot Note 31×DCS, at paras 18–20.To support this contention, the Defendants highlighted that the drawdowns were approved although Kismat FZC “never complied with any of the conditions imposed on the [C]redit [F]acilities”.32Foot Note 32×DCS, at paras 46 and 50.Thus, the NBO knew the documents were forged or fraudulent and could not have been induced by them in extending the Loans.33Foot Note 33×DCS, at paras 46, 48 and 49. 27 I reject this submission as there is no evidence to support these spurious allegations. First, the Defendants have not produced a single shred of evidence. In contrast, the NBO’s witnesses categorically denied such allegations.34Foot Note 34×NEs, 4 August 2020, p 56, lines 12–20; 5 August 2020, p 41, line 15 to p 42, line 13; p 107, lines 18–22; PCS, at para 65(j); PRS, at para 8(f).Mr Johnson testified that it was Kismat FZC’s finance manager who first approached the NBO to seek credit facilities.35Foot Note 35×AEIC of JRA, at para 9; NEs, 5 August 2020, p 26, lines 16–23; PRS, at para 8(b).Moreover, Mr Johnson, Mr Khalid, and another NBO employee, Mr Navin Dhanushka Anthony Weerakoon Amaratunga (“Mr Navin”), consistently maintained that it was the Trade Finance Department of the NBO (“TFD”) which checked the transaction documents. Neither Mr Johnson nor Mr Khalid had any control or influence over the TFD, which at that time was located in Abu Dhabi while the NBO’s main office was in Dubai, another city some 150km away.36Foot Note 36×NEs, 4 August 2020, p 16, line 20 to p 19, line 9; p 86, line 15-17, p 88, line 4 to p 89, line 20; p 58, lines 3–15; 5 August 2020, p 56, lines 13–21; 6 August 2020, p 41, lines 2–20; p 48, line 22 to p 49, line 6; PCS, at para 65(a)–(d).Thus, it does not make sense that Mr Johnson and Mr Khalid would propose the alleged collusion. I find the evidence of the NBO’s witnesses credible and reliable and thus not inherently incredible or out of common sense, and I accept them to be true. 28 Secondly, I accept that there were some procedural irregularities in the processing and drawdown of the Credit Facilities. However, these were not as extensive or egregious as the Defendants suggest. The NBO received the required specimen signature from Kismat FZC on 14 September 2016,beforethe Loans were extended.37Foot Note 37×2 CBD 711; Plaintiff’s Reply Submissions (“PRS”), at para 8(g).Although there appears to be a gap between the expiry of the Credit Facilities on 31 January 2016 and the facility letter dated 21 August 2016, Mr Johnson explained that this was common in the industry as time was needed to obtain the relevant information and approve the extension of the Credit Facilities.  Furthermore, there was no recall notice issued to Kismat FZC, hence, the NBO continued to permit drawdowns from the Credit Facilities.38Foot Note 38×NEs, 5 August 2020, p 111, line 24 to p 114, line 21; PCS, at para 8(c).Therefore, Kismat FZC complied with all the requirements except for the condition that the original invoices be countersigned by BP Singapore’s representative office in the UAE.39Foot Note 39×1 CBD 64, 116, 137, 158, 196; PRS, at para 8(h). 29 In relation to this irregularity, I accept that this was due to a genuine oversight by the TFD.40Foot Note 40×NEs, 6 August 2020, p 58, lines 5–22; PCS, at para 65(g); PRS, at para 8(h).Mr Navin explained that initially, the requests submitted by Kismat FZC pertained to transactions with Shell, for which only the signature of Shell’s representative was required. Thus, the TFD mistakenly assumed that the same applied to the invoices issued to BPCPL such that only one signature from BPCPL was required.41Foot Note 41×AEIC of Navin Dhanushka Anthony Weerakoon Amaratunga, at paras 11–15.I find Mr Navin’s explanation reasonable and not inherently incredible or out of common sense. 30 Finally, even if Mr Johnson and Mr Khalid had colluded with Bikash, Prakash, and by extension, Kismat FZC, their knowledge should not be attributed to the NBO. They were not the directing minds of the NBO. It is axiomatic that the knowledge of an agent is not to be imputed to the principal where the agent is acting in fraud of his principal and the knowledge is relevant to the fraud (seeHalsbury’s Laws of Singaporeat para 70.118;Belmont Finance Corporation Ltd v Williams Furniture Ltd and others[1979] Ch 250 at 261–262;McNicholas Construction Co Ltd v Customs and Excise Commissioners[2000] STC 553 at [54]–[56]). 31 For the above reasons, I find that the NBO has established aprima facieclaim for fraudulent misrepresentation against Kismat FZC which requires the Defendants to respond to the NBO’s case.",
        "Conspiracy by unlawful means": "32 The NBO submits that the Defendants are liable for conspiring by unlawful means to defraud and induce the NBO to extend the Loans to Kismat FZC, as well as to dissipate, conceal and/or wrongfully retain the moneys so disbursed. The elements of unlawful means conspiracy are as follows (see the Court of Appeal decision inEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 at [91], [110] and [112]):42Foot Note 42×PCS, at para 20; DCS, at para 41. (a) Two or more persons combined to do certain acts. (b) The alleged conspirators intended to cause damage or injury to the claimant by those acts. It is insufficient that harm to the claimant was likely, probable or even an inevitable consequence, although such states of mind may be a factor supporting an inference of intention. (c) The acts were unlawful. This includes acts which are actionable civil wrongs. (d) The acts were performed in furtherance of the agreement. (e) The plaintiff suffered loss as a result of the conspiracy. 33 Based on my findings at [23] and [24] above, the third and fifth requirements are established. I shall, therefore, consider whether the NBO hasprima facieestablished the first, second and fourth requirements. There are two related sets of acts alleged by the NBO. First, the inducement of the NBO to extend the Loans. Second, the dissipation of the moneys received from the Loans. I shall deal with each in turn. Inducement of the NBO to extend the Loans 34 Kismat FZC and Zu Lwin are alleged to have been involved in inducing the NBO to extend the Loans to Kismat FZC. I have already addressed the critical role played by Kismat FZC, such that all the requirements of unlawful means conspiracy are established. 35 As regards Zu Lwin, it is not disputed that she instructed the incorporation of BPCPL and TSPL.43Foot Note 43×ASOF, at paras 11 and 18.What is disputed is (a) whether Zu Lwin acted together with Bikash and Prakash to defraud the NBO; (b) whether Zu Lwin intended thereby to cause damage or injury to the NBO; and (c) whether BPCPL and TSPL were incorporated in furtherance of such an agreement. 36 The Defendants contend that Zu Lwin was not aware of the purpose of incorporating BPCPL and TSPL.44Foot Note 44×DCS, at paras 23, 58 and 59.In my view, however, the evidence suggests otherwise. Zu Lwin was actively involved in Bikash’s and Prakash’s scheme. Not only did she incorporate BPCPL and TSPL, she also enquired whether the name “Sinopec Singapore Pte Ltd” was available. This is similar to the real McCoy, Sinopec Group, which is also a large oil and petrochemical company.45Foot Note 45×2 CBD 682; PCS, at para 35(b).With her tertiary qualifications and experience in the oil and petroleum industry, she must have known that these names were similar to existing multinational oil companies.46Foot Note 46×2 CBD 577–579; DCS, at para 58; PCS, at para 35(c).In fact, she was alerted to this twice when the consulting firm hired to incorporate BPCPL informed her that the name of the company was “a bit sensitive because of the words/terms involved”.47Foot Note 47×2 CBD 658, 659; PCS, at para 35(a).Moreover, it is undisputed that she was the director of BPCPL and TSPL in the period during which the forged and/or fraudulent documents were issued to the NBO.48Foot Note 48×ASOF, at para 20. 37 Given the totality of the evidence, the reasonable and logical inference is that Zu Lwin, together with Bikash and Prakash and in furtherance of the fraudulent conspiracy, incorporated BCPL and TSPL, and submitted forged documents to the NBO, thereby inducing the NBO to disburse the Loans. Her participation in this fraudulent conspiracy and knowledge of the potential effects of the conspiracy on the NBO suggests that she intended to cause damage or injury to the NBO. Dissipation, concealment and/or wrongful retention of proceeds of fraud 38 All the Defendants have been implicated by the NBO in the dissipation, concealment and/or wrongful retention of the moneys disbursed pursuant to the Loans. I shall address each Defendant in turn. (1) Kismat Singapore 39 The NBO submits that Kismat Singapore was used as a conduit to facilitate the dissipation and concealment of funds traceable to the Loans.49Foot Note 49×PCS, at paras 27(a)(i); 31 and 32.The following evidence is pertinent: (a) Bikash and Prakash were the only shareholders and directors of Kismat Singapore at the material time.50Foot Note 50×ASOF, at paras 2 and 5; PCS, at para 32. (b) Kismat Singapore received and remitted significant sums of money from and to various persons and companies (see [9] above). These companies were associated with Bikash and Prakash, or otherwise raise suspicion. Kismat Energy was controlled by Bikash and Prakash,51Foot Note 51×DCS, at para 6; PCS, at para 27(a)(iii).TSPL was incorporated upon Prakash’s instruction,52Foot Note 52×ASOF, at para 18; PCS, at para 27(a)(ii).Joshi Trading’s sole director and shareholder is Bikash’s and Prakash’s nephew,53Foot Note 53×ASOF, at para 27.and Impex’s director and sole shareholder is the sole shareholder and director of TSPL.54Foot Note 54×ASOF, at para 21; 1 CBD 51–53; PCS, at para 27(a)(iii).Universal’s name closely resembles that of  the real McCoy, Universal Lubricants, a multinational lubricants manufacturer, echoing Bikash’s and Prakash’smodus operandiof impersonating multinational companies.55Foot Note 55×PCS, at para 27(a)(ii). (c) The transfers from Kismat Singapore significantly increased in frequency and value from 12 June 2017, the first working day after the First Mareva Injunction was granted.56Foot Note 56×PCS, at para 37(a)(iv); Annex A; ASOF, at paras 55–60. 40 Based on the above, I find that the NBO has established aprima faciecase that Kismat Singapore, together with Bikash, Prakash and the Defendants, facilitated the transfer of moneys, in furtherance of the conspiracy to dissipate the moneys disbursed by the NBO. Since Bikash and Prakash were the controlling minds of Kismat Singapore, their intention to cause damage and injury to the NBO can be attributed to Kismat Singapore. (2) Joshi Trading 41 The NBO similarly submits that Joshi Trading was used as a vehicle to dissipate and conceal the moneys obtained from the NBO.57Foot Note 57×PCS, at para 42.I note the following: (a) Bikash’s and Prakash’s nephew is Joshi Trading’s director and sole shareholder.58Foot Note 58×ASOF, at para 27; PCS, at para 44(c).According to the Defendants, Joshi Trading was created so that Prakash and Bikash could carry out trading from Singapore.59Foot Note 59×DCS, at para 39.To the contrary, however, the evidence shows that Joshi Trading was established to carry out nefarious activities to dissipate assets belonging to the NBO. (b) Joshi Trading also received and remitted moneys from and to persons and/or companies associated with Bikash and Prakash:60Foot Note 60×PCS, at para 43; Annex A. (i) Joshi Trading received US$7,130,000 from Kismat Singapore. The bulk of this (specifically, US$5,390,000) was transferred between 12 June and 15 June 2017; 12 June 2017 was the first working day after the First Mareva Injunction was granted (see [39(c)] above). (ii) Joshi Trading purchased US$5,222,362.88 worth of gold bars on 15 June 2017, the same day as the last transfer of moneys from Kismat Singapore. Prior to these transfers, Joshi Trading had a total bank balance of US$2,467.17.61Foot Note 61×1 CBD 294, 298, 312; PCS, at para 27(c).Therefore, the moneys used to purchase the gold bars must have come from the funds received from Kismat Singapore. (iii) Joshi Trading received US$1,010,659.75 from Impex. (iv) Joshi Trading remitted US$35,000 to Madhu. (v) Joshi Trading issued an invoice for the sale of 128kg of gold bars to Zu Lwin and Madhu for S$7,250,517.75 but there is no evidence of payment. 42 Based on the above, I find that the NBO hasprima facieestablished that Joshi Trading, together with Bikash, Prakash and the Defendants, facilitated the transfer of moneys, in furtherance of the conspiracy to dissipate the moneys disbursed by the NBO. Given the extent of Joshi Trading’s involvement and the close links between Bikash, Prakash and Joshi Trading’s director/shareholder, the reasonable and logical inference is that Joshi Trading shared Bikash’s and Prakash’s intention of causing damage or injury to the NBO. The fact that Joshi Trading was incorporated on 3 April 2017,afterthe scheme to defraud the NBO had already commenced, is not a bar to liability as long as Joshi Trading was sufficiently aware of the surrounding circumstances and shared the same object (seeThe “Dolphina”[2012] 1 SLR 992at [265]).62Foot Note 62×PCS, at para 44(a); DCS, at para 63.This was the case here. (3) Zu Lwin 43  The NBO submits that Zu Lwin, together with Bikash, Prakash and the Defendants and in furtherance of the conspiracy to defraud the NBO, dissipated and concealed the moneys obtained from the NBO.63Foot Note 63×PCS, at para 39.The following evidence is pertinent: (a) Based on my conclusion at [37] above that Zu Lwin was part of the conspiracy to induce the NBO to disburse the Loans to Kismat FZC, the reasonable and logical inference is that she also participated in dissipating such funds with the same intention to cause injury or damage to the NBO. (b) Zu Lwin was an employee, director and 10% shareholder of Kismat Singapore, which was part of the conspiracy. Zu Lwin was also a director of BPCPL and TSPL at the time the Loans were disbursed.64Foot Note 64×PCS, at para 39. (c) Joshi Trading issued Zu Lwin an invoice for 128kg of gold bars, which I concluded at [41(b)(ii)] above had been purchased using funds received from Kismat Singapore. There is no evidence to show that she paid for the gold bars. She rented the Safe Deposit Boxes to store the gold bars and attempted to remove the gold bars from the Safe Deposit Boxes the day she was served the Second Mareva Injunction.65Foot Note 65×PCS, at para 40(e); Plaintiff’s Bundle of Further Documents, Tab 2, at para 16(d).This was highly suspicious. When Zu Lwin applied to set aside the NBO’s writ of search and seizure, the learned assistant registrar dismissed her claim.66Foot Note 66×AEIC of KKSAR, at para 93. 44 Based on the above, I find that the NBO hasprima facieestablished that Zu Lwin, together with Bikash, Prakash and the Defendants, received the gold bars, in furtherance of the conspiracy to dissipate the moneys received from the NBO, with the intention of thereby causing damage and injury to the NBO. (4) Madhu 45 The NBO submits that Madhu acted in concert with Bikash, Prakash and the Defendants in furtherance of the agreement to dissipate the moneys received from the NBO.67Foot Note 67×PCS, at para 46.I note the following: (a) Madhu, similar to Zu Lwin, received the invoice from Joshi Trading for 128kg of gold bars. There is also no evidence that she paid for the gold bars. Madhu was also listed as the second additional licensee for the Safe Deposit Boxes.68Foot Note 68×ASOF, at paras 64–65; PCS, at para 46(c).Like Zu Lwin, she also applied to set aside the NBO’s writ of search and seizure, but her application was similarly dismissed.69Foot Note 69×AEIC of KKSAR, at para 93. (b) Madhu received US$35,000 from Joshi Trading,70Foot Note 70×ASOF, at paras 62–63.after Joshi Trading received US$5,390,000 from Kismat Singapore. No reason was given for the receipt of US$35,000. (c) Madhu is Prakash’s wife and circumstantial evidence shows that she assisted Prakash to dissipate assets. In the absence of any contradictory evidence from Madhu, the reasonable and logical inference is that she shared a close relationship with Prakash and therefore would have known Prakash’s reason for wanting the above acts to be done (seeSingapore Rifle Association v Singapore Shooting Association and others[2019] SGHC 13 at [71]).71Foot Note 71×PCS, at para 46(a). 46 Based on the above, I find that the NBO hasprima facieestablished that Madhu, together with Bikash, Prakash and the Defendants, received the gold bars and other moneys, in furtherance of the conspiracy to dissipate the moneys received from the NBO, intending to thereby cause damage and injury to the NBO. 47 For the above reasons, I find that the NBO hasprima facieestablished that Bikash, Prakash, and the Defendants conspired to fraudulently induce the NBO to extend the Loans and dissipate the moneys received from the NBO, with the intention of thereby causing damage or injury to the NBO. Such acts were unlawful and carried out in furtherance of the conspiracy to defraud the NBO. The NBO suffered loss as a result of this conspiracy. Thus, the elements of the NBO’s fraudulent misrepresentation claim areprima faciemade out. Quantum of damages 48 NBO claims damages comprising the principal sum disbursed under the Loans amounting to US$14,665,972.86, as well as loss of profits amounting to at least US$3,891,741.96,72Foot Note 72×PRS, at para 26; Annex 1.less the part-payment of AE$250,000 repaid to the NBO on or about 19 June 2017, and less the sum of US$5,933,826.56 which was recovered from the sale of the gold bars (“the Damages”) by the Sheriff.73Foot Note 73×PCS, at para 53; SOC, at prayer (a).The loss of profits refers to interests and commissions that the NBO could have earned from lending the moneys disbursed under the Loans to another customer.74Foot Note 74×PCS, at para 50; NE, 4 August 2020, p 87, line 6 to p 88, line 1.This is an ordinary incidence of the NBO’s business as a bank. 49 The Defendants submit that the NBO is not entitled to damages for loss of profits and that the NBO must account for the interest and commission received from Kismat FZC in respect of prior transactions under the Credit Facilities.75Foot Note 75×DCS, at para 71; DRS, at paras 46–50.I do not accept this. First, it is axiomatic that damages for fraudulent misrepresentation include all consequential losses suffered by the claimant in reliance upon the fraudulent misrepresentation. This is regardless of whether or not such loss was foreseeable (seeWishing Star Ltd v Jurong TownCorp[2008] 2 SLR(R) 909 (“Wishing Star”) at [21] and [28];East v Maurer[1991] 1 WLR 461).76Foot Note 76×PRS, at para 27.Therefore, the loss of interest and commission is recoverable. Secondly, although the claimant must account for any benefits received as a result of the transaction (seeWishing Starat [21], citingSmith New Court Securities Ltd v Citibank NA[1997] AC 254 at 266–267), there are no such benefits in this case. The NBO’s claim does not extend to all the loans disbursed to Kismat FZC pursuant to the Credit Facilities. Rather, it is only the Loans that have been impugned.77Foot Note 77×PRS, at para 28.There is no evidence that interest or commission was paid by Kismat FZC pursuant to the Loans. Thus, there are no benefits for which the NBO must account. 50 It is trite that once a conspiracy is proven, each co-conspirator is jointly and severally liable for the losses which the claimant has suffered (seeAsian Corporate Services (SEA) Pte Ltd v Eastwest Management Ltd (Singapore Branch)[2006] 1 SLR(R) 901 at [23]). Thus, each of the Defendants is jointly and severally liable for the Damages claimed by the NBO.78Foot Note 78×PCS, at para 52.",
        "Constructive trust": "51 The NBO submits that Kismat Singapore, Joshi Trading and Madhu are liable to account to the NBO as constructive trustees for US$3,697,324, US$2,918,296.87 and US$35,000 respectively.79Foot Note 79×PCS, at para 55.There are two broad categories of constructive trusts that are potentially applicable here – the institutional constructive trust (“ICT”) and the remedial constructive trust (“RCT”). The difference between the two was explained by Lord Browne-Wilkinson inWestdeutsche Landesbank Girozentrale v Islington London Borough Council[1996] AC 669 at 714–715, as cited by the Singapore Court of Appeal inChing Mun Fong (executrix of the estate of Tan Geok Tee, deceased) v Liu Cho Chit[2001] 1 SLR(R) 856 (“Ching Mun Fong”) at [35]: Under an institutional constructive trust, the trust arises by operation of law as from the date of the circumstances which give rise to it: the function of the court is merely to declare that such trust has arisen in the past. The consequences that flow from such trust having arisen (including the possibly unfair consequences to third parties who in the interim have received the trust property) are also determined by rules of law, not under a discretion. A remedial constructive trust, as I understand it, is different. It is a judicial remedy giving rise to an enforceable equitable obligation: the extent to which it operates retrospectively to the prejudice of third parties lies in the discretion of the court. 52 None of the circumstances giving rise to an ICT are present in this case (see the decision of Judith Prakash J (as she then was) inGuy Neale and others v Nine Squares Pty Ltd[2013] SGHC 249 (“Guy Neale”)at [141], citingLow Heng Leon Andy v Low Kian Beng Lawrence (administrator of the estate of Tan Ah Khng, deceased)[2011] SGHC 184 (“Low Heng Leon Andy”)at [53]). AlthoughLow Heng Leon Andyrefers to “fraud” as one of the facts that can found an ICT, this does not refer to fraudsimpliciter, but to cases where the “defendant fraudulently relies on the informality of a transaction to deny the beneficial interest of the claimant” (seeSnell’s Equity(John McGee QC gen ed) (Sweet & Maxwell, 33rd Ed, 2014)at para 26-011). Further, although the appeal against Prakash J’s decision inGuy Nealewas allowed inGuy Neale and others v Nine Squares Pty Ltd[2015] 1 SLR 1097, the Court of Appeal did not expressly comment on Prakash J’s decision at [141]. 53 As such, it remains to consider the RCT. The RCT was first considered in Singapore inChing Mun Fongand subsequently explained by the Court of Appeal inWee Chiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Wee Chiaw Sek Anna”) at [172] and [184]: 172 … The basis of an RCT in Singapore law at its present stage of development therefore appears to be founded on fault … predicated on a state of knowledge which renders it unconscionable for the recipient to keep the moneys. … … 184 The fact giving rise to the court’s discretion to impose an RCT was therefore … theknowing retentionof the moneys in a way that affects the recipient’s conscience. [emphasis in original] 54 Although the RCT “is still in its developmental stages in Singapore”, the abovementioned principles have been consistently reiterated in the few cases concerned with whether to impose an RCT (seePhilip Antony Jeyaretnam and another v Kulandaivelu Malayaperumal and others (Thirumurthy Ayernaar Pamabayan, third party; Pramela d/o Govindasamy and another, non-parties)[2020] 3 SLR 738 at [23]). Nevertheless, the courts in those cases declined to impose an RCT for various reasons. InWee Chiaw Sek Anna, the Court of Appeal observed at [172] that there was no fraud on the part of the deceased to establish an RCT. Similarly, the Court of Appeal inChing Mun Fongat [37] found an RCT inappropriate because there had been “no dishonest conduct” on the part of the payee.InZhou Weidong v Liew Kai Lung and others[2018] 3 SLR 1236 (“Zhou Weidong”)at [82], Audrey Lim JC (as she then was) declined to impose an RCT because the claimant had not carried out the “precursory step of tracing”. I also bear in mind Vivian Ramsey IJ’s caution inCPIT Investments Ltd v Qilin World Capital Ltd and another[2017] 5 SLR 1 at [199] that the RCT in Singapore “is only to be imposed sparingly”. 55 In my view, this case is one in which an RCT should be imposed. I have found that the Defendants were part of a conspiracy to fraudulently induce the NBO to disburse the Loans and thereafter dissipate the moneys received from the NBO. Thus, unlike inWee Chiaw Sek AnnaandChing Mun Fong, there is clearly fraudulent and dishonest conduct involved. Furthermore, as regards tracing, my finding on the conspiracyprima facieestablishes an indirect link between the NBO’s moneys and the moneys and/or assets received by the Defendants. The circumstantial evidence indicates that at the time each of the Defendants received these moneys and/or assets, they knew that these moneys and/or assets had been obtained fraudulently arising from their conspiracy to defraud the NBO. This state of knowledge makes it unconscionable for the Defendants to keep the moneys and/or assets. For these reasons, I impose an RCT on the moneys and/or assets received by the Defendants which are traceable to the NBO’s moneys, operating from the time that the Defendants first received these moneys and/or assets.",
        "Knowing receipt": "56 The NBO claims that Kismat Singapore, Joshi Trading and Madhu are liable to account to the NBO for US$3,697,324, US$2,918,296.87 and US$35,000 respectively for knowing receipt. The requirements of a claim in knowing receipt are (a) a disposal of the claimant’s assets in breach of trust/fiduciary duty; (b) the beneficial receipt by the defendant of assets which are traceable as representing the assets of the claimant; and (c) knowledge on the part of the defendant that the assets received are traceable to a breach of trust/fiduciary duty, such knowledge being such that it is unconscionable for the defendant to retain the benefit of the receipt (seeGeorge Raymond Zage III and another v Ho Chi Kwong and another[2010] 2 SLR 589 at [23];Relfo Ltd (in liquidation) v Bhimji Velji Jadva Varsani[2008] 4 SLR(R) 657 at [21]).80Foot Note 80×PCS, at paras 57 and 61. 57 I find that the elements of knowing receipt areprima facieestablished. First, per my finding at [55] above, the moneys received by Kismat FZC from the NBO were subject to an RCT. When Kismat FZC transferred these moneys to the other Defendants (directly or indirectly), the moneys were disposed of in breach of its duties as constructive trustee. Secondly, the Defendants received moneys and/or assets which aretraceable to Kismat FZC’s breach of its duties as constructive trustee. Finally, since the Defendants were part of the conspiracy to defraud the NBO, they knew that these moneys and/or assets were traceable to Kismat FZC’s breach of its duties as constructive trustee. This makes it unconscionable for the Defendants to retain the benefit of such moneys and/or assets. Therefore, I find that the NBO hasprima facieestablished its claim in knowing receipt against the Defendants, in particular, Kismat Singapore, Joshi Trading and Madhu.",
        "Unjust enrichment": "58 The requirements for a claim in unjust enrichment are as follows (seeWee Chiaw Sek Anna([53]supra)at [98]–[99] and [115]).81Foot Note 81×PCS, at para 62.First, the defendant has been enriched or benefitted. Secondly, the enrichment is at the claimant’s expense: the claimant must prove that (a) the defendant received an immediate benefit from the claimant, thus establishing a direct personal link, or (b) the defendant received a benefit traceable from the claimant’s assets, thus establishing an indirect link through the value in the defendant’s hands that once belonged to the claimant. Thirdly, the enrichment was unjust. The relevant unjust factor in this case is total failure of consideration, which involves an inquiry as to the basis for the transfer in respect of which restitution is sought, and whether this basis has totally failed (seeBenzline Auto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 at [46]). Finally, there are no applicable defences available to the defendant. Notably, the Court of Appeal inWee Chiaw Sek Annaobserved at [184] that the facts giving rise to an RCT may arise subsequent to or concurrently with a claim in unjust enrichment. 59  There is no real need for me to determine this point given that I have found all the Defendants liable for the entire sum of Damages, as well as liable as constructive trustees and for knowing receipt (see [50], [55] and [57] above). Nevertheless, for completeness, I find that all the requirements for unjust enrichment have been established. Here, the first and fourth requirements are uncontroversial. As regards the second requirement, I have found that there is,prima facie, a link between the NBO’s moneys and the moneys received by Kismat Singapore, Joshi Trading and Madhu (see [55] above). As regards the third requirement, there was a total failure of consideration as the basis of the Loans was that they were to be used for discounting invoices issued by Kismat FZC to BP Singapore and the Total-related company. However, the evidencesuggests that the moneys were not used for such transactions. Rather, Prakash, Bikash and the Defendants attempted to dissipate the moneys after deceiving the NBO into granting them the Loans. Thus, I find that the elements of unjust enrichment have beenprima facieestablished.",
        "Summary of findings": "60 The court is satisfied that the evidence adduced by the NBO is credible and reliable. The NBO’s case is also not inherently incredible or out of common sense. Furthermore, circumstantial evidence relied on by the NBO leads to a reasonable and logical inference that there was a conspiracy amongst the Defendants and others to defraud the NBO. Faced with these allegations from the NBO, the obvious and sensible response from the Defendants would have been to rebut these allegations. However, the Defendants elect not to give evidence and submit that there is no case to answer. Bearing this in mind, I make the following findings. 61 I find that the NBO has established, on aprima faciebasis, that Kismat FZC is liable for fraudulent misrepresentation. Bikash and Prakash as directors of Kismat FZC represented to the NBO that they had contacts with several real McCoys that are multinational oil companies and that there were trade receivables owed to Kismat FZC by BP Singapore and a Total-related company. This induced the NBO to grant the Credit Facilities and disburse the Loans. It was intended that the NBO would act upon the representations and Bikash and Prakash knew that the representations were false. Kismat FZC defaulted on the Loans and caused the NBO to suffer damage. 62 I reject the Defendants’ allegation that the NBO, through Mr Khalid and Mr Johnson, had colluded with the Defendants to incorporate BPCPL and TSPL to impersonate the real McCoys. The evidence shows that Kismat FZC, in its various applications to the NBO for the Loans to be disbursed, complied with all the formal requirements under the Credit Facilities save for the condition that the original invoices be countersigned by BP Singapore’s representative office in the UAE. I accept Mr Navin’s evidence that the disbursement of the Loans despite this procedural irregularity was due to a genuine oversight. Moreover, even if there was collusion, Mr Khalid’s and Mr Johnson’s knowledge should not be attributed to the NBO. Therefore, the NBO hasprima facieestablished its fraudulent misrepresentation claim against Kismat FZC. 63 I also find that the NBO hasprima facieestablished its unlawful means conspiracy claim. I address the evidence against each Defendant separately: (a) Kismat FZC: Based on the same facts as in the fraudulent misrepresentation claim, it is clear that Kismat FZC, through its directors and shareholders, Bikash and Prakash, played a critical role in the conspiracy to induce the NBO to disburse the Loans and thereafter, dissipate the moneys received. (b) Zu Lwin: I reject her defence that she was unaware of the purpose of incorporating BPCPL and TSPL. She was engaged in a pattern of incorporating companies with names similar to multinational companies, despite her experience in the oil and petrochemical industry and having been advised of such similarities. She was the director of BPCPL and TSPL when the forged and/or fraudulent documents were issued to the NBO. She was also an employee, director and 10% shareholder of Kismat Singapore. She rented the Safe Deposit Boxes to store the gold bars obtained from Joshi Trading and attempted to remove them the day she was alerted of the Second Mareva Injunction. (c) Kismat Singapore: Not only were Bikash and Prakash the only shareholders and directors of Kismat Singapore at the material time, Kismat Singapore remitted and received significant sums of money to and from persons/companies associated with Bikash and Prakash. The frequency and value of the transfers by Kismat Singapore significantly increased immediately after the First Mareva Injunction was granted, suggesting an attempt to dissipate moneys. (d) Joshi Trading: Joshi Trading’s director and sole shareholder is Bikash’s and Prakash’s nephew. Joshi Trading also received and remitted significant sums of money to and from persons/companies associated with Bikash and Prakash, including Kismat Singapore, Zu Lwin and Madhu. Joshi Trading also purchased the gold bars using the funds received from Kismat Singapore, and later issued an invoice for the purported sale of these gold bars to Zu Lwin and Madhu. (e) Madhu: Madhu is Prakash’s wife. She received the invoice from Joshi Trading for the gold bars and was also listed as the second additional licensee for the Safe Deposit Boxes. In addition, she received a sum of money from Joshi Trading after Joshi Trading received certain sums from Kismat Singapore. 64 Based on all the above circumstantial evidence, I find that the NBO hasprima facieestablished that Bikash, Prakash and the Defendants conspired to fraudulently induce the NBO to disburse the Loans and thereafter dissipate the moneys received, with the intention of thereby causing damage or injury to the NBO. These acts were unlawful and carried out in furtherance of the fraudulent conspiracy, thereby causing the NBO to suffer loss. The fact that Joshi Trading was incorporated after the scheme to defraud the NBO had already commenced is not a bar to liability. 65 Thus, the Defendants are jointly and severally liable for the Damages sought by the NBO, being the principal sum disbursed under the Loans amounting to US$14,665,972.86, as well as the loss of profits amounting to at least US$3,891,741.96, less the part-payment of AE$250,000 repaid to the NBO on or about 19 June 2017, and less the sum of US$5,933,826.56 which was recovered from the sale of the gold bars. Although the NBO must account for any other benefits received, there are none here because the NBO’s claim is limited to the four Loans. 66 Further, I find that there is an RCT over the moneys and/or assets received by the Defendants pursuant to the conspiracy. Their involvement in the conspiracy not only establishes the requisite state of knowledge making it unconscionable for them to retain the moneys and/or assets, it also establishesprima faciean indirect link between the NBO’s moneys and the moneys and/or assets received by them. 67 I also find that the requirements of knowing receipt areprima facieestablished. The moneys received by Kismat FZC from the NBO were subject to a constructive trust. Kismat FZC breached its duties as constructive trustee when it transferred these moneys to the Defendants. Given their involvement in the conspiracy, Kismat Singapore, Joshi Trading and Madhu knew that the moneys they received were traceable to Kismat FZC’s breach of its duties as constructive trustee. 68 Thus, Kismat Singapore, Joshi Trading and Madhu are liable to account to the NBO for US$3,697,324, US$2,918,296.87 and US$35,000 respectively. The NBO is entitled to trace the assets or proceeds into which these sums have been converted, if any. If these sums have been converted into other traceable assets, the NBO is entitled to trace its claim into those assets and maintain a proprietary remedy subject to any applicable legal limitations (seeAljunied-Hougang Town Council and another v Lim Swee Lian Sylvia and others and another suit[2019] SGHC 241 at [633];Bhavika Manohar Godhwani v Manohar Hargun Godhwani and others[2020] SGHC 147 at [68]). 69 Finally, I find that the NBO hasprima facieestablished its claim in unjust enrichment. Kismat Singapore, Joshi Trading and Madhu have been enriched by the moneys they received. The evidence suggests that there is an indirect link between the NBO’s moneys and the moneys received by Kismat Singapore, Joshi Trading and Madhu. Further, there was a total failure of consideration and no defences apply. Therefore, the requirements for unjust enrichment are satisfied and Kismat Singapore, Joshi Trading and Madhu are liable to the NBO for US$3,697,324, US$2,918,296.87 and US$35,000 respectively. Strictly speaking, however, this finding is superfluous given my findings on the NBO’s claims in unlawful means conspiracy, constructive trust and knowing receipt.",
        "Conclusion": "70 For the above reasons, I find that the NBO hasprima facieestablished its claims against the Defendants. As such, I reject the Defendants’ submission of no case to answer and find for the NBO. The Defendants are to pay costs to be agreed or taxed to the NBO. Tan Siong ThyeJudge Chan Cong Yen Lionel (Chen Congren), Nora Jessica Chan Kai Lin, Beatrice Mathilda Yeo Li Hui (Yang Lihui) and Chua Yi Ling Ilene (Oon & Bazul LLP) for the plaintiff; Kanthosamy Rajendran (RLC Law Corporation) for the second, fourth, tenth, fourteenth and fifteenth defendants; Prasanna d/o T V Prabhakaran (Raj Prasanna & Partners) for the first and third defendants; The fifth, sixth, seventh, eighth, ninth, eleventh, twelfth and thirteenth defendants absent and unrepresented."
    }
}