{
    "case_title": "Gokul Patnaik vNine Rivers Capital Ltd",
    "ncitation": "[2020] SGHC(I) 23",
    "coram": "Vivian Ramsey IJ",
    "sections": {
        "Introduction": "1 In these proceedings (SIC/OS 4/2020), the applicant (“Mr Patnaik”) applies under the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“IAA”) to set aside SIAC Award No. 073 of 2019 dated 24 June 2019 (the “Award”) made in arbitration proceedings ARB133/17/KRW (the “Arbitration”). 2 Mr Patnaik seeks to set aside the Award on three grounds: (a) that the Award contained decisions on matters beyond the scope of the submissions to arbitration and so should be set aside under Article 34(2)(a)(iii) of the UNCITRAL Model Law on International Commercial Arbitration (“Model Law”); (b) that there was a breach of the rules of natural justice in connection with the making of the Award and so should be set aside under s 24 of the IAA; and/or (c) that the Award is contrary to the public policy in Singapore and so should be set aside under Article 34(2)(b)(ii) of the Model Law. 3 In support of the application under Article 34(2)(b)(ii) of the Model Law, Mr Patnaik has filed an expert affidavit on Indian law by Justice Ananga Kumar Patnaik (“Justice Patnaik’s Affidavit”). The respondent (“Nine Rivers”) has applied to strike out that affidavit (“the Strike Out Application”) on the ground that the affidavit deals with issues ofIndianlaw and public policy and is irrelevant to an application under Article 34(2)(b)(ii) of the Model law, which concerns the question of whether the Award is in conflict with the public policy ofSingapore.",
        "Background": "4 The background to the Arbitration has been set out in the Award and I summarise it as follows.1Foot Note 1×Gokul Patnaik’s 1st affidavit dated 24 September 2019 (“Gokul’s 1st Affidavit”) at Exhibit GP-1.In 2009, the parties to the Arbitration were involved in completing an investment of 300 million Indian Rupees (“INR”) to be made by Nine Rivers into Global Agrisystem Private Limited (“GAPL”), a company incorporated under the laws of India. 5 Ultimately this led to an investment being made pursuant to a Share Subscription and Shareholders Agreement dated 4 March 2010 (“the SSSA”). Pursuant to the SSSA, Nine Rivers, as “Investor”, subscribed to the following “Investor Securities” in GAPL:2Foot Note 2×Gokul’s 1st Affidavit at pp 37 and 136. (a) 100 equity shares of face value INR 10, each at a premium of INR 15.7, for an aggregate sum of INR 2,570 (“Investor Equity Shares”); (b) 3,000,000 Cumulative Compulsorily Convertible Preference Shares of GAPL (“CCPS”) bearing 6.67% dividend per annum, having a face value of INR 30 each at a premium of INR 70 per CCPS (“Investor CCPS”). 6 The SSSA defined GAPL as the “Company”. Each of Mr Patnaik, an Indian citizen, and Katra Finance Limited (“Katra Finance”), a company incorporated under the laws of Mauritius, were defined as a “Promoter”. Gokul Patnaik Associates Private Limited, a company incorporated under the laws of India; Gokul Patnaik (HUF), duly constituted and recognised as a Hindu undivided joint family under the laws of India; Mr Sunil Kumar Sharma, an Indian citizen; Katra Holding Private Limited, a company incorporated under the laws of India (“KHPL”); and Mr Ramesh Vangal, a resident of Singapore (“Mr Vangal”), were defined as the “Promoter Group”.3Foot Note 3×Gokul’s 1st Affidavit at pp 37 and 130. 7 In the Arbitration, Nine Rivers, as claimant, made each Promoter and each member of the Promoter Group a respondent. However, substantive relief was only sought against the Promoters, Katra Finance and Mr Patnaik, in their role as Promoters, among other things. No relief was sought against the members of the Promoter Group other than in respect of costs. 8 Section 20 of the SSSA provided for the Parties agreeing to undertake to commit themselves to all actions necessary to cause an initial public offering of the “Equity Shares” of GAPL or to seek a “Strategic Sale”,vizsale to any third party to change control of GAPL, satisfying each of various specified conditions. This was defined in the SSSA as a “Qualified Exit”. One of the conditions for the Qualified Exit was that the minimum value should be INR 4,000,000,000.4Foot Note 4×Gokul’s 1st Affidavit at pp 135, 140, and 180. 9 Section 16.5 of the SSSA provided that, in the event that the Qualified Exit was not accomplished by 31 March 2014, Nine Rivers, as Investor, would have the right to:5Foot Note 5×Gokul’s 1st Affidavit at p 175. (a) sell all, or a portion, of its securities to any Third Party purchaser of its choosing without the Right of First Refusal to the Promoter(s); and/or (b) by service of a Notice in the specified form, to drag along all or a portion of the securities held by the Promoter(s) to offer the same to the Third Party purchaser, provided that the securities of the Promoter(s) that are dragged along should be sold to any Third Party purchaser on the same terms and conditions as those of the Investor (“Drag Along Right”). 10 Section 16.5.3 of the SSSA provides that, within 21 days of the receipt of a Drag Along Notice, the Promoters had the right to make an unconditional and nonbinding first offer to purchase the Investor Securities (“the ROFO”). If the Promoters chose to exercise the ROFO, they were to notify the Investor of the offer price and provide information related thereto in a form set out in the SSSA.6Foot Note 6×Gokul’s 1st Affidavit at p 176. 11 There was, in fact, no Qualified Exit by 31 March 2014 and, according to Nine Rivers, it exercised its Drag Along Right and Katra Finance elected to exercise its ROFO. This process was then encapsulated within an agreement (“the 2014 SPA”) under which Katra Finance agreed to purchase the “Sale Securities” from Nine Rivers at a “Purchase Consideration” of INR 302,500,000, plus various other amounts. 12 The Sale Securities were defined in the 2014 SPA as being:7Foot Note 7×Gokul’s 1st Affidavit at p 109. ... collectively (i) the Equity Shares, the Seller CCPS and any other Company Equity Securities subscribed to or purchased by the Seller, (ii) any Equity Shares received by the Seller upon Conversion of any Seller CCPS; and (iii) any Company Equity Securities received by the Seller as a result of any Adjustment Event; 13 The 2014 SPA was signed by Katra Finance, by GAPL and by Mr Patnaik on his own behalf, on behalf of Gokul Patnaik (HUF) and on behalf of the same Promoter Group as defined in the 2014 SPA. Under the 2014 SPA, the Promoters were defined as being only Katra Finance (who is also defined as the Purchaser) and Mr Patnaik and the Promoter Group appeared to play no role. 14 In the event, Katra Finance did not purchase the Sale Securities from Nine Rivers in accordance with the 2014 SPA and there was a subsequent negotiation which resulted in variations to the payment mechanism and the time for payment. This led to amendments to the 2014 SPA which were recorded in the Addendum Agreement dated 4 December 2015 (“the 2015 Amendment”), which was signed by Mr Vangal on his own behalf and on behalf of Katra Finance and by Mr Patnaik on behalf of GAPL, himself as a Promoter and on behalf of the Promoter Group, as defined in the 2015 Amendment. The Promoter Group in the 2015 Amendment was a smaller group than that contained in the SSSA and the 2014 SPA because Mr Vangal, who was previously part of the Promoter Group, became both a Purchaser and a Promoter for the purposes of the 2015 Amendment. 15 However, neither Mr Vangal nor Katra Finance completed the purchase of the Sale Securities in accordance with the 2014 SPA or the 2015 Amendment. Between June 2016 and September 2016, Nine Rivers negotiated via email with Mr Vangal and various others in an attempt to secure the sale of the Sale Securities but no sale transpired. 16 On 7 October 2016, Nine Rivers sent a Notice of Default (“the Notice of Default”) to the respondents in the Arbitration, except for Gokul Patnaik Associates Private Limited, alleging that the “Promoter Group”, as defined in the Notice of Default, had all agreed to purchase the Sale Securities but had defaulted. Nine Rivers called upon that Promoter Group to rectify the default and purchase the Sale Securities for the Purchase Consideration as defined in the 2014 SPA. Nine Rivers accepted that the Notice of Default should have identified only the “Purchasers”, as defined in the 2015 Amendment, as having been obliged to purchase the Sale Securities. 17 On 16 December 2016, Nine Rivers sent Mr Patnaik, GAPL and Katra Finance a notice pursuant to section 17.2.2.1 of the SSSA (“the Put Option Notice”) calling upon the Promoters to purchase the Investor Securities (as defined in the SSSA) pursuant to the Put Option contained in section 17.2.2.1 of the SSSA (“Investor Put Option”), in an amount of INR 1,329,000,000 (“the Put Option Amount”). 18 Neither Katra Finance nor Mr Patnaik complied with the Put Option Notice and that led to the Arbitration in which Nine Rivers sought payment of the Put Option Amount, together with other relief. 19 Nine Rivers commenced the Arbitration on 5 May 2017 pursuant to the arbitration agreement contained in clause 11.12 of the 2014 SPA, as amended by the 2015 Amendment. That provided for arbitration under the Singapore International Arbitration Centre (“SIAC”) Rules, the applicable edition being the SIAC Rules (6th edition), effective from l August 2016. The seat of the Arbitration was Singapore.8Foot Note 8×Gokul’s 1st Affidavit at p 120. 20 By clause 11.9 of the 2014 SPA, it was agreed that: This Agreement shall be governed and interpreted by, and construed in accordance with, the laws of India and subject to clause 9.12 (Arbitration) [sic], the courts of Mumbai shall have the exclusive jurisdiction in respect of any dispute arising under or in relation to this Agreement. 21 Mr Charles Peter Manzoni QC, SC was appointed as the sole arbitrator (“the Arbitrator”) by the Vice President of the Court of Arbitration of SIAC on 26 February 2018. Directions were given and a hearing was held in Singapore from 11 to 13 February 2019, followed by written closing submissions. The Arbitrator made his award on 24 June 2019 (“the Award”). 22 In the Award, the Arbitrator found that:9Foot Note 9×Gokul’s 1st Affidavit at p 98. 1. The First Respondent, Mr Patnaik, and the Second Respondent, Katra Finance are jointly and severally required to purchase the Investor Securities, as defined in the SSSA, held by the Claimant Nine Rivers pursuant to the Put Option contained in Section 17.2.2.1 of the SSSA for a total consideration of INR 1,329,000,000 (in words one billion three hundred and twenty nine million Indian Rupees). 2. All other claims are dismissed. 3. Each party is to bear its own costs incurred in this arbitration. 4. Each of the First Respondent, Mr Patnaik, the Second Respondent Katra Finance and the Claimant, Nine Rivers are to pay one third of the costs of the arbitration as determined by the Registrar in the sum of Singapore Dollars 254,797.22 (in words, two hundred and fifty four thousand , seven hundred and ninety seven Singapore Dollars and twenty two cents).",
        "These proceedings": "23 On 24 September 2019, Mr Patnaik commenced these proceedings by Originating Summons HC/OS 1191/2019 to make an application to set aside the Award (“the Application”). The Application was supported by the First Affidavit of Mr Patnaik. 24 On 9 December 2019, the cause papers were served on Nine Rivers who appointed solicitors on 2 January 2020. 25 On 24 January 2020, Mr Patnaik filed evidence on Indian law in Justice Patnaik’s Affidavit. Justice Ananga Kumar Patnaik is now retired and was a former Judge in the Supreme Court of India and is not related to Mr Patnaik. 26 On 21 February 2020, Nine Rivers filed the Second Affidavit of Jageshwar Juggernauth in reply to the Application. 27 Also, on 21 February 2020, Nine Rivers filed an application to strike out, HC/SUM 830/2020 (“the Strike Out Application”), seeking to strike out Justice Patnaik’s Affidavit, supported by the First Affidavit of Jageshwar Juggernauth. 28 On 19 March 2020, Mr Patnaik filed a Third Affidavit in reply to the Strike Out Application and on 2 April 2020 Nine Rivers filed the Third Affidavit of Jageshwar Juggernauth in response to that affidavit. 29 Also, on 2 April 2020, the matter was transferred to the SICC as SIC/OS 4/2020. 30 On 1 May 2020, Mr Patnaik filed a Fourth Affidavit in response to Nine Rivers’ reply affidavit and on 18 May 2020 Nine Rivers filed the Fourth Affidavit of Jageshwar Juggernauth in reply to that affidavit. 31 On 10 June 2020, I held a Case Management Conference at which I gave directions for the Application to be dealt with on 25 and 26 June 2020. In relation to the Strike Out Application, in dealing with the issues on the Application, I would also deal with issues on the Strike Out Application. I said that, soon after the hearing on 25 and 26 June 2020, I would inform the parties of my decision on whether Justice Patnaik’s Affidavit could be relied on in these proceedings. Nine Rivers indicated that, in the event that I decided that Justice Patnaik’s Affidavit could be relied on, it would wish to apply to serve evidence on Indian law.  I therefore directed that 23 and 24 July 2020 should also be held in reserve as hearing dates, in the event that a further hearing was required to deal with evidence of Indian Law. 32 On 2 July 2020, having considered the submissions of the parties and for the reasons set out in this judgment, the court informed the parties that I had decided that no reliance could be placed on Justice Patnaik’s Affidavit in relation to the application under Art 34(2)(b)(ii) of the Model Law. On that basis, there was no need for any application by Nine Rivers to file evidence on Indian law and the hearing on 23 and 24 July 2020 was vacated.",
        "The application": "33 In the Application, Mr Patnaik seeks to set aside the Award pursuant to s 24 of the IAA and Articles 34(2)(a)(iii) and 34(2)(b)(ii) of the Model Law set out in the First Schedule of the IAA. 34 Mr Patnaik seeks to set aside the Award on the following grounds. (a) The Award contained decisions on matters beyond the scope of the submissions to the Arbitration, as the disputes in the Arbitration are not arbitrable under the 2014 SPA and are beyond the jurisdiction of the Arbitrator. (b) There was a breach of the rules of natural justice occurring in connection with the making the Award, as the Arbitrator did not allow an application to amend the Statement of Defence to incorporate submissions which would have placed the burden of proof on Nine Rivers to prove its entitlement to the reliefs granted in the Award. (c) The Award is in conflict with the public policy of India because the awarded relief is in contravention with Indian Law and it would be a breach of international comity and thus against Singapore public policy to allow the Award to stand. 35 As set out above, Nine Rivers filed the Strike Out Application seeking to strike out Justice Patnaik’s Affidavit on the grounds that: (a) the affidavit, which deals with issues of Indian law and public policy, is irrelevant to the Setting Aside Application as, under the IAA and Article 34(2)(b)(ii) of the Model Law, the Award may only be set aside by the court if the court finds that the Award is in conflict with the public policy of Singapore; (b) the affidavit amounts to fresh evidence that was not brought up in the Arbitration; and (c) Mr Patnaik’s reliance on Justice Patnaik’s Affidavit is an attempt to revive issues that have already been determined by the Arbitrator in the Arbitration. 36 I will deal with each ground of the Application, in turn.",
        "Application under Article 34(2)(a)(iii) of the Model Law": "37 Article 34(2)(a)(iii) of the Model Law provides as follows: (2) An arbitral award may be set aside by the court specified in Article 6 only if: (a) the party making the application furnishes proof that: … (iii) the award deals with a dispute not contemplated by or not falling within the terms of the submission to arbitration, or contains decisions on matters beyond the scope of the submission to arbitration, provided that, if the decisions on matters submitted to arbitration can be separated from those not so submitted, only that part of the award which contains decisions on matters not submitted to arbitration may be set aside; …",
        "Mr Patnaik’s submissions": "129 It was submitted on behalf of Mr Patnaik in the Arbitration that the terms of the 2014 SPA requiring the purchase of the Sale Securities for consideration amounted to an assured return which was inconsistent with the Indian Foreign Exchange Management (Transfer or Issue of Security by a Person Resident outside India) Regulations (“FEMA Regulations”), as amended in 2013 (“the FEMA Regulations 2013”). He therefore contended that the amendments to the FEMA Regulations in 2013 rendered section 17.2.2.1 of the SSSA void after the SSSA was entered into in 2010, and that the 2014 SPA and section 17.2.2.1 of the SSSA were therefore voidab initio. It was also contended that, if a contract was illegal, it was void under s 23 of the Contract Act 1872 (Act No 9 of 1872) (India). 130 The Arbitrator heard submissions from Indian counsel for the parties on those contentions and determined as follows in the Award. (a) On Indian Contract Law, at paragraph 113:51Foot Note 51×Gokul’s 1st Affidavit at p 60. … the 2014 SPA does not, in my view fall within s23. The object of the 2014 SPA is not forbidden by law, and the object is not such as would defeat the provisions of FEMA. Hence I do not believe that s23 has any application on the facts of this case. (b) On the application of the FEMA Regulations, at paragraph 133:52Foot Note 52×Gokul’s 1st Affidavit at p 65. … I also accept that the [Reserve Bank of India] can be asked for permission in respect of the Put Option, and that thus the question of whether Mr Patnaik is ultimately entitled, under FEMA and its regulations, to effect the transfer to which he has agreed under the SSSA, is more properly to be determined if and when enforcement of any award I may give is to be addressed. It is not something that makes the 2014 SPA, the 2015 Amendment or section 17.2.2.1 of the SSSA void ab initio. 131 Mr Patnaik submits that, based on Justice Patnaik’s Affidavit, the Arbitrator erred in making these findings. Mr Patnaik submits that, on that basis, the Award is contrary to Singapore public policy and so should be set aside under Article 32(2)(b)(ii) of the Model Law. He submits that Singapore public policy has been breached because, as a matter of Singapore public policy, international comity will not allow a Singapore court to affirm an award the performance of which would be in breach or illegal pursuant to the laws of another friendly country. 132 Mr Patnaik refers to a number of authorities. First, he refers toAJT v AJU[2010] 4 SLR 649 (“AJT v AJU”) which was relied on by Nine Rivers. He says that the concluding agreement in that case was not illegal at the time it was entered into (“Concluding Agreement”; see [145] below). The arbitral tribunal found that the Concluding Agreement was not illegal because it made a finding of fact that the Concluding Agreement did not require the appellant to do anything other than to receive evidence of the withdrawal and discontinuance of the criminal proceedings. 133 The case came before the court on an application under Article 34(2)(b) of the Model Law and one of the issues was the extent to which the Singapore courts could open up the findings which had been made by the arbitral tribunal. The Court of Appeal decided that it could not open up a finding of fact which was a finding as to the effect of certain acts upon the Concluding Agreement. 134 Mr Patnaik submits that this case is distinguishable on the basis that, in the present case, it is not an agreement which forms the illegality but the construction of a foreign statute which is an issue of law, not an issue of a finding of fact. 135 He submits that it was a finding of law which caused the illegality by way of statute and this breaches Indian public policy. On that basis, he accepts that as stated inAJT v AJUat [65]: “[t]his means that findings of fact made in an IAA award are binding on the parties and cannot be reopened except where there is fraud, breach of natural justice or some other recognised vitiating factor”. However, he submits that the decision that the learned Arbitrator made was a finding of law which is not binding on the parties and as such can be challenged on the basis that it is in breach of public policy. 136 He also refers to the decision inKempinski([44]supra) where the arbitrator issued a fourth interim award holding that any award of damages in favour of Kempinski for the intermediary period would be against the public policy of Indonesia and therefore unenforceable. He says that the Court of Appeal affirmed the arbitrator’s decision and held that the arbitrator was correct in holding that he had no power to award any damages to Kempinski as doing so would have been contrary to the public policy of Indonesia. 137 He submits that that case is similar to the present case in that, inKempinski, the parties entered into a management contract of a hotel in 1994 but, between 1996 and 2000, three decisions were issued by the Indonesian tourism industry making it illegal for a foreign entity to manage hotels in Indonesia, unless it sets up a company incorporated in Indonesia or enter into a joint venture with an Indonesian party. Kempinski was advised that it would not be acting in contravention of the new regulatory framework and therefore continued to manage the hotel without any objections from Prima. The business relationship between the parties ended and a notice of termination was issued by Prima to Kempinski. Kempinski then commenced arbitration alleging that the termination was wrongful and sought damages or specific performance. Prima then pleaded illegality in view of the requirements of the Indonesian tourism industry. The arbitrator issued four interim awards and in the fourth award held that any award of damages in favour of Kempinski would be against Indonesian public policy and unenforceable, and therefore Kempinski’s claim for relief failed. 138 In the High Court, it was held that, as the third award had been set aside, then the fourth award should be set aside. The Court of Appeal held at [72] that the fact that public policy had not been pleaded did not affect the position and stated: “In our view, public policy is a question of law which an arbitrator must take cognisance of if he becomes aware of it in the course of hearing the evidence presented during arbitral proceedings”. Mr Patnaik submits that public policy is a point of law and that this supports his case. InKempinski, the contract became illegal after it was signed, and the Court of Appeal affirmed the arbitrator’s decision to hold that he had no power to make an award which was contrary to public policy. 139 Mr Patnaik then refers toPehTeck Quee v Bayerische Landesbank Girozentrale[1999] 3 SLR(R) 842 (“PehTeck Quee”) at [45] where the Court of Appeal summarised the position, based onFoster v Driscoll[1929] 1 KB 470 (“Foster vDriscoll”), as such: “In other words, an agreement whose object to be attained is a breach of international comity will be regarded by the courts as being against public policy and void”. 140 Mr Patnaik therefore says that there is authority in Singapore following on fromFoster v Driscollthat an agreement whose object to be attained is a breach of international comity will be regarded by the courts as being against public policy and void. 141 Finally, Mr Patnaik refers to the Court of Appeal’s decision inSheagars/o T M Veloo v Belfield International (Hong Kong) Ltd[2014] 3 SLR 524 (“Sheagar”), where the court was asked to determine if the guarantees given by the appellant should not be enforced on the principle of international comity, because the giving of loans were contrary to Hong Kong laws. The court held that the giving of loans was not contrary to Hong Kong laws, but again restated the principle of international comity as established inFoster v Driscoll. 142 Mr Patnaik therefore submits that Justice Patnaik’s Affidavit on Indian law is highly relevant as it shows that, under the 2014 SPA, he would have been in breach of the FEMA Regulations and Indian law and in breach of Indian public policy. He submits that it would consequently be against Singapore public policy to affirm the Award based on a contract which endeavours to perform an illegal act in India.",
        "Nine Rivers’ submissions": "143 Nine Rivers submits that the issue is whether, in the present proceedings, the Award should be set aside on public policy grounds on the basis that it contravenes the foreign exchange laws in India and, consequently, is in conflict with the public policy of India. It submits that the Award cannot be set aside on the basis that it is in conflict with the public policy of India as the relevant public policy is that of Singapore. It contends that evidence relating to the public policy of any country other than Singapore is irrelevant for determining whether the Award should be set aside on the public policy grounds. 144 Nine Rivers refers to Mr Patnaik’s assertion that the Singapore courts have previously considered the public policy of another sovereign nation and set aside an arbitral award on the basis that it was against the public policy of that sovereign nation, and that the Singapore courts will treat any agreement whose object is a breach of international comity as being against public policy and void. 145 Nine Rivers refers to the decisions of the High Court inAJT v AJU([132]supra) and the Court of Appeal inAJU v AJT[2011] 4 SLR 739 (“AJU v AJT”). In that case, AJT instituted arbitration proceedings against AJU, in relation to an agreement between P (a related company of AJT) and AJU. After commencement of the arbitration, AJU made a complaint of fraud, forgery, and the use of a forged document to the Thai police against O (AJT’s sole director and shareholder), P, and Q (another related company of AJT). While the police investigations were ongoing, AJU and AJT entered the Concluding Agreement. In the Concluding Agreement, AJU agreed that it would withdraw the complaint; obtain evidence of termination of all criminal proceedings against O, P, and Q; and pay a sum to AJT. In exchange, AJT agreed that all existing claims between them were deemed as fully settled. The Concluding Agreement was governed by Singapore law. 146 After AJU withdrew the complaint and paid the sum to AJT, the Thai prosecution confirmed that a non-prosecution order was issued in respect of the charges against O, P, and Q. However, AJT claimed that AJU failed to comply with the Concluding Agreement and hence AJT refused to terminate the arbitration. AJU applied to the tribunal to terminate the arbitration, on the ground that the parties had reached full and final settlement of the claim in view of the Concluding Agreement. 147 AJT challenged the validity of the Concluding Agreement on the grounds of,inter alia, illegality, on the basis that the Concluding Agreement required AJT to take unlawful action to stop the criminal proceedings in Thailand. 148 The tribunal decided that,inter alia, the Concluding Agreement was not illegal. AJT then applied to set aside the tribunal’s award on the grounds that, among other things, the award sought to enforce the Concluding Agreement which was illegal and unenforceable in Thailand. 149 The High Court stated, at [34] and [36] ofAJT v AJU([132]supra), that “the courts will treat a contract governed by its own law as void where the parties’ intention and object contemplated thereby jeopardises relations between its government and another friendly government”, and hence, “an agreement whose object to be attained is a breach of international comity will be regarded by the courts as being against public policy and void”. 150 The High Court stated at [40] that “if the Concluding Agreement was entered into by the parties in furtherance of an illegal purpose under the law of the place of performance,ie, Thai law, it will have to be set aside on the ground that it is contrary to the public policy of Singapore under Art 34(2)(b)(ii) of the Model Law.” 151 Nine Rivers submits that the salient distinctions betweenAJT v AJUand the present case are that, first, the Concluding Agreement was governed by Singapore law. It was in this context that the High Court held at [34] that “the courts will treat a contract governed by its own law as void where the parties’ intention and object contemplated thereby jeopardises relations between its government and another friendly government”. In other words, this does not mean that the court will consider the public policy of another nation, where the underlying contract is governed by a foreign law.53Foot Note 53×DWS at [77]. 152 Nine Rivers refers to the Court of Appeal’s decision inAJU v AJT([145]supra) where, at [62], it clarified that the true question that was being considered was “whether, if a Singapore court disagrees with the Tribunal’s finding that the Concluding Agreement is not illegal under Singapore law, the court’s supervisory power extends to correcting the Tribunal’s decision on this issue of illegality”. Hence, Nine Rivers submits that, where an underlying contract is governed by a foreign law such as in the present case where the 2014 SPA is governed by Indian law, there is nothing to suggest that the Singapore courts, in determining whether to set aside the Award on public policy grounds, will consider whether the contract is illegal under the foreign law. 153 Secondly, Nine Rivers refers to the fact that the present proceedings involve setting aside the Award and not enforcing the Award, which is a matter being currently dealt with in the High Court of Delhi, India. The principles inAJT v AJU([132]supra) were derived from cases where the courts were being asked to enforce contracts that were governed by the court’s domestic law and to be performed in another foreign nation. It submits that they do not automatically extend to situations where the court is being asked to set aside an international arbitration award arising from an underlying contract that was governed by a foreign law. 154 In this case, Nine Rivers submits that the Arbitrator also made clear, at paragraph 133 of the Award, that “the question of whether [Mr Patnaik] is ultimately entitled, under FEMA and its regulations, to effect the transfer to which he has agreed under the SSSA, is more properly to be determined if and when enforcement of any award I may give is to be addressed”. As enforcement proceedings have already been commenced in India and Mauritius, Nine Rivers submits that the appropriate forum to determine the Indian law issues is in the enforcement proceedings rather than this application to set aside the Award.54Foot Note 54×DWS at [78]–[79]. 155 Given that the Indian law issues will likely be determined by the court that is tasked with the enforcement proceedings, and such court may well be better equipped to deal with them than the Singapore courts, Nine Rivers submits that there is clearly nothing that would shock the conscience or violate Singapore’s most basic notion of morality and justice, which, as this Court observed inCEB v CEC([109]supra) at [49], will seldom be the case in commercial disputes such as the present case.55Foot Note 55×DWS at [80]. 156 Nine Rivers therefore submits that the Indian law issues are of no relevance to the public policy of Singapore and that Justice Patnaik’s Affidavit could not assist in this challenge under the public policy grounds. In the circumstances, it submits that the challenge based solely on the Indian law issues should fail.56Foot Note 56×DWS at [81]–[82]. 157 Further, Nine Rivers submits that Mr Patnaik’s arguments were dealt with at the Arbitration and allowing them to be re-heard at this stage would amount to an abuse of process. They were dismissed in the Award and should not be re-litigated on their merits in this application to set aside the Award. 158 Nine Rivers refers toBTN and another v BTP and another[2019] SGHC 212 at [78]–[80] and submits that the Award cannot be reviewedde novoby the courts in a setting aside action, save for jurisdictional decisions. Further, insofar as a setting aside action is brought on non-jurisdictional grounds, the parties are not allowed to adduce fresh evidence on those grounds and it refers toSinolankaHotels & Spa (Private Limited) v Interna Contract SpA[2018] SGHC 157 at [60].57Foot Note 57×DWS at [84]. 159 In the present case, Nine Rivers says that the Indian law issues were raised and submissions were made on them during the hearing from 11 to 13 February 2019 and the parties had agreed not to adduce expert evidence regarding the same. The Award was issued on 24 June 2019 and the Indian law issues were considered and decided upon in the Award, after hearing the parties’ submissions.58Foot Note 58×DWS at [85]. 160 Nine Rivers submits that Justice Patnaik’s Affidavit is fresh evidence that was only adduced in February 2020, more than three months after the Application was filed. That affidavit was not prepared and/or put in evidence before the Arbitrator, although it could have easily been obtained during the course of the arbitration proceedings and would have been available at the time of the Arbitration hearing. In this regard, Mr Patnaik has not shown why, at the time of the Arbitration, Justice Patnaik’s Affidavit was not available and/or could not have been obtained with reasonable diligence. The parties had agreed at the Arbitration that they would not lead expert evidence on the Indian law issues but would simply address them by way of submissions by their respective Indian solicitors.59Foot Note 59×DWS at [86]. 161 Nine Rivers submits that, in raising the Indian law issues and attempting to rely on Justice Patnaik’s Affidavit on the Application, Mr Patnaik is effectively seeking to re-hear the merits of the dispute and to re-present submissions that have already been made in the Arbitration. It submits that Mr Patnaik is trying to take a second bite at three arguments that were raised in the Arbitration and rejected by the Arbitrator in the Award: whether the Investor Put Option is an optionality clause with assured returns; whether the Reserve Bank of India (“RBI”) can be asked for permission in respect of the Investor Put Option; and whether the 2014 SPA, the 2015 Amendment or section 17.2.2.1 of the SSSA is rendered void.60Foot Note 60×DWS at [87]–[89]. 162 In this regard, Nine Rivers refers to the Court of Appeal’s decision inBBA v BAZ([49]supra) at [41] where it was stated that “[t]he courts do not and must not interfere in the merits of an arbitral award and, in the process, bail out parties who have made choices that they might come to regret, or offer them a second chance to canvass the merits of their respective cases. This important proscription is reflected in the policy of minimal curial intervention in arbitral proceedings, a mainstay of the Model Law and the IAA …” [emphasis in original removed]. 163 Further, Nine Rivers submits that, even if the Arbitrator had made an error of fact or error of law in respect of his decision on the Indian law issues, that, in itself, would not permit the Award to be set aside on public policy grounds. It says that the high threshold for establishing public policy grounds was recently affirmed by the Court of Appeal inBBA v BAZ, in these terms at [101]–[102]: Lastly, the CA 10 Appellants argued that an egregious error of law in the making of an Award amounts to a breach of public policy and the finding of joint and several liability is such an error. To demonstrate the severity of such an error, Mr Sreenivasan argued there could be wider consequences for shareholder agreements with “drag-along” clauses and collective sale agreements. BAZ disagreed that public policy was engaged. It is settled jurisprudence that mere errors of law do not cross the high threshold of making out a breach of Singapore’s public policy:PTAsuransi Jasa Indonesia (Persero) v Dexia Bank SA[2007] 1 SLR(R) 597 (“PTAsuransi”) at [57];AJU v AJT[2011] 4 SLR 739 at [62]. The CA 10 Appellants’ arguments were redolent of an attempt to recast an “egregious” error of law as a matter of public policy. This is something this Court has taken a firm stand against and rejected since 2007: seePTAsuransiandAJU v AJT. 164 In summary, Nine Rivers submits that Mr Patnaik’s reliance on public policy grounds to set aside the Award is an abuse of process and should not be allowed, because the contention that the Award is in conflict with the public policy of India is irrelevant as the setting aside regime under the Model Law provides for the public policy of Singapore to be the basis on which an arbitral award may be set aside. The Indian law issues had already been submitted on and determined in the Award and any attempt to revive them at this stage is a clear abuse of process. Even if there was an error of fact or law in respect of the Arbitrator’s decision on the Indian law issues, this is insufficient to set aside the Award on public policy grounds.61Foot Note 61×DWS at [94].",
        "Discussion": "165 There are, essentially, two questions raised by this part of the Application. First, the extent to which the findings of fact and/or law of the Arbitrator should be taken to be final and binding on this court and whether the correctness of those findings can be challenged on the basis of evidence submitted for the purpose of the Application. Secondly, to the extent that the findings of fact and/or law are not final and binding and it were to be found that the Award was illegal in India, would this court set aside the Award on the grounds that it conflicted with the public policy of Singapore? The effect of findings by the Arbitrator 166 In summary, Mr Patnaik submits that, based on Justice Patnaik’s Affidavit, the Award is in conflict with the laws of India and consequently in conflict with the public policy of India as it is not enforceable against Mr Patnaik, who is an Indian resident. He submits that the court should therefore make its own finding on this question of law, even if it amounts to re-litigating an issue considered in the Arbitration and dealt with in the Award. 167 Nine Rivers, in summary, submits that Mr Patnaik cannot rely on Justice Patnaik’s Affidavit because the issue of whether the 2014 SPA was an illegal agreement was an issue in the arbitration proceedings and cannot be re-litigated on the merits in an application to set aside the Award on the basis of Singapore public policy. 168 In the decision of the High Court inAJT v AJU([132]supra) and of the Court of Appeal inAJU v AJT([145]supra), there was an SIAC arbitration based on the Concluding Agreement governed by Singapore law. It was alleged that the Concluding Agreement was null and void on the grounds of duress, undue influence and illegality. The arbitral tribunal decided that the Concluding Agreement was valid and enforceable. The other party then applied to the High Court to set aside the award under Article 34(2)(b)(ii) of the Model Law on the basis that the award was contrary to Singapore public policy as it was an agreement to take steps to stifle a prosecution in Thailand and therefore illegal under Singapore law (the governing law) and Thai law (the place of performance). 169 The High Court judge reopened the findings of the arbitral tribunal and set aside the award, holding that the Concluding Agreement was an agreement to stifle the prosecution in Thailand and was contrary to public policy in Singapore. On appeal, the Court of Appeal dealt with two issues, the first being: whether the Judge was correct in going behind the award and reopening the tribunal’s finding that the Concluding Agreement was valid and enforceable. 170 The Court of Appeal held that the Judge was not entitled to reject and substitute the tribunal’s findings with his own findings. The Court of Appeal said that arbitration under the IAA was international arbitration and not domestic arbitration, and so s 19B(1) provided that an IAA award was final and binding on the parties, subject only to narrow grounds for curial intervention. This meant that findings of fact made in an IAA award were binding on the parties and could not be reopened except where there was fraud, breach of natural justice or some other recognised vitiating factor. 171 The Court of Appeal referred toPTAsuransi Jasa([63]supra) at [53]–[57], where it was held that, even if an arbitral tribunal’s findings of law and/or fact were wrong, such errors would notper seengage the public policy of Singapore. In that case, the public policy of Singapore was not engaged by the findings of fact of the tribunal. 172 In giving its judgment inAJU v AJT([145]supra), the Court of Appeal made some important observations on the approach of a court faced with an application to set aside a contract on grounds of illegality. First, at [37], the court said that there was no difference between the enforcement regime in s 31(4)(b) of the IAA and the setting aside regime under Art 34(2)(b)(ii) of the Model Law as far as public policy is concerned, so that case law on the enforcement regime is relevant to the setting aside regime. As stated in [38], where enforcement was resisted on public policy grounds, the public policy objection must involve either “exceptional circumstances…which would justify the court in refusing to enforce the award” or a violation of “the most basic notions of morality and justice”. 173 Secondly, the Court of Appeal inAJU v AJTconsidered the issue of whether a court could reopen an arbitral tribunal’s finding on the legality of the underlying contract and decide that issue for itself, as the High Court judge had done in that case. In coming to a conclusion on this aspect, the Court of Appeal considered two English authorities: first,  the decision of Colman J and the English Court of Appeal inWestacreInvestments Inc v Jugoimport-SPDR Holding Co Ltd[1999] QB 740 (“Westacre(HC)”) and [2000] 1 QB 288 (“Westacre(CA)”) and, second, the English Court of Appeal’s decision inSoleimanyv Soleimany[1999] QB 785 (“Soleimany”). After analysing those authorities, the Court of Appeal at [59]–[61] analysed two divergent approaches to the circumstances in which the court may reopen an arbitral tribunal’s decision that an underlying contract was legal. They considered that the approach taken inWestacre(HC)by Colman J and by the majority of the English Court of Appeal was to be preferred to the more liberal and “interventionist” approach taken inSoleimanyand by Waller LJ in the minority in the Court of Appeal inWestacre(CA). The Court of Appeal at [60] said that the preferred approach was “consonant with the legislative policy of the IAA of giving primacy to the autonomy of arbitral proceedings and upholding the finality of arbitral awards (whether foreign arbitral awards or IAA awards).” 174 The approach taken by Colman J inWestacre(HC), in the context ofAJU v AJTand this case, was summarised in two principles at 767G–768A, cited inAJU v AJTat [42]: (v) If the court concluded that the arbitration agreement conferred jurisdiction to determine whether the underlying contract was illegal and by the award the arbitrators determined that it was not illegal, prima facie the court would enforce the resulting award. (vi) If the party against whom the award was made then sought to challenge enforcement of the award on the grounds that,on the basis of facts not placed before the arbitrators, the contract was indeed illegal, the enforcement court would have to consider whether the public policy against the enforcement of illegal contracts outweighed the countervailing public policy in support of the finality of awards in general and of awards in respect of the same issue in particular. [emphasis in original] 175 On balance, Colman J held inWestacre(HC)at 773A–E that “the public policy of sustaining international arbitration awards on the facts of this case outweighs the public policy in discouraging international commercial corruption”. At 769A, Colman J had observed that, since the parties had selected arbitration by an impressively competent international body (viz, the International Chamber of Commerce), the English courts would be entitled to assume that the arbitrators appointed were of undoubted competence and ability, and well able to understand and determine the particular issue of illegality arising in that case. InAJU v AJTat [61], the Court of Appeal said that this premise applieda fortioriin that case, given that: “(a) the parties selected arbitration by the SIAC (an equally competent international body); (b) the Tribunal consisted of experienced members of the local Bar; and (c) the Tribunal decided the issue of illegality according to Singapore law. For these reasons, a Singapore court would all the more be entitled to assume that the members of the Tribunal had adequate knowledge of Singapore law.” 176 InAJU v AJT([145]supra), the law to be applied in the arbitration was Singapore law and the Court of Appeal at [62] held that the judge was entitled to decide whether the Concluding Agreement was illegal and to set aside the award if it was tainted with illegality. It stated: Be that as it may, since the law applied by the Tribunal was Singapore law, the question that arises is whether, if a Singapore court disagrees with the Tribunal’s finding that the Concluding Agreement is not illegal under Singapore law, the court’s supervisory power extends to correcting the Tribunal’s decision on this issue of illegality. In our view, the answer to this question must be in the affirmative as the court cannot abrogate its judicial power to the Tribunal to decide what the public policy of Singapore is and, in turn, whether or not the Concluding Agreement is illegal (illegality and public policy being, as pointed out at [19] above, mirror concepts in this regard), however eminent the Tribunal’s members may be. Accordingly, we agree with the Judge that the court is entitled to decide for itself whether the Concluding Agreement is illegal and to set aside the Interim Award if it is tainted with illegality, just as inSoleimany, the English CA refused to enforce the Beth Din’s award as it was tainted with illegality. 177 However, at [64], the Court of Appeal concluded that it was not an appropriate case for the judge to reopen the tribunal’s finding that the Concluding Agreement was valid and enforceable. They found that the case was not aSoleimany-type case ([173]supra) involving an underlying contract tainted by illegality where the tribunal had ignored palpable and indisputable illegality, but a case more analogous toWestacre(CA)([173]supra) orOmnium deTraitement et de Valorisation SA v Hilmarton Ltd[1999] 2 Lloyd’s Rep 222, where the respective arbitral tribunals found that the underlying contracts in question did not involve the giving of bribes but lobbying of government officials, which was not contrary to English public policy. 178 The Court of Appeal inAJU v AJTheld at [65] that the judge was not entitled to reject the tribunal’s findings and substitute his own findings for them. It referred to s 19B(1) of the IAA which provides that: “[a]n award made by the arbitral tribunal pursuant to an arbitration agreement is final and binding on the parties and on any persons claiming through or under them and may be relied upon by any of the parties by way of defence, set-off or otherwise in any proceedings in any court of competent jurisdiction.” The Court of Appeal stated that this meant that “findings of fact made in an IAA award are binding on the parties and cannot be reopened except where there is fraud, breach of natural justice or some other recognised vitiating factor.” 179 The Court of Appeal then referred toPTAsuransi Jasa([63]supra) and said at [66]: In this connection, we would reiterate the point which this court made inPTAsuransi Jasa([27]supra) at [53]–[57],viz, that even if an arbitral tribunal’s findings of law and/or fact are wrong, such errors would notper seengage the public policy of Singapore. In particular, we would draw attention to the following passage from [57] of that judgment: … [T]he [IAA] … gives primacy to the autonomy of arbitral proceedings and limits court intervention to only the prescribed situations. The legislative policy under the [IAA] is to minimise curial intervention in international arbitrations. Errors of law or fact made in an arbitral decision,per se, are final and binding on the parties and may not be appealed against or set aside by a court except in the situations prescribed under s 24 of the [IAA] and Art 34 of the Model Law. While we accept that an arbitral award is final and binding on the parties under s 19B of the [IAA], we are of the view thatthe [IAA] will be internally inconsistent if the public policy provision in Art 34 of the Model Law is construed to enlarge the scope of curial intervention to set aside errors of law or fact. For consistency, such errors may be set aside only if they are outside the scope of the submission to arbitration. In the present context, errors of law or fact,per se, do not engage the public policy of Singapore under Art 34(2)(b)(ii) of the Model Law when they cannot be set aside under Art 34(2)(a)(iii) of the Model Law. [emphasis added] This passage recognises the reality that where an arbitral tribunal has jurisdiction to decide any issue of fact and/or law, it may decide the issue correctly or incorrectly. Unless its decision or decision-making process is tainted by fraud, breach of natural justice or any other vitiating factor, any errors made by an arbitral tribunal are notper secontrary to public policy. 180 However, the Court of Appeal said that, as an award could be challenged on public policy grounds, it was necessary to clarify the application of the principle that “errors of law or fact,per se, do not engage the public policy of Singapore”. At [67]–[68] they said: … since s 19B(4) of the IAA, read with Art 34(2)(b)(ii) of the Model Law, expressly provides that an arbitral award can be challenged on public policy grounds, it is necessary for us to clarify the application of the general principle laid down inPTAsuransi Jasa(at [57]) that “errors of law or fact,per se, do not engage the public policy of Singapore”. It is a question of law what the public policy of Singapore is. An arbitral award can be set aside if the arbitral tribunal makes an error oflawin this regard, as expressly provided by s 19B(4) of the IAA, read with Art 34(2)(b)(ii) of the Model Law. Thus, in the present case, if the Concluding Agreement had been governed by Thai law instead of Singapore law, and if the Tribunal had held that the agreement was indeed illegal under Thai law (as the Respondent alleged)but could nonetheless be enforced in Singaporebecause it was not contrary to Singapore’s public policy, this finding –viz, that it was not against the public policy of Singapore to enforce an agreement which was illegal under its governing law – would be a finding of law which, if it were erroneous, could be set aside under Art 34(2)(b)(ii) of the Model Law (read with s 19B(4) of the IAA). In contrast, Art 34(2)(b)(ii) of the Model Law does not apply to errors offact. As Colman J said inWestacre(HC)([40]supraat 769E–F)vis-à-viserrors of fact in arbitral awards: In so far as [the issue referred to arbitration] involves [the] determination of questions of fact, that is an everyday feature of international arbitration.The opportunity for erroneous anduncorrectable findings of fact arises in all international arbitration. [emphasis added] In a similar vein, Quentin Loh JC pointed out at [24] ofStrandoreInvest A/S v Soh Kim Wat[2010] SGHC 151 (which concerned an application under s 29(1) of the IAA for leave to enforce a Danish arbitral award in Singapore): It is worth remembering that just as parties who have chosen arbitration must live with their arbitrator, ‘good, bad or indifferent,’ our courts may be called upon to enforce ‘bad’ awards from another jurisdiction. [emphasis in original] 181 At [69], the Court of Appeal summarised the position as follows: In our view, limiting the application of the public policy objection in Art 34(2)(b)(ii) of the Model Law to findings oflawmade by an arbitral tribunal – to theexclusionof findings offact(save for the exceptions outlined at [65] above) – would be consistent with the legislative objective of the IAA that, as far as possible, the international arbitration regime should exist as an autonomous system of private dispute resolution to meet the needs of the international business community. 182 I now turn to consider the finding in this case that the 2014 SPA was not an illegal contract. The Arbitrator summarised the issue in paragraph 103 of the Award:62Foot Note 62×Gokul’s 1st Affidavit at p 57. The Answering Respondents suggest that the terms of the 2014 SPA, which require the Sale Securities to be purchased for a consideration of INR 302,500,000 (plus the accrued preferred dividend up to 30 June, 2014) amounts to an assured return which is inconsistent with the FEMA Regulations 2000, as amended by the FEMA Regulations 2013, and therefore illegal. They therefore contend that the 2014 SPA is void ab initio. 183 The Arbitrator held that, contrary to Mr Patnaik’s case, the consideration of INR 302,500,000 was not an assured return as it was an agreed consideration arrived at as an arms-length negotiation at the time of exit. 184 Mr Patnaik also contended, as set out in paragraph 116 of the Award, that “both the 2015 Amendment, and section 17.2.2.1 of the SSSA are also void, both being contrary to the FEMA Regulations 2000.”63Foot Note 63×Gokul’s 1st Affidavit at p 60.The Arbitrator rejected the submission in respect of the 2015 Amendment for the same reasons as in relation to the 2014 SPA. As Mr Patnaik is a resident of India, the Arbitrator held that the FEMA Regulations (as amended by the FEMA Regulations 2013) would apply to any transfer of the Investor Securities to him. As a result, he went on to analyse whether the SSSA might contravene the FEMA Regulations (as amended by the FEMA Regulations 2013), and consequently whether it might be void. 185 The Arbitrator held at paragraph 132 of the Award that, contrary to Mr Patnaik’s case, on a proper construction of both the 2014 SPA and the SSSA, the Investor Put Option was not an optionality clause with an assured return but it was contingent, entirely at the behest of the Purchaser, the Company and the Promoters, and no return was assured at all. 186 At paragraph 133, the Arbitrator also added that he accepted that “the RBI can be asked for permission in respect of the Investor Put Option, and that thus the question of whether Mr Patnaik is ultimately entitled, under FEMA and its regulations, to effect the transfer to which he has agreed under the SSSA, is more properly to be determined if and when enforcement of any award I may give is to be addressed. It is not something that makes the 2014 SPA, the 2015 Amendment or section 17.2.2.1 of the SSSA void ab initio”.64Foot Note 64×Gokul’s 1st Affidavit at p 65. 187 The foregoing findings of the Arbitrator involved findings of fact as to the nature of the transactions under the 2014 SPA, the 2015 Amendment and the SSSA. For the reasons set out inAJU v AJT([145]supra), those findings of fact made by the Arbitrator are final and binding and in this case there is no vitiating factor such as fraud or breach of natural justice which allows them to be reopened in this court. 188 Further, even if the Arbitrator made findings of law, those would be findings of Indian law which he made after hearing submissions from Indian lawyers. The relevant agreements in this case, unlike the Concluding Agreement inAJU v AJT, were governed by Indian law and not by Singapore law. So far as this Singapore court is concerned, findings of Indian law are findings offactas to a foreign law. For this court, considering an application under the IAA, an issue of foreign law is a matter of fact which has to be proved by evidence. Therefore, the findings of the Arbitrator as to Indian law were findings of fact so far as this court is concerned. 189 On that basis and as explained inAJU v AJT, Art 34(2)(b)(ii) of the Model Law does not apply to errors of fact, and limiting the application of the public policy objection in Art 34(2)(b)(ii) of the Model Law to findings of Singapore law made by an arbitral tribunal is consistent with the legislative objective of the IAA. 190 The relevant issue of law in this case is the public policy of Singapore. As the observations of the Court of Appeal inAJU v AJTat [67] shows (see [180] above), if an arbitral tribunal decides that a contract is illegal but also decides that it was not against Singapore public policy to enforce that contract in Singapore, that finding would be a finding of law which, if it were erroneous, could be set aside under Art 34(2)(b)(ii) of the Model Law by a court in Singapore if the contract is governed by Singapore law. 191 However, if an arbitral tribunal decides that a contract is not illegal under a foreign law, as is the case here under Indian law, then there is no issue of Singapore law which is engaged and therefore no finding of law which a Singapore court could set aside under Art 34(2)(b)(ii) of the Model Law. 192 If, contrary to my finding, the decision of the Arbitrator on the meaning of the FEMA Regulations under Indian law was a matter which amounted to a finding of law which was open to challenge in this court, it is clear that the parties selected arbitration by the SIAC (a competent international body) and the Arbitrator is an experienced arbitrator. Further, the Arbitrator decided the issue of Indian law based on the procedure which the parties agreed and Mr Patnaik now seeks to challenge the findings of the Arbitrator by adducing fresh evidence, not produced in the Arbitration. Using the phrase of Colman J inWestacre(HC)([173]supra), even if it were open for me to consider the issue of Indian law afresh on an application under Art 34(2)(b)(ii) of the Model Law, I would not, on balance, do so. In my judgment, the public policy of sustaining international awards on the facts of the current case outweighs the public policy in discouraging international commercial transactions which breach a country’s foreign exchange regulations, even if, contrary to the findings of the Arbitrator, that is what happened in this case. Indian public policy and Singapore public policy 193 In the light of my decision, this issue does not arise. However, having heard full argument, I consider it appropriate to deal with it. 194 The parties agree that the relevant public policy to consider under Art 34(2)(b)(ii) of the Model Law is that ofSingapore, not India. 195 Mr  Patnaik submits that the Award is in breach of the public policy of India, as it affirmed a contract which necessitated parties joining in an endeavour to perform an act which was illegal by the laws of India in terms of acting contrary to the FEMA Regulations. Consequently, he says that the Award is in breach of Singapore public policy and should be set aside. I shall assume that, contrary to what I have said above, I had held that the SSSA and the 2014 SPA, as amended, were illegal contracts under the laws of India. 196 As outlined above, Mr Patnaik principally relies on three authorities:Kempinski([44]supra),PehTeck Quee([139] supra), andSheagar([141]supra). The facts and holding ofKempinskihave been outlined at [136]–[138] above. 197 InPehTeck Quee, a German bank in Singapore extended foreign currency credit facilities to a Malaysian resident under a facility agreement governed by Singapore law. The bank commenced proceedings against the individual who contended that the proper law was Malaysian law and the facility agreement was illegal and void as it breached Exchange Control and Moneylenders statutes in Malaysia. The Court of Appeal held at [45] and [48] that the principle inFoster v Driscoll([139]supra) did not apply on the facts of that case as the obligation sought to be enforced did not involve the doing of an act in Malaysia but in Singapore, and the parties had not intended or contemplated breaking the laws of Malaysia at the time of contracting. 198 The Court of Appeal also stated at [54], without further consideration of the exact scope ofRalliBros v Compania Naviera Sota y Aznar[1920] 2 KB 287 (“RalliBros”), that there should not be an unequivocal merger between the principle inRalliBros– that a contract was invalid in so far as the performance of it was unlawful by the law of the country where it was to be performed – and that inFoster v Driscoll, where a contract whose object was a breach of international comity would be void for being against public policy. 199 In consideringFoster v Driscoll, the Court of Appeal inPehTeck Queestated at [45]–[47]: The appellant also raised a related argument based on a principle of public policy formulated in the case ofFoster v Driscoll([19] supra). This principle states that the courts will treat a contract governed by its own law as void where the parties’ intention and object contemplated thereby jeopardises relations between its government and another friendly government. The case concerned a contract, governed by English law, for the supply and sale of whisky that was to be smuggled into the United States of America in contravention of the prohibition laws in force at the time. The actions were brought in relation to various disputes arising out of the contract. The Court of Appeal categorically stated that the courts would not enforce such a contract “made between the parties to further an adventure or break the laws of a foreign state”. Sankey LJ added: … an English contract should and will be held invalid on account of illegality if the real object and intention of the parties necessitates them joining in an endeavour to perform in a foreign and friendly country some act which is illegal by the law of such country notwithstanding the fact that there may be, in certain events, alternative modes or places of performing which permit the contract to be performed legally. In other words, an agreement whose object to be attained is a breach of international comity will be regarded by the courts as being against public policy and void. This principle was elaborated on in the case ofRegazzoniv K C Sethia (1944) Ltd([19] supra) which concerned a contract for the sale and delivery of jute bags. The parties to the contract contemplated that these bags should be shipped from India to Genoa for resale to South Africa. One party eventually repudiated the contract and the other party brought an action for damages for breach of contract. The proper law of the contract was English law. At the time, there was in force a prohibition on the export of goods to South Africa by the Indian Government. The Law Lords agreed with and appliedFoster v Driscoll. Lord Keith said ([19] supra) at 327: … to recognise the contract between the appellant and the respondent as an enforceable contract would give a just cause for complaint by the Government of India and should be regarded as contrary to conceptions of international comity. On grounds of public policy, therefore, this is a contract which our courts ought not to recognize. In the same case, Lord Reid added at 323 that: The real question is one of public policy in English law: but in considering this question we must have in mind the background of international law and international relationships often referred to as the comity of nations. This is not a case of a contract being made in good faith but one party thereafter finding that he cannot perform his part of the contract without committing a breach of foreign law in the territory of the foreign country. If this contract is held to be unenforceable, it should, in my opinion, be because from the beginning the contract was tainted so that the courts of this country will not assist either party to enforce it. Based on this and the finding that the parties had intended to violate the laws of India, the House of Lords held that the contract was unenforceable since an English court would not enforce a contract or award damages for its breach, if its performance would involve doing an act in a foreign and friendly state which would violate the law of that state. This was based on the principle of public policy and the consequent desire for international comity. 200 InSheagar([141]supra) at [124], the Court of Appeal also referred to the principle inFoster v Driscolland said: … The Appellant’s pleaded case was based on the principle of international comity established inFoster v Driscoll… Sankey LJ explained the principle in the following terms (at 521–522): [A]n English contract should and will be held invalid on account of illegalityif the real object and intention of the parties necessitates them joining in an endeavour to perform in a foreign and friendly country some act which is illegal by the law of such countrynotwithstanding the fact that there may be, in a certain event, alternative modes or places of performing which permit the contract to be performed legally. [emphasis added] This principle was accepted by us inPehTeck Quee …at [45]. 201  It is evident that, on grounds of international comity, a court will not as a matter of public policy enforce a contract if the real object and intention of the parties necessitates them joining in an endeavour to perform in a foreign and friendly country an act which is illegal in that country. However, that is not what the court is dealing with here. As Colman J pointed out inWestacre(HC)([173]supra) at 772–773: … an order of this court whichdirectlyenforced such an agreement would be in collision with the public policy of Kuwait. That, however, is not the order which the plaintiffs invite this court to make, forthere is the additional dimension in this case that the issue of illegality has already been the subject of arbitration and of a valid award. Although direct enforcement of the contract would clearly be offensive to comity, enforcement of any such award in England under the New York Convention must be very much less so,for enforcement does not substantially depend on the public policy of Kuwait but of this country. [emphasis in original in italics; emphasis added in bold italics] 202 The important starting point is that, of the foregoing three cases highlighted by Mr Patnaik,only Kempinski([44]supra) dealt with the setting aside of an arbitral award.  InPehTeck Quee([139] supra) andSheagar, a national court was considering the question of theenforcement ofa contract governed by its national lawin litigation proceedings before the court. In such a case, if the real object and intention of the parties necessitates them joining in an endeavour to perform in a foreign and friendly country some act which is illegal by the law of such country, then the national court may refuse enforcement on the basis of public policy, as it would be a breach of international comity to do so. That does not mean that every illegal contract would always, as a matter ofSingaporepublic policy, not be enforced or would be set aside on the basis that a contract was illegal in the place of performance. 203 In the present case, even if I had found that the SSSA and the 2014 SPA, as amended, were illegal under the laws of India, the grounds for a breach of international comity of the type set out inFoster v Driscoll([139]supra) would not have been made out.Kempinskidoes not assist Mr Patnaik’s case because the Court of Appeal in that case wasnotconsidering the issue of public policy underArt 34(2)(b)(ii)of the Model Law and whether it would indeed be in breach ofSingaporepublic policy to enforce a contract that is illegal in a foreign state due to a breach of international comity. Rather, it was considering if an arbitral tribunal’s consideration of anunpleadedpublic policy point would cause the tribunal to exceed its jurisdiction and thus give rise to a breach ofArt 34(2)(a)(iii)of the Model Law. Mr Patnaik has thus not cited any authority for the proposition that a contract which is illegal in another foreign statenecessarilyleads to a breach of international comity, and thusSingaporepublic policy under Art 34(2)(b)(ii) of the Model Law, if the arbitral award contemplating the enforcement of that contract is not set aside. 204 The authorities demonstrate that the public policy ground under Art 34(2)(b)(ii) of the Model Law is anarrowground, and the test is whether the upholding of the arbitral award would “shock the conscience”; is “clearly injurious to the public good or ... wholly offensive to the ordinary reasonable and fully informed member of the public”; or “where it violates the forum’s most basic notion of morality and justice”:PTAsuransi Jasa([63]supra) at [59]. To succeed on a public policy argument, the party has to cross a “very high threshold” and demonstrate “egregious circumstances such as corruption, bribery or fraud, which would violate the most basic notions of morality and justice”:Sui Southern Gas Co Ltd v Habibullah Coastal PowerCo (Pte) Ltd[2010] 3 SLR 1 at [48];BAZ v BBA and others and other matters[2018] SGHC 275 at [156]–[159]. 205 The relevant question is whether the illegality in the foreign state would demonstrate sufficiently egregious circumstances that would “shock the conscience” or violate the most basic notions of morality and justice so as to amount to a breach of Singapore public policy. 206 In the present case, there is no reason why a breach of the FEMA Regulations or the laws of India, without more, would “shock the conscience” or violate the “most basic notions of morality and justice”. If Mr Patnaik’s submissions are taken to their logical conclusion, thenanyminor illegality or regulatory infringement by a contract in its place of performance wouldipso factolead to the conclusion that international comity, and thus Singapore public policy, would be breached so that the arbitral award would have to be set aside. The public policy ground under Art 34(2)(b)(ii) of the Model Law is a narrow ground and does not lead to that conclusion. I therefore reject Mr Patnaik’s submission that Art 34(2)(b)(ii) of the Model Law would have been satisfied, even if the SSSA and 2014 SPA, as amended, were found to be illegal because of a breach of the FEMA Regulations or the laws of India.",
        "Application under s 24(b)of the IAA": "88 Section 24(b) of the IAA provides as follows: 24. Notwithstanding Article 34(1) of the Model Law, the High Court may, in addition to the grounds set out in Article 34(2) of the Model Law, set aside the award of the arbitral tribunal if — … (b) a breach of the rules of natural justice occurred in connection with the making of the award by which the rights of any party have been prejudiced.",
        "Application under Article 34(2)(b)(ii) of the Model Law": "128 Article 34(2)(b)(ii) of the Model Law provides as follows: (2) An arbitral award may be set aside by the court specified in Article 6 only if: (b) the court finds that: … (ii) the award is in conflict with the public policy of this State.",
        "Conclusion": "207 For the reasons set out above, I do not consider that the applicant, Mr Patnaik, has made out any of the grounds on which he seeks to set aside the Award and the Application is dismissed. 208 Given those findings, Justice Patnaik’s Affidavit is not relevant to decide any issue on the Applications and, in respect of the Strike Out Application by the respondent, Nine Rivers, I order that Justice Patnaik’s Affidavit be struck out.     Vivian RamseyInternational Judge Ramachandran Doraisamy Raghunath and Josiah Fong Ren Jing (Peter Doraisamy LLC) for the plaintiff; Joseph Lopez, Vanathi Eliora Ray, and Kyle Yew Chang Mao (Joseph Lopez LLP) for the defendant."
    }
}