{
    "case_title": "Koh Ah KinvYat Yuen Hong Co Limited",
    "ncitation": "[2020] SGHC 252",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 The plaintiff purchased the property at 115 University Road Singapore 291911 (the “Property”) in June 1979. He has remained as the registered proprietor of the Property from 11 December 1979. The Property is located beside a strip of land described as Lot No. MK17-02870X (the “Strip of Land”). This Strip of Land belongs to the defendant and is the subject of contention in this originating summons. 2 The plaintiff’s claim, in essence, is that he is the owner of the Strip of Land having adversely possessed it since 1979 (or in shorthand, acquired title by adverse possession). The defendant disputes this and brings a counterclaim seeking an order that the plaintiff removes the fences and walls surrounding the Strip of Land erected by the plaintiff.",
        "The law on adverse possession": "3 The Land Titles Act 1993 (Act No 27 of 1993), together with s 9(3) of the Limitation Act (Cap 163, 1996 Rev Ed), abolished the acquisition of title by adverse possession in 1994. The position was explained by the Court of Appeal inBalwant Singh v Double L & T Pte Ltd[1996] 2 SLR(R) 7 at [24] as follows: … Firstly, for land held under the common law system if the adverse possessor did not have 12 years of adverse possession as of 1 March 1994, he would now not be able to make a claim – see s 9(3) of the Limitation Act. Conversely, if he had the requisite 12 years, he could rely on s 177(3) of the 1993 LTA to preserve his possessory title. Secondly, for registered land held under the provisions of the repealed LTA, the adverse possessor could rely on ss 172(7) and 172(8) of the new LTA. Thirdly, for registered land held under the provisions of the new LTA, no adverse possession claims are now allowed unless s 172(7) or 172(8) of the new LTA applies. 4 The Strip of Land was unregistered land, of which the plaintiff was in possession. It was thus agreed between parties that the dispute in the present situation fell within the first category elucidated in the extract above.1Foot Note 1×Plaintiff’s Written Submissions para 24; Defendant’s Written Submissions para 8. 5 In order to prove adverse possession, a claimant must establish two elements: factual possession (factum possessionis) and the requisite intention to possess (animus possidendi):Ahmad Kasim bin Adam (suing as an administrator of the estate of Adam bin Haji Anwar and in his own personal capacity) v Moona Esmail Tamby Merican s/o Mohamed Ganse and others[2019] 1 SLR 1185 at [34];Powell v McFarlane(1977) 38 P&CR 452 at 470–471 (“Powell”). Adverse possession must also have occurred for at least 12 continuous years, but which can be constituted of separate, continuous, periods by differing individuals: ReLot 114-69 Mukim 22, Singapore[2001] 1SLR(R) 811 at [41]. 6 As to what each of the elements require, this was elaborated inJA Pye (Oxford) Ltd and another v Graham and another[2002] UKHL 30 (“JA Pye”) at [40] as follows: … there are two elements necessary for legal possession: (1) a sufficient degree of physical custody and control (‘factual possession’); (2) an intention to exercise such custody and control on one’s own behalf and for one’s own benefit (‘intention to possess’). … 7 It bears mentioning that the burden of proof remains on the party that is claiming adverse possession:City Developments Ltd v Estate of Syed Allowee bin Ally Aljunied, deceased[2009] 2 SLR(R) 223 at [31];Tan Ah Suan v Ng Aik Kern and others[2002] 2 SLR(R) 1135 at [15]. 8 As to thestandard and evidencerequired, however, the defendant submits that while the standard of proof is the balance of probabilities, the “evidence of factual possession and intention must be compelling”2Foot Note 2×Defendant’s Written Submissions para 14.. It makes this point, relying on the cases ofWong Shing Chai Jimmy v Good Allied Investment Ltd[2017] HKCU 3137 (“Wong Shing Chai”)andWong Wai Chi Susanna v Lam Lai Chun[2020] HKCU 693 (“Wong Wai Chi”). InWong Shing Chai, the court citedTsang Foo Keung v Chu Jim Mi Jimmy[2017] 3 HKC 527 at [26], for the proposition that: The person claiming adverse possession has the burden of proving both exclusive physical control and the requisite intention. Although the standard of proof is still the normal civil standard, ie on the balance of probabilities, commensurate with the serious consequences of finding that the holder of the paper title has been disposed theevidence of exclusive possession and intention must be compelling. It cannot be lightly assumed that the paper title holder has foregone his interest in land. [emphasis added] 9 This same extract was again cited inWong Wai Chiat [19] as part of the broad principles concerning adverse possession. The court inWong Wai Chi, however, goes on to state at [20] that the “trespasser must adduce clear and affirmative evidence to show that he had the requisite intention to possess”, citing Slade J’s judgment inPowellat 472. 10  In my view, the need forcompelling evidenceonly relates to the second element of an intention to possess. This is seen fromPowellitself at 476 where it is stated that: … it is consistent with principle as well as authority that a person who originally entered another's land as a trespasser, but later seeks to show that he has dispossessed the owner, should be required to adducecompelling evidence that he had the requisiteanimus possidendiin any case where his use of the land was equivocal, in the sense that it did not necessarily, by itself, betoken an intention on his part to claim the land as his own and exclude the true owner. [emphasis added in bold] 11 This portion ofPowellwas also cited with approval by Lord Hutton inJA Pyeat [77]. Counsel for the defendant, Mr Davinder SinghSC, eventually agreed that there was no need to apply such an exacting evidential standard to the first element of factual possession. All that is required at that stage is a general assessment of the circumstances in question. This must necessarily be correct as proof of such intention would require somethingbeyondfactual possession.",
        "The present case": "12  In order to succeed in this application, the plaintiff must prove that he was in adverse possession of the Property on or before 1 March 1982, at least twelve years prior to the change of the law on 1 March 1994. The plaintiff’s case on factual possession really boils down to two points. First, he alleges that “in or about early 1980”,3Foot Note 3×Affidavit of Koh Ah Kin filed on 6 February 2020 para 7.he had carried out several works to the Strip of Land. In his affidavits,4Foot Note 4×Affidavit of Koh Ah Kin filed on 6 February 2020 paras 8 and 9; Affidavit of Koh Ah Kin filed on 6 April 2020 para 8.he claims that the Strip of Land was initially demarcated by two fences; one that separated the Strip of Land and his Property (the “Inner Fence”) and one that separated the Strip of Land and the open space next to it (the “Outer Fence”). With the help of contractors, both fences were removed, and a retaining wall and a new fence (the “New Fence”) was built in place of the outer fence. He also erected a separate retaining wall and fence at the back of the Property. As part of the construction works, the plaintiff claims to have filled up the Strip of Land with soil and flattened it. 13 In order to prove his claim, the plaintiff adduces two sets of photographs of the New Fence. The first set contains a single photograph, dated January 1984;5Foot Note 5×Affidavit of Koh Ah Kin filed on 6 April 2020 p 5.the plaintiff relies on this to show that the Inner Fence had been removed, leaving only the New Fence, and that the Strip of Land was flattened instead of sloping.6Foot Note 6×Affidavit of Koh Ah Kin filed on 6 April 2020 para 9.The second set contains two photographs that he claims are taken recently of the New Fence.7Foot Note 7×Affidavit of Koh Ah Kin filed on 6 February 2020 pp 65–66. 14 It is plain, however that the fences depicted in the two sets of photographs are different from one another. Counsel for the plaintiff accepted that the New Fence described in the plaintiff’s affidavits referred to a “chain-link” fence, which is also depicted in the first set of photographs. The fence in the second set of photographs, in contrast, is a solid, aluminium fence. The photographs therefore do not assist at all in the plaintiff’s case. 15 The plaintiff was also unable to produce any documentation or any planning approvals as proof of the construction works. Even disregarding the differences between the photographs, there is no evidence that the New Fence (or the “chain-link” fence) had been erected by the plaintiff in or around early 1980. The photograph is dated January 1984, as noted above at [14]. Taken at its highest, this would indicate that the plaintiff had constructed the New Fence by January 1984 and not before 1 March 1982. 16 The plaintiff’s next point on factual possession is that he had planted several rambutan trees on the Property at the same time of the construction works above at [13]. The plaintiff’s argument is that the rambutan trees he had planted in or around early 1980, are the same trees on the Property today and they had grown and extended their roots into the Strip of Land.8Foot Note 8×Plaintiff’s Written Submissions para 42.In support of this argument, the plaintiff tendered two further sets of photographs of the rambutan trees, one set dated January 1984 and one set of the trees on the site today. These photographs were accompanied by expert evidence from an arborist, Mr Yap Chung Hoe Derek (“Mr Yap”). Based on his affidavit dated 6 April 2020 (“Mr Yap’s Report”), the key findings of Mr Yap were as follows:9Foot Note 9×Yap Chung Hoe Derek’s affidavit filed 6 April 2020 pp 7–10. (a)  While it could not be identified with absolute certainty, in his opinion, the trees in the photographs resembled rambutan trees. (b) Based on the canopy spread of one of the trees, it was estimated that it had been growing on site for more than four years at the point the picture was taken. This indicated that the trees had been planted in or around 1980. (c) Comparing the branch architecture and the tree form from both sets of photographs, there was “compelling evidence” that the trees in the January 1984 picture were the same trees on site today. (d) The root distribution pattern and extension of the trees were not necessarily limited by hard barriers (such as the presence of a fence). The unequal distribution of surface roots could also be due to non-homogenous water distribution. Further, such an examination should not be based purely on surface roots and should take into account roots below soil level. 17 On its part, the defendant relied on the expert evidence of an arborist, Mr Goh Mia Chun (“Mr Goh”). Mr Goh produced two reports: the first dated 17 March 2020, and the second dated 21 April 2020 that was a reply to Mr Yap’s Report. The key findings from both of Mr Goh’s reports may be summarised as thus: (a) The branch architecture and the tree form of the trees in the two sets of photographs are “clearly different”. Mr Yap had overlooked portions of the trees’ structures that indicated that the trees in the photographs were not similar.10Foot Note 10×Defendant’s Written Submissions paras 30–40.Further, Mr Yap had failed to consider literature that indicated that trees grew up from their most distal ends,11Foot Note 11×Defendant’s Written Submissions paras 41–47.resulting in him relying on incorrect portions of the tree structure as proof of similarity. (b) The asymmetrical distribution of the rambutan trees’ roots indicated that there was no soil on the Strip of Land and that the Inner Fence was still present. The lack of resources for growth and obstacles in the soil constituted impediments to root structure and distribution.12Foot Note 12×Defendant’s Written Submissions paras 61–67. (c) The photographs indicated that there was significantly more root growth to the side facing away from than towards the Strip of Land.13Foot Note 13×Defendant’s Written Submissions paras 68, 74–81. (d) Mr Yap had not shown how an analysis of roots below soil level was relevant. In any case, the correct analysis was to look at the surface roots as it was “well known that rambutan is shallow rooted”.14Foot Note 14×Defendant’s Written Submissions paras 69–72. 18 In my view, the rambutan trees, and the evidence adduced by the plaintiff, are simply not indicative of factual possession since early 1980. In relation to the branch architecture and the tree form, I find that in totality, the evidence on this is equivocal at best. I will note, however, that this was largely because Mr Yap did not produce a follow-up report, leaving most of the points made in Mr Goh’s second report unrebutted. Additionally, the multitude of literature relied upon by Mr Goh also remains unrebutted by the plaintiff. 19 On balance, however, I find that the points made by Mr Goh on root growth to be more persuasive. The photographs indicate a clear, and highly asymmetrical, growth patternawayfrom where the Inner Fence used to be. Further, in the report provided by the plaintiff’s own surveyor expert, Mr Quah Kee Soo (“Mr Quah”), it can be seen that the extent of tree roots are unevenly distributed on the side towards the Property and not the Strip of Land.15Foot Note 15×Quah Kee Soo’s affidavit dated 3 March 2020, p 10.While non-homogenous water distribution is a possible reason, there is no evidence to show that this was true. Given that both parties agree that the Inner Fence did indeed exist, and that the Strip of Land was previously a drainage area without soil, it is more likely that these were the causes of uneven root growth. 20 Additionally, the pattern in which the plaintiff had planted the rambutan trees suggests that the Inner Fence might have existed at the time of planting. The defendant rightly points out that the trees on the Property appears to have been planted in a manner that was parallel to the boundary walls surrounding the Property and the Strip of Land, and generally an even distance of about half to one metre away from the boundary walls. The only deviations from this pattern are a jackfruit tree planted on the Strip of Land itself, and the rambutan trees. While the rambutan trees had been planted further away from the boundary walls when compared to the other trees, it was pointed out that they had maintained the distance of about half to one metre away from wherethe Inner Fence used to be. The plaintiff proffered no explanation as to why this was the case. It is likely that the Inner Fence still existed at the time when the rambutan trees were planted, and that prevented the plaintiff from planting closer to the boundary wall. For completeness, I note that the jackfruit tree, while planted extremely close to the boundary wall, was explained by Mr Goh to have been at most 15 years in age. This meant that it would have been planted at the earliest in 2005, by which time the plaintiff would have already removed the Inner Fence. This was unchallenged by the plaintiff at the hearing. 21 In any event, it must be emphasised that the rambutan trees are on the Property and not within the Strip of Land. This was confirmed by Mr Quah in his report. The plaintiff has not provided any authority or any reason whatsoever as to how the mere growth of roots into a neighbouring piece of land suffices to establish factual possession. As stated inPowellat 471 (cited byLee Martin v Wama bte Buang[1994] 2 SLR(R) 467 at [16]), the alleged possessor must have been “dealingwith the land in question as an occupying owner might have been expected to” [emphasis added]. I cannot see how the fact that a tree, planted by the plaintiff within his property, and having some of its roots growing into the defendant’s land, can constitute adverse possession. In my view, to accept the plaintiff’s submission that would be to lower the threshold far below what is required. 22 On the evidence before me, the plaintiff has failed to show that he had constructed the New Fence (and the accompanying works) or planted the rambutan trees before 1 March 1982. The plaintiff has therefore not satisfied the burden of showing that he was in possession of the Strip of Land for 12 continuous years prior to 1 March 1994. 23 Consequently, the defendant remains the owner of the Strip of Land and its counterclaim is allowed.",
        "Conclusion": "24 For the reasons given, I reject the plaintiff’s claim and allow the defendant’s counterclaim. The plaintiff is therefore also ordered to remove the fences and walls surrounding the Strip of Land.  Counsel are to file, within two weeks of this judgment, written submissions on the quantum of costs to be awarded in this case. Lee Seiu KinJudge Yap Peck Choon Patrick and Callie Kwong Yan Li (BR Law Corporation) for the plaintiff; Davinder Singh s/o Amar Singh SC and Tan Ruo Yu (Davinder Singh Chambers LLC) for the defendant.",
        "": "Certified True Copy  Private Secretary to Judge Supreme Court"
    }
}