{
    "case_title": "Ho Pak Kim Realty Co Pte Ltd (in liquidation)vHo Soo Fong and another",
    "ncitation": "[2020] SGHC 193",
    "coram": "Audrey Lim J",
    "sections": {
        "Background": "2 HPK was incorporated in May 1984 with its main activities in civil engineering and real estate development. D1 and D2, who are brothers, are its directors since its incorporation and hold 75% and 25% of HPK’s shares respectively. 3 In January 2006, HPK commenced Suit 36 of 2006 (“Suit 36”) against Revitech Pte Ltd (“Revitech”) over a construction dispute. Revitech filed a counterclaim. Both parties succeeded in their respective claims but Revitech’s counterclaim was eventually assessed by the court to be larger than HPK’s claim.1Foot Note 1×Statement of Claim (Amendment No. 3) (“SOC”) at [8]; Don Ho’s Affidavit of Evidence-in-Chief (“AEIC”) dated 3 January 2020 (“Don Ho’s AEIC”) at [13].By various court decisions which culminated in the assessment of damages award on 29 October 2013, the net effect was that HPK owed Revitech around $1,585,723.08.2Foot Note 2×Don Ho’s AEIC at [13] and [20] and table therein; JUD 584/2013 in Suit 36/2006.In June and July 2017, Revitech served statutory demands on HPK for an outstanding sum principally relating to Suit 36, which by then amounted to some $1.619 million. As HPK failed to pay, Revitech commenced winding up proceedings in October 2017. The winding up order was made on 27 October 2017 and Don Ho was appointed HPK’s liquidator (“the Liquidator”). Thus far, Revitech is the only creditor who has filed a proof of debt.3Foot Note 3×Don Ho’s AEIC at [23].",
        "The Liquidator’s claim": "4 The Defendants’ purported misconduct is summarised as follows.",
        "Failure to submit proper statement of affairs and destruction of plaintiff’s records": "5 D1 had failed to submit proper statement of affairs (“SOA”) in accordance with s 270 of the Companies Act (Cap 50, 2006 Rev Ed) (“CA”) and D2 did not submit any SOA at all. The first SOA that D1 submitted (“1st SOA”) was defective as it was stated to be made as at 31 August 2012 rather than the liquidation date of 27 October 2017, and no supporting documents were provided to substantiate the figures therein.4Foot Note 4×SOC at [25]; Don Ho’s AEIC at [25(e)] and pp 61–72.The Liquidator rejected the 1st SOA and requested for it to be amended. After repeated reminders, D1 submitted a second SOA (“2nd SOA”),which was also incomplete as it was stated to be made as at 31 August 2017 (and not the liquidation date) and D1 had only provided a profit and loss statement and balance sheet as of 31 August 2017 without supporting documents.5Foot Note 5×SOC at [27]; Don Ho’s AEIC at [25(j)]–[25(k)] and pp 85–100.The Liquidator again rejected the 2nd SOA and requested D1 to resubmit another SOA and further complained to the Accounting and Corporate Regularity Authority (“ACRA”), the Official Receiver and the Commercial Affairs Department (“CAD”). D1 then sent a third SOA (“3rd SOA”), which was also incomplete for the same reasons. In particular, it did not provide details of HPK’s largest claim of about $3.5 million, which were debts owing to it.6Foot Note 6×SOC at [30A]; Don Ho’s AEIC at [25(q)] and pp 120–131. 6 D1 and D2 also did not provide the Liquidator any accounts, books or records of HPK, and the Liquidator had no means to verify the details in the SOAs apart from HPK’s 2012 Financial Statement (“2012 Financial Statement”) which D1 had provided. D1 and D2 had a duty to maintain proper books and records of HPK pursuant to s 199 of the CA, but D1 claimed that these documents had been destroyed. Furthermore, HPK did not prepare accounts from 2013 onwards, which coincided with the time the decision in Suit 36 determined damages to be paid effectively by HPK to Revitech.7Foot Note 7×Don Ho’s AEIC at [46].Additionally, D1 had refused to answer interrogatories administered in 2019. As for D2, his responses to the interrogatories were rather bare.8Foot Note 8×Don Ho’s AEIC at [27]; D2’s Answers to Interrogatories dated 12 December 2019. 7 The Defendants’ refusal to provide documents and information and their purported destruction of HPK’s documents were to cover their tracks and frustrate Revitech’s recovery of its debt in Suit 36.9Foot Note 9×SOC at [31]–[32] and [69]; Don Ho’s AEIC at [28], [50] and [55]–[57].",
        "Breach of duties": "76 I turn now to HPK’s claims against the Defendants for breach of duties.",
        "Relief sought": "12 Consequently, HPK seeks to claim S$3,590,587; damages for the Defendants’ breach of duties; and a declaration that they are jointly and severally liable for HPK’s debts.14Foot Note 14×SOC at [75]; 25/2/20 Notes of Evidence (“NE”) at pp 5–7.Although HPK had also pleaded claims in conspiracy and fraudulent trading, Mr Lee (HPK’s counsel) confirmed that HPK would not be pursuing them. Further, whilst the Liquidator also claimed for breach of trust, this claim was not pursued in closing submissions.15Foot Note 15×List of Issues dated 3 March 2020.",
        "First defendant’s case": "13 D1 essentially denied that he had breached any duties owed to HPK. 14 D1 claimed that he could not provide HPK’s documents to the Liquidator as CAD had seized them (“Seizure Event”). As for any remaining documents at HPK’s premises after the Seizure Event, D1 had instructed his workers “to tidy up the place” but they “misunderstood” him and accidentally cleared away the documents belonging to HPK. In any event, there was no reason for him to have kept the discarded documents as they were then more than six years old and were discarded before the present Suit was filed.16Foot Note 16×D1’s AEIC dated 13 January 2020 (“D1’s AEIC”) at [13(f)], [19] and [23]. 15 HPK did not prepare accounts from 2013 onwards as it had no business activity since 2006. At that time, D1 was also very caught up with the litigation in Suit 36 and he neglected the proper running of HPK. Hence, he did not call for an annual general meeting of, or appoint auditors for, HPK. D1 claimed that he had provided the best explanation possible in the SOAs and he remained ready, able and willing to assist the Liquidator and to file any further SOA. D1 claimed that whilst the $3.59m Sum was “justly due” to HPK, he had attempted to claim the sum from the Related Parties (who were the Three Persons) but they refused to pay.17Foot Note 17×D1’s AEIC at [13], [16], [24], [28] and [34]; D1’s Written Submissions dated 13 July 2020 (“D1WS”) at [4].In any event, HPK’s claim for the $3.59m Sum is time-barred.18Foot Note 18×D1’s Defence (Amendment No 2) dated 29 August 2019 (“D1’s Defence”) at [42]. 16 D1 also claimed that HPK owed D2 and him a total of $3,132,356. This comprised directors’ loans to HPK of $2,707,356 and $425,000 which D1 had paid Revitech on HPK’s behalf for Revitech’s costs in 2006 or 2007.19Foot Note 19×D1’s AEIC at [12], [26] and [33].",
        "Second defendant’s case": "17 D2’s case is as follows. Around 1984, D1 approached him to form HPK. D2 said that he was Chinese-educated and not well-versed in English and would not be able to contribute much to HPK. D1 told D2 that he only needed to “use” D2’s name to meet the administrative requirements to start a company and that D2 would not be involved in the day-to-day running of HPK. Subsequently, D2 also allowed D1 to “use” D2’s name to set up Invest Ho Properties Pte Ltd (“IH”) and Ho Tong Seng (“HTS”) in 1986 and 1989 respectively.20Foot Note 20×D2’s AEIC dated 2 January 2020 (“D2’s AEIC”) at [4]–[8]. 18 Although D2 was a shareholder and director of HPK, HTS and IH, he was a “silent” shareholder or partner and left the management of the three companies to D1. D2 worked full time for HPK from its incorporation until 1994; and thereafter worked part-time until around 2002 when he “retired”, although he remained as director. He supervised workers on construction sites and transported them, and saw to the repair of construction equipment.21Foot Note 21×D2’s AEIC at [9]–[13]. 19 D2 left the management of HPK to D1 who made all the business and management decisions and handled all the financial matters. D2 never received nor read any correspondences addressed to HPK, which he would not have understood, and they were all dealt with by D1. D1 was in charge of preparing documents relating to HPK’s business and projects. D2 could not read or write English and relied on D1 to explain the contents of the documents D1 asked him to sign. He signed the documents based on what D1 told him as he “trusted [D1] entirely”. He had acted honestly and reasonably in leaving the management of HPK to D1 and believed that D1 could be relied on to advance HPK’s interests.22Foot Note 22×D2’s AEIC at [14]–[20]; D2’s Supplemental AEIC dated 8 June 2020 (“D2’s Supp AEIC”) at [4]–[5], [13]–[14], and [18]–[24]. 20 D2 did not know about HPK’s dealings with Revitech and the first time he found out about Suit 36 was in 2007 from his relatives who worked in HPK. D2 also did not know about third party debts owed to HPK and he never kept any documents belonging to HPK. Essentially, D2 claimed that he was not aware of his obligations to HPK as he fully trusted D1 who told him that he need not be involved in HPK’s affairs. D1 never told D2 that HPK was insolvent and D2 had no reason to suspect otherwise.23Foot Note 23×D2’s AEIC at [23]–[32] and [37]; D2’s Supp AEIC at [25]–[26]; D2’s Written Submissions dated 13 July 2020 (“D2WS”) at [7] and [13]–[25]. 21 Finally, D2 claimed that he and D1 had provided loans to HPK amounting to $2,707,356 and this sum should be set off against any sums due and owing by them to HPK. D2 also pleaded that HPK’s claim for the $3.59m Sum is time-barred.24Foot Note 24×D2’s AEIC at [38]; D2’s Defence (Amendment No 3) dated 25 March 2020 (“D2’s Defence”) at [32].",
        "Amendment of Statement of Claim": "22 After the close of the Defendants’ case but before the parties filed their written submissions, the Liquidator applied to amend the Statement of Claim (“SOC”) to plead at paragraph 22 that the defendants had a duty “to use reasonable diligence” under s 157(1) of the CA and/or a duty to act “with reasonable diligence” in HPK’s interest under common law (“the Proposed Amendment”). The Defendants objected to the Proposed Amendment. 23 D1 (but not D2) also challenged the matters raised in paragraphs 19 to 19D and 71 to 72 of the SOC (“Stated Paragraphs”). The Stated Paragraphs related to claims for fraudulent trading and conspiracy which had been withdrawn, and D1 argued that HPK could not rely on the matters stated therein for its claim for breach of director’s duties.25Foot Note 25×Minute Sheet dated 17 March 2020.The Liquidator asserted that although he had withdrawn the claims for fraudulent trading and conspiracy, he did not withdraw the factual assertions in the Stated Paragraphs. 24 I agreed with the Liquidator. In any event, this point was not crucial to the parties’ case or prejudicial to the Defendants. The matters in the Stated Paragraphs pertaining to the Defendants’ breach of directors’ duties were replicated elsewhere in the SOC. The Liquidator had also set out his version of events in his affidavit of evidence-in-chief (“AEIC”) to support his claim for breach of directors’ duties and the Defendants had filed their AEICs before the Liquidator withdrew the fraudulent trading and conspiracy claims. In his AEIC, D1 had referred to the Stated Paragraphs26Foot Note 26×D1’s AEIC at [13], [38]–[39].and relied on the same evidence to refute the claim for breach of directors’ duties as he did to refute the claims for fraudulent trading and conspiracy. For completeness, my reasons also applied to D2, who had the opportunity to refute the allegations in the Stated Paragraphs. 25 As for the Proposed Amendment, the court has a wide discretion to allow pleadings to be amended at any stage of the proceedings, including at trial, after judgment, or on appeal. There are two primary considerations in deciding whether to allow an amendment, namely, whether the amendment sought would enable the real question or issue in controversy between the parties to be determined, thereby ensuring the ends of substantive justice are met; and that procedural fairness to the opposing party is maintained:Sheagar s/o T M Veloo v Belfield International (Hong Kong) Ltd[2014] 3 SLR 524 at [117]. 26 I allowed the Proposed Amendment to enable the real issues to be determined. The matters relating to the Proposed Amendment were not new. The Liquidator in his pleadings and evidence had set out the matters which he intended to rely on for his claim against the Defendants for not acting with reasonable diligence as directors of HPK, and he did not seek to introduce new evidence. The cause of action remained that of breach of directors’ duties, although the Proposed Amendment sought to plead a particular duty to use reasonable diligence. 27 The crux of the Liquidator’s claim for breach of duties as directors is that the Defendants should have pursued the Related Parties to recover the debts owing to HPK, particularly in light of the dispute between HPK and Revitech that resulted in a judgment overall in Revitech’s favour. The Liquidator had already pleaded that the Defendants had failed to keep proper records of HPK and refused to provide the identities of and the amounts owing by the Related Parties. The Defendants had something to hide and had impeded the Liquidator’s recovery efforts from the Related Parties in the interests of HPK’s creditors.27Foot Note 27×SOC at [33]–[44] and [57] and [63]; Don Ho’s AEIC at [28].The Liquidator had also pleaded that the Defendants have not explained if the $3.59m Sum had been collected by them orif they made any effort or sufficient effortto do so, and that they had preferred the Related Parties’ interests to the interests of HPK and its creditors and failed to take into account the latter’s interests when HPK was insolvent.28Foot Note 28×SOC at [59]–[60], and [65]–[66].Chief in the Liquidator’s claims is that D1 and D2 took certain steps such as causing the destruction of company records; failing or refusing to file proper SOAs; and failing or refusing to provide particulars of the Related Parties. Alternatively, the Liquidator claimed that the Defendantsdid not doanything or did littleto ensure that sums owing from the Related Parties were collected. 28 As for D2, the Liquidator had averred that, as a director, D2 had duties to oversee the management and operation of HPK and not act as a rubber stamp to D1’s actions.29Foot Note 29×D1’s Defence at [22(r)]; Reply to Defence (Amendment No. 2) dated 13 September 2019 at [15].The Liquidator’s AEIC also set out D2’s lack of diligence as a director,eg, he asserted that D2 could not sit by idly instead of collecting moneys due to HPK; D2 had allowed D1 to do as he pleased with HPK’s affairs; D2 could not wilfully close his eyes to D1’s actions; and D2’s duties as a director were non-delegable.30Foot Note 30×Don Ho’s AEIC at [49], [67] and [69]. 29 Hence, the real issues between the parties had been set out and the Defendants would have known the case they had to meet. There was no element of surprise or prejudice to them. This is not a case in which the issue in the Proposed Amendment was not canvassed in the parties’ evidence or at trial. The matters as pleaded, and subsequently raised in the Liquidator’s AEIC, had set out the issues to be determined, including whether the Defendants had acted with reasonable diligence in HPK’s affairs. The Defendants’ respective defences also remained the same. As such, I had allowed the Proposed Amendment and D2 had filed a supplementary AEIC to deal with the Proposed Amendment. I had also allowed the Defendants to call witnesses and cross-examine the Liquidator. 30 Finally, I add that even without considering the Proposed Amendment (ie, whether the Defendants had acted with reasonable diligence), the final outcome on the Suit would have been the same.",
        "Factual findings": "31 Before determining whether D1 and D2 had breached any duties as directors of HPK, I first make some factual findings.",
        "Identity of Related Parties": "32 The identity of the Related Parties mentioned in the 2012 Financial Statement forms the crux of HPK’s case. The 2012 Financial Statement showed an “amount owing from related parties” to HPK of the $3.59m Sum as at 31 August 2012. Based on HPK’s Balance Sheet as at August 2012 (“2012 Balance Sheet”), the Related Parties were HTS (who owes HPK $3,500,074.29) and IH (who owes HPK $90,513.51) as they share common shareholding and directors with HPK.31Foot Note 31×D1’s AEIC at p 1132; Don Ho’s AEIC at p 142; 25/2/20 NE at pp 19–20, and 28.There is nothing to show that this sum has been repaid to HPK. D1 claimed that the Related Parties are Wee Poh, Revitech and Subramaniam who each respectively owed HPK “about $800,000 to $900,000”, “about $2m” and “about $800,000”.32Foot Note 32×D1WS at [4]; D1’s Defence at [28]; D1’s AEIC at [28]; 25/2/20 NE at pp 28–29. 33 D1 asserts that there is no corroborative evidence of the $3.59m Sum, other than the 2012 Financial Statement, and there is no proof that this financial statement is audited or accurate.33Foot Note 33×D1WS at [12]–[36].I find this assertion to be unmeritorious, given that D1 agreed that the $3.59m Sum is owing to HPK.34Foot Note 34×D1WS at [4] and [87]; 26/2/20 NE at p 85.The 2012 Financial Statement must also be read with the 2012 Balance Sheet. 34 As to the identityof the Related Parties who owe the $3.59m Sum, I find that they are HTS and IH, based on the definition of “related parties” in the 2012 Financial Statement.35Foot Note 35×Don Ho’s AEIC at p 148.D1 and D2 are shareholders of HPK, HTS and IH, and directors of HPK and IH at the material times.They have also been directors of HTS since its incorporation, although D2 resigned as director in January 1996.36Foot Note 36×25/2/20 NE at pp 121–123 and 153; 1AB at p 104; 7AB at pp 1776–1780; Bundle of Additional ACRA Records (dated 27 March 2020).On the other hand, the Three Persons are not related to HPK, as they do not share any common directors or shareholders with HPK.Next, the 2012 Balance Sheet expressly identified the Related Parties as HTS and IH and the amount owing by each of them to HPK which tallied with the $3.59m Sum. The figures in the 2012 Financial Statement and the HPK balance sheets tallied not only for the 2012, but also for the 2011, financial year.37Foot Note 37×Don Ho’s AEIC at pp 141–142; D1’s AEIC at pp 1131–1132 35 I reject D1’s claim that the 2012 Balance Sheet, which showed HTS and IH as the “related parties” owing money to HPK, was a “mistake”. D1 claimed that he did not know if the amount reflected was wrong, and, when asked if IH owed HPK the sum reflected therein, he said “Maybe yes, maybe no. I also don’t know”.38Foot Note 38×25/2/20 NE at pp 150–153.When asked to clarify again, D1 reiterated that he did not know if IH and HTS owed any money; that they could not have owed such a large amount; and that he did not know what was the “mistake” he claimed regarding the accounts because it was the accounts staff who had prepared HPK’s financial statements.39Foot Note 39×26/2/20 NE at pp 85–88.He also claimed that the 2012 Financial Statement was “wrong” or it was “possible it’s wrong” and that he “just [took] the account and … signed”.40Foot Note 40×25/2/20 NE at pp 158–159. 36 I disbelieve D1 in relation to the “mistakes” in the 2012 Balance Sheet and 2012 Financial Statement. He was unable to give a satisfactory answer as to the “mistake” precisely because the accounts spoke for themselves. Indeed, D1 asserted thatheprovided the accounts staff the information and documents pertaining to how much each debtor owed HPK, and the staff would verify the information and prepare the financial statement and balance sheet on that basis.41Foot Note 41×26/2/20 NE at pp 33–34.Hence, D1’s own explanation of the manner by which the financial statement and balance sheet were prepared strongly supported the inference that the figures mentioned therein were genuine. 37 To bolster his claim that IH and HTS were not the Related Parties, D1 claimed that HPK never did any work for them and hence no moneys were ever due from them to HPK, and that the accounts staff who prepared the 2012 Financial Statement “were not aware of the private arrangement” that HPK did not actually do the work.42Foot Note 42×D1WS at [88]–[89]; 26/2/20 NE at pp 35 and 44–48.I find this claim of a “private arrangement” unbelievable and contradicted by the documents which showed that IH and HTS had engaged HPK on various projects, for which there appears to have been partial payments to HPK. I turn to two projects. 38 In 2006, IH engaged HPK to construct cluster houses at Daisy Avenue for some $2.8 million (“Daisy Avenue Project”) by a letter of award dated 28 August 2006 (“Daisy Avenue LOA”).43Foot Note 43×25/2/20 NE at pp 114–117; D1’s AEIC at pp 1087–1089.D1 claimed that HPK never intended to do the construction works for IH, but that the Daisy Avenue LOA was merely to enable HPK to apply for man-year entitlement from the Ministry of Manpower (“MOM”). D1 claimed that it was IH and HTS that completed the Daisy Avenue Project with the workers that HPK had engaged.44Foot Note 44×25/2/20 NE at pp 119 –121; D1WS at [83].D2 claimed he thought that the Daisy Avenue LOA was only to enable HPK to apply for man-year entitlement, as D1 had told him so.45Foot Note 45×D2WS at [18]–[23]; 27/2/20 NE at p 12; 26/2/20 NE at p 10.I disbelieve D1 and D2. (a) On 26 November 2008, D1 filed an affidavit in Suit 36 in response to Revitech’s claim for security for costs against HPK (“D1’s Nov 2008 Affidavit”), wherein he attested that HPK was involved in the Daisy Avenue Project; that HPK “[had] not received full and final payment in respect of the [Daisy Avenue Project]”; and that, “[a]lthough the project has achieved TOP on 8 October 2008, there [was] still a substantial amount of the contract sum that has yet to be certified”.46Foot Note 46×Murthy Abhishek’s AEIC dated 7 January 2020 (“Abhishek’s AEIC”) at pp 65–66; 2AB pp 502–572. (b) Ten payment vouchers that IH had issued were exhibited, and which showed various “part payment for [the Daisy Avenue Project]” made to HPK ranging from $5,000 to $60,000 (and totalling some $327,000).47Foot Note 47×D1’s AEIC at pp 1150–1159.I disbelieve D1’s claim that these were moneys loaned to HPK for it to pay the workers’ levy and Central Provident Fund contribution (“CPF”) (whose workers HPK had applied purportedly for HTS and IH to do the Daisy Avenue Project).48Foot Note 48×25/2/20 NE at pp 125–127.The payment vouchers were clear in their purport, which was to pay HPK for the project. Also, it would be strange for HPK to borrow money from IH to pay workers’ levy and CPF in 10 separate transactions which occurred very close in time between 14 November and 24 December 2007. Further, it is unclear how the workers’ levy and CPF alone amounted to a substantial sum of $327,000. D1 was unable to explain this, first maintaining it was for workers’ levy and CPF, then rather incomprehensibly explained that some of the “loan” was to “give the subcontractor money … to solve all the problem”, and that HPK “[owed] other people money”, then said that it was also used to pay “the previous subcontractor of Revitech”.49Foot Note 49×25/2/20 NE at pp 126–131. 39 Next, in August 2008, HTS awarded a contract to HPK by a letter of award dated 25 August 2008 (“Rosyth LOA”) for the construction of an apartment block at Rosyth Road (“Rosyth Project”). Again, I disbelieve D1’s and D2’s claim that the Rosyth LOA was to enable HPK to apply for manpower but that, in reality, HTS was doing the construction work.50Foot Note 50×D1’s AEIC at pp 1093–1094 and 1098–1102; 25/2/20 NE at pp 139–141; D1WS at [84]; D2WS at [18]–[23].In D1’s Nov 2008 Affidavit, D1 attested that HTS had engaged HPK as the principal subcontractor for the Rosyth Project; that HPK was at that time still involved in the construction of apartments in the Rosyth Project; that a sum of money would be due to HPK; and that there were “significant business activities” between the companies.51Foot Note 51×Abhishek’s AEIC at pp 65–66 (D1’s Nov 2008 Affidavit at [17]–[22]).Before me, D1 denied that he had lied in that affidavit. However, D1’s claim that he “had no authority”; that he was “forced to do it”; and that he had “no alternative” but to say what he said in the affidavit was preposterous.52Foot Note 52×25/2/20 NE at p 143–147. 40 D1’s attempt to distance HPK from any construction works done for any other person/entity can also be seen in relation to the construction of two bungalows at Braddell Road for D1 and D2 (“Braddell Project”), by way of an LOA dated 17 November 2007 from D1 and D2 to HPK (“Braddell LOA”).53Foot Note 53×2AB pp 531–534; 26/2/20 NE at pp 134–136 and 162. (a) Again, I disbelieve D1 that HPK was not involved in the Braddell Project other than to apply for manpower.54Foot Note 54×D1WS at [85].D1’s testimony in court revealed his evasiveness and lies. He first claimed that he built the two bungalowsby himselfand with his brother, then claimed that he engaged a subcontractor but the documents to show who the subcontractor was had been lost. When queried as to the identity of the subcontractor, D1 was evasive and did not answer the question. He then claimed that he had borrowed money from the bank to pay for the construction of the bungalows himself and that he still owed the bank money. When asked for bank documents to support his claim, he claimed that they were lost, and then said that he had paid off the bank. Finally, when queried again as to the main contractor for the Braddell Project, D1 then claimed it was HPK.55Foot Note 55×26/2/20 NE at pp 134–139. (b) D1’s evidence was also contradicted by D2 as, contrary to D1’s claim, D2 did not personally construct the bungalows and he stated that HPK was the main contractor for the Braddell Project.56Foot Note 56×26/2/20 NE at p 163.Also, despite D2 stating that HPK was the main contractor, he then claimed, contradictorily, that he and D1 built the bungalows and they personally hired the subcontractors to do so.57Foot Note 57×27/2/20 NE at p 20. 41 In my view, D1 was trying to spin a story to show that, whilst HPK was the apparent contractor for all the developments, it only provided manpower and the construction works were actually performed by someone else including himself. I also find that D2 was attempting, unconvincingly, to support D1’s position in this regard. 42 As can be seen from above, D1’s claim that the Related Parties were the Three Persons was at odds with the documentary evidence and his earlier stance on the matter. In D1’s Nov 2008 Affidavit, D1 stated that HPK was appointed for the Daisy Avenue and Rosyth Projects by “related companies/persons” whom he mentioned IH and HTS, and stated that there were significant business activities amongst “the related companies of which [HPK] is part”.58Foot Note 58×Abhishek’s AEIC at p 66 (D1’s Nov 2008 Affidavit at [19]–[22]). 43 Finally, I turn to D1’s assertion that the Three Persons were related parties to HPK “because they owe [HPK] money” and HPK did work with them.59Foot Note 59×25/2/20 NE at pp 154–156.I find that this did not make sense and was unsupported by the evidence. (a) To begin with, there were no common shareholders or directors between HPK and the Three Persons. (b) Next, D1’s claim that Revitech is a related party that owed money to HPK was maintained even in his AEIC filed in January 2020 and in court, yet by this time it was clear that Revitech did not owe any money to HPK and it was the other way around. (c) Pertinently, D1 was unable to satisfactorily explain how the amounts allegedly stated to be owing by the Three Persons to HPK – of “about $800,000 to $900,000”, “about $2m” and “about $800,000” – added up to the $3.59m Sum. I find that he was attempting to make up the numbers for the Three Persons to match the $3.59m Sum. (i) D1’s claim that the supporting documents were “lost”, and that the figure of about $800,000 to $900,000 that he mentioned in relation to Wee Poh when he filed his AEIC was from his “memory”,60Foot Note 60×26/2/20 at p 92 and pp 98–100.did not assist his case. (ii) D1’s explanation that Subramaniam still owed HPK about $800,000 was incomprehensible. D1 stated in his AEIC that the contract was for some$1.8millionand Subramaniam did not pay so HPK proceeded to sue, and then he proceeded to say that it was only some$800,000that was owing to HPK in 2004.61Foot Note 61×D1’s AEIC at [28(c)].In court, D1 was unable to explain how $800,000 was owing from a contract which was for $1.8 million, and stated that this was based on HPK’s records.62Foot Note 62×26/2/20 NE at pp 103–107.It is unclear how the sum of $800,000 was based on HPK’s records when D1 claimed the records had been lost or that he did not have them. Then, D1 stated in court that HPK’s claim against Subramaniam was based on a contract between them for which D1 had instituted a suit against him in 2008 (“DC Suit 691”).63Foot Note 63×26/2/20 NE at pp 110–111; D1’s AEIC at pp 508–510 (DC Suit 691/2008).However DC Suit 691 was for an aggregate sum of only about $240,000. (d) Indeed, D1 prevaricated in his testimony in court between claiming that he did not know – or was not sure or could not recall – if anyone owed money to HPK (apart from the Three Persons), and then stating that, based on the records, there are nowfivepersons owing money to HPK, namely HTS, IH and the Three Persons.64Foot Note 64×25/2/20 NE at pp 103–107. 44 In conclusion, I find that D1, being an experienced businessman having (as he himself claimed) worked on about 66 projects from 1984,65Foot Note 65×D1’s AEIC at [21(h)].knew what a “related party” was and that HTS and IH were the Related Parties. I also find that D2 knew that the Related Parties were HTS and IH. D2 was a shareholder and director of all three companies and he knew that IH and HTS had engaged HPK for works (see also [86]–[89] below).",
        "Whether the $3.59m Sum had been repaid": "45 Next, I find that, on balance, the $3.59m Sum has not been repaid by the Related Parties, whether or not they were IH and HTS or the Three Persons. 46 First, I find that the $3.59m Sum has not been repaid by IH and HTS, and this is supported by the documents and D1’s evidence. (a) Section 320 of the CA provides that, where a company is being wound up, its books and papers relevant to its affairs shall, as between the contributories and the company, beprima facieevidence of the truth of the matters recorded therein. The 2012 Financial Statement, signed by D1 and D2, isprima facieevidence of the $3.59m Sum which was at that time owing from the Related Parties. The 2012 Balance Sheet further showed the Related Parties as IH and HTS, and the figure corresponding to the $3.59m Sum. D1 agreed that the financial statements and balance sheets were prepared by HPK’s accounts staff based on supporting or underlying documents.66Foot Note 66×26/2/20 NE at pp 23–24, and 33–34. (b) Whilst D1 had, in his 2nd SOA, exhibited a 2017 trial balance of HPK (“2017 Trial Balance”) that showed Revitech and Subramaniam owing $1,320,000 and $362,000 respectively to HPK, the veracity of this is doubtful and in light of D1’s own evidence (see also [(c)] below). The 2017 Trial Balance was only given to the Liquidator in the 2nd SOA in 2018, and there are no financial records from 2013 (after the 2012 Financial Statement and Balance Sheet) until the 2017 Trial Balance to explain how the figures in the 2017 Trial Balance were derived. The basis for the figures therein is also unclear, particularly when D1 claimed that Subramaniam still owes HPK some$800,00067Foot Note 67×D1’s AEIC at [28(c)]; 26/2/20 NE at pp 68 and 92.which was inconsistent with the 2017 Trial Balance. Also, the 2017 Trial Balance showed Revitech owing $1.32 million to HPK even in 2017, when it was clear that, by 2013, HPK owed Revitech a net sum. In any event, Revitech and Subramaniam are not Related Parties (as I had found), and if D1 claims that they owed money to HPK, then they were also HPK’s debtors which HPK’s directors should have pursued. (c) D1’s own evidence was also inconsistent. He claimed in his AEIC that “no money is owed by any company to HPK”.68Foot Note 68×D1’s AEIC at [33].Then, in court, D1 agreed that the $3.59m Sumisstill owing to HPK, and asserted that the reference in the 2012 Financial Statement regarding the $3.59m Sum being owed by the Related Parties wasnota mistake, but claimed that they were owing by the Three Persons.69Foot Note 69×25/2/20 NE at pp 101–103; 26/2/20 NE at pp 33 and 84–85.By D1’s admission, the $3.59m Sum is still owing to HPK. 47 Second, even if the Related Parties were the Three Persons, D1 had made little or no effort to collect the $3.59m Sum from them, and I disbelieve that he had genuinely attempted to do so but to no avail. D1 stated in his AEIC that he had tried to claim the $3.59m Sum from the Three Persons and they “refused to pay”; but it transpired in cross-examination that D1 did not pursue Wee Poh because it was “no use, they cannot pay”. D1’s further attempt to show that HPK did not pursue Wee Poh because Wee Poh was “gone”, was unbelievable given that it was still in existence.70Foot Note 70×D1’s AEIC at [13(d)]; 26/2/20 NE at pp 123–130.As for Subramaniam, D1 claimed that he commenced DC Suit 691 against him but he then passed away and D1 “did not know what to do and did not proceed with the suit”.71Foot Note 71×D1’s AEIC at 2[(c)].It beggars belief that D1 did not know what to do, given that he was represented by lawyers in that suit, and he did not explain what efforts he made (if any) to find out if he could continue to pursue the claim against Subramaniam’s estate. Further, despite asserting that Subramaniam owed HPK about $800,000, the claim in DC Suit 691 was for only about $240,000. 48 D2’s counsel (Mr Wong) claimed that the 2012 Financial Statement was unreliable as it was “possibly questionable”, given that it mentioned (in the “Notes to the Financial Statements”) HTS as the company instead of HPK.72Foot Note 72×25/2/20 NE at p 54.I reject this contention. The 2012 Financial Statement was signed by D1 and D2 and they have not claimed that it was not HPK’s statement. In any event, D1 admitted that the $3.59m Sum was owing by the Related Parties (albeit he claimed they were the Three Persons). I accept the Liquidator’s explanation that the mention of HTS in the 2012 Financial Statement was likely a typographical error as, reading the document in whole, the references therein were to HPK. 49 Mr Wong also claimed that the 2012 Financial Statement was “questionable” because IH’s 2012 financial statement showed IH owing to “related parties” some $3,176,438 but without specifying who the related parties are.73Foot Note 73×25/2/20 NE at pp 63–64.In closing submissions, D1’s counsel (Mr Dodwell) also highlighted the inconsistency between the 2012 Balance Sheet and IH’s and HTS’s financial documents to cast doubts on the accuracy and reliability of HPK’s 2012 Financial Statement of what was owed to HPK by Related Parties.74Foot Note 74×D1WS at [21]–[36]. 50 IH’s financial statement does not assist the Defendants. If it showed an amount owing to “related parties”, this may support that IH owes money to HPK, since HPK is related to IH. Also, IH’s financial statement (as at 31 December 2012) which showed that it owed $3,176,438 to its related parties,75Foot Note 75×D1’s AEIC at p 1126.did not support the claim that HPK’s 2012 Balance Sheet, which reflected a smaller sum of $90,513.51 as owing from IH to HPK, was unreliable. 51 Likewise, that HTS’s balance sheet at December 2013 showed that it owed HPK some $592,301.98,76Foot Note 76×BAEIC (Vol 2) at pp 1137–1138.different from the amount in the 2012 Balance Sheet (of HPK), was insufficient, in my view, to cast doubt on the 2012 Balance Sheet read with the 2012 Financial Statement. HTS’s balance sheet is not signed or verified by its directors and was produced by D1 who has not explained the figures therein. This must be looked in light of D1’s own admission that the $3.59m Sum is still owing to HPK from the Related Parties, and D1’s own case that HTS does not owe any money to HPK to begin with and HPK did not collect any money from HTS.77Foot Note 77×D1WS at [5]; 25/2/20 NE at p 150.D1’s assertion clearly contradicted both HPK’s 2012 Balance Sheet and HTS’s 2013 balance sheet, both of which showed that HTS owed money to HPK. D1 was a director of all three entities at the material time and would have known of their financial positions. He was the person best able to explain the accounts but did not do so. Pertinently, D1 agreed in court that the $3.59m Sum is still owing to HPK. 52 To sum up, I am satisfied that the Liquidator has shown on balance that there were related party debts comprising the $3.59m Sum that have not been paid to HPK, and that D1 knew of this. I am also satisfied that D2 knew this, for the reasons I will explain below.",
        "D2’s role in HPK and his understanding of English": "53 D1 claimed that D2 was a sleeping director of HPK and D2 “[cannot] do anything, and he [does not] know everything”. D1 also claimed that he managed the affairs of HTS and IH; that D2 did not know what was going on in HTS and IH; and that anything D2 did there was on D1’s instructions.78Foot Note 78×26/2/20 NE at pp 3–5.D2 also signed documents on D1’s request, and both of them had signed the 2012 Financial Statement “blindly”.79Foot Note 79×26/2/20 NE at p 6.Similarly, D2 claimed that he “retired” from HPK in 2002; that he left the management of HPK to D1; and that he signed documents based on what D1 told him (see [18]–[19] above). 54 I disbelieve the Defendants that D2 was a silent partner or “sleeping” director who was not involved in the management or day-to-day running of HPK at all. D2 was clearly not a silent partner as he claimed to have worked full time since HPK’s incorporation until 1994, and part-time thereafter until 2002. The Defendants attempted to give the impression that D2 was uneducated and thus incapable of taking part in the management or running of HPK or of any other entity. But the evidence showed otherwise. (a) D2 prevaricated on the Daisy Avenue LOA, which suggests that he had something to hide. He signed the Daisy Avenue LOA on IH’s behalf (as its director) and signed a Rosyth LOA on HPK’s behalf.80Foot Note 80×D1’s AEIC at pp 1088 and 1099.I disbelieve D1 that he merely told D2 that the two LOAs were to apply for man-year entitlement and D2 signed on that representation.81Foot Note 81×26/2/20 NE at pp 8 and 13.D2 admitted that he was aware of the Daisy Avenue LOA and that IH had appointed HPK as the main contractor. When asked to confirm this, D2 was evasive; then stated he was “not sure”; then said that he did not know what the Daisy Avenue LOA was about; and then said that he knew it was for a “construction project” because D1 had told him so.82Foot Note 82×26/2/20 NE at pp 159–161.When queried further, D2 claimed that he could not recall if he had asked D1 or anyone else who understood English to explain the Daisy Avenue LOA to him, and in re-examination he stated that D1 might have done so but he might have forgotten.83Foot Note 83×27/2/20 NE at pp 3 and 28. (b) D2’s testimony on the Rosyth LOA also further undermined his credibility. Whilst D2 had admitted signing the Rosyth LOA, he claimed that he was not aware that HTS had appointed HPK as the subcontractor for the Rosyth Project. When asked whether he had “signed blind”, he was reluctant to answer the question but subsequently stated that he did not know what he was signing.84Foot Note 84×26/2/20 NE at pp 159–160.Then, he claimed that he could not recall if D1 had explained the document to him or if he had signed it because D1 had told him to.85Foot Note 85×27/2/20 NE at p 3. (c) Likewise, D2 had signed the 2012 Financial Statement. He claimed somewhat inexplicably that he could not recall if he had understood the document when he signed it or whether D1 had explained the document to him then. He then claimed that he signed it because D1 had asked him to, although he did not understand the document, which I disbelieve.86Foot Note 86×27/2/20 NE at pp 4–5.I find D2 to be inconsistent in his account. In his first AEIC, D2 stated that he did not recall “having sight of any of [HPK’s] financial documents during [his] time in the Company”.87Foot Note 87×D2’s AEIC at [17].However, in his supplementary AEIC, D2 stated that he did see HPK’s financial documents, because after the accountants prepared the financial accounts, they showed them to him and explained to him “briefly in general terms because [he] was not trained in finance or accounting”.88Foot Note 88×D2’s Supp AEIC at [12]. (d) Indeed, D2 went as far as to claim that he did not know whether, in a construction project, the main contractor was the one who sourced for subcontractors or liaised with the latter in the contract works.89Foot Note 89×27/2/20 NE at pp 11–12.This is unbelievable given that he was involved in HPK and helped supervise workers on construction sites. However, when asked about the Braddell Project, D2 then stated that, “usually, the main contractor would go and look for the subcontractors to do the job”.90Foot Note 90×27/2/20 NE at p 20. 55 Thus, I disbelieve D2’s portrayal of illiteracy to the point that he could not assist in the management or operations of HPK. When queried about whether he had ever seen invoices, as he had been in the construction industry for many years, D2 claimed that he could not remember and that he did not know what an invoice was,91Foot Note 91×27/2/20 NE at pp 1–2.which was unbelievable. D2 claimed that he could not read or write in English, save for simple words.92Foot Note 92×D2’s AEIC at [5], [13], [16]–[18], [28], and [35].I find that hard to believe given that he had signed documents for HPK and IH; he had signed the 2012 Financial Report; and he understood many questions posed to him in English in court and answered them even before they were interpreted to him in Mandarin. I disbelieve in any event that D2 did not know the purport of documents that he signed, which included HPK’s financial statements or accounts. 56 I also find that D2 attempted to distance himself from the Daisy Avenue and Rosyth Projects and from the 2012 Financial Statement, as they would show that he was involved in HPK’s management in 2006, 2008, and even in 2012 despite claiming to have retired in 2002, and that he knew that the Related Parties owed monies to HPK for works that HPK did for them. If D2 had retired, there was no reason for him to sign the Rosyth LOA and the 2012 Financial Statement, when there werethree other directorsof HPK (in addition to D1 and D2, and who were their siblings)93Foot Note 93×Bundle of Additional ACRA Records (dated 27 March 2020).who could have done so and especially if D2 was as illiterate or incapable as the Defendants made him out to be. 57 Hence, I disbelieve D2 that he had “retired” from HPK in 2002 and did not do any work for HPK thereafter. D2’s explanation that he did not resign as a director despite having “retired” in 2002 because HPK was still operating and Revitech was owing HPK money then,94Foot Note 94×26/2/20 NE at p 148; 27/2/20 NE at pp 22–23.was unconvincing. There was no evidence of Revitech owing HPK money in 2002. Suit 36 was only commenced in 2006, and D2 claimed that he was informedin 2006that Revitech owed HPK money.95Foot Note 95×D2’s AEIC at [23]; 26/2/20 NE at pp 149 and 163.He then claimed that he did not resign in 2002, not because he was still waiting to collect money from Revitech, but that “[he] never thought of all these things”.96Foot Note 96×27/2/20 NE at p 24.Despite his claim that he did not resign in 2002 because HPK was then still operating, D2 did not resign as HPK’s director even in 2006 although he claimed that HPK had stopped operating then.97Foot Note 97×26/2/20 NE at p 150.Also, despite claiming that he did not do any more work for HPK after he retired in 2002, he continued to sign documents such as the LOAs and 2012 Financial Statement. 58 The documentary evidence also supports my finding that D2 did not “retire” in 2002 and that, in fact, he continued to be remunerated. A spreadsheet from HPK (“HPK Spreadsheet”) showed that D2 was paid a salary of $23,352 anddirector’s feesof $50,000 even in 2006. For comparison, D1 was paid $13,092 in salary with $100,000 in director’s fees in 2006. D1 claimed that D2 was not working in 2006, but admitted that D2 was paidmorethan D1 in salary, despite D1 managing the business.98Foot Note 98×26/2/20 NE at pp 37–38; D1’s AEIC at p 1146.In addition, although D1 claimed that D2 “never work” and D2 claimed that he did not do anything after his retirement in 2002,99Foot Note 99×27/2/20 NE at p24.D2 continued to be paid a salaryevery year from 2006 to 2011, including a significant sum of $100,000 in 2010.100Foot Note 100×26/2/20 NE at p 39.D2 was evasive when he was confronted with the HPK Spreadsheet. He claimed he was not sure if he received any salary in 2006, but “maybe have”. He could not remember if he received any salary in 2008 and he was evasive about whether he received any salary in 2009 but later admitted that he had received a salary in 2009 and 2010. Then, D2 changed his evidence and said that “in actual fact, [he] did not take any salary” and “the salaries were meant to be put [into] the CPF accounts to maintain a company record”, but then D2 claimed he was not even sure if the salaries were actually put into the CPF account.101Foot Note 101×26/2/20 NE at pp 152–155. 59 D1 admitted to producing the HPK Spreadsheet for this trial and maintained that it was accurate, but then did an about-turn by saying that the directors did not actually draw any salary but had to “pay tax”.102Foot Note 102×26/2/20 NE at pp 37, 40, 41 and 51.It is unbelievable that HPK’s directors did not draw any salary in those years, especially D1 (who was managing HPK throughout as he claimed), and that the directors would have been prepared to pay tax on sums they never received. 60 Finally, Mr Wong relied on s 157C of the CA, namely, that D2 had relied on D1 and HPK’s employees “in good faith” when he signed the LOAs and the 2012 Financial Statement “and had no knowledge that any inquiry was required or such reliance was unwarranted”.103Foot Note 103×D2WS at [26]–[29].Section 157C(1) essentially provides that a director may, when exercising his powers or performing his duties, rely on information supplied or on expert advice given by various persons such as an employee, a professional adviser or an expert which the director believes on reasonable grounds to be within that person’s competence, or to rely on another director of the company. 61 I do not find s 157C of the CA to assist D2. Section 157C and the facts relied on in support of the provision were not pleaded by D2, and D2 also has not shown how that provision is made out. In any event, s 157C does not affect my findings that D2 was not a silent partner or “sleeping” director who had signed documents blindly; that he was not as illiterate as he made himself out to be; and that he had not merely relied on information provided by D1 and HPK’s employees. I find that D2, being involved in HPK, knew who the Related Parties were, knew about the projects that HPK was involved in particularly with the Related Parties, knew that moneys were owed by them to HPK, and would have been privy to the decisions made by D1 including the decision not to collect the $3.59m Sum (see also [85]–[89] below). 62 In any event, s 157C(2) provides that s 157C(1) applies to a director only if he: (a) acts in good faith; (b) makes proper inquiry where the need for inquiry is indicated by the circumstances; and (c) has no knowledge that such reliance is unwarranted. Mr Wong submits that D2 acted in good faith and that there was no reason for him to doubt D1 as “[D1’s] track record with managing [HPK] had been a good one” and “there is no evidence that there was anything untoward which should have put [D2] on inquiry”. There was also nothing more that D2 could have done to collect the $3.59m Sum and there would have been no difference even if he had taken steps to make inquiries because he did not have “control over the other [party]” –ie,D1 – “to comply”.104Foot Note 104×D2WS at [38]–[40]. 63 I reject these submissions. This was a case in which the circumstances called for further inquiries. The 2012 Financial Statement states clearly that HPK’s only “current asset” is the $3.59m Sum “owing from related parties”, and this formed the bulk of HPK’s “total assets” (of $3,629,332). Yet, it is not even D2’s case that he had made the proper inquiries when he signed the LOAs and the 2012 Financial Statement; D2 claimed that he madenoinquiries at all. Also, it cannot be said that D2 did not have control over D1 to comply or over the outcome, given that D2 is equally a director of HPK. As such, the requirements in s 157C(2) are not made out.",
        "When HPK ceased business activities": "64 D1 attested that there was “no business” or “no business activity” since2006(see [15] above), to explain why HPK had not prepared company accounts from 2013 onwards. I disbelieve D1 and find that HPK continued to maintain business activity until around 2012 or 2013. (a) In D1’s Nov 2008 Affidavit, D1 maintained that HPK was “an active company” and was, in 2008, still involved in the construction of the Braddell and Rosyth Projects for $7,900,000 and that HPK had a “ready revenue stream”.105Foot Note 105×2AB 508 (D1’s 1st Nov 2008 Affidavit at [16]–[18]).There were also numerous invoices and payment vouchers between HPK and IH pertaining to the Daisy Avenue Project up to end 2011, and the project obtained its Temporary Occupation Permit only in October 2008.106Foot Note 106×D1’s AEIC at pp 1150–1191; 2AB 508 (D1’s 1st Nov 2008 Affidavit at [18]). (b) The HPK Spreadsheet showed the Defendants continued to receive salaries and/or director’s fees until 2011/2012. Three other siblings also received remuneration in various years between 2006 and 2012. (c) HPK continued to maintain staff and even prepared accounts and balance sheets of the company until 2012. D1’s explanation that his staff continued to work despite him telling them since 2006 that HPK was “dormant” did not make sense.107Foot Note 107×26/2/20 NE at p 55. (d) Indeed, D1’s pleaded case was that there was “little” business activity since2010, and HPK only reported to ACRA that it was “dormant” since 1 November 2013. Likewise, in D1’s affidavit verifying the SOA of HPK which he affirmed in April 2018, D1 stated that HPK was dormant since 2012 or 2013.108Foot Note 108×D1’s Defence at [12(i)]; 26/2/20 NE at pp 53–54 and 56; D1’s AEIC at p 693. 65 Thus, the evidence showed that HPK was doing business until 2012/2013. Pertinently, D1 reported HPK’s dormancy to ACRA just a few days after the assessment of damages in Suit 36.",
        "Defendants’ refusal to cooperate with the Liquidator": "66 I also find that the Defendants had refused to cooperate with the Liquidator by refusing to provide him with information and details on the Related Parties to enable him to pursue the $3.59m Sum for HPK. In this regard, I considered the conduct of the Defendants below. Failure to file SOA in compliance with s 270 Companies Act 67 I find that the Defendants had failed to comply with s 270 of the CA. D1 had not submitted a proper SOA, such as with relevant particulars of HPK’s creditors and information that the Liquidator required. The three SOAs submitted were internally inconsistent, inconsistent with each other, and inconsistent with D1’s evidence in this Suit. (a) D1 stated in the 1st SOA (dated 28 November 2017) that HPK’s “unsecured claims” were $1,664,000 without giving details. There was no claim for directors’ loans to HPK. D1’s reason for not mentioning any directors’ loans because the Liquidator had informed him that such a claim was time barred was clearly a lie, as the Liquidator did not have any prior discussion with D1 before he submitted the 1st LOA.109Foot Note 109×26/2/20 NE at p 62. (b) In the 2nd SOA (dated 28 February 2018), D1 stated $1,682,000 as HPK’s assets under “sundry debtors” which comprise Revitech ($1,320,000) and Subramaniam ($362,000). But in his AEIC and in court, D1 maintained that Subramaniam still owed HPK around $800,000.110Foot Note 110×D1’s AEIC at [28(c)]; 26/2/20 NE at pp 68 and 92.D1 could not even keep his story straight. It is also unclear how Revitech owed HPK money, given the final outcome in Suit 36. (c) Additionally, in the 2nd SOA, D1 stated $840,714.10 owing by HPK to the Defendants as “unsecured claims/creditors”. However, under the column for “preferential claims” of HPK’s creditors, D1 stated that HPK owed $79,750.65 to HTS, $5,783.69 to IH, $47,066.75 to D1 and $690,113.01 to D2. It is unclear how the figures under “preferential claims” were derived and how HTS and IH werecreditorsof HPK. In particular, the amounts stated to be owed to the Defendants were vastly different from what was stated under “unsecured claims/creditors” as $840,714.10. (d) D1’s manner of filing the 2nd SOA must be seen in the light that, prior to that, the Liquidator had on 7 December 2017 informed him about his incomplete 1st SOA and requested it to be “amended with further input of information and details”.111Foot Note 111×Don Ho’s AEIC at p 80. (e) Then, in the 3rd SOA (dated 27 July 2018), D1 listed HPK’s “sundry debtor” as Subramaniam (for $362,000), and “unsecured claims” against HPK of $2,329,542 comprising Revitech’s claim of $1,488,828.48 and the Defendants’ claim of $840,714.10. Again, despite the Liquidator having asked for supporting documents to substantiate D1’s SOA or a proof of debt of the Defendants’ purported loans to HPK, none was forthcoming.112Foot Note 112×25/2/20 NE at p 90; Don Ho’s AEIC at [25]. 68 D1’s manner in submitting the SOAs showed his nonchalance, lackadaisical attitude, and lack of cooperation with the Liquidator.He also did not bother to verify the information in the SOAs that he submitted. (a) The 1st SOA was bereft of details and stated to be made as at 2012 (instead of the date of winding up), with no supporting documents provided other than the 2012 Financial Statement. This was after the Liquidator had allowed D1 an extension of time to submit the 1st SOA, and after D1’s representative had informed the Liquidator’s representative that “the Statement of Affairs for thelast five (5) yearsof [HPK] is ready”.113Foot Note 113×Don Ho’s AEIC at pp 75 and 78.This was also after the Liquidator had informed D1 repeatedly to surrender HPK’s books and records for the last five years.114Foot Note 114×Don Ho’s AEIC at pp 54, 73 and 76.Despite this, D1 did not explain what had become of them. (b) The 2nd SOA was stated to be made up to August 2017 and not the date of winding up, and included the 2017 Trial Balance, a 2017 balance sheet and a 2017 profit and loss and statement, with the last document reflecting “nil” figures for each line item. Again, no supporting documents were provided. This was despite the Liquidator having reminded D1, on at least two occasions, to submit an SOA “made out to the date of liquidation” and to surrender HPK’s books and records, and had reminded D1 to provide details to his submissions.115Foot Note 115×Don Ho’s AEIC at pp 82, 84 and 101.Likewise, D1 did not explain what had become of the books and records. Pertinently, Revitech was stated in the 2nd SOA to be HPK’sdebtor, despite the decision in Suit 36, and various items in the 2nd SOA were unexplained (see [67(c)] above). (c) Again, the 3rd SOA was submitted without supporting documents, and this was despite D1’s representative having informed the Liquidator that “a fresh set consistent with the requirements of the Liquidators” would be submitted.116Foot Note 116×Don Ho’s AEIC at p 105. 69 Hence, despite repeated reminders from the Liquidator on the requirement to submit a proper SOA with supporting documents and to hand over HPK’s documents, D1 did not comply or explain why he could not do so. When faced with the discrepancies in his SOAs, D1 claimed that the handwritten portions of the 2nd SOA were his, whereas the typed portions were done by someone else; he did not pay attention to what had been filled in the 2nd SOA; and he did not know how the figures mentioned therein were derived. As for the 3rd SOA, D1 claimed that his then lawyers filled in the figures as they liked and he signed the SOA without checking.117Foot Note 117×26/2/20 NE at pp 64–67.If that were true, this clearly showed D1’s nonchalant and lackadaisical attitude towards submitting the SOAs. I find that D1’s credibility left much to be desired. He denied that the 1st and 2nd SOAs were rejected by the Liquidator and claimed that there were no communications between them on the filing and submitting of SOAs,118Foot Note 118×D1’s AEIC at [17].when the correspondences clearly showed otherwise. I also disbelieve D1 that the 3rd SOA was filled in by his lawyers unilaterally and he merely accepted it. 70 As for D2, he did not make any effort to submit or assist in the submission of an SOA, despite the Liquidator having sent a letter to D2 dated 27 October 2017 to do so.119Foot Note 119×Don Ho’s AEIC at p 55.I disbelieve D2 that he never received any written communication from the Liquidator or that, even if he had, he would have forwarded them to D1 “without opening it”.120Foot Note 120×D2’s Defence at [13]; D2’s AEIC at [35].It is unclear how he would have known that correspondence came from the Liquidator if he did not open the letter to check its contents, especially since the letter of 27 October 2017 was sent to his residence (and not to HPK’s office) and could well have had nothing to do with the work or business of HPK. In court, D2 then claimed that he did open letters but that he would not know who the sender was, which I find to be a lie and which contradicted his earlier evidence that he had received the letters, and knew that they were, from the Liquidator.121Foot Note 121×27/2/20 NE at pp 20 and 31. 71 Whilst the Liquidator’s complaint to ACRA against D1 for a breach under s 270(3) of the CA was disposed of in 2018 by a court having ordered a discharge amounting to an acquittal, this did not mean that D1 (or D2) could not be in breach of directors’ duties. In fact, D1 was issued with a stern warning pertaining to the Liquidator’s complaint to CAD.122Foot Note 122×25/2/20 NE at pp 11–12; 7AB at pp 1588–1589. Failure to provide books and records of HPK 72 I also find that D1 had deliberately destroyed the books and records of HPK. D1 stated that, when CAD went to HPK’s premises around 21 December 2016 and seized some documents,123Foot Note 123×25/2/20 NE at pp 132–134; 26/2/20 NE at p 25.HPK’s documents were kept at IH’s premises and, after the Seizure Event, his workers had accidentally discarded them although he only told them to “tidy up the place” (see [14] above). I find D1’s claim that HPK’s remaining documents were “accidentally” discarded and that he did not “believe” in destroying documents124Foot Note 124×D1’s Defence at [12(f)]; D1’s AEIC at [13(f)] and [23].to be a blatant lie. 73 D1 stated in his AEIC that, after the Seizure Event, he instructed his workers totidy up theplace,but theymisunderstoodhim and proceeded to clear away HPK’s documents. However, in court, when D1 was first asked when he told his workers tothrow awaydocuments, he stated that it was on the day of the Seizure Event. D1 then changed his answer and said, “No, no, no.  I never said throw. I said whatever document more than 5,6 year one,all get away.” He then said that he told his workers that “whatever document[s] more than 6 year is no more in use,can just clear it off. That means throw away.” When asked to clarify that he had asked the workers to “throw away” documents from 2010 and older, he answered “Yah, more than 5, 6 year”. D1 also admitted that the documents he asked the workers to throw away included HTS’s and IH’s.125Foot Note 125×25/2/20 NE at pp 132–135.He subsequently reiterated that he had informed his workers that all documents “more than 5 year …all throw away”.126Foot Note 126×26/2/20 NE at pp 25–26.D1 also stated that the documents he wanted to discard were from 2010 and older, and “maybe 2011 also”. When asked whether documents from 2012 would have been kept, he replied “I don’t know.”127Foot Note 127×25/2/20 NE at pp 135–136.Thus, D1’s own testimony showed that he had instructed his workers to discard HPK’s documents. Failure to answer interrogatories and D2’s redaction of HPK’s bank statement 74 The Liquidator had filed interrogatories on 25 November 2019 (“Interrogatories”), which D1 did not answer.128Foot Note 128×26/2/20 NE at p 74; Plaintiff’s Bundle of Documents (“PB”) at pp 28–32.His claim that he did not know whether the Interrogatories had been forwarded to him by his lawyers129Foot Note 129×26/2/20 NE at pp75–76.was not credible. When showed an email in court, evidencing the Interrogatories were emailed to him, D1 accepted that he had received the Interrogatories but stated that he might have accidentally deleted that email as he did not pay attention to it.130Foot Note 130×26/2/20 NE at pp 115–116.I find that D1 had refused to respond to the Interrogatories, and not that he had accidentally deleted the email. 75 As for D2, though he had replied, he was similarly uncooperative with the Liquidator in answering the Interrogatories. Although he claimed not to have any documents pertaining to HPK’s bank accounts as he did not control the accounts, he produced a bank statement for a DBS account (for August 2016) for which he admitted, reluctantly, that he had redacted the particulars of the transactions in that statement. This was after he claimed that he could not recall whether the statement was already in that form (ie, blanked out) when he first received it from the bank and also after he claimed that he was not trying to cover up the bank balance in that statement.131Foot Note 131×27/2/20 at pp NE 16–17.Considering the totality of D2’s conduct, evasiveness, and the surrounding circumstances, I find that D2 was also deliberately uncooperative in responding to the Interrogatories.",
        "Duty to act honestly or bona fide in HPK’s interests and to act for a proper purpose": "77 A director owes a fiduciary duty to actbona fidein the best interests of the company. This common law duty is also statutorily enshrined as the duty to act “honestly” in s 157(1) of the CA:Ho Yew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 (“Ho Yew Kong”) at [134]. The test is “whether an intelligent and honest man in the position of a director of the company concerned, could, in the whole of the existing circumstances, have reasonably believed that the transactions were for the benefit of the company”; and where the transaction is not objectively in the company’s interests the court may draw an inference that the directors were not acting reasonably:Ho Kang Peng v Scintronix Corp Ltd(formerly known as TTL Holdings Ltd)[2014] 3 SLR 329 (“Scintronix”) at [38]. The company also has an interest in having its directors act within their powers and for proper purposes (Scintronixat [40]). 78 I find that, by refusing to collect the $3.59m Sum for HPK, the Defendants had breached the duty to act honestly andbonafidein HPK’s interests. Even in 2012, the $3.59m Sum was due to HPK from the Related Parties, HTS and IH. The Defendants did not pursue HTS and IH for this sum given D1’s evidence that he never collected any money from them because they never did work for HPK. Even if the Related Parties were the Three Persons, the Defendants made little or no effort to pursue them for the debt. No intelligent and honest man in the position of a director of HPK could, in the whole of the existing circumstances, have reasonably believed that refusing to pursue the $3.59m Sum from the Related Parties would have been in HPK’s interest. 79 D1 is a savvy businessman who has worked on numerous projects since 1984. He incorporated HPK, HTS and IH, and was a director in many other companies.132Foot Note 132×D1’s AEIC at [21(o)] read with SOC at [34].D2 was also a director of the three companies for many years and, I had found, was not merely a silent partner or “sleeping” director in HPK. Hence, the Defendants cannot be said not to know that they owed duties as directors and what these duties were. 80 As I have already found, D1 also deliberately destroyed the books and records of HPK, the Defendants refused to provide the Liquidator with the necessary details of the Related Parties, and they refused to cooperate with the Liquidator in submitting SOAs. The Defendants thus obstructed the Liquidator in the pursuit of this sum from the Related Parties for HPK and deliberately acted against HPK’s best interests. As such, they had breached their duty to act honestly andbona fidein HPK’s best interests, and to exercise their powers for a proper purpose. As will be seen below, the Defendants’ decision not to collect the $3.59m Sum from the Related Parties was done for an improper purpose, because this decision was to benefit the Defendants, and not HPK, by keeping the money out of reach of HPK and Revitech.",
        "Duty to consider the interests of the company’s creditors": "81 Directors have a duty to act in the best interests of the company as a whole. When the company is solvent, they owe no duty to the creditors. But when a company is insolvent or in a parlous financial position, directors have a fiduciary duty to take into account the interests of the company’s creditors when making decisions for the company. When a company is insolvent, the creditors’ interests become the dominant factor in what constitutes the benefit of the company as a whole (Liquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 at [48], [51] and [52]). This duty requires directors to ensure that the company’s assets are not dissipated or exploited for their own benefit to the prejudice of the creditors’ interests. 82 The Liquidator claimed that the Defendants had breached their duty to take into account the interests of HPK’s creditors by failing to collect the $3.59m Sum from the Related Parties for HPK, to frustrate Revitech from receiving from HPK what was due to it in Suit 36. This is particularly as the debtors (ie, HTS and IH) were related parties to HPK and D1 and D2 were also shareholders (and directors) of HTS and IH.133Foot Note 133×Don Ho’s AEIC at [46]–[50] and [54]. 83 I find that HPK was already in a parlous financial situation since 2012. (a) The 2012 Financial Statement showed that HPK hadnocash and cash equivalents at the end of 2012, and that HPK’s total equity, minus the $3.59m Sum, was near zero.134Foot Note 134×Don Ho’s AEIC at pp 142 and 144.Indeed, the bulk of HPK’s assets at the time, based on the 2012 Financial Statement, was the $3.59m Sum owed to it. The $3.59m Sum was also HPK’sonlycurrent asset and besides this, HPK had only $38,745 in investments. Hence, the $3.59m Sum was important to HPK’s solvency. D1 testified that HPK had no money “all the while”.135Foot Note 135×25/2/20 NE at pp 103 and 105.D1 thus knew that HPK was in a parlous financial situation even in 2012. (b) In addition, the Defendants knew, by the time the assessment of damages for Suit 36 was completed in October 2013, that HPK owed over $1.5 million to Revitech, in addition to a liability of $2.9 million as at the end 2012 (based on the 2012 Financial Statement136Foot Note 136×Don Ho’s AEIC at p 151.). At that time, the bulk of HPK’s assets was the $3.59m Sum. As the Liquidator pointed out, if HPK did not collect the $3.59m Sum or if the sum was impaired or could not be recovered, HPK would be totally insolvent.137Foot Note 137×25/2/20 NE at p 76. 84 Therefore, HPK was in a parlous financial situation in 2012 and 2013, both prior to and after Suit 36 was completed. Yet, the Defendants completely disregarded the interests of HPK’s creditor, Revitech, by failing to pursue the $3.59m Sum – HPK’s main asset – from the Related Parties; caused the books and records of HPK to be destroyed; and refused to cooperate with the Liquidator causing him to be unable to pursue this sum from the Related Parties. The Defendants had a duty to consider the interests of HPK’s creditor, Revitech, to ensure that HPK’s assets are not dissipated or exploited for their own benefit to the prejudice of Revitech’s interest, and they had breached that duty. 85 The evidence showed that the Defendants did not merely neglect to consider Revitech’s interest, but deliberately refused to collect the $3.59m Sum from the Related Parties (HTS and IH) to keep it from Revitech. Shortly after the net judgment in Suit 36 was given in Revitech’s favour in 2013, the Defendants stopped filing financial statements for HPK (the last financial statement being the 2012 Financial Statement) and preparing HPK’s accounts from 2013, and decided to cease business activity and report HPK’s dormancy to ACRA (see [64] and [65] above). That the Defendants chose to suddenly make HPK “dormant” after Revitech was awarded a substantial sum of damages against HPK leads to the inference that they intended to frustrate Revitech from recovering the judgment sum in Suit 36; especially when they knew that HPK had assets in the form of the $3.59m Sum which it had not collected or pursued against HTS and IH.138Foot Note 138×26/2/20 NE at p 57.It was thus clear that in 2013 (particularly after the court decision in Revitech’s favour), the Defendants decided not to pursue the $3.59m Sum from the Related Parties to Revitech’s prejudice. I find D2 was privy to this. Indeed, whilst claiming that HPK was no longer operating and had ceased all activities since 2006, the directors continued to draw salaries until 2012, whilst letting the debts owed by the Related Parties remain uncollected. 86 I reiterate that I had rejected D2’s defence that he was a silent partner or “sleeping” director of HPK and did not know that HPK owed money to the Related Parties. I find this defence does not assist D2. The case ofDynasty Line Ltd (in liquidation) v Sukamto Sia and another and another appeal[2014] 3 SLR 277 is instructive. Sia, one of two directors of the company, Dynasty, pledged shares acquired by Dynasty (which had not been fully paid for) to various banks as security for loan facilities granted to him and his related parties (“Security Transactions”). The shares were Dynasty’s only assets. Lee, the other director, had signed documents relating to the pledge of about 40.7% of the shares. When the loans under the Security Transactions were defaulted on, the banks sold the shares to satisfy the debt. Dynasty was wound up and the liquidators sued Sia and Lee for breach of fiduciary duties to Dynasty. 87 The Court found that Sia had breached his fiduciary duty by wholly disregarding the interests of Dynasty’s creditors as the Security Transactions imperilled Dynasty’s solvency, yet Sia still pledged the shares as collateral for loans to himself and his related parties to the prejudice of Dynasty’s creditors.  Lee claimed that he did not know that Dynasty had creditors; he was entitled to assume that the shares had been fully paid for; he did not know of the share pledges; and he signed the pledge documents on Sia’s request. The Court rejected that Lee was “completely ignorant” of Dynasty’s affairs as he was an experienced businessman who had been involved in the management of public listed companies and had a 20% share in Dynasty’s profits. It was thus unlikely that Lee had refrained from making any enquires about the value of the shares. Pertinently, Lee’s absence of knowledge of Dynasty’s insolvency was not a defence to his duties to make due inquiry and establish Dynasty’s financial health, and it was incumbent upon Lee to know what assets and liabilities it had. The Court further found that Lee must have been aware of the nature of the pledge documents that he had signed, and would at that point have made the necessary inquiries that would have led him to know that Dynasty was pledging a significant portion of the shares as security for a loan facility to Sia. In signing the pledge documents, the Court found Lee in breach of his fiduciary duties to Dynasty for the same reasons that Sia was liable. 88 In the present case, D2 had signed the 2012 Financial Statement. It is immediately apparent from that statement that the $3.59m Sum was HPK’s only “current assets” and formed the bulk of its “total assets” (of $3,629,332). Hence, it is unbelievable that D2 had signed the 2012 Financial Statement blindly without making any enquiries about what the “amount owing from related parties” was. I had disbelieved D2 that he did not know that there was anyone who owed money to HPK. He was a 25% shareholder in HPK; he knew that HPK was involved in many construction projects; he signed the Daisy Avenue LOA and Rosyth LOA; he was aware that HPK was the main contractor for the Braddell and Daisy Avenue Projects; and he admitted that HPK’s accountants would provide and explain HPK’s accounts to him albeit briefly (see [40(b)], [54] and [55] above). It was equally unbelievable that D2 was unaware of the outcome of Suit 36, and the judgment debt which HPK owed to Revitech. The entirety of the proceedings in Suit 36 took place over seven years (from 2006 to 2013) and D2 attested that he knew of Suit 36 even in 2007. Indeed, D2’s premise that he was a “sleeping” director was also that he had “retired” in about 2002; but the evidence showed that he was still active in HPK and drawing a salary for many years after his purported retirement. 89 In any event, there were many occasions when D2 could have made enquiries that would have led him to discover HPK’s parlous financial position and its failure to collect the $3.59m Sum from the Related Parties. It bears reiterating that D2 was involved in HPK, HTS and IH, he was a director of HPK since its incorporation and a shareholder, and he was also a shareholder and director of HTS and IH. He thus had a direct interest in all three entities. It is thus unbelievable that D2 remained consistently ignorant of HPK’s parlous financial position and HPK’s failure to collect the $3.59m Sum. Instead, I find that D2 knew that the Related Parties were HTS and IH and he was equally privy to the decision not to collect the $3.59m Sum from them to the prejudice of HPK and its creditor, Revitech. 90 As such, I am satisfied that the Defendants breached their fiduciary duty to consider the interests of HPK’s creditors, by failing to pursue the $3.59m Sum to the prejudice of the interests of HPK’s creditor, Revitech, when HPK was in a parlous financial situation.",
        "Duty not to put oneself in a position of conflict": "91 A director also owes, as an important facet of the duty of honesty, a duty of undivided loyalty to his company:Townsing Henry Georgev Jenton Overseas Investment Pte Ltd (in liquidation)[2007] 2 SLR(R) 597 at [60]. This encompasses the “no-profit rule”, which proscribes the director from making a profit out of his fiduciary position, and the “no-conflict rule”, which includes two different aspects that proscribes two different typesof conflicts. The first proscribes the director from putting himself in a position where his own interests and his duty to his principal are in conflict (“no conflict of interest and duty”):Ho Yew Kong([77]supra) at [135];Nordic International Ltd v Morten Innhaug[2017] 3 SLR 957 (“Nordic International”) at [53] and [54]. The second prohibits the director from acting in a situation where there is a conflict between his duties owed to more than one principal (“no conflict of duty and duty”). The no-conflict rule is strict: where a director is found to have placed himself in a position of conflict of interest, he will not be permitted to assert that his action wasbona fideor thought to be in the interests of the company:Goh Chan Peng and others v Beyonics Technology Ltd and another and another appeal[2017] 2 SLR 592 at [47];Nordic Internationalat [53]. 92 I find that the Defendants have breached the no conflict of interest and duty rule. They have a direct interest in refusing to collect the $3.59m Sum from the Related Parties (of whom they are shareholders) and in refusing to assist the Liquidator in pursuing this debt from the Related Parties, because this would keep the $3.59m Sum out of Revitech’s reach such that the Related Parties, and thus the Defendants, can benefit. Yet, the Defendants owe a duty to HPK to ensure that the $3.59m Sum is pursued and collected for HPK. 93 Indeed,D1’s inconsistent explanations for not collecting the $3.59m Sum(eg,claiming that Wee Poh “refused to pay” and then claiming that he did not pursue Wee Poh(see [47] above)) andhislies about the identities of the Related Parties, coupled with D2’s claim of ignorance of HPK’s affairs, showed the Defendants’ deliberate concealment of the Related Parties’ identities and refusal to collect the $3.59m Sum for HPK so that they could benefit. If HTS and IH had repaid the $3.59m Sum to HPK (which is then used to discharge its liabilities to its creditors such as Revitech), D1 and D2 would have lost that sum, given their interests in both the Related Parties and HPK. 94 The Defendants also breached the no conflict of duty and duty rule by prioritising their duty as directors to IH and HTS over their duty as directors to HPK. They owed a duty to HPK to pursue the $3.59m Sum from IH and HTS. As the Defendants are also directors of IH and D1 is still a director of HTS, they (on IH’s and HTS’s behalf) would have resisted the collection of this debt. 95 Hence, I find that the Defendants had put themselves in positions of conflict by preferring the interests of IH and HTS and the Defendants’ own interests over the interests of HPK and its creditors.",
        "Duty to act with reasonable diligence": "96 A director’s duty under s 157(1) of the CA to “use reasonable diligence in the discharge of the duties of his office” encapsulates a director’s separate common law duty to exercise due care, skill and diligence:Ho Yew Kong([77]supra) at [134];Scintronix([77]supra) at [42]. The standard of care and diligence owed by a director “is not fixed” and is a “continuum depending on various factors” such as his role in the company, the type of decision being made, and the size and business of the company. The standard “will not be lowered to accommodate any inadequacies in the individual’s knowledge or experience”; and will instead “be raised if he held himself out to possess or in fact possesses some special knowledge or experience”:Ho Yew Kongat [136]. Ultimately,alldirectors, whether engaged in an executive or non-executive capacity, “are subject to a minimum objective standard of care which entails the obligation to take reasonable steps to place oneself in a position to guide and monitor the management of the company”:Ho Yew Kongat [137]. 97 I had rejected D2’s claims that he did not know about Suit 36 until 2007 or about third party debts owed to HPK, that he was purportedly a “sleeping” director who signed documents blindly on D1’s instructions, and that he was unaware of his obligations to HPK. Even if these claims were true, D2 would still have breached his duty to exercise reasonable diligence or to exercise due care, skill and diligence. He was not a greenhorn to business or to HPK. As a director of HPK, he is subject to a minimum standard of care to take reasonable steps to monitor the management of HPK. This would entail some knowledge of HPK’s business activities and what assets and liabilities it had, even if he did not know the minute details. If D2 had taken some steps to monitor HPK’s management, it would not have gone unnoticed to him that HPK’s main asset even in 2012 was the $3.59m Sum owed by the Related Parties and which remained uncollected, especially given that D2 had signed the 2012 Financial Statement and he knew that HPK was doing construction projects such as for IH.139Foot Note 139×26/2/20 NE at p 159.This must also be looked at in light of the fact that D2 knew around 2007 that HPK had lost a court case against Revitech and D1 had decided to appeal against the decision in Suit 36 – yet D2 purportedly did not make any effort to find out the final outcome of that suit given that it would have affected HPK’s financial situation. 98 Hence, D2 had clearly not discharged the minimum objective standard of care required of him in monitoring the management of HPK, which standard applied to all directors including one engaged in a non-executive capacity. Even inAbdul Ghani bin Tahir v Public Prosecutor[2017] 4 SLR 1153 at [89] and [93] (which involved a criminal prosecution of a director of the company for failure to exercise reasonable diligence under s 157(1) of the CA), the court held that a director cannot simply be a “dummy director” who approves, ignores or is nonchalant as to whether the company is engaging in any illegal activities and the cavalier attitude adopted by the director there made it clear that “he had failed to exercise any diligence, let alone reasonable diligence” as required of him as a director.",
        "Sections 199 and 336 of the Companies Act": "99 The Liquidator also pleaded that the Defendants had breached their duty to maintain proper records, accounts and books of HPK under s 199 (read with ss 338 and 339) of the CA and to deliver them to him under s 336(1) of the CA. However, these are matters which attract a criminal penalty under the CA, and do notper segive rise to a separate cause of action against the Defendants.",
        "Conclusion on breach of duties": "100 In conclusion, I find that both D1 and D2 have, by failing to cause HPK to pursue the $3.59m Sum against the Related Parties especially when HPK was in a parlous financial position, breached their duties as directors of HPK. Whilst D2 claimed that he had merely lent his name as a director to HPK in order to incorporate the company, thus suggesting that he was a “nominee” director or “sleeping” director, and claimed that he was not aware that he had duties as a director,140Foot Note 140×D2’s AEIC at [5]–[6] and [37].all these did not absolve him from liability. The law also does not make a distinction of the fiduciary duties that a nominee director owes to the company (W&P Piling Pte Ltd (in liquidation) v Chew Yin What and others[2007] 4 SLR(R) 218 at [80]). As stated earlier, even if D2 was merely a “sleeping” director (which I did not accept), this would not have absolved him from his duty to exercise due care, skill and diligence.",
        "Remedies": "101 At common law the remedies available to a company for a director’s breach of duty depends on the nature of the duty breached. Not all duties which a director owes to his company are fiduciary duties. The source of all fiduciary duties is the duty of loyalty and fiduciary duties in the classic sense thus encompass the no-profit and no-conflict rules. The duty of care, skill, and diligence is not a fiduciary duty as it is not imposed to exact loyalty from a director:Ho Yew Kong([77]supra) at [135]. Breaches of fiduciary duties can be further divided into custodial and non-custodial breaches. A non-custodial breach does not involve the stewardship of assets already entrusted to the director, while a custodial breach results in the misapplication of the principal’s funds:Sim Poh Ping v Winsta Holding Pte Ltd and another and other appeals[2020] 1 SLR 1199 (“Sim Poh Ping”) at [104]–[106]. 102 The usual remedy for a breach of a director’s non-custodial fiduciary duty would be a compensatory monetary award such as equitable compensation. Where the fiduciary earned profits from the breach, the principal can seek, alternatively, an account of profits:Sim Poh Pingat [105]. As for a custodial breach, the Court of Appeal inSim Poh Ping(at [108]–[109]) noted that there is “good reason for the remedial principles targeting the misapplication of funds to apply to a custodial breach”, as the wrong is done to the principal’s funds placed under the fiduciary’s custody. Further, in a custodial breach of duty, there should be a causal link between the breach and the subject matter of the breach that is sought to be restored:Sim Poh Pingat [114] and [125]–[126]. Where a director breaches his duties to act honestly and use reasonable diligence under s 157(1) of the CA, he is liable to the company for “any profit made by him or for any damage suffered by the company as a result of the breach”: s 157(3)(a). 103 In the present case, the evidence showed that the $3.59m Sum was owed by the Related Parties to HPK even as at 31 August 2012 and D1 agrees to the existence of this debt and that it has not been collected by HPK. The Defendants’ decision not to pursue the $3.59m Sum to keep this out of reach of HPK’s creditor, Revitech, effectively resulted in the dissipation of this asset to the detriment of both HPK and its creditor but to the benefit of the Related Parties and indirectly the Defendants as shareholders of the Related Parties. The Defendants’ failure to cooperate with the Liquidator (such as to provide the books of HPK and to give particulars relating to the Related Parties and the $3.59m Sum) impeded the Liquidator in carrying out his functions to recover HPK’s assets for the creditors’ benefit in the liquidation. The Liquidator attested that he was unable to form a clear picture of the existing assets and liabilities of HPK or to trace the transactions that HPK has been involved in.141Foot Note 141×Don Ho’s AEIC at [27].Indeed, the Defendants continue to hide the true identities of the Related Parties, maintaining that they are the Three Persons. This impeded the Liquidator in his pursuit of HTS and IH for the $3.59m Sum as there was insufficient evidence to enable him to make a considered claim against them (eg, how the debt in the form of the $3.59m Sum is derived and in relation to what services or goods provided by HPK to HTS and IH, and when the debts accrued to HPK). 104 Mr Wong submits that, even if HPK had sought to collect the debts from HTS and IH, it could only have collected a maximum of $90,925.88. D2 submits that HTS’s 2013 Balance Sheet showed it only had $412.37 in cash and no fixed assets, and that it was insolvent and had net liabilities of $1.15 million. Hence, the maximum amount that HPK could have obtained from HTS was $412.37. This, coupled with the $90,513.51 owing by IH to HPK, as reflected in HPK’s 2012 Balance Sheet, would only amount to a total of $90,925.88.142Foot Note 142×D2WS at [109]–[112].I reject this submission. It was neither pleaded in D2’s defence nor attested to by D2 and the plaintiff had no opportunity to respond to this. In any event, this is pure speculation. Apart from HTS’s 2013 Balance Sheet, there is no evidence to show that HTS only had $412.37 in assets or that it was indeed insolvent or what HPK could have recovered from HTS if it had pursued a claim against it. The reliability of HTS’s 2013 Balance Sheet is also doubtful as it is unclear how it was derived. 105 Hence, I am satisfied that HPK has suffered loss equivalent to the $3.59m Sum as a result of the Defendants’ breaches of duties, and which the Defendants are liable to compensate HPK for.",
        "Time bar": "106 The Defendants pleaded that HPK’s claim for the $3.59m Sum is in any event time-barred under ss 6(1)(a), 6(2), 6(7) and/or 22(2) of the Limitation Act (Cap 163, 1996 Rev Ed) (“LA”),ie, the action cannot be brought after six years from the date on which the cause of action accrued. 107 When a limitation defence is raised by the defendant, the plaintiff has to prove that its claim falls within the limitation period. In this regard, it is insufficient for the plaintiff to show that the date of accrual of the cause of action is different from the date alleged by the defendant, and he also has to prove that the date of accrual is within the limitation period:IPP Financial Advisers Pte Ltd v Saimee bin Jumaat and another appeal[2020] SGCA 47 at [37] and [41]. 108 However, it is important to distinguish between a claim by HPK against its debtors (the Related Parties) for the $3.59m Sum, and a claim by HPK against its directors for breaching their duties. The Defendants’pleadeddefence of limitation is on the basis that the causes of action in respect of the $3.59m Sum had accrued in or around 1999 (for the project with Wee Poh), 2004 (for the project for Subramaniam) or 2006 (for the project with Revitech), but the present Suit was commenced only on 12 October 2018.143Foot Note 143×D1’s Defence at [28] and [42]; D2’s Defence at [32]; D1WS at [133]–[144].The Defendants’ pleaded limitation defence is thus based on a cause of action byHPK against its debtors, namely theThree Personsin respect of the $3.59m Sum. In such a case, the date on which the cause of action accrued would be when the $3.59m Sum fell due from the Three Persons. But the Defendants’ pleaded defence in limitation is misconceived and a non-starter, as the Liquidator’s cause of action is against the Defendants for breach of directors’ duties. 109 The Liquidator attested that the cause of action only accrued on 29 October 2013, after the assessment of damages in Suit 36 had been completed, because this was when the Defendants would have “started to abandon [HPK’s] business and benefited the [R]elated [P]arties”. Furthermore, the Defendants’ breaches “could not have been discovered until after the winding up had been commenced”.144Foot Note 144×Don Ho’s AEIC at [62].Where the claim is one of breach of directors’ duties, the date on which the cause of action accrued would be when the breach of the duty can be said to have crystallised. This would be when the Defendants caused HPK not to pursue and collect the $3.59m Sum in disregard of HPK’s and its creditors’ interests so that the Defendants could benefit themselves and the Related Parties,ie, in October 2013 when it became apparent that the outcome in Suit 36 resulted in HPK owing Revitech some $1.5 million. As this Suit was commenced on 12 October 2018, it is thus not time barred. For completeness, the Defendants have not pleaded that there was a time bar in relation to the underlying debt (the $3.59m Sum)vis-à-visIH and HTS, precisely because their defence is that the Related Parties are the Three Persons and the time-bar appliedvis-à-visthe Three Persons.",
        "Defendants’ claims of loans to HPK": "110 The Defendants claimed that HPK owes them $3,132,356 for loans which they made to HPK (see [16] and [21] above) (“the Loan”). They pleaded that the Loan amount was $2,707,356, and which they “have a right to claim” from HPK “and will file their claim in due course”, and that this sum should be set off against any sums which they may be liable to HPK.145Foot Note 145×D1’s Defence at [26]; D2’s Defence at [21]; D1WS at [145]–[146].It should be noted that the Defendants have not filed a counterclaim for the Loan and it is unclear if they had sought leave to do so (under s 262(3) of the CA). 111 In any event, and whether the Loan claimed is $3,132,356 or $2,707,356, I am not satisfied that the Defendants have proved, on balance, that HPK owes them the Loan. First, whilst the 2012 Financial Statement read with the 2012 Balance Sheet would beprima facieevidence that the Defendants were owed $2,707,356 in directors’ loans in 2012, they have not shown, on balance, that there was any sum due to them today and what that amount is. They have not provided any underlying documents (eg,bank statements) to corroborate the Loan when they, as directors of HPK, were in a position to do so. 112 Second, the Defendants’ claim for $3,132,356 is contradicted by their own evidence. D1 in his AEIC stated that HPK owed him and D2 $3,132,356 comprising $2,707,356 as due and payable to D1 and another $425,000 which D1 lent to HPK to pay Revitech’s costs in Suit 36. Then, in the 2nd SOA, he claimed that HPK owed the Defendants $840,714.10.146Foot Note 146×Don Ho’s AEIC at p 87.Despite claiming that the figure of $840,714.10 came from him (when it was again inserted in the 3rd SOA) and maintaining that this sum was correct,147Foot Note 147×26/2/20 NE at pp 71–72.he was unable to show the basis for this amount. As for D2, he stated that he did not even know what loan amount he had extended to HPK, or how the figures of $2,707,356 or $840,714.10 came about, and that the court should ask D1 instead.148Foot Note 148×27/2/20 NE at pp 14–16.In any event, the SOA does not show a breakdown between what is owed to D1 and D2 respectively, and both D1 and D2 did not know how much was purportedly owing by HPK to each of them.149Foot Note 149×26/2/20 NE at p 144. 113 As such, I dismiss the Defendants’ claim pertaining to the Loan or that it should be set off against HPK’s claim against them.",
        "Conclusion": "114 In conclusion, I find that the Defendants had breached their duties to actbona fidein HPK’s interests, that they had exercised their powers for an improper purpose, that they had failed to consider the interests of HPK’s creditors when HPK was in a parlous financial position, and that they had placed themselves in a position of conflict. They had also failed to use reasonable diligence in the discharge of their duties as directors and to exercise due care, skill and diligence. I also find that as a result of the Defendants’ breach of duties and failure to pursue the Related Parties (HTS and IH), HPK had suffered a loss equivalent to $3,590,587, for which they are jointly and severally liable to HPK. 115 I will hear parties on costs. Audrey LimJudge Lee Ming Hui Kelvin and Ong Xin Ying Samantha(WNLEX LLC) for the plaintiff; Alfred Dodwell and Yap Pui Yee (Dodwell & Co LLC) for the first defendant; Ronald Wong Jian Jie and Lopez Stacey Millicent Xue Mei (Covenant Chambers LLC) for the second defendant."
    }
}