{
    "case_title": "Periasamy Ramachandran and another vSathish s/o Rames and another",
    "ncitation": "[2020] SGHCR 8",
    "coram": "Elton Tan Xue Yang AR",
    "sections": {
        "Introduction": "1 A guarantor who discharges the liability of a principal debtor is typically entitled to an indemnity from the principal debtor for the sum paid. If he seeks recourse against his co-guarantors, he will usually obtain equal contribution from each co-guarantor. But these are only the ordinary consequences of an application of the underlying legal and equitable principles, and not invariable outcomes. The matter before me provided an occasion to consider the basis and scope of the oft-invoked rights to an indemnity from a principal debtor and to contribution from co-guarantors, and from that analysis determine the circumstances in which the recovery of an indemnity and contribution may be inappropriate. 2 The plaintiffs guaranteed a loan to a company, which was named as borrower on the loan documents, and mortgaged their home as further security. The first defendant, a director of the company, was a co-guarantor alongside the plaintiffs. The plaintiffs and the company entered into a formal investment agreement, under which the plaintiffs would invest a sum of money into the company and expect a certain monthly rate of return. At or around the same time, the parties allegedly orally agreed that the loan monies would be used by the plaintiffs for the purpose of their investment in the company, and that the monthly pay-outs from the investment would also include the instalments required to service the loan, over and above the agreed investment returns. Those instalments would be paid directly to the lender by the company. 3 When the company defaulted in the repayment of the loan, the lender exercised its rights under the guarantee against the plaintiffs, who then sold their home and used the proceeds to discharge the company’s liability. The plaintiffs now seek a full indemnity from the company as well as contribution from the first defendant for a third of the amount paid to the lender, and have applied for summary judgment for such relief. The company and the first defendant deny that the plaintiffs have any right to an indemnity or to contribution. They rely heavily on the decision of the English Court of Appeal inBerghoff Trading Limited and others v Swinbrook Developments Limited and others[2009] EWCA Civ 413 (“Berghoff”) and argue that there is a parallel between the situation inBerghoffand the present case, with the consequence that the reasoning of Bernard Rix LJ, who gave the principal judgment of the Court of Appeal, may be similarly applied.",
        "Facts": "",
        "The Loan and the Guarantee": "4 The second defendant, Cradle Wealth Solutions Pte Ltd (“Cradle”), is a Singapore-incorporated company that provides consultancy services for start-ups. The first defendant is a director and 75% shareholder of Cradle.1Foot Note 1×Statement of Claim at para 1; Defence (Amendment No. 1) at para 3. 5 By way of a letter of offer dated 29 June 2017 (“the Letter of Offer”) and a term loan agreement dated 30 June 2017 (“the Term Loan Agreement”), Ethoz Capital Limited (“the Lender”) granted Cradle, which was designated in the Term Loan Agreement as the “Borrower”,2Foot Note 2×1st affidavit of Periasamy Ramachandran dated 1 May 2020 (“Plaintiffs’ supporting affidavit”) at p 46.a term loan credit facility for the sum of $1m (“the Loan”). The Loan was to be repaid, together with interest, in 120 monthly instalments of $11,666.67 each, so that the total amount to be paid to the Lender would be $1.4m.3Foot Note 3×Ibid.at pp 37 and 76. 6 Pursuant to the Term Loan Agreement, the Loan was secured in the Lender’s favour in two ways. First, the plaintiffs and the first defendant executed a guarantee dated 30 June 2017 (“the Guarantee”) in favour of the Lender, guaranteeing the due and punctual payment by Cradle of all sums owed by Cradle to the Lender.4Foot Note 4×Ibid.at pp 103-104.Second, the Plaintiffs mortgaged their home at No. 1 Jalan Mesra Singapore 368758 (“the Property”) to the Lender.5Foot Note 5×Ibidat pp 79-102.Both the Letter of Offer and the Term Loan Agreement were signed by the plaintiffs and the first defendant, the latter also signing the documents for and on behalf of Cradle.6Foot Note 6×Ibid.at pp 41–42 and 71-72.It is undisputed that on 26 July 2017, the Lender disbursed the loan via a bank transfer to Cradle.7Foot Note 7×1st affidavit of Muhammed Azri Bin Jamaludeen and Sathish s/o Rames dated 29 July 2020 (“Defendants’ reply affidavit”) at para 16 and p 26.",
        "Alleged default in payment": "7 The subsequent events are disputed. According to the plaintiffs, Cradle defaulted on its repayment obligations. On 17 July 2019, the plaintiffs received a letter of demand from the Lender’s solicitors for payment of $1,144,085.09 as the outstanding amount due to it. The plaintiffs allege that the same letter was received by the defendants who did nothing about it.8Foot Note 8×Statement of Claim at para 6.The plaintiffs proceeded to sell the Property voluntarily for a sum of $2,100,000, with completion taking place on 15 November 2019.9Foot Note 9×Plaintiffs’ supporting affidavit at para 16. 8 On 31 October 2019, the Lender commenced HC/OS 1361/2019 (“OS 1361”) against the plaintiffs and the first defendant. OS 1361 was a mortgage action under Order 83 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) for recovery of the outstanding sum of $1,222,168.81 which included interest as at 30 October 2019, such interest continuing to run until full payment.10Foot Note 10×Plaintiffs’ supporting affidavit at pp 23–24.Before an assistant registrar, the plaintiffs resisted the payment of $319,752.42 which comprised accelerated and default interest. The plaintiffs succeeded in their argument that the default interest clause was an unenforceable penalty, and the assistant registrar held on 3 January 2020 that the outstanding interest payable by the plaintiffs was $230,634, with default interest at the rate of 5.33% per annum running on that sum from 15 November 2019 until payment.11Foot Note 11×Plaintiffs’ supporting affidavit at paras 18–19.It is not disputed that the defendants did not take part in the proceedings.12Foot Note 12×Statement of Claim at para 7; Defence (Amendment No. 1) at para 9. 9 According to the plaintiffs, they paid the Lender and its solicitors a total of $1,151,632.90 out of the proceeds of the sale of the Property, consisting of (a) $912,699.26 as the undisputed principal and interest; (b) $237,317.94 as the sum ordered by the assistant registrar in OS 1361 (inclusive of $5,000 as the Lender’s legal costs in OS 1361); and (c) $1,615.70 as the Lender’s legal costs for the redemption of the mortgage.13Foot Note 13×Statement of Claim at para 9; Plaintiffs’ supporting affidavit at para 22.",
        "The present proceedings": "10 The plaintiffs commenced this suit on 10 February 2020, naming both the first defendant and Cradle as defendants. Apart from the aforementioned sum of $1,151,632.90 paid to the Lender, the plaintiffs additionally claim their legal costs in (a) defending OS 1361, amounting to $11,972.56; and (b) the redemption of the mortgage, amounting to $5,000.14Foot Note 14×Statement of Claim at paras 9(iv) and (v).This amounts to a total claimed sum of $1,168,605.46 (“Claimed Sum”), excluding interest.15Foot Note 15×Statement of Claim at para 10(ii). 11 As against Cradle, the plaintiffs seek an indemnity of the full Claimed Sum on the basis that Cradle was the principal debtor for the Loan. As against the first defendant, the plaintiffs seek a one-third contribution of the Claimed Sum, amounting to $389,535.15, on the basis that the first defendant was a co-guarantor. On 1 May 2020, following the close of pleadings, the plaintiffs filed HC/SUM 1862/2020, which is the present application for summary judgment.",
        "The defendants’ account": "12 The defendants do not dispute the existence or effect of the Term Loan Agreement. However, in their pleadings, they seek to introduce a separate though not necessarily inconsistent account of facts. According to the defendants, the plaintiffs approached Cradle sometime in May 2017, through Cradle’s then-Chief Agency Officer, Mr Prithipkannan s/o Subramaniam (“Mr Prithip”). The plaintiffs wanted to invest in Cradle and informed Cradle that they wished to mortgage the Property to raise funds for their investment.16Foot Note 16×Defence (Amendment No. 1) at para 15. 13 The parties then looked for possible credit and finance companies that were willing to provide a loan to the plaintiffs. One of these was the Lender.17Foot Note 17×Ibid.at paras 16–17.The Lender informed the plaintiffs and Cradle that its policy was not to loan monies to individuals but only to corporate entities. 14 On 28 June 2017, Cradle and the plaintiffs entered into what Cradle described as a “Private Placement Agreement” (“PPA”). This is a written document18Foot Note 18×Defendants’ reply affidavit at pp 12–24.and the plaintiffs do not appear to dispute its existence and effect.19Foot Note 19×Reply (Amendment No. 1) at paras 4(i) and (v).Under the PPA, Cradle agreed to issue 200 preference shares to the plaintiffs in consideration for the plaintiffs placing a sum of $1m (“the Investment Sum”) with Cradle. Cradle would pay the plaintiffs 0.45% of the Investment Sum each month for a total of 48 months (ie,$4,500 monthly). At the end of 48 months, Cradle was to repurchase the 200 preference shares from the plaintiffs.20Foot Note 20×Defence (Amendment No. 1) at para 23. 15 On 30 June 2017, the plaintiffs and Cradle (which was represented by the first defendant and Mr Prithip) attended a meeting with the Lender’s representatives (named as Mr Ang Wee Kiat and Mr Kim Sor Hoon).21Foot Note 21×Ibid.at para 18.At the meeting, the Lender’s representatives suggested that Cradle be the principal applicant for the loan and that the plaintiffs be the guarantors and also place the Property as security for the loan. The Lender’s representatives further informed the parties that one of Cradle’s directors had to be a guarantor.22Foot Note 22×Ibid.at para 19. 16 The proposal was tabled to the then-directors of Cradle, who concluded that the transaction would be to the benefit of Cradle and its shareholders. As such, Cradle agreed to be the principal applicant of the loan.23Foot Note 23×Ibid.at para 20.According to the defendants, the parties then entered into an oral agreement. It is not clear from the defendants’ pleadings when exactly the oral agreement was entered into, or even if there was more than one oral agreement. It was not even clear who exactly were the parties to the oral agreement(s), with the defendants’ pleadings containing two references to oral agreements, the first reference mentioning the plaintiffs and Cradle,24Foot Note 24×Ibid.at para 21.and the second simply mentioning the first plaintiff.25Foot Note 25×Ibid.at para 24.For simplicity, and without making any determination of this matter, I will refer to the agreement(s) as the “Alleged Oral Agreement”. The terms of the Alleged Oral Agreement are as follows:26Foot Note 26×Ibid.at paras 21 and 24–25. (a) Cradle would be the principal applicant of the loan. (b) The plaintiffs would provide a guarantee and place the Property as security for the loan. (c) The first defendant would also provide a guarantee in favour of the Lender. (d) The monies disbursed by the Lender to Cradle would be used as the plaintiffs’ intended investment with Cradle. (e) The plaintiffs would enter into a separate investment agreement with Cradle to reflect the plaintiffs’ investment in Cradle (this agreement appears to be the PPA). (f) The monthly pay-out from the investment agreement would be in two parts: (i) First, the sum owed to the Lender on account of the loan, which was to be repaid at $11,666.67 per month (see [5] above). Cradle would pay the $11,666.67 directly to the Lender and was to keep a record of such payment. (ii) Second, the amount due to the plaintiffs under the investment agreement (ie,$4,500 per month (see [14] above)). This meant that “the total returns realised by the [plaintiffs] on a monthly basis amount to S$16,666.67 [ie,adding $11,666.67 to $4,500]”.27Foot Note 27×Defence (Amendment No. 1) at para 26. 17 The defendants explain that Cradle made monthly payments of $11,666.67 to the Lender and $4,500 to the plaintiffs respectively, up until December 2018 when it ran into financial issues arising from the failure of certain companies to honour their payments to Cradle, as a result of which Cradle was unable to fulfil its own payment obligations.28Foot Note 28×Ibid.at para 29. 18 The plaintiffs deny that they ever entered into the Alleged Oral Agreement. They plead that Cradle was the borrower and principal debtor in respect of the Loan, such that Cradle was “solely responsible to service the loan repayments”. They further claim that Cradle’s “obligations under the PPA [were] separate and independent of [its] obligations as principal debtor”.29Foot Note 29×Reply (Amendment No. 1) at paras 4(ii)–(v).",
        "The parties’ cases": "19 The plaintiffs’ case is straightforward and rests entirely on the Guarantee. As against Cradle, they rely on the well-established principle that a guarantor has a right to be indemnified or reimbursed by the principal debtor after the guarantor makes payment to the creditor: seeRe Aathar Ah Kong Andrew[2020] SGHC 173 (“Aathar Ah Kong Andrew”) at [36]. As against the first defendant, the plaintiffs refer to the equally established principle that a guarantor who pays a creditor is entitled to call upon his co-guarantors to contribute towards the payment: see Poh Chu Chai,Guarantees and Performance Bonds(LexisNexis, 3rd Ed, 2017) at para 12.1.1;Teo Song Kwang(alias Teo Richard) and Another v Vijayasundram Jeyabalan[2005] SGHC 60 (“Teo SongKwang”) at [40];Tng Kay Lim v Wong Fook Yew and Another[2009] SGHC 195 (“Tng KayLim”) at [16]–[19]; andBan Hin Lee Bank Berhad v Gan Boon Wah and Others (Chew Sing Hoong and Others, Third Parties)[1991] SGHC 113. Since the plaintiffs have paid off Cradle’s liability to the Lender in full, they argue that they are now entitled to obtain summary judgment against Cradle and the first defendant for an indemnity and contribution respectively.30Foot Note 30×Plaintiffs’ supplementary submissions at paras 12–15.I accept – and I did not understand the defendants to disagree – that the plaintiffs have established aprima faciecase that calls for the defendants to show cause as to why summary judgment should not be entered. 20 The defendants have three responses. Their first and primary argument, upon which much of the hearing before me centred, is based on the decision of the English Court of Appeal inBerghoff. It suffices at this juncture to state the outcome ofBerghoff, where it was decided that a partnership was not required to indemnify its partners who had guaranteed the repayment of a loan extended to the partnership by a bank. Reasoning fromBerghoff, the defendants argue that Cradle should similarly not be required to indemnify the plaintiffs,31Foot Note 31×Defendants’ written submissions at paras 2–14.and further that it would be “inequitable” for the plaintiffs to seek any contribution from the first defendant.32Foot Note 32×Defence (Amendment No. 1) at para 38. 21 The defendants’ second argument is that if Cradle is found liable to pay the plaintiffs as principal debtor, it is entitled to a set-off of $1m because the plaintiffs were to invest that sum in Cradle under the PPA, and yet the plaintiffs “ha[d] not paid Cradle the said sum”.33Foot Note 33×Ibid.at paras 30–32.Their third and final argument is that the plaintiffs had each signed two documents dated 8 August 2019,34Foot Note 34×Defendants’ reply affidavit at pp 28–29.agreeing not to commence legal action against Cradle for debts owed to the plaintiffs until Cradle had completed its own suits against Cradle’s debtors.35Foot Note 35×Defence (Amendment No.1)at paras 33–36. 22 An additional limb of the defendants’ pleadings was that the first defendant should be discharged as a guarantor because the Property had not been sold at the “best possible price” or its “true market value”, with the implication that the plaintiffs and the Lender had “interfered with [the first defendant’s] rights as a Guarantor and/or caused prejudice to those rights”.36Foot Note 36×Ibid.at paras 39–43.At the hearing, counsel informed me that the defendants would not be pursuing that argument in this application. It will therefore be absent from my consideration.",
        "Analysis": "23 I begin by describing the facts and reasoning inBerghoff, before considering the principles, if any, to be drawn from the decision and their applicability to the present case.",
        "The decision inBerghoff": "24 InBerghoff, the partnership in question (“Caspian”) owned a 51% share in a joint venture company that had rights in a valuable oil field. Caspian had two partners – “Rosserlane” and “Swinbrook” respectively – with Rosserlane owning all but a miniscule part of the equity in Caspian. Caspian, Rosserlane and Swinbrook entered into a loan agreement with a bank, with Caspian described as “Borrower” and the two partners as “Guarantors” and “Obligors”. It was contemplated in the loan agreement and surrounding agreements, which included a “Participation Agreement”, that Rosserlane and Swinbrook would sell their partnership interests in Caspian within a certain period, either by their own motion or by the bank by way of a forced sale. Depending on the price of the sale, the bank would earn an equity upside or participation in various amounts. 25 As it turned out, the bank exercised its right to a forced sale and both Rosserlane and Swinbrook sold their partnership interests to two buyers. The sale proceeds were received under the sale by the bank and were used by it, in accordance with the loan agreement, to discharge all of the obligations of Caspian and the original partners, with a small surplus remaining. 26 Rosserlane then brought a counterclaim against Caspian and the buyers, with its primary contention being that as guarantor of Caspian’s obligations under the loan agreement with the bank, it was entitled to be indemnified by Caspian to the extent that the sale proceeds of its partnership interest in Caspian had been used by the bank to pay off Caspian’s borrowings. Summary judgment was given against Rosserlane in the lower courts on the basis that its counterclaim had no real prospect of success. Rosserlane’s appeal to the Court of Appeal was likewise unsuccessful. 27 Rix LJ, giving the principal judgment of the Court of Appeal, began by recalling the general approach, which was that a guarantor would be entitled to an indemnity from a primary obligor of the amount of the latter’s liability which the guarantor had been called upon to pay: at [24]. He pointed out, however, that the “focus of the whole arrangement” inBerghoffwas the Participation Agreement, which designed the loan in a manner that “enable[d] the partners,ieessentially Rosserlane, to sell their equity in Caspian and thereby repay the bank”. In Rix LJ’s view, the fact that the loan was to be repaid by the partners through the sale proceeds of their partnership interest, and not by Caspian, had important implications on whether the partners had a right to seek reimbursement from Caspian: 34.  … From beginning to end of the arrangement, therefore, and whether the sale were to be voluntary or forced, it was always contemplated and expressly provided for that the loan (and any equity uplift under the Participation Agreement) would be paid out of the proceeds of sale, directly to the bank’s own account.Since the proceeds would come from the sale of Rosserlane’s partnership interest in Caspian, it would follow that the loan would be repaid by Rosserlane, notby Caspian. This therefore is not the normal situation where a guarantor’s right of indemnification or reimbursement from the principal debtor is designed to ensure that the guarantor does not lose out merely from the choice of the creditor as to the source of his payment.This is not the normal situation where as between a principal debtor and his guarantor it is agreed or understood that the debt is only that of the former and that if the guarantor is called upon to pay, he will be reimbursed.This is an entirely special case where, from beginning to end, the funds with which to repay the loan were to come from the partners, ie from Rosserlane. 35.  In such a case it seems to me to be impossible to say, in the absence of express agreement between Caspian and Rosserlane, that Caspian is to have any further liability to reimburse Rosserlane. After all, Rosserlane has an equity interest in Caspian, the value of which has to reflect Caspian’s debt to the bank.It makes no difference to Rosserlane (fiscal and other considerations apart) whether Caspian repays the loan (and ancillary obligations) and Rosserlane receives any remaining equity value, or whether Rosserlane receives the gross value of Caspian, but itself provides the bank with what is owed to it.In these circumstances,it is impossible to believe that it was nevertheless an essential part of this transaction that Rosserlane retained a right to be reimbursed by Caspian. On the contrary, this would have made no sense. There is only one egg, the value of Caspian’s interest in the Shirvan oil field, and that egg is to be used to repay the loan, for the benefit, and not the burden, of all those, such as Rosserlane …, who have an equity interest in, and thus a responsibility to the bank to support the indebtedness of Caspian. [emphasis added in italics and bold italics] 28 Rix LJ went on to conclude that the Participation Agreement “dispose[d] of both ways” in which Rosserlane’s rights were framed, whether in terms of “the complete indemnification of a guarantor or the contribution of a co-obligor”. He explained that“the answer in either case is provided by the parties’ contract.Rosserlane’s partnership interest will be sold, the proceeds will discharge all liabilities to the bank, andthe parties’ agreement as to the disposal of those proceeds is a complete answer to any further suggested cross-liabilities between Caspian and its partners” [emphasis added]: at [37].",
        "The right to an indemnity": "29 Given the defendants’ reliance onBerghoff, it is necessary for me to consider whether the approach inBerghoffis consonant with Singapore law – especially the right of a guarantor to an indemnity following his discharge of the liability owed to the creditor, which is well-established in our jurisprudence – and, if so, whether it is persuasive authority for the purposes of the case before me. Implied agreement to indemnify 30 To the best of my knowledge,Berghoffhas not received consideration by our courts. Notwithstanding that, I find that the English Court of Appeal’s reasoningis consistent with our courts’ approach to the right of guarantors to an indemnity, and that the outcome inBerghoffis best explained having regard to the reasons why such a right may arise. 31 While the right of a guarantor to an indemnity or reimbursement from a principal debtor has been affirmed on multiple occasions (see [19] above), it does not appear that our courts have specifically examined the foundations of that right. However, inAathar Ah Kong Andrew, the High Court referred, as an authority supporting the existence of the right, to the English High Court’s decision inAnson v Anson[1953] 1 WLR 573 (“Anson”). I suggest thatAnsonprovides a useful explanation of the origins of the right. 32 InAnson, a husband opened a bank account in his wife’s name, with the intent that the account be used primarily as a housekeeping account out of which she would pay bills relating to the housekeeping of their matrimonial home. Although the husband paid the wife a substantial allowance, the account became overdrawn. Upon the wife’s request, the husband provided a written guarantee to the bank to cover the overdraft. Following the parties’ divorce, the bank made a written demand for payment of the debit balance of the account, amounting to £500, from the wife, who refused to meet the demand. The bank turned to the husband under the guarantee and the husband duly paid the bank £500. The husband then commenced proceedings against the wife, seeking payment of £500 as money paid under a guarantee entered into at her request. 33 Citing the Court of Appeal’s earlier decision inIn re a Debtor[1937] Ch 156, Pearson J observed that “in the normal case where a guarantee is given by a surety at the request of the principal debtor the right of reimbursement is of acontractual characterand arises from animplied contract” [emphasis added]. This was, he explained, “an agreement between [principal debtor and guarantor], the terms of which can beworked out on ordinary contractual lines,applying the principles with regard to implied terms” [emphasis added]. He went on as follows (at 577): … The intention as between the two of them normally is that the principal debtor shall remain the principal debtor; it is his debt and his obligation and he is expected to pay it. If the surety is called upon to pay and does pay, that for the time being defeats the intention of the parties that the debt shall be and remain that of the principal debtor. In order to put that position right, and to restore it to the position intended between the two of them by their original contractual intention, it is necessary thatthe right of reimbursement should be read into the contract or inferred to be one of the terms of the contract. The essence of the matter is thatthe principal debt is primarily the obligation of the principal debtor, while the liability of the surety is only a secondary liability, andit is the intention as between the two parties to the transaction as well as against the third party that that position should be preserved. That is the explanation on contractual lines of thisimplied term which confers the right of reimbursement. … [emphasis added in italics and bold italics] 34 On the facts of the case, Pearson J held that the wife was liable to reimburse the husband the £500 paid by him to the bank pursuant to the guarantee. He rejected the wife’s argument that the guarantee was provided in the nature of an advancement to her, such that the parties intended that the husband should not have a right to reimbursement. In Pearson J’s view, this was not a case in which “the right of reimbursement might be excluded by express or implied agreement between the parties at the moment when the guarantee is given. That might occur, for instance, in a situation where the husband informed the wife upon furnishing the guarantee to the bank that “the arrangement is entirely for [his] convenience; it will be [his] debt, and [he] will pay it and [the wife] will not be concerned in it”. In such a situation, Pearson J would have found it “very arguable that, working out the position on a contractual basis, there should be read into the implied contract a term that there was to be no right of reimbursement … [T]here would be a term excluding the right of reimbursement”. Returning to the case before him, Pearson J posed the “main question [as] whether such a term [could] be implied”, and found that there could be no such implication on the facts of the case: at 580. 35 Two points can be drawn from the analysis inAnson. First, where a guarantor provides a guarantee at the request of the principal debtor, there will typically be an implied agreement between principal debtor and guarantor that the latter should be indemnified in respect of his liability toward the creditor. In most cases where a guarantee is provided upon such request, the court “will have no difficulty in finding sufficient evidence of an implied agreement by the principal to indemnify the surety. It is a necessary corollary of the principal asking someone to pay his debt, that he promises that he will repay him.”: see Geraldine Andrews and Richard Millett,Law of Guarantees(Sweet & Maxwell, 7th Ed, 2015) (“Andrews& Millett”) at para 10-006. Given the relative rarity of principal debtors and guarantors expressly agreeing that a right of indemnity should be conferred on the latter, the implication of the right is said to be the more common legal basis upon which the right arises: seeAndrews& Millettat para 10-006; and Wayne Courtney, John Phillips and James O’Donovan,The Modern Contract of Guarantee English Edition(Sweet & Maxwell, 3rd Ed, 2016) (“Courtney, Phillips & O’Donovan”) at para 12-001. 36 Second, and notwithstanding the frequency or even the ease with which such a right may be implied,Ansondemonstrates that the parties may expressly or impliedly disavow such a right or exclude it from any express or implied agreement between them. That follows from the fact that the right to an indemnity arises as a matter of contract and is therefore subject to the nuances of what the parties have agreed. Consequently, as Pearson J observed (see [33] above), whether the right exists and how far it extends is to be “worked out on ordinary contractual lines, applying the principles with regard to implied terms”. The right can be “limited or excluded expressly by agreement orimpliedly by thenature of the transaction secured by the guarantee” [emphasis added]: seeCourtney,Phillips & O’Donovanat para 12-015. That was the case inAnson, where the parties had not sought, by the husband’s provision of the guarantee, to “relieve [the wife] of the debt, but to solve the immediate banking emergency”. The intention was that “it being already her debt, it should remain her debt”, with the consequence that “the ordinary position as between surety and principal debtor prevail[ed]”: at 580–581. 37 For the avoidance of doubt, the above only concerns the situation where the guarantor seeks recourse from the principal debtorafterpaying the debt or otherwise discharging the underlying liability. While a guarantor may have rights against the principal debtor evenbeforehe makes payment – for instance, to seekquia timetrelief – such rights arise not by way of the common law but by operation of equity, out of the rationale that “guarantors should be able to remove the cloud hanging over their heads before it starts to rain”: seeCourtney,Phillips & O’Donovanat para 11-115; andAndrews & Millettat para 10-025. RationalisingBerghoff 38 The result inBerghoffis entirely explicable on the basis of the contractual nature of the right to an indemnity, although it was not explicitly analysed in that fashion. Since it was agreed between Rosserlane and Caspian, by way of the Participation Agreement, that the loan would be repaid out of the sale proceeds of Rosserlane’s partnership interest, there could be no room for an implied agreement that Caspian would indemnify Rosserlane for the latter’s payment to the bank. In other words, the contractual arrangements were such as toexcludeany implied right to an indemnity that Rosserlane, as guarantor, might ordinarily have had as against Caspian. From another perspective, such an implied right would have beeninconsistentwith parties’ express agreement as to who would bear the burden of repaying the loan, triggering the well-established prohibition against implication in such circumstances: see Andrew Phang Boon Leong gen ed,The Law of Contract in Singapore(Academy Publishing, 2012) at para 6.054; andLim Kim Yiang and another v Foo Suan Seng and others[1991] 2 SLR(R) 141 at [9]. 39 The ordinary implication of the right to an indemnity was perhaps alluded to in Rix LJ’s reasoning at [34], where he remarked that the arrangements between Rosserlane and Caspian was “not the normal situation where as between a principal debtor and his guarantor it isagreed or understoodthat the debt is only that of the former and that if the guarantor is called upon to pay, he will be reimbursed” [emphasis added]. Given that the right to an indemnity was at least impliedly excluded by the Participation Agreement, it was “impossible to say,in the absence of express agreementbetween Caspian and Rosserlane, that Caspian [was] to have any further liability to reimburse Rosserlane” [emphasis added]: at [34], see also [27] above. 40 It is remarked inAndrews & Millettat para 10-022 that “[t]he right to an indemnity is so integral a part of the bargain between the surety and the principal that a court would hesitate long before concluding that it had been given up. Thus the onus of proving that such an agreement exists may be difficult to discharge.” This is surely so given the incidence of guarantors’ expectations that they will be indemnified against a liability from which they never stood to gain – as Duff J explained in the Canadian case ofDuff v Coughlin(1914) 50 S.C.R. 100 at 109, “[u]nless precluded by agreement express or implied or by some equity or estoppel arising from the conduct of the parties the surety (by reason of the relationship created by the contract of suretyship) is entitled to require the principal debtor to discharge his obligation to the creditor in so far as that may be necessary to relieve the surety. The debtor in other words comes under an obligation to save the surety harmless from any prejudice which might arise from the performance of the principal obligation …”. It is respectfully suggested, however, that given the contractual origins of the right to an indemnity, in a situation where the court is satisfied that the true contractual position between principal debtor and guarantor is that the latter rather than the former was to bear the liabilities, it should not be slow to give effect to the agreement and refuse to imply the right. That may be a “special case” (to recall the words of Rix LJ inBerghoff) in the sense that it may be relatively uncommon, but the application of the contractual approach in such a situation preserves the parties’ bargain and ensures that the burden of the debt ultimately falls on the correct party. As Rix LJ observed at [36], had Caspian been found liable to indemnify Rosserlane, its value to Caspian’s buyers – who were co-defendants in the counterclaim alongside Caspian – would have been reduced by a correlative amount. That would have seriously affected the commercial sensibility of the purchase. ApplyingBerghoff 41 Taking the defendants’ account of the facts as true for present purposes, I find that there is (to use the language ofRitzland Investment Pte Ltd v Grace Management & Consultancy Services Pte Ltd[2014] 2 SLR 1342 at [44]) a “fair or reasonable probability” that there is a relevant parallel toBerghoffwith the result that the parties may be taken to have excluded any implied right on the part of the plaintiffs to seek an indemnity against Cradle, and that would provide a “real orbona fidedefence” for the purposes of this application. I make two observations. 42 First, notwithstanding that Cradle was named as borrower in the Letter of Offer and Term Loan Agreement – just as Caspian was in the loan agreement inBerghoff– there is an alleged agreement between the parties that the Loan would be paid off by the plaintiffs rather than Cradle. That is the Alleged Oral Agreement, under which the parties envisaged that the monthly pay-out to the plaintiffs would consist in part of the monthly instalments due to the Lender, which Cradle would pay directly to the Lender (see [16(f)(i)] above). That parallels the Participation Agreement inBerghoff, which established that Rosserlane would bear the responsibility for repaying the loan (through the sale proceeds of Rosserlane’s partnership interest). In these circumstances, there was no real significance to the fact that Caspian was named as borrower or indeed how the particular payment arrangements would work; as Rix LJ observed at [35], it “ma[de] no difference to Rosserlane (fiscal and other such considerations apart) whether Caspian repays the loan (and ancillary obligations) and Rosserlane receives any remaining equity value, or whether Rosserlane receives the gross value of Caspian, but itself provides the bank with what is owed to it”. In the same vein, nothing turns on the fact that Cradle was named as borrower and would be the party paying out the monthly instalments to the Lender directly. 43 The fact that the bank inBerghoffwas also a party to the Participation Agreement alongside Rosserlane and Caspian is not, in my view, a meaningful distinction, given that Rosserlane’s alleged right to be indemnified by Caspian was a matter between the two of them in relation to which the bank had neither any business nor interest. Nor does any significance lie in the form of the Participation Agreement as written rather than oral, in contrast to the Alleged Oral Agreement. 44 Second, going again by the defendants’ account of the facts, it is noteworthy that the plaintiffs sought the loan in order to make their intended investment, and given the Lender’s policy to lend only to corporate entities and not individuals, would not have been able to obtain the money without Cradle being the named borrower. Since the benefit of the Loan accrued at least in part to the plaintiffs, whom the defendants allege are the parties that instigated the arrangement, it stood to reason that they would also bear the burden of it, and that was precisely the arrangement that parties agreed upon pursuant to the Alleged Oral Agreement, under which part of the monthly pay-out to the plaintiffs would consist of the repayment of the Loan. To paraphrase Rix LJ’s words inBerghoff, this was “not the normal situation where as between a principal debtor and his guarantor it is agreed or understood that the debt is only that of the former and that if the guarantor is called upon to pay, he will be reimbursed. This is an entirely special case where, from beginning to end, the funds with which to repay the loan were to come from the [investors],iefrom [the plaintiffs].” If it were otherwise, and Cradle were regarded as the true debtor, Cradle would in fact be funding the plaintiffs’ investment in itself. 45 It is certainly true that the situations of Caspian and Cradle are not identical; the former was almost wholly owned by Rosserlane and was in essence a vehicle to hold a valuable asset (a share in the oil field), whereas the latter is independent from the plaintiffs and no doubt itself stood to gain from the plaintiffs’ investment. The question is whether these differences warrant different findings on the issue of whether parties expressly or impliedly agreed to exclude the guarantor’s right to an indemnity, and my view is that they do not. Rosserlane’s near complete ownership of Caspian is at most of evidentiary significance, insofar as it suggests that any agreement for an indemnity between them might be unlikely. It does not entail that such an agreement would, or would be likely to, arise in the absence of such a connection between guarantor and principal debtor. As to Cradle’s potential benefit from the Loan as an investment in it, I note that the absence of an implied right to an indemnity does not leave the plaintiffs without recourse. There remains the PPA and indeed the Alleged Oral Agreement itself, both of which contain an agreed allocation of parties’ rights and responsibilities regarding the plaintiffs’ investment, including the plaintiffs’ expected return. But that is a matter under the PPA and beyond my consideration, given that the plaintiffs’ claims in the present proceedings are based solely on the Guarantee. The restitutionary basis 46 Where there is express or implied contract of indemnity, the right to an indemnity may arise on a third basis; namely, as a right of restitution in quasi-contract. As the point was not taken before me, I will consider this alternative avenue only briefly, although it should be noted that there was a passing reference inBerghoffto the restitutionary right (at [24]), andBerghoffhas therefore been considered from this perspective: see Charles Mitchell, Paul Mitchell and Stephen Watterson eds,Goff & Jones on the Law of Unjust Enrichment(Sweet & Maxwell, 9th Ed, 2016) (“Goff &Jones”) at paras 19-01, 19-03 and 20-88; see alsoAnsonat 577–578 for a similar analysis. 47 Three general conditions must be satisfied in order for the guarantor’s restitutionary claim to succeed: first, the payment is made under the compulsion of law, as opposed to a mere moral compulsion; second, the payment was reasonably necessary in the interests of the principal debtor or the guarantor or both of them (and the guarantor must not have officiously exposed himself to make the payment); and third, the payment discharged the liability of the principal debtor who, as between itself and the guarantor, was primarily and ultimately responsible for the debt and consequently obtained the benefit of the payment by an absolute orpro tantodischarge: seeCourtney,Phillips & O’Donovanat para 12-002; andAndrews & Millettat para 10-008. 48 As regards the third requirement, the learned authors ofGoff & Jonesexplain that this means that “some or all of the burden of paying the third party [ie,the creditor] should ultimately be borne by the defendant [ie,the principal debtor]”: at para 20-01. CitingBerghoffamongst other examples, the authors observe that the allocation of responsibility to pay the third party may be the subject of agreement between the claimant and defendant, and that where such agreement exists, “[t]he court will give effect to the agreement by allowing a claim for contribution or reimbursement where some or all of the responsibility for paying the third party was undertaken by the defendant, andby the same token the claim will be disallowed, or reduced, where some or all of this responsibility was undertaken by the claimant” [emphasis added]: at para 20-88. 49 In my view, there is a fair or reasonable probability that the third requirement for the existence of the restitutionary right has not been satisfied in the present case, with the result that reimbursement cannot be sought through this avenue. This is by virtue of the Alleged Oral Agreement, according to which responsibility for repaying the Loan lay with the plaintiffs, as it did with Rosserlane inBerghoff. The alleged oral agreement 50 The above analysis has been conducted on the assumption that the defendants’ account of the facts is true, and in particular, that the Alleged Oral Agreement exists with the terms described by the defendants. I have arrived at the conclusion that if the defendants’ account is taken as true, there is a fair or reasonable probability that the plaintiffs would not be entitled to seek an indemnity as against Cradle, whether on the basis of an implied right or a restitutionary right in quasi-contract, and that would provide a real orbona fidedefence to the plaintiffs’ claim which is based solely on the Guarantee. The existence and terms of the Alleged Oral Agreement, which is a matter of evidence, is therefore a matter of consequence. 51 The plaintiffs’ response is a simple denial that the Alleged Oral Agreement exists.37Foot Note 37×Reply (Amendment No. 1) at para 4(i).They also deny that the “true purpose and intent of the [Loan]” was, as the defendants describe, to fund the plaintiffs’ investment in Cradle, which would be named as borrower because the Lender would otherwise have been unwilling to provide the Loan.38Foot Note 38×Ibid.at para 4.The plaintiffs argue that “[f]or all purposes and intent[s], [Cradle was] the borrower and principal debtor for the loan”, and hence “solely responsible to service the loan repayments”.39Foot Note 39×Ibid.at paras 4(ii) and (iv).Notably, however, the plaintiffs do not deny the existence and terms of the PPA,40Foot Note 40×Ibid.at para 4(i).which is a document showing at minimum that the plaintiffs sought to invest $1m in Cradle. The plaintiffs’ sole comment in relation to the PPA is that “[Cradle’s] obligations under the PPA are separate and independent of their obligations as principal debtor”.41Foot Note 41×Ibid.at para 4(v). 52 I find that the existence and terms of the Alleged Oral Agreement are issues that ought to be tried. In my view, the Alleged Oral Agreement is not inconsistent with the PPA, and it in fact arguably complements the latter agreement by explaining that the debt remained that of the plaintiffs and would be repaid by them (as part of their pay-outs from their investment in Cradle), notwithstanding that Cradle was named as borrower in the loan documents. In such a manner, the plaintiffs would be responsible for funding their own investment. The plaintiffs have argued that they “would [not] have entered into such a huge undertaking based on [an] ‘oral agreement’”.42Foot Note 42×3rd affidavit of Periasamy Ramachandran dated 11 August 2020 (“Plaintiffs’ reply affidavit”) at para 5.That is not an irrelevant contention but it does not, in my judgment, suffice to show that the issue is not triable.",
        "The right to contribution": "53 Even if it were found that the plaintiffs do not have a right to an indemnity against Cradle, it does not follow that the plaintiffs necessarily have no right to seek contribution as against their co-guarantor, the first defendant. That is because a guarantor’s right to contribution from his co-guarantors rests upon a different basis from his right to be indemnified by the principal debtor. I note at this point that this was not an issue that arose inBerghoff, since Rosserlane brought no claim for contribution against its co-guarantor and former partner, Swinbrook. A right in equity 54 It is well-established as a matter of local authority that the right to contribution arises not as a matter of contract but equity: seeTeo Song Kwangat [40];Tng Kay Limat [16]; andWong Chin Juan (trading as SE Automobile Investment) v Absolute Euromotors Pte Ltd and others[2010] SGHC 1 at [10] (citingCraythorne v Swinburne(1807) 33 ER 482 (“Craythorne”)). The rationale for equity’s intervention is succinctly summarised inAndrews & Millettat para 12-001, as follows: The surety’s right of contribution is based upon the equitable principle that the creditor should not be permitted to bring down the burden of the whole debt upon one surety only, and recognises thatthe co-sureties have a common interest and a common burden.It is a right that arises independently of contract, from the essence of the relationship of co-surety itself, and the notion thatthe burdens and the benefits of that position should be shared. Where a surety pays more than his rateable proportion of the debt, he is entitled to exercise this right against his co-surety, because he has discharged their obligations to the creditor. It exists only where the two sureties guarantee the same debt. … [emphasis added] 55 The fact that the right to contribution arises in equity rather than contract is perhaps reflected most clearly in the availability of contribution between co-guarantors who were not even aware of each other’s existence when they provided their guarantees: seeDering v Earl of Winchelsea(1787) 1 Cox 318 (cited inTng Kay Limat [16]). Equity’s approach to contribution 56 I make two further observations, the first of which is uncontroversial and already rooted in local authority, and the second of which does not appear to have hitherto found expression in our jurisprudence but which I accept as persuasive. 57 First, notwithstanding that the right to contribution arises in equity, it may be modified or excluded by express or implied agreement between the co-guarantors. This is an established principle of considerable vintage. In the seminal case ofCraythorne, Lord Eldon LC found it “clear [that] a [co-guarantor] may by contract take himself out of the reach of the principle”, and it was therefore necessary “in every case [to] consider, whether the [defendant co-guarantor] has done so”: at 484. This was precisely the approach adopted by Lee Seiu Kin J inTng Kay Lim, where Lee J recognised the possibility of exclusion or modification of the right by agreement (at [19]), and went on to consider whether certain share transfer agreements entered into between the co-guarantors operated to exclude or modify the right by imposing on the plaintiff co-guarantor an obligation to assume the liabilities of the defendant co-guarantors under the guarantees in question (at [21]). It should also be noted that such an agreement between co-guarantors will not affect the rights of the creditor: seeAndrews & Millettat para 12-012. 58 Second, the proposition that an equitable outcome is the equal contribution of co-guarantors toward the principal’s liability – in other words, the maxim that “equity is equality” – is only a starting point, although it may be the result in most cases. The reason why this is a starting point that may be departed from is that equity requires the court to investigate the substance of the arrangements between the co-guarantors to determine what would be a just apportionment, and that may range from equal contribution amongst co-guarantors to the absence of any obligation to contribute: seeOfficial Trustee in Bankruptcy v Citibank Savings Ltd(1995) 38 NSWLR 116 (“Citibank”). It does not appear that our courts have had occasion to consider the nature of the circumstances in which equity will demand a departure from the position of equal contribution. InTng Kay Lim, Lee J found “nothing in the circumstances, or anything in the evidence before [him], that would move [him]” to relieve the defendant co-guarantors from their liability to contribute, and on the facts, held that each of the five guarantors in question were liable to pay one-fifth of the judgment sum: at [24]. Similarly, inTeo Song Kwang, which involved a bank guarantee signed by three individuals including the plaintiff and defendant, the defendant was held to be liable for one-third of the sum paid by the plaintiff in settlement of the bank’s claim (at [44]); in other words, equal contribution. 59 I respectfully suggest that the judgment of the Supreme Court of New South Wales (Equity Division) inCitibankprovides useful guidance on equity’s approach toward the right of contribution. InCitibank, the plaintiff was the trustee of the bankrupt estate of a husband and his wife (“the couple”). The second defendants were the husband’s parents. The couple and the second defendants mortgaged their respective homes as co-guarantors to secure advances which the first defendant, Citibank, extended to a company through which the couple carried on business. The second defendants had no interest in the advances or the company and had merely acted to assist their son and daughter-in-law. When the business failed, the couple became bankrupt and the plaintiff sold the couple’s home in satisfaction of the debts owed to Citibank. The plaintiff then claimed from the second defendants one-half of the amount paid to Citibank as contribution. 60 In reaching his decision, Bryson J in the Supreme Court of New South Wales embarked upon a comprehensive review of the English and Australian cases. Rather than reproducing Bryson J’s summaries of the various authorities, I have taken the liberty of distilling and organising the following principles from his analysis: (a) When persons fall under a common liability as sureties, and the creditor enforces the remedies available to him in such a manner that a disproportionate burden falls on one of the sureties, that surety has an entitlement in equity to contribution by the others so that, overall, the burden is distributed fairly: at 119F. (b) The starting point for the court’s determination of whether a surety is entitled to contribution from his co-sureties, and if so, how much contribution, is the application of the equitable principle “equity is equality”. That principle assumes that the co-sureties are in positions of equality so that equality of outcome is appropriate. Since equality ordinarily produces a just outcome, the assumption of “equal sharing should not be lightly departed from”: at 119F, 120B and 125C. (c) However, as ever with equitable relief, the court is in search of the “substance of transactions”; specifically, whether the “true relationship” between the parties is as co-sureties with a common liability: at 119G and 120A. That relationship may be ascertained from one or more sources: (i) First, the terms of documents or express arrangements between the parties (such as, inCitibank, a Deed of Supplementary Loan reflecting common liability as between the couple and the second defendants). In “most cases”, the parties’ true relationship may be amply reflected in such agreements: at 119G and 120D. However, because the right to contribution arises from “equitable doctrine and not the actual or imputed agreement of co-sureties” – meaning that the court is ultimately “not enforcing contractual or other legal rights of the parties, but is intervening, as a court of conscience, to secure a just outcome” – the court does not, and should not, limit its consideration to such express documented agreements: at 123D–E and 120C–D. (ii) Second, apart from those recorded in written documents, other agreements (actual or imputed), understandings or common intentions between the parties that they are not in an equal relationship as sureties. These may but need not amount to contract: at 120A and D–E, 122C–D and 124D–E. (iii) Third, an intention held by a co-surety at the time of becoming a surety – irrespective of whether this intention was shared with the other co-sureties – that the parties are not in an equal relationship as sureties: at 120D–E, 122E–F and 124E. (d) The circumstances in which the parties acted, including any representations, conventions or detriments, may make their relationship sufficiently clear without there being any particular arrangement, objective expression of intention, or actual advertence to the subject of contribution. Indeed, cases in which it is most obvious that a co-surety is not entitled to contribution from another may be cases where there is least likely to be express advertence to contribution: at 120A and D–E, and 123F–G. (e) One circumstance in which it may be inequitable to require contribution is where the plaintiff co-surety enjoys the whole benefit of the guarantee (such as the money advanced): at 125D–127A; see also the Supreme Court of Canada’s decision inBater and Anor v Kare[1964] SCR 206 (“Bater”) at 210–211; the English High Court’s decision inDay v Shaw and another[2014] EWHC 36 (Ch) (“Day vShaw”) at [36];Courtney,Phillips & O’Donovanat para 12-212; andGoff & Jonesat para 20-100. This is consistent with the rationale for equity’s intervention described at [54] above; namely, that contribution is founded on the assumption that co-sureties share a common interest and a common burden. When this assumption is displaced, a different conclusion must follow. As Cartwright J explained inBater(citing the notes toLampleigh v Braithwaitin Smith’sLeading Cases, 13th ed, vol 1 at 163), “where two persons are under an obligation to the same performance, though by different instruments, if both share the benefit which forms the consideration, they must divide the burden; if only one gets the benefit he must bear the whole”. (f) In the final analysis, the court’s overriding aim is to “achieve natural justice, and that task involves recognising and giving appropriate weight to the factors which bear upon whether or not the supposed contributories stand in the same position for the purpose of granting contribution as an equitable remedy”: at 127D–F. 61 On the facts ofCitibank, Bryson J found that the couple obtained the benefit of the advance from Citibank through the company, which was the commercial vehicle through which the couple carried on their business affairs; in other words, they were “in a practical position of receiving and having the moneys lent”: at 127G. In contrast, the second defendants “received no tangible advantage, apart from the satisfaction of assisting family members”. In Bryson J’s view, this was the true “substance of the events” and it entailed that there was “simply no obligation in conscience” on the second defendants to contribute: at 127F–G and 136A. The position of the first defendant 62 Applying the principles I have described, I am satisfied that there is a fair or reasonable probability that the first defendant has a real orbona fidedefence, which is that there is some agreement, understanding or common intention between the parties that the first defendant is not in a position of equality with the plaintiffs as co-guarantors with respect to the Loan, with the consequence that it is inequitable for the plaintiffs to seek contribution from the first defendant. 63 Two considerations weigh in favour of this finding. The first is the Alleged Oral Agreement, which reveals that the plaintiffs (and not the first defendant) were to bear responsibility for servicing the Loan through their pay-outs from their investment in Cradle. As I mentioned earlier (see [16] above), beyond the existence of the Alleged Oral Agreement, the identities of the parties to the Alleged Oral Agreement are also unclear. Specifically, it is unclear if the first defendant is a party to the Alleged Oral Agreement. But I do not consider this to be an obstacle given that equity does not require the existence of a formal or even enforceable contract as between the parties (see [60(c)]–[60(d)] above). It would suffice, for instance, that there was an understanding or intention that the first defendant would not be required to contribute to the plaintiffs’ discharge of the liability to repay the Loan, and that appears plausible in light of the fact that the Loan provided the funds for the plaintiffs’ investment. The second consideration, which buttresses the first, is that according to the defendants (see [15] above), the first defendant became a co-guarantor only because of the Lender’s requirement that one of the guarantors of the Loan be a director of Cradle. There is no other indication from the pleadings or the parties’ affidavits as to why or how else the first defendant came to be a co-guarantor of the Loan. In my view, this is an additional circumstance against the equities of requiring the first defendant to contribute to the plaintiffs’ repayment of the Loan. I find that the issues of the identities of the parties to the Alleged Oral Agreement and the reason(s) why the first defendant came to be a co-guarantor of the Loan are matters that cannot be determined on the evidence presently before me and ought to be tried. 64 I have considered whether it might also be inequitable to require the first defendant to contribute because the plaintiffs have enjoyed the “whole benefit” (see [60(e)] above) of the Guarantee, namely, the Loan. But I am hesitant to draw this conclusion given the presence of authority that a shareholder in a company that borrowed the money can be treated as someone who has taken the benefit (or some benefit) of the loan: seeCitibank(citing the second edition ofCourtney, Phillips & O’Donovanat 549); andCourtney, Phillips & O’Donovanat para 12-213. InDay v Shaw, a husband and his wife were co-owners and co-mortgagors of property that was used to secure a loan extended to a company that was run by the husband and their daughter, both of whom also provided a guarantee in respect of the loan. When the company failed and the property was sold, the question before the English High Court (Chancery Division) was whether the husband and the wife were to contribute equally with the result that the balance sale proceeds would be split evenly between them, or if the husband’s share of the proceeds should be applied to exonerate the wife. Morgan J held at [26] that the wife was entitled to be exonerated because the husband and wife were sub-sureties to the husband and daughter who were sureties, just as a surety is entitled to be indemnified by a principal debtor. More relevantly for present purposes, Morgan J went on to consider whether, if the husband and wife had not been sub-sureties, his conclusion would have been the same. He found as persuasive the case ofCitibank, drawing from it the principle that “where one co-surety took the whole benefit of the loan, then it may be equitable to require that surety to indemnify his co-sureties”, as well as the subsidiary principle that “a court could regard a shareholder in the company which had borrowed the money as someone who had taken the benefit of the loan” (at [36]). This led Morgan J to inquire into whether the wife had any shareholding in the company and could thus be regarded as having benefited from the loan, and therefore liable to contribute. On the evidence before him, and “not because of any uncertainty as to the legal principles to be applied”, Morgan J found that the question of ownership and control of the company was insufficiently explored in the trial below and hence the argument could not be made (at [43]). 65 In the present case, I find it impossible to say that Cradle – and hence the first defendant, which was a 75% shareholder of Cradle (see [4] above) – did not stand to benefit from the arrangements, which facilitated the plaintiffs’ investment of a considerable sum in it. It is also inarguable that Cradle intended to use the Investment Sum to its own benefit (even if the plaintiffs were also to benefit from their investment). I am therefore doubtful that the first defendant would be able to avail himself of an argument of this nature.",
        "Remaining issues": "66 Given my decision on the defendants’ primary submission that the plaintiffs have neither any contractual right of indemnity as against Cradle nor a right in equity to contribution from the first defendant, it will not be necessary for me to consider the defendants’ alternative submissions. As earlier described (see [21] above), these are the defendants’ arguments that (a) Cradle is entitled to a set-off on the basis of the PPA; and (b) the plaintiffs have agreed not to sue Cradle as evidenced by two documents dated 8 August 2019 that are allegedly signed by the plaintiffs. Notably, these two arguments only appear to furnish defences for Cradle and not also for the first defendant. 67 Had I been required to decide those alternative arguments, I would have had difficulty accepting the defendants’ argument on set-off. To begin, the basis of the claimed set-off – whether legal, equitable, or some other basis – was never made clear to me. More importantly, I cannot see how it can realistically be maintained that the plaintiffs “have not paid Cradle” the Investment Sum (see [21] above).43Foot Note 43×Defence (Amendment No. 1) at para 31.Indeed, the defendants themselves have expressly accepted and in fact provided evidence, by way of a statement of account, that the Lender disbursed the monies to Cradle on 26 July 2017 (see [6] above). When I put this to counsel for the defendants, counsel explained that it “[came] back down to the first issue, that it is unfair if [Cradle] is required to pay the indemnity”. This is accordingly a matter to be decided within that context and not through the frame of a set-off, which I consider to be unsustainable. 68 As to the documents dated 8 August 2019, the plaintiffs vehemently deny that they ever signed such documents, and submit in the alternative that the documents have been taken out of context as they were prepared to support Cradle’s application for judicial management in HC/OS 1170/2019 (which has since been dismissed) and to resist a winding-up application in HC/CWU 147/2019 (which has been withdrawn).44Foot Note 44×Reply (Amendment No. 1) at paras 6(i) and (iii).They claim that the signatures on the documents were forged and have filed a police report accordingly.45Foot Note 45×Plaintiffs’ reply affidavit at para 4 and pp113–116.If the issue had called for determination, I would have found that it involved matters to be tried. It is impossible to determine on the evidence before me the authenticity of the signatures on the documents and, if they were indeed signed by the plaintiffs, the purpose(s) for which the documents had been so prepared and signed.",
        "Conclusion": "69 For the foregoing reasons, I find that while the plaintiffs have established aprima faciecase for judgment, the defendants have demonstrated the existence of a fair or reasonable probability of a real orbona fidedefence, and therefore ought to be granted unconditional leave to defend: seeAkfel Commodities Turkey Holding Anonim Sirketi v Townsend, Adam[2019] 2 SLR 412 at [41] and [50]. 70 I will hear the parties on costs. Elton Tan Xue YangAssistant Registrar Bernard Sahagar s/o Tanggavelu (Lee Bon Leong & Co.) for the plaintiffs; Muhammad Hariz Bin Badrul Jamali Tahir and Muhammed Riyach Bin Hussain Omar (H C Law Practice) for the defendants.",
        "": ""
    }
}