{
    "case_title": "Seto Wei Meng (suing as the administrator of the estateand on behalf of the dependants of Yeong Soek Mun, deceased) and anothervFoo Chee Boon Edward and others(Singapore General Hospital Pte Ltd, third party)",
    "ncitation": "[2020] SGHC 260",
    "coram": "Choo Han Teck J",
    "sections": {
        "The fatal liposuction and fat transfer procedure": "6 Mandy Yeong had two liposuction procedures prior to the third and fatal one. The first was performed by one Dr Teo in 29 July 2010 and the second by Dr Foo on 18 July 2011. The procedure in 2010, which was just for liposuction, resulted in hollows and surface irregularities in Mandy Yeong’s thigh regions. Unhappy with the outcome of the first procedure, Mandy Yeong underwent the second procedure in 2011. This included both a liposuction as well as a fat transfer, which involved taking the fat from Mandy Yeong’s ‘flanks’ to fill in her thigh region. 7 Mandy Yeong was still dissatisfied with the result of the second procedure and so she consulted Dr Foo on 28 May 2013. During the consultation, they discussed the liposuction and fat transfer procedure performed by Dr Foo on Mandy Yeong in 2011, and Mandy Yeong’s unhappiness with the uneven appearance of her thighs. Dr Foo recommended a further liposuction and fat transfer procedure to correct that. As with the 2011 procedure, this would involve a liposuction (Mandy Yeong’s third since 2013) and a fat transfer procedure (Mandy Yeong’s second since 2013) whereby the fat from Mandy Yeong’s abdomen region would be transferred into her thighs to correct the unevenness. The procedure was initially scheduled for 14 June 2013 but was postponed, by mutual agreement, to 28 June 2013. 8 As recounted at [3] above, Mandy Yeong died on 28 June 2013 after the fatal procedure. The cause of death, which is not disputed by the parties, was found by the State Coroner to be “pulmonary fat embolism due to liposuction”. When fat embolism manifests in clinical symptoms such as inflammation, multi-organ dysfunction and neurological changes, it is known as fat embolism syndrome. Here, the parties and experts are in agreement that Mandy Yeong suffered from the fulminant form of fat embolism syndrome, which they say is rarer and has an earlier onset and a poorer prognosis that ordinary fat embolism syndrome. Fat embolism syndrome may not be fatal if appropriate medical attention is given, but fulminant fat embolism is almost always fatal. The causes and consequences of this will be addressed shortly. 9 I first address the question of Dr Foo’s liability for negligence. This comprises several issues, which I shall now consider in turn.",
        "Informed consent": "10 Dr Foo claims that he discussed the 28 June 2013 procedure with Mandy Yeong on 28 May 2013. He says that the risks of the procedure, including fat embolism, had been told to her on that day. Despite his claim, his notes of that consultation made no reference to any such advice. They barely covered half a page and half of that concerned the surgical and medical fees. That, together with a set of standard consent forms that Mandy Yeong signed on 28 June 2018, formed the documentary evidence relating to Mandy Yeong’s consent to the procedure. The plaintiffs allege that those forms were handed to Mandy Yeong by the Clinic’s staff. Although Dr Foo maintains that he personally discussed the content of the forms with Mandy Yeong, there is no documentary evidence supporting his claim. The forms were signed by Mandy Yeong, but no signature appears where Dr Foo’s signature ought to be. 11 When a patient does not give her consent, the procedure for which consent was lacking would result in the tort of trespass by the doctor, and that is actionable even without proof of damage. Where consent is given but without adequate advice, the wrong would be that of negligence, and the patient has to prove the absent advice and convince the court that had she known of such advice, she would not have consented to the procedure. The difference between liability in trespass and liability in negligence lies mainly in the damages to be awarded, but as we shall see, this is not an issue that I need to deal with. 12 In this case, there is a passage in the consent forms signed by Mandy Yeong that refers to “serious complications”. The passage reads as follows: … Although serious complications have been reported to be associated with fat transfer procedures, these are very rare. Such conditions include, but are not limited to: Fat embolism (a piece of fat may find its way into the blood stream and result in a serious life-threatening condition), stroke, meningitis (inflammation of the brain), serious infection, blindness or loss of vision, or death. 13 The form goes on with a passage on ‘pulmonary complications’ in which the patient is told: … Pulmonary (lung and breathing) complications may occur from both blood clots (pulmonary emboli) and a partial collapse of the lungs after general anaesthesia. Should either of these complications occur, you may require hospitalization and additional treatment. Pulmonary emboli can be life threatening or fatal in some circumstances. Fat embolism syndrome occurs when fat droplets are trapped in the lungs. This is a very rare and possibly fatal complication of fat transfer procedure. 14 I am of the view that the passages above would have sufficiently discharged a surgeon’s duty to obtain informed consent for the procedure that Mandy Yeong went through, had the patient’s attention been drawn to them. 15 In some cases, the patient may be able to understand the above passages herself if they were given to her to read just before entering into consultation with the doctor. In such cases, it may be enough for the doctor to ask if she had read and understood the passages, and if she had questions to ask of them. But this was not the situation in this case. Although Mandy Yeong would certainly have understood those passages, given her education and profession, there is some dispute as to whether she had been given sufficient time to read them. Dr Foo’s position is that he had given Mandy Yeong the consent forms when he met her on 28 May 2013 and that she had kept them for a month and returned them, duly signed, on the date of the procedure. Conversely, the plaintiffs contend that the consent forms were only provided to Mandy Yeong on the day of the procedure. Aside from Dr Foo, no other witness was able to provide a first-hand account of this matter. The signature of the person who signed as a witness did not have a name to match. 16 The evidence is not all that clear, but I incline to accept that the forms were not given in circumstances in which Mandy Yeong was likely to have read and understood them in detail. It is unlikely that Mandy Yeong would only have signed the consent forms on 28 June 2013 if she had managed to read them beforehand. Dr Foo’s way of informing Mandy Yeong about the dangers of her procedure was therefore not sufficient. The absence of any notes by Dr Foo fortifies my belief that the danger of fat embolism was not adequately brought to Mandy Yeong’s attention before the procedure on 28 June 2013. There is also nothing to indicate that Mandy Yeong had been apprised of such risks at any time prior to 28 June 2013,egduring her consultation with Dr Foo on 28 May 2013, or before undergoing her 2010 and 2011 procedures. 17 But the question remains as to whether Mandy Yeong would have gone ahead with the procedure on 28 June 2013 even if she had read the two passages above, or if Dr Foo had told her what the two passages above stated. Given the rare nature of the risk of pulmonary embolism, Mandy Yeong’s personal experience with liposuction, as well as her desire to correct the unevenness of her thighs, it would seem that she would be more likely to accept the risk and proceed. Thus, although Dr Foo had not in my view adequately drawn Mandy Yeong’s attention to the risk of fat embolism, as well as the increased risk of fat embolism in the case of a repeat liposuction with a fat transfer, he cannot be said to have caused her death in this regard because there is no direct evidence that she would not have consented otherwise; and the inference from what evidence there is indicates that she would probably have gone ahead nonetheless. As mentioned above, I accept that there is no evidence that Mandy Yeong was properly advised before her 2010 and 2011 procedures, but the fact remains that she went through those with no mishap other than her dissatisfaction with the aesthetic results. 18 The Clinic was given a special licence on certain conditions to perform liposuctions. The conditions that were in force at the material time are the Specific Licensing Conditions for Special Care Service (Ambulatory Service – Liposuction) (“Specific Licensing Conditions”) implemented under reg 37 read with the Third Schedule of the Private Hospitals and Medical Clinics Regulations (Cap 248, Rg 1, 2002 Rev Ed). One of these conditions was specifically expressed to be the requirement to inform the patient of the implications and increased difficulties of a repeat procedure, and to document this advice in the doctor’s medical record. But for the reasons earlier stated, I think that Mandy Yeong would probably have gone ahead even if she had been told of the increased risk. The risk was increased, but, according to the experts, statistically, it would still be considered rare. I shall now turn to consider the next major issue – Dr Foo’s alleged negligence in managing Mandy Yeong’s postoperative condition. Negligence in managing postoperative condition 19 The procedure in question on 28 June 2013 commenced at 12 noon and ended about 2pm. There was some uncertainty as to whether it ended at 2pm exactly or at 1.50pm, but I am of the view that this ten minutes’ difference is not crucial to my judgment. What is important is that the parties are in agreement that Mandy Yeong’s oxygen saturation level had fallen from 100% at 2pm to 72% at 2.05pm. From that point, evidence from those present is neither clear nor consistent, but the picture that emerges is that of total mayhem and confusion. Nobody seemed to know what to do. 20 Apart from Dr Foo, three other doctors were present. One of them, Dr Shenthilkumar s/o Sritharan Naidu (“Dr Shenthilkumar”), was only there briefly at two moments — once about 2.30pm and once shortly before Mandy Yeong collapsed — as he had been tending to his own patients. He did not have much to say but what seems clear to me from his testimony is that when he walked into Dr Foo’s surgery about 2.30pm, he had perceived that an emergency was underway. It was obvious to him that an oxygen saturation of 92%, which was what he noted at that time, was not good. Dr Shenthilkumar alleges that he had at that point advised Dr Foo to call an ambulance. This sensible advice was unfortunately either not heard or disregarded by Dr Foo. 21 In addition to Dr Shenthilkumar, there was a Dr Gerard Ee who responded to the nurses’ call and other than helping to set up a drip, he did nothing else. Finally, there was Dr Chow who was attending to his own patients until slightly after 2pm when he was called to Dr Foo’s operating theatre to help Dr Foo. By the accounts of both Dr Foo and Dr Chow, they were trying all sorts of procedures to help raise Mandy Yeong’s oxygen saturation level. These included using venti-mask and, subsequently, a bag-mask and valve to supply air with higher oxygen content to Mandy Yeong. According to both of them, Dr Foo was also simultaneously trying to diagnose the cause of the drop in Mandy Yeong’s oxygen saturation level throughout the 40 to 45 minutes before the ambulance was called. 22 Contrary to Dr Foo’s claim that the patient’s condition was improving, the documentary evidence — in the form of a photograph of a monitor screen depicting Mandy Yeong’s vital signs — shows that Mandy’s oxygen saturation level was moving up and down because of Dr Foo’s and Dr Chow’s efforts, but even then, with oxygen being given, the blood oxygen level did not go above 92%. That is an emergency. There is evidence that that was more than one photograph of the vital signs monitor. One was by a phone camera belonging to one of the nurses. The other was by Dr Chow’s small digital camera that was not produced at trial although it seems that photographs might have been taken with that camera. 23 Another point of contention is the question, when did Mandy Yeong suffer a collapse? This is because in a hospital context, the moment a patient collapse, “Code Blue” — the universal hospital signal for activating emergency resuscitation — would be sounded. Furthermore, the time between the patient’s collapse and the calling of the ambulance is especially significant in cases involving fat embolism where time is of the essence. When exactly Mandy Yeong collapsed was disputed, not only because there were differing accounts of what had transpired at the Clinic but also because the experts differed in their definitions of a “collapse”. It is not necessary for me to comment on these differences here. Suffice to say that the general consensus is that Mandy Yeong had suffered a “collapse” in the sense of a cardiovascular collapse at around 2.45pm, and an ambulance was called at 2.53pm. The ambulance arrived at the building in which the Clinic was situated in just four minutes and was tending to Mandy Yeong by 3.01pm. 24 Dr Foo explained in his testimony in court that it was medical procedure to gradually exclude one condition after another until the correct diagnosis was made. However, there is no reason why Dr Foo could not have called an ambulance while simultaneously diagnosing the problem. Furthermore, there is no evidence that fat embolism was eventually diagnosed by Dr Foo. And the fact that it took him 45 to 50 minutes to realise that he could not figure out what was going on compels me to infer that Dr Foo was not adequately trained for such surgeries. Liposuction and related procedures are generally considered the specialty of plastic and reconstructive surgeons, and Dr Foo is a general surgeon who only attended several overseas liposuction courses and internships before practising liposuction. This is not to say, however, that general surgeons should never be allowed to carry out liposuction surgeries. It is ultimately for the health authorities and the medical profession to sort out these boundaries. 25 One of the experts that Dr Foo called to give evidence on his behalf was Dr Sung Ki-Su (“Dr Sung”) from South Korea, a country well known for its cosmetic surgery expertise, but it was remarkable that Dr Sung himself had no formal qualifications as a plastic and reconstructive surgeon. He was, on his own admission, a psychiatrist who had taken up some training in liposuction, and then began to practise liposuction on his own. I find little comfort or confidence in accepting Dr Sung’s testimony. On the other hand, where medical safety and protocol are concerned, as well as where the incident and consequences of fat embolism are concerned, the plaintiffs’ witnesses, Dr Boey Wah Keong (“Dr Boey”) and A/Prof Lim Thiam Chye (“A/Prof Lim”) gave evidence supported not just by their professional degrees and experience, but also the soundness of their testimony to the lay ear. 26 Not only do I think that the written literature about serious complications such as fat embolism was not explained to Mandy Yeong, it seems to me that Dr Foo himself was notau faitwith that potential problem and was unable to recognise its possibility when Mandy Yeong collapsed on his table. That accounted for the 45 to 50 minutes of frantic exploration in the vain hope that something might help to improve her oxygen saturation levels. Dr Boey’s view was that Dr Foo did not consider fat embolism syndrome as a possible cause of Mandy Yeong’s collapse. I accept that opinion because had Dr Foo considered the possibility of fat embolism syndrome, he would have called the ambulance straightaway. Dr Foo testified that he did not do so because he was trying to diagnose what the cause was. The only problem with this evidence is that he could not explain why he took so long. He testified that fat embolism syndrome was only diagnosed after the autopsy, but he forgets that at the material point, he was not undertaking an autopsy but merely considering the possible causes of the collapse. With the information that he had then, which we now know at trial, fat embolism syndrome should occupy top ranking once the other possible causes such as a heart attack, a cerebrovascular accident, or a massive haemorrhage to the abdomen had been ruled out; and these can be ruled out very quickly. 27 The plaintiffs’ experts’ testimonies on this point were simple and direct — when a doctor finds himself unable to handle the situation, he must call for help. In this case, calling for help is an understatement — Dr Foo should have pounded the alarm; and should have done so much earlier. 28 Initially, Dr Foo deflected liability by blaming the doctors at the SGH’s A&E department for not adequately tending to Mandy Yeong, and in particular, for not recommending the use of extracorporeal membrane oxygenation (“ECMO”), a device that supplements normal resuscitation known as cardiopulmonary resuscitation (“CPR”). The doctors from the SGH explained that the patient was already in such bad condition when she arrived that they did not think ECMO would have helped. In the event, Dr Foo discontinued his third-party claim against the SGH and its doctors midway through the trial. 29 What we are left with from all the doctors who testified on behalf of the plaintiffs and the SGH, is that Mandy Yeong had arrived at the A&E department of the SGH too late to be saved. The general consensus among the doctors was that had the ambulance been summoned when Mandy Yeong’s blood oxygen fell with no ostensible cause, she would have had a chance of surviving the fat embolism. 30 Mr Sreenivasan, counsel for Dr Foo, submitted that Mandy Yeong had fulminant fat embolism, a condition that was almost invariably fatal. Dr Boey is of the opinion that the fulminant form of fat embolism syndrome “has an earlier onset (within 1–2 hours) and a more pronounced respiratory and a haemodynamic deterioration”, when compared with the non-fulminant variety of fat embolism syndrome. This fits exactly into Mandy Yeong’s situation. The operation had ended about 2pm. Within five minutes Mandy Yeong was heard coughing and making a gurgling sound. Her oxygen saturation fell to 72% when her blood pressure and heart rate were stable. In spite of assisted ventilation, her oxygen saturation fluctuated and never rose above 92%. 31 To say that fulminant embolism is almost always deadly is not wrong, but misses three important points. First, fulminant fat embolism is a diagnosis made after the event. One of Dr Foo’s witnesses, Dr Sriram Shankar, explained that the word “fulminant” merely denotes that the patient was in a high-risk situation. The medical literature also defines “fulminant” as a descriptor for an event or process that occurs suddenly and is severe to the point of lethality. Most patients who die from fat embolism are diagnosed as having the fulminant form. It is possible that had they survived, their condition would merely have been classified as fat embolism. 32 Second, the non-fulminant form of fat embolism occurs most commonly in patients with traumatic injuries involving lower limb fractures (egfractures of the thigh or shin bones), and in this form, it takes a longer time for the symptoms to appear. Fulminant fat embolism is much rarer and for this to occur, it would mean that a large volume of fat had suddenly been introduced into the patient’s bloodstream. One plausible cause of this is the direct injection of fat into the bloodstream. I agree with Ms Kuah, counsel for the plaintiffs, that the fact that Mandy Yeong’s symptoms appeared so swiftly after the procedure indicates that the cause arose during the procedure. This is relevant to the plaintiffs’ claims that the procedure was carried out negligently, which will be discussed later. 33 Third, patients with fat embolism have reasonably good chances of survival when they are given prompt expert resuscitation in a hospital with such facilities. Even patients with fulminant fat embolism can recover with such treatment. The SGH has the necessary resuscitation equipment, but not Dr Foo’s clinic. Dr Foo and his clinic were unprepared to save Mandy Yeong. Hence, speedy conveyance to the SGH was vital, and I am of the opinion that Dr Foo’s delay in sending for the ambulance was an act of negligence. 34 Mr Sreenivasan submits that even if Dr Foo had been negligent, his negligence did not result in loss because the chances of surviving a fulminant fat embolism are slim. As I mentioned above, I accept the evidence of the plaintiffs’ experts that fulminant fat embolism is a retrospective diagnosis. More importantly, I do not think that a tortfeasor may be excused on the ground that the chances of a person’s survival are slim when the very chance of survival was snatched from her by the tortfeasor’s act of negligence.",
        "Negligence in performing procedure": "35 Furthermore, I think that the evidence supports a finding that the fat embolism occurred as a result of the surgical procedure in which Dr Foo inserted a blunt tip cannula into Mandy Yeong’s thigh and directly injected fat molecules into her bloodstream. That is not an accepted risk if the surgery is properly carried out, and thus, the inference must be that the surgeon was negligent in the course of the procedure itself. 36 A/Prof Lim testified that fat embolism syndrome can occur in the procedure that Dr Foo performed, and that the incidence of this complication ranges from 2% to 22% depending on the different aetiological causes. That is a statistic of all such cases. What I have to find is whether, on the balance of probabilities, Dr Foo’s negligence in carrying out the procedure was likely to have caused Mandy Yeong to fall into the 2% to 22% category. What the statistic tells us is that even when there is a fat transplant done using the method that Dr Foo employed, 78% would not have developed fat embolism syndrome. It does not tell us whether in this instance whether Dr Foo had negligently performed Mandy Yeong’s surgery and caused her onset of fat embolism syndrome. 37 In this case, Mandy Yeong had previous fat transplants done on the same areas that, the experts say, would have left scar tissues, and injecting fat into these areas would have been more difficult because of the resistance due to the scarred tissues. Furthermore, as mentioned at [33] above, the extremely rapid onset of symptoms in this case meant that a large volume of fat had suddenly entered into Mandy Yeong’s bloodstream. Finally, one of the SGH’s doctors, Dr Lim Jia Hao, testified that when he was treating Mandy Yeong, he had noted bruising on her abdominal wall and upper thighs, which indicated that her femoral vessels might have been inadvertently punctured. All things considered, it was more likely than not that Dr Foo had inadvertently punctured a blood vessel as he was injecting the fat into Mandy Yeong’s thigh. 38 It seems to me that the clearest evidence of this is the temporal proximity between the completion of the procedure and the subsequent onset of Mandy Yeong’s symptoms, but that is a strong connection in the evidence of contrary evidence or evidence that might suggest otherwise. There is no other explanation as to how such a large volume of fat could have gotten into Mandy Yeong’s bloodstream. I am accordingly of the view that Dr Foo’s negligent performance of Mandy Yeong’s procedure caused her eventual demise. Other aspects of note 39 Dr Foo also breached the Specific Licensing Conditions when he collected a deposit of $2,311.20 from Mandy Yeong after her consultation on 28 May 2013 even though Condition 17(3) stipulates that no financial transaction relating to a liposuction procedure could be made for seven days from the day of first consultation on that procedure. Dr Foo explained that it was Mandy Yeong who had wanted to make payment on that day because she did not want the trouble of going back seven days later just to make payment. That may be so, but it is still a breach of the conditions. It is a condition imposed on the Clinic and for Dr Foo and the Clinic staff to comply. The blame for a breach cannot be shifted to the patient. In itself, however, the breach is not a cause of Mandy Yeong’s death. 40 The absence of medical, consultation, and surgical notes has made it difficult to understand what happened to Mandy Yeong. It is because of this that I am limited to drawing fewer inferences than I could otherwise do. I have set out the specific instances that are important, but I should now conclude that reviewing the case as a whole, it also seems to me, and I so find, that Dr Foo, who may well be a competent general surgeon, was not adequately trained to perform the liposuction and fat transfer procedures. Unfortunately, Dr Foo believed himself capable and thus did not manage this case as a competent surgeon in this field should have done. I therefore find that the cause of Mandy Yeong’s death was due to the negligence of Dr Foo. 41 For completeness, I briefly address the plaintiffs’ pleaded argument — which was abandoned at the close of the trial — that Dr Foo had failed to administer fluids intraoperatively and during the postoperative period. Dr Boey’s evidence in this regard was that the amount of fluids that Dr Foo had administered to Mandy Yeong during the surgery and during the resuscitation process was “grossly inadequate” and that this had placed Mandy Yeong at a disadvantage when pulmonary embolism occurred. Dr Foo argues that he had adopted the tumescent technique in carrying out his liposuction procedure, and that the use of tumescent anaesthesia negates the necessity of administering additional intravenous fluids during the procedure. I make no finding on this issue save to observe that the medical evidence on this point appears to be divided. Indeed, some medical literature warns against the administration of additional fluids intraoperatively when the tumescent technique was used. 42 I now turn to consider the plaintiffs’ claims for damages, which fall under the following heads: (a) An estate claim, comprising funeral expenses, medical expenses incurred at the Clinic, legal costs and disbursements incurred for obtaining the Letters of Administration, general damages for pain and suffering, and legal costs and disbursements incurred in relation to the coroner’s inquiry (“the Estate Claim”); and (b) a dependency claim, comprising the amounts claimed for bereavement and loss of support for Mandy Yeong’s dependants (“the Dependency Claim”); and (c) a loss of inheritance claim for the loss of inheritance suffered by Mandy Yeong’s dependants (“the Loss of Inheritance Claim”).",
        "The Estate Claim": "43 Where the Estate Claim is concerned, Dr Foo does not dispute the amounts being claimed by the plaintiffs for funeral expenses, medical expenses and legal costs and disbursements incurred for obtaining the Letters of Administration. 44 The plaintiffs claim $7,000 as general damages for pain and suffering. This is disputed by Dr Foo, who claims that a sum of $5,000 is sufficient given that Mandy Yeong had become unconscious soon after her blood oxygen levels plummeted. In my view, $7,000 is the appropriate figure. The evidence is that Mandy Yeong was conscious from 2.05pm, when the oxygen desaturation first began, till about 2.45pm. During this period, she would have felt severe breathlessness and distress from the lack of oxygen. The nurses and doctors who were present also testified that Mandy Yeong had been restless and uncomfortable while she was still conscious. 45 As for the coroner’s inquiry fees, the plaintiffs’ position is that these should be taxed if not agreed, while Dr Foo argues that they should not be claimable at all. InZhuXiu Chun (alias Myint Myint Kyi) v Rockwills Trustee Ltd (administrators of the estate of and on behalf of the dependants of Heng Ang Tee Franklin, deceased) and other appeals[2016] 5 SLR 412, the Court of Appeal held (at [76]) that coroner’s inquiry fees are claimable as long as the amount claimed is reasonable and proportionate. I therefore see no reason to disallow the plaintiffs’ claim in this regard.",
        "The Dependency Claim": "46 The plaintiffs claim bereavement at the statutory sum of $15,000 set out under s 21(4) of the Civil Law Act (Cap 43, 1999 Rev Ed). This is undisputed by Dr Foo and thus I need say no more on this matter. 47 The plaintiffs seek to utilise the “traditional method” to calculate the loss of support suffered by Mandy Yeong’s dependants as a consequence of Dr Foo’s negligence. By this method, the court must determine the deceased’s dependents’ reasonable expectation of pecuniary benefit by adding together the value of the benefits received by the dependants from the deceased (Armstrong, Carol Ann (executrixof the estate of Peter Traynor, deceased, and on behalf of the dependents of Peter Traynor, deceased) v Quest Laboratories Pte Ltd and another and other appeals[2020] 1 SLR 133 (“Armstrong”) at [212]). 48 At the time of her death, Mandy Yeong had been the Head of Regional Market Development for Roche Diagnostics Asia Pacific Pte Ltd (“Roche”), where she had worked for nearly 20 years. She was survived by her two elderly parents (Mr Yeong and Mdm Lee), her husband (Mr Seto), as well as her sons (aged 17 and 13 respectively at the time of their mother’s death). 49 Mr Seto and Mdm Lee gave evidence that prior to her demise, Mandy Yeong had provided her parents with a total monthly allowance of $1,000. On top of this allowance, Mandy Yeong frequently bought her parents gifts and had given them a few hundred dollars each month to pay their foreign domestic helper’s salary and foreign worker levy (“FWL”). Mr Yeong passed away on 8 October 2016. As such, the plaintiffs submit that the total multiplicand should be $1,500 per month for the period preceding Mr Yeong’s death, and $1,000 per month thereafter. Since Mdm Lee was 71 years old at the time of Mandy Yeong’s death, and the average life expectancy of a female in Singapore is about 86 years old, the discounted multiplier for Mdm Lee’s loss of support ought to be 11.25 years (ie, 15 years’ dependency period with a discount of 25% for accelerated receipt and vicissitudes of life). 50 Dr Foo’s position is that the plaintiffs lack the standing to make a dependency claim on Mr Yeong’s behalf as he has since passed away. Moreover, there is a serious evidentiary issue as to whether Mandy Yeong had even provided Mdm Lee with an allowance. 51 In my view, the plaintiffs are entitled to make a claim on Mr Yeong’s behalf as he only passed away after the suit had commenced. I am also prepared to accept, based on Mr Seto’s and Mdm Lee’s testimony, that Mandy Yeong was a filial daughter who willingly provided for her parents. However, there is nothing to show that Mandy Yeong had given her parents a monthly sum of $1,500 prior to her death. The only documentary evidence available is a bank statement showing that Mandy Yeong had paid for her parents’ foreign domestic worker’s FWL in June 2013. Considering the circumstances in their totality, I am of the view that a multiplicand of $1000 per month for the period preceding Mr Yeong’s death (approximately 40 months) would be fairer. For the period subsequent to Mr Yeong’s death, a multiplicand of $500 per month and a discounted multiplier of 9 years (12 years with discount of 25%) ought to be applied. 52 On behalf of Mandy Yeong’s husband, Mr Seto, the plaintiffs claim $322,920 for loss of support for household expenses, $816,962.97 for loss of support for expenses relating to an investment property (“the Hilloft”) which Mandy Yeong and Mr Seto jointly owned, and $296,700 for loss of support of car expenses. Mr Seto continues to own the Hilloft property to-date but there is no evidence that he is earning rental income from the property. 53 Where the household expenses are concerned, Dr Foo argues that there are two “gaping holes” in the plaintiffs’ claim: first, that the plaintiffs have not shown the apportionment of household expenditure between Mandy Yeong and her husband, and second, that they have not shown any proof of expenses incurred or to be incurred after Mandy Yeong’s passing. 54 Although the plaintiffs have not adduced documentary evidence of actual expenditure on household expenses, I am of the view that Mr Seto’s estimate of $2,600 per month is reasonable. The key question is how that sum ought to be apportioned between the parties. It is clear that Mandy Yeong earned considerably more than her husband. Her income for 2012 (ie, her last drawn income before her death) exceeded $420,000, while Mr Seto’s income in 2013 was around $120,000. This being said, I agree with counsel for Dr Foo that there is no evidence that Mandy Yeong would have continued to earn three times her husband’s income for the remainder of her career. More importantly, even if Mandy Yeong’s income was thrice the amount of Mr Seto’s income, this is not proof that she contributed three times the amount that Mr Seto contributed to the family’s household expenses. For this reason, I am of the view that a fairer approach would be to apportion the household expenses in the ratio of 66.6% to Mandy Yeong, and 33.3% to Mr Seto. This would result in a multiplicand of $20,779.20. 55 There is some dispute as to whether Mandy Yeong would have worked till age 62 or age 67, as the Human Resources Policy of Roche states that the retirement age of Roche is “as the law prescribes currently”. Under the Retirement and Re-employment Act (Cap 274A, 2012 Rev Ed), the minimum retirement age of an employee is 62, but employers must offer re-employment to employees up to the age of 67 if they are medically fit and assessed as having satisfactory work performance. Given Mandy Yeong’s good health and her stellar track record at work, I accept that it is more likely than not that she would have been offered employment till the age of 67. The appropriate multiplier should therefore be 13.8 years (23 years with a discount of 40%). 56 As to the Hilloft and car expenses, I am of the view that the plaintiffs’ claims are reasonable and that they have adduced sufficient evidence to substantiate their claims. I do not think that the Hilloft mortgage should be excluded simply because it could, in theory, be covered by the rental income that is earned from the property. As stated at [52] above, there is no evidence that Mr Seto is renting or intends to rent out the Hilloft. I also accept that Roche provided Mandy Yeong with the free use of a company car and that they would likely have continued doing so if not for Mandy’s demise. The plaintiffs’ claim for the cost of two cars is not unreasonable given that that Roche gave Mandy Yeong the option to change her car for a newer model every 5 years or so. 57 On behalf of Mandy Yeong’s two sons, the plaintiffs claim $113,601 for the older son and $249,433.20 for the younger son, encompassing monthly expenses, additional expenses (eg, holidays, gifts and healthcare benefits), as well as one-off expenses for driving lessons and university fees. 58 The parties agree that the discounted multipliers for the older son and the younger son ought to be 6 and 9 years respectively. Dr Foo is also prepared to accept the figures proposed by the plaintiffs in relation to the driving lessons and the university fees. However, Dr Foo asserts that the amounts claimed for monthly and additional expenses are excessive and unsubstantiated. Although I agree with Dr Foo that the plaintiffs have not tendered evidence of the sons’ actual monthly expenditure, it would not be appropriate to substitute the figures proposed by the plaintiffs with a nominal sum. In the circumstances, I am of the view that a sum of $1,200 per month for the older son’s monthly expenses and a sum of $900 per month for the younger son’s monthly expenses would suffice. As for the additional expenses, a sum of $3,000 per child per year is reasonable and appropriate. Again, these expenses would be apportioned in the ratio of 66.6% to Mandy Yeong, and 33.3% to Mr Seto.",
        "The Loss of Inheritance Claim": "59 The plaintiffs claim $4,956,551.11 for loss of inheritance based on Mandy Yeong’s projected income and $767,970 for loss of inheritance based on the stock options which Roche would have awarded to Mandy Yeong during the course of her employment. 60 Parties are agreed that the applicable test for the computation of a loss of inheritance claim is that set out inArmstrong(at [113]). Dr Foo’s main objection to the plaintiffs’ claim is that they did not call a representative from Roche to give evidence on Mandy’s projected remuneration. I am unable to accept this contention. The compensation statements and pay slips tendered by the plaintiffs are sufficient to satisfy me of the fact that Mandy Yeong had enjoyed annual salary increments of between 6.5% and 20.2% from 2009 till 2014. It is also evident from Mandy Yeong’s performance appraisals that she was a competent and highly valued employee. Taking all these factors into account, I am led to the conclusion that Mandy Yeong would most likely have enjoyed an average annual salary increment of about 5% until the age of 60. This would translate into an average annual income of $754,468.13. 61 The plaintiffs claim that Mandy Yeong’s annual expenses on her dependants would amount to about $111,427.79 a year. This sum ought to be reduced in light of my findings above that Mandy Yeong’s expenditure on household expenses, property-related expenses, and her parents’ and sons’ expenses would not have been extensive as the plaintiffs claim. In my view, an approximate figure of about $90,000 per year would be appropriate. I also accept the presumption endorsed inArmstrong(at [212]) that a person in a household of four with two children would typically spend 25% of her income on personal expenses. This means that Mandy Yeong’s average annual personal expenditure would have been $188,617.03. As such, the appropriate multiplicand for loss of inheritance based on Mandy Yeong’s projected income should be $475,851.10. The applicable multiplier would be 6.9 years (23 years with a discount of 70%). 62 As to the stock options, I am hesitant to find — based on the limited evidence available — that Mandy Yeong would have continued to accumulate 1,200 stock options annually till the end of her working life. In my view, a more conservative and realistic estimate would be 1,000 stock options (valued at $92.75 each) per year for a total of about 20 years. The appropriate multiplier is therefore 6 years (20 years with a discount of 70%).",
        "Apportionment": "63 I turn finally to consider Dr Foo’s argument, raised belatedly in the Defendants’ Reply Submissions, that if Dr Foo were found to be negligent, he only ought to be liable for a third of the damages claimable by the plaintiffs. This submission is clearly a non-starter. As the analysis in this judgment makes clear, Dr Foo’s negligent acts alone were sufficient to cause Mandy Yeong’s death. He should thus be liable in full for the losses suffered by the plaintiffs. 64 In conclusion, I award the plaintiffs the following damages: (a) for the Estate Claim, the sum of $31,390.99 (comprising $12,714.78 in funeral expenses, $4,983 in medical expenses incurred at the Clinic, $6,596.80 for the legal costs and disbursements incurred for obtaining the Letters of Administration, $96.41 for the cost of obtaining a medical report from SGH and $7,000 as general damages for pain and suffering), as well as the coroner’s inquiry fees which are to be taxed if not agreed; (b) for the Dependency Claim, the sum of $1,728,293.90 (comprising $15,000 for bereavement, $94,000 for Mdm Lee’s and Mr Yeong’s loss of support, $1,400,415.93 for Mr Seto’s loss of support, $96,881.69 for the older son’s loss of support and $121,996.28 for the younger son’s loss of support); (c) for the Loss of Inheritance Claim, the sum of $3,839,872.59 (comprising $3,283,372.59 for loss of inheritance based on projected income and $556,500 for loss of inheritance in relation to the stock options). 65 Pre-judgment interest is to be awarded from the date of the writ at the default interest rate of 5.33% per annum for all of the plaintiffs’ claims except for the claim for the medical expenses incurred at the Clinic, for which an interest rate of 3% per annum shall apply. 66 I will hear submissions on costs at a later date. - Sgd -Choo Han TeckJudge Kuah Boon Theng SC, Yong Shuk Lin Vanessa and Chain Xiao Jing Felicia (Legal Clinic LLC) for the plaintiffs;Narayanan Sreenivasan SC, Sundararaj Palaniaapan, Lim Min (K&L Gates Straits Law LLC) (instructed) and Gan Guo Wei (Charles Lin LLC) for the first defendant;Mak Wei Munn, Teh Shi Ying and Ong Hui Fen Rachel (Allen & Gledhill LLP) for the third party."
    }
}