{
    "case_title": "Jethanand Harkishindas BhojwanivLakshmi Prataprai Bhojwani (alias Mrs Lakshmi Jethanand Bhojwani) and others",
    "ncitation": "[2021] SGHC 256",
    "coram": "Kwek Mean Luck JC",
    "sections": {
        "Introduction": "1 Does someone have a right to access another’s computer and extract a mass of emails belonging to that person, without his awareness or consent, because the former was entitled to some of the emails as a beneficiary of a trust, or because the latter may not comply in the future with his disclosure obligations arising from court proceedings that have not been initiated and will not involve the former? This was the thrust of the defence raised by two sons, when their father brought an action against them for breach of confidence for surreptitiously extracting his emails.",
        "The facts": "2 The plaintiff and the first defendant are former husband and wife. The second and third defendants are two of their children. The fourth defendant is the law firm that represented the first defendant in divorce proceedings in FC/D 4639/2017 (the “Matrimonial Proceedings” or “FCD 4639”) and in HC/OS 1407/2017 (the “Trust Proceedings”). The Trust Proceedings was an action the first defendant commenced against the plaintiff to account as trustee for the trust set up by the plaintiff’s father for benefit of the plaintiff’s wife and his three children (the “Trust”). 3 The plaintiff and the first defendant were married in 1979. Around 1986, they stayed at a property (the “Matrimonial Home”) with their children. Around 2016, their marriage broke down irretrievably. The first defendant commenced the Matrimonial Proceedings on 5 October 2017. Interim Judgment was obtained on 29 October 2018, dissolving the marriage between the plaintiff and the first defendant. Ancillary matters in the Matrimonial Proceedings are still pending. Around June 2019, the plaintiff moved out of the Matrimonial Home. 4 The plaintiff owned a personal laptop (the “Personal Laptop”) with his own work email account from Shankar’s Emporium where he is a director. He used the Personal Laptop for personal and business purposes. This included storage of private emails, correspondence, bank statements of the plaintiff’s accounts, his personal affairs, business financial records and other documents. 5 Sometime in or around October 2016, the third defendant asked the plaintiff for use of his Personal Laptop to watch a movie.1Foot Note 1×Set Down Bundle at p 62 (Further and Better Particulars (“F&BP”) of the second and third defendant’s Defence dated 22 May 2020 (“22 May 2020 F&BP”) at p 5); Sandeep Jethanand Bhojwani’s Affidavit of Evidence-in-Chief (“AEIC”) at paras 84 and 85.The plaintiff agreed. While using the Personal Laptop, the third defendant saw the plaintiff’s emails and folders. He then downloaded documents from the plaintiff’s email folders (the “Copied Data”) into a USB stick. This was done without the plaintiff’s awareness or consent. The plaintiff’s forensics expert, Mr Darren Cerasi, gave unrebutted evidence that there were over 50,000 unique Copied Data that were downloaded.2Foot Note 2×Darren Cerasi’s AEIC at pp 12–13.Each unique Copied Data is a non-duplicate file; for example, an email with 20 attachments would be 21 files.3Foot Note 3×Notes of Evidence (“NE”) 26 July 2021 at pp 15–19. 6 The third defendant pleaded that he told the first defendant and the second defendant about the Copied Data in or around October 2017.4Foot Note 4×Set Down Bundle at p 63 (22 May 2020 F&BP at p 6).The second defendant was authorised to act on behalf of the first defendant in respect of the Matrimonial Proceedings and the Trust Proceedings.5Foot Note 5×2nd and 3rd Defendant’s Closing Submissions (“2D/3DCS”) at para 12.The second defendant reviewed the Copied Data and forwarded some of them to the fourth defendant, on behalf of the first defendant.6Foot Note 6×2D/3DCS at para 13.The first defendant used some of the documents from the Copied Data in the Matrimonial Proceedings.7Foot Note 7×1st and 4th Defendant’s Closing Submissions (“1D/4DCS”) at para 14.It is undisputed that the defendants did so without the awareness or consent of the plaintiff. The plaintiff also asserts that the first defendant used the Copied Data in the Trust Proceedings.",
        "The plaintiff’s claim": "7 The plaintiff brought an action in this suit against the defendants for breach of confidence seeking:8Foot Note 8×Set Down Bundle at p 98 (Statement of Claim Amendment No 1 at p 8). (a) a permanent injunction to restrain the defendants from using, disclosing or destroying the Copied Data or any copy or part of the Copied Data (the “Permanent Injunction”); (b) an order for the defendants to deliver up all the Copied Data and any copy or part of the Copied Data to the plaintiff; and (c) special damages, and damages or equitable damages to be assessed and paid by the defendants to the plaintiff. 8 The second and third defendants resisted the action in entirety.9Foot Note 9×2D/3DCS at para 16. 9 The first and fourth defendants indicated that they were prepared to consent to a permanent injunction, on the terms of the Interim Injunction Order issued in HC/ORC 5620/2020 dated 14 September 2020 (“Interim Injunction Order”), subject to certain amendments. They did not contest the plaintiff’s action on breach of confidence and participated only to make submissions on the terms of the Permanent Injunction and the costs order, and to contest liability for damages.10Foot Note 10×1D/4DCS at paras 1 and 2. 10 There are three main issues arising from the plaintiff’s claim: (a) whether there is a breach of confidence (vis-à-vis the second and third defendants only); (b) what should be the terms of the Permanent Injunction; and (c) whether the plaintiff is entitled to damages against the defendants.",
        "Breach of confidence": "11 The law on breach of confidence was considered by the Court of Appeal inI-Admin (Singapore) Pte Ltd v Hong Ying Ting and others[2020] 1 SLR 1130 (“I-Admin”). The court held at [61]: … Preserving the first two requirements inCoco([20]supra), a court should consider whether the information in question “has the necessary quality of confidence about it” and if it has been “imparted in circumstances importing an obligation of confidence”. An obligation of confidence will also be found where confidential information has been accessed or acquired without a plaintiff’s knowledge or consent. Upon the satisfaction of these prerequisites, an action for breach of confidence is presumed. This might be displaced where, for instance, the defendant came across the information by accident or was unaware of its confidential nature or believed there to be a strong public interest in disclosing it. Whatever the explanation, the burden will be onthe defendantto prove that its conscience was unaffected. … [emphasis in original] 12 The Court of Appeal thus adopted and modified the test inCoco v AN Clark (Engineers) Ltd[1969] RPC 41 (“Coco”), preserving the first two requirements ofCocoand modifying the third requirement ofCoco. I will refer to the first two requirements of the approach set out above inI-Adminas the “Cocorequirements”, given that they remain unchanged.",
        "Whether the information has the necessary quality of confidence about it": "Whether the plaintiff needs to prove that the Copied Data has the necessary quality of confidence about it 13 The plaintiff asserted in their Opening Statement, in reliance on [61] ofI-Admin, that the Copied Data undoubtedly has the quality of confidence in circumstances where the third defendant surreptitiously misappropriated and used them without the plaintiff’s knowledge and consent, and the burden shifts to the defendants to prove that they should not be liable to the plaintiff for breach of confidence.11Foot Note 11×Plaintiff’s Opening Statement at para 35. 14 The second and third defendants disagreed. They contend that the plaintiff still bears the burden of showing that the documents in question are confidential.12Foot Note 12×2D/3DCS at para 27. 15 I note that inI-Adminat [61], the Court of Appeal stated clearly that the first requirement ofCoco– that the information “has the necessary quality of confidence about it” – is preserved. The line relied on by the plaintiff at [61] ofI-Adminfor their assertion is: “[a]n obligation of confidence will also be found where confidential information has been accessed or acquired without a plaintiff’s knowledge or consent. Upon the satisfaction of these prerequisites, an action for breach of confidence is presumed.” It is clear from this line that the Court of Appeal was referring to “confidential information”, that is, information that has beenfoundto be confidential. 16 The second requirement ofCocois that the confidential information must have been “imparted in circumstances importing an obligation of confidence”. It is in relation to this secondCocorequirement, thatI-Adminstates that an obligation of confidence will be found where the confidential information is accessed or acquired without the plaintiff’s knowledge or consent. In other words, where confidential information was accessed without knowledge or consent, this fact fulfils the second requirement ofCocothat the confidential information was “imparted in circumstances importing an obligation of confidence”. 17 There is therefore no basis for the plaintiff’s assertion that underI-Admin, there is no need to prove that the information has the necessary quality of confidence about it, where the information was surreptitiously accessed and used without the plaintiff’s knowledge or consent. 18 To support their position that there is no need to comply with the first requirement ofCoco, the plaintiff also relied onImerman v Tchenguiz[2011] 2 WLR 592 (“Imerman”) at [68] where the court held that just as a defendant “who adventitiously, but without authorisation, obtains information in respect of which he must have appreciated that the claimant had an expectation of privacy” is a breach of confidence, “it must,a fortiori, extend to a defendant who intentionally, and without authorisation, takes steps to obtain such information.”13Foot Note 13×Plaintiff’s Closing Submissions (“PCS”) at para 273. 19 In his reply submissions, the plaintiff also refers toAshcoast Pty Ltdv Whillans[1998] QCA 034 (“Whillans”) where it was said by McPherson JA that the “fact that those details were obtained by the appellant not openly but surreptitiously, is perhaps the clearest indication that they were confidential and that he considered them to be so.” This was cited by the Supreme Court of Queensland inIthaca Ice Work Pty Ltd v Queensland Ice Supplies Pty Ltd & Anor[2002] QSC 222 (“Ithaca Ice Work”), where the court held at [12] the “wrongful acquisition of information raises a presumption that the information should be protected.” The plaintiff submits that these cases lend force to theImermanapproach that surreptitious acquisition of information gives rise to aprima faciecase that the information so obtained is confidential.14Foot Note 14×Plaintiff’s Reply Submissions (“PRS”) at paras 81–83. 20 However,Imermanalso makes clear that a breach of confidence involves a defendant who obtains information which the defendant appreciated or ought to have appreciated as confidential: seeImermanat [68]–[69]. Hence, even inImerman, the court did not state that it is assumed that information is confidential where the defendant surreptitiously accessed it without the plaintiff’s knowledge or consent. In reaching the modified approach at [61] ofI-Admin, the court did considerImerman(at [59]). It is thus not correct for the plaintiff to submit that the court’s modified approach at [61] ofI-Admindid not consider or does not apply to anImermansituation. 21 In addition, while the Australian cases ofWhillansandIthaca Ice Workindicate that the courts there would more readily find that information was confidential where it was surreptitiously obtained, they did not go so far as to state that there is no need in such situations to examine whether that information is confidential. Indeed, inWhillans, before McPherson JA’sdictawhich the plaintiff relies on, McPherson JA also stated that he had no doubt that the information there was confidential to the respondent even if the names of the patients were in fact known to the respondent by reason of his having treated them, as the “critical feature was the combination of those names with the addresses of the patients, and their compilation or collection in a single, simple and readily accessible form”. In other words, even inWhillans, the court analysed the information in coming to its view that it was confidential. This must be so, since information which is clearly in the public domain, would not be treated as confidential information, even if it was surreptitiously obtained. 22 Hence, my view is that, followingI-Adminat [61], the plaintiff has to prove that the Copied Data for which he asserts his claim of breach of confidence, “has the necessary quality of confidence about it”. Whether a claimant for breach of confidence must particularise each and every document for which he claims confidence 23 The second and third defendants further assert that the plaintiff must particularise each and every of the documents claimed to be confidential, relying onChiarapurk Jackand others v Haw Par Brothers International Ltd and another and another appeal[1993] 2 SLR(R) 620 (“Chiarapurk Jack”) andStratech Systems Ltd v Nyam Chiu Shin (alias Yan Qiuxin) and others[2005] 2 SLR(R) 579 (“Stratech”). 24 The plaintiff disagrees with this. He relies onImermanat [78], where the court rejected the imposition of a requirement that the claimant must identify each and every document for which he claims confidence and why. The court inImermanstated that in that case, the imposition of such a requirement was unnecessary (as it is obvious that many, probably most, of the documents are confidential or contain confidential information), disproportionate (because of the sheer quantity of documents copied) and unfair (in light of the number of the documents copied, and the fact that the copying was done without the claimant’s knowledge, let alone his consent). The court found that it was oppressive and verging on the absurd to suggest that before the claimant could obtain any equitable relief, he must first identify which out of 250,000 documents is confidential. 25 The plaintiff also cites the decisions of the Hong Kong Court of First Instance inSim Kon Fah v JBPB and Co (a firm)and others[2011] 4 HKLRD 45 at [53] andHong Kong Exchanges and Clearing Ltd v Shi Huaifang[2019] HKCFI 1212 at [52]–[53] for the proposition that the application of the principles requiring particulars must be applied with a degree of practical common sense and that the adequacy of particularity in each case depends on its own facts. The plaintiff submits that it would be disproportionate, unfair, oppressive and verging on the absurd to suggest that the plaintiff must particularise each and every one of the more than 50,000 documents that were copied.15Foot Note 15×PCS at paras 192–198.Moreover, the rationale of the requirement to particularise the confidential information is to prevent oppressiveness to the defendant, by allowing the defendant to know the case to meet. However, in this case, the second and third defendants had provided the plaintiff with a schedule of all the Copied Data that they were delivering up pursuant to the Interim Injunction.16Foot Note 16×Exhibit PE2.They were hence fully aware of the documents in the Copied Data and could not now say they did not know the case they have to meet in terms of the confidential documents. 26 In my view, the second and third defendants’ reliance onStratechis based on an unjustifiably stretched reading of the decision. At [27] ofStratech, the Court of Appeal noted that the plaintiff did not specify in its pleadings or evidence the confidential information allegedly taken. In the further and better particulars, the plaintiff inStratechmerely stated, “[t]he 1st and 2nd Defendant disclosed all the Plaintiffs’ information contained in the 5 computers at LTA as well as confidential information acquired by them in the course of employment.” The court found (at [36]) the plaintiff’s claim there to be too sweeping because it took the position that,inter alia, password protected information had to be confidential information. The court then stated (at [39]) that the plaintiff there ought to have been able to establish its case with specificity. A reading ofStratechindicates that while the Court of Appeal required such greater specificity, it did not mandate that every document claimed to be confidential has to be particularised. 27 This was also the view of the court inQB Net Co Ltd v Earnson Management (S) Pte Ltd and others[2007] 1 SLR(R) 1 (“QB Net”) when it consideredStratech. The court noted (at [74]) that unlike the plaintiff inStratech, the plaintiff inQB Nethad “[identified] the various manuals that constituted the confidential information” and “the plaintiff had adduced evidence to show how such information was confidential in nature. Therefore, the plaintiff’s claim was adequately particularised.” 28 The analysis inSingapore Civil Procedure 2021vol 1 (Cavinder Bull gen ed) (Sweet & Maxwell, 2021) (“Singapore Civil Procedure”), at para 18/12/42 also highlights a requirement for clear and precise pleadings, but without mandating that each and every document be particularised. It states: Cases of alleged breach of confidence ought to be clearly and precisely pleaded, and particulars of the confidential information must be given. Moreover,someparticularity of what is alleged to have been taken is required (Speed Seal Products Ltd. v. Paddington[1984] F.S.R. 77; also,Chiarapurk Jack & Ors. v. Haw Par Brothers International Ltd. & Anor. and another appeal[1993] 2 S.L.R.(R.) 620, CA where it was held that where a party seeks to restrain another from misusing allegedly confidential information, he is required to give particulars of the information to show that it is confidential and that there is a need to restrain the act). [emphasis added] 29 InChiarapurk Jack, the Court of Appeal expressed concern (at [34]) that the plaintiff provided “merely a statement that the details of the manufacturing process are confidential” and that this emanated from “a source that claims no familiarity with. the manufacture of the product”. Hence, the court held (at [38]) that it was “not sufficient for the respondents merely to allege, and by an officer who was not personally conversant with the details, that there was a manufacturing process, the detailed particulars of which were confidential … It was incumbent on them to be specific before injunctions could be justified on the basis of the confidentiality of the manufacturing process”. The court also noted (at [42]) that a statement of claim averring a whole list of confidential information and a duty of confidence in a defendant not to disclose such information would constitute a fishing expedition if no particulars are given. 30 I note that in the survey of the law in the United Kingdom on this point in Charles Phippset al,Toulson & Phipps on Confidentiality(Sweet & Maxwell, 4th ed, 2020) (“Toulson & Phipps”), the position is also that a claimant is not required to particularise each and every document. At para 4-011, the authors state that “it would be wrong to cast the claimant’s obligation of particularisation as an absolute rule, applicable without modification in every case. Much may depend on the manner in which a defendant originally came by the information alleged to be confidential”.Imermanis cited as one example, along with other categories in which a claimant may not be required to identify with specificity every item of information alleged to be confidential (Toulson & Phippsat paras 4-011–4-012). 31 In this case, the plaintiff has specified in his Affidavit of Evidence-in-Chief (“AEIC”), documents from the Copied Data that have been taken from him and used, and why they were confidential. The plaintiff’s case is that private and confidential documents from the Copied Data were used in the Matrimonial Proceedings. These include the following, with specific references removed to protect confidentiality: (a) a correspondence written by the fourth defendant (on behalf of the first defendant) to the Family Justice Court, which contained private and confidential documents relating to his alleged properties in another country;17Foot Note 17×Plaintiff’s AEIC dated 25 June 2021 (“Plaintiff’s AEIC”) at paras 52–53. (b)  the first defendant’s AEIC, which contained the plaintiff’s private emails from around 27 December 2011 to 5 February 2013 with another;18Foot Note 18×Plaintiff’s AEIC at para 61. (c) the Affidavit of Assets and Means (“AAM”) filed by the first defendant on 14 February 2019.19Foot Note 19×Plaintiff’s AEIC at paras 62–63.These include: (i) statements from Bank Accounts held in the plaintiff’s sole name; (ii) private emails dated 1 February 2013 to 16 August 2016 with another in relation to properties in another country; (iii) a private email dated 9 January 2017 that the plaintiff had sent to himself; and (i) the plaintiff’s personal income tax statement dated 2 July 2018. (d) the first defendant’s discovery affidavit on 14 May 2019, which contained an agreement that the plaintiff entered into with another;20Foot Note 20×Plaintiff’s AEIC at para 64. (e) the first defendant’s second Request for Discovery and Interrogatories served on 19 July 2019, that referred to bank statements of the plaintiff’s bank account;21Foot Note 21×Plaintiff’s AEIC at paras 65–66. (f) the first defendant’s third Request for Discovery and Interrogatories dated 13 August 2019, which contained private emails received by the plaintiff and directors of Shankar’s Emporium, dated from 12 September 2007 to 3 December 2008 and from 21 April 2015 to 29 September 2015;22Foot Note 22×Plaintiff’s AEIC at paras 67–69.and (g) the first defendant’s affidavit filed on 4 August 2020 in support of her application for leave to serve her fourth Request for Discovery, where she exhibited documents relating to the plaintiff’s alleged property dealings in another country.23Foot Note 23×Plaintiff’s AEIC at para 71. 32 Therefore, it cannot be said that there is a similar lack of specificity here as inStratech. This is not a case where the defendants are prejudiced, because they know what information was taken. This is also not a case, as described inChiarapurk Jack, where the plaintiff’s assertion of confidentiality is made by someone who is not familiar with the content, or where the plaintiff is trying to fish for evidence to strengthen his case. 33 I agree with the plaintiff that thedictainImermanat [78] is apt for application here. The imposition of a requirement to particularise each and every document here is unnecessary (as the documents involve private emails and many, probably most, are confidential or would contain confidential information), disproportionate (because of the sheer quantity of documents copied, which in this case is about 50,000) and unfair (in light of the number of the documents copied, and the fact that the copying was done without his knowledge, let alone his consent). It would be oppressive and verging on the absurd to suggest that before the plaintiff could obtain any equitable relief, he must first identify which out of the 50,000 documents are confidential. 34 Given the technological advancements today, where larger and larger amounts of data are easily stored, and large volumes of data can be quickly extracted, that would place an unnecessary and oppressive burden on a plaintiff bringing forth a claim for breach of confidence in situations where large volumes of his or her data has been extracted without his or her knowledge or consent. To do so would create an erroneous incentive for defendants to extract even larger volumes of data to make it harder for a plaintiff to particularise each and every document. 35 At the same time, within the facts of each case, the principle remains that there must be enough particulars of sufficient specificity to allow the defendant to know the case to meet. 36 In summary, while the plaintiff has to establish its case that there is breach of confidence with specificity, there is no strict legal requirement that the plaintiff must identify each and every document for which he claims confidence for. In this case, I find that the plaintiff has set out his case for breach of confidence with sufficient specificity. Whether the Copied Data have the necessary quality of confidence 37 The next issue is whether the Copied Data have the necessary quality of confidence. 38 InWee Shuo Woon v HT SRL[2017] 2 SLR 94(“Wee Shuo Woon”), the Court of Appeal set out the principles on when information is confidential. At [30]–[32] and [36]–[37], the court stated that: 30 InSpycatcher, Lord Goff observed (at 282) that the equitable duty of confidentiality is subject to certain limiting principles. One such principle is that information that has entered the “public domain” is, as a general rule, no longer amenable to the protection of the law of confidence: The first limiting principle (which is rather an expression of the scope of the duty) is … that the principle of confidentiality only applies to information to the extent that it is confidential. In particular,once it has entered what is usually called the public domain (which means no more than that the information in question is so generally accessible that, in all the circumstances, it cannot be regarded as confidential) then, as a general rule, the principle of confidentiality can have no application to it. … 31We stress, however, thatthe “public domain” principle as formulated inSpycatcher is not a freestanding rule to be mechanistically applied(Confidentialityat para 3-110).First, it is expressed as a general and not an absolute rule.…Secondly,the “public domain” principle is merely an aspect of the scope of the duty of confidentiality.In other words,it is but one factor to be considered when determining whether a person’s conscience ought to require him to treat information as confidential.Thus,the question for the court in each case is whether the degree of accessibility of the information is such that, in all the circumstances, it would not be just to require the party against whom a duty of confidentiality is alleged to treat it as confidential(seeConfidentialityat para 3-110). 32 … Secondly,where the information has become so accessible and/or accessed that a reasonable person in the position of the parties would not regard it as confidential, it could not be unconscionable for the party who receives such information to treat it as not confidential. … 36 …Potential, abstract accessibility is vastly different from access in fact. This is particularly so, given the proliferation of information in the globalised Internet age of today. Paradoxically,much of the information on the Internet, although accessible, is not in fact accessed by the public, whether from lack of interest or time or even ignorance. 37 Accordingly,the circumstances of each case must be examined. Consideration must be given to such factors as the likelihood of the information being accessed by the public, the degree to which the information has in fact been accessed and the extent to which the information may be appreciated and/or understood only with the specialised skills or expertise of the party seeking to make use of the information.” … [emphasis added] 39 In relation to whether the Copied Data have the necessary quality of confidence, the second and third defendants submit that: first, the plaintiff has admitted that out of the Copied Data, he is only alleging that the extracts referred to in his AEIC are confidential;24Foot Note 24×2D/3DCS at para 51.second, that the plaintiff is not a credible witness;25Foot Note 25×2D/3DCS at para 67.and third, the plaintiff has not proven that such extracts referred to in his AEIC have the necessary quality of confidence.26Foot Note 26×2D/3DCS at para 68. 40 On the first point, while counsel for the second and third defendants sought during cross-examination to pin the plaintiff down to the position that he is only alleging that the extracts in his AEIC are confidential and not more, the exchange did not bear this out. The second and third defendants cite the following:27Foot Note 27×NE 28 July 2021 at p 173 ln 19–p 174 ln 1. “Q: Can you confirm, as you have done for some of the other documents, where only part of the documents have been included in your affidavit of evidence-in-chief, can you confirm that whatever is included here, the selected part that is included, is the part that you are complaining is private and confidential? A: Yes. However, this was merely an affirmation by the plaintiff that what he has included in his AEIC is private and confidential. He did not clearly testify that the remainder of the Copied Data was not private and confidential. Indeed, when the counsel for the second and third defendants asked him, he said there were plenty more:28Foot Note 28×NE 28 July 2021 at p 65 ln 9–21 and p 146 ln 16–ln 25. Q: Based on your answers earlier, I did understand you to mean that it was only what you exhibited in your affidavit to be the documents that you are saying were private and confidential, from this particular letter? Are you changing your position? A: No, I'm saying there were so many document, I cannot remember what and -- which and what. But if this is what we have put, so it's here, but there may be some more documents which -- I haven't had time. You know, when we were filing it, we only got the -- the forensics only get all these papers out of the computer and then shared with us, it was already June. … Q: Since we only have those bank statements and IRAS statements included, can we take it that those are the only documents that you are complaining about for this particular AAM filed by Mdm Lakshmi? A:15,000[sic]documents were stolen. Am I supposed to put all the 50,000 documents into an affidavit? I'm asking myself and asking you, I don't know how to answer that. So if there were some more documents, have I forgone the point of saying that there were more documents but they are not here?Or -- … [emphasis added] The plaintiff reiterates this point further on in the cross-examination:29Foot Note 29×NE 28 July 2021 at p 166 ln 22–p 167 ln 18. Q: The point I'm trying to make is the point I have made before for other documents that you have exhibited in your affidavit of evidence-in-chief, which is that whatever is included here as the relevant extracts of this document at JHB-9, this is the sum total of the documents that you are complaining of are private and confidential from this particular document from Mdm Lakshmi; right? A: Like we went through earlier in the other one, I said that many documents were taken and these were used, some of these were put in my affidavit, as part of my affidavit. Q: These -- A: So we didn't use the others, my lawyers didn't use, that's it. Q: So they elected not to, you agreed with that decision? A: Yes. Q: You did not say you did not agree with their decision. A:But it doesn't mean (unclear - audio distortion)plenty more. [emphasis added] 41 In their reply submissions, the second and third defendants raised a new related point, which I will deal with here for completeness. They submitted that about 99% of the Copied Data was not disclosed by the plaintiff in discovery in this suit, and that since the plaintiff elected not to put these undisclosed documents in discovery or exhibit them in his AEIC, the court should presume that the undisclosed documents are not confidential, citing in supportBumi Geo Engineering Pte Ltd v Civil Tech Pte Ltd[2015] 5 SLR 1322(“Bumi Geo Engineering”) at [32]–[33] for the proposition that the court is entitled to presume that evidence which could be and is not produced is unfavorable to the person who withholds it.30Foot Note 30×2nd and 3rd Defendant’s Reply Submissions (“2D/3DRS”) at paras 13 and 15. 42 InBumi Geo Engineering, the court also stated (at [33]) that the source of the court’s power to draw such inference lies in s 116 illus (g) of the Evidence Act. This states that the court may presume the existence of anyfact, “that evidence which could be and is not produced, would if produced be unfavorable to the person who withholds it”. While there is a factual matrix that the court examines in assessing if information is confidential, whether documents are confidential or not is ultimately a legal finding, not a purely factual one, and hence not suitable to be determined via a presumption of adverse inference in reliance on s 116 illus (g) of the Evidence Act. Moreover, as set out above, I find that there is no legal requirement for the plaintiff to particularise each and every confidential document that he seeks protection for. In addition, during the re-examination of the plaintiff, counsel for the plaintiff sought to bring the plaintiff through other documents from the Copied Data, that were not in his AEIC but were in the Agreed Bundle of Documents. The plaintiff notes that counsel for the second and third defendants acknowledged that such documents could be found in the Agreed Bundle of Documents and hence such documents are part of the evidence in court. InPress Automation Technology Pte Ltd v Trans-Link Exhibition Forwarding Pte Ltd[2003] 1 SLR(R) 712, the court held (at [22]) that the effect of the parties’ agreement to include a report as one of the agreed documents was that they had agreed that it would be admissible without formal proof. Whilst parties were free to ask questions relating to the report and would not be barred from making submissions on the truth of its contents, the report would stand as evidence in court once it had been admitted as part of the Agreed Bundle.The plaintiff’s submission is borne out by the relevant exchange, set out below:31Foot Note 31×NE 28 July 2021 p 220 ln 2–p 225 ln 14. [Plaintiff’s Counsel (“PC”)]: Because, your Honour, when it was put to him that “these were the only document that you referred to in the AEIC”, he kept saying there were many more, 50,000 documents, so I’m just referring him to the AB to confirm whether these are some of the documents. Like I said, these documents were presented to the court in the Family Justice Court your Honour, in the matrimonial proceedings by WongP.The only reason why they were not in the AEIC was because we did not want to pad up the AEIC to make it too voluminous. But they were in the AB. [2nd and 3rd Defendants’ Counsel (“2D/3DC”)]: Your Honour, if my learned friend wants to submit that the entirety of the documents in the affidavit is in the AB, I don’t have an issue with him mentioning that. But I don’t see why the witness should be asked to comment on any part of the documents which are not inside his AEIC which I did not refer him to. Court: I believe it is Mr Liew's submission that the witness said that there were other documents as well which were not inside the AEIC, and his question flows from that. [2D/3DC]: Yes, your Honour. … [PC]: What about the documents at tab 2 and tab 3? Are these also the documents that are referred to by WongP in that request, which you did not refer to in your AEIC? [Witness]: Yes. Tab 3, yes, certificate copy -- … [2D/3DC]:Your Honour, if that is just what Mr Liew wants to establish,like I said, I am not disputing that these are the documents referred to by WongP in that letter. PC: I appreciate that, your Honour.If that's the case, that's on record so I don't think I need to take the witness through each of these documents, on the basis that there is no dispute that the affidavits do not include all documents but they can be found in the AB. [emphasis added] 43 On the second point regarding the plaintiff’s credibility, I do not agree with the second and third defendants’ submission. They point to inconsistencies in the plaintiff’s evidence about whether he used a particular email account exclusively for his email communications and the number of accounts accessible from his laptop and his knowledge of them.32Foot Note 32×2D/3DCS at paras 62–64.However, such inconsistencies do not relate to the material aspects of the plaintiff’s evidence. Assessing his overall conduct throughout the trial and his answers, I found the plaintiff to be a credible witness. 44 In respect of the third point, regarding the set of documents referred to by the plaintiff in his AEIC as confidential, the second and third defendants make the following submissions: (a) The fourth defendant’s letter to Court dated 24 June 2019 (“24 June Letter”), found at JHB-2 of the plaintiff’s AEIC – the plaintiff accepted that the email from the plaintiff to himself dated 13 November 2015 (“Plaintiff’s 13 November 2015 Email”) with a subject title and devoid of content, was not confidential. In relation to the index of the 24 June Letter, the plaintiff testified that save for items no 7, 29, 30, 31, and 34 of the index (“Excluded items from index of 24 June Letter”) which he said were not part of the Copied Data, the rest was allegedly confidential information. However, the plaintiff did explain how the other enumerated items were private and confidential to the plaintiff.33Foot Note 33×2D/3DCS at paras 70–73. (b) An email dated 28 March 2014 from Company X (“Company X email”),from the first defendant’s Written Submissions dated 22 November 2019 filed in FCD 4639, found at JHB-11 of the plaintiff’s AEIC – the plaintiff accepted during cross-examination that this email contained a brochure from Company X and an empty quotation form, and is not a sensitive document.34Foot Note 34×2D/3DCS at paras 74–77. (c) Emails between plaintiff and another, AB, in 2014 (“AB Emails”),from an extract of the first defendant’s AEIC filed on 4 August 2020 in FCD 4639, found at JHB-12 of the plaintiff’s AEIC – the plaintiff accepted that he had earlier sent the AB Emails to the second defendant.35Foot Note 35×2D/3DCS at paras 78–81. (d) Last Will and Testament of the plaintiff’s mother dated 11 June 2010 (“Plaintiff’s Mother’s Will”)-– the plaintiff alleged in para 98 of his AEIC that the Plaintiff’s Mother’s Will was part of the Copied Data and confidential. However, he failed to show that this could be found in the Copied Data.36Foot Note 36×2D/3DCS at paras 82–88. 45 While the Plaintiff’s 13 November 2015 Email contained only a subject title and was devoid of further content, I find that the information on the subject matter and timing of the communication can be considered a personal confidential matter. While the Company X email contained a brochure from Company X and an empty quotation form, I find that what someone is considering to purchase can be considered to be a personal confidential matter, even if the product information is more widely available. 46 The second and third defendants’ submission that the plaintiff’s assertion of confidentiality in respect of the items in the index of the 24 June Letter is insufficient, is similar to their submission that the plaintiff has to particularise each and every document. As set out earlier, that is no legal requirement mandating the plaintiff to do so. But more than that, the index is not simply a listing of the title of the emails. It contains descriptions of the emails, such that one can broadly make out contents of the emails. The description of the emails in the index (save for items no 7, 29, 30, 31, and 34 of the index which the plaintiff said were not part of the Copied Data) show that they relate to communications concerning the plaintiff’s private life, including his personal finances and business dealings. None of these emails were in the public domain. I find that they can be regarded as confidential. 47 The second and third defendant’s case in relation to the AB Emails is premised on what they characterise as the plaintiff’s acceptance that he had earlier sent the AB Emails to the second defendant.37Foot Note 37×2D/3DCS at para 80.When asked by counsel for the second and third defendants if he accepted that he had “sent it to Devin once upon a time”, the plaintiff replied yes.38Foot Note 38×NE 28 July 2021 at p 197 ln 17–19.No documentary evidence was adduced by the second defendant that he did receive such emails. 48 I find that the second defendant has not proven that the plaintiff emailed the AB Emails to him, as the extract of the more detailed exchange shows that the plaintiff did not make such a concession:39Foot Note 39×NE 28 July 2021 at p 192 ln 5–p 193 ln 25. Q: She got it from Devin because you had given it to Devin before. This is not from the copied data. That’s what she is saying. … Q: So do you agree with that? A: That I had given this to Devin? Q: In 2014, yes. A:I may have given. I may have given. Q: Sorry? A:I may have given. I can’t remember. Q: Can you go back to the [AB] email itself. … Q: Do you see at the top right of your email, it says Devin Bhojwani? A: Yes, confirm. Q: This would appear only if it’s printed from his email account? … A: I don’t know how that works.But does it show that I sent him a copy, I copied him on this. Q: It appears you have blind copied him or you forwarded it to him or something after that? A:No, it doesn’t show me here that I forwarded this to him. My communication is if look at the “To” column is only to[AB]. Q: Yes. A:Not to Devin. So if he got my copy, and then he prints it, that’s his copy, not from me to him. It just says over here I sent it to[AB]. He got hold of my copy and he printed one. … A:That’s what I read and that’s what I understand, otherwise he should show one where I copied him on the mail, like the other one that I sent to the three boys. Q: All I’m saying is Mdm Lakshmi says she got this from Devin and that you had sent it to him. You said it’s possible. I have shown it to you. You had some questions over it. My position is: would you accept that on the face of this email, Devin already has it? A:I would say that, no. I would again categoric-- you see, I have not emailed -- mailed Devin on this thing, so he got hold of it, not got it. He got hold of it. [emphasis added] 49 In relation to the Plaintiff’s Mother’s Will, the second and third defendant’s case is that the plaintiff failed to show that this could be found in the Copied Data. However, as pointed out by the plaintiff, the third defendant admitted in cross-examination that the Plaintiff’s Mother’s Will was part of the Copied Data that was disclosed pursuant to the Interim Injunction.40Foot Note 40×NE 29 July 2021 at p 195 ln 8–p 197 ln 5. 50 It is undisputed that the Copied Data were downloaded from the plaintiff’s email folders on his Personal Laptop. He has testified that such emails involve communications relating to “company affairs (such as management and operational issues and overall business matters including financial records); [his] personal information including private investments (bank statements from accounts etc); other private communications and all [his] other personal information”.41Foot Note 41×Plaintiff’s AEIC at para 30.Consistent with this assertion, the communications that he referred to in his AEIC, as having been used and relied on by the fourth defendant in the Matrimonial Proceedings, were shown to be of such tenor. I note with agreement the observation inImerman(at [76]): “[c]ommunications which are concerned with an individual’s private life, including his personal finances, personal business dealings, and (possibly) his other business dealings are the stuff of personal confidentiality”. In addition, in similar vein to what was observed inImerman(at [77]), the fact that the second and third defendant’s justification for their actions was their fear that the plaintiff would seek to “maintain the secrecy of the information which [they] sought by clandestine means”, strengthens the plaintiff’s case that such material was confidential. 51 Neither can it be said that the Copied Data were in the public domain, even for those used in the Matrimonial Proceedings. They have not been accessed by the public. Leave of court is required for members of the public to inspect the file and there is no evidence of such inspection. It is also the first and fourth defendant’s case that no member of the public has accessed the Copied Data.42Foot Note 42×1D/4DCS at para 62. 52 I also note that leaving aside the Excluded items from index of 24 June Letter, the second and third defendants have not shown that the other documents listed in the plaintiff’s AEIC or the Copied Data fail to meet the first requirement ofCoco. They refer to notes prepared by the second defendant (“2D Notes”) which they contend cannot be confidential but which they assert the plaintiff claims as part of the Copied Data.43Foot Note 43×2D/3DRS at para 45.However, the plaintiff has stated that he has never asserted that the 2D Notes were part of the Copied Data or part of his confidential documents.44Foot Note 44×PRS at para 117. 53 The second and third defendants have also made submissions that the consideration of whether the Copied Data are confidential would also entail consideration of circumstances after the alleged breach, and that because of the second and third defendant’s entitlement to Trust documents and the plaintiff’s duty of disclosure in the Matrimonial Proceedings and Trust Proceedings, the documents relating to the Trust and Matrimonial Proceedings do not possess the necessary quality of confidence.45Foot Note 45×2D/3DRS at para 22.They citeQB Netat [82]in support.46Foot Note 46×2D/3DCS at para 29.However, there is nothing in [82] ofQB Netthat supports this proposition. That paragraph states essentially that the information there was unmistakably in the public domain and the plaintiff could not claim confidentiality for it. In other words, it refers to the quality of the information at the time of breach. The second and third defendant’s submissions regarding the plaintiff’s obligations to disclose are more properly examined within theI-Adminframework under the third limb rather than the first limb, which I address below. 54 I therefore find that the plaintiff has met the first requirement ofCoco,that theinformation in the Copied Data “has the necessary quality of confidence about it”, with the exception of theExcluded items from index of 24 June Letter (the “Non-confidential documents from Copied Data”).",
        "Was the information imparted in circumstances importing an obligation of confidence?": "55 It is not contested by the second and third defendants that the second requirement of Coco is met in this case. The Court of Appeal inI-Adminat [61] held that an obligation of confidence will be found where confidential information has been accessed or acquired without a plaintiff’s knowledge or consent. In this case, it is undisputed that the Copied Data were accessed or acquired without the plaintiff’s knowledge or consent. There is hence an obligation of confidence arising in this case and the information was imparted in circumstances importing an obligation of confidence.",
        "Whether presumption of breach of confidence is displaced": "56 In line withI-Admin, as the prerequisites of the modifiedCocotest have been met, an action of breach of confidence is presumed. The next question is whether this might be displaced. 57 In regard to this, the second and third defendants submit that the plaintiff does not enjoy the right of confidentiality over documents in the Copied Data relating to: (a) the matrimonial assets between the plaintiff and the first defendant as he has an obligation to disclose them in the Matrimonial Proceedings for purposes of final ancillary matters which are still pending, and in the Trust Proceedings;47Foot Note 47×2D/3DCS at para 18(c)–(d). (b) the Trust and Trust assets as the second and third defendants as beneficiaries are legally entitled to them. As the Court of Appeal has already ordered the plaintiff to provide an account of the Trust Assets to the first defendant, there is no reason why an account of trust would not be similarly granted in the second and third defendants’ favour since they stand in the same status as the first defendant as beneficiaries of the Trust;48Foot Note 48×2D/3DCS at para 134.and (c) the Copied Data contains documents that reveal crime, fraud or misconduct of such a nature that it ought, in public interest, to be disclosed.49Foot Note 49×2D/3DCS at para 129. 58 I will deal quickly with this last point before examining the second and third defendants’ other two contentions. While the second and third defendants submit that the Copied Data reveals fraud and criminal breach of trust by the plaintiff, they have not pleaded it. It is trite law that a party should be bound by its pleaded case: seeTan Poh Choo Joscelyn v Tan Poh Seng and another[2014] SGHC 22 at [81] andEnholco Pte Ltd v Schonk, Antonius Martinus Mattheus and Another[2015] SGHC 108 at [2]. Neither did they put this contention to the plaintiff for him to explain his position. InSuhha Natrajan v The Bank of East Asia Ltd[2017] 1 SLR 141 the court held (at [48]) that allegations of vital importance ought to have been put directly to the plaintiff who should be given the opportunity to address it. This was not done. Importantly, the second and third defendants have also not provided any evidence to support this allegation. I find this submission to be without merit. Whether the second and third defendants’ actions were justified because of the plaintiff’s alleged failure to comply with discovery/disclosure obligations in the Matrimonial Proceedings and Trust Proceedings 59 In response to the second and third defendants’ submission that they were justified to extract the Copied Data because of the plaintiff’s duty of disclosure in the Matrimonial Proceedings and the Trust Proceedings, the plaintiff points to the following. 60 First, the third defendant’s evidence is that he downloaded the Copied Data in October 2016. However, there were no extant legal proceedings when the third defendant allegedly downloaded the Copied Data in October 2016. The Matrimonial Proceedings were commenced by the first defendant in October 2017. The Trust Proceedings were eventually initiated by the first defendant in December 2017. Moreover, the third defendant’s explanation that he only told the first and second defendants in or around October 2017 at about the time when his father and mother were exchanging information about assets they owned after his mother had commenced the Matrimonial and Trust Proceedings,50Foot Note 50×Third defendant’s AEIC dated 7 July 2021 (“Third Defendant’s AEIC”) at paras 90–91.is not borne out on the facts: since the Trust Proceedings was only filed on 18 December 2017, while Interim Judgment in the Matrimonial Proceedings was only entered on 29 October 2018. Thus, the exchange of documents for matrimonial assets would not have commenced before that. 61 Second, there has been no finding by the Family Justice Courts that the plaintiff breached disclosure obligations nor are there live issues of breach of disclosure obligations in the Matrimonial Proceedings or Trust Proceedings. 62 Third, the second and third defendants are not even parties in the Matrimonial Proceedings or the Trust Proceedings. 63 Fourth, the third defendant did not just download documents relating to the Matrimonial Proceedings or the Trust Proceedings. Indeed, the third defendant testified that he was not able to isolate the specific documents and hence copied from the plaintiff’s email folders, documents that were not related to the Matrimonial Proceedings or the Trust Proceedings. 64 The plaintiff submits that the court should not “condone the illegality of self-help consisting of breach of confidence (or tort) because it is feared that the other side will itself behave unlawfully and conceal that which should be disclosed”: seeImermanat [107]. 65 The second and third defendants rely onWeeShuo Woonfor the proposition at [50] that “[s]ince it is the court’s equitable jurisdiction that is being engaged, it remains open to the court to refuse relief on the general principles affecting the grant of a discretionary remedy,ie, on such grounds as inordinate delay, a lack of clean hands or general iniquity.” 66 In that case, the appellant was employed as a security specialist of the respondent company. The respondent sued him for breaching his employment contract. After the commencement of the suit, the respondent’s computer systems were hacked. Data, including emails between the respondent and its solicitors pertaining to the suit, were uploaded onto the internet. The appellant filed an affidavit referring to such emails and exhibited copies of them. The Assistant Registrar (“AR”) allowed the respondent’s application to expunge the emails. The High Court and Court of Appeal affirmed the AR’s decision. It was in this context that the Court of Appeal made its observations at [50]. Notably, they made this with reference to the appellant who had stealthily extracted the emails, not the respondent. This is clear from the Court of Appeal further stating at [50] that public policy “also requires that a litigant should not be permitted to make use of a copy of privileged document which he has obtained by stealth, trickery or otherwise acting improperly”. At [52], the Court of Appeal further emphasised that “the equity in favour of restraining the use of privileged documents is even stronger in the case of a party who had its privileged documents accessed and taken through stealth and unlawful means.” 67 Far from assisting them, the Court of Appeal’sdictainWee Shuo Woonabout the public policy against accessing and taking the Copied Data through stealth, trickery or otherwise improper conduct applies with equal force here against the second and third defendants. 68 According to the third defendant, he was the sole person involved in the downloading of the Copied Data. There is no firm evidence suggesting otherwise. The third defendant’s evidence is that he had initially borrowed the plaintiff’s Personal Laptop to watch a movie because his own laptop was not functioning. Besides the plaintiff’s personal account, there was another account on the Personal Laptop that the plaintiff had created for the second defendant’s personal use (“the second account”). The second account could not access any of the Copied Data. However, as the plaintiff could not remember the password for the second account, he logged into his personal account.51Foot Note 51×Third Defendant’s AEIC at para 84.According to the third defendant, he experienced some technical difficulties while watching the movie and in the midst of troubleshooting the technical difficulties, he accidentally clicked on the “Microsoft Outlook” icon, which opened up the plaintiff’s work email account.52Foot Note 52×Third Defendant’s AEIC at para 85. 69 The third defendant saw an email folder relating to the Trust and his late grandfather’s will (the “Will”).53Foot Note 53×Third Defendant’s AEIC at para 85.He then downloaded the Copied Data from the plaintiff’s work email account, which consisted of emails beyond those in the folder related to the Trust and the Will.54Foot Note 54×NE 29 July 2021 at pp 51–61.During cross-examination, the third defendant said that he did not know how to “isolate” the emails,55Foot Note 55×NE 29 July 2021 at pp 51–52.in that he did not know how to download only the emails that related to the Trust and Will. Upon further questioning, the third defendant admitted that at the relevant time, he knew that he was bequeathed shares of companies within the Shankar group of companies as a beneficiary of the Trust.56Foot Note 56×NE 29 July 2021 at pp 51–52 and 58–59.He assumed that there were other emails related to some of the companies within the Shankar group of companies and therefore downloaded the Copied Data.57Foot Note 57×NE 29 July 2021 at pp 57–58. 70 Even on the third defendant’s version of the evidence, the plaintiff had only allowed the third defendant to use his Personal Laptop for the limited purpose of watching a movie. But the third defendant went far beyond that limited permission. Even if the third defendant had accidentally accessed the plaintiff’s work email account and saw emails related to the Trust and the Will, he could have decided to ask the plaintiff about them rather than download the Copied Data without the plaintiff’s awareness or consent. Instead, he stealthily downloaded the Copied data. To make matters worse, he downloaded the emails from other folders on the basis that “there were emails in other folders that wouldprobablybe related to [the Trust and Will]” [emphasis added].58Foot Note 58×NE 29 July 2021 at pp 56 ln 5–10.He then, on his evidence, kept his actions secret from the plaintiff for more than a year until his actions came to light during the Trust and Matrimonial proceedings. When the second defendant was told by the third defendant, he did not tell the third defendant that this was wrong, but instead reviewed the Copied Data and forwarded some of them to the fourth defendant for use in the first defendant’s case in the Matrimonial Proceedings. The second and third defendants seek to rely onWee Shuo Woonto allege that the plaintiff should be refused relief because of his lack of clean hands. But whatWee Shuo Woonsays, is that a litigant should not be permitted to make use of a copy of privileged document which he has obtained by stealth or by acting improperly. That applies with full force to the second and third defendants. It is they who have the unclean hands. 71 Moreover, as the plaintiff has pointed out, relying onE C Investment Holding Pte Ltd v Ridout Residence Pte Ltd and othersand another appeal[2012] 1 SLR 32 at [92], the conduct complained of must have an immediate and necessary relation to the equity sued for, and it must be a depravity in the legal as well as in the moral sense. 72 In this case, the conduct complained of (ie, the failure of the plaintiff to disclose documents to the first defendant in the Matrimonial Proceedings and Trust Proceedings) does not have an immediate and necessary relation to the equity sued for by the plaintiff, as the second and third defendants are not even parties in the Matrimonial Proceedings and Trust Proceedings. Those proceedings were not even in existence at the time the third defendant downloaded the Copied Data. 73 The second and third defendants’ case is essentially, that they have a right to access someone else’s computer and extract a mass of emails belonging to that person, without that person’s awareness or consent, on the justification that that person may not comply in the future with his disclosure or discovery obligations in court proceedings that have not been initiated, and for which they will not be a party to. Moreover, due to the challenges of isolating the relevant emails, they are entitled to access and extract emails which are not even related to such future court proceedings. The public policy concerns highlighted by the Court of Appeal inWeeShuo Woonwould be greatly amplified if this were to be a valid defence. 74 I therefore find that there is absolutely no merit to the second and third defendants’ defence that they are entitled to the Copied Data because of the plaintiff’s alleged failure in discovery or disclosure obligations in the Matrimonial Proceedings or Trust Proceedings. It is undisputed that the Matrimonial Proceedings or Trust Proceedings had not yet commenced, either at the point where the third defendant accessed and downloaded the Copied Data in October 2016 or when the third defendant said he informed the first and second defendant of this in October 2017. Nor were they parties to the eventual Matrimonial Proceedings or the Trust Proceedings. It is also undisputed that the Copied Data was not even restricted to documents relating to the Matrimonial Proceedings or the Trust Proceedings. Whether the second and third defendants are entitled to access, extract and use the Copied Data because they are beneficiaries of the Trust 75 The second and third defendants’ other defence relates to their status as beneficiaries of the Trust set up by their grandfather. Their father, the plaintiff, is the trustee. Their case is that the plaintiff had hidden the existence of this Trust from them. When it was discovered, the plaintiff did not provide them with the necessary documents about the Trust. Hence, the second and third defendants are entitled to access, extract and use the Copied Data without the plaintiff’s awareness or consent. 76 I find that there is no merit to this defence for the following reasons. 77 First, the second and third defendants do not dispute that the third defendant was not able to identify or isolate what were the documents that related to the Trust, and that he extracted much more documents than just those relating to the Trust. 78 Second, evenifthe second and third defendants were entitled to documents relating to the Trust, the proper approach would have been to seek remedy through the court rather than to stealthily extract it without the awareness or consent of the plaintiff. This court does not condone a litigant hiding documents that should properly be disclosed as part of legal proceedings. But at the same time, it is a simple legal principle that if a father has his son’s belongings and refuses to return them to him, the son is not entitled to break into the father’s house to surreptitiously retrieve it. This principle does not change just because such belongings take the form of confidential information. I fully endorse the principle set out inImermanat [107]: “[a]re the courts to condone the illegality of self-help consisting of breach of confidence (or tort), because it is feared that the other side will itself behave unlawfully and conceal that which should be disclosed? The answer, in our judgment, can only be: No.” What the second and third defendants did was plainly wrong. The first and fourth defendants recognised this and chose not to contest the plaintiff’s action for breach of confidence. The second and third defendants did not recognise this and ironically chose to justify their conduct by pleading that it was the plaintiff who came to court with unclean hands. 79 Therefore, in my judgment, the second and third defendants are not entitled to access and extract the Copied Data without the awareness or permission of the plaintiff, simply because they assert that they are beneficiaries of the Trust.",
        "Permanent Injunction": "80 The plaintiff’s primary position on the Permanent Injunction, is that there should be no exceptions permitting the first and fourth defendants to use any Copied Data in the Matrimonial Proceedings. Their secondary position is that if the Court is minded to retain the existing exceptions ordered by the Court under the Interim Injunction Order dated 14 September 2020 (“Interim Injunction”), the scope of exceptions there should not be expanded to permit the use of additional documents by the first and fourth defendant.The Permanent Injunction should likewise have no exceptions for the second and third defendants. 81 The defendants seek certain limitations in the Permanent Injunction. First, that the injunction contain the limitation that the first, second and third defendants should be at liberty to use their knowledge or recollection of the Copied Data to support any application that they may make to the Court for specific discovery in any proceedings, and if the Court allows their application, they shall be at liberty to use and refer to the documents so ordered to be disclosed in those proceedings, subject always to the law of evidence (the “Knowledge Exception”).59Foot Note 59×1D/4DCS at paras 100–107; 2D/3DCS at paras 173–176.In support of their position, they rely onANB v ANC and another and another matter[2015] 5 SLR 522 (“ANB v ANC”)which said (at[25]): … The Respondents relied on the Judge’s reasoning below and submitted thatprejudice could arise if the information obtained could not be used in the divorce proceedings between the parties. Again, we point out that these proceedings did not relate to the admissibility of the information as evidence in the divorce proceedings (see above at [12]). In any event, we made it clear in the orders made thatour holding in this case did not prevent the 1st Respondent from relying on her knowledge of the information to seek disclosure of the information via specific discovery in other proceedings in the usual course of litigation (although the admissibility of the information as evidence would be subject to the decision of whichever court is seized of the matter)see Order of Court in Annex A at paras 1(c) and 10).In our view, such an arrangement obviated the practical prejudice contemplatedby the Respondents and the Judge below that may arise upon a granting of an injunction. [emphasis added] 82 The first and fourth defendants note that the Knowledge Exception is already present in the Interim Injunction dated 14 September 2020 at cl 2(c). They emphasise that in the discovery process, there would be court scrutiny as the applicant would have to satisfy the court that the documents are both relevant and within the possession, custody or party of the other party.60Foot Note 60×1D/4DCS at paras 103–107.The plaintiff has made no specific submission against the defendants’ request to retain the Knowledge Exception, but have proposed that if the court is minded to allow exceptions in the Permanent Injunction, they be the same as that in the Interim Injunction, which includes the Knowledge Exception.61Foot Note 61×PRS at para 704. 83 I find the Knowledge Exception to be fair and practical. As observed by the Court of Appeal inANB v ANC, the admissibility of evidence in other proceedings would be subject to the scrutiny of the court hearing such application, taking into consideration the applicable legal principles. I therefore allow the defendants to retain the Knowledge Exception in the Permanent Injunction. 84Second, the second and third defendants submit that one full set of the Copied Data (or part thereof) should be placed in the custody of the plaintiff’s and the first, second and third defendants’ solicitors(the “Retention Exception”). The second and third defendants submit that the Retention Exception would provide“the obvious justice in seeking to ensure that the plaintiff cannot dispose of or hide documents which he is or may become obliged to produce to the court”:Imermanat [149].62Foot Note 62×2D/3DCS at paras 177–184. 85However, as pointed out by the plaintiff, the second and third defendants’ reliance onImermanat [149] is misplaced. From [147] and [149] ofImerman, it is clear that the documents there were delivered up by the defendant to the plaintiff’s solicitors. The second and third defendant’s reliance onANBv ANCis similarly misplaced. The court inANBv ANCdid not permit the defendant’s solicitors to retain all the copied data, but only certain documents out of the copied data which were filed in the pending matrimonial proceedings. 86Moreover, the second and third defendants have not shown that the plaintiff has hidden or disposed of documents that he is obliged to produce in the Matrimonial Proceedings or Trust Proceedings. The first and fourth defendants have confirmed that the plaintiff has not breached any such disclosure requirement in the Matrimonial Proceedings and that there are no live issues of disclosure in either the Matrimonial Proceedings or the Trust Proceedings.63Foot Note 63×NE for HC/SUM 3353/2021, 26 July 2021, at p 19.I find no basis for the Retention Exception and disallow it. 87Third, the defendants submit that the confirmation that all soft copies of the Copied Data have been delivered up, can be in the form of a Solicitor’s Undertaking instead of a certification by the plaintiff’s computer forensic expert (“PCFE”). The defendants submit that this would save time and costs. There is no reason to doubt the solicitors’ integrity or to believe that the defendants would not comply as they have fully complied with delivery up orders to date. In addition, the solicitors of the defendants, being law firms, should not have their database subject to repeated invasions or carte blanche access by an external party.64Foot Note 64×1D/4DCS at paras 108–116; 2D/3DCS at paras 185–189. 88The plaintiff disagrees. He submits that there is no basis to depart from the Interim Injunction, which is based on the order made by the Court of Appeal inANB v ANC.There, the copied data was also on the database of the solicitor. That did not stop the court from ordering the PCFE there to undertake deletion of the copied data. Moreover, the terms of the Interim Injunction already provides that the PCFE is to protect privileged and confidential information that are not part of the Copied Data.65Foot Note 65×PCS at paras 467. 89In addition, the plaintiff notes that the fourth defendant made the same request, at the hearing of the first and fourth defendants’ application to set aside theexparteInterim Injunction, to provide a Solicitors’ Undertaking that the Head of its IT Department would undertake the deletion of the electronic copies of the Copied Data in the possession of the fourth defendant, in lieu of the PCFE undertaking the deletion. This was rejected by Justice Andrew Ang. In any event, given the fourth defendant’s conduct in this case, the plaintiff does not trust the fourth defendant to undertake the task of deletion of the Copied Data on its own.66Foot Note 66×PCS at paras 467 and 468. 90Given that the fourth defendant are themselves a party to this suit, I do not consider it appropriate that the deletion of the Copied Data be by way of solicitor’s undertaking from the fourth defendant on behalf of the first defendant. I note that the fourth defendant are also the solicitors for the second and third defendants in HC/S 521/2021, which they have commenced against the plaintiff. Moreover, the arguments in support of the solicitors’ undertaking are not strong. I accept that there can be cost savings for the defendants if the confirmation of deletion of the Copied Data is in the form of a solicitors’ undertaking rather than through a certification by the PCFE (which the defendants would have to pay for). But having breached confidence in relation to the Copied Data, the defendants should put the plaintiff back in the position that he previously was in. In so far as there are concerns regarding intrusion of the solicitors’ databases, the Interim Injunction provides that the PCFE is to protect privileged and confidential information that are not part of the Copied Data, and this would remain so under the Permanent Injunction. 91Fourth, the first and fourth defendants submit that the Permanent Injunction should be expanded to cover not only the FCD 4639 affidavits, but also all the other documents filed in FCD 4639 which are listed at para 17(h) of the Statement of Claim (the “SOC” andthe “FCD 4639 Affidavits and Documents”). The FCD 4639 Affidavits and Documents have already been filed/tendered to Court and received in evidence in FCD 4639, and findings and orders have already been made in FCD 4639 based on the same. The first defendant would require these documents for the ongoing FCD 4639 proceedings.67Foot Note 67×1D/4DCS at paras 117–121. 92The second and third defendants have not made any explicit submission on this. However, in relation to their submissions on whether there the Copied Data has the quality of confidence or if there is a breach of confidence, they had cited a passage fromHT SRL v Wee Shuo Woon[2016] 2 SLR 442 (“Wee Shuo Woon (HC)”) at [30].68Foot Note 68×2D/3DCS at para 123.As will be seen from the passage, it does not deal with whether information has quality of confidence or if there is a breach of confidence, but on when an injunction is available. Hence, while I found that it was not applicable to the legal scenarios which the second and third defendants cited the passage for, I nevertheless consider it here. InWee Shou Woon(HC)at [30], the court had observed that “an injunction is only available before the documents have entered into evidence or otherwise have been relied upon at trial … [i]f a plaintiff desires to seek relief, he must do so before the matter falls out of the reach of equity (and the law of confidence) and passes into the realm of the law of evidence”. 93 In response to this, the plaintiff notes that the first and fourth defendants themselves have not taken the position that it is too late for the plaintiff to seek injunctive relief for the Copied Data, even for those utilised by them in the Matrimonial Proceedings. The plaintiff submits that thedictainWee Shou Woon (HC)was doubted by the Court of Appeal at [26], where the court held that “privileged material exhibited in an affidavit filed in respect of an application, which has yet to be heard, has not formally been admitted into evidence”. Hence, the documents exhibited by way of letter and not affidavit, to the Family Justice Court do not constitute “evidence”. In addition, the plaintiff submits that the affidavits filed have not entered into evidence in FCD 4639:69Foot Note 69×PRS at paras 233–243. (a)The firstdefendant’s AEIC filed on 14 August 2018 in FCD 4639 did not enter into evidence since it was for purposes of the divorce proceedings and the parties reached an agreement before trial, for divorce on uncontested basis. (b) The first defendant’s Affidavit of Assets and Means (“AAM”) filed on 14 February 2019 in FCD 4639 was filed for the purposes of the ancillary matters hearing, which is still pending. (c) The first Defendant’s Discovery Affidavit filed on 14 May 2019 in FCD 4639 was filed relating to division of matrimonial assets, which is still pending. 94 More broadly, the plaintiff submits thatat the hearing of the first and fourth defendants’ application to set aside theexparteInterim Injunction, the first and fourth defendants made the same request. This was rejected by Justice Andrew Ang, on the ground that the first defendant should not be rewarded for the wrong done by her sons in obtaining this information surreptitiously from the plaintiff.70Foot Note 70×PRS at para 701.The first and fourth defendants did not appeal against Justice Andrew Ang’s decision. They cannot now be allowed to have a second bite of the cherry. Moreover, as far as the first and the fourth defendants are concerned, nothing has changed from the time Justice Andrew Ang made the injunction order against them in September 2020 to the present stage. They elected not to participate in the trial. They offered no evidence. Therefore,their present position after the trial is no better than that which existed at the time Justice Andrew Ang made the Injunction Order against them in September 2020. Allowing the additional exceptions, would be to allow the first and the fourth defendants to take advantage of their own wrongs. The documents that the first and fourth defendants want to use in the Matrimonial Proceedings by way of exceptions to the Permanent Injunction, constitute all of the Copied Data that they have adduced in the Matrimonial Proceedings to date. If the wide exceptions sought by them are allowed, it will render the entire Permanent Injunction futile and useless. One of the primary reasons Justice Andrew Ang rejected the request for the exceptions to be broadened was that it would have the effect of undermining the entire injunction order itself, and he said: “[s]till, I think that the right balance in this particular case is not to overextend the wife’s right to the access to the documents such that – as I have heard Mr Liew – it then renders the injunction just something not worth the paper it’s written on.” 95 The court inTentat Singapore Pte Ltd v Multiple Granite Pte Ltdand others[2009] 1 SLR 42 (“Tentat”) held (at [40]) that: “[w]hen a document has become a part of the record in any court proceedings, the information in the document enters into the public domain, and it will be too late to preserve the privilege in the document.” InTentat, the court noted that reference to privileged information in the affidavit of a party was insufficient to be considered as having “entered into evidence”, as the case has not been heard. The filing of the affidavit was “preparatory to the admission of evidence”. In this case, orders have been made in FCD 4639, although they do not explicitly reference the documents mentioned at para 17 of the SOC. The plaintiff submits that the affidavits have not entered into evidence as they have not been heard on. As the first and fourth defendants have chosen not to participate in the trial, there is no evidence from them against this. 96  In any event, it is clear that while the affidavits were filed into court, there have been no request to inspect them. They were not disseminated to any third party apart from the court. This is also the position asserted by the first and fourth defendants.71Foot Note 71×1D/4DCS at para 93.It is also clear that the rest of the FCD 4639 Affidavits and Documents which are not on affidavit have not entered into evidence in FCD 4639 and were also not disseminated to any third party apart from the court. Consequently, the plaintiff is not prevented from seeking injunctive relief for such documents. However, the question remains as to whether the Permanent Injunction should cover these documents. 97  In response to the plaintiff’s argument that nothing has changed since the Interim Injunction to warrant variations to it, the first and fourth defendants submit that what has changed following the trial, is the evidence adduced at trial which confirms their limited role in the entire matter.72Foot Note 72×2D/3DRS at para 21.But given that they have chosen not to participate in the trial, it can hardly be said that there was robust evidence from them in this respect. The first and fourth defendants also submit that the trial has shown that a significant number of the alleged Copied Data are not confidential.73Foot Note 73×2D/3DRS at para 23(b).Again, the weight of this submission is severely undermined by the first and fourth defendant’s lack of participation in the trial. They chose not to contest the plaintiff’s action for breach of confidence. In any event, as I have stated earlier, I find that the overwhelming bulk of the Copied Data is confidential, subject to the minor exceptions mentioned. 98After examining the respective interests of the parties,I agree with the balance drawn by Justice Andrew Ang in theInterim Injunction, which is to allow for the first defendant to continue the use of the Copied Data only in relation to her AEIC for the divorce filed on 14 August 2018, her Affidavit of Assets and Means filed on 14 February 2019 and her Discovery Affidavit filed on 14 May 2019, but not for the other uses sought by the first and fourth defendant. This would limit the use of the Copied Data to the more substantive matters where the Copied Data has been filed into court as affidavits in FCD 4639, without rendering the injunction useless. I note that this is a position that the plaintiff has also proposed, if the court is minded to allow exceptions in the Permanent Injunction.74Foot Note 74×PRS at para 704.",
        "Damages": "99 In addition to the remedy of a permanent injunction and delivery up of the Copied Data, the plaintiff also claims against the defendants for general damages and special damages, and for damages for injury to feelings, pain and suffering (“damages for injury to feelings”).",
        "Whether the pleadings were amended to include damages in bad faith": "100 As a preliminary point, the first and fourth defendants submit that the plaintiff should not be allowed to claim for damages as his pleadings were amended in bad faith to include damages after the first and fourth defendants indicated that they were prepared to consent to an order for a permanent injunction. 101 Bad faith is usually considered when the court is deciding whether to grant leave to amend pleadings: seeSeow Teck Ming and another v Tan Ah Yeo and another and another appeal[1991] 2 SLR(R) 38 at [34]. Once the amendment has been made, the question of bad faith should not affect the claim, unless the defendant is asking for it to be struck out for,inter alia, being scandalous under O 18 r 19(1) of the Rules of Court (2014 Rev Ed) (“Rules of Court”). Further, the court’s concern in relation to pleadings is ultimately with regard to prejudice caused to the other party. The amendment and the submission on bad faith was considered in SUM 1928/2021. The amendment was allowed by the Court. I thus find that there is no question of bad faith precluding the plaintiff from now seeking damages.",
        "Whether relief for damages was sufficiently pleaded": "102 The defendants submit that the plaintiff has not provided sufficient particulars in the SOC for general damages.75Foot Note 75×2D/3DCS at para 194; 1D/4DCS at para 19.Neither has the plaintiff computed such damages even though “costs incurred in dealing with various matters” should be easily ascertainable.76Foot Note 76×2D/3DCS at para 197.No details were given at all in respect of the special damages claim, for damages for injury to feelings. Only a bare assertion was made. 103 The plaintiff citesThe Shravan[1999] 2 SLR(R) 713 at [77] to support its position that general damages “may be averred generally”.77Foot Note 77×PRS at para 565.However, a distinction has been made where damages are of a kind that are not the necessary and immediate consequence of a wrongful act. Damages do not immediately and naturally flow from a breach of confidence. InI-Admin, the court highlighted (at [72]–[73]) the difficulties with quantifying monetary remedies for breach of confidential information. It also observed (at [68]) that “[i]njunctions and interim injunctions are often regarded as vital remedies in confidence cases because they operate to contain the damage suffered from the loss of confidentiality”. 104 InSingapore Civil Procedureat paras 18/12/13 and 18/12/44, citingPerestrello e Companhia Limitada v United Paint Co Ltd; Same v Same[1969] 1 WLR 570, it is stated that: Where the plaintiff claims that he has suffered damage,i.e.injury, of a kind which is not the necessary and immediate consequence of the wrongful act, it is his duty to plead full particulars to show the nature and extent of the damages,i.e.the amount which he claims to be recoverable, irrespective of whether they are general or special damages, so as to fairly inform the defendant of the case he has to meet and to assist him in computing a payment into court, and the mere statement or prayer that he claims “damages” will not support a claim for such damages… . … The plaintiff will not be allowed at the trial to give evidence of any special damage which is not claimed explicitly, either in his pleading or particulars … Special damage in the sense of a monetary loss which the plaintiff has sustained up to the date of trial must be pleaded and particularised, otherwise it cannot be recovered. … If special damage be claimed in the statement of claim, but not with sufficient detail, particulars will be ordered with dates and items;e.g.if the plaintiff alleges that certain customers have ceased to deal with him, he must give their names, or his allegation will be struck out. … 105 Further, inBiofuel Industries Pte Ltd v V8 Environmental Pte Ltd and another appeal[2018] 2 SLR 199 at [41], the Court of Appeal held that “a claimant cannot make a claim for damages without placing before the court sufficient evidence of thequantumof loss it had suffered, even if it would otherwise have been entitled in principle to recover damages”[emphasis in original]. 106 In this case, it is clear from the pleadings that the plaintiff has not sufficiently pleaded or particularised his relief for damages. There are no particulars or computation for general damages, nor were there any details in respect of the special damages claim for damages for injuries to feelings or the costs allegedly incurred by the plaintiff in the Matrimonial Proceedings and Trust Proceedings.",
        "Whether damages for injury to feelings should be awarded": "107 Although special damages were not sufficiently pleaded by the plaintiff, I also examined for completeness, if they could be awarded here if properly pleaded. It was held inI-Adminat [68]–[70] that injunctions and delivery up are vital remedies. The court also noted inI-Adminthat these remedies do not set right the loss already suffered, but equitable monetary remedies do not guarantee more ideal outcomes. The reason is that it is wildly speculative to determine how much of the profits came from the defendant’s own capital, given that it has been intermingled with the confidential information. In addition, the concern inI-Adminwas what kind of remedy would place the plaintiff in a position if the duty of confidence had not been breached. The court there was not concerned with damages for injury to feelings and pain and suffering.I-Admintherefore does not assist the plaintiff in this regard. 108 There are no local reported cases concerning the award of damages for injury to feelings due to breach of confidence. The plaintiff relies on three cases,Archer vWilliams[2003] EWHC 1670 (QB) (“Archer”),Cornelius v De Taranto[2001] EWCA Civ 1511 (“Cornelius”) andHarry Royston Cole v The Chief Officer of the States of Jersey Police[2007] JRC 240 (“Harry Royston”).78Foot Note 78×PRS at paras 481 and 482. 109 Amongst this trio of cases, the main case isCornelius. InArcherat [75], the court relied onCorneliusas the authority to award damages for injury to feelings due to breach of confidence. InCornelius, the court recognised (at [77]) that damages for injury to feelings or pain and suffering was “a novel instance of such a remedy”.79Foot Note 79×PRS at para 479.The decision there was premised upon Article 8 of the Convention for the Protection of Human Rights and Fundamental Freedoms 1950 (also known as the European Convention on Human Rights (“ECHR”)). At [66], the court noted that: … it would be a hollow protection of that right if in a particular case in breach of confidence without consent details of the confider’s private and family life were disclosed by the confidant to others and the only remedy that the law of England allowed was nominal damages. In this case an injunction or order for delivery up of all copies of the medico-legal report against the defendant will be of little use to the claimant. The damage has been done. The details of the claimant’s private and family life are within the archives of the National Health Service and she has been unable to retrieve them. The Jersey case ofHarry Roystonalso referred toArcherandCorneliusas authority. 110 Two observations can be made from the above. First, the decision inCorneliuswas premised on Art 8 of the ECHR, which protects the “right to respect for his private and family life, his home and his correspondence”. The plaintiff cites the Australian case ofGiller v Procopets(2008) 24 VR 1 (“Giller”) which held (at [431]) that the basis for damages for distress caused by a breach of confidence is the Lord Cairns’ Act, which he submits isinpari materiawith para 14 of the First Schedule to the Supreme Court of Judicature Act (“SCJA”). The plaintiff submits that there is therefore juridical basis to award damages for injury to feelings caused by breach of confidence, based on para 14 of the First Schedule of the SCJA.80Foot Note 80×PRS at para 429–435.While I agree that there is such juridical basis in the SCJA, the point arising fromCorneliusis not that it derived its juridical basis from Art 8 of the ECHR, but that in its reasoning, the court inCorneliuswas consciously seeking to ensure that the protection of the rights guaranteed under Art 8 of the ECHR was not made “hollow”. Singapore has not signed or ratified the ECHR. There is no corresponding need to ensure effective protection of any rights under Art 8 of the ECHR. 111 Second, the court inCorneliuswas concerned with the fact that injunctions and delivery up cannot right the wrong done to the plaintiff because the confidential information had already been irretrievably released into the public domain. The other two English cases cited by the plaintiff,ArcherandHarry Roystonalso involved dissemination of confidential information into the public domain, in the form of the press. In contrast, there is no dissemination here of the Copied Data to third parties other than the court. In this case, injunctions and delivery up can right the wrong done to the plaintiff. 112 Moreover, the plaintiff has failed to substantiate with evidence, his claim that he has suffered any injury to his feelings, and pain and suffering, beyond a bare assertion in his AEIC.81Foot Note 81×Plaintiff’s AEIC at para 111.Neither has the plaintiff shown that any such injury to feelings is caused by the breach of confidence. If anything, it appears that the hurt of the plaintiff pertains primarily to his feelings about the breakdown in his relationship with his family leading to him leaving the Matrimonial Home, as seen from the grievances he shared extensively in court,82Foot Note 82×NE 27 July 2021 at p 107 ln 8–p 117 ln 8.rather than the breach of confidence specifically. The plaintiff citesRobertson Quay Investment Pte Ltd v Steen Consultants Pte Ltd[2008] 2 SLR(R) 623 at [28] and [30] in support of a flexible approach to the proof of damage as “[d]ifferent occasions may call for different evidence with regards to certainty of proof, depending on the circumstances of the case and the nature of the damages claimed.”83Foot Note 83×PRS at paras 628–635.However, in this case, flexibility on different types of evidence does not even arise, as the plaintiff has not even substantiated his claim at all with evidence beyond a bare assertion. 113 I therefore find no legal or evidential grounds for the plaintiff’s claim for damages for injury to feelings and dismiss it.",
        "Whether damages for costs in Matrimonial Proceedings and Trust Proceedings should be awarded": "114 I find that the plaintiff is not entitled to special damages in respect of costs incurred in the Matrimonial Proceedings and Trust Proceedings. 115 First, the plaintiff has not properly and adequately pleaded such special damages, as he had failed to plead the costs incurred by the plaintiff in dealing with the Matrimonial Proceedings or the Trust Proceedings. Neither has he pleaded how such costs are consequential upon the breaches alleged in this Suit. Even in the plaintiff’s AEIC, the plaintiff has only made bare assertions that he should be “reimburse[d]” for all the reasonable costs that he had incurred, without giving any further details.84Foot Note 84×Plaintiff’s AEIC at para 117. 116 Second, such costs incurred by the plaintiff in the Matrimonial Proceedings would have been incurred by the plaintiff in any event, pursuant to his duty to make full and frank disclosure of his matrimonial assets, regardless of whether the Copied Data was used or relied on. 117 Third, I find that the Copied Data was not used by the first and fourth defendants in the Trust Proceedings. The plaintiff submitted that the specificity in the first defendant’s request for eight documents (as identified in Exhibit PE1 and which are allegedly part of the Copied Data) during the Trust Proceedings must mean that she had already seen these documents from the Copied Data.85Foot Note 85×NE 28 July 2021 at pp 108–109; Exhibit PE1. (a) However, for six of the eight documents in Exhibit PE1, it has not been shown that they were from or even correlate to the Copied Data.86Foot Note 86×NE 28 July 2021 at pp 114–115.The fourth defendant explained that PE1 was formulated on the basis of a two-page Trust statement in one of his affidavits dated 18 August 2018 for the Trust Proceedings and which was given by the plaintiff to the defendants sometime around 16 May 2018 by email.87Foot Note 87×NE 28 July 2021 at p 116. (b)The two remaining documents were the Last Will and Testament of the plaintiff’s deceased father (“Will of plaintiff’s father”) and a shareholder’s agreement dated 2 August 2002. The Will of the plaintiff’s father was provided to the first defendant by the plaintiff’s lawyers before the commencement of the Trust Proceedings sometime around 16 November 2016. It was explained that the shareholder’s agreement was provided by another lawyer (Mr Esvaran) representing the whole family around early 2017 during a “divestment exercise” prior to the commencement of the Trust Proceedings.88Foot Note 88×NE 28 July 2021 at pp 117 and 121.",
        "Whether equitable damages / equitable compensation should be awarded": "118 The plaintiff also seeks equitable damages, but he has not tendered any evidence supporting this claim or provided any preliminary quantification. Given the paucity of supporting evidence, the plaintiff seeks for equitable damages to be referred to for assessment.89Foot Note 89×PCS at para 499.However, as rightly pointed out by the defendants,90Foot Note 90×2D/3DRS at para 81 and 1D/4DRS at para 6.this trial was not bifurcated, which means that any award for damages awarded is to be assessed based on evidence led at the trial. The plaintiffs were aware of this from the outset. 119 The first and fourth defendants highlight that bothI-AdminandClearlabare cases dealing with the use of confidential information in a commercial context and it is unclear whether the reliefs of equitable compensation and equitable damages are available to the plaintiff where the confidential information relates to personal information taken in a personal or family setting. Even if such reliefs are available, they submit that these reliefs should not be awarded in the circumstances of this case. The first and fourth defendants further submit that the Copied Data was only used for the Matrimonial Proceedings. They did not profit from the use of the Copied Data, as these are documents which the plaintiff was legally obliged to disclose in any event in the Matrimonial Proceedings pursuant to his duty to make full and frank disclosure of the matrimonial assets. 120 In addition, the second and third defendants citeShiffon Creations (Singapore) Pte Ltd v Tong Lee Co Pte Ltd[1990] 2 SLR(R) 472, where the court held (at [23]) that the general rule is that an award for damages in lieu of equitable relief would be granted only in exceptional situations.91Foot Note 91×2D/3DCS at para 224. 121 In the present case, no such exceptional situation exists for the grant of equitable damages in lieu of an injunction, not to mention in addition to an injunction (which the plaintiff also seeks). The defendants have delivered up all the Copied Data, in hardcopy and/or electronic form. There is also a Permanent Injunction which prevents further use of the Copied Data. Any award of equitable damages would amount to “double recovery” for the plaintiff. The only exception allowed in the Permanent Injunction is with respect to the parts of the Copied Data that were exhibited in the three affidavits filed in FCD 4639. However, while there may not be double recovery in respect of these documents, there is no loss to the plaintiff since these are documents that the plaintiff was legally obliged to disclose in any event in FCD 4639 pursuant to his duty to make full and frank disclosure in the Matrimonial Proceedings. I agree with the defendants that the plaintiff’s right to preserve confidentiality of the Copied Data has been adequately vindicated by way of the Permanent Injunction and order for delivery up. Hence, the plaintiff is not entitled to any further relief for equitable damages or equitable compensation. Conclusion 122 In conclusion, I find the second and third defendants liable to the plaintiff for breach of confidence in respect of the Copied Data (excluding the Non-Confidential documents from the Copied Data as found at [54]). The terms of the Permanent Injunction will be on same terms as that ordered in the Interim Injunction dated 14 September 2020. I dismiss the plaintiff’s claims for damages. 123 I will hear the parties on costs. Kwek Mean LuckJudicial Commissioner Kanapathi Pillai Nirumalan, Liew Teck Huat, Ow Jiang Meng Benjamin, Bryan Looy Chye Shen and Phang Cunkuang (Niru & Co LLC) for the plaintiff; Alvin Yeo SC, Chang Man Phing, Gavin Neo Jia Cheng and Khoo Kiah Min Jolyn (WongPartnership LLP) for the first and fourth defendants; Derek Kang Yu Hsien and Lim Shi Zheng Lucas (Cairnhill Law LLC) for the second and third defendants."
    }
}