{
    "case_title": "Christie, Hamish Alexander (as private trustee in bankruptcy of Tan Boon Kian)vTan Boon Kian and others",
    "ncitation": "[2021] SGHC 62",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1 The first respondent, Mr Tan Boon Kian (the “Bankrupt”), was a man of substantial personal net worth and the Group Chairman of the Cairnhill Group of Companies.1Foot Note 1×Second Affidavit of Hamish Alexander Christie (“Second Affidavit of HAC”), at para 8.On 7 March 2018, a bankruptcy application was filed against him.2Foot Note 2×Originating Summons (Creditor’s Bankruptcy Application) filed on 7 March 2018.Subsequently, on 19 April 2018, he was declared bankrupt.3Foot Note 3×ORC 2654/2018. 2 In the two years preceding the filing of the bankruptcy application, the Bankrupt had transferred substantial sums of money to the following family members: the second respondent, Mr Tan Boon Hock (“TBH”); the third respondent, Mdm Tan Poh Swan (“TPS”); and the fourth respondent, Ms Tan Seo Teng Felicia (“FT”). I shall refer to them collectively as the “Recipients”. The details of these transfers (which I shall refer to collectively as the “Transfers”) are as follows: (a) On 18 January 2017, the Bankrupt transferred S$250,000 to his sister, TPS. This was effected by a cheque dated 16 January 2017, which was cleared on 18 January 2017.4Foot Note 4×Second Affidavit of HAC, at paras 4(c) and 35 and Exhibit HAC-12 at p 263. (b) On 18 January 2017, the Bankrupt transferred S$150,000 to his brother, TBH. This was effected by a cheque dated 17 January 2017, which was cleared on 18 January 2017.5Foot Note 5×Second Affidavit of HAC, at paras 4(a) and 20 and Exhibit HAC-7 at p 107. (c) On 1 November 2016 and 25 January 2017, the Bankrupt transferred a total of S$100,000 to his daughter, FT. This was effected by two cheques for S$50,000 each: a cheque dated 26 October 2016, which was cleared on 1 November 2016, and another cheque dated 17 January 2017, which was cleared on 25 January 2017.6Foot Note 6×Second Affidavit of HAC, at paras 4(e) and 48 and Exhibit HAC-15 at pp 281–282; Affidavit of Tan Seo Teng Felicia (“Affidavit of FT”), at para 12.This aggregated sum was spent by FT on her wedding banquet at the Ritz-Carlton hotel, which was held on 9 December 2016.7Foot Note 7×Affidavit of FT, at paras 10 and 25. 3 By an Order of Court dated 18 December 2018,8Foot Note 8×HC/ORC 8381/2018.Mr Hamish Alexander Christie was appointed as the trustee of the Bankrupt’s bankruptcy estate (the “Private Trustee”). The Private Trustee commenced this application (“SUM 5249/2020”) for declarations that the Transfers are void under ss 98 and/or 99 of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (the “Act”) as the transactions entered into with FT were undervalued and the payments to TPS and TBH were unfair preferences. The Private Trustee also seeks court orders for each of the Recipients to transfer the sums received to the Private Trustee within 14 days of the orders.9Foot Note 9×HC/SUM 5249/2020.",
        "The parties’ cases": "",
        "The Private Trustee’s case": "4 The Private Trustee submits that the Bankrupt was “utterly and indisputably insolvent” at the time of the Transfers.10Foot Note 10×Applicant’s Written Submissions (“PTS”), at paras 3 and 37. 5 In respect of the moneys transferred by the Bankrupt to TPS and TBH, the Private Trustee’s case is that the transfers of S$250,000 and S$150,000 respectively were unfair preferences. TPS and TBH were (and continue to be) unsecured creditors of the Bankrupt and these transfers improved their position in the Bankrupt’s bankruptcy regime relative to the other unsecured creditors, thereby giving both of them an unfair preference.11Foot Note 11×PTS, at para 75.Further, TPS and TBH are “associates” of the Bankrupt as they are his siblings. Hence, the Private Trustee submits that the Bankrupt is statutorily presumed to have been influenced by a desire to prefer them over other creditors. The burden is on TPS and TBH to rebut this presumption on a balance of probabilities.12Foot Note 12×PTS, at paras 76–85.The Private Trustee asserts that they have failed to rebut this presumption. 6 In respect of the moneys transferred to FT, the Private Trustee submits that the transfers amounting to S$100,000 were transactions at an undervalue because they were gifts from the Bankrupt. Alternatively, these transactions were entered into with FT on terms that provided for the Bankrupt to receive no consideration, or the consideration received by the Bankrupt in these transactions was significantly less than the value of the consideration provided by FT.13Foot Note 13×PTS, at para 89.The Private Trustee accepts that the court has the discretion under s 98(2) of the Act to decline to make an order to restore the position to what it would have been if the Bankrupt had not entered into these transactions. However, he contends that the facts of this case do not warrant the court to exercise this discretion.14Foot Note 14×Applicant’s Supplemental Submissions (“PTSS”), at paras 2 and 16–20.",
        "TPS’s and TBH’s cases": "7 TPS and TBH contend that the transfers to them should not be avoided as the Bankrupt was not insolvent at the time of the transfers to them15Foot Note 15×Second and Third Respondents’ Skeleton Submissions (“TBHS”), at paras 2(a) and 31–61.and that these transfers were not influenced by any desire on the part of the Bankrupt to unfairly favour them.16Foot Note 16×TBHS, at paras 2(c) and 62–69.",
        "FT’s case": "8 FT, like TPS and TBH, contends that the Bankrupt was not insolvent at the time of the transfers to her.17Foot Note 17×Fourth Respondent’s Skeletal Submissions (“FTS”), at para 4.Further, FT submits that even if the Bankrupt was insolvent at the relevant time, the transfers to her should not be declared void and she should not be required to transfer the S$100,000 she received to the Private Trustee, because such an order would have a “significant and wholly disproportionate effect” on her and would be unjust.18Foot Note 18×FTS, at paras 5–12.",
        "The applicable law": "9 As a preliminary point, I note that this application was made under the provisions of the Bankruptcy Act, which has since been repealed. The statutory provisions governing transactions at an undervalue and unfair preferences are now contained in ss 361–365 of the Insolvency, Restructuring and Dissolution Act 2018 (Act 40 of 2018) (“IRDA”). These statutory provisions under the Bankruptcy Act and the IRDA are substantially the same. Hence, the issues arising in this application would not have been resolved differently under the equivalent IRDA provisions.",
        "Unfair preferences": "10 Where an individual is adjudged bankrupt and he has, at the relevant time (as defined in s 100 of the Act), given an unfair preference to any person (the “recipient”), the private trustee in bankruptcy may apply to the court to make such order as it thinks fit for restoring the position to what it would have been if that individual had not given that unfair preference (s 99(1) (read with s 36) and s 99(2) of the Act). 11 Where the recipient is an associate of the individual, the relevant time to claw back the moneys is the period of two years prior to the day of the making of the bankruptcy application on which the individual is adjudged bankrupt (s 100(1)(b)(ii) of the Act). An “associate” includes a relative of the individual, which in turn includes his brother, sister, and lineal descendant (ss 101(2) and 101(7) of the Act). I shall refer to this two-year period as the “clawback period for unfair preferences”. 12 Further, the individual must have either (a) been insolvent at the relevant time of the preference, or (b) become insolvent in consequence of the preference (s 100(2) of the Act). 13 Pursuant to s 99(3) of the Act, an individual gives an unfair preference to the recipient if: (a) the recipient is one of the individual’s creditors or a surety or guarantor for any of his debts or other liabilities; and (b) the individual does anything or suffers anything to be done which (in either case) has the effect of putting the recipient into a position which, in the event of the individual’s bankruptcy, will be better than the position the recipient would otherwise have been in. 14 In addition, pursuant to s 99(4) of the Act, the court will only make an order if the individual who gave the preference was influenced, in deciding to give it, by a desire to produce in relation to the recipient the effect of putting the recipient into a position which, in the event of the individual’s bankruptcy, will be better than the position the recipient would have been in if the preference had not been given. For convenience, I shall refer to this as the “desire to prefer”. Where the recipient was an associate of the individual at the time the unfair preference was given, such a desire to prefer will bepresumedunless the contrary is shown (s 99(5) of the Act).",
        "Transactions at an undervalue": "15 Where an individual is adjudged bankrupt and he has, at the relevant time (as defined in s 100 of the Act), entered into a transaction with any person at an undervalue, the private trustee in bankruptcy may apply to the court to make such order as it thinks fit for restoring the position to what it would have been if that individual had not entered into that transaction (s 98(1) (read with s 36) and s 98(2) of the Act). 16 The relevant time is the period of five years before the day of the making of the bankruptcy application on which the individual is adjudged bankrupt (s 100(1)(a)(ii) of the Act). I shall refer to this five-year period as the “clawback period for undervalue transactions”. 17 As is the case with unfair preferences, the individual must have either (a) been insolvent at the relevant time, or (b) become insolvent in consequence of the transaction (s 100(2) of the Act). However, where the transaction was entered into with an associate of the individual, these requirements arepresumedto be satisfied unless the contrary is shown (s 100(3) of the Act). 18 Section 98(3) of the Act sets out the situations in which an individual will be considered to have entered into a transaction at an undervalue. Two situations are potentially relevant in this case: gifts or transactions on terms that provide for the individual to receive no consideration (s 98(3)(a)) and transactions for consideration the value of which (in money or money’s worth) is significantly less than the value of the consideration provided by the individual (s 98(3)(c)).",
        "Issues to be determined": "19 It is not disputed that TPS, TBH and FT are associates of the Bankrupt, as they are his sister, his brother and his daughter respectively.19Foot Note 19×PTS, at para 2(b); TBHS, at paras 16 and 63.The timing and quantum of the Transfers to the three Recipients are also not disputed.20Foot Note 20×PTS, at para 2(a); TBHS, at para 11; FTS, at para 4 (read with Affidavit of FT, at para 12).It is, therefore, clear that the Transfers took place within the applicable clawback period for unfair preferences and the applicable clawback period for undervalue transactions.21Foot Note 21×PTS, at paras 72–74 and 86–88. 20 Further, the parties do not dispute that TPS and TBH were creditors of the Bankrupt. The transfers to themin factput them in a better position upon his bankruptcy than they would otherwise have been in (as the moneys they received were partial repayments of the outstanding loans they had extended to the Bankrupt).22Foot Note 22×PTS, at paras 17, 20 and 75.This suffices to establish an unfair preference within the statutory definition in s 99(3) of the Act. 21 The central issues to be determined in this case are, therefore, as follows: (a) whether the Bankrupt was insolvent at the time of the Transfers; (b) whether the Bankrupt was influenced by a desire to prefer when he made the transfers to TPS and TBH; (c) whether the transfers to FT were transactions at an undervalue; and (d) if the transfers to FT were indeed transactions at an undervalue, whether I should nevertheless decline to make the order sought by the Private Trustee in the circumstances of her case.",
        "My decision": "",
        "Whether the Bankrupt was insolvent at the time of the Transfers": "22 I shall first deal with the issue of whether the Bankrupt was insolvent at the time of the Transfers,ie, in November 2016 and January 2017. 23 Pursuant to s 100(4) of the Act, an individual is insolvent for the purposes of ss 98 and 99 if either of the following conditions is satisfied: (a) he is unable to pay his debts as they fall due, or (b) the value of his assets is less than the amount of his liabilities, taking into account his contingent and prospective liabilities. For convenience, I shall refer to these conditions as the “cash flow test” and the “balance sheet test” respectively, even though these terms are more commonly used in relation to companies (seeParakouShipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 15 at [64]). It is well established that these two tests are to be read disjunctively, so that the Bankrupt will be held to be insolvent as long as one of the two tests is satisfied (seeLiving the Link Pte Ltd (in creditors’ voluntary liquidation) and others v Tan Lay Tin Tina and others[2016] 3 SLR 621 (“Living the Link”) at [26] andCCM Industrial Pte Ltd (in liquidation) v ChanPui Yee[2016] SGHC 231 at [15]). 24 Before I deal with the application of the two tests for insolvency in the present case, I wish to reiterate that the Bankrupt’s insolvency at the time of the transfers toFTcan be presumed under s 100(3) of the Act unless the contrary is shown. This is because the Private Trustee is seeking to impugn these transfers on the basis that they were transactions at an undervalue23Foot Note 23×PTS, at paras 86 and 89.and FT was an associate of the Bankrupt (by virtue of being his daughter). FT, therefore, bears the burden of proving, on a balance of probabilities, that the Bankrupt wasnotinsolvent at the time of the transfers to her. In her submissions, FT argues that the Bankrupt was not insolvent when the transfers to her were made, for the reasons set out in the Bankrupt’s first affidavit.24Foot Note 24×FTS, at para 4.As these reasons are substantially reproduced in TPS’s and TBH’s submissions, I shall consider the issue of whether FT has discharged her burden of proving that the Bankrupt was not insolvent together with the issue of whether the Private Trustee has proven, on a balance of probabilities, that the Bankrupt was insolvent for the purposes of the application against TPS and TBH. In this case, these issues are two sides of the same coin. The cash flow test 25 Under s 100(4)(a) of the Act, an individual is cash flow insolvent if he is unable to pay his debts as they fall due. Cash flow insolvency will be established if the individual was “pressed for payments at the material time … and had not been able to pay” (seeLiving the Linkat [27], citingLeunWah Electric Co (Pte) Ltd (in liquidation) v Sigma Cable Co (Pte) Ltd[2006] 3 SLR(R) 227 at [8]). For a debt to be taken into account in the cash flow insolvency test, there must have been some form of demand or request for payment: “even debts which are technically due are to be ignored where there is no current indication that the creditors concerned are requiring repayment” (Goode onPrinciples of Corporate Insolvency Law(Kristin van Zweiten gen ed) (Sweet & Maxwell, 5th Ed, 2018) (“Goode”) at para 4–19, an earlier edition of which was cited with approval inSeahChee Wan and another v Connectus Group Pte Ltd[2019] SGHC 228 at [107]). In this regard, I find the observations of Prof Ian F Fletcher inThe Law of Insolvency(Sweet & Maxwell, 3rd Ed, 2002) at para 20-017, which were cited with approval inLiving the Linkat [27], instructive: As proof of the debtor company’s state of illiquidity, it will suffice to exhibit to the court some evidence – conveniently, often, in the form of correspondence – showing anunequivocal request for payment made by the creditor, and anabsence of anybona fidedispute as to indebtednesson the part of the debtor. [emphasis added] Although these observations were made in relation to insolvent companies, they are, in my view, equally applicable to insolvent individuals. 26 The Private Trustee submits that the Bankrupt was cash flow insolvent at the time of the Transfers as he was unable to pay his debts as they fell due.25Foot Note 25×PTS, at para 37(b).The Private Trustee relies on the following facts: (a) Most of the Bankrupt’s assets were illiquid in nature and could not easily be utilised to discharge his debts as they fell due.26Foot Note 26×PTS, at para 66. (b) TPS and TBH had made several loans to the Bankrupt which had fallen due for repayment but had not been repaid:27Foot Note 27×PTS, at para 67; Second Affidavit of HAC, Exhibit HAC-6, at pp 72–105 and Exhibit HAC-11, at pp 196–261. (i) a loan of RM2,438,192.69 made by TPS on 1 February 2014, which the Bankrupt was to repay in 100 monthly instalments commencing on 1 March 2014; (ii) a loan of S$1,250,000 made by TPS on 2 March 2012, which the Bankrupt was to repay by 1 March 2013; (iii) a loan of S$1,000,000 made by TPS on 7 November 2012, which the Bankrupt was to repay by 6 December 2012; (iv) a loan of S$239,750 made by TPS on 27 July 2015, which the Bankrupt was to repay by the end of 2015; (v) a loan of RM4,958,746.10 made by TBH on 1 February 2014, which the Bankrupt was to repay in 100 monthly instalments commencing on 1 March 2014; (vi) a loan of S$974,189.64 made by TBH on 25 December 2012, which the Bankrupt was to repay in 100 monthly instalments commencing on 1 January 2013; and (vii) a loan of S$239,750 made by TBH on 27 July 2015, which the Bankrupt was to repay by the end of 2015. (c) Although the Bankrupt deposed that his family members who had made loans to him, including TBH and TPS, were prepared to give him time to repay them, the Private Trustee submits that it is “hard to believe that TBH and TPS (as well as the rest of the Bankrupt’s family members) would not have made any demands for repayment of the loans, especially where clear repayment timelines were stipulated in most of the loans, and the amount outstanding was a substantial sum”.28Foot Note 28×PTS, at para 69.In this regard, the Private Trustee also relies on the letter to the Bankrupt from Allen & Gledhill LLP dated 8 March 2017 (the “A&G Letter of Demand”), which stated in “clear and unequivocal” terms the Bankrupt’s family members’ demand for him to make immediate repayment of his debts of RM21,708,144.50 and S$13,314,949.38 within seven days from the date of the letter.29Foot Note 29×PTS, at para 69; Second Affidavit of HAC, Exhibit HAC-18, pp 306–309, at para 9.The Private Trustee further relies on the minutes of a meeting on 10 May 2019 which record the Bankrupt’s statement that his relationship with TPS had gone sour over the years due to money-related matters.30Foot Note 30×PTS, at para 69; First Affidavit of Tan Boon Kian (“First Affidavit of TBK”), Exhibit TBK-4, p 68, at para 30.Notwithstanding the A&G Letter of Demand, these debts remain substantially unpaid to date. (d) In their letters to the Bankrupt dated 25 August 2016 and 3 October 2016, Harry Elias Partnership LLP (“HEP”) had requested the payment of their bills amounting to an aggregate sum of S$212,136.45. In particular, in their letter dated 3 October 2016, HEP stated that they “look[ed] forward to [the Bankrupt’s] early settlement” of their bills.31Foot Note 31×PTS, at para 68; Third Affidavit of Hamish Alexander Christie (“Third Affidavit of HAC”), Exhibit HAC-31, Annex B, at pp 459–464 (see, in particular, p 463 at paras 5–6).However, these debts remain substantially unpaid to date. 27 On the other hand, TPS and TBH contend that the Private Trustee has failed to discharge his legal burden of proving, on a balance of probabilities, that the cash flow test of insolvency was satisfied at the time of the Transfers. They rely on the following: (a) In January 2017, none of the Bankrupt’s family members were pressing him for payment. They were all prepared to give him time to sell his assets to repay them in full. The first and only time the Bankrupt’s family members sent him a formal demand letter for the repayment of their loans was in March 2017 (afterthe Bankrupt made the Transfers), in the A&G Letter of Demand. The A&G Letter of Demand was triggered by concerns arising from the impending finalisation of the Bankrupt’s divorce settlement with his ex-wife, and no further action was taken by any family member after the A&G Letter of Demand.32Foot Note 32×TBHS, at paras 34(a)–34(b). (b) The Bankrupt’s liabilities to non-family creditors in January 2017 were not significant. There is no evidence that any of the Bankrupt’s non-family creditors had pressed him for payment as at January 2017.33Foot Note 33×TBHS, at paras 34(c)–34(d). (c) The Bankrupt’s various contingent liabilities remained contingent up to the point at which the Bankrupt was made a bankrupt, and there were no demands for repayment of these contingent liabilities at the time of the Transfers.34Foot Note 34×TBHS, at para 34(e). 28 On the evidence before me, I am satisfied that, on a balance of probabilities, the Bankrupt was cash flow insolvent at the time of the Transfers. I accept that the Bankrupt’s family members might have been prepared to give him time to repay the loans they had extended to him, such that – even though they were technically due – the Bankrupt might not have been pressed to repay the loans from TPS and TBH (as set out at [26(b)] above) as at January 2017. However, HEP’s letters dated 25 August 2016 and 3 October 2016 contained unequivocal and repeated requests for the payment of their bills, which were not disputed by the Bankrupt. Further, as at 10 February 2017, two of those bills – Bill Number 128672 dated 23 August 2016 (under which the Bankrupt owed HEP S$86,474.9935Foot Note 35×Third Affidavit of HAC, Exhibit HAC-31, Annex B, p 459, at para 2.) and Bill Number 129194 dated 28 September 2016 (under which the Bankrupt owed HEP S$60,360.1836Foot Note 36×Third Affidavit of HAC, Exhibit HAC-31, Annex B, p 462, at para 2.) – remained entirely unpaid.37Foot Note 37×Third Affidavit of HAC, Exhibit HAC-31, Annex B, p 465, at para 5.Furthermore, although the A&G Letter of Demand was sent to the Bankrupt in March 2017, this was very close to the Transfers in January 2017. This indicates that the Bankrupt was already unable to fulfil the demands set out in the A&G Letter of Demand. Thus, contrary to TPS’s and TBH’s assertions, there is indeed evidence that at least one of the Bankrupt’s non-family creditors had pressed him for payment of a significant sum by the time of the Transfers and that he had been unable to pay. 29 Counsel for TPS and TBH argues that the Bankrupt’s non-payment of HEP’s bills does not show that he was unable to pay his debts as they fell due. He stresses that HEP continued to act for the Bankrupt and did not press him for payment and that it is not unusual for clients not to pay their solicitors’ bills promptly, especially since clients may wish to apply for such bills to be taxed. However, I do not find these arguments persuasive. The fact that HEP continued to act for the Bankrupt does not indicate that their letters were merely reminders rather than unequivocal requests for payment. HEP did not press for payment vigorously as HEP were unaware that the Bankrupt was insolvent at that time. If HEP had suspected that their bills would not be paid because the Bankrupt was insolvent or faced financial difficulty, HEP would have insisted that their bills be paid before it would continue to represent the Bankrupt. 30 The Bankrupt offered no explanation for his non-payment of these bills, other than stating that HEP were “always prepared to give [him] time to pay”.38Foot Note 38×First Affidavit of TBK, at para 23(c).Neither the Bankrupt nor any of the Recipients suggested that the reason for non-payment was that the Bankrupt wished to have HEP’s bills taxed. A plain reading of HEP’s letters belies the Bankrupt’s claim that HEP were prepared to give him time to pay these bills. 31 Therefore, applying the cash flow test, I find that the Bankrupt was insolvent at the time of the Transfers in November 2016 and January 2017. 32 In view of this, it is not strictly necessary for me to determine whether the balance sheet test for insolvency is also satisfied. As I have noted at [23] above, the two tests are disjunctive and not conjunctive. The remarks of Steven Chong J (as he then was) inLiving the Link(at [28]) are particularly apposite in the present case: “no matter how asset rich the company might be, it will still fail the cash flow test and be held to be insolvent under s 100(4) of the [Act] if it is proved that the company was unable to pay its debts as they fell due”. These remarks apply equally to individuals. Nevertheless, since the parties have made extensive submissions on the balance sheet test, I shall also address whether the Bankrupt failed the balance sheet test at the time of the Transfers. The balance sheet test 33 Under s 100(4)(b) of the Act, an individual is balance sheet insolvent if the value of his assets is less than the amount of his liabilities, taking into account his contingent and prospective liabilities. The Private Trustee submits that the Bankrupt was balance sheet insolvent at the time of the Transfers as the value of his assets was less than the amount of his liabilities.39Foot Note 39×PTS, at paras 37(a) and 61.On the other hand, the Recipients contend that the Bankrupt’s net assets at that time “comfortably exceed[ed]” his net liabilities.40Foot Note 40×TBHS, at para 61.As this stark divergence in the parties’ positions arose from their differing valuations of the Bankrupt’s main assets and liabilities,41Foot Note 41×PTS, at paras 39–56; TBHS, at paras 39–55.I shall deal with each of these assets and liabilities in turn. (1) The Bankrupt’s assets 34 It is common ground that the Bankrupt’s main assets at the time of the Transfers were: (a) his indirect ownership of the Le Meridien luxury hotel in Sentosa (the “Hotel”); (b) the property at 17 White House Park (the “White House Park Property”); (c) the property at 278 Ocean Drive, #07-10 The Coast (the “Ocean Drive Property”); and (d) the property at Apt 1303, Royal Domain Tower, 368 St Kilda Road, Melbourne, Australia (the “Melbourne Property”). (A) The Hotel 35 The Bankrupt’s key asset was his indirect ownership of the Hotel. At the time of the Transfers, the shareholding structure of the relevant companies that owned the Hotel was as follows. The Bankrupt held a direct 33% shareholding in Maxz Universal Development Group Limited (“MDG”), and he also owned 99.98% of Cairnhill Treasure Investments (S) Pte Ltd (“CTI”), which held a 64% shareholding in MDG. MDG, in turn, was the 94% shareholder of Treasure Resort Pte Ltd (“Treasure Resort”). The primary asset owned by Treasure Resort was the Hotel.42Foot Note 42×PTS, at para 9; TBHS, at paras 39–40. (I)Value of the Hotel 36 The Recipients contend that the value of the Hotel at the time of the Transfers was S$313m. This is based on the desktop valuation report dated 17 October 2016, which was prepared by HVS on the Bankrupt’s request.43Foot Note 43×First Affidavit of TBK, Exhibit TBK-1, at pp 17 and 21.On the other hand, the Private Trustee argues that a more accurate estimate of the value of the Hotel at the time of the Transfers is closer to S$152.4m.44Foot Note 44×PTS, at paras 53–54.This is the average of the forced sale values estimated by Colliers International Consultancy & Valuation (Singapore) Pte Ltd (“Colliers International”) and Knight Frank Pte Ltd (“Knight Frank”) in June 2018, on the request of PricewaterhouseCoopers Advisory Services Pte Ltd (“PwC”) (as the appointed receivers and managers of Treasure Resort after it went into liquidation). Colliers International’s valuation report provided a figure of S$174m–S$185m45Foot Note 45×Third Affidavit of HAC, Exhibit HAC-25, at p 118.and Knight Frank’s valuation report provided a figure of S$119.85m.46Foot Note 46×Third Affidavit of HAC, Exhibit HAC-25, at p 166. 37 Having considered the three valuation reports and the parties’ submissions, I am of the view that HVS’s valuation does not accurately reflect the actual value of the Hotel at the time of the Transfers in November 2016 and January 2017. While HVS’s valuation report was the most contemporaneous (as it was prepared in October 2016 on the request of the Bankrupt), the parameters adopted by HVS significantly limit the accuracy of its valuation for present purposes for the following reasons: (a) First, HVS’s valuation of S$313m was based on discounted cash flow projections for a period of 59 years (ie, the entire remaining term of the lease for the Hotel), with the net income of the Hotel projected to increase every year.47Foot Note 47×First Affidavit of TBK, Exhibit TBK-1, at pp 22 and 48–49.Therefore, while I accept that valuation is a“specialised field” that involves “matters of professional judgment”,48Foot Note 48×TBHS, at para 47.I must take cognisance of the fact that HVS’s valuation was premised on two highly optimistic and unrealistic assumptions. First, that the Hotel would continue to operate and turn a profit for the entire remaining duration of its lease. Second, that the Hotel would become increasingly profitable over time. Treasure Resort had incurred net losses of S$12.3m in 2014 and S$15.2m in 2015,49Foot Note 49×Third Affidavit of HAC, Exhibit HAC-23, pp 61.and its adjusted net current liabilities were S$221.2m in 2014 and S$228m in 2015.50Foot Note 50×PTS, at para 48.Further, Treasure Resort’s auditors in December 2016 had highlighted “a material uncertainty that may cast significant doubt about [Treasure Resort’s] ability to continue as a going concern”.51Foot Note 51×Third Affidavit of HAC, Exhibit HAC-23, at p 61.The auditors’ estimates for Treasure Resort’s net current liabilities were S$181.2m in 2014 and S$188m in 2015.52Foot Note 52×Third Affidavit of HAC, Exhibit HAC-23, at p 61.In these circumstances, HVS’s two assumptions were unlikely to hold true.53Foot Note 53×PTS, at para 41(a)–(b).In contrast, the valuations prepared by Colliers International and Knight Frank were based on discounted cash flow projections for a period of only ten years. On HVS’s own calculations, the discounted cash flow projections for a more realistic period of ten years from 2016/2017 to 2025/2026 would amount to only S$114m.54Foot Note 54×First Affidavit of TBK, Exhibit TBK-1, at p 48. This sum is the total of the discounted cash flow projections from 2016/2017 to 2025/2026, as set out in HVS’s table. (b) Secondly, HVS’s valuation did not take into account any capital deduction beyond the forecast reserve for replacement.55Foot Note 55×First Affidavit of TBK, Exhibit TBK-1, at p 49.Therefore, this does not accurately reflect the significant capital expenditure that would likely be incurred in the maintenance and upkeep of the Hotel for the period of 59 years.56Foot Note 56×PTS, at para 41(c).HVS’s valuation also does not appear to have taken into account capital depreciation of the Hotel which had only a remaining lease of 59 years. 38 This view is borne out by the fact that Colliers International’s and Knight Frank’s valuations of the Hotel’s market value (S$205.4m57Foot Note 57×Third Affidavit of HAC, Exhibit HAC-25, at p 152.and S$141m58Foot Note 58×Third Affidavit of HAC, Exhibit HAC-25, at p 190.respectively), and the eventual sale price of the Hotel (S$156.8m),59Foot Note 59×Third Affidavit of HAC, at para 22(d).were considerably lower than HVS’s valuation. While these valuations and the sale of the Hotel took place in 2018 (ie, more than one year after the Transfers), I disagree with TPS’s and TBH’s submissions that this renders them “totally irrelevant”, or that this is an impermissible application of hindsight.60Foot Note 60×TBHS, at paras 49–50.In my view, they provide useful indicators of the Hotel’s likely valueat the time of the Transfersand cast doubt on the accuracy of HVS’s valuation, since the value of the Hotel is unlikely to have fallen so dramatically in a short span of one or two years. 39 It is also significant that, even though the Bankrupt had been attempting to sell the Hotel since August 2016 at the earliest61Foot Note 61×First Affidavit of TBK, at para 12.and deposed that he was in advanced discussions with several significant interested parties by January 2017,62Foot Note 62×First Affidavit of TBK, at para 13.none of these discussions bore any fruit. The Hotel was only sold in 2018 after Treasure Resort had gone into liquidation. The Recipients have not adduced any evidence, such as offers from these purportedly interested parties, to corroborate their submission that HVS’s valuation of the Hotel at S$313m was a fair and accurate estimate of its value. While an offer to purchase the Hotel at S$300m was made by Menorah International Pte Ltd (“Menorah”) on 12 July 2018,63Foot Note 63×Third Affidavit of HAC, Exhibit HAC-26, at p 201.Menorah “failed to even place the requisite deposit for the purchase of the [Hotel] within the stipulated timeframe”,64Foot Note 64×Third Affidavit of HAC, Exhibit HAC-26, at p 217.and PwC subsequently wrote to the Bankrupt to put on record that there were “indications which suggest that these purportedly interested parties may not be genuine”.65Foot Note 65×Third Affidavit of HAC, Exhibit HAC-26, at p 219.HVS’s valuation of S$313m is therefore uncorroborated by any external evidence of the Hotel’s likely value. 40 In so far as the Recipients are concerned that Colliers International’s and Knight Frank’s valuations may have been affected by Treasure Resort going into liquidation on 23 March 2018,66Foot Note 66×Third Affidavit of HAC, at para 15.this concern is adequately addressed by relying on the estimates of the Hotel’smarketvalue, rather than itsforced salevalue (for which separate estimates were provided by both Colliers International and Knight Frank). 41 Therefore, in the absence of any expert evidence or further expert reports on the valuation of the Hotel, I am of the view that a more accurate estimate of the Hotel’s value at the time of the Transfers is around S$173.2m. This figure is the average of the market value estimates provided by Colliers International and Knight Frank. (II)Value of the Bankrupt’s indirect ownership of the Hotel 42 As I have explained at [35] above, the Hotel was owned by Treasure Resort. Thus, any proceeds raised from the sale of the Hotel would first have to be utilised to pay off Treasure Resort’s liabilities before being distributed to the Bankrupt. The Private Trustee and the Recipients accept that Treasure Resort’s liabilities at the end of 2015 amounted to S$267.6m.67Foot Note 67×PTS, at para 55; TBHS, at paras 54–55. 43 For the reasons I have given at [37]–[41] above, I am of the view that the value of the Hotel at the time of the Transfers was S$173.2m, which was less than the aggregate liabilities of Treasure Resort,ie, S$267.6m. I, therefore, find that, on the balance of probabilities, there would have been no surplus sale proceeds for distribution to the Bankrupt. Consequently, I agree with the Private Trustee’s submission68Foot Note 68×PTS, at para 38 (Bankrupt’s Assets, item (a)).that the value of the Bankrupt’s indirect ownership of the Hotel at the time of the Transfers was negligible. 44 In the Bankrupt’s further affidavit filed on 5 February 2021,69Foot Note 69×SUM 608/2021.he sought to exhibit the latest available management accounts for MDG (for the financial period from 1 January 2016 to 30 June 2016) and CTI (for the financial year ended 31 December 2014).70Foot Note 70×Second Affidavit of Tan Boon Kian (“Second Affidavit of TBK”), Exhibit TBK-6.These management accounts were introduced very close to the hearing of SUM 5249/2020. The Bankrupt’s position is that these management accounts show that he was the largest creditor of both MDG and CTI, being owed S$11m by the former and S$8.23m by the latter.71Foot Note 71×Second Affidavit of TBK, at para 9.While the Bankrupt’s further affidavit and the management accounts exhibited therein were in draft form, I allowed them to be introduced into evidence as counsel for the Private Trustee raised no objection to this. Nevertheless, as I have found that the value of the Hotel at the time of the Transfers was less than the aggregate liabilities of Treasure Resort, this new evidence does not affect my conclusion at [43] above. If the sale proceeds from the Hotel would not even have sufficed to pay off Treasure Resort’s liabilities, there would not have been any surplus sale proceeds for distribution to the Bankrupt after paying off MDG’s and CTI’s liabilities. (B) The White House Park Property 45 The White House Park Property was sold in or around January 2017 at S$25.5m, as part of the Bankrupt’s divorce settlement with his ex-wife.72Foot Note 72×First Affidavit of TBK, at para 14(a).TPS and TBH submit that the value of this asset should be S$3.9m,ie,the Bankrupt’s share of the balance sale proceeds which he received in February 2017.73Foot Note 73×TBHS, at para 56(a).The Private Trustee, however, contends that the value of this asset should be S$2.69m,ie, the Bankrupt’s share of the sale proceeds after deductions were made to the Central Provident Fund (“CPF”) Board and to the Bankrupt’s ex-wife as reimbursement for various arrears.74Foot Note 74×PTS, at para 38 (Bankrupt’s Assets, item (b)); Third Affidavit of HAC, at para 27(a) and Exhibit HAC-27 at p 224. 46 I agree with the Private Trustee that the value of the White House Park Property at the time of the Transfers was approximately S$2.69m. In applying the balance sheet test under s 100(4)(b), the Bankrupt’s prospective liabilities must also be taken into account. As explained inKon Yin Tong and another vLeow Boon Cher and others[2011] SGHC 228 at [40], a prospective liability is a debt which will certainly become due in the future, either on some date which has already been determined or on some date determinable by reference to future events. It includes both future debts, in the sense of liquidated sums due, and non-liquidated claims. In the present case,the refund of the Bankrupt’s CPF funds and the reimbursement to the Bankrupt’s ex-wife were prospective liabilities which the Bankrupt already had at the time of the Transfers. These deductions must therefore be applied to the Bankrupt’s share of the sale proceeds in order to determine the value of the White House Park Property as an asset of the Bankrupt at the material time. (C) The Ocean Drive Property 47 The Ocean Drive Property was purchased at a price of S$3.25m and sold by the Bankrupt’s ex-wife in August 2017 at S$3.22m.75Foot Note 75×Third Affidavit of HAC, at para 28 and Exhibit HAC-29 at p 445.The mortgage loan outstanding in January 2017 would have been approximately S$2.6m.76Foot Note 76×First Affidavit of TBK, at para 14(b).TPS and TBH submit that, if the Ocean Drive Property had been sold at the time of the Transfers in January 2017, the sale would likely have yielded surplus proceeds in excess of S$600,000, and that the Bankrupt would have been entitled to half of this sum (ie, S$300,000) as part of his divorce settlement.77Foot Note 77×TBHS, at para 56(b).The Private Trustee submits that the value of this property at the material time was S$413,604.94,ie, the Bankrupt’s share of the balance sale proceedsbeforerefunding the Bankrupt’s CPF funds.78Foot Note 78×PTS, at para 38 (Bankrupt’s Assets, item (c)); Third Affidavit of HAC, Exhibit HAC-29, at p 446.Counsel for the Private Trustee explains that this position was taken for two reasons: (a) “to be fair” to the Bankrupt, as the CPF funds were refunded only in August 2017 (after the completion of the sale of the Ocean Drive Property),ie,after the Transfers were made; and (b) to avoid a dispute over whether the Bankrupt’s refunded CPF funds should be considered theBankrupt’sassets at the material time. 48 I do not agree with the Private Trustee’s reasons. In my view, even though the Bankrupt’s CPF funds were in fact refunded only in August 2017, the amount of the refund must be taken into account in ascertaining the value of the Ocean Drive Property at the time of the Transfers. This is because the refund of the Bankrupt’s CPF funds was a prospective liability which the Bankrupt already had at the time of the Transfers. If the Ocean Drive Property had been sold in January 2017, the Bankrupt would have been under an obligation to refund his CPF funds at that time. Further, the Bankrupt’s CPF funds could only be used for limited purposes, and it was not argued before me that the Bankrupt’s CPF funds should generally be included in his assets for the purpose of the balance sheet test. Therefore, I agree with TPS’s and TBH’s submissions that the value of the Ocean Drive Property at the time of the Transfers was approximately S$300,000. (D) The Melbourne Property 49 The Private Trustee submits that, as the Melbourne Property was sold by the Bankrupt’s estate in 2019 for A$1.41m and the Bankrupt’s share of the sale proceeds (after deducting Australian capital gains tax) was approximately S$300,000, the value of the Melbourne Property as an asset of the Bankrupt at the material time was S$300,000.79Foot Note 79×PTS, at para 38 (Bankrupt’s Assets, item (d)); Third Affidavit of HAC at para 29(b) and Exhibit HAC-30 at pp 448–452.On the other hand, TPS and TBH contend that the market value of the Melbourne Property was A$1.425m in January 2017 and that, after repaying the outstanding mortgage loan on the property together with interest, a sale of the Melbourne Property at that time would likely have yielded surplus proceeds of more than A$1m. The Bankrupt would have been entitled to half of that sum (ie, A$0.5m) under his divorce settlement.80Foot Note 80×TBHS, at para 56(c). 50 I agree with the Private Trustee that the value of the Melbourne Property at the time of the Transfers was closer to S$300,000,ie, the Bankrupt’s share of the sale proceeds after deducting Australian capital gains tax. At the time of the Transfers, Australian capital gains tax was a prospective liability which the Bankrupt would have to discharge upon the sale of the Melbourne Property. Hence, it should be taken into account in applying the balance sheet test. (E) Summary of the Bankrupt’s assets 51 Taking all the above sums together, I estimate the value of the Bankrupt’s assets at the time of the Transfers to be approximately S$3.29m. AssetValueIndirect ownership of the HotelNegligibleWhite House Park PropertyS$2,690,000Ocean Drive PropertyS$300,000Melbourne PropertyS$300,000TotalS$3,290,000 (2) The Bankrupt’s liabilities 52 It is common ground that the Bankrupt had the following currentand contingentliabilities at the time of the Transfers: LiabilityValue (rounded to the nearest S$)Debts owed to the Bankrupt’s family members, as set out in the A&G Letter of DemandRM21,708,144.50 (S$6,957,739) and S$13,314,94981Foot Note 81×PTS, at para 38 (Bankrupt’s Liabilities, item (a)); TBHS, at para 58 (items (a) and (b)).Other debts owed to the Bankrupt’s family membersUS$2,750,000 (S$3,795,000)and S$2,000,00082Foot Note 82×PTS, at para 38 (Bankrupt’s Liabilities, item (b)); TBHS, at para 58 (items (g) and (h)).Debts owed to HEP under Bill Number 128672 (dated 23 August 2016) and Bill Number 129194 (dated 28 September 2016)S$146,83583Foot Note 83×PTS, at para 38 (Bankrupt’s Liabilities, items (c) and (d)); TBHS, at para 58 (items (e) and (f)).Contingent debt owed to UOB arising from the Bankrupt’s liability as a mortgagor for a debt owed by the Bankrupt and his ex-wifeS$3,477,80484Foot Note 84×PTS, at para 38 (Bankrupt’s Liabilities, item (f)); TBHS, at para 58 (item (j)). Owing to a typographical error, the numbering from (g)–(i) is repeated at para 58 of TBHS. The items after “Contingent liabilities (arising from personal guarantees)” have therefore been renumbered as (j)–(o).Contingent debt owed to UOB arising from the Bankrupt’s liability as a personal guarantor for facilities extended to Cairnhill Group Holdings Pte Ltd (“CGH”)S$434,21085Foot Note 85×PTS, at para 38 (Bankrupt’s Liabilities, item (g)); TBHS, at para 58 (item (k)).Contingent debt owed to UOB arising from the Bankrupt’s liability as a joint and several guarantor for facilities extended to TCH Holding Pte LtdS$758,75086Foot Note 86×PTS, at para 38 (Bankrupt’s Liabilities, item (h)); TBHS, at para 58 (item (l)). This appears to have been double-counted at para 58 of TBHS (item (d)).Contingent debt owed to UOB arising from the Bankrupt’s liability as a personal guarantor for facilities extended to TDS Investment Pte LtdS$1,778,00087Foot Note 87×PTS, at para 38 (Bankrupt’s Liabilities, item (i)); TBHS, at para 58 (item (m)).Sub-TotalS$32,663,287 53 In addition, the Private Trustee includes the following contingent debts among the Bankrupt’s liabilities at the time of the Transfers: (a) A contingent debt of S$205.74m owed to Malayan Banking Berhad (“Maybank”) arising from the Bankrupt’s liability as a personal guarantor for facilities extended to Treasure Resort.88Foot Note 88×PTS, at para 38 (Bankrupt’s Liabilities, item (j)); Second Affidavit of HAC, Exhibit HAC-20, at p 416.I shall refer to this as the “Maybank-Treasure Resort Contingent Debt”. (b) A contingent debt of S$432,916 owed to NAFA System Services Pte Ltd (“NAFA”) arising from the Bankrupt’s liability as a guarantor for NAFA’s cleaning fees that were chargeable to Treasure Resort.89Foot Note 89×PTS, at para 38 (Bankrupt’s Liabilities, item (l)); Second Affidavit of HAC, Exhibit HAC-20, at pp 431–434.I shall refer to this as the “NAFA-Treasure Resort Contingent Debt”. (c) A contingent debt of S$30m to Maybank arising from the Bankrupt’s liability as a personal guarantor for facilities extended to CGH.90Foot Note 90×PTS, at para 38 (Bankrupt’s Liabilities, item (k)); Second Affidavit of HAC, Exhibit HAC-20, at p 408 (para 3(b)).I shall refer to this as the “Maybank-CGH Contingent Debt”. 54 On the other hand, TPS and TBH submit that the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt should be excluded from the Bankrupt’s liabilities as they were Treasure Resort’s liabilities and would, therefore, have already been deducted in computing the Bankrupt’s net assets (ie, in valuing the Bankrupt’s indirect ownership of the Hotel at the time of the Transfers).91Foot Note 91×TBHS, at para 59.This submission is premised on the assumption that the value of the Hotel at the time of the Transfers was S$313m, following HVS’s valuation.92Foot Note 92×TBHS, at paras 54 and 61.As for the Maybank-CGH Contingent Debt of S$30m, this sum was not included in the Recipients’ calculations and was also not addressed in their submissions. 55 Further, with regard to the valuation of these contingent liabilities, counsel for the Private Trustee submits that the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt owed by the Bankrupt should be valued in full because Treasure Resort was deeply in the red at the time of the Transfers and the likelihood of the Bankrupt’s personal guarantees being called upon was, therefore, a certainty. In response, counsel for TPS and TBH argues that the value of the Bankrupt’s contingent liabilities should be substantially discounted because there was no reason for the Bankrupt to think that there was a real risk that his various guarantees would be called upon in January 2017. 56 There are, therefore, two issues in dispute: (a) whether the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt should beincludedamong the Bankrupt’s liabilities at the time of the Transfers; and (b) whether the Bankrupt’s contingent liabilities should bevaluedin full, or instead should be discounted to reflect the possibility that the relevant contingencies might not occur. These issues overlap, but I shall deal with them in turn for completeness. (A) The Bankrupt’s contingent debts as a personal guarantor for Treasure Resort 57 I agree with the Private Trustee’s submission that the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt should be included among the Bankrupt’s liabilities at the time of the Transfers. As I have found (at [41] above) that the value of the Hotel at the time of the Transfers was only around S$173.2m, the sale proceeds of the Hotel would not have been sufficient for Treasure Resort to discharge its liabilities to both Maybank and NAFA (which amounted to a total of approximately S$206.17m). Thus, the Bankrupt’s personal guarantees under the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt would have been called upon. (B) Valuation of the Bankrupt’s contingent liabilities 58 I turn now to consider how the Bankrupt’s contingent liabilities should be valued. As explained inGoodeat para 4–39, there are two main approaches to valuing a contingent liability: One is to say that if there is a more than even chance of the contingency occurring, the liability should be taken as the present value of the contingent liability, for example, the amount of a guaranteed debt discounted to take account of its futurity. On this approach, a contingent liability with an 80% chance of accrual, although discounted for futurity would not be discounted for the 20% chance that it would not accrue, whilst a liability with a 50% chance of accrual would be disregarded altogether. An alternative approach is to value the contingent liability at the percentage of likelihood of its occurrence, so that if the likelihood were 80% the liability would be taken in at the present value of 80% of the full liability, whilst a contingent liability with a 10% chance of accrual would be estimated at the present value of 10% of the full liability. 59 However, later in the same paragraph,Goodeobserves that: Neither of these approaches seems fully satisfactory. The first seems to set the threshold of likelihood too high, while the second is contrary to prevailing practice, which is to value the contingency in full (less any discount for futurity) if it will probably occur and is capable of valuation and disregard it altogether in other cases. It is thought thatthe question to be asked is whether there is a real prospect that the contingency will occur, in which case it should be brought in at its present value without further discount for the possibility that it may not accrue. [emphasis added] 60 I agree with the view expressed inGoodethat neither of the two approaches is fully satisfactory. The first approach seems overly mechanical, whereas the second approach would be highly speculative. In my view, the preferable approach (asGoodesuggests) is to include the full value of contingent debts where there is areal prospectthat the relevant contingency will occur. This seems to me to strike the most appropriate balance between giving effect to the statutory mandate to take into account the debtor’s contingent liabilities and reflecting the practical reality that contingent liabilities with only a remote possibility of accrual should not simply be taken at face value for the purpose of the balance sheet test. 61 I agree with the Private Trustee’s submission that the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt owed by the Bankrupt should be valued in full. In this case, the relevant contingency is Treasure Resort defaulting on its debts of S$205.74m to Maybank and S$432,916 to NAFA. The Hotel was Treasure Resort’s primary asset and I have found that the sale proceeds of the Hotel (of around S$173.2m) would not have been sufficient to discharge Treasure Resort’s liabilities to both Maybank and NAFA (see [57] above). Furthermore, Treasure Resort was experiencing serious financial difficulties and faced a high risk of insolvency by December 2016 (see [37(a)] above). In these circumstances, there was indeed a real prospect that this contingency would occur and that the Bankrupt’s personal guarantees would be called upon. Consequently, the Bankrupt’s contingent liabilities under the Maybank-Treasure Resort Contingent Debt and the NAFA-Treasure Resort Contingent Debt should be valued in full,ie, S$206.17m. 62 The parties made no submissions before me regarding the likelihood of the Bankrupt’s personal guarantees for the liabilities of the other companies (ie, CGH, TCH Holding Pte Ltd and TDS Investment Pte Ltd) being called upon. Hence, I am not in a position to evaluate whether there was a real prospect, at the time of the Transfers, that these other companies would have defaulted on their debts. I, therefore, make no finding on the appropriate valuation of the contingent debts owed to UOB arising from the Bankrupt’s liability as a guarantor for facilities extended to CGH, TCH Holding Pte Ltd, and TDS Investment Pte Ltd, and the Maybank-CGH Contingent Debt. However, even if the Bankrupt’s contingent liabilities in respect of these other companies are valued atzero(which is extremely unlikely), the Bankrupt’s total liabilities would have been approximately S$235.87m at the time of the Transfers: LiabilityValue (rounded to the nearest S$)Debts owed to the Bankrupt’s family members, as set out in the A&G Letter of DemandRM21,708,144.50 (S$6,957,739) and S$13,314,949Other debts owed to the Bankrupt’s family membersUS$2,750,000 (S$3,795,000)and S$2,000,000Debts owed to HEP under Bill Number 128672 (dated 23 August 2016) and Bill Number 129194 (dated 28 September 2016)S$146,835Contingent debt owed to UOB arising from the Bankrupt’s liability as a mortgagor for a debt owed by the Bankrupt and his ex-wifeS$3,477,804Contingent debt owed to Maybank arising from the Bankrupt’s liability as a personal guarantor for Treasure Resort’s liabilitiesS$205,740,857Contingent debt owed to NAFA arising from the Bankrupt’s liability as a guarantor of Treasure Resort’s liabilitiesS$432,916TotalS$235,866,100 (C) Summary of the Bankrupt’s liabilities 63 Therefore, I estimate the amount of the Bankrupt’s liabilities at the time of the Transfers to be at least S$235.87m. (3) Conclusion on the balance sheet test 64 As the amount of the Bankrupt’s liabilities (at least S$235.87m) far exceeded the value of his assets (approximately S$3.29m) at the time of the Transfers, I find that the Bankrupt was also balance sheet insolvent at the material time.",
        "Whether the Bankrupt was influenced by a desire to prefer TPS and TBH": "65 I shall now consider whether the transfers to TPS and TBH should be avoided as unfair preferences. As I have explained at [20] above, TPS and TBH were creditors of the Bankrupt and the transfers put them in a better position upon his bankruptcy than they would otherwise have been in. This is sufficient to establish that these transfers were unfair preferences under s 99(3) of the Act. However, the court will only make an order in respect of these unfair preferences if the Bankrupt was influenced by a desire to prefer in making the transfers (s 99(4) of the Act). Since TPS and TBH are associates of the Bankrupt, s 99(5) of the Act applies such that the Bankrupt ispresumedto have been influenced by a desire to prefer them unless the contrary is shown. The burden of proving that the Bankrupt was not influenced by such a desire thus lies on TPS and TBH. 66 TPS and TBH argue that the following facts show that the Bankrupt lacked the requisite desire to place them in a better position in the event of his bankruptcy:93Foot Note 93×TBHS, at para 66. (a) By January 2017, the Bankrupt was in advanced discussions with a number of potential buyers for the Hotel. As the Bankrupt understood it, the sale of the Hotel would have cleared all his debts, leaving him with a significant surplus. (b) The possibility that he might be facing bankruptcy never even crossed his mind, and he was confident about the future. (c) The Bankrupt also made sizeable payments to discharge some of Treasure Resort’s debts in January and February 2017, when he had no legal obligation to do so. 67 Counsel for TPS and TBH, relying on the Bankrupt’s affidavit evidence,94Foot Note 94×First Affidavit of TBK, at para 33.further argues that if the Bankrupt had been motivated by a desire to prefer his family members, he would also have made payments to the other family members to whom he owed moneys (including his own mother), and not only to TPS and TBH. 68 On the other hand, the Private Trustee submits that the Bankrupt, TPS and TBH have failed to rebut this statutory presumption, for the following reasons:95Foot Note 95×PTS, at paras 77–85. (a) It is not necessary to establish that the individual knew or believed that he was insolvent at the time of the preference. It suffices that he was influenced by the desire to put a creditor in a position which, in the event of the individual’s bankruptcy, would be a better position than if no payment was made. The fact that bankruptcy never crossed the Bankrupt’s mind would, therefore, be irrelevant for the purpose of establishing that he was not influenced by a desire to prefer TPS and TBH. (b) The Bankrupt’s admission that he was “very grateful” to TPS and TBH as the family members who had been the most financially supportive of him and that he had made the transfers to “show [his] appreciation to them by making some repayments to them”,96Foot Note 96×First Affidavit of TBK, at para 32.indicates the Bankrupt’s desire to prefer the individuals who had supported him most in the past over his other creditors. (c) It is disingenuous for the Bankrupt to state that he had no legal obligation to make the sizeable payments to discharge Treasure Resort’s debts in January and February 2017. By the Bankrupt’s own admission, the largest payment made by the Bankrupt for this purpose was the payment of a sum of S$2.34m to Sentosa Development Corporation (“SDC”) on 8 February 2017.97Foot Note 97×First Affidavit of TBK, at para 34.This sum was paid because the Bankrupt had, on 27 January 2017, undertaken to pay and personally guarantee the payment of this sum to SDC from the sale proceeds of the White House Park Property.98Foot Note 98×Third Affidavit of HAC, at para 27(b) and Exhibit HAC-28, p 226, at paras 4–8.Thus, the Bankrupt would have breached his own legal obligations if he had not made this payment to SDC. 69 In my view, TPS and TBH have failed to rebut the statutory presumption that the Bankrupt was influenced by a desire to prefer. In order to rebut this presumption, TPS and TBH must show, on a balance of probabilities, that the transfers were not influencedat allby any desire on the Bankrupt’s part to place them in a preferential position (seeLiquidators ofProgen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 at [36]). They have not succeeded in doing so in the present case. 70 TPS and TBH are correct to point out that the court must look at the subjectivedesire of the debtor to determine whether he positively wished to improve the creditor’s position in the event of his own insolvency. The requisite desire may be proved by direct evidence or its existence may be inferred from the existing circumstances of the case (seeDBS Bank Ltd v Tam Chee Chong and another (judicial managers of Jurong Hi-Tech Industries Pte Ltd (under judicial management))[2011] 4 SLR 948 (“Tam Chee Chong”) at [22] and [26]). However, the Bankrupt’s direct evidence on affidavit shows that hewasinfluenced by a subjective desire to improve TPS’s and TBH’s absolute positions at the time of the transfers. I agree with the Private Trustee’s submission that the Bankrupt made the transfers to TPS and TBH to show his appreciation and gratitude to them. TPS and TBH are the family members who had been the most financially supportive of him. This evinces a clear desire on the Bankrupt’s part to place them in a preferential position. 71 In this regard, the facts of the present case are similar to those ofTam Chee Chong, where the chairman of the insolvent company had testified that the company had given a charge to one of its creditors (viz, DBS) because DBS “had been very supportive of” the company. In those circumstances, the Court of Appeal found that the trial judge had been “perfectly justified” in finding that the company’s decision to grant the charge was “influenced by a desire to give DBS what it wanted because it had been good to the [company]” (at [44]). 72 Even if the possibility that he might be facing bankruptcy never crossed the Bankrupt’s mind, which I find difficult to accept, this does not negate a finding that the Bankrupt was influenced by a desire to prefer. As the Court of Appeal explained inCoöperatieveCentrale Raiffeisen-Boerenleenbank BA (trading as Rabobank International, Singapore Branch) v Jurong Technologies Industrial Corp Ltd (under judicial management)[2011] 4 SLR 977 at [31]–[32]: [A]s was pointed out by Lee Eng Beng in ‘The Avoidance Provisions of the Bankruptcy Act 1995 and their Application to Companies’ (1995) SJLS 597 at 616, a literal interpretation of s 99(4) of the [Act] provides that ‘the desire to prefer relates to the producing of the effect of a preference andhas nothing to do with knowledge of one’s own insolvency’. In other words, s 99(4)only requires that there must be a desire on the debtor’s part to improve the creditor’s absolute position at the time the preference is granted(which would be the case if,eg, the creditor obtains cash paymentor a security interest – from that point onwards, he is better off, regardless of what happens afterwards to the debtor). … As Lloyd J pointed out inReConegrade Ltd[2003] BPIR 358 at 372H, if the debtor did desire a particular result,it matters not that it thought that bankruptcy was a remote risk. [emphasis in original omitted; emphasis added in italics] Thus, while I would not go so far as to say that the Bankrupt’s knowledge of his insolvency (or of the likelihood of his insolvency) isirrelevantin determining whether he was influenced by a desire to prefer, it is notnecessaryfor this purpose. 73 Further, little to no weight should be placed on the fact that the Bankrupt paid a sum of S$2.34m to SDC on 8 February 2017. Based on the evidence before me, the Bankrupt was under a legal obligation to make this payment to SDC from the sale proceeds of the White House Park Property. Similarly, I am unable to agree with the submission made by counsel for TPS and TBH that, if the Bankrupt had been motivated by a desire to prefer his family members, he would have made payments to his other family members as well. In my view, the fact that the Bankrupt did not preferallof his family members does not assist TPS and TBH in showing that the Bankrupt was not influenced by a desire to preferthem. 74 Therefore, TPS and TBH have failed to rebut the statutory presumption that the Bankrupt was influenced by a desire to prefer them in making the transfers.",
        "Whether the transfers to FT were transactions at an undervalue": "75 I shall now address the question of whether the transfers to FT amounting to S$100,000 were transactions at an undervalue. 76 The Private Trustee submits that the transfers to FT were gifts made by the Bankrupt to her, or otherwise transactions entered into by the Bankrupt with FT on terms that provided for him to receive no consideration (under s 98(3)(a) of the Act). In the alternative, the Private Trustee contends that the transfers were transactions in which the value of the consideration received by the Bankrupt was significantly less than the value of the consideration provided by him (under s 98(3)(c) of the Act).99Foot Note 99×PTS, at para 89. 77 On the other hand, FT raises two arguments to support her position that the transfers to her were not gifts: (a) In her affidavit, FT argued that the transfers cannot be categorised as gifts because the Bankrupt gained something personally from paying it. FT’s wedding was an important way for the Bankrupt to build goodwill and further develop his relationships with his business network.100Foot Note 100×FT, at para 17. (b) FT also argues that the transfers were not gifts of moneys for FT to keep, but instead were paid and used purely for the express purpose of paying for FT’s wedding expenses. 78 In my view, it is clear that the transfers to FT were gifts. FT’s arguments do not assist her in showing that the transfers were not gifts: the fact that a gift-giver gains something personally from giving it does not make it any less a gift, and gifts are not limited to moneys for the recipient to keep. As the Private Trustee emphasises,101Foot Note 101×PTS, at para 93.there is also no evidence to suggest that the transfers were made on theconditionthat FT had to invite the Bankrupt’s business associates. Indeed, on FT’s own account, she was “like any other girl, who out of filial piety, held a grand wedding banquet for her father’s sake, and [the Bankrupt], like any other father, offered to, and did, pay for a substantial portion of the wedding banquet costs”.102Foot Note 102×FT, at para 25.The transfers to FT were, therefore, undervalue transactions under s 98(3)(a) of the Act.",
        "Whether the court should decline to make the order sought against FT": "79 Notwithstanding that the transfers to FT were undervalue transactions, the court has a discretion under s 98(2) of the Act not to make an order restoring the position to what it would have been if the Bankrupt had not entered into these transactions. This is implicit in the court’s power under s 98(2) to “make such orderas it thinks fit” [emphasis added] (seeLiving the Linkat [72] and [75]). 80 The Private Trustee does not dispute that the court retains such a discretion. However, the Private Trustee submits that this discretion ought to be exercised sparingly and only in exceptional circumstances. Thus, the court should not exercise this discretion in the present case.103Foot Note 103×PTSS, at paras 2–3. 81 On the other hand, FT submits that she should not be required to transfer the sum of S$100,000 to the Private Trustee. FT argues that her situation is similar to that of the respondents in the English cases ofTrusteein Bankruptcy of Gordon Robin Claridge v Claridge and another[2011] All ER (D) 27 (Aug) (“Claridge”) andRe Peter HerbertFowlds (a bankrupt) Bucknall and another (as joint trustees in bankruptcy of Peter Herbert Fowlds) v Wilson[2020] All ER (D) 153 (May) (“ReFowlds”) as she received and spent the S$100,000 in good faith for the exact purpose for which it was given to her. Further, she believed that she was fully entitled to spend it. To require her to transfer this sum to the Private Trustee would be “unjust” and would have a “significant and wholly disproportionate effect” on her.104Foot Note 104×FTS, at paras 8, 10, and 12.In this regard, FT has emphasised that she has a young family and is “just starting out in life”, with a young child and two more children due this year.105Foot Note 105×FTS, at para 12.FT elaborated that she does not own any assets and lives in a rented property. She is also a participant in the SGUnited Mid-Career Pathways Programme and does not have a high monthly income. 82 In my view,ClaridgeandReFowldsprovide no analogy to FT’s situation in the present case. The facts of both cases were wholly exceptional. 83 InClaridge, the bankrupt (Mr Claridge) and the respondent (Mrs Claridge) were husband and wife. Their matrimonial home (the “Property”) was initially subject to a mortgage in favour of Birmingham Midshires Building Society (“BMBS”). After Mr Claridge was made bankrupt, Mrs Claridge owned the full beneficial interest in the Property and became solely liable to BMBS in relation to BMBS’s outstanding mortgage. Subsequently, Mr and Mrs Claridge jointly took out a loan from Kensington Mortgage Company Limited (“KMC”). On the joint instructions of Mr and Mrs Claridge, the loan moneys were paid into Mrs Claridge’s bank account. The loan moneys were used to discharge BMBS’s mortgage and re-mortgage the Property in KMC’s favour, as well as to repair and renovate the Property. Mr Claridge’s trustee in bankruptcy sought to impugn the transfer of half of the loan moneys (ie, £26,689.50) from Mr Claridge to Mrs Claridge as a transaction at an undervalue. 84 Sales J (as he then was) found that Mr Claridge had entered into a transaction the substance of which involved him conferring a benefit on his wife (Claridgeat [29]). This was because Mr Claridge’s half-share of the loan moneys was paid to Mrs Claridge or to BMBS for her sole benefit (since Mrs Claridge was the sole beneficial owner of the Property). However, Sales J declined to make an order against Mrs Claridge under the provision of the Insolvency Act 1986 (c 45) (UK) equivalent to s 98 of the Act. While one factor taken into account by Sales J was the fact that Mrs Claridge had spent the moneys in good faith believing that she was fully entitled to spend it (Claridgeat [49(ii)]), Sales J also had regard to the following factors: (a) In the context of this transaction, there was no simple way to restore the position to what it would have been if Mr Claridge had not entered into this transaction (Claridgeat [49(ii)]). (b) The extent to which Mrs Claridge had benefited from the transaction was limited. She remained liable to KMC to makeallthe mortgage repayments. There was no evidence of the extent to which the value of the Property was actually increased by the expenditure of Mr Claridge’s share of the loan moneys on it. It, therefore, did not appear unjust in all the circumstances that no order should be made against Mrs Claridge (Claridgeat [49(iii)] and [49(vi)]). 85 These factors do not apply in the present case. The transfers amounting to S$100,000 were direct gifts from the Bankrupt to FT which can be simply reversed by an order that FT transfer a sum of S$100,000 to the Private Trustee. Further, FT benefited significantly from the transaction as S$100,000 of her wedding expenses were defrayed by the transfers. 86 I turn now toReFowlds. Several years before his bankruptcy, the bankrupt (Mr Fowlds) had retained his stepdaughter (Ms Wilson), a qualified management accountant, to provide forensic accountancy services on an arm’s length, commercial basis. Ms Wilson was owed a total of £99,330, and Mr Fowlds paid her about 48% of this sum (ie, less than £50,000) within the applicable clawback period. Mr Fowlds’ trustees in bankruptcy sought to impugn this payment to Ms Wilson on the ground that it was an unfair preference. 87 Jones J found that the payment was an unfair preference, but declined to order Ms Wilson to return the payment. Jones J took into account the following factors (ReFowldsat [79]–[93]): (a) The debt arose from a commercial relationship and represented a fair amount for the work carried out. Further, Ms Wilson’s relationship to Mr Fowlds did not gain her any priority or advantage over his other commercial creditors. (b) Ms Wilson played no part in the making of the preference other than receiving the payment; she acted in good faith and had no reason to question the payment at any material time. (c) Ms Wilson no longer had the payment or realisable assets of remaining value purchased from those funds. (d) Ms Wilson had limited financial means and would not have been able to restore the payments without selling her family home, which would adversely affect her children (including their contact with their father) and her business. Restoration of the payments would thus have a significant and wholly disproportionate effect upon her, bearing in mind that only a sum of less than £50,000 would be restored to the bankruptcy estate. 88 The situation of Ms Wilson inReFowldsis, therefore, very different from the situation of FT in the present case. I accept that FT may have received and spent the S$100,000 in good faith and that transferring S$100,000 to the Private Trustee would place a financial burden on FT and her family. However, I do not think the effect of such an order on FT is comparable to the hardship Ms Wilson would have suffered from having to sell her home and relocate her children and her business. Although FT has asserted that she and her husband “simply do not have the means to return such a large sum”,106Foot Note 106×FT, at para 26.she has not adduced any evidence to support this. FT has also not given any evidence to show that she would suffer any particular hardship as a result of having to transfer the sum of S$100,000 to the Private Trustee. In addition, unlike Ms Wilson inReFowlds(who had received the payment from Mr Fowlds as consideration for the professional services she had provided to him on a commercial basis), FT was a volunteer for the full sum of S$100,000 and provided no consideration for the same. 89 Furthermore, Jones J was careful to emphasise that it would be a “departure from the wide scope of the norm to refuse relief if all the other requirements of the statutory provision are satisfied”. He added that there would have to be “something unusual” to justify such a course, given that the purpose of the relevant statutory provisions was to “achieve the equal rate of distribution to which creditors should be entitled under the statutory waterfall” (ReFowldsat [12]). Indeed, Jones J expressly stated that he “would not be considering exercising the discretion if the [p]ayment had been a gift or a transaction at an undervalue” (ReFowldsat [101]). In this case, I have found that the transfers to FT were gifts.ReFowldstherefore does not assist FT. 90 Two additional considerations further undercut FT’s argument that she would be unfairly prejudiced if she is ordered to transfer S$100,000 to the Private Trustee. (a) The evidence suggests that FT would have had the financial means to pay for her wedding expenses even without the transfers from the Bankrupt. FT had booked the Ritz-Carlton hotel as the venue for her wedding banquet by 15 December 2015, and had been required to pay deposits amounting to S$39,787.31 (30% of the anticipated cost of the wedding banquet) by 9 June 2016.107Foot Note 107×FT, Tab C, at pp 57 and 59.The transfers were only made to FT in November 2016 and January 2017, and the Bankrupt referred to the S$50,000 transferred to FT in November 2016 as “stand by for her wedding”.108Foot Note 108×FT, Tab A, at p 15.Thus, although FT stated during the hearing that she had booked the wedding venue and paid the required deposits before receiving the transfers on the faith of the Bankrupt’s verbal agreement to defray the costs of the wedding, the objective evidence adduced by FT herself suggests that she did notrelyon the transfers to pay for her wedding banquet expenses. The transfers were, therefore, more akin to the Bankrupt’s contributions towards defraying the cost of her wedding, rather than funds which she depended on to be able to afford her very lavish wedding banquet. (b) At the hearing, FT estimated that she receivedang powmoney amounting to approximately S$50,000 as gifts from the guests who attended her wedding. This would have further helped to defray the cost of the wedding banquet. Indeed, the combined amount of the transfers and theang powmoney was more than sufficient to cover the cost of the wedding banquet, which was S$135,292.20.109Foot Note 109×FT, at para 14(3) and Tab C at p 76.In other words, after taking into account the transfers and theang powmoney, it appears that FT and her husband did not need to pay a single cent towards their wedding banquet. 91 Therefore, I find that the circumstances of this case do not justify the court exercising its discretion under s 98(2) of the Act not to make an order restoring the position to what it would have been if the Bankrupt had not entered into these transactions. I agree with the Private Trustee’s submission that the Bankrupt’s creditors should not be made to foot the bill for FT’s lavish wedding banquet on her behalf.110Foot Note 110×PTSS, at para 21.If I were to decline to make the order sought by the Private Trustee against FT, this would be tantamount to allowing FT to receive an unqualified windfall at the expense of the Bankrupt’s creditors, when she has given no value for her receipt of the transfers from the Bankrupt. This would be an inequitable outcome.",
        "Summary of findings": "92 In summary, I make the following findings: (a) At the time of the Transfers, the Bankrupt was insolvent under s 100(4) of the Act. (b) The transfers to TPS and TBH were unfair preferences, and they were given within the applicable clawback period for unfair preferences. In deciding to give these preferences, the Bankrupt was influenced by a desire to prefer TPS and TBH. (c) The transfers to FT were transactions at an undervalue, and they were entered into within the applicable clawback period for undervalue transactions. The circumstances of the present case do not justify the court exercising its discretion under s 98(2) of the Act not to make an order restoring the position to what it would have been if the Bankrupt had not entered into these transactions.",
        "Conclusion": "93 For all of the above reasons, I grant the Private Trustee’s application for the following orders: (a) an order that TBH transfers the sum of S$150,000 to the Private Trustee; (b) an order that TPS transfers the sum of S$250,000 to the Private Trustee; and (c) an order that FT transfers the sum of S$100,000 to the Private Trustee. The Recipients are to make the necessary transfers within 14 days of the date of this judgment, unless otherwise agreed with the Private Trustee. 94 In addition to the above orders, the Private Trustee sought declarations that the Transfers are void under ss 98 and/or 99 of the Act. However, I am reluctant to make these orders. Sections 98(2) and 99(2) of the Act empower this court to “make such order as it thinks fit forrestoring the positionto what it would have been” [emphasis added] if the Bankrupt had not entered into the undervalue transactions or given the unfair preferences. The court may do so by, for example, requiring the Recipients to pay, in respect of benefits received by them from the Bankrupt, such sums to the Private Trustee as the court may direct (s 102(1)(d) of the Act). I have made such orders at [93] above. These orders are sufficient for the Private Trustee to claw back the moneys from the Recipients for distribution to the creditors of the Bankrupt. It is not necessary for me to declare the Transfers to the Recipients void. Furthermore, unlike the earlier version of the Act which was in force prior to 15 July 1995, the relevant provisions of the present Act do not refer to undervalue transactions or unfair preferences being void (or, for that matter, voidable) (seeBuildspeedConstruction Pte Ltd (in liquidation) v Theme Corp Pte Ltd and another[2000] 1 SLR(R) 287 at [51]). Hence, I decline to declare that the Transfers to the Recipients are void or voidable as it serves no useful purpose to the Private Trustee. 95 I shall now hear parties on the issue of costs. Tan Siong ThyeJudge of the High Court Siew Guo Wei and Yeow Yuet Cheong (Tan Kok Quan Partnership) for the applicant; The first respondent absent and unrepresented; Chua Sui Tong and Tang Abigail (Rev Law LLC) for the second and third respondents; The fourth respondent in person."
    }
}