{
    "case_title": "Tan Yi Lin Cheryl vAIA Singapore Pte Ltd",
    "ncitation": "[2021] SGHC 130",
    "coram": "Chua Lee Ming J",
    "sections": {
        "Introduction": "1 The plaintiff, Ms Cheryl Tan Yi Lin, sued the defendant, AIA Singapore Pte Ltd, for payment of $1m under a life insurance policy (the “Policy”) issued by the defendant to the plaintiff’s deceased husband, the late Mr Cheong Wai Ming Edmund (the “Insured”). The plaintiff commenced this action in her capacity as the sole executrix of the estate of the Insured pursuant to a Grant of Probate dated 5 November 2016 (the “Grant of Probate”),1Foot Note 1×1 Agreed Bundle (“AB”) 385.and as the sole trustee and beneficiary under the Policy pursuant to a nomination dated 6 August 20152Foot Note 2×2 AB 807–808.made by the insured under s 49L(2) of the Insurance Act (Cap 142, 2002 Rev Ed). 2 The defendant had voided the Policy on the ground that in his application to the defendant for the Policy, the Insured had failed to (a) disclose his other previous and pending applications for life policies and (b) inform the defendant of his subsequent applications to other insurance companies for life insurance up to the time that the defendant issued its policy to the Insured. 3 I found that the defendant was entitled to void the Policy and dismissed the plaintiff’s claim. The plaintiff has appealed against my decision.",
        "Facts": "4 The plaintiff and the Insured were married on 8 July 2009 and have a son who was born on 19 September 2013. Both the plaintiff and the Insured were former insurance agents with the defendant, the plaintiff from 26 September 2006 to 7 April 2009 and the Insured from 18 January 2008 to 13 May 2009. At the material time, the Insured was working as an accountant. 5 On 7 May 2014, the Insured submitted an Application Form for Life Insurance to the defendant (the “Application Form”).3Foot Note 3×1 AB 328–333.The application was for a five-year term life policy for $1m. The defendant’s authorised financial services consultant, one Mr Aik Chin Yeow (“Aik”), attended to the Insured. 6 The present proceedings arose from the following answers given by the Insured in the Application Form (the “Insured’s Answers”): (a) In response to the section asking for “Details of Previous and Concurrent Insurance Applications and Pursuits of Proposed Insured”, the Insured answered “No records”. (b) In the “Questionnaire” section of the Application Form, question 2 asked whether, among other things, the Insured had “any application for … life … insurance policy pending…?” and the Insured answered “No”. 7 In the Application Form, the Insured made the following declaration: 2.  I/We declare that the statements and answers in this application together with any required questionnaire or amendments (the “Information”) are full, complete, true and correct and that no information or material has been withheld. I/We understand that AIA Singapore, believing the Information to be such, will rely and act on the Information accordingly. I/We further agree that the Information shall form the basis of the contract between the parties hereto. I/We understand that if any of the Information is not full or complete or true or correct, the Policy issued hereunder may be void and I/we may receive nothing from the policy. 8 The first page of the Application Form contained the following warning:4Foot Note 4×1 AB 328. WARNING: In accordance with Section 25(5) of the Insurance Act, as may be amended from time to time, you are to fully and faithfully disclose in this Application Form all facts which you know, or ought to know, failing which you may receive nothing from the policy and/or the policy issued may be void. If a foreign currency policy is applied for, the equivalent of returns in Singapore-dollars will depend on the prevailing exchange rate (as determined by AIA Singapore), which may be highly volatile. 9 The last page of the Application Form contained the following warning:5Foot Note 5×1 AB 333. WARNING: If a material fact is not disclosed in this proposal, any policy issued may not be valid. If you are in doubt as to whether a fact is material, you are advised to disclose it. This includes any information that you may have provided to the Financial Services Consultant(s)/Insurance Representative(s) but was not included in the proposal. Please check to ensure you are fully satisfied with the information declared in this proposal. Additionally and without prejudice to the parties’ rights and obligations whether under law or otherwise, following the submission of your proposal, you must continue to disclose any and all material facts that may arise or which have changed from the information you had provided. 10 It was not disputed that the Insured’s Answers were false. The Insured had made three previous applications for life insurance within the previous six weeks of the Application Form; one had been issued whilst two were still pending as of 7 May 2014: (a) On 28 March 2014, the Insured had applied to Prudential Assurance Company Singapore (Pte) Ltd (“Prudential”) for a 66-year term life policy for $500,000.6Foot Note 6×1 AB 26–39.On 31 March 2014, Prudential issued a “PruTerm Vantage” policy for $500,000 to the Insured.7Foot Note 7×1 AB 15. (b) On 2 May 2014, the Insured had applied to Prudential for a ten-year term life policy for $1.5m.8Foot Note 8×1 AB 43–59.The sum assured was subsequently reduced to $600,000.9Foot Note 9×1 AB 42.On 23 May 2014, Prudential issued another “PruTerm Vantage” policy, this time for $600,000, to the Insured.10Foot Note 10×1 AB 41. (c) On 6 May 2014, the Insured had applied to Aviva Ltd (“Aviva”) for a ten-year term life policy for $2m.11Foot Note 11×2 AB 734–753.On 30 May 2014, Aviva issued a “MyProtector-Level Plus 10 Years” policy for $2m to the Insured.12Foot Note 12×1 AB 102–188. 11 On 30 June 2014, the defendant issued the Policy, an “AIA Secure Term Plus – 5 Year” policy, No L540625220, for $1m to the Insured, pursuant to the Application Form previously submitted.13Foot Note 13×1 AB 301–326. 12 Between 7 May 2014 (when the Insured submitted the Application Form to the defendant) and 30 June 2014 (when the defendant issued the Policy), the Insured applied for the following life insurance policies: (a) On 8 May 2014, the Insured applied to Manulife (Singapore) Pte Ltd for ten-year term life policy for $1m.14Foot Note 14×1 AB 261–288.On 26 May 2014, the Insured agreed to the assured sum being reduced to $750,000.15Foot Note 15×1 AB 289.On 17 June 2014, Manulife issued a “Manuterm 10-Year Renewable and Convertible” policy for $750,000 to the Insured.16Foot Note 16×1 AB 237–300. (b) On 22 May 2014, the Insured applied to The Great Eastern Life Assurance Company Limited (“GE”) for a five-year term life policy for $1m.17Foot Note 17×1 AB 349–354.The sum assured was subsequently reduced to $400,000.18Foot Note 18×1 AB 361.On 17 July 2014, GE issued a five-year “Smart Term Assurance” policy for $400,000 to the Insured.19Foot Note 19×1 AB 338–361. (c) On 24 May 2014, the Insured applied to AXA Insurance Pte Ltd (“AXA”) for a ten-year term life policy for $1m.20Foot Note 20×2 AB 764–770.On 30 May 2014, AXA issued a “10 Year Term Protector” policy for $1m to the Insured.21Foot Note 21×1 AB 191–192. 13 The Insured died in Australia on 26 September 2016 after he fell from an apartment on the 33rd floor. The Insured was viewing the apartment together with the plaintiff. The Coroners Court of Victoria, Australia, found that the Insured died from “multiple injuries sustained in a fall from height” and that the fall was accidental.22Foot Note 22×Plaintiff’s Bundle of Documents (“PBD”) 478 (paras 20 and 21(b)). 14 On 10 October 2016, the plaintiff made a claim under the Policy by lodging a Death Claim Form with the defendant.23Foot Note 23×2 AB 809–813.Crawford & Company International Pte Ltd (“Crawford”), who are loss adjusters, carried out an investigation into the Insured’s death for nine insurers/reinsurers, including the defendant. In its preliminary report dated 10 February 2017, Crawford noted that the Insured had purchased 12 policies (totalling $6,854,750) and that the Grant of Probate listed seven policies (totalling $2,764,000).24Foot Note 24×2 AB 855–957, at 864–865.The plaintiff did not include all of the Insured’s policies in the schedule of assets filed in connection with the application for the Grant of Probate. She wanted to keep the value of the assets under $3m so that she could avoid filing for probate in the High Court, which she thought would be “very expensive”.25Foot Note 25×NE, 18 November 2020, at 41:6–9, 44:18–45:7.The schedule of assets was subsequently amended to include more policies.26Foot Note 26×1 AB 386.The policy issued by Aviva (see [10(c)] above) was not included in the schedule even after the amendment, presumably because Aviva did not require the Grant of Probate.27Foot Note 27×NE, 18 November 2020, at 45:1–7. 15 On 25 July 2017, the defendant informed the plaintiff that the Policy was null and void because the Insured had “withheld information material to [the defendant’s] underwriting”.28Foot Note 28×2 AB 827–828. 16 In its final report dated 5 September 2017, Crawford concluded that the finding by the Coroners Court of Victoria was consistent with Crawford’s findings. Crawford also pointed out that five insurers had denied the plaintiff’s claims on the Insured’s policies, on the ground of non-disclosure.29Foot Note 29×2 AB 964–999, at 969. 17 On 17 June 2019, the plaintiff commenced the present action.",
        "The defendant’s case": "18 The defendant’s case was that the Policy was a contract of utmost good faith and the Insured was under a duty, under the terms of the Policy and at law, to disclose all material facts to the defendant until the Policy was issued on 30 June 2014.30Foot Note 30×Defence (Amendment No 2), at para 12. 19 The defendant denied liability under the Policy on the ground that the Insured fraudulently misrepresented and/or fraudulently failed to disclose material facts: (a) The Insured was required to disclose previous applications for life insurance policies and applications that were pending (see [6] above) but failed to disclose his three previous applications for life insurance policies dated 28 March 2014, 2 May 2014 and 6 May 2014 (see [10] above). (b) The Insured was under a duty to continue to disclose all material facts until the Policy was issued. The Insured failed to disclose that he had made three further applications for life insurance policies on 8 May 2014, 22 May 2014 and 24 May 2014 (see [12] above) before the Policy was issued on 30 June 2014.",
        "The plaintiff’s case": "20 The plaintiff’s case was as follows: (a) The Insured had informed Aik of the three policies referred to in [10] above, on 7 May 2014, when the Application Form was completed.31Foot Note 31×Reply (Amendment No 1), at para 2.6(iii).The defendant was deemed to have knowledge of such information.32Foot Note 32×Reply (Amendment No 1), at para 2.4. (b) Aik completed the Application Form on behalf of the Insured and advised the Insured that there was no need to disclose applications for life policies that were still pending or policies that were taken up with other insurers.33Foot Note 33×Reply (Amendment No 1), at paras 2.7–2.9.The Insured relied on Aik’s advice.34Foot Note 34×Reply (Amendment No 1), at para 2.4. (c) In the alternative, the misrepresentations and non-disclosures were not fraudulent.35Foot Note 35×Reply (Amendment No 1), at paras 5–6. (d) The defendant was not induced by or relied upon the misrepresentations and had not altered its position as a result of the misrepresentations.36Foot Note 36×Reply (Amendment No 1), at paras 9.2 and 9.6. (e) In the alternative, the defendant had waived its rights against the Insured.37Foot Note 37×Reply (Amendment No 1), at para 8.",
        "The issues": "21 The following were the issues before me: (a) Whether the Insured had an obligation of continuing disclosure? (b) Whether there was fraudulent misrepresentation and/or fraudulent non-disclosure of material information by the insured? (c) Whether the defendant was induced by the misrepresentations and/or had altered its position? (d) Whether the defendant had waived its rights under the Policy?",
        "Whether the Insured had an obligation of continuing disclosure?": "22 The Insured made his application for the Policy on 7 May 2014 by way of the Application Form. The Policy was issued on 30 June 2014. As stated in [12] above, between these two dates, the Insured had made three applications for life policies to three different insurers. 23 I agreed with the defendant that the Insured was under an obligation of continuing disclosure and had to disclose these three applications to the defendant before the Policy was issued. The law is clear on this. 24 What matters is the state of affairs at the date when the contract is concluded, and the representation is acted upon; a representation made is generally treated as continuing:The Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) at para 11:059, citingFoodcoUK LLP v Henry Boot Developments Ltd[2010] EWHC 358 (Ch) at [186]. 25 The same principle applies to insurance contracts. An insurance contract is concluded when the policy is issued. Poh Chu Chai,Principles of Insurance Law(LexisNexis, 6th Ed, 2005) (“Principles of Insurance Law”) statesat p 111 that a contract of insurance is one “where the parties are under a duty to exercise the utmost good faith and to make full disclosure of all facts material to the contract”. It then states at p 158: An insured’s duty of disclosure continues right up to the moment a contract of insurance is concluded. If there is any material change in the risk to be insured before the contract is concluded, the change has to be disclosed to the insurer. An insurer who issues a policy to an insured is not bound by the policy if the insured fails to disclose material changes in the risk before the contract is concluded. … 26 The plaintiff also admitted that she knew from the warning notice on the last page of the Application Form (see [9] above) that there was a continuing obligation of disclosure.38Foot Note 38×NE, 17 November 2020, at 89:30–90:3.That warning notice included the following sentence: … Additionally and without prejudice to the parties’ rights and obligations whether under law or otherwise, following the submission of your proposal, you must continue to disclose any and all material facts that may arise or which have changed from the information you had provided.",
        "Whether there was fraudulent misrepresentation and/or fraudulent non-disclosure of material information by the insured?": "27 This issue raised the following questions: (a) Whether the Insured/the plaintiff informed Aik about the Insured’s other applications for life policies? (b) Whether the misrepresentations or non-disclosures (if any) were fraudulent?",
        "Whether the Insured/plaintiff told Aik about the applications for other policies?": "28 It was indisputable that the Insured’s Answers were false. However, the plaintiff alleged that: (a) on 7 May 2014, the Insured and she had informed Aik of the Insured’s then existing life policy and pending applications for life policies, and Aik had informed them that there was no need to disclose pending applications or policies issued by other insurance companies; and (b) she informed Aik of the Insured’s subsequent applications for life policies, which were made between 7 May 2014 and 30 June 2014 (see [12] above). 29 I rejected the plaintiff’s allegations for several reasons. 30 First, the objective evidence contradicted the plaintiff’s allegations. One Ms Chua Ser Chee Shirley (“Shirley”) was the insurance agent from Aviva who had sold the Insured the $2m policy issued by Aviva (see [10(c) above). On 26 October 2016, the plaintiff was going with Shirley to see a lawyer regarding her application for the Grant of Probate. By this time, Shirley had become friends with the plaintiff.39Foot Note 39×NE, 17 November 2020, at 139:21–23.Shirley helped to prepare the schedule of the Insured’s assets for the probate application.40Foot Note 40×PBD 123 (at 11:57); NE, 17 November 2020, at 139:26–140:3 and 140:14 – 18.The schedule of assets included some of the Insured’s other life insurance policies. The plaintiff asked Shirley whether Aik (also known as David) could go along because Aik wanted to learn about the process.41Foot Note 41×PBD 124 (at 21:03); NE, 17 November 2020, at 140:20–22. 31 The following WhatsApp messages between the plaintiff and Shirley, and between the plaintiff and Aik, on 26 October 2016 were telling: (a) Shirley warned the plaintiff that “later the will officer ask [her] about stuff then [Aik] will know”.42Foot Note 42×PBD 124 (at 21:35).The plaintiff’s immediate response was that she would ask Aik not to go because “he [did not] know the insurance [the Insured bought]” and that only Shirley knew.43Foot Note 43×PBD 124 (at 21:35 and 21:36); NE 18 November 2020, at 33:18–34:3. (b) Shirley also said that she was “scared” that Aik would see the schedule of assets.44Foot Note 44×PBD 124 (at 21:35 and 21:36).In response, the plaintiff said that she would tell Aik not to go with them.45Foot Note 45×PBD 124 (at 21:37) and PBD 125 (at 21:38).Separately, the plaintiff then told Aik that he should not go with her and lied to Aik that “the lawyer” said that only one person could go with her and she was already going with her mother, her friend and her domestic helper.46Foot Note 46×PBD 275 (at 21:37). 32 It was clear from the WhatsApp messages above that the plaintiff changed her mind about letting Aik go with her because she did not want Aik to find out about the Insured’s other policies. This could only mean that Aik was not aware of the Insured’s other policies. The plaintiff did not offer any other credible explanation for the WhatsApp messages.47Foot Note 47×NE, 17 November 2020, at 141:12–144:13, 145:23–148:30. 33 In addition, on 9 October 2016, Aik asked the plaintiff whether the Insured had any policies issued by Prudential.48Foot Note 48×PBD, at p 269 (at 23:27).This also showed that Aik was not aware of the Insured’s policies issued by Prudential. 34 Second, the plaintiff did not want Aik to know that Shirley was an Aviva agent and told Aik that Shirley was a property agent.49Foot Note 49×PBD 124 (at 21:34).In her oral testimony, the plaintiff explained that Shirley and Aik did not know each other and there was no need for them to know each other.50Foot Note 50×NE, 17 November 2020, at 141:3–4, 142:21–26.Shirley knew that Aik was an AIA agent. Clearly, what the plaintiff meant was that there was no need for Aik to know that Shirley was an Aviva agent. In my view, the plaintiff did not want Aik to know that Shirley was an Aviva agent because Aik did not know that the Insured had bought a policy from Aviva. 35 Third, the Insured did not make full disclosures ofallhis applications to other insurers in his applications to Aviva, Manulife, Great Eastern and AXA: (a) In his application to Aviva dated 6 May 2014, the Insured did not disclose his application to Prudential dated 2 May 2014 that was pending.51Foot Note 51×1 AB 128–147 (at 133).The plaintiff claimed that she told the Aviva agent but the agent answered “No” to the question whether there were other applications pending.52Foot Note 52×17 November 2020, at 120:21–121:24. (b) In his application to Manulife dated 8 May 2014, the Insured did not disclose his applications to Aviva dated 6 May 2014 and AIA dated 7 May 2014, both of which were pending.53Foot Note 53×1 AB 261–270 (at 267).The plaintiff claimed that she told the Manulife agent but the agent said there was no need to disclose applications to other insurers.54Foot Note 54×NE, 17 November 2020, at 121:29–123:5. (c) In his application to GE dated 22 May 2014, the Insured did not disclose his applications to Prudential dated 2 May 2014, Aviva dated 6 May 2014, AIA dated 7 May 2014, and Manulife dated 8 May 2014.55Foot Note 55×1 AB 349–354 (at 353).The plaintiff claimed that the other applications were disclosed to the GE agent.56Foot Note 56×NE, 17 November 2020, at 126:1–127:2. (d) In his application to AXA dated 24 May 2014, the Insured did not disclose his existing life policies with Prudential issued on 31 March 2014 and 23 May 2014.57Foot Note 57×1 AB 220–226 (at 225).The plaintiff claimed that the Insured did disclose to the AXA agent.58Foot Note 58×NE, 17 November 2020, at 123:20–125:13. 36  I did not believe the plaintiff. I found it unbelievable thatallthe representatives ofdifferentinsurance companies would have made the same fundamental error. I also noted the following: (a) The application to Manulife disclosed policies issued by Prudential.59Foot Note 59×1 AB 267.If indeed (as the plaintiff claimed), the Manulife agent had said there was no need to disclose applications to other insurers, then the Prudential policies should not have been disclosed in the application. Yet, they were. (b) The applications to GE and AXA also disclosed policies issued by Prudential.60Foot Note 60×1 AB 225 and 353.It did not make sense that having been told of all the other applications to other insurers, the GE agent and the AXA agent decided to disclose only the Prudential policies. It made even less sense that the AXA agent would have decided to disclose a Prudential policy issued in 2010 but not the Prudential policy issued in 2014 for a larger assured sum. (c) Some of the insurers (including the defendant) denied the plaintiff’s claims on the Insured’s policies on the ground of non-disclosure. According to the plaintiff, the non-disclosures were caused by the insurers’ respective agents. The plaintiff also knew that insurance agents are regulated. Yet, the plaintiff did not complain to the Monetary Authority of Singapore about the agents.61Foot Note 61×NE, 17 November 2020, at 127:8–27. 37 Fourth, the plaintiff was an insurance agent with the defendant from September 2006 to April 2009 and with Prudential from 2009 to 2013.62Foot Note 62×NE, 17 November 2020, at 34:5–35:4.The Insured was an insurance agent with the defendant from January 2008 to May 2009. I found that it was more likely than not that the Insured and the plaintiff were aware that the Insured had to disclose all his other applications for life policies, including those that were still pending. 38 Fifth, s 94 of the Evidence Act (Cap 97, 1997 Rev Ed) prohibited the plaintiff from adducing oral evidence to the effect that the Insured had informed the defendant of his other previous or pending applications for life insurance policies. Such oral evidence contradicted the Insured’s representation in writing that he had no previous or pending applications. 39 Sixth, the plaintiff relied on the fact that in answer to Crawford’s question as to why the Insured’s other insurance policies were not disclosed in the Application Form, Aik had answered that the Insured “did not want to take into account his existing policies to factor into the purchase of [the Policy]”.63Foot Note 63×2 AB 967. 40 In his oral evidence, Aik explained that he had the Insured’s Financial Health Review (“FHR”) in mind when he gave this statement to Crawford.64Foot Note 64×NE, 18 November 2020, at 98:1–5.In his FHR, the Insured had stated that he “[did] not wish to take into account existing policies for planning”.65Foot Note 65×Defendant’s Bundle of Documents (“DBD”) 454.This statement was given in connection with the Insured’s current financial plans, not in connection with whether to purchase the Policy.66Foot Note 66×See DBD 453.Aik explained that his answer to Crawford was a mistake.67Foot Note 67×NE, 18 November 2020, at 99:28–29. 41 I accepted Aik’s explanations. The words used in Aik’s answer to Crawford were consistent with the Insured’s statement in the FHR. Aik mistakenly attributed the Insured’s statement to the purchase of the Policy. I accepted Aik’s explanation that the Insured did not tell him whether he (the Insured) had any existing policies.68Foot Note 68×Aik Chin Yeow’s AEIC, at para 26. 42 Seventh, I did not find the plaintiff to be a credible witness. She challenged the authenticity of nine emails sent by Aik to her between 6 May 2014 and 27 November 2014,69Foot Note 69×Exhibits D3–D11.including in particular an email dated 7 May 2014 from Aik, which enclosed the Application Form and the FHR signed by the Insured earlier that day.70Foot Note 70×Exhibit D7.The plaintiff categorically denied receiving the email dated 7 May 2014.71Foot Note 71×NE, 18 November 2020, at 2:13 to 2:18The plaintiff engaged a computer forensic expert, Ms Lee Catherine Susan (“Lee”) from KordaMentha Pte Ltd to provide findings in relation to the authenticity of the nine emails and whether the emails were sent by Aik and received by the plaintiff. 43 Lee’s expert report stated the following: (a) There was no evidence that the emails had been manipulated with. However, because of the limited data and information that she had been provided with to undertake her analysis, she was unable to conclude whether the original emails had been manipulated or altered.72Foot Note 72×Lee Catherine Susan’s AEIC, at p 14, para 49. (b) The emails appeared to be sent from Aik at his email address and transmitted to a Google mail server for deliver to the plaintiff at her email address.73Foot Note 73×Lee Catherine Susan’s AEIC, at p 14, para 51. (c) Proof of receipt of the emails should be obtained from the plaintiff’s mailbox or mail server. As she had been instructed and provided with limited data and information, she was unable to provide an opinion on whether the emails were received by the plaintiff. 44 Lee explained that by examining the plaintiff’s mailbox or mail server, she would still not know whether an email was received if the email had been deleted, but, obviously, if the email was received and had not been deleted, she would be able to confirm the same.74Foot Note 74×NE, 17 November 2020, at 18:27–19:2 and 19:15–27.Lee testified that she was not instructed to examine the plaintiff’s mailbox or mail server and when she asked about doing so, she was instructed not to.75Foot Note 75×NE, 17 November 2020, at 18:6–19, 19:3–13, 19:28–30.The plaintiff first claimed that Lee did not ask for access to her email account.76Foot Note 76×NE, 18 November 2020, at 9:20–21.The plaintiff subsequently changed her evidence and said that she could not recall whether Lee asked her for access to her email account.77Foot Note 77×NE, 18 November 2020, at 10:17–22. 45 I accepted Lee’s evidence. In my view, the plaintiff did not want to give Lee access to her email account. In the circumstances, the reasonable inference was that the plaintiff did receive the emails. 46 In addition, the plaintiff lied to the defendant in the Death Claim Form that the Insured did not have any other insurance policies.78Foot Note 78×1 AB 372.The plaintiff’s explanation was that Shirley helped her with the form and that Shirley told her there was no need to disclose the Insured’s other policies.79Foot Note 79×NE, 17 November 2020, at 153:4–154:17.I did not accept the plaintiff’s evidence that she had simply followed Shirley’s advice. In my judgment, the plaintiff did not want to disclose the number of claims that she was making. This was evident from the plaintiff’s WhatsApp messages with Shirley relating to the plaintiff’s claim on the policy issued by Manulife. In the WhatsApp messages, the plaintiff confirmed that the Manulife agent did not know how many claims she was making and that there was no need to state how many claims she was making.80Foot Note 80×PBD 169 (at 14:26). 47 The plaintiff also lied in her application for Grant of Probate. She submitted a schedule of assets (see [14] above) that she clearly knew was incorrect. Further, in her Statement in support of her application for Grant of Probate, the plaintiff stated that the Insured’s estate did not exceed $3m;81Foot Note 81×1 AB 394–395.the plaintiff knew this was false. 48  Based on all the evidence before me, I concluded that (a) the Insured and the plaintiff did not inform Aik about the Insured’s applications for other life policies made before 7 May 2014, or the Insured’s applications for other life policies made between 7 May 2014 and 30 June 2014, and (b) Aik did not advise the Insured and the plaintiff that there was no need to disclose pending applications or policies issued by other insurers.",
        "Whether the misrepresentations and non-disclosures were fraudulent?": "49 The Insured clearly knew that he had made applications for other life policies. I found that Aik did not advise him or the plaintiff that there was no need to disclose pending applications or applications to other insurers. In the circumstances, there was no doubt that the Insured’s misrepresentations and non-disclosures were deliberate and that he knew they were false. The Insured’s misrepresentations and non-disclosures were therefore fraudulent.",
        "Conclusion": "61 For the above reasons, I found that the defendant was entitled to avoid the Policy. Accordingly, I dismissed the plaintiff’s claim and ordered the plaintiff to pay costs fixed at $60,000 plus disbursements to be fixed by me if not agreed. Chua Lee MingJudge of the High Court Tan Yew Fai (Y F Tan & Co) for the plaintiff; Tan Teck San Kelvin and Chng Teck Kian Desmond (Zhuang Deqiang) (Drew & Napier LLC) for the defendant.",
        "Whether the defendant was induced by the misrepresentations?": "52 Mr Ho Chee Meng (“Ho”), the defendant’s Head of New Business, testified that: (a) The Insured’s annual income and insurance history (including pending applications) were material to the underwriting of the Policy. In particular, they were material to determining whether his income and financial resources justified the total amount of coverage or proposed coverage. AIA would not accept the Insured’s application if the total amount of coverage or proposed coverage was above AIA’s per life limit, which was expressed as a multiple of the Insured’s annual income.82Foot Note 82×Ho Chee Meng’s AEIC, at paras 13. (b) Pursuant to the Income Multiple Table in the AIA Underwriting Guidelines, AIA’s per life limit for life insurance policies was 30 times the annual income of the life to be insured, if the life to be insured was between 20 to 40 years of age.83Foot Note 83×Ho Chee Meng’s AEIC, at para 14. (c) The total sum of the existing and proposed coverage was subject to the per life limit in order to ensure that it was proportionate to the applicant’s income and financial needs of the life to be insured. This was consistent with well-established underwriting practice in Singapore for life insurance policies.84Foot Note 84×Ho Chee Meng’s AEIC, at para 15. (d) In accordance the established practice in the insurance industry in Singapore, the AIA Underwriting Guidelines, the underwriting assessment takes into account both existing policies and pending applications withallinsurers when comparing against the per life limit.85Foot Note 85×Ho Chee Meng’s AEIC, at paras 20–21. (e) Information on existing policies with and pending applications to other insurers are material to the underwriting process because they may guide the underwriter to ask further questions.86Foot Note 86×Ho Chee Meng’s AEIC, at para 23. (f) In the Insured’s case, based on his age and disclosed annual income, the per life limit for his total coverage was $2,250,000.87Foot Note 87×Ho Chee Meng’s AEIC, at para 25.The underwriting note dated 14 May 2014 in respect of the Insured’s application for the Policy stated that the Insured’s total sum assured was within AIA’s life per limit and AIA relied on and/or was induced by the information provided and representations made by the Insured and had issued the Policy to the Insured on that basis.88Foot Note 88×Ho Chee Meng’s AEIC, at paras 27–28. (g) AIA would have declined the Insured’s application for the Policy if AIA had known of the Insured’s then existing and pending applications for life policies.89Foot Note 89×Exhibits D18 and D19; NE, 19 November 2020, at pp 35:29–37:28. 53 I accepted Ho’s evidence that the Insured’s representations as to his total assured sum was taken into account in his decision to approve the Insured’s application for the Policy, and that if the Insured had given full disclosure of his existing and pending applications for life policies, the Insured’s application would have been rejected.",
        "Whether the defendant had waived its rights under the Policy?": "54 In her Reply (Amendment No 1), the plaintiff pleaded that the defendant had waived its rights in respect of the Insured’s misrepresentations and/or non-disclosures.90Foot Note 90×Reply (Amendment No 1), at para 8.The plaintiff did not plead any particulars as to how the waiver came about. 55 In closing submissions, the plaintiff first submitted that the defendant had waived its rights because it had renewed the Policy in 2015 and 2016 despite having told by the Insured and/or the plaintiff (through Aik) about the Insured’s other existing and pending applications for life policies.91Foot Note 91×NE, 20 November 2020, at 35:26–37:9.Upon the defendant pointing out that there were no renewals because the Policy was for a five-year term from 2014 to 2019, the plaintiff then submitted that the waiver arose because the defendant had not voided the Policy earlier.92Foot Note 92×NE, 20 November 2020, at 37:12–29. 56 I rejected the plaintiff’s case on waiver. First, the particulars of the alleged waiver had not been pleaded. Second, I had found that the Insured and the plaintiff had not informed Aik about the Insured’s other existing and pending applications for life policies. Third, the plaintiff had not shown how the Insured had suffered prejudice.93Foot Note 93×NE, 20 November 2020, at 37:30–38:8.",
        "The basis clause": "57 The defendant also relied on the following basis clause in the Application Form: DECLARATION … 2. I/We declare that the statements and answers in this application together with any required questionnaire or amendments (the “Information”) are full, complete, true and correct and that no information or material has been withheld. I/We understand that AIA Singapore, believing the Information to be such, will rely and act on the Information accordingly. I/We further agree that the Information shall form the basis of the contract between the parties hereto. I/We understand that if any of the Information is not full or complete or true or correct, the Policy issued hereunder may be void and I/we may receive nothing from the policy. 58Principles of Insurance Lawdescribes the effect of a basis clause as follows (at p 237): The use of a basis clause is by far the most common way warranties are created in an insurance contract. When an insured warrants the truth or accuracy of the statements given in a proposal form, the insurer is entitled to avoid the contractab initioif the statements are inaccurate even though they have no effect on the insured risk. The insurer is not obliged to show any causal link between the misstatement and the loss which takes place. Equally, if there is a misstatement in a proposal form containing a basis clause, the insurer is also not obliged to show that the misstatement constitutes a fact material to the risk insured, namely, that the information would have influenced a prudent insurer in his decision whether to take on the risk or the amount of premium to be charged for undertaking the risk. 59  I agreed with the defendant that the basis clause meant that the Insured’s Answers became warranties or conditions precedent and that the effect of the Insured’s Answers being false was that the defendant was also entitled to avoid the Policy on this ground.",
        "The incontestability clause": "60 The plaintiff relied on a term of the Policy which provided that the validity of the Policy could not be contested after two years from the issue date except for failure to pay premiums or fraud.94Foot Note 94×1 AB 316.However, as I had found that the Insured’s misrepresentations and non-disclosures were fraudulent, the defendant was entitled to rely on the fraud exception in the incontestability clause.",
        "": ""
    }
}