{
    "case_title": "Pang Moh Yin Patricia and another vSim Kwai Meng",
    "ncitation": "[2021] SGHC 11",
    "coram": "Dedar Singh Gill J",
    "sections": {
        "Background": "2 The ex-wife is an architect and runs an architectural consultancy firm. The ex-husband works as a part-time property agent and a resident engineer. They have two adult children, namely, Mr Christopher Sim and Ms Stephanie Sim (“Children”). At the material time, the family (together with the Mother before her passing) resided at a property located at 79 Mulberry Avenue Singapore 348452 (“Mulberry Property”). The Mulberry Property was owned by the following parties as tenants-in-common in the proportions as listed: (a) 50% by the ex-wife; (b) 33.3% (ie,one-third) by the ex-husband; and (c) 16.7% (ie,one-sixth) by the Mother. 3 The ex-wife and ex-husband also owned another property (“Signature Park property”) as joint tenants. The property’s mortgage was fully paid in September 2014. In February 2015, the joint tenancy was severed. The ex-wife and ex-husband then became co-owners of the said property as tenants-in-common in equal shares. 4 The oral agreement that is the subject of the present dispute allegedly concerns the Mulberry Property and the Signature Park property. Both parties have given conflicting versions of the events leading up to the entering of the said agreement. These will be discussed later below. 5 It is undisputed that on 22 June 2015, the ex-husband proposed to the ex-wife a sale of the Signature Park property. In connection with this proposal, they had a discussion in the master bedroom of the Mulberry Property and entered into an oral agreement (“Oral Agreement”). The terms of this Oral Agreement are contested. The ex-husband says that all that was agreed was that the Signature Park property would be sold. His account is hereinafter referred to as the “ex-husband’s Pleaded Oral Agreement”. According to the ex-wife, however, the agreed terms were as follows: (a) The ex-wife would consent to the ex-husband's request for the Signature Park property to be sold. (b) The ex-husband would transfer all his rights, title and interests (ie,his one-third share) in the Mulberry Property to the ex-wife. (c) The ex-wife would then transfer her half-share of the sale proceeds of the Signature Park property, less $180,000, to the ex-husband. The deduction of $180,000 (“$180,000 Deduction”) was meant to compensate the ex-wife for the estimated rental proceeds which she would forgo as a result of the sale of the Signature Park property. (“ex-wife’s PleadedOral Agreement”). 6 On either pleaded version of the Oral Agreement, the Signature Park property was to be sold. To this end, the ex-husband procured the services of his brother, a real estate agent, to sell the Signature Park property. In July 2015, an option to purchase the said property for $1.35m was granted. On 23 July 2015, the option was exercised. On 27 August 2015, both the ex-wife and ex-husband attended at the conveyancing solicitor’s office to sign the relevant sale documents. On 17 September 2015, the sale of the Signature Park property was completed. The ex-wife and ex-husband each received a half-share of the proceeds, amounting to about $675,000. 7 Thereafter, on 5 October 2015, the ex-wife approached the ex-husband to ask him to transfer his one-third share in the Mulberry Property to her. The ex-wife says that this was pursuant to the ex-wife’s Pleaded Oral Agreement. The ex-husband denies this. It is undisputed that on that day, the ex-husband made it clear that he would not be making the transfer. The ex-wife then drafted a handwritten note (“Handwritten Note”) purporting to reflect the terms of the ex-wife’s Pleaded Oral Agreement (as set out at [5] above), although the note omitted to include the $180,000 Deduction. The Handwritten Note stated: 5 oct 2015 I, [the ex-husband’s name] HEREBY CONFIRM THAT I AGREED TO TRANSFER MY 1/3 SHARE OF [THE MULBERRY PROPERTY] IN RETURN FOR [EX-WIFE]; THE HALF SHARE OWNER OF [THE SIGNATURE PARK PROPERTY], TO ALLOW ME TO SELL THE UNIT AT SIGNATURE PARK AND TO KEEP ALL THE SALE PROCEEDS.  [Ex-husband’s name] The ex-wife and the ex-husband had a heated exchange during which the former attempted to get the latter to sign the above note. A scuffle broke out. The ex-husband was on one side. The ex-wife and their son, Mr Christopher Sim, were on the other side. When all was said and done, the Handwritten Note remained unsigned by the ex-husband. 8 Subsequently, on 4 November 2015, the ex-husband filed for divorce by commencing FC/D 4974/2015 against the ex-wife (“Divorce Suit”). In April 2016, whilst the Divorce Suit was still ongoing, the ex-wife commenced a separate action, Suit No 364 of 2016, against the ex-husband (“Previous Suit”). The facts pleaded by the ex-wife in the Previous Suit are materially similar to those pleaded in the present Suit. In the Previous Suit, the ex-wife essentially sought to enforce an alleged oral agreement which was, in all material aspects, identical to the ex-wife’s Pleaded Oral Agreement. However, the ex-husband successfully applied to the High Court for a stay of the Previous Suit on account of the ongoing Divorce Suit. The ex-wife eventually discontinued the Previous Suit. 9 Thereafter, the two individuals continued with the proceedings in the Divorce Suit. The relevant events are set out below: (a) On 3 November 2017, the district judge (“DJ”) hearing the ancillary matters in the Divorce Suit delivered her decision(“DJ’s Order”). The DJ’s Order included the following terms in relation to the division of the matrimonial assets: (i) The ex-wife shall have “thefirst rightto buy over the [ex-husband’s one-third] share in the [Mulberry Property] at $840,000” [emphasis added]. If “the [ex-wife] wishes to do so, she shall confirm in writing within 4 weeks from the date of this Order … and complete the transfer within 3 months from the date of the Final Judgment”. (ii) Alternatively, “parties shall jointly sell the [Mulberry Property] in the open market and complete the sale within 6 months from the date of the Final Judgment”. The net proceeds of sale shall be apportioned 50% to the ex-wife, 33.3% to the ex-husband and 16.7% to the Mother. (iii) The ex-wife and ex-husband shall “retain assets in each sole name and/or possession”. (b) On 14 November 2017, the certificate of final judgment of divorce was issued. (c) The ex-wife then appealed to the High Court (Family Division) against the DJ’s Order in HCF/DCA 153/2017 (“HCF Appeal”).On 26 February 2018, the DJ issued her grounds of decision (“DJ’sGD”) in respect of the DJ’s Order. (d) On 10 August 2018 and 6 September 2018, the High Court judge (“HCFJudge”) heard parties on the HCF Appeal. On 8 October 2018, he delivered his decision and made his orders (“HCFOrder”), which included: (i) upholding the part of the DJ’s Order set out in [9(a)(i)] above; and (ii) setting aside the part of the DJ’s Order set out in [9(a)(ii)] above. The above proceedings in the Divorce Suit are relevant for two reasons. First, as set out later below, the ex-husband argues that certain matters in the present Suit were previously litigated in the Divorce Suit and are nowres judicatabefore this Court. Second, the ex-husband’s counterclaim against the ex-wife is based on her alleged non-compliance with the DJ’s Order and the HCF Order above. 10 On 8 November 2018, the ex-husband began a fresh action against the ex-wife and the Mother by way of Originating Summons No 1359 of 2018 (“OS”). He sought,inter alia, a court order that the Mulberry Property be sold on the open market and the proceeds of sale be divided amongst the ex-wife, the Mother and himself according to their respective ownership shares. Shortly after, on 15 November 2018, the Mother passed away and the ex-wife thus became the Personal Representative of the estate. In the late Mother’s will, she bequeathed her one-sixth share in the Mulberry Property to the Children in equal shares. The OS was then amended so that the second defendant became the ex-wife in her capacity as the Personal Representative. 11 On 22 February 2019, the ex-wife (in her own name and as the Personal Representative) filed an application, Summons No 937 of 2019 (“SUM 937”), to convert the OS into a writ action. This was granted by the assistant registrar (“AR”) on 19 March 2019. The OS was thereby converted into a writ action, that being the present Suit. Specifically, the AR ordered that the proceedings be continued as if they had been begun by the issue of a writ of summons with the ex-husband as the defendant and the ex-wife in both capacities as the first plaintiff and second plaintiff. 12 On 1 April 2019, the ex-husband filed Registrar’s Appeal No 104 of 2019 (“RA 104”) against the AR’s decision in SUM 937. On 6 August 2019, Lee Sieu Kin J dismissed RA 104. Thereafter, parties filed their pleadings for this Suit in the usual course. The plaintiffs are represented by counsel in this Suit. The ex-husband is a litigant-in-person although he has apparently received some form of legal assistance in these proceedings.",
        "The plaintiffs’ case": "13 By way of background to the Oral Agreement, the plaintiffs paint a picture of the ex-husband as a compulsive gambler under pressure from his creditors. According to them, the ex-wife discovered in early 2008 that the ex-husband had been gambling regularly on casino cruise ships and in Genting Highlands casinos. The ex-husband secretly continued his gambling activities over the next several years despite his repeated promises to stop. In 2010, for example, the ex-husband purchased an annual entrance membership to gamble at the Resorts World Sentosa casino. These gambling activities led to a deterioration of the ex-husband’s personal financial situation and strained the marital relationship between the couple. The ex-husband faced mounting debts which caused him to borrow heavily from banks and moneylenders. Between 2014 and 2015, the ex-husband sought to borrow money on at least two occasions from the ex-wife, but these requests were rejected. He also attempted to refinance the Signature Park property to obtain more funds but was unsuccessful. 14 Around the time of the Oral Agreement, the ex-husband’s financial woes came to a head as he had many debts falling due in July 2015. It was in this context – with his back against the wall and facing increasing pressure from his creditors – that in early June 2015, the ex-husband proposed to the ex-wife the sale of the Signature Park property. Initially, the ex-husband threatened to file for divorce and liquidate all the matrimonial assets to pay off his debts if the ex-wife did not agree to a sale. The ex-wife refused to do so. She had purchased the Signature Park property for the long-term so that it could be used to earn passive income and eventually be bequeathed to the Children. To resolve this impasse the ex-husband proposed that in exchange for the ex-wife agreeing to sell the Signature Park property he would transfer his one-third share in the Mulberry Property to her. The ex-wife says that she feared that the ex-husband’s debts would result in him being made bankrupt. This would expose the Mulberry Property to his creditors. The property was the family home in which the ex-wife, the Mother and the Children lived. The ex-wife therefore agreed to the ex-wife’s Pleaded Oral Agreement (as set out at [5] above) in order to protect the family home. Although it was not a term of the agreement, the ex-wife indicated that she would consider allowing the ex-husband to continue living in the Mulberry Property on the condition that he did not resume his gambling activities. 15 Immediately after, the ex-husband took steps to quickly sell the Signature Park property. The ex-wife was not deeply involved in the conduct of the sale and there was no discussion on the sale price. The ex-husband accepted the offer of $1.35m without even consulting her. Even though this price was below the market value of the property, the ex-wife acquiesced to the sale in order to fulfil her end of the bargain. She was thus shocked to learn on 5 October 2015 that the ex-husband was reneging on his obligations under the ex-wife’s Pleaded Oral Agreement. This is what led to the scuffle on that day. In subsequently commencing the Divorce Suit on 4 November 2015, the ex-husband was attempting to deny the ex-wife’s claim to the Mulberry Property by having it divided as a matrimonial asset. 16 As a consequence of the above, the plaintiffs seek to enforce the ex-wife’s Pleaded Oral Agreement and obtain,inter alia,the following reliefs: (a) A declaration that the ex-wife and the ex-husband entered into the ex-wife’s Pleaded Oral Agreement (as set out at [5] above). (b) An order that the ex-husband do “all that is necessary to transfer his 33.3% share of the Property” to the ex-wife forthwith. (c) Alternatively, in the event that the ex-husband is absent, or neglects, or refuses to sign any document or endorse any instrument in accordance with the terms of the judgment or order, an order that the signature thereof by the Registrar, shall have the same effect as the execution, signing or indorsement thereof by the party ordered to execute, as provided for under s 14(1) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”). (d) An order that the remaining sale proceeds of the Signature Park property as may be due to the ex-husband under the ex-wife’s Pleaded Oral Agreement shall be paid by the ex-wife to the ex-husband (save for the sum of $180,000 which the ex-wife shall retain) after his transfer of his one-third share in the Mulberry Property to the ex-wife. 17 In reply to the ex-husband’s Res Judicata Defence and Formality Defence (as defined at [18] and [21] below), the plaintiffs further contend the following: (a) The ex-husband has previously raised theRes JudicataDefence before Lee J in RA 104 and is precluded on the ground of issue estoppel from raising the defence again before this Court. (b) Certain WhatsApp messages exchanged between the ex-wife and ex-husband satisfy the formality requirements of s 6(d) of the Civil Law Act (Cap 43, 1999 Rev Ed) (“CLA”). (c) Even if s 6(d) of the CLA is not satisfied, the ex-wife’s Pleaded Oral Agreement has been performed in part by the ex-wife and is therefore enforceable on that ground.",
        "The defendant’s case": "18 The ex-husband’s preliminary objection is that the issue of what the terms of the Oral Agreement were (ie,the “Agreed Terms Issue” as defined in [24(a)] below) had already been argued and decided in prior legal proceedings. Before this court, the said issue is thereforeres judicata(“Res Judicata Defence”). 19 As to the crux of the dispute, the ex-husband claims that the background to the Oral Agreement as painted by the plaintiffs is misleading. He denies their allegations that he was a compulsive gambler. He accepts that he did purchase an annual membership to enter the Resorts World Sentosa casino but claims that this was allegedly only for leisure, networking and client entertainment purposes. The ex-husband admits that he did ask to borrow money from the ex-wife on two occasions. 20 According to the ex-husband, he had proposed the sale of the Signature Park Property to the ex-wife simply because condominium prices in the vicinity of the said property had peaked. There were many upcoming condominium projects nearby, which would eventually lead to falling prices for older condominium estates (such as the Signature Park property). This was the reason that the parties agreed to the ex-husband’s Pleaded Oral Agreement on 22 June 2015 and there was nothing more to it. None of the additional terms in the ex-wife’s Pleaded Oral Agreement were even mentioned, much less agreed to. The eventual sale price of the Signature Park property of $1.35m was above its market value at the time. The ex-wife’s allegation that she was not consulted on the buyers’ offer was untrue as she had agreed in advance to a sale price of not less than $1.3m. The ex-wife’s Pleaded Oral Agreement is, in truth, a scheme concocted by her to deprive him of his rightful share of the Mulberry Property. 21 The ex-husband also argues that even if the ex-wife and he had entered into the ex-wife’s Pleaded Oral Agreement, the said agreement is unenforceable on account of a failure to comply with the formalities required by s 6(d) of the CLA. (“Formality Defence”). 22 The ex-husband further counterclaims against the ex-wife on the following basis (“Counterclaim”). Allegedly, the DJ’s Order in the Divorce Suit required the ex-wife to buy over the ex-husband’s one-third share in the Mulberry Property for $840,000. To date, she has refused to do so. The HCF Order did not disturb the lower court’s findings of fact, disallowed the ex-wife’s appeal and merely set aside the part of the DJ’s Order set out at [9(a)(ii)] above. That being the case, the ex-husband is entitled to damages resulting from the ex-wife’s non-compliance with the DJ’s Order. To calculate the aforesaid damages, the ex-husband argues the following: (a) At the time of the hearing before the DJ in 2017, “[t]he agreed market value for the [Mulberry Property] was $2,520,000” and the ex-husband’s one-third share was worth $840,000. (b) If “the [Mulberry Property] were to be sold today, it would fetch about $3,150,000”. The ex-husband’s one-third share would be worth “about $1,048,950”. (c) The ex-husband has “lost out in terms of capital appreciation and interests [sic]”, a sum of $208,950 (being the difference between $1,048,950 and $840,000). He is thus entitled to “damages of $208,950” plus interest and costs.",
        "Issues that arise for my consideration": "23 There are three preliminary issues for me to deal with: (a) Whether the ex-wife, in her capacity as the Personal Representative of her late Mother’s estate, has anylocus standito seek the reliefs sought (“Locus StandiIssue”). (b) Whether the plaintiffs are precluded by the doctrine ofres judicatafrom raising before this Court the issue of what the terms of the Oral Agreement are (ie,the “Agreed Terms Issue” as defined at [24(a)] below) (“Res JudicataIssue”). (c) In respect of the affidavits of evidence-in-chief (“AEICs”) filed by the parties’ witnesses, whether any contents thereof are inadmissible or objectionable on any basis (“Admissibility Issue”). 24 The main issues that arise for my consideration are as follows: (a) What were the terms of the Oral Agreement entered into by the ex-wife and ex-husband on 22 June 2015? (“AgreedTerms Issue”) (b) If the terms of the Oral Agreement are as per the ex-wife’s Pleaded Oral Agreement, whether the said agreement is enforceable (“Enforceability Issue”). This comprises the following sub-issues: (i) Does the Oral Agreement fulfil the formality requirements of s 6(d) of the CLA? (“FormalitiesSub-Issue”) (ii) If not, is the Oral Agreement nonetheless enforceable on the ground that the ex-wife has performed the agreement in part? (“Part PerformanceSub-Issue”) (c) Whether the ex-husband’s counterclaim against the ex-wife succeeds (“Counterclaim Issue”).",
        "Analysis of the issues": "",
        "Locus Standi Issue": "25 The ex-wife claims to be a party to her Pleaded Oral Agreement in her own name. If I accept that the said agreement is sufficiently proven, it is clear that she has thelocus standito apply for the reliefs sought as a contracting party to the agreement. It is not, however, alleged by either side that theMotherwas a party to either the ex-wife’s or ex-husband’s Pleaded Oral Agreement. That being the case, I fail to see what standing the ex-wife has as the Personal Representative of her late Mother’s estate to apply for the reliefs sought. All that the ex-wife said in her AEIC is that her late Mother’s “[e]state will be guided by the…Court’s decision in this case as the [e]state is a part owner of the [Mulberry] Property but is not a party to the Oral Agreement”. This does nothing to address the aforesaid difficulty. I therefore dismiss the action by the ex-wifequathe Personal Representative and decline to grant the reliefs sought by her in that capacity. For consistency, however, my analysis below will continue to refer to the case run collectively by the “plaintiffs” despite my finding that the ex-wife’s actionquathe Personal Representative fails.",
        "Admissibility Issue": "26 Before trial, each side filed a Notice of Objections to Contents of AEIC (“Notice of Objections”) in respect of the AEICs of the other side’s witnesses. As some of these objections go to the admissibility, and not merely the weight, of the witnesses’ evidence, I deal with both Notices of Objections as a preliminary issue. The ex-husband’s Notice of Objections 27 Shortly after the Oral Agreement of 22 June 2015, the ex-wife says that she separately told the Mother (who was still alive at the time) as well as several other family members and relatives that she had entered into the ex-wife’s Pleaded Oral Agreement with the ex-husband. The other family members and relatives (collectively the “Third Parties”) that the ex-wife allegedly spoke to are as follows: (a) Ms Stephanie Sim, the elder child of the ex-wife and ex-husband. (b) Mr Christopher Sim, the younger child of the ex-wife and ex-husband. (c) Mr Kevin Tan, a cousin of the ex-wife. (d) Ms Corinna Ann Jonathan, the wife of the ex-husband’s brother. (e) Ms Adelina Pang, a cousin of the ex-wife. 28 About a year later, in August and September 2016, the Mother and the Third Parties each signed a statutory declaration detailing their separate conversations with the ex-wife (“Statutory Declarations”). During the said conversations, they were allegedly told that the ex-wife had agreed with the ex-husband to give up her half-share in the Signature Park property in return for his one-third share in the Mulberry Property. 29 As the Mother had passed away by the time of trial, the ex-wife exhibited the late Mother’s Statutory Declaration in her own AEIC. She filed a Notice to Admit Documentary Hearsay Evidence (dated 17 August 2020) and relied on the exception for hearsay evidence in s 32(1)(j)(i) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) to admit the said Statutory Declaration. Although the ex-husband did not object to the admissibility of the Mother’s Statutory Declaration in his Notice of Objections (see [30] below), he appears to have done so in his AEIC on the ground that it constitutes hearsay. I reject such an objection. Under s 32(1)(j)(i) of the Evidence Act, a statement of relevant facts (ie,a statement relating to the terms of the Oral Agreement) is itself relevant and therefore admissible where the maker of the statement has passed away. The Mother’s Statutory Declaration plainly falls into this category of statements and is therefore admissible pursuant to the said provision. 30 As for the Third Parties, they each filed their own AEICs and exhibited their own Statutory Declarations to their respective AEICs. On 11 August 2020, the ex-husband filed his Notice of Objections to the following contents: (a) Paragraphs 4 and 5 of the AEIC of Ms Stephanie Sim, and her Statutory Declaration exhibited thereto. (b) Paragraph 4 of the AEIC of Mr Christopher Sim, and his Statutory Declaration exhibited thereto. (c) The AEICs of Ms Corinna Ann Jonathan, Ms Adelina Pang, and Mr Kevin Tan, and their respective Statutory Declarations exhibited thereto. (d) Various paragraphs of the ex-wife’s AEIC. For the record, on 25 August 2020, I granted the plaintiffs’ application in Summons No 3466 of 2020 to strike out part of the ex-husband’s Notice of Objections which referred to certain “without prejudice” correspondence. 31 The ex-husband’s objections to the ex-wife’s AEIC (referred to [30(d)] at above) can be briefly dealt with. His objections are essentially factual rebuttals disputing the ex-wife’s evidence. These are not grounds for refusing to admit the ex-wife’s evidence entirely and will simply be taken into consideration in my overall assessment of the evidence below. The ex-husband also raised an objection on the ground ofres judicata,which will be dealt with in the next section. 32 My present focus is instead on the ex-husband’s objections at [30(a)-(c)] above. These objections are made on the basis that the specified evidence of the Third Parties (“ObjectedThird-Party Accounts”) is hearsay and thus inadmissible. The Objected Third-Party Accounts mainly (but do not exclusively) comprise accounts given by the respective Third Parties in relation to what the ex-wife had told him/her about the alleged terms of the Oral Agreement. 33 The plaintiffs, unsurprisingly, reject the ex-husband’s objection. They do not deny that the Third Parties were not present when the ex-wife entered into the Oral Agreement with the ex-husband and that the Third Parties thus do not have personal knowledge of the conversation that took place. However, this supposedly only goes to the weight to be ascribed to the Objected Third-Party Accounts and not their admissibility. It is argued by the plaintiffs that the rule against hearsay only excludes out-of-court statements where the maker of the statement is not produced in court. In the present case, however, all of the Third Parties were called as witnesses at trial. 34 InOrion-One Development Pte Ltd (in liquidation) v Management Corporation Strata Title Plan No 3556 (suing on behalf of itself and all subsidiary proprietors of Northstar @ AMK) and another appeal[2019] 2 SLR 793, the Court of Appeal (citingSoon Peck Wah v Woon Che Chye[1997] 3 SLR(R) 430 at [26]) endorsed the following definition of hearsay evidence (at [9]): [T]he assertions of persons made out of court whether orally or in documentary form or in the form of conduct tendered to prove the facts which they refer to (iefacts in issue and relevant facts) … 35 In the plaintiffs’ submissions, they argue that the Objected Third-Party Accounts “speak to…the conduct of [the ex-wife] after the Oral Agreement was entered into, i.e. a relevant factor for the Court to take into account in deciding if the Oral Agreement [as alleged by the ex-wife] exist[s]”. In other words, the plaintiffs are relying on the Objected Third-Party Accounts forthe purpose of proving the truth of the ex-wife’s out-of-court statementsin relation to the alleged terms of the Oral Agreement. To that extent, I agree with the ex-husband that the Objected Third-Party Accounts constitute hearsay evidence. The fact that the Third Parties were produced in court to confirm their respective AEICs as their own and to be cross-examined does not change this. The point remains that the Third Parties were still testifying as to what another party hadtoldthem and their testimony is being relied upon to prove the truth of that other party’s out-of-court statements. This is impermissible unless the plaintiffs establish that some exception to the hearsay rule (ie,under s 32(1)(a)-(k) of the EA) applies. The plaintiffs, however, made no attempt to do this. 36 I thus hold that the Objected Third-Party Accounts are inadmissible for the purpose of proving the truth of the ex-wife’s statements in relation to the alleged terms of the Oral Agreement. That being said, there are certain statements in the Objected Third-Party Accounts that the plaintiffs are relying on for other purposes. For example, in their Statutory Declarations, some of the Third Parties gave evidence on matters which they apparently had direct personal knowledge of,ie,matters which were not simply told to them by the ex-wife. These matters relate largely to the ex-husband’s gambling activities and debts and will be discussed later below. The plaintiffs’ Notice of Objections 37 On 11 August 2020, the plaintiffs also filed a Notice of Objections to Contents in respect of the ex-husband’s AEIC. The objections are that the statements in question are: (a) scandalous, irrelevant or otherwise oppressive;(b) inadmissible as opinion evidence;(c) legal submissions, rather than evidence as to facts in issue; and(d) in relation to unpleaded material facts. 38 The ex-husband did not respond to any of these objections. Although I agree with some of the said objections, I do not consider them to raise any particularly significant issues. As such, I will not individually address each objection but will make the following general comments: (a) As to the objections in [37(a)] and [37(d)] above, I approach them by simply discussing below whatisrelevant to the disputed issues raised in the pleadings. Insofar as the ex-husband’s statements were irrelevant to the said issues, they do not factor into my analysis. (b) In respect of the objections at [37(b)] above, I am cognisant of the rule against the admissibility of opinion evidence and thus do not rely on the ex-husband’s statements insofar as they constituted such evidence. (c) Similarly, as for the objections at [37(c)] above, I disregard the ex-husband’s statements in his AEIC insofar as they were in the nature of legal submissions. In any event, most of the statements in question were repeated in one form or another in his closing and reply submissions. Where this is not the case, I will point it out below.",
        "Res Judicata Issue": "39 The ex-husband’s Res Judicata Defence is that the doctrine ofres judicataprecludes the ex-wife from raising the Agreed Terms Issue again before this Court. In support of this argument, the ex-husband elaborates as follows: (a) The Agreed Terms Issue had already been argued before the DJ in the Divorce Suit. The DJ had decided that the terms of the Oral Agreement, as alleged by the ex-wife at the time, were not sufficiently proven. (b) In the HCF Appeal, the ex-wife raised the Agreed Terms Issue again but her counsel apparently dropped the said issue in the course of the appeal. (c) It is thus clear that both the DJ and the HCF Judge have already adjudicated on the Agreed Terms Issue in the Divorce Suit. Furthermore, the ex-wife had commenced the Previous Suit to litigate this very issue but then discontinued the action. Instead, she elected to raise the said issue in the HCF Appeal (although she ultimately decided to drop it). She ought to be estopped from raising the same issue again before this Court. 40 The substance of the ex-husband’sRes JudicataDefence was set out in his AEIC but was not repeated in his submissions. This was one of the ex-husband’s arguments which the plaintiffs objected to as being a legal submission, rather than evidence as to the facts in dispute. I am, however, not minded to foreclose this entire line of argument insofar as the ex-husband did have some personal knowledge of the factual mattersunderlyingit (ie,the proceedings in the Divorce Suit and the Previous Suit). The “legal submission” that these underlying facts gave rise tores judicatawas but a small step that inexorably followed from the said facts. I will thus consider theRes JudicataDefence on its merits. 41 The plaintiffs’ response is that the ex-husband is himself precluded on the ground of issue estoppel from raising theRes JudicataDefence again before this Court. They allege that Lee J in RA 104, in allowing the OS to be converted to the present Suit, had already heard and conclusively rejected this argument. In my view, the plaintiffs’ response cannot be sustained. The simple reason is that the plaintiffs failed to point me to any part of the court’s decision in RA 104 that supposedly dealt with theRes JudicataDefence. While it appears from the parties’ submissions in RA 104 that the point wasargued,there is no evidence that it was actuallydecided.The first and fourth requirements of issue estoppel, as set out at [43] below, are not made out. 42 InGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”) at [17]–[19], Sundaresh Menon JC (as he then was) explained that the doctrine ofres judicataencompasses three conceptually distinct, though interrelated, strands – namely, cause of action estoppel, issue estoppel, and the “extended doctrine of res judicata” (also known as “abuse of process”). I understood the ex-husband’sRes JudicataDefence to mainly rely on the second of these strands (ie,issue estoppel). 43 The four requirements for issue estoppel, as enumerated by the Court of Appeal inLee Tat Development Pte Ltd v Management Corporation of Strata Title Plan No 301[2005] 3 SLR(R) 157 (at [14]-[15]), are as follows: (a) There must be a final and conclusive judgment on the merits. (b) That judgment must be of a court of competent jurisdiction. (c) There must be identity between the parties to the two actions that are being compared. (d) There must be an identity of subject-matter in the two proceedings. 44 The previous judgments referred to by the ex-husband (as giving rise to issue estoppel) are the DJ’s Order and the HCF Order. Starting with the DJ’s Order, the focus is whether there is a “final and conclusive” judgment on the merits of the Agreed Terms Issue (ie,the first requirement of issue estoppel. InGoh Nellie(at [28]), Menon JC gave following guidance as to the meaning of “finality”: …Finality for the purpose ofres judicatasimply refers to a declarationor determination of a party’s liability and/or his rights or obligations leaving nothing else to be judicially determined:The Doctrine of Res Judicataat para 154. Whether the decision in question is a final and conclusive judgment on the meritsmay be ascertained from the intention of the judgeas gathered from the relevant documents filed, the order made and the notes of any evidence taken or arguments made … [emphasis added in bold] 45 I make the following observations about the DJ’s GD: (a) It appears from the DJ’s GD (at [3], [7] and [8]) that the Agreed Terms Issue was argued before her, although the exact terms alleged by the ex-wife in the Divorce Suit were somewhat different from the terms in the ex-wife’s Pleaded Oral Agreement. Before the DJ, the ex-wife alleged that the ex-husband had agreed to transfer his one-third share in the Mulberry Property to her in exchange for her consent to sell the Signature Park property urgently. Each of them would supposedly get an “equal share of the net sale proceeds”, save that the ex-wife was “entitled to deduct…$180K and [other sums]” from the ex-husband’s share. The ex-wife had argued that as a result of this alleged oral agreement, the Mulberry Property was no longer subject to division as a matrimonial asset. In response, the ex-husband had argued,inter alia,that the court should not take into account the ex-wife’s allegations because the said agreement was not made “in contemplation of divorce”. (b) At [9] of the DJ’s GD, the DJ “accepted [the ex-husband’s arguments], as supported by section 112 of the WC”. I note that s 112(2)(e) of the Women’s Charter (Cap 353, 2009 Rev Ed) (“WC”) provides that in dividing the pool of matrimonial assets, the court maytake into account“any agreement between the parties with respect to ownership and division of the matrimonial assets madein contemplation of divorce” [emphasis added]. The DJ referred to this subsection, saying that “[according to s 112(2)(e) of the WC,] any agreement between the parties with respect to ownership and division of the matrimonial assets must be made in contemplation of divorcewhich was not the case here” [emphasis added]. (c) The DJ also found that in any case, the “evidence on paper” (which included certain text messages, a “hand-written agreement” and the parties’ affidavit evidence) was not conclusive evidence proving the terms of the oral agreement as alleged by the ex-wife in the proceedings (at [9]). (d) Lastly, the DJ ruled that “[m]ore importantly, [she] had no powers under the relevant matrimonial laws to adjudicate on such property disputes” (at [9]). 46 It is clear from [45(c)] above that the DJ had made a finding of fact on the Agreed Terms Issue. However, based on the DJ’s reasoning set out at [45(b)] and [45(d)] above, it appears that the DJ did not consider it to be within her powers to adjudicate on the said issue because the oral agreement alleged by the ex-wife did not fall under s 112(2)(e) of the WC. That being the case, I do not think that the DJ had at all intended her finding to be a “final and conclusive” judgment in respect of the Agreed Terms Issue. The first requirement of issue estoppel is hence not made out. 47 Similarly, I do not accept that the HCF Order gives rise to issue estoppel. As I have just mentioned, despite making a finding of fact on the Agreed Terms Issue, the DJ also ruled that she had “no powers under the relevant matrimonial laws” to adjudicate on the said issue. The ex-wife’s HCF Appeal was against the DJ’s entire decision. It appears from the ex-wife’s Appellant’s Case, as well as the notes of evidence for the hearing on 8 October 2018 (when the HCF Judge delivered his decision), that the parties had also raised the Agreed Terms Issue on appeal. However, the ex-husband’s AEIC states that in the course of the appeal the ex-wife’s counsel abandoned the Agreed Terms Issue altogether. For some reason, neither side adduced the notes of evidence for the hearings before the HCF Judge on 10 August 2018 and 6 September 2018 to enable the court to verify whether this was true. Nonetheless, I note that the ex-wife does not deny this and I will proceed on the basis that the ex-husband’s evidence is correct. Subsequently, when the HCF Judge issued the HCF Order, he did not give any reasons or make any finding on the Agreed Terms Issue. There is nothing in the matters I have just described to indicate that the HCF Judge had reached a final and conclusive decision on the merits of the Agreed Terms Issue. I hence find that the HCF Order does not satisfy the first requirement of issue estoppel either. 48 I now deal with a related argument raised by the ex-husband based on the differing jurisdiction of this Court and the Family Justice Courts (which comprises the High Court (Family Division), as well as the Family Courts). The ex-husband argues that the Mulberry Property was a matrimonial asset and was thus liable to division under s 112 of the WC. Pursuant to the DJ’s Order and the subsequent HCF Order, the Family Justice Courts have exercised the aforesaid power of division in respect of the Mulberry Property in the Divorce Suit. If the ex-wife was aggrieved by the DJ’s Order or the HCF Order, the proper avenue was for her to file an appeal against the same. The present Suit is an attempt to bring a “back-door appeal” against the two aforesaid decisions and therefore an “abuse of process”. It is further said that this Court has no jurisdiction to divide matrimonial assets or to disturb the “findings” by the DJ or the HCF Judge in the HCF Appeal. 49 I am not convinced by the ex-husband that the present Suit amounts to an abuse of process. Contrary to his suggestion, the plaintiffs are not seeking to have this Court exercise the same jurisdiction as the Family Justice Courts under s 112 of the WC to divide the Mulberry Property as a matrimonial asset. Rather, they are simply seeking to have this Court exercise its independent jurisdiction to determine the Agreed Terms Issue in relation to the Mulberry Property. Insofar as he is arguing that this Court nonetheless ought not to exercise its jurisdiction to hear the Agreed Terms Issue again because it has already been decided in the proceedings for the Divorce Suit, this is in effect an argument founded on issue estoppel which I have dealt with above. I hence say no more on this point. 50 For completeness, the Previous Suit also does not give rise to any issue estoppel in respect of the Agreed Terms Issue. This is because after the Previous Suit was stayed by the High Court, it was discontinued by the ex-wife before a “final and conclusive judgment on the merits” was rendered. As to the brief point made by the ex-husband in relation to the Previous Suit, as set out at [39(c)] above, I cannot agree that the ex-wife’s decision to discontinue the Previous Suit is, in and of itself, an abuse of process. 51 For the foregoing reasons, I see no basis to hold that the doctrine ofres judicataprecludes the ex-wife from raising the Agreed Terms Issue (or otherwise maintaining the present Suit) against the ex-husband. I thus turn to the main issues in this action.",
        "Agreed Terms Issue": "52 The question here is whether the terms of the Oral Agreement are as per the ex-wife’s or the ex-husband’s Pleaded Oral Agreement. The plaintiffs’ account has been set out at [13]–[15] above while the ex-husband’s is at [19]–[20] above. The ex-husband makes the following additional points: (a) It would not have made any sense for him to enter into the ex-wife’s Pleaded Oral Agreement given that his one-third share in the Mulberry Property was worth at least $840,000. This was more than the ex-wife’s half-share in the Signature Park property, which was worth a mere $675,000. (b) The ex-wife was legally represented throughout the process of selling the Signature Park property. If the terms of the Oral Agreement were as per the ex-wife’s Pleaded Oral Agreement, the ex-wife would have instructed the conveyancing solicitor at the time to draft a proper written agreement for signing. Yet, she omitted to do so. She only opted to draft the Handwritten Note and tried to force the ex-husband to sign it on 5 October 2015, almost three months after the sale. The ex-wife is a professional architect and not a naïve person. Even on the ex-wife’s own account, their marital relationship had soured years before 2015 and there was no more trust between them. In such circumstances, the ex-wife’s omission to put the ex-wife’s Pleaded Oral Agreement in writing goes to show that the said agreement was never entered into at all. 53 Having considered all the evidence and the parties’ submissions, my view is that the ex-wife’s account of the terms of the Oral Agreement is to be preferred over that of the ex-husband’s. My assessment of the evidence will broadly cover the following areas: (a) The general consistency of the parties’ cases(b) The documentary correspondence between the parties.(c) The circumstances surrounding the Oral Agreement.(d) Other relevant evidence.At the appropriate junctures, I also examine how the affidavit evidence and testimony of the various witnesses cohere with the abovementioned evidence. 54 I start with the general consistency of the parties’ cases, as stated in their pleadings, AEICs, trial testimony and submissions. In her AEIC, testimony and submissions, the ex-wife generally stood by the plaintiffs’ pleaded position in respect of the ex-wife’s Pleaded Oral Agreement. On the other hand, the ex-husband seemed to vacillate between saying that on 22 June 2015 there was “no oral agreement at all” and that there was an Oral Agreement, but only on the terms following the ex-husband’s Pleaded Oral Agreement. In submissions, the plaintiffs’ counsel argued that the ex-husband was plainly being inconsistent. Although I can understand the point that counsel is making, it appears that by stating (in his AEIC, at trial and in submissions) that there was “no oral agreement at all” the ex-husband actually meant that there was no Oral Agreementon the terms alleged by the ex-wife. This is demonstrated, for example, by the fact that, during the ex-husband’s cross-examination of the ex-wife, he essentially said in the same breath that there was no “oral agreement at all”andthat he and the ex-wife only agreed to the sale of the Signature Park property: Court: So what is the question? [Ex-husband]: My question is there areno terms of oral agreement at all… All we did discuss, on the very night of 22 June 2015, was to go ahead with the sale of the Signature Park. Court: Then you can ask her that question and you can put to her that that is all that you discussed. [Ex-husband]: Yes. This is all I discussed on the night of 22 June 2015, all I want to say to you is thatI want to sell the Signature Park; then you repeat, you told me, \"Okay,let's try out and see how the market respond. If I can fetch your minimum expectation of 1.3 million, then we'll go ahead and sell it\", that's all we discussed ... [emphasis added in bold] 55 Understood in this manner, the ex-husband’s case was not internally inconsistent although it was somewhat confusing. Nonetheless, it must be borne in mind that the ex-husband was acting as a litigant-in-person. Generally, I accept that the ex-husband’s case throughout these proceedings was that he and the ex-wife only entered into the ex-husband’s and not the ex-wife’s Pleaded Oral Agreement. 56 Turning to the documentary correspondence between the parties, my view is that it clearly supports the existence of the ex-wife’s Pleaded Oral Agreement. Crucially, as the sale of the Signature Park property was underway in July 2015, the ex-wife and ex-husband had a WhatsApp exchange on 4 July 2015 (“4 July 2015WhatsApp Exchange”). It is undisputed that the only property sale going on at the time was that of the Signature Park property. The said exchange is as follows: 10:08:49 AM: [Ex-husband]: According to Jay,I can request our Lawyer to instruct Buyers[ie,for the Signature Park property]to issue two cheques to u n me for half share payments. No issue. 10:18:49 AM: [Ex-wife]: Ok 10:50:01 AM: [Ex-husband]: I am of the view thatbuyer issue a cheque of $180,000 to yr account & balance to my account.Our lawyer will do the transfer of share forboth propertiesat the same timeas the sale transaction[for the Signature Park property]. Okay 10:53:02 AM: [Ex-wife]: It isn’t just $ 180K , but whatever amt still owing me from common fund 10:53:46 AM: [Ex-husband]: Yes, plus that amount. Okay 10:56:46 AM: [Ex-wife]:No[,] only upon the successful transfer of the house into my name 10:58:09 AM: [Ex-husband]:As well u transferred yr share[ie,in the Signature Park property]to my name, okay 10:59:13 AM: [Ex-wife]:There is no need to transfer bec u are already selling it 10:59:37 AM: [Ex-husband]: Okay [emphasis added in bold and in bold italics] 57 I read the above exchange in the following manner: (a) In the ex-husband’s message at 10.08am, he initially stated that the buyers for the Signature Park property could be requested to issue separate cheques to the ex-wife and himself for their respective half-share in the sale proceeds. The ex-wife agreed to this in her message at 10.18am. (b) At 10.50am, the ex-husband then attempted to change the arrangement. He stated instead (in the first sentence of his message) that upon the completion of the sale, the ex-wife should be issued a cheque for $180,000 and the balance of the entire sale proceeds of the Signature Park property should be paid directly to him. The second sentence of his message continued, “Our lawyer will do thetransfer of share for both propertiesat the same time as the sale transaction [for the Signature Park property]” [emphasis added]. As the plaintiffs point out, the ex-wife and ex-husband only owned two properties –ie,the Signature Park property and the Mulberry Property. The ex-husband does not deny this. The second sentence must therefore have been referring to these two properties. (c) At 10.53am, the ex-wife then referred to the fact that the ex-husband also supposedly owed her additional amounts from a “common fund”. It is unclear what this “common fund” was but it is not a live issue between the parties. A number of seconds later, the ex-husband agreed. (d) At 10.56am, the ex-wife added “No[,] only upon successful transfer ofthe houseinto my name” [emphasis added]. Given that the Signature Park property was to be sold to third party buyers, this message must have been referring to a transfer to the ex-wife of the ex-husband’s one-third share in theMulberry Property. (e) At 10.58am, the ex-husband said that the ex-wife should also transfer her “share” into his name. At 10.59am, the ex-wife replied that there is no need to do so because he is “already selling it”. Immediately after, the ex-husband replies “Okay”. These messages were plainly referring to theSignature Park property. 58 Based on my above reading of the 4 July 2015 WhatsApp Exchange, it is clear to me that it strongly supports the ex-wife’s Pleaded Oral Agreement. I make the following points: (a) The ex-husband’s 10.08am message (and the ex-wife’s agreement at 10.18am) is consistent with the terms of the ex-wife’s Pleaded Oral Agreement, under which each person was tofirstreceive his/her respective half-share of the sale proceeds of the Signature Park property. Read by themselves, the two messages are also consistent with the ex-husband’s Pleaded Oral Agreement (insofar as each person was clearly entitled to receive his/her respective half-share of the sale proceeds). (b) However, in the ex-husband’s 10.50am message, he then sought to change the arrangement relating to the distribution of the Signature Park sale proceeds. Essentially, he stated that the entire sale proceeds of the Signature Park property (less $180,000) should be paid to him immediately upon the completion of the sale. He went on to state that “Our lawyer will do the transfer of share for both properties [ie, the Mulberry Property and the Signature Park property] at the same time as the sale transaction [for the Signature Park property]”. As the plaintiffs rightly point out, under the ex-husband’s Pleaded Oral Agreement, he hadno basisat allfor asking to receive theentire sale proceedsof the Signature Park property (less $180,000). This message is only explicable on the ex-wife’s Pleaded Oral Agreement, insofar as the said agreement required the ex-husband to transfer his one-third share in the Mulberry Property to the ex-wife in exchange. This is supported by the second sentence of the ex-husband’s 10.50am message, where he refers to the “transfer of share” in respect of the Mulberry Property. The ex-husband’s 10.50am message is also consistent with the ex-wife’s Pleaded Oral Agreement insofar as the said agreement required thatultimately(but not immediately upon the completion of the sale),the ex-husband was to receive the entire sale proceeds of the Signature Park property (less $180,000) because the ex-wife would eventually transfer her half-share in the sale proceeds (less $180,000) to him. (c) As alluded to, however, the suggestion in the ex-husband’s 10.50am message that he should receive the entire sale proceeds of the Signature Park property (less $180,000)immediatelyupon the completion of the sale is at odds with the ex-wife’s Pleaded Oral Agreement. This apparent inconsistency is, however, addressed by the ex-wife’s message at 10.56am. She says “No”, and that the ex-husband would have to transfer his one-third share in the Mulberry Property to herfirst. In other words, the ex-wife insisted on first receiving her half-share of the sale proceeds of the Signature Park property. This brings the parties’ exchange fully in line with the ex-wife’s Pleaded Oral Agreement, insofar as under the said agreement the ex-wife was to transfer her half-share of the sale proceeds of the Signature Park property (less $180,000) to the ex-husband onlyaftershe received his one-third share in the Mulberry Property. (d) The ex-husband’s messages at 10.58am and 10.59am did not contest what the ex-wife had just said. He merely said there that the ex-wife should also transfer her “share” in the Signature Park property to his name. This was, however, quickly corrected by the ex-wife. She said there was no need for such a transfer because the property was already being sold. The ex-husband accepted this. This is again entirely consistent with the ex-wife’s Pleaded Oral Agreement (as explained in the last sentence of the preceding sub-paragraph). The said agreement does not involve the ex-wife transferring her half-share in the Signature Park property directly to the ex-husband. 59 Notwithstanding the fact that the 4 July 2015 WhatsApp Exchange considerably undermines the ex-husband’s case (in the manner just explained), the ex-husband failed to properly address it in his AEIC and at trial. Instead, during the ex-husband’s cross-examination of the ex-wife, he made the belated allegation that the message purportedly sent by him at 10.50am on 4 July 2015 had been “tampered with” and ought to be “expunged”. When he was cross-examined, the ex-husband maintained his allegation. I highlight, however, that the documents evidencing the 4 July 2015 WhatsApp Exchange were in fact disclosed by the ex-husbandhimselfin his List of Documents, which was supported by his verifying affidavit. This was pointed out to the ex-husband when he was cross-examined by the plaintiffs’ counsel. At the time, I asked the ex-husband whether it was his position that he had submitted documents that had been tampered with. Despite maintaining his tampering allegation just moments before, the ex-husband then prevaricated and replied that he was actually saying that he could not recall exactly what he wrote but he did not believe he wrote what was stated in the message in question. When the time came for submissions, however, the ex-husband revived his dispute as to the authenticity of the 4 July 2015 WhatsApp Exchange. 60 In my view, the ex-husband is not entitled to raise this allegation given that he was the one who had disclosed the messages in question. To this end, I also point out that the 4 July 2015 WhatsApp Exchange was included in the parties’ Agreed Bundle of Documents which was expressed to have been “Agreed as to authenticity, and not as to contents”. Further, nowhere in the ex-husband’s Notice of Objections (or his AEIC) did he dispute the authenticity of the messages in the 4 July 2015 WhatsApp Exchange. To my mind, the ex-husband’s belated allegation is devoid of merit and speaks to his own cavalier attitude in making unsubstantiated claims. This effectively leaves the 4 July 2015 WhatsApp Exchange wholly unexplained by him. 61 On 30 May 2016, the ex-husband also sent the ex-wife the following WhatsApp message: [Ex-wife’s name] , at that time when  you demand for $180,000 from me, you have agreed to let me stay in our home for next Ten years. … 62 There was no reply from the ex-wife. This message was sent while the proceedings for the Divorce Suit were ongoing (ie,after the Divorce Suit was filed on 4 November 2015, but before the DJ’s Order of 3 November 2017 was made). This was also after the ex-wife had filed the Previous Suit (in April 2016). Little else is known about the context surrounding this message. Although this message was not contemporaneous with the Oral Agreement, it nonetheless came from the ex-husbandhimselfwhen the parties werealreadyin dispute over the terms of the Oral Agreement.I thus find that the said message favours the plaintiffs in two ways. 63 First, this message supports the plaintiffs’ case that the Oral Agreement was for the ex-husband to transfer his one-third share in the Mulberry Property to the ex-wife. As the plaintiff’s counsel rightly pointed out, the fact that the ex-husband had to rely on the ex-wife’s purported agreement to let him reside in the Mulberry Property suggests that he had indeed agreed to give up his share (and thus his right to reside) in the same. The reference in the message to the ex-wife allowing the ex-husband to reside in the Mulberry Property is also broadly consistent with the ex-wife’s account that she had at least considered doing so (as set out in the last sentence of [14] above). Second, the message refers to the sum of $180,000 that the ex-wife had apparently “demanded” from the ex-husband. This “demand” does not feature in the ex-husband’s version of the events on 22 June 2015 at all and is instead more consistent with the $180,000 Deduction in the ex-wife’s Pleaded Oral Agreement. 64 At trial, the ex-husband’s explanation was that there was in fact only a “discussion” for him to continue residing at the Mulberry Property and no agreement was reached. Even so, the first point I have made still stands. When the plaintiffs’ counsel put it to the ex-husband that nowhere in this 30 May 2016 message did he say that the $180,000 Deduction was denied, the ex-husband’s reply was that he “[could] not remember” and that he believed the message was tampered with. This was again an unsubstantiated allegation raised for the first time at trial, and which I refuse to entertain. It was not raised when parties filed their Lists of Documents, Notices of Objections, or the Agreed Bundle of Documents (which was expressed to have been “Agreed as to authenticity, and not as to contents”). I thus regard the ex-husband’s evidence as inadequate in addressing the 30 May 2016 message. 65 The plaintiffs further rely on the Statutory Declaration made by the Mother to prove their case. In her Statutory Declaration the Mother confirmed that in the week of 22 June 2015 the ex-wife told her about the material terms of the ex-wife’s Pleaded Oral Agreement except for the $180,000 Deduction. I note, however, that the Mother’s Statutory Declaration was made only on 8 August 2016. This was not contemporaneous at all with the Oral Agreement on 22 June 2015. It was madeafterthe ex-husband had refused to transfer his one-third share in the Mulberry Property to the ex-wife on 5 October 2015 and alsoafterthe Divorce Suit and the Previous Suit had already been filed. At the time, the ex-wife’s and ex-husband’s dispute as to the Agreed Terms Issue had already crystallised in both a legal and non-legal form. In the circumstances, even though the Mother’s Statutory Declaration is admissible, I am unable to place much weight on it. 66 Moving on, I find that the circumstances surrounding the Oral Agreement also reinforce the plaintiffs’ case rather than that of the ex-husband. I accept, as the plaintiffs claim, that at the time of the Oral Agreement the ex-husband was a regular gambler who faced mounting debts and was under pressure to obtain funds to repay his debts. The ex-wife exhibited a document showing that on 21 May 2010, she obtained an exclusion order against the ex-husband to prevent him from gambling at Singapore casinos. She also adduced multiple loan documents showing that between 2014 and 2015 the ex-husband obtained numerous loans from various moneylenders, sometimes at extremely high interest rates. Some of these loans were repaid but were then followed by further loans. Multiple rejected loan applications by the ex-husband were also put into evidence. 67 The ex-wife also produced a note given to her by the ex-husband (“Debt Note”) shortly prior to the time of the Oral Agreement in June 2015. In the Debt Note, the ex-husband recorded his debts owed to four different creditors at the time. These debts totalled $63,580 and were stated to be due on either 22 or 24 July 2015. This supported the ex-wife’s claim that the ex-husband was desperately looking for funds in the lead up to the Oral Agreement because he had debts that were going to be due soon. In fact, the ex-husband squarely admitted to this claim under cross-examination. 68 Further, it appears to me that the ex-husband was indeed the party pushing for the sale of the Signature Park property to be completed as soon as possible. On 5 July 2015, the ex-husband sent the following WhatsApp messages to the ex-wife: [Ex-husband], 2:46:43 PM: Do u agree to sell above $1.3M? Ply reply [Ex-husband], 3:32:54 PM: Do u agree to sell above $1.3M? Ply reply 69 The ex-wife did not even bother to reply to the above messages. Her explanation, which I consider to be reasonable, was that she no longer had any real interest in the sale price of the Signature Park property. This was because ultimately, the ex-wife’s share of the proceeds was capped at $180,000 assuming that the ex-wife’s Pleaded Oral Agreement was duly performed. Tangentially, the two messages above also seem inconsistent with the ex-husband’s allegation that the ex-wife had agreed in advance to a minimum sale price of $1.3m (see [20] above).  Although he did not specify when the ex-wife’s agreement was procured, this was presumably around the time of the Oral Agreement on 22 June 2015. If the said agreement was procured any time prior to 5 July 2015, there would be no need for the ex-husband to seek the ex-wife’s agreement in these two messages again. At trial, the ex-husband’s account appeared to be that it was in these very two messages that he was seeking the ex-wife’s agreement to the minimum sale price of $1.3m. I have difficulty understanding how this assists him given that the ex-wife never replied to convey her agreement. His allegation was therefore left hanging in the air. 70 Subsequently, when the option to purchase the Signature Park property was granted, the option fee (of 1% of the purchase price) was paid solely to the ex-husband around 10 July 2020. The remaining deposit (being 4% of the purchase price) was also paid directly to the ex-husband on 23 July 2020at hisspecific request, rather than to the conveyancing solicitor as stakeholder. Based on the ex-husband’s email correspondence with the conveyancing solicitor (in which the ex-wife was copied), as well as his WhatsApp messages with the ex-wife, it was clear that the ex-husband was the party driving the sale. This cohered with the fact that there were receipts issued by the four creditors mentioned in the Debt Note, showing that the ex-husband made repayments to them on 22, 24, and 31 July 2015. This was very shortly after the ex-husband either received the option fee or the remaining deposit for the sale of the Signature Park property. All this further substantiated the plaintiffs’ claim (at [66] above). 71 There was, however, little attempt made by the ex-husband (in his AEIC or at trial) to explain the various pieces of evidence mentioned at [66]–[70] above beyond what I have already described in those paragraphs (ie,by showing that he was living within his financial means, or by accounting for his need or use of the money he borrowed). His responses,eg,denying that he was a compulsive gambler, were generally unsupported by the evidence or otherwise unsatisfactory. 72 I am therefore inclined to believe the plaintiffs that the ex-husband was indeed under pressure from his creditors at the time he entered into the Oral Agreement. Although not a particularly crucial point, it also seems to me that the ex-husband’s debts were likely incurred as a result of his gambling activities. In such circumstances, there is an obvious reason as to why the ex-husband would give up what he claims to be his more valuable share in the Mulberry Property in exchange for the ex-wife’s share in the Signature Park property (see the ex-husband’s argument at [52(a)] above). Simply put, the ex-husband was in urgent need of funds to stave off his creditors and he needed to procure the ex-wife’s agreement to liquidate the Signature Park property. At trial, the ex-husband claimed that his debts (ie,those recorded in the Debt Note) did not necessitate his sale of the Signature Park property and had “nothing to do” with the terms of the Oral Agreement. According to him, there was “nothing wrong for [him]…to pay off the creditors once [he had] the money”. Contrary to his bare claims, however, I consider the existence of the ex-husband’s debts (especially those recorded in the Debt Note which fell due in July 2015) to be relevant in explaining his likely reason for entering into the ex-wife’s Pleaded Oral Agreement on 22 June 2015. 73 For completeness, some of the Third Parties also stated in their Statutory Declarations that they had personal knowledge of the ex-husband’s gambling habits and debts. I am, however, unable to give their evidence much weight for generally the same reasons stated at [65] above in relation to the late Mother’s Statutory Declaration (ie,the Statutory Declarations were made at a time when the dispute between the ex-wife and ex-husband had already arisen). More importantly, the basis for these Third Parties’ knowledge of the ex-husband’s gambling activities was not stated anywhere. 74 The plaintiffs also seek to rely on the Handwritten Note to prove the ex-wife’s Pleaded Oral Agreement. In my view, however, this note does not carry much independent weight. This is because the note was drafted by the ex-wife on 5 October 2015, which was not contemporaneous with the Oral Agreement that had been made some months before. The note was never signed by the ex-husband. It was in fact drafted almost immediatelyafterthe ex-husband stated to the ex-wife that he would not transfer his one-third share in the Mulberry Property to her. At that point, the dispute as to the terms of the Oral Agreement had already arisen. In such circumstances, a note unilaterally drafted by one party for the purpose of forcibly shutting down the dispute would not, by itself, be of much probative value as to the terms of the Oral Agreement. 75 That being said, taking into account theotherevidence discussed (at [54]–[73]) above, I accept that the Handwritten Note and the scuffle which broke out on 5 October 2015 are at leastconsistentwith the plaintiff’s case. Indeed, if the parties did enter into the ex-wife’s Pleaded Oral Agreement, the ex-wife’s outrage on learning that the ex-husband was reneging on his obligations would be perfectly explicable. The ex-husband points out that the Handwritten Note did not include the term relating to the $180,000 Deduction in respect of the Signature Park sale proceeds. However, I accept the ex-wife’s explanation that in the heat of the moment it slipped her mind to include the said term because her main concern was with ensuring that the ex-husband honoured his agreement to transfer his one-third share in the family home (ie,the Mulberry Property) to her. 76 As to the ex-husband’s argument at [52(b)] above, the ex-wife explained at trial that she simply did not think to put the ex-wife’s Pleaded Oral Agreement in writing. This was an arrangement between her and the ex-husband as spouses (at the time), not as commercial parties. There was no mention then of any divorce proceedings and she trusted him and did not expect him to go back on his word. She also explained that when she and the ex-husband signed the completion documents for the Signature Park property on 27 August 2015, she did mention to the conveyancing solicitor the transfer of the ex-husband’s share in the Mulberry Property to her. However, there was no discussion as to whether the ex-wife’s Pleaded Oral Agreement had to be put in writing. All that the conveyancing solicitor said was that the transfer could be carried out after the sale of the Signature Park property was complete and the parties left it at that. 77 I generally accept the ex-wife’s explanation above that she did not think it necessary to put the ex-wife’s Pleaded Oral Agreement in writing because she did not think that the ex-husband would renege on the said agreement. This was entirely plausible in the context of a private and informal conversation between husband and wife (even if their relationship was strained). The two had been married and lived together for about 34 years and had raised the Children to adulthood. The ex-wife’s shock at realising that the ex-husband had no intention of fulfilling his end of the bargain, as exemplified by her desperate attempt to get him to sign the Handwritten Note on 5 October 2015, is consistent with the reaction of someone who had not expected to be betrayed. I do not believe the ex-husband’s characterisation of the incident as a violent attempt by the ex-wife, out of nowhere, to get him to hand over his one-third share in the Mulberry Property. 78 On the whole, I find the plaintiffs’ account (ie,that the ex-husband was mired in debt and that the ex-wife had thus agreed to enter into the ex-wife’s Pleaded Oral Agreement in order to protect the family home from his creditors) to be credible and consistent with the available evidence. The ex-husband’s account that the ex-wife and he had sold the Signature Park property purely as a result of their expectations of the movements in the property market (as set out at [19]–[20] above) does not sit well with the evidence discussed at [53]–[77] above. The said evidence includes his own admission that he was pressed to obtain sufficient funds to repay the debts recorded in the Debt Note (see [67] above) and the correspondence between the parties. I therefore hold that the terms of the Oral Agreement are as per the ex-wife’s Pleaded Oral Agreement.",
        "Enforceability Issue": "79 Although I have found that the ex-wife and ex-husband entered into the ex-wife’s Pleaded Oral Agreement on 22 June 2015, there is an additional question of whether such an oral agreement is enforceable. It is to this question that I now turn. Formality Sub-Issue 80 The ex-wife’s Pleaded Oral Agreement concerns the disposition of the ex-husband’s and ex-wife’s respective interests in immovable property (ie,the Signature Park property and the Mulberry Property). That being the case, s 6 of the CLA restrains the ex-wife from bringing this Suit against the ex-husband to enforce the said agreement unless certain formality requirements are satisfied. The statutory provision provides: Contracts which must be evidenced in writing 6.No action shall be brought against— … (d)any person upon any contract for thesale or otherdisposition of immovable property, or any interest in such property; … unlessthe promise or agreement upon which such action is brought, orsome memorandum or note thereof,is in writing and signed by the partyto be charged therewith or some other person lawfully authorised by him. [emphasis in original in bold italics; emphasis added in bold] 81 InJoseph Mathew and another v Singh Chiranjeev and another[2010] 1 SLR 338 (“Joseph Mathew”), the Court of Appeal helpfully summarised the law in relation to s 6(d) of the CLA (at [24]–[26] and [28]–[29]): 24Section 6(d)is, of course, an important and well-known one,having its genesis in s 4 of the UK Statute of Frauds 1677(Cap 3) (“the 1677 UK Act”)which was later re-enacted (in the UK) in substantially the same form in s 40 of the UK Law of Property Act 1925(Cap 20) (“the 1925 UK Act”) (and for the legal position in Singapore prior to the introduction of s 6(d) (during which time, in essence, s 4 of the 1677 UK Act applied), seeCheshire, Fifoot and Furmston’s Law of Contract(2nd Singapore and Malaysian Ed, Butterworths Asia, 1998 at p 356)). It should be noted thatthe current legal regime in the UK context is (with effect from 27 September 1989) no longer the same and (unlike the Singapore position) is governed by the UK Law of Property (Miscellaneous Provisions) Act 1989(Cap 34) (“the 1989 UK Act”), in which,inter alia,contracts for the sale of land or other disposition of an interest in land mustthemselvesbe in writing(see s 2 of the 1989 UK Act). 25  As can be seen, s 6(d) (reproduced above at [22]) comprises a number of requirements. 26 In so far as thespecific contentsof asufficientnote or memorandum within the meaning of s 6(d) are concerned, the following observations by Prof Furmston inCheshire, Fifoot and Furmston’s Law of Contract(Oxford University Press, 15th Ed, 2007) (“Cheshire, Fifoot and Furmston”) at p 271 are apposite: The agreement itself need not be in writing. A ‘note or memorandum’ of it is sufficient, provided that it containsall the material termsof the contract. Such facts as the names or adequate identification of theparties, the description of thesubject matter, the nature of theconsideration, comprise what may be called the minimum requirements. [emphasis added] … 28 Next, and more specifically, there is the important requirement in s 6(d) thatthe note or memorandum be “in writing”. 29 Yet another requirement in s 6(d) is thatthe note or memorandum must be “signed”.… [emphasis in italics in original; emphasis in bold added] 82 As stated above, under s 6(d) of the CLA, the agreementitselfneed not be in signed writing. If an agreement disposing of an interest in land is purely oral, it is sufficient that the said agreement isevidencedby a signed memorandum or note in writing. The relevant requirements are as follows: (a) First, there must be a ‘sufficient’ memorandum or note containing all the material terms of the agreement relating to theidentification of the parties,the description of thesubject-matter,andthe nature of theconsideration. (b) Second, the memorandum or note must be “in writing”. (c) Third, the memorandum or note must be “signed”. 83 The ex-husband’s Formality Defence is that the above requirements have not been met. On the other hand, the plaintiffs submit that the said requirements are satisfied by the “WhatsApp messages” exchanged between the ex-wife and ex-husband. The plaintiffs did not specify which messages they were referring to or how the said messages identified the material terms of the ex-wife’s Pleaded Oral Agreement. Nonetheless, I consider the plaintiffs’ submissions to be mainly relying on the 4 July 2015 WhatsApp Exchange. The ex-wife and ex-husband did exchange several other WhatsApp messages on 5 July 2015, 16 July 2015 and 30 May 2016. However, I do not think that any of these other messages bring the plaintiffs any further than the 4 July 2015 WhatsApp Exchange already does in identifying the material terms of the ex-wife’s Pleaded Oral Agreement (see [84]–[88] below). 84 Starting with the first formality requirement, my view is that thepartiesto the ex-wife’s Pleaded Oral Agreement have been sufficiently identified. This is because in the 4 July 2015 WhatsApp Exchange, the ex-wife and ex-husband are each identified by their own names. Further, the said exchange must identify the material terms relating to thepropertiesin questionand thenature of the consideration,as per the ex-wife’s Pleaded Oral Agreement at [5(a)-(c)] above. 85 Thepropertiesin question are the Signature Park property and the Mulberry Property. It is true that the 4 July 2015 WhatsApp Exchange does not specifically state the address of either property. Nonetheless, as observed inHalsbury’s Laws of Singaporevols 14 and 14(2) at para 170.1212,“[w]here the contract contains a description which renders the propertyascertainable, oral evidence has been admitted to complete the identification” [emphasis added]. In this vein, the two properties are sufficiently identified based on my reading of the 4 July WhatsApp Exchange as set out at [57]–[58] above. In particular, as stated earlier in [57(b)], the properties being discussed by the ex-husband and ex-wife in the 4 July 2015 WhatsApp Exchange could only have been the Signature Park property and the Mulberry Property given that these were the only properties owned by the couple. Further, as mentioned at [57(d)] above, seeing that the Signature Park property was to be sold to third party buyers, the ex-wife’s message at 10.56am must have been referring to the transfer of the ex-husband’s one-third share in theMulberry Propertyto her. 86 As to thenature of the considerationto be provided by each party, I make the following findings: (a) Under the first material term of the ex-wife’s Pleaded Oral Agreement, she was to provide herconsent to the saleof theSignature Park property. In my view, this term is sufficiently identified on a reading of the entire 4 July 2015 WhatsApp Exchange. During the said exchange, there is a back-and-forth discussion between the ex-husband and ex-wife as to how the proceeds of the sale of the property were to be distributed. It is clear from the discussion that the ex-wife did consent to the sale of the Signature Park property. (b) The second material term of the ex-wife’s Pleaded Oral Agreement was that the ex-husband would transfer his one-third share in theMulberry Propertyto theex-wife. In my view, the ex-wife’s message at 10.56am sufficiently identifies this term. This is based on the point set out at [57(d)] (and repeated at [85]) above. (c) The third material term was that theex-wifewouldtransfer her half-share of the sale proceedsof the Signature Park property to theex-husband,less $180,000. I find that this term is sufficiently identified based on my reading of the 4 July 2015 Exchange as set out at [58(b)-(d)] above. In particular, the ex-husband had indicated (at 10.50am) that in addition to his own half-share of the sale proceeds of the Signature Park property, he should also receive the ex-wife’s half-share (less $180,000)immediatelyupon the completion of the sale. At 10.58am, the ex-wife replied “No[,] only upon the successful transfer [of the ex-husband’s one-third share in the Mulberry Property] to my name”. The ex-wife clearly meant that the ex-husband was to receive her half-share of the sale proceeds of the Signature Park property (less $180,000) onlyafterthe “successful transfer” of the ex-husband’s one-third share in the Mulberry Property to her. When the ex-husband said (at 10.58am) that the ex-wife should also transfer her “share” in the Signature Park property to his name, the ex-wife immediately corrected him (at 10.59am) that there was no need for such a transfer because the property was already being sold. The ex-husband then accepted the ex-wife’s position in his message at 10.59am, which stated “Okay”. Read as a whole, I am satisfied that these messages do adequately reflect the third material term. 87 I therefore conclude that the first formality requirement of s 6(d) of the CLA is fulfilled. The 4 July 2015 WhatsApp is certainly not a formal written agreement drafted by lawyers, as would be available in an ideal scenario. Nonetheless, bearing in mind that this was an informal conversation taking place between husband and wife, I am satisfied that the exchange does capture all the material terms of the ex-wife’s Pleaded Oral Agreement for the purposes of constituting a ‘sufficient’ memorandum within s 6(d) of the CLA. 88 As for the “writing” requirement of s 6(d) of the CLA, the Court of Appeal inJoseph Mathew([81]supra)(at [38], citingSM Integrated TranswarePte Ltd v Schenker Singapore (Pte) Ltd[2005] 2 SLR 651 (“SM Integrated”)) has recognised electronic records (including emails) as being “writing” for the purpose of s 6(d) of the CLA. The 4 July 2015 WhatsApp Exchange therefore fulfils this requirement. The Court of Appeal inJoseph Mathewalso went on to explain (at [40]) that the “signature” requirement is a flexible one provided that it is clear that the messages emanate from the person “signing” them. In this vein, inSM Integrated(at [92]),where the top of an email stated that it was from the sender’s name and email address, the High Court held that there was a “signature” from the sender for the purposes of s 6(d) of the CLA. Here, the 4 July 2015 WhatsApp Exchange comprised messages sent by the ex-wife and ex-husband to each other in her/his own name and from her/his own contact number by which she/he was and no doubt intended to be identified as his/her respective self. I hence find that the “signature” requirement is also made out (see alsoAng Bee Yian v Ang Siew Fah[2019] SGHC 178 at [113]–[114]). 89 There being compliance with all the formality requirements of s 6(d) of the CLA, the ex-wife is entitled to bring this Suit against the ex-husband in order to enforce the ex-wife’s Pleaded Oral Agreement. This should be sufficient to deal with the ex-wife’s action, save for my decision on the reliefs to be granted (see [118] below). However, in the event that I am wrong (ie,in that s 6(d) of the CLA has not been complied with), I go on to analyse whether the ex-wife’s Pleaded Oral Agreement is nonetheless enforceable on the ground of part-performance. Part Performance Sub-Issue 90 In the event that the ex-wife’s Pleaded Oral Agreement does not comply with s 6(d) of the CLA, the plaintiffs submit that the ex-wife’s Pleaded Oral Agreement has nonetheless been performed in part by the ex-wife and is thus enforceable on that ground. 91 It is well-settled that the doctrine of part performance is a part of Singapore law and represents an exception to the formality requirements of s 6(d) of the CLA. As explained inJoseph Mathew(at [48]): 48Part performance is, of course, an exception to the requirementsunder s 6(d). It is equitable in origin and was intended to prevent,inter alia,this very statutory provision fromitselfbeing utilised as an engine of fraud(andsee,eg,Steadman([38]supra)at 558as well as the oft cited observations of Farwell J in the English High Court decision ofBroughton vSnook[1938] 1 Ch 505 at 513). Indeed, Lord Hoffmann, in the House of Lords decision ofActionstrength Ltd (t/a Vital Resources) v InternationalGlass Engineering IN.GL.EN SpA[2003] 2 AC 541 (“Actionstrength”), observed (at [22]) that part performance was introduced “[v]ery soon after” the 1677 UK Act. [emphasis in original in bold italics; emphasis added in bold] 92 It may be recalled from the remarks inJoseph Mathew([81]supra)(at [24]) that s 6(d) of the CLA has its genesis in s 4 of the UK Statute of Frauds 1677 (c 3) (“the 1677 UK Act”) which was later re-enacted (in the UK) in substantially the same form in s 40 of the UK Law of Property Act 1925 (c 20). Section 4 of the 1677 UK Act was enacted to cure a particular mischief, as explained by Lord Simon in the important English decision ofSteadman v Steadman[1976] AC 536(“Steadman”)(at 558): … The “mischief” for which [s 4 of the 1677 UK Act] was providing a remedy was, therefore, that some transactions were being conducted orally in such a way that important interests were liable to be adversely affected by a mode of operation that invited forensic mendacity [ie,deceit]. The remedy was to require some greater [written] formality in the record of such transaction than mere word of mouth if it was to be enforced … It soon became clear, however, that in seeking to cure this mischief the statute was itself liable to be exploited for unscrupulous purposes. InSteadman(at 558), Lord Simon continued: …[A]lmost from the moment of passing of the Statute of Frauds, it was appreciated that it was being used for a variant of unconscionable dealing, which the statute itself was designed to remedy. A party to an oral contract for the disposition of an interest in land could, despite performance of the reciprocal terms by the other party, by virtue of the statute disclaim liability for his own performance on the ground that the contract had not been in writing. Common law was helpless. But Equity, with its purpose of vindicating good faith and with its remedies of injunction and specific performance, could deal with the situation. 93 The solution devised by equity was the doctrine of part performance which, within limited bounds, sought to “assuage the rigour[s]” of the formality requirements imposed by statute (seeMidlink Development Pte Ltd v The Stansfield Group Pte Ltd[2004] 4 SLR(R) 258 (“Midlink Development”) at [66]). Hence, inJoseph Mathew(at [52]), the Court of Appeal remarked: 52… [Historically,][p]art performance was developed as a judicial exception to s 4 of the 1677 UK Act(see also I C F Spry, The Principles of Equitable Remedies: Specific Performance, Injunctions, Rectification and Equitable Damages (Sweet & Maxwell, 7th Ed, 2007) (“Spry”) at p 254 as well as Pettit ([29] supra) at 441 (where it was observed that“[a]lthough the Court of Chancery was bound by statute, it nevertheless regarded itself as having the power to intervene where the strict application of the statute would actually operate to promote fraud rather than to prevent it”);but cf Crown ([49] supra) at 77−78). [emphasis in original omitted; emphasis in bold added] This is the historical background leading to the present state of Singapore law, as stated at [91] above, being that the doctrine of part performance is a recognised exception to the local equivalent of s 4 of the 1677 UK Act (ie,s 6(d) of the CLA). 94 Although it is not in doubt that the doctrine of part performance is recognised in Singapore, there remains uncertainty as to how it is to be applied. InHu Lee Impex Pte Ltd v Lim Aik Seng (trading as Tong Seng Vegetable Trading)[2013] 4 SLR 176 (“Hu Lee Impex”), Andrew Ang J (as he was then) provided a useful exposition of this uncertainty (at [20]–[21] and [23]–[24]): 20  …[T]here remains some difference of opinion as to how the doctrine of part performance ought to apply.The Law of Contract in Singapore(Andrew Phang Boon Leong ed) (Academy Publishing, 2012) notes at para 08.145: “Singapore authority on the application of the doctrine [of part performance] is scanty, and reference to its actual operation has generally been brief.” The contributors go on to note at paras 08.151–08.152 as follows: …[Sir Edward] Fry set out two slightly different propositionsas to when a promisee’s acts might amount to sufficient ‘part performance’ so as to justify compulsion of a promisor to specifically perform what would otherwise be an unenforceable contract. Fry first set out the proposition thatthepromisee’s acts of part performance had to be referable, ‘to acontract such as that alleged,but to no other title’… However, Fry then made a slightly different proposition, that: The true principle, however, of the operation of acts of part performance seemsonly to require thatthe acts in question be such as must be referred tosomecontract, and may be referred to the allegedone; that they prove the existence ofsomecontract, and areconsistent withthe contract alleged. … [contributors’ emphasis in The Law of Contract in Singapore; footnotes in original omitted] 21 In this regard,there are two diametrically opposed English cases, namely,Elizabeth Maddison v JohnAlderson(1883) 8 App Cas 467 (“Maddison”) andSteadman v Steadman[1976] AC 536 (“Steadman”).The formercase embodies Sir Edward Fry’s first and stricter approach, while the latter embodies his second and more liberal approach. … 23 Thus,on a classical interpretation of the doctrine of part performance, the acts that are relied uponmust unequivocally point towards the existence of a contract fitting the description of the oral contract alleged to exist.However, this requirement was not strictly applied in the later House of Lords case ofSteadman([21]supra). … 24 On the views expressedinSteadman, the acts relied on to establish part performance no longer needto point unequivocally towards the existence of a particular oral contract. The doctrine of part performance is satisfied if, on an analysis of all the circumstances (but leaving aside evidence of the purported oral contract), the court is satisfied that more probably than not the acts relied upon were done in reliance on the oral contract. [emphasis in bold added] 95 As set out above,there are two differing standards which may be used to determine whether a promisee’s acts amount to sufficient part performance so as to justify ‘enforcing’ what would otherwise be an unenforceable contract. I refer here to the contract being ‘enforceable’ only in a loose sense since, as explained later below at [105], the doctrine of part-performance does not in fact seek to enforce the contract itself. Returning to my main point, the two aforementioned standards were espoused in the English House of Lords decisions ofElizabeth Maddison v JohnAlderson(1883) 8 App Cas 467 (“Maddison”) andSteadman. They are as follows: (a) The stricter standard inMaddisonrequires that the acts (which are relied upon to constitute part performance) are unequivocally and in their own nature referable to the agreement being alleged (Hu Lee Impexat [23]). (b) The more relaxed standard inSteadmanonly requires that on an analysis of all the circumstances as a whole, butleaving aside evidence of the purported oral contract itself,the court is satisfied that it is more probable than not that the acts relied upon were done in reliance on the oral contract (Hu Lee Impexat [24]). 96 In the present case, the standard to be applied is a live issue between the parties. Before examining their submissions, I first note that in Singapore there has yet to be any Court of Appeal authority deciding which one of the two standards inMaddisonandSteadman([92]supra) is applicable under the doctrine of part performance. The issue was not decided by the Court of Appeal inJoseph Mathew([81]supra),although as observed by Ang J inHu Lee Impex(at [26])one interpretation of the decision is that theMaddisonstandard was applied. InJoseph Mathew(at [64]), the Court of Appeal stated: 64 Although it used to be the case that the payment of money could never amount to part performance, this is no longer the case. However, the converse does not necessarily follow inasmuch asthe payment of moneypersewill notautomaticallyresult in a finding of part performanceas such payment might be equivocal innature.Much will depend on the surrounding circumstances(see,eg, Spry ([52]supra) at p 274).In the[present] circumstances, we agree with the reasoning of the Judgeas set out in the preceding paragraph (the doctrine of part performance having beensatisfied in this case by the payment of moneywhich was effected by way of a chequeand having regard to the circumstances of the case itself).In anyevent, this does not – having regard to the reasons given above − impact on the decision we arrived at inasmuch as it constitutes anadditionalreasonfor our decision.Indeed, the application of part performance also constituted (as is evident from the preceding paragraph) an extra string to the legal bow in the court below. It may be argued that in line withMaddison,the Court of Appeal was impliedly recognising that the acts relied upon must beunequivocalin referring to the alleged oral contract. Thus, the Court of Appeal reasoned that any payment of money which is equivocal in nature would not suffice. However, as the plaintiffs’ counsel points out, the Court of Appeal went on to say that “[m]uch would depend on thesurroundingcircumstances”. This would appear to be more consistent with theSteadmanstandard given that the standard inMaddisonrequires the acts in question to be examinedin isolationwithout reference to any other evidence or information. In my view, there is plainly room for both interpretations. In any event, as already stated, it is clear that the Court of Appeal did not decide the issue or enter into a substantive discussion of the standard to be applied. 97 There are two decisions pre-datingHu Lee Impexwhich also dealt with the doctrine of part performance – namely, the High Court decision ofMidlink Development([93]supra) and the Straits Settlements Court of Appeal case ofKhoo Keat Lock v Haji Yusopand others[1929] SSLR 210. However, as noted by Ang J inHu Lee Impex(at [25] and [27]), the standard to be applied was not a live issue in either case. InHu Lee Impexitself(at [33]),Ang J was of the view that theMaddisonstandard was to be preferred to theSteadmanstandard. Since then, however, there has been little other authority on the point. InCheong Kok Leong v Cheong Woon Weng[2017] SGCA 47 (at [8]) the Court of Appeal found (inobiter) that there had been part performance of a certain contract by the respondent’s payment of $200,000 to the appellant but did not discuss which standard was applied. More recently, inLiberty Sky Investments Ltd v Goh Seng Heng and another[2019] SGHC 40(at [65]), Audrey Lim JC (as she then was) appeared, inobiter,to followHu Lee Impexin applying theMaddisonstandard. However, there was again no discussion of the controversy between which of the two standards should be applied. 98 Having set out above the state of the local authorities, the question before me is two-fold: (a) First, in determining whether the acts relied upon by a promisee amount to sufficient part performance (so as to justify the enforcement of the relevant agreement), which one of the two standards inMaddisonandSteadmanis applicable? (b) Second, is the applicable standard satisfied on the present facts? 99 The ex-husband submits that the stricterMaddison([95]supra) standard ought to apply and that it is not fulfilled on the present facts. There is therefore no part performance of the ex-wife’s Pleaded Oral Agreement so as to justify its enforcement. On the other hand, the plaintiffs make the following submissions: (a) In deciding which is the applicable standard, the court should take a ‘case-by-case’ approach depending on whether the court has the opportunity to hear from both sides to the dispute. Where such an opportunity is present, as in the present case, the more relaxedSteadmanstandard should apply. On the instant facts, theSteadmanstandard is clearly fulfilled. (b) Alternatively, if there is to be only one standard applicable to all situations, theSteadmanstandard is to be preferred and it is satisfied on the present facts. (c) Even if the stricter standard inMaddisonis applicable, it is also satisfied on the present facts. 100 In my view, theMaddisonstandard is the more appropriate standard. In coming to this view, I am cognisant of the legal reforms in England which have taken place following the decision inSteadman([92]supra)in 1974. As mentioned earlier,Steadmanarticulated a much more relaxed standard than the strict requirement of “unequivocal referability” in the 1883 decision ofMaddison.Relatively soon afterSteadmanwas decided, the UK Law Commission issued a report,Transfer of Land Formalities for Contracts for Sale etc. of Land(Law Com No 164, 1987) (Chairman: Mr Justice Beldam) (“UK Law Commission Report”). It contained a series of recommendations that eventually led to the abolition of the doctrine of part performance under English law. Section 40 of the UK Law of Property Act 1925 (c 20), which was the latest iteration of s 4 of the 1677 UK Act, was repealed. It was replaced by s 2 of the Law of Property (Miscellaneous Provisions) Act 1989 (c 34), which now requires contracts for the disposition of certain interests in landthemselvesto be in signed writing, and not merely evidenced by signed writing. A failure to comply with such formalities means that the contract in question isvoidand not merely unenforceable. As explained by Ang J inHu Lee Impex([94]supra)(at [29]), “[a]priori, if oral agreements pertaining to land are void, there is no contract for either party to partially perform”. The doctrine of part performance ceased to exist under English law. 101 Importantly, the UK Law Commission Report recommended the aforementioned legal reforms due to the perceived uncertainty in the law created by the more relaxed standard inSteadman. As stated inHu Lee Impex(at [30]): 30Section 2 of the Law of Property (Miscellaneous Provisions) Act 1989 was enacted following the UKLaw Commission Report which had recommended reform because of perceived defects in the law as it stood after the decision ofSteadman. Chief amongst these are: (a) the virtual impossibility of discovering with acceptable certainty, prior to proceedings, whether a contract will be found to be enforceable under statutory requirements (at para 1.8); and (b)Steadmanleaving the doctrine of part performance in an uncertain state.Taking the case at its highest, it appears that an oral contract for sale can be readily and unilaterally be [sic] made enforceable (for instance, inSteadmanby instructing solicitors to prepare and submit a draft conveyance), in effect rendering s 40 of the Law of Property Act 1925 a dead letter (at para 1.9; and para 3.23 of Appendix D). [emphasis added in bold] 102 InHu Lee Impex,Ang J found the recommendations of the UK Law Commission Report to be persuasive as to the undesirability of the uncertainty created by the standard inSteadman. He hence concluded in the following terms that theMaddisonstandard ought to be adopted: 31 I note thatThe Law of Contract in Singapore([20]supra), after an extensive analysis of English case law, states at para 08.164 that: Based on the above, the general view is that as a matter of English law [the learned contributors citeSteadmanv Steadmanin the footnotes at this point], there is a bare majority in favour of the more ‘relaxed ‘view as to the question of referability. However, in Singapore, nothing was said in the recent Court of Appeal decision ofJoseph Mathew v Singh Chiranjeevto supplement the holding of the Court of Appeal of the Straits Settlements inKhoo [Keat] Lock v Haji Yusop. The best one can do, then, is to assume that it may well be that a similar approach to that taken inSteadman v Steadmanwill be adopted by the Court of Appeal when the opportunity presents itself. [footnotes omitted] While it is open to the Singapore court to followSteadman([21]supra), the learned contributors did not take cognisance of the fact thatSteadmanno longer represents the position in English law.Indeed,Steadmanwas thevery impetus for, and was trenchantly criticised in, the UK Law Commission Report. To reiterate, the UK Law Commission Report eventually led to the passage of the Law of Property (Miscellaneous Provisions) Act 1989 which abolished the doctrine of part performance. 32 In my view,the recommendations of the UK Law Commission are highly persuasive.A wide interpretationof the doctrine of part performance would defeat theraison d’êtreof s 6(d) by undermining certainty andincreasing the potential for litigious disputes. Parties to a land transaction would find it difficult to know exactly when a binding contract has been concluded, and could find themselves unwittingly bound by the unilateral acts of their counterparties. An overly liberal interpretation ofSteadmanwould be akin to judicial abolition of s 6(d).Lord Morris of Borth-Y-Gest, in his dissenting speech inSteadmanalluded to much the same thing at 547E: “Courts of equity did not set out to make the terms of an Act of Parliament virtually nugatory.” 33 In my view,the approach inMaddison([21]supra) is to be preferred to that inSteadman.To reiterate, the acts relied upon as evidence of part performance of a purported oral contract must unequivocally and of themselves point to the contract as alleged. [emphasis added in bold] 103 I am in broad agreement with the above views of Ang J inHu Lee Impex(at [31]-[33]) and gratefully adopt the same.In particular, I also find the views of the UK Law Commission Report (set out at [101] above) to be persuasive and indicative of the problems that may be created by applying the overly relaxed interpretation of the doctrine of part performance inSteadman. There is a difficult balancing exercise to be performed between ensuring that the legislative purpose of s 6(d) of the CLA is not defeated and that the doctrine of part performance achieves its objective of thwarting unconscionable conduct in exploiting the statute. In this regard, the standard inMaddison([95]supra) appears to me to reach an acceptable balance between the two competing considerations. 104 InMaddison(at 475-476),Lord Selborne reconciled the doctrine of part performance with the statutory formality requirements under English law as follows: …In a suit founded on such part performance, the defendant is really \"charged\" upon the equities resulting from the acts done in execution of the contract, and not (within the meaning of the statute) upon the contract itself.If such equities were excluded, injustice of a kind which the statute cannot be thought to have had in contemplation would follow.… The matter has advanced beyond the stage of contract; and the equities which arise out of the stage which it has reached cannot be administered unless the contract is regarded. The choice is between undoing what has been done (which is not always possible, or, if possible, just) and completing what has been left undone. The line may not always be capable of being so clearly drawn as in the case which I have supposed; butit is not arbitrary or unreasonable to hold that when the statute says that no action is to be brought to charge any person upon a contract concerning land, it has in view the simple case in which he is charged upon the contract only, and not that in which there are equities resulting from res gestae subsequent to and arising out of the contract. So long as the connection of those res gestae with the alleged contract does not depend upon mere parol testimony, but is reasonably to be inferred from the res gestae themselves, justice seems to require some such limitation of the scope of the statute, which might otherwise interpose an obstacle even to the rectification of material errors, however clearly proved, in an executed conveyance, founded upon an unsigned agreement. [emphasis added in bold] 105 In other words, the doctrine of part performance (as rationalised by Lord Selborne) only seeks to enforce theequitiesgenerated by a party who has partially performed the alleged oral contract. The doctrine does not seek to undermine the formality requirements imposed by statute by enforcing the oral contractitself. This is notwithstanding that in a number of Singapore authorities the courts have often, as I have in other parts of this judgment, spoken loosely of the “contract” itself being enforced on the ground of part performance. Nonetheless, proceeding on the basis of Lord Selborne’s reconciliation between doctrine and statute, the requirement of “unequivocal referability” inMaddisonmay be thought of as specifying a particular threshold that a party’s “equities” must cross in order to justify the enforcement of the same despite the non-compliance of the contract with the requisite statutory formalities. 106 In this vein, I am assisted by a recent decision of the Australian High Court,Pipikos v Trayans[2019] 1 LRC 236 (“Pipikos”). InPipikos,the Australian High Court had to consider whether theMaddisonorSteadman([92]supra)standard was applicable as part of the doctrine of part performance under Australian law. In that case the relevant statutory provision was s 26(1) of the Law of Property Act 1935 (SA), the modern Australian equivalent of s 4 of the 1677 UK Act pursuant to which contracts for the sale of land must comply with certain formality requirements (seePipikosat [1]). InPipikos,the seven-judge coram of the Australian High Court unanimously held that theMaddisonstandard was to be preferred. In the judgment delivered by Kiefel CJ, Bell, Gageler and Keane JJ, the following instructive commentary on theMaddisonstandard was set out (at [47]–[49], [51]–[52], [54] and [65]): [47] It is true that some statements in the cases are far from clear as to the rationale of the doctrine of part performance.In some of the cases the basal principle is stated in terms of a concern to enforce the equities that have arisen by reason of the performance of obligations under the parol contract in order to prevent the equitable fraud that would occur if the defendant were allowed to resile from a partly completed transaction. ... [48]In other cases the principle has been stated in terms of a concern that evidence is necessary to satisfy a peculiarly high standard of proof to establish the fact of the making of a parol contract for the sale of land. ... [49]The view that the court enforces the equities arising from partialperformance, rather than the rights conferred by the parol contract itself, while attended with a degree of subtlety,has the powerful merit of being consistent with the Statute of Frauds.The view that part performance is concerned with matters of proof of the parol contract cannot stand with the Statute of Frauds, the evident purpose of which is to prevent the enforcement of a parol contract, however clear may be the proof of its making. … [51] It is significant in this respect that Lord Selborne expressly adopted the statement of Sir James Wigram V-C inDale v Hamiltonthat it is in general of the essence of an act of part performance— 'that the Court shall, by reason of the act itself,without knowing whether there was an agreement or not, find the parties unequivocally in a position different from that which, according to their legal rights, they would be in if there were no contract.' (Emphasis added.) [52] In a case where the parties are found, as a matter of fact, to be in that position,equity requires that the transaction be completed notwithstanding theobjection of the defendant that the contract itself cannot be enforced by reason of non-compliance with the Statute of Frauds.The requirement for unequivocal referability is essential to Lord Selborne's thesis that the court is not enforcing the contract—that would be contrary to the Statute of Frauds—but the equities generated by its partial performance. It is only where the acts of part performance are inherently and unequivocally referable to such a contract that it cannot be objected that, in truth, and contrary to the legislation, it is the parol contract that is being enforced. … [54]The equity to have the transaction completed arises where the acts that are proved are consistent onlywith partial performance of a transaction of the same nature as that which the plaintiff seeks to have completed by specific performance. … … [65]Lord Selborne's requirement that the acts of part performance relied upon be unequivocally referable to a contract of the kind asserted by the plaintiff is best understood as being necessary to give rise to this peculiarly strong equity. … [emphasis added in bold] 107 The above commentary is broadly consistent with my remarks made in [105] above. I am unable to identify any reason to disagree with the balance struck inMaddison([95]supra) – namely, that a plaintiff must show by satisfying the requirement of ‘unequivocal referability’ that he/she possesses a “peculiarlystrong equity” that deserves enforcement (seePipikosat [65]). This is also in line with my view that the doctrine of part performance ought not to be regarded as a free-wheeling creation of equity which can be moulded to deliver “palm-tree justice” in an unprincipled manner. Having regard to the balance referred to in [103] above, there must be a principled limitation on the scope of the doctrine. The requirement of “unequivocal referability” inMaddisonprovides this limitation. A similar point is made in the judgment of Kiefel CJ, Bell, Gageler and Keane JJ inPipikos(at [72]), which I gratefully reproduce here: [72]The importance of the reconciliation achieved by Lord Selborne should not be discounted.It should not be thought,as the submissions advanced on behalf of the appellant appear to assume,that part performance is, like equitable estoppel,the original and unconstrained creation of the courts of equity, the elements of which can be reformulated at large to 'do justice against a defaulting defendant'.In particular, the argument advanced on the appellant's behalf fails to appreciate thatLord Selborne's articulation of the law of part performance was driven by the conscious need to reconcile the decisions of the courts of equity with the clear words of s 4 of the Statute of Frauds. [emphasis added in bold] 108 I further observe that inPipikos,the learned Judges also signalled the hesitation of the Australian courts in following a standard (ie,theSteadmanstandard)which was the impetus for legal reforms abolishing the doctrine of part performance under English law altogether. At [75]–[76], the learned Judges stated: [75] In this regard, it may be noted that thedecision inSteadmanwas followed by the legislative abolition in the United Kingdom of the doctrine of part performanceby the Law of Property (Miscellaneous Provisions) Act 1989 (UK), which provided thats 40of the Law of Property Act 1925 (UK) shall cease to have effect and which, by s 2(1), provided: 'A contract for the sale or other disposition of an interest in land can only be made in writing and only by incorporating the terms which the parties have expressly agreed in one document or, where contracts are exchanged, in each.' [76] This legislative response toSteadmanwas recommended by the Law Commission of England and Wales.The decision inSteadmancontributed to the conclusion of the Law Commission that the doctrine of part performance was so confused that its abrogation by the legislature was desirable. The Law Commission considered that the most common example of injustice arising from undocumented dealings is the case of a plaintiff who incurs expenditure in effecting improvements to land to the knowledge of the owner and in the expectation generated by the owner of a transfer of the land; and that that injustice would be remedied by equitable estoppel. But as noted above, the 'coverage' provided by equitable estoppel is not the same as that provided by part performance.And the law of part performance, as explained by Lord Selborne and in decisions of this Court, does not create the confusion that the Law Commission perceived inSteadman. [emphasis in bold added] It suffices to say that the above views are similar to those expressed by Ang J inHu Lee Impex([94]supra)and myself in this judgment (see [100]–[103] above). 109 The plaintiffs nonetheless advance a number of arguments in support of the standard inSteadman. These are as follows: (a) First, it is arguable (based on the point made by the plaintiffs’ counsel set out [96] above) that the Court of Appeal inJoseph v Mathew([81]supra)was applying theSteadmanstandard. (b) Second, the requirement inMaddisonthat the act in question must be unequivocally referable to the alleged oral contract “relating to an interest in land” fails to appreciate the realities of commercial dealings in which agreements often contain multiple terms not all of which will relate to land. (c) Third, the requirement of “unequivocal referability” inMaddisonis inconsistent with the standard of proof in civil cases which only requires matters to be proven on a balance of probabilities. (d) Fourth, the strict standard inMaddisonwas formulated in the 18th century when evidence regarding oral agreements was limited. In modern times, however, with the advancement of technology, there are “bound to be surrounding circumstances that can support what the act being relied upon meant”, such as the 4 July 2015 WhatsApp Exchange in the present case. 110 I am, however, not persuaded by the plaintiffs for the following reasons: (a) First, I repeat the points made at [96] above that there is room for both the interpretations ofJoseph Mathewspecified therein. More importantly, it is clear that the Court of Appeal inJoseph Mathewdid not decide the issue of the applicable standard. (b) Second, it does not appear to be seriously disputed that the ex-wife’s consent to the sale of the Signature Park property relates to an “interest in land”. The plaintiffs’ difficulty (as will be seen below) is in simply showing that this alleged act of part performance isunequivocally referableto the ex-wife’s Pleaded Oral Agreement. What the plaintiffs need to justify is why the requirement of “unequivocal referability” inMaddisonshould be abandoned for theSteadman([92]supra)standard. The plaintiffs’ argument at [109(b)] above does not directly address this. (c) Third, the plaintiff’s argument at [109(c)] above appears to be based on an understanding of the doctrine of part performance as a rule of evidence or mode of proof of an oral contract and the “unequivocal referability” requirement inMaddisonas being a standard of proof. I do not, however, consider this to be correct. As noted at [104]–[107] above and inPipikos([106]supra) (at [47]–[49], [51]–[52], [54] and [65]),Maddisonrationalised the doctrine of part performance as concerning the enforcement of the equities generated by a party’s partial performance of the contract. It is not concerned with proofof the contract itself. Seen in this light, the doctrine is a substantive equitable principle and not merely a rule of evidence or mode of proof seeking to impermissibly replace the requirements of proof in s 6(d) of the CLA. (d) Fourth, I understand the plaintiffs’ argument at [109(d)] above to be that it is easier nowadays (as compared with the past) to obtain evidence in respect of alleged oral contracts as parties are far more likely to communicate through recorded mediums. Although this may generally be true, I do not think it is sufficient to address the arguments in favour of theMaddisonstandard, as discussed above. 111 Lastly, I am also not fully convinced thatSteadmanprovides a cogent basis for overturning the balance struck by theMaddison([95]supra) standard. In essence, this is because, as noted by Kiefel CJ, Bell, Gageler and Keane JJ inPipikos,the reasoning of the members of the coram inSteadmanwas disparate: [67]It is noteworthy that inSteadmannone of their Lordships suggested that the decision involved a departure from the approach of Lord Selborne inMaddison v Alderson.Nevertheless, Lord Reid justified his conclusion by reasoning in terms of estoppel: 'If one party to an agreement stands by and lets the other party incur expense or prejudice his position on the faith of the agreement being valid he will not then be allowed to turn round and assert that the agreement is unenforceable.' [68] Two things may be said about Lord Reid's statement of principle. First, to the extent that it speaks of the avoidance of detriment as an essential condition of the operation of the doctrine of part performance, it differs from … Lord Selborne's reasoning … ; and secondly, it does not explain how it is that the doctrine supports an order for specific performance of a contract rather than an order limited to remedying the detriment to the plaintiff. [69]InSteadmanViscount Dilhorne and Lord Salmon seem, at least to some extent, to have justified their conclusionson the basis that the acts relied upon were sufficient proof of a parol contract in the absence of the writing required by the Statute of Frauds. [70] In oral argument senior counsel for the appellant, acknowledgingthe disparate reasoning of the members of the majority of the House of Lords inSteadman, rightly did not press this Court to follow that decision.Given the absence from their Lordships' reasons of analysis critical of Lord Selborne's reasoning, and given further that, in point of principle, the doctrine of part performance is neither a species of equitable estoppel nor a mode of proof of a parol contract,Steadmandoes not provide a sound basis for departing from the position[ie,theMaddisonstandard]established by the course of authority in this Court. [emphasis added in bold] 112 At this juncture, I discuss the plaintiffs’ somewhat novel argument that the court ought to take a ‘case-by-case’ approach in deciding the applicable standard. The argument is as follows. There are two different risks of injustice at play in situations involving oral contracts: (a) First, the risk that perjured evidence may be called upon to prove spurious agreements said to have been made orally. (b) Second, the risk that a party making and acting on what he thought to be a binding oral agreement would find his commercial expectations defeated when the other party successfully relied on the lack of a written memorandum of the agreement. Where the court is only able to hear evidence from one party to the alleged oral contract (ie,because the other party is deceased), the first risk of injustice would be more important than the second. This was the case inMaddisonand hence the stricter standard was applied. However, where the court has the benefit of hearing evidence from both sides to the dispute, the second risk of injustice should come to the forefront. Where parties have the opportunity to put all the evidence before the court, the court ought to be able to look at all the surrounding circumstances in determining if part performance has been made. This was the case inSteadmanand the more relaxed standard was thus applied. As this Court has the benefit of hearing evidence from both sides to the Oral Agreement,ie,the ex-husband and ex-wife, theSteadmanstandard ought to apply here. 113 In my view, the ‘case-by-case’ approach above is not workable. One of the criticisms made by the UK Law Commission Report in respect of the English legal position afterSteadmanis that “[a]s a result of judicial attempts to prevent the statute being used as an instrument of fraud, it is virtually impossible to discover with acceptable certainty,prior to proceedings, whether a contract will be found to be enforceable under statutory requirements” [emphasis added] (see also [101] above). It goes without saying that parties require certainty in their dealings, especially when it comes to interests in land which are likely to have substantial value. This means that, at the very least, parties should be clear early on as to which one of the two standards inMaddisonandSteadmanshould govern whether a promisee’s acts amount to sufficient part performance (so as to render a contract “enforceable”). It cannot be that the applicable standard is dependent on legal proceedings being commenced, and whether both sides to the dispute eventually turn up to litigate in court. Parties would be left in an unacceptable state of legal limbo until the day of trial. Accordingly, if a choice must be made between theMaddisonandSteadmanstandards, it ought to be made across the board for all oral contracts and not merely on a ‘case-by-case’ basis. 114 In conclusion, for the reasons above, I would adopt theMaddisonstandard over theSteadman([92]supra)standard. 115 Applying the stricter standard inMaddison(set out [9595(a)] above) to the present facts, the act relied upon by the plaintiffs as constituting the ex-wife’s part performance of the ex-wife’s Pleaded Oral Agreement is the ex-wife’s giving of consent to the sale of the Signature Park property. The plaintiffs argue that the ex-husband himself accepts than there was an oral agreement entered into on 22 June 2015 and that “[t]his alone would satisfy the requirement that the [ex-wife’s consent] points to anagreement on an interest in land” [emphasis in original] . This argument is, however, misconceived. As earlier stated, theMaddisonstandard requires the act relied upon to be examined in isolation. Contrary to the plaintiffs’ argument, the ex-husband’s evidence of the Oral Agreement itself is not to be taken into consideration. More importantly, I am unable to accept that the ex-wife’s consent to the sale of the Signature Park property is “unequivocally, and in [its] own nature, referable to the agreement being alleged”. The ex-wife was a co-owner of the said property and there is nothing in this alleged act of part performance that distinguishes it from an ordinary sale of one’s property. Nothing in the nature of this act points to the ex-wife’s Pleaded Oral Agreement with the ex-husband, much less unequivocally so. 116 For the reasons above, if I had found that the formality requirements of s 6(d) of the CLA were not satisfied, I do not think that the ex-wife’s Pleaded Oral Agreement would nonetheless be enforceable on the ground of part-performance. As mentioned earlier, however, this is strictly speaking a moot point on account of my finding that s 6(d) of the CLAissatisfied in the present case.",
        "Counterclaim Issue": "117 The ex-husband’s Counterclaim against the ex-wife has already been set out at [22] above. It is dismissed for the simple reason that the DJ’s Order, as varied by the HCF Order, does not require the ex-wife to buy over the ex-husband’s one-third share in the Mulberry Property. Based on [9(a)] above read with [9(d)], it is clear that the ex-wife merely had the “first right” but not an obligation to buy over the ex-husband’s share. She was entitled not to exercise that right. In submissions, the ex-husband added that he also seeks a court order that the plaintiffs are to sell the Mulberry Property on the open market and give him his one-third share of the sale proceeds. Although he had initially sought this relief in the OS, he failed to pray for the same in his Defence and Counterclaim. In any case, this is inconsequential as I see no basis to make such an order.",
        "Conclusion": "118 In summary, I dismiss the action by the ex-wife in her capacity as the Personal Representative of the Mother’s estate(ie, quathe second plaintiff) and deny the reliefs sought by her in such capacity. I also dismiss the ex-husband’s Counterclaim against the ex-wife. In respect of the ex-wife’s action in her own name (ie, quathe first plaintiff) against the ex-husband, I order as follows: (a) A declaration that the ex-wife and the ex-husband entered into the ex-wife’s Pleaded Oral Agreement on 22 June 2015 (as set out at [5] above) be granted. (b) The ex-husband is to transfer to the ex-wife all his rights, title and interest in the Mulberry Property (ie,his one-third share) within 30 days of the date of this judgment. (c) In the event that the ex-husband is absent, or neglects, or refuses to sign any document or indorse any instrument to execute the aforesaid transfer by the specified deadline, the Registrar of the Supreme Court is empowered to do so on his behalf pursuant to s 14(1) of the SCJA. (d) Within 21 days of the execution of the aforesaid transfer, the ex-wife is to transfer $495,000 to the ex-husband, such amount being equivalent to her half-share of the sale proceeds of the Signature Park property (ie,$675,000) less $180,000. (e) Parties shall have liberty to apply. 119 I will hear parties on costs at a later date. Dedar Singh GillJudge of the High Court Sean Francois La’Brooy and Cumara Kamalacumar (Selvam LLC) for the plaintiffs; The defendant in person.",
        "": ""
    }
}