{
    "case_title": "Cosmetic Care Asia Ltd and othersvSri Linarti Sasmito",
    "ncitation": "[2021] SGHC 157",
    "coram": "S Mohan JC",
    "sections": {
        "Introduction": "1 Summons 5867 of 2019 (“SUM 5867”) is the defendant’s application (a) to discharge/set aside the order of an assistant registrar granting the plaintiffs leave to serve the originating process in HC/S 617/2019 (“S 617”) on the defendant out of jurisdiction in Jakarta, Indonesia, (b) to discharge/set aside a further order allowing for substituted service of the originating process to be effected on the defendant, (c) to set aside the service on the defendant and (d) for a declaration that the Writ of Summons (“Writ”) and Statement of Claim (“SOC”) have not been duly served on the defendant in compliance with the Rules of Court (Cap 322, R5, 2014 Rev Ed) (“ROC”) . 2 I dismissed SUM 5867 on 31 August 2020 and delivered brief oral grounds for my decision. The defendant subsequently sought my leave to appeal to the Court of Appeal. After hearing the parties, I granted the defendant leave on 8 February 2021 as I felt that there were some issues of importance in this case which would warrant consideration by the Court of Appeal. The defendant has since appealed and I now set out the full grounds for my decision in SUM 5867.",
        "Facts": "",
        "The parties": "3 The first plaintiff, Cosmetic Asia Care Ltd, is a company incorporated in the British Virgin Islands (“BVI”) and is in the business of franchising and licensing, among other things, the “MARIE FRANCE” trademark and logo, the “BELLA” trademark, the “SVENSON” trademark, and specialised treatments and products for weight management, hair and beauty. 4 The second to fourth plaintiffs, OBM (Technical Services) Pte Ltd, Facial Care Services Pte Ltd and Hair System Management Pte Ltd are incorporated in Singapore and are in the business of specialised treatments and selling products for weight management, hair and beauty.1Foot Note 1×Plaintiffs’ Skeletal Submissions dated 13 February 2020 (“Plaintiff’s February Submissions”) at paras 7–8.All four plaintiffs (the “plaintiffs”) are wholly-owned subsidiaries of Cosmetic Care Group Ltd.2Foot Note 2×Statement of Claim (S 617/2019) (“SOC”) at para 5. 5 The defendant, Sri Linarti Sasmito, is an Indonesian citizen, and the co-founder of the following companies incorporated in Indonesia: (1) PT Cosmeticindo Slimming Utama (“PTCSU”), (2) PT Cantiksindo Utama (“PTCU”) and (3) PT Hairindo Pratama (“PTHP”) (collectively, the “PT Entities”). The PT Entities are in the business of providing health, beauty and weight management services. They are the Indonesian franchisees of the plaintiffs.3Foot Note 3×Defendant’s Submissions dated 13 February 2020 (“Defendant’s February Submissions) at para 5.",
        "Background to the dispute": "6 The relationship between the plaintiffs and the PT Entities goes back to the mid-1990s and was initially governed by various franchise, license and technical assistance agreements permitting the latter to,inter alia, franchise and license trade names, marks and specialised treatments and products for weight management, hair and beauty (“Agreements”).4Foot Note 4×Plaintiffs’ February Submissions at para 9; 1st affidavit of Sri Linarti Sasmito dated 21 November 2019 (“1SLSA”) at para 6; 1st affidavit of Quek Swee Li dated 2 August 2019 (“1QSLA”) at paras 22–23. 7 Several years later, the first plaintiff and its related entities entered into a term sheet dated 23 April 2014 (“Term Sheet”) with the PT Entities.5Foot Note 5×Defendant’s February Submissions at para 5; Plaintiffs’ February Submissions at para 11; 1QSLA at pp 408–412.The Term Sheet stated in a section titled “Background” as follows: 1. CCA [ie, the first plaintiff and its related entities] entered into agreements (“Agreements”) with PTCS, PTHP and PTCU on 1 October 1994, 30 June 1995 and 30 June 1995 respectively. The Agreements are for the period up to 9 August 2014 (PTCS), 30 June 2013 (PTCU) and 30 June 2017 (PTHP). 2. From around July 2011 (to September 2013), the PT Entities are in default as a result of not making payment of fees due in accordance with the Agreements. 3. Since October 2013, PT Entities have in good faith been complying with the Agreements whilst discussions in respect of new terms have been held. 8 In particular, the Term Sheet contained an “Interim arrangements” clause (“Interim Arrangements Clause”), which stated that: From date of signing of Term Sheet until the new agreements are signed, PT Entities shall continue paying 10% Operating Surplus as Technical Assistance Fees (“TAF”), 10% Operating Surplus as License Fees (“LF”) and 10% Operating Surplus as Royalty charges and shall be pro-rata for the month in which the Term Sheet is signed … 9 The Term Sheet also contained a “Termination” clause (“Termination Clause”), which stated that: This Term Sheet can be terminated if there is a default under this Term Sheet by 21 days written notice to the defaulting party. 10 Subsequently, an acknowledgement of debt dated 18 May 2018 (“AOD”) was executed. The AOD is the centrepiece of the dispute between the parties in S 617. The AOD was prepared on the letterhead of PTCSU and was signed by the defendant, by Patrick Schwarz (“Schwarz”) as the Chief Financial Officer of the “Global Beauty Group” and Quek Swee Li (“Quek”) as the Chief Executive Officer of the “Global Beauty Group”. The defendant’s signature was “witnessed” electronically by one Foong Daw Ching (“Foong”). Foong sent an email dated 21 May 2018 to the plaintiffs forwarding the AOD signed by the defendant. In that email, Foong stated that his email could be treated as him having witnessed the defendant’s signature on the AOD.6Foot Note 6×1QSLA at p 524.The text of the AOD is reproduced below:7Foot Note 7×1QSLA at p 414. CCA and its affiliated companies understand that the following companies PT Cosmeticindo Slimming Utama (“PTCS”), PT Cantiksindo Utama (“PSU”) and PT Hairindo Pratama (“PTHP”) (collectively “the creditor”) will enter into liquidation. The creditor is the assigned party under which CCA entered into the current agreement. I, the undersigned, Sri Linarti Sasmito hereby acknowledge that I am personal [sic] liable to the outstanding Technical Assistance, License and Royalty Fees (“Fees”) amounting to Rp4,787,517,603 for the time period November 2017 to March 2018, based and calculated in accordance with the existing “Term Sheet” issued on 23rd April 2014 and signed on 9th May 2014 and applicable for the creditor which are owned and represented by Sri Linarti Sasmito. The same applies for the Fees covering the months till new PT commences full operational status, which are not available as per the date of issuance of this letter. Should there be any amounts outstanding and agreed upon, it will be offset against the total owing amount by the creditor to CCA and its affiliated companies. The total outstanding fees are due with the operational commencement of the new PT, which is foreseeably on 1st July 2018 as per statement given to us by the creditor. This acknowledgement of Debt serves the purpose of the temporarily continuance [sic] under the current terms. Singapore, 18 May 2018 [signature]          [signature] Sri Linarti Sasmito                  Patrick Schwarz PT Cosmeticindo Slimming         CFO, Global Beauty Group Utama (“PTCS”) PT Cantiksindo Utama (“PTCU”) PT Hairindo Pratama (“PTHP”)  In Witness by: [blank signature line]           [signature] Foong Daw ChingQuek Swee Li CEO, Global Beauty Group 11 I put down a marker at this juncture to note that the parties to the Term Sheet and the AOD, and whether the Term Sheet was meant to replace the Agreements, are among a number of matters of some contention between the parties. Plaintiffs’ version of events 12 The factual backdrop against which and why the AOD was executed, as well as the validity and enforceability of the AOD are also disputed by the parties. The plaintiffs’ case is that the defendant executed the AOD because the PT Entities had failed, refused and/or neglected to pay the monies due and owing to the plaintiffs under the Interim Arrangements Clause of the Term Sheet. Between November 2017 and March 2018, the sum due to the plaintiffs from the PT Entities stood at Indonesian Rupiah (“IDR”) 4,787,517,603.8Foot Note 8×1QSLA at para 30.In consideration of the plaintiffs’ forbearance from commencing legal action against the PT Entities, the plaintiffs and defendant agreed that the latter would guarantee the payment of the fees due from the PT Entities under the Interim Arrangements Clause. That gave rise to the AOD.9Foot Note 9×Plaintiffs’ February Submissions at paras 25–26.It is the plaintiffs’ case that the defendant was seeking to stave off the termination of the commercial relationship by the plaintiffs and commencement of legal proceedings by the plaintiffs against the PT Entities to recover what was owed by the PT Entities. However, following the execution of the AOD, the PT Entities failed to pay the fees due to the plaintiffs under the Interim Arrangements Clause.10Foot Note 10×1QSLA at paras 26–36.As such, the plaintiffs took the position that the PT Entities were guilty of breaching the Term Sheet and proceeded to terminate the same on 28 September 2018. At the point of termination on 28 September 2018, the PT Entities owed the plaintiffs a total sum of IDR 7,849,171,370.11Foot Note 11×1SLSA at pp 29–31. 13 The plaintiffs then issued a number of demands to the PT Entities from 28 September 2018 to 31 January 2019 for payment of the amounts outstanding. However, the PT Entities refused to pay the monies demanded and disputed the amount that was owed. In those circumstances, the plaintiffs then sought to enforce the guarantee given by the defendant under the AOD. A demand was sent by the plaintiffs’ solicitors, Tan Kok Quan Partnership (“TKQP”), to the defendant on 6 March 2019 demanding payment from the defendant of the sum of IDR 8,221,181,489 (“Outstanding Balance”) said to be due to the plaintiffs as at the date of the letter.12Foot Note 12×1QSLA at pp 416–420.However, the defendant refused to make payment of the Outstanding Balance and through her solicitors, Rajah & Tann Singapore LLP (“R&T”), denied any liability under the AOD for the reasons which had been articulated in an earlier letter from R&T (sent on behalf of the PT Entities) on 15 February 2019.13Foot Note 13×1QSLA at pp 427–429.Among the reasons given was the contention that the “operational commencement of the new PT entity”, which was a condition for when any payment would become due under the AOD, never came to pass.14Foot Note 14×1SLSA at p 63 at para 5(3).The defendant’s position was that the “new PT” entity envisaged in the AOD, namely, PT Asia Prima Pratama (“PT APP”), never commenced operations and thus any liability of the defendant under the AOD was not triggered. The plaintiffs on the other hand took the position that the “new PT” entity was PT Maddie Frans Bodiline (which subsequently changed its name to PT Asia Prima Indonesia (“PT API”) on 4 March 2019) and that it had commenced full operations on 11 October 2018, thus crystallising the defendant’s liability under the AOD.15Foot Note 15×Plaintiffs’ February Submissions at para 27. 14 The plaintiffs thus commenced S 617 against the defendant on 25 June 2019 to enforce the AOD. In S 617, the plaintiffs claimed against the defendant the Outstanding Balance or alternatively, damages to be assessed for breach of the AOD.16Foot Note 16×SOC at p 25. Defendant’s version of events 15 The defendant disagreed with the characterisation of events as set out by the plaintiffs. The defendant contended17Foot Note 17×1SLSA at paras 6–12; pp 62–65 and 71–73.that the AOD was entered into because the parties were seeking to achieve a more efficient tax structure. It was therefore envisaged that a “new PT” would be incorporated that would take over the business/operational role of the PT Entities. The PT Entities in turn would thereafter be liquidated. However, the “new PT” entity (ie,PT APP) never commenced operations, and the PT Entities continued with their respective businesses until the plaintiffs purported to terminate the Term Sheet on 28 September 2018. In addition, the defendant asserted that the plaintiffs had been overcharging the PT Entities. Thus, until the accounting of amounts due from the PT Entities to the plaintiffsandamounts due from the plaintiffs to the PT Entities had been undertaken, and with operational commencement of the “new PT” entity not coming to pass, the AOD remained inchoate and unenforceable. The present proceedings 16 By an order of court dated 5 August 2019, the plaintiffs obtained leaveexparteto serve a sealed copy of the Writ in S 617 endorsed with the SOC on the defendant in Jakarta (“Service Out Order”).18Foot Note 18×HC/ORC 5266/2019.On 4 October 2019, the plaintiffs obtained a furtherexparteorder allowing them to effect substituted service of the Writ and SOC on the defendant by sending copies of the Writ and SOC by registered post to the defendant's address in Indonesia and/or through the smartphone messaging platform, “WhatsApp”, linked to the defendant's mobile phone number (“Substituted Service Order”).19Foot Note 19×HC/ORC 6729/2019. 17 Substituted service was effected on the defendant on or about 11 October 2019. The defendant acknowledged receiving copies of the Writ and SOC on 11 October 2019 via a “Whatsapp” message.20Foot Note 20×1SLSA at para 22.SUM 5867 was filed by the defendant on 22 November 2019. It is also of note that the PT Entities commenced litigation in Indonesia against the first plaintiff by way of a claim registered in the Central Jakarta District Court on 24 January 2019 (“Indonesian Proceedings”).21Foot Note 21×1st affidavit of Drs Sularno Popomaruto dated 28 November 2019 (“1DSPA”) at pp 7–9.",
        "Issues to be decided": "18 There are two main issues that arise to be decided in SUM 5867: (a) whether the Service Out Order should be set aside, and under this issue, the following sub-issues also arise for consideration: (i) whether the plaintiffs’ claim has sufficient merits; (ii) whether Singapore is the appropriate forum to determine the dispute; (iii) whether the plaintiffs had discharged their obligation to make full and frank disclosure; and (b) whether the Substituted Service Order should be set aside.",
        "Whether the Service Out Order should be set aside": "",
        "General principles": "19 The requirements that must be met before a plaintiff may obtain leave to serve originating process out of Singapore are well-established and have been helpfully summarised by the Court of Appeal inOro Negro Drilling Pte Ltd and others vIntegradora de Servicios Petroleros Oro Negro SAPI de CV and others and another appeal (Jesus Angel Guerra Mendez, non-party)[2020] 1 SLR 226 (“Oro Negro”) at [54], reaffirming its earlier decision inZoom Communications Ltd v Broadcast Solutions Pte Ltd[2014] 4 SLR 500(“Zoom Communications”) at [26]: (a) First, the plaintiff must have a good arguable case that its claim falls within one of the “jurisdictional gateways” under O 11 r 1 of the Rules of Court (Cap 322, R 5, 2014 Ed) (the “ROC”). For convenience, we shall henceforth refer to this requirement as the “good arguable case requirement”. (b) Second, there must be a sufficient degree of merit to the plaintiff’s claim, and in doing so it must show that there is a serious question to be tried. This requirement was unnecessary though, if the plaintiff was relying on a jurisdictional gateway that already required the court to examine the merits of its claim under the good arguable case requirement (Bradley LomasElectrolok Ltd v Colt Ventilation East Asia[1999] 3 SLR(R) 1156 at [18]-[20]). (c) Third, Singapore mustclearlybe the more appropriate forum for the trial or determination of the action (the “appropriate forum requirement”). [emphasis in original] 20 In addition, the plaintiff must provide full and frank disclosure of all material facts when applying for leave, and a failure to do so may be a sufficient basis to set aside an order granting leave for service out (Zoom Communicationsat [68]–[69]). 21 The defendant submitted, and it was not disputed by the plaintiffs, that the burden of satisfying the requirements for leave lies with the plaintiffs. The defendant further contends that the plaintiffs had failed to discharge their burden of demonstrating that (a) their claim had sufficient merit; and (b) that Singapore was the proper forum for the determination of the dispute. Further, the plaintiffs also failed to make full and frank disclosure in theirexparteapplication for leave to serve the originating process out of jurisdiction.",
        "Whether the plaintiffs’ case has sufficient merits": "Preliminary observations 22 The defendant did not dispute that the good arguable case requirement had been met by the plaintiffs in this case insofar as the plaintiffs relied on O 11 r 1(a) of the ROC as their jurisdictional gateway, namely, that relief was sought in S 617 against the defendant who had property in Singapore.22Foot Note 22×Certified Transcript (26 February 2020) at p 3 ln 13–17.Accordingly, whilst the plaintiffs had also relied on a number of other limbs in O 11 r 1 ROC in theirexparteapplication, namely O 11 rr 1(d)(i) and/or 1(d)(iii), it was unnecessary for me to decide if the plaintiffs also satisfied those limbs to the standard of a good arguable case. It is common ground between the parties that the jurisdictional gateway requirement is met by a plaintiff so long asat least oneof the jurisdictional gateways in O 11 r 1 ROC upon which the plaintiffs have relied is met to the standard of a good arguable case. 23 This point was of relevance in this case because engaging in an analysis of whether the plaintiffs were able to rely on O 11 rr 1(d)(i) and/or 1(d)(iii) of the ROC as jurisdictional gatewayscouldpotentially involve delving into themeritsof the claim to determine if a case had been made out by the plaintiffs to the standard of a good arguable case. 24 However, in light of the defendant’s acceptance that the plaintiffs did have a good arguable case to rely on O 11 r 1(a) of the ROC, which was a jurisdictional gateway that didnotengage the merits of the case, the court would only need to consider the merits of the plaintiffs’ claim at alowerthreshold,ie,whether there was a serious question or issue to be tried (Bradley LomasElectrolok Ltd and another v Colt Ventilation East Asia Pte Ltd and others[1999] 3 SLR(R) 1156 (“Bradley Lomas”) at [18] and [20]). 25 Shortly after the hearing before me had concluded, the High Court delivered judgment inKernel Oil Pte Ltd v ImanDjuniardi[2020] SGHC 52 (“Kernel Oil”). I directed parties to tender further submissions to addressKernel Oil. In particular, I directed the parties to submit on the threshold which the plaintiffs had to meet at this stage of the proceedings with regard to the merits of their case when O 11 r 1(d) ROC was the jurisdictional gateway in question. InKernel Oilat [16], Choo Han Teck J was of the view that at least with regard to O 11 r 1(d)(i) of the ROC, a plaintiff had to establish a good arguable case that the limb applied and to go on separately to demonstrate that there is a serious issue to be tried on the merits. 26 Ultimately, in light of the defendant’s concession (see [22]), it was not necessary for me to engage the issue of whether a plaintiff has to separately show a serious issue to be tried on the merits when the jurisdictional gateway relied upon is O 11 r (1)(d) of the ROC. I therefore say no more on this point. 27 With the jurisdictional gateway requirement established, I turn my attention to the merits of the plaintiffs’ claim. Parties’ cases 28 The defendant submitted that the plaintiffs have failed to show that there is any serious issue to be tried. First, the plaintiffs are unable to prove that the operational commencement of the “new PT”, which is a requirement for the defendant’s liability to arise under the AOD, had taken place.23Foot Note 23×Defendant’s February Submissions at paras 16–22.Second, the AOD is unenforceable under Indonesian law, which the defendant argues is the governing law of the document.24Foot Note 24×Defendant’s February Submissions at paras 23–28.Third, the parties to the AOD are ambiguous and this uncertainty shows that no valid contract had been entered into.25Foot Note 25×Defendant’s Reply Submissions dated 18 March 2020 (“Defendant’s March Submissions”) at paras 31–38.Finally, the AOD is not supported by consideration and is therefore unenforceable.26Foot Note 26×Defendant’s February Submissions at para 29. 29 The plaintiffs submitted that they have demonstrated that there is a serious issue to be tried. PT API was incorporated on or about 10 October 2018 and had commenced operations, and therefore the defendant’s liability under the AOD had been triggered. The PT Entities had failed, refused or neglected to pay the debt due and the quantum of this debt could be ascertained. There is thus sufficient foundation for the plaintiffs’ claim that the defendant was liable under the AOD. The AOD was governed by Singapore law and not Indonesian law. While the defendant made various assertions to the effect that the plaintiffs’ case lacked sufficient merit, these assertions have been adequately addressed by the plaintiffs. Lastly, there was no uncertainty as to the parties to the AOD and there was valid consideration flowing from the plaintiffs in the form of an implied forbearance to sue.27Foot Note 27×Plaintiffs’ Revised Further Submissions dated 9 April 2020 (“PRFS”) at paras 8(c)–10. Analysis 30 InMAN Diesel & Turbo SE and another v IMSkaugen SE and another[2020] 1 SLR 327 (“MAN Diesel & Turbo SE”), the Court of Appeal observed that, in order to establish a “good arguable case” that a claim fell within one of the jurisdictional gateways in O 11 r 1 of the ROC, a plaintiff need only show that it had “the better of the argument”, as opposed to a “much better argument”, which would be “imposing too high a standard of proof”. The threshold of a “good arguable case” requires “more than a mereprima faciecase, but is lower than that of a balance of probabilities” (at [30]). As for the merits of the case, where it is required to be separately shown, the threshold is that of a “serious issue to be tried” (seeOro Negroat [54(b)], referenced at [19] above). 31 That the threshold of a “serious issue to be tried” is lower than that of a “good arguable case” is uncontroversial, but what does that lower threshold entail in practical terms? In particular, what does a plaintiff need to demonstrate to cross that lower threshold? InKernel Oil, the High Court held at [16] that a “serious issue to be tried” merely means that a plaintiff “must raise an issue which needs to be resolved by the court”. To that, I would add that the issues or questions raised by the plaintiff and the available evidence disclose that the claim is notso hopelessas to warrant leave to serve out being refused. 32 The English House of Lords’ decision inSeaconsarFar East Ltd v BankMarkazi Jomhouri Islami Iran[1994] 1 AC 438 (“Seaconsar”) was the seminal case that explained the distinction between the “good arguable case” standard to establish a jurisdictional gateway and the “serious issue to be tried” standardvis-a-visthe merits of the case, in the context of an application for leave to serve originating process out of jurisdiction. Lord Goff of Chieveley, delivering the leading opinion of the House of Lords (at 451–452), referenced Lord Davey’s opinion inChemischeFabrik vormals Sandoz v Badische Anilin und Soda Fabriks(1904) 90 LT 733 (“Chemische”), where Lord Davey stated: An injunction is sought to restrain the defendants from doing some act within the jurisdiction. Rule 4 of [Order 11] prescribes that the application is to be supported by evidence stating that in the belief of the deponent the plaintiff has a good cause of action, and no such leave is to be granted unless it be made sufficiently to appear to the court or judge that the case is a proper one for service out of the jurisdiction under this Order. This does not, of course, mean that a mere statement by any deponent who is put forward to make the affidavit that he believes that there is a good cause of action is sufficient. On the other hand, the court is not, on an application for leave to serve out of the jurisdiction, or on a motion made to discharge an order for such service, called upon to try the action or express a premature opinion on its merits, and where there are conflicting statements as to material facts, any such opinion must necessarily be based on insufficient materials. But I think that the application should be supported by an affidavit stating facts which, if proved, would be a sufficient foundation for the alleged cause of action, and, as a rule, the affidavit should be by some person acquainted with the facts, or, at any rate, should specify the sources or persons from whom the deponent derives his information.A more difficult question is where it is in dispute whether the alleged or admitted facts will, as a matter of law, entitle the plaintiff to the relief which he seeks. If the court is judicially satisfied that the alleged facts, if proved, will not support the action, I think the court ought to say so, and dismiss the application or discharge the order. But where there is a substantial legal question arising on the facts disclosed by theaffidavits which the plaintiff bona fide desires to try, I think that the court should, as a rule, allow the service of the writ.The words at the end of the Order do not, I think, mean more than that the court is to be satisfied that the case comes within the class of cases in which service abroad may be made under the first rule of the Order. [emphasis added] 33 With reference to Lord Davey’s opinion inChemische, Lord Goff inSeaconsaropined as follows (at 452): On this approach, if in support of the plaintiff's ex parte application an affidavit is sworn in proper form deposing to facts which, if proved, provide a sufficient foundation for the alleged cause of action, that should generally be enough for present purposes. This is no doubt what a number of judges have referred to when they have used the expression \"prima facie case\" in this context. The problem arises from the fact that the court will consider, on an application to set aside leave so given, affidavit evidence on the part of the defendant, and will take such evidence into account when deciding whether or not to exercise its discretion in favour of the plaintiff.But the court cannot resolve disputed questions of fact on affidavit evidence; and it is consistent with the statement of the law by Lord Davey that if, at the end of the day, there remains a substantial question of fact or law or both, arising on the facts disclosed by the affidavits, which the plaintiff bona fide desires to try, the court should, as a rule, allow the service of the writ. If this approach is correct, the standard of proof in respect of the cause of action can broadly be stated to be whether, on the affidavit evidence before the court, there is a serious question to be tried. [emphasis added] 34 The House of Lords further held (at 456–457) that: Once it is recognised that, so far as the merits of the plaintiff's claim are concerned,no more is required than that the evidence should disclose that there is a serious issue to be tried, it is difficult to see how this matter, although it falls within the ambit of the court's discretion, has not in practice to be established in any event.This is because it is very difficult to conceive how a judge could, in the proper exercise of his discretion, give leave where there was no serious issue to be tried. Accordingly, a judge faced with a question of leave to serve proceedings out of the jurisdiction under Order 11 will in practice have to consider both (1) whether jurisdiction has been sufficiently established, on the criterion of the good arguable case laid down inKorner'scase, under one of the paragraphs of rule 1(1), and (2) whether there is a serious issue to be tried, so as to enable him to exercise his discretion to grant leave, before he goes on to consider the exercise of that discretion, with particular reference to the issue of forum conveniens. [emphasis added] 35 Lord Davey’s opinion inChemischewas cited with approval by our Court of Appeal inBradley Lomas. The Court of Appeal also reiterated the point that the court is “not called upon to try the action or express a premature opinion on its merits” (Bradley Lomasat [17]). The court needs only to be satisfied at this early stage of the proceedings that the evidence demonstrates that the claimis not so hopelesssuch that leave should not be granted. 36 Aside from leave to serve out of jurisdiction under O 11 of the ROC, the threshold of a “serious issue to be tried” is also a requirement to be met by a party seeking an interlocutory injunction under the test as set out inAmerican Cyanamid Co v Ethicon Ltd[1975] AC 396. As to what constitutes a “serious issue to be tried” for purposes of obtaining an interlocutory injunction, the authors ofSingapore Civil Procedure 2020vol 1 (Chua Lee Ming gen ed) (Sweet & Maxwell, 10th Ed, 2019) note that the court “must be satisfied thatthe claim is not frivolous or vexatious”; and that the court should consider this requirement as having been met “unless the material available to the court at the hearing of the application … fails to disclose that the plaintiff hasany real prospect of succeedingin his claim for a permanent injunction at the trial (at para 29/1/11, emphasis added). 37 The authors ofSingapore Civil Procedurefurther note (at para 29/1/12) that: The prospects of the plaintiff’s success are to be investigated only to a limited extent. As pointed out by the High Court inBuckman Laboratories (Asia) Pte Ltd v Lee WeiHoong[1999] 1 S.L.R.(R.) 205 at [28],this is a low threshold. All thathas to be seen is whether he has prospects of success which, in substance and reality, exist.Odds against success do not defeat him, unless they are so long that the plaintiff can have no expectation of success, but only a hope. If his prospects are so small that they lack substance and reality, then he fails; for he can point to no question to be tried which can be called “serious”, and no prospects of such success which can be called “real”. However, with respect to the prospects of the plaintiff’s success where a dispute as to facts is in issue, while it is not appropriate for the court to attempt to resolve conflicts of evidence on affidavit, this does not mean that the court is bound to accept uncritically as raising a dispute of fact which calls for further investigation, every statement on an affidavit, however equivocal, lacking in precision, inconsistent with undisputed contemporary documents or other statements by the same deponent, or inherently improbable in itself it may be.It is for the court to determine in the first instance whether statements contained in affidavits that are relied upon as raising a conflict of evidence upon a relevant fact have sufficient prima facie plausibility to merit further investigation as to their truth(EngMee Yong v V Letchumanan[1979] 2 MLJ 212 at 217, cited with approval inChuan Hong Petrol Station Pte Ltd v Shell Singapore (Pte) Ltd[1992] 2 S.L.R.(R.) 1 at [45]). [emphasis added] 38 The “serious issue to be tried” threshold in the context of applications for interlocutory injunctions has also been helpfully summarised by Prof Jeffrey Pinsler inSingapore Court Practice 2017(LexisNexis, 2017) (at para 29/1/25): InAmerican Cyanamid, Lord Diplock stated that the evidence adduced at the hearing must show that the claimant has a ‘real prospect of succeeding in his claim for a permanent injunction at the trial’ ([1975] AC 396, at 408).The court is concerned with whether the evidence reveals issues which may enable the plaintiff to succeed, rather than the actual strength of his case.As Browne LJ said inAlfred Dunhill vSunoptic SA[1979] FSR 337, at 373, ‘it is irrelevant whether the court thinks that the plaintiff’s chances of success in establishing liability are 90 per cent or 20 per cent’. Also seeRe Cable[1977] 1 WLR 7;Smith v Inner London Education Authority[1978] 1 All ER 411.There is no rule that the plaintiff must establish a prima facie case or probability of success.SeeAmerican Cyanamid v Ethicon[1975] AC 396, at 407;Fellowes & Son v Fisher[1976] QB 122, at 137;Hong Kong Vegetable Oil vMalin Sirinaga Wicker[1978] 2 MLJ 13, at 15. The same point was made inCaynev Global Natural Resources[1984] 1 All ER 225, where Eveleigh J saida serious question to be tried involves showing supporting evidence for the claimant’s case and that the eventual determination of the issues at trial is in doubt.… [emphasis added] 39 As can be seen from the case authorities and commentaries above at [32] –[38], in assessing if the “serious issue to be tried” merits threshold has been met, be it in the context of O 11 r 1 ROC or an interlocutory injunction, the court’s task is primarily to ascertain if there are issues to be tried (of fact or law) which the plaintiff couldpotentiallysucceed in at trial; the court does not go to any great lengths to assess the merits of the claim. The threshold is low but nevertheless, it must be shown that there is a “substantial question of fact or law which the plaintiff has a genuine desire to be tried” (Halsbury Laws of Singaporevol 6(2) (LexisNexis, 2020 Reissue) (“Halsbury Laws of Singapore”) at para 75.071, citingChemischeandBradley Lomas). 40 Following from the above, so long as the plaintiffs are able to demonstrate that there are issues that they have raised in respect of their claim against the defendant which the court would need to resolve at a trial, which are not so hopeless and in respect of which the plaintiffs may prevail at trial, the threshold of demonstrating a serious question or issue to be tried on the merits would have been crossed. This remains the caseeven ifthe plaintiffs may not, at this stage, have the “better of the argument” (ie, a good arguable case) on certain aspects of their claim. 41 In my judgment, the plaintiffs have established that there are serious issues to be tried as far as the merits of their claim are concerned. None of the defendant’s arguments demonstrates otherwise. I turn to consider each of the defendant’s arguments summarised at [28] above. My analysis and conclusions below on the competing arguments are based on the evidence that was before me when SUM 5867 was heard, and the various submissions of the parties in relation to whether the Service Out Order should be set aside. (1) Operational commencement of the “new PT” entity 42 The defendant argued that the operational commencement of the “new PT” entity never took place and therefore, liability under the AOD had not arisen. Whilst it was not disputed that PT API had been incorporated after the AOD was executed, the defendant argued that PT API was not the “new PT” entity envisioned by the parties under the AOD. First, the defendant submitted that the plaintiffs had changed their position on the identity of the “new PT” entity that they were seeking to rely on to prove their claim under the AOD.28Foot Note 28×Certified Transcript (26 February 2020) at p 7 ln 11–23.In a letter written from the first plaintiff to the defendant on 28 September 201829Foot Note 29×1SLSA at p 30.and a letter written from the plaintiffs’ solicitors, TKQP, to the defendant’s solicitors, R&T dated 17 April 2019,30Foot Note 30×ISLSA at p 76 at para 11.the plaintiffs’ position was that the “new PT” entity envisaged in the AOD was PT APP, which had been incorporated on 16 November 2017 “to assume a role similar to that of the PT Entities”. However, and according to the defendant, inexplicably, the plaintiffs’ position changed in the SOC filed on 25 June 2019, where it was pleaded by the plaintiffs that the “new PT” entity was PTAPI, not PT APP.31Foot Note 31×SOC at para 42(c).Second, on the plaintiffs’ case that the defendant incorporated PT API on 11 October 2018 after the plaintiffs terminated the Term Sheet on 28 September 2018, the AOD would no longer be in effect at that latter point. As such, PT API could not have been the “new PT” entity referred to in the AOD. Third, the plaintiffs’ claim that PT API is the “new PT” entity was based on mere speculation that PT API was owned or controlled by the defendant. It could not be the case that the defendant’s liability under the AOD would be triggered as long as any “new PT” entity was set up, even if the business was not related to the PT Entities or the defendant.32Foot Note 32×Defendant’s March Submissions at paras 21, 22 and 23(3). 43 It was also argued by the defendant that incorporation of a “new PT” is different from it having achieved operational commencement. First, based on a company profile exhibited by Schwarz, PT APP had been incorporated on or around 16 November 2017,33Foot Note 33×1st affidavit of Patrick Richard Schwarz dated 19 February 2020 (“1PRSA”) at p 50.beforethe AOD was signed. The AOD however referred to the operational commencement of the “new PT” being foreseeable on 1 July 2018. Thus, “operational commencement” of the “new PT” could not have referred to its incorporation. In addition, the second paragraph of the AOD provided that the defendant was liable for fees “till new PT commences full operational status”, which was a reference to the point in time at which the “new PT” entity had taken over the former franchise business of the PT Entities.34Foot Note 34×Defendant’s March Submissions at paras 16(1)–(2).Third, the defendant argued that correspondence between the parties after the AOD was signed indicated that “operational commencement” involved the “new PT” entering into new franchise agreements with the plaintiffs in place of the PT Entities and carrying on with the PT Entities’ former franchise business.35Foot Note 35×Defendant’s March Submissions at para 18.Thus, even if PT API is the “new PT” entity, it had yet to operationally commence.36Foot Note 36×Defendant’s March Submissions at para 24. 44 Against this, the plaintiffs’ case is that the “new PT” entity referred to in the AOD was originally PT APP. Before the execution of the AOD, the defendant’s representative Sri Siniyati Wijaya had informed representatives of the plaintiffs, Schwarz and Quek, by an email dated 17 April 2018 that the defendant was planning to start PT APP on 1 May 2018. Thus, PT APP was initially intended to be the “new PT” entity referred to in the AOD.37Foot Note 37×Plaintiffs’ February Submissions at paras 27–29; p 16 (Annex A).However, the defendant changed her mind and instead commenced full operations for an entity named PT Maddie Frans Bodiline on 11 October 2018, and later changed that entity’s name to PT API on 4 March 2019, without the plaintiffs’ knowledge. The plaintiffs argued that they have adduced sufficient evidence to show that PT API carried on the business and functions that were originally slated to be performed by PT APP. In particular, the first plaintiff had engaged an Indonesian law firm, TMID Law Firm, to prepare an investigation report on PT API (“TMID Report”). The TMID Report showed that:38Foot Note 38×1QSLA at pp 518–519; Certified Transcript (26 February 2020) at p 21; Plaintiffs’ February Submissions at para 30. (a) PT API had applied to register marks in Indonesia which adopted designs similar to the mark “Marie France Bodyline”. The first plaintiff is the proprietor of the mark “Marie France Bodyline”. In addition, the marks sought to be registered also bear a company name, “Maddie Frans Bodiline”, similar to the names of the first plaintiff’s beauty and slimming clinics,ie, that of “Marie France Bodyline”. PT API had registered these marks for services which the first plaintiff also provides, without the knowledge or permission of the first plaintiff. (b) The director of PT API is one Oey Poh Han (“Oey”), whom the plaintiffs claim is also the director of another entity PT Agro Mas, which in turn holds 50% of the shares in the PT Entities; (c) The majority shareholder holding 90% of the shares in PT API is PT Biotech Indonesia. The plaintiffs claim that the defendant holds 40% of the shares in another entity, PT Zamrud Indonesia, which was used to hold 40% of the shares in PT Biotech Indonesia until 9 October 2018. 45 The plaintiffs argued that the defendant’s liability under the AOD had crystallised when PT Maddie Frans Bodiline (subsequently renamed PT API) commenced full operations on 11 October 2018. Even if PT API’s commencement of operations was insufficient to trigger the defendant’s liability, the plaintiffs submitted in the alternative that it was an implied term under the AOD that the defendant had an obligation to guarantee payment of the arrears owed by the PT Entities to the plaintiffs in the event that the defendant failed, refused and/or neglected to set up the “new PT” entity by 1 July 2018 (ie, the predicted operational commencement date of the “new PT” entity as stated in the AOD).39Foot Note 39×Plaintiffs’ February Submissions at para 31. 46 Having considered the competing arguments, I am satisfied that there are serious issues to be tried. There is at present insufficient evidence that the defendant’s liability to pay underthe AODwould not be triggered if the “new PT” entity was incorporated after the termination ofthe Term Sheet. The AOD states that the fees are due “with the operational commencement of the new PT” with no other qualification; it was not expressed to be conditional on the Term Sheet remaining alive or not being terminated. The plaintiffs do have a case to argue that the defendant is liable under the AOD to pay any outstanding fees due once PT API (as the alleged “new PT”) had been incorporated even if that occurred after the Term Sheet had been terminated. I could not conclude that a claim advanced on this basis was so hopeless that it did not even cross the low threshold of constituting a serious issue to be tried. 47 The defendant also argued that by purporting to terminate the Term Sheet and the commercial relationship between the plaintiffs and the PT Entities,  the plaintiffs would no longer be effecting any transfer of the franchise agreements and/or business from the PT Entities to the “new PT” entity thereafter. Therefore, the “phoenix” scheme that the AOD was meant to facilitate was abandoned at that point.40Foot Note 40×Defendant’s March Submissions at paras 23(2) and 23(3).However, the defendant’s assertions as to the factual background and purpose of the AOD are disputed by the plaintiffs. It is axiomatic that in applications of this nature, factual disputes cannot be determined by the court at this stage of the proceedings based on conflicting affidavit evidence. In this case, evidence of the surrounding circumstances and context are likely to have some relevance on the interpretation of the Term Sheet, the AOD and their respective terms. That exercise cannot be conducted on the basis of affidavit evidence adduced at this nascent stage of the proceedings. 48 Second, based on the TMID Report adduced by the plaintiffs, there is at least some evidence indicating that PT API was linked in some way to the PT Entities and the defendant or had sought to provide services similar to that provided by the PT Entities. It is noteworthy that PT API had applied to register in Indonesia marks similar to those owned by the first plaintiff; the defendant did not specifically deny this in any of her affidavits. 49 Many questions have been left unanswered by both parties on several aspects of their relationship and the current dispute; in addition, the evidence adduced by both sides in SUM 5867 was far from complete and left a number of question unanswered. For example, the termination clause in the Term Sheet refers to the termination of thelicense agreement, but it is not clear on the face of the document whether that refers to the Term Sheet itself, although parties appear to have taken this position in their arguments before me. Much of the plaintiffs’ arguments also hinged on the TMID Report, and the credibility of that report remains to be tested at trial. The plaintiffs acknowledged that the TMID Report was unsigned and undated but submitted that the report does refer to a company named PT API.41Foot Note 41×Certified Transcript (26 February 2020) at p 20 ln 26–30.There is also insufficient evidence in relation to whether PT API had attained “full operational status” and what that entailed. Further, there are also the questions of whether the parties intended the “new PT” in the AOD to be a reference only to PT APP and what, if any, was the significance of the 1 July 2018 date stated in the AOD as the operational commencement date of the “new PT” entity. 50 For the purposes of my decision, I took into account the evidence adduced by the plaintiffs in the TMID Report. Apart from arguing that it was unsigned and undated, the defendant did not adduce any positive evidence to rebut the contents of the TMID Report, when information about the operations of PT API was, in my view, more likely than not to be within the defendant’s knowledge. As the plaintiffs submitted, the defendant did not positively assert in her affidavits that PT API did not commence operations concurrently with its incorporation. Nor did she procure an affidavit from Oey to that effect.42Foot Note 42×PRFS at para 10(a).There is also some merit in the plaintiffs’ submission that they could obtain further information about PT API in due course during the process of discovery.43Foot Note 43×Certified Transcript (26 February 2020) at p 21 ln 23–26. 51 As for the identity of the “new PT”, I took note of the fact that the parties dispute the background to and the purpose of the AOD. Given the imprecision in the wording of the AOD and the Term Sheet, it is likely, at least as a matter of Singapore law, that evidence of surrounding circumstances and context may well be relevant and necessary to aid in the interpretation of these documents and their terms. While the plaintiffs will no doubt have to explain the change in their position on the identity of the “new PT” from PT APP to PT API, on the evidence before me, I cannot conclude that the plaintiffs’ claim is so hopeless that it does not raise any serious issue to be tried. Similarly, the alternative argument by the plaintiffs that a term is to be implied in the AOD that the AOD would be enforceable if the “new PT” entity was not set up on or before 1 July 2018 is also not so hopeless such as to raise no serious issue to be resolved at trial. (2) Ambiguity of parties to the AOD 52 The defendant argued that the parties to the AOD are ambiguous. First, the fact that the AOD was signed by the “Global Beauty Group” was fatal to the plaintiffs’ case as a group of companies is not a legal person capable of entering into a contract. Relying onMax-Sun Trading Ltd and another v Tang Mun Kit and another (Tan Siew Moi, third party)[2016] 5 SLR 815 (“Max-Sun Trading”) at [48], counsel for the defendant argued that the parties to the AOD were too uncertain for it to be valid. Second, whilst the Term Sheet refers to “agreements”, no evidence has been provided as to who exactly the parties to these agreements are. Third, the plaintiffs and their related companies had not finalised the parties who were meant to enforce the Term Sheet and/or the AOD, and have in correspondence referred to monies being owed to “GBI”,ie, “Global Beauty International Ltd”.44Foot Note 44×Defendant’s March Submissions at paras 31–38; Certified Transcript (26 February 2020) at pp 5–6. 53 The plaintiffs argued that the present case can be distinguished from the facts inMax-Sun Trading.In that case, which was decided after trial, the terms and the parties to the alleged contract (which was oral) were clearly uncertain. This is to be contrasted with this case, where “CCA and its affiliated companies” was specifically referred to in the text of the AOD. The AOD also expressly refers to the Term Sheet, where the parties were also identified. The Term Sheet further sets out the franchise, licencing and technical assistance agreements between the parties.45Foot Note 45×Certified Transcript (26 February 2020) at p 22 ln 11–19. 54 I acknowledge that the Term Sheet and AOD are not well-drafted and the terms in both these documents have been vaguely defined. The defendant pointed out that the Term Sheet refers to the agreement as being entered into by the first plaintiffand its related entitiesbut did not specifically name the second to fourth plaintiffs. The defendant also claimed that the second to fourth plaintiffs are not parties to the Term Sheet as their representatives did not sign the Term Sheet.46Foot Note 46×1QSLA at p 410; Defendant’s March Submissions at para 35(2).The defendant further argued that the agreements referred to in the Term Sheet were entered into on “1 October 1994, 30 June 1995 and 30 June 1995” between the first plaintiff and PTCSU, PTHP and PTCU respectively,47Foot Note 47×1QSLA at p 408.but the Agreements referred to in the plaintiffs’ affidavit supporting theexparteleave application were entered into on 7 June 1995;48Foot Note 48×1QSLA at paras 22 and 23; Defendant’s March Submissions at para 36this discrepancy prompted the defendant’s counsel to argue that the agreements mentioned in the Term Sheet relied on by the plaintiffs were “phantom agreements”. During oral arguments before me, plaintiffs’ counsel pointed to theeffective datesof the Agreements, giving examples of three agreements between the first plaintiff and PTCSU,49Foot Note 49×1QSLA at p 69.PTHP50Foot Note 50×1QSLA at p 161.and PTCU51Foot Note 51×1QSLA at p 117.whoseeffective dateswere 1 October 1994, 30 June 1995 and 30 June 1995 respectively. The plaintiffs therefore submitted that the dates referred to in the Term Sheet referred to theeffective datesof the Agreements; as such, the agreements referred to in the Term Sheet are in fact the Agreements entered into between the plaintiffs and the PT Entities.52Foot Note 52×Certified Transcript (26 February 2020) at p 16.Against this, the defendant argued that the Term Sheet referred to these dates as dates on which the agreements wereentered into, and not theireffective dates. Further, save for one agreement, the expiry dates of the agreements as stated on the Term Sheet and the Agreements also do not match, thereby strengthening the defendant’s arguments that the Term Sheet referred to phantom agreements.53Foot Note 53×Defendant’s March Submissions at para 37; Annex A to the Defendant’s March Submissions. 55  However, and notwithstanding the points mentioned in [54] above, there is some evidence that the Term Sheet, AOD and the Agreements are indeed linked. On the defendant’s own case,theAgreementsweresupersededby the Term Sheet,54Foot Note 54×Defendant’s February Submissions at para 5.and the AOD was created because a “new PT” entity was to be incorporated and the PT Entities were envisaged to transfer or hand over their Indonesian franchises to the “new PT” entity.55Foot Note 55×Defendant’s February Submissions at para 7.I also noted that the defendant’s arguments in relation to the ambiguity of the parties to the AOD were raised somewhat belatedly only at the hearing before me. It was not an issue that the defendant raised in any of her affidavits for SUM 5867. Nor was it a point made by the defendant in any of the fairly extensive correspondence exchanged between the parties’ solicitors prior to the commencement of S 617. 56 The defendant stated, in her first affidavit filed on 22 November 2019, that the Term Sheet served a “bridging function” as a number of the Agreements had expired and the plaintiffs were in the midst of negotiating the terms of new franchise agreements that would supersede the Term Sheet. It was therefore agreed that during this interim period, the PT Entities could continue using the plaintiffs’ franchise/ brand and that the plaintiffs would continue to provide the services that it had been providing to the PT Entities under the Agreements.56Foot Note 56×1SLSA at para 8.In my view, this was at the least an implicit acknowledgement that the Term Sheet was entered into between the plaintiffs and the PT Entities. 57 Further, the defendant also stated in the same affidavit at [11] that as the liquidation of the PT Entities was being contemplated,the plaintiffswere concerned that they “would have no one to turn to in connection with any monies owing under the Interim Arrangements clause when the PT Entities are liquidated”. According to the defendant, it was in these circumstances thattheplaintiffsrequested her to sign the AOD. Again, this was, in my view, at least an implicit acknowledgement by the defendant that the AOD was a document signed by her and the plaintiffs. 58 The defendant again repeated her position in her second affidavit filed on 17 January 2020, where she stated at [13] that: … As I explained [in the defendant’s 1st affidavit] … it was contemplated that the sums whichthe Plaintiffsowed the PT Entities would be set off against the sums which the PT Entities owedthe Plaintiffs.This was why the AOD stated… expressly that “should there be any amounts outstanding and agreed upon, it will be offset against the total owing amount by the creditor to [the first plaintiff] and its affiliated companies”.Indeed, I should also point out that the AOD defines the “creditor” to mean [PTSU], [PTCU], and [PTHP] (i.e. the PT Entities)”. [emphasis in original removed; emphasis added in italics] 59 Put another way, there was nospecificdenial by the defendant in any of her affidavits in support of SUM 5867 that the plaintiffs were parties to the AOD and the entities who could assert a claim against the defendant under the AOD. I had also alluded to the extensive correspondence exchanged by the parties’ solicitors prior to the commencement of S 617. The defendant’s solicitors were at pains to point out to the plaintiffs’ solicitors the defendant’s defences to the claim, but in none of the correspondence spanning several months did the defendant ever raise any issue about the plaintiffs not being parties to the AOD or that the AOD was void for uncertainty of parties. 60 The case ofMax-Sunrelied on by the defendant does not assist her. First,Max-Sunwas not an O 11 case but a case that was decided after trial. Second, the facts inMax-Sunare quite different to those in the case before me. For one, the contract alleged to have been concluded inMax-Sunwas oral. At this stage of the matter, all I need to be satisfied is whether the plaintiffs’ claim that they are parties to the AOD was so hopeless or frivolous as to be doomed to failure. I was far from satisfied that this was the case. 61 Lastly, I also note that the defendant, while arguing that the burden remains on the plaintiffs to demonstrate that all the requirements for leave to serve out have been met, was conspicuously silent on who, in her view, the parties to the AOD are. More specifically, the defendant does not say to whom she was agreeing to undertake personal liability when she signed the AOD. 62 For the foregoing reasons, I disagree that there is no serious issue to be tried on whether the plaintiffs are parties to the AOD or whether the AOD is void for uncertainty. (3) AOD is void under Indonesian law and/or is not supported by valid consideration 63 For the reasons which are detailed below at [73] to [119], I have concluded that the governing law of the AOD isSingapore law. In the circumstances, the defendant’s argument that the claim had no merits, as the AOD was governed by Indonesian law and would therefore be null and void and unenforceable under Indonesian law, is not made out. 64 The defendant’s alternative argument is that even if the AOD is governed by Singapore law, it would be unenforceable as the AOD is not supported by consideration. The defendant contends that no evidence has been adduced by the plaintiffs to show that they had exercised forbearance from commencing legal proceedings against the PT Entities in exchange for the execution of the AOD by the defendant.57Foot Note 57×Defendant’s February Submissions at para 29.Rather, the AOD was signed by the defendant purely to facilitate the “phoenix scheme”.58Foot Note 58×Certified Transcript (19 March 2020) at p 3 ln 20–21. 65 These arguments can be dealt with briefly. First, whether the AOD had been signed by the defendant in exchange for the plaintiffs’ forbearance in suing the PT Entities on the sums (if any) owed to the plaintiffs under the Term Sheet is a disputed factual issue that would need to be determined at trial. Second, the plaintiffs argued that forbearance to sue as consideration may be implied. While the defendant argued to the contrary, the plaintiffs’ contentions were, again, not so hopeless such as to demonstrate an absence of any serious issue to be tried on this point. On the contrary, there were substantial issues of fact and/or law on the lack of consideration point to be determined at trial. The court should not express any premature opinion at this stage of the proceedings. Conclusion on the merits of the plaintiffs’ claim 66 In conclusion, I disagreed with the defendant’s contentions that the merits of the plaintiffs’ claim are so weak that they raise no serious issues or questions to be tried. While there may be (and I would put it at no higher than that) some aspects of the plaintiffs’ claim that are less robust than others, overall, this is not a claim that has been shown to be so hopeless or doomed to failure as to warrant the setting aside of the Service Out Order. In my judgment, the plaintiffs’ claim has a sufficient degree of merit and thus, this requirement has also been satisfied by the plaintiffs.",
        "The natural forum requirement": "67 I turn next to the natural forum requirement.The plaintiffs bear the burden of showing that Singapore is the more appropriate forum to hear the dispute. The principles that apply in determining the appropriate forum in the context of a service out application are well-known and have been reiterated in a number of Court of Appeal decisions, includingOro Negroat [80(c)]: The inquiry for determining whether Singapore was the more appropriate forum in the context of service out applications was the same as that undertaken at thefirststage of theSpiliadatest (Zoom Communications([54]supra) at [70]). Consequently, Singapore would be the more appropriate forum if it had the most real and substantial connection with the disputes raised (JIO Minerals FZC v Mineral Enterprises Ltd[2011] 1 SLR 391 (“JIO Minerals”) at [38]). The court would weigh the connecting factors that had the most relevant and substantial associations with the dispute rather than undertake a mechanical application of established connecting factors. It would also be primarily concerned with thequalityof the connecting factors rather than the quantity of factors on each side of the scale (JIO Mineralsat [41];Rappo, Tania v Accent Delight International Ltd[2017] 2 SLR 265 at [70];Lakshmi AnilSalgaocar v Jhaveri Darsan Jitendra[2019] 2 SLR 372 (“Lakshmi AnilSalgaocar”) at [54]). [emphasis in original] 68 In this regard, it is also clear that in assessing whether Singapore is the natural forum, it does not matter whether Singapore is the natural forum by a hair or by a mile (Oro Negroat [80(b)]). 69 Five broad categories of relevant connecting factors have been identified inJIO Minerals FZCand others v Mineral Enterprises Ltd[2011] 1 SLR 391 (“JIO Minerals”) (at [42]) to guide a court in its identification of the natural forum, namely, the personal connections of the parties and the witnesses; the connections to relevant events and transactions; the applicable law to the dispute; the existence of proceedings elsewhere; and the shape of the litigation. 70 The parties have raised the following factors to be considered in the analysis:59Foot Note 59×Table of Connecting Factors at Annex A to PRFS. (a) governing law and place of performance of the AOD; (b) witness compellability; (c) existence of parallel proceedings; (d) availability of documentary evidence; (e) domicile of parties; (f) location where the AOD was signed; (g) currency used; and (h) commercial purpose of the AOD. 71 As re-emphasised inOro Negro, the court is concerned with thequalityrather than quantity of the connecting factors; simply put, it is not a “ mechanical numbers game” and the court should take into account “the entire multitude of factors” (Lakshmi AnilSalgaocar v Jhaveri Darsan Jitendra[2019] 2 SLR 372 (“Lakshmi AnilSalgaocar”) at [54]). In a similar vein, the court should not apply and assess the connecting factors in a mechanical fashion; instead, “greater weight should be ascribed to factors that are likely to be material to a fair determination of the dispute” (MAN Diesel & Turbo SEat [128]). The “lodestar for a court tasked with identifying the natural forum is whether any of the connections point towards a jurisdiction in which the case may be ‘tried more suitably for the interests of all the parties and for the ends of justice’” (Rappo, Tania v Accent Delight International Ltd and another and another appeal[2017] 2 SLR 265 (“Rappo”) at [72]). 72 Bearing in mind the principles summarised above and for the reasons articulated below, I am of the view that Singapore is the clearly more appropriate forum in which the plaintiffs’ claim against the defendant should be tried. Qualitatively, the more relevant factors to consider in this case are (a) the governing law of the AOD, (b) witness compellability and (c) the existence of parallel or related proceedings. Governing law of the AOD 73 In my judgment, the most relevant and significant connecting factor in the present dispute is the governing law of the AOD. The crux of the dispute involves the interpretation of the terms in the AOD (and to an extent, the Term Sheet) and whether the AOD can be enforced by the plaintiffs against the defendant to recover monies alleged to be owed under it. 74 The defendant argues that if Singapore law is the governing law of the AOD, that should not be a significant factor because there would be no complex legal issues at play, citingCIMB BankBhd v Dresdner Kleinwort Ltd[2008] 4 SLR(R) 543 (“DresdnerKleinwort”). The defendant contends that the plaintiffs had not pointed to any legal issue arising from Singapore law whichthe Indonesian courtswould find difficulty in adjudicating. If Singapore law applied, the main issues in the dispute would, according to the defendant, be factual. In contrast, should Indonesian law govern the AOD, the issues of Indonesian law at play would be complex. As such, if Indonesian law is found to govern the AOD, it should be a significant factor pointing toward Indonesia being the appropriate forum.60Foot Note 60×Defendant’s March Submissions at paras 49–54. 75 It is well-settled that the relevance of choice of law considerations in a jurisdictional enquiry regarding the natural forum to determine a dispute “lies in the general proposition that where a dispute is governed by a foreignlexcausae, the forum would be less adept in applying this law than the courts of the jurisdiction from which thelexcausaeoriginates”. Whilst the court of one jurisdiction can apply the laws of another country, there will “clearly be savings in time and resources if a court applies the law of its own jurisdiction to the substantive dispute” (Rickshaw Investments Ltd and another v Nicolai Baron vonUexkull[2007] 1 SLR(R) 377 (“Rickshaw Investments”) at [42]). 76 InDresdnerKleinwort, the court held that in that case, Singapore law on unjust enrichment was similar if not identical to the prevailing law in England, such that the Singapore courts would be well able to apply English law without the aid of foreign law experts. On that basis, the court found that even if the agreement in question were governed by English law, that factor would not be of much significance (at [63]). In contrast, inRickshaw Investments, the court considered that even where a party fails to adduce proof of foreign law, the court may have regard to the fact that the principles in the foreign jurisdiction concerned will, in all likelihooddiffer fromthelexforiin some respects (at [43]). 77 In the present case, it is not the defendant’s case that there are no material differences between Indonesian law and Singapore law as applied to the AOD. Indeed, on the defendant’s own case, the AOD is governed by Indonesian law and would benull andvoidunder Indonesian law by virtue of the Indonesian language law which mandates contracts involving Indonesian parties to be in Bahasa Indonesia. Further, the evidence of the defendant’s Indonesian law expert, as set out in in the 2nd Supplemental Legal Opinion of Paul Antonius Sitepu (“Sitepu”), is that the AOD would be annulled by virtue of the Indonesian language laweven ifthe governing law of the contractis Singapore law.61Foot Note 61×3rd affidavit of Paul Antonius Sitepu at pp 11–13.Thus, if I accept Sitepu’s evidence as correctly setting out the position under Indonesian law, then even on the defendant’s case, the question of whether the Indonesian courts would be able to apply Singapore lawwould not even ariseif the forum to determine the dispute were to be Indonesia, since the AOD would be considered null and void for violating the Indonesian language law. It appeared to me therefore that the issue of whether the Indonesian courts would be able to apply Singapore law was entirely moot, on the defendant’s own case. I did not, therefore, place much weight on this argument in my analysis. 78 Further, even if the Indonesian courts would seek to apply Singapore law on the basis that the AOD was governed by Singapore law, the Indonesian courts would have to determine the interpretation and enforceability of the AOD in accordance with Singapore law. For example, whether evidence of negotiations and/or discussions leading up to the execution of a personal guarantee is relevant to and admissible in the interpretation of an agreement was an issue identified by the defendant’s Indonesian law expert.62Foot Note 62×2nd affidavit of Paul Antonius Sitepu dated 18 January 2020 (“2PASA”) at pp 12–13.Similarly, there may be other legal questions that are likely to arise in the interpretation of the AOD under Singapore law which the Indonesian courts would have to grapple with; one example would be the issue of implication of terms into the AOD. A further example would be the concept of valid consideration for a contractual bargain and implied forbearance constituting valid consideration. It is therefore incorrect for the defendant to assert that even if Singapore law governed the AOD, the issues to be determined by the Indonesian courts would largely be factual issues. As such, if I find that the AOD is governed by Singapore law, it would be a significant factor pointing to Singapore as the clearly more appropriate forum to determine the dispute. 79 The principles that govern the determination of the governing law of a contract may be found in the Court of Appeal’s oft-cited decision inPacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”) at [36], citingOverseas Union Insurance Ltd vTuregum Insurance Co[2001] 2 SLR(R) 285 at [82]: There are three stages in determining the governing law of a contract. The first stage is to examine the contract itself to determine whether it states expressly what the governing law should be. In the absence of an express provision one moves to the second stage which is to see whether the intention of the parties as to the governing law can be inferred from the circumstances. If this cannot be done, the third stage is to determine with which system of law the contract has its most close and real connection. … 80 InPacific Recreation, the Court of Appeal noted at [46]–[47] that if the court were faced with a “multiplicity of factors, each pointing to a different governing law” such that the parties’ intentions as to governing law cannot be “realistically inferred”, the proper and “more productive” approach would be to move straight to the third stage of the analysis. The court also held at [48] that: The difference between the second stage and the third stage lies not in the factors to be taken into consideration, but in the weight which is to be accorded to these factors.It is worth emphasising that the aim of the third stage is not to divine any “intent” of the parties,but to consider, on balance,which law has the most connection with the contract in question andthe circumstances surrounding the inception of the contract.It is a pragmatic exercise acknowledging that parties do not always have a governing law in mind when theyenter into contracts.Equal weight ought to be placed on all factors, even those which would not, under the second stage, have been strongly inferential of any intention as to the governing law. [emphasis added in italics and bold italics] 81 The factors that a court can take into account at the second and third stages of the test inPacific Recreationare non-exhaustive. InLas Vegas Hilton Corp (trading as Las Vegas Hilton) v Khoo Teng Hock Sunny[1996] 2 SLR(R) 589, Chao Hick Tin J (as he then was) opined at [45] that many factors may be taken into account to determine the question of which governing law has the “closest and most real connection” to a contract, the “main ones[being] the place of contracting, the place of performance, the places of residence or business of the parties respectively; and the nature and subject matter of the contract” [emphasis added]. 82 InHalsbury Laws of Singapore, the following factors to be considered in the second stage were identified: whether the parties have agreed to a choice of court of a particular country; whether they have agreed to arbitration in a particular forum; the language or terminology used in the contract; the form of the documents used in the transaction; whether there are other connected transactions; whether they have specified a currency of the contract or the currency for payment; the places of residences of the contracting parties; and the commercial purpose of the transaction (at para 75.346). The factors to be considered at the third stage are “practically the same” as those considered in the second stage, although the weight accorded to the factors may not be the same. The authors ofHalsbury Laws of Singaporealso note (at para 75.347) that the place of performance is “ordinarily a highly relevant connection” at the third stage. 83 The defendant argued that the following factors pointed toward Indonesian law being either the inferred choice or the objective proper law of the AOD:63Foot Note 63×Defendant’s March Submissions at para 55. (a) Under the AOD, the defendant acknowledged that she would be personally liable for the Technical Assistance, License and Royalty Fees incurred by the PT Entities which are all based in Indonesia; (b) The defendant is an Indonesian citizen based in Indonesia; (c) Indonesian Rupiah is specified as the currency under the AOD; and (d) Liability under the AOD concerns transactions or events that took place in Indonesia, namely the operational commencement of the “new PT” entity, the fees payable by the PT Entities and facilitation of the “phoenix scheme” in Indonesia. 84 The plaintiffs argued that the AOD is governed by Singapore law. They contend that parties could not have intended the AOD to be governed by a system of law (ie, Indonesian law) which would render the agreement null and void. As the defendant claimed to be more familiar with Indonesian law than Singapore law, she could not now justify why the parties would have intended the AOD to be governed by Indonesian law, knowing that the AOD would be null and void under it.64Foot Note 64×PRFS at paras 2–4.Further, the AOD also did not state the exact amount of debt to be paid and was not made in the form of a notarial deed executed before a notary public, and both of these factors would render the guarantee unenforceable under Indonesian law. If parties had intended the AOD to be governed by Indonesian law, they would not be taken to have intentionally used forms and terms that would render it unenforceable under that law.65Foot Note 65×Plaintiffs’ February Submissions at para 34(c)–(d); 2nd affidavit of Dewi Savitri Reni dated 28 January 2020 at pp 9–10.In addition, the Royalty Fees, License Fees and Technical Assistance Fees set out under the Agreements between the plaintiffs and the PT Entities, for which the Term Sheet was entered into to amend and secure the payments thereof, contain express terms that they are governed by Singapore law.66Foot Note 66×1QSLA at pp 100 (cl 16(A)); 147 (cl 16(A)); 192 (cl 16(A)); 224 (cl 11(A)); 274 (cl 11(A)); 311 (cl 11(A)); 349 (cl 9(A)); 373 (cl 9(A)); 396 (cl 9(A)).As the Term Sheet is closely linked to the AOD, the parties would have intended for the various agreements including the AOD to have been governed by Singapore law.67Foot Note 67×Plaintiffs’ February Submissions at para 34(a); Certified Transcript (26 February 2020) at p 16. 85 The plaintiffs further submitted that the evidence showed that parties had intended for Singapore law to govern the AOD, for the following reasons: (a) The commercial purpose of the AOD is for the defendant to personally secure the payment of monies due and owing from the PT Entities to the plaintiffs and for such monies to be paid in Singapore. The plaintiffs disagreed that the commercial purpose of the AOD was to facilitate the “phoenix scheme” although it may have provided the factual backdrop to it.68Foot Note 68×Plaintiffs’ Reply Submissions dated 14 April 2020 (“Plaintiffs’ April Reply Submissions”) at para 5(a). (b) The place of performance of the AOD is Singapore. The fees due under the Term Sheet and the AOD were to be paid to the plaintiffs, which were either Singapore-incorporated companies (the second to fourth plaintiffs) or a BVI-incorporated company that operated out of Singapore (the first plaintiff). Accordingly, Singapore is the place of performance of the personal guarantee given by the defendant by way of the AOD.69Foot Note 69×Plaintiffs’ Aide-Memoire dated 26 February 2020 at p 2; PRFS at para 4.In response to this, the defendant claimed that the first plaintiff was the sole contracting party under the Term Sheet. Therefore, as the first plaintiff was a BVI-incorporated company and in the absence of evidence to the contrary, the defendant’s obligation, if any, to pay under the AOD would be to seek out the first plaintiff and pay it in the BVI.70Foot Note 70×Defendant’s March Submissions at para 44. (c) “Singapore, 18 May 2018” was stated at the bottom of the AOD before the signature blocks, which indicated that parties had wanted to make clear that the AOD was deemed to have been signed in Singapore, even though the defendant might have signed it outside of Singapore.71Foot Note 71×Plaintiffs’ February Submissions at para 34(b). 86 In my judgment, the governing law of the AOD is Singapore law. In the following paragraphs, I shall explain why I have come to this conclusion. 87 First, it was undisputed that the AOD contained no express reference to a governing law. Second, given the multiplicity of factors raised by the parties and that they pointed one way or another, I decided that the sensible and pragmatic course to take in this case was to move straight to the third stage of thePacific Recreationtest to determine the law which has the closest and most real connection with the AOD and the circumstances surrounding its inception. This test is an objective analysis undertaken from the perspective of a reasonable person in the position of the parties at the time of the contract (Rappoat [80]; see alsoPacific Recreationat [49]). (1) Choice of law in related agreements 88 I first consider the plaintiffs’ submission that the AOD and Term Sheet are governed by Singapore law, on the basis that they concern the payment of fees under the Agreements which themselves are expressly governed by Singapore law.72Foot Note 72×1QSLA at para 68; Plaintiffs’ February Submissions at para 34(a). 89 In response to the plaintiffs’ submission, the defendant argued that the Term Sheet was an independent contract which did not incorporate the terms of the Agreements. Leaving aside the defendant’s contention that the agreements referred to in the Term Sheet may not be the Agreements dated in 1995, the defendant submitted that the Agreements had in any event expired and therenewedagreements signed in June 2005 adduced by the plaintiffs in evidence provided forIndonesian lawas the express governing law. Further, as the Term Sheet was an agreement entered into between the first plaintiff and the PT Entities in relation to the PT Entities’ business in Indonesia, the objective proper law of the Term Sheet is Indonesian law.73Foot Note 73×Defendant’s March Submissions at para 62. 90 In my view, there is merit to the defendant’s argument that the renewed agreements between the plaintiffs and the PT Entities provided for Indonesian law to be the governing law. The defendant referred to three documents exhibited to Quek’s fourth affidavit:74Foot Note 74×4th affidavit of Quek Swee Li dated 11 March 2020 (“4QSLA”). (a) a franchise agreement dated 1 July 2005 between the first plaintiff and PTCU (the “2005 franchise agreement”); (b) a trademark license agreement dated 1 July 2005 between the first plaintiff and PTCU (the “2005 trademark license agreement”); and (c) a technical assistance agreement dated 1 July 2005 between the third plaintiff and PTCU (the “2005 technical assistance agreement”). (collectively, the “2005 PTCU Agreements”) 91 I note that the previous franchise agreement dated 7 June 1995 between the first plaintiff and PTCU (the “1995 franchise agreement”) was set to expire on 30 June 2005;75Foot Note 75×1QSLA at p 117.the trademark license agreement between the same parties dated 7 June 1995 (the “1995 trademark license agreement”) was set to expire on 30 June 2005;76Foot Note 76×1QSLA at p 264.and the technical assistance agreement dated 7 June 1995 also between the same parties (the “1995 technical assistance agreement”) was similarly set to expire on 30 June 2005.77Foot Note 77×1QSLA at p 369.The 2005 franchise agreement expressly referred to the 1995 franchise agreement and stated that the former was meant to renew the rights and franchise granted under the latter (at recitals (A)–(C)).78Foot Note 78×4QSLA at p 7.Similarly, the 2005 trademark license agreement referred to the 1995 trademark license agreement and stated that the former was meant to renew the rights to use the relevant marks granted under the latter (at recitals (A)–(D));79Foot Note 79×4QSLA at p 43.and the 2005 technical assistance agreement referred to the 1995 technical assistance agreement and stated that it was meant to allow for the continuation of provision of technical assistance as given under the latter (at recitals (A)–(C)).80Foot Note 80×4QSLA at p 56.These latter agreements all expressly stipulated Indonesian law as their governing law.81Foot Note 81×4QSLA at pp 31 (cl 16.1); 44 (cl 11); 65 (cl 9.1).Apart from the 2005 PTCU Agreements, the plaintiffs did not adduce evidence of any similar agreements involving PTCSU and PTHP even though presumably, such similar agreements exist and would contain similar choice of law clauses. As against this, the plaintiffs’ case is that the Term Sheet refers to the Agreements entered into in1995, which expressly stipulated Singapore law as their governing law. 92 I note that there are other gaps in the evidence. The 2005 PTCU Agreements were set to expire in 2015, and it is unclear if there was any subsequent renewal of those agreements. As I mentioned at [91], it is also unclear if the other agreements signed in 1995 with PTCSU and PTHP had also been renewed. In any event, leaving aside these gaps, all of these agreements were entered into between the relevant parties quite some time prior to the execution of the AOD on 18 May 2018. Thus, this factor of itself does not assist to determine whether Singapore law or Indonesian law would have the closest and most real connection to the AOD. (2) Invalidating effect of Indonesian law 93 In relation to the plaintiffs’ submission that the parties could not have intended the AOD to be governed by Indonesian law as it would be rendered null and void, the defendant submitted that she was unaware of the invalidating effect of Indonesian law on the AOD. The defendant referred toBNA v BNB[2020] 1 SLR 456 (“BNA v BNB”), where the respondents in that case sought to advance the argument that the parties could not have intended Shanghai to be the seat of the arbitration as the arbitration agreement would be void under Chinese law. The Court of Appeal held (at [90]) that for the respondents to make such an argument, they had to show that the parties were, at the very least,awareat the time of contracting that the choice of proper law of the arbitration agreement could have an impact on the validity of the agreement. On the facts in that case, the evidence suggested no such consideration operated on the minds of the parties. The defendant submitted that the argument made by the plaintiffs in the present case is analogous to that made by the respondents inBNA v BNB. 94 I accept that there is insufficient evidence before the court to indicate that at the point of entering into the AOD, the parties were aware of or had applied their minds to the possibility that the AOD would be void or unenforceable under Indonesian law. As such, I am unable to draw the conclusion that parties intended for the AOD to be governed by a system of law other than Indonesian law because of its otherwise invalidating effect on the AOD. (3) Place of performance of the AOD 95 The plaintiffs argued that the place of performance of the AOD is Singapore. According to the plaintiffs, the fees under the Agreements and the Term Sheet from the PT Entities to the plaintiffs were typically paid into bank accounts in Singapore, as there were payments made to Global Beauty International Pte Ltd, a company incorporated in Singapore and which was part of the same group of companies as the plaintiffs.82Foot Note 82×PRFS at footnote 5.In support of this position, the plaintiffs exhibited three invoices issued by Global Beauty International Pte Ltd to the PT Entities.83Foot Note 83×2nd affidavit of Quek Swee Li dated 23 September 2019  at pp 36–38.The first plaintiff operated in Singapore although it was incorporated in the BVI, and the second to fourth plaintiffs were incorporated in Singapore.84Foot Note 84×Plaintiffs’ February Submissions at para 52; PRFS at pp 15–16; Certified Transcript (26 February 2020) at p 25 ln 22–24.Thus, Singapore was the place where the defendant should seek out the plaintiffs as her creditors. 96 The defendant submitted that the plaintiffs’ arguments ignored the fact that the first plaintiff is incorporated in the BVI, such that even on the plaintiffs’ case, the defendant could make payment to the first plaintiff in the BVI. There is also no evidence that the first plaintiff operated or carried on business in Singapore.85Foot Note 85×Defendant’s March Submissions at paras 43–44. 97 Having considered the rival contentions, I agree with the plaintiffs that the place of performance of the AOD is Singapore. Following from this, any cause of action against the defendant based on the AOD would also have arisen here. 98 The general rule at common law is that a debtor’s payment obligations are to be performed at the place of the creditor’s residence (seeHalsbury Laws of Singaporeat para 75.347, n 9). As set out inThe Eider[1893] P 119 (“The Eider”) (at 131), the “ordinary rule” is that “the debtor must follow his creditor, and must pay where his creditor is” (perLord Esher MR). 99 InEFG Bank AG, Singapore Branch v Teng Wen-Chung[2017] SGHC 318 (“EFG Bank”) at [55]–[56], George Wei J held, in the context of a summary judgment application, that the place of performance of a loan agreement was where payment was to take place. InEFG Bank(at [56]), the court referred toDicey, Morris & Collins on The Conflict of Laws(Lord Collins of Mapesbury gen ed) (Sweet & Maxwell, 15th Ed, 2012) at para 11-197 for “[t]he general rule … that where no place of payment is specified … the debtor must seek out his creditor”. 100 The position inEFG Bankwas adopted by the Singapore International Commercial Court inBNP Paribas SA v JacobAgam and another[2018] 4 SLR 57 (“JacobAgam”). InJacobAgam, Vivian Ramsey IJ had to decide whether the case before him was an “offshore case” which “had no substantial connection with Singapore”. At [26]–[28], Ramsey IJ held, adopting the reasoning inEFGBank, that the place of payment under the guarantees in question in that case would be the place of the creditor, which was Singapore. On that basis, the court held that Singapore was the place of the performance of the guarantees in question in that case. 101 The general rule that it is the duty of a debtor to seek out his creditor in the absence of any agreement to the contrary is well-settled and has been accepted in a number of jurisdictions (see,eg,Arab Bank Ltd v Barclays Bank (Dominion, Colonial and Overseas)[1954] AC 495 at 531, where the House of Lords held that “generally it is the duty of a debtor to seek out his creditor and tender the amount of his debt”, although there was nothing to stop the parties from agreeing otherwise; inCoates v Charles Porter & Sons Pty Ltd(1990) 2 ACSR 733 at 735–736, where the Supreme Court of Western Australia found that it was an implied term of a quasi-contract that payments were to be paid to the liquidator at his ordinary place of business and residence, following the general rule that where a contract is silent as to place of payment, the debtor is to seek out the creditor and the debt is payable where the creditor is found). It follows from this general rule that the place of performance of monetary payment obligations would, where the contract is silent, be the creditor’s place of business. 102 On the facts of the present case, the place of performance of the AOD would, in my judgment, be Singapore. The available evidence pointed to payments being made, and the plaintiff’s business being based, in Singapore. The plaintiffs contended that they typically received payment from the PT Entities through their bank accounts in Singapore and adduced some evidence in support (see [95] above). In contrast, the defendant did not assert or produce any evidence that she or any of the PT Entities had ever dealt with the first plaintiff in the BVI or made any payments to the first plaintiff in the BVI. The defendant’s argument onThe Eiderprinciple was that she could seek out the first plaintiff in the BVI since it was incorporated there; however, as stated above, the scope of the general rule inThe Eideris that the debtor should seek out the creditor at its place of business, and there was no suggestion from the defendant that the plaintiffs did not carry on business in Singapore. Nor was there was any evidence of a history of past transactions betweenthe defendantandthe plaintiffswherethe defendanthad made payments to the plaintiffs otherwise than in Singapore. Based on the evidence before me, the defendant’s personal guarantee under the AOD was the first and only “transaction” between the defendant personally and the plaintiffs. 103 In addition, there was other evidence that indicated that Singapore was the plaintiffs’ place of business or at least their primary place of business. For example, it is undisputed by the defendant that shortly before the AOD was signed, there were meetings and in-person negotiations that took place in Singapore in or around May 2018 between theplaintiffs’ Singapore-based representativesand the defendant. There were also affidavits affirmed on behalf of the plaintiffs in these proceedings by Quek and Schwarz. Quek described herself in her affidavits as a director of all of the plaintiffs and was based in Singapore.86Foot Note 86×1QSLA at p 2.Schwarz described himself as the Chief Financial Officer of all of the plaintiffs, and was also based in Singapore.87Foot Note 87×1PRSA at p 1.I also refer to the points I make below at [116]–[118] on the currency of payment. Thus, this was not a case bereft of any evidence whatsoever indicating that Singapore was the plaintiffs’ place of business. As I mentioned above at [98], the general rule inThe Eideris applicable here since there is no express term in the AOD as to where payment was to be effected by the defendant. In my judgment, the available evidence supported the conclusion that payment by the defendant of any sums due to the plaintiffs under the AOD was to be made in Singapore. I note here in passing that a recent judgment of the Court of Appeal which was released after I rendered my decision in SUM 5867 supports the conclusions I have reached at [102]–[103] above – seeRecovery Vehicle 1 Pte Ltd v IndustriesChimiques Du Senegal and another appeal and another matter[2021] 1 SLR 342 at [84]–[85] and [88]. 104 That the place of performance by the defendant of her obligations under the AOD was Singapore would support the plaintiffs’ case that Singapore law has the closest and most real connection to the AOD and the circumstances surrounding its inception. 105 Before I leave this issue, I would refer to the case ofBunge SA and another v Indian Bank[2015] SGHC 330 (“Bunge”), which further buttresses the conclusion I have reached on the significance of theplace of performanceof a party’s contractual obligation to the issue of determiningthe governing lawof that contract. 106Bungeinvolved an application to stay proceedings that had been brought in Singapore in favour of India on the basis that India was the natural forum for the determination of the dispute. The claim by the plaintiff was for breach of an undertaking by the defendant bank contained in a SWIFT message sent by the latter. Amongst the connecting factors considered by Belinda Ang J (as she then was) was the governing law of the alleged undertaking contained in the SWIFT message. The parties inBungeaccepted that the choice of law analysis was as set out inPacific Recreation(see [79] above). The parties also accepted that there was no express choice of law in the SWIFT message, nor could a choice be inferred, and that the court should proceed to the third stage of thePacific Recreationtest. At [51], Ang J summarised the parties’ arguments as follows: The plaintiffs submitted that as the March SWIFT message was sent in the context of the overarching structured finance transaction, and specifically was an undertaking that flowed from Varun’s obligations under its contract dated 27 February 2012 with the first plaintiff (see [17(a)] above) which was governed by English law, the plaintiffs submitted that English law governed their claims against the defendant for breach of the undertaking. In contrast, the defendant’s view is that the laws of India have the closest and most real connection because: (a)     The March SWIFT message was issued by the defendant’s Mumbai branch. (b)     The performance of the terms of the March SWIFT message was to be effected in India. 107  At [52], Ang J held that: Before the court is able to determine the proper law of the alleged undertaking in the March SWIFT message, the court must first decide on the factual issue of whether or not the March SWIFT message constituted an undertaking as alleged.Applying the approach inPacific Recreation, the law that has the closest and most real connection to the March SWIFT message is prima facie Indian law for the two reasons stated by the defendant at [51] above.Hence, the question of whether the March SWIFT message constituted an undertaking in the first place isprima faciegoverned by Indian law. Assuming then that the March SWIFT message amounted to an undertaking under Indian law, the proper law of the undertaking and the defendant’s obligations thereunder would have to be decided as a matter of Indian law. [emphasis added] 108 It can be seen from the passages reproduced above that inBunge, the court considered the place of performance of the asserted contractual obligation as a relevant consideration in assessing the objective choice of law of that contract. That is also the approach I have adopted in this case. In my view, it is logical and principled for a court to have regard to the place of performance of the contract in its quest to determine the law that has the closest and most real connection with that contract. It is certainly a relevant factor considering thatperformanceof a contractual obligation may be said to be the very essence of any contract. Thus, the place where a contractual obligation is to be performed by a party is, in my view, a usefulindiciumof a contract’s objective proper law. As noted by the authors ofHalsbury’s Laws of Singapore(see [82] above), the place of performance is ordinarily a factor that is highly relevant at the third stage of thePacific Recreationtest. (4) Place of contracting 109 As for the place of contracting, whilst the AOD did state “Singapore” just above the signature block (see [10] above), the defendant’s case is that she signed the AOD in Indonesia. The defendant asserted that the AOD was sent to her for her signature via email by the plaintiffs’ representative on 18 May 2018. She then signed it in Indonesia and sent it via email on 21 May 2018 to Foong, who then forwarded the same to the plaintiffs.88Foot Note 88×1SLSA at para 38.In support of this, the defendant exhibited an email that she sent to Foong enclosing the AOD duly signed by her.89Foot Note 89×1SLSA at p 261.On the other hand, it is undisputed that all of the signatories on behalf of the plaintiffs signed the AOD in Singapore.90Foot Note 90×1QSLA at para 63.Overall, I found this to be a neutral factor in the determination of the governing law of the AOD. (5) Negotiations on the terms of the AOD took place in Singapore 110 The plaintiffs’ evidence was that the negotiations on the terms of the AOD took place in Singapore. On 30 April 2018, the parties negotiated the AOD at the Singapore office of Global Beauty International Pte Ltd. Schwarz, Quek and Carrie Neo Chin Wee (“Neo”) represented the plaintiffs in the negotiations whilst the defendant was accompanied by Foong, who was based in Singapore. Discussions between parties then continued via email from 2 May 2018 to 18 May 2018.91Foot Note 91×1QSLA at paras 64–65.The defendant does not dispute any of this. The fact that negotiations on the AOD took place in Singapore and the potential relevance in this case of the contextual circumstances surrounding the execution of the AOD are additional factors connecting Singapore law to the AOD. (6) Commercial purpose of the AOD 111 In relation to the commercial purpose of the AOD, the defendant submitted that the commercial purpose of the AOD was to carry out the “phoenix scheme” which had been abandoned when the first plaintiff terminated the Term Sheet.92Foot Note 92×Defendant’s March Submissions at para 23(2); Defendant’s Further Submissions dated 3 April 2020 at para 8(1).The plaintiffs disagreed and submitted that the commercial purpose of the AOD was to secure payments due to them under the Term Sheet from the defendant personally. The “phoenix scheme” which the defendant intended to put in place may have been part of the background context but it was not the purpose of the AOD. The AOD itself stated that it “serves the purpose of the temporarily [sic] continuance under the current terms.”93Foot Note 93×Plaintiffs’ April Reply Submissions at para 5(a). 112 The defendant has acknowledged that under the AOD, she was personally liable for any sums to be paid by the PT Entities (see [83(a)]). It also could not be seriously disputed that the plain wording of the AOD is to make clear the payment obligation of the defendant as a personal guarantor – hence the words “I … hereby acknowledge that I am personal [sic] liable …” in the AOD. While there may have been broader considerations or transactions contemplated by the parties, the direct or immediate obligation of the defendant under the AOD was to personally guarantee the payment of sums due from the PT Entities to the plaintiffs. That purpose of the AOD or the direct underlying obligation of the defendant under it was of greater relevance in determining the AOD’s governing law (seePacific Recreationat [39]). 113 As for the commercial purpose of the AOD, as I have already mentioned, the parties disagree what that was. In contrast, inKernel Oil,Choo J placed weight on the commercial purpose of the loan agreement in circumstances where the partiesdid not disputewhat that purpose was, namely to set up a Swiss entity and provide it with working capital (at [10]). 114 Given the parties’ disagreement in this case on the commercial purpose of the AOD, I preferred to focus on the purpose of the AOD with specific reference to the defendant’s immediate obligations under it. Analysed in that context, the purpose for which the AOD was entered into leaned in favour of Singapore law as the governing law, given my earlier conclusion that the place of performance of the AOD is Singapore. (7) Where entities are based 115 In relation to the defendant’s argument that the PT Entities are based in Indonesia and that the liability under the AOD concerns transactions or events that took place in Indonesia, this is, in my view, a neutral factor. Whilst the PT Entities were based in Indonesia, the plaintiffs were incorporated in or based in Singapore. (8) Currency 116 Finally, on the defendant’s submission that Indonesian Rupiah is specified as the currency under the AOD, I do not think much significance is to be ascribed to this factor. InPacific Recreation, the Court of Appeal observedat [44] that one “may occasionally infer that parties intend a contract to be governed by the law of the country in whose currency the sums due under the contract are payable”. It was commercially sensible for Indonesian Rupiah to be the currency in which the sums due under the AOD were expressed since it is, on the face of the document, a personal guarantee given by the defendant who is Indonesian. But that, in and of itself, does not necessarily point to Indonesian law or establish a closer connection to Indonesia. There was also evidence before me that invoices were issued to the PT Entities by the plaintiffs in other currencies such as US dollars.94Foot Note 94×See,eg, 1QSLA at pp 438–446; 448–456; 458–463; 465–470; 472–474; 476–478; 480–488; 490–495; 497–505.Further, in the defendant’s third affidavit, she exhibited emails where the plaintiffs’ Neo was chasing the defendant for payment and had expressed the amounts due in Singapore dollars. For example, just under a month after the AOD had been signed, Neo sent an email to the defendant on 14 June 2018 where she said:95Foot Note 95×3rd affidavit of Sri Linarti Sasmito dated 24 February 2020 at p 11. Attached May’18 Fees billed. With the latest, total outstanding as of to-date has amounting [sic] to S$817,209. As agreed in the signed acknowledgement letter of debt, this total outstanding fee will be due on 1 July 2018 with the commencement of the new PT, which are [sic] 2 weeks from now. Appreciate if you could start looking at your payment schedule plan; as based on past experience; daily limit for Indo to transfer out money overseas is limited to S$100k a day. 117 Two points of relevance emerge from this email. First, notwithstanding the reference in the AOD to Indonesian Rupiah amounts, the plaintiffs were quite clearly looking to be paid by the defendantin Singapore dollars. It can be reasonably inferred that the reference by Neo to the “daily limit for Indo to transfer out moneyoverseas…” [emphasis added] was a reference to transferring money from Indonesiato Singapore. This appears consistent with the conclusion I reached above at [97] on the place of performance of the AOD and provides additional support for the inference that the parties intended for Singapore to be the place of performance of the defendant’s payment obligations under the AOD, where the defendant’s creditor was based. 118 Secondly, the email also suggests that the amounts in the AOD expressed in Indonesian Rupiah were so expressed as a matter of convenience to the defendant more than anything else. I also note that neither party stated in any of their affidavits that the currency mentioned in the AOD was of any particular significance to them. (9) Conclusion on governing law of the AOD 119 Considering all of the factors as laid out above, I come to the conclusion that Singapore law is the governing law of the AOD. That is the law which, in my judgment, bears the most close and real connection to the AOD and the circumstances surrounding its inception. 120 My conclusion that Singapore law governs the AOD is, in this case, a significant factor pointing to Singapore as the clearly appropriate forum to determine the dispute or in O 11 parlance, demonstrating that this case is a proper one for service out of Singapore. Witness compellability 121 The plaintiffs submitted that most of the witnesses who are likely to be called by them are individuals who either negotiated or signed the AOD, namely Jason Kardachi, Schwarz, Quek and Foong. These individuals are all based in Singapore. As the defendant took issue with the construction of the terms of the AOD, the governing law of the AOD and its enforceability, as well as when the defendant’s liability to pay crystallised and the sums due and owing under the AOD, these witnesses would be able to speak to these matters.96Foot Note 96×Plaintiffs’ February Submissions at para 43. 122 The defendant submitted that the witnesses the plaintiffs intend to call are their employees or directors, and the only non-party witness they intend to call, Foong, is willing to give evidence in Indonesia. In contrast, the defendant intends to call non-party witnesses residing in Indonesia, namely the ex-employees of the PT Entities, Sri Linawati and Sri Siniyati Wijaya, as well as Oey from PT API.97Foot Note 97×Defendant’s March Submissions at paras 77–78. 123 In relation to witnesses, the witness location or convenience factor is in my view neutral. The witnesscompellabilityfactor, which is generally of more relevance, leans slightly in favour of Indonesia. This is because the defendant intends to call non-party witnesses who reside in Indonesia (seeLakshmi AnilSalgaocarat [73]). The plaintiffs submitted that it was unclear why Sri Linawati and Sri Siniyati Wijaya would be specifically required to testify that the new PT entity had not commenced operationally or that the Outstanding Balance was not owed by the PT Entities. The plaintiffs contended that such evidence could be led by the defendant herself or other members in the defendant’s group of companies.98Foot Note 98×Plaintiffs’ February Submissions at paras 44–45.However, as stated by the Court of Appeal inJIO Mineralsat [67], the threshold at this stage is for the defendant to show that evidence from foreign witnesses is “at least arguably relevant to its defence”. I accept that evidence from the two ex-employees of the PT Entities as well as Oey from PT API are arguably relevant to the defendant’s defence. 124 However, the analysis does not end there. There is no evidence before me to suggest that any of the non-party witnesses whom the defendant wishes to call (including the two former employees of the PT Entities) would be unwilling or are not prepared to give evidence in Singapore such that they would need to be compelled to give evidence,orthat they would not be willing to give evidence from Indonesia even via video-link (seeJIO Mineralsat [68]–[70];Raffles Education Corp Ltd and others v Shantanu Prakash and another[2020] SGHC 83(“Raffles Education”)at [77]–[83]). As such, in the overall analysis, I do not ascribe much weight to this factor. Existence of parallel or related proceedings 125 The plaintiffs submitted that the commencement of proceedings in Indonesia is irrelevant, as the resolution of the Indonesian Proceedings would have no bearing on the resolution of the present dispute. The plaintiffs also argued that the parties and issues in the Indonesian Proceedings and S 617 respectively do not overlap.99Foot Note 99×Plaintiffs’ February Submissions at para 49.The Indonesian proceedings have been brought by the PT Entities against the first plaintiff only and do not include the second to fourth plaintiffs or the defendant.100Foot Note 100×1DSPA at pp 7–9.In the Indonesian Proceedings, the PT Entities seek the following substantive orders:101Foot Note 101×1DSPA at pp 55–60. (a) That the Indonesian courts “declare legal and enforceable the seizure” against trademarks of the first plaintiff; (b) That that Indonesian courts declare that various agreements signed between some of the plaintiffs and the PT Entities have been terminated legally; (c) That that Indonesian courts declare that the Term Sheet is null and void for being contrary to the Indonesian language law; (d) That the Indonesian courts declare that there has been a franchise undertaking between the PT Entities and the first plaintiff based on an unwritten agreement, which legally had the same legal force as a written franchise agreement; (e) That the Indonesian courts declare that the first plaintiff’s purported termination of the Term Sheet has no legal force; (f) That the Indonesian courts declare that the unilateral termination of the franchise cooperation between the PT Entities and the first plaintiff is an event of default under the abovementioned unwritten agreement; and (g) Orders that the first plaintiff pay compensation and costs. 126 Conversely, the defendant submitted that the outcome of the Indonesian Proceedings would have a material effect on the sums due under the AOD. In the event that the Indonesian courts find that the Term Sheet is void, no liability would even arise under the AOD.102Foot Note 102×Defendant’s March Submissions at para 71. 127 I am of the view that the existence of parallel or related proceedings in Indonesia is a neutral factor. First, the parties involved in the dispute in the Indonesian Proceedings are different to those in S 617. The causes of action and reliefs sought in both proceedings also appear to be different, even though there may be some overlap in terms of thefactualassertions that may be advanced in both sets of proceedings. In so far as the Term Sheet and its validity play some part in both sets of proceedings, I am prepared to accept that there is an overlap in some of the issues in both sets of proceedings. Nevertheless, whilst theremaybe a risk of conflicting judgments on certain of these overlapping issues (for example, the validity of the Term Sheet), that risk is not, in and of itself, a sufficient or decisive factor pointing away from Singapore to Indonesia. This risk has to be weighed against other factors such as: (a) whether the parties and causes of action overlap or are different in the two sets of proceedings; (b) whether the situation presented is a truelisalibi pendens, or a case involving a “reversed parties” scenario, or simply a case of different proceedings being commenced by different parties; and (c) all the other relevant factors in determining which jurisdiction would be the natural forum to determine the dispute (seeRickshaw Investmentsat [90];Lakshmi AnilSalgaocarat [59] and [70];Raffles Educationat [89]–[91]). 128 Further, I have concluded that the governing law of the AOD is Singapore law (see [119]). If I accept the defendant’s case that the AOD would be null and void, and unenforceable in any proceedings brought by the plaintiffs against the defendant before the Indonesian courts, it appears counter-intuitive to give weight to the Indonesian Proceedings in the proper forum analysis. In any event and purely to complete the picture, counsel for the parties updated the court during the hearing of the defendant’s application for leave to appeal that the Indonesian court had dismissed the Indonesian Proceedings on 17 November 2020 and that the PT Entities have lodged an appeal against the dismissal. As these developments only occurred after I rendered my decision, they obviously played no part in my deliberations on SUM 5867. Other factors 129 I deal briefly with the remaining factors that the parties had raised in argument. The plaintiffs submitted that the parties have personal connections which tie the dispute to Singapore. Most of the parties in S 617 are companies incorporated in Singapore and the defendant owns property in Singapore. Nevertheless, the plaintiffs acknowledged that the domicile of the parties is a neutral factor in this case.103Foot Note 103×PRFS at p 9 (Table of Connecting Factors at Annex A to PRFS).As for the availability of documentary evidence, the plaintiffs submitted that the documentary evidence required would be readily available in Singapore; the liabilities and obligations of the parties can be determined on a reading of the AOD; and the amounts due and owing can be calculated based on information that the defendant and the PT Entities had provided to the plaintiffs.104Foot Note 104×Plaintiffs’ February Submissions at paras 41–42. 130 The defendant submitted that the domicile of the parties should be a neutral factor. The first plaintiff is incorporated in the BVI, and the second to fourth plaintiffs are incorporated in Singapore, while the defendant is a citizen of Indonesia who resides in Indonesia. She further submitted that the documents available are in hard copy form and therefore this factor points toward Indonesia as the appropriate forum.105Foot Note 105×Defendant’s Further Submissions dated 14 April 2020 at para 18. 131 In relation to the domiciles of the parties, I agree with the parties that it is a neutral factor in this case. As for the location of documentary evidence, I am also of the view that it is a neutral factor. There is no evidence from either party that there is a voluminous amount of documentary evidence available only in hard copy form, or (in the defendant’s case) that transporting documents from Indonesia to Singapore would pose any particular or extraordinary challenge that I should take note of. Nor was there any suggestion by either party that translation of documents was an issue. Conclusion on the natural forum requirement 132 Taking into consideration the different factors which I have highlighted above, I conclude that Singapore law is the law that has themostclose or real connection with the AODandthe circumstances surrounding its inception. Qualitatively, I find that to be a weighty factor pointing to Singapore as the clearly more appropriate forum in which the dispute in S 617 is to be determined. In my judgment, on balance, the relevant connecting factors which I have identified, taken as a whole, qualitatively point to Singapore as the clearly more appropriate forum for the trial of this action. Therefore, I find that the three-step test as set out inZoom CommunicationsandOro Negro(see [19] above) has been met by the plaintiffs.",
        "Failure to make full and frank disclosure": "133 I begin this section by first summarising the applicable principles. It is well-settled that a plaintiff applyingexpartefor leave to serve originating process on a defendant out of jurisdiction is subject to a duty of full and frank disclosure (ManharlalTrikamdas Mody and another v Sumikin Bussan International (HK) Ltd[2014] 3 SLR 1161 at [79]). As stated by the Court of Appeal in the recent case ofTecnomar& Associates Pte Ltd v SBM Offshore NV[2021] SGCA 36 (“Tecnomar”) at [12], this is a duty that is “owed to the Court and is driven by the need for the Court to satisfy itself that the case is aproperone for service out of jurisdiction” (emphasis in original). This duty “invariably extends to facts that may go towards rebutting the applicant’s claim”. 134 InShanghai Turbo Enterprises Ltd v Liu Ming[2019] 1 SLR 779, the Court of Appeal cited its earlier decision inTheVasiliy Golovnin[2008] 4 SLR(R) 994 and held that the test of materiality is “whether the facts in question are matters that the court would likely take into consideration in making its decision” (see alsoZoomCommunicationsat [68]). The applicant is to “identify the crucial points for and against the application, and not rely on general statements and the mere exhibiting of numerous documents” (at [105]). The key question is ultimately whether the facts disclosed are “sufficient for [the] purpose of making an informed and fair decision on the outcome of the application, such that the threshold of full and frank disclosure can be meaningfully said to be crossed” (at [106]). The court further considered that a “balance must be struck between protecting the defendant from abuse and unduly impeding the plaintiff from serving proceedings”, such that an informed and fair decision could be reached “without necessarily requiring an applicant to canvass the arguments against his own case as thoroughly as his opponent would if present” (at [106]). 135 The Court of Appeal also recently held inSteep RiseLtd v Attorney-General[2020] 1 SLR 872 that theexparteapplicant must disclose defences that may be reasonably raised by the defendant, but the duty “extends only to plausible defences and not fanciful or theoretical ones” (at [23]). The duty to make full and frank disclosure requires the applicant to also disclose “such additional facts which he would have known if he had made proper inquiries”, and not only material facts known to him (Tay Long Kee Impex Pte Ltd v TanBeng Huwah (trading as Sin Kwang Wah)[2000] 1 SLR(R) 786(“Tay Long Kee Impex”) at [21]). 136 The plaintiffs sought to rely onThe“Eagle Prestige”[2010] 3 SLR 294 (“The Eagle Prestige”) for the proposition that they need only raise defences which possessed the quality of a “knock out blow” to the plaintiffs’ case.106Foot Note 106×Plaintiffs’ April Reply Submissions at para 8. 137 Conversely, the defendant argued that the duty of full and frank disclosure was not limited to the disclosure of “knock out blow” defences. InThe Eagle Prestige, the court was concerned with the issue of whether it had admiraltyin remjurisdiction, and the court was making a finding on whether the claimant had proved that it had a good arguable case that its claim fell within one of the limbs of s 3(1) of the High Court (Admiralty Jurisdiction) Act (Cap 123, 2001 Rev Ed). This is a different issue from the question in the present case, which is whether the plaintiffs had a good arguable case on the merits.107Foot Note 107×Defendant’s Further Arguments dated 27 March 2020 at para 7. 138 I agree with the defendant that the principle inThe Eagle Prestigeis not one of general application across allexparteapplications but is limited to its context of an admiralty actionin remand the disclosure obligations imposed by the law on a plaintiff in such an actionin remwhen applyingexpartefor a warrant of arrest against the ship concerned. InThe Eagle Prestige, Belinda Ang J (as she then was) held that the duty to disclose plausible defences is not generally directed at defences that may be raised at trial in answer to the plaintiff’s underlying claim but in a broader perspective, to matters that may constitute an abuse of process. Ang J specifically pointed out that in the context of an application for a warrant of arrest, the concerns of the court were with considerations germane to its jurisdictionin remand generallynotwith the merits of the claim. Consequently, material facts would be facts relevant to the court’s decision whether to grant the application for the arrest warrant, such that defences to the claim at trial need not generally be disclosed. The exception to this is where the matters, if disclosed, would show up the claim as an abuse of process or one that was so obviously frivolous and vexatious as to be open to summary dismissal, such that the non-disclosure would be tantamount to or constitute an abuse of process (at [73]–[75]). 139 On the other hand, the threshold requirements for obtaining leave to serve originating process out of jurisdiction under O 11 of the ROC clearly do engagethe merits of the case (see [19] above). Thus, the discussion and holding inThe Eagle Prestigeon disclosure of plausible defences in anexparteapplication for a warrant of arrest in an admiralty actionin remare inapplicable in the context of an application for leave to serve originating processex jurisunder O 11 of the ROC. The law on whether an applicant has met its obligation of full and frank disclosure in an O 11 case is as set out in the established line of case authorities referred to at [133]–[135] above. 140 Having discussed the general principles, I turn now to their application to the facts of this case. The defendant submitted that the plaintiffs did not make full and frank disclosure and had failed to disclose the following facts in their affidavit supporting theexparteleave application:108Foot Note 108×Defendant’s February Submissions at para 54; Defendant’s March Submissions at pp 50-51; Certified Transcript (26 February 2020) at pp 13-14. (a) that there were two key issues between the parties, namely (i) the issue of whether the “new PT” entity had commenced operations; and (ii) the issue concerning the quantum of sums allegedly due under the AOD; (b) the existence of the Indonesian Proceedings despite attending a watching brief and not disclosing that the dispute in S 617 was part of a larger dispute between the PT Entities and the plaintiffs; (c) that the 2005 PTCU agreements contained express governing law clauses providing for Indonesian law as their governing law; (d) that the agreements referred to in the Term Sheet are different from those pleaded in the SOC; (e) that the plaintiffs had changed their case and asserted that PT API, instead of PT APP, was the “new PT” entity; (f) that the plaintiffs were not specifically identified as contracting parties in the AOD; and (g) any of the defendant’s defences, including the fact that the “new PT” entity had not commenced operations and the fact that the plaintiffs were relying on their forbearance to sue as consideration even though the parties’ correspondence did not support that contention. 141 Against this, the plaintiffs submitted that: (a) The Indonesian Proceedings were unrelated to the subject matter of the present suit. In any case, up till 23 October 2019, the first plaintiff had still not been served with the originating process for the Indonesian Proceedings. (b) The plaintiffs were not required to canvass the arguments against their own case as thoroughly as the defendant would have if she were present. In any case, the plaintiffs had already set out the defendant’s case that she was not liable to pay any sum due under the AOD and that the AOD was null and void under Indonesian law. (c) Whilst there may be a larger dispute between the PT Entities and the plaintiffs, that dispute was irrelevant to the resolution of this suit which concerned the defendant’s personal guarantee for the payment of the Outstanding Balance and at best, would only have a bearing on the quantum of debt due.109Foot Note 109×Plaintiffs’ February Submissions at paras 62–66. (d) The “new PT” entity in question was never defined in the AOD and the plaintiffs initially believed it to be PT APP. When the commercial relationship broke down and the plaintiffs discovered that PT API had been set up and was taking steps in Indonesia to,inter alia, register marks belonging to the first plaintiff, they commenced S 617 and identified PT API as the “new PT” entity. The plaintiffs need not highlight or explain this change as they were entitled to decide the entity which was to be the “new PT” entity on their case.110Foot Note 110×Plaintiffs’ April Reply Submissions at para 12. 142 The plaintiffs also submitted that if the court finds that they had failed to make full and frank disclosure, the non-disclosure was not deliberate. The court has a discretion not to set aside theexparteorder even in the absence of full and frank disclosure.111Foot Note 111×Plaintiffs’ February Submissions at paras 68–69. 143 On the evidence and based on the arguments presented, I find that there were some instances of material non-disclosure on the part of the plaintiffs. The  existence of the Indonesian Proceedings, the change in the identity of the “new PT” entity from PT APP to PT API, and the fact that the 2005 PTCU agreements provided for Indonesian law as their governing law were, in my view, relevant to the application for leave to serve out. 144 The plaintiffs did not dispute that they were aware of the Indonesian Proceedings at the material time even though the first plaintiff may not have yet been formally served with the proceedings then. Whilst the causes of action and parties in both sets of proceedings might be different, it is undeniable that there are some overlapping issues in both sets of proceedings. The existence of parallel or related proceedings would be a relevant fact for the court to be apprised of in considering whether to grant leave to serve the originating processes out of jurisdiction. As for the 2005 PTCU agreements, they would have had some relevance to the issue of the governing law of the AOD even though those agreements preceded the Term Sheet. The governing law of the AOD was relevant to the application both as a jurisdictional gateway requirement under O 11 r 1(d) of the ROC and when considering the natural forum requirement. Lastly, the identity of the “new PT” entity and the change from PT APP to PT API would have been relevant when considering the merits of the case. Thus, I find that, objectively, these facts would have been relevant to theexparteapplication for leave to serve out and could well have been taken into consideration by the assistant registrar who granted the Service Out Order. 145 It is settled law that even though there are material non-disclosures by an applicant in anexparteapplication, the court nevertheless retains a discretion not to set aside theexparteorder granted, or to deal with the non-disclosure by granting a fresh order in the light of the facts before it at theinterpartessetting aside hearing. In exercising its discretion, the court would consider whether the non-disclosure was “inadvertent or innocent (in the sense that the applicant did not know that fact, forgotten its existence, or failed to perceive its relevance), or whether it was deliberate and intended to mislead the court” (BahteraOffshore (M) Sdn Bhd v Sim Kok Beng and another[2009] 4 SLR(R) 365 at [25]–[27]; see alsoBrink’s-Mat Ltd vElcombe[1988] 3 All ER 188 at 193;Tay Long Kee Impexat [27]–[33]). 146 In the present case, I am not satisfied that the plaintiffs’ non-disclosures could be classified as deliberate or intended to mislead the court. In the plaintiffs’ supporting affidavit (“Affidavit”), they had set out the following potential defences that they had been alerted to in the correspondence exchanged by the parties’ solicitors prior to the commencement of S 617: (a) On 9 July 2019, the defendant’s solicitors issued a letter stating,inter alia, that the AOD is null and void under Indonesian law (Affidavit at para 47);112Foot Note 112×1QSLA at pp 507–510. (b) On 19 July 2019, a letter from the defendant’s solicitors stated that the defendant, who was not resident in Singapore, did not agree that Singapore was the appropriate forum for the determination of any dispute between the plaintiffs and the defendant. The defendant took the position that the relevant transaction involving the plaintiffs took place in Indonesia and that any relevant witnesses as well as documentary evidence relating to any dispute between the parties would also be situated in Indonesia. Indonesia should therefore be the natural forum to adjudicate the dispute (Affidavit at [50(a)]).113Foot Note 113×1QSLA at pp 515–516. 147 I find that the plaintiffs had sought to disclose the defendant’s key substantive defences as they had understood it. I contrast the present case with that ofTecnomar, where the court found that there was deliberate suppression or non-disclosure of material information. InTecnomar, the appellant was fully aware of the respondent’s defence that it had not contracted with the appellant, and that the contract was instead concluded between the appellant and another subsidiary. However, in itsexparteapplication, there was a “complete and conspicuous absence” of any reference by the plaintiff to that subsidiary (at [18]). Critically, if the proper disclosures had been made by the plaintiff inTecnomar, it would have demonstrated that plaintiffdid nothaveanygood arguable case that its claim fell withinthe asserted jurisdictional gateway(ie, O 11 r 1(d) ROC) as it would have demonstrated that the plaintiff hadno contractwith the defendant. It suffices to say that the facts and extent of non-disclosures inTecnomarare somewhat extreme and the evidence pointing to the non-disclosure being “deliberate and systematic” was compelling. 148 In the present case, however, whilst there was material information which should have been placed before the court as I have highlighted above at [143], none of the facts, singly or collectively, would have fatally impacted the plaintiffs’ ability to bring themselves within at least one of the jurisdictional gateways in O 11 r 1 of the ROC – I refer to O 11 r 1(a) specifically. I consider this to be a material difference between this case andTecnomar. The evidence overall also did not suggest to me that the plaintiffs had deliberately omitted to disclose any major defence available to the defendant, and this included the plaintiffs’ decision to switch the identity of the “new PT” entity referred to in the AOD from PT APP as initially envisaged to PT API. 149 Further, there would, in my view, be little purpose in discharging the Service Out Order, since the plaintiffs would be entitled to re-apply for leave on the evidence before me at the setting aside application (seeIMSkaugen SE and another v MAN Diesel & Turbo SE and another[2018] SGHC 123(“IMSkaugen (HC)”)at [79]; I pause here to note that whileIMSkaugen (HC)was reversed by the Court of Appeal inMAN Diesel &Turbo SE, the Court of Appeal did not disturb or overturnIMSkaugen (HC)on this discrete point. 150 Viewing the matter in the round, the non-disclosures in this case, while not trivial, were at the same time not so egregious as to warrant the setting aside of the Service Out Order. If a fresh application had been made before me at the hearing of the setting aside application, I would have granted the plaintiffs leave to serve out based on the evidence and information then available. In the circumstances, setting aside the Service Out Order would, in my view, represent a disproportionate outcome bearing in mind that a key consideration in challenges of this nature is whether theexparteapplicant has gained some unfair advantage by reason of the non-disclosure(s). Therefore, in the exercise of my discretion, I declined to set aside the Service Out Order and upheld it.",
        "Whether the Substituted Service Order should be set aside": "151 The final issue for consideration in SUM 5867 is whether the Substituted Service Order (HC/ORC 6729/2019) granting the plaintiffs leave to effect substituted service of the Writ and SOC on the defendant should be set aside. The Substituted Service Order provided that service could be effected on the defendant by sending copies of the Writ and SOC (i) by registered post to the defendant’s address in Indonesia and/or (ii) through the smartphone messaging platform “Whatsapp” to the defendant’s mobile phone number as specified in the Substituted Service Order. The defendant contends that the Substituted Service Order should be set aside as both modes of service stipulated therein contravene Indonesian law. 152  In support of her position, the defendant relied on an Indonesian law expert opinion provided by Sitepu. Sitepu opined that the “only mode of service of foreign process is by way of sending rogatory letters through diplomatic channel, which process has been mandated” by the Vienna Convention on Consular Relations (opened for signature 24 April 1963), 596 UNTS 261 (entered into force 19 March 1967) (“Vienna Convention”).114Foot Note 114×2PASA at pp 5-6.Article 5(j) of the Vienna Convention expressly identifies the transmission of judicial documents as a consular function. The Indonesian Ministry of Foreign Affairs and the Indonesian courts had, first in 2013 and subsequently in 2018, enacted a Memorandum of Understanding (“MOU”) “to ensure that the transmission of judicial documents would be effected in a manner compatible with the laws and regulations of Indonesia”. This MOU regarding Letters Rogatory Management and Request for Assistance on Civil Matters Document Delivery from a Foreign Court to an Indonesian Court and from an Indonesian Court to a Foreign Court sets out the procedure for service of foreign court documents in Indonesia.115Foot Note 115×1st affidavit of Paul Antonius Sitepu dated 21 November 2019 (“1PASA”) at p 17; 2PASA at p 7. 153 The defendant argued that if other methods for service of foreign process in Indonesia were permitted, the MOU would be rendered otiose. Further, Arts 388 and 390 of theHerzieneInlandsch Reglement(“HIR”) provide safeguards for the service of documents on Indonesian residents. It could not be right that service of foreign process may be effected in a manner that is different from that in which service of local process may be effected, as it would “expose persons resident in Indonesia to a greater risk of being served with foreign process”.116Foot Note 116×1PASA at p 22. 154 The plaintiffs on the other hand submitted that none of the modes of substituted service contravened Indonesian law. They relied on the evidence of their Indonesian law expert, Dewi Savitri Reni (“Reni”).117Foot Note 117×Plaintiffs’ February Submissions at paras 53–60.Reni opined that there is no express statutory law governing the service of foreign originating process in Indonesia or mandating service of such foreign process by any particular method.118Foot Note 118×1st affidavit of Dewi Savitri Reni dated 20 December 2019 (“1DSRA”) at p 13.With regard to Art 5(j) of the Vienna Convention, it only defines the functions in that provision as being consular functions (including transmitting judicial and extra-judicial documents) but does not address the method by which foreign process is to be served in Indonesia. Nor does it contain any mandatory provisions on such service; thus, Law No. 1 of 1982 by which Indonesia ratified the Vienna Convention also does not and is not intended to address the service of foreign process.119Foot Note 119×1DSRA at p 14. 155 Further, the MOU is not a law and serves only as a bilateral exchange or guideline between two Indonesian government institutionsinter se, namely the Indonesian Ministry of Foreign Affairs and the Indonesian Supreme Court, as to how courts and government institutions in Indonesia should handle letters rogatory.120Foot Note 120×1DSRA at p 15.As for the HIR, it is a domestic regulation that only governs the service of domestic Indonesian originating process in Indonesia, and not the service offoreignoriginating process.121Foot Note 121×1DSRA at p 19. 156 Reni also made reference to the decision of the High Court inHumpussSea Transport Pte Ltd (in compulsory liquidation) v PT Humpuss Intermoda Transportasi TBK and another[2015] 4 SLR 625 (“Humpuss”) where similar issues arose for consideration. Reni essentially agreed with the observations and conclusions reached by Steven Chong J (as he then was) inHumpusson the effect and ambit of Art 5(j) of the Vienna Convention, the MOU and the provisions in the HIR which were also raised by the parties’ Indonesian law experts inHumpuss.122Foot Note 122×1DSRA at p 11. 157 InHumpuss,service was effected personally on the defendants at their registered addresses in Indonesia by an Indonesian solicitor and by sending copies of the court papers to the defendants by courier (at [8]). Among other points raised, the defendants inHumpusssought to challenge the modes of service on the basis that they were contrary to Indonesian law and thereby invalid by reason of O 11 r 3(2) of the ROC. 158 Having considered the competing views of the parties’ Indonesian law experts, I find the evidence of the plaintiffs’ Indonesian law expert, Reni, to be more persuasive. I do not see any reason why the reasoning and conclusions reached inHumpussshould not apply equally in this case to the methods of substituted service stipulated in the Substituted Service Order. 159  As submitted by the plaintiffs, inHumpuss, Chong Jconcluded that there is no express statutory law which governs or mandates the service of foreign process in Indonesia (at [70]). Further, Sitepu did not cite any Indonesian court decision which had ruled that Art 5(j) of the Vienna Convention was a mandatory method of effecting service of foreign process, or which had ruled that the HIR does regulate and can be used for the service of aforeignoriginating process. Article 5(j) of the Vienna Convention provides that: Consular functions consist in: … (j) transmitting judicial and extrajudicial documents or executing letters rogatory or commissions to take evidence for the courts of the sending State in accordance with international agreements in force or, in the absence of such international agreements, in any other manner compatible with the laws and regulations of the receiving State … 160 Just from reading the text, it is plain that there is nothing in this article that (a) addresses service of foreign process or (b) provides that any form of service of process is mandatory. As for the HIR, the text of Arts 388(1) and 390(1) of the HIR merely set out a process by which authorised officials in Indonesia can deliver or serve court documents. There is nothing to indicate that the HIR is at all relevant to the service of foreign process. 161 Article 388(1) of the HIR provides that:123Foot Note 123×1PASA at p 21. All bailiffs, messengers on duty at the court tribunal, and general affairs officers are entitled and obligated to perform summons, notices and any other bailiff letters and to carry out the judge’s orders and ruling. 162 Article 390(1) of the HIR provides that:124Foot Note 124×1PASA at p 21. Every bailiff letter, unless those are mentioned below, shall be delivered to the people concerned at their domicile or address, and if they may not be found there, to the village Head or its assistant, who has to immediately notify to the people of such bailiff letter, but it is not necessary to be stated by law. 163 In so far as the defendant’s argument is that the HIR provides safeguards for service of local originating process such that the service of foreign originating process should be subject to the same standards, this is incorrect in law. As explained inHumpuss, the validity of service out of jurisdiction is to be determined by thelexfori, such that provisions of foreign law are only relevant where Singapore law deems compliance with foreign law to be relevant (at [101]–[103]). Under O 11 rr 3(2) and 4(2)(b) of the ROC, service would not be valid if it is contrary to the law of the foreign country. Service could contravene foreign law in two ways: (a) because it failed to comply with amandatorymanner of service of foreign process prescribed by the foreign law; or (b) because it had been effected in a manner specificallyprohibitedby the foreign law (at [104]). 164 The defendant has not provided any credible evidence to support her contention that that the HIR applies to service of foreign process also. With respect, I disagree with Sitepu that because the HIR provides safeguards for service ofdomesticoriginating process on Indonesian defendants, it should necessarily follow that service offoreignprocess would also be subject to the HIR regime. Such a conclusion is not supported by any authority from the Indonesian courts and would, in my view, do violence to the language of the HIR provisions in question. 165 InHumpuss, the court also considered the MOU and found that there was nothing in the MOU to indicate that it was the exclusive and mandatory method through which all foreign process in Indonesia must be served (at [65]). Further, the MOU is not law (at [66]). Reni agrees with the analysis inHumpusson the effect of the MOU. I note that Sitepu, in his reply opinion, did not dispute the correctness of Reni’s conclusion that the MOU is not considered law. 166 As is apparent from the foregoing paragraphs, the opinions expressed by Sitepu in this case, by and large, mirrored those that were raised and rejected inHumpuss. I respectfully agree with all of Chong J’s observations and conclusions inHumpussregarding Indonesian law on service of foreign process. I would only add that those observations and conclusions applymutatis mutandisto the modes ofsubstitutedservice utilised by the plaintiffs in this case. 167 The defendant failed to persuade me that the modes of substituted service stipulated in the Substituted Service Order contravened Indonesian law. I therefore declined to set aside the Substituted Service Order or the service of the Writ and SOC effected on the defendant pursuant to that order.",
        "Conclusion": "168 As the defendant did not prevail on any of the grounds on which she sought to challenge the Service Out Order and Substituted Service Order, I dismissed SUM 5867 in its entirety with costs. 169 After hearing the parties, I fixed costs of SUM 5867 at $14,000 to be paid by the defendant to the plaintiffs, with disbursements to be agreed, and failing such agreement, for the disbursements to be taxed. S MohanJudicial Commissioner Ng Ka Luon Eddee, Cha Mei Yin and Chan Michael Karfai (Tan Kok Quan Partnership) for the plaintiffs; Wong Soon Peng Adrian, Ng Tee Tze Allen and Timothy Ng Xin Zhan (Rajah & Tann Singapore LLP) for the defendant.",
        "": ""
    }
}