{
    "case_title": "CMJ and another vCML and another",
    "ncitation": "[2021] SGHC(I) 20",
    "coram": "Simon Thorley IJ",
    "sections": {
        "Background": "7 The Arbitration arose from a dispute between the parties in relation to a petroleum contract entered into on 24 March 2005 to explore, develop and produce oil and gas resources at certain offshore fields. The collaboration between the parties turned out to be less successful than they had hoped. It appears that not only did the parties discover less gas in the fields than was anticipated but world gas prices also declined significantly over the course of the project which put the parties at a disadvantage in their negotiations with the sole buyer for the gas produced. The reasons for the less than satisfactory outcome are, however, not relevant to the OS. 8 What is relevant is the way in which the Arbitration, which was regulated in the usual way by Procedural Orders, was conducted. The timeline of the Arbitration is conveniently set out in a table in the first affidavit of Mr Yuen Po Kwong Peter, which is reproduced below:3Foot Note 3×Mr Yuen’s 1st Affidavit at para 51.  DescriptionDeadlineClaimant’s Statement of Claim24 April 2017Respondent’s Statement of Defence (“Defence”)16 October 2017Claimant’s Statement of Reply (“Reply”)26 March 2018Respondent’s Statement of Rejoinder (“Rejoinder”)18 June 2018Experts of like disciplines to meet on without prejudice basis and produce joint report: identifying areas of agreement; identifying issues still not agreed; and providing reasons for any non-agreement23 July 2018Pre-hearing procedural conference and notification of factual and expert witnesses to be examined and cross-examined, and designation of any supplemental documents to be entered into the record and submitted to the Tribunal3 August 2018Evidentiary hearing10-14, 17-21 September 2018 9 On 1 June 2018, Procedural Order No 1 was amended and proceedings thereafter were regulated by Procedural Order No 2 (“PO2”).4Foot Note 4×Mr Yuen’s 1st Affidavit at pp 658-676.The Arbitration was conducted “memorial style” so that the parties’ statements of case would be accompanied by factual evidence and expert reports.5Foot Note 5×Mr Yuen’s 1st Affidavit at para 52.CMJ’s Statement of Claim was accompanied by four witness statements and three expert reports, one of which was from Professor Ling Bing (“Prof Ling”), an expert in PRC law (“The Ling Report”).6Foot Note 6×Mr Yuen’s 1st Affidavit at para 53.CML’s Defence was accompanied by one factual witness statement and three expert reports, but there was no expert report on PRC law in response to the Ling Report.7Foot Note 7×Mr Yuen’s 1st Affidavit at para 55. 10 CMJ’s Reply, served on 26 March 2018, and their accompanying statements and reports thus did not address further the question of PRC law.8Foot Note 8×Mr Yuen’s 1st Affidavit at para 56.On 10 May 2018 CML changed their counsel9Foot Note 9×Mr Yuen’s 1st Affidavit at para 57.and the contents of the Rejoinder were thus determined by the new counsel. The Rejoinder was accompanied by three further witness statements and an expert report of Professor Liu Kaixiang (“Prof Liu”) on PRC law (“the Liu Report”) which, for the first time, responded to the Ling Report.10Foot Note 10×Mr Yuen’s 1st Affidavit at para 58. 11 By a letter dated 11 July 2018, CMJ’s lawyers wrote to CML’s lawyers contending that:11Foot Note 11×Mr Yuen’s 1st Affidavit at para 59 and p 1800. … the [Rejoinder] and the accompanying witness statements and expert reports raised new issues and introduced new evidence which necessitates [CMJ’s] preparation of a response and production of relevant evidence in support thereof. (We will write to you shortly in this regard). The letter also went on to assert that during the joint expert meetings and the preparation of joint expert reports (“JERs”), the experts should not be precluded from discussing the new issues and relying on such materials as CMJ or their experts produced in response to those new issues (see also [24] below). 12 The reference to joint expert meetings and JERs in the letter was a reference to para 2.1(j) of PO2, which provided as follows:12Foot Note 12×Mr Yuen’s 1st Affidavit at p 661. Experts of like disciplines to meet on without prejudice basis and produce joint report: identifying areas of agreement; identifying issues still not agreed; and providing reasons for any non-agreement. 13 Paragraph 8.4 of PO2 provided as follows:13Foot Note 13×Mr Yuen’s 1st Affidavit at p 670. The Parties’ experts of like disciplines are to meet on a ‘without prejudice’ basis in person or by telephone or videoconference and produce a joint report: identifying areas of agreement; identifying issues still not agreed; and providing reasons for areas of non-agreement. The report shall be delivered on or before the date mentioned in [para] 2.1(j). 14 Reference should also be made to paras 8.10, 9.2(a) and 9.2(b), which provided as follows:14Foot Note 14×Mr Yuen’s 1st Affidavit at pp 671-672. 8.10 The witness statements shall be in sufficient detail so as to stand as examination in chief of the witness at the witness hearing.The Tribunal shall not receive testimony from any witness or expert who has not provided a written statement or report as part of the written procedure unless (i) it is offered to rebut an argument or evidence raised in the Rejoinder to which[CMJ] were not able to respond;or (ii) the new testimony is offered to rebut testimony offered for the first time during examinations at the hearing; and in each case (iii) is authorized by the Tribunal upon application to it, such application submitted as soon as reasonably possible following the alleged basis for the new evidence and describing for purposes of fair notice to the other party (a) a summary of the testimony offered for the first time at the hearing, (b) the new fact/argument that is to be rebutted, and (c) the identity of the witness that will offer the new testimony and the scope of that new testimony. 9.2(a) [CMJ’s] witnesses will be examined first, followed by [CML’s] witnesses. 9.2(b) Each witness shall first be invited to confirm or deny his or her written statement. [emphasis added] 15 CML responded to CMJ’s letter of 11 July 2018 by a letter dated 17 July 2018 resisting any attempt by CMJ to adduce further evidence and use the JER process to expand upon the expert evidence already served.15Foot Note 15×Mr Yuen’s 1st Affidavit at para 60.The material passages in CML’s letter read as follows:16Foot Note 16×Mr Yuen’s 1st Affidavit at pp 1803-1804. The current procedural calendar does not entitle [CMJ] to submit any … ‘response’ [to CML’s Rejoinder]. [PO2] permits the Parties to submit two written submissions each. This is consistent with the basic requirement under Article 15 of [the UNCITRAL Rules] that the Parties be treated with equality. It would be inconsistent with that requirement for [CMJ] to submit a third written submission in the form of a ‘response’ to [CML’s Rejoinder]. It is similarly improper for [CMJ] to use the [JER] process to expand the proposed without-prejudice discussions to include unspecified ‘materials’ that are not part of the record of [the Arbitration]. In paragraph 8.4 of [PO2], the Tribunal directed that experts of like disciplines produce a joint report: (a) identifying areas of agreement; (b) identifying areas of disagreement; and (c) giving reasons for such disagreement. It is clear that the process envisioned by the Tribunal is based on the experts’ existing reports, not new ‘materials’ introduced by one Party without seeking leave or providing copies of those materials to the other Party and their experts in advance. The purpose of the joint expert process is tonarrow, notexpand, the outstanding issues. [emphasis in original]",
        "The Additional Fact Evidence": "16 So far as concerns the additional fact evidence on which CMJ wished to reply an application was made by CMJ to the Tribunal by a letter dated 18 July 2018 to admit two further witness statements, one from Mr [C] and the other from Mr [D] ( both names redacted).17Foot Note 17×Mr Yuen’s 1st Affidavit at para 61.I need say no more about the latter as any reliance on the failure to admit that statement was not pursued at the hearing before me. The letter explains why Mr C’s witness statement (“BT2”) addresses matters raised in the Rejoinder which, it was said, could not have been addressed by CMJ in their Reply as these matters post-dated the date of service of the Reply. It states:18Foot Note 18×Mr Yuen’s 1st Affidavit at p 1808. a. [CML] cannot credibly contend that the principle of equality prohibits [CMJ] from adducing responsive evidence. On the contrary, having changed their legal counsel prior to the Rejoinder submission, [CML] have now in that submission chosen to make voluminous new statements of fact and arguments of law, and adduced the evidence of no fewer than five witnesses. It would be contrary to the principle of equality if [CMJ] were prohibited from making a short response to thesede novosubmissions from [CML’s] new counsel. b. The time taken by [CMJ] to analyse these submissions and procure evidence responsive to the new points therein, is wholly justified by the excessive scope and nature of [CML’s] Rejoinder, as well as the technical nature of the issues raised. c.Nor in the ordinary course of the procedure set out in PO2 would [CML] be entitled to successfully suppress [CMJ’s] factual witnesses from making statements in response to such new points[see para 8.10 of PO2]. By allowing [CMJ] to submit their responsive Witness Statements now, rather than make the same points in examination in chief, the Tribunal would simply be ensuring that such evidence is produced in a measured and early manner.It is certainly not denying [CML] the privilege they appear to assert in their letter. d. [CMJ’s] short responsive statements will in turn be accompanied by translations of the statements themselves and their accompanying exhibits. [CML] cannot allege prejudice on the basis of language. Indeed，it is telling that [CML] have yet to provide [CMJ] (and [the Tribunal]) with the full set of translations of their Rejoinder submissions filed some three weeks ago. [emphasis added] 17 CML’s lawyers responded to CMJ’s application by a lengthy letter dated 23 July 2018.19Foot Note 19×Mr Yuen’s 1st Affidavit at para 62 and pp 1849-1857.Briefly stated, CML asserted that BT2 was an attempt to expand upon the issues that had already been canvassed by CMJ in their Reply as well as seeking to introduce new factual issues. CML made the point that if CMJ wished to raise these issues, para 9.2(c) of PO2 gave them an opportunity to do this by way of direct examination at the evidentiary hearing and stated that if BT2 was to be admitted, CML should be given an opportunity to submit further evidence in response.20Foot Note 20×Mr Yuen’s 1st Affidavit at pp 1853-1854. 18 The letter also drew attention to the fact that to grant the application would result in unequal treatment between the parties and that the delay in making the application would, if granted, prejudice the proper preparation of CML’s case.21Foot Note 21×Mr Yuen’s 1st Affidavit at pp 1855-1856. 19 In turn, CMJ’s lawyers responded by a letter dated 25 July 2018.22Foot Note 22×Mr Yuen’s 1st Affidavit at para 63 and pp 1859-1865.This gave reasons why BT2 was responsive to matters raised for the first time in the Rejoinder and asserted that it would be preferable for BT2 to be allowed in evidence in advance of the hearing, rather than for Mr C to give his evidence orally at the hearing. This would avoid unequal treatment whilst ensuring that CMJ was not prejudiced by being denied the right to rely on the evidence. On 30 July 2018, CML’s lawyers submitted a final round of comments reiterating the points outlined in its earlier letters to the Tribunal.23Foot Note 23×1st Affidavit of Nicholas Peter Lingard (“Mr Lingard’s 1st Affidavit”) at para 15(f) and pp 522-530. 20 By an e-mail dated 2 August 2018, the Tribunal ruled on the question of whether BT2 should be admitted in evidence.24Foot Note 24×Mr Yuen’s 1st Affidavit at para 64 and pp 1867-1870.It declined to admit it and reasoned as follows:25Foot Note 25×Mr Yuen’s 1st Affidavit at p 1869. With regard to [BT2], the Tribunal finds that this new witness statement and the exhibits cited therein substantially expand the issues from those set out in the written submissions already exchanged. Except for a cursory reference to … [the] witness statement [of one of CML’s witnesses], it is unclear how the statements in [BT2] and the exhibits cited constitute a response to the matters discussed in [that witness statement]. Moreover, [BT2] does not clearly set out the allegations in the Rejoinder it purportedly responds to. Moreover, it is apparent that [BT2] contains many substantial and new allegations and documents. Even assuming that it is true that [CMJ] only obtained the factual materials in June 2018, there are many exhibits which would have been in [CMJ’s] possession or at the very least, [CMJ] would have known about these (for example, exhibits comprising of documents prepared by [CMJ]). Considering the proximity of the hearing, the Tribunal finds that it is much too late to admit substantial new evidence and witness statements. Moreover, the experts are already in the final stages of coming up with [the JERs]. As [CMJ] had previously stated, if the new evidence are admitted, their experts would be referring to these. It would be highly unfair to deprive [CML] and its experts from having the opportunity to peruse the new evidence and respond to these before the hearing. Therefore, the Tribunal disallows the introduction into the record of [BT2] and the exhibits cited therein. 21 On 24 August 2018, CMJ’s lawyers asked the Tribunal to amend its directions on the hearing arrangements so as to allow Mr C to give evidence-in-chief lasting for 30 minutes and to allow Mr C to adduce further materials in support of his position.26Foot Note 26×Mr Yuen’s 1st Affidavit at para 124 and pp 2322-2323.On 28 August 2018, the Tribunal acceded to the request for Mr C to give evidence-in-chief, but rejected the application for Mr C to adduce further materials on the basis that it had already made a decision on the admission of further documents, some of which has been admitted and some not.27Foot Note 27×Mr Yuen’s 1st Affidavit at para 126 and pp 2328-2329.On the latter request it said this:28Foot Note 28×Mr Yuen’s 1st Affidavit at p 2328. The Tribunal has already previously decided on the additional materials that [CMJ] has sought to introduce – some of these were admitted, and some were not allowed. The Tribunal’s decisions on these matters stand. Moreover, granting this request would be tantamount to a blanket admission of new materials, which the Tribunal and [CML] would have no ability to view and comment on before they are introduced. Therefore, the Tribunal denies this request. Paragraphs 7.1 and 7.7 of [PO2] stand – no new document may be presented at the hearing unless agreed by the Parties or authorized by the Tribunal in accordance with principles of due process, and demonstrative exhibits should not contain new evidence, and all evidence relied on to present the demonstrative exhibit must be cited to on the slide. 22 Pursuant to this direction, Mr C gave evidence-in-chief on Wednesday 12 September 2018 from 4.59pm until 5.24pm.29Foot Note 29×Mr Lingard’s 1st Affidavit at pp 1823-1838.",
        "The Expert Evidence": "23 In the same time frame, the parties’ lawyers were addressing the question of expert evidence and the preparation of the JERs. On 6 July 2018 CML’s lawyers wrote to CMJ’s lawyers seeking to agree the ground rules for the preparation of the JERs.30Foot Note 30×Mr Yuen’s 1st Affidavit at para 78 and pp 1810-1812.Six rules were proposed as follows:31Foot Note 31×Mr Yuen’s 1st Affidavit at p 1811. The process of producing joint expert reports shall be led by the Parties’ experts. The Parties’ counsel may consult with the Parties’ respective experts throughout the process. The meeting(s) or call(s) to take place between the Parties’ experts of like disciplines shall be attended by the experts of like disciplines and their teams only，without the attendance of client representatives or counsel. The meeting(s) or call(s) between the Parties’ experts of like disciplines shall involve the experts discussing their respective positions on each of the relevant issues on a ‘without prejudice’ basis. Any draft joint expert reports shall be prepared on a ‘without prejudice’ basis and shall not be referenced in these proceedings. Only the final joint expert report，which is approved and signed by both [CMJ’s] and [CML’s] experts of like disciplines, shall be entered into the record and referenced in these proceedings. The scope of the joint expert report of the Parties’ experts of like disciplines shall be limited to issues that both the [CMJ’s] and [CML’s] experts of like disciplines have already addressed in their respective expert reports submitted in these proceedings. The Parties’ experts shall not rely on any material not already on the record in these proceedings. 24 CMJ’s lawyers wrote back to CML, by way of the 11 July 2018 letter (see [11] above), agreeing to the first four proposals but rejected the last two stating:32Foot Note 32×Mr Yuen’s 1st Affidavit at para 80 and p 1800. During the joint expert meetings and the preparation of the joint expert reports, therefore, the experts should not be precluded from discussing such issues and relying on such materials that [CMJ] and/or their experts produce in response to the new issues raised and new evidence introduced in the Rejoinder Submissions. Furthermore, [PO2] does not regulate or restrict in any way the material that the experts are entitled to rely upon when engaging in the joint meetings or when preparing the joint expert reports. [CML’s] suggestion would unnecessarily fetter the experts’ in their preparation and communications. 25 In response, in the letter dated 17 July 2018 (see [15] above), CML’s lawyers rejected this approach, emphasising that the JER process was designed to narrow (not expand) the existing issues and that the introduction of material in addition to the existing material in the expert reports as already served would be contrary to the provisions relating to the JER process set out in PO2.33Foot Note 33×Mr Yuen’s 1st Affidavit at para 60 and pp 1803-1804. 26 On 3 August 2018 CMJ’s lawyers informed CML’s lawyers that Prof Ling intended to rely on a further 17 PRC law authorities in response to the Liu Report.34Foot Note 34×Mr Yuen’s 1st Affidavit at para 83 and pp 1886-1889. 27 Thereafter, Prof Liu sent Prof Ling, under cover of an e-mail dated 5 August 2018, a first draft of their proposed JER, which was six pages long.35Foot Note 35×Mr Lingard’s 1st Affidavit at para 168 and pp 543-544.On 6 August 2018, by letter, CML’s lawyers gave full reasons for objecting to the proposed introduction of the 17 PRC law authorities.36Foot Note 36×Mr Yuen’s 1st Affidavit at para 84 and pp 1898-1902. 28  In response, on 7 August 2018, Prof Ling sent back a revised draft extending to some 19 pages.37Foot Note 37×Mr Yuen’s 1st Affidavit at para 86 and pp 1915-1935.CML contended that a large proportion of the material in the column labelled “Professor Ling’s view” in the revised draft had been new material which was not in Prof Ling’s previous expert report.38Foot Note 38×Mr Lingard’s 1st Affidavit at para 168. 29 Also on 7 August 2018, CMJ’s lawyers wrote to the Tribunal seeking leave for Prof Ling to refer to 10 of the 17 additional authorities in the JER.39Foot Note 39×Mr Yuen’s 1st Affidavit at para 85 and pp 1904-1913.Full reasons were given at para 10 of that letter, but the substance of the reasoning was that this was a necessary step to provide CMJ with a proper opportunity to respond to the Liu Report which had only been served as part of the Rejoinder when it could and should have been served as part of the Defence. Had it been, Prof Ling could have prepared a further report as part of CMJ’s Reply. Granting Prof Ling leave to refer to the PRC law authorities was the best way of affording Prof Ling a fair and just opportunity to address the Liu Report, which was served late. 30 On 8 August 2018, CML’s lawyers wrote to the Tribunal objecting to the introduction of the 10 authorities on five grounds, each of which was explained in full in that letter.40Foot Note 40×Mr Yuen’s 1st Affidavit at para 87 and pp 1937-1942. 31 Next, on 9 August 2018, CMJ’s lawyers wrote to the Tribunal complaining about the conduct of CML’s counsel in the JER process and requesting,inter alia, a direction that the parties’ experts should file separate reports on area of disagreement.41Foot Note 41×Mr Yuen’s 1st Affidavit at para 89 and pp 1950-1953. 32 By a letter dated 10 August 2018, CML’s lawyers refuted the allegations of misconduct and opposed the provision of separate reports.42Foot Note 42×Mr Yuen’s 1st Affidavit at para 92 and pp 2163-2165.As a result, CMJ’s lawyers wrote to the Tribunal, also on 10 August 2018, seeking directions.43Foot Note 43×Mr Yuen’s 1st Affidavit at para 93 and pp 2167-2169. 33 On 14 August 2018 the Tribunal gave directions on each of these issues.44Foot Note 44×Mr Yuen’s 1st Affidavit at para 94 and pp 2171-2172.In relation to the JERs, the Tribunal said this: The Tribunal is in receipt of [CMJ’s] letter dated 9 August 2018, and [CML’s] letter dated 10 August 2018. [PO2], [para] 8.4 provides, ‘The Parties’ experts of like disciplines are to meet on a “without prejudice” basis…and produce a joint report: identifying areas of agreement; identifying issues still not agreed; and providing reasons for areas of non-agreement…’ With regard to the joint report on the areas of agreement: The Tribunal considers that the joint report identifying areas of agreement would be helpful to it. The Tribunal therefore directs that [CML’s] experts provide their areas of agreement to the relevant [CMJ’s] experts within 24 hours from this e-mail. [CMJ’s] experts will then retain any areas of agreement which remain uncontroversial, delete those which are no longer agreed, and finalize this report. After which, both experts will converse as to whether this finalized report is agreeable to both of them, and only the text that is agreed upon in this final discussion will be submitted to the Tribunal. All the other text with which either expert has an objection will be deleted. This agreed report will then be forwarded to the Tribunal immediately. With regard to the joint report on the issues still not agreed and the reasons for areas of non-agreement: This portion of the joint report is intended to comprise of (1) a list of areas of non-agreement, and (2) a short statement of what each expert’s position is. None of the experts are supposed to provide a lengthy explanation of their positions or a rebuttal of their counterpart’s position, as these will be reflected in the previous expert reports provided. The Tribunal agrees with [CML] that submitting separate reports on areas of disagreement would run the risk of expanding the issues or arguments, which is not appropriate at this stage. The report on areas of non-agreement should not amount to an additional expert report. If the parties are unable to agree on a joint submission for either or both (1) and (2) as described above within the deadline of submitting the areas of agreement to the Tribunal as set forth above, then the Tribunal will not accept any report on the areas of non-agreement. In this situation, only the joint report on areas of agreement will be accepted. 34 And, in relation to the PRC authorities, it said this:45Foot Note 45×Mr Yuen’s 1st Affidavit at para 95 and pp 2176-2177. The Tribunal agrees with [CMJ] that the PRC Law Materials should be admitted considering that [CML’s] PRC law expert’s (Prof. Liu’s) report on the substantive PRC legal issues was only submitted with the Rejoinder. It would thus be reasonable, as well as helpful to the Tribunal, for [CMJ’s] PRC law expert (Prof. Ling) to have an opportunity to address it. The Tribunal thus GRANTS [CMJ’s] request with regard to the PRC Law Materials. Prof. Liu may express his comments on the new materials during the hearing. 35 CMJ were dissatisfied with the decision on the JERs and considered that CML’s experts were using the decision to frustrate the purpose of the JERs. CMJ therefore wrote again to the Tribunal on 20 August 2018, seeking the opportunity for their experts to respond to new points made by CML’s experts.46Foot Note 46×Mr Yuen’s 1st Affidavit at para 98 and pp 2232-2238.This was opposed by CML’s lawyers in a letter to the Tribunal dated 21 August 2018.47Foot Note 47×Mr Yuen’s 1st Affidavit at para 99 and pp 2240-2242. 36 The Tribunal then issued a further decision on 22 August 2018, which stated:48Foot Note 48×Mr Yuen’s 1st Affidavit at para 100 and pp 2244-2245. The Tribunal sees no compelling reason to reconsider and modify its directions of 14 August 2018. If the Parties cannot agree to a (a) list of areas of non-agreement and (b) a short statement of each expert’s position on the area of non-agreement, separate submissions from each party would be unhelpful, and may serve to obfuscate what has already been discussed in the previous expert reports submitted. The Tribunal considers that each expert will have sufficient opportunity to express his/her views about various issues, including the issues of non-agreement, when they are called to the stand during the hearing. If the Tribunal, and in fact, any Party believe that an expert’s opinion on a substantive issue should be further explored, they are free to propound questions during the hearing. The expert will not be unreasonably prevented from stating his/her position in response to a question from the Tribunal or a Party, subject to the Tribunal’s power to control the arbitration proceedings. Separate submissions on areas of non-agreement would also constitute additional expert reports at this stage, which is neither timely nor appropriate, as the submissions phase before the hearing has already ended. With regard to [CMJ’s] allegations on [CML] and their expert(s) attempting to amend the areas of agreement, or seeking to rewrite or delete reasons for disagreement, the Tribunal is not in a position to rule upon those allegations, as these took place in a process without the Tribunal’s involvement, and on a without prejudice basis. The Tribunal also is not privy to the reasons why each expert chose to include or not include any text in the draft and the final joint expert report. Given the reasons stated above, the Tribunal denies [CMJ’s] request for the Tribunal to reconsider its directions of 14 August 2018. 37 CMJ’s lawyers responded in a long letter dated 24 August 2018, reiterating the fact that CML’s change of counsel had led to the Rejoinder evidence producing six new witnesses and three new expert reports, such that CMJ had not had a proper opportunity to respond to the new issues raised in that evidence.49Foot Note 49×Mr Yuen’s 1st Affidavit at para 124 and pp 2320-2326.CMJ expressed surprise that the Tribunal considered that it felt that there would be a sufficient opportunity for Prof Ling to express his views orally during the hearing. At para 11 of that letter a request was made for an additional 1.5 hours, over and above the 30 minutes that had been specified in the Arbitration’s “Hearing Arrangements/Schedule”, for the experts to make oral presentations.50Foot Note 50×Mr Lingard’s 1st Affidavit at para 224 and pp 498-501.Paragraphs 12-14 of the letter read as follows:51Foot Note 51×Mr Yuen’s 1st Affidavit at p 2323. 12 Given that the Tribunal has mandated a‘chess-clock’approach, there will be no prejudice to [CML] by such a direction as the additional apportionment of time to Mr. [C] and [CMJ’s] experts will come out of [CMJ’s] own total time. As the Tribunal will appreciate, [CMJ] are seeking to mitigate the procedural injustice which would be suffered by [CMJ] if there is no appropriate opportunity available to fairly and properly present their case and evidence to rebut [CML’s] new evidence that was introduced at the Rejoinder stage (as detailed below). 13  Alternatively, if the Tribunal feels that, because of the procedural history of this case, it would be unsatisfactory for it to hear [CMJ] and [CMJ’s] experts’ evidence and opinion on these new issues for the first time at the hearing (without the benefit of prior written submissions, opinions or evidence), it may prefer to simply disregard in their entirety all new issues and evidence (and all conclusions flowing from them) raised for the first time in [CML’s] Rejoinder and accompanying witness statements and expert reports upon which [CMJ] and their experts have not had an opportunity to respond. 14  To allow those issues and evidence to remain extant, without affording [CMJ] an opportunity to fully present their case on those issues and evidence, is an outcome that [CMJ] are confident the Tribunal is mindful to avoid. 38 The request for an extra 1.5 hours was granted by an e-mail from the Tribunal dated 28 August 2018, but the Tribunal made it plain that the additional time did not authorise the introduction of new materials or documents.52Foot Note 52×Mr Yuen’s 1st Affidavit at para 126 and pp 2328-2329.In addition, by an e-mail dated 31 July 2018, the Tribunal granted CMJ an additional four hours to present their case and cross-examine CML’s witnesses on the basis that CML had more witnesses, some of whose evidence required translation.53Foot Note 53×Mr Lingard’s 1st Affidavit at para 227(a) and p 532. 39 Prior to the evidentiary hearing, the parties submitted Opening Submissions which were supposed to be subject to a 30-page limit but which, in CMJ’s case, ran to 39 pages and contained reference to some 355 pages of additional material.54Foot Note 54×Mr Lingard’s 1st Affidavit at para 137.By a letter to the tribunal dated 4 September 2018, CML’s lawyers objected to the excessive length and the introduction of the new material by CMJ.55Foot Note 55×Mr Lingard’s 1st Affidavit at para 138 and pp 534-535.By an e-mail dated 5 September 2018, the Tribunal allowed CMJ’s 39-page Opening Submissions and directed that the additional material contained therein be admitted.56Foot Note 56×Mr Lingard’s 1st Affidavit at para 141 and p 538. 40 The hearing took place in Singapore between 10 and 20 September 2018. So far as the expert evidence was concerned, the Tribunal adopted a witness conferencing procedure which, as indicated, allowed each party’s PRC expert to give a 30-minute presentation followed by questioning from the Tribunal and the parties’ counsel. However, at the hearing, Prof Ling’s presentation took 45 rather than 30 minutes.57Foot Note 57×Mr Yuen’s 1st Affidavit at pp 2053-2072. 41  No further procedural objections were taken in relation to the expert evidence and, following two rounds of closing submissions, the Award running to 722 paragraphs was issued on 11 June 2020.",
        "CMJ’s Grounds of Objection": "42 CMJ raise three grounds for asserting that they were not given a fair opportunity to present their case and that the Tribunal failed to apply its mind to important aspects of their submissions in the Arbitration. These are expressed in CMJ’s written submissions as follows:58Foot Note 58×Plaintiffs’ Written Submissions (“PWS”) at para 36. [CMJ] were denied of a full opportunity to present their case from the Tribunal’s failure to allow [CMJ] to admit two witness statements to respond to new factual issues raised for the first time in [CML’s] Rejoinder, which resulted in real prejudice to [CMJ]; The Tribunal denied [CMJ’s] expert the chance to state his reasons and areas of disagreement in the [JER] by ordering, among other things, that the parties’ experts must agree on the list of areas of non-agreement, failing which the Tribunal will not accept any report on the areas of non-agreement. This resulted in [CMJ] being denied of a full opportunity of responding to [CML’s] case; and The Tribunal, in failing to give adequate reasons as required under Article 31(2) of the Model Law, failed to apply its mind to important aspects of [CMJ’s] submissions on the issue of the existence, scope and nature of [CML’s] duty to drill for additional gas. 43 The first of these relates to the non-admission of the witness statements of Mr C (namely, BT2) and Mr D. As indicated, Mr Giam SC had confirmed at the hearing before me that CMJ were not pursuing the objection in relation to the latter (see [16] above). So far as concerns Mr C’s evidence, there was an issue in the Arbitration as to whether CML had been in breach of their contractual duty to drill for additional gas. In the Award, there was a factual finding that CML had complied with their duty to drill for additional gas and thus was not in breach. CMJ contends that the failure to admit BT2, which related to this issue, meant that CMJ had been denied the opportunity properly to respond to evidence given in the Rejoinder and, hence, that the refusal to admit BT2 caused real prejudice. 44 The second is expressed as being an objection based upon the form of the JER of the PRC law experts.  In the course of the oral submissions before me it became clear that the objection was in truth an objection about the conduct of CML in filing Prof Liu’s report as part of the Rejoinder evidence rather than with the Defence. Thus CMJ had been denied the opportunity to respond by way of a full written report from Prof Ling in the Reply evidence and the procedure directed by the Tribunal for dealing with the late filed report of Prof Liu denied CMJ a proper opportunity of responding to CML’s case. 45 The third is an assertion, related to the first, based upon an alleged legal duty to drill for additional gas arising out of a letter dated 15 July 2011 from CML to CMJ (“the 15 July 2011 Letter”).59Foot Note 59×Mr Yuen’s 1st Affidavit at p 2332. 46 Before turning to each of these grounds I shall first consider the legal principles applicable to an application seeking to set aside an arbitral award. There was no material dispute between the parties as to these principles, which are well-settled.",
        "The Applicable Legal Principles": "47 The First Schedule to International Arbitration Act 1994 (Cap 143A, 2002 Rev Ed) (“IAA”) contains the UNCITRAL Model Law on International Commercial Arbitration (“the Model Law”) which applies to the Arbitration. 48 Article 34(1) of the Model Law provides that an application for setting aside an award to the appropriate supervisory court is the sole means by which an award can be challenged. Such an application can only be made on one or more of the grounds specified in Art 34(2). In this case, the relevant ground is found in Art 34(2)(a)(ii) and/or (iv), which read: (ii)the party making the applicationwas not given proper notice of the appointment of the arbitrator or was otherwiseunable to present his case; or … (iv)  the composition of the arbitral tribunal orthe arbitral procedure was not in accordance with the agreement of the parties... [emphasis added] 49 The reference to being “unable to present his case” is a reference back to Art 18 of the Model Law, which requires that “[t]he parties shall be treated with equality and each party shall be given a full opportunity of presenting his case”. 50 Section 24 of the IAA amplifies upon this by providing: Notwithstanding Article 34(1) of the Model Law, the General Division of the High Court may, in addition to the grounds set out in Article 34(2) of the Model Law, set aside the award of the arbitral tribunal if — (a)  the making of the award was induced or affected by fraud or corruption; or (b)  a breach of the rules of natural justice occurred in connection with the making of the award by which the rights of any party have been prejudiced. 51 The general principles for setting aside an award on the basis of a breach of natural justice were summarised by the Court of Appeal inSoh Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007] 3 SLR(R) 86 (“Soh Beng Tee”).  I draw attention to the following observations inSoh Beng Tee, which are relevant to this case: (a) it is indispensable to the requirement in every arbitration that the parties should have an opportunity to present their respective cases as well as to respond to the cases against them (at [42]); (b) it is not a ground for intervention that the court considers that it might have done things differently or expressed its conclusions on the essential issues at greater length (at [58]); (c) the judicial philosophy is of minimal curial intervention so that the court’s supervisory role should be exercised with a light hand and the arbitrators’ discretionary powers should be circumscribed only by the law and by the parties’ agreement (at [59]-[60]); (d) the courts are not a stage where a dissatisfied party can have a second bite at the cherry (at [65(b)]); (e) the court will not intervene because it might have resolved the issues differently (at [65(c)]); (f) there must be a real basis for alleging that the arbitrator has conducted the arbitral process either irrationally or unreasonably (at [65(d)]); (g) each case should be decided within its own factual matrix and it is not the function of the court “to assiduously comb an arbitral award microscopically in attempting to determine whether there was any blame or fault in the arbitral process” (at [65(f)]); (h) an applicant who seeks to set aside an arbitral award must establish (at [29]): (i) which rule of natural justice was breached; (ii) how it was breached; (iii) in what way the breach was connected to the making of the award; and (iv) how the breach did or could prejudice its rights. 52 As to the fourth of these, the Court of Appeal inSoh Beng Teeemphasised that there must be something more than the existence of a breach of natural justice - it must also be shown that the breach might realistically have led to a different outcome (at [86]-[90]). 53 This aspect was considered further by the Court of Appeal inLW Infrastructure Pte Ltd v Lim Chin San ContractorsPte Ltd[2013] 1 SLR 125 (at [54]): The proliferation of labels may not ultimately be helpful. Nevertheless, it is important to bear in mind that it is never in the interest of the court, much less its role, to assume the function of the arbitral tribunal. To say that the court must be satisfied that a different result would definitely ensue before prejudice can be said to have been demonstrated would be incorrect in principle because it would require the court to put itself in the position of the arbitrator and to consider the merits of the issue with the benefit of materials that had not in the event been placed before the arbitrator. Seen in this light, it becomes evident that the real inquiry is whether the breach of natural justice was merely technical and inconsequential or whether as a result of the breach, the arbitrator was denied the benefit of arguments or evidence that had a real as opposed to a fanciful chance of making a difference to his deliberations. Put another way, the issue is whether the material could reasonably have made a difference to the arbitrator; rather than whether it would necessarily have done so. Where it is evident that there is no prospect whatsoever that the material if presented would have made any difference because it wholly lacked any legal or factual weight, then it could not seriously be said that the complainant has suffered actual or real prejudice in not having had the opportunity to present this to the arbitrator … 54 Both parties drew my attention to the recent Court of Appeal decision inChina Machine New Energy Corp v Jaguar Energy Guatemala LLCand another[2020] 1 SLR 695 (“China Machine”).The Court of Appeal summarised the applicable principles on the setting aside of an arbitral award for breach of natural justice, as follows (at [104]): The foregoing discussion of the applicable principles may be summarised as follows: (a) The parties’ right to be heard in arbitral proceedings finds expression in Art 18 of the Model Law, which provides that each party shall have a “full opportunity” of presenting its case. An award obtained in proceedings conducted in breach of Art 18 is susceptible to annulment under Art 34(2)(a)(ii) of the Model Law and/or s 24(b) of the IAA. (b)  The Art 18 right to a ‘full opportunity’ of presenting one’s case is not an unlimited one. It is impliedly limited by considerations of reasonableness and fairness. (c)  What constitutes a ‘full opportunity’ is a contextual inquiry that can only be meaningfully answered within the specific context of the particular facts and circumstances of each case. The overarching inquiry is whether the proceedings were conducted in a manner which was fair, and the proper approach a court should take is to ask itself if what the tribunal did (or decided not to do) falls within the range of what a reasonable and fair-minded tribunal in those circumstances might have done. (d) In undertaking this exercise, the court must put itself in the shoes of the tribunal. This means that (i) the tribunal’s decisions can only be assessed by reference to what was known to the tribunal at the time, and it follows from this that the alleged breach of natural justice must have been brought to the attention of the tribunal at the material time; and (ii) the court will accord a margin of deference to the tribunal in matters of procedure and will not intervene simply because it might have done things differently.",
        "Ground 1: The non-admission of BT2": "55 As I have recorded above (at [43]), the alleged breach of natural justice lay in the Tribunal’s decision not to allow BT2 to be adduced in evidence, such that CMJ were not given a full opportunity of presenting their case within the meaning of Art 18 of the Model Law. 56 It is contended that this evidence is relevant to, and could have served to undermine, the conclusions reached by the Tribunal at paras 519-521 and 523-524 of the Award.60Foot Note 60×Mr Yuen’s 1st Affidavit at pp 195-196.Appropriately redacted to preserve anonymity, they read: 519 With respect to the [X] well, the contemporaneous documentation shows that the idea of drilling it was dropped after January 2015. The Tribunal notes that after January 2015, the TCM [Technical Committee] and JMC [Joint Management Committee] meetings, and the documents cited above, do not discuss the [X] well, and, by November 2017, the drilling of the [Y] well was proposed. [CMJ] subsequently agreed to the budget for the [Y] well in November 2017. 520 The Tribunal notes that [CML] did not present a drilling plan and detailed budget for the [X] well after the favourable economic evaluation of the well in November 2013 and April 2014 following the October 2013 meetings. [CML] as the Operator, could have made proposals to boost reserves, at a time where a revised estimate of the reserves made it impossible for the Sellers to achieve the requirements under the [contracts]. 521 However, contemporaneous evidence does not show that [CMJ] insisted on pushing through with the [X] well during this period. From the period starting January 2015, [CMJ] never brought up that they regarded the [X] well as essential, and never warned [CML] that they considered the failure to advance the plans as a dereliction of duty. … 523 Thus, it is apparent that the [X] well discussion stalled after January 2015 because of the more pressing issue of the low level of offtake. This sheds light on the probable reason why the [X] well design and budget were not put forward by [CML], and why in 2015, [CMJ] may not have approved a plan, given their more urgent priorities. In any case, there was nothing preventing [CMJ] from insisting on this in the JMCs [meetings]. There is no sufficient evidence showing that [CMJ] continued to strongly insist in progressing the work regarding the [X] well after January 2015. 524 Considering these, the Tribunal finds that [CML’s] failure to proceed with the arrangements for the [X] well was not a breach of its obligations as Operator. 57 In essence, CMJ’s case is that the evidence that Mr C proposed to give in BT2 would demonstrate that CMJ did continue to insist strongly that the work regarding the [X] well should be progressed at the relevant time. 58 CMJ’s case thus is: (a) there was a breach of natural justice in that CMJ’s right to be treated with equality and be given a full opportunity of presenting their case pursuant to Art 18 of the Model Law was undermined; (b) this was done by the Tribunal’s refusal to admit BT2, which was replying to new issues raised in the Rejoinder; (c) the breach was connected to the making of the Award in that it could have affected the conclusions reached at para 523 of the Award; and (d) the breach thus prejudiced CMJ’s rights. 59 CML challenges each limb of this argument. First, they contend that the material in BT2 was not in response to any new issues in the Rejoinder.  Second, even if it was, the Tribunal’s decision in exercising its discretion not to allow it to be admitted was proper and reasonable in all the circumstances. Third, any possibility of the parties not being treated with equality was removed by the Tribunal’s decision to allow CMJ the opportunity to adduce 30 minutes of evidence-in-chief from Mr C. Fourth, even if the evidence in BT2 had been adduced, it did not have the potential to undermine the conclusion at para 523 of the Award. It could not therefore have affected the outcome on that issue, so that CMJ have suffered no prejudice even if there was a breach of natural justice. 60 I do not propose to resolve the question of whether the relevant contents of BT2 were in response to new issues, merely expanded upon matters already covered in earlier evidence or raised new issues. The Tribunal was of the view that itdidexpand on the issues already raised and contained new allegations based, apparently, on recently acquired factual material (see [20] above). However, the Tribunal took steps to ensure that CMJ were not disadvantaged by its refusal to admit BT2, whatever be the status of the evidence, by allowing Mr C to give evidence-in-chief for 30 minutes. The question is whether those steps were, in the circumstances of this case, sufficient to avoid the breach of natural justice which CMJ now relies upon. 61 The starting point is to revert to para 8.10 of PO2 which is set out above (at [14]). This provision expressly anticipates that there may be a need for testimony from a witness which is offered to rebut an argument or evidence raised in the Rejoinder. Paragraph 8.10 of PO2 is not limited to testimony directed to issues raised for the first time in the Rejoinder. It was thus open to CMJ to adduce oral evidence from Mr C directed at any part of the Rejoinder evidence. Indeed, CMJ appreciated this in their letter of 18 July 2018 (the contents of which I have set out above at [16]), where they contended that it would be better to submit BT2 prior to the evidentiary hearing rather than make the same points in examination-in-chief. 62 In its ruling on 2 August 2018, the Tribunal refused to allow BT2 to be introduced in evidence (see [20] above). This was an exercise of discretion based upon its analysis of the nature of the evidence, the proximity of the hearing, the fact that the experts would have to consider the new evidence when they were already in the final stages of drafting the JERs and the fact that CML would not have an opportunity to peruse and respond to the evidence before the hearing. 63 In response to the refusal, CMJ requested that Mr C should be allowed 30 minutes to give evidence-in-chief and be allowed to adduce further materials in support. The former request was allowed but the latter was not (see [21] above). There was thereafter no protest by CMJ that the inability to adduce further materials rendered it impossible for Mr C to give the evidence which CMJ wished him to give. 64 The Tribunal was placed in a not unfamiliar but nonetheless invidious position of having to deal with late applications to adduce evidence. On the one hand, a refusal to admit the evidence could lead to an injustice, but to admit it could also lead to an injustice to the other party in having to grapple with the new evidence as well as preparing for the hearing. Accommodating the needs of both parties could possibly have the result of jeopardising the hearing date, which in a case such as this would be thoroughly undesirable. 65 To my mind, this is a case where the observations of the Court of Appeal inChina Machine([54] above) are particularly apposite. This was a matter of procedure and the Tribunal did its best to be fair to both parties consistent with adhering to the existing procedural timeline (see [8] above). I do not consider that what the Tribunal did falls out with the range of what a reasonable and fair-minded tribunal might have done in the circumstances of this case.  There was therefore no breach of natural justice in the Tribunal’s refusal to admit BT2. 66 Even if I were to be wrong in this, I consider that CMJ’s case on the issue fails on other grounds as well.  I shall briefly explain my reasoning. 67 First, CMJ assert that the evidence in BT2 would serve to demonstrate that they did insist strongly that the work regarding the [X] well should be progressed.  I do not read it as so doing. Instead, BT2 deals with Mr C’s concerns that the [Y] well was being proposed (see para 15 of BT2)61Foot Note 61×Mr Yuen’s 1st Affidavit at p 1822.and that CML were taking a negative view of other wells including [X] (see paras 17, 23 and 28 of BT2).62Foot Note 62×Mr Yuen’s 1st Affidavit at pp 1823, 1825-1826.Whilst Mr C makes it plain that CMJ did not agree with that view, he concluded at para 33 of BT2 that:63Foot Note 63×Mr Yuen’s 1st Affidavit at pp 1827-1828. [i]mportantly, [CMJ] did not insist on the immediate implementation of the alternative proposals of [X], [A] and [B] wells because, as [the chief representative of CML] said during the meeting, the production capacity limitation of the Platform meant that even with further reserves, the daily production rate could not be increased, it therefore made commercial sense to drill one well at a time as this was all that the Platform could handle. 68 This evidence is inconsistent with the suggestion that CMJ strongly insisted that the [X] well should be progressed. Therefore, even if the evidence in BT2 was admitted, the Tribunal would not have come to a conclusion different from the one it had reached at para 523 of the Award. As such, even if there had been any breach of natural justice as a result of the Tribunal’s refusal to admit BT2, it would not have prejudiced CMJ. 69 Second, when giving oral evidence, Mr C did not say that he had “strongly insisted” that wells such as [X] should be proceeded with.64Foot Note 64×Mr Lingard’s 1st Affidavit at para 149 and pp 1823-1839.His evidence was that he was critical of the decision to proceed with the [Y] well and discussed possible alternatives with CML but did no more than that. Mr C was therefore given the opportunity at the evidentiary hearing to adduce the evidence that CMJ now says should have been admitted, but he did not.  CMJ has therefore not demonstrated that, on the material actually before the Tribunal, its reasoning was either “irrational or capricious” (seeSoh Beng Tee([51] above) at [65(d)]). 70 At the hearing before me, Mr Giam SC sought to draw my attention to certain documents which were not before the Tribunal which he contended supported the suggestion that CMJ had insisted that other wells be drilled. I declined to allow CMJ to rely upon these documents. As I explained in myex temporedecision released to the parties in the course of the hearing before me,65Foot Note 65×Transcript, 2 Nov, p 13 line 22- p 14 line 32.it is not for this court to look at material which was not before the Tribunal. Any suggestion that there is a failure of natural justice on the part of the Tribunal in carrying out its function must focus on the material that was before it (seeChina Machine([54] above) at [104(d)]). It cannot be right that the court now, in a setting aside application, allows further material to be relied upon and then seeks to place its own judgment on that material, in place of that of the Tribunal. 71 There cannot be a breach of natural justice if a party was given an opportunity by the tribunal to adduce evidence but did not avail itself of that opportunity, save in circumstances where it considered that the opportunity was an insufficient one and brought that to the attention of the tribunal at the material time. This CMJ did not do. 72 For all these reasons therefore, in the circumstances of this case, there was no breach of natural justice in the Tribunal’s refusal to admit BT2.",
        "Ground 3: The additional gas issue": "73 It is convenient to consider the third ground before the second as it is factually related to the first of CMJ’s objections. In the Arbitration, CMJ contended that CML had a separate and independent duty to drill for additional gas. This is said to arise from the 15 July 2011 Letter (see [45] above), the last sentence of which (suitably redacted) reads:66Foot Note 66×Mr Yuen’s 1st Affidavit at p 2332. In the very unlikely case that, after implementing the development plan as specified in the ODP [Overall Development Plan], the production level is less than the minimum level in the ODP, [CML] will consult with [CMJ] and will arrange for additional development wells to be drilled to ensure that the production level reaches such minimum level of production. 74 CMJ’s case is succinctly stated in the following paragraphs of their written submissions:67Foot Note 67×PWS at paras 87-90. 87 It is [CMJ’s] case that, based on the representations made in [the 15 July 2011 Letter], [CML] had an independent duty to drill for Additional Gas if a shortfall arose. In the Award, the Tribunal did not consider whether a separate duty to drill on part of [CML] arose from [the 15 July 2011 Letter] but rather focused solely on whether such duty arose from the parties’ discussions and agreement at the JMC. The Tribunal then dismissed [CMJ’s] claims with respect to Additional Gas on the basis [CMJ] did not continue to insist on progressing the work regarding the [X] well after January 2015. Paragraph 523 of the Award states that: [citing para 523 of the Award] 88 [CMJ] submit[s] that the Tribunal had come to this conclusion without specifically making a finding as to whether [CML] had been under an obligation to drill for Additional Gas in the first place. Had such an independent duty existed, [CMJ’s] insistence or otherwise at the JMC would not have been the key determining factor. Rather, [CML] would have been under an independent duty to ensure that the relevant plans for the drilling of wells for Additional Gas were made and presented to the JMC. 89 The Tribunal dismissed [CMJ’s] case on [CML’s] obligation to drill additional wells on the factual basis that the JMC never approved the [X] well and [CMJ] did not insist on progressing the work regarding the well after January 2015. The Tribunal never made a finding on [CMJ’s] point that [CML] independently had the duty to drill for additional gas. 90 The issue of whether [CML] was under any duty to drill for Additional Gas was an essential issue as it was [CMJ’s] case during [the Arbitration] that [CML] breached its duty to drill for Additional Gas, and this was directly relevant to the issue of whether [CML] had breached their obligations to [CMJ]. As such, it is submitted that this was a failure of the Tribunal to apply its mind to an important aspect of [CMJ’s] submissions. 75 In relation to CMJ’s contention that this issue was an essential issue, CML drew my attention, in particular, to the observations of the High Court inTMM Division Maritima SA de CV v Pacific RichfieldMarine Pte Ltd[2013] 4 SLR 972 (at [72]-[74]):68Foot Note 68×Defendants’ Written Submissions (“DWS”) at para 348. 72     An arbitral tribunal is not obliged to deal with every argument. It is neither practical nor realistic to require otherwise. Toulson J summed up neatly the extent of the arbitral tribunal’s obligation inAscot Commodities NV v Olam International Ltd[2002] CLC 277 at 284 … : Nor is it incumbent on arbitrators to deal withevery argument on every point raised. But an award should deal, however concisely, with allessentialissues. 73     All that is required of the arbitral tribunal is to ensure that the essential issues are dealt with. The arbitral tribunal need not deal with eachpointmade by a party in an arbitration:Hussman (Europe) Ltd v Al Ameen Development and Trade Co[2000] 2 Lloyd’s Rep 83 … at [56]. In determining the essential issues, the arbitral tribunal also should not have to deal with every argument canvassed under each of the essential issues. 74     What then is considered ‘essential’? This is not easy to define. Notwithstanding, in my view, arbitral tribunals must be given fair latitude in determining what is essential and what is not. An arbitral tribunal has the prerogative and must be entitled to take the view that the dispute before it may be disposed of without further consideration of certain issues. A court may take a contrary viewex post facto, but it should not be too ready to intervene. [emphasis in original] 76 In relation to the question of whether the Tribunal has, in fact, failed to consider an essential issue, CML relied upon the Court of Appeal’s decision inAKNand another v ALC and others and other appeals[2015] 3 SLR 488 (at [46] and [59]): 46 To fail to consider an important issue that has been pleaded in an arbitration is a breach of natural justice because in such a case, the arbitrator would not have brought his mind to bear on an important aspect of the dispute before him. Consideration of the pleaded issues is an essential feature of the rule of natural justice that is encapsulated in the Latin adage,audi alteram partem… what must be shown to make out a breach of natural justice on the basis that the arbitrator failed to consider an important pleaded issue. It will usually be a matter of inference rather than of explicit indication that the arbitrator wholly missed one or more important pleaded issues. However, the inference – that the arbitrator indeed failed to consider an important pleaded issue – if it is to be drawn at all, must be shown to be clear and virtually inescapable. If the facts are also consistent with the arbitrator simply having misunderstood the aggrieved party’s case, or having been mistaken as to the law, or having chosen not to deal with a point pleaded by the aggrieved party because he thought it unnecessary (notwithstanding that this view may have been formed based on a misunderstanding of the aggrieved party’s case), then the inference that the arbitrator did not apply his mind at all to the dispute before him (or to an important aspect of that dispute) and so acted in breach of natural justice shouldnotbe drawn. … 59 With respect, poor reasoning on the part of an arbitral tribunal is not a ground to set aside an arbitral award; even a misunderstanding of the arguments put forward by a party is not such a ground. … the court ‘is not required to carry out a hypercritical or excessively syntactical analysis of what the arbitrator has written’ when considering whether an arbitral award should be set aside for breach of natural justice. Neither should it approach an arbitral award with a ‘meticulous legal eye endeavouring to pick holes, inconsistencies and faults … with the objective of upsetting or frustrating the process of arbitration’ …. 77 It is not suggested that the Tribunal did not have in mind CMJ’s argument that CML had a separate and independent duty to drill for additional gas, as the Tribunal specifically referred to it at para 491 of the Award:69Foot Note 69×Mr Yuen’s 1st Affidavit at p 190. According to [CMJ], [CML] had the obligation to appraise and develop Additional Gas in accordance their duties as a Reasonable Prudent Operator, under the rolling development strategy,andunder the 15 July 2011 Letter … [emphasis added] 78 Thereafter, at paras 492-503 of the Award,70Foot Note 70×Mr Yuen’s 1st Affidavit at pp 190-192.the Tribunal set out the respective arguments of the parties, which included, at para 499, CML’s contention that there was no such legal obligation on their part arising from the 15 July 2011 Letter to drill additional wells as that decision was reserved to the JMC.71Foot Note 71×Mr Yuen’s 1st Affidavit at p 191. 79 The Tribunal then considered those submissions at paras 504–524 of the Award and concluded that there was no breach of CML’s obligations in this regard.72Foot Note 72×Mr Yuen’s 1st Affidavit at pp 192-196. 80 Reading these paragraphs as a whole, it is clear Tribunal had well in mind the two ways in which CMJ put their case: based on CML’s duties as a reasonable and prudent operator and, alternatively, on CML’s alleged duties arising from the 15 July 2011 Letter. It equally had well in mind that drilling decisions were to be subject to the authorisation of the JMC. At para 509 of the Award,73Foot Note 73×Mr Yuen’s 1st Affidavit at p 193.the Tribunal also held that it was apparent from the statements in the JMC meetings as well as in other documents that CMJ themselves had “proceeded very carefully about the plan of additional drilling”. 81 Whilst it does not expressly state that the obligations placed on CML by the terms of the 15 July 2011 Letter were the same as those placed on them as a reasonable and prudent operator, the inescapable conclusion is that it is implicit from the Tribunal’s reasoning that it did. Indeed, it would make no commercial sense to interpret the wording of the 15 July 2011 Letter as imposing a duty on CML to drill wells which no reasonably prudent operator would consider it was viable to drill, which is what CMJ’s submissions amount to. 82 I therefore accept that the question of whether CML’s conduct constituted a breach of their obligations under,inter alia, the terms of the 15 July 2011 Letter had been raised before the Tribunal. I do not accept that there was a failure in the Award properly to address this issue and I therefore find that there was no breach of natural justice in the way in which the Tribunal approached this issue.",
        "Ground 2: The PRC law issue": "83 CMJ’s submission is a clear one. They adduced expert evidence in the form of the Ling Report as part of the Statement of Claim in April 2017 (see [9] above). CML did not adduce any PRC law evidence in their Defence which was served in October 2017 (see [9] above). There was therefore no need for CMJ to adduce any evidence on PRC law as part of their Reply evidence in March 2018. CML did however adduce the Liu Report as part of their Rejoinder evidence on 18 June 2018, a month before the JERs were due on 23 July 2018 (see [10] above). Accordingly, CMJ were denied the opportunity, of responding to CML’s PRC law evidence whilst preparing their Reply – a period of some five months following the service of the Defence. The conduct of CML thus put CMJ in a position of inequality and denied them the full opportunity of presenting their case as Art 18 of the Model Law mandates. 84 CMJ, quite reasonably and properly, did not seek an order that the Liu Report was not to be admitted in evidence. That would have amounted to a denial of CML’s right properly to present their case unless CML’s conduct was such as to warrant such a draconian order. Provided that the report could be admitted without prejudicing CMJ’s right to respond in an appropriate way, there would be equality, notwithstanding CML’s regrettable conduct in adducing the Liu Report late. 85 CMJ however contends that the directions which the Tribunal did give denied them this opportunity.  CMJ says they sought to use the JER process to set out the areas of disagreement in relation to matters set out in the Liu Report, but this was opposed by CML and the Tribunal agreed with CML. Although the Tribunal allowed the additional 10 PRC law authorities to be adduced and granted CMJ the latitude to have an additional 1.5 hours over and above the 30 minutes for their experts (including Prof Ling) to make oral presentations during the evidentiary hearing (see [37]-[38] above), this did not give Prof Ling a proper opportunity to deal fully with the matters raised by Prof Liu and thus constituted a material breach of Art 18 of the Model Law. 86 For their part, CML make three points. First, that the procedure adopted by the Tribunal was fair and that it certainly did not constitute the sort of unreasonable behaviour on the part of the Tribunal that would justify the intervention of the court on a setting aside application. Secondly, that the procedure adopted was procedure that CMJthemselvesproposed and to which they made no complaint at that time. Third, that, in any event, CMJ have suffered no prejudice even if there was a breach of natural justice in the way in which the expert evidence was adduced. 87 I have set out earlier the way in which this issue arose and the manner in which the Tribunal had directed that Prof Ling’s evidence should be adduced (see [23]-[41] above). The first point to note is that at no time did CMJ seek permission from the Tribunal to adduce a further written report from Prof Ling. It sought to achieve the same result by modifying the JER process so that the JERs contained, by way of an explanation of the areas of disagreement, additional material from Prof Ling to refute assertions made by Prof Liu. This course of action was rejected by the Tribunal, but it did allow the 10 additional PRC law authorities to be introduced by Prof Ling and, following repeated requests from CMJ, did accede to CMJ’s request for an extra 1.5 hours over and above the 30 minutes previously provided for their experts’ oral presentations. The Tribunal also gave CMJ an additional 4 hours to present their case and cross-examine CML’s witnesses. 88 In making these directions the Tribunal was implementing in the manner it deemed appropriate the procedure as set out at para 8.10 of PO2 (see [14] above) which specifically foresaw that there might be a need to receive oral testimony from a witness at the hearing to rebut evidence adduced in the Rejoinder. 89 When faced with late evidence, a court or tribunal is presented with the difficult task of balancing the potential unfairness to one party or the other in the way in which it permits the parties to respond and deal with that evidence, should it allow it to be adduced. It must bear in mind that “perfect justice” - by which I mean giving the party faced with dealing with the new evidence the opportunity that it otherwise would have had, had the new evidence been adduced on time - is seldom an option if the proposed hearing date is not to be lost. Adjourning a hearing, particularly in a case where there are numerous counsel and witnesses and there are three judges or arbitrators is a course which the overall interests of justice require should be avoided, if at all possible. 90 My instinct, on the facts of this case, would have been to give CMJ a brief period in which they could put in a further expert report from Prof Ling in response to the Liu Report and for the JER process for the PRC law issues to be delayed until after this had been done. But that is not what CMJ sought and the fact that I might have done things differently is not a relevant consideration (seeSoh Beng Tee([51] above) at [65(c)]). The relevant question is whether the proceedings were conducted in a manner which was fair within the specific context of the particular facts and circumstances of this case. I have to ask myself whether what the Tribunal did falls within the range of what a reasonable and fair-minded tribunal in those circumstances might have done. In doing so I must accord a margin of deference to the Tribunal in matters of procedure (see [62] above; see alsoChina Machine([54] above) at [104(c)]-[104(d)]). 91 On this basis, I conclude that the Tribunal did act in a way that was both fair and reasonable in the circumstances of this case. In so doing, I take into account the following: (a) it would have been unfair to deprive CML of the opportunity to adduce the Liu Report notwithstanding the fact that it could and should have been adduced as part of the Defence; (b) PO2 anticipated that further evidence might have to be adduced to rebut matters that arose as part of the Rejoinder and that this was to be done by way of oral evidence at the hearing; (c) the 10 additional PRC law authorities were introduced, as requested by CMJ; (d) CMJ were allocated an extra 1.5 hours for oral presentations by their experts and a total of four hours for presenting their case so as to be able to deal with issues that arose as part of the Rejoinder and that these issues were then canvassed fully in the written closing submissions; and (e) the course adopted by the Tribunal was calculated to, and did, avoid the possibility of having to adjourn the evidentiary hearing. 92 CMJ contended that oral testimony was not as good as written testimony but, as Mr Bull SC pointed out at the hearing before me, in those 1.5 hours, Prof Ling could have read out a prepared statement encapsulating all the material that he would have included in a reply report. CMJ also contended that time was taken up during those 1.5 hours in translating Prof Ling’s evidence for Prof Liu’s benefit. However, CMJ would have been aware that this would be necessary when they sought and were granted the additional 1.5 hours. It was also suggested that the Tribunal rushed Prof Ling when he gave his oral evidence.74Foot Note 74×Mr Yuen’s 1st Affidavit at paras 12 and 130.I have read the passages in the transcript of the proceedings when Prof Ling gave his oral evidence75Foot Note 75×Mr Yuen’s 1st Affidavit at pp 1955-2161.and I do not consider that the Tribunal was unfairly rushing Prof Ling. I agree with CML that, when the passages of the transcript are read in context, it is clear that the Tribunal was moving matters along in accordance with the timetable and Prof Ling was working with them to achieve this end.76Foot Note 76×Mr Lingard’s 1st Affidavit at para 186.He was not being treated unfairly. 93 Taking all these matters together, I am satisfied that there was no breach of natural justice and that this ground of objection by CMJ must fail. 94 In the light of this decision, I can deal with the other two contentions of CML briefly. Their second point was that the procedure adopted by the Tribunal was procedure that CMJ themselves proposed and to which they made no complaint at the material time. I do not consider that this is a fair assessment of the position. The initial course proposed by CMJ was rejected by the Tribunal and thereafter CMJ made various requests which, it is apparent from the correspondence, they considered represented the next best way forward if they were not to be allowed to proceed in the way which they thought would give them a proper opportunity to respond to the late evidence in the Rejoinder (see [35]-[37] above). It was a course proposed under protest, not by desire. This aspect of CMJ’s conduct is unlike that of an aggrieved party who had conducted itself before the tribunal on the footing that it remained content to proceed with the arbitration, but only to complain after the fact when it realised that an award has been made against it (seeChina Machine([54] above)at [168] and [170]). Had I concluded that there was a breach of natural justice, I would not have denied CMJ relief on this ground. 95 The third point was that, in any event, CMJ have suffered no prejudice even if there was a breach of natural justice in the way in which the expert evidence was adduced. There were two issues on which the PRC law experts disagreed. The first was as to whether the particular agency relationship between CMJ and CML constituted a “general” or “special” agency under PRC law.77Foot Note 77×Mr Yuen’s 1st Affidavit at paras 136-140; Mr Lingard’s 1st Affidavit at paras 88-89.The second related to the impact on that agency relationship under PRC law if the agent was an unpaid/uncompensated agent and of certain alleged limitations of liability of such an agent.78Foot Note 78×Mr Yuen’s 1st Affidavit at para 141; Mr Lingard’s 1st Affidavit at para 90.The contention made by CML in the Arbitration was that such an agency had existed in this case and that, as a result, Art 406 of the PRC Contract Law limited their liabilityvis-à-visCMJ to losses resulting from wilful misconduct or gross negligence.79Foot Note 79×PWS at para 64(b). 96 CML’s contention is that, although the Tribunal resolved the general/special agency issue in their favour, this was irrelevant to the final outcome as the Tribunal went on to hold that the relationship between the parties on agency was regulated by the contractual arrangements between them and did not depend on whether CML were a general or special agent.80Foot Note 80×DWS at paras 91–94.In particular, the Tribunal recorded at paras 253-255 of the Award that it had been common ground between Prof Ling and Prof Liu that under PRC law the contractual arrangements between the parties are the “primary” source of an agent’s duties.81Foot Note 81×Mr Yuen’s 1st Affidavit at pp 139-140.The latter was not challenged before me. I therefore accept that, even if the Tribunal acted in breach of natural justice by denying Prof Ling a proper opportunity to present the arguments on this issue, CMJ would have suffered no prejudice, since ultimately it was irrelevant to the outcome. 97 So far as concerns the unpaid/uncompensated agent issue, again, the Tribunal decided it in CML’s favour and concluded that in order for CML to be liable as an uncompensated agent, CMJ would have to prove that there had been a breach of duties which amounted to wilful misconduct or gross negligence (see paras 295-304 of the Award).82Foot Note 82×Mr Yuen’s 1st Affidavit at pp 150-151.But it then went on to consider each breach relied upon by CMJ (see paras 305-388 of the Award).83Foot Note 83×Mr Yuen’s 1st Affidavit at pp 151-169.CML contends that, in each case, the Tribunal found, either that the breach had not been proved on the facts, or that the alleged breach was not such as to fall within the scope of CML’s duties as an agent.84Foot Note 84×DWS at paras 96 and 295; Mr Lingard’s 1st Affidavit at para 91. 98 The Tribunal’s conclusions are summarised at paras 387-388 of the Award.85Foot Note 85×Mr Yuen’s 1st Affidavit at p 169.Briefly put, it held that almost all of the alleged breaches arose out of CML’s actions as co-seller rather than as agent and that, in so far as they did not, CMJ had failed to establish the factual basis of these allegations, far less that these were a result of CML’s wilful misconduct or gross negligence. Accordingly, I accept that, even if there was a breach of natural justice in relation to the unpaid/uncompensated agent issue, such that the finding that CML were an unpaid agent might be reviewed, this finding would only have become relevant if the Tribunal determined that CML had acted in wilful misconduct or gross negligence. 99 The Tribunal’s conclusion, however, was not premised on a finding that CML had acted in wilful misconduct. It found in favour of CML on the underlying facts. Since the issue of wilful misconduct or gross negligence did not arise, the outcome would have been the same irrespective of whether the Tribunal determined the unpaid/uncompensated agent issue in CML’s favour. CMJ has therefore suffered no relevant prejudice on this issue either.",
        "Conclusion": "100 For the reasons given, CMJ are not entitled to the declarations sought in the OS. It is therefore not necessary to consider whether the Award should be set aside or whether matters should be remitted to the Tribunal for further consideration. 101 The OS will be dismissed with costs. If the parties cannot agree the sums to be paid by way of costs, they should submit written submissions within 21 days and indicate whether they wish to have a hearing on the issues raised or whether they are content for the court to decide them without the need for a hearing. Simon ThorleyInternational Judge Giam Chin Toon SC, Lee Wei Yuen Arvin (Li Weiyun), Lyssetta Teo Li Lin, Tay Ting Xun Leon and Wan Hui Ting, Monique (Wen Huiting) (Wee Swee Teow LLP) for the plaintiffs; Cavinder Bull SC, Foo Yuet Min, Tay Hong Zhi, Gerald, Kellyn Lee Miao Qian and Aw Wei Jie Daryn Emmanuel (Drew & Napier LLC) for the defendants."
    }
}