{
    "case_title": "Tendcare Medical Group Holdings Pte Ltd (formerly known as Tian Jian Hua Xia Medical Group Holdings Pte Ltd) (in judicial management) and another vGong Ruizhong and others",
    "ncitation": "[2021] SGHC 80",
    "coram": "Kannan Ramesh J",
    "sections": {
        "Introduction": "1 In this action, the plaintiffs, Tendcare Medical Group Holdings Pte Ltd (“Tendcare”) and its judicial manager, Mr Yit Chee Wah (“Mr Yit”), allege that the 1st and 7th defendants, Mr Gong Ruizhong (“Mr Gong”) and Mr Miao Weiguo (“Mr Miao”) respectively, carried out a fraudulent scheme to defraud Tendcare’s institutional investors (“the Scheme”). The plaintiffs further allege that the other defendants dishonestly assisted Mr Gong and Mr Miao in perpetrating the Scheme and/or in knowingly receiving the proceeds of the Scheme. 2 The 2nd defendant, Hua Xia Tian Jian Pte Ltd (“HXTJ”), counterclaims against Tendcare for payment of sums made for and on the latter’s behalf pursuant to an alleged “Entrustment Agreement” between HXTJ and Tendcare (“the Entrustment Agreement”) dated 3 March 2014.",
        "Facts": "",
        "The parties": "3 Tendcare was incorporated in Singapore by Mr Gong on 20 February 2014 as Tian Jian Hua Xia Medical Group Holdings Pte Ltd. Mr Gong was appointed its director and held the position at all material times. At all material times, Mr Gong also beneficially owned at least 70.84% of the issued share capital of Tendcare through his wholly-owned company Gongs Global Investment Development Holdings Limited (“Gongs Global”). Tian Jian Hua Xia Medical Group Holdings Pte Ltd was renamed Tendcare on 5 November 2015. 4 Tendcare is an investment holding company that, up to 29 June 2017 (as elaborated at [14] below), owned and operated hospitals and other medical-related businesses through various direct and indirect subsidiaries incorporated in Hong Kong and the People’s Republic of China (“PRC”). I shall collectively refer to Tendcare and the companies that it owned as the “Tian Jian Group”. Tendcare became insolvent and an application for a judicial management order was filed on 12 June 2017 by OCA V Holdings Pte Ltd (“OCA”), a creditor. OCA concurrently filed an application for the appointment of Mr Yit as interim judicial manager. I allowed the latter application on 28 July 2017. On 11 September 2017, I allowed OCA’s application to place Tendcare under judicial management and appointed Mr Yit as judicial manager. 5 HXTJ was incorporated in Singapore on 15 July 2013 as an exempt private company. Mr Gong is its sole director and shareholder holding 2,500,001 shares which are fully paid-up. HXTJ is in the business of acting as commission agents. 6 The 3rd to 6th defendants are PRC citizens. They are alleged to be co-conspirators and dishonest assistants of Mr Gong in the Scheme. The claims against them have since been withdrawn. 7 Mr Miao is a Singapore citizen. He is the sole director and shareholder of the 8th defendant, Hui Xiang Group Pte Ltd (“HXG”), and the 10th defendant, Qian Hui Capital Limited (“QHC”). HXG was incorporated in Singapore on 30 March 2011 and is engaged in management consultancy. QHC was incorporated in Hong Kong on 14 January 2005 and, according to Mr Miao, serves as the private investment arm of HXG, investing in “high return multi-industry and multi-sector opportunities in China and across the Asia-Pacific region”. 8 The 9th defendant, Hui Xiang Group (HK) Limited (“HXG HK”), is a Hong Kong-incorporated company. Mr Miao is its sole director. Up until 31 March 2015, HXG HK was wholly-owned by HXG. Thereafter, it became a wholly-owned subsidiary of the Imperium Mining Company, a company incorporated in the Cayman Islands on 8 February 2012, of which Mr Miao is the sole director. 9 The 11th defendant, Ms Wang Zhengqing (“Ms Wang”), and the 12th defendant, Ms Gong Luyi (“Ms Gong”), are Mr Gong’s wife and daughter respectively.",
        "Background to the dispute": "The Tendcare IPO 10 On 3 September 2013, HXG entered into a memorandum of understanding (“the September 2013 MOU”) with Beijing Tianjian Huaxia Medical Investment Management Co Ltd (“BJTJ”). Mr Gong was at all material times the legal representative and chairman of BJTJ. The September 2013 MOU was entered into for the purpose of an initial public offering (“IPO”) of Tendcare that Tendcare was considering (“the Tendcare IPO”). The September 2013 MOU required HXG to engage two advisers, KPMG and MCL Capital Limited (“MCL”), to (a) advise on the pre-IPO restructuring of Tendcare, and (b) assist in pre-IPO fundraising and preparations for the Tendcare IPO. Three other terms are salient. First, BJTJ would pay HXG a monthly retainer of S$100,000 which included the fees payable by HXG to MCL and KPMG. Second, HXG would receive a success fee of 4.5% of any pre-IPO funds raised. Third, 6% of Tendcare’s pre-IPO undiluted shares would be issued to three key officers of HXG in equal proportions. The three officers were Mr Miao, Mr Sim Mong Teck (“Mr Sim”) and Mr Ryan Gwee Yuan Kerr (“Mr Gwee”). Mr Gwee was HXG’s Chief Executive Officer (“CEO”) from November 2011 to December 2014. Mr Sim, a lawyer admitted to the Singapore Bar, was retained to provide legal advice on the Tendcare IPO process. Mr Miao had previously engaged him in March 2011 to assist with the incorporation of HXG. 11 The September 2013 MOU was executed by Mr Gwee on behalf of HXG and Mr Gong on behalf of BJTJ. Mr Miao was aware of the September 2013 MOU. 12 The salient terms of the September 2013 MOU were elaborated on and included (excepting the allotment of the 6% shares) in a Letter of Engagement between BJTJ and HXG dated 19 September 2013 (“the 2013 HXG LOE”). This too was signed by Mr Gwee on behalf of HXG and Mr Gong on behalf of BJTJ. 13 Following the execution of the 2013 HXG LOE, work on the Tendcare IPO began. Mr Gwee and Mr Sim were heavily involved in the Tendcare IPO with Mr Gwee leading the IPO team and Mr Sim the legal team. Mr Hanford Cheung (“Mr Cheung”) of MCL oversaw project administration. Several independent professional services firms were engaged by Tendcare to advise on various aspects of the Tendcare IPO. The pre-IPO funders that Tendcare solicited investments from retained their own advisers. The firms retained by Tendcare and the pre-IPO funders included KPMG and PWC China, as financial advisers, and King & Wood Mallesons (“KWM”) and Sullivan & Cromwell, as legal advisers. The contemplated corporate structure of Tendcare 14 The pre-IPO restructuring of Tendcare resulted in Tendcare becoming the ultimate holding company of the Tian Jian Group. A wholly-owned subsidiary, Tian Jian Hua Xia Medical Group (HK) Limited (“Tian Jian HK”), was incorporated in Hong Kong. Tian Jian HK in turn owned 100% of the shares in Shanxi Tian Jian Hua Xia Business Trading Co Ltd (“Shanxi TJHX WFOE”), a company incorporated in the PRC. Shanxi TJHX WFOE was classified as a wholly foreign-owned entity, and appeared to be the vehicle by which investments into the PRC by non-PRC investors were facilitated. Shanxi TJHX WFOE held 100% of the shares in BJTJ, which in turn held the equity in all the operating units of the Tian Jian Group in the PRC. This was the corporate structure until 29 June 2017. On that date, Shanxi TJHX WFOE transferred all of its shares in BJTJ (and thus in effect ownership of all of the operating units of the Tian Jian Group which BJTJ held) to Shanxi Jinbang Energy Technology Group Co Ltd (“Shanxi Jinbang”), a company that was not part of the Tian Jian Group. Shanxi Jinbang was incorporated in the PRC on 4 January 2000 and until 2 June 2017, Mr Gong owned 99% of its shares. On that date, Mr Gong transferred his shares to the 3rd defendant. The involvement of Luxe and NYC in the Tendcare IPO 15 On 2 June 2014, NYC Investments Limited (“NYC”) and Luxe Heritage Capital Management Limited (“Luxe”) entered into a share purchase agreement (“SPA”) with Tendcare (“the NYC/Luxe SPA”). NYC and Luxe were special-purpose vehicles (“SPVs”) incorporated in the British Virgin Islands (“BVI”) and respectively owned by Mr Sim and Mr Gwee. The NYC/Luxe SPA provided that NYC and Luxe would respectively subscribe for 441 and 882 new shares in Tendcare (representing 2% and 4% of Tendcare’s undiluted ordinary shares). The consideration was US$12,145,532.49 and US$24,291,064.98 respectively. This worked out to US$27,540.89 per share. The NYC/Luxe SPA further provided that NYC and Luxe would transfer to Tendcare an initial payment of US$810,000 (“the Initial Payment”) on completion of the NYC/Luxe SPA, with the balance to be paid upon notification by Tendcare. The Atlantis Investments 16 Shortly after, in anticipation of the Tendcare IPO, Atlantis China Star Fund Limited (“Atlantis China”) and EFG Atlantis China Pre-IPO Master Fund LP (“EFG Atlantis”) (collectively, “Atlantis”) agreed to respectively subscribe for 174 and 521 new ordinary shares of Tendcare at US$28,776.98 per share, pursuant to SPAs dated 3 June 2014. The waiver of payment for the NYC/Luxe shares 17 Sometime in 2014, Mr Gong (on behalf of Tendcare), Mr Gwee (on behalf of Luxe) and Mr Sim (on behalf of NYC) entered into a memorandum of understanding (“the 2014 MOU”). The 2014 MOU was undated. Under the terms of the 2014 MOU, the parties “[agreed] and [confirmed]” that, “notwithstanding” the terms of the NYC/Luxe SPA, their “true and mutual intentions” was for the Tendcare shares to be issued thereunder to be free “in consideration for services rendered to BJTJ and its intended group of restructured companies”. The 2014 MOU further provided that the total consideration for the shares of US$36,436,597.47 would be “fully funded” by Mr Gong instead of being paid by NYC and Luxe. To this end, the parties entered into a waiver agreement dated 5 June 2013 to reduce the Initial Payment from US$810,000 to US$10,000. Mr Yit asserts that the waiver agreement should be dated 5 June 2014 instead. Mr Sim paid the sum of US$10,000 to Tendcare on 6 June 2014. 18 Subsequently, in 2014, Tendcare, Luxe and NYC entered into a “Supplement to the Ordinary SPA” (“the Supplemental Agreement”). The Supplemental Agreement was executed by Mr Gong, Mr Gwee and Mr Sim on behalf of Tendcare, Luxe and NYC respectively. Under the terms of the Supplemental Agreement, the price per share stated in the NYC/Luxe SPA was reduced from US$27,540.89 to US$14,603.17, thereby reducing the total consideration for the shares from US$36,436,597.47 to US$19,320,000. 19 Mr Miao asserts that he found out about Luxe and NYC from Mr Gong in early December 2014. Mr Miao was told that the 6% of the undiluted ordinary shares of Tendcare that were promised to Mr Gwee, Mr Sim and himself under the September 2013 MOU had been issued to NYC and Luxe under the NYC/Luxe SPA. Mr Miao became angry as a result and felt that his trust in Mr Gwee and Mr Sim had been “misplaced”. Shortly thereafter, pursuant to a shareholder’s resolution dated 15 December 2014, Mr Miao dismissed Mr Gwee as CEO of HXG and terminated the services of Mr Sim with immediate effect. By a termination agreement dated 17 December 2014, HXG terminated the 2013 HXG LOE with BJTJ. The agreement was signed by Mr Miao on behalf of HXG and Mr Gong on behalf of BJTJ. 20 Following a meeting on 26 January 2015 (“the 26 January 2015 Meeting”), Mr Gong, Mr Miao, Mr Gwee and Mr Sim entered into an agreement dated 26 January 2015 (the “Termination Agreement”). The Termination Agreement provided for the termination of the 2014 MOU and all related agreements, including the NYC/Luxe SPA and the Supplemental Agreement. Under the Termination Agreement, each party agreed to release and absolve the other from any unsatisfied debts, responsibilities or obligations arising out of or in connection withinter aliathe September 2013 MOU and the 2014 MOU. Mr Gwee and Mr Sim also agreed to relinquish all their rights and interests in Luxe and NYC in favour of Gongs Global. As a result of the Termination Agreement, the shares in Tendcare held by NYC/Luxe reverted to Gongs Global. Mr Gwee and Mr Sim therefore did not each receive the 2% undiluted ordinary shares in Tendcare that had been promised under the September 2013 MOU. 21 With the Termination Agreement, Mr Gwee and Mr Sim ceased to be involved in the Tendcare IPO. Following Mr Gwee’s disengagement, Mr Cheung took over as the new CEO of HXG. Events after the Termination Agreement 22 Subsequent to the Termination Agreement, Mr Gong (on behalf of Tendcare) and Mr Miao (on behalf of HXG) entered into three agreements (the “Post-Termination Agreements”),viz: (a) A Success Fee Agreement dated 1 February 2015 under which HXG agreed to provide assistance on pre-IPO fund raising in return for a success fee of 5.5% of the pre-IPO funding raised. This was an increase from the 4.5% success fee agreed under the September 2013 MOU. (b) An IPO Shares Agreement and a Retainer Agreement both dated 1 February 2015 under which HXG agreed to provide assistance on the reorganisation of Tendcare’s medical business in preparation for the Tendcare IPO, in return for (i) Gongs Global issuing 3% of the undiluted ordinary shares in Tendcare to either QHC or Mr Miao (as opposed to the 2% which Mr Miao was to receive under the September 2013 MOU), and (ii) HXTJ paying QHC a monthly retainer fee of HK$300,000 until Tendcare was listed (as opposed to the S$100,000 that BJTJ was to pay to HXG under the September 2013 MOU). Other investors invest in Tendcare 23 In anticipation of the Tendcare IPO, Easom Limited (“Easom”) entered into a SPA dated 4 February 2015 to subscribe for 1,686 new ordinary shares in Tendcare at US$29,648.60 per share (“the Easom SPA”). On 31 March 2015, Mari Mundi III Limited (“MMIII”), a unit of China Merchant Capital, extended a loan of US$40m to Tian Jian HK as pre-IPO financing. The MMIII loan was secured byinter aliacharges over Mr Gong’s shares in Gongs Global and Tendcare’s shares in Tian Jian HK, following the pre-IPO restructuring of the Tian Jian Group as noted above at [14]. Six months later, OCA agreed to provide a US$19,978,280 loan to Tendcare via a Convertible Note Subscription Agreement (“OCA CNSA”) dated 10 September 2015. 24 In the event, the Tendcare IPO did not take place. Also, the shares that were issued to Luxe and NYC under the NYC/Luxe SPA and subsequently transferred to Gongs Global were not fully paid up despite the 2014 MOU providing that Mr Gong would pay for them (see [17] above).",
        "The parties’ cases": "",
        "The plaintiffs’ claims": "25 A substantial part of the plaintiffs’ claims against Mr Gong relates to Mr Gong causing Tendcare to transfer pre-IPO funds that were raised from the investors and lenders stated above (ie, Atlantis, Easom, MMIII and OCA) to entities outside of the Tian Jian Group, pursuant to the Scheme and/or in breach of fiduciary duties. The plaintiffs rely, in part, on the fact that the transfers generally took placeshortlyafterthe funds were transferred by the investors or lenders to Tendcare. Notably, the plaintiffs do not plead thatallof the proceeds of the OCA and MMIII loans were misapplied or dissipated. Indeed, the plaintiffs do not plead thatanyof the proceeds of the MMIII loans were dealt with inappropriately. I shall deal with the implications of this in greater detail at [107] below. 26 According to the plaintiffs, a total of US$89,965,770.29 was received by Tendcare and a total of US$45.29m and S$500,000 (“the Disputed Transfers”) were transferred out of Tendcare: (a)June 2014 Transfers: On 9 June 2014, Tendcare received US$14,992,805.48 and US$5,007,187.57 from EFG Atlantis and Atlantis China respectively. Soon afterwards, on 13 June 2014, Tendcare transferred US$5m to HXTJ. (b)February-April 2015 Transfers: On 6 February 2015, Tendcare received US$49,987,532.13 from Chow Tai Fook Nominees Ltd in respect of the Easom investment. On 6 February 2015 and 9 February 2015, Tendcare transferred US$15m and US$5m respectively to HXTJ. On 11 March 2015, Tendcare transferred US$2m to Tian Jian HK. This sum was then transferred to QHC pursuant to a purported loan agreement dated 14 April 2015 (the “US$2m QHC Loan”) between QHC and Tian Jian HK. (c)September-October 2015 Transfers: On 16 September 2015, Tendcare received US$11,348,272.82 from OCA. On 22 September 2015, Tendcare transferred US$4m to Tian Jian HK which in turn transferred the same amount to QHC pursuant to a purported loan agreement dated 22 September 2015 (the “US$4m QHC Loan”). In addition, on 23 September 2015, 25 September 2015 and 26 October 2015, Tendcare transferred S$250,000, US$2m and US$1m respectively to HXTJ; (d)November-December 2015 Transfers: On 12 November 2015, Tendcare received a further US$8,629,972.29 from Chow Tai Fook Nominees Ltd in respect of the Easom investment. On 13 November 2015, 16 November 2015 and 8 December 2015, Tendcare transferred US$3m, S$250,000 and US$4m respectively to HXTJ; and (e)HXG HK Transfers: Tendcare transferred US$1.75m and US$2.54m on 27 February 2015 and 10 April 2015 respectively to HXG HK ostensibly as payment of success fees. 27 The Disputed Transfers may also be categorised as follows: (a) Transfers of funds from Tendcare to HXTJ (an entity outside of the Tian Jian Group) (“the HXTJ Transfers”); (b) Transfers of funds from Tendcare to QHC, channelled through Tian Jian HK (which was part of the Tian Jian Group), in connection with the US$4m QHC Loan and the US$2m QHC Loan (“the Tendcare-TJHK-QHC Transfers”); and (c) the HXG HK Transfers. 28 Most of the funds received by HXTJ and QHC pursuant to the transfers described above were eventually channelled through Asia Hausse Capital Limited (“Asia Hausse”), a BVI company controlled by Mr Cheung, to various other entities in China. The plaintiffs’ description of the various flows of funds (of which the Disputed Transfers form a part) are annexed to this Judgment. On the basis of the Disputed Transfers, the plaintiffs pursue a number of claims against the defendants, all of which are denied by the defendants. The claims are summarised in the table below, and are set out in greater detail in the succeeding paragraphs: ClaimParties claimed againstTendcare (1st plaintiff)’s claimsBreach of fiduciary duties / DeceitMr GongDishonest assistance / Knowing receiptHXTJ, Ms Wang, Ms Gong, Mr Miao, HXG, HXG HK and QHCConspiracyMr Gong, HXTJ, Ms Wang, Ms Gong, Mr Miao, HXG, HXG HK and QHCUnjust enrichmentMr Gong, HXTJ, Mr Miao, HXG, HXG HK and QHCMr Yit (2nd plaintiff)’s claimsFraudulent tradingMr Gong, HXTJ, Ms Wang, Ms Gong, Mr Miao, HXG, HXG HK and QHC Fraudulent Trading 29 The plaintiffs allege that Mr Gong and Mr Miao carried on the business of Tendcare with the intent to defraud its creditors and investors, and that the other defendants were knowing parties to the fraudulent scheme (ie, the Scheme). The NYC/Luxe SPA was used to set a false “price floor” for Tendcare’s shares in order to induce the investors to subscribe for shares in Tendcare at a higher price; in other words, the “false” prices for Tendcare’s shares set by the NYC/Luxe SPA induced investors to subscribe for Tendcare’s shares at higher prices than they otherwise would have. Further, Mr Gong and Mr Miao also fraudulently caused Tendcare to incur debts by borrowing from MMIII and OCA. 30 Pursuant to the Scheme, significant portions of the funds raised from EFG Atlantis, Atlantis China, Easom and OCA were fraudulently transferred from Tendcare “without authority”, with “no ostensible or plausible link to [the] legitimate purposes of Tendcare or [the Tian Jian Group]”. The fraudulent transfers are the Disputed Transfers. 31 On the basis that the debt raised from MMIII (US$40m) and OCA (US$19,978,280) were pursuant to the Scheme, the plaintiffs assert that Mr Gong and Mr Miao are liable for fraudulent trading under s 340(1) read withs 227X(b) of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”) for the said loans totalling US$65,207,538.03 (including accrued interest). Notably, the claim for fraudulent trading does not extend to the investments by Atlantis and Easom which were by way of equity and not debt. 32 The plaintiffs assert that the other defendants had assisted in the Disputed Transfers knowing that they were made pursuant to the Scheme and are therefore also liable for fraudulent trading. Breach of fiduciary duties 33 The plaintiffs claim that Mr Gong breached fiduciary duties he owed to Tendcare by authorising the Disputed Transfers. Accordingly, the plaintiffs seek to recover the Disputed Transfers (which total US$45.29m and S$500,000). Deceit 34 Alternatively, the plaintiffs claim against Mr Gong in the tort of deceit. They assert that Mr Gong falsely represented to Tendcare that the transfers to HXTJ and/or QHC (through Tian Jian HK), and the HXG HK Transfers were for the purposes stated in Tendcare’s records or otherwise for legitimate purposes. Thereby induced, Tendcare transferred the funds and suffered loss representing the Disputed Transfers. Dishonest assistance and knowing receipt 35 The plaintiffs allege that HXTJ, Mr Miao, HXG, HXG HK, QHC, Ms Wang and Ms Gong dishonestly assisted Mr Gong to breach fiduciary duties in making the Disputed Transfers and/or in receiving the proceeds thereof in the knowledge that Mr Gong was acting in breach of fiduciary duties in causing them. Conspiracy 36 The plaintiffs claim that Mr Gong conspired with HXTJ, Mr Miao, HXG, HXG HK, QHC, Ms Wang and Ms Gong to procure or cause Tendcare to procure the Disputed Transfers. Unjust enrichment 37 In the alternative, the plaintiffs allege that Gong, HXTJ, Mr Miao, HXG, HXG HK and QHC were unjustly enriched to the extent of the Disputed Transfers as the monies transferred belonged or were traceable to Tendcare. Accordingly, the Disputed Transfers were made without consideration and without Tendcare’s consent or authority, and at its expense.",
        "The defendants’ case": "Mr Gong and HXTJ 38 While Mr Gong and HXTJ initially participated in these proceedings, that ceased with the discharge of their solicitors on 7 August 2020. Though Mr Gong filed an affidavit of evidence-in-chief (“AEIC”) on his behalf and on behalf of HXTJ, neither he nor HXTJ presented themselves at trial. The absence of Mr Gong and HXTJ did not relieve the plaintiffs of their burden to make their case against them. For completeness, I set out Mr Gong’s and HXTJ’s defence as pleaded. 39 Mr Gong and HXTJ do not deny that the Disputed Transfers were made or that Mr Gong owed common law and statutory duties to Tendcare. Their defence is that the pre-IPO funding, both debt and equity, was intended for capital investments or the general working capital of the Tian Jian Group and/or for the expenses of the Tendcare IPO. The Disputed Transfers werebona fidetransfers of funds intended for and applied towards such purposes. Further, the Disputed Transfers were made to HXTJ under the Entrustment Agreement pursuant to which HXTJ made payments for and on behalf of Tendcare. On this basis, Mr Gong and HXTJ deny all of Tendcare’s claims against them. Mr Miao, HXG, HXG HK and QHC 40 Mr Miao denies any involvement in the Scheme. He further denies any knowledge of NYC, Luxe and the NYC/Luxe SPA until December 2014. He asserts that the HXG HK Transfers were not fraudulent transfers of money. They were part payment of the US$7.15m in success fees that HXG HK was entitled to under the Success Fee Agreement. Mr Miao further asserts that the the Tendcare-TJHK-QHC Transfers were not fraudulent transactions. According to Mr Miao, Mr Gong needed funds to purchase hospitals in China. However, he was unable to transfer money directly to China due to fund transfer restrictions. Accordingly, the payments to QHC were disguised as loans to circumvent the restrictions. As such, Mr Miao denies all of Tendcare’s claims against him, HXG, HXG HK and QHC. Ms Wang and Ms Gong 41 Ms Wang and Ms Gong initially participated in these proceedings. Their participation ceased with the discharge of their solicitors on 24 June 2020. They did not turn up for trial as well, nor did they offer any evidence by way of AEICs in support of their defence. Again, their absence from trial or the failure to offer any evidence in support of their defence did not relieve the plaintiffs of the burden to make their case against them. For completeness, I set out their defence as pleaded. 42 In their defence, Ms Wang and Ms Gong deny knowledge of the Scheme or that they were parties to it. They also deny dishonestly assisting in the Disputed Transfers. As such, they deny all of Tendcare’s claims against them.",
        "HXTJ’s counterclaim": "164 The basis for HXTJ’s counterclaim is the Entrustment Agreement, the authenticity of which I do not accept (see [80] above). The burden is on HXTJ to prove its case. In my view, HXTJ has not discharged its burden as Mr Gong has failed to turn up for cross-examination or to call any witnesses who are able to establish the authenticity of the Entrustment Agreement. I therefore dismiss HXTJ’s counterclaim.",
        "The witnesses": "44 The plaintiffs called Mr Cheung, Mr Gwee, Mr Yit, Mr Joshua James Taylor (Mr Yit’s colleague who was involved in Mr Yit’s investigation into Tendcare’s affairs) and Mr Ma Xiaowei (“Mr Ma”) of OCA as witnesses. Mr Miao also testified. He was the sole witness for his case. As stated above, Mr Gong, Ms Wang, and Ms Gong did not turn up at trial.",
        "Issues to be determined": "45 The following issues arise for determination. As regards the plaintiffs’ claim for fraudulent trading: (a) Whether the Scheme was fraudulent; (b) Whether the defendants had any knowledge of and were involved in the Scheme; and (c) The extent of the defendants’ liability for fraudulent trading (if any). 46 As regards the plaintiffs’ claim for breach of fiduciary duties and dishonest assistance: (a) Whether in making or procuring the Disputed Transfers, Mr Gong breached fiduciary duties; and (b) Whether the defendants dishonestly assisted in the Disputed Transfers. 47 In the alternative, whether the plaintiffs’ claims for deceit, knowing receipt, conspiracy and restitution (arising from unjust enrichment) have been made out.",
        "My decision": "",
        "Preliminary issue: attribution of knowledge to the corporate defendants": "48 Before I turn to consider the plaintiffs’ claims, I deal first with a preliminary issue: whether Mr Gong’s and Mr Miao’s knowledge may be attributed to the corporate defendants they controlled namely,HXTJ (for Mr Gong) and HXG, HXG HK as well as QHC (for Mr Miao). Attribution implicitly arises from the plaintiffs’ pleaded case since it is plain that a company has no mind or body of its own and can only act through natural persons:Ho Kang Peng v Scintronix Corp Ltd (formerly known as TTL Holdings Ltd)[2014] 3 SLR 329 at [47]. In their closing submissions, the plaintiffs also set out the relevant basis for attribution,viz: (a)  As regards HXTJ, Mr Gong was “at all material times [its] sole director and shareholder” and “all documents in HXTJ were executed and authorised by [Mr] Gong”. There was therefore “no question that [Mr] Gong was in control” and was the “directing mind and will” of HXTJ. Thus, Mr Gong’s knowledge should be attributed to HXTJ; (b) As regards HXG, HXG HK and QHC, they were ultimately wholly-owned by Mr Miao, who was also the sole director of all three entities. 49 The defendants did not raise attribution of knowledge as an issue in their pleadings and submissions, being content to accept that attribution was permissible. I therefore take the attribution of Mr Gong’s knowledge to HXTJ, and that of Mr Miao’s knowledge to HXG, HXG HK and QHC, as undisputed and say nothing further on it. 50 I now turn to consider the plaintiffs’ claims.",
        "Fraudulent trading": "The law 51 The claim for fraudulent trading is based on s 340(1) read with s 227X(b) of the Companies Act. I should mention that s 340(1) of the Companies Act has since been re-enacted as s 238(1) of the Insolvency, Restructuring and Dissolution Act 2018 (No 40 of 2018). The provisions provide as follows: 340.—(1) If, in the course of the winding up of a company or in any proceedings against a company, it appears thatany business of the company has been carried on with intent to defraud creditors of the company or creditors of any other person or for any fraudulent purpose, the Court, on the application of the liquidator or any creditor or contributory of the company, may, if it thinks proper to do so, declare thatany person who was knowingly a party to the carrying on of the business in that mannershall be personally responsible, without any limitation of liability, for all or any of the debts or other liabilities of the company as the Court directs. [emphasis added] 227X.At any time when a judicial management order is in force in relation to a company under judicial management — … (b) sections 337, 340, 341 and 342 shall apply as if the company under judicial management were a company being wound up and the judicial manager were the liquidator, but this shall be without prejudice to the power of the Court to order that any other section in Part X shall apply to a company under judicial management as if it applied in a winding up by the Court and any reference to the liquidator shall be taken as a reference to the judicial manager and any reference to a contributory as a reference to a member of the company. 52 The plaintiffs must establish two things for liability to be established under s 340(1). First, that the business of Tendcare was carried on “with intent to defraud creditors of the company or creditors of any other person or for any fraudulent purpose”. Second, that the person sought to be made liable was “knowingly a party to the carrying on of the business in that manner”. In other words, the party sought to be made liable was knowingly involved in the fraudulent business. On the plaintiffs’ case, the relevant fraudulent business was raising pre-IPO funds on the pretext of the Tendcare IPO. 53 InTan Yoke Kheng (trading as Niklex Supply Co) v Lek Benedict and others[2005] 3 SLR(R) 263 at [7]–[9], the Court of Appeal defined “fraud” as used in s 340(1) as follows: 7 … To defraud someone is to cheat him, but what is cheating?The best that one can say is that it is an act or omission in which the fraudster deceives the innocent partyso as to enrich the fraudster, or cause the innocent party to suffer a loss or detriment. But the fraudster or cheat may achieve his objective in any number of ways.The only invariable element is the element of dishonesty on the part of the fraudster or cheat.Whether any given circumstances amount to fraud is a question of fact to be determined by the court … 8Rahj Kamalwas an approval of a finding of fact by the lower court judge in circumstances that the appellate court found were consistent with dishonesty having been proved.A dishonest intention can always be inferred from the surrounding circumstances. Hence, in that case, the court was entitled to infer dishonest intention by the fact of concealment, evidence of which was independently provided by prosecution witnesses. There was also other corroborative evidence such as the collection of money by the appellant in that case, and the subsequent substitution of receipts. All that was found by the court to have been done for the purpose of confusing the authorities. Hence, there was ample evidence of a dishonest intention on the part of the appellant in that case. 9 The Hong Kong case ofAktieselskabet Dansk Skibsfinansiering v Brothers[2001] 2 BCLC 324 (“Aktieselskabet”) requires some comment. Lord Hoffmann, delivering the judgment of the Hong Kong Court of Final Appeal, stated at 334 that: While I quite accept that a defendant cannot be allowed to shelter behind some private standard of honesty not shared by the community, I think that there is a danger in expressing that proposition by invoking the concept of the hypothetical decent honest man. The danger is that because decent honest people also tend to behave reasonably, considerately and so forth, there may be a temptation to treat shortcomings in these respects as a failure to comply with the necessary objective standard. It seems to me much safer, at least in the context of an allegation of fraud, to concentrate upon the actual defendants and simply ask whether they have been dishonest. Judges or juries seldom have any conceptual difficulty in knowing what is meant by dishonesty. We agree entirely with the above passage, but would say further,that the objective standard of what an honest person would have done in the circumstances can still be a useful device to test the honest intention of the person concerned against all the other evidence available, including, and especially, the explanation by the defendant of his deviation from what an honest person would have done in his circumstances… 54 Therefore, the principal indicium of fraud is dishonesty in the form of deception practised on an innocent party by the person sought to be impugned. Dishonesty can be inferred from the surrounding circumstances and absent a satisfactory explanation, from conduct which deviates from what an honest person would objectively have done in the circumstances. Whether the Tendcare IPO was fraudulent 55 I turn to consider whether there was dishonesty as alleged. The plaintiffs allege that the Scheme was to use Tendcare as a “vehicle to attract cash from investors which would be misappropriated thereafter”. In other words, there was really no plan to list Tendcare. The Tendcare IPO was simply a ruse to raise monies from investors so that the monies so raised could be misappropriated. Thus, the core issue is whether the Tendcare IPO was truly on the cards. If pre-IPO funds were procured on the pretext that Tendcare would be listed, the dishonesty is clear. In such a case, the monies raised were never meant for the Tian Jian Group’s business or to meet the expenses of the Tendcare IPO, as represented. This would make the Scheme fraudulent. 56 Fraud, according to the plaintiffs, might be inferred from the following. First, the “engagement of [HXG] and the use of [Luxe] and [NYC] as supposed to third party investors” to create a “price floor” was a “crucial step as it lent legitimacy to the fraudulent enterprise”. Second, the fact that pre-IPO funds were “siphoned off and transferred to HXTJ (primarily) usually within days”. This is a reference to the Disputed Transfers. Collectively, these show that the promoters of the IPO were not “honestly pursuing an IPO at the beginning only to be later tempted into fraud”. While I accept that a fraudulent or dishonest intention might be inferred from the second point, I am not persuaded that the first point supports such an inference. My reasons follow. (1) Whether the involvement of HXG, NYC and Luxe in the Tendcare IPO suggests fraudulent intent (A) NYC’s and Luxe’s involvement 57 According to the plaintiffs, the NYC/Luxe SPA played a crucial role in the Scheme in that it gave the false impression to third-party investors that Luxe and NYC were genuine investors in Tendcare when that was not true. The shares issued to them were in fact “sweat equity” for services rendered by Mr Gwee, Mr Sim and Mr Miao. The NYC/Luxe SPA lent legitimacy to the Tendcare IPO and led potential investors to subscribe for shares in Tendcare at a price above that stated in the NYC/Luxe SPA. In other words, NYC and Luxe were seen as the first investors and the price they purportedly paid for their shares as theminimumor “floor” price for subsequent share placements. The plaintiffs submit that this is “ample evidence” that the Tendcare IPO was used to defraud Tendcare’s creditors and investors. 58 I have difficulty with the plaintiffs’ submission. As a preliminary observation, the submission runs against the fact that not all the pre-IPO funds were raised as share equity. Notably, MMIII and OCA did not invest in Tendcare by way of equity. They lent monies to Tendcare though OCA had the option of converting debt to equity under the OCA CNSA. Being lenders, they would not have been influenced by NYC and Luxe investing in Tendcareasshareholders.Notably, the plaintiffs have led no evidence that they were. 59 This is significant as the claim for fraudulent trading is restricted to the loans made by MMIII and OCA. It is therefore doubtful whether the submission on the NYC/Luxe SPA is relevant to whether the MMIII and OCA loans were procured on a fraudulent basis. If at all, it might be relevant to the share subscriptions by Atlantis and Easom, but the plaintiffs make no claim for fraudulent trading in this regard. There is therefore a logical disconnect between the plaintiffs’ submission and claim. In any event, on a proper analysis, the submission is without substance even as regards the share investors. I shall explain. 60 The plaintiffs’ argument assumes that the investors were influenced by two factors in deciding whether to invest in Tendcare. First, that NYC and Luxe had subscribed for shares in Tendcare and second, that the price stated in the NYC/Luxe SPA was the baseline for the price they had to pay for their shares. 61 On the first, the plaintiffs must show that the investorswould nothave considered investing in or lending to Tendcarebut forNYC’s and Luxe’s investments. If in making their investment decisions, the investors were indifferent as to whether NYC and Luxe had subscribed for shares in Tendcare, it is difficult to see how that wasintendedor servedas a “crucial step” in the Scheme. 62 On the second, for similar reasons, if there is no evidence that the investors used the price stated in the NYC/Luxe SPA as a ‘floor price” for their shares, the argument must fail. 63 I have difficulty accepting that either fact was relevant from the share investors’ point of view. There are two fundamental problems. First, there is no evidence that the investors relied on the NYC/Luxe SPA. It appears that investors arrived at their own conclusions on the prudence of investing in Tendcare and were independently advised by competent financial and legal advisors. Mr Cheung’s evidence is that the investors were represented by independent legal counsel: Deacons represented Easom, and White & Case represented MMIII. The investors also retained independent financial advisors to undertake due diligence before they invested. Further, Tendcare also had a team of independent legal and financial advisers. According to Mr Cheung, KPMG was heavily involved in the Tendcare IPO as Tendcare’s financial advisor; they were also involved in pre-IPO fund raising as well as preparing the information memorandum for, and introducing Mr Gong to, the investors. KWM acted for Tendcare as its legal advisers. Mr Gwee’s evidence essentially corroborated Mr Cheung’s. Their evidence in this regard was not contested. There is no suggestion that the NYC/Luxe SPA figured as a factor in any of the materials generated by the professionals. In the round, the investors were sophisticated; they were capable of making up their own minds on the prudence of investing in Tendcare. In coming to a decision, they were suitably assisted by independent legal and financial advisers. The NYC/Luxe SPA did not appear to play any part in their deliberations, nor did it appear to play any part in Tendcare’s own advisers’ deliberations. 64 Second, Mr Gwee’s evidence is against the plaintiffs’ case. He testified that the NYC/Luxe SPA was entered into because Mr Miao, Mr Sim and he had agreed with Mr Gong that NYC and Luxe would hold the shares that was promised in the September 2013 MOU. This arrangement, which he described as “red-chipping”, was put in place in order to satisfy the requirements of the PRC’s State Administration of Foreign Exchange. Mr Gwee further testified that the price per share stipulated in the NYC/Luxe SPA correlated to the valuation of RMB220m that was agreed between Tendcare’s onshore lawyers in China (KWM), KPMG and the PRC’s Commerce Department. I accept his explanation, which is supported by an email dated 9 April 2014 from Mr Cameron Ma of KPMG to Mr Cheung (“the 9 April 2014 Email”). The email mentions that the sum of RMB220m was the subject of discussions with KWM and it was the sum Mr Gwee and Mr Sim “[need] to commit”. Mr Gwee was the plaintiffs’ witness and they were content to leave his evidence unchallenged. 65 Two further points ought to be made. First, the evidence shows that prior to the execution of the NYC/Luxe SPA on 2 June 2014, KPMG was already actively engaged in securing potential investors for the Tendcare IPO. Their efforts appear to have met with some success. On 17 January 2014, Ms Cyan Sze, a senior manager in KPMG’s corporate finance practice, sent an email to, amongst others, Mr Gwee, Mr Sim and Mr Cheung (“the 17 January 2014 Email”). The email read as follows: Dear Ryan and Project Team, I’d like to thanks [sic] the Project Teams (including [HXG], MCL, KPMG team) and [the Tendcare IPO] management in the past couple months to support the fund raising process.We have made good progress and achieved a significant milestone today by receiving 10 non-binding offer letters from potential investors regarding the RMB400m equity fund raising for [the Tendcare IPO]. We have prepared a summary to extract key terms from each letter (including but not limited to valuation basis) for your easy reference, attached also the original offer letters for your review. In the meantime, we are also preparing a Chinese version summary for [Mr Gong’s] reference and will share with you by early Monday.Since there are a few investors[who]may delay their submission of letters(i.e. Apax, CICC), we will update the summary upon receipt of their offers and circulate a revised version in due course. A quick summary of the key proposal from investors below for blackberry readers: 1. Boyu Capital – RMB400m for 12.9% preferred shares (EV RMB3.1bn) 2.Carlyle– RMB500m for 21.4% for equity (EV RMB2.3bn) 3. Actis – RMB400m for 20% preferred shares (EV RMB2bn) 4. ICG & Citic Capital – RMB400[m] for 20% preferred shares + RMB400m loan (EV 2bn) 5. China Merchant – RMB300m for 16.7% + RMB500m bank loan (EV 1.8bn) 6. Bain Capital – RMB350-380m for 20% ordinary shares (EV 1.75-1.9bn) 7. Warburg Pincus – RMB400m for 22.9% equity (EV 1.75bn) 8. OCBC – RMB200m for 10% CB (EV 2bn) 9. Bull Capital – RMB151m for 10.9% CB (EV 1.4bn) 10. Legend Capital – RMB200m for 15.12% equity (EV1.3bn) … [emphasis added] 66 Attached to the 17 January 2014 Email was a spreadsheet setting out details of the potential investments listed in the email. The potential investors’ valuations of Tendcare were also stated in the spreadsheet. The valuations were stated as multiples of Tendcare’s Earnings Before Interest, Tax, Depreciation and Amortization (“EBITDA”) for the year 2014. Two things are clear from the 17 January 2014 Email. (a) First, KPMG’s efforts at finding potential investors had succeededeven beforethe NYC/Luxe SPA was entered into. It follows that those potential investors did not have regard to the investments by NYC and Luxe which only goes to support the point that the NYC/Luxe SPA was not a relevant consideration. (b) Second, for the same reason, the price stated in the NYC/Luxe SPA wasnot a factorin setting the price for the investors. The profitability of Tendcare (as represented by its EBITDA) was the basis for the investors’ valuation of Tendcare, and the price they were willing to pay for the shares. 67 The manner in which the Atlantis investments were secured reinforces the point. In the 9 April 2014 Email sent by Mr Cameron Ma of KPMG to Mr Cheung and Mr Eric Sin Lik Man (“Mr Sin”) of HXG, a revised indicative non-binding offer for a potential investment by Atlantis in Tendcare was attached. In this email, Mr Cameron Ma noted that the “Atlantis investment will be based on Carlyle valuation of [RMB]1840m+120m”. Carlyle was one of the potential investors listed in the 17 January 2014 Email. According to a comment left by Mr Cameron Ma on the indicative non-binding offer from Atlantis, the valuation was “[b]ased on Carlyle’s pre-money valuation of [13 times] of 2014 EBITDA [minus] 71m of land accrual, assume Cash and Debt will be [sic] offset each other”. The valuation of 13 times Tendcare’s 2014 EBITDA dovetails with Carlyle’s valuation stated in the spreadsheet attached to the 17 January 2014 Email. Additionally, on 19 May 2014, Mr Cameron Ma sent an email (“the 19 May 2014 Email”) to Mr Gwee (with Mr Cheung, among others, on copy) asking him to confirm the details of the Atlantis investments. Those details included the pre-money valuation of BJTJ (ieTendcare) of RMB1,840m; the size of the Atlantis investments (at RMB124m or US$20m); the total number of shares to be issued to Atlantis (695 shares) and the price per share (US$28,782.70 per share). The details largely tracked the terms upon which Atlantis eventually invested in Tendcarevizan investment of 695 new Tendcare shares at US$28,776.98 per share. 68 It is therefore clear that Atlantis was not influenced by the NYC/Luxe SPA in arriving at the price that it was willing to pay for shares in Tendcare. Atlantis’ indicative non-binding offer had been made on 9 April 2014 which was wellbeforethe execution of the NYC/Luxe SPA on 2 June 2014. Further, Atlantis’ offer was based on an estimated valuation of Tendcare (ie,Carlyle’s valuation at 13 times Tendcare’s 2014 EBITDA) that was also arrived atbeforethe NYC/Luxe SPA was executed. As Atlantis was the first investor in Tendcare bar NYC and Luxe, it would be incorrect to say that all subsequent investors regarded the NYC/Luxe SPA as setting a “floor price”. 69 I make a final observation. The plaintiffs have led no evidence to the effect that any of the investors were in fact induced as asserted. Notably, no representatives from Atlantis or Easom were called to testify on whether they were influenced by the NYC/Luxe SPA in deciding to invest. While the plaintiffs did call Mr Ma from OCA, his evidence did not touch on this issue. In any case, OCA was not an equity investor. 70 In these circumstances, I am of the view that the NYC/Luxe SPA did not play the role suggested by the plaintiffs as regards the investors who subscribed to Tendcare’s equity. It certainly did not influence those who lent to Tendcare. Accordingly, NYC/Luxe SPA does not support the inference that the Scheme was fraudulent. (B) HXG’s involvement 71 The plaintiffs allege that Tendcare’s engagement of HXG for the Tendcare IPO raises a number of unanswered questions. Some of these relate to Mr Miao’s state of knowledge at the material time (which I shall deal with below). For now, it suffices to note that large parts of the 2013 HXG LOE were “copied word for word, or were substantively similar to the letter of engagement reached with KPMG”. In particular, cl 8.2 of the 2013 HXG LOE, like cl 8.2 of KPMG’s letter of engagement, referred to HXG as an “investor”. According to the plaintiffs, this raises questions as to why Tendcare and/or BJTJ were not informed about HXG’s “true role”, and it was also unclear why HXG, as an “investor”, would be responsible for paying KPMG’s fees. The plaintiffs’ argument is unclear. I understand it to mean that Tendcare and/or BJTJ were somehow misled or deceived as to HXG’s true role because the HXG LOE described HXG as an “investor” when Tendcare and/or BJTJ understood HXG to be an advisor for the Tendcare IPO. I see no merit in the argument for three reasons. First, as Mr Gong signed the 2013 HXG LOE on behalf of Tendcare, he (and by extension Tendcare) must be taken to have known of the terms of engagement and HXG’s true role. Second, it must have been clear to Tendcare and BJTJ from the September 2013 MOU and the 2013 HXG LOE (both of which Mr Gong signed) that HXG was not intended to be merely an investor. Under the September 2013 MOU (which was contemporaneous with the 2013 HXG LOE), HXG was to engage KPMG and MCL to assist in pre-IPO restructuring as well as fundraising and preparatory work. The 2013 HXG LOE elaborated on the September 2013 MOU. These agreements made clear that HXG was to manage the Tendcare IPO. Being responsible for KPMG’s fees was therefore hardly unusual. Third, that the 2013 HXG LOE and KPMG’s letter of engagement were substantively similar is equivocal. I do not see how an inference of a dishonest or fraudulent intent can be drawn from this. 72 For the reasons above, I am of the view that HXG’s involvement does not support the inference that the Scheme was fraudulent. (2) Whether the Disputed Transfers were fraudulent 73 The pre-IPO funds were raised for the business of the Tian Jian Group and to meet the costs and expenses of the Tendcare IPO. There is no evidence that the Disputed Transfers were used for the intended purposes. The evidence shows that the Disputed Transfers happened in most instances shortly after receipt of the pre-IPO funds. Taken together, these factors suggest that the pre-IPO funds were misappropriated and the Tendcare IPO was never on the cards. I am therefore of the view that Tendcare’s business was carried on with the intent to defraud creditors or for a fraudulent purpose (iethe Scheme). The question then is whether the defendants were knowingly parties to the Scheme. I start with Mr Gong and HXTJ. Liability of Mr Gong and HXTJ for fraudulent trading 74 In my view, aprima faciecase of fraudulent trading has been made out against Mr Gong. The fact that Tendcare was used to perpetrate the Scheme must inexorably lead to this conclusion for several reasons. First, Tendcare was owned and controlled by Mr Gong. He would have been the person pulling the strings and the principal beneficiary of the Scheme. Second, it is indisputable that Mr Gong authorised or caused the Disputed Transfers. The fact that he owned and controlled Tendcare and HXTJ (through which many of the Disputed Transfers were channelled) supports this conclusion. As stated at [39] above, Mr Gong’s pleaded case is that the Disputed Transfers were madebona fide. Implicit in the plea is the acknowledgement that he authorised the Disputed Transfers and was aware of the purpose for which the monies were used. The burden is therefore on Mr Gong to provide a cogent and satisfactory explanation in support of his plea. Mr Gong is clearly in a position to demonstrate how the monies were applied. His failure to do so suggests that the monies were in fact misapplied. This brings me to the significance of Mr Gong’s absence from trial. (1) Effect of Mr Gong’s absence from trial 75  Mr Gong’s absence at trial has important ramifications. The relevant provision is O 38 r 2(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed), which states: 2.—(1) Without prejudice to the generality of Rule 1, and unless otherwise provided by any written law or by these Rules, at the trial of an action commenced by writ, evidence-in-chief of a witness shall be given by way of affidavit and, unless the Court otherwise orders or the parties to the action otherwise agree, such a witness shall attend trial for cross-examination and, in default of his attendance, his affidavit shall not be received in evidence except with the leave of the Court. 76 Order 38 r 2(1) gives effect to the principle that the court will not receive evidence which the opposing party has not had the opportunity to challenge:Asia Hotel Investments Ltd v Starwood Asia Pacific Management Pte Ltd and another[2007] SGHC 50 (“Asia Hotel”) at [76]. Applying O 38 r 2(1), Mr Gong’s failure to attend trial to be cross-examined means that his AEIC cannot be received in evidence, unless the plaintiffs consent orleave of court is obtained:Asia Hotelat [74]. The plaintiffs submit that Mr Gong’s AEIC ought not to be admitted in evidence. I agree. There is no application for leave before me. In any case, this is not an appropriate case for leave to be granted. The allegation against Mr Gong is one of fraud. He ought to have turned up for trial and have his evidence properly tested under cross-examination. Mr Gong has not turned up nor explained his absence from the trial. He has quite simply refused to continue participating in this action. As such, there is no basis for his AEIC to be considered by the court. The same conclusion applies to the other affidavits filed by Mr Gong. Those affidavits cannot stand in a better position than his AEIC:Independent State of Papua New Guinea v PNG Sustainable Development Program Ltd[2019] SGHC 68 at [69]. The result of Mr Gong’s absence from trial is thatnoneof the evidence contained in the various affidavits he has filed in this action may be considered; his pleaded case must stand or fall on the evidence already admitted, which would include the evidence of witnesses who had attended trial:Cheo Yeoh & Associates LLC and another v AEL and others[2015] 4 SLR 325at [97]. With this, I turn to consider Mr Gong’s pleaded case. (2) Mr Gong’s pleaded case on fraudulent trading 77 Mr Gong’s pleaded case on fraudulent trading rests principally on two assertions: (a) That the Disputed Transfers were applied towards the business of the Tian Jian Group or to meet the expenses of the Tendcare IPO in the manner described in an email sent by Ms Liang Lirong of Tendcare to Tendcare’s investors in or around November 2016 (“the Liang Lirong Email”); and (b) The monies transferred from Tendcare to HXTJ (ie,the HXTJ Transfers) were pursuant to the Entrustment Agreement. HXTJ thereafter transferred the monies to other parties including Asia Hausse. The transfers were implemented on the instructions of HXG. Mr Gong and HXTJ aver that they have no knowledge of the transfers that were made thereafter by Asia Hausse. However, despite asserting this, Mr Gong pleads that the monies transferred by Asia Hausse were ultimately received by him and the 3rd to 6th defendants, and applied towards the “capital investments or general working capital of the Tian Jian Group or the [Tendcare IPO]”. 78 I turn first to Mr Gong’s claim that the Disputed Transfers were ultimately applied towards the business of the Tian Jian Group or to meet the costs and expenses of the Tendcare IPO in the manner described in the Liang Lirong Email. Apart from Mr Gong’s pleaded assertions, the Liang Lirong Email and a draft report prepared by Deloitte & Touche exhibited in Mr Gong’s AEIC, there is simplyno evidencethat monies were applied for these purposes. As the Liang Lirong Email and the draft report were exhibited in Mr Gong’s AEIC, for the reasons set out above at [76], they are not evidence I can take into account. In any case, the Liang Lirong Email is not satisfactory evidence. It simply contains a schedule of funds purportedly invested in the Tian Jian Group entities and in mergers and acquisitions projects. There is no supporting documentation establishing the provenance of the funds, their receipt by the Tian Jian Group entities or their use for legitimate purposes. The draft report is also not satisfactory evidence. Apart from the report being a draft, it simply shows an increase of RMB104.4m in the Tian Jian Group’s property, plant and equipment between 2014 to 2015. It sheds no light on whether the increase is a result of the legitimate use of the Disputed Transfers. 79 Further, Mr Gong’s pleaded case fails to account clearly for the chain of custody of the Disputed Transfers. Mr Gong ought to be able to show this, at least as regards the HXTJ Transfers (which comprises the bulk of the Disputed Transfers) as he controls HXTJ. The same may be said as regards the monies that were transferred from Asia Hausse as Mr Gong admits that they were received by him or the 3rd to 6th defendants and used for proper purposes. If the funds were ultimately applied towards their intended purposes, there would be payment vouchers supported by bank statements, transaction advices or equivalent, evidencing the chain of custody. The plaintiffs submit that I ought to draw an adverse inference against Mr Gong for his failure to adduce such evidence. I agree. It is relevant that on Mr Gong’s pleaded case, some of the funds that were transferred from Tendcare were received in his account with the Agricultural Bank of China. However, there isnothingin the evidence, not even in Mr Gong’s AEIC,which shows that the funds he had received were transferred out of that bank account. The only conclusion that can be drawn is that the monies were retained by Mr Gong. 80 I turn next to the Entrustment Agreement, which was ostensibly dated 3 March 2014. Mr Gong never produced the original of the Entrustment Agreement. Mr Gong asserts in his defence that in 2017, an employee of HXTJ, Mr Xu Zhimeng (“Mr Xu”), “sought to reproduce a word copy of the ‘Entrustment Agreement’ when he was unable to locate the executed version”. I have grave reservations over this assertion for three reasons. First, there is no explanation as to what has become of the original of the Entrustment Agreement. Neither Mr Gong nor Mr Xu turned up to explain. Second, it is entirely unclear what is meant by “sought to reproduce”. There is no explanation of how it was possible to reproduce the Entrustment Agreement when the original could not be located. Third, it is not evident why the Entrustment Agreement was needed in the first place given that both Tendcare and HXTJ are Singapore-incorporated companies which were at the material time owned and controlled by Mr Gong. Mr Gong was in effect both the remitter and the recipient. Accordingly, I do not accept the authenticity of the Entrustment Agreement. In any case, the Entrustment Agreement does not explain why Mr Gong needed to make the HXTJ Transfers. If funds were to be used for the Tian Jian Group’s business or the Tendcare IPO, the transfers could have been made directly to the relevant entities. It is not clear why it was necessary to transfer the monies between two Singapore-incorporated companies owned and controlled by the same person. 81 Accordingly, I find that the evidence points clearly to Mr Gong being the person behind the Scheme. In my view, Mr Gong is liable for fraudulent trading under s 340(1) of the Companies Act. As his knowledge is attributable to HXTJ (see [49] above), I also find HXTJ liable for fraudulent trading. I will consider the issue of quantum later in this judgment. Liability of Mr Miao, HXG, HXG HK and QHC for fraudulent trading 82 The plaintiffs’ claim against Mr Miao for fraudulent trading is on the following basis: (a) Mr Miao was involved in the Tendcare IPO and had a close relationship with Mr Gong. The close relationship is evidenced by Mr Miao regarding Mr Gong as his good friend, Mr Miao allowing Mr Gong to use his property in Singapore as his registered address, and the two of them sharing office space and for some time an employee (Mr Sin was for some time the Chief Financial Officer of both Tendcare and HXG). Mr Gwee’s evidence was also that Mr Miao was kept updated on the Tendcare IPO. All of this contradicted Mr Miao’s attempts to “play down his relationship with [Mr] Gong”. (b) Mr Miao was unable to explain how HXG would make a profit under the 2013 HXG LOE as the monthly retainer of S$100,000 was not even sufficient to cover Mr Gwee’s salary and Mr Sim’s retainer, let alone the fees that were payable to KPMG. Mr Miao’s assertion that he was not aware of KPMG’s engagement or their entitlement to a success fee on pre-IPO funds raised was not credible. (c) Mr Miao terminated Mr Gwee and Mr Sim’s services on 15 December 2014 on the false premise that they were trying to deprive him of the shares promised in the September 2013 MOU by executing the NYC/Luxe SPA without his knowledge. The premise was false because the NYC/Luxe SPA and the issuance of shares pursuant thereto could only have happened with Mr Gong’s approval. Mr Miao could have easily clarified this with Mr Gong. Yet, he failed to do so despite it being the “most natural course to take”. Mr Miao was fully aware of the situation and was not telling the truth as he was “attempting to play down his relationship” with Mr Gong by “denying as much as possible that he had any communications with [Mr Gong]”. (d) Mr Miao “knew of and [was] deeply involved in fund transfers relating to Tendcare and [Mr] Gong” as he was aware of certain transfers of monies from the PRC to offshore locations and thereon to Tendcare. Further, Mr Miao was also involved in the Tendcare-TJHK-QHC Transfers which were shams. (e) Mr Miao was unable to explain why cl 1.2 of the Termination Agreement provided for payment of an unspecified sum of money by BJTJ to HXG. The clause was in fact a mechanism to siphon funds from Tendcare. The increase in the success fee payable under the Success Fee Agreement (see [22(a)] above) and in Mr Miao’s entitlement to Tendcare shares from 2% to 3% under the IPO Shares Agreement (see [22(b)] above) also served this purpose. There was no reason to increase the success fee as Mr Miao could not personally contribute anything to the Tendcare IPO and there was in any case no work done by HXG for the Tendcare IPO after September 2015 because “its part in the fraud was done”. Mr Miao’s confusion over whether the success fees were calculated based on 3.5% or 5.5% of the fees raised from Easom underscored this. Accordingly, the purported payment of the success fee pursuant to the HXG HK Transfers was just another way for Mr Miao and HXG to “take their share of the loot”. 83 I make four observations. First, I struggle to see why HXG would need to enter into the September 2013 MOU, the 2013 HXG LOE and the Post-Termination Agreements if the plan all along was to misappropriate the pre-IPO funds. The plaintiffs’ case is that Mr Miao and Mr Gong were co-conspiratorsright at the outsetand not that Mr Miao became a co-conspirator along the way. As such, these agreements were clearly not needed for Mr Miao to share the spoils of the fraud with Mr Gong. Mr Gong could, if he wished, make transfers to Mr Miao without the need to legitimise them under sham agreements (in particular, there would be no need for the Post-Termination Agreements as I explain at [95] below). The ease with which Mr Gong was able to transfer monies out of Tendcare without any checks and balances shows that this was perfectly possible. If the argument is that these agreements were necessary to lend a veneer of credibility to the Tendcare IPO, it is misplaced. Credibility was already there with the involvement of KPMG who was leading much of the fundraising activity and the preparatory work for the Tendcare IPO. 84 Second, it is not apparent why Mr Gong would want to share the proceeds of the fraud with Mr Miao or need to engage HXG to perpetrate the fraud. The plaintiffs have not suggested a reason. Mr Gong could have procured Tendcare to engage professional advisers directly, thereby circumventing HXG and Mr Miao. 85 Third, save for the HXG HK Transfers, the plaintiffs are not able to point to any instance where any of the Disputed Transfers were retained by Mr Miao. The HXG HK Transfers are explicable on the basis of the success fee (see [104] below). Further, the HXG HK Transfers total US$4.29m which in the context of the Disputed Transfers is not significant. If Mr Miao was a principal player in a fraud of such significance, it is unlikely that his share was a relatively paltry one. 86 Fourth, if the plan was to drain Tendcare dry, it is unlikely that Mr Miao would see any benefit in the promised shares in Tendcare. Yet that was what the September 2013 MOU promised; indeed, the amount of shares Mr Miao was promised wasincreasedunder the Post-Termination Agreements (see [95(d)] below). 87 Collectively, these observations suggest that Mr Miao was not complicit in the Scheme. I now turn to consider each of the plaintiffs’ assertions against Mr Miao. (1) Mr Miao’s close relationship with Mr Gong and involvement in the Tendcare IPO 88 Mr Miao’s evidence does suggest that he shared a close friendship with Mr Gong. He and Mr Gong smoked cigars “at the cigar bar at La Casa located at Regent Hotel” whenever Mr Gong came to Singapore and between 2013 and 2019, Mr Miao allowed his property at Nassim Hill to be used by Mr Gong as his residence. 89 The close friendship notwithstanding, Mr Miao sought to distance himself from the Tendcare IPO. He claimed that as he was unfamiliar with finance and the listing of companies, he was not involved in HXG’s work for the Tendcare IPO. He also claimed that he did not have close or frequent discussions with Mr Gong on the Tendcare IPO. Mr Gwee’s evidence, however, was at odds with Mr Miao’s assertion. He testified that Mr Miao was kept updated on matters involving the Tendcare IPO at weekly meetings. Mr Gwee’s evidence was corroborated by his email dated 3 February 2014 to Mr Miao. In this email, Mr Gwee informed Mr Miao that it was “the latestupdate on all the works that have been done by [HXG] and MCL for Mr. Gong since October 2013”, implying that Mr Miao had received earlier updates. The email also stated that HXG and MCL had “already obtained over 20 letters of intent from global investment funds and banks” who “[valued] the project at RMB3 billion, which means that our shares are now worth around US$25 million”. This was a reference to fundraising activities for the Tendcare IPO as well as the shares in Tendcare that were promised in the September 2013 MOU. The email went on to state that Mr Gong wanted to appoint HXG “for the second stage of the corporate transformation and corporate governance so that the company will be fit for listing”, and that this stage would take nine months. It is therefore clear beyond peradventure that Mr Miao was kept informed of the progress of the Tendcare IPO. This stands to reason as the Tendcare IPO was an important engagement for HXG and by extension Mr Miao. The Tendcare IPO was also important to Mr Miao as he stood to receive 2% of Tendcare’s shares under the September 2013 MOU. He therefore had very good reason to maintain a keen interest in the Tendcare IPO. 90 In my view, however, neither Mr Miao’s close relationship with Mr Gong nor his involvement in the Tendcare IPOipso factomade him an accomplice of Mr Gong or a knowing participant in the Scheme. The plaintiffs have not put forward any cogent evidence that Mr Miao was aware (a) of the Scheme, or (b) that save for the Tendcare-TJHK-QHC Transfers which I shall come to at [101] below, the Disputed Transfers were not applied towards their intended purposes. This is critical. 91 In fact, the evidence suggests that Mr Miao was not kept informed of important matters relating to the Tendcare IPO by Mr Gwee and Mr Sim. Mr Miao expressed his dissatisfaction with their unilateral actions at the 26 January 2015 Meeting. For instance, the following excerpt from the transcript of that meeting relating to Mr Miao’s reaction to the NYC/Luxe SPA is relevant: [Mr Miao]: After finishing the IPO, the three of us, ultimately the equity – you have 8%, and [Mr Sim] has 4%.Have you ever told me? Have you said anything to me? [Mr Gwee]: Mr. Gong, no, Mr. Miao… … [Mr Gwee]: I, your, your, your accounts… I have always… your name is in there. [Mr Miao]: My name is written by you. Did you tell me about this 12% of equity? [Mr Gwee]: Not 12%. We have 2%. [Mr Miao]:I know. Beforedoing this, you two, lawyer [Mr Sim] and you, did you tell me? Did you tell me in advance? [Mr Gwee]: Mr. Miao, I called you the other day, and you said you need to keep Mr. Yu accompany. I said, do you want to come over and set your BVI company right. … [Mr Sin]: … You would help Mr. Miao to hold the shares as a nominee shareholder first, and then find an opportunity to transfer it to Mr. Miao. [Mr Miao]:You have my name there, yes. But you could have given me a heads-up. No matter what, I am the only shareholder, am I not? Mr. Gong is my best friend. [Mr Gwee]: I got it. This… It’s mine…I, I neglected, Mr Miao. … [Mr Miao]: Right? I don’t even know such an important agreement existed. When did I find out about it? It was until the day that Mr. Gong brought out the stock and I just found out then. You tell me what I should do? [Mr Sim]: Can I say something? I do things in a very clear way.The relationship among the three of us back then was completely different from what it is today. At that time, we were indeed brothers, and for many things we did not make phone calls accordingly. Under the circumstances back then, I might call him, and after speaking with me he would ask you again… (murmur) … [Mr Miao]: Let me tell you, [Mr. Gwee]. If you have called me once… [Mr Sim]: Do you know what Mr. Miao means? [Mr Miao]: It will not be the same results today. [Mr Sim]: Mr Miao now feels that you should call him first. [Mr Gwee]: Yes. [Mr Sim]: Right? For certain things, there should also be more, the so-called respect. [Mr Gwee]: Yes. … [Mr Sim]: Mr. Miao, if I really have been completely negligent, if you want me to… if you think I was not fulfilling my responsibility. I did not need to sign that contract at the time. [Mr Miao]: Listen to me.I have not seen your contract yet. I was just told this today and I have not read it, but as I said, I did not know anything before. I only found out about this matter the day I came to Singapore and Mr. Gong took out the equity certificate. I only found out about it then. [Mr Sim]: Mr Gong already explained that matter. [Mr Miao]:Mr. Gong did not tell me either. How can I not be angry? [Mr Sim]:I understand. I fully understand. … [Mr Miao]: Why? When dealing with Imperium Mining, you insisted that I do the nominee shareholder agreement in Singapore, and this time, I did not know anything. You two just… the equity… [Mr Sim]:I was indeed wrong just now. [Mr Miao]: I know.For this matter, you know he did not discuss with me. After I came here last month, I was shocked when I looked at the equity. [emphasis added] 92 It is apparent from the transcript cited above that Mr Gwee and Mr Sim had accepted that they had failed to inform Mr Miao of the use of Luxe and NYC to hold the shares promised under the September 2013 MOU. Indeed, Mr Miao alleged that he was not even kept informed by Mr Gong. If Mr Miao was a co-conspirator of Mr Gong in the Scheme as alleged, one would have expected (a) Mr Gong to have kept Mr Miao updated, and (b) Mr Miao to have kept a tight rein on Mr Gwee and Mr Sim particularly if the NYC/Luxe SPA was, as alleged by the plaintiffs, a crucial step in perpetrating the fraud. (2) Mr Miao terminating the services of Mr Gwee and Mr Sim 93 The transcript of the 26 January 2015 Meeting cited above also shows that Mr Miao had moved to terminate Mr Gwee and Mr Sim’s services, ostensibly because they had failed to keep him informed on matters. While I am prepared to accept that the reason given for terminating Mr Gwee and Mr Sim’s services was tenuous, I am not persuaded that it showed that Mr Miao was a participant in the Scheme for three reasons. First, if Mr Miao did not want Mr Gwee and Mr Sim in the picture, he would not have engaged them in the first place. Instead, Mr Gwee and Mr Sim were appointed at the outset and their removal was precipitated (albeit rather opportunistically) by Mr Miao discovering in December 2014 that the NYC/Luxe SPA had been executed. There was no premeditation on Mr Miao’s part. Second, the removal of Mr Gwee and Mr Sim is not explicable on the basis that they were seen as obstacles to Mr Miao and Mr Gong achieving the objectives of the Scheme. This is evident from the fact that by the time they were removed (on 26 January 2015), Tendcare had already raised funds from Atlantis and a portion of that had been transferred out to HXTJ as part of the Disputed Transfers. In the circumstances, it is more reasonable to conclude that Mr Miao was actuated by opportunistic self-interest in terminating the services of Mr Gwee and Mr Sim. The fact that he negotiated a better deal for himself under the Post-Termination Agreements by increasing his entitlement to Tendcare’s shares (from 2% to 3%), the monthly retainer and the success fee speaks to this. (3) The terms of the Post-Termination Agreements 94 The plaintiffs submit that the terms of the Post-Termination Agreements support the inference that Mr Miao and Mr Gong were the true partners in the fraud, for two reasons: (a) There was no reason for Mr Gong to agree to pay HXG and Mr Miao more in terms of success fees and equity in Tendcare when HXG had lost the expertise of Mr Gwee and Mr Sim; and (b) HXG’s “part in the fraud was done” as evidenced by no work being carried out by HXG on the Tendcare IPO after September 2015,ie,“after the funds were raised and then siphoned away from Tendcare”. 95 The plaintiffs’ argument in substance is that the Post-Termination Agreements were used as tools to siphon monies to Mr Miao. I do not accept the argument for several reasons. (a) First, if the Post-Termination Agreements were meant for this purpose, they surely would have been put in place right at the outset. That they were not puts paid to the plaintiffs’ argument. (b) Second, as stated at [83] above, these agreements were not necessary for monies to be channelled to Mr Miao given the ease with which Mr Gong was unable to transfer funds out of Tendcare without any checks and balances. (c) Third, the plaintiffs’ argument that a higher success fee under the Success Fee Agreement (5.5%) as opposed to that payable under the 2013 HXG LOE (4.5%) was not warranted because HXG had lost the services of Mr Gwee and Mr Sim is contrived for two reasons. First, at the heart of this argument is the fact that the success fee had been increased by 1%. It is a stretch to suggest that an increase of 1% was used as a means to siphon monies from Tendcare to Mr Miao. It is relevant in this regard that under the Retainer Agreement, the monthly retainer that was payable to HXG was actuallyreducedfrom S$100,000 to HK$300,000. Second, the evidence shows that there was significant fund raising activity between 1 February 2015 (the date of the Post-Termination Agreements) and September 2015. In that period, the Easom SPA, the MMIII loan and the OCA loan were secured. This was after the departure of Mr Gwee and Mr Sim. Such activity provides a justification for the increase in success fees. (d) Fourth, the plaintiffs’ argument ignores the fact that one of the Post-Termination Agreements was the IPO Shares Agreement under which Mr Miao negotiated for 3% of the undiluted equity of Tendcare to be given to him or QHC by Gongs Global. If Mr Gong and Mr Miao planned to drain Tendcare dry, negotiating for the increase would have been a pointless exercise. Indeed, it would also have been pointless for Mr Miao to be given any shares at all. (e) Fifth, the fact that HXG stopped work on the Tendcare IPO by September 2015 after the OCA loan had been procured because its “part in the fraud was done” is not supported by the evidence. First, it contradicts Mr Miao’s claim that HXG continued work on the Tendcare IPO after that date. Second, Mr Cheung, who was the plaintiffs’ witness, was the CEO of HXG from December 2014 to April 2018. He did not shed light on what HXG did or did not do in respect of the Tendcare IPO even though he was in a position to do so. Evidence to this effect was missing from his AEIC and the plaintiffs did not pursue the point with him at trial. In any case, even if it were true that HXG did not do any work on the Tendcare IPO after September 2015, that does not necessarily mean that Mr Miao was involved in the fraud. (4) Mr Miao’s inability to explain how the 2013 HXG LOE was profitable 96 The plaintiffs suggest that Mr Miao’s inability to explain how the 2013 HXG LOE was profitable shows that it was a sham which in turn supports his involvement in the Scheme. They make the point that the monthly retainer of S$100,000 was insufficient to cover Mr Gwee’s salary (S$80,000) and Mr Sim’s retainer (S$25,000), let alone the fees payable to KPMG. That Mr Miao “incredibly” denied knowledge of KPMG’s appointment only made his complicity more evident. 97  I do not think that the plaintiffs are correct in asserting that Mr Miao was not able to explain how the Tendcare IPO was profitable for HXG. The following excerpt from the Notes of Evidence is relevant: Q. Now, Mr Miao, at that time when you consented to the MOU, did you do any computation, even if it’s a very rough computation, of whether S$100,000 a month covered Hui Xiang Group’s expenses for this project? A.  This S$100,000 a month is just a small part.We still have 6 per cent of the shareholding,and we still have the 4.5 per cent success fee. Q. Yes, Mr Miao, which is why I had started my questioning on this issue by asking you whether the S$100,000 per month was a minor benefit. So you would agree that it’s a minor benefit, compared to the other benefits? A. Agree. Q. And I don’t think you have answered my question as to whether you did any sort of computation whether the S$100,000 per month would cover expenses for Hui Xiang Group for this project. A. Not enough to cover. Q. Well, Mr Miao, perhaps you can answer my question. It’s whether any computation was made. A.After the company was listed, Hui Xiang Group would have a substantial amount of revenue. [emphasis added] 98 It is clear from the above that Mr Miao had sufficiently explained how the Tendcare IPO would be profitable for HXG. Profitability would result from the 6% undiluted ordinary shares in Tendcare and the 4.5% success fee which HXG stood to gain. The monthly retainer of S$100,000, as Mr Miao mentioned, was only a “minor benefit” and one part of the total consideration for HXG’s services. It would be incorrect to see the monthly retainer in isolation. I accept that Mr Miao’s alleged ignorance of the engagement of KPMG is contrived. I also accept that the 6% undiluted shares in Tendcare was strictly speaking not a benefit that would accrue to HXG (as Mr Miao suggested), but to Mr Miao, Mr Gwee and Mr Sim under the terms of the September 2013 MOU. However, that in and of itself does not suggest complicity in the fraud that was at the heart of the Scheme. I therefore am not persuaded by the plaintiffs’ argument. (5) Mr Miao’s knowledge of the transfers of funds from Tendcare 99 The plaintiffs’ claim against Mr Miao for fraudulent trading also rests on his purported involvement in the some of the Disputed Transfers. They cite two examples. First, a draft email sent to Mr Cheung which was designated for Mr Miao’s review contained a spreadsheet which recorded transfers of funds from the PRC to offshore locations. This, according to the plaintiffs, suggests that Mr Miao and HXG “knew of and were deeply involved in fund transfers relating to Tendcare and [Mr Gong]”. Second, Mr Miao’s involvement in the Tendcare-TJHK-QHC Transfers. The plaintiffs refer to Mr Miao’s pleaded case as well as to his evidence at trial, in which he admitted that he had agreed to use the loans to assist Mr Gong to transfer funds into the PRC to purchase hospitals there. 100 As I have observed above at [73], for Mr Miao to be liable for fraudulent trading, the plaintiffs must show that he was involved in the Scheme and that as a result, he knew that the Disputed Transfers were not meant for the business of the Tian Jian Group or the expenses of the Tendcare IPO. It is insufficient to show that he was involved in the Disputed Transfers. Accordingly, knowledge of funds being transferredoutof the PRCper sedoes not show Mr Miao’s involvement in the Scheme or even in the Disputed Transfers (which in any case concern funds transferredintothe PRC). 101 The Tendcare-TJHK-QHC Transfers, however, do raise questions. Mr Miao accepts that the US$2m QHC Loan and the US$4m QHC Loan were shams in that they do not represent genuine loans from Tian Jian HK to QHC. While Mr Miao says that this was done to circumvent fund transfer restrictions in the PRC in order to purchase hospitals there for the Tian Jian Group, he does not explain why sham loan agreements were needed to achieve this. For Mr Miao to say that he thought this was proper is not credible. Tendcare raised funds from investors and lenders for useinter aliain the Tian Jian Group’s business in the PRC. Accordingly, arrangements would likely have been put in place by Tendcare in consultation with its advisers to legitimately remit the funds to the PRC. As a key adviser in the IPO process, HXG would have been involved in these arrangements. Mr Miao as the owner and controller of HXG would have been privy to the arrangements or at least would have the means to find out if there were any such arrangements before agreeing to the US$2m QHC Loan and the US$4m QHC Loan. It is contrived to suggest that sham loan agreements were an agreed mode of transfer of funds into the PRC. In my view, given that sham loan agreements were being used, Mr Miao must have known that the Tendcare-TJHK-QHC Transfers were not for the business of the Tian Jian Group or the expenses of the Tendcare IPO. At the very least, he was reckless as regards the purpose for which the transfers were made. This isprima facieevidence of dishonesty. Mr Miao’s knowledge does afford a basis for finding him liable for dishonest assistance and knowing receipt. I shall address this later in this judgment (see [154] below). However, this does not necessarily mean that Mr Miao was complicit in the Scheme. It is important that there is no allegation that Mr Miao retained any part of the Disputed Transfers. This suggests that he was not involved in the Scheme. (6) Other grounds 102 The final plank of the plaintiffs’ claim for fraudulent trading against Mr Miao relates to the HXG HK Transfers. The HXG HK Transfers total US$4.29m, consisting of two payments – US$1.75m and US$2.54m made on 27 February 2015 and 10 April 2015 respectively. The plaintiffs make three points. First, the payments were without proper basis. The payment of US$1.75m was roughly equivalent to a success fee of 3.5% on the sum of US$49,987,539.60 raised from Easom when the applicable rate under the Success Fee Agreement was 5.5%. Mr Miao was unable to account for the discrepancy. Second, invoices for success fees at the rate of 5.5% were issued by HXG HK for funds raised from Luxe and NYC under the NYC/Luxe SPA when they were not genuine investors. The plaintiffs point out that Mr Miao’s only explanation for this was that it was a mistake. Third, there was no commercial basis for HXG HK to be paid any success fee for pre-IPO funds raised from Atlantis since KPMG had already been paid a success fee for raising those funds. According to the plaintiffs, the real purpose of the HXG HK Transfers were for Mr Miao and HXG to “take their share of the loot”. Mr Miao’s defence is that the transfers were part payment towards the success fees that HXG was entitled to under the Success Fee Agreement. 103 I do not see any merit in the plaintiffs’ argument for the following reasons: (a) First, a success fee (at the rate of 4.5%) was already stipulated in the September 2013 MOU and in the 2013 HXG LOE, and thereafter in the Success Fee Agreement (at the rate of 5.5%). The plaintiffs do not challenge the legitimacy of the September 2013 MOU and while they do raise questions as regards the 2013 HXG LOE, the argument is not of substance as I have found (see [95(c)] above). Thus, in principle, a success fee was part of the contractual bargain between Tendcare and HXG and insofar as HXG issued invoices for such fee, it is difficult to attribute sinister motives to this. (b) Second, the September 2013 MOU provided that HXG would retain the services of KPMG. Pursuant thereto, HXG engaged KPMG under its letter of engagement dated 30 September 2013. KPMG’s letter of engagement provided that HXG would pay a success fee for pre-IPO funds raised by them. Therefore, it was HXG and not Tendcare who assumed liability for KPMG’s success fees. The fact that KPMG was paid a success feeby HXGfor raising pre-IPO funds did not mean that HXG was not entitled to a success feefrom Tendcarein respect of the same funds. That was a matter of contract between HXG and Tendcare. (c) Third, the evidence indisputably shows that HXG did perform an actual and substantial role in the Tendcare IPO. Emails from KPMG in respect of fund raising activities, examples of which were the 17 January 2014 Email and the 19 May 2014 Email mentioned at [65] and [67] above, were sent to Mr Gwee in his capacity as HXG’s CEO. There was therefore sufficient justification for the success fee as reasonable reward for work done. (d) Fourth, as counsel for Mr Miao submits, the plaintiffs did not lead evidence from Mr Cheung that there was no justification for the HXG HK Transfers even though they were made when he was the CEO of HXG. 104 In these circumstances, it is incorrect for the plaintiffs to suggest that there was no commercial basis for HXG HK to be paid any success fee or that the HXG HK Transfers were a way for Mr Miao and HXG to take their share of the “loot”. In my view, the fact remains that HXG was contractually entitled to success fees for work done in respect of the Tendcare IPO, and as far as it was concerned, the HXG HK Transfers were part payment of such fees. Mr Miao’s mistaken belief as to the arithmetic basis for the calculation of the success fees does not change this conclusion. As for cl 1.2 of the Termination Agreement (see [82(e)] above), in my view, it is clear that the parties did not intend that term to have any contractual effect as they did not provide for payment of any specified sum from BJTJ to HXG. The plaintiffs’ submission that this clause was a mechanism to siphon funds from Tendcare is therefore misconceived. 105 For the reasons above, I find that the plaintiffs’ claim against Mr Miao for fraudulent trading is not made out. The same result applies to the plaintiffs’ claims against HXG, HXG HK and QHC since those claims ride on the success of the plaintiffs’ case against Mr Miao for fraudulent trading. Liability of Ms Wang and Ms Gong for fraudulent trading 106 The plaintiffs’ claim for fraudulent trading against Ms Wang and Ms Gong is unclear. Their pleaded case appears to rest simply on the assertion that Ms Wang and Ms Gong were knowing parties to the Scheme. In respect of the claim against them forknowing receiptanddishonest assistance(but not fraudulent trading), the plaintiffs plead that Ms Wang and Ms Gong’s knowledge stemmed from their familial connection with Mr Gong and their roles in HXTJ (as a “director” (in name only) and accounts executive respectively). In my view, the plaintiffs’ case against Ms Wang and Ms Gong has not been made out. There is no evidence that they were involved in the Tendcare IPO and that they knew at the material time about the Disputed Transfers. Even if they did, there is no evidence that Ms Wang and Ms Gong knew that the Disputed Transfers were not meant for the business of the Tian Jian Group or to meet the costs and expenses of the Tendcare IPO. Indeed, in their closing submissions, the plaintiffs concede that there is no direct evidence of Ms Wang’s and Ms Gong’s involvement in the Disputed Transfers. The plaintiffs therefore submit that Ms Wang and Ms Gongmusthave known of the Disputed Transfers since HXTJ had no other business or operations save for channelling the Disputed Transfers on behalf of Mr Gong. This is by no means an obvious conclusion since it is equally possible thatMr Gonghimself caused the Disputed Transfers to be made without informing them or seeking their assistance. In my judgment, it is unsafe to hold that Ms Wang and Ms Gong were involved in the Scheme and are liable for fraudulent trading. The extent of liability for fraudulent trading 107 I now turn to consider the extent of Mr Gong and HXTJ’s liability for fraudulent trading under s 340(1) of the Companies Act. The plaintiffs submit that in an appropriate case, the court may declare that a fraudulent trader is personally liable forallof the debts and liabilities of the company evenif not all ofit is attributable to his conduct. I shall describe this as punitive relief as the fraudulent trader is made liable for the debts and other liabilities of the companyregardless of whether theyare caused by or incurred as a result of his conduct. In this regard, punitive reliefis limited to the debts and other liabilities of the companyas that is the limitation imposed by the language of s 340(1) of the Companies Act. Alternatively, the plaintiffs submit that the court may exercise its discretion to limit the fraudulent trader’s personal liability only to those debts or liabilities that resulted or was incurred as a result of the fraudulent trading. I shall describe this as remedial or compensatory relief as the fraudulent trader is made liableonly forthe debts or other liabilities of the company that are caused by or incurred as a result of his conduct. The plaintiffs further submit that it is irrelevant to the personal liability of a fraudulent trader that the company has utilised the proceeds from the fraudulent trading for legitimate purposes, unless such proceeds have been applied in “the interests of the creditors”. It is not entirely clear what the plaintiffs mean by this. I understand their argument to mean that the liability of a fraudulent trader may be reduced by the extent to which the proceeds of the fraudulent trading have been utilised to settle the debts owed by the company to its creditors. This issue arises because it is not the plaintiffs’ pleaded case thatallof the MMIII and OCA loans were siphoned from Tendcare or otherwise used for improper or illegitimate purposes (as mentioned above at [25]). In fact, there is no allegation by the plaintiffs that any part of the MMIII loan was wrongfully disbursed. Implicit in the plaintiffs’ case is that all of the MMIII loan and a portion of the OCA loan were either used for legitimate purposes or retained in Tendcare. Indeed, pursuant to cl 1.1(b)(iii) of the OCA CNSA, US$8.63m of the proceeds of the OCA loan had been used to repay a loan owed by BJTJ to Xi Zang Linzhi Fuyuan Investment Co. Ltd. In other words, a portion of the OCA loan had been used to discharge a contractual obligation. 108 On the other hand, Mr Miao, HXG and HXG HK submit that fraudulent traders should be personally liable only for debts or liabilities of the company that arecausally linkedto their fraudulent conduct. Further, fraudulent traders should not be made personally liable for the debts or liabilities of the company where the proceeds thereof have been retained by the company or used by the company for legitimate purposes. 109 The dispute between the parties therefore turns on two issues: (a) Whether Mr Gong and HXTJ ought to be liable for all debts and liabilities of Tendcare, or for only those that are attributable to their fraudulent conduct (“the causation issue”); and (b) Whether Mr Gong and HXTJ ought to be liable for those debts and liabilities that are attributable to their fraudulent conduct where the proceeds thereof have been retained or used by the company for legitimate purposes (“the retention of benefits issue”). 110 I start with the statutory language of s 340(1) of the Companies Act. The section states that the court, “if it thinks proper”, may declare that any person who is knowingly a party to fraudulent trading (as defined in the section) “shall be personally responsible,without any limitation of liability, forall or any of the debts or other liabilitiesof the companyas the Court directs” [emphasis added]. 111 Thus, the court has the discretion under s 340(1) of the Companies Act to make a person who was knowingly involved in fraudulent trading personally responsible for all of the debts and liabilities of the company without any limitation of liability. In other words, the court has the discretion to determine the extent of liability of the relevant person. In determining the principles which guide the exercise of this discretion, it is necessary to have regard to the purpose of s 340(1) of the Companies Act. I should emphasise that it is important to bear in the mind the context of the analysis that will follow. The present claim for fraudulent trading is brought by the judicial manager of Tendcare, as the appointed insolvency representative of the company, under s 340 read with s 227X of the Companies Act. It is not a claim broughtby a creditor or contributoryof Tendcare. This context is important for reasons that will become clear later in this Judgment (see [137] below). 112 Section 340(1) of the Companies Act has its genesis in the United Kingdom,Report of the Company Law Amendment Committee(Cmd 2657, 1926) (Chairman: Wilfred Greene KC) (“the Committee”). The Committee observed, at paragraph 61, that: This subject is in practice closely connected with that of undischarged bankrupts dealt with above. Our attention has been directed particularly to the case (met with principally in private companies) where the person in control of the company holds a floating charge and, while knowing that the company is on the verge of liquidation, “fills up” his security by means of good[s] obtained on credit and then appoints a receiver. We consider that this state of affairs cannot satisfactorily [be] dealt with by altering the law as to floating charges … On the other hand we consider that not only should the person whom the Court finds to have been guilty of fraudulent trading, etc., be subjected to unlimited personal liability but any security over assets of the company held by him or on his behalf or previously held by him or [on] his behalf and assigned to any one save a bona fide holder for value should be charged with the liability. … 113 The focus was therefore on the practice of persons who were in control of companies and who held floating charges disenfranchising creditors by using the companies to purchase goods on credit and subjecting the goods so purchased to their charges. Upon the onset of liquidation, such persons appointed receivers over the goods thereby visiting a loss on the creditors. Thus, the fraudulent trader incurred debts not for the purpose of the company but to strengthen his floating charge, and as such conduct constituted a fraud on the creditors, the Committee recommended the inclusion of the following provision: Where in the course of winding up [of] a company it appears that any business of the company has been carried on with the intent to defraud creditors of the company or of any other company or person or for any fraudulent or illegal purpose the Court should be empowered upon the application of the official receiver or of the liquidator or ofany creditor or contributoryto declare that all or any of the responsible directors of [the] company present or past shall be subject tounlimited personal liabilitiesin respect ofall or any of the debts or other liabilities of the companyand to make any necessary consequential orders for the purpose of enforcing such liability. [emphasis added] 114 It is apparent from the recommendation that both remedialandpunitive reliefs were intended. The remedial relief was to make the fraudulent trader personally liable for the debts of the creditors who were victims of his fraudulent conduct. The punitive relief was to make the fraudulent trader personally forallthe debts and liabilities of the company regardless of whether it was a result of the fraudulent conduct. This is clear from the fact that the application was available to the liquidator, receiver or a contributory of the company and not just to the impacted creditor, and from the wide language of the provisionviz“unlimited personal liabilities” and “all or any of the debts or other liabilities of the company”. 115 The Committee’s recommendation was adopted and enacted as s 275(1) of the Companies Act 1929 (c 23) (UK) (“UK Companies Act 1929”) which read: 275.—(1) If in the course of the winding up of a company it appears that any business of the company has been carried on with intent to defraud creditors of the company or creditors of any other person or for any fraudulent purpose, the court, on the application of the official receiver, or the liquidator or any creditor or contributory of the company, may,if it thinks proper so to do, declare that any of the directors, whether past or present, of the company who were knowingly parties to the carrying on of the business in manner aforesaid shall be personally responsible, without any limitation of liability,for all or any of the debts or other liabilities of the company as the court may direct. [emphasis added] 116 Section 275(1) of the UK Companies Act 1929 was re-enacted in substantially similar terms as s 332(1) of the Companies Act 1948 (c 38) (UK) (“UK Companies Act 1948”). Both these provisions arein pari materiawith s 340(1) of the Companies Act. The remedial and punitive reliefs in s 332(1) was recognised by Lord Denning MR inIn re Cyona Distributors, Ltd.[1967] 1 Ch 889 (“reCyona”) at 902: In my judgment, that section [ie,s 332(1) of the UK Companies Act 1948] is deliberately framed in wide terms so as to enable the court to bring fraudulent persons to book. If a man has carried on the business of a company fraudulently, the court can make an order against him for the payment of a fixed sum …The sum may be compensatory. Or it may be punitive. [emphasis added] 117 Thus, s 340(1) of the Companies Act is intended to provide forbothremedial (or compensatory) and punitive relief. This begs the question: on what basis does the court decide between punitive and remedial reliefs? This question is linked to the causation issue which I shall now consider. (1) The causation issue 118 In my view, the words “if [the court] thinks proper to do so” found ins 340(1) of the Companies Act suggests that it is not in every case that a fraudulent trader ought to be made responsible forallthe debts or other liabilities of the company. This is reinforced by the use of words “anyof the debts or other liabilities of the company as the Court directs” [emphasis added], and not justallof the debts or liabilities of the company. Indeed, if liability forallthe debts and liabilities of the company, whether incurred before or after, or as a result of fraudulent trading, follows from a finding of fraudulent trading, there would be no need for any discretion to be given to the court. Read this way, the section would primarily serve a punitive function. This cannot be correct. 119 Accordingly, I am of the view that the principle of causation ought to guide the exercise of discretion under s 340(1) of the Companies Act as to whether where the sum ordered to be paid serves a remedial or compensatory function. Causation may not necessarily be relevant where the court seeks to grantpunitiverelief (subject to the qualification in [137] below). This view is supported by the observations of Maugham J inIn re William C. Leitch Brothers, Limited[1932] 2 Ch 71 (“Leitch”) on s 275(1) of the UK Companies Act 1929 at 79–80: I am inclined to the view that s. 275 is in the nature of apunitive provision, and that where the Court makes such a declaration in relation to ‘ all or any of the debts or other liabilities of the company,’ it is in the discretion of the Court to make an order without limiting the order to the amount of the debts of those creditors proved to have been defrauded by the acts of the director in question,though no doubt the order would in general be so limited. [emphasis added] 120 Thus,Leitchsuggests that causation wouldgenerallybe required to be shown when the court exercises its discretion under the fraudulent trading provision, save in certain situations which Maugham J did not elaborate on. Presumably such situations would be in the most egregious of circumstances where the sum ordered serves a punitive function. 121 InMorphitis v Bernasconi and others[2003] EWCA Civ 289 (“Morphitis”), Chadwick LJ observed at [53] and [55] in relation to s 213 of the Insolvency Act 1986 (c 45) (UK) that: 53 The power under s 213(2) is to order that persons knowingly party to the carrying on of the company’s business with intent to defraud make “such contributions (if any) to the company’s assets” as the court thinks proper.There must, as it seems to me, be some nexus between (i) the loss which has been caused to the company’s creditors generally by the carrying on of the business in the manner which gives rise to the exercise of the power and (ii) the contribution which those knowingly party to the carrying on of the business in that manner should be ordered to make to the assets in which the company’s creditors will share in the liquidation. … … 55 I am not persuaded that there is power to include a punitive element in the amount of any contribution which, in the exercise of the power conferred by section 213(2) of the 1986 Act, a person should be declared liable to make to the assets of the company. As I have said,I think that the principle on which that power should be exercised is that the contribution to the assets in which the company’s creditors will share in the liquidation should reflect (and compensate for) the loss which has been caused to those creditors by the carrying on of the business in the manner which gives rise to the exercise of the power. Punishment of those who have been party to the carrying on of the business in a manner of which the court disapproves –beyond what is inherent in requiring them to make contribution to the assets of a company with limited liability which they could not otherwise be required to make– seems to me foreign to that principle. Further, the power to punish a person knowingly party to fraudulent trading – formerly contained in section 332(3) of the 1948 Act – has been re-enacted (and preserved) in section 458 of the Companies Act 1985.It could not have been Parliament’s intention that the court would use the power toorder contribution under section 213 of the 1986 Act in order to punish the wrongdoer. [emphasis added] 122 In order to understand the passage inMorphitiscited in the preceding paragraph, it is first necessary to set out the relevant statutory context as Chadwick LJ’s reasoning was heavily influenced by this. 123 Section 213 of the Insolvency Act 1986 (c 45) (UK) states: 213 Fraudulent trading. (1) If in the course of the winding up of a company it appears that any business of the company has been carried on with intent to defraud creditors of the company or creditors of any other person, or for any fraudulent purpose, the following has effect. (2) The court, on the application of the liquidator may declare that any persons who were knowingly parties to the carrying on of the business in the manner above-mentioned areto be liable to make such contributions (if any) to the company’s assets as the court thinks proper. [emphasis added] 124 Section 458 of the Companies Act 1985 (c 6) (UK) (as it stood in 2003, whenMorphitiswas decided) states: 458 Punishment for fraudulent trading. If any business of a company is carried on with intent to defraud creditors of the company or creditors of any other person, or for any fraudulent purpose, every person who was knowingly a party to the carrying on of the business in that manner is liable to imprisonment or a fine, or both. This applies whether or not the company has been, or is in the course of being, wound up. This provision is similar in terms to s 340(5) of the Companies Act. 125 InMorphitis, Chadwick LJ took the view – consistent withLeitch– that the requirement of causation applies to claims for fraudulent trading. However, departing fromLeitchandre Cyona, he went on to opine (obiter, as he had found that there was no fraudulent trading on the facts:Morphitisat [49]–[50]) that the court hadno powertoorder a punitive remedy in respect of fraudulent trading (see [121] above) because of the existence of penal provisions that criminalise and punish such conduct. In my view, this is inconsistent with the scope of s 340 of the Companies Act. Section 340(1) of the Companies Act provides that the court has abroaddiscretion to order the fraudulent trader to be personally responsible “withoutlimitation of liability,forall or anyof the debts or other liabilities of the companyas the Court directs” [emphasis added]. The court thereforehasthe power to order a punitive remedy (up to the extent of the debts or other liabilities of the company) if it thinks fit. There is nothing in s 340(5) (which as noted above provides for criminal penalties for fraudulent trading) that circumscribes the exercise of the discretion in s 340(1) of the Companies Act. Accordingly,even ifthe fraudulent trader isalsocriminally liableto a fine and imprisonment under s 340(5) of the Companies Act, it ought not to influence whether the relief under s 340(1) is awarded on a remedial/compensatory or punitive basis.  Furthermore, the fact that fraudulent trading carries acriminal penaltydoesnotentirely vitiate the court’spowerto grant apunitive civil remedyin respect of the same. Criminal penalties and punitive civil remedies serve distinguishable, though overlapping, purposes. As the Court of Appeal stated inACBv Thomson Medical Pte Ltd and others[2017] 1 SLR 918 at [183]: First, we consider thatcivil punishment performs a distinct and unique function and its purposes are not exhausted just because the criminal law has been brought to bear on the defendant.A condign criminal sentence is one which accurately reflectssociety’sinterest in the “four pillars of sentencing” – that is to say, punishment, deterrence, prevention, and rehabilitation (see the decision of the English Court of Appeal inR v James Henry Sargeant(1974) 60 Cr App R 74 at 77, cited with approval by this court inPP v Kwong Kok Hing[2008] 2 SLR(R) 684 at [17]).While there is no doubt that a punitiveaward has important social functions as well (such as to mark society’s disapproval of outrageous conduct), its chief purpose is tovindicate the plaintiff’sprivateinterests in punishing the defendant, vindicating his interests, and seeking appeasement. In short, therefore, “the task of fixing the appropriate sentence in the criminal proceeding and the inquiry into exemplary damages in the civil proceeding is essentially a different exercise” (seeDanielsat 76perThomson J).For this reason, we disagree with the majority’s opinion inGraythat the purpose behind a punitive award wouldalwayshave been wholly met if substantial punishment had been already inflicted by the criminal law… [emphasis in underline added; emphasis in italics in original] By using broad language in s 340(1) of the Companies Act, Parliament plainly intended the court to have the necessary flexibility to reach a just result in the circumstances of each case, including ordering a punitive remedy where appropriate, although the circumstances justifying such a remedy would, in my view, have to be exceptional, given the presence of statutory punishments for fraudulent trading in s 340(5) of the Companies Act. I can certainly envisage situations where it may be possible to make the argument that the fraudulent trader ought to be also liable for the debts and liabilities of the company not occasioned by his conduct. However, as I have not heard full arguments on the issue and it is in any caseobiter(see [138] below), the point is best left for consideration on a more appropriate occasion in the future. 126 For the reasons set out above, I am unable to accept the view of Chadwick LJ inMorphitisthat the relief under s 340(1) of the Companies Act is only remedial or compensatory. I prefer the view expressed inre CyonaandLeitchthat both compensatory and punitive reliefs are available under s 340(1) of the Companies Act. Having said that, remedial or compensatory relief ought to be the default remedy under s 340(1) of the Companies Act unless the circumstances are so exceptional as to warrant punitive relief (subject to the qualification in [137] below). In general, therefore, causation has to be established (seeLeitchandMorphitisas cited above). Where the court is of the view that punitive relief is appropriate, the need for causation may be dispensed with or at the very least attenuated. As the Court of Appeal inLim Teck Chengv Wyno Marine Pte Ltd (in liquidation)[1999] 3 SLR(R) 543 (“Lim Teck Cheng”) saidat [28]: We do not think that it is helpful, in this case, to dwell on the question whether the order made under s 340 is punitive or compensatory in nature. The section is directed against the improper incurring of new debts or liabilities when a director knows that they are unlikely to be repaid, and provides asummary remedy to recover from the director those debts and liabilities which were paid or incurred as a result of the fraudulent conduct on his part in the management of the company. [emphasis added] 127 It is clear from the passage inLim Teck Chengcited above that s 340(1) of the Companies Act is principally directed at compensatory or remedial relief by providing an avenue for the recovery from a fraudulent trader of debts and liabilities “which were paid or incurred as a result of the fraudulent conduct”. Plainly, it cannot be said that a debt or liability is “paid or incurred as a result of the fraudulent conduct” unless there is causation. 128 Causation is a logical construct and is a universal concept that is an integral part of the fabric of the law:Sim Poh Ping v Winsta Holding Pte Ltd and another and other appeals[2020] 1 SLR 1199 (“Sim Poh Ping”) at [94]. For this reason, the Court of Appeal inSim Poh Pingeschewed an approach to equitable compensation for breaches of fiduciary duties that denuded the requirement of causation of any real substance, observing, in addition, that such an approach “exposes the wrongdoing fiduciary to too great a degree of liability to compensate the principal. It is overly generous to the principal and (potentially at least) overly punishes the wrongdoing fiduciary”: at [238]. While I accept that an order made under s 340(1) of the Companies Act is not necessarily based on the principles of equitable compensation, I see no reason why the concern articulated inSim Poh Pingshould not be relevant in determining how the court ought to exercise its discretion under 340(1) of the Companies Act. Adopting an approach that eschews causation (which is the approach the plaintiffs advocate) would be punitive (not compensatory) and at the same time overly generous to the applicants (eg, by potentially imposing liability for debts that were properly incurred). 129 The need to establish causation is echoed in case law of other common law jurisdictions dealing with fraudulent trading provisions which arein pari materiawith s 340(1) of the Companies Act. In the Australian High Court case ofHardie v Hanson(1960) 105 CLR 451, Dixon CJ observed, in respect ofs 281 of the Companies Act 1943 (WA) (which isin pari materiawith s 340(1) of the Companies Act) that, once two conditionsvizthe carrying on of a business with intent to defraud the creditors or any other person, or for any fraudulent purpose, and knowing participation by the director or directors in such conduct, were satisfied: … the Court, ‘if it thinks proper so to do’, that is to say in its discretion, may declare any of the directors who were knowingly parties to ‘the carrying on of the business in manner aforesaid to be personally responsible’, without any limitation of liability. But for what? In the words of the sub-section, ‘for all or any of the debts or other liabilities of the company as the Court may direct’. To meit seemsdifficult to suppose that it was intended that the Court should in exercising this power of direction go outside debts and liabilities the existence of which was in some way attributable to the carrying on of the business with the requisite intent to defraud. [emphasis added] 130 The plaintiffs point out that in the same case, Menzies J highlighted that Maugham J inLeitchhad decided that the personal liability of a director found liable for fraudulent trading need not be limited to the amount of the debts due to the creditors found to be defrauded. However, as pointed out earlier (at [119] and [120]), inLeitch, Maugham J was simply making the point that causation might not always be relevant though such situations would be limited. Further, he recognised that as a general rule, the liability of a fraudulent trader was subject to causation being established. 131 The same position was taken in New Zealand inLöwer v Traveller[2005] 3 NZLR 479 (“Löwer”), where the Court of Appeal in interpretings 320(1) of the Companies Act 1955 (NZ) (which isin pari materiawith s 340(1) of the Companies Act), stated at [78]–[83]: [78]Section 320 of the 1955 Act conferred a power on the Court in the exercise of its judgment, if it thought it proper to do so, to impose personal liability without limitation on an impugned officer of a company for all or any part of its debts. The principal purpose of the section was tocompensate those who suffered loss as a result of illegitimate trading, the extent of the required contribution being a matter for the Court’s judgment. The factors of particular relevance to the exercise of the Court’s judgment concerning the amount of a declaration under s 320 arecausation, culpability and duration:Re Bennett, Keane & WhiteLtd (in liq) (No 2)(1988) 4 NZCLC 64,317 per Eichelbaum J. [79]The element of causation is concerned with the link between the carrying on of the company’s business recklessly, to the knowledge of the impugned director, and the indebtedness of the company for which it is sought to impose personal liability.In a case such as the present that involves an assessment of how much the liabilities of the company were increased because of the illegitimate delay in its ceasing to trade and the identification of a point in time when the director knew that continuing to trade would be reckless.The resulting figure however is no more than a relevant consideration for the Court although the amount of the director’s liability would not exceed the sum identified as caused by the known reckless trading. … [83]The relevance ofculpability is linked to the deterrent purpose of the provision… bearing in mind that at one end of the range the nature of a director’s involvement will be blind faith or muddleheadedness, whileat the other end there will be actions or instances of inaction which are plainly dishonest:Thompson v Innes(1985) 2 NZCLC 99, 463. Thedeterrent purpose of the section is served in cases involving a high degree of culpability by orders which are punitive as well ascompensatory:Re Cyona Distributors Ltdat p 902. [emphasis added] 132 The New Zealand Court of Appeal inLöwertherefore plainly considered causation as alimitingprinciplein the exercise of the court’s discretion. Causation links the conduct of the fraudulent trader with the indebtedness of the company for which liability is sought to be imposed. On the other hand, culpability is a relevant factor in deciding whether the sum ordered ought to have a deterrent or punitive effect. Deterrence as a consideration assumes greater significance the higher the degree of culpability. The court may then impose a punitive element in the order that it makes. 133 The plaintiffs rely on the Irish High Court case ofReHunting Lodges Ltd (in liquidation)[1984] IEHC 3 (“Re Hunting Lodges”) for the proposition that a fraudulent trader may be made personally liable for debts even where nothing is lost through his actions. In that case, a husband and wife were found liable for fraudulent trading under s 297(1) of the Irish Companies Act 1963, which isin pari materiawith s 340(1) of the Companies Act. The fraudulent conduct of the wife was concerned with the concealment of a sum of money which had been recovered. Carroll J observed, however, at [62] that: Mrs Porrit was concerned with the concealment of £148,000 all of which has been recovered, therefore no loss arises. In deciding whether to make Mrs Porrit liable for debts where nothing was lost through her actions,it is necessary that there should be ‘real moral blame’ attaching to her.In my opinion this does not arise because Mrs Porrit took all the advantages and noneof the responsibilities connected with the company. I consider that she should be personally liable without limitation of liability for all the debts of the company not exceeding the amount or value of any advancement from her husband since 1 December 1976. I have chosen that date as it is the start of the four year period when the accounts had to be reconstructed. I direct that Mrs Porrit make discovery on oath of any such advancement. She is already liable to the company on foot of the directors’ loan account. [emphasis added] 134 Thus, inRe Hunting Lodges, the Irish High Court was of the view that “real moral blame” was necessary in order for a fraudulent trader to be held personally responsible for debts which were not caused by the fraudulent conduct. Carroll J did not elaborate on what “real moral blame” was and cited no authority for that proposition. However, the use of “real moral blame” by Carroll J echoes the approach inLöwerwhere a punitive element was regarded as warranted if the level of culpability was high. In other words, “real moral blame” was necessary to invoke thepunitiveand not compensatory remedy for fraudulent trading. To that extent,Re Hunting Lodgesdoes not assist the plaintiffs’ argument that causation is not a relevant consideration. 135 I should add that as fraudulent conduct is the core ingredient of liability for fraudulent trading, the fact that there is fraudulent conduct sufficient to establish liability does not in and of itself warrant making an order on a punitive basis. This would result in a punitive element being imposed in all cases thereby obviating the need for causation and rendering the court’s discretion meaningless. In my view, for there to be a punitive element, there must be the necessary level of culpability. 136 The plaintiffs also draw my attention toTong Tien See Construction Pte Ltd (in liquidation) v Tong Tien See and others[2001] 3 SLR(R) 887 (“Tong Tien See”). They submit that in that case, the High Court ordered the defendants to be personally liable forallthe debts of the company and supposedly “did not think it was necessary to examine whether there was a causal link between the debts of the company, and the conduct of the defendants”. It appears from a closer examination of the judgment, however, that the debts of the company (amounting to S$53.3m: at [64]) was in fact equivalent to the loss/damage suffered by the company in respect of an unlawful means conspiracy on the part of the defendants: at [82]. The requirement of causation applies to a claim for unlawful means conspiracy:EFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFTHoldings”) at [112]. In any case, the court inTong Tien Seefound that the fraudulent trading lay in the defendants’ manipulation of the company’s accounts to falsely project an image of health so that the company would continue to be awarded new projects. The cashflows generated from these projects were used to pay the debts due under previous projects. This scheme came to an end when the company failed to secure new projects: at [56]. Thus, all the debts of the company were attributable to the defendants’ fraudulent conduct in procuring the projects using falsified company accounts. The requisite causal link was present inTong Tien See. Ittherefore does not support the plaintiffs’ argument that causation is not required. 137 I am therefore of the view that the sum ordered under s 340(1) of the Companies Act generally serves a remedial or compensatory function. Accordingly, causation has to be established and serves as a limiting factor. However, inexceptionalcircumstances, apunitiveremedy may be ordered in which case causation may not be a determinative consideration. I should add a caveat to the analysis and conclusion thus far, which I referred to at [111] above. Section 340(1) of the Companies Act allows a claim to be brought not only by a liquidator or judicial manager (when read with s 227X of the Companies Act) but also a creditor or contributory. If the liquidator or judicial manager brings the claim, as the appointed insolvency representative he represents the estate in insolvency. In such a situation, it seems correct to consider whether the relief ought to be remedial/compensatory or punitive. This is because the proceeds of recovery are for the benefit of the estate in insolvency which is burdened by all the debts and other liabilities of the debtor company. The claim under s 340(1) of the Companies Act offers the liquidator or judicial manager a summary process to potentially make the estate whole by seeking punitive relief (as noted above at [126]). However, where the applicant is a creditor or contributory, the case for punitive relief is unclear. As apreliminaryview, it seems intuitively correct to say that where the applicant is a creditor or contributory, the applicant ought to be limited to the loss that it had suffered as a result of the fraudulent conduct (iethe debts and other liabilities of the creditor that were incurred as a result of the fraudulent trading). Nevertheless, as this is an issue that has not been ventilated before me, I do not express a conclusive view on the matter. It is best left for consideration on a future appropriate occasion. 138 In the present case, causation is satisfied as regards the sums claimed by the plaintiffs. As stated above, the plaintiffs’ claim is limited to the loans extended by MMIII and OCA to Tendcare. The loans were raised by Tendcare purportedly for the business of the Tian Jian Group and the Tendcare IPO when the true intention of Mr Gong and by attribution HXTJ was otherwise. Therefore, but for the fraudulent conduct of Mr Gong and HXTJ pursuant to the Scheme, the debts owed to MMIII and OCA would not have been incurred by Tendcare. The requisite causal link is therefore present. For this reason, it is unnecessary for me to lay down any rule as to the circumstances in which the court may justifiably dispense with the requirement of causation. As I observed at [125] above, this issue is therefore best left for future consideration when a suitable case arises. This leaves the question of whether Mr Gong and HXTJ ought to be liable for the full extent of the loans. This requires consideration of the retention of benefits issue to which I now turn. (2) The retention of benefits issue 139 The retention of benefits issue, as observed above at [107], arises because part of the OCA loan was used to discharge a contractual obligation in the OCA CNSA. The plaintiffs acknowledge this as they do not plead that all of the proceeds of the MMIII and OCA loans were misapplied. Thus, on the plaintiffs’ case, part of the proceeds of the MMIII and OCA loans were not misappropriated; being either retained in Tendcare, or used for legitimate purposes. The question that arises therefore is this: where the proceeds of a fraudulently obtained loan are retained in the company, or are otherwise applied by the company for legitimate purposes, should the personal liability of the fraudulent trader under s 340(1) of the Companies Act be reducedprotanto? 140 The purpose of s 340(1) of the Companies Act, which, as I have observed above at [122]–[127], is to allow creditors who are defrauded analternativesummary avenue of recovery against the fraudulent traderpersonally. Once fraudulent conduct and the causal link between the conduct and the debts and other liabilities of the company are established, it seems to me that liability ought to follow to the full extent of such debts and other liabilities. If the fraudulent trader has caused the company to incur debts and liabilities whichbut forthe fraudulent conduct would not have been incurred, it ought not to matter that the some of the proceeds thereof was used to benefit the company. The fact is that the fraudulent trader by his fraudulent enterprise caused the company to incur a debt by defrauding the creditor. The debt ought not have been incurred in the first place. It therefore seems incorrect to conclude that the personal liability of the fraudulent trader ought to be reduced by the extent to which a benefit has been obtained by the company from use of the proceeds of the fraudulent trading, or the extent to which such proceeds have been retained by the company.",
        "Breach of directors’ duties": "141 I turn now to the plaintiffs’ claim against Mr Gong for breach of directors’ duties. The damages claimed are represented by the Disputed Transfers. The law 142 The plaintiffs plead that the following duties are owed to Tendcare by Mr Gongquadirector: the duty to act honestly in the discharge of his duties as a director; the duty to actbona fidein the company’s interests; the duty to act for a proper purpose in relation to the company’s affairs and duties as a trustee of the company’s assets. Mr Gong only admits to owing common law and statutory duties to Tendcarequadirector without specifying what those duties are. In my view, there can be no doubt that Mr Gong owes the duties pleaded by the plaintiffs. As the Court of Appeal inTownsing Henry George v Jenton Overseas Investment Pte Ltd (in liquidation)[2007] 2 SLR(R) 597 observed at [56], these are well-established duties of a director of a company. Whether Mr Gong breached his fiduciary duties to Tendcare 143 The Disputed Transfers involved the movement of funds out of the Tian Jian Group. As noted above at [26], the Disputed Transfers comprised the HXTJ Transfers, the Tendcare-TJHK-QHC Transfers and the HXG HK Transfers. 144 In my judgment, the HXTJ Transfers, totalling US$35m and S$500,000, represent a misapplication of Tendcare’s funds, and are therefore custodial breaches of Mr Gong’s fiduciary duties owed to Tendcare:Sim Poh Pingat [106]. Mr Gong’s defence was based on the Entrustment Agreement. However, for reasons set out earlier in this judgment (see [80] above), I do not accept its authenticity. Furthermore, the Entrustment Agreement does not explain the need to transfer funds from Tendcare (a Singapore company) to HXTJ (another Singapore company) controlled by the same person (again, see [80] above). No satisfactory defence has been put forward by Mr Gong to the plaintiffs’ case. I therefore find that Mr Gong is liable to Tendcare for the sum of US$35m and S$500,000 as regards the HXTJ Transfers. 145 The second category of Disputed Transfersiethe Tendcare-TJHK-QHC Transfers, involved the transfer of US$2m and US$4m on 11 March 2015 and 22 September 2015 respectively from Tendcare to Tian Jian HK. These sums were then transferred by Tian Jian HK to QHC by way of the US$2m QHC Loan and the US$4m QHC Loan on 15 April 2015 and 23 September 2015 respectively. Mr Miao accepts that these loan agreements were shams. According to Mr Miao, the loan agreements were the means by which funds were remitted into the PRC, ostensibly for Mr Gong to purchase hospitals there. As stated above at [101], I do not accept the explanation offered by Mr Miao. It is relevant that the funds remitted to QHC were ultimately transferred to Mr Gong’s personal bank account, and there was no satisfactory explanation as to how they were dealt with thereafter. This suggests that they were in fact misappropriated by Mr Gong. In my view, the whole scheme of transferring funds from Tendcare to QHC via Tian Jian HK using sham loan agreements – funds which ultimately ended up in Mr Gong’s personal bank account – amounted to dealing with the funds in a manner inconsistent with Tendcare’s interests. It seems evident that by concocting these arrangements, Mr Gong was in breach of his fiduciary duties to Tendcare. I therefore find that Mr Gong is liable to Tendcare for the sum of US$6m that was transferred pursuant to the Tendcare-TJHK-QHC Transfers. 146 Finally, the third category of fund transfers,ie,the HXG HK Transfers, represented, as I observed at [103] above, part payment of success fees owed to HXG HK. In my judgment, these were legitimate payments and Mr Gong did not breach his duties to Tendcare in causing them to be made. 147 I therefore find that Mr Gong breached his duties to Tendcare in transferring a total of US$41m and S$500,000 to HXTJ and QHC without any proper basis for doing so. Mr Gong is accordingly liable to Tendcare for that sum.",
        "Deceit": "148 Given my findings on Mr Gong’s breach of directors’ duties above, it is only necessary for me to consider the plaintiffs’ alternative case in deceit against Mr Gong in respect of the HXG HK Transfers. 149 The Court of Appeal inPanatron Pte Ltdand another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 set out the elements of the tort of deceit at [14] as follows: Basically there are the following essential elements. First, there must be a representation of fact made by words or conduct. Second, the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff. Third, it must be proved that the plaintiff had acted upon the false statement. Fourth, it must be proved that the plaintiff suffered damage by so doing. Fifth, the representation must be made with knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. 150 The plaintiffs’ pleaded case is that Mr Gong represented to Tendcare that the funds transferred to HXG HK were for the purposes stated in the payment authorisation instructions or otherwise for the legitimate purposes of Tendcare, knowing that such representations were false, and intending that Tendcare would act in reliance on such representations in remitting the funds. However, the transfers were in my judgment legitimate payments for success fees owed by Tendcare in respect of work done for the Tendcare IPO (see [104] and [146] above). The representations were not fraudulent as alleged. Deceit is therefore not made out.",
        "Dishonest assistance and knowing receipt": "Dishonest assistance 151 Dishonest assistance is a form of accessory liability. The cause of action is made out by establishing four elements: (a) the existence of a trust or fiduciary obligation; (b) a breach of trust or a fiduciary obligation; (c) assistance was rendered for the breach; and (d) the assistance was dishonest:Banque Nationale de Paris v Hew Keong Chan Gary[2000] 3 SLR(R) 686 at [136]. Dishonesty is shown if the relevant party has “such knowledge of the irregular shortcomings of the transaction that ordinary honest people would consider it to be a breach of standards of honest conduct if he failed to adequately query them”:George Raymond Zage III and another v Ho Chi Kwong and another[2010] 2 SLR 589 (“Zage”) at [22]. 152 As I have found that the HXG HK Transfers were legitimate (see [104] and [150] above), the dishonest assistance claim against the defendants (other than Mr Gong) is limited to the HXTJ Transfers and the Tendcare-TJHK-QHC Transfers. 153 I am satisfied that HXTJ’s liability for dishonestly assisting Mr Gong with the HXTJ Transfers is established on two bases: first, that it was plainly involved in the transfer of funds from Tendcare to an entity outside the Tian Jian Group (ie,itself) and second, that Mr Gong’s knowledge should be imputed to HXTJ: see [49] above. 154 For the reasons outlined earlier at [101] and [145], I am of the view that Mr Miao is liable for dishonestly assisting Mr Gong to breach fiduciary duties as regards the Tendcare-TJHK-QHC Transfers. It is clear that Mr Miao had agreed to use irregular means of transferring funds from Tendcare to QHC (via Tian Jian HK) namely, the sham “loan” agreements for the US$2m QHC Loan and the US$4m QHC Loan. I do not accept Mr Miao’s explanation as to why such means were used. I also do not accept the purported purpose for which the funds were remitted into the PRC. The fact remains that these funds eventually found their way into Mr Gong’s personal bank account and there is complete opacity as to how they were subsequently deployed. Collectively, this plainly calls into question thebona fidesof the transactions and indeed also of Mr Miao. In my judgment, Mr Miao facilitated Mr Gong’s breach of fiduciary duties in this regard. He knew at least from the time of the US$2m QHC Loan and the US$4m QHC Loan that the funds transferred pursuant thereto were not being remitted for the purpose of the Tian Jian Group’s business or the Tendcare IPO. At the very least, he was reckless as to the same. Mr Miao’s knowledge is attributable to QHC (see [49] above). Accordingly, I find both Mr Miao and QHC liable for dishonest assistance as regards the US$6m that was transferred pursuant to the Tendcare-TJHK-QHC Transfers. 155 There is no evidence that: (a) HXTJ was involved in the Tendcare-TJHK-QHC Transfers; (b) Mr Miao or QHC were involved in the HXTJ Transfers; and (c) HXG, HXG HK, Ms Wang and Ms Gong (which I have observed earlier) were involved in the HXTJ Transfers or the Tendcare-TJHK-QHC Transfers. Accordingly, in my view, the claim for dishonest assistance is only made out against HXTJ as regards the HXTJ Transfers and against Mr Miao and QHC as regards the Tendcare-TJHK-QHC Transfers. Knowing receipt 156 There are three elements of knowing receipt: (a) disposal of the plaintiffs’ assets in breach of fiduciary duty; (b) beneficial receipt by the defendant of assets which are traceable to the assets disposed of; and (c) knowledge on the part of the defendant that the assets received are traceable to a breach of fiduciary duty:Zageat [23]. Since onlythe HXTJ Transfers and the Tendcare-TJHK-QHC Transfers represented disposals of Tendcare’s assets in breach of fiduciary duty, the plaintiffs’ claim is limited to the proceeds of the HXTJ Transfers and the Tendcare-TJHK-QHC Transfers. 157 As I have found that HXTJ and Mr Miao/QHC were liable for dishonest assistance in respect of the HXTJ Transfers and the Tendcare-TJHK-QHC Transfers respectively, it is unnecessary for me to consider their liability for knowing receipt in respect of such transfers. 158 In respect of the HXTJ Transfers, there is no evidence that the funds transferred were received by Mr Miao, QHC, HXG, HXG HK, Ms Wang and Ms Gong. As for the Tendcare-TJHK-QHC Transfers, there is similarly no evidence that the funds transferred were received by HXTJ, HXG, HXG HK, Ms Wang and Ms Gong. I am therefore of the view that: (a) HXTJ is not liable for knowing receipt in respect of the Tendcare-TJHK-QHC Transfers; (b) Mr Miao and QHC are not liable for knowing receipt in respect of the HXTJ Transfers; and (c) HXG, HXG HK, Ms Wang and Ms Gong are not liable for knowing receipt in respect of the HXTJ Transfers or the Tendcare-TJHK-QHC Transfers.",
        "Conspiracy": "159 The elements of unlawful means conspiracy were set out by the Court of Appeal inEFT Holdingsat [112] as follows: (a) A combination of two or more persons to do certain acts; (b) The alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts; (c) The acts were unlawful; (d) The acts were performed in furtherance of the agreement; and (e) The plaintiff suffered loss as a result of the conspiracy. 160 The plaintiffs’ pleaded case is that the defendants had a common intention to work together to defraud investors by raising funds through Tendcare and thereafter misappropriating or dissipating the funds raised. Thus, the claims for fraudulent trading and for unlawful means conspiracy rest on the same foundation,ie,the defendants were party to the Scheme pursuant to which the pre-IPO funds were raised on false pretences and subsequently misappropriated. Thus, where the claim for fraudulent trading has not been made out, the claim for unlawful means conspiracy ought to fail as well. 161 Accordingly: (a)  The claim in conspiracy against Mr Miao, QHC, HXG and HXG HK for the HXTJ Transfers ought to be dismissed as there is no evidence that they were part of the Scheme or connected to the transfers; (b) The claim in conspiracy against HXG and HXG HK in relation to the Tendcare-TJHK-QHC Transfers ought to be dismissed as there is no evidence that they were involved in the transfers; (c) The claim in conspiracy against Ms Wang and Ms Gong ought to be dismissed as there is no evidence that they were involved in any of the Disputed Transfers or that they intended to injure Tendcare as a result; and (d) I have expressed my view at [104], [146], [150] and [152] above that the HXG HK Transfers were legitimate part payments of success fees for pre-IPO funds raised for the Tendcare IPO. The claim in conspiracy against the defendants in respect of these transfers ought therefore to be dismissed. 162 Finally, it is unnecessary for me to deal with the claim in conspiracy against Mr Gong and HXTJ as regards the HXTJ Transfers and against Mr Miao and QHC as regards the Tendcare-TJHK-QHC Transfers as I have found Mr Gong liable for breach of directors’ duties, and HXTJ and Mr Miao/QHC liable for dishonest assistance in respect of the HXTJ Transfers and the Tendcare-TJHK-QHC Transfers respectively.",
        "Unjust enrichment": "163 Similar to the conspiracy claim, it is only necessary for me to consider the unjust enrichment claim against Mr Miao, QHC, HXG, HXG HK, Ms Wang and Ms Gong in respect of the HXTJ Transfers; against HXG, HXG HK, Ms Wang and Ms Gong in respect of the Tendcare-TJHK-QHC Transfers; and against all the defendants in respect of the HXG HK Transfers. I should note that although the plaintiffs have pleaded a claim in unjust enrichment, no arguments on this point were made in their closing and reply written submissions, and it appears to me that they have implicitly abandoned the claim. I therefore say nothing further on it.",
        "Summary of the defendants’ liability": "165 In conclusion, I find that Mr Gong and HXTJ are jointly and severally liable for fraudulent trading for all the proceeds of the MMIII and OCA loans. I also find Mr Gong liable for breach of fiduciary duties owed to Tendcare for the HXTJ Transfers, and HXTJ jointly and severally liable with him for dishonest assistance for that breach. Further, I find Mr Gong liable for breach of fiduciary duties owed to Tendcare for the Tendcare-TJHK-QHC Transfers, and Mr Miao and QHC jointly and severally liable with him for dishonest assistance of that breach. 166 As the sum of US$4m (in respect of the US$4m QHC Loans) falls underboththe proceeds of the OCA loanandthe Tendcare-TJHK-QHC Transfers, I shall deal separately with this sum. I do this by deducting the sum of US$4m from the joint and several liability of Mr Gong and HXTJ for fraudulent tradingandfrom the joint and several liability of Mr Gong, Mr Miao and QHC in respect of the Tendcare-TJHK-QHC Transfers, and instead make Mr Gong, HXTJ, Mr Miao and QHC jointly and severally liable for this sum. Joint and several liability can and should be imposed on separate sets of wrongdoers for separately and independently causing the same indivisible loss suffered by the claimant: seeChong Kim Beng v Lim Ka Poh (trading as Mysteel Engineering Contractor) and others[2015] 3 SLR 652 at [39], citingJet HoldingLtd and others v Cooper Cameron (Singapore) Pte Ltd and another[2005] 4 SLR(R) 417 at [164].",
        "Conclusion": "167 In conclusion, I find that Mr Gong and HXTJ are jointly and severally liable to Mr Yit (as the judicial manager of Tendcare) for fraudulent trading in the sum of US$61,207,538.03 (the plaintiffs’ fraudulent trading claim of US$65,207,538.03 less US$4m as stated at [166]). I also find Mr Gong liable to Tendcare for breach of the fiduciary duties owed to Tendcare, and HXTJ jointly and severally liable to Tendcare with him for dishonest assistance of such breach in respect of the HXTJ Transfers, for the sum of US$35m and S$500,000. 168 I further find Mr Gong liable to Tendcare for breach of fiduciary duties in respect of the Tendcare-TJHK-QHC Transfers, and Mr Miao and QHC jointly and severally liable to Tendcare with him for dishonest assistance of such breach, for the sum of US$2m (the total claim of US$6m less US$4m). 169 Finally, I find Mr Gong, HXTJ, Mr Miao and QHC jointly and severally liable to the plaintiffs for the sum of US$4m, which falls withinboththe plaintiffs’ fraudulent trading claim and their claim for dishonest assistance of Mr Gong’s breach of fiduciary duties in respect of the Tendcare-TJHK-QHC Transfers. 170 I set out a table of the claims for which I have found each defendant liable and their corresponding liability, keeping in mind the rules against double recovery: Defendants liableAmountFraudulent tradingMr Gong and HXTJ (jointly and severally)US$61,207,538.03Breach of fiduciary duties / Dishonest assistanceHXTJ Transfers: Mr Gong and HXTJ (jointly and severally)US$35,000,000 and S$500,000Tendcare-TJHK-QHC Transfers: Mr Gong, Mr Miao and QHC (jointly and severally)US$2,000,000Fraudulent tradingandbreach of fiduciary duties / dishonest assistanceMr Gong, HXTJ, Mr Miao and QHC (jointly and severally)US$4,000,000 171 Judgment is granted accordingly, and all other claims and counterclaims are dismissed. I will hear the parties on costs. Parties are to file their submissions on costs, limited to 10 pages each, within fourteen days from the date hereof. Kannan RameshJudge of the High Court Lee Eng Beng SC, Cheng Wai Yuen, Mark, Chew Xiang, Soh Yu Xian, Priscilla, Tan Tian Hui and Lim Wee Teck, Darren (Rajah & Tann Singapore LLP) for the plaintiffs; Chan Chee Yin, Andrew, Tiong Yung Suh Edward, Lim Dao Kai, Kwok Wei, Edward, Ngiam Hian San, Laura (Yan Xianshan) and Serene Chee (Allen & Gledhill LLP) for the seventh to tenth defendants; The first, second, eleventh and twelfth defendants absent and unrepresented.",
        "Annex": ""
    }
}