{
    "case_title": "GTMS Construction Pte Ltd vSer Kim Koi(Chan Sau Yan (formerly trading as Chan Sau Yan Associates) and another, third parties)",
    "ncitation": "[2021] SGHC 33",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1 On 26 January 2021, following the release of my judgment inGTMS Construction Pte Ltd v Ser Kim Koi (Chan Sau Yan (formerly trading as Chan Sau Yan Associates) and another, third parties)[2021] SGHC 9 (“the Judgment”), the plaintiff wrote to the court to inquire whether the judgment sum of $1,103,915.48 awarded to the plaintiff on 18 January 2021 included interest. I had inadvertently omitted to award the plaintiff interest on the judgment sum. I see no reason to depart from the default interest rate of 5.33%perannum, which is prescribed by para 77 of the Supreme Court Practice Directions. Accordingly, I award the plaintiff interest at the rate of 5.33%per annumon the sums due under TI25, TI26 and TI27 from the date at which each of the respective causes of action arose. 2 Pursuant to [750] of the Judgment, parties were directed to file written submissions on costs and a hearing was fixed on 10 February 2021 for the parties to make oral submissions. Having considered the parties’ submissions, I shall now set out my decision in respect of costs. For convenience, I shall adopt the abbreviations used in the Judgment.",
        "The parties’ submissions": "",
        "The plaintiff’s submissions": "3 The plaintiff submits that it should be entitled to indemnity costs from the defendant, for the following five reasons: (a) The defendant conducted his case in an improper and oppressive manner, by making use of his financial resources to inundate the plaintiff with multiple false allegations of defects. This was a misuse of the court’s judicial resources and would result in a great loss to the plaintiff if the plaintiff is not awarded indemnity costs.1Foot Note 1×Plaintiff’s Costs Submissions (“PS”) at paras 7–12. (b) The defendant abused the judicial process by raising at the trial allegations not contained in his pleadings and in his AEICs. The defendant also introduced new evidence in the middle of the trial. This dragged the matter on without plausible reason and resulted in the needless escalation of costs.2Foot Note 2×PS at paras 13–18. (c) By pursuing trivial claims against the plaintiff, the defendant caused the plaintiff to expend an inordinate amount of time and resources in responding to the defendant’s claims.3Foot Note 3×PS at paras 19–21. (d) The defendant was dishonest and lied in giving evidence.4Foot Note 4×PS at paras 22–25. (e) The defendant made unmeritorious allegations of fraud against the plaintiff, which dealt a huge blow to the plaintiff’s business by damaging its professional reputation.5Foot Note 5×PS at paras 26–29.",
        "The third parties’ submissions": "4 The third parties similarly submit that they should be entitled to costs on an indemnity basis from the defendant.6Foot Note 6×Third Parties’ Costs Submissions (“TPS”) at para 2(a).In support of this submission, the third parties highlight the following: (a) The defendant unreasonably rejected the third parties’ offers to mediate, which were made to the defendant on 10 May 2019 and 25 June 2019.7Foot Note 7×TPS at paras 9–13. (b) The defendant unreasonably persisted in making unmeritorious conspiracy claims against the third parties.8Foot Note 8×TPS at paras 14–21. (c) The defendant recklessly and dishonestly put forward an evolving set of conjured allegations. The imposition of indemnity costs is required to discourage litigants such as the defendant from bullying parties with fewer resources.9Foot Note 9×TPS at paras 22–27. (d) In relation to the second third party, the defendant had been repeatedly informed by the third parties that the second third party should not be joined to the proceedings in the Suit. This was because the deed of novation transferring the first third party’s obligations under the MOA to the second third party was never signed. However, the defendant continued to join the second third party to the Suit. The defendant’s explanation that he had joined the second third party out of prudence was insufficient.10Foot Note 10×TPS at paras 30–31. 5 In the alternative, the third parties seek costs on a standard basis from 29 January 2014 (which was the date of the third party notice to join the third parties to the Suit) to 6 March 2017 (which was the deadline for the defendant to accept the open offer to settle made by the third parties in their solicitors’ letter dated 22 February 2017). The third parties argue that, after 6 March 2017, the defendant should pay costs on an indemnity basis.11Foot Note 11×TPS at para 2(b).In the further alternative, the third parties seek costs on a standard basis from 29 January 2014 to 20 July 2019, which was the deadline for the defendant to accept the further offer to settle made by the third parties in their Calderbank letter dated 5 July 2019. The third parties argue that the defendant should pay costs on an indemnity basis after 20 July 2019.12Foot Note 12×TPS at para 2(c).The offers contained in both of these letters were rejected by the defendant and these offers were more favourable to the defendant than the outcome of the Suit.13Foot Note 13×TPS at paras 7–8. 6 Finally, the third parties request the court to award a certificate pursuant to O 59 r 19 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”) certifying that costs for getting up the case by and for attendance in court of more than two solicitors shall be allowed (“a Certificate of Three Counsel”). The third parties highlight the following: (a) specialised knowledge of building and construction law was necessary in this case; (b) significant time was expended; (c) there were at least five distinct claims against the third parties, all of which required detailed legal and factual analyses, with voluminous documents involved; and (d) the matter was of great personal and professional importance to the third parties.14Foot Note 14×TPS at paras 32–34.",
        "The defendant’s submissions": "7 In response, the defendant submits that (a) costs should be ordered on the usual standard basisvis-à-visthe plaintiff, to be agreed or taxed; and (b) no order as to costs should be made between the defendant and the third parties.15Foot Note 15×Defendant’s Costs Submissions (“DS”) at para 41.In relation to costsvis-à-visthe plaintiff, the defendant submits that there are no exceptional circumstances in this case to warrant a departure from the usual standard basis: (a) The defendant had good reasons for not calling Mr Cheung as a witness to give evidence regarding the defendant’s conspiracy claims.16Foot Note 16×DS at paras 7–8. (b) The plaintiff and the third parties exaggerate the extent of costs incurred in having to defend against the defendant’s allegation of bribery.17Foot Note 17×DS at para 12. (c) It was not unreasonable for the defendant to pursue his claims for defects and non-compliant works. The court found in favour of the defendant in respect of some of these claims and these claims only formed part of the defendant’s case in the Suit.18Foot Note 18×DS at paras 17–19. (d) The defendant had, in good faith, previously attempted mediation with the plaintiff and the third parties but parties were unable to reach a settlement. Thus, it was reasonable for the defendant to consider that any further mediation would not be beneficial to the parties.19Foot Note 19×DS at paras 20–21. 8 In relation to the third parties, the defendant further submits that no order for costs should be made as between the third parties and the defendant, for the following reasons: (a) It was the first third party and not the defendant who had conducted the proceedings unreasonably, as it was only during the trial that he admitted that he had not considered Item 72 of the Preliminaries. Furthermore, according to the defendant, the court found in favour of the defendant in relation to the defendant’s claim against the first third party in negligence.20Foot Note 20×DS at paras 13–16. (b) The costs consequences set out in O 22A of the ROC should not apply as the offers made by the third parties to the defendant were not offers to settle.21Foot Note 21×DS at paras 22–28.Furthermore, even if O 22A applies, the third parties cannot rely on the earlier letter dated 22 February 2017 as that letter was nullified by the third parties’ subsequent letter dated 5 July 2019.22Foot Note 22×DS at paras 29–30. (c) The second third party should not be awarded indemnity costs as an ill-advised joinder of a third party is insufficient to warrant an order for indemnity costs, and the third parties are essentially claiming for duplicate costs as the first third party and the second third party were represented by the same set of solicitors throughout the proceedings.23Foot Note 23×DS at paras 32–34. 9 The defendant further submits that the third parties have failed to make a formal application for a Certificate of Three Counsel. In any case, there are no exceptional circumstances or novel or complex issues of law in this case that warrant the grant of a Certificate of Three Counsel.24Foot Note 24×DS at paras 35–39.",
        "My decision": "",
        "The applicable principles": "10 Order 59 rr 27(1)(a) and 27(3) of the ROC provide as follows: Basis of taxation (O. 59, r. 27) 27.—(1) Subject to the other provisions of these Rules, the amount of costs which any party shall be entitled to recover is the amount allowed after taxation on the standard basis where — (a) an order is made that the costs of one party to proceedings be paid by another party to those proceedings; … unless it appears to the Court to be appropriate to order costs to be taxed on the indemnity basis. … (3) On a taxation on the indemnity basis, all costs shall be allowed except in so far as they are of an unreasonable amount or have been unreasonably incurred and any doubts which the Registrar may have as to whether the costs were reasonably incurred or were reasonable in amount shall be resolved in favour of the receiving party … 11 It is trite that the court will only award indemnity costs in exceptional circumstances “when it is clearly just or appropriate to do so” (seeSingapore Court Practice(Jeffrey Pinsler gen ed) (LexisNexis Singapore, 2021) at para 59/27/4). As Chan Seng Onn J observed inAirtrust(Hong Kong) Ltd v PH Hydraulics & Engineering Pte Ltd[2016] 5 SLR 103 (“Airtrust”) at [17], “an order of costs on the indemnity basis is the exception rather than the norm and requires justification”. 12 In determining whether an order of indemnity costs is warranted, the following remarks by Chan J inAirtrustat [50] are instructive: … In my view, a focus on the unreasonableness of the party’s conduct may be preferred. As a baseline inquiry, it may be useful for a court to ask itself whether the party’s conduct was so unreasonable as to justify an award of indemnity costs. Such conduct must reflect a high degree of unreasonableness, and cannot merely be wrong or misguided in hindsight … Such unreasonableness, however, need not rise to the level of dishonesty or moral iniquity for it to attract indemnity costs. But in my judgment, the extent of a party’s dishonest and unscrupulous intentions and actions, where present, will be relevant factors for the court to take into account. 13 The starting point in this inquiry as to unreasonableness is O 59 r 5 of the ROC (seeAirtrustat [18]), which provides as follows: 5.The Court in exercising its discretion as to costs shall, to such extent, if any, as may be appropriate in the circumstances, take into account — (a) any payment of money into Court and the amount of such payment; (b) the conduct of all the parties, including conduct before and during the proceedings; (c) the parties’ conduct in relation to any attempt at resolving the cause or matter by mediation or any other means of dispute resolution; and (d) in particular, the extent to which the parties have followed any relevant pre-action protocol or practice direction for the time being issued by the Registrar. 14 InAirtrustat [23], Chan J also set out four non-exhaustive and potentially overlapping categories of conduct by a party which may provide good reason for an order of indemnity costs to be made, as follows: (a) where the action is brought in bad faith, as a means of oppression or for other improper purposes; (b) where the action is speculative, hypothetical or clearly without basis; (c) where a party’s conduct in the course of proceedings is dishonest, abusive or improper; and (d) where the action amounts to wasteful or duplicative litigation or is otherwise an abuse of process.",
        "Costs as between the plaintiff and the defendant": "15 Having considered the parties’ submissions, I find that it would be appropriate to order the defendant to pay to the plaintiff costs on a standard basis from 13 January 2014 (ie, the date the writ was filed)up until the date of the commencement of the trial on 8 November 2018, with costs payable on an indemnity basis thereafter. In reaching this decision, I found the following conduct of the defendant particularly pertinent. 16 First, the defendant indulged in speculative claims and allegations that were completely without basis.25Foot Note 25×PS at paras 26–29.In the defendant’s counterclaim in unlawful means conspiracy, he made serious allegations of fraud against the plaintiff and the first third party as well as against other professionals involved in the Project, such as CCA, F+G and RTO Leong. However, despite the gravity of such claims, he was unable to provide even a shred of evidence to support them (see [78] of the Judgment). This speculative and exaggerated conduct extended also to the defendant’s testimony in court. As I observed at [80] of the Judgment, the defendant had a propensity to make reckless and speculative allegations against the plaintiff, the third parties, and others. One such allegation was the Bribery Allegation, which the defendant continued to maintain despite the absence of any evidence to support it (see [82] of the Judgment). Another spurious allegation made by the defendant was that the Consultants, apart from Web, were also parties to the conspiracy to injure him (see [83] of the Judgment). A non-exhaustive list of the speculative allegations made by the defendant may be found at [85] of the Judgment. 17 Second, the claims made by the defendant against the plaintiff and the first third party were highly unreasonable and exaggerated (see [136]–[148] of the Judgment). The quantum of the defendant’s claims was excessive, the defendant unreasonably refused to mitigate his losses, and he unreasonably insisted on total and absolute rectification of all the alleged defects. This resulted in the claiming of sums that were completely out of proportion to the nature and extent of the alleged defects. I also note that some of these claims were relatively trivial (see [416] of the Judgment).26Foot Note 26×PS at paras 20–21.Although the defendant succeeded in certain aspects of his counterclaim against the plaintiff and was awarded damages in the sum of $47,496.82, this must be seen in the context of his numerous other unmeritorious claims. Out of the $47,496.82 awarded to the defendant, $18,871.60, which relates to the screed, the grouting and the intumescent paint, was conceded by the plaintiff’s witnesses. As regards the remaining sum of $28,625.22, which relates to the missing trellis beam and the utility fees, the plaintiff had agreed in the course of the proceedings to pay such sum to the defendant. 18 Third, in the course of the trial, the defendant raised new evidence and new allegations that had not been set out in his pleadings or in his AEICs. I give two examples of such conduct: (a) At the first and third tranches of the trial, the defendant sought to introduce new evidence in relation to the gas pipe (see [396] of the Judgment).27Foot Note 27×PS at paras 13–15.On both occasions, this was done weeks after that particular tranche of hearings had commenced. Eventually, the evidence proved irrelevant to the defendant’s pleaded case (see [403] of the Judgment) and I dismissed the defendant’s claim in relation to the alleged defects in the gas pipe. (b) In the course of his testimony in court, the defendant made fresh allegations of fraud. He claimed that the conspiracy between the plaintiff and the first third party had started from the tender process of the Project (see [10] of the Judgment). He also made the Bribery Allegation and alleged that all of the Consultants (except Web) had been part of the conspiracy against him (see [82]–[83] of the Judgment).28Foot Note 28×PS at paras 16–18. 19 In light of all of these circumstances, I find that the defendant’s conduct at the trial was deeply unreasonable, such that the imposition of indemnity costs is justified. In many instances, the defendant’s allegations were speculative, devoid of evidential proof and clearly without basis. His conduct in the course of the proceedings was reckless and improper. This ultimately resulted in the incurring of tremendous amounts of time and costs that were completely out of proportion to the claims involved. Given that such unreasonable behaviour occurred mostly during the trial of the Suit, I order that the defendant is to pay to the plaintiff costs on a standard basis from 13 January 2014 to 8 November 2018, with costs payable on an indemnity basis thereafter.",
        "Costs as between the third parties and the defendant": "The offers to settle 20 Two letters containing offers to settle were sent by the third parties to the defendant, as follows: (a) The first was a letter with an open offer to settle dated 22 February 2017 (“the 22 February 2017 Offer”). The third parties offered to settle the Suit on the basis that (i) the third parties would pay the defendant the differential between the solicitor-and-client costs and the party-and-party costs arising out of the Court of Appeal hearing, the sum of which was to be agreed or determined at a taxation hearing; and (ii) parties were to bear their own costs of the Suit.29Foot Note 29×Third Parties’ Bundle of Documents, Tab 1. (b) The second was a Calderbank letter dated 5 July 2019 (“the 5 July 2019 Offer”). Here, the third parties offered to settle the Suit on the basis that (i) the third parties would pay the defendant up to a maximum of $100,000; and (ii) the parties were to bear their own costs of the Suit and HC/S 875/2015 (“Suit 875”). Should the defendant accept this offer after 19 July 2019, the defendant was to bear the third parties’ costs in relation to the Suit and Suit 875 on a standard basis up till 19 July 2019, and on an indemnity basis from 20 July 2019 up till the date of acceptance of the offer.30Foot Note 30×Third Parties’ Bundle of Documents, Tab 3. 21 InSBS Transit Ltd(formerly known as Singapore Bus Services Limited) v Koh Swee Ann[2004] 3 SLR(R) 365 (“SBS Transit”), the Court of Appeal observed at [22] that O 22A r 1 is “precise on the form that an [offer to settle] must take” and “the use of the prescribed form is obligatory”. In this case, the offers to settle were not made in accordance with Form 33 of Appendix A to the ROC (as required under O 22A r 1 of the ROC). Thus, they do not fall within the statutory regime of offers to settle under O 22A of the ROC. However, these offers to settle are nevertheless valid and fulfil the same purpose and intent as those issued under O 22A of the ROC.As Lee Seiu Kin J explained inOng & Ong Pte Ltd v Fairview Developments Pte Ltd[2014] 2 SLR 1285 (“Ong & Ong”) at [31]–[34], the Calderbank letter was developed by the courts as “an extra-statutory inducement for parties to settle through the exercise of its discretionary powers to order costs”. Specifically, the practice of writing Calderbank letters arose from the English Court of Appeal’s decision inCalderbankv Calderbank[1976] Fam 93, where “Cairns LJ suggested that it was possible for a party to make an offer which was without prejudice to the issue of damages but with the right to be used on the question of costs”. This resulted in the development of what is now known as a Calderbank letter – “a letter marked ‘without prejudice save as to costs’ from one party involved in a claim to another setting out the terms of an offer to settle that claim” (seeSBS Transitat [16]). 22 Lee J further explained inOng & Ong(at [35] and [37]) the effect of such Calderbank letters on the court’s discretion to order costs, as follows: 35 However, a Calderbank offer, unlike the statutory regime under O 22 and O 22A of the ROC, does not bind the court to award costs in any particular manner but is one factor that the court will take into consideration in the exercise of its discretion to award costs: seeSBS Transit Ltd v Koh Swee Ann[2004] 3 SLR(R) 365 (‘SBS Transit’) at [21] and [24]. … … 37 As can be seen from the foregoing, the court has broad discretion as to costs in assessing Calderbank offers. Generally, the court’s consideration will bear on reasonableness or otherwise of an offeree’s refusal to accept the Calderbank offer … This will … turn upon the terms of the Calderbank offer and the specific circumstances surrounding it. 23 Thus, although Calderbank letters may not be offers to settle falling within O 22A of the ROC, the court may still take into account such letters in exercising its discretion to award costs. Indeed, the third parties have expressly clarified that they are not relying on O 22A of the ROC, but on the court’s general discretion to award costs.31Foot Note 31×Third Parties’ Reply Costs Submissions (“TPRS”) at para 16.I should add that strictly speaking, the 22 February 2017 Offer is not a Calderbank letter, as it was stated to be an “open letter”.32Foot Note 32×Third Parties’ Bundle of Documents, Tab 1.The third parties themselves have acknowledged this.33Foot Note 33×TPS at para 7.However, there is no reason why the principles applicable to the court’s consideration of Calderbank letters should not apply to other offers to settle that do not fall under O 22A of the ROC. In so far as these offers represent genuine attempts by the parties to settle, the court should give such offers due recognition when it comes to the issue of costs. This is in line with the policy of encouraging parties to settle, thereby saving judicial time and costs. 24 Having regard to these offers to settle, I find that it would be appropriate to order costs on a standard basis from 29 January 2014 (ie, the date of the third party notice to join the third parties to the Suit) to 6 March 2017 (ie, the deadline for the defendant to accept the 22 February 2017 Offer), with costs payable on an indemnity basis thereafter. It is pertinent that both offers to settle were much more favourable to the defendant than the outcome under the Judgment. The defendant’s claims against the third parties failed save for an award of nominal damages of $1,000 (see [749(c)(iii)] of the Judgment). This stands in stark contrast to the sums offered by the third parties in the offers to settle. Given my observation that the defendant’s claims were generally speculative and without basis, it would have been eminently reasonable for him to accept the offers to settle made by the third parties. If he had done so, significant time and costs could have been saved. 25 I shall now address some of the arguments raised by the defendant. The defendant submits that the 22 February 2017 Offer and the 5 July 2019 Offer were not offers to settle under O 22A of the ROC because they had been made on a without admission of liability basis. In support of this argument, the defendant relies onColliers International (Singapore) Pte Ltd vSenkee Logistics Pte Ltd[2007] 2 SLR(R) 230 (“Colliers”), in which Lai Siu Chiu J observed at [119] that “[a]n offer to settle cannot be qualified as a non-admission of liability nor can it be anex gratiaoffer”.34Foot Note 34×DS at paras 23–28. 26 This argument by the defendant misses the point. As I have observed at [21] above, the third party is not seeking indemnity costs on the basis of the statutory regime of offers to settle in O 22A. Instead, it is relying on the court’s general discretion to award costs. In any case, with the utmost respect, I am doubtful as to whether the position inColliersis correct. In this regard, I agree with the following observations by Chua Lee Ming J inGoh Kok Liang v GYP Properties Ltd and another[2020] SGHC 53 at [25] and [26]:35Foot Note 35×TPRS at para 17. 25 No explanation was given inColliersfor the statement set out above. Counsel for GYP and SRE informed me that he did not find any other authority on this point. In my respectful view, there is no reason why an [offer to settle (“OTS”)] cannot be made without an admission of liability. While O 22A r 1 ROC states that an OTS shall be in Form 33, there is nothing in Form 33 that prohibits such a qualification. Neither does such a qualification make the OTS any less of an offer to settle the proceedings. 26 It also bears highlighting that O 22A was introduced to ‘spur the parties to bring litigation to an expeditious end without judgment and thus to save costs and judicial time’ (seeSingapore Airlines Ltd v TanShwu Leng[2001] 3 SLR(R) 439 at [37]). Allowing an OTS to be made on a ‘without admission of liability’ basis would not be inconsistent with the objective of O 22A. Indeed, on the contrary, it might be argued that doing so could be conducive to speedy out-of-court settlements. 27 The defendant also submits that the 22 February 2017 Offer cannot be relied on because it was nullified by the 5 July 2019 Offer. In support of this submission, the defendant relies on para 22A/2/3 ofSingapore Civil Procedure2020 vol I(Chua Lee Ming gen ed) (Sweet & Maxwell, 2020).36Foot Note 36×DS at paras 29–30.Again, this argument misses the point, as the paragraph relied upon was written with reference to the statutory regime of offers to settle under O 22A of the ROC. Therefore, it has little relevance to the present case given that the third party is not relying on O 22A. Furthermore, it is appropriate in this case to have reference to the timeline set out in the 22 February 2017 Offer rather than the 5 July 2019 Offer. The former is a better indication of the time from which costs could have been saved by the defendant’s acceptance of the third parties’ offer to settle. Moreover, if the court were to take into account only the latter offer to settle, this may disincentivise parties from making subsequent offers to settle as that would delay the time from which they could seek indemnity costs. This seems to me inconsistent with the policy of encouraging parties to reach expeditious settlements. 28 Finally, the defendant submits that the court should not make any order for costs as between the first third party and the defendant because the first third party and the defendant have purportedly succeeded against each other and because of the first third party’s “perjury and conduct” at the trial.37Foot Note 37×DS at para 16.I cannot agree with this argument. As I observed at [24] above, the defendant has only been awarded nominal damages of $1,000, in contrast to his claim against the third parties for the sum of $10,853,718.63 (see [3] of the Judgment). Furthermore, the defendant was unsuccessful in defending the first third party’s counterclaim against him in the sum of $50,601.44 (see [749(d)] of the Judgment).38Foot Note 38×TPRS at para 2.Thus, it cannot be said that the defendant has succeeded against the first third party. Furthermore, I disagree with the defendant’s portrayal of the first third party’s conduct. As I observed at [659] and [694] of the Judgment, the first third party was upfront and candid in his testimony at trial.39Foot Note 39×TPRS at para 14.This stands in stark contrast to the defendant’s conduct at the trial (see [16] and [18] above). 29 For these reasons, I find it appropriate to order the defendant to pay to the third parties costs on a standard basis from 29 January 2014 to 6 March 2017, with costs payable on an indemnity basis thereafter. Distinction between the costs of the first third party and the second third party 30 It is trite that the first third party and the second third party are separate legal entities. Furthermore, it is apparent from the Judgment that the defendant erred in taking legal action against the second third party, as the defendant clearly had no legal recourse against the second third party (see [154] and [155] of the Judgment). This would ordinarily mean that the second third party should be entitled to costs from the defendant, possibly even on an indemnity basis. 31 However, it is pertinent that there was, in reality, little distinction made between the first third party and the second third party. The defendant’s claims against the third parties were the same. Furthermore, the third parties were represented by the same set of counsel and adopted virtually the exact same positions throughout the proceedings. Accordingly, there would have been a significant amount of overlap in the work done by the counsel for the third parties and the costs incurred thereupon. Notably, the third parties filed onlyonecosts schedule, with no distinction made between the costs incurred by the first third party and the costs incurred by the second third party. 32 In these circumstances, I find that it would not be appropriate to order two sets of costs in respect of each of the third parties, notwithstanding that they are strictly speaking separate legal entities. Instead, the circumstances justify the order of only one set of costs in respect of all of the work done by the counsel for the third parties. This would obviate the risk of any duplication of costs while ensuring that the third parties receive an adequate and fair sum for the costs expended in these proceedings.40Foot Note 40×DS at para 34. Certificate of Three Counsel 33 Order 59 r 19(1) of the ROC provides as follows: Costs for more than 2 solicitors (O. 59, r. 19) 19.—(1) Subject to paragraph (3), costs for getting up the case by and for attendance in Court of more than 2 solicitors for a party shall not be allowed unless the Court so certifies at the hearing or upon an application made by that party within one month from the date of the judgment or order. 34 A Certificate of Three Counsel should only be granted where the use of more than two solicitors is reasonable, having regard to Appendix 1 to O 59 (seeNg Eng Ghee and others v MamataKapildev Dave and others (Horizon Partners Pte Ltd, intervener) and another appeal[2009] 4 SLR(R) 155 at [36]). In this regard, para 1(2) of Appendix 1 sets out the following factors: (a) the complexity of the item or of the cause or matter in which it arises and the difficulty or novelty of the questions involved; (b) the skill, specialised knowledge and responsibility required of, and the time and labour expended by, the solicitor; (c) the number and importance of the documents (however brief) prepared or perused; (d) the place and circumstances in which the business involved is transacted; (e) the urgency and importance of the cause or matter to the client; and (f) where money or property is involved, its amount or value. 35 Having regard to the above factors and all the circumstances of the case, I find that the circumstances do not warrant the grant of a Certificate of Three Counsel. Although the trial was lengthy and there were voluminous documents, this is often the case in construction-related disputes. While this case did involve complex questions of interpretation involving the SIA Conditions, I do not think that the factual and legal issues at play were so complex as to justify the use of more than two solicitors. Finally, although I do not doubt that the matter was of great personal and professional importance to the third parties, it cannot be said that this went beyond what would usually be the case for parties personally involved in litigation. In these circumstances, I decline to grant a Certificate of Three Counsel as requested by the third parties.",
        "Summary of findings": "36 In summary, my findings are as follows: (a) In light of the defendant’s extremely unreasonable conduct, it would be appropriate and just to order the defendant to pay to the plaintiff costs on a standard basis from 13 January 2014 (ie, the date the writ was filed)up until the date of the commencement of the trial on 8 November 2018, with costs payable on an indemnity basis thereafter. The defendant brought a speculative action that was clearly without basis and his conduct in the course of the proceedings was reckless and improper, ultimately leading to a protracted trial and the disproportionate incurring of time and costs. (b) Having regard to the two letters containing offers to settle made by the third parties to the defendant, it would be appropriate to order the defendant to pay to the third parties costs on a standard basis from 29 January 2014 (ie, the date of the third party notice to join the third parties to the Suit) up until 6 March 2017 (ie, the deadline for the defendant to accept the open offer to settle), with costs payable on an indemnity basis thereafter. Both offers to settle were more favourable to the defendant than the outcome under the Judgment, and it would have been eminently reasonable for him to accept such offers. If he had done so, significant time and costs could have been saved. (c) However, it would not be appropriate to order two sets of costs in respect of each of the third parties, notwithstanding that they are strictly speaking separate legal entities. There was, in reality, little distinction made between the first third party and the second third party in the course of the proceedings. Thus, only one set of costs shall be ordered in respect of all of the work done by the third parties’ counsel. (d) The circumstances do not warrant the grant of a Certificate of Three Counsel. The length of the trial and the amount of documents involved did not exceed what is often the case in construction-related disputes. Neither were the factual and legal issues so profoundly complex as the third parties have suggested. Although the matter may have been of great personal and professional importance to the third party, this did not go beyond what would usually be the case for parties personally involved in litigation.",
        "Conclusion": "37 For all of the above reasons, I order the defendant to pay to the plaintiff costs on a standard basis from 13 January 2014 (ie, the date the writ was filed)up until the date of the commencement of the trial on 8 November 2018, with costs payable on an indemnity basis thereafter. I further order the defendant to pay to the third parties costs on a standard basis from 29 January 2014 (ie, the date of the third party notice to join the third parties to the Suit) up until 6 March 2017 (ie, the deadline for the defendant to accept the open offer to settle), with costs payable on an indemnity basis thereafter. If the parties cannot agree on the quantum of the costs as directed, then costs will have to be taxed. Tan Siong ThyeJudge of the High Court Thulasidas s/o Rengasamy Suppramaniam and Mendel Yap (Ling Das & Partners) for the plaintiff;Chong Chi Chuin Christopher, Josh Samuel Tan Wensu, Chen Zhihui and Calvin Lee (Drew & Napier LLC) for the defendant;Thio Shen Yi SC, Monisha Cheong, Md Noor E Adnaan and Uday Duggal (TSMP Law Corporation) for the third parties.",
        "": ""
    }
}