{
    "case_title": "Chen Mingxing and others  vZhang Jian and others",
    "ncitation": "[2021] SGHC 03",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 In this summons, the plaintiffs sought an interim injunction to restrain the 1st to 5th defendants (the “defendants”) from disposing of any shares in OEL (Holdings) Limited (“OEL”) held in their names and reducing or diluting the share value pending the trial of this action or further order. This included, but was not limited to, voting in favour of any proposed share placement(s) by OEL during any extraordinary or annual general meeting. The plaintiffs claimed that they had paid a sum of $7.7 million to the 1st and 2nd defendants with the intention of investing in OEL’s shares, rather than to benefit the defendants. 2 After hearing the parties’ submissions, I granted the interim injunction as sought by the plaintiffs on 13 November 2020. On 16 and 17 November 2020, the defendants made a request for further arguments to be heard. I partially allowed the defendants’ request and after considering the parties’ submissions, I varied the interim injunction by limiting it to 197,545,000 of the ordinary shares in OEL which were purchased on or around 16 December 2019 by the defendants. The parties were informed of the variation order by way of a registrar’s notice dated 7 December 2020. Pursuant to a further clarificatory request, the terms of the draft Order of Court were clarified by a second registrar’s notice dated 11 December 2020. 3 The defendants have since filed an application for leave to appeal against my decision. I now set out my grounds of decision in full.",
        "Background": "4 The 1st to 3rd plaintiffs are Cambodian citizens, while the 4th and 5th plaintiffs are Chinese citizens. The plaintiffs are private investors and businessmen who work and reside in Cambodia.1Foot Note 1×Statement of Claim (“SOC”) at paras 3–4They were looking for investment opportunities in Singapore sometime around September to October 2019. 5 The 1st defendant is a Chinese citizen and a Singapore permanent resident. He has been the Chairman and Executive Director of OEL since 4 May 2020.2Foot Note 2×Chen Mingxing’s 1st affidavit at para 11, p 69He is the single largest shareholder in OEL, a company listed on the Catalist of the Singapore Exchange. The 2nd defendant is a Chinese citizen residing and working in Singapore. Since 20 January 2020, the 2nd defendant has been appointed the Chief Executive Officer and Executive Director of OEL.3Foot Note 3×Chen Mingxing’s 1st affidavit at p 160The 3rd defendant is a Singapore citizen and a business consultant in OEL. The 1st to 5th defendants are all shareholders in OEL. The 6th defendant, Eminence Investment Pte Ltd (\"EI\"), is a company incorporated in Singapore and is in the business of providing management consultancy and corporate investment services.4Foot Note 4×SOC at paras 5–15; Defence at paras 5–12The 1st defendant is also the Managing Director and Chief Executive Officer of EI, whilst the 2nd defendant was a former Executive Director of EI and the 3rd defendant is the Executive Director and Chief Economist of EI.5Foot Note 5×SOC at para 16; Defence at para 13 6 Ms Wang Jue or “Jess” (“WJ”) is a Singapore citizen and a shareholder and director of Hai Sin International Pte Ltd (“HS International”).6Foot Note 6×Wang Jue’s 2nd affidavit at para 1She was the plaintiffs’ contact person in Singapore and was allegedly responsible for recommending that they should purchase shares in OEL. WJ was an Executive Director of OEL from 27 February 2020 until 26 June 2020.7Foot Note 7×Chen Mingxing’s 1st affidavit at paras 63, 79She continues to be a shareholder in OEL and is also involved in the management of various other business entities. 7 WJ and the defendants entered into a Sales and Purchase Agreement (“SPA”) with one Mr Jeffrey Hing Yih Peir (“Mr Hing”) on or around 16 December 2019 to purchase a total of 197,545,000 ordinary shares in OEL (“OEL Shares”). Under the SPA, Mr Hing disposed of his entire interest in the share capital of OEL, representing 29.56% of the issued and paid up capital of OEL.8Foot Note 8×Chen Mingxing’s 1st affidavit at p 179The proportions in which the OEL Shares were transferred to the 1st to 5th defendants and WJ are set out as follows:9Foot Note 9×SOC at para 45 1st defendant138,331,000 shares2nd defendant13,773,000 shares3rd defendant10,692,000 shares4th defendant10,692,000 shares5th defendant10,692,000 sharesWJ13,365,000 shares 8 The OEL Shares were acquired from Mr Hing at approximately eight times their market price. It was stated in the OEL Board of Directors’ response to queries raised by the Singapore Exchange Securities Trading Limited in relation to the acquisition of the OEL Shares that the price was reached on a “willing buyer willing seller basis”, with the purchasers taking into consideration that Mr Hing would be giving up his position as the controlling shareholder of OEL.10Foot Note 10×Chen Mingxing’s 1st affidavit at p 476 (Query 3) 9 In or around early May 2020, the plaintiffs were allegedly concerned about the 1st and 2nd defendants’ disproportionately high salaries. They also found out that OEL had entered into a loan agreement which was secured by, among other things, a first legal mortgage over OEL’s leasehold property at 8 Aljunied Avenue 3, Singapore 389933 (the “Property”). Thus, the plaintiffs instructed WJ to request the defendants to execute a share pledge in respect of the OEL Shares in favour of the plaintiffs. This request was rejected. The plaintiffs further began to harbour doubts over the 1st defendant’s qualifications and capabilities. The plaintiffs eventually proceeded to issue letters of demand including two on 15 July 2020 and 4 August 2020 seeking,inter alia, the return of the OEL Shares.11Foot Note 11×Chen Mingxing’s 1st affidavit at pp 520–527; 888–897The plaintiffs also claimed for the return of monies totalling $1,656,110.72 comprising $1,190,000 which was allegedly used by the 1st defendant to provide a director’s loan to OEL and the balance surplus monies. On 18 August 2020, a day before the underlying suit (Suit 763 of 2020) was commenced on 19 August 2020, OEL made an announcement that it had entered into an agreement for the placement of ordinary shares in OEL with 16 subscribers on 17 August 2020 (the “August placement”). The 3rd defendant was one of the subscribers.12Foot Note 12×Chen Mingxing’s 1st affidavit at para 107; p 954 10 The focus of the injunction application was on the OEL Shares. The plaintiffs claimed that the defendants held the OEL Shares for them on trust, or that they had been unjustly enriched. In the present summons, the plaintiffs therefore sought an interim injunction to restrain the defendants from disposing of any shares in OEL held in their names and reducing or diluting the share value pending the trial of this action or further order.",
        "The parties’ pleaded cases": "11 WJ played a pivotal role in the arrangements for both the plaintiffs and the defendants. Both the pleaded cases of the plaintiffs and the defendants in the underlying suit relied heavily on what WJ had purportedly informed them of. 12 The plaintiffs pleaded,inter alia, that there was a presumed resulting trust whereby the defendants held the OEL Shares on trust for the plaintiffs, or alternatively that the Shares were held on remedial constructive trust for them. As a further alternative, the plaintiffs pleaded that the defendants had been unjustly enriched with the monies spent on purchasing the OEL Shares. 13 According to the plaintiffs, they had paid $7.7 million pursuant to an agreed investment plan involving,inter alia, the purchase of the OEL Shares for $6,043,889.28 by the defendants and WJ, and the shares would be held on trust for the plaintiffs. The plaintiffs entered into this arrangement because they did not have CDP accounts and would require the OEL Shares to be held on trust for them until they could set up such accounts.13Foot Note 13×SOC at paras 29(a)–29(b)The plaintiffs would pay a further $1,656,110.72 to the 1st and 2nd defendants for use as cashflow for the benefit of the plaintiffs and/or OEL, subject to the plaintiffs’ instructions and consent. As part of the plan, WJ, together with the 1st and 2nd defendants, would be appointed to OEL’s key management positions and the plaintiffs themselves would be employed by OEL and/or its subsidiaries to assist with the development of the businesses of OEL and/or its subsidiaries. WJ had communicated the plan to the plaintiffs in late November 2019 and informed them that this was the 1st and 2nd defendants’ proposal. The plaintiffs agreed to the proposal. 14 The defendants maintained that they had no knowledge of any alleged communications between the plaintiffs and WJ. They contended instead that WJ had coordinated and structured all arrangements with the plaintiffs. The 1st defendant had agreed in October 2019 for WJ to procure investors (ie, the plaintiffs) who were looking to invest for residency in Singapore to invest $7.7 million with her or her companies through “Investment Contracts”. In turn, through her companies or otherwise, WJ would lend the $7.7 million to EI (the “Loan Agreement”). The loan would be repaid after four years and WJ would be paid a commission or return on investment of $1 million. The OEL Shares were procured as investments by the defendants and WJ in their own personal capacities.14Foot Note 14×Defence at para 22(a)In particular, EI had provided loans to the 1st to 3rd defendants for their personal investments, and EI had paid for shares in OEL which were given to the 4th and 5th defendants as well as WJ for their contributions in the acquisition of the OEL Shares.15Foot Note 15×Defence at paras 61–62",
        "Issues before the court": "15 The criteria for the grant of an interlocutory injunction were not in dispute. The key questions were therefore whether there was a serious issue to be tried and whether the balance of convenience favoured the grant of the injunction sought (American Cyanamid Co v Ethicon Ltd[1975] 1 AC 396).",
        "Serious issue to be tried": "",
        "Parties’ submissions": "70 Turning next to whether damages would be an adequate remedy, the plaintiffs submitted that damages would not be an adequate remedy as the plaintiffs had wanted to obtain a controlling stake in OEL. It would be impossible to quantify the monetary loss arising from the plaintiffs’ loss of the controlling stake in OEL, and the dilution of their shareholding would be irreversible.127Foot Note 127×Wu Jiaqi’s 5th affidavit at para 11The plaintiffs also claimed that the defendants were not likely to have sufficient financial means to pay for damages. The plaintiffs submitted that, even on the defendants’ own case, the 1st to 3rd defendants had taken loans from EI and would therefore be liable to EI for substantial sums (excluding interest) of $3,560,031, $235,980 and $183,000 respectively.128Foot Note 128×PWS at para 88; Zhang Jian’s 1st affidavit at paras 69, 74 71 The plaintiffs further submitted that granting the interim injunction would merely preserve the status quo as the defendants would be holding the OEL shares under their own names till the determination of the suit. The defendants would still be able to vote on matters relating to OEL’s key business decisions, apart from matters relating to share placements.129Foot Note 129×PWS at para 94The plaintiffs exhibited a letter issued by OEL to its shareholders dated 31 October 2020, in relation to (a) the proposed disposal of the Property; and (b) the proposed issue and allotment of shares to the 1st and 2nd defendants (the “Proposed Placement”), and the transfer of controlling interest in the company to the 1st defendant as a result of the Proposed Placement.130Foot Note 130×Wu Jiaqi’s 4th affidavit at p 14OEL would receive proceeds from the disposal of the said Property and there was also no reason why OEL had to restrict its fund-raising mechanisms to dilutive share placements.131Foot Note 131×PWS at para 95The defendants also did not purchase the OEL Shares with their own monies. Further, the 1st and 2nd defendants are foreigners who could liquidate the OEL Shares and dissipate their assets before leaving Singapore thereafter. 72 Finally, there was a real risk that the defendants would dissipate the OEL shares. First, the defendants had been unwilling to provide a letter of undertaking that they would not sell and/or dispose the OEL shares. Second, the share placements that the defendants engaged in previously had diluted the plaintiffs’ shareholding in OEL.132Foot Note 132×PWS at para 103The plaintiffs submitted that the OEL Shares represented 26.49% of OEL’s existing and paid-up capital of 745,802,074 shares. The plaintiffs claimed that upon completion of the August placement, their shareholding dropped to approximately 21.15% of the enlarged issued and paid-up capital of OEL.133Foot Note 133×Chen Mingxing’s 1st affidavit at para 109The sale price of $0.0126 per placement share134Foot Note 134×Chen Mingxing’s 1st affidavit at p 954offered and accepted for the August placement was also considerably lower than the price of $0.030595 per share135Foot Note 135×Chen Mingxing’s 1st affidavit at p 476which the plaintiffs had paid for the OEL Shares.136Foot Note 136×Chen Mingxing’s 1st affidavit at para 110Third, the 1st and 2nd defendants were the controlling minds of OEL who were able to singlehandedly cause the dilution of the plaintiffs’ shareholding in OEL and channel $550,000 of the August share placement proceeds137Foot Note 137×Chen Mingxing’s 1st affidavit at p 962towards the 1st defendant in purported repayment of what should have been the plaintiffs’ loan to OEL.138Foot Note 138×PWS at paras 104–105The plaintiffs also pointed out, in response to the defendants’ seventh head of further argument (see [82(g)] below), that the 1st and 2nd defendants’ votes at OEL’s 2020 Annual General Meeting constituted 86.28% of the total votes cast. The 1st and 2nd defendant were therefore largely responsible for passing the resolution giving OEL’s directors the mandate to issue shares.139Foot Note 139×Plaintiffs’ response to request for further arguments dated 19 November 2020 at para 39; Wu Jia Qi’s 4th affidavit at p 68; Wu Jia Qi’s 5th affidavit at para 10An injunction should be granted to prevent the defendants from further dealing with an asset in which the plaintiffs assert a proprietary interest. If the defendants were allowed to sell, dispose of or dissipate the shares, certain causes of action brought by the plaintiffs would be rendered nugatory.140Foot Note 140×PWS at para 102The plaintiffs submitted that they remained, collectively, the largest single shareholder, but this position could be jeopardised by further dilution of their shares.141Foot Note 141×Chen Mingxing’s 3rd affidavit at para 21 73 In contrast, the defendants submitted that damages would be an adequate remedy for the plaintiffs, as there was no supporting evidence that the plaintiffs had wanted a controlling stake in OEL to begin with.142Foot Note 142×DWS at para 114The plaintiffs, on their own case, were looking for investment opportunities which could be valued in monetary terms.143Foot Note 143×DWS at para 117In any event, OEL shares are publicly traded on the open market, and their values would fluctuate in accordance with market forces. Therefore, having a controlling stake would not enable the plaintiffs to control the value of OEL Shares.144Foot Note 144×DWS at para 119The defendants also averred that the issuance of placement shares would not lower OEL’s share value; even if it did, the plaintiffs’ losses could be quantified.145Foot Note 145×DWS at para 122Further, the plaintiffs had not proven that the defendants would be unable to pay damages.146Foot Note 146×DWS at para 127 74 The defendants claimed that damages would not be an adequate remedy for them as they would be deprived of their rights to vote. As the 1st and 2nd defendants held management positions in OEL, the grant of an interim injunction would negatively impact OEL’s business.147Foot Note 147×DWS at para 131Although the plaintiffs had stated that they were prepared to give an undertaking as to damages, such an undertaking was of little value as the plaintiffs were foreigners.",
        "My decision": "75 The 1st to 5th defendants have not denied, and indeed theycannotdeny, that the OEL Shares were not purchased with their own money. I agreed with the plaintiffs that it is uncertain whether the defendants would have sufficient financial means to pay for damages. The evidence suggested that the plaintiffs’ payments were meant as investments through the acquisition of OEL shares (as structured by WJ) and not necessarily because they had wanted all along to secure a controlling stake in OEL. However, the plaintiffs had pleaded that the OEL shares were being held by the defendants on trust for them. If the injunction was not granted and the defendants were at liberty to dispose of the shares, it would render this cause of action nugatory and cause irreversible damage to the plaintiffs. 76 For the same reason, the defendants’ shareholding should not be diluted by share placements or reduced by sale to third parties pending the resolution of the plaintiffs’ claim. The defendants could be adequately compensated in damages and the plaintiffs were ready to give an undertaking as to damages. Other than the fact that the plaintiffs were resident outside of jurisdiction, the defendants had not pointed to any cogent reason why the plaintiffs would not be in a financial position to compensate them if required. On the other hand, as the plaintiffs rightly pointed out, the 1st and 2nd defendants are Chinese citizens who could conceivably leave Singapore any time after liquidating the OEL Shares and dissipating their assets to defeat any potential judgment against them. In any event, if I have erred in my determination that the plaintiffs would not be adequately compensated by damages, the balance of convenience weighed in favour of granting the plaintiffs an interim injunction. 77 I accepted the plaintiffs’ submission that there was evidence of a real risk of dissipation of the shares unless the injunction was granted to preserve the status quo ante. Two share placements had taken place in February and August 2020, and another further placement had been proposed in OEL’s October announcement. The OEL Shares had already been subjected to dilution and possible reduction in value; there was thus evidence of dissipation through fragmentation or dispersal of the shares through share placements. The sale price of the shares in the August placement was significantly lower than what was paid to Mr Hing for the OEL Shares, and there was evidence that the 1st and 2nd defendants were able to substantially influence the passing of resolutions (including for the issuance of shares) despite there being other shareholders in OEL. Share placements were also not the only fundraising options available to OEL as I further explain at [97] and [98] below. Moreover, the 1st to 5th defendants had refused to provide any undertaking not to sell and/or dispose of the OEL Shares, or even to confirm whether any of the shares had been sold, despite the objective evidence which the plaintiffs adduced of high trading volumes in the shares in OEL in July and August 2020. 78 The evidence thus far indicated that the status quo ante should be preserved to prevent the defendants from further diluting the value of the OEL shares and/or from reneging on their implied undertaking to return the monies to the plaintiffs. There was a real risk of both events occurring. This was evident from the defendants’ steadfast denial of the plaintiffs’ involvement as financiers or, in a loose sense, “investors” in the acquisition of the OEL shares from Mr Hing, facilitating the takeover of Mr Hing’s majority stake in OEL. 79 There wasprima facieevidence pointing strongly to the defendants being enabled to acquire the OEL shares only as a result of the plaintiffs’ injection of funds. The defendants claimed in the face of this evidence not to be aware of how the plaintiffs were involved, on the main premise that they did not know one another. They pointed instead to the funds ostensibly flowing from WJ or her companies. Viewing the totality of the evidence in perspective, the defendants’ denial appeared highly suspect. 80 Accordingly, I granted an injunction to restrain the disposal of the OEL shares held by the defendants and reduction or dilution of the share value pending the trial of this action or further order, as sought by the plaintiffs.",
        "Adequacy of damages and balance of convenience": "",
        "Request for further arguments": "81 Further arguments were subsequently requested by the defendants. I acceded partially to this request and considered further arguments in relation to the scope of the interim injunction which was ordered on 13 November 2020.",
        "The seven heads of further arguments": "82 The defendants sought to canvass seven heads of further arguments. These were:148Foot Note 148×Defendants’ Requests for Further Arguments (“RFA”) by letters dated 16 and 17 November 2020 (a) First, that the court had misapprehended the facts in finding that there wasprima facieevidence that $7.7 million was paid by the plaintiffs and received by EI. (b) Second, that the plaintiffs did not just park the sum of $7.7 million with WJ and/or her companies so that the latter could loan the sum to EI, as the plaintiffs were engaged in a scheme to buy employment passes so as to obtain permanent residency in Singapore. (c) Third, that the court had acknowledged that the plaintiffs had not explained why WJ did not inform them that their funds were used for the immediate purchase of the OEL Shares, and that it was therefore not possible for the court to draw an inference that the plaintiffs were involved as investors to acquire the OEL Shares (“the third argument”). (d) Fourth, that the plaintiffs had not adduced any evidence which indicated that the defendants intended to sell or otherwise dispose of the OEL Shares. (e) Fifth, the balance of convenience lay in favour of not granting the injunction. (f) Sixth, order 1(a) of the original interim injunction order was too wide as it covered any OEL shares held by the defendants and ought to be limited only to the 197,545,000 ordinary shares in OEL purchased from Mr Hing (“the sixth argument”). (g) Seventh, order 1(b) should be set aside or varied as the scope of the injunction was also too wide and would have a crippling effect on OEL (“the seventh argument”). 83 In the defendants’ letter of 17 November 2020, they canvassed additional submissions in respect of the sixth and seventh arguments and reiterated the contention that the plaintiffs could not be said to be investors. I allowed the request for further arguments only for the sixth and seventh arguments, relating to the scope of the injunction. I did not have the benefit of hearing full arguments on these areas from the parties during the hearing on 11 November 2020. As for the remaining heads and the additional argument in the letter dated 17 November, I saw no reason to accede to the request. Except for the third argument, substantially the same points had already been canvassed at the hearing before me on 11 November 2020. 84 The third argument was a responsive argument to a comment made in my oral remarks that WJ appeared not to have told the plaintiffs about the intended purchase of the OEL Sharesfrom Mr Hingfrom the outset. I made this comment because the plaintiffs’ pleaded case omitted any specific reference to purchasing the sharesfrom Mr Hing. I did note that in paragraph 31 of the 1st plaintiff’s first affidavit, he stated that he was informed about the purchasefrom Mr Hingby WJ, and WJ had affirmed this in her affidavit. However, this fact was not pleaded from the beginning and it would appear that there was presently no contemporaneous independent evidence to support the 1st plaintiff’s claim. This tied in to my observation (see [75] above) that it was not necessarily clear that the plaintiffs had intended to obtain a controlling stake in OEL by purchasing Mr Hing’s shares in OEL. 85 In putting forth their further arguments under the third argument, the defendants had missed out the reference to Mr Hing which I had made in my oral remarks, and hence misunderstood the context of my comment. The arguments the defendants sought to address did not affect how I would have decided in any case. 86 In relation to the sixth argument, order 1(a) provided that the defendants would not sell or otherwise dispose of any shares in OEL held in their names pending trial or further order. The defendants submitted that the order should be limited only to the 197,545,000 ordinary shares in OEL purchased from Mr Hing, as the plaintiffs’ claim in resulting trust was limited only to those shares.149Foot Note 149×RFA dated 16 November 2020 at para 28In addition, the injunction should not extend to, or cover, shares acquired from open market transactions.150Foot Note 150×RFA dated 17 November 2020 at para 14 87 In response, the plaintiffs submitted that order 1(a) was reasonable and in line with the plaintiffs’ prayers for an order for an account of trust properties and a tracing order. Further, the defendants’ request was telling of their intention to sell and/or dispose of their shares in OEL. If not for the plaintiffs’ monies, the defendants would not have been able to purchase the OEL Shares and the 1st and 2nd defendants would not have been appointed to their positions in OEL and therefore able to propose share placements.151Foot Note 151×Plaintiffs’ response to RFA dated 19 November 2020 (“Plaintiffs’ response to RFA”) at paras 31, 33The defendants in turn argued that the plaintiffs had conflated their claim based on trust with their prayer for accounts and a tracing order.152Foot Note 152×Reply to plaintiffs’ response to RFA dated 24 November 2020 (“Reply to plaintiffs’ response to RFA”) at para 8 88 In relation to the seventh argument, order 1(b) provided that the defendants would not reduce the value of or dilute the percentage of the rights attached to any shares in OEL held in their names pending trial or further order. The defendants submitted that the scope of the injunction was too wide.153Foot Note 153×RFA dated 16 November 2020 at para 30The injunction would cripple OEL’s ability to raise public funds, and OEL would be deprived of its right to utilise its general mandate to issue shares. OEL’s access to funds would therefore be limited to loans at a crucial time when injection of funds was pertinent to facilitate OEL’s expansion plans. This would be prejudicial to the rights and/or interests of OEL and its near to 4,000 shareholders.154Foot Note 154×RFA dated 17 November 2020 at para 16 89 In response, the plaintiffs submitted that OEL had already raised funds through the disposal of the Property, as the relevant resolutions for the sale had been successfully passed without the votes of the 1st and 2nd defendants. Since it was the defendants’ position that the 1st and 2nd defendants did not control OEL’s Board of Directors, the interim injunction would not impact the running of OEL’s day-to-day operations. It was also not logical that the only way OEL could raise funds was through share placements.155Foot Note 155×Plaintiffs’ response to RFA at paras 37, 38 90 The defendants in turn argued that the disposal of the Property was the last fund-raising avenue for OEL and that all of OEL’s business decisions would be seen as linked to the 1st and/or 2nd defendants. The plaintiffs had also purportedly made baseless allegations to a “reputable local bank” that OEL had breached certain rules in obtaining a facility loan, causing the bank’s in-principle approval of the loan to be scuttled. As such, OEL was also unable to raise funds through secured loans, which led to it having no choice but to undertake the August placement at a discount to raise urgently needed funds for working capital and to fund its expansion into new business areas.156Foot Note 156×Reply to plaintiffs’ response to RFA at paras 11, 19",
        "My decision on the sixth and seventh arguments": "91 It would appear to be incontrovertible that the defendants would not have been in any position to acquire the shares from Mr Hing without the plaintiffs’ funds of $7.7 million. From the available evidence, the defendants could not credibly deny knowledge of the plaintiffs’ involvement as “investors” for the purpose of acquiring the OEL shares. The subsequent private share placements in February and August 2020 which resulted in further allotment of shares and the defendants’ aggregate shareholding exceeding the OEL shares purchased from Mr Hing could not be viewed in isolation from their December 2019 acquisition. 92 However, the plaintiffs’ primary objective was to obtain a declaration that the 1st to 5th defendants hold the OEL shares on trust for them, and an order that the OEL Shares be transferred to the plaintiffs or their nominees. On their own pleaded case, the plaintiffs essentially sought,inter alia, either a transfer or return of the OEL Shares which were acquired or a return of their funds (the bulk of which were used for the purchase of the shares) in the alternative. The plaintiffs did not contend that the defendants were trustees in relation to thefundsused for the purchase of the shares, but only in relation to theshares, the value of which may fluctuate according to market conditions.Prima facie, it was thus logical that the only shares which should be covered by the injunction were the OEL Shares which the plaintiffs claimed to be the subject of a potential resulting trust or remedial constructive trust. 93 It was also logical that the risk of the OEL shares being devalued would be higher if the OEL Shares were progressively diluted through share placements or issues. The plaintiffs pointed to indications that the share value had in fact already started to decline as OEL underwent two rounds of private placements in six months which increased the aggregate shareholdings. It was noteworthy however that in the February 2020 round of placements, the plaintiffs raised no objections to the share placements as the present dispute had not surfaced then. The plaintiffs would therefore reasonably have expected that private share placements and allotments which might result in consequential dilution of their shareholding and which were likely to affect share value could take place. Equally, the plaintiffs ought reasonably to have foreseen that additional shares could be acquired by the defendants from the open market. It did not follow from the plaintiffs’ submissions based on account of trust properties and tracing thatallthe shares presently held by the defendants had to be covered by the injunction. 94 The defendants argued that the plaintiffs had conflated their causes of action in trust with their prayer for accounts and tracing but even if this were objectionable, it overlooked the plaintiffs’ alternative pleaded case of unjust enrichment. If the plaintiffs succeed ultimately under this alternative cause of action, it would be open to them to seek a tracing order pertaining to the funds which the defendants had allegedly been unjustly enriched with. 95 It was not clear whether the defendants currently hold any shares that have been acquired from the open market or from off market transactions with third parties. Equally it was not clear whether they had any intention or capacity to acquire additional shares by such means. It would appear that any additional shares they now hold over and above the OEL shares had arisen mainly if not entirely from the February and August 2020 share placements. It was not patently obvious at this point that these additional shares must fall outside the scope of any tracing order or account of trust properties. Nevertheless, I was of the view that limiting the scope of order 1(a) of the injunction to the OEL shares was more consistent with the plaintiffs’ pleaded case and the circumstances at hand. 96 The seventh argument regarding order 1(b) had in fact been addressed at the hearing on 11 November 2020. The defendants’ submissions at para 135 and the 1st defendant’s 1st affidavit at paras 148 to 154 made the point that the defendants would not be able to raise funds if an injunction were to be granted, and that their business expansion plans would be impacted. However even if “any shares in OEL” were amended to “197,545,000 shares”, on the defendants’ own case, “any issuance of shares to parties other than the defendants will result in a dilution of the defendants’ shareholding interests in OEL”. If the defendants were allowed to freely complete further share placements, thereby diluting the value of the shares and/or the plaintiffs’ purported shareholding in OEL, the effect of the injunction would be very much watered down. 97 In my assessment, the seventh argument was not sustainable since the defendants’ core argument was that the injunction would affect OEL’s ability to raise further funds. As the plaintiffs submitted, share placements or issues were not the only fundraising options. OEL had already gone ahead to sell the Property which was valued at approximately $8.3m. OEL appeared to have made plans to diversify and aggressively expand its business, but this would rely on securing additional funding. Given the present litigation and the questions and doubts already raised, it may arguably be prejudicial as well to OEL’s shareholders for these expansion plans to proceed wholly unchecked. 98 OEL’s alleged difficulty in obtaining secured loans reflected its own financial capacity and business fundamentals. I noted with some irony that the defendants had deemed it necessary to highlight in their further arguments157Foot Note 157×See Reply to plaintiffs’ response to RFA at para 19their belief that a “reputable local bank” was somehow misled by the Ps’ allegedly “baseless, unsubstantiated and erroneous allegations” into withdrawing its in-principle approval for a loan of $4m to OEL. With respect, the more reasonable and plausible inference to my mind is that the said (unnamed) bank, in keeping with its reputation, must have done the necessary due diligence and formed its own independent and objective risk assessment before concluding that the loan was not viable. 99 Having considered the further arguments, order 1(a) of the interim injunction was varied by replacing the words “any shares” with “the 197,545,000 ordinary shares” in OEL. It followed that a similar variation ought to be made in order 1(b) and it was so ordered accordingly. 100 In the defendants’ reply to the plaintiffs’ submissions in respect of the sixth and seventh arguments, they also sought to adduce a further affidavit (the 1st defendant’s 3rd affidavit)158Foot Note 158×Annex F to Reply to plaintiffs’ response to RFAwhich exhibited a Shareholders’ Agreement (“SHA”) made between OEL and the defendants, WJ, one Wong Chau Farn (“Wong”), one Hu Ling Yan (“Hu”) and one Cai Xiao Yue (“Cai”). The plaintiffs objected to this further affidavit. 101 This further affidavit was technically inadmissible as it was filed without leave of court. As such, I disregarded its contents. Even if I did have to consider its contents, I would have attached minimal weight to them. In particular, the SHA was not signed by Wong and it was therefore unclear if the SHA was properly executed and had taken effect to begin with. Further, the SHA states that the shareholders “desire[d] to enter into [the SHA] and that the execution and delivery of [the SHA was] a condition to the Closing under the Sales and Purchase Agreement to be entered into”. However, as stated earlier, the SPA entered into for the acquisition of the OEL Shares was between the defendants, WJ and Mr Hing. It was therefore also unclear how Wong, Hu and Cai had come into the picture. 102 The adduction of the SHA did not change the present state of the evidence. While Clause 2 of the SHA states that “[n]o holder of Shares shall grant any proxy or become party to any voting trust or other agreement that is inconsistent with, conflicts with or violates any provision of this Agreement”, which appears to be inconsistent with the OEL Shares being held on trust for the plaintiffs, there is no evidence that the plaintiffs had known of the existence of this SHA even if it had been properly executed. I had found earlier that there were gaps in both parties’ cases but that there was sufficient evidence put forth by the plaintiffs such that their claims were not frivolous or vexatious.",
        "Conclusion": "103 For the reasons I have set out above, the injunction as sought by the plaintiffs was granted with a limitation as to its scope to 197,545,000 of the ordinary shares in OEL which were purchased from Mr Hing on or around 16 December 2019. 104 The plaintiffs’ submission on costs included the costs for Summons 4793 of 2020, for which costs was reserved.159Foot Note 159×Certified Transcript (13 November 2020) at p 9I noted that the hearing before me had taken slightly over three and a half hours. Considering the submissions on costs by both parties as well as the costs guidelines set out in Appendix G of the Supreme Court Practice Directions, I ordered costs to the plaintiffs to be fixed at $10,000, with reasonable disbursements to be agreed.160Foot Note 160×Certified Transcript (13 November 2020) at p 10 105 I made no order as to the costs of the further arguments, but invited parties to make submissions on costs if any. Parties did not object to there being no order as to costs by the stipulated deadline. See Kee OonJudge Quek Wen Jiang, Gerard, Ramachandran Doraisamy Raghunath, Feng Zhuo and Tey Jijie, Louis (PD Legal LLC) for the plaintiffs; Heng Gwee Nam Henry, Loh Hui-Qi Vicki, Charmaine Elizabeth Ong Wan Qi and Charanpreet Kaur (Legal Solutions LLC) for the defendants.",
        "": ""
    }
}