{
    "case_title": "Gui Chien Cheong Martin vFacilit8te Pte Ltd and another",
    "ncitation": "[2021] SGHC 105",
    "coram": "Philip Jeyaretnam JC",
    "sections": {
        "Introduction": "1 Start-up companies typically undergo several rounds of fund raising. New investors may insist that their funds not be deployed to pay off existing loans. One way to avoid new funds being used to repay prior loans, or at least those taken from company insiders such as directors or shareholders, is to require those loans to be first converted into equity in the start-up. 2 When someone invests in a company in return for a minority stake on the basis that prior loans from directors and shareholders will first be converted into equity, does the sole director’s subsequent failure to carry out the expected conversion amount to oppressive conduct, disregard of the investor’s interests, unfair discrimination or prejudice so as to found relief under s 216 of the Companies Act (Cap 50, 2006 Rev Ed) (the “CA”)? What if the sole director carries out the expected conversion, but sidesteps it by subsequently causing the company to disburse funds to him anyway so that he can pay off a loan which he took in order to lend to the start-up in the first place? 3 If, regardless of this conduct on the part of the sole director, the company would for other and independent reasons have failed as a business and ceased to be a going concern such that prior to the commencement of proceedings the minority stake would in any event have been worthless, should relief still be granted?",
        "Facts": "4 The first defendant, Facilit8te Pte Ltd (“F8”), described itself as a “one-stop service provider that organizes and manages services (from vetted 3rd party vendors) to users’ homes”.1Foot Note 1×Agreed Bundle of Documents (“AB”) 810.The plaintiff invested $203,799.00 in F8 under a subscription agreement dated 31 July 2017 (the “SA”) in return for 5% of its equity.2Foot Note 2×AB 237–240.The exact number of shares was to be calculated on the increased capital base following the conversion of all existing director and shareholder loans into equity.3Foot Note 3×Transcript, 17 February 2021, at p 35 lines 22–29.This conversion was requested by the plaintiff so that his investment would fund operations rather than pay down existing debt.4Foot Note 4×Transcript, 16 February 2021, at p 38 line 18 to p 39 line 4.The second defendant, who was a co-founder, a major shareholder and the sole director of F8, agreed to this.5Foot Note 5×Transcript, 16 February 2021, at p 80 line 8–13. 5 The plaintiff’s original complaint was that the second defendant did not then carry out his side of the bargain.6Foot Note 6×Reply at para 8; Transcript, 18 February 2021, at p 35 lines 5–23.Prior to the plaintiff’s involvement with F8, the second defendant had, in order to inject capital into F8, personally borrowed $50,000 from a company called First Media Pte Ltd (“First Media”) and then lent that same sum to F8.7Foot Note 7×Bundle of Affidavits of Evidence-in-Chief Vol 1 (“1 BAEIC”) 66 at paras 21–22.However, according to the plaintiff, the second defendant had failed to convert this loan to F8 into equity. 6 The second defendant did not deny that he did not convert the loan. Instead he mounted the defence that his loan to F8 was not relevant to the plaintiff’s investment because it had been made prior to that investment.8Foot Note 8×Defence at paras 8 and 10; 1 BAEIC 68 at para 27.Even in his evidence at trial, the second defendant maintained that there had not been conversion of that loan into equity.9Foot Note 9×Transcript, 16 February 2021, at p 80 lines 1–18. 7 However, when the second defendant’s witnesses followed him onto the stand, a different story emerged. The company’s external accountant and company secretary, Jovi Sen Joon (“Sen”), and the co-founder, Daryl Lim Meng Siang (“Lim”), both testified that the second defendant’s loan to F8 had been converted into equity, together with all other existing director and shareholder loans.10Foot Note 10×Transcript, 17 February 2021, at p 6 line 7 to p 8 line 14 and p 27 lines 19–23.While the requisite shareholders’ resolution was not disclosed or adduced into evidence, the conversion is referred to in the general ledger exhibited in Lim’s affidavit as having taken place on 31 August 2017.11Foot Note 11×Bundle of Affidavits of Evidence-in-Chief Vol 2 (“2 BAEIC”) 927.I accept the evidence of Sen and Lim in this regard. The second defendant had indeed held up his end of the bargain by converting his loan to F8 into equity. The curiosity that the second defendant never accepted this apparently favourable fact is explained by a further point. 8 Regardless of the conversion of his loan to F8 into equity, he still owed First Media $50,000. Though this was a personal debt, the second defendant used F8’s funds towards paying it off. First, unknown to the plaintiff, on 10 August 2017 F8 paid $13,000 to First Media in part-payment of First Media’s loan to the second defendant.12Foot Note 12×AB 260.Second, the second defendant, again without the knowledge of the plaintiff, increased his salary and that of Lim.13Foot Note 13×1 BAEIC 67 at para 24.The only reason for the increase was to use these additional monies to pay off his loan from First Media.14Foot Note 14×1 BAEIC 67 at para 24.The cumulative total of these increases for the period that they were paid (September to December 2017) amounted to $35,000.15Foot Note 15×1 BAEIC 67 at para 24. 9 The company’s business did not take off. Suspecting mismanagement, the plaintiff asked to inspect the company’s accounts in August 2018. Following his inspection, he raised with the second defendant the issue of the increased salaries. The second defendant agreed that the amount paid out in the guise of increased salaries was to be reflected instead as a loan to him. He promised to repay this loan to F8. 10 An important question of fact arises at this juncture. That question is how much of this loan was then repaid by him. The documentary evidence at trial showed that to date he has repaid only some $13,000 of the $35,000 that was paid to him by way of the increased salaries.16Foot Note 16×AB 694; Transcript, 16 February 2021, at p 73 line 1 to p 74 line 30.The second defendant however submitted that I should only find that it is not proved one way or the other whether he repaid the balance $22,000.17Foot Note 17×Second defendant’s closing submissions (“DCS”) at para 62.I do not accept this submission. The second defendant would know how much he had repaid and would have his own documentary record of such payments. The second defendant contends that his failure to produce such documents was contributed to by the plaintiff’s own failure to plead that the second defendant had not repaid the increased salaries.18Foot Note 18×DCS at para 62.However, as I explain later at [20] to [23], the question of how much the second defendant had repaid of the monies he had caused F8 to disburse had been put in issue. The second defendant is the person who knows best how much he in fact repaid, and his own bank and other personal records would be the best evidence of what he had repaid. His evidence was entirely vague and unsatisfactory on this point, and I do not believe his unsupported assertions that he had repaid more than what the documents placed before the court showed. I thus find on a balance of probabilities that the second defendant only repaid $13,000 of the $35,000. Further, I also find that none of the $13,000 paid directly to First Media by F8 on 10 August 2017 has been repaid to F8. 11 The company ceased operations around the end of 2018.19Foot Note 19×Transcript, 16 February 2021, p 94 lines 1–14.It had run out of funds to carry on business.20Foot Note 20×Transcript, 16 February 2021, p 94 lines 26–27.Hardly any evidence was adduced on the reasons for this business failure. The plaintiff did not attempt to prove that the failure was itself due to mismanagement. It must therefore be neutrally ascribed to F8’s services not achieving sufficient take up in the market.",
        "The plaintiff’s claim for rescission of the SA": "12 Before further examining the plaintiff’s primary claim for relief under s 216 of the CA, it is convenient at this juncture to consider his alternative claim for rescission of the SA for material breach. This is both because it can be simply disposed of, and because the plaintiff had entered a default judgment that it belatedly sought to unwind. The specific allegation is that under cl 1 of the SA,21Foot Note 21×AB 237.the parties agreed: ... [T]o enter into a shareholder agreement (the ‘Future Agreements’) within 30 days of this agreement to detail more specifically the rights and obligations of each parties. If for any reasons, the parties do not sign the Future Agreements within 30 days, this agreement shall be void and the first payment shall be repaid interest free within 14 days. 13 The second defendant was not a party to the SA, which was between the plaintiff and F8 only.22Foot Note 22×AB 237.As for F8, it appears to have been a party to a shareholders’ agreement that was already in existence, and which had been entered into on 9 May 2016 (the “SHA”). No executed copy of the SHA was adduced in evidence. All that was adduced was an unsigned version that was attached as Schedule 3 to a Convertible Loan Agreement also dated 9 May 2016.23Foot Note 23×AB 56–75.The SA referred to the SHA in cl 3, providing that the plaintiff “agrees to the current Shareholder Agreement dated 9 May 2016 or a superseded agreement which may be agreed by all parties”.24Foot Note 24×AB 238.The word “superseded” was presumably intended to convey a different meaning of “superseding”. 14 The alternative claim was brought against F8 as the counterparty issuing the shares to which the plaintiff was to subscribe. F8 did not enter appearance and was not represented in these proceedings. Default judgment was entered on this claim on 12 July 2019. However, on the application of the plaintiff himself, I set aside this default judgment on the first day of trial. This default judgment was plainly irregular, given that the relief of rescission is not a relief that can be ordered in default pursuant to O 13 rr 1 to 4 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed). The plaintiff presumably had also appreciated that if rescission of the SA were indeed granted, he would be deprived of standing to seek relief under s 216 of the CA, as he would be deemed never to have been a shareholder. Moreover, it would be F8 which would be obliged to repay his subscription amount, and F8 had no funds or resources to do so. Nonetheless, the plaintiff maintained the claim for rescission in the alternative, if he failed in his primary claim for relief under s 216 of the CA. 15 The alternative claim of rescission of the SA must fail. While it is obscurely phrased,25Foot Note 25×Statement of Claim (“SOC”) at prayer 4.in substance the claim asserts that cl 1 of the SA operates as a condition subsequent, failure of which rescinds the agreement. However, the plaintiff did nothing when no new or, adopting the parlance of the SA, future shareholder’s agreement that included him was agreed and executed within 30 days, and proceeded nonetheless to make the second and third instalments of his investment.26Foot Note 26×1 BAEIC 63 at para 14.Subsequently, he asserted his rights as a shareholder, including by inspecting F8’s books and participating in a general meeting by appending his digital signature.27Foot Note 27×Transcript, 16 February 2021, p 18 lines 7–16; AB 471, 549.The simple reason why he did nothing, and made no complaint about the absence of any new or future shareholders’ agreement, came out during his evidence: he relied on cl 3 of the SA as already making him a party to the existing SHA.28Foot Note 28×Transcript, 16 February 2021, p 22 line 25 to p 23 line 8.Thus, to the extent he considered the question, he must have taken the position that the rights and obligations of the parties were already sufficiently detailed in the SHA and so cl 1 of the SA had been fulfilled in substance. Indeed, the plaintiff relied on the SHA for his claim for relief under s 216 of the CA.29Foot Note 29×Plaintiff’s closing submissions (“PCS”) at paras 54–57.Clause 5.11 of the SHA provided that unanimous approval of shareholders was required for “[p]ayment of or increase in salaries and bonuses of officers and Directors of [F8]”.30Foot Note 30×AB 61.The plaintiff relied on this provision as establishing his legitimate expectation that his approval would be sought for any increase in either the second defendant’s or Lim’s salaries.31Foot Note 31×PCS at para 57; Transcript, 16 February 2021, p 21 lines 7–18. 16 Thus, the plaintiff treated the condition subsequent as having been performed by his becoming a party to the SHA. There was no formal accession to that earlier agreement, but everyone behaved as if he had become a party to it, establishing an estoppel by convention that this was validly effected by virtue of entering into cl 3 of the SA.32Foot Note 32×Transcript, 18 February 2021, p 12 line 22 to p 13 line 5.",
        "The plaintiff’s claim under s 216 of the Companies Act": "17 The plaintiff’s original case was that the second defendant’s failure to convert the $50,000 loan made by him to F8 into equity breached a critical element of the basis on which he invested, and that the inflation of the second defendant’s and Lim’s salaries to pay off that loan was a misuse of F8’s funds that unfairly prejudiced his interests. He also averred that this resulted in the irretrievable breakdown of mutual trust, goodwill and confidence, and that he had lost “all trust and confidence in the 2nd Defendant’s willingness to conduct the affairs of [F8]”.33Foot Note 33×SOC at paras 14(e) and (f).Presumably, by “willingness”, the plaintiff meant “ability”. 18 After the second defendant’s witnesses contradicted him by saying that the loan had in fact been converted into equity, the plaintiff, while not accepting that this in fact happened, added the alternative contention that even if the loan had been duly converted, the second defendant had still misused the funds of F8, by causing it first to pay $13,000 to First Media and then to inflate his and Lim’s salaries by $35,000.34Foot Note 34×Transcript, 18 February 2021, at p 48 line 28 to p49 line 3, p 66 lines 11–20; PCS at paras 35–43.He relied on this conduct as founding his claim for relief, being itself unfairly prejudicial to him. 19 Between the two claims raised by the plaintiff under s 216 of the CA, it is not necessary to consider the original claim based on breach of a legitimate expectation that all loans be converted into equity. The evidence at trial showed that these loans were in fact so converted (see [5]–[7] above). It is only the alternative claim, responding to the turn in the evidence at trial, that remains.",
        "The second defendant’s procedural objection": "20 Before I proceed to consider the substantive defences raised by the second defendant in relation to the alternative claim, I shall deal with his procedural objection. 21 One aspect of the objection was the contention that it was not open to the plaintiff to argue his case on this alternative footing, given that his pleaded complaint concerned the non-compliance with the condition of conversion of debt into equity.35Foot Note 35×DCS at paras 56 and 62.This suggestion is not well-made, given that the second defendant initially accepted that the loan was not converted.36Foot Note 36×Transcript, 16 February 2021, at p 80 lines 1–18.It was the second defendant’s witnesses whose testimony changed the picture. The plaintiff was merely reacting to that, with the riposte that the conversion of the loan into equity did not eliminate the unfairly prejudicial conduct, because the second defendant then used F8’s funds for his own ends, namely to repay his personal loan from First Media. 22 The second defendant also argues that the plaintiff failed to plead that the direct payment to First Media and the inflated salaries had not been repaid.37Foot Note 37×DCS at paras 56 and 62. 23 This misses the point. It was not necessary for the plaintiff to plead that. The crux of the plaintiff’s argument is not that the second defendant did not carry through his promise, made upon being found out, to repay the monies; it is that the second defendant should never have inflated his and Lim’s salaries in the first place.38Foot Note 38×SOC at paras 10–11.It is true that the plaintiff did not complain in his pleadings about the direct payment of $13,000 from F8 to First Media, using his invested funds. But this goes to the extent of the second defendant’s misuse of the plaintiff’s funds. This misuse was plainly in issue in this matter. When the financial amounts misused prove to be larger than pleaded, this only fortifies the case for unfairly prejudicial conduct. 24 This is separate from the question whether there was an accord resolving the unfairly prejudicial conduct, which if performed would bring it to an end. The second defendant did not plead such an accord in his defence, but he did raise it in his opening statement39Foot Note 39×Second defendant’s opening statement (“DOS”) at paras 15–16.and in his affidavit of evidence-in-chief.40Foot Note 40×1 BAEIC 71–72 at paras 36–40.I consider this question below, at [37] to [38].",
        "The second defendant’s substantive contentions": "25 The second defendant’s substantive defences to this alternative claim can be grouped into two sets. The first set argues in essence that the second defendant’s conduct was not unfairly prejudicial to the plaintiff. The second set argues that even if such conduct was unfairly prejudicial to the plaintiff, this prejudice had been eliminated by events following the plaintiff’s discovery of this conduct. 26 The first set of contentions, drawing on the opening, the brief oral closing at the conclusion of the evidence on 18 February 2021 and the written closing submissions that were filed on 1 April 2021, can be described as fivefold: (a) There was no legitimate expectation that the plaintiff’s funds be used only for operating expenses and not to repay loans.41Foot Note 41×Transcript, 18 February 2021, at p 5 line 16 to p 6 line 21; DCS at paras 20–21. (b) The second defendant acted for the benefit of F8 and not for his own personal benefit.42Foot Note 42×DOS at paras 20–24; DCS at paras 48–49. (c) The increase in directors’ salaries did not give rise to a minority oppression claim.43Foot Note 43×DOS at para 22; DCS at paras 22–27. (d) Any injury was suffered by F8 and not by the plaintiff.44Foot Note 44×DOS at para 38; DCS at paras 37–43. (e) The second defendant’s alleged failure to repay the monies used to repay his loan from First Media could not amount to prejudicial conduct.45Foot Note 45×DCS at para 63. 27 The second set of contentions comprised three broad points: (a) The breach (if any) was remedied by the second defendant’s agreement to repay the company’s funds.46Foot Note 46×Transcript, 18 February 2021, p 8 line 24 to p 9 line 24; DOS at paras 16–17 and 49–52. (b) To the extent it was not fully remedied, this cannot be complained of by the plaintiff, as he had full power at the time to dictate how it be remedied.47Foot Note 47×DOS at paras 7–19; DCS at paras 28–31. (c) Any prejudice was effectively wiped out by the failure of F8’s business.48Foot Note 48×DCS at paras 51–52. 28 The exposition of the second defendant’s contentions undertaken in the two paragraphs above is mine, and does not precisely follow how the second defendant ran his defences. However, I have captured their gist, and organised them into a logical flow. I would also add that the pleadings in this matter, on both sides, are brief and sketchy, outlining the dispute only at a high level of generality. Nonetheless, I am satisfied that both parties have had the opportunity to present their cases fully, broadly along the lines of my exposition. Whether the second defendant’s conduct was unfairly prejudicial 29 First, the second defendant submitted that there was no legitimate expectation that the plaintiff’s funds were to be used for operating expenses rather than to pay off loans. In particular, the second defendant took issue with the plaintiff’s reliance on a particular page of a presentation deck the second defendant had shown him. This page described F8’s monthly expenditure prior to the plaintiff’s investment as limiting the use of his funds to the purposes described on that page (essentially various categories of operating expenses).49Foot Note 49×AB 824.The second defendant noted that the plaintiff did not rely on the presentation deck in either his pleadings or his AEIC, and that the deck was provided by the second defendant in his AEIC.50Foot Note 50×DCS at para 20(a).This point lacks merit. It was pleaded that the plaintiff expected that existing loans were to be converted into equity.51Foot Note 51×Reply at para 8.This expectation plainly carried with it the expectation that his funds would not be used to pay off those existing loans. By logical elimination, this meant that his funds would be used for operating expenses. I therefore find that the plaintiff had a legitimate expectation in this regard, even without reliance on the presentation deck. 30 Second, the second defendant contended that he had acted for the benefit of F8, and not for his own personal benefit.52Foot Note 52×DCS at para 49.He had obtained a personal loan in order to fund his loan to F8, which needed funds for its operations. I agree that F8 did derive a benefit from the second defendant’s making of the loan arrangements. However, after his loan to F8 had been converted into equity, the second defendant still used the funds of F8 to repay the loan he had taken personally. This was certainly not in F8’s interests. If the loan had not been converted into equity, it would have at least remained a debt owed by F8 to the second defendant. Once converted, there was no debt owed by F8 and so any use of F8’s funds to pay off a debt owed by the second defendant was a misuse. 31 Third, in arguing that the increase in salaries did not found the minority oppression claim, the second defendant suggested that “[t]he inflation of salaries to pay back part of the loan was not a covert machination on the 2nd Defendant’s part but a suggestion made to him and [Lim] by [Sen]”.53Foot Note 53×DOS at para 22.But it obviously was a covert machination. It was a scheme meant to conceal from the plaintiff that F8’s funds were being used to pay off what was a personal liability of the second defendant. The second defendant attempted to hide behind Sen, the company’s accountant.54Foot Note 54×1 BAEIC 66–67 at para 23.However, as Sen testified, it was the second defendant and Lim who approached him after the conversion of the second defendant’s $50,000 loan to F8 into equity, and who asked him to think up ways to repay the second defendant’s personal liability to First Media.55Foot Note 55×Transcript, 17 February 2021, at p 8 lines 18–25.The second defendant knew, or at least ought to have known, that what he was doing was wrong and not something the plaintiff would have expected. 32 When the plaintiff raised the point that the increase in salaries should have been raised to him because cl 5.11 of the SHA required unanimous consent of shareholders for any increase in salaries,56Foot Note 56×Plaintiff’s opening statement at para 19; Transcript, 16 February 2021, p 21 lines 7–18.the second defendant pointed out that disputes under the SHA were subject to arbitration.57Foot Note 57×Transcript, 16 February 2021, p 22 lines 4–24.The second defendant argued that this aspect of the dispute should be referred to arbitration, a right which he had not waived.58Foot Note 58×DCS at paras 22–27.Whether to remove a material issue from consideration at such an advanced stage of proceedings by virtue of an arbitration clause would have been a difficult question. However, I do not have to answer that question because I do not need to place reliance on breach of the SHA. This is because, regardless of whether the SHA required the unanimous consent of shareholders, including Lim, for an increase in salaries, it was wrong for the second defendant to increase his and Lim’s salaries not because they deserved more but only in order to channel F8’s funds (invested by the plaintiff) to the repayment of his personal loan from First Media. It was not a genuine or deserved increase in salaries but a covert machination. 33 The fourth point that the second defendant made was that the real injury was to F8 and not to the plaintiff. The second defendant relies on the analytical framework laid down by the Court of Appeal inHo Yew Kong v Sakae Holdings Ltdand other appeals and other matters[2018] SLR 333 at [116], whereby the court must inquire into the injury suffered and the remedy sought. In terms of injury, the court should ask what the real injury is that the plaintiff seeks to vindicate, whether it is distinct from the injury to the company and whether it amounts to commercial unfairness against the plaintiff. In terms of remedy, the court should inquire into the essential remedy sought, whether it meaningfully vindicates the real injury suffered by the plaintiff and whether it is only obtainable under s 216. 34 Turning to the facts in this case, it is true that it was a breach of his fiduciary duty to F8 for the second defendant to increase his and Lim’s salaries for the collateral purpose of repaying his personal loan from First Media. But the same conduct can be both a breach of duty to the company and unfairly prejudicial conduct, if it involves unfairness or prejudice to the plaintiff distinct from, and in addition to, the breach of duty to the company. This is because the source of the funds was the plaintiff’s investment,59Foot Note 59×Transcript, 17 February 2017, at p 30 line 30 to p 31 line 23.and that investment had been made in the legitimate expectation that the second defendant would not use those funds to pay off existing loans (see [29] above). This was what the second defendant effectively did, albeit indirectly, by converting the loan to equity but surreptitiously increasing his and Lim’s salaries to channel funds to him so he could repay his personal loan from First Media. The injury that the plaintiff seeks to vindicate is precisely the wrong done to him in violating the assurance given to him. It is distinct from the injury to the company. 35 The remedy sought is also different, namely a buyout of his shares, and that remedy is only obtainable under s 216. Accordingly, I do not accept the second defendant’s contention on this point. 36 The fifth and final point made by the second defendant in the first set of contentions is that the second defendant’s failure to repay the unjustifiably increased salaries cannot amount to unfairly prejudicial conduct. This too is without merit. The prejudicial conduct was using the plaintiff’s invested funds to pay off the personal loan from First Media under the guise of the unjustifiably increased salaries, not the failure to repay those amounts. That failure is however relevant to one question arising under the second set of contentions, namely whether the prejudice was eliminated, cured or resolved. Whether the prejudice caused by the second defendant was eliminated 37 Turning then to the second set of contentions, the second defendant argued that to the extent that there had been any breach of the plaintiff’s legitimate expectations, it had been remedied with the plaintiff’s agreement. When the plaintiff discovered that the second defendant’s and Lim’s salaries had been inflated so that the second defendant could repay his personal loan, it was agreed that the salary increases would be reflected as a loan to the second defendant, which he would have to repay.60Foot Note 60×1 BAEIC 73 at para 42.Once that happened, the oppressive or prejudicial conduct came to an end.61Foot Note 61×DOS at paras 33 and 36.The second defendant relied onLim Chee Twang v ChanShuk Kuen Helina and others[2010] 2 SLR 209 (“Lim Chee Twang”) at [110] for the proposition that the plaintiff must show oppression continuing at the time the action under s 216 of the CA is brought, as past oppression, the effects of which had already ceased, would not found such an action. 38 The difficulty with this argument is that the breach and the prejudice it caused was not fully remedied because the second defendant only made partial repayment (see [10] above). Had he immediately and fully restored the monies wrongly disbursed, this would likely have brought the prejudicial state of affairs to an end. But he did not do that. At the same time, that there was an agreement concerning how to remedy the unfairly prejudicial conduct – even though this was not fully performed – remains material to the question of the appropriate remedy. 39 The second defendant made a further and related point. He argued that while the plaintiff was only a minority shareholder the second defendant would have agreed to whatever remedial action he wanted. Accordingly, he had the power to stop the allegedly unfairly prejudicial conduct. Given that he had practical options for redress, he was not entitled to seek redress by legal means.62Foot Note 62×DCS at para 31.In support of this proposition, the second defendant relied onAscend Field Pte Ltd and others v Tee WeeSien and another appeal[2020] 1 SLR 771, where the Court of Appeal said at [32] that: … [W]here a member is able to remedy any prejudice or discrimination he has suffered through the ordinary powers he possesses by virtue of his position as member, the conduct of the defendant cannot be said to be unfair to him. 40 While ingenious, the argument fails for two reasons. First, the second defendant did not specify what the plaintiff could have required (other than repayment of the monies) that would have put an end to the prejudice. Secondly, what was agreed by way of remedy, namely repayment, was not fully performed by the second defendant. 41 This leaves the final contention of the second defendant. It brings the discussion back to the question posed at the start of this judgment, in [3], concerning the impact of a finding that F8 would in any case have ceased to be a going concern for other and independent reasons.",
        "The effect of F8’s failure as a business": "42 This contention responded to the point I had raised at the conclusion of oral submissions for both parties to consider. I asked what the appropriate order would be if I accepted that there was unfairly prejudicial conduct, but that regardless of such conduct F8 would still have failed as a business so that the shareholding would be worth nothing.63Foot Note 63×Transcript, 18 February 2021, at p 68 line 6 to p 69 line 6. 43 The second defendant argues that “[i]t has not been established that the conduct of [the second defendant and Lim] in inflating their salaries caused any further disadvantage to the Plaintiff as [F8] was already a sinking ship in any event”.64Foot Note 64×DCS at para 51.F8 “was headed for business failure regardless of the inflation of the salaries because its debts amounted to $340,000 and it was not able to raise more financing”.65Foot Note 65×DCS at para 52.In other words, regardless of whether the prejudicial conduct occurred, the plaintiff would have lost his investment anyway. This links with the second defendant’s point that what the plaintiff seeks to do in this case is to recover a bad investment. 44 The second defendant cited, but did not develop arguments on, the Court of Appeal decision inKumagaiGumi Co Ltd v Zenecon Pte Ltdand others and other appeals[1995] 2 SLR(R) 304.66Foot Note 66×DCS at para 51.In that decision (at [76] to [78]), the Court of Appeal held that there was power under s 216 to order a defendant to make good to the company loss resulting from his unfairly prejudicial conduct, but concluded that whether the loss was caused by the unfairly prejudicial conduct remained contentious and unproven. Accordingly, the Court of Appeal set aside the order made at first instance on this aspect. This authority certainly demonstrates that the question of causation is important. I am of the view that the court should consider what consequences flow from or have been caused by the unfairly prejudicial conduct, and whether such consequences continue to operate in the present. The corollary of this is that it is legally relevant to what the appropriate order should be if factors other than the second defendant’s conduct have operated in relation to the company or the plaintiff’s grievance. 45 The plaintiff’s response to my question was to argue that I should order the buyout either at the subscription price for his shares, or on the basis of the revenue for 2019 that had been forecast in the presentation deck.67Foot Note 67×PCS at para 76 and 84–85; AB 822.This seemed to put matters in two different ways. One was that he should be restored to his position prior to making the investment. The other was that he should be put in the position he would have been in had the business prospered as he had expected. 46 In the first alternative, the plaintiff likens himself to the “white knight” asked to save the company’s business described in the Court of Appeal decision inTullioPlaneta v Maoro Andrea G[1994] 2 SLR(R) 501 (“TullioPlaneta”).68Foot Note 68×PCS at paras 74–76.In that case, despite his having invested in the company with a view to resuscitating its business, the appellant investor was excluded from his expected role in management by the respondent shareholder. Because the appellant was excluded, he could do nothing to resuscitate the business. There had been an agreement that the appellant would be manager or director and have an equal role in the running of the company and in decision making. The Court of Appeal held (at [18]) that: 18 There is no doubt that the power given to the court by s 216(2) of the Companies Act of ‘bringing to an end or remedying the matters complained of’ confers on the court an unfettered discretion subject only to the overriding requirement of fairness, and as the English authorities show the court is not bound to fix a value by valuation as at the date of the presentation of the petition or on the date the order is made. … In the circumstances, the Court of Appeal decided that fairness could only be achieved by ordering the respondent to purchase the appellant’s shares at the price at which he sold them to the appellant in the first place (at [20]). 47 The Court of Appeal did not spell out its reasoning for this decision, but it does seem to have been within the court’s consideration “that the respondent who himself ran the company after excluding the appellant did not seriously or at all try to re-activate the trading of the company” (at [14]). This suggests that the respondent’s responsibility for the company not being a going concern was material to the remedy ordered. 48 In the second alternative, the plaintiff relies on the principle that the court may fix the value of the shares as the value that they would have had but for the oppression.69Foot Note 69×PCS at para 84. 49 It is certainly correct that the court has discretion to mould the remedy to fit the fairness and justice of the case, including by determining the most appropriate date and basis of valuation, as well as notionally compensating for the effect of unfairly prejudicial conduct in the context of and for the purpose of valuation. However, whether and how to exercise this discretion depends on the facts and circumstances of each case. It is the circumstances prevailing at the time when the order is to be made that shape the appropriate remedy that would rectify the conduct complained of. 50 Turning to this case, I find that the business of F8 would have failed regardless of the unfairly prejudicial conduct. If the second defendant had not unjustifiably increased his and Mr Lim’s salaries, and had not caused F8 to pay $13,000 directly to First Media, in all probability F8 would have continued in business for two to three months longer, but with the same ultimate result of depleting its cash to nothing. For this reason, I find that what caused the loss of the plaintiff’s investment was simply that the business model of F8 was not the success he hoped it would be. This point distinguishes this case from that ofTullioPlanetawhere the respondent’s prejudicial conduct of excluding the appellant stopped the latter from taking steps to resuscitate the company. 51 The plaintiff appears to have invested in F8 mostly because he saw potential in its business model as a start-up.70Foot Note 70×Transcript, 16 February 2021, at p 15 lines 25–31.He admitted that he did not check F8’s financial statements or its financial health before deciding to make the investment.71Foot Note 71×Transcript, 16 February 2021, at p 15 lines 9–19.While he did maintain that his decision to invest would have been affected if he had known that F8 owed another $50,000 in addition to the US$250,000 of debt mentioned in the presentation deck,72Foot Note 72×Transcript, 16 February 2021, at p 17 lines 6–32.this evidence is not entirely consistent with his expression of interest in late 2018 (even after discovering the unfairly prejudicial conduct) in continuing with the business of F8 even without the second defendant.73Foot Note 73×AB 799.Indeed, even after discovering the inflated salaries, the plaintiff was prepared to offer a loan of $100,000 to F8 to keep it afloat, withdrawing this offer only when progress with potential clients faltered.74Foot Note 74×Transcript, 16 February 2021, at pp 36 and 37.The plaintiff’s consistent engagement and enthusiasm suggests that he did not consider the unfairly prejudicial conduct to be fundamental to his investment or incapable of remedy. As noted at [38] above, the fact that there was an agreement concerning how to remedy the unfairly prejudicial conduct, even though not fully performed, is material to the question of the appropriate remedy. That agreement had nothing to do with a buyout, and only involved repayment to F8 of the wrongly diverted funds. This certainly militates against the grant of a buyout on either of the bases now sought by the plaintiff. 52 In fact, F8’s business model did not lead to the anticipated revenues and profits, and no new investors could be found. It was not until 16 December 2018 that the plaintiff asked for repayment of his investment, but only of such part that had been used to pay off First Media, saying to the second defendant, “Since there is no interest to continue building [F8] from all parties, I would like to recover my investment amount which you used to pay off First Media”.75Foot Note 75×AB 802. 53 For these reasons, I am not persuaded that it would be right to grant the remedy of buyout on either basis sought by the plaintiff. In relation to the first basis, effectively seeking the return of his whole investment, the evidence does not show that the plaintiff truly considered the inflation of salaries to break the deal on the basis of which he had invested. Moreover, the second defendant did not cause F8’s business failure. Unlike the respondent inTullioPlaneta, he genuinely tried to make F8 a success, and it failed simply because its business model did not work. In relation to the second basis, whereby the plaintiff seeks the value of his investment on the assumption of F8’s success, the second defendant’s misuse of F8’s funds did not cause the business failure of F8. In short, the plaintiff would still have both made and lost his investment even if the unfairly prejudicial conduct had not occurred. 54 To put it another way, the bases now put forward by the plaintiff would overcompensate him and penalise the second defendant. The plaintiff would escape the consequence of his own decision to invest in F8 made because he, like the second defendant, believed in its business model. The second defendant would be made to shoulder the burden of F8’s business failure on both his own and the plaintiff’s behalf. This is not what fairness requires in this case. 55 It could be said that perhaps the plaintiff should be given the remedy of a buyout for a price calculated by reference to the amount of his investment wrongly diverted by the second defendant and not repaid to the company by him i.e. $36,000, comprising $22,000 of inflated salaries not repaid and $13,000 paid directly to First Media. This is not a remedy the plaintiff has sought. It is not appropriate in any event because it cannot be said that but for the unfairly prejudicial conduct the plaintiff’s shareholding would be worth $36,000. 56 On the other hand, it could be said that there is no prejudice to remedy, no present state of affairs to correct, given that F8 has ceased business for reasons independent of the unfairly prejudicial conduct. If so, then, as explained inLim Chee Twang(see [37] above), s 216 would have no application. This is not quite how the defendant has argued it, but it is a point the court must consider. 57 Taking a step back and looking at what transpired as a whole, both the plaintiff and second defendant believed in the business model of F8 as a young start-up. Unfortunately, it never gained the hoped-for traction. This was not the fault of the second defendant. Where the second defendant was at fault was in causing F8’s funds to be used to pay off his personal loan from First Media, surreptitiously sidestepping the loan-to-equity conversion that had been done because the plaintiff required it. When this misuse of F8’s funds was discovered by the plaintiff, he was unhappy but continued to believe in the potential success of F8. For this reason, he agreed that the increased salaries should be reflected as a loan to the second defendant, which the second defendant should repay. 58 The plaintiff bears the burden of showing that the second defendant’s conduct continues to have effect notwithstanding the business failure of F8. For example, it would have been material if it was shown that F8’s continuing in business for another few months would have enabled it to gain the traction it had previously failed to achieve. The plaintiff did not suggest, let alone prove, that this was the case.  It would have been material if the monies misused and not repaid would otherwise have been available for payment of significant dividends to shareholders including the plaintiff. Such a consequence could continue to operate to prejudice shareholders long after the event. Again, the plaintiff did not suggest that this was the case. 59 As it turned out, both the plaintiff and second defendant were wrong about the business model of F8. It failed. While the second defendant had engaged in unfairly prejudicial conduct, that conduct did not cause the business failure of F8. The failure of F8 brought an end to the prejudicial state of affairs. The plaintiff had lost his investment. But this was because of F8’s business failure and not the second defendant’s conduct. 60 There is one small point that remains, namely the plaintiff’s prayer that the second defendant account to F8 “for any loans undertaken and manner in which the said loans were used and/or dissipated”.76Foot Note 76×SOC at prayer 1.This prayer continued to be sought even after I directed the plaintiff to clarify what orders and relief it was seeking.77Foot Note 77×PWS at Annex A.However, none of the plaintiff’s closing submissions addressed this prayer and the plaintiff did not establish any basis for its grant. I dismiss it.",
        "Conclusion": "61 Ultimately, I am of the view that the second defendant must prevail in these proceedings, as his unfairly prejudicial conduct was overwhelmed by the independent business failure of F8. For this reason, it can no longer be said that the unfairly prejudicial conduct operates in the present, or that there is a present state of affairs that the claimed buyout would remedy. I dismiss the plaintiff’s claim. 62 That I have found that the second defendant had engaged in unfairly prejudicial conduct will be something to be considered in relation to the question of costs, on which I will hear parties. Philip JeyaretnamJudicial Commissioner Chan Yew Loong Justin and Jaspreet Kaur Purba (Tito Isaac & Co LLP) for the plaintiff; The first defendant absent and unrepresented; Siraj Shaik Aziz, Walter Silvester and Tan Hoe Shuen (Silvester Legal LLC) for the second defendant."
    }
}