{
    "case_title": "Public Prosecutor vSteven John a/l Gobalkrishnan",
    "ncitation": "[2021] SGHC 111",
    "coram": "Chua Lee Ming J",
    "sections": {
        "Introduction": "1 The accused, Mr Steven John a/l Gobalkrishnan, 40 years of age, faced one charge of having in his possession not less than 14.99g of diamorphine (a Class ‘A’ controlled drug) for the purpose of trafficking, an offence under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”) and punishable under s 33(1) of the MDA (“the Charge”). 2 On 5 April 2021, the accused pleaded guilty to the Charge and admitted without qualification to the facts contained in the Statement of Facts. I therefore convicted him on the Charge. 3 I sentenced the accused to 27 years’ imprisonment and 15 strokes of the cane. The sentence of imprisonment was backdated to his date of remand,ie, 8 August 2019. 4 The accused has appealed against the sentence.",
        "The facts": "5 The material facts, taken from the Statement of Facts, are set out below. 6 On 7 August 2019, officers from the Central Narcotics Bureau (“CNB”) commenced an operation after receiving intelligence that the accused would be delivering drugs to one Kajirajan s/o Supan (“the co-accused”). 7 At about 7.40am, the co-accused was spotted alighting from a taxi at a bus stop near the National University Centre for Oral Health (“the Bus Stop”), where the accused was waiting. The CNB officers observed the accused handing over a white plastic bag to the co-accused at the Bus Stop. The co-accused handed over $1,200 in cash to the accused. The accused then rode off on his motorcycle. 8 The CNB officers moved in and placed the co-accused under arrest at about 7.50am at the Bus Stop. The accused was arrested soon after, at about 8.00am, at the junction of Kent Ridge Road and South Buona Vista Road. 9 A search was conducted on the accused and $1,200 in cash, among other things, was found on him. The white plastic bag handed over by the accused to the co-accused was seized from the co-accused. The white plastic bag contained the following items: (a) One heat-sealed plastic bag (“A1A1”) containing 75 packets of yellow granular/powdery substance, wrapped in newspaper (collectively, “A1A1A”). (b) One heat-sealed plastic bag (“A1B1”) containing 75 packets of yellow granular/powdery substance, wrapped in newspaper (collectively, “A1B1A”).",
        "Background facts": "10 The accused owed money to one “Sugu”, an illegal moneylender based in Malaysia. In order to pay off his debts, the accused agreed with Sugu that he would source for customers who wanted to purchase diamorphine and deliver diamorphine to these customers. The co-accused was one such customer. 11 The accused would receive a commission of $500 for every 60 packets delivered, which would go either towards paying off his debts to “Sugu” or to himself directly. 12 The accused admitted that between March 2019 and the date of his arrest, he had delivered between 50–60 packets of diamorphine per delivery to the co-accused on at least ten occasions. All the deliveries occurred at the Bus Stop. 13 The accused and co-accused would get in touch prior to each delivery and decide on the number of packets to be delivered. The accused would then inform “Sugu” on the number of packets ordered by the co-accused, collect the drugs from “Sugu”, and then deliver the diamorphine to the co-accused. 14  “Sugu” agreed to a price of $500 for one set (ten packets) of diamorphine for the co-accused’s orders of diamorphine. The accused would provide the diamorphine to the co-accused on credit and the co-accused would pay for the previous order when they next met up. 15 The accused would wrap the diamorphine in newspaper and put them at the bottom of his sling bag. He would also place his raincoat and breakfast on top of the drugs to conceal them. He would then ride his motorcycle from Malaysia to Singapore via the Tuas Checkpoint.",
        "Facts pertaining to the Charge": "16 Sometime in July 2019, the co-accused ordered 60 packets of diamorphine from the accused, which cost $3,000. Upon delivery of the 60 packets, the co-accused paid the accused $1,800, leaving an unpaid balance of $1,200. 17 On 5 August 2019, the accused informed the co-accused that he would not be entering Singapore for about two to three weeks. As such, he wanted to check with the co-accused whether he needed more diamorphine. The co-accused told the accused that he needed 150 packets of diamorphine. 18 The accused collected the 150 packets of diamorphine from “Sugu” in Malaysia and packed them into two separate plastic bags of 75 packets each, which he sealed with a lighter (A1A1A and A1B1A respectively). He then wrapped each bundle with newspaper and placed them into a white plastic bag. 19 On 7 August 2019, the accused met up with the co-accused at the Bus Stop and handed the white plastic bag over to the co-accused. The co-accused paid the accused $1,200 in cash, which was the unpaid balance for the previous delivery. For the delivery of A1A1A and A1B1A, the co-accused owed the accused $7,500 and he was to pay this sum of money at a later date.",
        "Analysis of the drugs": "20 A1A1A and A1B1A were sent to the Health Sciences Authority (“HSA”) for analysis. The HSA certified that A1A1A and A1B1A contained, in aggregate, not less than 14.99g of diamorphine, a Class ‘A’ controlled drug listed in the First Schedule to the MDA. 21 The accused admitted to possession and ownership of A1A1A and A1B1A (collectively, “the Drugs”). He also admitted to delivering the Drugs to the co-accused. The accused was not authorised under the MDA or the regulations made thereunder to possess a controlled drug for the purpose of trafficking.",
        "Sentencing": "22 The prescribed punishment for the Charge was a maximum of 30 years’ imprisonment or life imprisonment and 15 strokes of the cane and a minimum of 20 years’ imprisonment and 15 strokes of the cane: s 33(1) read with the Second Schedule to the MDA. 23 The indicative starting sentence for unauthorised trafficking of 13.01g to 15g of diamorphine is 26 to 29 years’ imprisonment:Public Prosecutorv Tan Lye Heng[2017] 5 SLR 564 (“Tan Lye Heng”) at [125]. However, the court may make necessary upward or downward adjustments to the indicative starting sentence to take into account the culpability of the offender, as well as any relevant aggravating or mitigating factors:Vasentha d/o Joseph vPublic Prosecutor[2015] 5 SLR 122 (“Vasentha”) at [44]. 24 The Prosecution submitted the following: (a) Based on the weight of the Drugs (not less than 14.99g), the indicative starting sentence should be 29 years’ imprisonment and 15 strokes of the cane. (b) The indicative starting sentence should remain at 29 years’ imprisonment as the accused’s culpability is high: (i) He was not a mere courier with limited involvement. Instead, he played an active role in facilitating “Sugu’s” drug trafficking enterprise. The accused helped to collect, deliver, and repackage the Drugs. He also took active steps to ensure that the Drugs were concealed deep within his sling bag before entering Singapore. (ii) He was also motivated by financial gain as he was paid a commission of $500 by “Sugu” for every 60 packets of diamorphine delivered. He actively sourced for his own customers and liaised with them directly. He did not rely on “Sugu” to provide him with contacts. (c) Taking into account the following mitigating factors, the imprisonment term should be adjusted to 27 years, with the final sentence being 27 years’ imprisonment and 15 strokes of the cane: (i) The accused cooperated during the investigation process by admitting to the offence readily and implicating the co-accused. (ii) The accused has portrayed some remorse by pleading guilty, although the mitigating weight for his plea of guilt is low since the accused was caught red-handed. While the accused was untraced for drug-related offences, he should not be treated as a first-time offender given his admission that he had delivered drugs to the co-accused on at least ten occasions prior to his arrest. Such admissions would negate the mitigating weight of the accused’s assertion that it was his first offence:Vasenthaat [59] and [81]. 25 The accused submitted that the indicative starting sentence of imprisonment should be 26 years, considering his limited involvement in “Sugu’s” drug trafficking enterprise and the fact that his impecuniosity was exploited by “Sugu”. He further submitted that he had fully cooperated with the investigations and had shown remorse by pleading guilty. As such, the final sentence should be 24 years’ imprisonment and 15 strokes of the cane. 26 I disagreed with the accused’s submissions that the indicative starting sentence should be 26 years. The Court of Appeal inSuventher Shanmugam v Public Prosecutor[2017] 2 SLR 115 has made it clear (at [21]) that for drug trafficking offences, the sentence imposed should be proportional to the weight of the drugs in order to reflect the gravity of the offence. This approach has also been echoed in several other cases: see foreg,Public Prosecutor v Poopathi Chinaiyah s/o Paliandi[2020] 5 SLR 734 at [23]–[25] andTan Lye Hengat [124]. 27 The correct indicative starting sentence should thus be 29 years, which lies at the highest end of the spectrum, in order to properly reflect the gravity of the offence of trafficking 14.99g of diamorphine. 28 I agreed with the Prosecution’s submissions on sentencing. Accordingly, I sentenced the accused to 27 years’ imprisonment and 15 strokes of the cane. I ordered the sentence to be backdated to his date of remand,ie, 8 August 2019. 29 Arising from the above facts, the co-accused, 60 years of age, pleaded guilty to an offence of having in his possession not less than 14.99g of diamorphine for the purpose of trafficking, under s 5(1)(a) read with s 5(2) and punishable under s 33(1) of the MDA. A charge of trafficking by selling 18 packets containing, in total, not less than 2.47g of diamorphine, was taken into consideration. I agreed with the Prosecution’s submissions and sentenced the co-accused to 29 years’ imprisonment. The co-accused has not appealed against his sentence. Chua Lee MingJudge of the High Court Dwayne Lum and Chng Luey Chi for the Prosecution; Christopher Anand Daniel and Jacintha Gopal (Advocatus Law LLP) for the accused."
    }
}