{
    "case_title": "Lakshmi d/o Kumaravelu vLazada Singapore Pte Ltd",
    "ncitation": "[2021] SGHC 174",
    "coram": "Andre Maniam JC",
    "sections": {
        "Introduction": "1 The plaintiff filed thisex parteoriginating summons (“OS”) to appeal against decisions which, by law, are unappealable. I dismissed the OS. The plaintiff has indicated that she is dissatisfied with my decision, and will take the matter further.",
        "Background": "2 The plaintiff brought a claim before a Small Claims Tribunal against the defendant (“Lazada”), seeking (a) a refund of the amount she had paid for a dishwasher purchased on Lazada’s online platform in July 2020, and (b) damages for her suffering eczema, which she claimed was a result of her dealing with Lazada’s customer service.  3 Lazada was willing to refund the sum which had been paid for the dishwasher (which Lazada said was $472.98, but the plaintiff said was $499); but Lazada disputed the plaintiff’s claim for damages for eczema, which the plaintiff quantified in the sum of $1,124.51 for the period up to mid-October 2020. The plaintiff’s damages claim was denied by the tribunal magistrate. The magistrate found that (a) the plaintiff had not proven that Lazada had in any way caused her eczema, and (b) the nature of the damage was too remote for damages to be claimable. The magistrate only allowed a refund of the sum paid, which the magistrate found was $472.98 (which Lazada had already been willing to provide).",
        "The plaintiff had no right of appeal": "4 The plaintiff was dissatisfied with the Small Claims Tribunal’s order, as regards both the $26.02 difference in the amount of the refund, and her not getting any damages for eczema. However, the order of the Small Claims Tribunal was final and binding on the parties, subject only to a potential appeal. 5 Under s 38(1) of the Small Claims Tribunals Act (Cap 308, 1998 Rev Ed) (“the Act”) an order of a Small Claims Tribunal can be appealed against (a) on any ground involving a question of law; or (b) on the ground that the claim was outside the jurisdiction of the tribunal. However, under s 38(1A) of the Act, an appeal can only be brought if leave to appeal is given by the District Court. No such leave was given. 6 The plaintiff knew she needed leave to appeal. She applied to the District Court for leave to appeal, but her application for leave to appeal was dismissed, with the District Court stating that it agreed with the tribunal magistrate’s decision. Under s 38(3) of the Act, the District Court’s decision not to give leave to appeal is final and is not subject to an appeal. 7 The plaintiff expressly recognised in her OS that her application for leave to appeal had been dismissed by the District Court, but she nevertheless filed the OS as a “notice of appeal” to ask the High Court to “reconsider” the Small Claims Tribunal’s decision. However, she had no right to appeal against the Small Claims Tribunal’s decision. She also had no right to appeal against the District Court’s decision not to give her leave to appeal. 8 Section 38 of the Act was highlighted to the plaintiff by Lazada in email correspondence, by an Assistant Registrar at a pre-trial conference, and by me at the hearing of the OS, but the plaintiff maintained that she could still pursue her damages claim. She argued that there was a difference between the District Courtdismissing her applicationfor leave to appeal, and the District Courtnot grantingleave to appeal. There is no difference. She applied for leave to appeal, the District Court did not give her leave to appeal, and without such leave she could not appeal against the Small Claims Tribunal’s decision. Further, she could not appeal against the District Court’s decision. She filed this OS nevertheless. 9 The plaintiff also suggested that the OS could be regarded as afresh claim, for what she had failed to get from the Small Claims Tribunal. That does not work. One cannot get around a final, binding, and unappealable decision by filing the same claim (that had failed) in another court. 10 The plaintiff asserted that the court had advised that she could bring this OS. The court gave her no such advice. On the contrary, it was explained to her that she could not file a notice of appeal: her application for leave to appeal had been dismissed by the District Court, the Small Claims Tribunal’s order was binding, and there was no further recourse. After she filed the OS, she was informed that it was likely that her OS would be dismissed, but she decided to press on with it.  11 Finally, I would mention that the plaintiff proceededex partein the absence of Lazada. It was highlighted to her at a pre-trial conference that she should amend the OS to make itinter partes, and serve it, to require Lazada to attend. The court even gave her leave to amend the OS, but she declined to do so. She said that as she was the party dissatisfied with the Small Claims Tribunal’s decision, the court should just hear from her; she expressed concern that if the court also heard from Lazada, that could be “detrimental” to her (as she said the Small Claims Tribunal’s decision was, when the tribunal had heard from both sides). The court could not however overturn the Small Claims Tribunal’s decision without giving Lazada an opportunity to be heard.",
        "Conclusion": "12 The plaintiff had no right of appeal in the first place, and so I dismissed the OS. Andre ManiamJudicial Commissioner   The plaintiff in person; The defendant absent and unrepresented."
    }
}