{
    "case_title": "Greenway Environmental Waste Management Pte. Ltd. vCramoil Singapore Pte Ltd",
    "ncitation": "[2021] SGHC 203",
    "coram": "S Mohan JC",
    "sections": {
        "Introduction": "1 Shortly after 6.27pm on 7 June 2017, a fire broke out at the premises of a general waste collection business at 6 Tuas South Street 8, Singapore 637003. The premises were occupied by the plaintiff, Greenway Environmental Waste Management Pte. Ltd. (“plaintiff”). Approximately 11 minutes later at or shortly before 6.38pm, the fire (or a series of fires) culminated in a large explosion. Subsequent investigations into the cause of the fires and explosion determined that the most likely origin or source of the fires was the presence of a significant quantity of unfinished and unsealed cylindrical-shaped lithium batteries (“Lithium Batteries”).1Foot Note 1×Tan Jin Thong’s Affidavit of Evidence-in-Chief (“AEIC”) Exhibit TJT-1 at pp 16–17, 30 (Expert Witness Report dated 10 November 2020 at paras 4.5, 5.7; Expert Witness Response Report dated 27 November 2020 at p 3); Lim Chin Chin’s AEIC Exhibit LCC-2 at p 42 (Fire Investigation Report dated 20 November 2020 at para 81); Plaintiff’s Opening Statement at para 6; Defendant’s Opening Statement at para 6.The source of the Lithium Batteries, and in particular whether they originated from the defendant, Cramoil Singapore Pte Ltd, were among a number of hotly contested issues in this case. 2 To put matters into perspective, the available evidence indicates that after the incident, at least 200 kilograms of the Lithium Batteries were found in the waste segregation section at the premises of the plaintiff (“Plaintiff’s Premises”). The actual quantity or weight of the Lithium Batteries present in the Plaintiff’s Premisesbeforethe fire started was therefore probably in excess of 200 kilograms. 200 kilograms is the equivalent of forty, completely filled five-kilogram bags of rice. 3 The fires and resultant explosion caused damage to the Plaintiff’s Premises necessitating,inter alia, cleaning and restoration work and the incurrence of various costs and expenses to make good the damage caused. Fortunately, there was no loss of life or personal injuries. The cost and expense incurred amounted in total to S$579,641.50 (“Claim Amount”). The Claim Amount has been paid to the plaintiff by the plaintiff’s insurer Great Eastern Insurance Limited (“Great Eastern”).2Foot Note 2×Plaintiff’s Opening Statement at paras 2, 32; Plaintiff’s Closing Submissions (“CS”) at para 1.The present action has been brought by Great Eastern in the name of the plaintiff pursuant to Great Eastern’s rights of subrogation. The quantum of damages sought by the plaintiff, as represented by the Claim Amount, is not disputed by the defendant.3Foot Note 3×Day 1 Transcript dated 2 February 2021 at p 10, lines 8–14; Defendant’s CS at para 5.The real contest in this case is on liability.",
        "Facts": "",
        "The parties": "4 The plaintiff is a company incorporated in Singapore. At all material times, the plaintiff was in the business of providing general waste collection and recycling services.4Foot Note 4×Statement of Claim (“SOC”) at para 1.The plaintiff is, and was at all material times, licensed by the National Environmental Agency (“NEA”) as a General Waste Collector for general wastes classified under Class A and Class B.5Foot Note 5×Cai Jielun’s AEIC at para 6 and Exhibit CJL-6 at pp 22–29 (NEA Licence for General Waste Collector (Class A, B)); Lee Cheng Wah’s AEIC at para 5.Class A general wastes includes wastes such as “unwanted furniture, electrical appliances, construction and renovation debris, cut trunks and branches, bulky waste, and recyclable waste (excluding food waste)” while Class B general wastes include “domestic refuse, food waste (excluding cooking oil) and market waste and wastes which are degradable”.6Foot Note 6×Cai Jielun’s AEIC at para 8; Lee Cheng Wah’s AEIC at para 7.It is common ground that the plaintiff is not, and was not at the material time, a licenced Toxic Industrial Waste collector.7Foot Note 7×Cai Jielun’s AEIC at para 10; Lee Cheng Wah’s AEIC at para 8; Tan Kim Seng’s AEIC at para 9.For completeness, the plaintiff is also not licenced to collect Class C general wastes which would include sludge from water or sewage treatment plants, grease interceptors or waste from sanitary conveniences in ships and aircraft.8Foot Note 8×Thangarajah Thangamany’s AEIC at p 49 (HFS-Asia’s report dated 17 July 2017 at para 2.2, Table 1). 5 The defendant is a company incorporated in Singapore. At all material times, the defendant was a licensed Toxic Industrial Waste collector and “commonly handles” hazardous substances.9Foot Note 9×Tan Kim Seng’s AEIC at paras 2–4, Exhibit TKS-1 at pp 38–47 (NEA Licence for Toxic Industrial Waste); Tan Weide Marcus’ AEIC at paras 4(a)–(b).The defendant’s licence as a Toxic Industrial Waste collector, in turn, allows the defendant to only store, reprocess, use, treat, or dispose of such industrial wastesat theDefendant’s Premises.10Foot Note 10×Day 6 Transcript dated 10 February 2021 at p 16, lines 14–21.The defendant is also in the business of, among others, manufacturing and processing chemicals and recycling non-metal waste.11Foot Note 11×SOC at para 2; Defence at para 4.Even though the defendant is also licenced to dispose of general wastes, the defendant “focus[es] its resources on its core business of collecting and disposing of toxic or hazardous waste” as a matter of business strategy and as such “decided to outsource the disposal of the general wastes found in the wastes which [the defendant] collected from its customers and the general wastes which [the defendant] itself generated at its premises”.12Foot Note 12×Tan Kim Seng’s AEIC at para 6; Tan Weide Marcus’ AEIC at para 4(c).The defendant thus outsourced its general waste disposal operations to the plaintiff. As a result, the defendant was at the material time in June 2017, one of the plaintiff’s customers.",
        "Background to the dispute": "6 Since about 2004, and pursuant to an oral agreement between the parties, the plaintiff has been rendering services to the defendant for the collection, processing (if necessary) and disposing of wastes in consideration of payment (“Agreement”).13Foot Note 13×SOC at para 3; Defence at para 4; Defendant’s CS at para 4(a); Plaintiff’s Reply Submissions (“RS”) at para 38.During the course of the parties’ business relationship, the plaintiff extended copies of the plaintiff’s General Waste Collector’s Licence to the defendant on at least three occasions.14Foot Note 14×Cai Jielun’s AEIC at para 8, Exhibit CJL-6 at pp 31–37 (Email Correspondences dated 26 April 2016, 30 November 2016, and 17 February 2017).At all material times, the defendant was aware that the plaintiff is not a licenced Toxic Industrial Waste collector.15Foot Note 15×Defence at para 5; Tan Kim Seng’s AEIC at para 9. 7 As part of the Agreement, the plaintiff would deploy a skip bin at 4 Tuas View Lane, Singapore 637750 (“Defendant’s Premises”) for the defendant to discard general waste into it.16Foot Note 16×Lee Cheng Wah’s AEIC at para 16.One of the factual issues in contention in this case is whether a specific skip bin was always deployed by the plaintiff to the Defendant’s Premises and I shall return to that issue later. 8 On 7 June 2017 (the day of the incident), Mr Tan Kim Seng, the defendant’s managing director, called and spoke to Mr Lee Cheng Wah, the plaintiff’s managing director, over the telephone and requested the plaintiff to collect the skip bin containing waste from the defendant’s premises.17Foot Note 17×Statement of Claim at para 7; Defence at para 7. 9 The plaintiff’s lorry bearing licence plate XE 1524M (“Lorry”) arrived at the Defendant’s Premises some time after 6.00pm on 7 June 2017, collected the skip bin from the Defendant’s Premises and arrived at the Plaintiff’s Premises at around 6.20pm.18Foot Note 18×Defence at para 7A; Reply at para 4A.The journey from the Defendant’s Premises to the Plaintiff’s Premises is a short one and takes no more than fifteen minutes. 10 The Lorry was fitted with a Global Positioning System (“GPS”) that enabled the Lorry’s historical track data to be retrieved.19Foot Note 19×Thangarajah Thangamany’s AEIC Exhibit TT-1 at p 34 (Preliminary Report by Insight Adjusters and Surveyors Pte Ltd to the Plaintiff’s Insurer dated 17 July 2017 at para 36).There was a six-minute difference between the time as shown on the Lorry’s GPS track data and the timestamp on the plaintiff’s closed-circuit television (“CCTV”) recordings; this difference was considered to be “inherent and not manipulated”.20Foot Note 20×Thangarajah Thangamany’s AEIC Exhibit TT-1 at p 37 (Preliminary Report by Insight Adjusters and Surveyors Pte Ltd to the Plaintiff’s Insurer dated 17 July 2017 at para 41).Mr Cai Jielun (“Mr Cai”), the plaintiff’s operations manager, explained that the “time shown on the CCTV footages is usually not accurate due to power trips at the Plaintiff’s Premises from time to time”.21Foot Note 21×Cai Jielun’s AEIC at para 48.This discrepancy between real time and the CCTV footage timing was accepted by the defendant’s expert witness, Ms Lim Chin Chin (“Ms Lim”),22Foot Note 22×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 26 (Fire Investigation Report dated 20 November 2020 at para 23).and was also not seriously pursued by the defendant at trial or in its written closing and reply submissions. The CCTV footage showed that the Lorry unloaded the contents of a skip bin marked “A10” (“Skip Bin A10”) at the waste sorting yard (“Sorting Yard”) of the Plaintiff’s Premises from about 6.22pm (ie, 18:16 hours CCTV time) to about 6.23pm (ie, 18:17 hours CCTV time).23Foot Note 23×Plaintiff’s CS at para 11; Lim Chin Chin’s AEIC Exhibit LCC-2 at p 22 (Fire Investigation Report dated 20 November 2020 at para 18). 11 The waste unloaded from Skip Bin A10 included,inter alia, numerous light-coloured opaque packages. The waste unloaded also included large items such as a washing machine and some brown-coloured material that resembled soil.24Foot Note 24×Plaintiff’s CS at para 11; Lim Chin Chin’s AEIC Exhibit LCC-2 at p 25 (Fire Investigation Report dated 20 November 2020 at para 19).As it turned out, the light-coloured packages contained “large”25Foot Note 25×Plaintiff’s CS at para 12; Lim Chin Chin’s AEIC Exhibit LCC-2 at pp 36, 42, 64 (Fire Investigation Report dated 20 November 2020 at paras 59, 81, 169).or “substantial”26Foot Note 26×Plaintiff’s CS at para 12; Lim Chin Chin’s AEIC Exhibit LCC-2 at p 28 (Fire Investigation Report dated 20 November 2020 at para 27).quantities of “unfinished and unsealed” lithium batteries. To be clear, an “unfinished” battery refers to a cylindrical-shaped object which lacks the outer metal casing while an “unsealed” battery refers to a battery which lacks metal caps at either end.27Foot Note 27×Defendant’s CS at para 13; 3 AB at pp 1222, 1224 (HFS-Asia Report dated 17 July 2017 at Photographs 12, 15–16).The Lithium Batteries would contain a cathode, an anode and insulating layers or foils (containing lithium) rolled together in a cylindrical shape so as to form what is termed a “jelly roll”.28Foot Note 28×Day 7 Transcript dated 25 February 2021 at p 117, lines 2–8.As an aside, any finished batteries would have been in the form of cylindrical lithium batteries, similar to those widely available to consumers as AA or AAA sized lithium batteries. As a visual aid, I reproduce at Annex 1 of this judgment photographs of samples of the Lithium Batteries found at the Plaintiff’s Premises. 12 It is common ground that the Lithium Batteries would be considered toxic industrial waste and/or hazardous substances and which would not fall within Class A or Class B general wastes.29Foot Note 29×Defence at para 9; Reply at para 4DA.This is primarily because the metal lithium (labelled as “Li” in the periodic table) is extremely flammable and highly reactive to water. It is also not disputed that hazardous substances must be transported in accordance with Part II of the Environmental Protection and Management (Hazardous Substances) Regulations (Cap 94A, Rg 4, 2008 Rev Ed).30Foot Note 30×Day 6 Transcript dated 10 February 2021 at p 19, line 10 to p 20, line 13.The collection of toxic industrial waste is likewise strictly regulated and must be undertaken by a licenced Toxic Industrial Waste collector after receiving information from its customers on the toxic industrial waste under Part III of the Environmental Public Health (Toxic Industrial Waste) Regulations (Cap 95, Rg 12, 2000 Rev Ed) (the “Regulations on Toxic Industrial Waste”). 13 Additionally, not all general wastes falling within the same class can be disposed of in the same manner. Some general wastes are non-incinerable and hence cannot be disposed of at an NEA incineration plant.31Foot Note 31×Cai Jielun’s AEIC at para 41.Whether general wastes are ultimately disposed of at an NEA incineration plant depends on,inter alia, the size of such waste. Under the Third Schedule to the Environmental Public Health (General Waste Collection) Regulations (Cap 95, Rg 12, 2000 Rev Ed) (the “Regulations on General Waste Collection”), certain types of general wastes such as bulky items (ie, any “solid object exceeding 0.6 m in length or width or 0.1 m in thickness” and any “hollow object exceeding 0.6 m in length, width or height”) or large electrical appliances (eg, “washing machines, refrigerators and air-conditioning units”) are considered non-incinerable and hence cannot be disposed of at NEA incineration plants. 14 For completeness, the plaintiff also rendered services to the defendant for the collection and disposal of ash generated by the defendant from its own waste disposal/incineration activities. The defendant’s ash wastes would be disposed into adifferentskip bin because the ash would be “sent to another location” (ie, the Pulau Semakau landfill) and not the NEA incineration plant.32Foot Note 32×Defendant’s CS at paras 19, 30; Tan Kim Seng’s AEIC at para 40.That skip bin, according to the plaintiff and which was not contested by the defendant, was labelled “B”33Foot Note 33×Lee Teng Guan’s AEIC at para 9.(whereas the plaintiff contends that Skip Bin A10 was deployed exclusively at the Defendant’s Premises for the disposal of general waste at the material time34Foot Note 34×Cai Jielun’s AEIC at para 38; 1 Agreed Bundle of Documents (“AB”) at pp 296, 300, 304 (Plaintiff’s Collection Slips dated 2 June 2017, 5 June 2017, 6 June 2017 respectively).). The skip bin provided by the plaintiff for the defendant’s disposal of ash wastes is not the subject matter of the present dispute. 15 After a careful review of the CCTV footage, I have tabulated below a timeline of the key events that occurred after the contents of Skip Bin A10 were unloaded onto the floor of the Sorting Yard at the Premises at about 6.23pm (ie, 18:17 hours CCTV time).35Foot Note 35×Lim Chin Chin’s AEIC Exhibit LCC-2 at pp 22–24 (Fire Investigation Report dated 20 November 2020 at para 18); Tan Jin Thong’s AEIC Exhibit TJT–1 at pp 14–15 (J T Megan & Partners Pte Ltd Fire Investigation Consultancy & Services Initial Independent Expert Witness Report dated 10 November 2020 at para 3.2).As the CCTV timestamps are represented in the 24-hour clock format, I have used the same format. S/NReal Time(CCTV Time)Key Event1.18:24:26(18:18:26)Excavator transfers and spreads out waste from the central section of the waste pile to the rearward section of the waste pile.2.18:26:34(18:20:34)Skip Bin marked “A2” is used to push back the light-coloured packages from near the front to the rear of the Sorting Yard.3.18:26:39(18:20:39)Excavator tracks moves further forward towards the central area of the waste pile.4.18:27:18(18:21:18)A fire (“F1”) breaks out at or near the left track of the excavator, emitting bright flames.5.18:28:05(18:22:05)The excavator extends its arm to isolate some light-coloured packages to the left of F1.6.18:28:08(18:22:08)An employee uses an extinguisher to fight F1 for about 25 seconds.7.18:28:18(18:22:18)Another employee runs towards the excavator with another extinguisher and uses it for about 17 seconds.8.18:28:26(18:22:26)An employee with a water hose reel appears to spray water onto the fire.9.18:28:38(18:22:38)The excavator reverses slightly and moves towards the left side of the Sorting Yard. The tracks of the excavator roll over the fire and waste material.10.18:29:54(18:22:54)F1 intensifies with bright flames. Materials and sparks are observed to be ejected from the fire.11.18:29:14(18:23:14)More employees come to fight the fire using fire extinguishers and a second water hose reel.12.18:30:56(18:24:56)The flames of F1 are extinguished but the area appears to be smouldering and emitting smoke.13.18:32:07(18:26:07)A fire (“F2”) breaks out close to the location of F1 and is put out in about 20 seconds using water from the hose reel.14.18:33:42(18:27:42)An employee uses a rake to isolate burnt debris at the location of F1.15.18:34:52(18:28:52)The employee with the rake picks up a light-coloured package on the ground and appears to examine it with several other employees.16.18:36:22(18:30:22)A fire (“F3”) breaks out at an area near the excavator.An employee uses a rake to shift and isolates some burning material from F3 to a section in the Sorting Yard that does not contain any waste. Materials can be seen ejecting from F3. F3 appears to be put out shortly thereafter.17.18:36:33(18:30:33)A fire (“F4”) breaks out at the rear of the Sorting Yard.18.18:36:49(18:30:49)F4 intensifies rapidly.An employee continues to fight the fire using the water hose reel.19.18:36:56(18:30:56)The excavator extends its arm towards F4 and its claws excavate and push the burning waste.20.18:37:07(18:31:07)As the excavator arm retracts, some burning waste drops from the claws and appears to ignite waste material below it at two areas (“F5” and “F6”).21.18:37:54(18:31:54)The fire appears to spread and intensify. Materials eject from the fire. Employees continue to fight the fire using water hose reels.22.18:37:55(18:31:55)A large explosion occurs (see photograph at Annex 2 of this judgment). 16 As a point of clarification, whilst in the tabulation above I have referred to fires F1 to F6, the parties’ experts disagree on whether there were six fires, as the defendant’s expert contends, or only one fire as the plaintiff’s expert contends. The plaintiff’s expert’s disagreement is on the basis that the “spots of fires on the waste piles in the sorting area were not new fires. They were the result of fire spread from the initial fire”.36Foot Note 36×Tan Jin Thong’s AEIC Exhibit TJT–1 at pp 14–15, 31 (J T Megan & Partners Pte Ltd Fire Investigation Consultancy & Initial Report for Suit No. 803 of 2019 dated 10 November 2020 at para 3.2; J T Megan & Partners Pte Ltd Fire Investigation Consultancy & Services Response to Ms Lim Chin Chin’s Forensic Report dated 27 November 2020 at “Response to para 108”).The respective expert witnesses do not dispute that some of the “spots of fires” were the result of “fire spread”. This is unsurprising since the material events at the Sorting Yard are recorded by the plaintiff’s CCTV. Hence, insubstance, the respective expert witnesses are describing thesameseries of events. In any case, in my view, the difference is of no material significance to the issues in the present case.37Foot Note 37×Defendant’s CS at para 189; Plaintiff’s RS at para 52. 17 In this judgment, I refer to the fires as F1 to F6 respectively for ease of reference and to be more precise. A summary of the various fires at the Sorting Yard is set out below: FireDetailsF118:27:18 (18:21:18 CCTV time): F1 breaks out at or near the left track of the excavator, emitting bright flames.18:30:56 (18:24:56 CCTV time): Flames from F1 areextinguishedbut the area is still emitting smoke.F218:32:07 (18:26:07 CCTV time): F2 breaks out near F1’s location.18:32:27 (18:26:27 CCTV time): F2 isextinguishedin about 20 seconds using water from the hose reel.F318:36:22 (18:30:22 CCTV time): F3 breaks out at an area near the excavator. Flames are no longer visible (ie, presumablyextinguished) by about 18:36:30 (18:30:30 CCTV time).38Foot Note 38×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 155 (Fire Investigation Report dated 20 November 2020 at Appendix 88).F418:36:33 (18:30:33 CCTV time): F4 breaks out at the rear section of the Sorting Yard.F5 & F618:37:07 (18:31:07 CCTV time): F5 and F6 ignite from burning waste dropped from the excavator’s claws to the waste pile below it in two areas. 18 From the CCTV footage as summarised above, several of the earlier fires, namely F1 to F3, appear to have been successfully extinguished by the plaintiff’s own firefighting efforts. It is also undisputed that the Plaintiff’s Premises were fitted with a water mist system; this system, when activated, sprays water mist downwards from the ceiling of the Sorting Yard to reduce dust generated from the waste sorting operations. It is not in dispute, and is quite apparent from the CCTV footage, that the plaintiff’s water mist system was activated at the Sorting Yard in the course of the plaintiff’s firefighting efforts as one of the firefighting measures the plaintiff undertook. According to the Fire Investigation Report of the Singapore Civil Defence Force (“SCDF”), the water mist system was activated at about 6:37:11pm.39Foot Note 39×3 AB at pp 1741 at para 7(a)(4)(o).Ms Lim, on the other hand, notes that the water mist system was activated at about 18:34:37. This is, however, not a material difference and none of the issues in the present case turns on precisely what time the water mist system was activated. For purposes of my decision and having reviewed the CCTV recordings, I estimate that the water mist system was activated at about 6.35pm, approximately three minutes before the large explosion referred to at S/No. 22 in the tabulation of key events at [15] above. 19 Mr Cai called the SCDF at about 6.40pm. The first SCDF firefighting unit arrived at the Plaintiff’s Premises some five minutes and 37 seconds after the call. Five fire engines and other rescue vehicles were subsequently dispatched as reinforcement.40Foot Note 40×3 AB at p 1738 at para 6(b)(3).Using water and foam to fight the fire,41Foot Note 41×Day 4 Transcript dated 5 February 2021 at p 7, line 11.the SCDF managed to bring the fire under control at about 10pm. Damping down operations continued until the following morning.42Foot Note 42×Thangarajah Thangamany’s AEIC Exhibit TT–1 at p 13. 20 In its investigations, the SCDF observed burnt “remnants of cylindrical objects among the pile of waste” and similar cylindrical objects “at multiple points across the floor” of the Sorting Yard. Several unaffected light-coloured packages were recovered and submitted to the Forensic Chemistry and Physics Laboratory of the Health Sciences Authority (the “HSA”) for chemical analysis.43Foot Note 43×3 AB at pp 1740, 1771–1773, 1776–1777, 1788–1792 (SCDF Fire Investigation Report dated 25 November 2019 at para 7(a)(1)–(3), Annex F Photos 23–27, 30–32).Photographs of the unaffected light-coloured packages show that the packages were labelled. The labels on those packages indicate that there were at least four types of unfinished and unsealed lithium batteries present at the Plaintiff’s Premises. Photographs of the four differently labelled packages are at Annexures 3 and 4 respectively of this judgment.44Foot Note 44×Lim Chin Chin’s AEIC Exhibit LCC-2 at pp 28–29 (Fire Investigation Report dated 20 November 2020 at para 30).To appreciate the number of light-coloured packages containing the Lithium Batteries that were unloaded from Skip Bin A10 on the day in question, I have reproduced, at Annex 5 of this judgment, two screenshots from the CCTV footage at approximately 6.23pm (from Camera 2) and approximately 6.24pm (from Camera 13). It is not disputed that these light-coloured packages were among the last of the contents unloaded from Skip Bin A10 onto the floor of the Sorting Yard. 21 During the clean-up efforts after the incident, “hundreds of batteries” were found “on the floor at many parts of the Plaintiff’s Premises including the workshop, the weighbridge area and the open area beside the weighbridge”.45Foot Note 45×Cai Jielun’s AEIC at para 54.The plaintiff was required by the authorities to “dispose of the batteries found at the Plaintiff’s Premises” after the fire and requested the defendant to “provide a quotation to dispose of such batteries”, which the defendant did.46Foot Note 46×Cai Jielun’s AEIC at para 56.In an invoice from the defendant dated 15 August 2017 and received by the plaintiff on 21 August 2017, the defendant invoiced the plaintiff a sum of $139.10 for the “DISPOSAL OF SOLID WASTE (WASTE BATTERY)” amounting to “200.00KGS”.47Foot Note 47×Cai Jielun’s AEIC at paras 54–58, p 127 (Defendant’s Tax Invoice No. 00044083 dated 21 August 2017).The defendant did collect the Lithium Batteries from the plaintiff and disposed of them on or about 21 August 2017. According to the defendant, it treated these batteries as used or exhausted batteries which it could collect and dispose of as toxic waste, as opposed to lithium batteries which it was not licenced to collect.48Foot Note 48×Tan Kim Seng’s AEIC at paras 4, 81 and 89. 22 In its report, the SCDF concluded that the “general waste materials usually collected by the company, such as wood, paper and plastics were unlikely to create such effects as the ignition fuel, as they do not support spontaneous combustion”. The fuel for the fire was the “cylindrical objects containing lithium” and there were “no other possible ignition sources at the determined area of fire origin”.49Foot Note 49×3AB at pp 1746–1747 (SCDF Fire Investigation Report dated 25 November 2019 at para 8(b),(d)).The defendant’s expert, Ms Lim (a chemist and forensic scientist), opined that “the unsealed lithium batteries and bare jelly rolls” found at the Sorting Yard posed “significant fire and explosion hazards.”50Foot Note 50×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 33 (Fire Investigation Report dated 20 November 2020 at para 37).Both the plaintiff’s expert, Mr Tan Jin Thong (a former Deputy Commissioner of the SCDF) and Ms Lim, were in agreement that the source of the fires and explosion were the Lithium Batteries.51Foot Note 51×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 64 (Fire Investigation Report dated 20 November 2020 at para 171).However, notwithstanding this agreement, it was a major bone of contention between the parties whether the presence of the Lithium Batteries at the Sorting Yard was,infact and in law, theproximatecauseof the fires and eventual explosion, and in respect of which the defendant should bear legal liability to the plaintiff. I consider all of these issues in greater detail later in this judgment.",
        "The parties’ cases": "23 Briefly summarised, the parties’ respective cases are as follows. 24 The plaintiff claims against the defendant in contract and tort for: (a) damages for the Claim Amount; (b) pre-judgment interest pursuant to s 12 of the Civil Law Act (Cap 43, 1999 Rev Ed) (the “CLA”); and (c) costs. In relation to its claim in contract, the plaintiff pleads that it was an “implied term” of the Agreement” that the defendant would “only dump or allow to be dumped general waste” andnot“any flammable, hazardous, toxic industrial waste and/or waste which was of a dangerous nature” for the plaintiff’s “collection, processing and disposal”. The plaintiff further pleads that the defendant was “aware at all material times” of the same.52Foot Note 52×SOC at paras 4–5.The defendant breached the implied term of the Agreement in dumping or allowing substantial quantities of Lithium Batteries to be dumped into Skip Bin A10, for the plaintiff’s collection, processing and disposal on 7 June 2017 (the “Contract Claim”).53Foot Note 53×SOC at para 11; Plaintiff’s CS at para 14. 25 Further or in the alternative, the plaintiff pleads that the defendant “owed a duty of care to the [p]laintiff to ensure that waste dumped, or allowed to be dumped, by the [d]efendant, its employees, servants and/or agents, for collection, processing and disposal by the [p]laintiff did not contain flammable, hazardous, toxic industrial waste and/or waste which was of a dangerous nature”. The defendant breached its duty of care in dumping or allowing substantial quantities of Lithium Batteries to be dumped into Skip Bin A10, for the plaintiff’s collection, processing and disposal on 7 June 2017 (the “Negligence Claim”).54Foot Note 54×SOC at para 12; Plaintiff’s CS at para 15. 26 The plaintiff avers that the Lithium Batteries were collected from the Defendant’s Premises on 7 June 2017 since the plaintiff’s driver drove the Lorry “on which Skip Bin A10 had been loaded straight from the [Defendant’s] Premises to [the Plaintiff’s] Premises” without making “any stops at any other customer’s premises and did not deviate from the route”.55Foot Note 55×Plaintiff’s CS at para 57.The fires and explosions at the Plaintiff’s Premises were “solely caused or contributed to by the negligence of the [d]efendant”.56Foot Note 56×SOC at para 13. 27 The defendant on the other hand avers that it “could not have and did not pass any batteries to the [p]laintiff for collection, disposal and/or handling” as it “did not generate batteries in the course of its ordinary operations”.57Foot Note 57×Defence at para 8.In any case, before the plaintiff collected the wastes, the defendant’s “workers, employees and/or representatives had manually checked and sorted the wastes and did not find any lithium batteries”.58Foot Note 58×Defence at para 7A.Thus, even if the defendant had collected the Lithium Batteries from its own customers unknowingly, the defendant would have realised so “in the course of sorting the waste and before placing the sorted waste in the [s]kip [b]in deployed at the Defendant’s Premises”.59Foot Note 59×Defendant’s CS at para 49.Further or alternatively, the defendants avers that the plaintiff had at the material time “agreed and/or arranged to collect flammable and/or hazardous wastes (potentially including batteries) from YTL PowerSeraya Pte Ltd (“PowerSeraya”) and that the batteries … could have been collected from PowerSeraya or other customers of the [p]laintiff”.60Foot Note 60×Defence at para 8B. 28 The defendant denies that there was an implied term under the Agreement61Foot Note 61×Defence at para 9; Defendant’s CS at pp 33–34.or that it owed the plaintiff a duty of care to ensure that the wastes in Skip Bin A10 “did not contain flammable, hazardous, toxic industrial waste and/or waste which was of a dangerous nature”. This is because the defendant had specifically made a request for the plaintiff to sort, segregate and remove any toxic and/or hazardous wastes or any other wastes that are not considered general wastes (“Prohibited Wastes”) from the defendant’s wastes before disposing the wastes at NEA’s incineration plant. The plaintiff hence “knew or ought to have known that the [d]efendant’s [w]astes it collected on 7 June 2017 may contain … toxic and hazardous wastes”.62Foot Note 62×Defence at paras 4AA, 9A. 29 The defendant refutes any liability63Foot Note 63×Defence at para 10.and submits that even if the defendant was found liable, the plaintiff contributed to the fires and explosions by,inter alia, utilising improper firefighting techniques and belatedly activating the SCDF.64Foot Note 64×Defendant’s CS at paras 254, 266–267. 30 In response, the plaintiff avers that parties had “never agreed” for the plaintiff to sort, segregate and remove any Prohibited Wastes from the defendant’s waste. The plaintiff assumed that the “wastes collected from the Defendant’s Premises only contained general wastes”,65Foot Note 65×Reply at paras 2C–2D.especially since the defendant “knew at all material times that the Plaintiff did not have the necessary licence and/or authori[s]ation to collect hazardous and/or toxic industrial wastes”.66Foot Note 66×Reply at para 4DB.Instead, the plaintiff would, after collecting the general wastes from the Defendant’s Premises, “usually assess if there are bulky items to be segregated from the wastes collected”. Such bulky wastes, which are non-incinerable, could not be “disposed of at the [NEA] incineration plant” and hence the general waste had to be brought back to the Plaintiff’s Premises for segregation “before disposing the rest of the general wastes at the incineration plant”.67Foot Note 67×Reply at para 2C. 31 The plaintiff also avers that both parties had, in or around November 2016, “collaborated to enable the [p]laintiff to submit a quotation to [PowerSeraya] for the collection of general and toxic wastes”. In particular, the defendant would “handle the collection of toxic industrial wastes” while the plaintiff would “handle the collection of general wastes”.68Foot Note 68×Reply at para 4D.",
        "Issues to be determined": "32 The foregoing summary demonstrates that parties dispute two material facts which are crucial to the context of the present dispute: the scope of the Agreement and the defendant’s request to sort and segregate its wastes (“Issue 1”). Under Issue 1, the first sub-issue to be determined is the scope of the Agreement in relation to thetypeof waste to be collected by the plaintiff from the defendant (ie, whether general wasteonlyor general wastemixedwith toxic industrial waste and/or hazardous substances (“Mixed Waste”)). The first sub-issue is also closely interrelated with the second sub-issue, which concerns the scope of the defendant’s request to sort and segregate its wastes (the “Segregation Request”). While the defendant avers that the Segregation Request relates to the segregation of the defendant’s generalwastes from Mixed Waste, the plaintiff avers that the Segregation Request relates only to the segregation of the defendant’s incinerable general waste from non-incinerable general waste (comprising bulky items). 33 After Issue 1 is determined, there are three other broad issues for my determination as regards the defendant’s liability: (a) whether it was an implied term of the Agreement that the defendant would only dump or allow to be dumped general waste and not any Prohibited Wastes, for the plaintiff’s collection, processing (if necessary) and disposal and, if so, whether the defendant breached such a term (“Issue 2”); (b) if Issue 2 is answered in the negative, whether the defendant nevertheless owed the plaintiff a duty of care to only dump or allow to be dumped general waste and not any Prohibited Wastes, for the plaintiff’s collection, processing and disposal and, if so, whether the defendant breached its duty of care and caused the plaintiff damage (“Issue 3”); and (c) if Issue 3 is answered in the affirmative, whether the plaintiff was contributorily negligent for the damage it suffered (“Issue 4”).",
        "Issue 1: scope of the Agreement and the Segregation Request": "34 I shall consider the scope of the Agreement and the Segregation Request together as they are (a) closely interrelated and (b) key to unravelling the remaining issues. For example, if the scope of the Agreement is limited to the plaintiff’s collection, processing, and disposal ofonlygeneral waste disposed by the defendant, then it necessarily couldnothave been for the plaintiff to simultaneously collect, process, and dispose of the defendant’s Mixed Waste. In the same vein, it cannot be that the defendant’s Segregation Request would be for the plaintiff to segregate general wastes from Mixed Waste. The converse would also be true. For example, if the scope of the defendant’s Segregation Request encompassed the segregation of general waste from Mixed Waste, then the scope of the parties’ Agreement necessarily couldnothave been limited to the collection, processing, and disposing ofonlygeneral waste. 35 The plaintiff argues that the Agreement was, at all material times, for the plaintiff to “provide services to [the defendant] for the collection, processing (if necessary) and disposal ofgeneralwaste from [the Defendant’s] Premises” [emphasis in original] and that the defendant was aware that it “could only dump or allow to be dumped general waste and not any flammable, hazardous, toxic industrial waste and/or waste which was of a dangerous nature for [the plaintiff’s] collection, processing and disposal”.69Foot Note 69×Plaintiff’s CS at para 20.According to Mr Cai, if there were “any bulky items in the skip bins that needed to be segregated / processed”, the plaintiff would charge its customer “an additional handling fee” and the plaintiff’s “administrative staff would usually indicate on the collection slip that handling fees are payable and would include the handling fee when invoicing its customers”.70Foot Note 70×Cai Jielun’s AEIC at para 18; Plaintiff’s CS at para 22.Mr Cai also maintained the same at trial71Foot Note 71×Day 1 Transcript dated 2 February 2021 at p 74, line 25 and p 75, line 7.and rejected the suggestion that the handling fee was for the purposes of sorting the defendant’s general waste from Mixed Waste.72Foot Note 72×Day 1 Transcript dated 2 February 2021 at p 135, line 25. 36 Mr Cai’s evidence is also supported by that of Mr Lee Cheng Wah. According to Mr Lee Cheng Wah, the Agreement was for the plaintiff to “collect, process (if necessary) and dispose of general wastes collected from time to time from as and when such services were required by the [d]efendant in consideration of payment by the [d]efendant for the [p]laintiff’s services”.73Foot Note 73×Lee Cheng Wah’s AEIC at para 13.Furthermore, it was “never agreed” that the defendant “would make any request to the [p]laintiff for the [p]laintiff to sort, segregate and remove any [hazardous, toxic industrial waste and/or wastes which are of a dangerous nature] from the general wastes collected by the [p]laintiff from the [d]efendant’s premises”. He would “have never agreed” to collect Mixed Waste as the plaintiff is “only licensed to collect Classes A and B general wastes”.74Foot Note 74×Lee Cheng Wah’s AEIC at para 18.At trial, he also confirmed that “[t]he handling sorting [fee] is $150” and is charged “if there is a need to sort bulky waste”.75Foot Note 75×Day 3 Transcript dated 4 February 2021 at p 11, lines 5 and 10–11. 37 The defendant argues that a sorting request for the plaintiff to “sort, segregate and remove the Prohibited Wastes from the [d]efendant’s [w]astes before disposing and/or incinerating the same” would be made “when the [d]efendant’s [w]astes may contain Prohibited Waste[s]” or when the defendant was “unsure as to whether the [d]efendant’s [w]astes contained Prohibited Wastes”. The defendant pleads that this is simply because the defendant “did not have sufficient and/or adequate space and/or facility and/or equipment at the Defendant’s Premises to carry out a thorough sorting and/or segregation of the [d]efendant’s [w]astes”. The plaintiff would thereafter “return and/or sendto the [d]efendantthe Prohibited Wastes which it had removed” which the plaintiff was “unable to dispose of and/or handle” [emphasis added].76Foot Note 76×Defence at para 4AA; Defendant’s CS at paras 92–93.A fixed fee of $150 was payable to the plaintiff in consideration for such request.77Foot Note 77×Defendant’s Opening Statement at para 17.For example, according to Mr Tan Kim Seng, certain parts of a refrigerator may contain Prohibited Wastes (ie, the coolant). Instead of “dismantling the fridge itself, [the defendant] would request [the plaintiff] to … sort, segregate and remove” such Prohibited Wastes from the defendant’s Mixed Waste.78Foot Note 78×Tan Kim Seng’s AEIC at para 44.",
        "My analysis and decision": "219 The defendant’s second and third arguments at [209]–[210] have been mentioned briefly at [165] in relation to the issue of causation. While I have found those reasons insufficient to constitute anovus actus interveniens, it is worth addressing, for completeness, the more pertinent points in relation to the issue of contributory negligence. 220 In my judgment, considering the circumstances of this case and the exigency the plaintiff was thrust into on the day in question, the plaintiff cannot be said to have been contributorily negligent in any respect. On the contrary, I find that: (a) the plaintiff took reasonable steps in installing a fire safety system appropriate for its business operations, and which included water hose reels and fire extinguishers and (b) it was not unreasonable for the plaintiff to use the means available to it to fight the fires, including its use of the water mist system and the excavator.  Insofar as any perceived lack of protocols for the segregation of general waste or a risk assessment in respect of such segregation process are concerned, even if these were lacking, I disagree that it amounted to contributory negligence, particularly having regard to the nature of the plaintiff’s business. Given that the plaintiff handles only general waste, the plaintiff could not have reasonably foreseen that it would be at risk of handling substantial quantities of Lithium Batteries as part of its usual business operations. Therefore, even if the plaintiff were to review its protocols for waste segregation and conducting risk assessments, there would be no reason to mitigate the risks of metal fires, whether generally or specifically in relation to lithium metal fires. As such, the alleged lack of protocols or revised risk assessments had no causative potency in assessing blameworthiness of the plaintiff’s conduct. 221 I address each of the points in greater detail below. The plaintiff’s failure to provide for Class D fire extinguishers 222 I am unpersuaded by the argument that the plaintiff should have provided for a specific subtype of Class D fire extinguishers suitable for fighting lithium metal fires at the Plaintiff’s Premises. While the reasonable man is prudent, and takes care in looking after his own safety so as to prevent hurt to himself, the reasonable man is also not paranoid as to seek to pre-empt and safeguard against every conceivabletypeof fire  (including lithium metal fires) when he is in the business of collecting, sorting and disposing of only general waste. In my view, the defendant’s argument again ignores context. In my judgment, the plaintiff had done enough to mitigate against the foreseeable risks of fire by installing a fire safety system and firefighting equipmentcommensurateto thereasonablyforeseeablefire risks initsbusiness operations.  The fact that the SCDF issued the plaintiff a Fire Safety Certificate provides some evidence of the adequacy of the firefighting equipment installed at the Plaintiff’s Premises for its business activities. I also noted that in the SCDF investigation report, there was no suggestion that the available firefighting equipment at the Plaintiff’s Premises was in any way deficient or inadequate. 223 The factual circumstances in the present case are different to those inSato KogyoorUnion Camp Chemicals, and they do not therefore assist the defendant. Both cases are merely illustrative that undersomecircumstances anddepending on the facts, the failure to install a suitable fire safety system to mitigate the foreseeable risks of fire associated with a party’s business can,on the facts of the case concerned, amount to contributory negligence. The crucial distinction between the cases by the defendant and the present case is that the plaintiffcould not, as I found above at [186], have reasonably foreseen that the contents of Skip Bin A10 would have contained substantial quantities of the Lithium Batteries. In contrast, the plaintiffs inSato Kogyo, for example,“would have known that such [infra-red thermal imaging work] would generate high heat and therefore there may be a risk of fire” (at [80]). 224 Lastly, I reject the argument that the alleged breach by the plaintiff of its own Emergency Response Plan constitutes contributory negligence. There is, firstly, a disjunction between the fact that the plaintiff’s workers did not identify the type of fire and the conclusion that such failure constitutes contributory negligence. I re-emphasise that any assessment by the court as to whether an act or omission constitutes contributory negligence is intensively fact sensitive. I agree with the plaintiff that lay persons working as waste sorters in a general waste collection facility cannot reasonably be expected to be familiar with chemistry and reactive metals which are defined as toxic industrial or hazardous waste, much less be able to appreciate,in an emergency, the differences between an “orangey” flame and a “crimson” to “dazzling white” flame.  This is in contrast to a trained expert chemist analysing the events of the day and actions takenex post facto. In this regard, it is important to keep in mind that the chain of events, from the start of F1 at approximately 6.27pm, snowballed fairly quickly to the large explosion occurring at 6.38pm, merely 11 minutes later. If one considers the time lapse between F4 starting and the explosion occurring,less than2 minutes elapsed. This is not a case where the plaintiff’s employees had the luxury of time to investigate or assess the type of fire involved or should have been put on notice because of the unusual colour of the flames. I therefore disagree that there was a breach by the plaintiff of its Emergency Response Plan, or any breach of it that, causatively or in a blameworthy way, would amount to contributory negligence. 225 Lastly, even if one of the workers had correctly identified the type of fire as a lithium metal fire, it would not have been possible for the plaintiff to fight the fire with a specific Class D subtype fire extinguisher designed for such fires, such as a Lith-X fire extinguisher, simply because the plaintiff would not reasonably be expected to have such specialised extinguishers at the Plaintiff’s Premises in the first place. The plaintiff’s inappropriate firefighting methods 226 In my judgment, the plaintiff was not contributorily negligent in its firefighting methods, whether in using (a) Class ABC and/or carbon dioxide fire extinguishers and water (ie, from fire hose reels and its water mist system) and/or (b) an excavator to try to isolate the fire from other wastes in the Sorting Yard. 227 As stated at [202]–[203], a party’s conduct is to be assessed atthatmaterial time when the exigency is extant and not judged with the benefit of hindsight. When F1 ignited, the plaintiff’s workers at the Sorting Yard were faced with an emergency and had to take action to contain the fire. Such emergency arose as a result of the defendant’s negligence.  I therefore reject the defendant’s submission that the context of the fire being an “emergency situation” has “very little merit (if any)” simply because the plaintiff’s response was “not in compliance with [its own Emergency Response Plan]”.257Foot Note 257×Defendant’s RS at para 93. 228 The defendant’s argument is somewhat circular. I disagree that simply because the plaintiff hadanEmergency Response Plan, its failure to comply with itipso factodisentitles the plaintiff from relying on the agony of the moment principle with regard to its firefighting efforts. The argument also ignores context. An Emergency Response Plan cannot be expected to cater toeveryconceivable emergency – thus, in this case, if a lithium metal fire was not areasonably expectedemergency as far as the plaintiff and its business activities are concerned, thena fortiori, one wouldnotreasonably expect it to be covered by the plaintiff’s Emergency Response Plan; anda fortiori, the agony of the moment principlewouldcome into play. 229 I accept that the plaintiff’s use of water the fire extinguishers available to it in the firefighting process was not unreasonable in the circumstances. First, and related to my finding at [224], the plaintiff’s workers could not have reasonably suspected that the fire was a metal fire even if its colour was “crimson” to “dazzling white” as opposed to “orangey”. The plaintiff’s workers also could not be reasonably expected to know that water and Class ABC and/or carbon dioxide fire extinguishers are unsuitable for thespecificfires at the Sorting Yard on 7 June 2017; more so, when the firefighting methods and media used by the plaintiff’s workers to fight fires F1 and F2weresuccessfulin extinguishing them. 230 Secondly, even the expert evidence was divided on whether water and the use of an excavator were unreasonable firefighting methods. Mr Tan Jin Thong’s evidence on firefighting is that water is a “conventional way to fight lithium battery fires” as it produces a “cooling effect” which can “extinguish the waste fire and cool down the heat so as to prevent rekindling of the fire”.258Foot Note 258×Day 7 Transcript dated 25 February 2021 at p 10, lines 16–24.His evidence is also that an excavator is “the best and most effective way [of] isolating fire”.259Foot Note 259×Day 8 Transcript dated 26 February 2021 at p 6, lines 3–5.According to him, “it is not wrong” to use an extinguishing medium which has a “cooling effect” since it removes heat, which is one of the points of the “triangle of combustion”260Foot Note 260×Day 7 Transcript dated 25 February 2021 at p 138, lines 21–25.(the other two being oxygen and fuel261Foot Note 261×Day 8 Transcript dated 26 February 2021 at p 177, line 23 to p 178, line 3.). The SCDF likewise used “water and foam” in its firefighting efforts at the Plaintiff’s Premises.262Foot Note 262×Day 4 Transcript dated 5 February 2021 at p 7, line 11. 231 Ms Lim’s evidence is that lithium is a “very reactive alkaline metal” such that, if lithium metal is exposed to the environment, “the moisture in the environment is going to cause it to catch fire”. It “will also react with oxygen … carbon dioxide … [and] nitrogen that is in the air”.263Foot Note 263×Day 7 Transcript dated 25 February 2021 at p 94, lines 4–19.In her expert opinion, “water aggravated [the fire]”.264Foot Note 264×Day 7 Transcript dated 25 February 2021 at p 216, lines 1–2.She was of the view that water may be used only “if it is a very small amount of lithium batteries” and a large volume of water was used so as to “flood it”.265Foot Note 265×Day 7 Transcript dated 25 February 2021 at p 23, lines 7–12. 232 In my view, when faced with sudden and persistent fires, it is not unreasonable or negligent conduct if a party uses whatever fire extinguishing media or equipment that is immediately available to it so as to reduce heat and/or to isolate a fire so as to starve it of fuel, as was the case here. This isnotto say that I find the plaintiff’s response reasonableonlybecausethe SCDF had acted in a like manner (ie, in using water jets) or may have acted in a like manner (eg, in using an excavator to isolate the fire). As the defendant highlights, the plaintiff’s workers may not necessarily be trained in using an excavator for the purposes of firefighting266Foot Note 266×Defendant’s CS at para 262.and the volume and pressure of water used by the SCDF is “significantly greater” than that used by the plaintiff.267Foot Note 267×Defendant’s CS at para 260; Defendant’s RS at para 94.Nevertheless, the more important question is – should the plaintiff  be blamed for resorting to water, Class ABC and/or carbon dioxide fire extinguishers, its water mist system and an excavator to fight the fires (the nature of which was not reasonably known at the time)in the heat of the moment(no pun intended)?  I have no hesitation that the answer to that question is “No”. 233 At least with regard to F1 to F3, the plaintiff’s workers would have reasonably formed the view that the firefighting methods and media that they had utilisedwere effectivein containing those fires. F3 was put out with the use of a rake to rake over the package that caught fire, but the point remains that at least from 6.27pm when F1 started to about 6.30pm when F3 had been put out, there was no indication that the plaintiff’s firefighting efforts were ineffective. 234 I am also not persuaded that the plaintiff was contributorily negligent in failing to alert the SCDF earlierie, “upon the discovery of” the Lithium Batteries by the plaintiff’s workers. First, it is not clear to me, from a review of the CCTV footage that it can be categorically said that at approximately 6.29pm, one of the plaintiff’s workers picked up one of the packagesandchecked its contents. Based on the CCTV footage, it shows one of the workers picking up one of the packages, placing it back down on the floor and then picking up another. However, it is not entirely clear from the CCTV footage that the packageswereopened or that the contents were in fact checked. Nevertheless, even if the plaintiff’s workers did check and noticed that the light-coloured packages contained numerous batteries, such discovery does not mean that it was unreasonable, from that moment onwards, for the plaintiff to continue its firefighting efforts or that the SCDF should have been alerted then while the plaintiff continued its attempts to control the fire. As I have already discussed above, it is undisputed that both F1 and F2 were successfully extinguished. Nor could it be said that F3 was an “uncontrollable fire” and it too appeared to have been successfully put out. In my view, in those prevailing circumstances on the ground at the material time, it wasnotunreasonable for the plaintiff to continue containing the further fires without alerting the SCDF then and the plaintiff should not be blamedex post factowith the benefit of hindsight. In this regard, I could not accept Ms Lim’s opinion as it sought to slice and dice the plaintiff’s actions with too fine a knife and when viewed with the benefit of hindsight. 235  Even if the plaintiff ought to have called the SCDF earlier, in my view, it should have been no earlier than when F4 broke out at approximately 6.36pm (actual time). I agree with the plaintiff that it would not have made much difference, if any, in mitigating the plaintiff’s damage. Even if an employee alerted the SCDF as soon as F4 started at approximately 6.36pm, the SCDF would have only arrived at the scene at about 6.41pm (ie, about five minutes after the call), which would bewellafterthe large explosion had occurred at approximately 6.38pm. It would likewise make no material difference to the damage sustained by the plaintiff as a result of the fires and explosion on 7 June 2017, whether the call to SCDF was made immediately after the large explosion instead of some four minutes later. 236 Finally, even if I did accept the defendant’s case that water and Class ABC and/carbon dioxide fire extinguishers are inappropriate fire extinguishing media for lithium metal fires, and that the use of the excavator caused burning materials to drop from the claws of the excavator and ignite additional fires, they would at best suggest that the plaintiff’s firefighting methods were, in hindsight, a “less than optimum solution”. Even if so, this is not enough for me to find that the plaintiff responded in an unreasonable and blameworthy manner. The plaintiff’s lack of protocol for segregating waste and risk assessments in relation to such segregation 237 In the absence of evidence to the contrary, I am prepared to assume that it is more likely than not that the plaintiff “failed to incorporate” (in its Hazard Identification Document) principles pertaining to hazard identification, risk evaluation, and risk controls as the defendant contends (at [210]).  However, that does not advance the defendant’s case very much. I do not consider that any such failure bore any relevant or causative link to the occurrence of the fires and the explosion. Nor does it necessarily follow that the plaintiff was therefore careless in looking after its own safety. 238 On the facts, I am satisfied that the actionsactuallytaken on the day by the plaintiff’s workers could not be faulted. Thus, any failure on the plaintiff’s part to have in place a compliant Hazard Identification Document, even if proven, was strictly irrelevant and bore no causal relation to whether the plaintiff was guilty of contributory negligence. 239 For all of the reasons set out in this section of my judgment, I conclude that there wasno contributory negligenceon the part of the plaintiff. As such, the question of apportionment of liability does not arise and the plaintiff is entitled to its damages claim in full.",
        "Issue 2: the Contract Claim": "80 The plaintiff pleads that the defendant breached animpliedterm of the Agreement that the defendant would “only dump or allow to be dumped general waste” for the plaintiff’s collection, processing and disposal.135Foot Note 135×Statement of Claim at para 4.The plaintiff did not properly address or expand on this point in its closing submissions. The plaintiff merely submitted that the “facts” which establish the defendant’s breach of duty of care to the plaintiff likewise establish that the defendant “has breached its contract” with the plaintiff.136Foot Note 136×Plaintiff’s CS at para 102. 81 The defendant submits that the term which the plaintiff seeks to imply into the Agreement would not pass the three requirements necessary for implying a term in fact as set out by the Court of Appeal inSembcorp Marine Ltd v PPL Holdings Pte Ltdand another and another appeal[2013] 4 SLR 193 (“Semcborp”) (ie, that there is a “true gap” at [94(a)] and [101(a)], the alleged term satisfies the business efficacy test and the officious bystander test at [101(b)–(c)]).137Foot Note 137×Defendant’s CS at paras 116–119. 82 InSembcorp, the Court of Appeal explained that “not all gaps in a contract are “true” gaps in the sense that they can be remedied by the implication of a term” and in that respect, there are at least three ways in which a gap could arise (at [94]): (a) the parties did not contemplate the issue at all and so left a gap; (b) the parties contemplated the issue but chose not to provide a term for it because they mistakenly thought that the express terms of the contract had adequately addressed it; and (c) the parties contemplated the issue but chose not to provide any term for it because they could not agree on a solution. However, it isonlyin scenario (a) where it would be “appropriate for the court to even consider if it will imply a term into the parties’ contract” (at [95]). It would not be appropriate to imply a term in scenario (b), as that would effectively amount to seeking thecorrectionof amistaken beliefthat the agreement already accurately records the transaction between parties (at [96]). Nor would it be appropriate to imply a term in scenario (c), as parties in that scenario had “actually considered the gap but were unable to agree and therefore left the gap as it was” (at [95]). 83 In the present case, neither party adduced any evidence to show that, at the time of contracting in about 2004, both parties (namely, the plaintiff’s Mr Lee Cheng Wah and the defendant’s Mr Tan Kim Seng)did notcontemplateat allthe issue of whether the plaintiff would collect the defendant’s general waste only or the defendant’s Mixed Wastes, sort and segregate the Prohibited Wastes, and thereafter return such Prohibited Wastes to the defendant for disposal. Neither Mr Lee Cheng Wah nor Mr Tan Kim Seng, the two individuals who orally concluded the Agreement, gave any evidence demonstrating thatneither of themhad considered the issue at all. Given the complete lack of evidence before me on this critical point, I hesitate to make a finding that, on the balance of probabilities, neither party hadin factconsidered the scope of the Agreement and the Segregation Request at the time of contracting and that therefore a “true gap” existed. I thus have to agree with the defendant’s submission that the plaintiff has failed to demonstrate the existence of a “true gap” in the Agreement. As such, the term contended for by the plaintiffcannotbe impliedin fact. Furthermore, the plaintiff also does not make any submissions as to why the alleged term passes both the business efficacy test and the officious bystander test, which remains the applicable test in Singapore (Foo JongPeng and others v Phua Kiah Mai and another[2012] 4 SLR 1267 at [36]). 84 The plaintiff submits, briefly, in reply that “it is implicit from the policy considerations” and thepresentcircumstances, including the defendant’s knowledge that the plaintiff is licenced to collect only Class A and Class B general waste, that it is “appropriate” to imply the term alleged by the plaintiff.138Foot Note 138×Plaintiff’s RS at paras 42–43.The plaintiff thus seems to hint that the alleged term is an “implied term in law” (and citesChua Choon Cheng and others v Allgreen Properties Ltd and another appeal[2009] 3 SLR 724 (“Chua Choon Cheng”) at [68]–[69] in support). However, the plaintiff’s argument which focuses on the unique circumstances of thepresent caseas between the plaintiff and the defendant is more relevant for an implied termin fact, rather than a term implied in law; the plaintiff’s submissions seemed to conflate the two concepts. As the Court of Appeal inChua Choon Chengemphasised at [69], a term implied in law “will be implied in all contracts of a defined type, unless it is contrary to the express words of the agreement” and hence “such a term extends and applies to all future like cases”, which is quite unlike a term implied in fact. For that reason, the threshold to be satisfied before a term is implied in law is a high one and the court “should ordinarily exercise considerable restraint”. I do not think that the plaintiff has satisfied that high threshold and hence I decline to imply the term in law. 85 As the plaintiff has failed to establish that there is a case to imply a term in the Agreement in fact or in law, the effect is that its Contract Claim is not made out. The defendant is thus not liable for the breach of any implied term as the plaintiff contends. However, this is not the end of the matter and I proceed now to consider the next issue – whether the defendant is liable under the Negligence Claim.",
        "Issue 3: the Negligence Claim": "86 In the present case, the defendant disputes that: (a) the defendant owes the plaintiff a duty of care; (b) the defendant (by its acts and/or omissions) breached that duty of care and fell below the standard of care required of it; and (c) the defendant’s breach caused the plaintiff damage. I address each of these in turn. As mentioned at [3], the defendant does not dispute the quantum of the damage suffered by the plaintiff.",
        "Duty of care": "The applicable legal principles 87 The Court of Appeal inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”) set out the two-stage test applicable to determine whether a defendant owes a claimant a duty of care. The two-stage test is preceded by the threshold requirement offactualforeseeability such that the defendant ought to have foreseen that the claimant would suffer damage due to the defendant’s carelessness (Spandeckat [75]–[76]). At the first stage, the court considers whether there is sufficientlegalproximity between the plaintiff and the defendant. The focus of the inquiry at this stage is theclosenessof therelationshipbetween the parties which includes physical, circumstantial, and causal proximity, supported by the twin criteria of voluntary assumption of responsibility and reliance (Spandeckat [77] and [81]). 88 If the answers to the threshold requirement and first stage are both affirmative, aprima facieduty of care arises and the court then moves to the second stage of the analysis. At the second stage, the court considers whether any policy considerations applicable to the factual matrix negate thatprima facieduty of care such as, for example, a “contractual matrix which has clearly defined the rights and liabilities of the parties” (Spandeckat [83]). Thus, a duty of care is imposed on the defendant only if theprima facieduty of care is not negated by applicable policy considerations to the factual matrix of this case. 89 With these principles in mind, I turn now to consider the facts of the present case. Threshold requirement of factual foreseeability 90 In my judgment, the threshold requirement is clearly satisfied in the circumstances of the present case. I agree with the plaintiff’s submission that the defendant knew that the plaintiff would suffer damage in the event of carelessness by the defendant in discarding Prohibited Wastes in the general waste bin deployed by the plaintiff at the Defendant’s Premises.139Foot Note 139×Plaintiff’s CS at paras 81–82.This is especially so in this particular case, where such Prohibited Wastes included strictly regulated toxic industrial waste and/or hazardous substances. In addition, the defendant (itselfa company in the waste collection business) was in fact aware, at all material times, that the plaintiff lacked the necessary licence to collect, transport or otherwise deal with such toxic or hazardous substances. 91 The defendant made no submissions which specifically addressed the threshold requirement of factual foreseeability. In any case, the defendant does not dispute that the Lithium Batteries are toxic industrial waste and/or hazardous substances which would not be considered general waste. This is therefore sufficient to dispose of the threshold element of factual foreseeability. As noted by the Court of Appeal, in order for factual foreseeability to arise, it only requires that the “defendant ought to have known that the claimant would suffer damage from his (the defendant’s) carelessness”; this is so broad a definition that it realistically “would be fulfilled in almost all cases, because the two parties are likely to be in some degree of physical relationship” (Spandeckat [75]). Nevertheless, I make some further comments for completeness and to address some further arguments raised by the parties. 92 The plaintiff highlights that Mr Marcus Tan accepted that the defendant, as the party throwing waste into the skip bin for the plaintiff’s collection, processing (if necessary) and disposal, has a duty to ensure that the waste therein would not include significant fire and explosion hazards. The plaintiff submits that this admission by Mr Marcus Tan demonstrates that the defendant “must have foreseen the potential danger that could arise from a failure to check the bins and the waste dumped inside them”.140Foot Note 140×Plaintiff’s CS at paras 82–83. 93 However, the defendant contends that the plaintiff “should have known that the waste it collects may contain items which pose a fire hazard when crushed”. The defendant highlights that the plaintiff accepts that somegeneral wastesuch as mobile phones, laptops, computers and gas canisters are considered flammable. Some “electrical appliances”, which fall within Class A general waste under the Regulations on General Waste Collection, may thus contain “[l]ithium batteries or [l]ithium components”.141Foot Note 141×Defendant’s CS at paras 221–224. 94 I am not convinced by either party’s submissions as they are, to differing degrees, made without placing them within the context of the facts in this case. In my judgment, thepertinentcharacteristic about the Lithium Batteries is not just that they are flammable. Indeed, it is not disputed that other general wastes such as tree trunks and branches may also be flammable in any case. Nor is it to the point that mobile phones, laptops or other electrical appliances may be found discarded in a general waste bin with other general waste; such arguments miss the forest for the trees and are devoid of context. 95 In my view, bearing in mind all of the surrounding circumstances of this case such as the parties’ respective NEA licences, the scope of the Agreement and thenature and quantityof the Lithium Batteries found, the more pertinent characteristic in this case is thatthe Lithium Batteriesspecificallyarenotconsidered general waste by any definition, and this is common ground between the parties. It is therefore sufficient that the defendant ought to have known that the plaintiff would suffer some damagein general(as opposed to the specifickindof damage suffered) (Spandeckat [89]) if the defendant’s carelessness resulted inthe Lithium Batteries(and in that quantity) finding their way into Skip Bin A10. In this case, the plaintiff happened to have suffered significantpropertydamage as a result of the fires and explosion, though the actual damage suffered could have been of some other kind or by some other means as well. 96 I do not think that a reasonable parallel may be drawn between the Lithium Batteries and electrical appliances or devices containing lithium components. In my view, such a parallel seeks to compare chalk with cheese. Unlike the occasional electrical appliance or device, such as “a mini-fridge and printer” that Mr Tan Kim Seng had in mind when he made the Segregation Request to Mr Lee Cheng Wah on 7 June 2017 (as mentioned earlier at [77]), or a washing machine as was observed by Ms Lim from the CCTV footage, or the occasional discarded handphone or laptop, “substantial quantities” of the Lithium Batteries were found to be the cause of the fires and explosion in this case. It is one thing to allege that, for example, a mini-refrigerator dumped with general waste may contain coolant which in turn is considered a toxic waste or hazardous substance but quite another to analogise that example with approximately 200 kilograms of unsealed or unfinished lithium batteries in opaque bags. Legal proximity and policy considerations 97 Given my conclusion on the scope of the Agreement and the Segregation Request (at [75]), I am also satisfied that there is sufficient legal proximity (in the physical, circumstantial, and causal sense) between the parties given that the contractual arrangement between the parties was for the plaintiff to collect, process (if necessary) and dispose of the defendant’s general waste in the skip bin deployed by the plaintiff at the Defendant’s Premises. 98 The plaintiff highlights that the defendant was “aware at all material times that it could only dump or allow to be dumped general waste” and that the arrangement between the parties (ie, where the skip bin was in the defendant’s “custody and control”) meant that the plaintiff relied on the defendant to ensure that the skip bin contained only general waste.142Foot Note 142×Plaintiff’s CS at paras 86–87.Additionally, (as briefly discussed at [92]), Mr Marcus Tan testified that the defendant, as the party throwing waste into the skip bin, owed the plaintiff a duty to ensure that the defendant’s waste is free from waste which could pose significant fire and explosion hazards.143Foot Note 143×Day 6 Transcript dated 10 February 2021 at p 54, lines 24–25; p 55, lines 1–5.Coupled with the fact that the defendant’s Waste Sorting Procedure (see [66]) provided that general wasteis to be “dumped via a forklift into the general waste bin” aftersorting, I agree with the plaintiff and find that the defendant voluntarily assumed responsibility to ensure that the waste in the skip bin consistedonlyofgeneral waste.144Foot Note 144×Plaintiff’s CS at paras 88–89. 99 I am also satisfied that there are no policy considerations in this case that would negate theprima facieduty of care. I agree with the plaintiff that the “fact that there are regulations in respect of toxic and/or hazardous waste indicates strongly that there can be no policy reasons to negate the imposition of a duty of care”.145Foot Note 145×Plaintiff’s CS at para 90. 100 Before I end this section and for completeness, the Court of Appeal specifically indicated that the “presence of a contractual matrix which has clearly defined the rights and liabilities of the parties” may be a relevant policy consideration which negates theprima facieduty of care in some cases (Spandeckat [83]). While the parties’ relationship in the present case is ultimately a contractual one, I do not think that the Agreement in this case so clearly defines each party’s rights and liabilities to the extent that it negates aprima facieduty of care. In its submissions, the defendant does not seriously contend that the three requirements (ie, factual foreseeability, legal proximity, and absence of any policy considerations negating theprima facieduty of care) are not satisfied in this case. Instead, the defendant argues, more generally, that given its position on the scope of the Agreement and the Segregation Request,146Foot Note 146×Defendant’s CS at paras 97–114.“it must follow that the Defendant was under no duty to ensure that the Defendant's Wastes which it passed to the Plaintiff did not contain any Prohibited Wastes when a [Segregation Request] was made”.147Foot Note 147×Defendant’s CS at para 89.I have already explained my reasons for disagreeing with the defendant’s position on Issue 1 and I reiterate them here. For those reasons, I likewise disagree with the defendant’s arguments on why it does not owe the plaintiff a duty of care. 101 The more contentious issues in this case relate to the defendant’s breach of duty and causation, and it is to those issues that I now turn my attention.",
        "Breach of duty of care": "Standard of care (1) The applicable legal principles 102 The standard of care is theobjectivestandard of a reasonable person using ordinary care and skill. As stated inBlyth v The Company of Proprietors of The Birmingham Waterworks(1856) 11 Exch 781 at 784: Negligence is the omission to do something which a reasonable man, guided upon those considerations which ordinarily regulate the conduct of human affairs, would do; or doing something which a prudent and reasonable man would not do. 103 The reasonable person’s conduct, in turn, depends on certain factors which are relevant to the particular circumstances of the particular case such as the likelihood and risks of harm, the extent of harm, costs of avoiding harm, and the industry standards and common practice (Management Corporation Strata Title Plan No 2668 v Rott George Hugo[2013] 3 SLR 787 at [27], citing Gary Chan Kok Yew & Lee Pey Woan inThe Law of Torts in Singapore(Academy Publishing, 2011) (“Gary Chan”) at ch 5). 104 InThe “Sunrise Crane”[2004] 4 SLR(R) 715, the Court of Appeal found a duty of care where an ocean transporter of highly corrosive nitric acid, when transferring a cargo of nitric acid contaminated with hydraulic oil to a second vessel, failed to inform the crew of the second vessel of the nature of the cargo. In that case, the appellant was in the business of transporting dangerous goods while the respondent was not (at [28]). That second vessel suffered physical damage as a result of the nitric acid since the second vessel’s cargo tanks were made of mild steel and thus incapable of carrying nitric acid. WhileThe “Sunrise Crane”is not on all fours with the present case and must be read in light ofSpandeck, the Court of Appeal’s remarks at [25] on the standard of care in cases involving dangerous materials are pertinent and relevant: It is obvious that the law expects a person who carries a pound of dynamite to exercise more care than if he is only carrying a pound of butter, or putting it another way, to exercise more care with a bottle of poison than a bottle of lemonade: seeBeckett v Newalls Insulation Co Ltd[1953] 1WLR 8. What is adequate for one set of circumstances may not be so in relation to a different set of circumstances. It stands to reason that more care must be exercised where a highly dangerous substance is involved. 105 In the present case, the relevant risk is the risk of property damage as a result of inadvertently or carelessly passing the Lithium Batteries to the plaintiff in a skip bin meant only for general waste. The Lithium Batteries are, in turn, undisputed to be a type of Prohibited Wastes for which the defendant knew the plaintiff is not licenced or otherwise equipped to collect. More generally, lithium is itself a “very soft silvery reactive alkali metal” with its reactivity generally increasing with “temperature and surface area, and the presence of moisture”. Molten lithium is “extremely reactive” and “[e]xposed lithium foil is reactive in contact with moist atmosphere due to its large surface area”.148Foot Note 148×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 34 (Fire Investigation Report dated 20 November 2020 at paras 45–46).Similarly, in its forensic report, the HSA noted that upon “exposure in the air, the silver substances turned dark grey and grey, heat was also produced. The addition of water to the silver substances produced sparks, smoke and flame”.149Foot Note 149×3 AB at p 1791 (SCDF Fire Investigation Report dated 25 November 2019 Attachment A at para 10(d)).It is thus evidently clear that the lithium in the Lithium Batteries areper sehighly reactive so as to make it particularly dangerous, especially without the appropriate equipment to manage such reactive metals. 106 Bearing the applicable principles and factual context in mind, I turn to determine the standard of care in the present case. (2) The parties’ positions 107 The plaintiff submits that the standard of care accepted by the defendant is to “actually check what is inside the skip bin before [the plaintiff] comes to collect (and this checking must be done from time to time and not just once)” to satisfy itself that “no dangerous waste had been dumped or allowed to be dumped into Skip Bin A10”. This is especially since the plaintiff’s services are requested by the defendant when the Skip Bin A10 is already full, such that the plaintiff’s Lorry driver would not be able to “check what was below the bulky items that were in the upper part of Skip Bin A10”.150Foot Note 150×Plaintiff’s CS at paras 91–93. 108 The defendant rejects that the standard of care extends to checking what was inside the skip bin as the skip bin “was placed within the Defendant’s Premises and only the Defendant’s Workers or personnel within the Defendant’s Premises would have access to the same” and in any case is “unreasonable and unrealistic”.151Foot Note 151×Defendant’s RS at paras 73–74.The defendant’s case is that the defendant “had expended more than ample effort and exercised more than reasonable care in discharge of its duty” for the following reasons.152Foot Note 152×Defendant’s CS at paras 39–47, 120–129. (a) The defendant had conducted an extensive and comprehensive risk assessment so as to identify potential hazards and risks in the Defendant's Premises and operations, so as to implement effective risk control measures (namely, the defendant’s Waste Sorting Procedure, under which the defendant’s workers would manually sort out the wastes)to guard against such risks. If there were plastic bags, the defendant’s workers “have been instructed to open them to check the contents inside. The toxic and hazardous waste would then be segregated from the general waste”. (b) The defendant required its customers, as “toxic or hazardous waste generators”, to notify the defendant of the type and quantity of wastes to be collected. The defendant’s customers are required to submit a declaration of the same on NEA E-Tracking which would thereafter be confirmed or amended (if there is any discrepancy) by the defendant on NEA E-Tracking. (c) In addition to the records on NEA E-Tracking, the defendant’s practice is to keep “their own set of records of what is reflected in NEA E-Tracking, on the basis that NEA would conduct periodic audits on the same”. (d) When collecting wastes from its customers, the defendant would conduct “physical checks” to “ensure that that the toxic wastes which it collects are consistent with what the [d]efendant expected or thought that it was collecting” by way of a “visual inspection of the waste” by the driver of the defendant’s collection vehicle. (e) Upon transporting its customers’ waste back to the Defendant’s Premises, the defendant would “carry out another visual verification of the waste collected against the relevant delivery order before the waste is allowed into the Defendant's Premises”. At this juncture, the defendant may carry out “further tests” such as “PH test, water content test and specific gravity test” on the waste collected to confirm the “nature of the wastes is as per what the customers have declared and to ensure that the method of disposal or handling would be safe”. (f) The defendant also “took more than sufficient measures” to ensure that the defendant’s workers were “properly trained and are aware of the standard operating procedure” summarised above. As such, the defendant’s workers are “educated on the guidelines and standard operating procedures, so that they can implement these measures”. 109 Having considered the “potential risks of inadvertently collecting wastes which it was not supposed to and passing such waste” to the plaintiff, the defendant took steps to “ensure that a comprehensive and proper set of guidelines and standard operating procedure was put in place to address such risks”. The defendant submits that the foregoing “begs the question of what more could or should the [d]efendant have done to discharge its duty” of ensuring that the defendant’s waste “did not contain Prohibited Wastes (if any) or that the Batteries were not placed in Skip Bin A10”. (3) My analysis and decision 110 Though the defendant does not address the applicable standard of care directly, the defendant essentially emphasises that it has complied with what is essentially “industry standards and common practice”. I agree that the applicable regulations are indicative of the applicable standard of care when handling toxic industrial waste. For example, as mentioned at [108], the defendant would collect toxic industrial waste from a customer onlyafterreceiving information on the type and quantity of waste andconfirmingthe same by conducting its own inspections and further tests. The defendant also keeps a record of the same, in case of periodic audits. A licenced Toxic Industrial Waste collector is required to do the foregoing under regs 11–12 of the Regulations on Toxic Industrial Waste. 111 The difficulty in this case is that the defendant is a licenced Toxic Industrial Waste collector and General Waste collector that contracted out the collection, processing and disposal of its general waste to the plaintiff. The practical implication of such an arrangement is thatthe defendantwould necessarily handle Mixed Waste (as defined in the defendant’s defence) at the Defendant’s Premises and the plaintiff would be reliant on the defendant to properly sort its waste. In my judgment, given the likelihood and risks of harm (ie,property damage if toxic industrial waste and/or hazardous substances are passed to another entity neither licenced nor otherwise equipped to handle such waste and substances) and the extent of such harm, a reasonable person wouldensurethatonlygeneral waste is disposed of in the skip bin provided for and collected by a licenced General Waste collector. That is the standard of care that would be expected of the defendant. 112 For completeness, this is not to say that I make (nor do I need to make) any finding of the standard of care as regards electrical appliances in general that may be found in general waste. The standard of caremaynot be so stringent that the defendant had to also segregate every electrical appliance (which may be characterised as Class A general waste), just because such an appliance may have been powered by lithium batteries (eg, a household portable electrical device powered by two “AA” lithium batteries). It may be argued, in such a case, that the risks, likelihood and extent of harm associated with disposing of common household electrical appliances would be much smaller than that in the present case such that a reasonableperson would not search for and dismantle every electrical appliance in search for lithium components. The same could be said for the other examples given by the defendant,ie, discarded laptops or mobile phones; ultimately,context is key. In any event, these are hypothetical examples and not the case before the court. I do not consider them relevant or helpful to my determination of the issues in the circumstances of this case. I re-emphasise that the present case concerns large quantities of the Lithium Batteries that could not, by any stretch of imagination, be described as falling within Class A general waste, and I thus emphasise once again my remarks at [96]. Acting below the standard of care 113 In determining whether the defendant breached the standard of care expected of it, the pertinent factual issues in dispute that I have to decide are (a) was Skip Bin A10 deployed to the Defendant’s Premises on 6 June 2017, and (b) if so, whether the Lithium Batteries in Skip Bin A10 were dumped into it at while Skip Bin A10 was at the Defendant’s Premises. A subsidiary factual issue that is also in contention is whether Skip Bin A10 was deployed by the plaintiff exclusively for the defendant’s use. 114 In brief, the plaintiff submits that the defendant “failed to exercise reasonable care to check the inside of the skip bin to ensure that no waste that was flammable, toxic and/or hazardous and/or of a dangerous nature had been dumped or allowed to be dumped into Skip Bin A10” which led to the dumping of substantial quantities of the Lithium Batteries in breach of its duty.153Foot Note 153×Plaintiff’s CS at para 101.The defendant, however, submits that it “could not have dumped the lithium batteries into Skip Bin A10” because it “did not have access to or could not have come into possession of lithium batteries” and they must have come from some other source.154Foot Note 154×Plaintiff’s RS at para 3; Defendant’s CS at para 14.The plaintiff asserts that Skip Bin A10 had for many years been used or deployed exclusively for the defendant’s use. The defendant disputed this. 115 In my judgment, and for the reasons as elaborated below, I am satisfied on the totality of the evidence before me that the defendant did breach its duty of care by dumping (or allowing to be dumped) the Lithium Batteries into Skip Bin A10. (1) Skip Bin A10 was deployed at the Defendant’s Premises exclusively 116 The plaintiff’s case is that since 2009, it had deployed Skip Bin A10 at the Defendant’s Premises exclusively.155Foot Note 155×Statement of Claim (Amendment No. 1) at para 6.According to Mr Cai, “Skip Bin A10 is only deployed at the Defendant’s Premises and is never deployed at any other customer’s premises”.156Foot Note 156×Cai Jielun’s AEIC at para 38.Similarly, Mr Lee Cheng Wah stated that for “many years”, Skip Bin A10 “had been deployed at the Defendant’s [P]remises”.157Foot Note 157×Lee Cheng Wah’s AEIC at para 16. 117 The defendant’s position is that there was no “agreement or arrangement that the [p]laintiff would deploy any specifically marked and/or designated skip bin (including Skip Bin A10)” to collect the defendant’s wastes from the Defendant’s Premises.158Foot Note 158×Defendant’s Opening Statement at para 9; Defence (Amendment No. 3) at para 6.According to Mr Tan Kim Seng, “Mr Lee [Cheng Wah] and I did not have any agreement that a particular skip bin was designated for Cramoil’s [w]aste or to be deployed” at the Defendant’s Premises. He “do[es] not recall seeing any visible or particular markings or identification” on the skip bin deployed at the Defendant’s Premises.159Foot Note 159×Tan Kim Seng’s AEIC at para 33.Mr Sohel also testified at trial that he could not remember the marking on the skip bin deployed at the Defendant’s Premises.160Foot Note 160×Day 6 Transcript dated 10 February 2021 at p 134, lines 4–18, 118 This issue surrounding the exclusivity of Skip Bin A10 is of significance because the defendant emphasises that Skip Bin A10 had likely been left overnight at the Plaintiff’s Premises on 5 June 2017 before being deployed to the Defendant’s Premises on 6 June 2017. Specifically, the defendant avers that when Skip Bin A10 had been left at the Plaintiff’s Premises overnight on 5 June 2017, the plaintiff’s workers may have “loaded it with comingled waste which they had not been able to finish sorting by the end of the work day” and such waste included the Lithium Batteries.161Foot Note 161×Defendant’s CS at paras 79–80. 119 I find that, on balance, Skip Bin A10 was deployed at the Defendant’s Premises exclusively. The plaintiff’s evidence was not contradicted by the defendant with any objective evidence. The defendant’s witnesses stop short of outrightly denying that a skip bin other than Skip Bin A10 had been deployed at the Defendant’s Premises for the disposal of general waste. The evidence of the defendant’s witnesses is that they areunable to recallif the skip bin deployed at the Defendant’s Premises had all along been the one marked “A10”. There is no positive evidence from the defendant demonstrating that another skip bin with some other number had been deployed by the plaintiff to the Defendant’s Premises for the defendant’s general waste. In contrast, the plaintiff’s position is supported by contemporaneous collection slips, several of which contain the notation “A10”. In addition,noneof the plaintiff’s collection slipsorthe defendant’s collection tickets shows that a different skip bin with some other numbering was ever deployed at the Defendant’s Premises as the general waste bin.162Foot Note 162×1 AB at pp 132–307 (Plaintiff’s Collection Slips, Defendant’s Tickets, and NEA Receipts from 27 March 2017 to 7 June 2017). 120 Following my finding that Skip Bin A10 was for the defendant’sexclusiveuse, it is, in my view, highly unlikely that the waste from any of the plaintiff’s other customers could have been dumped into it, and I elaborate on this below at [130] onwards. It was thus immaterial whether Skip Bin A10 had been left overnight at the Plaintiff’s Premises on 5 June 2017. In my judgment, even if Skip Bin A10 was left overnight at the Plaintiff’s Premises as the defendant contends, the defendant’s allegation that waste from the plaintiff’s other customers could have been “comingled” is unlikely and far-fetched. (2) Skip Bin A10 contained the Lithium Batteries at the point of collection from the defendant 121 Based on the plaintiff’s signed collection slip dated 6 June 2017, Skip Bin A10 was placed at the Defendant’s Premises on 6 June 2017. On 7 June 2017, the plaintiff’s signed collection slip with the box for “Collect, Dispose & Return” was ticked along with the handwritten remarks “Rubbish + handling fee”. The unsigned invoice from the plaintiff dated 7 June 2017 shows that the skip bin collected from the Defendant’s Premises transported on “Vehicle No.: XE1524M” arrived at the Plaintiff’s Premises at “18:20”, which corresponds to the time stamp on the Lorry’s GPS.163Foot Note 163×1 AB at pp 304–306 (Plaintiff’s Collection Slips Nos. 114698, 115654; Plaintiff’s Invoice No. D-1305787).Screenshot photographs of the Lorry’s GPS track data also show that it arrived at the Defendant’s Premises at about “18:08:34” to collect Skip Bin A10, left at about “18:13:16”, and reached the Plaintiff’s Premises at about “18:20:34”.164Foot Note 164×1 AB at pp 416, 418, 421.As mentioned at [10], the Lorry unloaded the contents of Skip Bin A10 at the Sorting Yard at about 6.23pm, during which,inter alia, the light-coloured packages containing the Lithium Batteries were also unloaded. 122 I agree with the plaintiff that the foregoing “chain of events on 7 June 2017 prove that the [L]ithium [B]atteries were inside Skip Bin A10 when they were unloaded” at the Plaintiff’s Premises and that Skip Bin A10 was collected from the Defendant’s Premises and “brought straight” to the Plaintiff’s Premises.165Foot Note 165×Plaintiff’s CS at para 75.According to the Lorry’s GPS records,166Foot Note 166×1 AB at pp 414–421 (Screenshots of GPS Records for the Lorry dated 7 June 2017).the trip from the Defendant’s Premises to the Plaintiff’s Premises took less than 10 minutes without any indication of detours to any other locations in between. In addition, the evidence of Mr Lee Teng Guan, the driver of the Lorry, is that after Skip Bin A10 was loaded onto the Lorry, he drove the Lorry “straight from the Defendant’s Premises to the Plaintiff’s Premises” and “did not make any stops at any other customers’ premises” or “deviate from the route” between the two premises.167Foot Note 167×Lee Teng Guan’s AEIC at para 19.This evidence was not challenged at trial by the defendant and I accept it. On the evidence before me, I find that (a) Skip Bin A10 was exclusively deployed for the defendant’s use, (b) Skip Bin A10 was delivered to the Defendant’s Premises on 6 June 2017, (c) Skip Bin A10 was collected by the plaintiff from the Defendant’s Premises on 7 June 2017, and (d) the Lithium Batteries were unloaded from Skip Bin A10 at the Plaintiff’s Premises at about 6.23pm on 7 June 2017. The remaining issue is this – were the Lithium Batteries dumped into Skip Bin A10whileit was at the Defendant’s Premises between 6 and 7 June 2017? 123 The overall thrust of the defendant’s case underpinning its arguments on this issue is essentially that “even if” the plaintiff shows that, on 7 June 2017, “Skip Bin A10 was collected from the Defendant’s Premises, this does not take the Plaintiff’s case very far” and that such finding is “not the end of the matter”.168Foot Note 168×Defendant’s RS at para 4; Defendant’s CS at para 7.The defendant argues that such a finding does notnecessarilymean thatthe defendanthad discarded the Lithium Batteries into Skip Bin A10. 124 The defendant’s arguments focused on two prongs: (a) it was theplaintiff(and not the defendant) who had disposed of the Lithium Batteries in Skip Bin A10 and (b) the defendant’s stringent Waste Sorting Procedure would mean that the Lithium Batteries could not have come from the defendant. 125 On the totality of the evidence before me, I reject both of the defendant’s arguments. I explain why. (A) Whether the plaintiff delivered an empty Skip Bin A10 to the Defendant’s Premises on 6 June 2017 126 The defendant submits that “it is wholly possible, if not probable” for the plaintiff to have deployed skip bins from the Plaintiff’s Premises which “it believed to be empty, when they were in fact not”. For example, the skip bins deployed may have “contained waste from previous collections” and/or “other customers”. In that regard, the defendant highlights that the plaintiff’s collection slips suggest that Skip Bin A10 was “likely left overnight at the Plaintiff’s Premises on 5 June 2017” and the plaintiff thus had “full control and custody over the same”. It therefore remained a possibility that when Skip Bin A10 was left overnight at the Plaintiff’s Premises, the plaintiff’s workers “commingled waste which they had not been able to finish sorting by the end of the work day, and the waste included the [Lithium Batteries]”.169Foot Note 169×Defendant’s CS at paras 79–81.The defendant also submits that the fact that the light-coloured packages containing the Lithium Batteries “appear to be in the middle or towards the bottom of Skip Bin A10 lends credence” to its suspicion that the Lithium Batteries “were already in Skip Bin A10 when it was deployed to the Defendant's Premises”.170Foot Note 170×Defendant’s CS at para 82. 127 I reject the defendant’s arguments for several reasons. First, the theory postulated at [126] above was, in my view, somewhat far-fetched. This theory was raised on the back of a note made by Dr John Allum of HFS-Asia, the fire expert appointed on behalf of Great Eastern, in his handwritten interview notes taken during his attendance at the Plaintiff’s Premises on 9 June 2017. Dr Allum made a note that if “any waste unsorted at the end of the day, then this is put back into a skip bin for processing the next day.”171Foot Note 171×Day 2 dated 3 February 2021 at p 69, line 24 to p 70, line 13; Exhibit D6 at p 2. 128 For this theory to have any credibility, it would require proof that (a) a large number of light-coloured packages containing the Lithium Batteries were present on the floor of the Sorting Yard on 5 June 2017 commingled with other waste, (b) the commingled waste was specifically put back into Skip Bin A10 at some stage on 5 June 2017 because the plaintiff’s workers could not finish sorting the wastes by the end of the work day on 5 June 2017 and (c) on the next day (6 June 2017), Skip Bin A10 was delivered to the Defendant’s Premises with the Lithium Batteries inside that bin. It can be immediately seen that this theory is not credible because itassumesthat on 6 June 2017, prior to Skip Bin A10 being delivered to the defendant, the plaintiff’s workers did not empty out Skip Bin A10 to continue sorting the commingled waste that they had not completed sorting on 5 June 2017 (even assuming that is factually correct). Alternatively, it assumes that even if they did, the numerous packages containing the Lithium Batteries went unnoticed and were left inside Skip Bin A10. The theory alsoassumes(without any evidence) that Skip Bin A10 was left overnight on the floor of the Sorting Yard on 5 June 2017. 129 Furthermore, Dr Allum did not give evidence and therefore the context in which the note was made by him was not clear. On the other hand, two of the plaintiff’s employees, Mr Koothaiyan Mohana Sundaram and Mr Lin Jian Hong both independently testified at trial that there was no such practice of putting unsorted waste back into a skip bin to be sorted the next day. Their evidence was that any unloaded wastes would be completely sorted before they left for the day. If sorting could not be processed and completed within that day, the waste would not be unloaded at all. I accept their explanations which I find are also logical. In contrast, I find it difficult to fathom why partially unsorted general waste would be put back into a skip bin only to be emptied out again the next day for sorting to continue. 130 Thus, while one might accept that it waspossiblethat the theory postulated by the defendant at [126] could occur, it is in my view an unlikely and implausible scenario, both for the reasons I have set out above and simply on account of the sheer quantity of packages containing the Lithium Batteries that were subsequently unloaded from the Lorry at the Sorting Yard, as can be seen from the CCTV footage on 7 June 2017 (screenshots of which are at Annex 5 of this judgment). It is, in my view, simply inconceivable that that quantity of packages could be left inside Skip Bin A10 on 5 June 2017 (if indeed that was the case) without anyone from the plaintiff noticing. I therefore have little hesitation rejecting the defendant’s submissions that this theoretical possibility was what occurred on the balance of probabilities. 131 Going further, the defendant’s theory is not only far-fetched but entirely unsupported by any objective evidence. Even if I accept that Skip Bin A10 had been left overnight at the Plaintiff’s Premises on 5 June 2017 on the floor of the Sorting Yard, nothing in the evidence before me suggests that the plaintiff’s workers, during that time overnight, “had loaded it with comingled waste” and that any such “comingled waste” included the Lithium Batteries as the defendant contends.172Foot Note 172×Defendant’s CS at para 80.In my view, it is not significant that the light-coloured packages containing the Lithium Batteries were not at the very top of the contents in Skip Bin A10 since the position of such packages is ultimately not indicative ofthe partythathad disposed of the same into Skip Bin A10. 132 The defendant also sought to argue that there was no evidence that Skip Bin A10 was in fact checked to be empty before it was delivered to the Defendant’s Premises. Mr Lee Teng Guan, a driver for the plaintiff and who was specifically assigned to drive the Lorry, testified that he would specifically check that a skip bin is “completely empty” before delivering and deploying it at a customer’s premises and that it was a simple matter of accessing the top of the skip bin via a rung of steps on the skip bin.173Foot Note 173×Day 3 Transcript dated 4 February at p 37, ln 2–15.The defendant’s rebuttal was that Mr Lee Teng Guan’s “practice of checking that the skip bins were empty is wholly irrelevant” as there is “no evidence” showing that he had delivered the empty Skip Bin A10 to the Defendant’s Premises on 6 June 2017.174Foot Note 174×Defendant’s RS at paras 47–48.While this may be so, the more pertinent questions are whether, on the balance of probabilities, it ismore likelythan not that (a) when Skip Bin A10 was collectedfromthe Defendant’s Premises on5 June 2017and the contents unloaded at the Plaintiff’s Premises, Skip Bin A10 was checked to be empty and (b) the driver of the Lorry (when Skip Bin A10 was delivered to the Defendant’s Premises on 6 June 2017)andsomeone from the defendant would have checked that Skip Bin A10 was empty when it was delivered to the Defendant’s Premises. There is no reason for me to suspect or conclude that these checks were not done or were unlikely to have been done, whether by Mr Lee Teng Guan or any of the other plaintiff’s workers responsible for driving the Lorry and delivering and collecting Skip Bin A10 from the Defendant’s Premises, or any of the defendant’s employees tasked with dealing with Skip Bin A10. 133 For all the foregoing reasons, I find that Skip Bin A10 was delivered by the plaintiff to the Defendant’s Premises on 6 June 2017 empty. In light of this finding, it is not necessary for me to address the defendant’s submission that the Lithium Batteries could have come from the plaintiff or its customers instead of the defendant. The CCTV footage plainly shows that the light-coloured packages containing the Lithium Batteries were unloaded from Skip Bin A10 which was collected by the plaintiff on 7 June 2017 from the Defendant’s Premises. I am thus also satisfied that on the balance of probabilities, the Lithium Batteries were dumped into Skip Bin A10 while it was at the Defendant’s Premises, and prior to Skip Bin A10 being collected by the plaintiff on 7 June 2017. (B) The defendant’s Waste Sorting Procedure 134 The conclusion I have reached in the foregoing paragraph is sufficient to find that the defendant did breach its duty of care to the plaintiff and the standard care expected of it. However, as the defendant relied heavily on,inter alia, its Waste Sorting Procedure as part of its system of “stringent multi-levelled checks”, I will address some further points raised by the defendant in elaboration of my findings above on the issue of breach of duty of care. 135 The CCTV footage also depicts the unloading of some brown coloured material when the contents of Skip Bin A10 were unloaded at the Sorting Yard on 7 June 2017 (see [11]). The evidence of Mr Sohel, an employee of the defendant who was involved in the dumping of waste into Skip Bin A10 on the morning of 7 June 2017,175Foot Note 175×Day 6 Transcript dated 10 February 2021 at p 139, lines 7–24.is that the brown coloured material, which “looked like soil” did not look familiar and he “could not have put the brown stuff into the Bin”.176Foot Note 176×Sarkar Mohammad Sohel’s AEIC at para 16.The defendant, relying on such evidence, submits that this “further reinforces the possibility that the wastes found in Skip Bin A10 were not placed there solely by the [d]efendant and that the [p]laintiff had somehow placed other wastes in the same before deploying Skip Bin A10 to the Defendant’s Premises”.177Foot Note 177×Defendant’s CS at paras 83–86. 136 There are several problems and gaps with Mr Sohel’s evidence. The fact that Mr Sohel is certain that hepersonallydid not dump the brown coloured substance into Skip Bin A10 on 7 June 2017 does notnecessarilyprove that theplaintiffmust have done so. Mr Sohel’s evidence is therefore of no assistance to the defendant on this point, and I say so for several reasons. 137 First, at the material time, Mr Sohel “was also working with a worker” named Perumai Saravanan, who left the defendant’s employ “around August 2018”. On 7 June 2017, Mr Sohel “sorted the general wastes with Saravanan” and they “were the only two workers sorting the general waste on that day”.178Foot Note 178×Sarkar Mohammad Sohel’s AEIC at paras 11–12.As such, more than one person was involved in the dumping of waste into Skip Bin A10 prior to the plaintiff’s collection on 7 June 2017 and therefore, Mr Sohel’s evidence is in no way conclusive of the matter. As Mr Saravanan was not called by the defendant to give evidence, I am unable to make any findings on what Mr Saravanan did or did not do, or see, on that day. 138 Secondly, Mr Sohel was “not sure” that he had “seen many batteries before” but “think[s]” that he had not seen such batteries.179Foot Note 179×Day 6 Transcript dated 10 February 2021 at p 144, lns 11–17.Given that he was being asked to recall events that occurred almost 4 years ago, I treated the accuracy of his recollection with some caution. 139 Thirdly, the evidence demonstrates that Mr Sohel was not present at Skip Bin A10 throughout the day on 7 June 2017. In any case, it is impossible to determine (due to a lack of any direct evidence) whether the light-coloured packages were discarded into Skip Bin A10 on 6 June 2017 (ie,the day on which the plaintiff delivered Skip Bin A10 at the Defendant’s Premises) or 7 June 2017 (ie, the day on which the plaintiff collected Skip Bin A10). Mr Sohel did not give any evidence on what he did on 6 June 2017; nor was there any evidence from any other employee from the defendant tasked with sorting waste and placing waste into Skip Bin A10 on 6 June 2017. Mr Sohel is also unable to remember whether he was present when the Lorry collected Skip Bin A10 on 7 June 2017.180Foot Note 180×Day 6 Transcript dated 10 February 2021 at p 139, line 7 to p 140, line 3.Further, Mr Sohel accepted that he would not know if other workers disposed of other wastes inside Skip Bin A10 later in the day.181Foot Note 181×Day 6 Transcript dated 10 February 2021 at p 153, lines 17–25; Plaintiff’s CS at para 95.The defendant also agrees that Mr Sohel’s job was “not to guard” Skip Bin A10 or “check every item which was placed in the same” and he hence “obviously would not know if someone else were to dump items” therein but nonetheless that “does not diminish the weight of [his] evidence”.182Foot Note 182×Defendant’s RS at para 22. 140 Ultimately, I am of the view that the totality of Mr Sohel’s evidence did not assist in supporting the defendant’s case. On the evidence before me, it is clear that waste (including Prohibited Waste) could indeed have been disposed of into Skip Bin A10withoutMr Sohel’s knowledge because, quite simply, he was not there the entire time. 141 I also do not think that the defendant’s Waste Sorting Procedure or the alleged “multi-levelled checks” were strictly adhered to by the defendant on 6 and 7 June 2017. Had the defendant properly sorted and checked forallthe waste thrown into the skip bin, Skip Bin A10 collected by the plaintiff from the Defendant’s Premises on 7 June 2017 would not have contained the light-coloured packages containing the Lithium Batteries. Thus, while the Waste Sorting Procedure may be “stringent” and “multi-levelled”in theoryas the defendant repeatedly emphasised in its closing submissions,183Foot Note 183×Defendant’s CS at paras 48, 52; Defendant’s RS at paras 5, 19.it may not have been complied with quite so stringently as a matter ofactualpractice. Furthermore, I note that the defendant’s submissions in this regard are somewhat inconsistent with its pleaded case. As mentioned at [37], the defendant pleaded that it did not have “sufficient and/or adequate” facilities at the Defendant’s Premises to carry out a “thorough” sorting of its wastes.184Foot Note 184×Defence at para 4AA.If so, the Defendant cannot have it both ways in its attempts to avoid liability – on the one hand, pleading that it was unable to thoroughly segregate general waste from its Mixed Wastes and yet, on the other, contending that it had adhered strictly to its stringent “multi-levelled checks”. In my judgment, it is more likely that the defendant simply failed to ensure that only general waste was dumped into the “general waste bin” (ie, Skip Bin A10)for the plaintiff’s collection, processing (if necessary) and disposal, and thereby also failed to comply with its own Waste Sorting Procedure. 142 Finally, Mr Tan Kim Seng, in answer to the court’s question on whether there was any CCTV system in the Defendant’s Premises that would have recorded the location of Skip Bin A10, responded that while there would have been such recordings at the time (ie,in June 2017), by the time the claim against the defendant was first intimated in 2018, the recordings had already been overwritten.185Foot Note 185×Day 5 Transcript dated 9 February 2021 at p 230 at ln 4–18.Therefore, unfortunately, what would otherwise have been important objective evidence was not available. The court was thus left to make findings of fact based on inferences to be drawn from the oral and documentary evidence available. (C) Relevance of the entity which produced the Lithium Batteries and parties’ past breaches of their respective licences 143 I would also make some brief comments on two further arguments raised by the defendant in support of its case that the Lithium Batteries could not have come from the defendant. First, the defendant does not itselfgeneratewaste at the Defendant’s Premises which includes Lithium Batteries.186Foot Note 186×Defendant’s CS at paras 22–30.Secondly, the defendant did notcollectthe Lithium Batteries from any of its customers.187Foot Note 187×Defendant’s CS at paras 31–38; Defendant’s RS at paras 23–26. 144 In my judgment, it is unnecessary for me to make any specific finding on whichentityproduced or generated the Lithium Batteries. The only material and relevant issue for consideration in this part of my analysis and decision is simply whether the Lithium Batteries were disposed or dumped into Skip Bin A10 while it was at the Defendant’s Premises between 6 June and 7 June 2017. I have already concluded that the plaintiff has successfully established this on the balance of probabilities based on the totality of the evidence before me. There is therefore no need for me to decidehowor whythe defendant caused the Lithium Batteries to be disposed of or dumped into Skip Bin A10, orwhichof the defendant’s customers the Lithium Batteries could have emanated from. While the precise details as to how the Lithium Batteries ended up in Skip Bin A10 will remain an unsolved mystery, that mystery does not need to be solved in order for the court to determine the factual issues that are critical to establishing liability on the part of the defendant for the Negligence Claim. 145 For completeness, each party also expounded on and sought to gain mileage from the other party’s respective past breaches of their respective licences.188Foot Note 188×Plaintiff’s CS at paras 98–100; Defendant’s RS at paras 31–34, 44.I am of the view that these past incidents were not relevant to the court’s task of deciding whether the defendant breached its duty of care to the plaintiff in the present circumstances. Thus, I do not address those arguments and they did not play a part in my analysis. (3) Conclusion on breach of duty of care 146 I have found that Skip Bin A10 was exclusively designated by the plaintiff for use by the defendant (at [119]). I also find that the plaintiff did deliver an empty Skip Bin A10 to the Defendant’s Premises on 6 June 2017 and that Skip Bin A10, when collected by the plaintiff from the Defendant’s Premises on 7 June 2017, contained the Lithium Batteries. I also conclude that the defendant’s Waste Sorting Procedure was not adhered to strictly such that the light-coloured packages containing the Lithium Batteries ended up being disposed into Skip Bin A10 carelessly while it was at the Defendant’s Premises. Had the defendant’s Waste Sorting Procedure, as well the Agreement and Segregation Request been adhered to,onlygeneral waste (which could include bulky items) would have been disposed of into Skip Bin A10 for the plaintiff’s collection, processing and disposal. In turn, the numerous light-coloured packages containing the Lithium Batteries would not have been inside Skip Bin A10 when it was collected by the plaintiff on 7 June 2017. 147 The reasonable person is not expected to have the wisdom of Odysseus, the strength of Hercules, or the foresight of Cassandra. Nor is the reasonable person omnipotent nor omniscient; he (or she) may makereasonablemistakes. However, neither is the reasonable person so careless as to dump or allow to be dumpednumerouspackages,eachof which containingsubstantialquantities of Lithium Batteries into a skip bin designated only for general waste. Even if the defendant/its employees only saw the light-coloured packages (and not the Lithium Batteries themselves), based on the defendant’s own professed procedures,189Foot Note 189×Marcus Tan’s AEIC at paras 23–27; Sarkar Mohammad Sohel’s AEIC at para 5.it was incumbent on the defendant to have opened up such packages to check andensurethat the contents therein were indeed general waste instead of toxic industrial or hazardous waste that the plaintiff could not collect, process or dispose of. In discarding or allowing the Lithium Batteries to be discarded into Skip Bin A10, the defendant, in my judgment, acted or failed to act in a manner which fell short of the standard of care required of it. I am accordingly satisfied that the defendant did breach its duty of care to the plaintiff.",
        "Causation": "The applicable legal principles (1) Factual and legal causation 148 To succeed in its Negligence Claim, it is insufficient for the plaintiff to show that there has been a breach by the defendant of the latter’s duty of care; the plaintiff must also go on to prove, on a balance of probabilities, that there was a necessary link between the defendant’s wrongful conduct and the plaintiff’s loss or damage. It is not disputed that in this regard, the plaintiff must satisfybothtests ofcausation in factandcausation in law. 149 As the Court of Appeal explained inSunny Metal & EngineeringPte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 (“Sunny Metal”) at [52] and [64]: 52 … Causation in fact is concerned with the question of whether the relation between the defendant’s breach of duty and the claimant’s damage is one of cause and effect in accordance with scientific or objective notions of physical sequence. It is concerned with establishing thephysical connectionbetween the defendant’s wrong and the claimant’s damage. The universally accepted test in this regard is the “but for” test … 64 … one should, in order to determine whether an act or omission was a cause of the loss, eliminate the act or omission mentally and consider whether or not the loss would still have occurred. If the loss would not have occurred when the act or omission is eliminated, the act or omission is acondicio sine qua nonfor the loss. If the loss would still have occurred, even when the act or omission in question is disregarded, the loss has not been caused by this act or omission. 150 More recently inArmstrong, Carol Ann (executrix of the estate of Peter Traynor, deceased, and on behalf of the dependents of Peter Traynor, deceased) v Quest LaboratoriesPte Ltd and another and other appeals[2020] 1 SLR 133 (“Armstrong”), the Court of Appeal further emphasised that the focus of the “but for” test is to “tonarrowdown the possible causes of an event to only thenecessaryconditions, or thecausa sine qua non” (at [86], citing Winfield and Jolowicz, Tort (Edwin Peel and James Goudkamp gen ed) (Sweet & Maxwell, 19th Ed, 2014) at para 7-007). 151 Causation in law, in contrast, “is an attributive question as to whether the defendant should be made responsible for the consequences of his actions that have befallen the plaintiff”. In determining such a question, the court thus picks out “one or more necessary conditions (ie, thecausa causansas opposed to thecausa sine qua non) which are in a sense “more important” than the mass of conditions that makes up the background of the causal picture” (Armstrongat [87]). In determining thecausa causanswhich are “more important”, it is important to bear in mind that the overarchingrationalefor imposing the test of causation in law is to “to prevent indeterminate liability resulting from causation in fact alone” (Sunny Metalat [53]). The court’s focus at this stage is “how best toattribute responsibilityfor the claimant’s damage” (Sunny Metalat [54]). Thus, the law “arbitrarily declines to trace a series of events beyond a certain point” as a matter of “practical politics” (Palsgraf v The Long Island Railroad Company248 NY 339 (1928) at 352, cited inSunny Metalat [54]). 152 It would be apparent from the summary above of the principles on causation that there is some relation between causation in law and contributory negligence. As the Court of Appeal explained inPlanAssure PAC v Gaelic Inns Pte Ltd[2007] 4 SLR(R) 543 (“PlanAssure”) at [99], “contributory negligence on the part of a plaintiff can operate to break the causal chain”, citingClerk and Lindsell on Torts(Sweet & Maxwell, 19th Ed, 2006) at para 2-96. The similarity is one of the subject matters – both concern a claimant’s actions in circumstances which can be said to have contributed to the damage suffered. However, there is a material difference in the respective test and applicable threshold. In particular, the threshold to be satisfied is much higher where the defendant alleges that it wastheplaintiff’saction (and notthe defendant’sbreach of duty of care) thatcausedthe damage suffered. (2) The role of expert evidence 153 The expert evidence before me is relevant to the issues of causation and contributory negligence. However, this does not mean that the court must “blindly accept expert evidence on any matter”even ifsuch evidence is “not contradicted” by another expert witness. The “rule of prudence” governing the treatment of expert evidence requires the court to “carefully consider the factual or other premises on which the expert based his opinion”. As in the present case, the rule of prudence is “especially relevant where the expert is appointed by the party seeking to rely on his evidence” as it is “merely common sense that no party would call an expert to testify against its own case” (Poh Soon Kiatv Desert Palace Inc[2010] 1 SLR 1131 at [22]–[23]). 154 While it is axiomatic that a “judge is not entitled to substitute his own views for those of an uncontradicted expert’s”, the court also does not “unquestioningly accept unchallenged evidence”. Insubstance, the “same rules apply to the evaluation of expert testimony as they would to other categories of witness testimony”. As such, the court also considers content credibility, evidence of partiality, coherence and a need to analyse the evidence in the context of established facts (Sakthivel Punithavathi v PP[2007] 2 SLR(R) 983 at [76]). 155 Ultimately, it is for the court (not the expert) to make findings and determine the issues before it. As G P Selvam J noted inThe“H156”[1999] 2 SLR(R) 419 at [27]: Even though the expert may submit his conclusions, he must present the materials and the grounds [which] he uses to make his conclusions. The expert may not usurp the function of the court and present his finding. Further he cannot decide the issue by applying the law to the facts without setting out the law and the reasoning process. Causation in fact 156 It is uncontentious that the property damage suffered by the plaintiff as a result of the fires and explosion at the Plaintiff’s Premises on 7 June 2017 would not have occurredbut forthe presence of the Lithium Batteries in Skip Bin A10.190Foot Note 190×Plaintiff’s CS at paras 103, 106–107; Plaintiff’s RS at para 46.As highlighted above at [22], the defendant does not dispute that the Lithium Batteries were the origin of the fires and explosion.191Foot Note 191×Defendant’s CS at para 4(c)–(d); Day 7 Transcript dated 25 February 2021 at p 130, line 22.Ms Lim, the defendant’s expert, likewise accepts that but for the presence of Lithium Batteries, there would have been no fires at the Plaintiff’s Premises on 7 June 2017.192Foot Note 192×Day 8 Transcript dated 26 February 2021 at p 127, lines 6–18. 157 Therefore, in my view, the test forfactual causationis satisfied in this case. As the defendant points out, “establishing the factual causes is but merely a starting point to the inquiry”. The plaintiff must also establish that the defendant’s breach was the proximate cause of the fires and explosion at the Plaintiff’s Premises on 7 June 2017.193Foot Note 193×Defendant’s RS at paras 76–79.The more contentious issue in this case is whether the test for causationin lawis also satisfied. Causation in law (1) The parties’ submissions 158 The plaintiff’s position is that the defendant’s breach of duty “was more probable than not the effective or proximate cause of the fires and explosions that occurred at [the Plaintiff’s] Premises on 7 June 2017”.194Foot Note 194×Plaintiff’s CS at para 110.The defendant’s position is that the proximate cause of the fires and explosion was, instead, the “act of the [e]xcavator running over the [Lithium] Batteries and crushing and/or damaging them”.195Foot Note 195×Defendant’s CS at para 165.From the tabulation of key events at [15], the excavator tracks moved “further forward towards the central area of waste pile” at about 18:26:39. 159 According to the plaintiff,196Foot Note 196×Plaintiff’s CS at paras 112–114.the excavator “was merely a link in the chain of causation” between the defendant’s own breach of duty and the fires and explosion at the Plaintiff’s Premises on 7 June 2017 and “not a wholly independent cause of the fires and explosions that broke the chain of causation”. Further, the use of the excavator in and of itself to segregate general waste “would not have resulted in a fire if the [L]ithium [B]atteries had not been present in the waste unloaded from Skip Bin A10 on 7 June 2017” and thus “could not have been and did not constitute a wholly independent cause of the fires and explosions and was not anovus actus interveniens”. 160 In support of its position,197Foot Note 197×Plaintiff’s RS at paras 45–47, 49–51; Lim Chin Chin’s AEIC Exhibit LCC-2 at p 42 (Fire Investigation Report dated 20 November 2020 at para 80).the plaintiff further highlights that the defendant’s position is that “internal short circuits, overheating and thermal runaway in the batteries” triggered the first fire, F1. As such, “short-circuiting was the last event in a chain of events that started with [the defendant] dumping or allowing to be dumped lithium batteries into Skip Bin A10”.198Foot Note 198×Plaintiff’s RS at para 46.In respect of F2 to F6, the plaintiff highlights that based on the defendant’s own expert evidence, the “burning materials that ejected from [F1] and those that dropped from the claws of the excavator were likely to be sources of ignition at the new sites” and the “[e]xplosions of the burning batteries caused the ejection of hot burning materials to other locations on the waste pile [sic] ignited other fires”.199Foot Note 199×Plaintiff’s RS at para 49, citing Lim Chin Chin’s AEIC Exhibit LCC-2 at p 52 (Fire Investigation Report dated 20 November 2020 at para 108). 161 The defendant, on the other hand, avers that the mere presence of the Lithium Batteries is “at best…one ofthe factual causes of the [i]ncident” [emphasis in original].200Foot Note 200×Defendant’s RS at para 80.The defendant’s position is that it was the plaintiff’s workers’ acts which caused the fires and explosions at the Plaintiff’s Premises on 7 June 2017. The defendant submits that F1 to F3 were caused by the excavator,201Foot Note 201×Defendant’s CS at paras 190–200.F4 was caused by the spraying of water on the Lithium Batteries,202Foot Note 202×Defendant’s CS at paras 201–210.and F5 to F6 were caused by burning waste dropping from the excavator’s claws onto the waste material below it.203Foot Note 203×Defendant’s CS at paras 211–213. 162 The defendant also submitted that concerning F1,204Foot Note 204×Defendant’s CS at para 200.the “onlyexpert opinion in these proceedings on the probable cause of F1 is that of [Ms Lim]” [emphasis in original] as Mr Tan Jin Thong “declined” to comment on the “most probable cause of F1”. Ms Lim is, in turn, of the opinion that “F1 was probably caused by the [e]xcavator crushing and/or damaging the batteries” and her opinion is supported by the other available evidence on the matter.205Foot Note 205×Defendant’s CS at paras 190–199.For example, while the CCTV footage “does not clearly or conclusively show the tracks of the [e]xcavator coming into contact with the [Lithium] Batteries”, the “timingof F1” [emphasis in original] (ie, occurring only after the excavator moved towards the Lithium Batteries) raises an “irresistible inference that F1 was caused by the movement of the [e]xcavator”. Additionally, Ms Lim’s opinion is consistent with the observations made in various other reports, such as the SCDF fire investigation report. 163 The defendant also highlights that Mr Tan Jin Thong “refused to opine on the key issue of what caused F1” and ultimately “does not shed light on the issue of theprobable(and not just possible) cause(s)” of the fires and explosions” [emphasis in original].206Foot Note 206×Defendant’s CS at paras 156–158.In particular, he agreed that it is “a possibility” that the Lithium Batteries were crushed by the excavator207Foot Note 207×Day 7 Transcript dated 25 February 2021 at p 131, lines 10–14 and p 132 at lines 3–13.just as it is “possible” that F1 resulted from “contamination” of the Lithium Batteries with other general waste containing “moisture” at the Sorting Yard.208Foot Note 208×Day 7 Transcript dated 25 February 2021 at p 123, lines 2–8; p 124, lines 4–7.His evidence is that it is not necessarily the case that the excavator is the cause of F1209Foot Note 209×Day 7 Transcript dated 25 February 2021 at p 123, lines 7–8.and, most pertinently, he admitted that he was not testifying “to establish the cause of fire” [emphasis in original].210Foot Note 210×Defendant’s CS at para 157. 164 In addition, the defendant relies onStapley v Gypsum Mines[1953] AC 663 (“Stapley”) as being “instructive” on the matter.211Foot Note 211×Defendant’s RS at para 81.In that case, two miners were instructed to bring down a dangerous part of the roof where they were working. Whilst both men understood that they were not supposed to resume work until this was done, they nevertheless jointly decided to resume work. The roof fell and the appellant’s husband was killed. The House of Lords held on appeal at 687 that: … two causes may both be necessary pre-conditions of particular result - damage to X - yet the one may, if the facts justify that conclusion, be treated as the real substantial, direct or effective cause, and the other dismissed as at best acause sine qua nonand ignored for purposes of legal liability. Similarly, in the present case, the crushing of the Lithium Batteries by the excavator was the “triggering event” that caused the fires and explosions.212Foot Note 212×Defendant’s RS at para 82–83.According to the defendant, parties agree that a “fire would unlikely have occurred” if the Lithium Batteries had been “left untouched” and the excavator “did not crush or damage the same”.213Foot Note 213×Defendant’s RS at para 84. 165 Further, the defendant also submits that the plaintiff’s use of an excavator to segregate wastes is “improper and/or inappropriate and/or unsafe” since the plaintiff “did not know whether[the wastes] consisted of items which may pose fire hazards when crushed” [emphasis in original].214Foot Note 214×Defendant’s CS at para 215; Defendant’s RS at para 88.In this regard,215Foot Note 215×Defendant’s CS at paras 216–218, 219–220, 221–224, 237–238, 239–243, 244–247.the defendant raises numerous complaints – it argues that the plaintiff “would not know” whether the waste contained items which “may pose a fire hazard”, knew of the risk of the excavator crushing wastes during the segregation process, “knew or should have known” that the waste it collects “may contain items which pose a fire hazard when crushed”, the use of excavators to sort waste is “dangerous”, the plaintiff lacked “any procedure or protocol for sorting waste” at the Plaintiff’s Premises, failed to “conduct any risk assessments” relating to the segregation of waste, and failed to “provide training to its workers” on how to segregate waste. Overall, the defendant submits that the fires and explosions were “caused by the acts of the [p]laintiff’s [w]orkers” instead of the defendant’s own breach of duty of care.216Foot Note 216×Defendant’s CS at para 214.Accordingly, the condition and quantity of the Lithium Batteries in Skip Bin A10 is “irrelevant”.217Foot Note 217×Defendant’s CS at paras 228–236. 166 In the event the court finds that the defendant’s breach of duty in discarding Lithium Batteries in Skip Bin A10 is a proximate cause of the plaintiff’s damage, the defendant contends that in such an event, the plaintiff and defendant “ought to both be liable” and the court should apportion liability between the parties. The defendant relies on the Court of Appeal decision inChuang Uming (Pte) Ltd v Setron Ltd and another appeal[1999] 3 SLR(R) 771, in which liability was apportioned equally between a contractor and architect for defective workmanship as both were “equally to blame” (at [44]). The defendant highlights that “in terms of the contributory effect of two concurrent factors, it was difficult to say which of the main causes was in fact the primary cause” and liability was thus “apportioned equally between the parties”.218Foot Note 218×Defendant’s RS at paras 96–97. 167 The plaintiff responds that the defendant’s submissions ought to be rejected as “a disingenuous attempt to abdicate accountability” for its breach of duty. The defendant’s submissions are “akin to” a hypothetical situation in which one person wrongfully releases flammable gas in a kitchen unbeknownst to another person and the other person later lights the kitchen stove, which results in fires and explosions causing property damage and finding fault with the person lighting the match as a matter of attribution of liability.219Foot Note 219×Plaintiff’s RS at para 48. (2) My analysis and decision 168 As I indicated earlier at [16], whether there was only one fire (according to the plaintiff’s expert witness) or six fires (according to the defendant’s expert witness) is not material. As the defendant submits, even if there was only one fire, there would be an “unbroken chain of causation from F1 to F6”.220Foot Note 220×Defendant’s CS at para 189.In my view, the more important issue to consider is what was the cause of F1 in law. 169 As a preliminary point, I do not think it can be said that the expert evidence isunanimousin establishing that the “triggering event” for F1 was that of the crushing of the Lithium Batteries by the plaintiff’s excavator during the segregation process at the Sorting Yard, as the defendant contends. Mr Tan Jin Thong, for example, stated that F1 could have started as a result of the contaminationorcrushing of the Lithium Batteries (see above at [163]). The defendant relied on the following extract from the trial transcript to support its submission that the plaintiff’s expert agreed that the Lithium Batteries, if left untouched, were unlikely to have spontaneously caught fire:221Foot Note 221×Day 7 Transcript dated 25 February 2021 at p 120, ln 15–23. MS WANG: Mr Tan, next question I wanted to ask you is for unsealed and unfinished lithium batteries, if you leave them aside, okay, you don't touch them, you leave them I guess like say in a room, okay, open exposed to air, you just leave them one side, you don't touch them, would they spontaneously catch fire? A. If you don't touch them? Q. If you don't touch them? A. I don't think so. 170 However, the question asked of the plaintiff’s expert and the answer given has to be read in context. The question posed wasnota question aboutthe Lithium Batteries in questionat the Plaintiff’s Premises but ahypothetical exampleof unfinished and unsealed lithium batteries being left open exposed to air in, for example, a room. The question did not specify how many batteries were involved in the hypothetical, if they were completely exposed or in bags, or what type of “room” counsel had in mind. It would not, in my view, be a fair extrapolation from the answer given that the plaintiff’s expertagreedthat ifthe Lithium Batteriesfound at the Plaintiff’s Premises on the day in question were left untouched, it is unlikely that they would have spontaneously caught fire. 171 Nevertheless, based on the CCTV footage showing that F1 only ignitedafterthe excavator moved towards the light-coloured packages containing the Lithium Batteries and Ms Lim’s explanation of short circuiting in lithium batteries, I am satisfied that physical or “crushing” damage to the Lithium Batteries was more likely than not to have been, at the least, a “triggering event” for F1. On the available evidence, I cannot however rule out the possibility that the Lithium Batteries, whilst in the packages, may already have started to react to whatever moisture was present within the packages, notwithstanding that it appears from the CCTV footage that there were no signs of smoke or fire from the pile of the light coloured packages when they were unloaded from the Lorry onto the Sorting Yard. It cannot also be conclusively determined that none of the packages was torn or damaged from the time they were dumped into Skip Bin A10 to the time F1 started. 172 While I note Mr Tan Jin Thong’s evidence that “contamination” remains an alternative possibility, I agree with the defendant that mechanical damage to the Lithium Batteries as a result of using the excavator was the morelikelyand dominant triggering event for F1. 173 Ms Lim explained the chemical process for the cause of the fire as such:222Foot Note 222×Lim Chin Chin’s AEIC Exhibit LCC-2 at pp 35–36 (Fire Investigation Report dated 20 November 2020 at paras 55–57). Hazardous nature: Lithium batteries arehazardousdue to theirability to overheat and ignite combustible materials. Once ignited, the resulting fires can be difficult to extinguish. Thelikelihood of overheating or igniting is increased if the batteries are poorly packaged, damagedor exposed to a fire or heat source. Damage to batteries: Internal short circuitsmayoccurin a lithium battery due tomechanical abuseresulting in rupture or puncture damage of the insulating separator between the electrodes. A prolonged internal short circuit results in self discharge and a local temperature increase which may decompose the electrolyte, and cause a thermal runaway with potential safety hazards. Fires and explosions: An internal or external short circuit of a battery would quickly release a large amount of electrical energy, resulting in overheating, possibly thermal runaway and fire. Short circuits can produce electric arcing and hot sparks, igniting lithium metal foil, graphite powder, polyethylene film and electrolyte solvent. The rapid release of heat also accelerates chemical reactions, and causes rapid pressure build-up in the battery, resulting in a fire and/or an explosion. [emphasis in italics in original; emphasis added in bold] 174 Ms Lim also explained that, in relation to the cause of F1:223Foot Note 223×Lim Chin Chin’s AEIC Exhibit LCC-2 at p 42 (Fire Investigation Report dated 20 November 2020 at para 81). The risk is amplified by thelarge quantity of batteriesand theunprotected non-intact state of the batteries(bare jelly rolls without metal casings, jelly rolls in unsealed (uncapped) metal casings with no insulating plastic manufacturer labels. These unfinished batteries were more prone to mechanical damage (such as crushing by the claws or tracks of the excavator) and short circuits. [emphasis added] 175 From the foregoing, I find that “but for” the mechanical damage to the Lithium Batteries, the fires and explosion at the Plaintiff’s Premises on 7 June 2017 would not have occurred. As such, there are at least two factors contributing to causation in fact – the presence of the Lithium Batteries and the mechanical damage of the same as a result of the use of the excavator. 176 In my judgment, the “more important” condition between the two contributing factors and the proximate cause is thepresence ofthe Lithium Batteries, andnotthe mechanical damage caused by the plaintiff’s use of the excavator at the Sorting Yard. I agree with the plaintiff that the use of the excavator was merely a link in the chain of events and did not constitute anovus actus interveniens– the effective or proximate causeremainedthe presence of the Lithium Batteries. Therefore, in my judgment, the defendant ought to be made legally responsible for the consequences that have befallen the plaintiff as a result of the defendant’s breach of duty of care. I say so for the following reasons. 177 It must be emphasised that an exercise in determining causation in law (ie, attributing liability) must be done in a principledmanner, bearing in mind therationalefor the requirement, rather than arbitrarily with reference to thefinal actionidentifiable preceding the damage suffered as a matter of strict chronology of events. While the experts’ evidence is helpful in shedding light on the nature of lithium’s reactivity and the plaintiff’s firefighting efforts, expert evidence is not the gospel truth. The issue of attribution of liability is ultimately a legal question to be decided by the court. Thus, even if the expert evidence points to the immediate cause of the fires as the mechanical damage to the Lithium Batteries as a result of using the excavator as the defendant contends, I reject the argument that suchfinal“triggering event” is therefore necessarily alsothe cause of the plaintiff’s damagein law. 178 As a matter of attribution, causation in law seeks to prevent indeterminate liability resulting from causation in fact alone. As the Court of Appeal inArmstrongexplained at [87]: For instance, a necessary condition for a driver to have caused injury to a pedestrian would be the asphalt laid on the road some years back. But it would be absurd to hold the asphalt layer liable for the driver’s negligence. To resolve these difficulties, the courts undertake inquiries intocausation inlaw,which is an attributive question as to whether the defendant should be made responsible for the consequences of his actions that have befallen the plaintiff. [emphasis in bold and italics in original; emphasis added in underline] 179 InProsser and Keeton on the Law of Torts(West Group, 5th Ed, 1984) at p 266, the learned authors explained the concern for indeterminate liability as such: It should be quite obvious that, once events are set in motion, there is, in terms of causation alone, no place to stop. The event without millions of causes is simply inconceivable; andthe mere fact ofcausation, as distinguished from the nature and degree of the causal connection, can provide no clue of any kind to singling out those which are to be held legally responsible. [emphasis added] 180 In the present case, the defendant’s breach of duty of care owed to the plaintiff set off a sequence or chain of events – this included the plaintiff’s collection and processing (pursuant to the Segregation Request) of the waste in Skip Bin A10 on 7 June 2017. In such a case, the court determines whether any of those intervening events “can be said to be so significant causally as to break the causal link to be regarded as anovus actus interveniens” (Sunny Metalat [54]). As regards an allegation that the claimant’s own action constitutes anovus actus interveniens, it is well-established that the applicable test is that the claimant’s act must have been so “wholly unreasonable” that it “eclipses the original wrongdoing and may be deemed to be a wholly independent cause of the damage” (ACB v Thomson Medical Pte Ltd[2017] 1 SLR 961 at [84];TVMedia Pte Ltd v De Cruz Andrea Heidi[2004] 3 SLR(R)543 at [76];PlanAssureat [99]). 181 Bearing these principles in mind, I agree with the plaintiff’s submission that the use of the excavator during the sorting process was not anovus actus interveniens.Such use of the excavator cannot, in my judgment, be said to be so “significant causally” or so “wholly unreasonable” as to eclipse the defendant’s breach of duty of care owed to the plaintiff in the first place. I arrive at this conclusion for several reasons. 182 First, the use of an excavator by the plaintiff at the Sorting Yard cannot be unreasonable,when considered inlight of the context of the plaintiff’s business. While the plaintiff was aware of the risk of the excavator’s tracks running over the general waste224Foot Note 224×Defendant’s CS at paras 219–220.and Mr Cai testified that some general waste “may contain items which pose a fire hazard when crushed”,225Foot Note 225×Defendant’s RS at para 88; Defendant’s CS at paras 221–227.I am not convinced that such awareness is sufficient to find that it was wholly unreasonable of the plaintiff to use an excavator during the segregation process. I emphasise again – context is key. Mr Cai’s testimony at trial was specifically in relation togeneral wastewhich could “include lithium batteries and electrical appliances with lithium batteries component”, for which the use of “excavators and forklift” may result in a fire risk.226Foot Note 226×Day 1 Transcript dated 2 February 2021 at p 90 line 21 to p 91 line 10.That is quite different from the circumstances surrounding the present claim. 183 The plaintiff, as a licenced General Waste collector, handles general waste which, by its very nature, does not spontaneously combust and subsequently explode violently as a result of using an excavator. Such general waste is not expected to contain substantial quantities of flammable, toxic industrial or hazardous waste. As the plaintiff highlights, the use by the plaintiff of an excavator during the process of segregating general waste at the Sorting Yard had not resulted in any fires and explosions prior to 7 June 2017. Thus, the fires and explosions on 7 June 2017 cannot possibly have been a consequence reasonably contemplated by the plaintiff from the use of an excavator during the segregation process of general waste at the Sorting Yard so as to make such use unreasonable in the present circumstances. 184 Secondly, I reject the defendant’s contention that the plaintiff’s use of an excavator is otherwise “improper and/or inappropriate and/or unsafe”. Briefly, I disagree with the fundamental premise which underlies the defendant’s submissions (summarised at [165]). As I have said, the plaintiff reasonably expected the contents of Skip Bin A10 to contain only general waste. The segregation done at the Sorting Yard is merely in respect of bulky non-incinerable general waste from non-bulky incinerable general waste. This is quite unlike the circumstances under which the defendant sorts its Mixed Wastes at the Defendant’s Premises. According to Mr Marcus Tan, the defendant deliberately segregates its Mixed Waste by hand for the following reason:227Foot Note 227×Tan Weide Marcus’ AEIC at para 24. … the reason why the [d]efendant carries out the physical sorting of Mixed Waste by hand, instead of using excavators or forklifts, is because the use of excavators or forklifts may be too “rough”. … Sometimes,in the course of sorting the Mixed Wastes, the excavators or forklifts may crush or compress metal components in the waste, generating small sparks that can ignite the flammable or hazardous items mixed with the general wastes. [emphasis added] 185 I agree with the plaintiff that the defendant’s assertion that the use of an excavator at the Plaintiff’s Premises to segregate non-incinerable general waste from incinerable general waste as improper, inappropriate, or unsafe, is thus fallacious. Just as the defendant contends that F1 broke out only after the tracks of the excavator were observed to move towards the light-coloured packages, it can also be said that such use of the excavator did not cause any of theother wasteat the Sorting Yard to catch fire.228Foot Note 228×Plaintiff’s RS at para 58.It is worth noting that the defendant, in its closing submissions, was prepared to make the concession that the “use of an excavator to sort wastes may notgenerallybe considered unsafe and inappropriate and may well be very common” [emphasis in original]. The defendant argued that the plaintiff’s use of the excavator was “especially egregious” because it knew or should have known that the waste it collects may contain items which pose a safety or fire hazard when crushed.229Foot Note 229×Defendant’s CS at para 215. 186 This argument, however, again pays insufficient regard to the overall evidence and its context. This is not a case involving the odd used or discarded household lithium battery, discarded mobile phone or laptop being found in the general waste – such items may expected to be discarded together with the general waste, as might bulky items such as electrical appliances. The defendant argues that thequantityof the Lithium Batteries is irrelevant to the issue of causation as opposed tothe extentof the fires and explosions that occurred.230Foot Note 230×Defendant’s CS at paras 235–236.I disagree and find this too fine and technical a distinction to make. The substantial quantity of unfinished and unsealed batteries found just inonepackagealready significantly increased the risk of F1starting. The excavator is likely to have crushed several batteries, causing them to short circuit, catch fire and thereby also facilitating or aggravating “thermal runaway”. The quantity of Lithium Batteries in this case is, in my view,directly relevantto the issue of causation. This is not a case in which the plaintiff was expected to handleanyquantity of unfinished or unsealed lithium batteries or battery waste, much less the substantial quantity of the Lithium Batteries that ended up in Skip Bin A10. 187 Further, the issue of causation is not analysed in a vacuum butin relation tothe damage suffered by the plaintiff; in this case, it is the damage caused by metal fires and explosiondue tothe substantial quantity of Lithium Batteries present in Skip Bin A10. In that sense, theextentof the fires and explosion is also relevant to the issue of causation. 188 In my opinion, the plaintiff could not have foreseen or contemplated that the waste at its Sorting Yard would result in lithium metal fires and explosions occurring on 7 June 2017 as a result of the plaintiff’s use of an excavator to sort the waste unloaded from Skip Bin A10, and it would be unreasonable to hold otherwise. The defendant cannot now cry foul and point its fingers at the plaintiff as being the author of its own loss. For the same reasons, I also reject the defendant’s contention that this is a case where it is “difficult to say which of the main causes (ie, the defendant’s breach of duty of care or the plaintiff’s acts) was in fact the primary cause” of the plaintiff’s damage. 189 For all of the reasons set out in this section on causation, the defendant has failed to persuade me that F1, or any of the other fires and the resultant explosion at the Plaintiff’s Premises on 7 June 2017, ought to be properly attributed to theplaintiff’sact as a matter ofcausation in law. The plaintiff’s act of using the excavator during the segregation process at the Sorting Yard, while a link in the chain of events, does not constitute anovus actus interveniens. The plaintiff’s act is not, in my judgment, so wholly unreasonable as to eclipse the defendant’s breach of duty of care which resulted in the Lithium Batteries being dumped into Skip Bin A10. 190 The foregoing is sufficient to conclude the issue of causation.A fortiori, the other related acts summarised at [165] similarly do not satisfy the high threshold for breaking the chain of causation. Accordingly, I need not add to the length of this judgment by elaborating on them further. 191 To conclude this section, I find the defendant legally liable to the plaintiff for the damage suffered as a result of the fires and explosion caused by the presence of the Lithium Batteries at the Plaintiff’s Premises on 7 June 2017. 192 The conclusion above does not mean that the defendant must bear all of the damage suffered by the plaintiff. It is axiomatic that a claimant’s right to recover damages from a negligent tortfeasor is modulated by the extent to which the claimant may itself have contributed to the damage suffered. In the next part of this judgment, I consider whether any of the plaintiff’s actions, particularly its firefighting efforts, amount to contributory negligence so as to reduce the damages to which the plaintiff is otherwise entitled.",
        "Issue 4: Contributory Negligence": "",
        "The applicable legal principles": "193 As I stated at [152], there is some relation between causation in law and contributory negligence. The two are nevertheless conceptually different, as Lord Denning MR explained inFroom v Butcher[1976] QB 286 at 291 (affirmed by the Court of Appeal inParno v SC Marine Pte Ltd[1999] 3 SLR(R) 377 (“Parno”) at [59]): Negligence depends on a breach of duty, whereas contributory negligence does not. Negligence is a man’s carelessness in breach of duty to others. Contributory negligence is a man’s carelessness in looking after his own safety. He is guilty of contributory negligence if he ought reasonably to have foreseen that, if he did not act as a reasonable prudent man, he might hurt himself. 194 As noted by the Court of AppealAsnah bte Ab Rahman v Li Jianlin[2016] 2 SLR 944 (“Asnah”) at [18], a person is guilty of contributory negligence “if he ought to have objectively foreseen that his failure to act prudently could result in hurting himself and failed to take reasonable measures to guard against that foreseeable harm”. However, this does not mean that a claimant is expected to take precautions againstallrisks. On the contrary, the reasonably prudent man only needs to “guard himself against forms of injury thatmight reasonably have been foreseen and avoided” [emphasis added] (at [24]). Contributory negligence thus “connotes a failure by the claimant to take reasonable care for his own personal safetyin all the circumstances prevailing at the time of the accident,such that he is blameworthy to the extent that he contributed to his own injury” [emphasis added] (at [18]). In essence, a claimant cannot be considered blameworthy or contributorily negligent for failing to mitigate against risks which are not reasonably foreseeable. 195 It is only after a defendant successfully makes out the partial defence of contributory negligence that the court would then go on to consider what the appropriate apportionment of liability between the claimant and tortfeasor should be. As the Court of Appeal inParnoaffirmed at [61]: … a court must deal broadly with the problem of apportionment and in considering what is just and equitable, must have regard to the blameworthiness of each party. The claimant’s share in the responsibility for the damage cannot however be assessed without considering the relative importance of his acts in causing the damage apart from his blameworthiness. 196 The Court of Appeal has also since set out two key considerations guiding the court’s discretion in apportioning liability between the claimant and tortfeasor: “the relative causative potency of the parties’ conduct” and the parties’ “relative moral blameworthiness” (Rohini d/o Balasubramaniam v HSR International Realtors Pte Ltd[2018] 2 SLR 479 at [54]). These considerations are to be applied in a “rough and ready manner” since they are “incapable of precise measurement” (Asnahat [118]). 197 The issue of attribution relevant to causation in law is ultimately a question of determining whether the act of the plaintiff amounts to anovus actus intervenienssuch that the defendant ought not to be liable in law for the plaintiff’s damageat all. On the other hand, the issue of contributory negligence is a question of therelativeblameworthiness of each party which contributed to the plaintiff’s damage. Such relative blameworthiness, in turn, depends on the relative importance of that party’s particular acts (or omissions) in causing the damage. 198 The question of whether a plaintiff is contributorily negligent in the circumstances of any case is, by its very nature, an intensely factual one. As the learned author inGary Chanat para 08.083 highlights, the general principle of the “agony of the moment” “may be applied to assess the plaintiff’s conduct at the relevant time”. While the principle of the “agony of the moment” isgenerallyapplied in cases involving collisions (whether on land or at sea), I see no reason why it should be restricted only to such cases. 199 The Court of Appeal had extensively discussed the case law and academic authorities on the principle inThorben Langvad Linneberg v Leong Mei Kuen[2013] 1 SLR 207 at [79]–[102]. As explained inClerk and Lindsell on Torts(Sweet & Maxwell, 20th Ed, 2010) at para 8-144, the situation of responding to an emergency is “relevant to the objective standard of care required” and as such, “[a]ll that is necessary in such a circumstance is that the conduct should not have been unreasonable, takingthe exigencies of the particular situation into account” [emphasis added by the Court of Appeal at [79]]. A similar point was made inCharlesworth & Percy on Negligence(Christopher Walton gen ed) (Sweet & Maxwell, 12th Ed, 2010) at para 4-08 (at [80]): Dilemma created by another’s negligence. … Where, negligently, one party places another in a situation of danger,it does not amount to contributory negligence if the other, in reacting, does something which with the benefit of hindsight, was a less than optimum solution. … Clearly, the more agonising the dilemma in which a claimant is placed, the less critical anyone should be of the consequent reaction. The court will usually balance the risk taken against the consequences of the breach of duty. This could involve weighing the degree of inconvenience or danger to which a person had been subjected, with the risks incurred in an effort to do something about it. [emphasis added by the Court of Appeal in bold italics] 200 The considerations that underpin the “agony of the moment” principle are, in my view, applicablebeyondthe specific examples of collisions involving motor vehicles or ships. None of the case authorities or textbook commentaries referred to above seeks to limit the applicability of the principle to any particular type of factual scenario and I see no principled reason why it should be so limited. It would, in my view, be incongruous for the courts to apply the “agony of the moment” principle only in cases involving collisions when similar dilemmas can and do arise in other contexts. 201 In my judgment, the crucial circumstance is not whether a case concerns a collision but rather whether the claimant faces an exigency caused by another party (usually the tortfeasor) that compels the claimant to take reactive action. The court can and should then have regard to the principle of the “agony of the moment” in considering whether the claimant’s reaction to the particular exigency amounts, in fact and in law, to contributory negligence. 202 In assessing whether a claimant’s acts carried out in the “agony of the moment” amount to contributory negligence, several principles may be distilled: (a) first, the claimant’s dilemma arising from the “agony of the moment” must arise fromanotherparty’snegligence (as opposed to the claimant’s own conduct) and such negligence must have put the claimant in a position of exigency; as such, the principle cannot be utilised to help extricate a claimant who is “responsible for placing himself in a position where he had to agonise what to do” (SeeSoon Soon v Goh Yong Kwang[1992] 1 SLR(R) 535 at [20]). (b) secondly, the applicable test is whether the claimant’s conduct was unreasonable, taking the exigenciesof the particular situation into account; (c) thirdly, the threshold to be satisfiedis a high one– conduct which is considered less than optimumin hindsightis generally insufficient to show that the claimant’s response to the exigency thrust upon it was unreasonable and amounts to contributory negligence; (d) fourthly, the court distinguishes errors of judgment on the one hand and culpable neglect on the other; and (e) fifthly, the more agonising the dilemma in which the claimant is placed, the slower the court would be to find that the claimant’s reaction (or lack thereof) amounted to contributory negligence. 203 From the principles distilled above, it becomes clear that at its core, the “agony of the moment” principle calibratesthe standard of what would be considered an unreasonable responseto the particular momentand exigency faced by the claimant. 204 Reverting to the case at hand, given the circumstances involving unexpected fires at the Sorting Yard from an unexpected source caused by the defendant’s negligence, the principles relating to the “agony of the moment” are, in my view, relevant when assessing whether,inter alia, the plaintiff’s firefighting efforts amounted to contributory negligence. 205 With these principles in mind, I now consider whether the plaintiff’s acts amount to contributory negligence as the defendant contends.",
        "The parties’ submissions": "206 At the outset, I note that the defendant does not seriously contend, whether in its primary or reply closing submissions, that the situation the plaintiff found itself once F1 started constituted an emergency. The defendant’s expert also agreed that the situation the plaintiff was confronted with, at approximately 6.27pm when F1 started, was an emergency.231Foot Note 231×Transcript Day 8 dated 26 February 2021 at p 90, ln 13–20. 207 The defendant avers that the plaintiff was contributorily negligent for several reasons. First,232Foot Note 232×Defendant’s CS at paras 251–253.the plaintiff failed to provide for appropriate fire extinguishers at the Plaintiff’s Premises, namely Class D fire extinguishers. Instead, the Plaintiff’s Premises only had carbon dioxide fire extinguishers and/or Class ABC fire extinguishers, the latter being dry powder extinguishers, and which were used on the day in question. Class D fire extinguishers are specially designed to fight metal fires – they work by coating a very fine layer of copper powder which is applied to a metal fire evenly and gently by a spray nozzle. The copper powder conducts heat away from the metal fire, and is more suitable for fighting a fire emanating from lithium, a reactive alkaline metal. In that regard, the defendant argues that the plaintiff failed to abide by its own Emergency Response Plan, which stipulates that, in the event of a fire outbreak, the type of fire such as “electrical, chemical, etc” ought to be assessed to “determine the appropriate type of fire extinguisher to be used to fight (extinguish) the fire”.233Foot Note 233×1 AB at p 34, para 8. 208 The defendant relies in particular on two case authorities,234Foot Note 234×Defendant’s RS at paras 98–102.Sato Kogyo (S) Pte Ltd and another v Socomec SA[2012] 2 SLR 1057 (“Sato Kogyo”) andUnion Camp Chemicals Ltd v CRL TCL Ltd and another[2001] All ER (D) 95 (“Union CampChemicals”) in its submissions to support its argument. InSato Kogyo, the High Court found that the plaintiff was contributorily negligent “in not arming the FM200 system before they commenced their infra-red thermal imaging work on 27 June 2007” at [80]. The defendant also submits that inUnion Camp Chemicals, the English Court found that the plaintiff was contributorily negligent in failing to “obtain or commission method statements and risk assessments relevant to the commissioning and working of the gas control valve component of the burner management system” and failed to undertake “overall site supervisory functions so as to ensure, so far as was reasonably practicable, that the system would be commissioned safely”. 209 Secondly,235Foot Note 235×Defendant’s CS at paras 254–260, 263.the plaintiff was also contributorily negligent in its firefighting methods in two ways. First, the use of water from the hose reels and water mist system to fight the fires on 7 June 2017 are inappropriate against lithium metal fires (and this was a breach of the plaintiff’s Emergency Response Plan). Furthermore,236Foot Note 236×Defendant’s CS at paras 264–267.the plaintiff failed to recalibrate its firefighting response upon discovering that the source of the fires was the Lithium Batteries. Related to this argument,237Foot Note 237×Defendant’s CS at paras 268–272.the plaintiff failed to alert the SCDF “until it was alreadytoo late” [emphasis in original] and did not do so until after “about four minutes after the explosions had occurred”. The defendant also contends that even if the priority was to ensure that the plaintiff’s workers were safe and none was trapped in the fire immediately after the large explosion occurred, it only takes one person to activate the SCDF. Additionally, the use of an excavator in the firefighting efforts, particularly after F4 started, was also “inappropriate and unsafe” since the plaintiff’s workers were not trained in the proper use of excavators for the purposes of firefighting.238Foot Note 238×Defendant’s CS at paras 261–262. 210 Thirdly,239Foot Note 239×Defendant’s CS at paras 237–238.the plaintiff did not have any “procedure or protocol for sorting waste” at its premises. In this regard, the defendant submits that the plaintiff’s use of an excavator during the segregation process at the Sorting Yard may be reasonable if the plaintiff had applied its mind to the risks of doing so but “came to the (wrong) conclusion that it is reasonably safe to do so for whatever reason or that the costs of not doing so outweighs the risks such that it would not be practical to use other means to sort the wastes”. However, this was not the case. In addition,240Foot Note 240×Defendant’s CS at paras 239–243.even though the plaintiff had a Hazard Identification Document,241Foot Note 241×1 AB at pp 40–54.the steps indicated therein for “hazard identification”, “risk evaluation”, and “risk controls” were “completely for naught as the Plaintiff failed to incorporate any of these principles into its routine operations”. The defendant submits that it is “wholly unsafe and even reckless” for the plaintiff to have collected, handled, sorted, segregated and disposed of waste collected from its customers without assessing the risks which may arise from such processes [emphasis in original]. 211 In response, the plaintiff submits that its earlier submissions regarding its conduct (in relation to causation) remain relevant to the issue of contributory negligence.242Foot Note 242×Plaintiff’s CS at para 117.Regarding the lack of Class D fire extinguishers at the Plaintiff’s Premises,243Foot Note 243×Plaintiff’s CS at para 119–120.the plaintiff rejects the notion that it could have foreseen the risk of lithium metal battery fires from the large quantities of the Lithium Batteries found at its Sorting Yard on 7 June 2017; hence that was not a risk it could have “objectively foreseen and protected itself from”. The plaintiff had in place “fire extinguishers and water hose reels” which “had been approved by the SCDF for purposes of issuing a Fire Safety Certificate”. At the Sorting Yard, the plaintiff also had a “water mist system” which was activated on 7 June 2017 as part of its firefighting efforts. 212 The plaintiff also argues that in any case, it is not reasonable to expect the plaintiff, which is in the business of handling onlygeneral waste, to have a specific Class D subtype fire extinguisher at the Plaintiff’s Premises designed to fight lithium metal fires, particularly when it was not foreseeable that they would be collecting toxic industrial or hazardous waste such as lithium batteries as part of their normal business activities.244Foot Note 244×Plaintiff’s CS at para 135. 213 Secondly, the plaintiff was not contributorily negligent in its firefighting efforts. In assessing the reasonableness of the plaintiff’s firefighting efforts, the following factors had to be considered: (a) the context of it being an emergency situation, (b) the plaintiff’s expectation of what the waste unloaded from Skip Bin A10 should contain, (c) the plaintiff’s Emergency Response Plan requiring that SCDF be contacted only where the “extent of the accident is beyond the capability of the staff to contain or mitigate”,245Foot Note 245×1 AB at p 35and (d) the perceived effectiveness of the firefighting methods used. Thus, even if the plaintiff’s firefighting methods may not be “scientifically correct or correct in hindsight”, the plaintiff’s response was nevertheless reasonable or prudentduringthe emergency situation it was confronted with. In any case, the SCDF also used water as part of its firefighting operations on 7 June 2017.  Further, Mr Tan Jin Thong, an expert in firefighting, testified that the use of an excavator is “the best and most effective way [of] isolating fire” so as to prevent further spread of the fire. As such, the spread of the fire was more likely due to the ejection of hot or burning materials, rather than the use of an excavator.246Foot Note 246×Plaintiff’s CS at paras 151–154.Lastly, howthedefendantwould have responded to the same emergency is irrelevant.247Foot Note 247×Plaintiff’s CS at paras 132–135. 214 The plaintiff also highlighted that it is not disputed that fires F1, F2 and F3 were successfully extinguished by the plaintiff’s workers using,inter alia, water from hose reels and the available fire extinguishers. Thus, the “reasonable perception” of the plaintiff’s workers on the ground at the material time of the fires, and at least up to the extinguishment of F3, was that there was no “uncontrollable fire” and “the methods and media that they used to fight the fire was (sic) indeed effective”.248Foot Note 248×Plaintiff’s CS at paras 136–137, 139 and 141.In any case, the SCDF also used “water and foam” in its firefighting efforts despite the intensity of the metal fire by the time the SCDF arrived on scene.249Foot Note 249×Plaintiff’s CS at paras 144–149. 215 Further,250Foot Note 250×Plaintiff’s CS at paras 138, 140.the plaintiff also argues that it could not be reasonably expected of the plaintiff’s workers to identify the type of fire to determine that water is an inappropriate firefighting medium. In this regard, Ms Lim’s expert evidence is that a noticeable characteristic of a lithium metal fire is its colour – the fire develops from “crimson” to “dazzling white”, whereas the colour of general fires would be “orangey”. Lay persons and general workers cannot be expected to reasonably notice the “difference between a flame that isorangeyas opposed to a flame that iscrimson” [emphasis added]. Even if some of the plaintiff’s workers had picked up the light-coloured packages and looked into its contents, the plaintiff’s staff “would not have reasonably appreciated the contents of the packages to signify the fires were metal fires”. 216 The plaintiff reiterates that its workers “had no reason to call the SCDF” even up to F3. Even on Ms Lim’s evidence, F3 cannot be considered an “uncontrollable” fire. Furthermore, F1 and F2 were successfully extinguished by the plaintiff’s firefighting methods. The other fires, F4 to F6, ignited shortly after that and became very intense suddenly and within a very short span of time of less than two minutes (ie, from 18:36:33 when F4 ignited to 18:37:55 when the large explosion occurred).251Foot Note 251×Plaintiff’s CS at paras 141, 143.Mr Cai’s call to the SCDF (ie, at about 6:41:59pm) was about four minutes after the large explosion and is not unreasonable, given that the “priority was to ensure that the workers were safe and not trapped in the fire” following the explosion. In any event, the SCDF took about five minutes to reach the Plaintiff’s Premises after the call and thus, calling SCDF immediately after the explosion even without a four-minute gap would have made “no difference to the extent of the fire and the resulting loss and damage” suffered.252Foot Note 252×Plaintiff’s CS at paras 159–160.Thus, the plaintiff did not alert the SCDF so belatedly that it amounted to contributory negligence. 217 The plaintiff was also not contributorily negligent for any alleged lack of protocol for segregating waste and conducting risk assessments in relation to such segregation. On the contrary, the plaintiff highlights that whilede minimisquantities of Prohibited Waste in any given skip bin may be foreseeable (such as, for example, stray batteries in general waste collected from the plaintiff’s customers), the plaintiff could not have reasonably foreseen the presence of the substantial quantities of the Lithium Batteries.  Accordingly, there would be “no reason to change” the plaintiff’s standard methods of processing general waste containing bulky non-incinerable items.253Foot Note 253×Plaintiff’s CS at para 124.This also included its practice of notchecking light-coloured bags, since it is not unusual to see light-coloured bags amongst waste unloaded from a skip bin since the plaintiff also deals with food waste. Such light-coloured bagsper secould not have “put the plaintiff on notice that there was something dangerous inside the bags”.254Foot Note 254×Plaintiff’s CS at para 125. 218 Lastly, there was no need to reconsider the risks involved in using an excavator for the segregation of non-incinerable general waste from incinerable general waste as compared to, for example, segregating such waste by hand. In reasonably expecting Skip Bin A10 to contain only general waste, the plaintiff could only objectively foresee biological hazards (such as bacteria and viruses) and mechanical hazards (such as sharp objects). In that regard, Mr Cai testified that he would not manually sort through the general waste by hand unless he was sure that it was safe.255Foot Note 255×Plaintiff’s CS at para 128.Finally, there have been “no other fires” at the Plaintiff’s Premises despite the many years in which the plaintiff had used an excavator to sort general waste.256Foot Note 256×Plaintiff’s CS at para 121.",
        "Pre-judgment interest": "240 The applicable principles on whether pre-judgment interest ought to be awarded under s 12 of the CLA are well-established and have been summarised by the Court of Appeal inGrains and Industrial Products Trading Pte Ltd v Bank of Indiaand another[2016] 3 SLR 1308 at [137]–[141]. While pre-judgment interest is not awarded “as of right”, claimants who have been “kept out of pocket without basis should be able to recover interest on money that is found to have been owed to them from the date of their entitlement until the date it is paid” (at [138]). 241 In its Statement of Claim (Amendment No.1), the plaintiff claims interest pursuant to s 12 of the CLA. The defendant made no specific submissions in respect of whether pre-judgment interest ought or ought not to be awarded. As a matter of principle, the right to damages for the tort of negligence runs from the date of loss. I am satisfied that it would be appropriate in this case to allow pre-judgment interest on the Claim Amount and for such interest to run from 8 June 2017 (ie, the day immediately after the date of the incident).",
        "Conclusion": "242 On the evidence before me, I am satisfied that the Agreement was for the plaintiff to collect, process (if necessary), and dispose of the defendant’s general waste only, and that the Segregation Request made by the defendant on 7 June 2017 to the plaintiff was to segregate bulky non-incinerable general waste from incinerable general waste. 243 In all of the circumstances of the present case, I am satisfied that the defendant owed the plaintiff a duty of care to ensure that only general waste was disposed of into Skip Bin A10 for the plaintiff’s collection, processing (if necessary) and disposal. In breach of such duty, a substantial quantity of the Lithium Batteries (weighing at least 200 kilograms) was disposed of into Skip Bin A10 while it was at the Defendant’s Premises some time between 6 and 7 June 2017. That, in turn, resulted in the fires and explosion that occurred at the Plaintiff’s Premises following the unloading of the waste from Skip Bin A10 at the Plaintiff’s Premises shortly after 6.20pm on 7 June 2017. The plaintiff’s subsequent actions were not so wholly unreasonable so as to constitute anovus actus interveniens. Nor was the plaintiff careless in looking after its own safety as to be contributorily negligent for the damage caused to the Plaintiff’s Premises by the fires and the ensuing explosion. 244 Whilst the plaintiff’s Contract Claim fails, its Negligence Claim succeeds and the defendant is accordingly liable to the plaintiff for the Claim Amount. I therefore grant judgment in favour of the plaintiff against the defendant for the sum of S$579,641.50, plus interest on that sum at the rate of 5.33% per annum from 8 June 2017 to the date of judgment. 245 I shall hear the parties separately on costs. S MohanJudicial Commissioner S Selvam s/o Satanam and Amraesh Arun Balachandran (Ramdas & Wong) for the plaintiff; Wang Ying Shuang and Osman Khan (Rajah & Tann Singapore LLP) for the defendant.",
        "Annex 1: Photographs of the Lithium Batteries": "A.1 Lithium Batteries with unsealed outer metal casings:   A.2 Unfinished Lithium Batteries with no metal casings:",
        "Annex 2: Screenshots from CCTV Footage": "A.3 Footage from Camera 13 of F4 fire at 18:37:54 (18:31:54 CCTV time):   A.4 Footage from Camera 13 of explosion at 18:37:55 (18:31:55 CCTV time):",
        "Annex 3: Photographs of Packages Containing the Lithium Batteries": "A.5 Packages labelled “Lithium Foil UN 1415”:",
        "Annex 4: Photographs of Packages Containing the Lithium Batteries": "A.6 Package labelled “Jelly Roll with Lithium”:",
        "Annex 5: Screenshots from CCTV Footage (Plaintiff’s Sorting Yard)": "A.7 Footage from Camera 2 at 18:23:41 (18:17:41 CCTV time):   A.8 Footage from Camera 13 at 18:24:33 (18:18:33 CCTV time):"
    }
}