{
    "case_title": "Public Prosecutor vGaiyathiri d/o Murugayan",
    "ncitation": "[2021] SGHC 187",
    "coram": "See Kee Oon J",
    "sections": {
        "Facts": "3 At the time of the offences, the Accused was a 36-year-old homemaker. The Deceased, Piang Ngaih Don, was a 24-year-old single mother from Myanmar, who was employed in the Accused’s household as a domestic worker at the material time.2Foot Note 2×Statement of Facts at [1]. 4 The Accused and the Deceased resided in a three-bedroom flat (“the flat”) along with the Accused’s husband, Kevin Chelvam (“Kevin”), the Accused’s mother, Prema d/o S Naraynasamy (“Prema”), as well as the Accused’s two young children (“the children”).3Foot Note 3×Statement of Facts at [3].At the material time, there were also two tenants residing in one of the bedrooms in the flat.4Foot Note 4×Statement of Facts at [4]. 5 The Deceased began her employment in the Accused’s household on 28 May 2015. She had no prior experience working outside Myanmar.5Foot Note 5×Statement of Facts at [7].As a condition of employment, the Deceased agreed to forgo having a handphone or any days off, in exchange for higher pay.6Foot Note 6×Statement of Facts at [7].Kevin was the Deceased’s registered employer, and the Deceased’s duties included household chores in addition to assistance with the care of the two children, who were four years old and one year old respectively in July 2016. The Accused was responsible for the day-to-day care, supervision, and welfare of the Deceased.7Foot Note 7×Statement of Facts of [8]. 6 Early into the Deceased’s employment, the Accused became unhappy with the Deceased as she perceived her to be slow, to have poor hygiene practices, and to eat too much. The Accused established strict rules concerning hygiene and order in the flat, and would get angry with the Deceased whenever she perceived the latter to have disobeyed those rules.8Foot Note 8×Statement of Facts at [9].At the start, the Accused would raise her voice and shout at the Deceased when she was upset with her, but this escalated to physical abuse from October 2015 onwards.9Foot Note 9×Statement of Facts at [10]. 7 Through closed-circuit television (“CCTV”) cameras installed throughout the flat by the Accused and Kevin to monitor the Deceased and the children,10Foot Note 10×Statement of Facts at [11].35 days’ worth of video camera footage (“CCTV footage”) was retrieved in the course of investigations. The CCTV footage documented the extensive abuse and ill-treatment inflicted upon the Deceased from 21 June 2016 till the Deceased’s eventual demise on 26 July 2016.11Foot Note 11×Statement of Facts at [12]. 8 All 115 charges preferred against the Accused involved specific instances of abuse which were captured on CCTV. The particulars of the 115 charges are summarised in a table at Annex A to the Statement of Facts. I set out in the following paragraphs an outline of the facts pertaining to the 28 proceeded charges.",
        "Use of criminal force under s 352 of the Penal Code (DAC-902724-2018)": "9 On 21 June 2016 at about 9.58pm, while the Deceased was in the kitchen toilet, the Accused took a bottle of cold water from the refrigerator and poured it over the Deceased’s head, before scolding her to “wake her up”.12Foot Note 12×Statement of Facts at [13].",
        "Criminal intimidation under s 506 of the Penal Code (DAC-902770-2018)": "10 On 13 July 2016 at about 4.30pm, the Accused felt that the Deceased had not properly wiped the stove and kitchen tiles. The Accused called the Deceased to the kitchen and proceeded to slap, scold, and pinch the Deceased on her stomach, before pointing a kitchen knife at the Deceased, intending to cause her alarm. This last act was the basis of the s 506 charge. The Deceased retreated to the back of the kitchen where she was subjected to more physical abuse, part of which formed the subject-matter of a separate charge in DAC-902771-2018 for voluntarily causing hurt.13Foot Note 13×Statement of Facts at [15]-[16].",
        "Voluntarily causing hurt by means of a heated substance under s 324 read with s 73(2) of the Penal Code (DAC-902753-2018)": "11 On 24 June 2016 at about 7.51am, while the Deceased was ironing clothes, the Accused knocked the Deceased on her head once with her hand. The Accused returned later and took the heated steam iron and pressed it against the Deceased’s forehead, whilst scolding the Deceased for having presumably burnt the Accused’s items. She then pressed the iron onto the Deceased’s right forearm.14Foot Note 14×Statement of Facts at [18].",
        "Voluntarily causing hurt under s 323 read with s 73(2) of the Penal Code": "12 On 22 other occasions, the Accused had voluntarily caused hurt to the Deceased, or had abetted Prema to voluntarily cause hurt to the Deceased, or had voluntarily caused hurt to the Deceased together with Prema in furtherance of the common intention of them both.15Foot Note 15×Statement of Facts at [21]-[24].These 22 charges were summarised and tabulated at paragraph 21 of the Statement of Facts. 13 Among the acts enumerated in the 22 charges, the Accused had on various occasions punched, slapped and kicked the Deceased. She had also hit the Deceased on multiple occasions on the body using her bare hands as well as with implements such as clothes hangers, a plastic bottle, a broomstick, a metal ladle or other household items. In some instances, the Deceased was assaulted on vulnerable parts of her body, such as her head, neck and groin. 14 Notably, on numerous occasions, the Accused had grabbed the Deceased by her hair and shaken her back and forth or from side to side and spun her head around, followed by hitting and/or kicking the Deceased as well as stamping on her body after she had fallen to the floor. She had also dragged the Deceased by her hair across the floor.",
        "Wrongful restraint under s 341 of the Penal Code (DAC-902830-2018)": "15 On 15 July 2016 from 12.26am to 5.41am, the Accused used a piece of string to tie the Deceased’s hand to the window grille, in order to prevent the Deceased from leaving the bedroom at night. When the Deceased begged the Accused not to tie her up, the Accused hit her and scolded her, and told her she deserved to be tied up as she had been sneaking out at night to take food. The Deceased was tied to the window grille for the 12 nights preceding her death on 26 July 2016. The Accused had disposed of the piece of string after the Deceased’s death before the police arrived as she was worried that her act of tying up the Deceased would be discovered.16Foot Note 16×Statement of Facts at [25]-[27].",
        "Voluntarily causing grievous hurt by starvation under s 325 read with s 73(2) of the Penal Code (DAC-902842-2018)": "16 For at least the 35 days preceding the Deceased’s death, the Accused had not provided the Deceased with sufficient food. The Deceased’s meals often comprised only sliced bread soaked in water, cold food from the refrigerator or some rice at night. The Deceased weighed 39 kg when she was first employed on 28 May 2015. She lost 15 kg during the 14 months she was employed in the Accused’s household, weighing a mere 24 kg at the time of her demise.17Foot Note 17×Statement of Facts at [29]. 17 In the autopsy on the Deceased which was conducted on 27 July 2016 by Dr George Paul (“Dr Paul”), the forensic pathologist, the Deceased was noted to be emaciated and in a poor nutritional state. In Dr Paul’s opinion, if the Deceased was subjected to further starvation, it would have resulted in severe and debilitating starvation changes which would lead to progressive multi-organ failure and, if left untreated, death. There was no evidence that the Deceased had any chronic or debilitating illness, pre-existing infection or disease which would result in her poor nutritional state of emaciation.18Foot Note 18×Statement of Facts at [30]-[31].",
        "Culpable homicide under s 304(a) of the Penal Code": "18 On 25 July 2016, at about 11.40pm, the Deceased was doing laundry in the kitchen supervised by the Accused, when the Accused felt that the Deceased was working too slowly and proceeded to assault her by hitting her once on her neck with a clenched fist and pulling her hair. When the Accused noticed the Deceased swaying at the entrance to the kitchen toilet from the impact of the blows, the Accused told the Deceased not to “dance” and hit her on the head with a detergent bottle, causing the Deceased to fall backwards and become disorientated. When the Deceased attempted to stand, her legs gave out from under her.19Foot Note 19×Statement of Facts at [35]. 19 The Accused ordered the Deceased to get up from the toilet floor but she was unable to stand. The Accused called Prema over, who again ordered the Deceased to get up. Prema and the Accused then proceeded to pour a basin of water on the Deceased and sprayed water at her from the toilet hose in an attempt to wake her up. Prema told the Deceased to change out of her wet clothes, but as the Deceased was too weak to stand, Prema dragged her from the kitchen floor to the bedroom. In the bedroom, the Accused kicked the Deceased in her stomach, while Prema punched the Deceased’s neck and strangled her.20Foot Note 20×Statement of Facts at [36].The Deceased asked for dinner, but she was denied food.21Foot Note 21×Statement of Facts at [37]. 20 At about 11.58pm, the Accused used a piece of string to tie the Deceased’s hand to the window grille. As she was doing so, she kicked the Deceased on the stomach, before leaving the Deceased to lie on the floor in her wet clothes.22Foot Note 22×Statement of Facts at [38]. 21 On 26 July 2016 at about 12.11am, the Accused entered the bedroom and kicked the Deceased once, telling her to wake up when the alarm rang.23Foot Note 23×Statement of Facts at [39].Between 4.57am and 5.00am, the Accused became angry with her failed attempts to wake the Deceased up. She proceeded to kick the Deceased and stomp on her head and neck area repeatedly, lifting up her body and grabbing her by her hair, extending the Deceased’s neck backwards repeatedly, as well as strangling her intermittently.24Foot Note 24×Statement of Facts at [40].Prema was in the bedroom and also tried to wake the Deceased up. As the Deceased remained unresponsive, both the Accused and Prema became concerned. At about 5.02am, the Accused poured a bottle of water over the Deceased’s face in a further attempt to wake her up.25Foot Note 25×Statement of Facts at [41]. 22 At about 7.28am, the Accused and Kevin came to check on the Deceased as she had remained motionless. Kevin then left for work. At about 9.22am, Prema propped the Deceased up against the bed and attempted to feed her some “Nestum” cereal drink and tried to warm her hands and legs to revive her. As the Deceased remained motionless, Prema suggested that they call a doctor.26Foot Note 26×Statement of Facts at [43]. 23 Between 9.30am to 9.45am, the Accused called a nearby general practitioner (“GP”) clinic, to request for the GP to make a house call. The GP in question was Dr Grace Kwan Wai Chee, and she had seen the Deceased at the GP clinic when the Accused brought her there for a medical check-up on 23 May 2016. The Accused falsely told the clinic nurse that she found the Deceased on the kitchen floor when she woke up and believed that the Deceased may have fallen. She claimed that the Deceased was in and out of consciousness and was still moving. She was told that the GP would not be available for at least the next 30 to 45 minutes, and was advised to call for an ambulance instead. However, the Accused insisted on waiting for the GP to attend to the Deceased.27Foot Note 27×Statement of Facts at [44]. 24 The Accused and Prema changed the Deceased out of her wet clothes while waiting for the GP. At about 10.08am, they carried the Deceased out of the bedroom and lay her on the sofa in the living room.28Foot Note 28×Statement of Facts at [45]. 25 At about 10.50am, the GP arrived at the flat, and found that the Deceased did not exhibit any signs of life. The GP informed the Accused and Prema that the Deceased was dead.29Foot Note 29×Statement of Facts at [47].They expressed shock and claimed that the Deceased had been moving minutes before the GP arrived. The GP advised them to call the police to report the Deceased’s death, but they asked if they could call an ambulance instead. The GP insisted that they should call the police and said that she would remain in the flat until the police arrived. The Accused remained hesitant. She called Kevin and informed him what had happened and Kevin said that he would return home immediately.30Foot Note 30×Statement of Facts at [48]. 26 The GP asked the Accused if she had beaten the Deceased but the Accused denied having done so. The GP then decided to call the emergency services herself. She asked Prema if the Deceased had been fed as she appeared very thin and appeared to have lost weight compared to when she was last seen at the GP clinic on 23 May 2016. Prema replied that the Deceased ate a lot. The paramedics arrived at about 11.26am, and pronounced the Deceased dead at 11.30am on 26 July 2016.31Foot Note 31×Statements of Fact at [47]-[51]. 27 The police arrived shortly after at 11.31am. The Accused told the police that she had found the Deceased lying on the kitchen floor that morning and had called Prema to help carry the Deceased to the sofa. When asked why she did not call an ambulance, the Accused said that the Deceased’s condition was not serious, but she was only weak, and hence they decided to call the GP instead.32Foot Note 32×Statement of Facts at [51].",
        "Autopsy report": "28  An autopsy was performed by Dr Paul on 27 July 2016 at 11.44am at the mortuary, and the cause of the Deceased’s death was documented as hypoxic ischaemic encephalopathy following severe blunt trauma to the neck. In addition, 31 recent scars and 47 external injuries were found on all parts of the Deceased’s body.33Foot Note 33×Statement of Facts at [53].In particular, the autopsy found that the Deceased’s neck region was extensively emaciated with loss of contours of neck muscles. There were multiple abrasions and bruises to various parts of the neck, including crescentic shaped abrasions consistent with those from fingernails, as well as a recent fracture of the hyoid bone.34Foot Note 34×Statement of Facts at [54]-[55]. 29 According to Dr Paul, the injuries to the body ranged from fresh or very recent injuries to those which were more than a month old. All the injuries were the result of some blunt force, save for those on the right forearm which were related to contact with a heated steam iron. Dr Paul opined that the injuries to the neck as well as the other injuries sustained by the Deceased were collectively sufficient, in the ordinary course of nature, to cause death in the manner described.35Foot Note 35×Statement of Facts at [56]-[59]. 30 In particular, Dr Paul opined in his further report dated 10 November 2017 that the manner in which the Deceased was held by the neck by the Accused on 26 July 2016, with her head pulled back by the hair and being shaken “like one shakes a rag doll”, would appear to be the most likely assault that resulted in the fracture of the Deceased’s hyoid bone. Such a fracture would not be fatal by itself but would indicate a very violent compression or blow to the upper front and side of the neck. The extensive force could have led to irreversible damage changes in the Deceased’s brain, and her poor nutritional state compounded her inability to tolerate the repeated trauma to her neck, leading to hypoxic ischaemic encephalopathy which resulted in death.36Foot Note 36×Statement of Facts at [58].",
        "Diminished responsibility – the Accused’s psychiatric conditions": "31 After the Accused’s arrest, she was assessed by several psychiatrists who diagnosed her to have suffered from major depressive disorder (“MDD”) with peripartum onset of moderate severity, as well as obsessive compulsive personality disorder (“OCPD”).37Foot Note 37×Statement of Facts at [60]-[62].It was agreed by both the Prosecution and the Defence that the findings of Dr Derrick Yeo in his psychiatric report of 14 July 2019 were reflective of the Accused’s mental state.38Foot Note 38×Statement of Facts at [64].Both her psychiatric conditions of MDD and OCPD were deemed to have had asubstantial contributionto the commission of the offences.39Foot Note 39×Prosecution’s bundle of documents (“PBD”) at p 108. 32 Nevertheless, Dr Derrick Yeo opined that the Accused was not of unsound mind at the time of the offences and was fit to plead. She was cognisant of her actions and purposeful in her conduct. She did not lack capacity to comprehend what she was doing. Although Dr Derrick Yeo found that her mental responsibility was partially impaired, she was assessed to be able to exercise conscious deliberation and volitional control throughout the commission of her offences.40Foot Note 40×PBD at p 108.Accordingly, in Dr Derrick Yeo’s view, the defence of diminished responsibility under Exception 7 to s 300 of the Penal Code was applicable to the accused.41Foot Note 41×PBD at p 109.Although the Accused had initially faced a murder charge, the Prosecution eventually proceeded on a charge of culpable homicide not amounting to murder.",
        "Brief procedural background": "33 The Accused admitted to all the foregoing matters which were set out in the Statement of Facts without qualification, and I convicted her on all 28 proceeded charges, after recording her plea of guilt on 23 February 2021. Having heard full submissions on sentencing by the Prosecution, as well as the Defence’s mitigation plea, I adjourned the matter to deliberate on the appropriate sentence. 34 On 2 March 2021, the Accused’s counsel on record (Mr Sunil Sudheesan and Ms Diana Ngiam (collectively “former counsel”)) wrote to inform the court of “certain issues” that had arisen relating to the hearing on 23 February 2021. I convened a case conference on 15 March 2021 where her former counsel applied to discharge themselves from acting for the Accused. I was informed that Mr Joseph Chen (“Mr Chen”) had been instructed by the Accused’s family to act for her in their place. 35 The Accused was present at this case conference but she did not appear to have communicated hitherto with Mr Chen or given him any instructions. She appeared undecided as to whether Mr Chen should take over the conduct of her case. In any event, Mr Chen had not been instructed by the Accused or her family to appear on her behalf at the case conference. I therefore convened a further case conference on 30 March 2021 so that Mr Chen could be present as well. On 30 March 2021, the Accused confirmed her intention for Mr Chen to act for her, whereupon I permitted her former counsel to discharge themselves. 36 Mr Chen formally took over conduct of the matter on 30 March 2021. He stated that his instructions were to further mitigate for the Accused and requested for time to take her instructions. A sentencing mention was scheduled for 29 April 2021 but Mr Chen’s instructions appeared to have shifted after 30 March 2021, from presenting a further plea in mitigation to seeking a reduction of the s 304(a) charge. It would appear from this that the Accused had sought to either qualify or retract her plea of guilt to the s 304(a) charge. After obtaining further clarification from the Accused, Mr Chen confirmed on 29 April 2021 that her instructions to him were not to qualify or retract her plea of guilt but only to further mitigate on her behalf. 37 The matter was then fixed for a further mention on 22 June 2021. I gave directions for a further written mitigation plea to be filed by 28 May 2021 and for the Prosecution to file reply submissions if necessary by 14 June 2021. Due to additional COVID-related restrictions which affected his ability to see the Accused in May 2021, Mr Chen filed the further plea in mitigation on 8 June 2021 (“the further plea”). The Prosecution informed me that no further written reply submissions on their part were necessary, but reserved their right to make an oral reply.",
        "The parties’ submissions on sentence": "",
        "Prosecution’s submissions": "38 The Prosecution submitted that the primary sentencing considerations were those of general deterrence and retribution.42Foot Note 42×Prosecution’s sentencing submissions at [4].In particular, general deterrence was warranted in view of the fact that the case had involved the abuse of a domestic helper,43Foot Note 43×Prosecution’s sentencing submissions at [6].and retribution was warranted in view of the extent of harm inflicted on the Deceased by the Accused.44Foot Note 44×Prosecution’s sentencing submissions at [8].The Prosecution’s submissions sought to characterise the offences as one of the “worst types of cases of culpable homicide”,45Foot Note 45×Prosecution’s sentencing submissions at [13].in view of the horrific abuse and torture,46Foot Note 46×Prosecution’s sentencing submissions at [17]-[18].the duration and intensity of the physical abuse,47Foot Note 47×Prosecution’s sentencing submissions at [23].the psychological harm,48Foot Note 48×Prosecution’s sentencing submissions at [29].and blatant disregard of life on the part of the Accused.49Foot Note 49×Prosecution’s sentencing submissions at [37].With regard to the Accused’s psychiatric conditions, the Prosecution argued that this was not a material mitigating factor as it had already been taken into account in the reduction of the charge,50Foot Note 50×Prosecution’s sentencing submissions at [43]-[44].and that it did not displace the need for deterrence and retribution.51Foot Note 51×Prosecution’s sentencing submissions at [51].Finally the Prosecution also submitted that the s 304(a) charge when considered in totality with the rest of the proceeded charges would have tipped the balance towards imposing a sentence of life imprisonment on the Accused.52Foot Note 52×Prosecution’s sentencing submissions at [93].Alternatively, the Prosecution submitted that if the court was not minded to impose a sentence of life imprisonment, the global sentence of imprisonment should not be less than 27 years.",
        "Defence’s submissions": "39 Through her former counsel, the Accused submitted that the primary sentencing principles should be those of retribution and rehabilitation.53Foot Note 53×Mitigation plea at [10].In contrast to the Prosecution’s submissions, it was submitted that sufficient mitigatory weight had to be placed on her mental condition,54Foot Note 54×Mitigation plea at [57].and that the principle of deterrence had limited application in the present case as the Accused was suffering from a mental disorder.55Foot Note 55×Mitigation plea at [86].Furthermore, it was argued that this case could not be considered as one of the worst types of culpable homicide,56Foot Note 56×Mitigation plea at [106].and that in deciding if the Accused should be sentenced to life imprisonment, the court had to consider theHodgsoncriteria laid down by the English Court of Appeal inR v Rowland Jack Forster Hodgson(1968) 52 Cr App R 113 (“Hodgson”) at 114.57Foot Note 57×Mitigation plea at [128].In summary, through her former counsel, the Accused had initially submitted that she should be sentenced to not more than 14 years’ imprisonment.58Foot Note 58×Mitigation plea at [10]. 40 In the further plea, Mr Chen sought to reiterate the point made by her former counsel that the Accused did not have a prior history of maid abuse.59Foot Note 59×Further Plea in Mitigation at [2].In addition, he submitted that the Accused’s increased anxiety over the health and welfare of her children and perceived lack of good hygiene on the part of the Deceased as a cause of her children’s various illnesses had played a significant part in her commission of the offences.60Foot Note 60×Further Plea in Mitigation at [11]-[14].Mr Chen had also argued that rehabilitation should be the primary sentencing consideration,61Foot Note 61×Further Plea in Mitigation at [19].and had asked for a gag order in order to protect the Accused’s children from the possible stigmatisation which may result from the significant media attention the case had drawn.62Foot Note 62×Further Plea in Mitigation at [22].Through Mr Chen, the Accused revised her position as to the appropriate sentence and submitted that a global sentence of eight to nine years’ imprisonment would be sufficient.63Foot Note 63×Further Plea in Mitigation at [28].These positions were adopted during the sentencing mention on 22 June 2021. 41 In addition, on 30 March 2021, in a handwritten mitigation plea submitted by the Accused, the Accused had made reference to her personal circumstances, such as the fact that Kevin had begun divorce proceedings, that her children were having a hard time coping in school, and that her mother had to undergo treatment for a kidney ailment while in remand. In her handwritten mitigation plea, the Accused also alleged physical abuse at the hands of her fellow inmates while in remand, as well as unhappiness at the discharge of her former counsel.64Foot Note 64×Accused’s Written Mitigation dated 30 March 2021.This last point was apparently overtaken by events, given that the Accused had confirmed at the case conference on 30 March 2021 that she had no objections to her former counsel’s discharge, with Mr Chen taking over conduct of the matter henceforth. 42 At the sentencing mention on 22 June 2021, the Accused further confirmed through Mr Chen that she would rely on all three written mitigation pleas (ie, those filed by her former counsel, Mr Chen as well as her handwritten mitigation plea).",
        "Issues to be determined": "43 In determining the sentence, I considered all three written mitigation pleas, the oral submissions of both the Accused’s former counsel and Mr Chen on 23 February 2021 and 22 June 2021 respectively, as well as the submissions of the Prosecution. The two key issues which arose before me were: (a) the applicable sentencing principles in the present case; and (b) the mitigatory weight to be placed on the accused’s psychiatric conditions.",
        "The applicable sentencing principles in the present case": "44 InADF v Public Prosecutorand another appeal[2010] 1 SLR 874 (“ADF”), VK Rajah JA stated in the majority decision of the Court of Appeal at [55], that “[i]n a case of domestic maid abuse, ordinarily, the principles of deterrence and retribution take precedence” over the other principles of prevention and rehabilitation, subject to the proviso that “[i]n every sentencing decision, a court has to judiciously assess which of the four principles apply, the interplay which these principles have with the factual matrix and how much weight they should be given before being applied to the matter at hand” (seeADFat [54]). 45 Notwithstanding the holding inADFset out above, in sentencing a mentally disordered offender, it must also be remembered that there will be an ongoing tension between the sentencing principles of deterrence and rehabilitation. In this regard, the Court of Appeal inLimGhim Peow v Public Prosecutor[2014] 4 SLR 1287 (“LimGhim Peow”) at [26], has also stated that the element of general deterrence “maybe given considerably less weight” [emphasis in original], as an offender who suffers from a mental disorder is usually not an appropriate object for exemplary punishment (at [27]). Similarly, the sentencing principle of specific deterrence would generally be of limited application in cases involving mentally disordered offenders, as it is premised on the assumption that the offender can balance and weigh the consequences before committing an offence (seeLimGhim Peowat [36]). 46 However, it is not the case that the element of general deterrence can never be accorded full weight in sentencing a mentally disordered offender, and much would depend on the circumstances of the case (seeLimGhim Peowat [35]). Pertinently, the Court of Appeal emphasised inLimGhim Peowat [35] that “[i]f the nature of the mental disorder is such that it does not affect the offender’s capacity to appreciate the gravity and significance of his criminal conduct, the application of the sentencing principle of general deterrence may not be greatly affected”. 47 With the above observations in mind, it remained apposite in the present case to have regard to the relevant aggravating factors set out by the Court of Appeal when sentencing maid abusers (seeADFat [91]): (a) where serious injury and/or trauma was occasioned; (b) where there was use of weapons or objects in causing hurt; (c) the degree of abuse of position or authority; (d) the prolonged abuse over a period of time, especially if the severity of the abuse escalates over time; (e) where mental abuse takes place in conjunction with physical abuse; (f) the absence of genuine remorse.",
        "The mitigatory weight to be placed on the accused’s psychiatric conditions": "48 The Prosecution had characterised the Accused’s acts as “one of the worst (if not the worst) incidents of culpable homicide”,65Foot Note 65×Prosecution’s sentencing submissions at [41].in justifying the imposition of a sentence of life imprisonment.66Foot Note 66×Prosecution’s sentencing submissions at [93].On the other hand, both the Accused’s former counsel and Mr Chen had relied on the fact of her mental disorders to argue for lower sentences. Life imprisonment in relation to mentally disordered offenders 49 InPublic Prosecutorv Aniza bte Essa[2008] 3 SLR(R) 832 (“Aniza(HC)”), an offender who had pleaded guilty to abetment of culpable homicide not amounting to murder under s 304(a) read with s 109 of the Penal Code 1985, was diagnosed to be suffering from moderate depression which had substantially impaired her responsibility. In the context of sentencing a mentally disordered offender, Chan Seng Onn J opined that the highest punishment of life imprisonment can be imposed in two situations (see alsoPublic Prosecutor v PMageswaran and another appeal[2019] 1 SLR 1253 (“Mageswaran”) at [45] – [49]): (a) Where it can be cumulatively shown that the following three broad criteria enunciated by the English Court of Appeal inHodgson(ie, the “Hodgsoncriteria”) are satisfied (seeAniza(HC)at [38]–[46];Neo Man Lee v Public Prosecutor[1991] 1 SLR(R) 918 at [7];PurwantiParji v Public Prosecutor[2005] 2 SLR(R) 220 at [19]): (i) that the offence or offences are in themselves grave enough to require a very long sentence; (ii) that it appears from the nature of the offences or from the defendant’s history that he is a person of unstable character likely to commit such offences in the future; and (iii) that if the offences are committed the consequences to others may be specially injurious, as in the case of sexual offences or crimes of violence. (b) Where “the manner in which the defendant commits the offence is so cruel and inhumane that the defendant does not deserve any leniency whatsoever and that the only just sentence is the maximum of life imprisonment and any other sentence is simply too lenient ... Here the overriding concern is not so much the protection of the public from a likely repetition by the offender if released, but the need to mete out the maximum punishment to register society’s sheer abhorrence of what the offender has done, to deter others accordingly, and to ensure that the offender’s punishment is therefore proportionate to the utterly sadistic and cruel acts [the offender] did” (seeAniza(HC)at [47]). 50 It should be noted thatAniza(HC)had been decided within the framework prior to the 1 February 2008 Penal Code amendments (“the Penal Code Amendments”), where the court was compelled to choose between ten years or life imprisonment as the maximum punishment. A closer examination of the preceding paragraphs ofAniza(HC)at [44]–[46], would show that Chan J had been elaborating on his concerns with this perceived “huge gulf” between ten years and life imprisonment and how theHodgsoncriteria might apply. In my view, the observations made inAniza(HC)at [47] should thus be read in that context, which has also been recognised implicitly by the Court of Appeal inLimGhim Peowat [56] and [58]. In this regard, the Court of Appeal has also separately held that the Penal Code Amendments, which have increased the sentencing range under s 304(a) to 20 years’ imprisonment as an alternative to life imprisonment, ensure that the court no longer has to choose between the “two imperfect options” of life imprisonment or ten years’ imprisonment (seeMageswaranat [44]). Accordingly, it is not clear if the observation inAniza(HC)that “any other sentence [other than life] is simply too lenient” would still hold true under the current sentencing regime since the wide gap between ten years and life imprisonment has been narrowed by legislative amendment. 51 Even assuming that the court’s observations inAniza(HC)at [47] continue to be valid, it would appear that life imprisonment has not been imposed in any case by our courts where an offender isnotdeemed to be at risk of reoffending. A clear illustration is the post-Aniza(HC)case ofLimGhim Peow, which might have well fallen under the “cruel and inhumane” epithet, as the victim in that case was doused with petrol and set ablaze in a planned and premeditated act. However, even after taking into account the accused’s psychiatric condition, a sentence of 20 years was imposed rather than life imprisonment, even though the offender had previous convictions and was assessed to have had a latent violent disposition, with an attendant risk of recidivism. 52 On the facts ofAniza(HC), Chan J held that as the secondHodgsoncriteria was not fulfilled and there was no evidence that the offender had abetted a “slow, cruel and painful” killing, a sentence of life imprisonment was not warranted. A sentence of nine years’ imprisonment was imposed instead (seeAnizaat [48]–[49] and [53]–[57]). This sentence was upheld on appeal inPublic Prosecutor vAniza bte Essa[2009] 3 SLR(R) 327 (“Aniza(CA)”). In delivering the judgment of the Court of Appeal, Chan Sek Keong CJ held at [71] that theHodgsoncriteria serve as an appropriatealternativebasis for imposing the sentence of life imprisonment on a mentally disordered offender,ieas an alternative to the principle that the highest punishment should only be reserved for the worst types of cases. 53 In this regard, the following considerations as to whether the maximum penalty of life imprisonment should be meted out under s 304(a) as set out by the Court of Appeal inMageswaranat [49] are apposite to adopting a principled approach with regard to mentally disordered offenders: To sum up, in considering whether the maximum penalty of life imprisonment under s 304(a) is warranted,the sentencing court will have to be satisfied that the case before it is one of the worst type of cases of culpable homicides.We note, parenthetically, thatlife imprisonment is warranted, alternatively, where theHodgsoncriteria are satisfiedsuch that the court is of the view that the mentally unstable offender will pose a “serious danger to the public for an indeterminate time” …In determining whether a case is one of the worsttype of cases of culpable homicides, the sentencing court will have to examine the circumstances of the case from the perspective of: (a) the nature of the crime; and (b) the circumstances of the criminal.It would take an exceptional case,devoidof any mitigating circumstances, for a sentencing court to be satisfied that a case is one of the worst type of cases of culpable homicides warranting the imposition of themaximumsentence of life imprisonment. [emphasis in italics in original, emphasis added in bold] 54 ReadingMageswarantogether withAniza(CA)at [71], it is clear that where the cumulativeHodgsoncriteria are met, a sentence of life imprisonment would be justified to protect society. However, where any of theHodgsoncriteria are not met, the court should then turn to consider the established sentencing principles applicable to mentally disordered offenders (see [44]–[47] above), and where the court is satisfied that the case is one of the worst type of cases of culpable homicide, having examined the nature of the crime and the circumstances of the criminal, a sentence of life imprisonment may be justified even if theHodgsoncriteria are not met. Relevance of prosecutorial discretion to reduce the charge 55 In the Prosecution’s submissions, the argument was raised that as the Accused had her charge reduced to one under s 304(a) in view of her psychiatric conditions, to consider it again in sentencing could be viewed as an instance of double-counting as “[i]t would be unduly lenient if her psychiatric condition isagainrelied upon to avoid life imprisonment” [emphasis in original].67Foot Note 67×Prosecution’s skeletal submissions at [44]. 56 At the 23 February 2021 hearing, it was clarified and confirmed that the Prosecution did not dispute the fact that her mental disorders were relevant to sentencing, although the Prosecution continued to maintain its position that the extreme circumstances of the offence must negate any mitigating value that might be attached to the Accused’s personal circumstances, citingAniza(HC)at [47]. 57 In my view, there was no basis for the Prosecution’s argument that the reduction of the murder charge on account of the accused’s psychiatric conditions must be borne in mind when determining the sentence for the reduced charge, so as not to offend the rule against double counting.68Foot Note 68×Prosecution’s skeletal submissions at [43].It is settled law that the court determines the appropriate sentence based on the charge that is before the court (seeQuek Hock Lye v Public Prosecutor[2012] 2 SLR 1012 at [29]). The fact that the charge in the present case had been reduced from a murder charge, and correspondingly whatever reason(s) the prosecution might have factored in for the purpose of exercising its prosecutorial discretion in reducing the charge, were not relevant considerations in sentencing. It must follow therefore that as a matter of principle, there was no question of double-counting if the Accused’s psychiatric conditions were taken into account in determining the sentence. 58 The question before the court was how much weight, if any, to attach to her psychiatric conditions. This logically flowed from the Prosecution’s clarification and concession at the hearing. This was in fact the focal point of the court’s enquiry in past cases which were cited by both the Prosecution and Defence, includingAniza(HC)andLimGhim Peow. It is pertinent to note that inLimGhim Peow, the Court of Appeal had emphatically stated, in the context of a similar charge under s 304(a), that the existence of a mental disorder on the part of the offender isalways a relevant factor in the sentencing process(at [25]). 59 This is subject to the qualifier that “[a] mental disorder, even if it substantially impaired the offender’s mental responsibility for the commission of the offence and thereby reduced the offence (in the context of the offence of culpable homicide under s 299 of the [Penal] Code) from that of murder to that of culpable homicide not amounting to murder, cannot be invoked as a blanket excuse for every aspect of the offender’s criminal conduct” (seeLimGhim Peowat [52]). The appropriate sentence for the s 304(a) charge 60 Evaluating how much weight to attach to an offender’s psychiatric condition in the overall determination of sentence is a fact-specific exercise in each case. Reverting to the facts of the present case, as I have noted earlier, it was necessary to adopt a principled approach and take into account the accused’s psychiatric conditions in determining the appropriate sentence. 61 First, I considered the applicability of theHodgsoncriteria. It cannot be disputed that the first and thirdHodgsoncriteria were met in the present case, and it was only the secondHodgsoncriterion which was material. In this regard, I noted that the Accused previously had four other domestic helpers, and there was no evidence of any complaints against the Accused for abuse or ill-treatment. The Accused did not appear to have been a pathologically violent person prior to the material events. As Dr Derrick Yeo found, this suggested that the onset of her MDD linked to her OCPD at or around the time of the offences was a material factor which contributed to her offending conduct. Dr Derrick Yeo further opined that she was not deemed to be at risk of reoffending.69Foot Note 69×PBD at p 109.It would also appear that the Accused had been responsive to psychiatric treatment.70Foot Note 70×PBD at p 108.She did not appear to be of unstable character or to have a propensity to pose a danger to the public. In my view, it was clear that the Accused would not fulfil the secondHodgsoncriterion, and hence I turned to consider the established sentencing considerations in relation to mentally disordered offenders. 62 The Statement of Facts and the accompanying CCTV footage told a shocking story of how the Deceased was abused, humiliated, tortured, starved and eventually made to suffer death at the hands of the Accused. The Deceased, a domestic worker in a foreign land, was completely vulnerable and utterly defenceless, and made to endure agonising physical and psychological harm for a prolonged duration before succumbing to her injuries. The Prosecution’s submissions were framed in forcefully emotive terms, but words cannot adequately describe the abject cruelty of the Accused’s appalling conduct. 63 In considering if this case fell properly within the description of one of the worst cases of culpable homicide, both (a) the nature of the crime, and (b) the circumstances of the criminal should be examined. While no concrete guideline or rule was purported to be laid down inMageswaran, the Court of Appeal appeared to have adopted an exclusionary approach, in that in order for a case to be considered as one of the worst cases of culpable homicide, it should generally be found that there was “an absence or at least a lack of material mitigating circumstances” (seeMageswaranat [46]). 64 I agreed with the Prosecution that there were multiple aggravating factors. As noted at [47] above, all the relevant aggravating factors outlined by the Court of Appeal inADFat [91] were present. Leaving aside for the moment the Accused’s mood disorders and personality disorder, there were few if any material mitigating factors. Her lack of antecedents, plea of guilt and cooperation with the authorities carried little mitigating force. The objective evidence of the relevant facts which gave rise to the charges was cogent and well-captured on CCTV. The Accused could not be regarded as a first offender on account of the fact that she faced 115 charges for separate and distinct offences which covered only the duration of 35 days preceding the Deceased’s death: seeChenWeixiong Jerriek v Public Prosecutor[2003] 2 SLR(R) 334 at [15] and [17]. 65 The Accused claimed to be remorseful. I was not persuaded that she was indeed genuinely remorseful; her immediate reaction and subsequent conduct upon discovering that the Deceased was unresponsive on the morning of 26 July 2016 certainly was not indicative of any remorse but pure instinctive self-preservation. There was absolutely no remorse in any of the Accused’s actions that morning, when she delayed obtaining proper medical attention for the Deceased and sought to disavow and cover up her role in causing the Deceased’s injuries. This was inconsistent with her claims to have cooperated in the investigations. It would also appear from the various psychiatric reports that she was not prepared to accept responsibility for her actions for at least a considerable period after her arrest.71Foot Note 71×PBD at pp 50, 73, 107 and 108. 66 Furthermore, the further plea tendered by Mr Chen continued to attempt to draw a causal connection between the Deceased’s perceived poor hygiene and the Accused’s children’s various illnesses, which in turn resulted in the Accused “careen[ing] out of control”.72Foot Note 72×Further Plea in Mitigation at [12]-[14].In the further plea, the Accused claimed that the doctor had told her that her children’s illnesses were due to poor hygiene.73Foot Note 73×Further Plea in Mitigation at [12].However, this was not documented in any of the KK Women and Children’s Hospital medical reports on the children’s hospital admissions. Moreover, the medical reports covered periods where the elder child was diagnosed with hand, foot and mouth diseasebeforethe Deceased commenced working in the household on 28 May 2015. On the face of the reports, the Accused’s children’s various documented medical conditionsafter28 May 2015 (namely knee pains, pneumonia and otitis media (ear infection) and viral infection)74Foot Note 74×Further Plea in Mitigation at [9]-[10].did not appear to have any clear connection to the Deceased’s perceived poor hygiene standards. 67 Additionally, the Accused suggested in the further plea that she regretted that the Deceased “had been unable to reach out for help as [she] too [ie, like the Accused] would not have been able to articulate the abusive situation she had been subjected to”.75Foot Note 75×Further Plea in Mitigation at [18].The cruel irony in this statement was indicative of her lack of genuine remorse. As the Prosecution rightly noted, the Deceased was never given any opportunity to seek help. The Deceased had no handphone or days off. She had no apparent means of contacting anyone for help. She was restrained by being tied up at night by the Accused. When the Accused last brought her for a medical check-up at the GP clinic on 23 May 2016, she took steps to ensure that the Deceased did not raise any complaints to the GP. The Accused was the one who answered all the GP’s questions relating to the Deceased’s physical condition and appearance.76Foot Note 76×Statement of Facts at [12(d)]. 68 To sum up, I was not persuaded by the Accused’s attempts to demonstrate her remorse. Rather, her efforts to downplay her culpability suggested that she remained unprepared to take responsibility for her actions but continued to blame the Deceased for having provoked her instead. 69 In my view, this was undoubtedly among the worst cases of culpable homicide imaginable, and it would arguably not be wrong to describe the present case as “worse” and more heinous thanLimGhim Peow.After all, the Accused had been charged with 114 charges in addition to the s 304(a) charge, in relation to offences committed over 35 days (from June 2016 onwards). These 114 offences would only represent a fragment of the full extent of physical abuse inflicted on the Deceased since at least October 2015. The Deceased was subjected to incessant abuse as well as tremendous pain and suffering for a prolonged period. 70 The central issue to my mind was whether the Accused deserved a sentence of life imprisonment, or whether her psychiatric conditions were sufficient reason for me to consider a sentence of 20 years’ imprisonment or lower in respect of the s 304(a) charge. 71 The Prosecution cited precedents involving culpable homicide not amounting to murder which resulted in a life sentence notwithstanding that the offenders suffered from some psychiatric condition that contributed to their offending.77Foot Note 77×Prosecution’s skeletal submissions at [52].The Prosecution also acknowledged that those offenders were found to be at risk of reoffending. As the Prosecution very fairly noted, the circumstances in the various precedents did not lend themselves easily to comparison. Comparisons across precedents may not be helpful given that the facts in each case can and do differ widely, and ultimately each case has to be assessed based on its own unique circumstances. 72 I should add that I viewed with caution the Prosecution’s submission that the court’s “righteous anger” should be invoked as a reason to apply the full force of the law in sentencing.78Foot Note 78×Prosecution’s skeletal submissions at [2].The court should of course not shy away from conveying the strongest disapprobation of offending conduct and expressing outrage on behalf of society in appropriate cases such as this. But emotiveness can impede full and fair consideration of all relevant factors. The sentence of the court is not and indeed should not be based on an overriding visceral sense of indignation. 73 In totality, I accepted that the Accused’s culpability was somewhat attenuated. In Dr Derrick Yeo’s words, her “depressed state, compounded by her [OCPD], would have caused her to have increased irritability and anger”, and these conditions would have “affected her judgment”.79Foot Note 79×PBD at p 108.He noted that she thought that she would not face any consequences for her ill-treatment of the Deceased. This last observation was slightly ambiguous, but I understood it to mean that in his assessment, her judgment was affected to the extent that she was reckless or callous with regard to the consequences of her actions. It did not suggest that the Accused did not know that what she was doing was legally or morally wrong. 74 To be clear, it was not Dr Derrick Yeo’s opinion that the Accused’s psychiatric conditions had directly caused her to commit the offences. Nonetheless, the undisputed fact was that her psychiatric conditions had substantially contributed to the commission of the offences. Crucially, as noted above at [61], Dr Derrick Yeo had opined that she was responsive to psychiatric treatment and was unlikely to reoffend. She was unlikely to pose a serious danger to the public. These were important distinguishing factors that set her case apart from the precedents cited where life imprisonment was imposed. For these reasons primarily, I did not think that life imprisonment would be fair or appropriate. 75 That being said, I did not accept that the mitigating force of her psychiatric conditions was so substantial or compelling as to warrant a sentence of less than 20 years in relation to the s 304(a) charge. Her alleged state of heightened anxiety over her children’s medical conditions could not be said to reduce her culpability. As I had explained above at [66], her children’s various illnesses had no palpably clear link to any perceived poor hygiene practices on the part of the Deceased. There were also past assaults including the incident with the heated iron forming the subject-matter of the s 325 charge which had nothing to do with the Deceased’s standards of hygiene. In any case, the Accused’s liberal resort to routine beatings and brutal attacks on the Deceased, some of which were committed in full view of her children, were hardly justifiable means of disciplining the Deceased for any perceived lapses in her work or hygiene standards. 76 While Dr Derrick Yeo had assessed that the Accused’s judgment was impaired by her depressed state compounded by her OCPD, he determined that the impact on her judgment lay in her “thinking that she would not face any consequences” for her ill-treatment of the Deceased. Crucially, although Dr Derrick Yeo concluded that her mental responsibility was partially impaired, he assessed her to be able to exercise conscious deliberation and volitional control throughout the commission of her offences.80Foot Note 80×PBD at p 108.In Dr Derrick Yeo’s view, “she had the cognitive and volitional capacity to engage in purposeful, planned actions in choosing methods in which to inflict physical punishment” on the Deceased.81Foot Note 81×PBD at p 108. 77 The cruel and inhumane methods that the Accused had chosen to employ in order to punish the Deceased were conscious and deliberate. They reflected an utter lack of any basic humanity. The Prosecution submitted that the Accused had treated the Deceased as a lesser human being. In my assessment, what the Accused had done to the Deceased demonstrated that she had callously regarded the Deceased aseven lessthan a human being. In her final hours, the Deceased was kicked, strangled, pulled by her hair, stomped upon and punched like a punching bag or some inanimate object. In the 35 days leading up to her death, she had endured repeated assaults, including being lifted and dragged by her hair and being spun round like a rag doll by the Accused. This much was incontrovertibly revealed from the CCTV footage alone. The Deceased was defenceless. She was at the total mercy of the Accused. The Accused showed no mercy whatsoever. 78 In this connection, I differed from Dr Derrick Yeo’s opinion that the Accused had treated the Deceased “like a child to be physically disciplined, in order to achieve her goal of good hygiene practices and cleanliness, with the main goal of preventing her children from falling ill due to contamination”.82Foot Note 82×PBD at p 108.This may have been his assessment after taking into account the Accused’s self-reported circumstances and motivations. However, the numerous savage and vicious attacks captured on CCTV footage, and in particular where the s 304(a) offence was concerned, did not suggest at all that the Accused had only thought that she was merely disciplining a wilfully disobedient child. 79 By the Accused’s own account, the underlying reasons for her criminal conduct were founded on fact, namely her dissatisfaction with the Deceased’s perceived lapses, spurred by her depression and fixation over hygiene and cleanliness. In line with the Court of Appeal’s observations inPublic Prosecutor v Kong Peng Yee[2018] 2 SLR 295 at [65], her psychiatric conditions could “only ameliorate to a limited extent the criminal conduct because [her mind was] still rational”. The Court of Appeal went on to hold that in such cases, “deterrence and retribution should still feature becausedepression, even if severe, cannot be a licence to kill or harm others” [emphasis added] (at [65]). 80 The Accused was fully cognisant of her actions and purposeful in her criminal conduct. She intended to inflict untold pain and suffering on the Deceased ostensibly as “punishment” for her perceived shortcomings. In my view, the Court of Appeal’s observation inLimGhim Peowat [35] were also apposite: the nature of the Accused’s psychiatric conditions was ultimately not such that they affected her capacity to appreciate the gravity and significance of her criminal conduct, even if her judgment may have been affected so as to cause her to think that she could continue abusing the Deceased with impunity and not have to face any consequences. Thus, while her culpability may have been attenuated, it remained high. 81 The Accused further argued that the plight of her young children in being deprived of her maternal care while she is incarcerated should be considered on compassionate grounds in sentencing. It is well-established in law that personal or family hardship are not mitigating factors unless there are clearly exceptional reasons for taking them into account (seeLaiOei Mui Jenny v Public Prosecutor[1993] 2 SLR(R) 406 at [11]-[12];LimChoon Kang v Public Prosecutor[1993] 3 SLR(R) 254 at [5];LeawSiat Chong v Public Prosecutor[2001] 3 SLR(R) 646 at [12];Public Prosecutor v Loqmanul Hakim bin Buang[2007] 4 SLR(R) 753 at [73]). 82 On the related issue of a gag order raised in the further plea, I was unable to find any justification or legal basis for the gag order she had sought in order to protect her children from stigmatisation. The fact that there was significant media and public interest in this case did not constitute a valid reason for either a gag order or for a lighter sentence. There is no recognised principle in law that calls for a gag order in such circumstances. Equally, it cannot be right that the court’s sentencing determination, whether weighing on the side of the Prosecution or that of the Accused, is calibrated according to the intensity of media scrutiny or public interest. These considerations do not dictate how the sentencing court should decide, whether in the case of a crime of grossly shocking proportions or a relatively minor offence. 83 I concluded that retribution and general deterrence were the sentencing principles that took centre stage in the present case. Having balanced the various sentencing considerations and weighed the aggravating and mitigating factors, I found that a sentence of 20 years’ imprisonment in respect of the s 304(a) charge was appropriate. It was not manifestly excessive but was proportionate to the Accused’s offence, and it accorded due consideration to her mental disorders which had substantially contributed to her commission of the offences. The appropriate sentences for the remaining charges 84 As a starting point in addressing the sentences for the remaining charges, I kept in mind the principles laid down by Sundaresh Menon CJ inMohammadShouffee bin Adam v Public Prosecutor[2014] 2 SLR 998 (“Shouffee”). The one transaction rule was completely inapplicable as this was not a case involving a single or isolated invasion of the same legally protected interest. It would not make sense to consider that the various offences might somehow be said to have been unified by the same purpose or design. Even though the Deceased was the sole victim, each offence was separate and distinct in character and in terms of the time of commission. 85 For the 22 charges under s 323 read with s 73(2), and s 323 read with s 73(2) and either s 34 or s 109, they involved varying degrees of harm and culpability. It would not be wholly appropriate to impose the same sentence for each and every charge. Having regard to the framework I had set out inTay WeeKiat and another v Public Prosecutor and another appeal[2018] 4 SLR 1315 (“Tay WeeKiat”)at [70]–[75] in relation to sentencing cases of domestic maid abuse, it was plain that the Accused’s sustained pattern of offending was systematically abusive and oppressive. I had no doubt that the appropriate sentences would fall within the higher end of the sentencing spectrum. 86 I imposed sentences pegged at between 18 months’ and two years’ imprisonment, depending on the extent and duration of the hurt involved in the respective charges, bearing in mind both the physical harm and the significant psychological harm that was indubitably inflicted on the Deceased (Tay WeeKiatat [71]–[72]). The specific sentences are as follows: S/NoCharge NumberSentence1DAC-902727-201818 months2DAC-902744-2018Two years3DAC-902749-2018Two years4DAC-902763-201818 months5DAC-902768-201818 months6DAC-902771-2018Two years7DAC-902775-2018Two years8DAC-902776-2018Two years9DAC-902777-2018Two years10DAC-902780-2018Two years11DAC-902787-2018Two years12DAC-902791-2018Two years13DAC-902797-2018Two years14DAC-902802-2018Two years15DAC-902805-2018Two years16DAC-902807-2018Two years17DAC-902808-2018Two years18DAC-902810-2018Two years19DAC-902811-2018Two years20DAC-902813-2018Two years21DAC-902815-2018Two years22DAC-902821-2018Two years 87 For the s 324 read with s 73(2) charge (DAC-902753-2018), I agreed with the Prosecution that a sentence of three years was warranted, having considered the applicable aggravating factors to domestic maid abuse cases set out inADFat [91] andTay WeeKiatat [73]. For the s 352, s 341 and s 506 charges (DAC-902724-2018, DAC-902830-2018 and DAC-902770-2018), I agreed with the Prosecution that a sentence of one month’s, one month’s and three months’ imprisonment for each of these respective charges was warranted. 88 Where the s 325 charge (DAC-902842-2018) was concerned, the Prosecution submitted for at least three years’ imprisonment. The only related sentencing precedent involving an employer effectively starving a foreign domestic worker appears to bePublic Prosecutorv Lim Choon Hong and another[2017] 5 SLR 989. However, that case involved prosecution for a far less serious offence under s 22(1)(a) of the Employment of Foreign Manpower Act (Cap 91A, 2009 Rev Ed) (“EFMA”) read with reg 4(2) of the Employment of Foreign Manpower (Work Passes) Regulations 2012 (S 569/2012), punishable under s 22(1)(i) of the EFMA which carries a maximum imprisonment term of only 12 months. As the maximum permissible imprisonment term for the present s 325 offence is 15 years, with the added element of endangering life, I was of the view that a sentence of three years’ imprisonment was amply justified.",
        "Consecutive sentences and the totality principle": "89 I considered that the general rule enunciated by Menon CJ inPublic Prosecutor vRaveen Balakrishnan[2018] 5 SLR 799 (“Raveen”) at [41] and [48] was broadly applicable in the present case. The Accused was a multiple offender who ought to be separately punished for each offence, but bearing in mind the totality principle, it would be entirely out of the question to order the individual sentences for all or even a substantial number of the 28 proceeded charges to run consecutively. This would lead to a crushing and wholly disproportionate sentence by any standard. It would violate the general rule against double counting aggravating factors given that multiple offences were involved. These factors would already have been taken into account at the first stage of the sentencing process in dealing with the appropriate individual sentences: seeADFat [92] andShouffeeat [79]. 90 As such, at the second and third stage of the sentencing analysis set out by Menon CJ inRaveenat [98], I determined that at least five sentences ought to run consecutively in view of the Accused’s overall criminality. I concluded thus after having given careful and deliberative thought in relation to the relevant sentencing considerations, including the Accused’s psychiatric conditions. I therefore ordered the sentences in respect of five charges to run consecutively, namely those for the: s 304(a) charge (HC 900118/2016: 20 years’ imprisonment), s 324 charge (DAC-902753-2018: three years’ imprisonment), s 325 charge (DAC-902842-2018: three years’ imprisonment) and two s 323 charges (DAC-902815-2018 and 902821-2018: two years’ imprisonment each). The aggregate sentence was 30 years’ imprisonment. 91 With the sentence backdated to the Accused’s date of arrest on 26 July 2016, subject to remission, she would effectively be incarcerated for another 15 years or so. By that time, she would be in her mid-50’s.",
        "Conclusion": "92 The extremely aggravated and horrific circumstances of the offences which culminated in the untimely passing of the Deceased were crucial considerations that tipped the scales towards retribution and deterrence. General rather than specific deterrence was of particular concern. At the same time, the sentencing court must not ignore the circumstances of an offender who has relevant and significant psychiatric conditions. 93 Notwithstanding the Accused’s psychiatric conditions, she was cognisant of her actions and purposeful in her conduct. She did not lack capacity to comprehend what she was doing. To recapitulate, the 115 charges spanned only the final 35 days of the Deceased’s life. From the Statement of Facts and the accompanying CCTV footage, it was clear beyond peradventure that the Accused had waged a brutally dehumanising campaign of violence against the Deceased. She relentlessly inflicted pain and suffering on the Deceased as “punishment” for her perceived lapses. The Accused did so without compunction until she caused the death of the Deceased. 94 The overall picture before me led me to conclude that an extended custodial sentence had to be imposed. The sentence had to signal clearly societal outrage and abhorrence of these offences. Though I was not persuaded that the Accused was deserving of life imprisonment for the s 304(a) charge, an extended sentence would neither be crushing nor disproportionate in light of the gravity of the offences. 95 For the above reasons, I ordered that the sentences in respect of five charges to run consecutively, as stated at [90] above. The aggregate sentence was therefore 30 years’ imprisonment.   96 The sentence was backdated to 26 July 2016, the date of the Accused’s arrest. See Kee OonJudge of High Court Mohamed Faizal SC, Senthilkumaran Sabapathy and Stephanie Koh (Attorney-General’s Chambers) for the Prosecution; Sunil Sudheesan and Diana Ngiam (Quahe Woo & Palmer LLC) for the Accused (up to 30 March 2021); Joseph Chen (Joseph Chen & Co) for the Accused (wef 30 March 2021)."
    }
}