{
    "case_title": "Kanesan s/o Ramasamy vPublic Prosecutor",
    "ncitation": "[2021] SGHC 269",
    "coram": "Vincent Hoong J",
    "sections": {
        "Facts": "",
        "The parties": "2 The appellant was arrested on 13 September 2016 at Tiong Bahru Plaza after being screened by police and found to have had two outstanding warrants.1Foot Note 1×Record of Proceedings (“ROP”) p 24.After his arrest, he was found to be carrying a cigarette box containing a burnt aluminium foil and TOTO betting slip with residue. He was brought back to the Police Cantonment Complex, where a statement was recorded from him, and urine samples were collected from him.2Foot Note 2×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [6].The urine samples collected were analysed by the Health Sciences Authority (“HSA”) and found to contain morphine.3Foot Note 3×ROP pp 889 – 890.",
        "Procedural history": "3 At the trial below, the Prosecution called a total of 21 witnesses who gave evidence as to how the appellant was arrested, his behaviour whilst under arrest, the recording of his statement, and the contents of his urine test. 4 The defence sought to challenge the admissibility of the long statement recorded on 13 September 2016 (“P5”)4Foot Note 4×ROP pp 891 – 893.on the basis that the appellant was threatened, offered inducements and promises by the recorder,5Foot Note 5×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [17].which led to an ancillary hearing.6Foot Note 6×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [15].During the course of the appellant’s evidence given during the ancillary hearing, it was raised by the appellant that he had been registered as an informant for the Central Narcotics Bureau (“CNB”).7Foot Note 7×ROP p 126.In the intervening dates, before the ancillary hearing was concluded, Mr Ravi s/o Madasamy took over conduct of the defence, and filed a criminal motion to the High Court in Criminal Motion 6 of 2018 (CM 6/2018), seeking an order from the court to cease the criminal proceedings against the appellant. The court records in CM 6/2018 were placed under a sealing order and a gag order. The motion was eventually dismissed for a lack of jurisdiction. 5 In the ancillary hearing that continued, the DJ found that the statement in P5 given by the appellant was voluntary and admissible as evidence.8Foot Note 8×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [15].The DJ found that there was no reason for the recording officer (SSgt Ravichandran) to lie or frame the appellant,9Foot Note 9×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [31].and that the appellant’s failure to keep a straight and coherent account regarding his allegations against the police severely undermined the credibility of his testimony.10Foot Note 10×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [36].Having admitted the statement in P5, the DJ found that SSgt Ravichandran had accurately recorded the circumstances surrounding the offence and how the appellant had come to obtain the heroin.11Foot Note 11×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [48].",
        "Findings by the court below": "6 With regards to the possession of drug utensils charge, the DJ found that the appellant gave no satisfactory explanation as to why his claim that the utensil belonged to his roommates should be believed. The appellant also did not choose to call his roommates to testify in his defence. In the absence of any objective or corroborative evidence, the DJ found that the drug utensils belonged to the appellant, which is what the appellant admitted to in P5.12Foot Note 12×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [50]. 7 With regards to the drug consumption charge, the appellant had argued that the presence of morphine in his urine could have been due to his consumption of cough medication containing codeine, or that it was because he had passively inhaled second-hand smoke from his roommates’ inhalation of heroin.13Foot Note 13×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [43].In respect of the cough medication argument, the DJ found this assertions by the appellant to be vague and unsupported by any credible evidence, and that the appellant had neither provided any prescription for cough medication nor had he called any of his roommates to testify to his claim that the cough medications belonged to them.14Foot Note 14×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [52].In respect of the passive inhalation argument, the DJ found this was also speculative, as none of his roommates were called to testify,15Foot Note 15×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [55].and the expert evidence that the appellant sought to adduce through one Dr Joseph Samuel Bertino Jr (“Dr Bertino”) lacked any foundational basis for a proper assessment of whether the presence of morphine in the appellant’s urine could have been due to passive inhalation.16Foot Note 16×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [56] – [57]. 8 In totality, the DJ found that the appellant was unable to rebut the presumption under s 22 of the MDA that he had consumed morphine, as neither of his defences were proven on a balance of probabilities.17Foot Note 17×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [59].The DJ accordingly convicted him on the charges and imposed the mandatory minimum sentence of five years’ imprisonment for the drug consumption charge (given his two prior drug consumption convictions), and four months’ imprisonment for the drug utensils charge.18Foot Note 18×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [67].Notably, the DJ did not find that the appellant would have been adversely affected for being found guilty as a registered confidential informer of the CNB, and that there was no evidence proving that the appellant was a CNB informant.19Foot Note 19×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [60]. 9 After his conviction and sentencing on 5 May 2020, the appellant commenced proceedings on constitutional grounds in Suit 1157 of 2020 (S 1157/2020) against the Attorney-General for having proceeded with the above charges against the appellant. These proceedings were similarly subject to a sealing order, and suffice to say, the appellant’s claims were dismissed in their entirety.",
        "The parties’ submissions on appeal": "",
        "The appellant’s case": "10 The appellant now appeals against his conviction and sentence on the following grounds. First in relation to P5, that the appellant had adopted alaissez-faireapproach when he signed P5, which would mean that P5 was not given voluntarily.20Foot Note 20×Appellant’s Submissions at [17] – [19].That the onus was on the Prosecution to show why the recording officer did not manufacture untruths; the onus is not on the appellant to show why SSgt Ravichandran would want to “fix him”,21Foot Note 21×Appellant’s Submissions at [20].and that the fact that the appellant had remained calm when arrested and questioned meant that he had no idea that the cigarette pack contained drug utensils.22Foot Note 22×Appellant’s Submissions at [31].The appellant also argued that he was promised that if he cooperated with the police he would be released as he had been registered as a CNB informant in the past. Accordingly, his statement were not procured voluntarily.23Foot Note 23×Appellant’s Submissions at [74] – [75]. 11 Second, in relation to his defences at trial, that the DJ had failed to attach “due weight” to the fact that the HSA analysts were unable to rule out the possibility that the appellant’s urine test was positive for codeine as he had ingested cough medication.24Foot Note 24×Appellant’s Submissions at [6] – [9].That in respect of the passive inhalation defence, all the appellant had to show was the scientific possibility that morphine was found in his urine because of passive inhalation. The onus was on the Prosecution to prove that this rebuttal cannot stand.25Foot Note 25×Appellant’s Submissions at [56] – [57]. 12 Third, that the proceedings against the appellant were unconstitutional under Arts 9(1) and 12(1) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“Constitution”) by virtue of the appellant’s previous status as a registered confidential informant of the CNB.26Foot Note 26×Appellant’s Submissions at [69] – [70], [79] – [81].Further, that the appellant as a confidential informant would not be able to receive equal protection under the law,27Foot Note 27×Appellant’s Submissions on Art 9 and 12 at [11].and the State had deprived the appellant of the protection that ought to be accorded to a confidential informant and promised by his handler.28Foot Note 28×Appellant’s Submissions on Art 9 and 12 at [16].Further, that there was public interest in not convicting the appellant.29Foot Note 29×Appellant’s Submissions on Art 9 and 12 at [51].",
        "The Respondent’s case": "13 In relation to the appellant’s arguments against the admissibility of P5, the Prosecution submits that the DJ had been correct to find that the allegations of the appellant were last minute attempts by the appellant to retract his admissions,30Foot Note 30×Respondent’s Submissions at [22].which were shifting,31Foot Note 31×Respondent’s Submissions at [24] – [25].and were not raised at an earlier stage.32Foot Note 32×Respondent’s Submissions at [26].In addition, there was no evidence to prove any of the appellant’s allegations, such as SSgt Ravichandran’s alleged promises to him,33Foot Note 33×Respondent’s Submissions at [27].the claim that he was “traumatised”, “disturbed” and “screaming crazily”, or the claim that he was in severe pain.34Foot Note 34×Respondent’s Submissions at [29].In view of the unsubstantiated and unreliable nature of the appellant’s allegations, the DJ was right to have found that P5 was voluntarily35Foot Note 35×Respondent’s Submissions at [30].and accurately recorded by SSgt Ravichandran.36Foot Note 36×Respondent’s Submissions at [37]. 14 In relation to the appellant’s defences, the DJ was correct to reject his inconsistent defence about how the drug utensils actually belonged to his roommates,37Foot Note 37×Respondent’s Submissions at [39].as he had failed to provide any evidence to corroborate this.38Foot Note 38×Respondent’s Submissions at [41].As for the medication defence the DJ was correct to have rejected it as uncorroborated and speculative,39Foot Note 39×Respondent’s Submissions at [43].inconsistent,40Foot Note 40×Respondent’s Submissions at [45] – [47].and lacking in objective evidence.41Foot Note 41×Respondent’s Submissions at [48].Similarly, for the passive inhalation defence, the DJ was correct to have rejected the appellant’s medication defence as uncorroborated and speculative,42Foot Note 42×Respondent’s Submissions at [53].as there was no reference to this defence in his cautioned statements,43Foot Note 43×Respondent’s Submissions at [54].nor was there any evidence to support the appellant’s claim that he had lived in the said flat with a roommate that smoked heroin.44Foot Note 44×Respondent’s Submissions at [56] – [58].The appellant’s evidence was also inconsistent on cross-examination, and the expert evidence he sought to adduce was contradicted by the HSA analysts.45Foot Note 45×Respondent’s Submissions at [60] – [61]. 15 In relation to the appellant’s constitutional arguments, the Prosecution submits that the appellant’s suit against the Attorney-General for violation of the Constitution in S 1157/2020 had already been struck out, with the court finding that there was no law preventing the Prosecution from charging informants for offences they have committed.46Foot Note 46×Respondent’s Submissions at [20].There was accordingly, no basis for the appellant to have the issues relitigated in these proceedings.47Foot Note 47×Respondent’s Submissions at [21]. 16 As for the sentence, the sentences meted out for each offence was the mandatory minimum, and as they were ordered to run concurrently, the global imprisonment term of 5 years was the lowest possible global sentence and cannot be said to be manifestly excessive.48Foot Note 48×Respondent’s Submissions at [69]-[71].",
        "My Decision": "",
        "Was there any basis to argue that Art 9(1) or 12(1) of the Constitution had been breached?": "Issue estoppel 17 On a preliminary note, it should be highlighted that this would be the third time that counsel for the appellant is raising arguments premised on Arts 9(1) and 12(1) of the Constitution. The issue ofres judicataarises as to whether the appellant is even entitled to raise such a claim. The first instance was in CM 6/2018 where the motion was dismissed on procedural grounds, as it was found that the appellant should have brought the application under s 395 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) in order to determine the effect of provisions of the Constitution, although the court found noprima facieevidence of a breach of either Art 12 or 9 of the Constitution. 18 The second instance was in S 1157/2020, where it was found that the appellant’s claims were unsustainable in law as there was no law that prevented the Public Prosecutor from charging informants for offences they have committed, and the appellant’s prayer for a declaration that the criminal proceedings against him were unconstitutional was struck out under O 18 r 19(1)(a) and r 19(1)(b) of the Rules of Court (2014 Rev Ed). 19 Turning first to the doctrine ofres judicata, Sundaresh Menon JC (as he then was) stated in Goh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”) at [17] that there were three distinct but interrelated principles under the umbrella doctrine ofres judicata: (a)Cause of action estoppel:a party is precluded from asserting or denying, as against the other party, the existence of a particular cause of action, the non-existence or existence of which has been determined by a court of competent jurisdiction in previous litigation between the same parties. (b)Issue estoppel: a party is precludedfrom re-litigating anissue;  this principle applies where a litigant raises a question of fact or law which has already been determined by a court of competent jurisdiction. In order for issue estoppel to be established: (i) there must be a final and conclusive judgment on the merits; (ii) that judgment must be of a court of competent jurisdiction; (iii) there must be identity between the parties to the two actions that are being compared; and (iv) there must be an identity of subject-matter in the two proceedings. (c)Abuse of process:this is an extended doctrine ofresjudicata,stemming from the courts’ concern with managing and preventing multiplicity of litigation so as to ensure that justice is achieved for all. This is relevant where neither cause of action estoppel nor issue estoppel apply. 20 While the proceedings in CM 6/2018 which were dismissed on procedural grounds would not have given rise to any of the principles ofres judicataas stated above, it would appear that the appellant’s attempts to pursue the same arguments canvassed in S 1157/2020, would be a case for issue estoppel, as it had already been found that there was no legal basis for the appellant to argue that the Prosecution’s decision to proceed against him was unconstitutional. Nevertheless, I will go on to examine the relevant constitutional arguments the appellant has proffered. Article 9(1) of the Constitution 21 Article 9(1) of the Constitution states: No person shall be deprived of his life or personal liberty save in accordance with law. 22 In this regard, the Court of Appeal inYongVui Kong v Public Prosecutor[2015] 2 SLR 1129 had held at [14]: Before we consider the construction of these words “life or personal liberty”, it is helpful to note two key features of Art 9(1) which are apparent on a plain reading. First, it prohibits the State from unlawfullydeprivingan individual of his life or personal liberty, but does not impose any duty on the State to take affirmative measures to facilitate or promote a person’s enjoyment of his life and personal liberty.Second, Art 9(1) contemplates that the State may deprive an individual of, or intrude upon, rights that are within the ambit of “life and liberty” but onlyin accordance with law.Thus, the provision seeks to ensure that any such deprivations or intrusions are authorised by and comply with “law”. The word “law” includes legislative enactments: Art 2(1) of the Constitution. Therefore, even assuming that a particular right falls within the ambit of the words “life and personal liberty”, that does not preclude Parliament from depriving a person of that right by way of a validly enacted law. In order to challenge such an enactment, a litigant must not only show that it deprives or threatens to deprive him of his right to life and personal liberty; he must go further and establish that the enactment is void and/or inconsistent with another law that takes precedence over it. [emphasis in italics in original, emphasis added in bold] 23 The burden is on the appellant to show that he has been deprived of liberty in a manner that is inconsistent with legislative enactments. This is so as to ensure that the government acts in accordance with valid laws when depriving a person of life or personal liberty. As was observed in S 1157/2020, the appellant has not pointed to any law or statute which states that he should be granted extra protection as a former informant. Accordingly, the appellant’s arguments that because he was a former informant, he would be deprived of his life and personal liberty without being awarded any protection by the law or protection as promised to him,49Foot Note 49×Appellant’s Submissions on Art 9 and 12 at [43].does not make any sense. Furthermore, Art 9(1) of the Constitution itself only states that the appellant cannot be deprived of his personal liberty arbitrarily and must be afforded due process, with which he has been provided in the present case. Article 12(1) of the Constitution 24 Article 12(1) of the Constitution states: All persons are equal before the law and entitled to the equal protection of the law. 25 The test that is to be applied to analyse whether a legislative provision is consistent with an individual’s right to equal protection under Art 12(1) is known as the “reasonable classification” test. This test requires that the classification prescribed by the provision be founded on an intelligible differentia, and that the differentia bear a rational relation to the object sought to be achieved by the statute: seeLim MengSuang and another v Attorney-General and another appeal and another matter[2015] 1 SLR 26 at [60]. 26 Again, the appellant has not pointed to any legislative provision which shows that he was unfairly treated when the Public Prosecutor made the decision to proceed with prosecuting him. On the contrary, it could be argued that to afford him special treatment when he was not in fact acting as an informant at the material time, would be an abuse of Art 12(1) of the Constitution itself. Accordingly, in my view there is no merit in the appellant’s arguments premised on Art 12(1) of the Constitution.",
        "Admissibility of the appellant’s statement": "Alleged threat and oppression 27 The appellant alleges that when he was giving the statement recorded in P5, he was in “a traumatised state”, was “not ready to give his statement on that day”, and was “not in a proper state of mind”.50Foot Note 50×ROP pp 113 – 114.Second, he alleges that he was denied medical attention despite suffering from severe back pain.51Foot Note 51×ROP p 135.Third, that SSgt Ravichandran had threatened to “put [the appellant] in” as he was putting up an act.52Foot Note 52×ROP p 291. 28 Where the voluntariness of a statement is challenged, the burden is on the Prosecution to prove beyond a reasonable doubt that the statement was made voluntarily. The test for determining admissibility is whether the alleged threat, inducement, or promise had operated on the mind of the appellant in making that statement. This test of voluntariness is partly objective whereby the court determines if there was a threat, inducement or promise, and partly subjective whereby the court determines if the threat, inducement or promise had operated on the mind of the particular appellant through the hope of escape or fear of punishment (seeChaiChien Wei Kelvin v Public Prosecutor[1998] 3 SLR(R) 619 (“Kelvin Chai”) at [53];Public Prosecutor v Yue Roger Jr[2019] 3 SLR 749 at [55] – [56]). 29 As for the alleged threat against SSgt Ravichandran, it is trite law that the effect of any words or threats would have to be assessed in the context of the individual case, according to the part objective part subjective test as stated at [28] above (seeLimThian Lai v Public Prosecutor[2006] 1 SLR(R) 319 at [18]). I agree with the DJ that there was no evidence to show that the  allegations against SSgt Ravichandran were true, nor was there any reason for SSgt Ravichandran to lie in order to frame the appellant.53Foot Note 53×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [31].Additionally, by the appellant’s own account, the alleged threat was made in the context of asking him to stop malingering and not in the course of recording the statement in P5 from him. As such, I find it difficult to accept that it was a threat such as to affect the admissibility of P5, even if I were to accept that the alleged threat was made. 30 As to the alleged oppression, as was stated inKelvin Chaiat [56]–[67], oppression is a question of fact which is found where that an “[appellant] was in such a state that his will was ‘sapped’ and he could not resist making a statement which he would otherwise not have made”. In the present case, the appellant’s position that he was neither ready nor was he in a proper state of mind to give the statement in P5, cannot be said to have been circumstances which would have met the standard of oppression. Inducement 31 Central to this appeal, was the appellant’s allegation that he was induced into giving the statement in P5, this comprised of two key inducements. The first was that he was told by the arresting officers that he would face a traffic offence and would be granted bail.54Foot Note 54×ROP pp 126 and 130The second was that he would be allowed to speak to his handler from his time working as a confidential informant, who would ensure that “nothing will happen”. 32 For the first statement, even if one of the reasons for which he was initially stopped was for traffic related offences, the appellant’s claim that he would be charged with a traffic offence, would neither cohere with the fact that he was found with drug paraphernalia on his person nor would it bear any relation to the contents of the statement in P5. Further, the appellant was unable to recall which officer had told him he would be only charged with a traffic offence,55Foot Note 55×ROP p 131.and in his own evidence he stated that he was told that he would be handed over to the traffic police for the traffic offences.56Foot Note 56×ROP p 130.In totality, I agree with the DJ that this allegation of the appellant’s was not believable.57Foot Note 57×PP v Kanesan s/o Ramasamy[2020] SGDC 144 at [32]. 33 For the second statement, it is clear that the appellant himself does not allege that it wasbecauseof the purported inducement/promise that he be allowed to speak to his former handler, that he was told to confess to a crime he did not commit:58Foot Note 58×ROP p 590 – 591. DC: Now, Mr. Kanesan, the DPP asked you earlier in your evidence, look at paragraphs 5, 6, and 7 of the statement, and the DPP asked you whether you know of any reason why Mr. Ravichandran would put in this content in paragraphs 5, 6, and 7, if you had not given him all the information in these paragraphs. Do you know why he would have done that? A:  Sir, there is no need for the officer to have frame me, and I also do not know, in a---for being a CNB handler, I guess maybe they might use this statement to prosecute any other ri---any other---of the part of---I---I don’t say it was part of my handler, as a---for the CNB, they be taking such statement, I guess so, I do not---but---officer Ravichandran has no reason to frame me. I entrusted and signed the whole, um, voluntary statement, um, without going through the detail also, because I---I trust my handle---handler CNB will not put me in problem, Sir. 34 As it appears, the appellant’s case at trial was that he could just give his statement and his previous handler would have stepped in to stop him from being prosecuted. At trial, it was put to SSgt Ravichandran by the appellant’s counsel that SSgt Ravichandran had said “[d]on’t worry, your handler says he knows you and that he will meet you later.”59Foot Note 59×ROP p 412.Taking the appellant’s case at its highest, the appellant’s allegation was being told that he would be allowed to contact his previous handler,60Foot Note 60×ROP p 466, 467,which SSgt Ravichandran in fact did on his behalf.61Foot Note 61×ROP p 430, 432Any purported correlation between this promise to allow him to meet his previous handler and the latter stepping into to prevent him from being prosecuted would have been entirely a perception on the appellant’s part.  As has been established in law, self-perceived inducement does not amount to an inducement in law (see atGulam binNotan Mohd Shariff Jamalddin and another v Public Prosecutor[1999] 1 SLR(R) 498 at [57]). 35 Further, this would also implicitly mean that the appellant had in fact given a truthful statement in the hope that his former handler would make sure he was not charged for the offences. If the appellant had not committed any of the offences and truly believed that no action would be taken against him, why would he have incriminated himself so completely in P5. As such, I am of the view that there was no basis for the appellant’s allegation that he had been induced into providing the statement. Accordingly, I find that the DJ was justified in finding that the appellant’s statement was made voluntarily and admissible.",
        "Was the DJ correct to find the defences were not credible?": "The Drug Utensils charge 36 To recapitulate, the appellant’s defence in relation to the possession of drug utensils charge was that the items had belonged to his roommates. It was not disputed that the items were in fact found in his physical possession upon his arrest. 37 I agree with the DJ that the appellant has not pointed to any evidence to substantiate his claims that the utensils belonged to his roommates, and he had not called any of them as witness to the trial. In fact, the appellant does not even know the real names of those three alleged roommates of his.62Foot Note 62×ROP p 505.He was also not able to get the location of the flat right,63Foot Note 63×ROP p 509.and he was not even sure if they had smoked heroin.64Foot Note 64×ROP p 529.Accordingly, I find that this defence is wholly unsatisfactory. The Drug Consumption Charge 38 There are two prongs to the appellant’s defence on the drug consumption charge. The first is that he might have taken codeine-containing cough medication, and the second that he had passively inhaled smoke from his roommate’s heroin use. 39 In my view, there is no basis for the appellant to say that just because he has a fanciful explanation for the presence of morphine in his urine that the prosecution came under an obligation to prove that his explanation was false. Once the controlled drug is found in the urine of the appellant, s 22 of the MDA presumes that theactus reusandmensreaof consumption are proven, and the burden of proof would fall upon the appellant to prove, on a balance of probabilities, that he had not consumed a controlled drug in contravention of s 8(b) of the MDA (seeVadugaiahMahendran v Public Prosecutor[1995] 3 SLR(R) 719 at [24];ZhengJianxing v Attorney-General[2014] 3 SLR 1100 at [30]). This means that the appellant had to provide sufficient objective evidence and call the relevant witnesses to prove that he had not in fact consumed the drugs that were tested positive from his urine. 40 I first address the expert evidence of Dr Bertino adduced by the appellant in his defence. First, in relation to the cough medication, I found Dr Bertino’s evidence to be unsatisfactory, as he had premised this on the unsubstantiated assumption that the cough medication had contained codeine. Dr Bertino had not analysed the cough syrup, did not have sight of it, and was not even aware of how much cough medication the appellant claimed to have consumed.65Foot Note 65×ROP p 705.He also admitted that he did not know “for certain that it contained codeine”. Second, in relation to the passive inhalation of heroin, Dr Bertino had limited information to reach his tentative conclusion that the presence of morphine could have been due to the inhalation of heroin smoke. Dr Bertino did not know how many other persons were in the flat, the size of the flat, the layout of the flat, or any other details of the appellant’s living arrangements.66Foot Note 66×ROP pp 665 – 666.When Dr Bertino had sight of the appellant’s evidence that his roommates were smoking cigarette, he agreed that this would not give rise to a positive urine for morphine or codeine. Further, the scientific paper that Dr Bertino sought to rely upon, contained multiple variables which have not been accounted for in the circumstances of the present case, and therefore cannot be accorded any weight. 41 Turning next to the substance of the appellant’s cough medication defence, I agree that the appellant’s evidence in this regard is not credible, he alleges to have taken his roommate’s cough mixture but does not recall the amount consumed nor the type of mixture,67Foot Note 67×ROP p 525 – 626.and crucially he has not adduced any objective evidence such as a prescription label or a witness to substantiate his claim. I similarly find that the appellant’s inability to provide any evidence, apart from bare assertions on his part, as fatal to the appellant’s passive inhalation defence. 42 Accordingly, I find that the appellant has not rebutted the presumption under s 22 of the MDA.",
        "Sentence": "43 As for the sentence, counsel for the appellant has not made any submissions on sentence. In any event, as the appellant was sentenced to the mandatory minimum sentence of 5 years’ imprisonment in respect of the drug consumption charge under s 8(b)(ii) of the Misuse of Drugs Act and 4 months’ imprisonment in respect of the possession of drug utensils charge and with both charges ordered to run concurrently, the global sentence of five years’ imprisonment cannot be said to be manifestly excessive.",
        "Conclusion": "44 In summary, I find no merit in the appellant’s arguments on the unconstitutionality of the criminal proceedings proceeded against him. Having examined the record, I also find that the defences proffered by the appellant were unsubstantiated and speculative, and that the statement recorded from the appellant in P5 had contained the truth as to how the drug utensils were found in his possession and how the morphine was found in his urine. I therefore dismiss the appeal against his conviction and sentence. Vincent HoongJudge of the High Court       Ravi s/o Madasamy (K K Cheng Law LLC) for the appellant; Kavitha Uthrapathy and Angela Ang (Attorney-General’s Chambers) for the respondent.",
        "": ""
    }
}