{
    "case_title": "TOT vTOU and another appeal and another matter",
    "ncitation": "[2021] SGHC(A) 9",
    "coram": "Belinda Ang Saw Ean JAD (delivering the judgment of the courtex tempore)",
    "sections": {
        "Introduction": "1 In AD/CA 17/2021 (“CA 17”) and AD/CA 18/2021 (“CA 18”), the Husband and the Wife have cross-appealed against the ancillary orders made by the High Court Judge (“the Judge”) in HCF/DT 1467/2015. Each has raised a number of challenges in respect of the Judge’s orders. These challenges pertain to the division of matrimonial assets, the Wife’s maintenance, as well as the costs in respect of the decision below. The Husband has also brought a separate application, AD/SUM 7/2021 (“SUM 7”) to adduce fresh evidence in his appeal. 2 We remind parties that, in matrimonial cases, the appellate court will be slow to interfere with the orders made by the court below unless it can be demonstrated that the court below has committed an error of law or principle, or has failed to appreciate certain material facts:ANJ v ANK[2015] 4 SLR 1043 (“ANJ v ANK”) at [42];TNL v TNK and another appeal and another matter[2017] 1 SLR 609 at [53]. Furthermore, inUSB v USA and another appeal[2020] 2 SLR 588, the Court of Appeal categorically stated (at [80]) that: [I]n the context of matrimonial disputes, appeals will not be sympathetically received where the result is a potential adjustment of the sums awarded below that works out to less than 10% thereof… where the Judge below expended significant effort in particularising parties’ contributions and explaining his reasons for doing so, parties should not nit-pick at minor errors, especially when the errors are not ones of principle. 3 This being said, the courtwillstep in to correct computational errors in appropriate instances, particularly where both parties are agreed that such errors exist. For example, inBOR v BOS and another appeal[2018] SGCA 78, the Court of Appeal stepped in to correct several computational errors made by the High Court Judge, most of which were not disputed by either party. 4 Having set out the relevant threshold for appellate intervention, we now provide the grounds of our decision on SUM 7 and the cross-appeals below.",
        "SUM 7": "5 In SUM 7, the Husband seeks to adduce the following evidence (collectively, “the Further Evidence”): (a) two e-mails from 2006 showing that the Husband’s company would remit the reimbursement for travel expenses paid by him; (b) invoices and e-mails from travel agents and hotels which the Husband stayed at during his business trips; and (c) a letter of offer dated 8 July 2004 from United Overseas Bank for a term loan on the security of one of the Husband’s properties. 6 In order to succeed in SUM 7, the Husband must show that the Further Evidence satisfies the three conditions set out inLadd v Marshall[1954] 1 WLR 1489 (“Ladd v Marshall”),ie, that the evidence (a) could not have been obtained with reasonable diligence for use at the hearing below; (b) if given, would probably have an important influence on the result of the case, though it need not be decisive; and (c) is as such as to be presumably believed,ie, apparently credible, though it need not be incontrovertible: seeUJN v UJO[2021] SGCA 18 at [4]. If the appeal is against a decision after a trial or a hearing bearing the characteristics of a trial (eg, assessment of damages involving extensive taking of evidence andcross examination), the requirements inLadd v Marshallshould generally apply with full rigour. Otherwise, the court remains guided by the rule inLadd v Marshallbut is not obliged to apply it in an unattenuated manner: seeAnAnGroup (Singapore) Pte Ltd v VTB Bank (Public Joint Stock Co)[2019] 2 SLR 341 at [35] and [57]. 7 In our judgment, even though theLadd v Marshallconditions need not be applied stringently here because the AM hearing was based on affidavit evidence without cross-examination of the deponents, the Further Evidence should not be admitted for the reasons that follow. 8 First, we are unpersuaded by the Husband’s argument that he was unable to retrieve the Further Evidence with reasonable diligence at the time of the ancillary matters hearing because they were kept in boxes that were stored in his friend’s house. The Husband was evidently fully aware of the existence and location of the documents, and the onus lay on him to make the necessary effort to access them if required. In any event, the Husband acknowledged in his written submissions for the ancillary matters hearing that he had been keeping records of his business travels in hard disks and he has not explained why the documents which he now seeks to admit were not in the hard disks, and if they were in the hard disks, why they had not been retrieved earlier. In these circumstances, there is no justification to allow him to admit the Further Evidence at this belated stage of the proceedings. 9 Second, the relevance of the Further Evidence is equivocal. Although the Further Evidence does shedsomelight on the movements of deposits in, and withdrawals from, the POSB 102 account during the period from mid-December 2005 to February 2007,  the Further Evidence does not deal with the full amount in dispute and is thus unlikely to influence the outcome of our decision in so far as the adverse inferences against the Husband are concerned. 10 Given the above, we do not see any basis for admitting the Further Evidence and SUM 7 is therefore dismissed.",
        "Division of matrimonial assets": "11 In so far as the division of matrimonial assets is concerned, having considered the parties’ written submissions and counsel’s oral arguments, we are satisfied that there is no merit in the Wife’s challenges. She has not been able to show that the Judge’s decision was wrong in principle, or that he made any material mistakes of fact. Similarly, for the same reason, there is no merit in the Husband’s challenges save for one exception. That exception is the Judge’s assessment of the parties’ expenditure on the River Valley Property (being one of the parties’ joint properties (“Joint Properties”)). 12 The Husband contends that the Judge wrongly deducted a sum of $288,750 from the Husband’s estimate of the parties’ expenditure on the River Valley Property. This is said to comprise a sum $283,750, being a direct contribution by the Husband to the River Valley Property, as well as a sum of $5,000, being a direct contribution by the Wife to the River Valley Property. The Wife accepts that the Judge made a mistake in deducting these sums, the parties have adjusted their calculations in their respective skeletal submissions to account for this mistake. 13 The parties accept that, taking into account the figure of $288,750, with all else being equal, the parties’ total expenditure on the Joint Properties ought to be $4,999,963.51.  As such, the value of the Husband’s direct contributions from his cash and CPF towards the Joint Properties is $2,795,424.58, and the revised ratio of the parties’ direct contributions to the Joint Properties ought to be as follows: ContributionsWifeHusbandCash & CPF669,069.692,795,424.58Rental income767,734.62767,734.62Percentage28.7%71.3%Apportioned1,486,118.83(28.7% x 5,178,114.39)3,691,995.56(71.3% x 5,178,114.39) 14 Taking into consideration the change to the parties’ expenditure on the Joint Properties, the ratio of the parties’ overall direct contributions should be as follows:   S/NAssetWife’s contributionHusband’s contributionJoint assets1Joint Properties1,486,118.833,691,995.562Joint bank accounts36,470.31Wife’s assets3Matrimonial Home1,994,650.0055,350.004Chronoswiss watch5,628.0022,372.005Remaining assets838,188.35Husband’s assets6Husband’s assets1,274,507.59Total4,324,585.185,080,695.46Ratio46.054.0 15 Consequently, the parties’ average contributions ratio ought to be revised as follows: Contributions ratioWifeHusbandDirect46.054.0Indirect55.045.0Average50.549.5 16 In addition to the exception above, we also respectfully disagree with the Judge’s approach of adjusting the parties’ contributions ratio of 50.75 (Wife):49.25 (Husband) by 0.75% to reach a final contributions ratio of 50:50 between the parties (see Judgment at [159]). The Judge had opined that such an adjustment was warranted because this was a long marriage of 17 years with two children and, according toUBM v UBN[2017] 4 SLR 921 (“UBM v UBN”) at [66], an inclination towards equal division would apply to long dual-income marriages where appropriate. 17 In our judgment, these reasons do not pass muster. We do not interpretUBM v UBNfor the proposition that the court is entitled to further adjust the parties’ average ratiosafterapplying theANJ v ANKframework, for the sole purpose of reaching an equal or a more equal division between the parties. Indeed, such an approach was explicitly rejected by the Court of Appeal inUYQ v UYP[2020] 1 SLR 551. In that case, the High Court Judge had arrived at a average ratio of 67.5 (Wife):32.5 (Husband) after applying theANJ v ANKframework. The Judge had then proceeded to adjust this ratio downwards to 60 (Wife):40 (Husband) because of,inter alia, her view that the court should incline towards equal division in long dual-income marriages. On appeal, the Court of Appeal held that the initial ratio of 67.5:32.5 should not have been amended as the Judge, in applying theANJ v ANKframework, had already considered all the relevant factors under s 112 of the Women’s Charter (Cap 353, 2009 Rev Ed) (at [5]). Likewise, in the present case, the fact that this was a 17-year long marriage with two children hadalreadybeen duly considered by the Judge in his application of theANJ v ANKframework. We therefore do not think that there was any basis for the Judge to further adjust the parties’ average ratios to 50:50. 18 At this juncture, we also briefly explain our reasons for not disturbing the Judge’s findings as regards (a) the four insurance policies; (b) the apportionment of rental income from the Joint Properties as well as (c) the drawing of adverse inferences, given that both parties have expended considerable effort on these issues. 19 In relation to the four insurance policies in respect of which the children are the life assured, the burden lies on the Husband to show how the Judge had erred in including the insurance policies in the matrimonial pool. In our view, the Husband has not discharged this burden as he has not provided us with actual copies of the policies in question. He has only adduced letters from the insurers which do not tell us who the beneficiaries of the policies are. 20 In relation to the apportionment of rental income, the Husband makes two alternative contentions. First, the Judge should not have counted the rental income from the Joint Properties as part of the parties’ direct contributions. This approach had resulted in double-counting since the rental income had been entirely deposited into the parties’ jointly-held POSB 102 account, which already formed part of the matrimonial pool. In the alternative, the Judge should not have apportioned the rental incomeequallybetween the parties as the Wife had “washed her hands from the dealings [with] the [Joint Properties]”. 21 In our view, the Husband’s first argument is misconceived as it conflates the identification of matrimonial assets with the determination of the parties’ respective contributions to the same. In the present case, the Judge didnotinclude the rental income from the Joint Properties in the pool of matrimonial assets (see Judgment at [60]). However, as it is undisputed that the rental income from the Joint Properties had been applied to service the mortgage loans on the Joint Properties, the Judge was clearly entitled to consider the rental income as part of the parties’contributionstowards the acquisition of the Joint Properties. There would have been no double-counting in this regard since whatever moneys remained in POSB 102 evidently could not have been applied towards the acquisition of the Joint Properties. 22 The Husband’s alternative argument is likewise without merit. In our view, the Judge was entitled to rely onTwiss, Christopher James Hans v Twiss, Yvonne Prendergast[2015] SGCA 52 (“Twiss”) where the Court of Appeal held (at [18]) that rental proceeds which had been derived from renting out the parties’ jointly-owned matrimonial home “ought to be considered as belonging jointly to the parties as this was income earned on an asset that was jointly owned”. The Husband seeks to distinguishTwisson the basis that it dealt with rental income derived from a matrimonial home whereas in the present case, the rental income had been derived from jointly-owned properties which were not matrimonial homes. We do not see any reason to distinguishTwisson this basis. First, it should not make a difference whether rental income was derived from the matrimonial home or an investment property. In the years that the matrimonial home was used to earn rental income, it was practically an investment property. Secondly, in our view, the court inTwisswas applying apresumption(which is rebuttable by countervailing evidence) that rental income earned on an asset that was jointly owned should be attributed equally. The court’s application of that presumption was fair in that case because it gave recognition to the fact that the rental income was brought in by both parties to the marriage to acquire the property in question. In the present case, we are similarly satisfied that it would be fair to apply this presumption, there being no evidence of any arrangement between the parties to share the rental proceeds in an unequal manner. In fact, it is the Wife’s evidence that she has paid and is still paying income tax based on 50% of the rental income earned from the Joint Properties. 23 As to the adverse inferences against the parties, given that we have dismissed SUM 7 (see [10] above), we are not satisfied that there are any grounds for disturbing the Judge’s findings that both parties had failed to disclose certain material facts. The only aspect of the Judge’s reasoning that we disagree with is that, in drawing an adverse inference against the Husband in respect of the cheque for $180,000, the Judge had relied on the fact that one of the entries in the Husband’s cheque book had been modified (see Judgment at [138]). Based on the Husband’s cheque book records, the alteration had only been made to the amount of the cheque, and in this regard, there was no dispute that a sum of $180,000 had in fact been debited from the Husband’s bank account on 12 November 2007. Notwithstanding this, however, we agree with the Judge that the Husband had taken highly inconsistent positions as regards the purpose of the cheque, and that this provided sufficient basis to draw an adverse inference against him. On the whole, we agree with the Judge’s approach of drawing adverse inferences against the Husband and Wife equally, with the net effect that there was zero change to their average contributions ratio.",
        "Maintenance": "24 Both the Wife and the Husband are appealing against the Judge’s order that the Husband pay the Wife nominal maintenance of $1 a month. The Husband submits that the Judge should not have ordered the Husband to pay the Wife maintenance at all, while the Wife seeks lump sum maintenance of $756,000. 25 We do not think that it would be appropriate to make an order for substantive maintenance, much less lump sum maintenance in the sum of$756,000.We accept that the Husband has many financial responsibilities, including the children’s expenses and the mortgage payments for two of the Joint Properties. The Wife will also be obtaining a substantial sum from the division of matrimonial assets. 26 That being said, we do not accept the Husband’s position that the Wife should not be awarded maintenanceat all. Though the Wife previously held a well-paying job, it appears that she has not been able to secure any form of permanent employment since her retrenchment in 2017. The COVID-19 pandemic has also created uncertainty in the job market and, as the Judge found, there is real possibility that the Wife may not be able to find a job in the near future, much less one which offers her the same amount of income as before. 27 We note that, on appeal, the Husband raises the new contention that the Wife receives income from her directorship of two companies and that nominal maintenance is not warranted as a result. In response, the Wife seeks to admit two affidavits as evidence that she does not receive any income from her directorships of the two companies. We admit the two affidavits. We note the Husband’s counsel’s point that the Wife could have provided the accounts of the companies to show that she had not received any director’s fees from them. However, the affidavits were filed by the directors of the respective companies and they constitute independent evidence which this court can give weight to. In relation to the first company (“Co-W”), the affidavit states that the Wife has not received any salary or director’s fee from Co-W from the date of its incorporation, and that an application to strike off Co-W has been filed. In relation to the second company (“Co-F”), the affidavit states that the Wife has not been paid any remuneration or director’s fee from Co-F, and also shows that the Wife is not a shareholder of Co-F. 28 In the premises, we are of the view that the Judge’s decision to order nominal maintenance for the Wife was appropriate. Such an arrangement ensures that the Husband will not be unduly financially burdened at present, and also preserves the Wife’s right to apply for substantive maintenance in the future, should her unemployment persist.",
        "Costs below": "29 Finally, the Wife submits that the Judge erred in not ordering the Husband to pay the costs of the AM hearing to the Wife. The Wife contends that the Husband ought to bear the Wife’s costs because he had caused the proceedings below to become unnecessarily protracted and had also refused to engage a lawyer despite having the financial means to do so. 30 It is trite that the costs of the ancillaries is an issue that lies well within the discretion of the first instance judge: seeTNL v TNKat [65] andJBB v JBA[2015] 5 SLR 153 at [5]. In our view, there is no compelling reason to interfere with the Judge’s exercise of discretion in the present case. The Husband and the Wife had each succeeded on different aspects of the ancillary matters that were in issue, and there was therefore no obvious “winner” to whom costs should be awarded.",
        "Conclusion": "31 For the reasons set out above, we dismiss SUM 7 in its entirety, and we dismiss CAs 17 and 18 except in relation to the point set out at [12] above. 32 As for the costs of the appeals, and the costs incurred by the late filing of the two affidavits by the Wife, we order that each party bears his or her own costs. For SUM 7, we award costs against the Husband but this is fully set off against the sum of $3,906.70, being his share of the additional filing fee incurred by the parties for filing the parties’ Joint Core Bundle in excess of the page limit. The usual consequential orders will apply. Belinda Ang Saw EanJudge of the Appellate DivisionQuentin LohJudge of the Appellate DivisionChua Lee MingJudge of the High Court Lai Ying Ling Jenny and Lai Ying Mei Jennifer (Jenny Lai & Co) for the appellant in AD/CA 17/2021, the applicant in AD/SUM 7/2021 and the respondent in AD/CA 18/2021; Tay Siok Leng Josephine (Josephine Tay & Co) for the respondent in AD/CA 17/2021 and AD/SUM 7/2021, and the appellant in AD/CA 18/2021."
    }
}