{
    "case_title": "Puspa Sinnappa (personal representative and administrator of the estate of Puthalvan Vadiveloo, deceased) and another  vBalasingam s/o Rengasamy and another",
    "ncitation": "[2021] SGHC 171",
    "coram": "Andrew Ang SJ",
    "sections": {
        "Introduction": "1 This was an estate and dependency claim brought by the 1st and 2nd Plaintiffs (the wife and daughter of the deceased and co-administrators of his estate)1Foot Note 1×Statement of Claim at para 1.arising from a road accident that took place on 23 November 2015. The accident involved the Defendants’ motor vehicle and a motorcycle under the control of the deceased (“the Deceased”). The 1st Defendant was the driver of the vehicle which was owned by the 2nd Defendant.2Foot Note 2×Statement of Claim at para 2.Unfortunately, the accident caused the death of the Deceased, who was the owner and rider,3Foot Note 3×Affidavit of Evidence-in-chief of Puspa Sinnappa at para 4.and injured the 1st Plaintiff, who was riding pillion. The 1st Plaintiff has commenced a separate action in the State Court for damages arising from her personal injury. 2 In regard to liability, a consent interlocutory judgment was entered on 10 October 2019 with the Defendants agreeing to bear 85% liability and the estate accepting 15% on account of contributory negligence.4Foot Note 4×HC/JUD 551/2019. 3 It has fallen to me to assess the quantum of damages as well as to fix interest and costs.",
        "Estate claim": "4 Special damages covering medical expenses, funeral associated expenses and those incurred in taking out probate have been agreed. Interest thereon shall be at the rate of ½ of 5.33% from date of accident to date of judgment.",
        "General damages for pain and suffering": "5 The Deceased was taken to Ng Teng Fong General Hospital following the accident. Upon arrival, he was unconscious with a Glasgow Coma Scale of 3. He was noted to be bleeding from the nose and there was an obvious depressed skull fracture.5Foot Note 5×Affidavit of Evidence-in-chief of Dr Lee Eng Kiang, p 6. 6 There were other extensive injuries but it is not necessary for me to itemise them. The deceased was alive for a little over a day before he died. On the basis that with a Glasgow Coma Scale of 3 the Deceased would not have felt pain, the Defendants submitted that an award of $2,500 would be fair.6Foot Note 6×Defendants’ written submissions at para 12.The Plaintiffs, on the other hand submitted that pain and suffering included fright reaction on the part of the Deceased. They also submitted, on the authority of the Court of Appeal decision inTanKok Lam (next friend to Teng Eng) v Hong Choon Peng[2001] 1 SLR(R) 786, that an award should be made for the loss of amenities as that was an objective fact regardless of whether the Deceased was able to appreciate the loss. Accordingly, they submitted that an award of $4,000 for pain and suffering and loss of amenities would not be unfair.7Foot Note 7×Plaintiffs’ opening statement at para 4.I agree. 7 Interest on the general damages (although negligible) will run from date of service of writ to date of judgment at the rate of 5.33% per annum.",
        "Dependency claim": "8 The statutory basis for a dependency claim is in section 20 of the Civil Law Act (Cap 43, 1999 Rev Ed). Sections 20(1) and 20(2) provide as follows: Right of action for wrongful act causing death 20.—(1)  If death is caused by any wrongful act, neglect or default which is such as would (if death has not ensued) have entitled the person injured to maintain an action and recover damages in respect thereof, the person who would have been liable if death had not ensued shall be liable to an action for damages, notwithstanding the death of the person injured. (2)  Subject to section 21(2), every such action shall be for the benefit of the dependants of the person (referred to in this section and in sections 21 and 22 as the deceased) whose death has been so caused. Section 22(1) goes on to provide that in every action brought under s 20, the court may award such damages as are proportioned to the losses resulting from the death to the dependants respectively. Section 22(1A) mandates that the court shall take into account any moneys or other benefits which the deceased would be likely to have given to the dependants by way of maintenance, gift, bequest or devise or which the dependants would likely have received by way of succession from the deceased, had the deceased lived beyond the date of the wrongful death. 9 The loss of dependency is normally assessed by the multiplier-multiplicand method. The annual value of the dependency (the multiplicand) is aggregated over the number of years that the dependency might reasonably be expected to last but discounted in recognition of the fact that a lump sum is being given up front instead of by way of periodical payments over the years (the multiplier). 10 The assessment of the multiplicand is done in one of two ways; the court may simply add together the value of benefits received by the dependants from the deceased (the “Traditional Method”) or deduct a percentage from the deceased’s annual income representing personal expenditure exclusive to himself (the “Percentage Deduction Method”), leaving the rest as being for the benefit of the family. The latter method has the advantage of avoiding tedious enquiry into numerous items of expenditure spent on the dependants but is inappropriate where the deceased was a high income earner and, therefore, having the means for discretionary personal expenditure. Happily, the parties are agreed on employing the Percentage Deduction Method. 11 InHarris v Empress Motors Ltd[1984] 1 WLR 212 (“Harris v Empress Motors”) (which was referred to by the Court of Appeal inHoYeow Kim v Lai Hai Kuen[1999] 1 SLR(R) 1068), the court held that the conventional figure for deduction for personal expenses where the family unit consists of a husband and wife would be 33% – the rationale of this being the assumption that the husband and wife would spend ⅓ of the income each and ⅓ for their joint benefit; but where there are children, the conventional deduction would be 25% (Harrisv Empress Motorsat 217). 12 The percentages suggested inHarrisv Empress Motorsare merely a rule of thumb and should not be applied in a mechanistic manner. They should be departed from where the facts of the case warrant it. The Defendants submit that by reason of the fact that at the time of the accident the wife was working, the conventional percentage deductions of 25% and 33% attributable to the husband’s exclusively personal expenditure should be replaced by significantly higher percentages ranging from 40% to 50%.8Foot Note 8×Defendants’ written submissions at para 107 to para 108.The effect is to reduce the quantum attributable to dependency. No explanation was offered as to how these higher percentages were derived. We shall return to this when dealing with the multiplicand. 13 The Deceased died at the age of 40 in the accident, leaving behind three dependants, namely, his wife and two daughters aged 45, 20 and 10 years at the time of the accident. The Deceased had been working as a Cell Leader in Honeywell Aerospace Singapore Pte Ltd (“Honeywell”) at its factory in Jurong. 14 He was a hardworking man whose life revolved around his family and his job with little time for other pursuits. Moreover, he was a frugal man who spent very little on himself. His wife managed his finances as she held the ATM card for the account into which his salary was paid. She gave him $50 each time for his personal expenditure and when that ran out after a few days she would give him $50 more. He ate breakfast and lunch at the Honeywell canteen at subsidised prices. For example, breakfast cost only $1.20 and lunch, about $3.9Foot Note 9×NB: I am assuming that when the 1st Plaintiff said “…the lunch is in his own company which is subsidised. We only spend about $3 a day”, she was referring to $3 for one person (Notes of Evidence (28 October 2020) page 16 line 22 to line 23).Apart from expenses related to the motorcycle he used, there was little else he spent money on as he did not have any hobby and drank only very occasionally, such as during Deepavali with his brothers, but even then consumed little. He did not drink at home. It is little wonder that $50 would last him a few days. Even for his haircut, he would want the wife to be with him. They did their shopping together in Malaysia for which she would exchange Singapore dollars withdrawn with his ATM card for Malaysian currency. In contrast to his meagre expenses, the two daughters cost much more to maintain because of their educational expenses. Prior to the accident, the elder daughter, the 2nd Plaintiff, was given $500 each month to cover her meal expenses. In 2019, she enrolled for a part-time course of study leading to a Bachelor of Arts with Honours degree in Accounting and Finance with Coventry University in collaboration with PSB Academy. This cost $20,186 in fees.10Foot Note 10×Plaintiffs’ Bundle of Documents (Vol 1) at page 234.The 1st Plaintiff gave evidence that the deceased would certainly have supported her through tertiary education. I have no reason to doubt that. In addition, the parents were paying a total of approximately $190 in insurance premium on her behalf.11Foot Note 11×Plaintiffs’ Bundle of Documents (Vol 1) at page 255. 15 The second daughter, Darshana, had tuition in three subjects costing $320 per week.12Foot Note 12×Notes of Evidence (28 October 2020) page 21 line 18.Her School Fees and Miscellaneous fees were $400 per month.13Foot Note 13×Plaintiffs’ Bundle of Documents (Vol 1) at page 249.She also had a daily allowance of $6 (which increased to $10 when she reached Primary 5).14Foot Note 14×Notes of Evidence (27 October 2020) page 84 line 19 to line 21. 16 The 1st Plaintiff and her husband had also taken out a residential property loan for which monthly instalments were $1,475 per month for years 1 to 3 before increasing to $1,556 in year 4. From documentary evidence produced, there was payment to Singapore Power of approximately $149 per month and payment to Singtel of approximately $330 per month.15Foot Note 15×Plaintiffs’ Bundle of Documents (Vol 1) at pages 254 and 256.The latter seems high to me, but it might be for a package. In any case, this was not queried by the Defendants. One other item of expenditure which emerged in the cross examination of the 1st Plaintiff was the $12,000 annual premium for an insurance policy which was purchased in Malaysia covering the Deceased, the 1st Plaintiff and the two daughters.16Foot Note 16×Notes of Evidence (28 October 2020) page 23 line 6.The 1st Plaintiff did clarify that once the family acquired permanent residence status in Singapore, they would have to give up the policy. However, she also testified that they would have to take up insurance in Singapore once that happened.17Foot Note 17×Notes of Evidence (27 October 2020) page 53 line 27 to line 29. 17 The foregoing is of course not a comprehensive itemisation, the Plaintiffs having sensibly opted to adopt the Percentage Deduction method. They largely came out in evidence as a result of cross-examination of the 1st Plaintiff. Nevertheless, they show that the household expenses and children’s educational expenses were such that it was unlikely that on account of the wife’s income, the Deceased could have spent more on himself even if he were so inclined. Moreover, his frugality, the long hours that he spent at work and his lack of a hobby meant that he would not have required more than the conventional 25% for his exclusive use. Even the petrol and maintenance expenses for the motorcycle were family expenses, the vehicle being for the transportation of other family members as well. I am therefore of the view that at least until the elder daughter became financially independent the appropriate deduction is 25%. For subsequent dependency periods the wife’s income should be taken into account, leading to increased percentage deduction as we shall see. 18 The Plaintiffs computed the working life of the Deceased as ending at age 70, whereas the Defendants submit that it should be only until age 65. I agree with the Plaintiffs for the reasons which follow. 19 In his 2019 National Day Rally speech on 18 August of that year, the Prime Minister announced that the retirement age and re-employment age will be raised by gradual steps to 65 and 70 respectively by the year 2030. This increase would have been implemented well before the Deceased would have reached retirement age. The evidence of Ms Chong Wan Juen (“Ms Chong”), the Human Resource Manager at Honeywell, was that Honeywell currently offers re-employment beyond the statutory retirement age of 62 up to the age of 67, subject to a health check and a performance rating of 5. It is reasonable to assume that Honeywell’s re-employment policy would in due course be adjusted in line with later Government policy. It is also reasonable to assume that the Deceased, who had consistently attained a performance rating of at least 5, would qualify. 20 There is no basis to question his ability to pass a health check, there being no evidence to suggest otherwise. Indeed his wife testified that he was in good health. In any case, any possibility that he might in the future fall into ill health would already be taken into account in the multiplier for the vicissitudes of life. A further consideration which suggests that, but for the accident, the Deceased would have worked for as long as he was permitted to is the reality that, given the life expectancy in Singapore, not many people can confidently retire and depend for the rest of their lives on their CPF savings. I therefore accept that it is not unreasonable to assume that the Deceased would have worked until he attained the age of 70 years. 21 The remaining working life of the Deceased had he not suffered the wrongful death is therefore 30 years. However, to arrive at the multiplier, this figure has to be discounted to take into account the benefit of receiving a lump sum payment in advance and the vicissitudes of life. With the introduction of actuarial tables in amendments to the Supreme Court Practice Directions, multipliers can be arrived at which more realistically reflect the discounted value of an accelerated receipt of compensation and the vicissitudes of life. If the actuarial tables were to apply in the present case, the multiplier would be 21.6 years. However, the tables may only be used in proceedings that are heard on or after 1 April 2021. Unfortunately for the Plaintiffs, the present case falls on the wrong side of that cut off date. 22 The plaintiffs submit that an 18-year multiplier should apply whereas the defendants propose 15 years. I am of the view that 18 years would be fair. It implies an embedded rate of return of nearly 4% per annum which, though high would be closer to reality than the annual rate of return of more than 5% which the multiplier of 15 years implies.",
        "Multiplicand": "23 The multiplicand is based on the available annual income post-tax and after deduction of employee’s CPF contributions for the year, as this is the income from which the dependants would receive their financial support. From this resultant figure, there has to be deducted a percentage thereof representing expenditure exclusively personal to the deceased. 24 As the annual income would not be static throughout the putative working life of the deceased, salary increments and promotions (if any) would also have to be taken into account. 25 I have studied the Plaintiffs’ computation of the annual income which the Deceased may reasonably be expected to earn had he not died prematurely as a result of the accident and have the following comments: (a) The computation builds in an annual increment of 3% in the base salary. This is supported by the evidence of Ms Chong, the Human Resource Manager. On the other hand, the Defendants’ suggestion of 2.7% is not supported by the evidence. Referring to Plaintiffs’ Exhibit P7 at page 6 (on guidelines for the recommended variable bonus and merit increment range for employees), counsel for the Defendants suggested that the increment should be the mean between 2.1% and 3.3% i.e. 2.7%.18Foot Note 18×Defendant’s written submissions (9 December 2020) at para 63.However that same chart also showed that the “Average Guidance” would be 95% of the country merit increment budget. On the basis of a modest budget of 3% taken as an example, the deceased’s increment would already be 95% of 3%ie, 2.85%. (It should be noted that for the years 2015 to 2019 the country merit increment budget ranged from 3% in 2018 and 2019 to 4% in 2015 with 2016 and 2017 having a budget of 3.5%. The budget for 2020 was 0% but this was an exceptional year caused by the COVID-19 pandemic). If the country budget was just a little higher at 3.16%, the increment that the Deceased would get would be 3%. Hence the estimate of 3% given by the employer’s representative is reasonable. (b) Ms Chong also opined that the Deceased would be eligible for a promotion in the course of his career with the employer. However, if the Deceased opted for such promotion, he would have to forgo earning overtime pay. Since overtime pay constitutes a large part of the annual income, and on the basis that the Deceased would have preferred to continue earning overtime to support the family and to pay mortgage instalments for the HDB apartment that they had moved into just about a month before the fatal accident, the Plaintiffs’ computation omits any reference to a promotion. In contrast, the Defendants assume that the Deceased would be promoted by year 2023,19Foot Note 19×Defendant’s written submissions at para 78.thereby very substantially reducing the income which the Deceased would be expected to earn during his working life. In my view, this is an unreasonable assumption. The Deceased cannot be expected to opt for a promotion which would in effect drastically cut down his earnings such that his ability to support the family would be seriously compromised. However, I do not consider it reasonable to assume that the Deceased would continue to clock up the same overtime hours throughout his career. Accordingly, I would build in a ⅓ reduction in his overtime hours at, say, age 55 years and a further ⅓ reduction at say age 60. I do not apply a final ⅓ reduction at age 65 because by then the wife will have retired, having attained 70 years of age, leaving him as the sole bread winner. (c) Another item that requires determination is the variable bonus. Variable bonuses for the years 2016 to 2020 can be derived from actual site achievements in the years 2015 to 2019, using the chart at the Plaintiffs’ Exhibit P7 at page 6. For the years 2021 to 2025, the Defendants propose an average site achievement of 30%.20Foot Note 20×Defendant’s written submissions at para 89.On that basis, the Deceased would be credited with a variable bonus of 30% of the maximum of 2.5 months’ bonusie,0.75 months. Whilst I accept that the COVID-19 pandemic would have an impact on the employer’s performance, it is overly pessimistic to assume that the pandemic would have an adverse effect throughout the 5-year period. I would increase the average achievement to 40%. (i) For years 2026 onwards, possibly erring on the side of caution, I would allow an average achievement of 60% on the assumption that for every good year which achieves 90%, there will be a bad year which achieves 30% performance. 26 I now consider the 1st Plaintiff’s income. She earned much less than the Deceased. This was estimated by the Defendants to be 39.4% of the Deceased’s take-home pay at the time of the accident.21Foot Note 21×Defendant’s written submissions at para 98.From 2000 to 2006 the 1st Plaintiff was working for STATS ChipPAC Industries. Sometime in 2006 she joined Honeywell as a quality technician, but from 2010 to 2011 she stayed home to look after the second daughter because of difficulty in employing a helper. In 2012 she joined Leica for about 13 months doing documentation for incoming parts. In 2013 she left to join Ciba Vision but left after 4 months to undergo knee surgery in Malaysia followed by a break of 8 months for recuperation. In 2014 she joined Eaton Industries as a quality technician.22Foot Note 22×Notes of Evidence (27 October 2020) pages 21 to 24.Owing to injuries she sustained in the accident which took her husband’s life, she lost her job in 2016. In August 2018 she managed to secure a job in SATS Ltd (“SATS”) but owing to COVID-19 which severely affected the aviation industry, the number of hours she worked at SATS were reduced. To supplement her income, she found employment at Sim Ley Pte Ltd as a Quality Inspector. Unfortunately, that did not last long. She then took up a job at the Singapore Expo to look after COVID-19 patients so as to provide for the family as the sole breadwinner. 27 Under cross-examination the 1st Plaintiff was asked whether she agreed that once the children became independent in the future, there would be less motivation for the Deceased to work the same long hours. She disagreed and reiterated that she would become a full-time housewife at some point.23Foot Note 23×Notes of Evidence (28 October 2020) page 41 line 15 to line 16.She had earlier testified that just two weeks before the accident, she had discussed with her husband the question of her retirement and he had promised her that he would make her a housewife. The Defendants suggested to her that to enjoy the later years of their lives the husband would then not work as many hours as he did before. Her reply was that if he did not, they would not be able to “afford to go for holiday”. Moreover, with everything becoming more expensive and their having to take up insurance in Singapore, if the husband did not work hard, they would not be able to afford “all those thing[sic] in Singapore” (referring to medical bills and insurance).24Foot Note 24×Notes of Evidence (27 October 2020) page 53 line 25 to line 31.Counsel for the Defendants persisted and sought the 1st Plaintiff’s agreement that the husband would work a reduced number of hours. She replied in effect that unlike in the past when commuting between Malaysia and Singapore each day would entail three hours of travelling time, from their flat in Singapore it would take only five minutes to get to work.25Foot Note 25×Notes of Evidence (27 October 2020) page 54 line 6 to line 12.She also mentioned that previously they had to leave home at 5.30am, arriving at the factory at 7.00am. In short, therefore, living in Singapore near the place of work meant not only that the husband spent much less time travelling to work, but also that he did not have to wake up at before 5.30am. 28 I stated earlier that after the elder daughter became independent, the wife’s income should be taken into account when determining the percentage deduction attributed to the deceased husband’s personal expenses. Although the wife gave evidence of her intention of eventually becoming a full-time housewife, I am disinclined to believe that she would stop working given the financial needs of the family. How then should we compute the dependency? A principled approach was applied in the decision inCoward vComex Houlder Diving Ltd(18 July 1988, Court of Appeal) (UK) (“Coward vComex”). Under this method, the wife’s income is pooled together with the husband’s and it is taken that he would have spent 25% of that pooled income on himself (or ⅓ where there was no dependent child). The balance of the husband’s income after allowing for his increased expenses would then constitute the amount of dependency. 29 The wife’s income at the time of the accident was 39.4% (rounded up to 40%) of the husband’s take home pay. For lack of any evidence as to her income going forward, I shall assume that she would continue to take home 40% of the husband’s take home pay. 30 Applying theCoward vComexmethod, the dependency where there is a dependent child works out to be 65%. This is derived as shown below. (a) Let husband’s take home pay be H. The wife’s would then be 4/10H and the combined take-home pay would be 14/10H. (b) Applying the conventional 25% to the combined income, the husband’s personal expenditure = 25/100 of 14/10H = ¼ x 14/10H = 7/20H. Therefore, the dependency = 20-7/20H = 65% of H. (c) Applying the same method of computation, we arrive at a figure of 53.33% dependency where there are no dependent children. 31 The multiplicand is not one constant figure throughout. Apart from the provision for increments and the staged reduction of overtime, the dependency also varies according to whether there is income contribution by the wife and whether there is any dependent child. 32 It is therefore necessary to divide dependency into four tranches: (a) The first 5 years at 75% dependency (ie, not taking the wife’s income contribution into account for the reasons mentioned in [17] above).(b) The next 7 years at 65% dependency.(c) Thereafter, until the Deceased (but for the accident) would have reached the age of 65 years, at 53.33% dependency.(d) Thereafter, until the Deceased would have reached the age of 70 years at 66.66%. This is because the wife (5 years older than he) would have stopped working when she attained 70 years of age. 33 In regard to the overtime hours, I assume that at age 55 years the deceased would have shed ⅓ of his overtime hours and that 5 years down the road he would further shed a similar number of hours. As I said earlier, I do not provide for a final reduction of the remaining overtime hours because the wife would have stopped working at 70 years, leaving him as the sole breadwinner. 34 The foregoing guide-posts for the computation of the dependency claim were communicated to counsel at a hearing on 21 April 2021 and further clarified on 17 May and 2 July 2021. 35 I am grateful to counsel for the Plaintiffs for working out the rather involved computation and to counsel for the Defendants for reviewing the same. The entire set of tables from which the computations were derived are annexed hereto as Annexes A to E. 36 Based on the tables, the following are the four tranches of dependency awarded on the basis of 100% liability: For the 1st tranche of 5 yearsFor the 2nd tranche of 7 years$147,551.91$211,976.19For the 3rd tranche of 13 yearsFor the 4th tranche of 5 yearsTotal$369,784.78$220,553.99$949,866.87Add 53.33% of loss of CPF ($356,813.31 x 53.33% x 18/30)$114,173.12Total dependency claim based on 100% liability$1,064,039.99 37 Interest on pre-trial loss of dependency is computed as shown below: Loss of dependency from date of death up to date of hearing$274,713.70Interest at ½ of 5.33% per annum$41,245.20 I do not consider it appropriate to award interest on the pre-trial loss of CPF as the CPF benefit would not be enjoyed until much later in retirement.",
        "Conclusion": "38 In the result the following are awarded on a 100% liability basis. Agreed funeral associated expensesAgreed probate expenses$7,400.00$5,247.00BereavementTotal$15,000.00$27,647.00Interest at ½ of 5.33% per annum from date of accident to date of judgment$4,142.18Total including interest$31,789.18General DamagesInterest from date service of writ to date of judgment at 5.33% per annum$4,000.00$564.19Loss of dependency and CPF$1,064,039.99Interest on pre-trial loss of dependency$41,245.20Total of the damages and interest$1,141,638.56(At 85% liability on account of contributory negligence)$970,392.78 39 I will hear the parties on costs. Andrew AngSenior Judge Raj Singh Shergill and Sonia Lim (Lee Shergill LLP) for the plaintiffs; Shahira Binte Mohd Anuar and Teo Weng Kie (Tan Kok Quan Partnership) for the defendants.",
        "": "",
        "Annex A": "",
        "Annex B": "",
        "Annex B1": "Annex C",
        "Annex C1": "Annex D",
        "Annex D1": "",
        "Annex E": ""
    }
}