{
    "case_title": "The “Ocean Winner” and other matters",
    "ncitation": "[2021] SGHC 8",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Background facts": "4 PetroChina is the “owner of and/or shipper and/or consignee and/or lawful holder” of certain bills of lading in respect of cargo shipped onboard the vessels named in the Writs (collectively, “the Vessels”).  OTPL is a ship charterer and ship management company incorporated by Mr Lim Oon Kuin in Singapore in 1978.  Before OTPL filed for judicial management in May 2020 (see [10] below), OTPL chartered or operated more than 150 vessels.  Save for a few small vessels, OTPL’s vessels are bareboat chartered from Xihe Holdings Pte Ltd, Xihe Capital Pte Ltd and their subsidiaries (collectively, the “Xihe Group”).  A related company is Hin Leong Trading (Pte) Ltd (“HLT”), which is an oil trading company incorporated by Mr Lim Oon Kuin in Singapore in 1973.  OTPL, HLT, Xihe Holdings Pte Ltd, and Xihe Capital Pte Ltd are all owned by Mr Lim Oon Kuin and his daughter, Ms Lim Huey Ching, and his son, Mr Lim Chee Meng.  HLT regularly nominated OTPL’s vessels to carry out contracts for the sale and purchase of oil.  OTPL also regularly chartered vessels to numerous oil majors, traders, and state-owned enterprises (such as PetroChina).1Foot Note 1×Ee Meng Yen Angela’s 2nd affidavit dated 1 September 2020 at pp 414–415; Lim Chee Meng’s OS 666 affidavit dated 9 July 2020 (“Lim Chee Meng’s 9 July Affidavit”) at p 201. 5 At all material times, OTPL was the bareboat or demise charterer of the Vessels: “Ocean Winner” (IMO No 9242479) in Admiralty in Rem No 86 of 2020 (“ADM 86”); “Chao Hu” (IMO No 9307920) in Admiralty in Rem No 87 of 2020 (“ADM 87”); “Ocean Goby” (IMO No 9812406) in Admiralty in Rem No 88 of 2020 (“ADM 88”); and “Ocean Jack” (IMO No 9812418) in Admiralty in Rem No 89 of 2020 (“ADM 89”).  The Vessels are owned by subsidiaries of either Xihe Holdings Pte Ltd or Xihe Capital Pte Ltd.  In particular, Ocean Jack and Ocean Goby are owned by An Rong Shipping Pte Ltd (which is owned by Xihe Capital Pte Ltd) while Ocean Winner and Chao Hu are owned by Dafa Shipping (Pte) Ltd (which is owned by Xihe Holdings Pte Ltd).2Foot Note 2×Lim Chee Meng’s 1st affidavit dated 8 May 2020 (“Lim Chee Meng’s 8 May Affidavit”) at pp 20, 36, 44; Lim Chee Meng’s 9 July Affidavit at [11]–[12], p 118 and pp 193–195.Prior to 17 April 2020, Mr Lim Oon Kuin, Ms Lim Huey Ching, and Mr Lim Chee Meng were each directors of OTPL and of HLT.  On 17 April 2020, Mr Lim Oon Kuin stepped down as a director of HLT and OTPL.3Foot Note 3×Ee Meng Yen Angela’s 3rd affidavit dated 1 October 2020 (“Angela’s 3rd Affidavit”) at [19].Ms Lim Huey Ching and Mr Lim Chee Meng are also directors of Xihe Holdings Pte Ltd, Xihe Capital Pte Ltd, as well as various subsidiaries in the Xihe Group which had bareboat chartered vessels to OTPL.4Foot Note 4×Lim Chee Meng’s OS 452 affidavit dated 11 May 2020 at [7]–[9]; Lim Chee Meng’s 9 July Affidavit at [1]. 6 On 17 April 2020, OTPL and HLT (represented by the same law firm) filed Originating Summons No 406 of 2020 (“OS 406”) and Originating Summons No 405 of 2020 (“OS 405”) respectively for moratorium relief pursuant to s 211B(1) of the CA (“s 211B moratorium”).5Foot Note 5×Lim Chee Meng’s 8 May Affidavit at [7]–[8].An automatic moratorium came into effect upon the filing of the application under s 211B of the CA, which was to last for 30 days or until the application was heard and determined, whichever came earlier (see s 211B(13)).  It is not in dispute that OTPL had not attempted to seek any creditor support for the moratorium before the filing of the application. 7 On 21 April 2020, HLT filed for judicial management and interim judicial management (“IJM”) via Originating Summons No 417 of 2020 (“OS 417”) and Summons No 1780 of 2020 (“SUM 1780”) respectively.  On the same day, HLT also filed Summons No 1779 of 2020 (“SUM 1779”) to withdraw its s 211B moratorium application in OS 405. 8 On 22 April 2020, PetroChina filed the Writs for ADM 86–89.  The Writs name the defendant as the “Owner and/or Demise Charterer” of the respective Vessels.  They disclose cargo claims by PetroChina against the respective Vessels.  The Endorsements of Claim contained in the Writs state that PetroChina claims damages against the owner and/or demise charterer of the Vessels for the following: … breach of contract and/or negligence and/or breach of duty as bailees and/or conversion of the said cargo, by themselves their servants or agents, in respect of their failure to deliver the said cargo and/or misdelivery of the said cargo. 9 On 27 April 2020, HLT’s withdrawal application in SUM 1779 and IJM application in SUM 1780 were heard together before Kannan Ramesh J, who granted both SUM 1779 and SUM 1780.  Therefore, the s 211B moratorium no longer applied to HLT.  The judge also directed,inter alia, that OTPL was to indicate within one week (i.e., by 4 May 2020) whether it was proceeding with OS 406. 10 On 6 May 2020, OTPL filed the following applications: (a) Summons No 1902 of 2020 (“SUM 1902”) to withdraw its application in OS 406 for moratorium relief; (b) Originating Summons No 452 of 2020 (“OS 452”) for an order that it be placed under judicial management; and (c) Summons No 1903 of 2020 (“SUM 1903”) for an order that, pending the determination of OS 452, it be placed under IJM. 11 On 8 May 2020, OTPL entered an appearance in ADM 86–89 and filed the Summonses to set aside or strike out the Writs under O 12 r 7(1) and/or O 18 r 19(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”). 12 On 12 May 2020, Ramesh J ordered that: (a) For SUM 1902, OTPL was to be granted leave to withdraw OS 406, “subject to the creditors’ positions being reserved to argue, amongst others”, that: (i) OS 406 “was not correctly brought on the sole ground that it did not satisfy the requirements of section 211B [of the CA], in particular, section 211B(4) of the [CA]”; (ii) the s 211B automatic moratorium “did not restrain the commencement of” certain admiralty actions, including ADM 86–89; (iii) in the event the s 211B automatic moratorium “is effective and restrains commencement of the said admiralty actions”, including ADM 86–89, “leave to commence such actions would nonetheless have been granted either retrospectively or otherwise”. (b) For SUM 1903, OTPL was to be placed under IJM, with Mr Purandar Janampalli Rao and Ms Ee Meng Yen Angela (“Ms Angela Ee”) to be appointed as interim judicial managers of OTPL. 13 Therefore, the s 211B moratorium flowing from the filing of OS 406 was no longer in place from the time of the order made on 12 May 2020.  For completeness, I should add that, on 7 August 2020, Ramesh J granted both OS 417 and OS 452.  OTPL’s interim judicial managers were appointed as its judicial managers.  As such, OTPL and HLT are now both under judicial management.  On 13 August 2020, Xihe Holdings Pte Ltd was ordered to be placed under IJM as well.6Foot Note 6×Angela’s 3rd Affidavit at [67] and pp 2435–2437. 14 None of the Writs has been served on the Vessels to date.  OTPL discovered the Writs after a cause book search was conducted in respect of the Vessels.7Foot Note 7×Lim Chee Meng’s 8 May Affidavit at [10]. 15 It is also relevant to these applications that, on 1 October 2020, OTPL filed Summons No 4257 of 2020 (“SUM 4257”) in OS 452 for leave to disclaim “unprofitable contracts previously entered into by [OTPL]”, including “all bareboat charter agreements … between [OTPL] and the respective owners … for … 96 vessels”, including the Vessels.  On 23 November 2020, Ramesh J allowed the application to disclaim 11 of the bareboat charterparties, including those for Ocean Winner and Chao Hu.  For certain other charterparties, including those for Ocean Goby and Ocean Jack, the application for leave to disclaim those contracts was adjourned to a date to be fixed.8Foot Note 8×See Plaintiff’s Other Hearing Related Requests dated 31 December 2020 at [3]–[7].",
        "The parties’ cases in the Summonses": "16 OTPL submits that the Writs should be set aside under O 12 r 7(1) of the ROC, on the authority ofThe“Hull 308”[1991] 2 SLR(R) 643 (“The Hull 308”), or the inherent powers and/or jurisdiction of the court.  Alternatively, OTPL submits that the Writs should be struck out under O 18 rr 19(1)(b) or 19(1)(d) of the ROC because the s 211B automatic moratorium was subsisting when the Writs were filed.  In particular, OTPL relies on ss 211B(8)(c)–211B(8)(d) of the CA for its submission that the Writs could not be filed without leave of court.  OTPL had to rely on s 211B of the CA as that was the applicable statutory provision at the time of the filing of OS 406 (on 17 April 2020).  As highlighted at [2] above, s 211B(8) of the CA has since been repealed and re-enacted as s 64(8) of IRDA, which came into effect on 30 July 2020.  For schemes of arrangement, IRDA does not apply where an application under s 211B of the CA has been made before 30 July 2020: s 526(1)(b), IRDA. 17 As regards s 211B(8)(c) of the CA, OTPL submits that, while thein remwrit is procedurally an action against theres(i.e., the vessel), the true defendant of the action is the owner and/or the demise charterer of the vessel.  Consequently, OTPL submits that the Writs are “proceedings” commenced against OTPL, who is the demise charterer, within the meaning of s 211B(8)(c) of the CA and as such the Writs could not be filed except with leave of court.  Alternatively, relying on s 211B(8)(d) of the CA, OTPL submits that the Vessels are its “property” because it has a bareboat charter interest in the Vessels.  Thus, the Writs are “other legal process[es]” commenced against “property” of OTPL within the meaning of s 211B(8)(d) of the CA, which were filed without leave of court despite such leave being required by the statute.  Since the filing of the Writs was done in flagrant disregard of the s 211B automatic moratorium, this constitutes a serious abuse of process and the Writs should be struck out. 18 PetroChina submits that the filing of the Writs was not caught by the s 211B automatic moratorium because ss 211B(8)(c)–211B(8)(d) of the CA did not apply to bar the filing of the Writs without leave of court.  Section 211B(8)(c) of the CA did not apply because an admiraltyin remwrit is an action against theres, not the company.  Section 211B(8)(d) of the CA did not apply because the act of filing the admiraltyin remwrits does not come within the meaning of “execution, distress or other legal process[es]” under s 211B(8)(d) of the CA.  The Vessels were also not “property” of OTPL, who is a demise charterer and not the shipowner.  PetroChina also highlighted in its written submissions that s 211B(8)(e) of the CA did not apply to the present case.  However, OTPL ultimately did not rely on s 211B(8)(e) of the CA in its submissions in support of the Summonses. 19 In addition, PetroChina also makes three alternative submissions.  First, the s 211B moratorium was voidab initiobecause OTPL blatantly failed to comply with the requirement under s 211B(4) of the CA before filing its application under s 211B(1), in particular, the requirement for evidence of creditor support for the moratorium (see s 211B(4)(a)).  Second, there is a triable issue as to whether OTPL was indeed the genuine bareboat charterer of the Vessels at the material time because OTPL produced two different versions of the bareboat charterparties (one from Mr Lim Chee Meng, and another from Ms Angela Ee), which, PetroChina submits, casts doubt on the veracity of these bareboat charterparties.9Foot Note 9×Cao Haijing’s affidavit dated 11 August 2020 at [15]–[16].If OTPL is not the genuine bareboat charterer but perhaps acting only as an agent, the statutory moratorium in favour of OTPL would be irrelevant.  Third, if there has been a breach of the moratorium, retrospective leave should be granted by the court for the Writs to be filed.  In response to these submissions, OTPL submits that there is no provision under the CA that states that a moratorium under s 211B which was obtained in a procedurally defective manner is voidab initio; there is no basis for PetroChina’s speculative allegations that the bareboat charters may be shams and there is thus no basis to dispute that OTPL was the bareboat charterer that is potentially liable in respect of PetroChina’s contractual claim; and that retrospective leave of court should not be granted for the Writs to be filed.",
        "Issues to be determined": "20 Two main issues arise for determination in this case. (a) First, was the filing of the admiraltyin remWrits the commencement of “proceedings” against “the company”, OTPL, under s 211B(8)(c) of the CA? (b) Second, was the filing of the admiraltyin remWrits an “execution, distress or other legal process” against “property” of OTPL under s 211B(8)(d) of the CA? 21 If the answer to either of the foregoing questions is in the affirmative, then that would mean that the Writs were filed without leave of court as required under ss 211B(8)(c) and 211B(8)(d) of the CA.  This leads to a consideration of the next issue of whether retrospective leave of court should now be granted for the Writs to be filed. 22 As for the two other issues raised by PetroChina,i.e., is the s 211B moratorium voidab initiodue to OTPL’s failure to comply with s 211B(4) of the CA when it filed OS 406, and is there a triable issue as to whether OTPL was the genuine bareboat charterer of the Vessels, I recognise that these other issues can be determined quite separately from the questions of statutory interpretation.  They are alternative arguments by Petro China if I find that the statutory moratorium did not bar the filing of the Writs.  However, as the submissions by the parties on these other issues involve protracted questions of fact,e.g., whether the directors of OTPL were at the time of the filing of OS 406 acting in bad faith, and the actual contractual arrangements between OTPL and the shipowners, I shall first consider the question of the interpretation of ss 211B(8)(c)–211B(8)(d) of the CA, as outlined at [20] above.  If I do find in favour of PetroChina on the point of statutory interpretation and conclude that the filing of the Writs fell outside the scope of the moratorium, there would be no need to deal with these two other issues.  I should also add that the focus of counsel’s submissions at the hearing was on the proper statutory interpretation of s 211B(8) and it will be remiss of me not to deal with those submissions squarely. 23 As highlighted at [16] above, OTPL relied on the CA rather than IRDA in this case, and parties made their submissions on the basis of the relevant CA provisions, since the applicable provisions of IRDA were not yet in force at the time of the filing of OS 406.  As such, I have to analyse the relevant provisions of the CA that are relevant to this case, even though they have now been repealed, but I will highlight the corresponding provisions of IRDA (where applicable).",
        "Legal requirements of O 12 r 7(1) and O 18 r 19(1) of the Rules of Court": "24 O 12 r 7(1) of the ROC provides: Dispute as to jurisdiction, etc. (O. 12, r. 7) 7.—(1)  A defendant who wishes todispute the jurisdictionof the Court in the proceedings by reason of any such irregularity as is mentioned in Rule 6 or on any other ground shall enter an appearance and within the time limited for serving a defence apply to the Court for — (a) an order setting aside the writ or service of the writ on him … [emphasis added] 25 O 12 r 7(1) of the ROC applies to a situation where there is a dispute as to the existence, and not as to the exercise, of the court’s jurisdiction:The “Jian He”[1999] 3 SLR(R) 432 at [44].  Thus, in the context of an admiraltyin remwrit, an objection to the writ would fall within O 12 r 7(1) of the ROC if it is a jurisdictional challenge,e.g., that the requirements under ss 3 or 4 of the High Court (Admiralty Jurisdiction) Act (Cap 123, 2001 Rev Ed) (“HCAJA”) are not satisfied. 26 O 18 rr 19(1)(b) and 19(1)(d) of the ROC provide as such: Striking out pleadings and endorsements (O. 18, r. 19) 19.—(1)  The Court may at any stage of the proceedings order to be struck out or amended any pleading or the endorsement of any writ in the action, or anything in any pleading or in the endorsement, on the ground that — … (b) it is scandalous, frivolous or vexatious … [or] … (d) it is otherwise an abuse of the process of the Court, and may order the action to be stayed or dismissed or judgment to be entered accordingly, as the case may be. 27 As set out in O 18 r 19(1)(b) of the ROC, pleadings or the endorsement of a writ may be struck out if they are “scandalous, frivolous or vexatious”.  A claim can be “scandalous” if it contains averments that are irrelevant and unnecessary to the cause of action sought to be established, and have been included to abuse, discredit or prejudice a party:Singapore Civil Procedure 2020vol 1 (Chua Lee Ming gen ed) (Sweet & Maxwell, 10th Ed, 2020) at para18/19/11.  A claim can be “frivolous or vexatious” if it is “plainly or obviously unsustainable”, which means a claim which is either legally or factually unsustainable:The“BungaMelati 5” [2012] 4 SLR 546 at [32]–[33] and [39]. 28 Under O 18 r 19(1)(d) of the ROC, pleadings or the endorsement of a writ may be struck out if they are an abuse of the process of the court.  The instances of abuse of process include, but are not limited to, the following: proceedings which involve a deception on the court, or are fictitious or constitute a mere sham; proceedings where the process of the court is not being fairly or honestly used, but is employed for some ulterior or improper purpose or in an improper way; proceedings which are manifestly groundless, without foundation or serve no useful purpose; or multiple or successive proceedings which cause or are likely to cause improper vexation or oppression:CheeSiok Chin and others v Minister for Home Affairs and another[2006] 1 SLR(R) 582at [34] and [36].",
        "Can O 12 r 7(1) apply in this case?": "29 While not raised by the parties, it appears to me that a preliminary issue that arises from the Summonses is whether O 12 r 7(1) of the ROC even provides a proper basis for OTPL’s challenge to the Writs.  The question is whether the present challenge to the Writs is a challenge to the existence of, as opposed to the exercise of, this court’s jurisdiction (see [25] above).  OTPL relies onThe Hull 308([16]supra) and submits that O 12 r 7(1) is applicable.  InThe Hull 308, the Court of Appeal upheld the High Court’s decision to set aside an admiraltyin remwrit filed after the winding up of the company because the writ was filed without obtaining leave to commence the action under s 262(3) of the Companies Act (Cap 50, 1988 Rev Ed).  Section 262(3)(a) of the Companies Act (Cap 50, 1988 Rev Ed) – which is now found in s 133(1)(a) of IRDA – provides that, when “a winding up order has been made or a provisional liquidator has been appointed, no action or proceedings shall be proceeded with or commenced against the company except … by leave of the Court”. 30 In my view, since O 12 r 7(1) of the ROC applies to a situation where there is a dispute as to the existence (and not the exercise) of the court’s jurisdiction (see [25] above), one has to consider whether the filing of an admiraltyin remwrit without leave of court, assuming such leave is required by statute, would mean that the court’s jurisdiction over the matter would noteven exist, or if it means that, in such a scenario, the existence of the court’s jurisdiction is not denied by the commencement of the proceedings without leave, but instead the question is whether it would be appropriate for the court toexercise its jurisdictionto hear the matter.  In the former case, the writ may be set aside, while in the latter case, the appropriate remedy might be a stay of the proceedings or a striking out.  When I asked counsel for OTPL about this distinction, he did not cite any other authorities, apart fromThe Hull 308, to support his submission that the Writs may be set aside under O 12 r 7(1).  However, from my reading of the judgment inThe Hull 308, it is not apparent that this issue was actually raised and disputed by the parties in that case.  Also, there is no mention in that judgment as to whether counsel in that case had relied on O 12 r 7(1) as a basis for setting aside. 31 Nevertheless, as the parties did not raise this as a specific issue, I express no firm view on whether the nature of OTPL’s objection is one that properly falls under O 12 r 7(1), and shall proceed on the basis of the parties’ position that it is applicable.  I turn now to the more central issue of whether leave of court was required under ss 211B(8)(c)–211B(8)(d) of the CA to file the Writs.",
        "Nature of the filing of the admiraltyin remwrit and the admiraltyaction": "32 To determine if the filing of the Writs comes within ss 211B(8)(c)–211B(8)(d) of the CA, the nature of the filing of an admiraltyin remwrit has to be properly understood.  I thus first set out the relevant principles concerning the admiraltyin remaction.  In this regard, I find the following cases to be particularly instructive:The “Bolbina”[1993] 3 SLR(R) 894 (“TheBolbina”);TheFierbinti[1994] 3 SLR(R) 574 (“TheFierbinti”); andThe “Trade Resolve”[1999] 2 SLR(R) 107 (“The Trade Resolve”). 33 First,in remactions under the HCAJA can be brought only in the circumstances set out at ss 4(2), 4(3) and 4(4) of the HCAJA.  Claims which fall within s 4(4) of the HCAJA are often referred to as “statutory lien claims” or, more accurately, claims brought pursuant to “statutory rights of actionin rem”. 34 Second, forin remactions under s 4(4) of the HCAJA, the issuance of the admiraltyin remwrit “createsthe statutory lien and protects it from any change of ownership thereafter even though the writ has not been served” [emphasis added].  Service of the writ is “not necessary for the creation of the lien or its protection from change of ownership”:TheBolbinaat [14].  Thus, the statutory lien, once created by the issuance of the writ, attaches to each and every ship named in the writ:TheBolbinaat [21].  Even if there is a subsequent change of ownership of the ship(s), the new shipowner’s title remains encumbered by the statutory lien created by the admiralty writ. 35 Third, the creation of the statutory lien by the issue of thein remwrit and the invocation of jurisdictionin remare “extremely different concepts”:TheBolbinaat [15].  It is now well established law that the admiralty jurisdiction of the court is only invoked upon either the service of the writ on the ship or the arrest of the ship, whichever is earlier:TheFierbintiat [39].  Thus, as explained by the High Court inThe Trade Resolveat [46]: … only after the admiralty jurisdiction to hear an actionin remis properly invoked by a proper service of a writ in an actionin remwithin Singapore’s territorial waters, or by a proper and lawful arrest in territorial waters without contravention of Art 28 of UNCLOS or in inland waters,then the court will be vested with the necessary admiralty jurisdiction to hear and try an actionin rem, and to give a judgmentin remagainst the vessel if the claim is proved.  [emphasis added] 36 Of course, even without service of the admiraltyin remwrit, a shipowner or demise charterer may enter an appearancegratisfor the purpose of seeking to set aside the writ under O 12 r 7(1) of the ROC, on the grounds that the High Court would not have admiralty jurisdiction over the matter,i.e., that the jurisdictional requirements under the HCAJA are not met.  For example, it might be a clear case that the requirement in s 4(4) of the HCAJA is not met because the demise charterer of the ship “at the time when the action is brought” is not the person “who would be liable on the claim in an action in personam … when the cause of action arose”.  However, OTPL in this case is not objecting on the basis that any of the jurisdictional requirements under the HCAJA have not been met such that the court would not have any admiralty jurisdiction over the Vessels named in the Writs. 37 Fourth, it is well established, as the parties accept, that an admiralty actionin remis an action against ares,i.e.the vessel:TheBolbina([32]supra) at [11].  However, whether or not the admiralty action remains as a “pure”in remaction, or is transformed into an action which proceeds as both anin remas well as aninpersonamclaim, which I will describe as a “mixed action” for want of a better phrase, or a “pure”inpersonamaction, depends on whether the defendant enters an appearance and/or provides security:TheBolbinaat [13]. (a) First, where thein remwrit is served and the owner or charterer of the vessel enters an appearance, thein remaction also becomes aninpersonamclaim against the owner or charterer.  The appearance transforms the proceedings into one where there is also aninpersonamclaim, and the owner or charterer who has entered an appearance will become liableinpersonamon any judgment obtained.  This is regardless of whether the owner or charterer provides any security for the plaintiff’s claim.  But, if the owner or charterer then furnishes proper and sufficient security for the claim, the action further transforms into a “pure”inpersonamaction against him for all intents and purposes.  The arrest procedure, if not already utilised, and other features of thein remaction then become dormant.  The action will then proceed like any otherinpersonamclaim against the owner or charterer, save that security has been provided for the claim. (b) Second, where thein remwrit is served on the ship and the warrant of arrest is executed but there is no appearance by the ship’s owner or charterer, the admiralty action remains and will proceedin remagainst theresand only against theresas a “pure”in remaction.  The plaintiff is left to proceed in default of appearance, and if he obtains judgment, or if he obtains an order for sale before that, the ship will be sold to create a fund to satisfy all claims against the ship in accordance with the rules of priority.  In that sense, the action continues as a true actionin remafter the arrest of the ship if no appearance is entered and no security is provided.  The owner or charterer will not be liableinpersonamon any judgment that is obtained. (c) Third, where thein remwrit is served and the ship is arrested and the ship’s owner or charterer enters an appearancebutdoes not provide security, this would be a “mixed” actionin remandinpersonam.  The action isin rembecause the ship is taken as security.  The action is alsoinpersonambecause, once the owner or charterer in an admiralty actionin remhas entered an appearance in such action, he has submitted himself personally to the jurisdiction of the court.  Thus, any judgment obtained binds theres, which is the vessel, and it also binds the owner or chartererinpersonam. 38 In a “pure”in remaction, if judgment is obtained by the plaintiff, that judgment is enforceableonly against the shipand enforcement is limited to the realised value of the ship.  In a “mixed” actionin remandinpersonam, if judgment is obtained, it is enforceable against the shipand also against theshipowner (or charterer)to the full extent of the judgment.  In other words, judgment may be entered and enforced against the shipowner or charterer to thefullextent of the damages awarded to the plaintiff and is not limited to the value of theresor the bail which represents theres:TheFierbinti([32]supra) at [12];The “Kusu Island”[1989] 2 SLR(R) 267 (“TheKusu Island”)at [17];The Dictator[1892] P 304.  In aninpersonamaction, the shipowner or charterer is liable for the full amount of the plaintiff’s proved claim:The Trade Resolve([32]supra) at [48]. 39 Appearance is entered, not only to defend a claim, but also if the owner or charterer wishes to apply to set aside the writ or service of the writ, or otherwise to challenge the jurisdiction of the court: Toh Kian Sing SC,Admiralty Law and Practice(LexisNexis, 3rd Ed, 2017) (“Toh Kian Sing”) at p 214;The Trade Resolveat[38].  Where the shipowner or charterer appears in the action, he submits to the jurisdiction of the court, except where he is successful in setting aside the writ or service thereof or otherwise challenging the court’s jurisdiction:Toh Kian Singat p 214.  As already mentioned (at [25] above), the application to set aside admiralty writs is brought under O 12 r 7(1) of the ROC on the basis that the requirements for admiralty jurisdiction under the HCAJA are not met, or in relation to a lack of proper service of the writ.  All these objections go to the question of the admiralty jurisdiction of the High Court, and are quite different to the objection raised by OTPL in the Summonses. 40 With these principles in mind, I now turn to the main issues of whether the filing of the Writs came within ss 211B(8)(c)–211B(8)(d) of the CA.",
        "Does s 211B(8)(c) of theCompanies Act apply?": "41 Section 211B(8)(c) of the CA – which has been repealed and re-enacted as s 64(8)(c) of IRDA (in largely similar terms) – provides: Power of Court to restrain proceedings, etc., against company … (8) Subject to subsection (9), during the automatic moratorium period for an application under subsection (1) by a company — … (c) noproceedings(other than proceedings under this section or section 210, 211D, 211G, 211H or 212) may be commenced or continued againstthe company, except with the leave of the Court and subject to such terms as the Court imposes; [emphasis added] 42 The three-step framework for statutory interpretation is well established.  First, the court should ascertain the possible interpretations of the statutory provision, having regard not just to the text of the provision but also to the context of that provision within the written law as a whole.  Second, the court should ascertain the legislative purpose of the statute.  Third, the court should compare the possible interpretations of the provision against the purpose of the statute and prefer the interpretation which furthers the purpose of the written text.  The court must begin by presuming that a statute is a coherent whole, and that any specific purpose of a provision does not go against the grain of the relevant general purpose of the statute, but rather is subsumed under, related or complementary to it.  The statute’s individual provisions must then be read consistently with both the specific and general purposes, so far as it is possible:Tan Cheng Bock v Attorney-General[2017] 2 SLR 850 at [37]–[54]. 43 The material question before me is the proper interpretation to be given to the phrase “proceedings … against the company”.  There are two specific issues: whether the filing of the Writs is (a) a commencement of “proceedings” and whether it is (b) “against the company”, OTPL.  I shall now turn to the first issue.",
        "Commencement of “proceedings”": "44 It is clear that the filing of the Writs is not a “continuation” of “proceedings”; the question is whether it is a commencement of “proceedings”.  I accept that a plain interpretation of that phrase could mean the initiation of any legal process towards a formal adjudication, such as the filing of a writ, or it could more restrictively mean when the service of legal process has been effected because this is when a formal response,e.g., the entry of appearance or filing of a defence, then becomes necessary. Purpose of s 211B of the Companies Act 45 The purpose behind s 211B of the CA was summarised by Ramesh J inRe IMSkaugen SE and other matters[2019] 3 SLR 979 at [41]–[42], citing Mr Edwin Tong SC’s comments during the second reading of the Companies (Amendment) Bill 2017 (Bill No 13/2017) inSingapore Parliamentary Debates, Official Report(10 March 2017) vol 94 (“2017 Parliamentary Debates”).  A scheme of arrangement under the CA – provided by ss 210, 211, 211A–211J and 212 of the CA (ss 211A–211J of the CA have now been repealed and re-enacted as ss 63–72 of IRDA) – was meant to allow companies to implement debt-restructuring arrangements without being seen as making an insolvency application.  Within this framework for schemes of arrangement, the specific purpose of s 211B is to provide for an automatic 30-day stay of proceedings against the applicant company, once an application under s 211B(1) for a scheme of arrangement is filed, so that the company has “breathing space” to either develop and propose a restructuring plan, or, if one has been proposed, to refine and mature it based on engagement with its creditors.  The end objective in both situations is a vote on the restructuring plan at a scheme meeting if one is ordered under s 210(1) of the CA (which is still in force today). 46 To quote Mr Tong SC, who was also a member of the Insolvency Law Review Committee and also a member of the Committee to Strengthen Singapore as an International Centre for Debt Restructuring, in full: The moratorium is crucial because it suspends actions against a debtor company.Without a moratorium, a scramble usually takes place when creditors think that someone else is going to steal a march on them, and consequently everyone moves in to liquidate the company. This undermines any prospect of being able to reach a more beneficial arrangement. It drives a company towards litigation and ultimately kills value in the company.In contrast, a moratorium holds the line and keeps all creditors on an even keel. This is vital, so that companies in distress can have some ‘breathing space’ in order to put in place an effective and mutually beneficial rescue plan. In that context, the automatic 30-day moratorium upon an application being made in Court is very much welcomed. This is necessary to give efficacy to the moratorium. … [emphasis added] 47 Similarly, Ms Indranee Rajah SC, then Senior Minister of State for Finance and for Law, explained during the 2017 Parliamentary Debates that: The moratoriumprevents creditors fromtaking action against the company, such as commencing legal proceedings or enforcing security rights, and gives the company breathing room to put forward the restructuring proposal. [emphasis added] 48 Then, in a further Note on the 2017 amendments to the CA titled “Enhancing Singapore as an International Debt Restructuring Centre for Asia and Beyond” (20 June 2017), Ms Rajah SC stated that the change effected by the amendments would be that: … [I]f an automatic or court-ordered moratorium in a scheme situation is in place, maritime claimants will have to apply for leaveto proceed with their claims(in the same way that they have always had to do in liquidation and judicial management situations). [emphasis added] 49 It is apparent from the foregoing that s 211B of the CA is meant to provide “breathing space” for applicant companies to devise a scheme of arrangement that may have a higher prospect of success at the vote for the scheme.  Thus, the underlying purpose behind the moratorium is to prevent creditors of the company from “taking action” or “proceedingwith” their claims against the company while it is working on a scheme proposal.  Some semblance of thestatus quomust prevail so that the officers of the company can have time to meaningfully engage with the creditors, instead of time and resources being spent on fighting fires. Winding up and judicial management 50 It is next important to consider the differences between the s 211B moratorium and the moratorium regime for winding up and judicial management. 51 Under s 262(3) of the CA, which is now found in s 133(1)(a) of IRDA, once a winding up order has been made or a provisional liquidator has been appointed, “no action or proceeding shall be proceeded with or commenced against the company except … (a) by leave of the Court; and (b) in accordance with such terms as the Court imposes”.  In addition, s 258 of the CA – now s 129 of IRDA – provides that, at any time after the making of a winding up application and before a winding up order has been made, the court may stay or restrain further proceedings in any pending action or proceeding against the company.  Critically, s 260 of the CA – now found in s 130(2) of IRDA – has the effect of rendering as void any attachment, sequestration, distress or execution put in force against the estate or effects of the company after the commencement of the winding up. 52 As compared to s 211B of the CA, a winding up moratorium is understandably wider because the “primary object of the winding up provisions of the [Companies] Act … is to put all unsecured creditors upon an equality and to pay themparipassu”:The Hull 308([16]supra) at [14].  It is thus important to prevent an unsecured creditor frombecominga secured creditor after a provisional liquidator has been appointed or after the commencement of winding up. 53 Unlike liquidation, judicial management is intended “to minimize the depletion of economic resources and to offer the unsecured creditor a platform to make his view heard”.  Judicial management provides a legal framework that would enable the rescue of a potentially viable business and thus prevent a premature liquidation, while winding up is the “precise converse of judicial management”, entailing the entire process leading to the ultimate interment of the company itself:Neo Corp Pte Ltd (under judicial management) vNeocorp Innovations Pte Ltd and another application[2005] 4 SLR(R) 681 at [30]–[31]. 54 Once the application for a judicial management order is filed, there is an imposition of an interim moratorium under s 227C of the CA (now s 95 of IRDA) until the making of the order or the dismissal of the application.  Another moratorium under s 227D of the CA (now s 96 of IRDA) kicks in after the judicial management order is made: the purpose of s 227D is to restrict creditor actions in order to not render any judicial management process otiose.  In particular, ss 227D(4)(a)–227D(4)(f) exactly mirrors the provisions of ss 211B(8)(a)–211B(8)(f) of the CA.  The purpose of the judicial management moratorium is also similar to s 211B.  It is to provide “breathing space during which plans can be put together to achieve the purposes” of judicial management: seeSingapore Parliamentary Debates, Official Report(5 May 1986), vol 48 at col 40, per then Minister of Finance, Dr Hu Tsu Tau.  In other words, the judicial management moratorium is meant to support the ability of the judicial manager to carry out his function. 55 In a proposed scheme of arrangement, the interest of a creditor is different from that of a creditor in a liquidation.  In a proposed scheme of arrangement, the creditor has an autonomous voting right which may be critical to the jurisdiction of the court to sanction the scheme.  While the creditor may have an interest in the eventual payout if the scheme is proved, the creditor may also prefer not to have that payout, and instead may vote against the proposed scheme so that he could recover his claim in a liquidation:The Royal Bank of Scotland NV (formerly known as ABNAmro Bank NV) and others v TT International Ltd and another appeal[2012] 2 SLR 213 (“TT International”)at [93].  On the other hand, in liquidation, the interest of every creditor is to seek greater priority in the repayment of its debt from the assets of the debtor company.  This explains the need for theparipassuprinciple.  Thus, the concern about preventing an unsecured creditor from “stealing a march” on his fellow unsecured creditors in a liquidation context is absent in the context of a proposed scheme of arrangement. 56 The main effect of the “turning” of an unsecured creditor into a secured creditor during a s 211B moratorium is on theclassification of creditors, because secured and unsecured creditors must be classed differently for the purposes of voting for the proposed scheme:TT Internationalat [131]–[141].  Thus, when a creditor “turns” from an unsecured creditor into a secured creditor during the s 211B moratorium and but before the creditors’ meeting to vote on the proposed scheme, it is not a case of the priority of the creditor’s claim against the company being improved.  Rather, all it does is to result in a different classification of the creditor for the purposes of voting on the proposed scheme. Is the filing of the Writs the commencement of “proceedings”? 57 From the foregoing, the key difference between the purpose of the winding up moratorium provisions – under ss 258–262 of the CA (now ss 129–133 of IRDA) – and the s 211B moratorium is that the liquidation moratorium seeks to prevent all proceedings against the company that result in any unsecured creditor “stealing a march” on their fellow unsecured creditors.  On the other hand, the specific purpose of s 211B is simply to give time – “breathing space” – to the company to devise or refine a restructuring plan that has the highest chance of being approved by a vote from the creditors at the scheme meeting, without distraction by any proceedings that may threaten the creditors’ confidence in the success and viability of any scheme.  If a company is busy defending lawsuits, or trying to prevent its property from being seized,while it is devising its plan for a scheme of arrangement, the company will likely have less time and resources to devote to coming up with a scheme that may be acceptable to the creditors.  In my judgment, therefore, the s 211B moratorium could not have been intended to operate in such a way as to deny the creation of substantive legal rights.  It only acts to postpone the pursuit and/or enforcement of such legal rights so that the company’s officers will not be too distracted and can focus their minds on coming up with a scheme of arrangement. 58 As explained at [35] above, the filing of the Writs only creates the statutory lien in favour of the plaintiff.  It merelycreates the security interestfor the plaintiff.  The admiralty jurisdiction of the court is not yet invoked.  In that limited sense, the action does not substantively “commence” until service of the Writs.  Therefore, the filing of the admiraltyin remwrit merely crystallises the claimant’s security interest.  Quite clearly, the company is not denied any “breathing space” by the mere filing of the admiralty writs or is in any way hindered in its efforts to devise a scheme of arrangement. 59 It is also crucial to appreciate the fact that, in a typical civil action, the claimant’s right to bring his claimalreadyexists.  For instance, in a tortious claim, the plaintiff does not need to file his writ of summons to “create” his claim; the plaintiff’s claimalreadyarose at the time of the tort, and the filing of the writ of summons is a step aimed at properly pursuing his legal rights (and the court’s jurisdiction is invoked once the writ is served on the defendant).  This is also the case for admiraltyin remactions based on maritime liens (brought under s 4(3) of the HCAJA), because a maritime lien accrues and attaches to the ship(s) from the moment the plaintiff’s cause of action arises.  Therefore, in such cases, the issuance of the writ is not meant (or required) to create or crystallise the plaintiff’s interest or right of action.  Rather, the filing of the writ of summons is the process of commencing proceedings to pursue his legal rights. 60 However, the admiraltyin remwrit may also serve a different purpose depending on the nature of the claim.  For statutory rights of actionin remunder s 4(4) of the HCAJA, the plaintiff is not simply seeking to pursue his legal rights by commencing the action with the filing of the admiraltyin remwrit.  By filing the admiraltyin remwrit, the plaintiff is also seeking tocreateits security interest in the ship,ie, a statutory lien.  Without the filing of the admiraltyin remwrit, the plaintiff’s statutory lien isnot even created. 61 In my judgment, unlike the writ of summons in the case of civil proceedings or the admiraltyin remwrit in the case of maritime liens, the plaintiff’s right to a security interest in the form of the statutory lien, granted by s 4(4) of the HCAJA, is potentially at risk of beingdestroyedby the shipowners if it is unable to even file its admiraltyin remwrit.  This is because s 4(4)(i) of the HCAJA requires that,at the time when the action is brought, the person who would be liable on the claim in an actioninpersonamis either the beneficial owner of that ship as respects all the shares in itor the charterer of that shipunder a charter by demise.  If the plaintiff is unable to file the admiraltyin remwrit to even create its statutory lien, then the shipowner can simply and effectively defeat the plaintiff’sin remclaim by terminating the bareboat charters with the charterers’ agreement and accept physical redelivery of the vessel before the writ is filed.  While s 211B of the CA is intended to protect companies from being distracted by having to defend legal proceedings while devising a scheme proposal, it is not intended to disallow a plaintiff’s statutory lien under s 4(4) of the HCAJA from even crystallising in the first place.  As already explained, the moratorium under s 211B of the CA was never intended to defeat or deny the creation of substantive legal rights. 62 That is precisely what OTPL and the Xihe Group attempted to do in this case.  As OTPL itself submits, the person who would be liableinpersonamfor PetroChina’s cargo claims in the Writs is the bareboat charterer, OTPL, not the Vessels’ owners.  Yet, on or around 18 May 2020, after OTPL had been placed under IJM (on 6 May 2020), OTPL sought to terminate the majority of its bareboat charterparties by redelivering the vessels to the respective Xihe Group shipowners, because it could no longer service the bareboat charter obligations to the ship owners.  This appeared to suit Xihe Group just fine because more and more parties were issuing writs against the vessels owned by the Xihe Group, even after HLT and OTPL had filed for judicial management.  Mr Lim Chee Meng, a director of the Xihe Group, admitted that the Xihe Group “decided to terminate 42 of their bareboatcharterpartiesto protect their vessels”.10Foot Note 10×Lim Chee Meng’s 9 July Affidavit at [140].So, from 20 May 2020 to 3 June 2020, the Xihe Group issued notices of termination in respect of the bareboat charterparties of 39 of its vessels (“Termination Notices”).  As counsel for PetroChina highlighted, this was an obvious attempt to ring fence the Xihe Group’s assets because this would prevent further admiralty writs, under s 4(4) of the HCAJA, from being issued against the vessels (since OTPL would no longer be the vessels’ bareboat charterer). 63 However, Xihe Holdings Pte Ltd was subsequently placed under IJM, and it appears that the Xihe Group could not come to an agreement with OTPL’s judicial managers on the terms of the physical redelivery of the vessels.  As a result, as aforementioned at [14] above, OTPL’s judicial managers then filed SUM 4257 to seek to disclaim its bareboat charterparties with the Xihe Group, including the ones for all four of the Vessels.  Ramesh J granted OTPL’s application to disclaim the charterparties for Ocean Winner and Chao Hu, and the application in relation to the charterparties for, amongst other vessels, Ocean Goby and Ocean Jack has not yet been fully heard.11Foot Note 11×See Angela Ee’s 3rd Affidavit at [38]–[55]; see also Lim Chee Meng’s 9 July Affidavit at [140]. 64 The foregoing is significant for two reasons.  First, the termination of the bareboat charterparties for Ocean Winner and Chao Hu (and potentially Ocean Goby and Ocean Jack) prevents further admiraltyin remwrits from being issued against these ships pursuant to s 4(4) of the HCAJA, since OTPL would no longer be the ships’ bareboat charterer.  Second, the fact that OTPL’s judicial managers are seeking to disclaim the bareboat charterparties for all four of the Vessels on the basis that they are “unprofitable contracts” clearly demonstrates that even OTPL’s own judicial managers take the view that these bareboat charterparties are not assets which OTPL requires for any potential restructuring of OTPL’s business. 65 The s 211B moratorium was never intended by Parliament to prevent a claimant’s security interest from even being created.  Viewed in this context, the mere filing of the Writs, which are meant to create the statutory liens on the Vessels, cannot be said to be the commencement of “proceedings” within the meaning of s 211B(8)(c) of the CA.  As explained above, I do not think that the issuance of the admiraltyin remwrits alone would militate against the purpose of the s 211B moratorium.  Thus, in my judgment, a narrower interpretation of “proceedings” should be preferred – the mere creation of the security interest by the issuance of the Writs does not come within the meaning of “proceedings” in s 211B(8)(c) of the CA.",
        "Proceedings “against the company”": "66 Even if the filing of the Writs is the commencement of “proceedings” within the meaning of s 211B(8)(c) of the CA, the next question is whether such “proceedings” have been commenced “against the company”, OTPL. 67 OTPL submits that, although an admiraltyin remclaim is procedurally against theres, which is the ship named in the admiralty writ, the “true defendant” is the demise charterer of the Vessels which, in this case, is OTPL.  As the demise charterer of the Vessels, it is the relevant person who would be liableinpersonamfor the cargo claims brought by PetroChina in the Writs and hence should be regarded as the person against whom the proceeding has been commenced.12Foot Note 12×Defendant’s closing submissions dated 8 October 2020 (“DCS”) at [28].For this proposition, counsel for OTPL placed reliance on three cases:The “Indian Grace” (No 2)[1998] 1 Lloyd’s Rep 1 at 7 and 10;TheKusu Island([38]supra) at [22]; andKuoFen Ching and another v Dauphin Offshore Engineering & Trading Pte Ltd[1999] 2 SLR(R) 793 (“KuoFen Ching”) at [17] and [18]. 68 I am unable to agree with this submission.  As explained at [37] above, an actionin remis an action againsttheres, not the owner or the demise charterer of the vessel.  This principle is in fact reiterated in the cases relied on by OTPL: seeTheKusu Islandat [32];KuoFen Chingat [25].  As also already explained (at [39] above), the action only transforms into a mixed actionin remandinpersonamafter the shipowner or chartererenters an appearance.  It is only after entry of appearance that any judgment sum can be enforced against the shipowner or charterer personally.  Where no appearance is entered by the shipowner or charterer, judgment when entered is enforceableonly against theres and no more:TheKusu Islandat [26];KuoFen Chingat [17]. 69 Thus, the fact that the bareboat charterer, OTPL, is the so-called “true defendant” because PetroChina’s cargo claims are, in substance, against the bareboat charterer is beside the point.  To determine if the Writs are “proceedings” against OTPL such that the s 211B moratorium applies, the question is whether OTPL would have been personally liable for thein remactions commenced by the Writs at the time when they were issued.  If no appearance had been entered, the actions would remain, at all times, actionsin remagainst theres(ie, the Vessels), and OTPL would not be personally liable at all.  That being the case, my view is that the filing of the Writs is notthe commencement of proceedings “against the company”, OTPL. 70 It is only now that OTPL has entered appearance that each of the admiralty actions is then transformed into a mixed actionin remandinpersonam, as explained at [37] above.  Given that there is a subsisting moratorium applicable in OTPL’s favour arising from the fact that it is now in judicial management, my view is that PetroChina would have to obtain leave of court if it wishes to proceed with the claim, including service of the Writs on the Vessels and arrest of the Vessels.  Such steps would amount tocommencingand thereaftercontinuingwith “proceedings”againstOTPL, now that the admiralty actions have also been imbued withinpersonamclaims against OTPL. 71 In sum, for the purposes of s 211B(8), I find that the filing of the Writs is not the commencement of “proceedings” since it merely creates the security interest (vizthe statutory lien), and it is not “against the company”, OTPL, since it is an action against theres.  As such, for the reasons set out above, I find that s 211B(8)(c) of the CA does not apply to bar the filing of the Writs without prior leave of court.",
        "Does s 211B(8)(d) of theCompanies Act apply?": "72 I now turn to s 211B(8)(d) of the CA (now s 64(8)(d) of IRDA), which provides: Power of Court to restrain proceedings, etc., against company … (8) Subject to subsection (9), during the automatic moratorium period for an application under subsection (1) by a company — … (d) noexecution, distress or other legal processmay be commenced, continued or levied against anypropertyof the company, except with the leave of the Court and subject to such terms as the Court imposes; [emphasis added]",
        "“Execution, distress or other legal process”": "73 In my analysis of s 211B(8)(d) of the CA, the first question is whether the filing of the Writs is an “execution, distress or other legal process”.  It is clear that the mere filing of an admiraltyin remwrit is not “execution”, because writs of execution are writs toenforcea judgment or order of court, and they include writs of seizure and sale, writs of possession, and writs of delivery: see s 13 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed); O 46 r 1 of the ROC.  It is also clear that the mere filing of an admiraltyin remwrit is not “distress”, which is the process of distraining movable property to realise an amount of unpaid rent: see s 7 of the Distress Act (Cap 84, 2013 Rev Ed). 74 The next question is whether the filing of an admiraltyin remwrit comes within the meaning of “other legal process”.  This involves the proper interpretation of the phrase “other legal process”. 75 The steps for statutory interpretation and the purpose of s 211B of the CA have been outlined at [42] to [49] above.  I have also highlighted the differences between the scheme of arrangement and the liquidation and judicial management contexts at [50] to [56] above.  The phrase “other legal process” could meananylegal process or only enforcement processes similar in nature to “execution” and “distress” proceedings.  An interpretation that furthers the purpose of s 211B of the CA must be given to the phrase “other legal process”. 76 In my judgment, I am satisfied that the narrower interpretation furthers the specific purpose of s 211B of the CA.  As highlighted above, the s 211B moratorium is simply intended to provide “breathing space” for the company to develop its scheme proposal so that it can increase its chances of securing votes for approval of the scheme.  In this context, I am of the view that “other legal process” under s 211B(8)(d) of the CA must mean enforcement processes similar in nature to “execution” and “distress” proceedings.  In other words, it must refer to processes to seize the money or property of the company.  Parliamentary intention must have been that the company’s officers should not be spending time trying to fend off attempts to seize the assets or property of the company, instead of focussing their efforts on coming up with an acceptable scheme of arrangement. 77   The filing of the admiraltyin remwrit merely creates the statutory lien and, thus, the security interest in the ship.  There is no element of enforcement by such a step.  Without filing the Writs, PetroChina’sin remclaim does not even arise, and may potentially be permanently prevented from arising if the shipowner terminates the bareboat charter and has the vessel redelivered before anyin remwrit is filed.  In my judgment, therefore, the filing of the Writs does not come within the meaning of “other legal process” in s 211B(8)(d) of the CA. 78 Furthermore, as aforementioned at [56] above, in the context of a scheme of arrangement, the main effect of allowing the admiralty writs to stand is that the claimant becomes a secured creditor.  All this does is that it results in a different classification of the creditor for the purposes of the eventual voting on the proposed scheme.  This does not stymie the purpose of s 211B to provide “breathing space” for the company to devise or refine its scheme proposal. 79 This interpretation is also in line with the application of theejusdem generisprinciple.  Theejusdem generisprinciple is a principle of statutory construction “whereby wide words associated in the text with more limited words are taken to be restricted by implication to matters of the same limited character”.  The crucial part of the analysis in determining whether, and if so how, theejusdem generisprinciple may be applied is the identification of the “genus” or common thread that runs through all the items in the list that includes the disputed term:Public Prosecutor v LamLeng Hung and others[2018] 1 SLR 659 at [105]–[121]. 80 In this case, the common thread between “execution” and “distress” proceedings is that they are both different types of enforcement proceedings.  Thus, as highlighted extra-judicially by Belinda Ang Saw Ean J (as she then was) in “Waking Up from the Shipowners’ Nightmare!”, her speech at the Maritime Law Conference 2017 (12 October 2017) at para 41, “other legal processes” should be read in line with “execution” and “distress” to mean other legal enforcement proceedings, such as garnishee proceedings.  Thus, in my judgment, the filing of the Writs, which only creates the statutory liens over the Vessels, does not fall within “other legal processes”.",
        "“Property”": "81 The next question is whether the Vessels can be said to be OTPL’s “property”.  As highlighted at [5] above, OTPL is not the owner of the Vessels.  OTPL is the demise charterer of the Vessels.  Thus, the question is whether a demise (or bareboat) charter interest comes within the meaning of “property” under s 211B(8)(d) of the CA. 82 “Property” is not defined in Part VII of the CA, which provides the framework for schemes of arrangement.  OTPL submits that the definition of “property” in s 227AA of the CA (now s 88(1) of the IRDA), which applies to judicial management, should be adopted.  Section 227AA of the CA provides: Interpretation of this Part 227AA.In this Part— … ‘property’, in relation to a company, includes money, goods, things in action andevery description of property, whether real or personal and whether in Singapore or elsewhere,and also obligations and every description of interestwhether present or future or vested or contingent arising out of, or incidental to, property … [emphasis added] 83 OTPL submits that the definition of “property” in s 227AA of the CA is “instructive” for the purposes of interpreting s 211B(8)(d) “as it arises under the judicial management regime which similarly provides for a statutory automatic moratorium”, and the relevant statutory provisions for the moratorium under the judicial management regime – ss 227C(c) and 227D(4)(d) of the CA – areinpari materiawith s 211B(8)(d) of the CA.  OTPL also highlights that the Report of the Insolvency Law Committee (2013) recommended at p 142, para 21 that “the scope of the statutory moratorium [for schemes of arrangement] should be no narrower than that in judicial management”.13Foot Note 13×DCS at [29]. 84 On the other hand, PetroChina submits that Parliament has specifically declined to import the definition of “property” in s 227AA of the CA to the s 211B regime.  Thus, the definition of “property” in s 227AA of the CA does not apply.  In the alternative, PetroChina also submits that the alleged bareboat charters are, in any event, not “property” because clause 16 of the bareboat charter document provides that the charterers shall have a lien on the Vessel for all moneys paid in advance and not earned, and it would be odd for there to be a contractual provision giving the charterers a right of lien over their own property.14Foot Note 14×Plaintiff’s closing submissions dated 8 October 2020 at [40]. 85 The first question arising from the parties’ submissions is whether s 227AA of the CA applies to s 211B of the CA.  I agree with PetroChina that the definition of “property” in s 227AA does not apply to s 211B.  The text of s 227AAclearlystates that s 227AA only applies to “this Part”,i.e.,Part VIIIA of the CA, which are ss 227AA–227X, the provisions governing judicial management.  I would be ignoring the clear text of s 227AA if I were to apply the definition of “property” in s 227AA also to s 211B. 86 The next question is whether a bareboat charter interest may, in principle, come within the meaning of “property” under s 211B of the CA.  A bareboat charter “essentially operates as a lease of the vessel to the charterer” by transferring possession and control of the vessel from the owner to the charterer, but a “bareboat charter does not transfer legal or beneficial title in the vessel to the charterer”:The “Chem Orchid”[2015] 2 SLR 1020 at [66].  Thus, while the bareboat charterer does not have legal or beneficial title to the vessel, I think that the bareboat charterer has an interest in the vessel akin to a leasehold interest.  It is this interest which gives the bareboat charterer the right to possess and control the vessel, similar to how a tenant has the right to exclusive possession of lease premises. 87 This leads to the next question of how “property” should be interpreted.  “Property” could mean only assets over which the company has legal and/or beneficial title or also assets in which the company has some property interest, including a leasehold interest or a bareboat charter interest. 88 PetroChina’s submission (at [84] above) is unhelpful because it proceeds on the assumption that “property” under s 211B(8)(d) of the CAcanonly take on the narrower interpretation,i.e.,only assets over which the company has title.  The very question facing this court is whether “property” under s 211B(8)(d) of the CA includes a bareboat charterer’s interest in a ship.  In this regard, I can shortly dispose of PetroChina’s argument that it is odd that a bareboat charterer would be contractually entitled to a lien over the vessel for moneys it has paid, if it already has a property interest in the vessel.  There is nothing odd at all for there to be such a clause because the bareboat charterer may be faced with a demand for the return of the vessel, even though he has already paid his charter hire in advance.  In such circumstances, it is entirely sensible that he should have a lien over the vessel because he has at the very least a restitutionary claim for the return of the unutilised portion of his charter hire. 89 As OTPL points out, it is clear that s 211B(8) of the CA was enacted to expand the scope of the moratoria for companies planning to propose schemes of arrangement to align it with the moratoria for judicial management.  Prior to the enactment of s 211B, the moratorium for companies which have proposed schemes of arrangement was provided under s 210(10) as follows: Power of Court to restrain proceedings (10) Where no order has been made or resolution passed for the winding up of a company and any such compromise or arrangement has been proposed between the company and its creditors or any class of such creditors, the Court may, in addition to any of its powers, on the application in a summary way of the company or of any member, creditor or holder of units of shares of the companyrestrain further proceedings in any action or proceeding against the companyexcept by leave of the Court and subject to such terms as the Court imposes. [emphasis added] 90 Thus, theonlyprotection for companies afforded by the s 210(10) moratorium was against “any action or proceeding against the company” (which isinpari materiato s 211B(8)(c) of the CA).  The Report of the Insolvency Law Committee (2013) highlighted the limited scope of s 210(10) at p 136, para 7 as an issue for reform: … [T]he protection afforded by the statutory moratorium provided at section 210(10) of the Companies Act isrelatively weakcompared with the moratoriums found in the liquidation or judicial management regimes. The statutory moratorium under section 210(10) only restrains ‘further proceedings in any action or proceeding against the company’ anddoes not appear to extend to enforcement of security or quasi-security interests(as is the case under the judicial management regime) or a blanket prohibition against actions taken by creditors (although this is unclear from the face of section 210(10) of the Companies Act).It also does not apply to landlordsseeking to exercise their right of re-entry to registered leasehold property. [original emphasis in italics; emphasis added in bold italics] 91 Thus, the Insolvency Law Committee recommended, as highlighted by OTPL, that the scope of the statutory moratorium for companies which are planning to propose schemes of arrangement should be no narrower than that for judicial management (see [83] above).  Therefore, s 211B expanded the scope of the moratorium for such companies, and now s 211B(8)(d) prevents the commencement of any execution, distress or other legal process against the company’s property without leave of court, and s 211B(8)(e) prevents the taking of any steps to enforce security over any of the company’s property without leave of court. 92 As such, in view of the specific purpose of s 211B, which was enacted toexpandthe scope of the moratorium under s 210(10), I am of the view that ss 211B(8)(d)–211B(8)(e) were meant to cover the types of property interest which were not previously covered under s 210(10), as identified by the Insolvency Law Committee at [90] above.  Since a leasehold interest is intended to be covered under the expanded scope of s 211B, I do not see why a bareboat charterer’s interest in a vessel should not similarly be covered.  Thus, I am of the view that OTPL’s bareboat charter interest in the Vessels does come within the meaning of “property” under s 211B(8)(d) of the CA. 93 Nevertheless, since the filing of the Writs is not an “execution, distress, or other legal process” within the meaning of s 211B(8)(d) of the CA for the reasons given (at [73] to [80] above), I find that s 211B(8)(d) of the CA is not satisfied in this case.",
        "Conclusion": "94 For the reasons set out in this judgment, I am of the view that the filing of the Writs does not come within the meaning of ss 211B(8)(c) and 211B(8)(d) of the CA.  As such, no leave of court was required to file the Writs.  Consequently, there is no basis to set aside or strike out the Writs.  This is sufficient for me to dismiss the Summonses, and the remaining three issues highlighted at [21] and [22] above do not arise for my determination.  As such, I express no views on whether the s 211B moratorium in this case was voidabinitio; whether there is a triable issue as to whether OTPL was the genuine bareboat charterer of the Vessels at the material time; and whether retrospective leave ought to be granted (see [19] above). 95 For completeness, while OTPL did not rely on s 211B(8)(e) of the CA (now s 64(8)(e) of IRDA), I agree with PetroChina’s submissions that the filing of the Writs also did not come within s 211B(8)(e) of the CA.  Section 211B(8)(e) of the CA provides that: [N]o step may be taken to enforce any security over any property of the company, or to repossess any goods under any chattels leasing agreement, hire‑purchase agreement or retention of title agreement, except with the leave of the Court and subject to such terms as the Court imposes … The mere filing of the admiralty Writs creates the security interest in the form of statutory liens over the Vessels.  It is thus not a step taken toenforcethat security.  That security interest would not even exist without the filing of the Writs. 96 As such, I dismiss the Summonses.  I will hear the parties separately on the issue of costs of the applications. Ang Cheng HockJudge of the High Court Tan Poh Ling Wendy, Tang Yuan Jonathan, Kelley Wong Kar Ee (Morgan Lewis Stamford LLC) for the plaintiff; Lee Eng Beng SC, Ng Hui Ping Sheila, Ting Yong Hong, Ho Qi Rui Daniel (Rajah & Tann Singapore LLP) for the defendant."
    }
}