{
    "case_title": "Re Sifan Triyono",
    "ncitation": "[2021] SGHC 55",
    "coram": "Kwek Mean Luck JC",
    "sections": {
        "Introduction": "1 This, Registrar’s Appeal No 13 of 2021, is an appeal against the decision of the Assistant Registrar (“AR”) on 6 January 2021 dismissing his application in Originating Summons (Bankruptcy) No 69 of 2020 for an interim order under Part 14 of the Insolvency, Restructuring and Dissolution Act (Act 40 of 2018) (“IRDA”). The issue in this appeal is whether the appellant’s draft proposal for a voluntary arrangement (“the Proposal”) satisfies the requirement of being “serious and viable”, such that it would be appropriate for the court to make an interim order under s 279(2) IRDA. At the end of the hearing, I dismissed the appeal and gave my brief reasons. I now set out my reasons in full.",
        "Facts": "2 The appellant is an Indonesian businessman and a Singapore Permanent Resident.1Foot Note 1×1st Affidavit of Sifan Triyono dated 26 October 2020 (“Triyono’s 1st Affidavit”) at [16].He claims to be an indirect shareholder holding a majority stake in an Indonesian company, PT Kapuas Tunggal Persada (“KTP”), which he incorporated in 2004. The appellant claims to hold shares in multiple holding companies that hold shares in KTP, namely PT Mutiara Bara Energy, Clearline Holding Ltd (BVI), PT Bumi Rakasa Abadi and PT Kartika Jaya Lestari.2Foot Note 2×Triyono’s 1st Affidavit, Page 201 read with 3rd Affidavit of Sifan Triyono dated 5 February 2021 (“3rd Affidavit”) at Page 38.KTP holds a coal mining concession, and works with sub-contractors in relation to the operation of the mine as a part of its business.3Foot Note 3×Triyono’s 1st Affidavit at [18]. 3 While the appellant claims to have no knowledge of any bankruptcy proceedings against him, he claims that one Flame S.A. (“Flame”) will pursue execution proceedings and bankruptcy proceedings against him, in the event that a judgment is granted in Flame’s favour in a separate suit.4Foot Note 4×Triyono’s 1st Affidavit at [27].Flame had commenced a suit on 2 October 2020 against the appellant in the High Court for default of payment of a sum of US$900,735.47, which was due to be paid pursuant to a settlement agreement between the appellant, the appellant’s wife, and Flame.5Foot Note 5×Triyono’s 1st Affidavit at [9]-[11]. 4 The appellant filed an application on 27 October 2020 for an interim order under Part 14 of IRDA to allow for consideration of the Proposal. Out of the ten creditors the appellant claims to have, two are banks holding security over his property, and five are related and unsecured creditors (the “Related and Unsecured Creditors”): four of which are the appellant’s relatives, while one is a company owned by the appellant’s relatives. The remaining three creditors, Flame, PT Harma Presis Meka Indonesia (“PT Harma”) and Suhaili are unsecured and unrelated. Under the Proposal:6Foot Note 6×Triyono’s 1st Affidavit, Page 213 at [38]. (a) The Related and Unsecured Creditors will be excluded from the Proposal. (b) The three unsecured and unrelated creditors are required to take a 60% discount of their present debt. The balance 40% (“Compromised Total Debt”) is to be paid in monthly instalments progressively over a period of five years between 2022 to 2026. (c) payment for the Compromised Total Debt of approximately SGD $2,740,789.017Foot Note 7×Triyono’s 1st Affidavit, Page 203 at [16].is to come from KTP’s repayment of its USD $1,077,322 debt (approximately SGD $1,441,529.88) owed to the appellant.8Foot Note 8×Triyono’s 1st Affidavit, Page 194 at [12]; Triyono’s 1st Affidavit, Page 207 at [28]. (d) KTP will fund a total of USD $2,536,080 from its forecasted revenue from 2022 to 2026.9Foot Note 9×Triyono’s 1st Affidavit, Page 212 at [36]. 5 Flame attended the hearing before the AR and objected to the application for an interim order.",
        "Decision below": "6 The AR found that there were serious doubts about the viability of the Proposal and dismissed the application for the interim order. The main reasons were:10Foot Note 10×Notes of Evidence (“NE”) dated 6 January 2021, Pages 42-46. (a) First, it is unclear what is the legal basis of KTP’s payment to the appellant’s creditors and how creditors will enforce any failure to pay on the part of KTP. While the appellant is said to be the controlling mind of KTP, KTP remains a separate legal entity. The appellant relied on a letter dated 16 December 2020 from KTP. That letter refers to the appellant’s first affidavit filed on 26 October 2020, which says that the funds for the repayment of the Compromised Total Debt under the Proposal will “come from the repayments from KTP in respect of debts owed to” the appellant. This was different from what was submitted by the appellant to the AR at the hearing, where it was said that the intention is for KTP to make payment under the Proposal beyond the SGD $1 million that KTP owed to the appellant. The total amount to be paid out under the Proposal, is approximately SGD $2.7 million. The AR observed that there was however no evidence of an agreement on the part of KTP to make payment beyond the SGD $1 million that KTP owed to the appellant. Neither was there anything to suggest that KTP would be amenable to be legally bound to make payment for the total debts under the Proposal. Even if KTP were bound, enforcement against KTP was uncertain given that KTP is an Indonesian company. (b) Second, there are problems with KTP’s ability to pay. It was undisputed that KTP is presently in the red. (i) The amount that KTP would have available to make payment under the Proposal would depend on its projected revenue as well as costs. The appellant provided projected revenue and cash flow, but information on operating costs and expenses was lacking, even though the actual revenue available for payment would depend on the costs incurred. (ii)  In the Proposal, the appellant set out certain projected revenue streams for KTP, to explain how the proposed repayments will be funded. These projected revenue streams are based on 3 contracts which the appellant says KTP has entered into with various parties. (A) But out of these 3 contracts, one of the contracts, with PT Kapuas Bara Utama (“KBU”), is entirely oral in nature. There is no evidence about the terms of the contract, including the rate at which KBU is charged for using KTP’s haulage road. There is no evidence of the amount that KBU is paying KTP at present, even though the appellant informed the AR that KBU is presently using and paying for the usage of the haulage road. (B) For the contract with PT Batubara Kalteng Jaya (“BKJ”), the contract has not yet commenced. There is also no evidence on how the contract terms translate into the figures that the appellant has set out in the Proposal as the projected revenue stream. (C) For the contract with PT Pamapersada Nusantara (“PT PN”), the contract exhibited is dated 4 August 2017 and said to last for a term of 5 years, which means that it will end in 2022. There was no evidence as to any agreement by the parties to extend the contract beyond 2022, which is the period in which the creditors are supposed to be repaid under the appellant’s Proposal. (iii) At the hearing, the AR asked the appellant if he would like an opportunity to put in further information to address these concerns. The hearing was stood down for the appellant to consider, after which the appellant informed the AR that he would decline the opportunity and stand by the Proposal as put forth.11Foot Note 11×NE dated 6 January 2021, Page 4 at lns 25-28.",
        "Application to adduce further evidence": "7 On 5 February 2021, shortly before the hearing for this appeal, the appellant filed the third affidavit from the appellant (the “third affidavit”) in support of SUM 600 of 2021, an application to adduce further evidence. The third affidavit sought to adduce the following evidence.12Foot Note 12×3rd Affidavit of Sifan Triyono dated 5 February 2021 (“3rd Affidavit”). (a) First, an unsigned affidavit from Mr Harwo, the President Director of KTP (“KTP’s affidavit”) containing the following: (i) KTP’s confirmation that it would make available funds to repay the appellant’s creditors under the Proposal, that such repayments would not be solely from the debt that KTP owed to the appellant of US$1,077,322, and that KTP would agree to be contractually bound under the Proposal if necessary;13Foot Note 13×3rd Affidavit at [5]. (ii) a copy of KTP’s full audited financial statements (“audited FS”) for the years 2018 and 2019; and (iii)  projections of KTP’s financial statements for the years 2022 to 2026 (“Projections”) prepared by an Indonesian accounts and auditing advisor. (b) Second, relevant emails between the appellant and DBS Bank Limited (“DBS”) to show that the appellant was unable to obtain a second mortgage on the Ardmore Park Property or obtain re-financing. 8 Although these documents were clearly directed at addressing the concerns raised by the AR at the hearing below, the appellant asked for SUM 600 of 2021 to be heard only after RA 13 of 2021 was heard. The initial reason given by the appellant was that they wanted to be fair to Flame and to give counsels for Flame time to review, given the lateness of the application, which had been filed on the Friday afternoon before the hearing on the following Monday morning. Flame, however, indicated that they were prepared to proceed with hearing SUM 600 of 2021 at the start of the appeal. The appellant subsequently acknowledged that the appellant’s intention was for SUM 600 of 2021 to be kept alive, so that depending on how the appeal goes, the appellant can apply for leave to adduce further evidence, which will assist the appellant’s case in this appeal. The appellant took the position that the Proposal was serious and viable as it stood, without the further evidence in SUM 600 of 2021. The application to adduce further evidence, according to the appellant, was to show thebonafidesof the appellant. The appellant asked that RA 13 of 2021 proceed first without determining SUM 600 of 2021. 9 The evidence in SUM 600 of 2021 appeared, at least from the face of the application, to be directly related to RA 13 of 2021, since it sought to plug the gaps that the AR below had highlighted. The appellant had also written in earlier to inform the Court that the subject matter of SUM 600 of 2021 relates to RA 13 of 2021 and asked that it be placed before this Court on the day of the appeal.14Foot Note 14×Letter to the Registrar by Solicitors for the Applicant dated 5 February 2021. 10 I therefore asked parties to address me on SUM 600 of 2021 first, after which I heard submissions on RA 13 of 2021. In view of the appellant’s request that SUM 600 of 2021 be kept alive until after the appeal was heard, I did not rule on SUM 600 of 2021 after hearing parties on it, but proceeded to hear the parties on RA 13 of 2021. In the course of submissions on RA 13 of 2021, I considered the potential impact if any, that the evidence in the third affidavit would have in addressing any gaps, if the third affidavit were admitted. 11 At the end of the hearing for the appeal, I dismissed the application in SUM 600 of 2021 to adduce further evidence through the third affidavit. The Court of Appeal has observed inJTrustAsia Pte Ltd v Group Lease Holdings Pte Ltd and others[2018] 2 SLR 159 at [56], that the conditions to admit fresh evidence on appeal stated inLadd v Marshall[1954] 1 WLR 1489 remain a useful analytical tool for assessing the justice of allowing fresh evidence in an interlocutory appeal. In the context of adducing fresh evidence in a registrar’s appeal to a judge in chambers, the Court stated that “the judge [is]entitled, though notobliged, to employ the conditions ofLadd v Marshallto help her decide whether or not to exercise her discretion to admit or reject the further evidence” [emphasis in original]. I applied the conditions ofLadd v Marshallas an analytical tool here. 12 Notably, at the hearing below before the AR, the AR had offered the appellant the opportunity to put in further information. The hearing was stood down for the counsel for the appellant to take instructions on this.15Foot Note 15×NE dated 6 January 2021, Pages 40-41.Counsel for the appellant returned and informed the AR that the appellant’s position was that “the Proposal as put forward is serious and viable”. In other words, the appellant had been offered an earlier opportunity by the court to put in further evidence and the appellant declined that opportunity. 13 At the appeal, the appellant submitted that this should not be treated as having declined the opportunity to put in evidence, but that the offer by the AR was wrong. It was submitted that the appellant should not have been put to a choice between leaving the evidence as it stood or taking up the AR’s offer for leave to put in further evidence. Instead, the AR should have found that further evidence was required and asked the appellant to put in further evidence. 14 In my judgment, the AR was not wrong in offering to allow the appellant a choice to adduce further evidence. The AR was not in the position to know if the appellant had further evidence or would be willing to put in further evidence, and hence was not wrong, in offering the appellant an opportunity to put in more evidence, instead of asking that further evidence be filed by the appellant. 15 I proceed to consider the conditions underLadd v Marshall. In respect of the first condition ofLadd v Marshall, namely whether evidence could be obtained with reasonable diligence, the appellant acknowledged that there are weaknesses for the audited FS of KTP since that could be filed earlier. However, I found that all the documents in KTP’s affidavit, including the assurance of KTP and the Projections, have difficulty meeting the first condition. The appellant could have taken up the opportunity given by the AR for the appellant to put in further evidence. Instead, after the hearing stood down, the appellant informed the Court that he was not going to put in further evidence and that the proposal as it stood was serious and viable. Clearly, the evidence contained in KTP’s affidavit could have been obtained with reasonable diligence. The only reason why the evidence was not obtained earlier was that the appellant chose not to. 16 The appellant compounded this by choosing not to have SUM 600 of 2021 heard before this appeal, but after. Again, the evidence may not have been before this court, simply because the appellant, having obtained the evidence chose not to do so. The operative word here is “may”, as I make this only as an observation. In considering the merits of RA 13 of 2021, I nevertheless considered if the evidence in SUM 600 of 2021 would have made a difference to the Proposal. 17 Neither did I eventually take the appellant’s decision to have SUM 600 of 2021 heard after RA 13 of 2021 into account, in assessing whether SUM 600 of 2021 meets the first condition ofLadd v Marshall. In my judgment, the appellant’s declining the opportunity offered by the AR to put in earlier evidence, is sufficiently weighty in itself. As the Court of Appeal has stated inJurong Town Corp v Wishing Star[2004] 2 SLR(R) 427 at [27], the court “should guard against attempts by a disappointed party seeking to ‘retrieve lost ground in interlocutory appeals’ by relying on evidence which he could or should have put before the court below”. That speaks aptly to this situation. 18 In addition, the evidence the appellant sought to adduce through the third affidavit struggles to meet the second and third conditions inLadd v Marshall, namely, that the evidence must be such that, if given, it would probably have an important influence on the result of the case, and that it must be apparently credible though it need not be incontrovertible. 19 In respect of being apparently credible, Flame contested the credibility of the KTP assurance by Mr Harwo, noting that the affidavit was not signed, and that the usual course would be to sign such a document and state that the signing party was not able to get to a notary in time. This was not even done here. Flame submitted that the appellant had been hedging below and was hedging even now.16Foot Note 16×Minute Sheet for SUM 600/2021 dated 8 February 2021, Page 12.While I found it unusual that the affidavit by Mr Harwo was unsigned, given its relevance to addressing one of the AR’s concerns, I did not find that to be wholly determinative. 20 However, there were other fundamental difficulties. (a) First, when asked at this appeal how the assurance by Mr Harwo would address the problem of enforcement, the appellant stated that the reality is that the assurance of Mr Harwo in KTP’s affidavit “does not help very much” in addressing the problem of enforcement against an Indonesian third party that does not pay and that the proposal would fail immediately if KTP does not pay. The assurance was more an expression ofbona fideson the part of the appellant. (b) Second, the Projections, as pointed out by Flame, are based on the audited FS, which shows different figures from the KTP financial statements submitted in the hearing below. For example, while there were figures for net sales in the earlier KTP financial statements, net sales in the audited FS for both 2018 and 2019 are reflected as nil.17Foot Note 17×3rd Affidavit, Page 19.In addition, the audited FS now reflects Flame as a creditor, in amounts which Flame said they were not previously aware of, when the earlier financial statement did not show that Flame was a creditor at all.18Foot Note 18×3rd Affidavit, Page 40 at [16].Given such inconsistencies, it is not clear to what extent both sets of financial statements are the same, and where there are changes, whether the numbers in the audited FS are credible. (c) Third, the Projections still reflect a very negative financial situation for KTP. For example, the total current liability for KTP in 2022 is still about US$67 million.19Foot Note 19×3rd Affidavit, Page 73This is a significant amount of negative equity, far outstripping the amounts that the appellant claimed KTP would be able to pay creditors. (d) Fourth, neither do the Projections address the earlier concern with the three contracts underpinning the repayment schedule from KTP, which is that two of the contracts are oral agreements with unspecified terms and one contract ends in 2022 when repayment is scheduled to start in 2022. (e) Fifth, the reliability of the Projections is compounded by the lack of visibility as to its working assumptions. The report containing the Projections prepared by the appellant’s auditor states that the information contained therein is based primarily on,inter alia, assumptions from the management of KTP.20Foot Note 20×3rd Affidavit, Page 55.The appellant informed the court that the Projections are based on how KTP addressed them to the auditor and that assumptions were made, but such assumptions were not available to Flame or this court. 21  Thus, even if KTP’s affidavit was admitted, it would not have made a difference in strengthening the Proposal. It would be far from probably having an important influence on the result of the case, which is the second condition ofLadd v Marshall. Given the disparity between the audited FS and the KTP financial statement submitted in the court below, as well as the lack of transparency on the assumptions underlying the Projections, it also does not meet the condition of being apparently credible. For these reasons, after hearing this application along with the appeal, I dismissed SUM 600 of 2021.",
        "Issues to be determined at the appeal": "22 The appeal itself, RA 13 of 2021, proceeded on three planks of arguments by the appellant: (a) First, the AR did not consider the Proposal holistically, including the following:21Foot Note 21×Applicant-Appellant’s Skeletal Submissions (“Appellant’s Skeletal Submissions”), Page 15. (i) KTP’s confirmation that the matters of the Proposal were true and accurate,ie, confirmation that KTP will make the proposed repayments under the Proposal. (ii) The appellant’s suggestion that KTP will agree to be bound to the appellant’s creditors (through an amended Proposal) would give the creditors recourse against KTP. (b) Second, the AR misunderstood the voluntary arrangement process:22Foot Note 22×Appellant’s Skeletal Submissions, Page 16. (i) The appellant would not gain an unfair advantage if the Proposal fails, as the creditors will revert to their original position as against the appellant. (ii) There was hence no need to consider the contractual obligations and liabilities of KTPvis-à-visthe creditors, nor was there a need to consider the creditor’s ease of enforcement against KTP. (c) Third, the AR inappropriately scrutinised the Proposal:23Foot Note 23×Appellant’s Skeletal Submissions, Page 17. (i) A proposal is by definition nascent and necessarily incomplete. Any issues should be ironed out through the voluntary arrangement process. (ii) A broad assessment should have been applied. It was inappropriate for the AR to have conducted close scrutiny of the excerpts of KTP’s financial statements and concluded that the forecasted revenues of KTP were unrealistic. The proper party to scrutinise the details of a proposed voluntary arrangement is the nominee, who is to conduct a study of the proposed voluntary arrangement at a later juncture.",
        "The relevant law": "23 Before I address these issues, it would be useful to set out the relevant law. 24 The voluntary arrangement scheme under Part 14 of the IRDA was introduced by way of the Bankruptcy Act in 1995, which was modified from the United Kingdom’s Insolvency Act 1986 (c 45) (“the UK Insolvency Act”). The objective was to encourage debtors to settle their debts early so as to avoid bankruptcy: see Singapore Parliamentary Debates, Official Report (25 August 1994), vol 63 at cols 401—402. As the court has aptly observed inReAathar Ah Kong Andrew[2018] SGHC 124at [53] (affirmed on appeal), a voluntary arrangement enables a debtor to stave off multiple lawsuits by offering creditors the assurance of an earlier satisfaction. A good voluntary arrangement benefits all involved, obviating the longer process and higher costs of bankruptcy administration. 25 Under s 276(1) IRDA, any insolvent debtor who intends to make a proposal to the debtor’s creditors for a voluntary arrangement may apply to the Court for an interim order. Section 279 IRDA sets out the conditions for an interim order and states: 279.—(1) The Court must not make an interim order on an application under section 276 unless it is satisfied that — (a) the debtor intends to make a proposal for a voluntary arrangement; (b) no previous application for an interim order has been made by or in respect of the debtor during the period of 12 months immediately before the date of the application; and (c) the nominee appointed by the debtor’s proposal is qualified and willing to act in relation to the proposal. (2) The Court may make an interim order if it thinks that it would be appropriate to do so for the purpose of facilitating the consideration and implementation of the debtor’s proposal. 26 Under s 279(1) IRDA, the court must not make an interim order, unless it is satisfied that the gateway conditions therein are met. 27 Once the gateway conditions are satisfied, the court may make an interim order under s 279(2) IRDA, if it thinks that it would be “appropriate to do so for purpose of facilitating the consideration and implementation of the debtor’s proposal”. 28 Section 279 IRDA is drawn from s 255 of UK Insolvency Act and is materially the same. Section 255(1) and (2) of the UK Insolvency Act states: 255(1): The court shall not make an interim order on an application under section 253 unless it is satisfied: - (a) that the debtor intends to make a proposal under this Part; (b) that on the day of the making of the application the debtor was an undischarged bankrupt or was able to make a bankruptcy application; (c) that no previous application has been made by the debtor for an interim order in the period 12 months ending with that day; and (d) that the nominee under the debtor’s proposal is willing to act in relation to the proposal. (2) The court may make an order if it thinks that it would be appropriate to do so for the purpose of facilitating the consideration and implementation of the proposal. 29 Cases from the United Kingdom have provided useful guidance on what would be “appropriate” when considering the making of an interim order. In particular, it has been held that in determining “appropriateness”, the court will consider whether the debtor’s proposal for voluntary arrangement is “serious and viable”: seeCooper vFearnley, re a debtor (No 103 of 1994)[1997] BPIR 20 (“Cooper vFearnley”) at 21. InHook v JewsonLtd[1997] B.C.C. 752 (“Hook v Jewson”), which followedCooper vFearnley, it was held that: … If, in a particular case, the judge before whom the application for an interim order concludes that the proposal is not one which can be described as serious and viable, it would be expected that as a matter of discretion, the judge would refuse to make an interim order. Judges must, I think, be careful not to allow applications for interim orders simply to become a means of postponing the making of bankruptcy orders, in circumstances where there is no apparent likelihood of benefit to the creditors from such a postponement. 30 InHook v Jewson, the Vice-Chancellor (“V-C”) upheld the district judge’s refusal to make an interim order to enable a proposal to be put to a meeting under s 257 of the UK Insolvency Act 1986. In particular, the V-C rejected the counsel’s argument that the court’s discretion to refuse an interim order under s 255 of the UK Insolvency Act is limited. The V-C noted that Section 255 of the UK Insolvency Act prevents the court from making an order unless prescribed conditions are satisfied, but there is no indication of any limitation on the court's discretion to refuse. On the facts, the V-C noted various deficiencies with the proposal. To start with, it failed to comply with the requirements under r 5.3 of the Insolvency Rules 1986 (UK) (SI 1986/1925) (which is inpari materiawith r 5(2)(a) of the Insolvency, Restructuring and Dissolution (Voluntary Arrangements) Regulations 2020), as there was no information about the applicant’s assets and which particular assets are to be excluded from the voluntary arrangement. The V-C also found other serious deficiencies with the proposal: the details of the applicant’s creditors were inaccurate; the applicant proposed to repay part of his debts from litigations he hoped to pursue, but there was no evidence on the substance of his legal claims. Hence, the V-C found the proposal to be a “hopeless one” that was not fit to be placed before creditors. 31 The UK courts have also held that in considering the making of the interim order, the court will be conscious that one of the reasons for the discretion is to filter out proposals that are not viable, so as to avoid unnecessary and wasteful convening of creditors’ meetings. The court should not expose creditors to the cost and expense of considering a proposal which has no real prospect of being productive: seeFletcher vVooght[2000] BPIR 435 andDavidson v Stanley[2005] BPIR 279. 32 Our courts in Singapore have taken the same approach as the UK courts. InReAathar Ah Kong Andrew[2019] 3 SLR 1242 (“ReAathar Ah Kong Andrew”) at [41], it was recognised that “the effect of an interim order is a serious incursion into the rights of creditors to proceed against a debtor to recover what is owed.” To avoid unnecessary delay and waste of expenses on the part of creditors, Singapore courts would consider whether the debtor’s proposal is “serious and viable” when determining if it is “appropriate” to make the interim order for the purposes of s 279(2) IRDA: seeRe Lim WeeBeng Eddie[2001] SGHC 103 which followedHook v Jewson. 33 In addition, it has been emphasised that the debtor’s plan must contain sufficient details at the outset in order for the court to assess whether the proposal is “serious and viable”. InReAndrla, Dominic and another matter[2019] SGHC 77 (“ReAndrla, Dominic”), the court stated at [25] and [27]: [25] … in order to persuade the court that the proposal is, to citeRe Lim WeeBeng Eddie, ‘serious and viable’,the  appellant must put up a plan that contains sufficient informationon how he is able to raise the funds set out in the proposal. He cannot rely on hints and innuendo … … [27] … In order to enable the court to decide whether a proposal is viable,sufficientdetails must be given at the outset in order to prevent abuse… It is incumbent on this court to ensure that applications for interim orders not be used to delay bankruptcy proceedings by requiring such applications to be accompanied by proposals that are serious and viable.If such a proposal is not provided at the outset, a court should dismiss the application… [emphasis added] 34 Following this overview of the authorities in the UK and Singapore, let me summarise the relevant principles in considering the making of an interim order under s 279(2) IRDA: (a) the effect of an interim order, which holds off all proceedings against the debtor, is a serious incursion into the rights of creditors to proceed against a debtor to recover what is owed. (b) in considering the making of an interim order, the court will be conscious that one of the reasons for the discretion is to filter out proposals which are not serious and viable, so as to avoid the unnecessary and wasteful convening of creditors’ meetings. (c) In order for the court to decide whether a proposal is serious and viable, the debtor’s plan must contain sufficient details at the outset. (d) If the judge concludes, taking into account all the evidence available, that the proposal is not one which can be described as serious and viable, such as where there is no apparent likelihood of benefit to the creditors, nor any real prospect of the proposal being productive,  it would be expected that as a matter of discretion, the judge would refuse to make an interim order. Otherwise, an interim order would simply become a means of postponing the making of bankruptcy orders.",
        "Preliminary point on whether appellant is insolvent": "35 Before I move on to address the substance of the appellant’s appeal, let me address a preliminary point that arose in the course of the appeal. 36 One of the gateway conditions under s 276(1) IRDA is that the applicant is insolvent. Flame initially contested the appellant’s assertion that he was insolvent under the balance sheet test. Flame submitted that since the appellant claimed to be able to direct two Indonesian companies that he controlled to make repayments for his debt under the Proposal, the assets or value of these two companies should be considered as part of the appellant’s assets. When the appellant stated at the hearing that these two companies did not form part of the debt servicing arrangement under the Proposal, Flame agreed not to contest the appellant’s insolvency status. It was thus agreed by the parties, that the appellant meets the gateway conditions under s 279(1) IRDA. 37 Let me now address the appellant’s three planks of appeal.",
        "Whether the AR considered the Proposal holistically": "38 The first plank of appeal is that the AR did not consider the Proposal holistically. In this regard, the appellant refers to a letter dated 16 December 2020, where KTP stated that it had been provided with a copy of the appellant’s first affidavit dated 26 October 2020 and that it had “reviewed the same and confirm that the matters therein, insofar as they relates to PT Kapus Tunggal Persada, are true and accurate”.24Foot Note 24×Second Affidavit of Sifan Triyono dated 21 December 2020 (“Triyono’s 2nd Affidavit”), Page 51.The appellant also refers to his suggestion of binding KTP to the creditors, as giving the creditors additional recourse against KTP. 39 However, these matters were explicitly considered by the AR. KTP’s letter dated 16 December 2020 was considered by the AR, who noted that this letter referred to the appellant’s first affidavit filed on 26 October 2020.25Foot Note 25×NE dated 6 January 2021, Page 43 at lines 11-14.That affidavit says that the funds for the repayment of the compromised total debt under the Proposal will “come from the repayments from KTP in respect of debts owed to” the appellant. This was different from the appellant’s submissions at the hearing before the AR, that the intention was for KTP to go beyond the SGD $1million that it owed to the appellant, to cover the debts under the proposal of approximately SGD $2.7 million. 40 The AR then went on to observe that:26Foot Note 26×NE dated 6 January 2021, Page 44. (a) there was no evidence of an agreement on the part of KTP to make payment beyond the SGD $1 million that KTP owed to the appellant. (b) Neither was there anything to suggest that KTP would be amenable to being legally bound to make payment for the total debts under the proposal. (c) Even if KTP were bound, enforcement against KTP was uncertain given that KTP is an Indonesian company. 41 The unsigned KTP’s affidavit from Mr Harwo in the third affidavit, contained statements that addressed points (a) and (b) above. However, the unsigned KTP’s affidavit did not address the critical point at (c). Even if KTP’s affidavit was admitted, the uncertainty of enforcement against an Indonesian company, which affects the viability of the Proposal, remains. When asked about this, the counsel for the appellant replied that the assurance of KTP in KTP’s affidavit does not help very much in addressing the problem of enforcement against an Indonesian company that does not pay, and that the Proposal would fail immediately if KTP does not pay. Instead, the assurance was there to show thebonafidesof the appellant. 42 Assessing the observations of the AR, I found that the AR did consider the proposal holistically. The AR was right to be concerned about the problem of enforcement against an Indonesian third party that is funding the entire repayment, as this is crucial to the viability of the Proposal.",
        "Whether the AR misunderstood the voluntary arrangement process": "43 The appellant’s second plank of appeal is that the AR misunderstood the voluntary arrangement process, as the appellant will not gain an unfair advantage if KTP fails to pay under the proposal. Instead, the creditors will revert to their original position as against the appellant. There is hence no need to consider the contractual obligations and liabilities of KTPvis-à-visthe creditors, nor a need to consider the creditors’ ease of enforcement against KTP. 44 This submission misunderstood the tension and balance underpinning the granting of an interim order. The debtor who has a serious proposal to make should be granted the opportunity to do so to satisfy his creditors and avert a bankruptcy order. But an interim order, if granted, means that creditors who are entitled to resort to a bankruptcy order to enforce their right to payment will have their claims delayed. As the court inReAathar Ah Kong Andrewstated, noted above at [32],  “the effect of an interim order is a serious incursion into the rights of creditors to proceed against a debtor to recover what is owed”, and “a tight leash is kept right from the start”. Hence, as rightly noted by the court inRe Dominic Andrlaat [27], the court has to balance the interests of both sides, by requiring a serious and viable proposal at the outset. 45 While the interim order allows for a standstill of 42 days, subject to further extensions on the application of the nominee, that is not so small an advantage that the court should, as submitted by the appellant, ignore basic considerations such as whether a foreign third party funder is able and obligated to make the repayments and the difficulties creditors may encounter in enforcing such repayments. Where a proposal lacks such basic considerations and cannot be said to be serious and viable, it is incumbent on the court to dismiss the application for interim order so that the application is not used to delay bankruptcy proceedings, thereby prejudicing the rights of creditors. 46 In my judgment, the AR had understood the nature of the interim order in the voluntary arrangement process and was right in asking about the lack of contractual obligations of KTP to the creditors and the difficulties of enforcement against an Indonesian third party.",
        "Whether the AR inappropriately scrutinised the proposal": "47  The third plank of the appeal is that the AR inappropriately scrutinised the Proposal. The appellant submits that a proposal is by definition, nascent and necessarily incomplete. The appellant relies onRe IMSkaugen SE and other matters[2019] 3 SLR 979 at [35], where the court adopted the test stated inReConchubar Aromatics Ltd and other matters[2015] SGHC 322, in the context of a moratorium application relating to a scheme of arrangement under the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”), that it is sufficient for the court to “make a broad assessment that there was a reasonable prospect of the scheme working and being acceptable to the general run of creditors.” 48 However, this test was in relation to proposing a scheme of arrangement under the Companies Act, entailing different statutory provisions and schema. While there may be similar considerations in granting a moratorium for a scheme of arrangement, which may be analogised to the considerations in granting an interim order for voluntary arrangement, no argument has been put forth by the parties in this regard. Further, even in the context of granting a moratorium under s 210(10) of the Companies Act, the court inRe Pacific Andes Resources Development Ltd[2018] 5 SLR 125 (“Re Pacific Andes”) has observed at [61] that there is nothing in the language of s 210(10) to restrict the court’s power to grant the moratorium “subject to such terms as it deems fit”. I note that this observation is similar to that made by the V-C inHook v Jewsonwith respect to the wording of s 255 of the UK Insolvency Act for the making of an interim order. The scrutiny exercised by the court in granting a moratorium enables the court to exercise a “close control over the restructuring process” to strike a balance between the competing interests of the debtor and its creditors. Even on “a broad assessment” basis, the court needs to be satisfied that “there is a plan that has a reasonable prospect of working and being acceptable to the general run of creditors” (Re Pacific Andesat [65]). Hence, even in the context of granting a moratorium for corporate restructuring, the “broad assessment” approach does not give the debtor acarte blancheto restructure its debts, with no oversight from the court at all. 49 Moreover, even on the appellant’s submitted yardstick of “a broad assessment”, it was undisputed by the parties that the court should look at the financial statements that support a proposal. It is also undisputed by parties that the relevant test of what is “appropriate” under s 279(2) IRDA is whether the proposal is serious and viable. In the face of glaring data in the financial statements, pointing to the current financial difficulties of a third party company that is supposed to make future repayments, the court should ask how valid the optimistic future revenue projections are, and whether the third party company is indeed capable of funding the repayment to make the proposal a viable one. 50 The difficulties in the appellant’s Proposal do not arise from any inappropriate scrutiny undertaken by the AR, but from questions that flow from the inconsistencies apparent in the documents produced by the appellant, questions which are relevant to whether the Proposal is viable, questions which although raised earlier, continue to be left unanswered. 51 The Proposal is for KTP to pay the creditors approximately SGD $2.7 million between 2022 to 2026. However, the financial statement for KTP, produced by the appellant, shows that:27Foot Note 27×Triyono’s 1st Affidavit, Page 429. (a) KTP was operating at a net loss in 2018 and 2019, of USD $12,209,523 and USD $ 5,799,952 respectively for these years. (b) Net sales in 2018 were USD $942,614 in 2018 and USD$ 587,452 in 2019. Cost of Sales was USD $9,906,333 in 2018 and USD $6,055,885 in 2019. Revenue from sales thus appear to be only 10% of the costs of sales, raising questions about the sustainability and profitability of KTP. (c) Finance costs amount to about USD $2.83 million each year, in 2018 and 2019, while the General and Administrative Expenses amounted to USD $629,394 in 2018 and USD $771,678 in 2019. 52 The current pessimistic financial state of KTP in 2018 and 2019 stands in stark contrast to the optimistic KTP revenue projections contained in the Proposal, where KTP is projected to earn about USD $2.4 million of revenue in 2022, increasing yearly to reach revenues of USD $4.45 million in 2026. 53 In light of such contrasting data between KTP’s financial statement for 2018—2019 and the projected revenues for 2022—2026, it is natural and indeed correct, for the AR to examine if the projected revenue streams stated in the Proposal are viable, as that fundamentally affects the viability of the entire proposal. The AR’s inquiry touched on basic points:28Foot Note 28×NE dated 6 January 2021, Pages 45—46. (a) One contract, with KBU, is entirely oral in nature. There is no evidence on the contractual rate at which KBU would be charged for using KTP’s haulage road, nor evidence of how much KBU is paying KTP now, even though the Appellant informed the AR that KBU is presently using and paying for KTP’s haulage road. (b) Another contract, with BKJ, has not yet commenced and there is also no evidence on how the contract terms translate into the project revenue figures in the Proposal. (c) The third contract, PT PN, will end in 2022. There was no evidence of any agreement by the parties to extend the contract beyond 2022, which is the period in which the creditors are supposed to be repaid under the Proposal. 54 These issues were flagged out in the hearing before the AR and by Flame. As Flame pointed out, the appellant chose not to respond to clarify any of these issues, but instead submitted that there should not be such scrutiny at the point of seeking an interim order, and that such questions should be left to the nominee to address at the next stage. But the legal requirement is for an applicant to demonstrate to the court that his proposal is serious and viable at the outset, and the points raised, undeniably affect whether the Proposal is serious and viable. 55 The questions above remain unanswered even if the third affidavit is admitted. (a) First, the reliability of the Projections in the third affidavit is uncertain, since is the Projections are based on a set of financial statements that show different figures from those submitted in the court below. (b) Second, questions about the poor financial health of KTP remain. For example, in the audited FS, the total current liability for 2022 is still about USD $67 million. This is a significant amount of negative equity, far outstripping the amounts that the appellant claims KTP would be able to pay the creditors in the future. The appellant was unable to explain why the significant negative equity of KTP would not affect repayment. (c) Third, the forecast is based on assumptions provided by KTP to the auditors, assumptions that were not made available to either Flame or this court. Conclusion 56 In conclusion, the appellant has not shown that the Proposal is serious and viable, even if the evidence in SUM 600 of 2021 is admitted. The current dismal financial state of KTP calls into question its ability to make future repayments. The lack of clarity about the contracts that underpin KTP’s ability to make future payments, and the lack of transparency about how the financial and operational costs would affect future revenue, affects the viability of the proposed repayments. The uncertainty arising from enforcement against an foreign third party raises another set of doubts, which remain unanswered. 57 For the reasons given above, I dismissed the appeal. I heard the parties on costs and awarded Flame costs of $17,000 inclusive of disbursements, for both RA 13 of 2021 and SUM 600 of 2021. Kwek Mean LuckJudicial Commissioner Kyle Gabriel Peters and Feng Zhuo (PDLegal LLC) for the Appellant; Song Swee Lian Corina Mrs Corina Song Jeremiah, Liang Junhong Daniel and Lim Wan Jen Melissa (Allen & Gledhill LLP) for Flame S.A."
    }
}