{
    "case_title": "Soh Rui Yong vLiew Wei Yen Ashley",
    "ncitation": "[2021] SGHC 96",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 The three appeals that are the subject matter of these grounds of decision relate to an ongoing trial at the State Courts, District Court Suit No 1784 of 2019. Initially fixed for hearing from 1 to 3,8 to11, and 24September 2020, the trial is at present part-heard and the cross-examination of two defence witnesses remain. 2 Registrar’s Appeal from the State Courts No 24 of 2020 (“RAS 24”) is an appeal against the District Judge’s (the “DJ”) decision on 24 September 2020 in respect of Summons No 3132 of 2020 to allow the plaintiff, Mr Liew Wei Yen Ashley (“Mr Liew”), to amend his Statement of Claim (“SOC”). Registrar’s Appeal from the State Courts No 25 of 2020 (“RAS 25”) is an appeal against the DJ’s order on 16 October 2020 in respect of Summons No 2895 of 2020 dismissing the application of the defendant, Mr Soh Rui Yong (“Mr Soh”), for the late adduction of additional expert evidence. Mr Soh thereafter filed an application in Summons No 3822 of 2020 for the DJ to recuse herself from continuing to hear District Court Suit No 1784 of 2019. The DJ dismissed the application on 14 December 2020 and Registrar’s Appeal from the State Courts No 35 of 2020 (“RAS 35”) is the appeal arising therefrom. 3 These grounds of decision furnish details of the summation I gave parties when I dealt with the Registrar’s Appeals on 19 April 2021. I explain my orders in RAS 24 and RAS 25 within the wider frame of RAS 35.",
        "Factual context": "4 These matters arise out of a defamation suit. Mr Liew and Mr Soh represented Singapore at the 2015 South East Asian games (“2015 SEA games”) marathon event (“the race”). Mr Soh won the gold medal at this event.1Foot Note 1×Soh Rui Yong’s AEIC dated 21 February 2020 in DC/DC 1784/2019 at para 3.Mr Liew subsequently won the International Fair Play Committee’sPierre de CoubertinWorld Fair Play Trophy.2Foot Note 2×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 2. 5 The relevant part of the citation for Mr Liew’s award3Foot Note 3×Ashley Liew’s AEIC in DC/DC 1784/2019 dated 26 August 2020 at p 361.recounted that during the Men’s Marathon Race at the 28th South East Asian Games in Singapore on 7 June 2015, due to bad visibility, the runners leading the race ran straight on at the 5.5km U-turn point in the darkness. Mr Liew, who was behind the leaders, took the U-turn correctly and suddenly found himself leading the field. Instead of taking advantage of his lead, which was about 50m, he decided to wait for his rivals. The citation stated that Mr Liew’s act (the “Act of Fair Play”) probably cost him a medal as he eventually finished eighth with a time of 2hr 44min 2sec while his personal best was 2hr 32min 12sec. 6 Mr Soh disputed the award’s citation on social media, stating that Mr Liew did not slow down to wait.4Foot Note 4×Soh Rui Yong’s AEIC dated 21 February 2020 in DC/DC 1784/2019 at paras 29 to 47.Mr Liew thereafter brought a suit in defamation, contending that the innuendo from this comment was that he had lied about his account of sportsmanship.5Foot Note 5×Set Down Bundle in DC/DC 1784/2019 at p 91, para 22. 7 Mr Soh’s Defence denies that his post was defamatory.6Foot Note 6×Set Down Bundle in DC/DC 1784/2019 at p 112, para 23.He also relies on the defences of justification, asserting that his statement was true; and fair comment, asserting the words were fair comment on the 2015 SEA Games Marathon and the Fair Play Award, a matter of public interest.7Foot Note 7×Grounds of Decision for DC/SUM 3822/2020 at para 4.Mr Soh sought to prove justification by contending that Mr Liew did not wait for his rivals after the U-turn.8Foot Note 8×Soh Rui Yong’s AEIC dated 21 February 2020 in DC/DC 1784/2019 at para 17.A key issue in the trial below, therefore, was whether Mr Liew slowed down after the U-turn and for how long. Mr Liew’s evidence was that after he slowed down, a Japanese runner, Mr Kuniaki Takizaki (“Mr Takizaki”) first caught up and ran past him.9Foot Note 9×Ashley Liew’s AEIC in DC/DC 1784/2019 dated 26 August 2020 at para 28.Thereafter, the leaders of the “chase pack”, which included Mr Soh, caught up.10Foot Note 10×Ashley Liew’s AEIC in DC/DC 1784/2019 dated 26 August 2020 at para 32.Mr Liew said in his affidavit of evidence in chief that approximately two and a half minutes after he left the U-turn, he returned to his usual marathon pace.11Foot Note 11×Ashley Liew’s AEIC in DC/DC 1784/2019 dated 26 August 2020 at para 33.Mr Soh, in contrast, maintained in his affidavit of evidence in chief that because Mr Liew did not slow down, he took some 7 minutes to catch up with Mr Liew.12Foot Note 12×Ashley Liew’s AEIC in DC/DC 1784/2019 dated 26 August 2020 at para 18.During Mr Liew’s cross-examination, asked about the distance from the U-turn at which he returned to his usual marathon pace, he stated that while he did not recall the exact position, it was “probably been (sic) around 700m from the U-turn point”.13Foot Note 13×Certified Transcript dated 1 September 2020 in DC/DC 1784/2019 at p 74, lines 1 to 2.This answer resulted in various applications and also formed a primary focus of the recusal application.",
        "Recusal application": "8 Mr Soh made various categories of contentions that I deal with in their broader context of judicial interference and apparent bias.",
        "Judicial interference": "9 In determining whether there has been excessive judicial interference, the ultimate question for the court is whether or not there has been the possibility of denial of justice to a particular party:BOIv BOJ[2018] 2 SLR 1156 (“BOI”) at [111]. The doctrine does not exclude against all and any interference. Rather, it aims to preventexcessivejudicial interference. As the Court of Appeal explained inMuhammad Nabil bin MohdFuad v Public Prosecutor[2020] 1 SLR 984 at [166]: Thus, for excessive judicial interference to be established, it would generally be necessary to show that the situation was “anegregiousone” [emphasis in original] (seeMohammed Aliat [175(g)]). Plainly, where a complaint of excessive judicial interference is made on appeal, the appellate court will consider whether the court below has in fact acted in a manner that has resulted inactual prejudiceto the relevant party; the relevant inquiry is not whether a fair-minded person wouldreasonablysuspectorapprehendthat the court below was biased (see BOI at [112]). Actual prejudice could, for instance, arise if a judge intervenes in the proceedings to such an extent that it prevents a party from presenting its case. [emphasis in original] 10 The question of whether interference is excessive is both a quantitative and qualitative one:BOIat [135]. Qualitative factors are concerned with the purpose of the interference, whether such interference is focused, the effect of the interference and the tone and demeanour of the judge. Quantitative factors are concerned with the frequency and length of interventions. The two main mischiefs that the doctrine aims to curtail are: first, where the judge, in interfering, has not observed her proper role; and second, where a party has been prevented from presenting his case by the interference. Both mischiefs were contended by defence counsel in this case. 11 Defence counsel’s contentions centred on three issues: The first and main issue, was about the DJ’s interruptions during his cross-examination on what he termed the “700m issue”.14Foot Note 14×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 116.Associated with this was the DJ’s questioning of Mr Liew using Google Maps to establish the distance.15Foot Note 15×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 160.Third, his interrupted cross-examination in respect of four statutory declarations that were filed with the Singapore National Olympic Council (“SNOC”).16Foot Note 16×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 187.I deal with each in turn. Whether the distance was 700m 12  Defence counsel explained at the hearing of the appeal that his object was to establish that the pace calculated from the figures that Mr Liew gave wasfasterthan Mr Liew’s average pace for the entire race, and therefore the dramatic slowdown that Mr Liew testified about did not happen. Arising from the DJ’s interruptions, he said, he was prevented from making his point and putting his case to the witness. However, from the transcript, defence counsel was able to elicit the points required from Mr Liew to make his case. He established that Mr Liew’s Act of Fair Play ended at the 700-metre mark after the U-turn, after a time of about two and a half minutes, at which point Mr Soh and the “chase pack” caught up with him.17Foot Note 17×Appellant’s Bundle of Documents dated 23 February 2021 (“ABOD”) Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 93 lines 10 to 16.He calculated the average pace from those two figures,18Foot Note 18×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020 p 107 lines 26 to 27.and elicited Mr Liew’s calculation of his own average pace for the entire marathon.19Foot Note 19×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020 p 93 at lines 23 to 28 and 30-32.He also put his specific point that Mr Liew’s estimates were not credible several times to Mr Liew on the afternoon of the first day. Mr Liew answered variously: (a) in relation to the 50m gap after the U-turn between himself and the others, “I don’t know … the exact timing … would take to close that kind of gap”;20Foot Note 20×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 106 lines 28 to 29 and p 107 lines 1-2. (b) in relation to his pace over the 700m, “I don’t have the [m]ath with me”;21Foot Note 21×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 107 line 12 (c) in relation to the specific question of running 700m in a 3 minute, 34 seconds pace, “these are just estimations”;22Foot Note 22×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 108 line 12and (d) then, to the suggestion he had not slowed down, “there was a slowing down involved”.23Foot Note 23×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 108 line 22. 13 Further, the answers from Mr Liew highlighted above, were obtained prior to the DJ’s intervention, which was near the end of the afternoon and in response to an objection raised by Mr Liew’s counsel. Defence counsel was dissatisfied that the DJ reminded him that Mr Liew’s mention of 700m was an estimate. However, at Mr Liew’s first mention of the 700m, he stated at the time that it was an estimate:24Foot Note 24×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 73 line 30 to p 74 line 5. Liew Uh, Your Honour, I don’t recall the exact positions. Again, this was 5 years ago at the heat of the moment, dark and rainy morning. Um, but, uh, it would have, uh probably been around 700 metres from the U-turn point. Again, I can’t be too -- sure. 14 Mr Liew then continued to make similar qualifications throughout the cross-examination on the first and second days. Hence the DJ explained in her judgment that when she interposed she was just reminding counsel that the figures were estimates.25Foot Note 25×Grounds of Decision for DC/SUM 3822/2020 at [47]. 15 The DJ did, at a particular point before the lunch break on the second day, make a comment that defence counsel objected to. This comment was about his questioning “ad nauseum” on the same issue.26Foot Note 26×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 50 lines 1 to 2.The discourtesy is regrettable. Nevertheless, the comment should be put in context. In the present case, defence counsel had stated on the first day of trial that he had obtained the concession he wanted.27Foot Note 27×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 114 lines 18 to 19.On the second day, defence counsel repeatedly used the figures of 700m and two and a half minutes for various other lines of questioning throughout the morning, without any clear point coming across.28Foot Note 28×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 25 line 11 to p 29 line 32; p 43 line 6 to p 48 line 29.Just before the DJ’s interruption, he was cross-examining Mr Liew on why he had not clarified with the media the various reports that they had made about him.29Foot Note 29×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 46 line 26 to p 47 line 16.Thus, when the DJ interrupted, it was in this context of a protracted line of questioning that was not directly relevant. Further, the DJ later permitted further cross-examination on the same point of the 700m distance on subsequent days.30Foot Note 30×ABOD, Volume 3, Tab E, Day 5 Trial Transcripts, 9 September 2020, p 158 line 28 to p 159 line 4; p 161 lines 21 to 23. 16 Associated with this issue was defence counsel’s criticism about the DJ’s use of Google Maps to question Mr Liew near the end of the second day of trial, 2 September 2020. Mr Liew at this point had been questioned extensively on the 700m figure by him, and Mr Liew had reiterated that it was an estimate.31Foot Note 31×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 164 lines 6 to 10.Mr Liew, in the course of his replies, also brought up two different landmarks that he recalled from the Act of Fair Play. First, he had brought up a “clearing on the right side of [the] running path” on the first day of trial.32Foot Note 32×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 93 lines 7 to 9.Second, on the second day of trial, he had brought up a “bridge which happen[ed] to be around the 300-metre mark” where another runner had overtaken him during the Act of Fair Play.33Foot Note 33×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 4 lines 3 to 5.Later on during the second day, opposing counsel had objected to defence counsel’s line of questioning for being repetitive, and defence counsel had then reiterated that the figure of 700m had only been established in cross-examination.34Foot Note 34×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 92 line 25 to p 94 line 6.The DJ then reminded defence counsel that the figure was always an estimate and then suggested the use of Google Maps to obtain “factual information as regards to distance”.35Foot Note 35×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 94 line 7 to p 95 line 2.Defence counsel agreed to the use of Google Maps, but stated he was unable to operate it,36Foot Note 36×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 97 line 15–24.and thus the DJ asked counsel for the plaintiff if he could. Counsel for the plaintiff agreed and then used Google Maps to facilitate further questioning.37Foot Note 37×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 94 line 27 to p 97, line 32. 17 Mr Soh contended that the DJ “descended into the arena.”38Foot Note 38×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 143.An examination of the transcript did not show that the DJ took on any improper role, nor was there any improper purpose actuating the DJ’s suggestion. Mr Liew had mentioned two landmarks during the repeated cross-examination on the 700m estimate, and the DJ saw this as an opportunity to use Google Maps to come to a more accurate and objective understanding. It was also important to note that in the course of this exercise, the DJ had also noted that there weretwo clearings. One was at the 500m mark, which was more favourable to Mr Liew’s case, but another was asecond possible clearingat around the 741m mark, which was more useful for Mr Soh.39Foot Note 39×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 150 line 7–15.She sought to clarify the possibilities with Mr Liew. 18 Mr Soh also contended that the DJ had allowed counsel for the plaintiff to supplement the testimony of Mr Liew during the questioning on Google Maps.40Foot Note 40×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at paras 158 to 162.A review of the transcript shows that his role was not as an active witness, but limited to relaying information viewed from the Google Maps.41Foot Note 41×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 139, line 9 onwards. Interruption in respect of questions on the SNOC statutory declarations 19 A final point of interference allegedly arose when, during the cross-examination of Mr Liew, defence counsel raised the absence of four statutory declarations from witnesses of the race, as well as Mr Liew’s failure to call Jenny Huang as a witness. In his submissions before me, defence counsel suggested that such an absence should have meant the DJ should have drawn an adverse inference against Mr Liew.42Foot Note 42×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 197.He pointed to the power of the court to draw an adverse inference under s 116(g) of the Evidence Act, where evidence which could be and is not produced would if produced be unfavourable to the person who withholds it.43Foot Note 43×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 218. 20 If that was the case, defence counsel could simply have put the question as to a witness’s absence, to give the opposing party an opportunity to explain the absence of the witness; and he could thereafter put any argument on inferences into his submissions: seeCheongGhim Fah and another v Murugian s/o Rangasamy[2004] 1 SLR(R) 628 at [43]. The time at which the inference would be drawn would be at the end of trial. 21 Instead, when asked by the DJ, defence counsel framed his issue as one of a breach in discovery obligations,44Foot Note 44×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, p 195 lines 17 to 22.which was entirely different from the issue explained to me. First, when parties were discussing why the four statutory declarations were not tendered as evidence, counsel for the plaintiff explained that they were disclosed and the defendant’s discovery obligations were accordingly discharged, and defence counsel disputed this point. The DJ found that the plaintiff did give disclosure pursuant to a notice to produce, and the plaintiff did not see the declarations as necessary as supporting evidence for his case.45Foot Note 45×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 Sep 2019 Transcript p 203 lines 22 to 30.After the DJ made this finding, defence counsel then requested for the court to draw an adverse inference based on the plaintiff’s omission to include the four statutory declarations in evidence.46Foot Note 46×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 Sep 2019 Transcript p 204 lines 2 to 4.In the context of this discussion, the DJ quite reasonably disposed of this point summarily by saying she would not do so. Notwithstanding, she then allowed defence counsel to continue to discuss the point and then to cross-examine Mr Liew on the issue, which he then again framed as a discovery point. Despite his frame, he did in fact pose questions to Mr Liew on the absence of a particular witness, and was not prevented from doing so by the DJ:47Foot Note 47×3 September, p 213, line 17 – p 216 line 6. Q Now, the 4 Statutory Declarations were not tendered as evidence to Court, am I right to say? A That is for my legal position to argue for and against. However, Your Honour, I will point out that to my understanding, from a non-legal perspective, my understanding is that the Defendant was in possession of these Statu---Statutory Declaration. It did take some time but my understanding was, he was in possession. And how did I know this? My worst---our worst fears came to, um---came---came true when out of the blue, unprovoked, Mr Soh went to post all 4 Statutory Declarations on his personal and commercial Facebook page. And I only knew about it because I was in the middle of seeing patients, my patients in the chiro---in my, uh, chiropractic clinic that I work at. And one of the, uh, um---one of those, uh, witnesses, one of these four witnesses was so mad because this was supposed to be a confidential document and now it was all over social media with her name, and even her practice, what she does. And that’s when I had no choice but to stop my workflow for the day and, um, inform the, uh---my, uh, Counsel that this was unacceptable because one of my witnesses was, uh, in a very dire strait. And thankfully, um, the post was eventually taken down and ….. ……….  Q Now, the---witness was in dire straits, is that what you’re saying? A Yes. Q Now, she didn’t no want to tes---the witness does not want to testify in the trial, am I right to say? A I cannot speak to her exact position on testifying the trial but my understanding is that she was, uh, one of those that signed the Statutory Declaration. Q Yes. And so, the witness was not willing to come forward for trial. That’s---that’s all I want to point out. A For her own reasons, uh,--- Q Thank you, A which we respect. [DC]: I---I do not wish to take this on further. I think we can leave the point as satisfied. That---that---that’s---the other witnesses--- Court: Any more question? [DC]: No, Your Honour. Court: No more--- [DC]: I have no more questions. Conclusion on judicial interference 22 Defence counsel relied heavily uponPublic Prosecutor vChua Siew Wei Kathleen[2016] 2 SLR 713 (“Kathleen Chua”). InKathleen Chua, a district judge had foreclosed several lines of cross-examination by the prosecution, which related to the accused’s motivation and relationship with the victim and were clearly relevant: see [28]–[29]. The witness there had only been on the stand for two hours. The district judge in that case had also made several rude comments to the prosecution when cutting off their line of questioning. 23 The analogy drawn withKathleen Chuawas not tenable. In my judgment, the transcripts show that defence counsel had a full and extensive time of cross-examination. Mr Liew was cross-examined over a period of five days. Excluding the time taken for interposing foreign witnesses, interruptions and oral submissions arising therefrom, and interlocutory applications, defence counsel had a total of over 11 hours, as follows: on the first day, more than two hours; on the second day, about three hours; on the third day, about four hours; on the fifth day, about one-and-a-half hours; and on the sixth day, some fifty minutes. By way of comparison, plaintiff counsel’s cross-examination of Mr Soh over two days totalled about five-and-a-half hours with about four-and-a-half hours on 11 September 2020 and about an hour on 24 September 2020. 24 A sense of perspective would be useful. In the round, this issue of the distance of 700m from the U-turn is only an aspect of the broader question, did Mr Liew slow down at the U-turn? Mr Liew’s ability to explain himself is only one factor to consider in the context of all the evidence adduced.",
        "Apparent bias": "25 The remaining arguments concern apparent bias. The law on apparent bias was definitively restated in the case ofBOIat [103]: (a)The general test is an objective one: whether there are circumstances that would give rise to areasonable suspicion or apprehensionof bias in the fair-minded and informed observer. (b)“Reasonable suspicion or apprehension”:there is a reasonable suspicion or apprehension of bias when an observer would think, from relevant circumstances, that bias is possible. This belief cannot be fanciful, and it must be a reasoned one, capable of articulation with reference to the evidence presented. (c)The observer’s perspectiveis that from which matters are to be judged: the court must not supplant the observer’s perspective by assuming knowledge outside the scope of knowledge of a reasonably well-informed member of the public. Detailed knowledge of the law and court procedure, or insider information regarding the character and ability of the members of the court or tribunal, would not be attributed to the observer. Instead, the observer would be informed of all relevant facts that are generally capable of being known by members of the public, including the traditions of integrity and impartiality that the administrators of justice have to uphold. The observer must also be fair-minded, and cannot be unduly complacent, sensitive or suspicious. For example, they should not jump to hasty conclusions of bias based on isolated episodes of temper or remarks taken out of context. The court may only consider circumstances which were available to an observer witnessing proceedings. 26 The contentions of apparent bias were broadly in two categories. First, that a series of errors he contended the DJ made showed her inclination to rule against Mr Soh. Second, that she made various remarks which he contended prejudged Mr Soh’s case or showed an underlying bias against Mr Soh. Series of errors alleged as evidence of bias 27 It was conceded at the hearing that there is a distinction between judicial error and apparent bias. As noted inTOW v TOV[2017] 3 SLR 725 at [46], “[a]n error in law or fact does not mean that bias was present or an appearance of bias created”. Defence counsel argued instead that a series of errors in this case gave rise to the perception of bias. The main plank of defence arguments related to RAS 24 and RAS 25. I deal with the substance of these appeals first and come to her comments made in the context of these applications separately at [34]–[41]. 28 RAS 25 concerned the dismissal of an application for an expert witness filed on the fourth day of trial. The defence contention was that the application for an expert witness was filed because of the issue as to whether Mr Liew slowed down. It was related to an earlier appeal I dealt with on 21 October 2020, Registrar’s Appeal from the State Courts No 17 of 2020 (“RAS 17”), which was a failed attempt to adduce additional GPS records from Mr Soh’s GPS watch in the midst of trial. Pertinent to this was that Mr Soh, from the outset, estimated that he took seven minutes to catch up with Mr Liew. If the GPS records were relevant, they would have been relevant to Mr Soh’s assertions from the outset, and Mr Soh had breached his discovery obligations in not disclosing these GPS records from his watch earlier. Similar to RAS 17, if Mr Soh had thought fit to use an expert earlier to discuss the pace of the runners in the context of the time needed for the “chase pack” to catch up, he ought to have done so much earlier, and not midway through trial. More fundamentally, a coach’s evidence as to how elite marathon runners usually run would not be relevant; neither would his testimony be necessary in the context of Mr Liew’s or Mr Soh’s personal best times, which his draft affidavit also dealt with. Mr Liew, Mr Soh, and Mr Takizaki could have been cross-examined on (a) how elite marathon runners usually run, (b) how they themselves usually run, or (c) their personal best times. The salient issue was how Mr Liew ran on the day in question, and whether he slowed down. That is a factual query for the court, not an expert. RAS 25 was therefore dismissed. 29 RAS 24 concerned Mr Liew’s application to amend his SOC filed on the in the evening of 23 September 2020, just before the scheduled final day of trial, 24 September 2020. This was granted by the DJ on 24 September 2020 with no order on costs. These amendments concerned particulars of aggravated and exemplary damages. 30 Registrar’s Appeal from the State Courts No 18 of 2020 (“RAS 18”) forms part of the background to this issue. RAS 18 was in respect of Mr Liew’s adduction of a Supplementary Affidavit of Evidence in Chief (“SAEIC”). This was allowed by the DJ on the second day of trial. The SAEIC comprised social media posts made by Mr Soh and other documents whose authenticity were not disputed by Mr Soh. There was no prejudice occasioned by this as the SAEIC made no assertions and Mr Soh was aware of and did not dispute the authenticity of the documents; their relevance would depend upon matters already pleaded or alluded to. RAS 18 was dismissed at the same time as RAS 17. 31 RAS 24, on the other hand, was a different matter. The amendments to the SOC sought to add particulars to the pleading for aggravated and exemplary damages. The premise for the amendment was that it would not occasion prejudice, on the footing that the particulars were of documents already admitted into court, either through the Agreed Bundle or Mr Liew’s SAEIC.48Foot Note 48×Respondent’s Written Submissions for RAS 24 dated 22 February 2021 at para 40.The argument that there was no prejudice was tenuous: the plaintiff has closed his case, and the cross-examination of the defendant has been completed. The defendant would be entitled to reply, put in any evidence in his own defence, and to cross-examine the plaintiff accordingly. More fundamentally, the 157 pages of particulars were prolix and contained many aspects of evidence. The pleading as it stood embarrassed the defendant in his defence of the suit. On 1 March 2021, and because matters remained unsatisfactory, again on 2 March 2021, I allowed counsel for the plaintiff time to consider the issues and to submit thereafter with the benefit of pleading precedents. Even so, the plaintiff’s latest proposal of 16 March 2021 remained prolix, with multiple assertions of evidence over 39 pages. In contrast, the precedents he exhibited by way of submission were entirely limited to allegations of material fact, as pleadings should be. In the form submitted, the draft amendments remained prolix and would embarrass a fair trial. Defence counsel characterised the application as a back-door attempt by the plaintiff to rectify his SAEIC, on the hypothesis that the plaintiff’s application arose after his counsel was not allowed to cross-examine Mr Soh on the contents of the documents annexed to the SAEIC on the seventh day of trial.49Foot Note 49×Appellant’s Written Submissions for RAS 24 dated 22 February 2021 at paras 44, 50 and 51.The earlier SAEIC, filed on 9 September 2020 after leave was given on 2 September 2020, contained no evidence in chief regarding the documents annexed. Pleadings, however, cannot replace the function of evidence in chief. In the event that there is an absence of evidence on a material fact pleaded, that would in any event be fatal to that particular aspect of the case. I allowed the appeal and set aside the orders made below. 32 The ruling on the application to amend the pleadings was therefore an error. Another error defence counsel relied on was in respect of the DJ’s order made at trial to disallow any publication of the name of an individual who had made a statutory declaration for the SNOC, Ms Jenny Huang.50Foot Note 50×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, p 210 line 10 and p 216 lines 25 to 27.The DJ accepted that she was entitled to privacy because she was not a witness in the case.51Foot Note 51×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, p 216 lines 26 to 27.When Ms Huang subsequently applied for a sealing order, however, it was conceded at that hearing that the order lacked a proper basis: no particular public interest required the specific order, and in previously making the order at trial the DJ relied upon evidence from the bar.52Foot Note 52×Notes of Evidence for DC/SUM 64/2021 dated 16 February 2021 at p 11B and 12F.A salient point was that this later application was resisted by Mr Soh, and the DJ dismissed the application, ruling in Mr Soh’s favour, rectifying the position.53Foot Note 53×Notes of Evidence for DC/SUM 64/2021 dated 16 February 2021 at p 12F. 33 Viewed in the round, the facts did not reveal a series of errors nor a predisposition to rule against Mr Soh. Of the four appeals on interlocutory matters I dealt with, I had dismissed three. Mr Soh had also not appealed another decision the DJ made to disallow the late adduction of two witnesses. Series of comments made by trial judge 34 Criticism of various comments made by the DJ were in two categories, in particular, (a) comments in relation to the applications which led to RAS 24 and 25, which defence counsel argued showed a bias against Mr Soh; and (b) comments that he alleged showed she prejudged various applications. 35 I start with the comments in the application pertinent to RAS 24, which Mr Soh contended showed a predisposition against him. His premise was that the DJ revealed her prejudice in her use of the phrases “reprehensible conduct” and “mercenary advantage” in her oral grounds for that decision. The full context was as follows:54Foot Note 54×Transcript for DC/DC 1784/2019 dated 16 October 2020 at p 97 lines 4 to 20. … As for the claim for exemplary damages, exemplary damages can be awarded if the Plaintiff is able to show that the Defendant deliberately published the words--- the alleged defamatory words even though he knew that they were untrue or was reckless and not caring whether the words were true or false because the prospects of material gain outweighed the prospects of material loss. In this regard,evidence that supports an inference of reprehensible conduct and cy---cynical calculation of mercenary advantage on the part of the Defendant would be relevant.As the particulars sought to be introduced by way of the amendment, support the Plaintiff's claim that the Defendant's conduct is such that the Court should award aggravated damages and exemplary damages to the Plaintiff, the amendments, on the face of it, are necessary to enable the real questions in controversy between the parties to be decided, and therefore should be allowed. … [emphasis added] 36 Although the citation was not given in her oral grounds, it appeared clear from the context that she was quoting case law. The specific case is that ofJohn v MGN Ltd[1997] QB 586, a defamation case where the requirements for awarding exemplary damages were discussed. The judgment notes that for a person to be liable for exemplary damages, their conduct “must have been motivated by mercenary considerations”, and that when deciding this, a jury must not lightly draw “an inference of reprehensible conduct and cynical calculation of mercenary advantage”: at 619. The DJ was not making a comment about Mr Soh. 37 I turn to the complaints in relation to the application made for the adduction of expert evidence. His complaint was that on the one hand when he sought to make his point that Mr Liew’s coverage of 700m in two and a half minutes was faster than his average marathon pace, the DJ was of the view that there was no expert evidence on the same.55Foot Note 55×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at paras 99 to 100.On the other hand, when he then sought to adduce the expert evidence, the DJ appeared to have changed her mind and disallowed the application.56Foot Note 56×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 108. 38 Detailing the material events as they unfolded is useful to understand this issue. As I mention at [13], it was first raised in cross-examination in the middle of the afternoon of the first day. Near the end of the first day, after counsel for the plaintiff objected to the line of questioning, defence counsel explained that he was “doing a scientific---a mathematical approach to understand what is the pace that he run”.57Foot Note 57×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 109 line 3.After discussion, the DJ mentioned that defence counsel could include the issue in his submissions, and that “if [he had] a point to push that is scientific, it should have been through an expert witness”.58Foot Note 58×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, p 107 line 18 to p 112 line 10.During the second day of trial, defence counsel stated in the morning that he would, in submissions, show “how running 700 metres in 2 ½ minutes cannot be a slowdown”.59Foot Note 59×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 47 lines 20 to 23The DJ appeared to understand him to be alluding to the normal speed of a marathon runner, on which there was no expert evidence adduced, so the DJ then said that it would be a matter for expert evidence and not submissions.60Foot Note 60×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 47 lines 29 to 32.In the afternoon, defence counsel stated that Mr Soh had told him that it was not “humanly possible for any Singaporean, not even [Mr Soh] to be able to slow down at junctures and still run a pace of 334 minutes [sic] kilometres per hour.”61Foot Note 61×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 109 lines 6 to 9.He reiterated this one more time and then mentioned that he would introduce expert evidence.62Foot Note 62×ABOD, Volume 1, Tab B, Day 2 Trial Transcripts, 2 September 2020, p 111 lines 13 to 27. 39 From the transcript, it appears the DJ was attempting to let defence counsel know that expert evidence could not be adduced from the bar in the context of his cross-examination of a witness of fact, and she did not suggest that he should put in expert evidence in the midst of trial. She also sought to clarify her confusion on the precise point he was trying to make. On the third day of the trial, just before the lunch break, she cleared the courtroom for a discussion with counsel. She sought to clarify the issue with counsel, because “[w]hen [she] started the case, [she] had thought the crux of the matter is a comparison between the Plaintiff’s version and the Defendant’s version”.63Foot Note 63×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 100 lines 23 to 25.She understood Mr Soh’s case, she said, as that set out in his affidavit, which was that he took 2 km or 7 minutes to catch up with Mr Liew.64Foot Note 64×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 107 lines 11 to 13.She asked defence counsel about the need for the questions that he asked regarding pace, stating that they were not matters in evidence.65Foot Note 65×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 101 line 28 to p 102 line 4 and p 103 lines 10 to 16.Defence counsel, rather than explaining the point as he did at the appeal hearing, noted the point and then promised he “would endeavour to be more focused”.66Foot Note 66×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 103 lines 30 to 31.She pointed out that defence counsel had not asked Mr Liew any questions about Mr Soh’s version of events as set out in Mr Soh’s affidavit, rather, his questions were “confusing and new”, regarding what was a “marathon pace, not marathon pace”.67Foot Note 67×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 104, lines 2 to 10.At the end of the ten minute discussion she stated:68Foot Note 68×ABOD, Volume 2, Tab C, Day 3 Trial Transcripts, 3 September 2020, at p 107 lines 18 to 27. So, 2.5 minutes must have meant that he slowed down, right? 7 minutes, he didn’t slowdown, he was running at his normal pace. Very straightforward. I don’t have to … deal with math. It’s 2.5 minutes, 7 minutes. Who is telling the truth? As simple as that… So, even if you have muddied the waters for me, … I won’t take all those confusing stuff that are not in evidence before me, okay? Again, rather than to explain why it was that the DJ should engage with any particular argument, defence counsel’s reply was that he took the DJ’s point, and proceedings were thereafter adjourned for a lunch break. 40 The DJ did, therefore, attempt to clarify her understanding, and a reasonable and objective bystander, at that point, would have realised she had not prejudged matters and was seeking to clarify her thinking. On the other hand, when the application was filed, the expert’s draft affidavit would have finally made the point clear, because the new evidence was not to show the boundaries of human possibility. Thus, in relation to what was being sought to be adduced, the merits of the application, would also be plain: see [28] above. In Mr Liew’s case, the questions as to his best time, his time after the U-turn and whether he slowed down, had been put and answered on the afternoon of the first day,beforeMr Liew’s counsel objected, andbeforeMr Soh’s counsel explained the issue as one of a “scientific” perspective: see [12] above.69Foot Note 69×ABOD, Volume 1, Tab A, Day 1 Trial Transcripts, 1 September 2020, at p 29 lines 31 to 32. 41 Coming to the comments said to prejudge the case, there were four alleged instances of prejudgment by the DJ. First, regarding comments made about the recusal application prior to the hearing;70Foot Note 70×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 457.the second was regarding prejudgment of the application for expert evidence;71Foot Note 71×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at paras 239 to 256.the third was that the DJ prejudged the credibility of two of Soh’s witnesses who he sought to call during SUM 3175;72Foot Note 72×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at paras 313 to 326.and fourth, that the DJ had prejudged the issue of indemnity costs against Soh that counsel for the plaintiff said he would seek when counsel for the defendant sought additional trial dates to cross-examine Mr Liew.73Foot Note 73×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at paras 437 to 450.From an examination of the transcripts, these were by way of preliminary remarks, and it would not have appeared to the reasonable observer that the DJ had come to a final and conclusive decision: see, in this context,BOIat [101]. Conclusion on apparent bias 42 There were other contentions that I do not think useful to deal withseriatim. A category contended misstatements on the law made by the DJ, such as the principles for the amendment of pleadings, the drawing of adverse inferences, and matters of evidence. These were matters relevant to appeal and not recusal, and I did not examine them save where relevant to RAS 24 and RAS 25. The remaining category concerned various ad-hoc requests that the DJ did not accede to on various matters relating to case management such as timelines and adjournments. These refusals could not, in and of themselves, be perceived as bias and I do not see the need to detail each one in these grounds. 43 A finding of apparent bias is one made in the context of the entirety of proceedings. Having considered the list of complaints, I found that no objective bystander would have perceived any apparent bias.",
        "Matters of etiquette": "44 Two matters of etiquette are related to aspects of the case dealt with above. Defence counsel used his own transcripts of chamber hearings in advancing quite a few of his complaints against the DJ. Certified transcripts had not been requested for most of the incidences complained about. In one instance where he did obtain a court certified transcript, in relation to the hearing on 8 September 2020 for SUM 2828/2020,74Foot Note 74×Ashley Liew’s 5th Affidavit dated 27 November 2020 at p 99 to 108.he contended that the official transcript deviated from his own transcript. His complaint was that there were substantial editorial adjustments made to the court transcript, which painted opposing counsel in a positive light, whilst giving the impression that he had only half-heartedly attempted to argue his case.75Foot Note 75×Appellant’s Written Submissions for RAS 35 dated 23 February 2021 at para 307.A perusal of the certified transcript did not, in my opinion, reflect his interpretation of it. Counsel are reminded that wherever a judge is quoted, proper etiquette suggests that a transcript should be requested of the judge. Thus, inHodgson v Imperial Tobacco Ltd[1998] 1 WLR 1056, quoted by Lee Seiu Kin J inTan Chin Min vThe Royal Bank of Scotland plc[2013] 4 SLR 529 at [11], where the English Court of Appeal made the point that chambers hearings are not confidential or secret, it stated that information about what occurs in chambers should “be made available to the publicwhen requested” [emphasis added]. This is particularly important in recusal applications, where there is a danger of confirmation bias on the part of counsel who may already be under a mistaken impression. InBOI, the Court of Appeal noted how the unofficial transcripts in that case were tainted by the bias of the parties against the particular judge: at [118]–[119]. 45 A final and related matter is that the examination of the transcripts necessitated by this application, illuminated the vital importance of court rules and court etiquette in ensuring effective access to justice. This was a simple defamation case that was essentially factual; it could well have finished within the 8 days that it was set down for with good order. First, the multiple interlocutory applications that whittled down trial time were filed just before and during trial. These could have been considered, filed and argued much earlier. During trial, cross-examination was marked by not infrequent, and sometimes lengthy, objections by counsel; unnecessary remarks to each other and to witnesses may well have distracted from the issues at hand. Counsel have a duty to their clients to pursue their interests diligently and to prepare their cases well: see r 5(1) of the Legal Profession (Professional Conduct) Rules2015 (S 706/2015) (the “PCR”). Concomitant with this, is the duty to treat fellow members of the bar with proper decorum. Rules 4(f), 7(1)(a) and (b) of the PCR stipulate that counsel have a duty to accord one another with respect, dignity and courtesy. Good order in litigation is fundamental to a fair and effective trial process, without which the merits of any case could easily be obscured. Rules 4(a), 9(1)(a) and (e) of the PCR also make clear that counsel have a duty to the court to assist in the administration of justice and to conduct their case in a manner which maintains the fairness, integrity and efficiency of proceedings. Sundaresh Menon CJ recently emphasised inReParti Liyani[2020] 5 SLR 1080 at [35] that counsel’sparamountduty is to assist the court in the administration of justice. I mention, as an illustration of how these three sets of duties coalesce, a letter sent by counsel two days after I disposed of matters. This was a request for an extension of time for leave to appeal by way of letter and referenced an unanswered request to opposing counsel to agree. Due consideration for client, fellow counsel and court would suggest that prior to drafting such a letter, counsel ought to have studied ss 29, 29A and 29B of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) and Rule 56A of the Rules of Court (Cap 322, 2014 Rev Ed) (he was referred to these provisions by way of response).",
        "Conclusion": "46 RAS 35 and RAS 25 were dismissed. RAS 24 was allowed and the orders made in the application below were set aside. 47 In respect of costs, the three appeals filed by Mr Soh were related. RAS 35 was the most substantive. It required extensive examination of the transcripts and of the various interlocutory applications and appeals, including RAS 24 and RAS 25. It was more appropriate to make a single order, and in that context I took into consideration that for RAS 24, Mr Soh would also have been entitled to the costs below. I awarded Mr Liew half of the costs of RAS 35. These costs were fixed in the round, inclusive of disbursements, at $10,000. 48 Allegations of excessive judicial interference and judicial bias, while necessary when appropriate, are extremely serious and should only be employed with great circumspection and care. Inevitably, they occasion costs to clients, public resources and the justice system as a whole. The Court of Appeal’s guidance inBOIat [141] remains apt: Finally, we cannot emphasise enough how extremely serious allegations of judicial bias are. Indeed, such allegations can be utilised not only as a weapon of abuse by disgruntled litigants but also waste valuable court time and resources in the process. We would imagine that, by their very nature, such allegations would be rare in the extreme. Should such proceedings arise before the court in the future and be found to be unmeritorious, there may be serious consequences. Valerie TheanJudge of the High Court Clarence Lun Yaodong, Samuel Lim Jie Bin, Phee Wei Qi, Shanice and Selina Shantini Naidu (Fervent Chambers LLC) for the appellant; Teng Hin Weng, Mark and Lim Tianjun (That.Legal LLC) for the respondent."
    }
}