{
    "case_title": "Wang XiaopuvGoh Seng Heng and another",
    "ncitation": "[2021] SGHC 282",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 This matter concerned an application of the Plaintiff, Wang Xiaopu, for an order of committal against the First Defendant, Dr Goh Seng Heng (“Dr Goh”). On 30 August 2021, Dr Goh elected to give evidence in the show cause hearing, and was subjected to cross-examination by the Plaintiff’s counsel, Ms Morgan. On 19 October 2021, after hearing the submissions by counsel for both parties, I found Dr Goh to be in contempt of court, and ordered that he be punished for such contempt by serving a seven-day term of imprisonment, which was to commence on 9 November 2021 (the “Order”). 2 On 5 November 2021, Dr Goh filed an appeal against the Order, and on 8 November 2021, upon his application, I granted a stay of execution. I now give the grounds of my decision.",
        "Background": "3 In the main action,WangXiaopu v Goh Seng Heng and another[2019] SGHC 284 (the “Judgment”), the Plaintiff sued Dr Goh for misrepresentation and breach of contract concerning the sale of certain shares by Dr Goh to the Plaintiff for a sum in excess of S$30m (the “Sales Proceeds”). On 5 December 2019, Woo Bih Li J (as he then was) gave judgment in favour of the Plaintiff and ordered that Dr Goh repay the Plaintiff S$30.7m. At [265] of the Judgment, it was further ordered that: In the event that [Dr Goh] does not repay the … $30,700,000 … within 30 days from the date of this decision … [Dr Goh] is to account for the sales proceeds and a consequential tracing order for those proceeds is granted. I shall refer to this as the “Tracing Order”. 4 Dr Goh did not pay the sum ordered, nor any part of it. Indeed, even as at the date of my Order, the sum remained wholly unsatisfied. As a consequence of Dr Goh’s failure to pay the judgment debt, the Tracing Order came into effect on 5 January 2020, and he became liable to account for the Sales Proceeds. On 13 March 2020, the Plaintiff filed a summons in this action, summons no 1453 of 2020 (“SUM 1453”),1Foot Note 1×Plaintiff’s Bundle of Documents (“PBOD”) (Vol 1) at Tab 3.to pursue the Tracing Order. Despite being served with the requisite notice through his solicitors on record,2Foot Note 2×PBOD (Vol 1) at Tab 6.Dr Goh did not attend the hearing of SUM 1453 on the appointed date. 5 Without protest from Dr Goh, Woo J granted an order in terms of SUM 1453 (“ORC 3129”) on 22 June 2020.3Foot Note 3×PBOD (Vol 1) at Tab 1.ORC 3129 directed that Dr Goh account for the various sums totalling the equivalent of S$30,700,000 which had been paid by the Plaintiff to him on various dates. In particular, Dr Goh was ordered to render a full account of:4Foot Note 4×PBOD (Vol 1) at p 6 (bundle pagination (“bp”)). (a) RMB ¥39,428,736 paid by the Plaintiff on 24 October 2013 into his HSBC account in Guangzhou, China, bearing the account number 629151309050 (the “HSBC-GZ Account”) (para 2(a) read with paras 3 and 4 of ORC 3129); and (b) A further ¥46,720,151.01 paid by the Plaintiff on 26 November 2013 into the HSBC-GZ account (para 2(d) read with paras 3 and 4 of ORC 3129). These are the orders which formed the subject of this contempt action and I shall refer to them as the “HSBC Orders”, and the sums of money to which they relate as the “Funds”. 6 Meanwhile, on 6 March 2020, Dr Goh filed a debtor’s bankruptcy application in HC/B 940/2020 (“B 940”). This application was granted on 19 March 2020 and Dr Goh was declared a bankrupt. The Plaintiff became aware of this on 17 April 2020, and accordingly, applied for court’s leave to proceed against Dr Goh in SUM 1453. She obtained it on 9 June 2020, and ORC 3129 was thereafter served on Dr Goh on 25 June 2020 for his compliance. 7 On 20 July 2020, Dr Goh affirmed an affidavit in response to ORC 3129 (the “July 2020 Affidavit”). He stated the following at paragraph 4:5Foot Note 5×PBOD (Vol 1) at p 230 (bp), para 4.“I make this Affidavit in response the application of the Plaintiff, Wang Xiaopu, in SUM 1453/2020 and ORC 3129/2020 focusing on addressing the orders made by the Court.” By this, Dr Goh put it beyond doubt that this affidavit was specifically made to comply with the orders of Woo J in ORC 3129. 8 Substantively, in response to both HSBC Orders, Dr Goh made the same statements at para 6 of the July 2020 Affidavit:6Foot Note 6×PBOD (Vol 1) at p 231 (bp), para 6. “The account has been closed for several years. AsI am unable to recalland I do not anymore have in my possession any physical records of past bank statements of the account, I have written to the bank to help in tracing my past statements. My registered letter to the bank dated 06 July 2020 and the Singapore Post posting form for registered service and Singapore Post receipt are attached as Exhibit GSH-B. [Emphasis added] 9 From this, it is clear that on 20 July 2020, Dr Goh’s position was that he was unable to remember what had happened to the Funds. This, however, was discovered to be untrue. On 27 August 2020, the Plaintiff’s counsel, Drew & Napier (“D&N”), learnt from the Official Assignee’s (the “OA”) office that Dr Goh had informed them that he had lost the Funds due to “bad investments” in China.7Foot Note 7×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 292 (bp), paras 35 and 38.The full statement Dr Goh gave to the OA’s office was as follows:8Foot Note 8×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 439 (bp). [Question]: What happened to the S$18 million worth of RMB that was in your HSBC-GZ bank account? [Dr Goh’s response]:All the S$18 million worth of RMB was used to pay for my business obligations, debts andinvestment losses I incurred in China. None of the S$18 million came into Singapore and I did not use any of the money to benefit anyone in my family. Also, it was due to the reason that the Central Bank of China did not allow RMB to be taken out of China, so none of the money was transferred to Singapore. [Emphasis added] 10 I pause to note that Dr Goh later attempted to clarify in August 2021 (during the contempt proceedings: see [20] to [26] below) that these “business obligations, debts and investment loses” were gambling losses. Specifically, he claimed that the Funds had been paid “to junkets in China who had supplied [him] with gambling and rolling chips”.9Foot Note 9×Dr Goh’s Affidavit (16 Aug 2021): PBOD (Vol 2) at p 542 (bp), para 102(a). 11 I interject with his subsequent clarification at this stage because – as will become apparent at [17] below – Dr Goh will come to explain in April 2021 that he was a gambler, and had lost the Funds as a result of his gambling habit. As the phrase, “business obligations, debts and investment losses” is slightly ambiguous, I thought it necessary for it to be seen in that light. That said, I hasten to add that, whether Dr Goh was being truthful as to the fact that all “S$18 million worth of RMB” in the HSBC-GZ Account had been lost to gambling, was not an issue I needed to determine for the purposes of finding him in contempt. 12 I return then to the chronology of events after D&N learnt of Dr Goh’s response to the OA’s office on 27 August 2020. Almost immediately, they wrote to him on 28 August 2020, asking that he clarify what happened to the Funds in the HSBC-GZ Account.10Foot Note 10×Plaintiff’s Affidavit  (10 Oct 2020): PBOD (Vol 1) at p 292 (bp), para 36.In response, Dr Goh affirmed another affidavit on 28 August 2020 (the “August 2020 Affidavit”) and, in answer to that question, stated as follows:11Foot Note 11×PBOD (Vol 1) at p 256 (bp), para 5 in response to “Question 4b”. I cannot remember nor recall. It has been too many years ago and I have since retired from active professional and corporate life, being over 65 and diabetic with poor and failing memory. [Emphasis added] 13 By this, Dr Goh solidified the response in his earlier July 2020 Affidavit. Having received Dr Goh’s July 2020 and August 2020 Affidavits, the Plaintiff took the view that he had not, in either of those affidavits, provided a sufficient account of Sales Proceeds nor any useful information. Indeed, the two affidavits filed by Dr Goh spanned less than eight pagesin total,12Foot Note 12×PBOD (Vol 1) at Tabs 7 and 8.and although they contained some exhibits, these were of no real value to the Plaintiff insofar as they were concerned withtracingthe Funds. 14 Accordingly, on 18 September 2020, D&N sent another letter to Dr Goh demanding information. It stated that the Plaintiff was “completely unconvinced that [he had] simply forgotten what happened to the Funds [in the HSBC-GZ Account]”, but was prepared to give him “one final opportunity to comply with ORC 3219 fully”.13Foot Note 13×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at pp 441–442 (bp).It was only at this point that Dr Goh departed from his earlier position that he could not remember what had happened with the Funds. On 22 September 2020, he responded to D&N – by way of email – that the Funds had been “expended to Chinese businessmen [to] whom [he] owed financial obligations”. However, he provided no details as he claimed that he was unable to recall any, and that he was “still waiting for HSBC China to assist”.14Foot Note 14×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 454 (bp). 15 It should not be surprising that the Plaintiff was not satisfied with this response. Therefore, on 24 September 2020, D&N sent a further letter to Dr Goh which stated the following. First, that the Plaintiff disagreed that HSBC China would be able to render any assistance as any bank statements it could provide would show no more than the bare account numbers to whom any transfers of the Funds were made. They would not indicate the identities of these “Chinese businessmen”. Second, given the minimal utility of such statements, that Dr Goh was to file a further affidavit – no later than 30 September 2020 – identifying the “Chinese businessmen” and providing documentary proof of the financial obligations owed to them.15Foot Note 15×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 458 (bp), paras 5–7.On 5 October 2020, Dr Goh responded by email stating, essentially, that he was not able to remember, nor did he have any relevant documents.16Foot Note 16×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at pp 462–463 (bp). 16 In light of this unhelpful response, on 12 October 2020, the Plaintiff filed an application to commence the present contempt proceedings against Dr Goh. On 13 November 2020, she was granted leave to do so by Woo J, and thereafter, the matter came before me on 30 August 2021. 17 I will turn to the defence Dr Goh put up at the contempt proceedings before me momentarily. Before I do so, however, it is worth nothing that, prior to the hearing, the Plaintiff commenced bankruptcy examination proceedings under s 83 of the Bankruptcy Act (Cap 20, 2009 Rev Ed) against Dr Goh. This took place on 12 and 13 April 2021 before Assistant Registrar Sim Junhui (the “Examination Proceedings”). During these proceedings, Dr Goh said that the “Chinese businessmen” referenced in his earlier 22 September 2020 email were, in fact, casino junkets. He claimed to be a very big gambler, and that he had lost the Funds in the HSBC-GZ Account on gambling in Macau. Specifically, he stated that both amounts of ¥39,428,736 and ¥46,720,151.01 – forming the subject of the HSBC Orders – werecompletelylost in this way.17Foot Note 17×Plaintiff’s Affidavit (25 May 2021): PBOD (Vol 2) at pp 900–902 (bp).This was first time Dr Goh raised his gambling habit (cross-reference [11] above), and it was a position he maintained during the contempt proceedings. 18 In summary, in July and August 2020, Dr Goh affirmed two affidavits in which he stated unequivocally that he could not remember what had happened to the Funds in his HSBC-GZ Account. These two affidavits were prepared pursuant to ORC 3219 and served on the Plaintiff. However, in August 2020, Dr Goh informed the OA’s office that the Funds had been used to pay off “business obligations, debts and investment losses incurred in China”. When questioned further by the Plaintiff in September 2020, he then departed from his position that he “could not remember”, and told the Plaintiff that the Funds had been paid to “Chinese businessmen”, though he claimed to be unable to remember who these individuals were. Finally, in April 2021, Dr Goh sought to clarify in the Examination Proceedings that the “Chinese businessmen” he mentioned in September 2020 were, in fact, casino junkets. 19 With this sequence of events in mind, I turn to the contempt proceedings which took place before me on 30 August and 19 October 2021.",
        "The contempt proceedings; Dr Goh’s contempt": "20 The Plaintiff ultimately elected to proceed with the present contempt proceedingsonlyon the basis of the HSBC Orders and the Funds.18Foot Note 18×Plaintiff’s Further Written Submissions (8 Oct 2021) at para 93.As stated at [5] above, these concerned the ¥39,428,736 and ¥46,720,151.01 transferred by the Plaintiff, on 24 October 2013 and 26 November 2013 respectively, to Dr Goh’s HSBC-GZ Account. I highlight this because the Plaintiff’s application originally referred to another two sums paid into other accounts belonging to Dr Goh,19Foot Note 19×Summons in HC/SUM 5041/2020: PBOD (Vol 1) at p 471 (bp), paras 1(a)(ii) and (iii).but these were not pursued. 21 In his defence to these contempt proceedings, on 16 August 2021, Dr Goh affirmed an affidavit (the “August 2021 Affidavit”).20Foot Note 20×PBOD (Vol 2) at Tab 16.In it, he claimed that he had, “at all times”, provided all information that was available to him at the material time, to the best of his ability and knowledge, and that he had made all efforts to procure the relevant documents and information to comply with the Tracing Order.21Foot Note 21×PBOD (Vol 2) at p 484 (bp), para 8.He set out in considerable detail, over 201 pages, the actions he had taken in this regard. 22 The fundamental issue with this claim, however, was that he clearly stated – in his July 2020 and August 2020 Affidavits – that he wasunable to recallwhat had happened to the relevant sums of monies paid by the Plaintiff into his HSBC-GZ Account, when that was not the case. It can therefore hardly be said that Dr Goh complied “at all times”. Indeed, the evidence (set out from [8] to [15] above) shows clearly that Dr Gohknewwhat had happened to the money, but did not disclose that information to the Plaintiff. 23 In his August 2021 Affidavit, Dr Goh attempted to justify this action –ie, his earlier answers that he could not remember. He explained that he was unable to recall theprecise detailsof how he had dealt with the Funds in the HSBC-GZ Account due to various factors such as the stress from the onslaught of multiple and protracted litigation, his age, and his diabetic condition. More specifically, he claimed that the multiple and protracted law suits he faced had “overwhelmed [him] with information”. He was thus “unable to completely recall whether [he] had received the entirety of the Sale Proceeds and if so where these monies [had been] transferred to, and whether the monies relate[d] to the Sale Proceeds or some other unrelated transaction raised in a separate suit”.22Foot Note 22×PBOD (Vol 2) at pp 484–485 (bp), paras 8–9.He also claimed that he suffered from dyslexia, and always had had a weak ability to retain details. At the age of 66 years, his memory was worsening, and he was increasingly unable to remember details of past events, especially those that had taken place seven years ago.23Foot Note 23×PBOD (Vol 2) at p 485 (bp), para 10. 24 The only meaningful point which arises from this aspect of his August 2021 Affidavit is that he had no recollection of thedetailsof the transfers out of his HSBC-GZ Account,notthat he could not recall the general position that the Funds had been gambled away in Macau. This, however, did not aid Dr Goh’s defence. To the contrary, it illustrated why his claims that he “could not recall” in his July 2020 and August 2020 Affidavits were particularly invidious. 25 On 30 August 2021, he elected to give evidence from the witness box before me, and was subject to cross-examination by Ms Morgan. During cross-examination, he accepted without hesitation that he recalled the “general event” of losing the Funds by gambling in Macau.24Foot Note 24×Notes of Evidence (“NEs”) 19 Aug 2021 at p 52, lines 13–19.Instead, he sought to explain why he did not disclose this “general event” to the Plaintiff for what appeared to me to be two connected reasons, though he did not explain them in a particularly coherent manner. (a) First, Dr Goh said that his gambling losses were “huge, very depressing and embarrassing”, and that he was “afraid to tell opposing counsel [ie, D&N], who [he] thought was quite adversarial”.25Foot Note 25×NEs 19 Aug 2021 at p 51, lines 17–28.He even went as far as to say that he was “shell-shocked” at the time ORC 3129 had been served on him.26Foot Note 26×NEs 30 Aug 2021 at p 51, lines 19–28. (b) Second, I understood that he did not wish to inform the Plaintiff that he had gambled the Funds away because he had no recollection of the specific payment details, and would not have been able to provide such details until the bank, HSBC China, had supplied him with the relevant bank statements.27Foot Note 27×NEs 19 Aug 2021 at p 52, lines 5–30. 26 The essence of Dr Goh’s evidence therefore seemed to be that he did not wish to disclose the fact of his gambling to the Plaintiff because he did not have the details to back up his assertion, which he knew the Plaintiff’s counsel, D&N, would demand, seeing as they were – as he put it – “quite adversarial”. Thus, on this basis, he said that he felt that he could only provide full details when he obtained the bank documents.28Foot Note 28×NEs 30 Aug 2021 at p 47, lines 10–13 and p 69, lines 9–28. 27 In my view, this was not a legitimate defence. The inability to provide a full account is not an excuse to provide no account. When the court orders an individual to account for certain funds, he or she is obliged to provideallinformation relating to those funds, even if such information is incomplete. It is antithetical to the accounting process to allow the obligor to pick and choose how and when he or she wishes to comply. 28 By Dr Goh’s own account, heknewthat the Funds in the HSBC-GZ Account had been lost on account of gambling, yet he did not inform the Plaintiff. In fact, there was absolutely no excuse for him to claim to have no recollection in the August 2020 Affidavit (affirmed on 28 August) whenonlyone day earlier, he had informed the OA’s office that the Funds had been used to pay off business obligations, debts, and investment losses in China. It is therefore clear that he had lied in his July 2020 and August 2020 Affidavits about being unable to recall what happened to the Funds due to his failing health and memory. He had full knowledge of where the money went, though he may not have recalled the full details. To tell a lie in an affidavit – in answer to adirectorder of court to disclose information relating to the Funds – was clearly a contempt of court. The only outstanding question, insofar as liability was concerned, was whether he possessed the requisitemensrea. 29 In this regard, I need only refer to the decision of the Court of Appeal inPertaminaEnergy Trading Ltd v Karaha Bodas Co LLC and others[2007] 2 SLR(R) 518 (“Pertamina”). Here, the court stated at [51]: In so far as the party to the court order is concerned, it would appear thatit is only necessary to prove that the relevant conduct of the party alleged to be in breach of the court order was intentional and that it knew of all the facts which made such conduct a breach of the order(including, of course, knowledge of the existence of the order and of all of its material terms (see the English High Court decision ofRe L (A Ward)[1988] 1 FLR 255 at 259)). However,it is unnecessary to prove that that party appreciated that it was breaching the order. As Sachs LJ put it in the English Court of Appeal decision ofKnight v Clifton[1971] Ch 700 at 721, “[the] prohibition is absolute and is not to be related to intent unless otherwise stated on the face of the order”. [Emphasis added] 30 Dr Goh’s own evidence showed that he intended to withhold information from the Plaintiff despite being ordered to provide afull account. Even if he genuinely considered himself justified in temporarily withholding information from the Plaintiff until such a time as he could provide a more complete account, that would not have affected my finding that he possessed the requisite mental state. This was because, asPertaminasuggests, it was not relevant whether Dr Goh appreciated that – by holding back information – he would be in breach of ORC 3129. It was sufficient that heintentionally– as opposed to inadvertently – held back such information. Given his knowledge at the time he affirmed the July 2020 and August 2020 Affidavits, Dr Goh certainly had such intention. Furthermore, in his attempt to hold back this information, he had aggravated the contempt by lying in his affidavits that he was unable to recall what happened to the Funds. For these reasons, I found Dr Goh guilty of contempt.",
        "The appropriate punishment": "31 The punishment for contempt can range from a warning to a fine and to imprisonment. What an appropriate punishment should be for any particular contempt plainly depends on the circumstances of the individual case, and I now turn to my reasons for imposing a seven-day imprisonment term on Dr Goh. In this regard, I considered his conduct in the enforcement proceedings of the Tracing Order,ie, in SUM 1453; as well as in the contempt proceedings before me. 32 I do not think that the details of the underlying litigation that resulted in the Judgment are of much relevance. However, the circumstances surrounding the Plaintiff’seffortsin enforcing the Judgment and the Tracing Order are, in my view, relevant to sentencing. According to Ms Morgan (and this is not denied by Dr Goh), the Plaintiff made multiple demands for payment of the judgment sum which were ignored by Dr Goh; he did not even make any request for extension of time to make payment. This attitude continued even after the Tracing Order came into effect, and the Plaintiff sought to pursue it. Indeed, his conduct before the commencement of the contempt proceedings, in my view, suggests a rather cavalier attitude towards ORC 3219. 33 First, on 5 January 2020, 30 days after the Judgment of 5 December 2019, the Tracing Order came into effect. However, quite shortly after this, on 6 March 2020, Dr Goh filed the bankruptcy action in B 940 for him to be declared bankrupt. Whether or not this was specifically done to thwart the Plaintiff’s enforcement efforts is not necessarily the point. Dr Gohwouldhaveknown that it would affect their efforts. 34 Second, although he was adjudged a bankrupt on 19 March 2020, it was not until 17 April 2020 that the Plaintiff learnt of this, and it did so from a letter issued by the court,notDr Goh.29Foot Note 29×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 285 (bp), para 14.Indeed, SUM 1453 to pursue the Tracing Order was filed on 13 March 2020,afterDr Goh’s bankruptcy application. This had to be put on hold until the Plaintiff obtained leave of court on 9 June 2020 to proceed against Dr Goh in SUM 1453 as Dr Goh had, by then, been adjudged bankrupt. Dr Goh’s lack of initiative in keeping the Plaintiff updated about something as significant as his bankruptcy is, in my view, indicative of his lack of willingness to fully comply with ORC 3129 at this stage. 35 Third, in his application in B 940, Dr Goh declared that he had zero assets and total liabilities of $676,350 owing to unsecured creditors.30Foot Note 30×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at p 316 (bp).This was despite the fact that he had multiple bank accounts which he used to receive substantial sums of money over the years (as Dr Goh himself later disclosed during the Examination Proceedings),31Foot Note 31×Ms Morgan’s Affidavit (16 Apr 2021): PBOD (Vol 2) at p 715 (bp), para 13.including proceeds from the sale of his house at 36 Cove Way, Singapore 098272, and two motorcars. The house – at the time of his bankruptcy application – had only recently been sold to his wife for S$5.25m in April 2019,32Foot Note 32×Ms Morgan’s Affidavit (16 Apr 2021): PBOD (Vol 2) at pp 719–720 (bp), para 15(a).and the motorcars to undisclosed persons for a total of $310,000 in November 2019.33Foot Note 33×Dr Goh’s Statement of Affairs (6 Mar 2020) in HC/B 940/2020 at p 19. 36 Though Dr Goh claimed that some of this money had been expended on gambling debts, many of his explanations – given during the Examination Proceedings in April 2021 – were simply that he could not remember.34Foot Note 34×Ms Morgan’s Affidavit (16 Apr 2021): PBOD (Vol 2) at pp 717–720 (bp), paras 14–16.Not only was information about these sums of money not earlier volunteered in his July 2020 and August 2020 Affidavits, but the explanations Dr Goh also ultimately gave during the Examination Proceedings were still not particularly helpful to the Plaintiff, and further, not very reasonable in context. 37 Fourth, for the purposes of his B 940 application, Dr Goh also affirmed an affidavit on 6 March 2020, in which he stated that the cause of his insolvency was “business failure”. If, as he informed the court in the Examination Proceedings, he had lost all the monies in the HSBC-GZ Account to gambling losses, then the cause of his insolvency was certainly not “business failure”. Dr Goh attempted to explain in the Examination Proceedings that he had used the wrong words,35Foot Note 35×Ms Morgan’s Affidavit (16 Apr 2021): PBOD at p 776 (bp), lines 19–24.but it is somewhat difficult to believe that Dr Goh – an entrepreneurial medical doctor – did not appreciate the differences between legitimate business failure, and failing as a high roller. 38 Finally, as noted above, ORC 3129 was obtained on 22 June 2020 and it was served on Dr Goh by way of personal service on 25 June. Thereafter, he did not act with any degree of urgency, or with any real initiative. This was so much so that the Plaintiff had to sendsixreminders to Dr Goh, from 16 July to 24 September 2020,36Foot Note 36×Plaintiff’s Affidavit (10 Oct 2020): PBOD (Vol 1) at pp 288–297 (bp), paras 24–48.demanding full compliance with ORC 3129. However, as can be seen from [13] to [17] above, nothing meaningful was forthcoming from Dr Goh until the Examination Proceedings and the August 2021 Affidavit,afterthe Plaintiff filed its application for committal. The threat of sanction ought not to have been needed for Dr Goh simply to take more proactive steps towards complying with ORC 3219. 39 That said, an observation I make is that these contempt proceedings certainly have moved Dr Goh to provide, in that August 2021 Affidavit, a much fuller account of the proceeds than he had done on the mere order made by Woo J in ORC 3129. He provided more detailed information regarding the accounts and what he had done. He displayed urgency in writing to HSBC China to obtain information on the HSBC-GZ Account even though nothing of substance had – at the point of the Order – come back from the bank. 40 To his credit, he attempted to set out the actions he had taken to rectify his non-compliance, though, contrary to his submission,37Foot Note 37×Dr Goh’s Affidavit (16 Aug 2021): PBOD (Vol 2) at pp 545–552 (bp), paras 114–140.I did not find that he had yet purged himself of his contempt. To date, all Dr Goh has substantively stated is that he had gambled away the Funds, and to this end, he gave evidence that he was a high roller whose bets could go as high as S$750,000. This was not a satisfactory account, given: (a) that he only raised the claim that he was a gambler in the April 2021 Examination Proceedings; and (b) has not produced any evidence proving that he was in fact such a high rolling gambler. To accept that Dr Goh has discharged his obligations under the Tracing Order on the grounds of such bare assertions would fundamentally undermine the Plaintiff’s victory in the main action. 41 In connection, I note that the Plaintiff did not believe that Dr Goh had indeed lost the Funds in the HSBC-GZ Account to gambling, and was of the view that he was actively impeding her efforts to trace the Funds. This was not surprising, though, not a factor I thought appropriate to take into account for the purposes of sentencing given that it was not proven before me, even though the inference was strong. 42 That said, even if Dr Goh’s gambling explanation was to be taken at face value, he had still lied intwoaffidavits. Further, I found the particular manner in which he lied to be aggravating factors. It is difficult to prove a person is lying when he claims he cannot recall something, and a cynical resort to this device, which is clearly what Dr Goh had hoped to do, aggravates the fact that he had chosen to lie. As I have stated from [32] to [38] above, Dr Goh had displayed a cavalier attitude with sums in the tens of millions of dollars that he had caused the Plaintiff to lose. Not only did he refuse to cooperate, but he also chose to tell a deliberate lie in the July 2020 and August 2020 Affidavits in the face of a direct order of court, the effect of which was to delay the execution process and increase costs for the Plaintiff. This behaviour clearly called for punishment with a term of imprisonment. 43 Ms Morgan urged upon me to punish Dr Goh for contempt by ordering him to be imprisoned for no less than seven months,38Foot Note 38×PWS at para 106.based on a number of precedents.39Foot Note 39×PWS at paras 28–42.The primary difficulty I had with her submission, however, was that it seemed to require a contempt of greater severity. That is, one which would have required me to find not only that Dr Goh had lied in the July 2020 and August 2020 Affidavits in respect of his claims that he could not remember the “general event” of gambling, butalsothat he was either: (a) lying entirely about the fact that he had gambled away the Funds; or (b) lying about the fact that he could not recall the precise details of the payments out of the HSBC-GZ Accounts.40Foot Note 40×PWS at para 106(c).As stated at [41] above, though the inference in respect of (a) was strong, it was not one I found to have been proven. In relation to (b), it similarly cannot be said to have been proven. 44 Ms Morgan also highlighted the prejudice that the Plaintiff has suffered from Dr Goh’s non-compliance, that is, her inability to recover any of the Funds to-date.41Foot Note 41×PWS at para 106(a).I accept this to be the case. However, in my view, a sentence of seven months would cause even further delays to the accounting process. As I observed above, these contempt proceedings appear to have put some pep into Dr Goh’s step. Even if nothing meaningful has yet turned up, I can see that he has now applied effort towards complying with ORC 3219, albeit belatedly. 45 I am therefore of the view that a short and sharp seven-day period of imprisonment would be appropriate punishment for the contempt Dr Goh has displayed. This serves to impress upon him that his blatant lying in the face of a court order poses a serious obstruction in the administration of justice, and also to signal to him that he should henceforth make the fullest efforts to comply with the Tracing Order in ORC 3129. Any further failure to do so may visit upon him a further, more severe punishment for contempt. This is an objective which can be achieved without causing even further delay to the Plaintiff’s enforcement of the Tracing Order.",
        "Conclusion": "46 Upon the application of Dr Goh’s counsel, Mr Ng, I allowed Dr Goh to commence his sentence three weeks from the date of my Order,ie, 9 November 2021. Ms Morgan was agreeable to this postponement subject to the second defendant, Dr Goh’s daughter, standing as surety for him.42Foot Note 42×NEs 19 Oct 2021 at pp 39–43.The relevant surety documents were executed on 20 October 2020. 47 As an aside, I record that the Plaintiff indicated to me at the hearing on 19 October 2021, that she intended to seek costs against the second defendant as Dr Goh’s sponsor for these proceedings.43Foot Note 43×NEs 19 Oct 2021 at p 44, line 1 to p 47, line 17.The Order of Committal, HC/ORC 6109/2021, directed that costs be determined at a later date, but in light of the appeal, it is appropriate that costs for SUM 5041 be determined together with the costs for the appeal.   Lee Seiu KinJudge of the High Court Dierdre Grace Morgan and Yeow Ying Xin Madeline (Drew & Napier LLC) for the Plaintiff; Ng Lip Chih (Instructed), Rezvana Fairourse d/o Mazharedeen, and Lee Wei Jie (NLC Law Asia LLC) for the Defendants."
    }
}