{
    "case_title": "Muhammad Adam bin Muhammad Lee (suing by his litigation representatives Noraini binte Tabiin and Nurul Ashikin binte Muhammad Lee)vTay Jia Rong Sean",
    "ncitation": "[2021] SGHC 264",
    "coram": "S Mohan J",
    "sections": {
        "Introduction": "1 On 3 April 2015, the plaintiff, Muhammad Adam bin Muhammad Lee (“plaintiff”), was involved in a tragic car accident that changed the course of his life. 2 By way of a brief overview, the plaintiff was a pedestrian on a footpath along Hougang Avenue 2 outside Hougang Stadium when the defendant lost control of his car, mounted the kerb and knocked the plaintiff down.1Foot Note 1×Statement of Claim para 3; Defence para 2.The plaintiff suffered a multitude of severe and permanent injuries as a result of the accident and is now mentally incapacitated.2Foot Note 2×PCS para 2.1.He is represented in this action, HC/S 253/2018 (“Suit 253”), by his litigation representatives: his mother, Mdm Noraini binte Tabiin (“Mdm Noraini”); and his elder sister, Ms Nurul Ashikin binte Muhammad Lee (“Ms Ashikin”). The defendant’s insurers have conduct of the defendant’s case. Unless otherwise stated, all references to “plaintiff” and “defendant” in this judgment should henceforth be taken as a reference to the plaintiff’s litigation representatives and the defendant’s insurers, respectively. 3 On 2 May 2018, the defendant conceded 100% liability. Interlocutory judgment was entered by consent and for the plaintiff’s damages to be assessed. 4 The present case involves numerous heads of claim, almost all of which are disputed as between the parties. Having carefully considered the evidence and the parties’ submissions, I award the plaintiff damages in the sum of$2,186,182.40as tabulated at the end of this judgment at [305]. 5 In the following sections of this judgment, I shall consider the evidence and submissions on each head of damage claimed by the plaintiff and set out the reasons for my decision in respect of each of them.",
        "The plaintiff’s educational and vocational background": "6 The plaintiff was born on 6 September 1991. He was 23 years old when the accident occurred on 3 April 2015.3Foot Note 3×BAEIC Vol 1 p 36.He had completed his National Service not long before on 11 September 2014 and had served as a process technician in the technological department under the info-communications unit.4Foot Note 4×PCS para 3.3.He was also enrolled in Singapore Polytechnic’s Computer Engineering course which was due to commence in April 2015.5Foot Note 5×PBOD Vol 3 p 1126; BAEIC Vol 1 p 42.As a result of the accident, the plaintiff deferred commencing his studies in Singapore Polytechnic to February 2017. When he attempted to resume his studies, he was unfortunately unable to cope with the coursework and eventually dropped out of Singapore Polytechnic entirely. In April 2020, the plaintiff enrolled in Temasek Polytechnic but was also unable to cope. He subsequently withdrew from the course on 27 April 2020.6Foot Note 6×PCS para 3.4 – 3.5. 7 The subject of the plaintiff’s future employment prospects is a major point of contention in Suit 253. The defendant submits that the plaintiff will be able to regain employment and undertake “light jobs”. In contrast, the plaintiff takes the view that he can no longer work for the rest of his life as a result of his injuries. 8 What is uncontested is that the plaintiff is presently unemployed. His sister, Ms Ashikin, testified that in 2017 the plaintiff had tried to work at a bubble tea shop (“BBT shop”) in Hougang located on the ground floor of the block of flats where they used to live. However, he only lasted three days before being asked to leave, ostensibly because he was deemed to be too slow in carrying out the work assigned to him.7Foot Note 7×PCS paras 3.7 – 3.8; NE 11 Nov 2020 37:11 – 32, 43:8 – 29. 9 Prior to the accident, the plaintiff had completed a course in Chemical Process Technology (Pharmaceuticals) on 22 December 2009 in ITE and a course in Electronics Engineering in Higher NITEC on 28 March 2012.8Foot Note 8×PCS para 3.1.In relation to the latter course, the plaintiff exhibited a testimonial written by his lecturer, Mr William Siew dated 17 April 2012. There, Mr Siew observed that the plaintiff “has done very well for his course of study … and obtained a very good Grade Point Average of 3.489, out of a maximum of 4.0”. Mr Siew also stated that “[the plaintiff] is likely to succeed in whatever career he chooses”.9Foot Note 9×PBOD Vol 3 p 1102 – 1103. 10 The plaintiff had also completed internships with Pfizer Asia Pacific Pte Ltd from October 2008 to May 200910Foot Note 10×PBOD Vol 3 p 1109.and Hyper Communications Pte Ltd from October to December 2011.11Foot Note 11×PBOD Vol 3 p 1121.More recently, he worked as a temporary staff at Singapore Press Holdings as a Customer Service Officer.12Foot Note 12×PBOD Vol 3 p 1122.",
        "The plaintiff’s injuries and medical history": "11 After the accident, the plaintiff was rushed to Tan Tock Seng Hospital (“TTSH”) and was hospitalised for approximately four and a half months from 3 April to 14 August 2015. 12 A medical report by Dr Vincent Ng Yew Poh (“Dr Ng”) dated 21 October 2015 stated that upon arrival at TTSH,13Foot Note 13×PBOD Vol 1 p 196 – 197.the plaintiff’s vital signs were unstable and he was unresponsive with a score of 5 on the Glasgow Coma Scale (“GCS”). The GCS is a scale that measures a patient’s consciousness – it ranges from 3 to 15, with 3 being the lowest possible level of consciousness and 15 being full consciousness. The plaintiff’s Computed Tomography head scan revealed multiple skull fractures, brain contusions and a large left frontal-parietal extradural haemorrhage. He also had multiple facial fractures, and a left proximal femur fracture. 13 During his prolonged hospital stay, the plaintiff underwent numerous medical and surgical procedures. He suffered episodes of fever and bacterial infection and even developed hydrocephalus (ie,an abnormal build-up of fluid in the cavities deep within the brain).14Foot Note 14×PBOD Vol 1 p 196 – 197.His neurological recovery during the stay was assessed by Dr Ng to be “slow and gradual”. 14 The plaintiff was subsequently treated and/or assessed by a slew of doctors and other medical professionals. I lay out the most relevant reports below: (a) Dr Simon Collinson’s report dated 22 November 2015 containing a neuropsychological assessment of the plaintiff and follow-up report dated 3 November 2018. (b) Dr Chan Lai Gwen’s report dated 2 December 2015 on the plaintiff’s mental capacity, her reassessment report dated 8 July 2016 and updated medical report dated 25 September 2020. (c) Dr Karen Chua’s report dated 17 May 2016 and follow-up reports dated 12 September 2018, 3 March 2020 (wrongly dated 3 February 2020)15Foot Note 15×NE 25 Nov 2020 3: 6 – 8.and 30 March 2020 on the plaintiff’s rehabilitative progress. (d) Dr Calvin Fones’ report dated 17 January 2018 and his follow-up report dated 10 February 2020 on the plaintiff’s mental capacity and his diagnoses of Major Neurocognitive Disorder due to Traumatic Brain Injury (“TBI”) with behavioural disturbances, Major Depressive Disorder and Persistent Depressive Disorder. (e) Dr K Kannan’s orthopaedic report dated 3 February 2020. (f) The Occupational Therapy Function Evaluation report prepared by Mr Sudev Sreedharan and Ms Sharon Seah, consultant occupational therapists at OzWorks Therapy Pte. Ltd., dated 1 February 2019 (“OzWorks Report”). (g) The physiotherapy report prepared by Mr John Abraham, physiotherapist at Rapid Physiocare Pte Ltd (“Rapid Physiocare”) dated 26 November 2019. 15 The contents of these various reports will be discussed in greater detail below.",
        "General damages": "16 Compensatory damages for personal injuries are of two types, general and special. General damages have two major components: (a) pain and suffering and loss of amenity; and (b) post-trial pecuniary loss such as the loss of future earnings. Special damages refer to pre-trial pecuniary loss and include: (a) pre-trial out-of-pocket expenses such as medical, nursing and supportive care, transportation and household expenses; and (b) pre-trial loss of earnings or profits. 17 The aim of an award of damages is, as far as money can accomplish, to restore a plaintiff to the same position as if the tortious wrong had not been committed:Lua Bee Kiang (administrator of the estate of Chew Kong Seng, deceased) v Yeo Chee Siong[2019] 1 SLR 145 (“Lua Bee Kiang”) at [9].",
        "Pain and suffering": "18 “Pain and suffering” refers to the physical pain, emotional and intellectual suffering arising from the injury (Au Yeong Wing Loong v Chew Hai Ban and another[1993] 2 SLR(R) 290 at [11]), while “loss of amenity” refers to the loss of the ability to enjoy life to its fullest (Halsbury’s Laws of Singapore – Civil Procedure, vol 4(LexisNexis, 2016 Reissue) at para 50.387. Whether there is loss of amenity is an objective fact that does not depend on an appreciation of the loss by the victim:Tan Kok Lam (next friend to Teng Eng) v Hong Choon Peng[2001] 1 SLR(R) 786 at [28]. 19 Where non-pecuniary loss – such as pain and suffering and loss of amenity – is concerned, the guiding principle is that of “fair compensation”. This means that compensation ought to be reasonable and just, and need not be “absolute” or “perfect”:Lua Bee Kiangat [9]. 20 There are two methods for determining what is “fair compensation”. The first is the component method, by which the loss arising from each item of injury is individually quantified and then added up to estimate the overall loss that the claimant has suffered. The second is the global method, by which all the injuries sustained by the claimant are considered holistically to arrive at an estimation of his overall loss:Lua Bee Kiangat [10]. 21 The principle behind the component method is that damages should be awarded for losses that may properly be regarded as distinct or discrete. However, a concern regarding the component method is that the overall quantum must be a reasonable sum that reflects the totality of the claimant’s injuries. This latter point is the principle which animates the global method. The two methods are complementary rather than mutually exclusive because they are simply different practical modes of producing a fair estimate of the claimant’s loss. The application of both methods may proceed in two stages (Lua Bee Kiangat [11]–[13]): (a) First, the court should apply the component method to ensure that the loss arising from each distinct injury suffered is accounted for and quantified. (b) Second, the court should apply the global method to ensure that the overall award is reasonable and neither excessive nor inadequate. The global method can thus be said to be a tool to assist in stress testing the amounts awarded by the court under the component method and where necessary, to make adjustments accordingly. 22 The plaintiff’s claim for pain and suffering damages can broadly be broken down into five categories of injuries: (a) TBI; (b) facial fractures; (c) lung injuries; (d) lower limb injuries; and (e) multiple bruises and fractures. As tabulated below, the plaintiff claims a total of $343,000.16Foot Note 16×PCS p 92 (items A1 to A5).In contrast, the defendant submits that the sum should be $153,000 with a discount of 25% (ie,approximately $115,000 after applying the discount).17Foot Note 17×DCS paras 73, 97 and 185; DRS para 13. DamagesPlaintiff’s positionDefendant’s positionTBI$      250,000.00$ 125,000.00Facial Fractures$        35,000.00$                  -Lung Injuries$        10,000.00$                  -Lower Limb Injuries$        45,000.00$   25,000.00Multiple Bruises and Lacerations$          3,000.00$     3,000.00Total$ 343,000($153,000 x 75%)≈ $115,000 Stage 1: The individual components (1) TBI 23 Taking guidance from the Court of Appeal’s decision inChai Kang Wei Samuel v Shaw Linda Gillian[2010] 3 SLR 587 (“Samuel Chai”) at [48]–[49], both parties analyse the plaintiff’s claim for TBI with reference to three domains: structural, psychological and cognitive. In line with the Court of Appeal’s comments inLua Bee Kiangat [15],the parties made extensive reference to Charlene Cheeet al,Guidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010)(“2010 Guidelines”) in deriving their proposed awards to compensate for the plaintiff’s injuries. Even then, they have arrived at significantly different figures. 24 For ease of reference, their respective positions on the damages for TBI are tabulated as follows: Damages for TBIPlaintiff’s positionDefendant’s positionStructural$75,000$45,000Cognitive$160,000$80,000Psychological/Psychiatric$50,0000Aggravated$10,0000Total$295,000$125,000Final figure$250,000 (discounted by approx. 16% for overlapping injuries)$93,750 (discounted by approx. 25%) 25 The plaintiff submits that he should be entitled to $75,00018Foot Note 18×PCS para 2.72.for his structural injuries (ie,the highest award in the “Severe” category for skull fractures in the 2010 Guidelines) as the accident caused him to suffer: (a) skull fractures which resulted in serious complications in the form of extradural haematomas and contusions of the brain;19Foot Note 19×PCS para 2.66.(b) bone depression due to his decompressive craniectomy surgery;20Foot Note 20×PCS para 2.68.and (c) scars from surgery.21Foot Note 21×PCS para 2.69. 26 He separately claims $160,000 for cognitive injuries (ie,the highest value in the range for “Moderately severe brain damage” in the 2010 Guidelines). The plaintiff has been diagnosed with Major Neurocognitive Disorder due to TBI and now suffers from numerous residual cognitive disabilities. He is mentally incapacitated and is unable to live independently, continue his education or work. Since the time of the accident, he has made a “slow and gradual neurological recovery” and has thus fallen out of the “Very severe brain damage” category. Having regard to precedents such asLua Bee KiangandLee Wei Kong (by his litigation representative Lee Swee Chit) v Ng Siok Tong[2012] 2 SLR 85 (“Lee Wei Kong”), the plaintiff submits that his injuries surpass those of the claimants in the precedents, and he should therefore be entitled to an award in the highest range of the “Moderately severe brain damage” category.22Foot Note 22×PCS paras 2.90 – 2.92. 27 The plaintiff also claims $50,000 for psychiatric injuries (ie,at the higher end of the “Severe” range for general psychiatric disorder in the 2010 Guidelines).23Foot Note 23×PCS paras 2.93 – 2.98.This is on the basis that his prognosis is poor and the behavioural changes (eg,violence towards his family members) are permanent. 28 I pause to flag that there appears to be some confusion on the part of plaintiff’s counsel as to whether the plaintiff falls within the “Severe” range or in between the “Severe” and “Moderately severe” ranges for general psychiatric disorder, asbothranges are put forward in the plaintiff’s closing submissions at paragraphs 2.93 and 2.94. Given that the plaintiff eventually put forth a claim for $50,000 for psychiatric injuries, it would appear that the position ultimately taken is that the plaintiff falls within the “Severe” range. 29 The plaintiff claims a further $10,000 as aggravated damages in relation to his psychiatric conditions. This is on the basis that the defendant has behaved in an exceptional and contumelious manner by: (a) arranging for private investigators who took videos of him in the privacy of his own home which captured him in a state of undress (ie,topless); (b) conducting an interview with him on the pretext of doing a survey; and (c) making a last minute application for leave to call the plaintiff as a witness to give evidence.24Foot Note 24×PCS paras 2.99 – 2.121. 30 Totalling up the amounts claimed above (ie,$75,000 + $160,000 + $50,000 + $10,000 = $295,000), the plaintiff submits that “considering overlapping”, a reasonable global award would be $250,000 after applying a 16% discount.25Foot Note 25×PCS paras 2.123 – 2.124. 31 The plaintiff highlights that as the defendant had dispensed with the attendance of all of the plaintiff’s doctors from the neurosurgery department, all of their reports are unchallenged. Further, the defendant had not arranged for the plaintiff to be medically re-examined for any of the injuries sustained.26Foot Note 26×PCS para 2.10. 32 As for the defendant, it submits that a sum of $45,000 is appropriate compensation for the plaintiff’s structural injuries (ie,at the higher end of the “Moderate” range for skull fractures in the 2010 Guidelines). This is largely on the basis that his structural injuries were more serious than those inSamuel Chaifor which an award of $29,000 was given.27Foot Note 27×DCS paras 75 – 79. 33 The defendant further avers that a sum of $80,000 is reasonable in respect of the plaintiff’s neurocognitive injuries (ie,at the lowest end of the range under “c(i)” for “Moderate brain damage” in the 2010 Guidelines).28Foot Note 28×DCS paras 80 – 82. 34 The defendant does not dispute that the plaintiff suffers from Major Depressive Disorder or Persistent Depressive Disorder (respectively, “MDD” and “PDD”). However, it denies the existence of any violent outbursts from the plaintiff because there is no documentary evidence of it, save for the family’s “subjective reporting”.29Foot Note 29×DCS para 59(c).In any event, it avers that no damages should be awarded for psychiatric damage as the plaintiff’s violent outbursts and psychological/psychiatric injuries were not caused by the accident or the defendant. Instead, they were caused by the actions of his family members or some other factors unrelated to the accident.30Foot Note 30×DCS paras 83 – 87.More specifically, the defendant posits that the outbursts were caused by the “excessive management and supervision” by the family and/or their refusal to give him medication.31Foot Note 31×DCS para 65.It also denies any causal link between the accident and the plaintiff’s “belated claim for aggravated damages”. (A) Analysis and decision on structural injuries 35 Structural injuries fall within the specialisation of neurosurgeons and includes brain oedema, subdural, extradural subarachnoid haematoma, brain contusion and loss of consciousness:Samuel Chaiat [48]. 36 The 2010 Guidelines state as follows: J. SKULL (a) Fracture The quantum of the award depends on whether serious complications arise as a result of the fractured skull,eg, epidural haematomas, swelling of the brain, laceration of the brain from the broken skull fragments,etc. In less serious cases, the person suffers only from a hairline fracture of the skull and achieves full recovery with minimal, if any residual disabilities. (i) Severe fracture$50,000–$75,000 The injured person suffers from compound fractures of the skull and the skull fragments have lacerated the brain, resulting in serious brain injury. Haematomas following the fracture of the skull resulting in severe brain injury also fall into this category. (ii) Moderate fracture$30,000–$50,000 The severity of the cases in this category is less than that of (a)(i) above but there is extensive surgery done to repair the skull fracture with a long recovery period. The higher end of the range of the award is appropriate where there are complications arising during the recovery period,eg, further surgery to relieve brain pressure,etc. (iii) Minor fracture$20,000–$30,000 Cases in this category include those where the injured person suffers from a hairline fracture of the skull which does not result in severe consequences. Conservative treatment is needed and there are few, if any, residual disabilities in the long run. 37 The dispute between the parties lies in whether the plaintiff falls within the “Severe” or “Moderate” category for skull fracture. The indicative range for damages is therefore between $45,000 and $75,000. 38 In my judgment, the plaintiff falls within the “Severe” category given his myriad injuries and the multifarious procedures that he had to undergo in the aftermath of the accident as detailed in Dr Ng’s report dated 21 October 2015.32Foot Note 32×PBOD Vol 1 pp 196 – 197.The plaintiff endured: (a)Multiple skull fracturesin the left zygomatic arch (ie,the cheekbones), fossa of the left temporal mandibular joint (ie,the joint connecting the lower jaw to the skull), greater wing of left sphenoid extending to body of sphenoid and walls of left sphenoid sinus (ie,the area around the nose) and fractures of the left frontal and squamous part of the temporal bone (ie,the lower portions of the skull around the ears). (b)A large left frontal-parietal extradural haemorrhage (ie,thecollection of blood in the potential space between the skull and the dura, the latter being the outermost of the three membranes covering the brain and spinal cord). (c) A recovery period ofapproximately fourand a half monthsgiven that the plaintiff was only released from TTSH on 14 August 2015. (d)Complications which had arisen during the recovery period– namely, the development of hydrocephalus. 39 The plaintiff had to undergo a left decompressive craniectomy and evacuation of extradural haematoma, and insertion of an intracranial pressure monitor on the day of the accident. Further surgeries were also necessary, including but not limited to: (a) on 9 April 2015, a thigh wound debridement; (b) on 16 April 2015, an open reduction and internal fixation of fracture and wound closure; (c) on 4 July 2015, to insert a programmable ventriculoperitoneal shunt (ie,a cerebral shunt to drain cerebrospinal fluid causing hydrocephalus); and (d) on 11 July 2015, to repair his skull defect. 40 In my judgment, an award of$65,000would be appropriate for the plaintiff’s structural injuries (ie,towards the upper end of the “Severe” range). The plaintiff’s skull fractures were extensive, spanning the lower to middle portions of the skull. He presented at TTSH with large patches of bleeding in his skull and subsequently suffered a serious complication in the form of hydrocephalus. Follow-up surgeries were also necessary during his long recovery period. The plaintiff continues to suffer from bone depression as a result of his decompressive craniectomy surgery on 3 April 201533Foot Note 33×PCS para 2.68.and has also been left with large scars on his head.34Foot Note 34×PCS para 2.69. 41 A rare example of a case which specifically elucidates the considerations behind a component award for structural injury to the brain isLua Bee Kiang.There, the plaintiff suffered multiple facial fractures and injuries, including a 10cm forehead laceration, zygomatic arch fractures, sinus fractures, extensive hemosinus (ie,breakage in the walls of the sinus) and complex facial fractures. He also suffered blunt force trauma injury to his right eye. Further, the defendant inLua Bee Kiangdid not dispute that the plaintiff had suffered skull fractures in the “Moderate” range for the purposes of the 2010 Guidelines. The Court of Appeal did not think that $40,000 was inappropriate based on the 2010 Guidelines (albeit that this was prior to accounting for overlapping facial injuries) (at [33]–[34]). 42 In this case, the plaintiff’s injuries are far worse given that he suffered complications post-accident and had to undergo repeat surgeries. Even without accounting for those, the fact that the plaintiff also sustained alargeextradural haemorrhage places him in a far worse position than the plaintiff inLua Bee Kiang. Therefore,$65,000would be appropriate for structural injuries. (B) Analysis and decision on psychological injuries 43 Psychological injuries fall within the specialisation of psychiatrists and include depression, mood swings, anger and anxiety:Samuel Chaiat [48]. 44 I do not think it can be disputed that, beginning from 2018, there were episodes in which the plaintiff was violent towards his family members.35Foot Note 35×NE 10 Nov 2020 9:16-21, 10:4 - 9.The mere fact that those episodes are based off the family’s reporting is not objectionable in and of itself – most of the episodes occurred in private at home and the plaintiff (lacking mental capacity) is unlikely to have the presence of mind to report or make a note of them himself. These outbursts and aggressive tendencies are recorded in various reports (seeeg,Dr Collinson’s follow-up report dated 3 November 2018 at para 3.236Foot Note 36×PBOD Vol 1 p 274.and Dr Fones’ report dated 10 February 2020 at paras 3 and 437Foot Note 37×PBOD Vol 1 p 429 – 430.). His family members were also able to provide coherent and vivid descriptions of how, where and when some of the most severe episodes occurred in their testimony – I highlight, for example, Ms Ashikin’s account of the plaintiff’s angry outburst targeted at Mdm Noraini during the family’s Hajj pilgrimage to Saudi Arabia in her Affidavit-of-Evidence-in-Chief (“AEIC”) dated 18 November 2019 at para 3738Foot Note 38×BAEIC Vol 1 pp 30 – 31 [Ms Ashikin’s AEIC para 37].which was consistent with her account under cross-examination39Foot Note 39×NE 10 Nov 2020 11:8 – 12:7; 12 Nov 2020 26: 6 – 27:13.and corroborated subsequently by Mdm Noraini’s account.40Foot Note 40×NE 12 Nov 2020 p 101:17 – 32.Having seen and observed them on the stand, I saw no reason to disbelieve their evidence regarding the outbursts by the plaintiff. 45 I reject the defendant’s case theory that the family had somehow been responsible for the psychiatric injuries suffered by the plaintiff or had exacerbated them by being overprotective of or depriving him of “alone time”41Foot Note 41×NE 10 Nov 2020 71: 1-20. The theory is unsupported by evidence, particularly expert evidence, and conveniently ignores the fact that these signs of psychiatric injury only began manifestingafterthe accident.42Foot Note 42×PBOD Vol 1 p 430.Crucially, as stated in Dr Collinson’s follow-up report dated 3 November 2018, these episodes were consistent with the behavioural symptoms associated with TBI, namely,“angry outbursts, emotional overreaction, physical and verbal abuse, and impulsiveness particularly when agitated”.43Foot Note 43×PBOD Vol 1 p 271 para 1.6.In contrast, the defendant offered no contrary evidence. 46 Given that the defendant’s argument is essentially oncausation, there is no analysis in its submissions on quantum and it also accepts the diagnosis of MDD and PDD as put forth by the various doctors. Separately, I harbour some reservations as to whether the defendant should even be permitted to challenge causation at the stage of assessment of damages when it has already conceded full liability on 2 May 2018. In this regard, I have in mind the Court of Appeal’s recent reiteration inTan Woo Thian v PricewaterhouseCoopers Advisory Services Pte Ltd[2021] 1 SLR 1166at [7] that causation is a matter going towardsliability(and not quantum) in that it is a critical element which must be proved before the tort of negligence is made out in the first place. Quite apart from this, the key point here is that even theplaintiff’sclaimed figure of $50,000 cannot simply be accepted without analysis. Therefore, in the ensuing paragraphs, I take some time to lay out the evidence of the plaintiff’s doctors. 47 Dr Fones, the plaintiff’s psychiatrist, opined in his follow-up report dated 10 February 2020 that the plaintiff suffers from MDD of moderate severity as characterised by persistent low mood accompanied by insomnia alternating with hypersomnia, low energy/fatigue, low self-esteem and feelings of hopelessness. Given that this has persisted for more than two years, the plaintiff is now diagnosed with PDD.44Foot Note 44×PDBO Vol 1 p 430.There are also assorted behavioural changes associated with the plaintiff’s TBI. I will deal with the plaintiff’s behavioural changes under cognitive impairments as these are explicitly contemplated in the 2010 Guidelines as a way to estimate damages for brain damage. To remove this first degree of overlap, I focus only on the plaintiff’s diagnosis of MDD and PDD in this section. It should also be noted that there are clear overlaps betweenthe effectsof MDD, PDD and the plaintiff’s behavioural changes – a point which the plaintiff concedes in his closing submissions at para 2.46. This second degree of overlap will be returned to under Stage 2 (see [104] below). 48 As the plaintiff’s court-appointed psychiatrist who focussed on treating his PDD, Dr Fones’ follow-up report dated 10 February 2020 is of especial significance. Dr Fones found that:45Foot Note 45×PBOD Vol 1 pp 429 – 432. (a) If the plaintiff’s PDD is left untreated, it will interact with his Neurocognitive Disorder, further compounding his behavioural problems and disabilities. (b) The chronic nature of the plaintiff’s depression which has developed into PDD “is more amenable to treatment and improvement. However the long-standing nature of his physical and social difficulties are negative prognostic factors for improvement in his mood state”. (c) The plaintiff’s disabilities do not affect his basic activities of daily living (eg,bathing and eating). However, his ability to carry out important tasks which are fundamental for independent living has been substantially affected. (d) He is unable to handle money or manage finances beyond small sums (ie,less than $100). He is unable to travel independently beyond the immediate proximity of his home and unable to manage on his own with regards to cooking/nutrition, health care and ensuring personal safety and security. (e) By extension, the plaintiff would be unable to hold down a job. 49 Dr Fones prescribed anti-depressant medication to the plaintiff, and referred him to a clinical psychologist for therapy and counselling. 50 There are some indications that Dr Fones’ observations at [48(d)] may have been overly dire. I say this because the defendant’s private investigators obtained video footage of the plaintiff being able to leave his flat in Hougang, take different modes of public transport and navigate on his own (including a trip from home to TTSH for one of his medical appointments and back),46Foot Note 46×DCS p 11, para 10 – 13.purchase food and other items on his own and answer interview questions during a mock survey. It is therefore apposite to also have regard to the opinions of two other doctors. 51 First, Dr Chua, a senior consultant at TTSH’s department of rehabilitation, assessed the plaintiff at around the same time and detailed the following findings in her report dated 3 March 202047Foot Note 47×PBOD Vol 1 p 425 – 428.and her clarification letter dated 30 March 2020:48Foot Note 48×PSBOD  p 1513 – 1515. (a) The plaintiff reported that he was independent in self-care activities of daily life (“ADL”), able to plan his daily home routine, cook simple meals and perform his gym routine independently. Dr Chua added in her clarification letter that the plaintiff had informed his clinical psychologist that he was able to use Google maps to navigate in unfamiliar places. (b) The family reported that he was independent in taking public transport on his own on familiar routes without aid. (c) According to his family members, problems of domestic violence, frequent anger episodes and physical aggression towards them were reported since 2018 and worsened in the past six months. (d) The plaintiff’s depression screening scores were elevated during the session and Dr Chua referred the plaintiff back to his psychologist for anger management and family counselling. (e) While he currently does not need a long term carer for his ADL, there needs to be a supervisor for his instrumental ADLs and oversight of his social behaviour when he is outside the safety of his home. (f) In terms of readiness or fitness to return to work for gainful employment, this would be daunting. Dr Chua added subsequently that the plaintiff would “face immense difficulty with employment” in her clarification letter. (g) In 2018, there were behavioural issues with impulsivity, episodic dyscontrol, anger, emotional overreaction, aggression towards his mother requiring hospitalisation. These instances were documented three to four times a year. 52 Dr Chua prescribed a low dosage of anxiety and depression medication to the plaintiff on 6 March 2020.49Foot Note 49×PCS para 2.50. 53 Second, Dr Chan, a consultant with TTSH’s department of psychological medicine, prepared an updated medical report of the plaintiff’s psychiatric illnesses dated 25 September 2020. She was of the view that the plaintiff would require “lifelong supervision for activities of daily living”. Further, in her opinion, the diagnosis of Major Neurocognitive Disorder due to TBI with behavioural disturbance “better accounts for Adam’s current condition than the diagnoses of [MDD] and/or [PDD]”.50Foot Note 50×PBOD Vol Supp p 1525.By this, Dr Chan clarified that she was not denying that the plaintiff has depression. Rather, what she meant to convey was that the plaintiff has more than just depression.51Foot Note 51×NE 24 Nov 2020 63:12-21. 54 The relevant sections of the 2010 Guidelines state as follows: A. GENERAL PSYCHIATRIC DISORDERS This section covers psychiatric conditions not provided for specifically in the sections below. There is a myriad of psychiatric conditions that could result from experiencing a traumatic event,eg, depression, avoidant phobias, anxiety attacks,etc. They range in severity too, with the most severe psychiatric conditions debilitating a person to the extent he is unable to cope with the activities of daily life. The factors to be taken into account in valuing claims of this nature are as follows: (i) The person’s ability to cope with life and work in general as compared to his pre-trauma state; (ii) The effect on the person’s relationships with the family, friends and those with whom he or she comes into contact with; (iii) Whether the person is suicidal as a result of his psychiatric condition; (iv) Whether medical help has been sought; (v) The extent to which treatment would be successful; (vi) The extent to which medication affects the person’s work and social life; (vii) Whether the person adheres faithfully to counselling sessions and takes his or her medication; (viii) The risk of relapse in the future; and (ix) The chances of recovery in the future. (a) Severe                    $25,000–$55,000 The person suffers from marked problems with respect to factors (i) to (vi). Despite treatment, the prognosis remains very poor as the person is unlikely to be able to return to employment permanently or even take charge of his daily affairs. (b) Moderately severe   $8,000–$25,000 There are significant problems associated with factors (i) to (vi) above but the prognosis will be much more optimistic than in (a) above. However, the person may still have long-term problems coping with stressors of work life and the demands of social life thus preventing a return to pre-trauma employment. He is however, able to perform the activities of daily life independently. [emphasis in original] 55 In my judgment, the plaintiff falls within the “Moderately severe” category and a reasonable award is$20,000. Given Dr Chan’s opinion that the majority of the plaintiff’s symptoms can be explained better by the behavioural changes associated with TBI, the harm caused to the plaintiff by PDD or MDD is likely to be less significant. As Dr Fones stated in his report dated 10 February 2020, the prognosis for them is also more optimistic because depression is more amenable to treatment than behavioural changes. Further, while the plaintiff has had violent outbursts and emotional episodes that have undoubtedly taken a toll on his relations with his family, these occur infrequently at a rate of approximately three to four times a year.52Foot Note 52×PBOD Vol 1 p 426.It is also important to consider that the plaintiff’s condition has improved markedly since the plaintiff started taking medication. In fact, Ms Ashikin recounted that there have been “no recent violent [sic] towards any family members”.53Foot Note 53×NE 10 November 2020 74:11-12.Thus, this factor while present, is not currently prominent. While the plaintiff has expressed suicidal thoughts to his father,54Foot Note 54×NE 13 Nov 2020 p 113:16.this aspect does not appear at all in the most recent report by Dr Chan, nor does it appear to have been remarked upon much by the experts. I therefore reach the conclusion that suicidal ideation does not feature greatly as part of the plaintiff’s psychological injuries. 56 Nonetheless, an award at the higher end of the “Moderately severe” range is warranted as the plaintiff’s ability to work and cope with life has been adversely affected to a significant degree when compared to his pre-trauma state. While he is able to carry out basic ADL on his own, cook simple meals, navigate and travel unsupervised on familiar routes, the relevant doctors are unanimous in their opinion that the plaintiff requires at least some degree of supervision in his daily life and will find it difficult to find a job in the future. I return to this latter point below at [74]. 57 To sum up, I hold that a reasonable award for the plaintiff’s psychological injuries is$20,000. (C) Analysis and decision on cognitive impairments 58 Cognitive impairments fall within the specialisation of clinical psychologists and include loss of spatial, visual, long and short term memory, intellect (in terms of Intelligence Quotient (“IQ”)) and learning ability:Samuel Chaiat [48]. 59 The defendant agrees that the plaintiff should receive damages for his neurocognitive injuries. It submits that the plaintiff is at the lowest point under “c(i)” in the “Moderate brain damage” category in the 2010 Guidelines,55Foot Note 55×DCS paras 80 - 81.while the plaintiff claims that he is at the highest end of the “Moderately severe brain damage” category.56Foot Note 56×PCS paras 2.76 and 2.92The range is therefore from $80,000 to $160,000. 60 The relevant portions of the 2010 Guidelines state as follows: (b) Moderately severe brain damage      $120,000–$160,000 Cases falling under this category include injured persons who are, although more aware of their physical environment than those in (a) above [ie,Very severe brain damage], still have severe physical and cognitive limitations such that there is heavy reliance on care-givers for constant care. The GCS may be between 8–10. This category also includes persons whose intellect and personality undergo a significant change subsequent to the injuries sustained. The quantum of the award will be affected by the following factors: (i) the degree of awareness of the physical environment and response to stimuli; (ii) life expectancy; (iii) the extent of physical limitations; (iv) the degree of dependence on others for activities of daily living; (v) significant cognitive impairment and personality change (with associated behavioural problems); and (vi) epilepsy or a significant risk of epilepsy. (c) Moderate brain damage This category is distinguished from (b) above by the fact that the degree of dependence on care-givers is significantly lower and the person is able to perform simple tasks of daily life. The GCS scale may be between 9–12. (i) Moderate to severe cognitive impairment with accompanying personality change resulting in behavioural problems, a reduced awareness of danger present in the physical environment, reduced sight, speech and sensory abilities with a significant risk of epilepsy and no prospect of employment.$80,000–$120,000. (ii) Moderate to modest cognitive impairment – the person’s chances of competing in the job market with other able-bodied persons is significantly reduced and there is some risk of epilepsy.$50,000–$80,000 (iii) Able to perform the activities of daily life competently with minimal or no dependence on others but concentration and memory are affected, such that the ability to work is reduced and there is a small risk of epilepsy.$25,000–$50,000 [emphasis in original] 61 The various experts of the plaintiff are largely in agreement that the plaintiff’s main diagnosis is Major Neurocognitive Disorder due to TBI with behavioural disturbance.57Foot Note 57×PSBOD  p 1527 – 1528 [Dr Fones’ report dated 26 Oct 2020]; p 1523 – 1526 [Dr Chan’s report dated 25 Sept 2020]; PBOD Vol 1 p 274 [Dr Collinson’s report dated 3 Nov 2018].The plaintiff’s cognitive impairments are serious and extensive, spanning multiple cognitive domains. Dr Collinson, his neuropsychologist, assessed him in 2015 and found that the plaintiff has:58Foot Note 58×PBOD Vol 1 p 204. global cognitive deficits … [which] consist of generalized decline in intellectual ability affectingall domainsincluding core language comprehension and speed of language comprehension, non-verbal (visuo-perceptual) organisation, working memory and general processing speed. In addition [the plaintiff] has asevere amnestic disorderaffecting both verbal and non-verbal memory processing. He hassevere higher order deficitsin the areas of verbal generation, concreteness, inhibition and elements of planning. [emphasis added] 62 Upon reassessment in 2018, Dr Collinson found the plaintiff’s IQ to be between the 2nd to 8th percentile in the population and that:59Foot Note 59×PBOD Vol 1 p 274. [The plaintiff] shows no significant improvement from theglobal cognitive deficitsthat were recorded in 2015. These include; a generalised decline in intellectual ability affecting all domains including core language and speed of language comprehension, non-verbal (visuo-perceptual) organisation, and working memory. He continues to demonstrate a severe amnestic disorder affecting both verbal and non-verbal memory modalities. He has significant higher order deficits. [emphasis added] 63 Despite rigorous cross-examination by Mr Anthony Wee, counsel for the defendant, Dr Collinson maintained his position that the plaintiff’s cognitive impairments are “pretty widespread” and that “he’s impaired in every area I tested him” although he agreed that the plaintiff was more severely affected in some areas than others.60Foot Note 60×NE 24 Nov 2020 117:6 – 23, 119:14 – 26.Dr Collinson’s views are corroborated by Dr Fones who observed in para 3 of his report dated 10 February 2020 that the plaintiff’s TBI has resulted in “a range of cognitive deficits. He continues to have deficits in the domains of complex attention, executive ability, learning and memory. He also has slowing in his speed of information processing and has difficulties in social cognition”.61Foot Note 61×PBOD Vol 1 pp 429 – 430. 64 Manifestations of these cognitive effects include difficulties with managing financial transactions and calculations. As reported by Dr Chua in her report dated 3 March 2020, mental calculations involving more than two digits are challenging for the plaintiff.62Foot Note 62×PBOD Vol 1 p 427.In a related vein, Dr Fones observed in his report dated 10 February 2020 that the plaintiff is unable to handle money or manage finances beyond small sums.63Foot Note 63×PBOD Vol 1 p 431. 65 Furthermore, behavioural and personality changes have been observed in the plaintiff over the years. In his report dated 10 February 2020, Dr Fones observed at paras 3–4 that: 3 … Emotionally, his condition [ie,TBI] has led to irritability and easy frustration, experiencing tension/anxiety and affective (mood) liability. 4 Personality changes he has developed include apathy, suspiciousness and aggression. He has become paranoid and suspicious to the point of being fearful of going out and talking to others ever since he found out that he had been subject to private investigators’ surveillance. The lack of emotional control has manifested in verbal and sometimes, physical aggression directed at the family members. The physical violence has even escalated to the point of causing injury to his family members. These factors have compounded his ongoing difficulties with relationships, independent living and self-care. As mentioned above (at [44]–[45]), I do not think that the defendant can plausibly deny that the plaintiff has had angry and violent outbursts, or that these are causally related to the accident. Dr Chua has also documented that such instances did occur, at one point, three to four times each year (see above at [51(g)]). 66 The doctors have also observed that the plaintiff’s cognitive recovery has plateaued and that he is unlikely to see significant improvement.64Foot Note 64×PRS para 1.10.Dr Fones stated at para 48 of his report dated 17 January 2018 that “[t]he prolonged and persistent nature of the cognitive deficits arising from the severe TBI would be unlikely to improve now, some 2 years and 9 months after the accident”.65Foot Note 65×PBOD Vol 1 p 261.The same was reported in Dr Chua’s report dated 3 March 2020:66Foot Note 66×PBOD Vol 1 p 426. His cognitive screening scores … were in the impaired range in the areas of spatial organisation, short term memory and calculation and when compared with his scores in 2016,these were minimally changed.This pattern is similar and consistent with that in 2018 from Dr Collinson’s report and his current cognitive deficits are consistent with severe TBI and demonstratechronic fixed deficits which are not likely to improve.[emphasis added] 67 Furthermore, as I will explain below in the section containing my decision on the plaintiff’s loss of future income, I am of the view that it will be an uphill task for the plaintiff to independently obtain and retain a job in the future. 68 Bearing in mind the above, the applicable range of awards for the plaintiff’s cognitive injuries can be narrowed down to between $80,000 and $140,000 (ie,the lowest point under “c(i)” in the “Moderate brain damage” category to the mid-point of the “Moderately severe brain damage” category). An award at the highest range of “Moderately severe brain damage” (ie,$160,000) is not warranted because the plaintiff does not claim to have epilepsy or any risk of it, and takes the position that his life expectancy has not been altered (ie,because he claims to have the same remaining life expectancy as an average male Singapore citizen).67Foot Note 67×PCS para 2.77 read with para 4.23. 69 To further narrow down the range, it is necessary to have regard to two key factors which distinguish between the “Severe” and “Moderately severe” categories in the 2010 Guidelines: (a) the degree of dependence on caregivers; and (b) the ability to perform simple tasks of daily life. 70 With regard to the evidence, the first port of call would be the surveillance video footage of the plaintiff. There are two sets of videos: (a) Video recordings taken on 15 June 2016 showing the plaintiff walking alone in the vicinity of Hougang Avenue 8. He was seen purchasing items from a neighbourhood store on his own before going home.68Foot Note 68×DCS p 11. (b) Video recordings on 16 June 2016 showing the plaintiff walking, on his own, from his house, making his way to TTSH on public transport and back again. 71 I had briefly touched on these videos at [50] above. They show that the plaintiff is able,on his own, to take public transport, navigate and handle simple transactions to purchase items. Admittedly, they do not demonstrate whether, and if so the extent of, any pre-planning or prior instruction that may have been required on the part of the plaintiff’s family members. Nevertheless, and more importantly, even if these videos are mere snapshots of the plaintiff’s life on selected days and unrepresentative of the full spread of his neurocognitive impairments as a result of the accident,69Foot Note 69×PCS paras 2.17 – 2.22.they do, at the very least, show that he is able to handle himself in public (whether with any pre-planning or otherwise) without any violent outbursts or aggression towards others, and is also aware of traffic signs, signals anddangers(eg,waiting for traffic lights to change and quickening his pace when pedestrian crossing lights in his favour are flashing green and about to turn red). 72 While Ms Ashikin and Mdm Noraini took pains to emphasise that the plaintiff was, especially for the trip to TTSH, following a meticulously prepared plan and had to go through a large amount of preparation before he was allowed to go out on his own, the fact remains that the plaintiff was capable of following directions and plans with the aid of his family members.70Foot Note 70×PCS para 2.19 – 2.22 73 This is entirely in line with the findings of the experts that the plaintiff is independent in self-care ADL, able to plan his daily home routine,etc(see above at [51(a)]–[51(b)] and also Dr Fones’ report dated 10 February 2020 at para 14)71Foot Note 71×PBOD Vol 1 p 431.. The plaintiff is also able to send reasonably coherent emails and messages (see, for example, his emails sent to Nanyang Polytechnic on 20 April 2018 in relation to his application for the “Direct Admission Exercise”).72Foot Note 72×DCS para 54; NE 10 November 2020 62:1-17.Further indication that the plaintiff had recovered some measure of his pre-accident cognitive abilities can be gleaned from a brief perusal of the plaintiff’s “Memory Diary”. These were initially a somewhat garbled collection of disjointed short sentences after the accident (see, for example, the entry on 20 July 2015),73Foot Note 73×BAEIC Vol 1 p 133.but eventually progressed to full sentences and paragraphs about the events of his day (for example, what he had for lunch and dinner, mention of a visit to the dentist and being unsure if he should get braces for his teeth), his hopes for recovery and his dream of going to “NAFA”ie,the Nanyang Academy of Fine Arts (see, for example, the entries on 15 and 19 November 2015).74Foot Note 74×BAEIC Vol 1 p 201. 74 That having been said, the experts are unanimous in their opinion that the plaintiff will require some form of supervision for the rest of his life: (a) Dr Collinson stated in his report dated 3 November 2018 at para 3.3 that although the plaintiff “may not want a caregiver and is capable of living semi-independently with the help of his family, he would not manage to live by himself successfully without this support. In the absence of family, he would need a caregiver to provide at least some oversight in his daily activities”.75Foot Note 75×PBOD Vol 1 p 274.When cross-examined on this point, Dr Collison explained that generally, individuals with cognitive injuries like the plaintiff, are unlikely to manage their safety well if they were to live alone in several respects which I found concerning:76Foot Note 76×NEs 24 November 2020 105:27 – 106:1. They don’t manage their safety well within the house, so they might leave the gas on whilst they are cooking and potentially cause a fire. They may forget to lock their house and be robbed. They may be subject to influence by other people, who could take away their money or pressure them in some way … those are the kind of threats to people who have severe injury by living alone. Equally concerning, Dr Collinson had also observed that the plaintiff, specifically, was unable to come up with simple solutions to immediate real-life problems that could pose a threat or impairment to his well-being such as a fire or a minor leak in his house.77Foot Note 77×NEs 24 November 2020 122:16 – 123:19. (b) The OzWorks Report dated 1 February 2019 opined that the plaintiff is:78Foot Note 78×PBOD Vol 1 p 304 – 305. independent in all basic activities of daily living but requires supervision/assistance from family members with some instrumental activities of daily living. He is able to manage small day-to-day financial purchases but requires assistance with more complicated financial matters eg. use of ATM, major purchases, balancing a budget. He also requires assistance in the areas of housekeeping, meal preparation, shopping, laundry and medication management. It adds that:79Foot Note 79×PBOD Vol 1 p 305. [the plaintiff] is currently ADL independent, is able to use public transport and [can] go out into the community independently. As such, a caregiver that accompanies him at all times is not necessary. However, he is not able to live independently as he requires assistance for some instrumental ADLs (eg. management of financial matters, housekeeping, meal preparation, laundry) and will require oversight/assistance of a live-in, full-time caregiver for his safety and well-being. (c) Dr Chua stated in her report dated 3 March 2020 that “[w]hile he currently does not need a long term carer for his ADL, there does need to be a supervisor for his instrumental ADLs and oversight of his social behaviour when he is outside the safety of his home”.80Foot Note 80×PBOD Vol 1 p 427. (d) Dr Chan stated in her report dated 25 September 2020 that “due to the severity of his cognitive impairment and behavioural disturbances, it is likely that [the plaintiff] will need lifelong supervision for activities of daily living.”81Foot Note 81×PSBOD  p 1525. 75 Bearing in mind the above, it is clear that the plaintiff is capable of managing himself forbasicday-to-day activities but would still require some supervision and support as he is unable to live independently. Of particular concern is Dr Collinson’s observation that the plaintiff would face difficulties in mitigating risks to his own safety if he were to live alone. Pursuant to the 2010 Guidelines, this indicates that the plaintiff would fall in the “Moderate brain damage” category. Accordingly, in my judgment, a reasonable figure for his cognitive impairments is$100,000. This is in the highest range of damages for the “Moderate brain damage” category and reflects the fact that his injuries are severe, widespread and almost certainly permanent. (D) Summary of Award on TBI 76 I find that the following component awards are reasonable in respect of the plaintiff’s TBI. For the avoidance of doubt, these awardsdo not includeoverlapping injuries. (a) Structural injuries: $65,000 (b) Psychological injuries: $20,000 (c) Cognitive impairments: $100,000 (2) Facial fractures 77 The plaintiff seeks to claim $35,000 for multiple facial fractures.82Foot Note 82×PCS paras 2.125 and 2.134.He adds that he has had to undergo an open reduction and internal fixation of his left orbitozygomatic complex fractures on 16 April 2015 and subsequently suffered complications as a result of the metal implants in his body.83Foot Note 83×PCS para 2.128. 78 In my judgment, damages are not claimable by the plaintiff for the multiple facial fractures because the injuries relied upon by the plaintiff here are thevery sameinjuries used to quantify the plaintiff’s injuries to the skull, and for which I have already awarded damages (see [40] above). The award for facial fractures is therefore$0. (3) Lung injuries and urinary tract infection 79 The plaintiff submits that a sum of $10,000 ought to be awarded to him because he was found to suffer from aspiration pneumonitis on the day of the accident and subsequently suffered healthcare-related pneumonia and urinary tract infection (“UTI”).84Foot Note 84×PCS para 2.142.He also had to undergo an open tracheotomy on 9 April 2015 resulting in a 3cm scar. 80 Save for denying that the aspiration pneumonitis could have been caused by the accident, the defendant makes no submission on the plaintiff’s claim of $10,000 for lung injuries and UTI.85Foot Note 85×DCS paras 88 – 90. 81 Aspiration pneumonitis refers to chemically induced inflammation of the lungs as a result of the aspiration of the gastric contents, followed by infection of the lungs due to the bacteria in the gastrointestinal tract. This may occur when brain injury or loss of consciousness affects a person’s normal gag reflex. This may well have occurred as a result of the accident given that the plaintiff had lost consciousness and had a GCS of 5. The healthcare-related pneumonia, UTI and open tracheotomy were all complications which aroseafter the accident,during the course of the plaintiff’s prolonged hospital stay.86Foot Note 86×PBOD Vol 1 p 221. 82 The plaintiff tenders two authorities in support of its position. InAng Siam Hua v Teo Cheng Hoe[2004] SGHC 147 (“Ang Siam Hua”), the court awarded $2,000 for pneumonia (at [15]) and $6,000 for a tracheotomy scar and multiple abrasions and scars across various parts of the body. The figure of $6,000 cannot be relied upon because the tracheotomy scar was one of the less serious abrasion scars observed on the plaintiff inAng Siam Hua. The court specifically referenced the case ofSeow Seet Lye v Ho Kian Min(MC Suit No. 9504 of 1996) in which an award of $500 was made for a 2.5cm tracheotomy scar. InOng Leong Hin suing by Ong Chee Peng, Deputy v Ho Yew Leong(HC Suit No 209 of 2013), the court awarded $5,000 for pain and suffering for other injuries which included UTIs. The latter case is unhelpful because the award of $5,000 is not broken down into its various components and the page from thePractitioners’ Library – Assessment of Damages: Personal Injury and Fatal Accidents(LexisNexis, 3rd Ed, 2017) cited by the plaintiff only states “urgency in micturition” as a disability without more. 83 Having regard to other authorities, awards for lung injuries have been as follows: (a) InChoy Kuo Wen Eddie v Soh Chin Seng[2008] SGHC 113, the plaintiff suffered a rib fracture, pulmonary contusion, chemical pneumonitis and extubation for nine days. Chemical pneumonitis, like aspirational pneumonitis, is lung irritation caused by the inhalation of substances irritating or toxic to the lung. He received an award of $5,000 (at [61]–[62]). (b) InSun Delong v Teo Poh Soon and another[2016] SGHC 129 (“Sun Delong”) the plaintiff developed small bilateral lower lung contusions and minimal pneumomediastinum. The latter is a rare condition in which air is present in the mediastinum (ie,the central component of the thoracic cavity between the lungs that contains the heart, trachea, oesophagus and some blood vessels). He received an award of $5,000 (at [20]–[21]). 84 None of the authorities is specifically on point. In fact, in the absence of medical evidence, it is not possible to gauge if minimal pneumomediastinum or chemical pneumonitis is even of the same severity as the injuries suffered by the plaintiff here. In my judgment, an award of $1,000 would be reasonable for the 3cm tracheotomy scar, and $4,000 would be reasonable for the plaintiff’s aspiration pneumonitis, pneumonia and UTI. The total award for lung injuries and UTI is therefore$5,000. (4) Lower limb injuries 85 The plaintiff submits that a reasonable sum for his leg injuries is $35,000. To this, he adds a further $10,000 to account for three scars on his lower limbs. This results in a total award of $45,000 for lower limb injuries.87Foot Note 87×PCS paras 2.155 – 2.160. 86 The defendant submits that a reasonable sum for the plaintiff’s leg injuries is $25,000.88Foot Note 88×DCS para 93. 87 As a starting point, I do not think that the plaintiff should receive a further $10,000 for the three scars. This would constitute overcounting because the 2010 Guidelines which the plaintiff used to derive a sum of $35,000 for leg injuriesalreadyincludes compensation for scars (see underlined portions below). Therefore, I will deal with the lower limb injuries as a whole. 88 The relevant portions of the 2010 Guidelines state as follows: (b) Severe leg injuries (i) Very severe injuries short of amputation,eg,extensive degloving, gross shortening, non-union of fractures, badly damaged soft tissues (muscle wasting). Extensive surgery and physiotherapy are required but recovery will not be complete. The person is likely to be left with extensive disabilities despite surgery that will greatly impair his chances of employment in the same trade and also impede his social life. His condition is not likely to improve in the long run.$35,000–$55,000 (ii) Serious and/or multiple fractures leading to restricted mobility, deformity and/or shortening of limbs. There is  high risk of developing osteoarthritis requiring surgery and intensive physiotherapy. The person is likely to suffer significant disabilities on a long term basis that will significantly affect his chances of finding employment and his social life as well but the severity is less than that of (b)(i) above.$30,000–$40,000 (iii)  Serious injuries to joints or ligaments resulting in permanent instability, laxity of the ligaments despite surgery and physiotherapy.There is also extensive scarringwhich cannot be removed completely by cosmetic surgery. However, the person is likely to be able to gain employment though at a reduced capacity and there may be some effect on his social life as well.$25,000–$30,000 (iv)  Moderate injuries which include open and/or compound fractures. An award in the higher range is appropriate where there is a likely risk of degenerative changes in the future requiring further surgery as a result of damage to the articular surfaces of the tibia and/or fibula, malunion of fractures, muscle wasting, restricted movement andunsightly scars which cannot be completely removed by cosmetic surgery.$15,000–$25,000 [emphasis in original in bold, emphasis added in underline] 89 The parties have both cited category “b(ii)” in their submissions (ie,$30,000 to $40,000). Somewhat confusingly, the defendant claims that this corresponds to a monetary award in the range of $25,000 to $45,000 when such figures do not match the range indicated for category “b(ii)” in the 2010 Guidelines.89Foot Note 89×DCS para 92.I therefore undertake the analysis afresh in relation to this category by reference to the points put forth by the parties. 90 The plaintiff suffered the following lower limb injuries:90Foot Note 90×PCS para 2.143. (a) Open fracture of the left femoral shaft bone.(b) Displaced fracture over the left proximal femoral shaft.(c) Left thigh compartment syndrome.(d) Gross deformation of left thigh/open laceration wound of hip/thigh.(e) Contusion of muscles around the left proximal femur. 91 In my view, the fractures and the resultant surgeries as detailed at para 2.144 of the plaintiff’s submissions warrant an award in category “b(ii)”. It has not escaped my attention that since the time of the accident, the plaintiff has made a significant recovery from these injuries and surveillance videos show that he is capable of walking around his neighbourhood alone and unaided for some distance.91Foot Note 91×DCS para 93(c).To understand the present extent of his injuries, it is necessary to have regard to the opinion of three medical experts. 92 First, the plaintiff’s rehabilitation doctor, Dr Chua, stated in her clarification letter dated 30 March 2020 that:92Foot Note 92×PSBOD p 1514. On 22 Jan 2020, he was assessed by our senior physiotherapist at TTSH 5B clinic who reported that [the plaintiff] was independent in functional mobility, able to walk up and down a slope and climb 1 flight of stairs. He had a full score of 56/56 on the Berg Balance Score which is a standardised, comprehensive 14-item test of static and dynamic balance activities including standing on 1 leg, left and right …He was independent in ambulationwithleft lower limb in slight external rotation.His gait speedon the standardised 10m walk test was 1.46m/s was within normal limits andconsistent with a person being able to walk in the community at usual speed. On a test of walking capacity such as the 6-minute walk test, [the plaintiff] walked 402m which was within normal limits. It was also documented by the senior physiotherapist that the patient was able to take public transport and come to the clinic independently.The presence of pain or muscle aches or tightness in his fractured thigh could also influence performance in high level balance tests such as standing on one leg. These can improve with physiotherapy and exercise.[emphasis added in bold and underline] 93 That said, Dr Chua’s findings showed that the plaintiff suffers from some residual disabilities (ie,the sections underlined above). This is consistent with the findings of Dr K Kannan, the plaintiff’s consultant orthopaedic specialist in his report dated 3 February 2020. 94 Dr Kannan found that the plaintiff’s main orthopaedic issues are “left hip and knee discomfort with limited range”.93Foot Note 93×PBOD Vol 1 p 319.His medical opinion is that: [The plaintiff’s] injuries have affected his lower limb biomechanics to the extent that he is unable to perform normal gait and some of his daily activities.This disability is permanent. He has had a fracture of the left thigh femur bone, which had been treated with an internal fixation. He has now apermanent reduced movement at the hip joint and left knee on clinical examination. … The lower limb injury has left him with some functional limitations. This has affected his work and active lifestyle and some functions like squatting, climbing and kneeling; basic functions that he is currently unable to do with ease. The range discrepancy between the right and left hip will make his gait difficult, as he would now have to expand more energy moving his left leg. He may also require a special garment or an orthotic to help de-rotate the left lower limb to balance the pelvis so that his gait can be more balanced.Currently as he is young, he is compensating very well without a limp or imbalance in his gait. However, this subtle abnormal gait pattern will eventually take a significant strain on his hips and back. This functional disability is likely to be permanent. [emphasis added] 95 When showed the surveillance footage of the plaintiff walking, Dr Kannan saw that there was a “very, very subtle difference in the gait” and that if rehabilitation was not done to teach the plaintiff to balance his gait, his condition would deteriorate over the years.94Foot Note 94×NE 30 Nov 2020 38:29 - 39:16. 96 The third medical report of relevance is that of Dr Mudh Farhan bin Mohd Fadil, a consultant in TTSH’s Department of Orthopaedic Surgery. In his specialist report dated 23 November 2018,95Foot Note 95×PBOD Vol 1 p 284.he stated that the plaintiff’s “limitation in left hip and knee movement will be permanent – there is no intervention to resolve this”. He observed that the plaintiff’s residual disability for activities of daily living and work are from the limitation in the movement of his left hip and left knee. Further: [The plaintiff] is totally independent in activities of daily living. As far as the stability and strength that his left leg offers, he is able to walk, climb up and down stairs independently and is able to take the public transport independently. The left femur is able to withstand normal load stresses of running and jumping and load bearing as if it was not injured. He is doing weight training at the gym to build up further his strength. His limited hip and knee movements though will restrict him from jobs requiring prolonged squatting, kneeling or moving in tight spaces… 97 Viewed in the round, it is clear that the plaintiff has regained most of the function in his lower limbs. He is also able to carry out most activities of daily living independently and will either maintain at this standard or continue to improve with therapy and/or gym training sessions. However, there remains some residual disability in the form of a limited range of movement in his left hip and knee which is permanent. As such, an award at the lower end of the range of “b(ii)” is, in my judgment, warranted and reasonable. Factoring in his three permanent scars: (a) long scar running down the entire upper left thigh measuring 28cm; (b) left knee lateral scar measuring 5.6cm; and (c) left knee medial scar measuring 2cm, I find that a total sum of$33,000is reasonable for the plaintiff’s lower limb injuries. (5) Bruises and lacerations 98 The parties agree that the component award for bruises and lacerations should be$3,000and I award this sum as agreed. (6) Conclusion on Stage 1 99 In summary, the aggregate award using thecomponentmethod is $226,000 broken down as follows: InjuriesAwardTBI: Structural$65,000TBI: Psychological$20,000TBI: Cognitive$100,000Facial Fractures$0Lung Injuries$5,000Lower Limb Injuries$33,000Multiple Bruises and Lacerations$3,000Total$226,000 Stage 2: The global award 100 I now turn to Stage 2 of the analysis to assess if the global award is manifestly excessive or inadequate. There are two important considerations at the second stage. The first is whether there are “overlapping” injuries - injuries which either: (a) together result in pain that would not have been differentially felt by the claimant; or (b) together give rise to only a single disability. In such circumstances, compensating for each distinct injury would likely result in an excessive award. The second consideration is precedent, which should be referenced to assist in arriving at a fair estimate of loss and to ensure that like cases are treated alike:Lua Bee Kiangat [17]–[18]. (1) Overlapping 101 The defendant submits that a 25% discount should be applied. The only reason given for this is that the Court of Appeal inLua Bee Kianghad applied this same discount.96Foot Note 96×DCS paras 96 – 97.There is no explanation for why such a significant discount should apply to the particular facts of the present case and I therefore reject the defendant’s submission. 102 The plaintiff submits that a discount of 16% for overlapping should applyonlyto the plaintiff’s TBI, also without further analysis.97Foot Note 97×PCS paras 2.123 – 2.124 . 103 In the sections above, I have already accounted for the following forms of overlapping in the parties’ submissions: (a) The claimed award for facial fractures which is essentially a component of the structural injuries in TBI (ie,skull fractures and skull-related fractures): see above at [78]. (b) The fact that psychological injuries would include MDD, PDD as well as the behavioural and personality changes due to TBI, the lattertypebeing separately accounted for under the award for cognitive impairments: see above at [47]. 104 As alluded to above at [47], there is a further form of overlapping. This refers to theeffectof the behavioural and personality changes on the plaintiffvis-à-vistheeffectof MDD and PDD. It will be obvious from the sections above that they result in some common effects, namely,the plaintiff’s emotional and violent outbursts. 105 Per Dr Fones’ report dated 10 February 2020 (see above at [48(a)]), these separate injuries can interact with each other to compound the plaintiff’s problems and disabilities. In his further report dated 26 October 2020 (approximately, a month before trial), he noted that98Foot Note 98×PSBOD p 1527.: I have already clarified in earlier reports that any depressive features are secondary to the primary problem of Major Neurocognitive Disorder. The difference lies merely in whether there is comorbidity (the presence of another concomitant disorder) or if the depressive features are a manifestation of the Neurocognitive Disorder and personality changes. … In other words, the MDD and PDD are separate from the behavioural disturbances from the TBI (as well as the subsequent personality changes), but the latter also has depressive features. 106 To account for the common effect in these three disorders, I find that a further discount of $10,000 is warranted, thereby bringing the aggregate award down to$216,000. (2) Precedents 107 I turn now to consider some of the precedents. 108 InLua Bee Kiang,the plaintiff suffered significant cognitive deficits and acquired an amnestic disorder. He also experienced personality changes and displayed behavioural problems. He made good recovery from his brain injury and was able to live independently although this caused him significant disadvantage in seeking employment – he was subsequently able to find and hold down a job as a cleaner (at [27]). He suffered multiple facial fractures and injuries and a blunt trauma injury to his right eye (at [33]). To compound this, there were numerous other fractures across his body (at [45]). Although the plaintiff there largely recovered from his injuries, he “continues to suffer from pains in his leg and his back” (at [46]). Significantly, he was 64 years old at the time of the appeal and 58 years old at the time of the accident. The Court of Appeal awarded him $70,000 for his brain injuries, $40,000 for his skull fractures, and $126,000 for his bodily injuries under the component approach. After accounting for overlapping, the total award for pain, suffering and loss of amenity was reduced to $200,000 (at [37] and [49]). 109 InRamesh s/o Ayakanno(suing by the committee of the person and the estate, Ramiah Naragatha Vally) v Chua Gim Hock[2008] SGHC 33 (“Ramesh”), the claimant was 26 years old at the time of the accident. As a result of the accident, he was declared mentally disabled. He was unable to move and talk, and required life-long medication for epileptic seizures. The accident caused injury to both sides of his brain and had to be treated with bilateral craniectomies. In addition, his liver was damaged, his left iliac bone was fractured, and he sustained disc protrusions at different levels of the dorsal spine. His lower limb had also contracted and required tendo archilles lengthening. For pain, suffering and loss of amenity arising from all of these head and bodily injuries, the Assistant Registrar (“AR”) awarded $170,000 in damages, and, on appeal to the High Court, Kan Ting Chiu J increased the award to $185,000 (at [9]). 110 InLee Wei Kong (by his litigation representative Lee Swee Chit) v Ng Siok Tong[2012] 2 SLR 85 (“Lee Wei Kong”), the plaintiff was 18 years old at the time of the accident and his remaining life expectancy was 53 years. Four years after the accident, he had recovered exceptionally and had returned to his studies. But his speech remained impaired with dysphasia and dysarthria, he had acquired a left lateral squint, he had developed increased impulsivity and gave into occasional temper outbursts, and he had lost some sphincteric control resulting in urinary and bowel urgency. His injuries after the accident included fractures of the cheekbone and the left temporal bone, a large haematoma with severe mass effect which caused a midline shift of the brain, and fracture of the sixth cervical vertebra. For pain and suffering arising from all these head and bodily injuries, the AR awarded $285,000 in damages, but this was reduced to $160,000 by the High Court. The latter figure was affirmed by the Court of Appeal after it considered the relevant precedents. Pertinently, the court said (at [16]) that “[t]here has not been any case where, for pain and suffering, an award close to $285,000 had been made”. 111 InTan Juay Mui (by his next friend Chew Chwee Kim) v Sher Kuan Hock and another (Liberty Insurance Pte Ltd, co-defendant; Liberty Insurance Pte Ltd and another, third parties)[2012] 3 SLR 496 (“Tan Juay Mui”), the plaintiff was 48 years old at the time of the accident. As a result of the accident, she experienced post-traumatic personality changes and suffered from delusions. Her memory and intellect also deteriorated: on an IQ test she scored “Extremely Low” for non-verbal problem solving skills and verbal reasoning, and “Low Average” to “Average” on the Working Memory Index. She lost the ability to manage herself and her affairs. Physically, she sustained multiple haemorrhagic contusions in her brain although there were no skull fractures. But complications at surgery left her with impaired vision and paralysis of her left side. She also developed diabetes, which was found to have been caused or exacerbated by the accident and not to be too remote a head of loss. Her left leg below her knee was also amputated to save her life. The AR awarded her $230,000 for pain and suffering, comprising $170,000 for her head injuries and $60,000 for her leg injury. This award was upheld on appeal by Judith Prakash J (as she then was) in the High Court (at [36] and [52]–[54]). 112 InSun Delong, the plaintiff suffered TBI as a result of his head injuries. This caused occasional headaches, sleep difficulty, giddiness/vertigo, some degree of poorer attention span and greater irritability. There was no deterioration of the plaintiff’s cognitive ability, nor any risk of epilepsy and he remained capable of running his own business. He suffered a number of pelvic, lower limb and shoulder injuries including multiple fractures. He made good recovery and was found to be relatively asymptomatic and fit for normal work. He suffered multiple lacerations to his spleen and also developed small bilateral lower lung contusions and minimal pneumomediastinum. Choo Han Teck J awarded him a sum of $45,000 for his head injuries, $12,000 for his pelvic/lower limb injuries, $1,500 for his shoulder injury, $16,000 for his abdominal injuries, $5,000 for his lung injuries and $6,000 for abrasions and scars (at [17], [19], [21] and [23]). Thus, for pain and suffering, he received a total sum of $85,500. The plaintiff was 26 years old at the time of the accident. 113 Finally, inAOD, a minor suing by the litigation representative v AOE[2014] SGHCR 21, the plaintiff was nine years old at the time of the accident, and had a remaining life expectancy of 27 years. The accident left him a quadriplegic who required constant care. He had the motor skills of a six-month-old and the sensory, thinking and language skills of a 12-month-old baby. After the accident he had several haemorrhagic contusions with acute subarachnoid haemorrhage with intraventricular involvements as well as subdural bleeding. He also had cerebral edema, early hydrocephalus and abrasions over the left forehead and temple. For his pain and suffering, the AR awarded $190,000 in damages and this decision was not challenged on appeal: seeAOD (a minor suing by his litigation representative) v AOE[2016] 1 SLR 217 at [12]–[13]perGeorge Wei J. 114 It will be apparent that none of the precedents is on all fours with the present case.Ramesh,in particular, is somewhat dated and a significant uplift would be necessary to account for the decreased value of money due to inflation. In my view, the most relevant precedents areTan Juay Mui($230,000),Lua Bee Kiang($200,000)andLee Wei Kong($160,000). In my judgment, $216,000 is a reasonable sum in this case given that the plaintiff is currently 30 years old and his injuries will plague him for far longer than the plaintiff inLua Bee Kiang.Furthermore, his injuries are far more serious as he also suffers from MDD, PDD and cannot live independently. As forLee Wei Kong,a significant uplift to the award in that case must be given to account for inflation. Further, it should be noted that the plaintiff inLee Wei Kongrecovered exceptionally and was able to return to his studies. This does not appear possible here despite the best efforts of the plaintiff (see above at [6]). An award that is slightly lower than that granted inTan Juay Muiis warranted on the facts of the present case given that the plaintiff there developed diabetes and had to amputate her left leg below the knee – a permanent and irreversible disability. In my judgment, an award of$216,000for pain and suffering is comfortably in line with the precedents, after accounting for the heightened severity of the injuries suffered by the plaintiff in Suit 253 as well as inflation.",
        "Aggravated damages": "115 While the plaintiff has included a claim for aggravated damages as part of his damages claim for pain and suffering due to TBI,99Foot Note 99×PCS para 2.99.I consider it more appropriate to deal with this claim as a separate head of damages, particularly since an award of aggravated damages is meant toaugmentan award of compensatory damages (see [119] below). 116 It also bears mention at the outset that the question of whether aggravated damages are recoverable in cases of negligence or inallcases involving negligence is, at present, still an open one (see, for example,Ramesh s/o Krishnan v AXA Life Insurance Singapore Pte Ltd[2017] SGHC 197 (“RameshKrishnan”)at [125]–[134],AYW v AYX[2016] 1 SLR 1183 at [117] andHalsbury’s Laws of Singapore vol14(4)(LexisNexis, 2021) at para 177.038). Also, inNoor Azlin bte Abdul Rahman and another v Changi General Hospital Pte Ltd and others[2021] SGHC 10at [187], while Belinda Ang JAD noted that the plaintiffs had argued before her that aggravated damages could be awarded in negligence cases, the learned judge did not arrive at any determinative conclusion on the question as a matter of law and instead, dismissed the claim for aggravated damages on the basis that (a) it had not been pleaded and (b) there was, in any event, no justification on the facts to augment the compensatory damages awarded (at [192]–[193]). 117 In the case before me, Mr Wee for the defendant did not contend that aggravated damages are not recoverable in principle. Indeed, both parties advanced their respective submissions on theassumedbasis that aggravated damages are, in principle, claimable. 118 Not having received the benefit of considered argument from counsel on the point, I am loathe to arrive at any determinative conclusion on this issue of principle. In any case, I do not find it necessary to decide the point. This is because evenassumingthat aggravated damages are recoverable in principle in a claim for damages for personal injury such as the present one, there is, in my view, no basis to award the plaintiff any such damages on the facts of the present case. 119 Aggravated damages are meant toaugmenta sum awarded in general damages. They cater for the enhanced hurt suffered by the plaintiff due to the aggravation of the injury by the manner in which the defendant committed the wrong or by his motive in so doing, either or both of which might have caused further injury to the plaintiff’s dignity and pride:ACB v Thomson Medical Pte Ltdand others[2017] 1 SLR 918 at [156] andKoh Sin Chong Freddie v Chan Cheng Wah Bernard and others and another appeal[2013] 4 SLR 629 at [75]. In this regard, aggravated damages cannot be claimed unless: (a) general damages are proved; and (b) the adequacy of the amount of damages calls for augmentation of the general damages (Li Siu Lun v Looi Kok Poh and another[2015] 4 SLR 667 (“Li Siu Lun”) at [156]). Additionally,exceptional or contumelious conduct or motivein committing the wrongdoing is necessary (seeRameshKrishnanat [130] andLi Siu Lunat [149]). 120 In my view, the conduct of the defendant complained of is neither “exceptional” nor “contumelious”. As the plaintiff recognises, it is not uncommon for insurance companies to conduct surveillance on claimants who claim to have suffered serious injuries as a result of negligence;100Foot Note 100×PCS para 2.107.the same applies also to the mock interview conducted with the plaintiff. While some of the surveillance footage captured images of the plaintiff topless at home, this would have been observable to any person standing outside the plaintiff’s flat. 121 As for the steps taken by the defendant in HC/SUM 1090/2020 (“SUM 1090”) for leave to call the plaintiff to give evidence, this is not, in itself “contumelious conduct”. In fact, after hearing SUM 1090 and considering the views of the plaintiff’s doctors, I was of the view that the application should be allowed and I granted the application with conditions. While both Dr Fones and Dr Chan stated that the giving of evidence will be emotionally difficult and stressful for the plaintiff,101Foot Note 101×PCS para 2.112 – 2.113.Dr Fones made clear (in his specific responses to questions framed by the court to him) that:102Foot Note 102×PSBOD p 1522 [Dr Fones’ report dated 14 May 2020]. [the plaintiff’s] condition does not prevent him from understanding questions put to him as a witness during a Court hearing, nor prevent him from giving rational answers to questions put to him, his memory deficits still continue to affect him. The accuracy of his recall and his tendency to lapse into confabulation must be considered by the Court if he were to be put up as a witness. 122 The risk of confabulation and/or the accuracy of the plaintiff’s ability to recall events, is a matter going towards the weight to be accorded to his evidence, and is well within the means of the court to assess. Furthermore, given that the plaintiff was certified by Dr Fones to be fit to take the stand, measures were pre-emptively taken to reduce the plaintiff’s emotional stress as much as possible – namely, requiring the defendant’s counsel to adhere to a pre-set list of examination questions which was made known to the plaintiff’s counsel in advance and vetted by the court, and limiting this list to a set of 10 questions.103Foot Note 103×Registrar’s Notice dated 5 Oct 2020 in respect of HC/SUM 1090/2020.In any event, the defendant eventually chosenotto call the plaintiff to the stand. 123 More importantly, it would be apparent from the damages I have awarded for pain and suffering at [114] above, the quantum of the general compensatory damages awarded to the plaintiff is entirely in line with the 2010 Guidelines and the precedents. As such, there is, in my judgment, no need for afurtheraward of aggravated damages to augment the sum awarded. I therefore decline to grant aggravated damages to the plaintiff.",
        "A note on the quantification of future losses": "124 An award of damages for future losses arising from non-fatal personal injuries is intended to place a lump sum of money in the plaintiff’s hands which he can draw down upon at periodic intervals over the expected duration of his loss, taking into account the vicissitudes of life and the time value of money, such that the lump sum is reduced to zero at the end of that duration: seeQuek Yen Fei Kenneth (by his litigation representative Pang Choy Chun) v Yeo Chye Huat and another appeal[2017] 2 SLR 229 (“Kenneth Quek”) at [43]–[44] and [58]. 125 An award for loss of future income or future medical expenses is traditionally calculated by way of the multiplier-multiplicand approach (Kenneth Quek(at [42]): … The multiplicand represents the quantum of loss, whether in terms of an incurrence of medical expenses (for [future medical expenses]) or a reduction of earnings (for [loss of future earnings]), that the claimant is expected to suffer at periodic intervals in the future. The multiplier, in turn, is the mathematical tool used to calculate the lump-sum present value of the stream of future periodic losses across the remaining life expectancy and the remaining working life … of the claimant. [emphasis in original omitted] 126 The difficulty in assessing future loss usually lies in the determination of the multiplier which represents the number of periods which comprise the total duration of a particular head of loss. For example, with regard to loss of future earnings, the duration of a plaintiff’s loss will be the remainder of his working life. For future medical treatment, the duration of a plaintiff’s loss will be the period for which he is likely to require that treatment. In the case of lifelong medical treatment, the duration of the plaintiff’s loss will be the rest of his natural life: seeKenneth Quekat [52] andChristian Pollmann v Ye Xian Rong[2021] SGHC 77 (“Christian Pollmann”) at [10]–[11]. As a side note, I would mention thatChristian Pollmannwas appealed to the Appellate Division of the High Court (“the Appellate Division”) in AD/CA 56/2021 (“AD 56”). The appeal in AD 56 was heard and dismissed by the Appellate Division on 5 November 2021, save for the trial judge’s lumpsum award in respect of post-retirement income which the AD increased from $100,000 to $200,000. 127 Three factual premises undergird the determination of the multiplier (seeKenneth Quekat [43]): (a) the length of the expected period of future loss, from the date of the assessment of damages to the date of death (for a lifelong multiplier) or retirement (for a future earnings multiplier); (b) the receipt of compensation for the future losses by the claimant as an immediate lump sum, which can almost invariably be invested at a rate over and above inflation to make a profit, and the probability that mortality risks (and other vicissitudes of life) would curtail the claimant’s expected period of future loss; (c) the continual drawing-down and spending of the invested lump sum, such that by the end of the expected period of future loss the claimant will have nothing left. 128 There are at least four methods for determining the multiplier (seeKenneth Quekat [50]citingPoh Huat Heng Corp Pte Ltd v Hafizul Islam Kofil Uddin[2012] 3 SLR 1003 (“Hafizul”) at [48]): (a) The precedent approach determines the multiplier by analogy with past precedents. (b) The arithmetic approach determines the multiplier by the arithmetic formula for determining the net present value of a stream of payments into the future. (c) The actuarial approach determines the multiplier by reference to actuarial tables. (d) The fixed-formula approach determines the multiplier by a formula fixed by legislation. 129 In the absence of authoritative actuarial tables for Singaporean lives, and in the absence of any formula fixed by legislation, the precedent approach and the arithmetic approach are to be preferred in Singapore. These two approaches are to be usedindependently, with the precedent approach used to cross-check the result obtained by the arithmetic approach so as to ensure consistency with past awards in like cases:Kenneth Quekat [54]. 130 The precedent approach embeds the adjustment for both accelerated receipt and the vicissitudes of life in the multipliers which the courts have selected in past cases, albeit in a manner which has been until recently, unreasoned, unarticulated, and ultimately unprincipled. The arithmetic approach uses a formula which is a function of the discount rate for any given loss and duration to calculate a multiplier. The multiplier calculated by this formula adjusts only for the time value of money at the selected discount rate. A multiplier derived by the arithmetic approach must therefore be adjusted further to account for the vicissitudes of life: seeKenneth Quekat [58]. 131 Authoritative actuarial tables set out multipliers which incorporate an evidence-based adjustment for life expectancy at a range of discount rates. One of the advantages of the actuarial approach is therefore that it allows a multiplier which is adjusted both for the time value of money and for the vicissitudes of life to be selected from a single source:Christian Pollmannat [18]. The actuarial tables from the Personal Injury (Claims Assessment) Review Committee 132 It will be clear from my recitation above of the law as it currently stands that the multiplier (and the discount rate embedded within) plays a preponderant role in the calculation of future losses which, in many personal injury cases, form the bulk of an injured plaintiff’s claim. The multiplier assumes an especial importance where these losses are expected to stretch many years into the future. 133 In recent years, there has been an increasing recognition amongst Singapore’s courts that the multipliers awarded in Singapore have been undercompensating plaintiffs. Multipliers have traditionally been based on the assumption that the lump-sum award could be invested to achieve real rates of return of between 4% – 5% per annum, when the reality is that the prevailing rates of return on fixed deposits are below 4% per annum and have been so since 1998: seeLai Wai Keong Eugene v Loo Wei Yen[2014] 3 SLR 702 (“Eugene Lai”) at [28] and [32], as endorsed inKenneth Quekat [55] and [59]. 134 Our courts have declined to make anygeneral“radical and sweeping revision of the discount rate embedded in the multipliers used under the conventional approach”, on the basis that such a drastic and wide-ranging change lies within the institutional competence of Parliament and is one which “can only be undertaken after a careful study, with input from experts and the various stakeholders”. However, it has not escaped our courts’ attention that this state of the law was unsatisfactory and that there was scope for reform (seeEugene Laiat [37]–[38] andKenneth Quekat [55] and [59]). Subsequently, the Committee to Review the Law on Damages for Personal Injury and Death (“Personal Injury Damages Committee”) was convened to review the compensation regime for victims of personal injury or dependents in the case of death, the assessment of damages and to consider reforms in related areas. 135 The efforts of the Personal Injury Damages Committee (as well as that of the later-established Personal Injury (Claims Assessment) Review Committee) culminated in the publication of theActuarial Tables with Explanatory Notes for use in Personal Injury and Death Claims(Academy Publishing of the Singapore Academy of Law, 2021) (“PIRC Tables”) in March 2021. The PIRC Tables are actuarial tables that serve as aproxyfor having to calculate direct discount rates and multipliers.This isbecause experts have already undertaken these calculations when creating the tables such that one can simply select an appropriate pre-determined figure: seeKenneth Quekat [62]. 136 The PIRC Tables are based on 2019 preliminary population data produced by the Singapore Department of Statistics covering Singapore residents. Unlike the conventional approach to determining the multiplier based on a single discount rate which does not accurately reflect the fact that interest rates vary depending on the terms of the investment, the PIRC Tables are based on a “yield curve that represents expected investment returns for investments of different periods of time.” Three significant considerations, among other possible adjustment factors, are built into the PIRC Tables: (a) An investment expense assumption built into the rates of return on the yield curve. This in turn is based on three different investment instruments considered in the yield curve portfolio: (i) risk-free assets or Singapore Government Bond Securities, (ii) corporate bonds and; (iii) equities. (b) A 2% rate of inflation. (c) An built-in mortality improvement of 2.6% per annum for both genders. 137 The use of the PIRC Tables in all proceedings for the assessment of damages in personal injury and death claims that areheardon or after 1 April 2021 was subsequently written into the Supreme Court Practice Directions at para 159 and also the State Courts Practice Directions at para 145. 138 Both are worded in identical terms and I reproduce para 159 of the Supreme Court Practice Directions as follows: 159. Reference to Actuarial Tables for the Assessment of Damages in Personal Injury and Death Claims (1) In all proceedings for the assessment of damages in personal injury and death claims that are heard on or after 1 April 2021, the Court will refer to the ‘Actuarial Tables with Explanatory Notes for use in Personal Injury and Death Claims’ published by the Academy Publishing of the Singapore Academy of Law (the ‘Actuarial Tables’) to determine an appropriate multiplier, unless the facts of the case and ends of justice dictate otherwise. This is so regardless of when the accidents or incidents that gave rise to those claims occurred, and regardless of the dates on which the actions were commenced. (2) The Actuarial Tables will serve as a guide and the selection of the appropriate multipliers and amount of damages awarded will ultimately remain at the discretion of the Court. Where appropriate on the facts and circumstances of the case, the Court may depart from the multipliers in the Actuarial Tables. 139 It will be obvious from the discussion above (see especially at [133]–[134]) that the PIRC Tables are a welcome contribution to this area of the law, especially for a victim of a tort who is now more likely to be entitled to alargerdamages award for his or her future losses by the application of these tables. 140 Unsurprisingly, while the plaintiff had originally relied on the evidence of his expert Mr Iain Potter, a Chartered Accountant in MDD Forensic Accountants, to quantify the extent of the plaintiff’s future losses and the relevant multiplier, the plaintiff now reliesprimarilyon the multipliers derived from the PIRC Tables (see for example, the plaintiff’s closing submissions at paras 3.32–3.39, 4.25–4.26 and 6.8, and reply submission at paras 1.86–1.88). 141 In gist, Ms Viviene Kaur Sandhu, lead counsel for the plaintiff, submits that the PIRC Tables are applicable to Suit 253 because “the case is still being heard, in that, a decision for [Suit 253] has not been pronounced and as we had specifically written in requesting for an extension of time to make submissions on the [PIRC Tables].” Further, the PIRC Tables should be applied to determine the appropriate multiplier as the “justice of the case demands in this day and age and to prevent gross undercompensation to the [p]laintiff”.104Foot Note 104×Plaintiff’s Further Submissions (“PFS”) dated 18 June 2021 at 10 – 11. 142 The defendant, equally unsurprisingly, objects vigorously to the same on the basis that:105Foot Note 105×Defendant’s Further Submissions (“DFS”) dated 12 July 2021 at paras 4 - 19.(a) the PIRC Tables are only applicable to hearings after 1 April 2021 and the evidential hearing for Suit 253 had concluded on 3 December 2020; (b) no evidence had been led during the assessment of damages hearing in relation to the PIRC Tables; and (c) the cross-examination conducted by Mr Wee would have been very different if the defendant knew that the plaintiff would rely upon the PIRC Tables during the assessment of damages hearing.106Foot Note 106×DCS paras 112 - 114.To elaborate on the third point, according to the defendant, Mr Wee would have led evidence: (a) On the present mortality rate of Singapore residents given that the PIRC Tables were based on preliminary population data from two years ago which would certainly be open to challenge in the light of the COVID-19 pandemic and its uncertain after-effects. (b) To test the calculation of the yield curve and whether it is more representative of how money in the real world would be invested than a single discount rate. (c) On other adjustment factors inbuilt in the PIRC Tables such as gender, age band, education level, level of disability and employment status at the time of the accident. In the defendant’s view, any reliance upon the PIRC Tables would occasion prejudice to the defendant which cannot be remedied simply by the exchange of further submissions and an award of costs.107Foot Note 107×DFS at para 20. The PIRC Tables cannot be completely relied upon as a matter of fairness to the defendant 143 After considering the parties’ arguments in their closing and reply submissions for Suit 253, as well as their further submissions, I have come to the conclusion that the PIRC Tables arenot applicablein this case and in any event,cannotbe completely relied upon as a matter of fairness to the defendant. 144 First, para 159 of the Supreme Court Practice Directions makes it clear that the PIRC Tables are only to apply to proceedingsheard on orafter1 April 2021. Here, the evidentiary hearing before me for the assessment of damages in Suit 253 commenced on 10 November 2020 and concluded on 3 December 2020. The parties were originally due to file their closing submissions on 28 January 2021 and reply submissions by 11 February 2021;108Foot Note 108×NE 3 December 2020 73:9 and 75:1.these deadlines were subsequently shifted to 8 April 2021109Foot Note 109×Letter from Court dated 6 April 2021.and 23 April 2021110Foot Note 110×Letter from Plaintiff’s Counsel to Court dated 18 June 2021 at para 4.respectively after repeated requests for extensions of time by the parties. I do not think that the words “proceedings … heard on or after 1 April 2021” includes (or was intended to include) a situation where parties are no longer able to adduce any further evidence or file submissions without leave of court, after the close of trial. 145 Second, and more importantly, I am of the view that it would occasion irremediable prejudice to the defendant were the court to rely directly and solely upon the PIRC Tables in determining the appropriate multiplier for the plaintiff’s future losses. The first time in which the PIRC Tables were evenmentionedin Suit 253 was on 19 March 2021, approximately three and a half months after the close of the evidentiary hearing, in a letter to the court from the plaintiff’s counsel requesting an extension of time to file their closing submissions in the light of the recent publication of the PIRC Tables. Any finding that the PIRC Tables are applicable to Suit 253 would occasion two inter-related and irremediable forms of prejudice to the defendant. 146 Firstly, the proposed quantum for the plaintiff’s claim would have increased significantly from the start of trial in November 2020 to the time closing submissions were filed in April 2021,with no advance notice whatsoever to the defendant. To illustrate this point, one need only consider that the multiplier for the plaintiff’s loss of future earnings and CPF in his opening submissions is20 years.111Foot Note 111×Plaintiff’s Opening Submissions at p 10. Scott Schedule at S/No 6.This figure became25.43 yearsbased on Mr Potter’s calculations112Foot Note 112×PBOD Vol 1 343 (Mr Potter’s Report at para 4.13).and was subsequently increased again to25.60 yearsbased on the PIRC Tables (on the assumption that the plaintiff did not obtain a degree and so would start working from the age of 26)113Foot Note 113×PCS para 3.35.. This being the case, the defendant was deprived of the opportunity to understand and respond to theconstantly shiftingcase that was being mounted against it, until 19 March 2021 – approximately three and a half months after the close of trial and two months after the original deadline for the filing of closing submissions. 147 Secondly, while I recognise the plaintiff’s point that the PIRC Tables are to be used “as is”, the plaintiff acknowledges that they are to be applied “unless there are specific circumstances in a case which would warrant a departure from the [PIRC Tables]”. Paragraph 159(2) of the Supreme Court Practice Directions makes this clear because it states that “[w]here appropriate on thefacts and circumstances of the case,the Court maydepart from the multipliers in the [PIRC Tables]” [emphasis added]. Taking the plaintiff’s argument at its highest and assuming that the PIRC Tables are applicable, the fact that the PIRC Tables were only mentioned at such a late stage meant that the defendant was deprived of the opportunity to adduce evidence, conduct cross-examination and/or seek discovery of further documents to show that there may be specific circumstances unique to Suit 253 which would warrant a departure from the multipliers in the PIRC Tables; a departure would not necessarily be limited to applying a higher multiplier but would conceivably (and more commonly) also mean applying alowermultiplier than that indicated in the relevant PIRC table. One example of such evidence would be in relation to whether there was any heightened risk of mortality to the plaintiff due to the COVID-19 pandemic. This being the case, the prejudice to the defendant in the event that the PIRC Tables are applied in Suit 253 cannot, in my judgment, be remedied by costs. 148 I am cognisant of the fact that the PIRC Tables were only published in March 2021 such that the plaintiff could not possibly have given advance notice to the defendant of his reliance on them in the closing submissions. However, the proper course of action to take, if at all, in such a situation would be to seek leave from the court to reopen the evidentiary proceedings so as to introduce the point (and the revised formulation of damages) formally and properly, and not to simply raise the PIRC Tables in closing submissions. This is especially since the multipliers derived from the PIRC Tables will almost invariably result in a significant enhancement to the quantum of future losses claimable by a victim who has suffered personal injuries as a result of a tort. I will return to this point later when I juxtapose the quantum of damages claimable under the traditional precedent and arithmetic approaches (ie,incorporating a 4% – 5% discount rate) with that under the PIRC Tables when determining the appropriate multiplier for each head of future loss. 149 For completeness, I would add that in dismissing the appeal againstChristian Pollmannin AD 56, the Editorial Note appended toChristian Pollmannstates that the Appellate Division held,inter alia, that: … the Actuarial Tables with Explanatory Notes published by the Academy Publishing, Singapore Academy of Law [ie,the PIRC Tables] did not apply and should not be used in [AD 56]. This was because the hearing of this matter at first instance commenced on 14 January 2020, before the implementation date of 1 April 2021 as set out in para 159 of the Supreme Court Practice Directions. The parties in Suit 253 did not have the benefit of this guidance from the Appellate Division when they tendered their written submissions for Suit 253. I myself have not relied upon it in arriving at my conclusion (at [143] above) that the PIRC Tables are not applicable to Suit 253 and cannot be completely relied upon as a matter of fairness to the defendant. I shall say no more on this issue, save to observe that the conclusion I have reached is entirely in line with the decision of the Appellate Division in AD 56.",
        "Loss of income (working life)": "150 The plaintiff mounts his claim on the basis that he will no longer be able to do any real work,114Foot Note 114×PCS para 3.12.and that but for the accident, he would have completed his Computer Engineering course at Singapore Polytechnic and received a Diploma in Computer Engineering. He would then have gone on to university and subsequently sought employment as an engineer.115Foot Note 115×PCS para 3.7. 151 The plaintiff claims a sum of $2,265,864.11 for loss of future income (inclusive of CPF). He is not claiming for any pre-trial loss of income as his primary case is that he would have pursued a degree and only joined the workforce in 2021.116Foot Note 116×PCS paras 3.37 and 3.40. (a) The multiplicand of $90,707.13 is derived from the calculations of Mr Potter, as stated in his report dated 3 February 2020 (“Mr Potter’s Report”) and the addendum to the report dated 9 February 2021 (“Mr Potter’s Addendum”).117Foot Note 117×PCS paras 3.18 and 3.28.Specifically, it is the average salary of a chemical engineer and an electronics engineer up till the age of 70 after accounting for income tax as well as the differential employer CPF contribution rates across the years . (b) The multiplier of 24.98 is derived from the PIRC Tables118Foot Note 118×PCS para 3.38.–ie,29 years old at the start of payments due to the time needed to complete university education, up till the end of payments at the age of 70. 152 In the alternative, assuming that this court makes a finding that the plaintiff would not have obtained a degree, the plaintiff claims a sum of $1,578,646.53.119Foot Note 119×PCS para 3.39. (a) The multiplicand of $61,665.88 is derived from Mr Potter’s calculations of the average annual salaries of a computer technician and chemical engineering technician up till the age of 70. (b) The multiplier of 25.60 is derived from the PIRC Tables120Foot Note 120×PCS paras 3.33 - 3.35–ie,the plaintiff’s entry into the workforce at 26 years old, up till the end of payments at the age of 70. 153 In the alternative, the plaintiff submits that if the court is not minded to rely upon the PIRC Tables to determine the appropriate multiplier, reference should be made to Mr Potter’s calculation of the multiplier based on the Personal Injury Tables Singapore 2015 and a real rate of return (ie,discount rate) of 2%.121Foot Note 121×PFS at para 13. 154 The defendant argues that a more reasonable sum is $464,820.122Foot Note 122×DCS para 138(b).It begins by stating that the plaintiff is capable of doing “light jobs” from 16 January 2019 such that the multiplicand should be his annual income but for the accident,after subtractingthe annual income for “light jobs”.It also takes the view that the remaining span of the plaintiff’s working life is 32 years (ie,based on aretirement age of 62).123Foot Note 123×DCS para 109. (a) The multiplier of 16 years is derived by having regard to various precedents.124Foot Note 124×DCS para 109. (b) The multiplicand is derived from the average pay as a computer engineer for a polytechnic diploma holder (ie,$2,435 per month) after subtracting the average pay for a cleaner at a food and beverage establishment (ie,$1,200 per month).125Foot Note 125×DCS paras 128, 133 and 135. (c) The defendant projects that the plaintiff would have been promoted every five years from June 2018 until he reaches a “glass ceiling” of $4,500. As such, each period of five years would have its own multiplier and multiplicand.126Foot Note 126×DCS para 137. 155 The defendant concedes that the plaintiff should be entitled to pre-trial loss of income because its case is that the plaintiff would have joined the workforce directly after obtaining his Diploma in Computer Engineering. Multiplicand for loss of income 156 Two issues must be determined to ascertain the loss of income multiplicand. First, whether the plaintiff has any capacity to work in the future. Second, what the plaintiff’s yearly income would be, but for the accident. I deal with each in turn. (1) The plaintiff’s present ability to obtain future employment. 157 The defendant argues that the plaintiff is able to engage in “simple jobs” or “light jobs” despite his injuries. It derives support for this from: (a) Dr Chan’s report dated 25 September 2020 which states her opinion that the plaintiff has a lowered vocational potential and that:127Foot Note 127×PSBOD  p 1525. It is likely that [the plaintiff] will only be able to performsimple jobsthat involve repetitive routines and do not involve higher-order thinking or problem-solving skills, and do not involve much interpersonal communication or social interaction. An example of this would be that of a sheltered workshop. [emphasis added] (b) The OzWorks Report dated 1 February 2019 which states that:128Foot Note 128×PBOD Vol 1 p 305. Taking into account his abilities and issues, [the plaintiff] has the capability to engage inlight jobsthat are simple and repetitive, highly structured, does not require independent decision-making, have low speed demands and are not client facing. However, it is unlikely that he would be able to apply for a job, go through the interview process, obtain and retain a job independently on the open market. He would require the assistance of a job placement agency that specializes in job coordination and training for persons with disabilities. [emphasis added] 158 In opposition, the plaintiff relies upon the following medical opinions to show that he will face grave difficulties in finding and remaining gainfully employed. (a) Dr Collinson’s report dated 3 November 2018 which stated that in terms of prognosis, individuals with severe TBI are known to have high unemployment as well as significant activity limitations, restrictions to participation and social isolation. The plaintiff “is not capable of managing a full time job, although he might be able to engage in some limited activities such [as] part time pamphlet distribution or similar work that does not require memory, planning, judgement of [sic] social skill” [emphasis added].129Foot Note 129×PBOD Vol 1 p 275. (b) Dr Chua’s report dated 3 March 2020 that:130Foot Note 130×PBOD Vol 1 p 428. In terms of readiness or fitness to return to work for gainful employment in a non-supported environment locally this would bedaunting in view of his profound and extensive memory and executive impairments, lack of insight, poor social communication, post-TBI anger and irritability.Considering his lack of work history and transferable skills, he would face employment restrictions and be disadvantaged in the current labour market. As such it is advisable for him to postpone work pursuits presently and he could, in future, benefit from work retraining focusing on specific skills, assistance with job seeking, job placement and on-job support in a vocational agency for disabled individuals in order to aid in sustainability. This can be considered after his psychiatric and behavioural issues are under control. [emphasis added] (c) The report above was based on Dr Chua’s assessment of the plaintiff on 3 January 2020, and also noted that the plaintiff has “a low threshold for noisy or crowded environments”. Subsequent to this, the plaintiff was assessed by TTSH’s occupational therapists in March 2020 and their finding (as stated in Dr Chua’s clarification letter dated 30 March 2020) was that he would “face immense difficulty with employment”.131Foot Note 131×PSBOD  p 1513. (d) Dr Fones’ report dated 10 February 2020 stated that the plaintiff is “unable to hold down a job due to his range of cognitive deficits and behavioural difficulties”.132Foot Note 132×PBOD Vol 1 p 431. 159 Having considered the evidence given by the experts, both written and oral, I come to the conclusion that, on the balance of probabilities, it is more likely that the plaintiffwill notbe able to find gainful full-time employment in the future. 160 As a starting point, I do not place much weight on Dr Chan’s report on the issue of the plaintiff’s ability to work because her speciality is in psychiatry and her engagement with the plaintiff across the years was focussed on assessing his mental capacity and TBI.133Foot Note 133×PBOD Vol 1 p 211 [Dr Chan’s first report to assess the plaintiff’s mental capacity dated 2 Dec 2015]; p 230 [Dr Chan’s second report to reassess the plaintiff’s mental capacity dated 8 July 2016].In contrast, Dr Chua is the plaintiff’s rehabilitation doctor and had the aid of TTSH’s occupational therapists in arriving at her opinion that the plaintiff would face immense difficulties in finding a job. As for the OzWorks Report, this makes it clear that the plaintiff would not be able toindependentlyobtain a job on his own and would have to be aided specifically by organisations specialising in finding jobs for persons with disabilities. Further, while the defendant postulates that the plaintiff will be able to do “light jobs” after being aided by such charitable organisations, the OzWorks Report places a large heaping of qualifiers and caveats on the type of job that the plaintiff could conceivably do. Specifically,one which is simple and repetitive, highly structured, does not require independent decision-making, has low speed demandsandis not client-facing. It is difficult to imagine a job which would be able to fulfil all these multifarious requirements. I also note that the OzWorks Report does not provide any examples of the same. Even the example of a cleaner at a food and beverage establishment postulated by the defendant would not fit the bill – it would quite conceivably require independent decision-making, speed demands are unlikely to be low (for example, in a food court or hawker centre especially during peak hours) and it would be “client-facing” because of the interactions with members of the public who patronise such establishments. Further, it could also conceivably require the plaintiff to work in environments that are noisy or crowded, or both, despite his low threshold for tolerating such environments. 161 It should be noted that none of the experts relied upon by the plaintiff goes so far as to say that the plaintiff will never be able to earn any money in the future. Rather, the focus of their evidence is on whether he will be able to work independently and remain gainfully employed. Bearing in mind the severe impairment to almost all of the plaintiff’s cognitive domains including his low IQ and severe amnestic disorder, it is, in my judgment, reasonably clear that the plaintiff cannot do any real work apart from the simplest of tasks. Nor was there any medical evidence led by the defendant to support its assertion that the plaintiff can effectively undertake the “light job” of a cleaner in a food and beverage establishment. 162 This case appears to me to involve a situation not unlike that envisaged by the Court of Appeal inLee Wei Kong(at [27]) where a plaintiff’s ability to work has “effectivelybeen destroyed” [emphasis added]. Common sense would lead to the conclusion that in the case before me, it will only be a “very exceptional employer”, prompted perhaps by compassion (such as a charitable organisation or the plaintiff’s friends or family), who will employ the plaintiff to do the simplest of tasks. In the circumstances and based on the evidence before me, I find it intuitively unfair to make any deductions to the plaintiff’s award for loss of future income premised on the unascertained, hopeful future compassion of others, and I decline to do so. 163 In my judgment, the plaintiff cannot realistically obtain or retain any employment and I therefore will not make any deduction on account of the plaintiff undertaking “light jobs”. My later analysis thus proceeds on the basis that the plaintiff ought to be compensated for the effective loss of hisentirecapacity to work. 164 For completeness, I should also mention that income tax is ordinarily deducted from the multiplicand on the basis that the purpose of tortious damages is to place the plaintiff back in the position he would have been but for the accident (seeTeo Sing Keng and another v Sim Ban Kiat[1994] 1 SLR(R) 340 at [34] and more recently,Foo Chee Boon Edward v Seto Wei Meng[2021] SGCA 92 (“Foo Chee Boon”) at [57]). This has been deducted by the plaintiff even though the defendant has not asked for it.134Foot Note 134×PCS para 3.24. (2) The plaintiff’s projected yearly income but for the accident 165 The plaintiff’s education and vocational background is laid out at [6]–[10]. I am of the view that the plaintiff would, more likely than not, have completed his Computer Engineering course in Singapore Polytechnic and the defendant is also prepared to accept this.135Foot Note 135×DCS para 128(a) - (b).However, it would, on the available evidence, be a stretch to say that he would have also gone on to university, undertaken a course of study, and completed it to successfully obtain a degree that would enable him to work as a chemical, electrical or electronics engineer (ie,the roles put forth by the plaintiff and Mr Potter).136Foot Note 136×PCS para 3.26.The only evidence that the plaintiff has marshalled in support of his claim to a university education is as follows: (a) Ms Ashikin’s testimony that the plaintiff had aspirations to be a chemical engineer, computer engineer or an employee of Pfizer Asia Pacific Pte Ltd.137Foot Note 137×PCS para 3.6. (b) The fact that Ms Ashikin had also graduated from university, albeit in a different field of study,ie, psychology and sociology. (c) The testimonial from his lecturer Mr Siew dated 17 April 2012 that the plaintiff is likely to succeed in whatever career he chooses. (d) His good work performance at Pfizer Asia Pacific, Singapore Press Holdings, Hyper Communications and during National Service. (e) His academic performance prior to the accident. 166 In my judgment, none of these pieces of evidence shows that the plaintiff would have gone on to apply forand successfully obtaina degree, much less points to a specific degree in a branch of engineering. Ms Ashikin agreed on the stand that there is no evidence to show that the plaintiff will make it to university.138Foot Note 138×NE 10 Nov 2020 104:29 – 30.Mr Potter also conceded that his report did not have any statistics showing:139Foot Note 139×NE 1 Dec 2020 19:8 – 32. (a) The chances of an individual graduating with a degree in computer engineering after successful entry into the course. (b) The chances of a graduate from Singapore Polytechnic completing a degree course in any university. 167 The plaintiff’s projected yearly income must therefore be assessed on the basis that but for the accident, he would have gone on to obtain his Diploma in Computer Engineering and to work in the computer engineering industry – a position that the defendant also accepts.140Foot Note 140×DCS para 128(c).For the purposes of the analysis below, I reject all of the plaintiff’s analyses that are premised on the plaintiff obtaining a university degree. 168 There are both evidential and logical difficulties with the approaches ofbothparties in calculating the multiplicand for the future loss of income. 169 The defendant uses $2,435 as the median starting salary of a computer engineering polytechnic graduate (as stated in the Ministry of Manpower Yearbook of Manpower Statistics 2019 annexed to Mr Potter’s Report)141Foot Note 141×BAEIC Vol 5 p 1810.to derive a base annual salary of $29,220. It then claims that it is “reasonable to assume” that the plaintiff would have been promoted every five years from July 2018 and received an increment every five years until he reaches a “glass ceiling” of $4,500. This glass ceiling argument is made on the basis that afresh entryuniversity graduate in computer engineering would earn a median starting salary of $4,000 and if a polytechnic graduate’s salary were to exceed this significantly, it would make more sense for the employer to hire a fresh university graduate instead.142Foot Note 142×DCS para 137.There are glaring difficulties with this argument. I list but two. (a) First, this assumption is on flimsy ground because the defendant has producedno evidenceof any such alleged glass ceiling, nor provided any evidence or reason for its assumption that the promotions/increments would occur only every five years. (b) Second and more importantly, it is illogical to contend that an employer wouldalways prefera fresh graduate withno experienceor any track record of service over anexperienceddiploma holder who has proven both his or her loyalty and worth to the company through years of service, simply because it may be cheaper to hire a fresh graduate. The comparison drawn by the defendant is inapposite. 170 Theplaintiff’sapproach143Foot Note 143×PCS para 3.18 – 3.40.is also problematic, but for different reasons. While Mr Potter’s figures and calculations appear to me to be sensible, the plaintiff’s application of the same causes difficulties. 171 Mr Potter eschewed the use of the $2,435 median figure above on the basis that:144Foot Note 144×PCS para 3.20. if this figure were to be used for a loss calculation then it would significantly understate [the plaintiff’s] loss, since it would not take account of the promotions and non-inflationary wage increases that [the plaintiff] would almost certainly have achieved over the course of his working life. Mr Potter postulates that the plaintiff could have taken on the following jobs with the following average salaries (perdata from the Ministry of Manpower (“MOM”)) as tabulated below.  172 Mr Potter used the “Median” monthly salary “[i]n the absence of any evidence to suggest that [the plaintiff] would have achieved earnings above or below the median for the occupations which appear to fit most closely with his qualifications and career aspirations”.145Foot Note 145×PBOD Vol 1 p 338 [Mr Potter’s Report at para 3.13].As the above figures from MOM did not factor in deductions for income tax, and additions for bonuses, wage increments and employer CPF contributions across the years, these were factored into the calculations within Mr Potter’s Report.146Foot Note 146×PBOD Vol 1 p 338 – 339 [Mr Potter’s Report at paras 3.14 – 3.17].On the stand, however, Mr Potter conceded that he had failed to account for the fact that the rate of employer CPF contribution differs between the ages of “Up to 55”, “56 – 60”, “61 – 65” and “66 – 70”.147Foot Note 147×NE 1 Dec 2020 59:23 – 28, 60:18 – 32.As such, Mr Potter prepared an addendum which included different multiplicands for each age range, which I reproduce below.  173 The plaintiff leverages on these calculations to derive a single multiplicand of $61,665.88 (in the case where no university degree is obtained). This figure was arrived at using the following calculation:148Foot Note 148×PCS para 3.27.  174 There are two glaring problems with the plaintiff’s methodology: (a) First, the plaintiff was enrolled in a polytechnic course forcomputer engineering.While he had completed the Chemical Process Technology (Pharmaceuticals) course in ITE, and the Electronics Engineering course in Higher NITEC, these were respectively six and three years prior to the accident. I do not think any link can reasonably be drawn that the plaintiff would have gone on to work as a chemical engineering technician. This is especially since the median annual pay for chemical engineering technicians routinely exceeds that of computer technicians by a considerable margin. The plaintiff has not adduced any evidence to suggest that both professions are so similar with interchangeable skillsets that individuals who complete diploma courses in computer engineering are able or likely to embark on either career path. (b) Second, the plaintiff’s methodology of taking the average of the median annual pay for computer technicians/chemical engineers across the periods of “Up to 55”, “56 – 60”, “61 – 65” and “66 – 70” to derive a single multiplicand is overly simplistic. The different time periods consist ofdifferent numbers of years. For example, the “Up to 55” band consists of 28.5 years given Mr Potter’s assumption that the plaintiff “would have commenced work shortly [after graduating from his Computer Engineering course at Singapore Polytechnic in March 2018], on 1 May 2018” (ie,at approximately 26.5 years old).149Foot Note 149×PBOD Vol 1 p 336 (Mr Potter’s Report at paras 3.4 – 3.5).In contrast, the other time bands consist of only four or five years each. The average, if any, should be aweightedaverage and not a simple average of the four figures. 175 Having perused the differing methods proposed by both sides, I consider Mr Potter’s methodology to be fairer and sounder given that it derives from MOM data and factors in income tax, CPF contribution rates across different years, as well as bonuses and wage increments. I note also that the defendant is not disputing that the plaintiff would have been promoted and would have received wage increments (albeitonly every five years, and only until the plaintiff reaches a “glass ceiling”). I therefore adopt Mr Potter’s methodology as a starting base. 176 It has not escaped my attention that Mr Potter’s Addendum was only produced after trial. However, I do not think this is material given that the only alteration in Mr Potter’s figures is to account for differing employer CPF rates in the different age bands – this corrects a flaw in Mr Potter’s earlier methodology which was pointed out by Mr Wee during cross-examination and which Mr Potter accepted as requiring an adjustment. Furthermore, this revised calculation results in areductionof Mr Potter’s calculated figures by 1% – 2%, which is to the defendant’s benefit.150Foot Note 150×Mr Potter’s Addendum at para 1.13.I therefore adopt it but with some further tweaks to determine the multiplicand. 177 I have also considered that Mr Potter’s methodology uses the industry average pay but also factors in wage increments over the years. This, in my view, does not constitute double-counting (nor does the defendant make any submission to this effect) because Mr Potter’s multiplicand does not actually factor in promotions and the yearly bonuses that will likely accompany them. These are distinct from one’s monthly salary or general wage increments. The court adjudicates on the basis of the arguments advanced by the parties, and in the absence of a more concrete and feasible methodology proposed by the defendant, I am of the view that the wage increments serve as a close enough proxy to account for promotions across the years and bonuses. 178 The plaintiff’s projected annual income should be based on the median salary of acomputer technician. After adjusting for income tax, differential CPF contribution rates, bonuses and wage increments, there are four multiplicands to be used here as derived from Mr Potter’s calculations:151Foot Note 151×Mr Potter’s Addendum at para 1.8. AgesMultiplicands26 to 55$      51,092.0056 to 60$      49,334.0061 to 65$      47,575.0066 to 70$      46,916.00 Periods of loss 179 I first determine the number of years of loss. The plaintiff was born on 6 September 1991. He was 23 years old at the time of the accident. His three-year Computer Engineering course at Singapore Polytechnic was due to commence in April 2015 and but for the accident, he would have expected to graduate and obtain his Diploma in Computer Engineering sometime in March or April 2018 at the age of approximately 26 years old. 180 In accordance with s 4 of the Retirement and Re-employment Act (Cap 274A, 2012 Rev Ed) (“RRA”), the minimum statutory age of retirement is currently 62 years old. Sections 7 and 7A of the RRA require an employer to offer re-employment to an employee who reaches 62 years of age until the employee turns 67 years old. The plaintiff argues that given the Prime Minister’s announcement during his National Day Rally speech in 2019 that the retirement and re-employment ages would be raised to 65 and 70 years of age respectively by 2030, it is reasonable to assume that the plaintiff would be employed till the age of 70.152Foot Note 152×PCS para 3.34; PBOD Vol 1 405 (Mr Potter’s Report at Appendix 13 p 10).I agree that this is a reasonable assumption to make given that in today’s context, there is a growing incidence of people continuing to work after their official retirement age. This is also a trend that is being encouraged by the Government on account of Singapore’s ageing population. 181 For completeness, I have also taken note of similar statements made recently in Parliament in November this year, when the RRA was amended, reiterating the Prime Minister’s statement that the retirement and re-employment ages for Singapore workers would be raised progressively to 65 and 70 years, respectively. These statements lend further support to my view above at [180]. 182 The relevant dates for the calculation of pre-trial and future loss of income are thus as follows: EventDateAgeBirth6 September 19910 yearsAccident3 April 201523 years and 6 monthsGraduation with Diploma in Computer EngineeringApril 201826 years and 6 to 7 monthsEntry into workforce6 May 201826 years and 8 monthsTrial6 May 202129 years and 8 monthsRetirement6 September 206170 years 183 I have provisionally fixed the date of trial as 6 May 2021solelyfor ease of calculation – this date being eight months after the plaintiff’s 29th birthday, itself being a date which is linked to retirement age (see table above at [182]).I stress that my choice of this date as the date of trialshould notbe seen as an acknowledgment that the hearing had effectively continued past 1 April 2021 such that the PIRC Tables are applicable to determine the plaintiff’s claim.I have fixed the date of the plaintiff’s entry into the workforce as 6 May 2018 because it is, in my view, reasonable to assume that the plaintiff would start work soon after graduating from the polytechnic in March or April 2018. Pre-trial loss of income 184 Pre-trial loss of income spans a period of exactly three years (ie,from 6 May 2018 to 6 May 2021). To recap, the plaintiff has not asked for any pre-trial loss of income because his case is that he would have only begun working in 2021 (ie,after obtaining a university degree) such that there would be no pre-trial loss of income. 185 Pursuant to the multiplicand for the age band up to 55, the plaintiff should receive$153,276(ie,$51,092 x 3 years). Multiplicand for future loss of income 186 Future loss of income is calculated from 7 May 2021 when the plaintiff is 29 years and 8 months old, to 6 September 2061 when the plaintiff turns 70. This translates to 40 years and 4 months’ worth of future losses, as illustrated in the table below. AgesMultiplicandsNumber of years29 years and 8 month to 55 years$      51,092.0026 years and 4 months56 years to 60 years$      49,334.005 years61 years to 65 years$      47,575.005 years66 years to 70 years$      46,916.004 years For clarity, there is only a four year period between the ages of 66 to 70 because the plaintiff is deemed to stop workingonthe day he turns 70. Unlike years where the plaintiff turns 55, 60 and 65, the plaintiff does not continue to work for the full year after he turns 70. 187 The weighted average for the overall multiplicand is arrived at as follows:. Multiplier for future loss of income 188 In the sections below, I will consider three methods for determining a suitable multiplier. These are the precedent and arithmetic approaches asjuxtaposedwith the actuarial approach (ie,referencing the PIRC Tables purely for comparison purposes). 189 For the avoidance of doubt, I do not adopt Mr Potter’s calculations of the multiplier and his proposed multiplier. First, as the defendant rightly pointed out, Mr Potter had admitted on the stand that part of his calculations were based off the United Kingdom’s Ogden Tables (“Ogden Tables”) which are not applicable in Singapore. Further, the particular version that he had relied upon is the 2011 version which is now approximately ten years out of date.153Foot Note 153×DCS para 111c. 190 Second, Mr Potter’s calculations also relied heavily upon the actuarial tables found in WS Chan, FWH Chan and JSH Li,Personal Injuries Tables Singapore 2015(Sweet & Maxwell, 2014) (“2015 Tables”).154Foot Note 154×PBOD Vol 1 pp 341 and 354 - 359 (Mr Potter’s Report at para 4.1 and Appendix 3); NE 1 Dec 2021 20:1 – 26.The 2015 Tables have not attained the status of authoritativeness (seeChristian Pollmannat [31] citingKenneth Quekat [51] and [80]), and are based ondatedlife expectancy data. The 2015 Tables were published in November 2014 and were based on demographic data from 2012 (seeChristian Pollmannat [23]). Much like the Ogden Tables, close to ten years have passed since then and it would not, in my view, be safe to place complete or even considerable reliance upon the 2015 Tables. 191 Crucially, Mr Potter uses the 2015 Tables and the Ogden Tables to provide alternative multiplier calculations based on a 2% discount rate and a 4.5% discount rate. While the 4.5% discount rate can be accepted on the basis of precedent, a 2% discount rate is, in my view, straying too far and would represent a radical and sweeping departure from the traditional discount rate range of 4% – 5% under the conventional approach, a departure which our apex court has repeatedly cautioned against (seeEugene Laiat [37]–[38] andKenneth Quekat [59]). Furthermore, little analysis has been provided for this specific figure, whether in terms of macroeconomics or otherwise, apart from the contention that this is “more representative of the real returns potentially available to [the plaintiff] through investing any damages awarded in CPF accounts or investments generating similar returns”.155Foot Note 155×PBOD Vol 1 p 341 – 342 (Mr Potter’s Report at para 4.6).This statement, on its own, is entirely insufficient. (1) PIRC Tables 192 The total multiplier, based on the PIRC Tables, is 25.08 years for a period of 40 years and 4 months. When applied to the four multiplicands, this gives a total award of $1,267,293.40. Start of periodEnd of periodAgeMultiplicandsComments on calculation of multiplierMultiplier (in years)Award6-May-216-Sep-2129 and 8 months to 30$51,092.00Divide by 3 for 4 month period, no discount given the proximity of time1/3$17,030.666-Sep-216-Sep-4630 to 55$51,092.00Table 1 - 619.86$1,014,687.126-Sep-466-Sep-5156 to 60$49,334.00Table 1 - 6 (21.97-19.86)2.11$104,094.746-Sep-526-Sep-5661 to 65$47,575.00Table 1 - 7 (23.57 - 21.97)1.6$76,120.006-Sep-576-Sep-6166 to 70$46,916.00Table 1 - 7 (24.75 - 23.57)1.18$55,360.88Total25.08$1,267,293.40 (2) Precedent approach 193 InKenneth Quek,the Court of Appeal stated that the discountratesthat are embedded or implicit in the precedent cases provide for more meaningful and accurate evaluations of different cases as opposed to the discountamounts(at [97]). 194 In line with the Court of Appeal’s approach and adopting three of the precedents used inKenneth Quek, I set out a table of the most relevant precedents and the annualised discount rates implicit therein (net of contingencies). S/NCase nameRemaining working life (in years)Multiplier for loss of income (in years)Discount ratesReference1Lee Wei Kong43204.27%Kenneth Quekat [98]2Kenneth Quek4320Either 4.21% or 4.27%Kenneth Quekat [100]3Teo Ai Ling42204.21%Kenneth Quekat [98]4Hafizul36175%Kenneth Quekat [98] 195 The most relevant precedents are the first three. The claimants in those cases were young individuals who had long remaining working lives of over 40 years at the time of the assessments of damages. A further consideration stated inKenneth Quekis whether the claimant is likely to stay in Singapore for the remainder of his or her working life (at [99]). If, for example, like the claimant inHafizul,the plaintiff here wishes to go overseas, a further discount to account for contingencies ought to be imposed upon the multiplier. There is no indication that the plaintiff intends to go or live overseas. Like the claimants in the first three cases, the plaintiff is a Singapore citizen. 196 Having regard to the first three precedents, it would appear to me that strictly speaking, an appropriate multiplier ought to be just shy of 20 years because the claimants in those cases have at least one and a half more years of working life remaining than the plaintiff. However, in my judgment, a slight revision upwards up to 20 years is amply justified on the basis that all three precedents are slightly dated.Kenneth Quekwas decided on appeal in 2017, whileTeo Ai LingandLee Wei Kongwere respectively decided in 2010 and 2012. InKenneth Quek,the Court of Appeal implicitly recognised that the multipliers based on discount rates of 4% – 5% had been artificially low because the prevailing rates of return on fixed deposits were below 4% per annum and had already remained so for 15 years (at [55]). This was four years ago, and the present economic situation looks far bleaker than that in 2017 due to the COVID-19 pandemic. Further, steps have already been taken to drastically reform the calculation of multipliers and to revise them upwards to reflect the low interest rate environment through para 159 of the Supreme Court Practice Directions which mandate that the PIRC Tables will, generally, be used to determine an appropriate multiplier for all personal injury and death cases heard on or after 1 April 2021. (3) Arithmetic approach 197 The formula for calculating a multiplier was helpfully laid out inChristian Pollmannat [77]–[78] (as upheld on appeal in AD 56): 77 The mathematical formula for the present value of an ordinary annuity is as follows:. In this formula,PVis the present value of the annuity,Pis the value of each periodic payment,ris the interest rate andnis the number of payments. This formula is the mathematical equivalent of the formula which the Court of Appeal used to derive the discount rate implicit in a multiplier selected using the precedent approach (Kenneth Quekat [72]). 78 The multiplier/multiplicand method also seeks to yield the present value of an ordinary annuity, albeit by a different route than the arithmetic method. Therefore, it is mathematically valid to set the two formulas equal to each other thus:If the value of each constant payment isin the first formula and is thein the second formula, then thein the first formula must necessarily equalin the second formula. In this formula,ris thediscount ratewhich I have selected of 4.25% per annum …andnis the number of periods comprised in the duration of the plaintiff’s loss of earnings,ie,21 years …. Inserting these values into the formula yields a multiplier of 13.71. [emphasis in original] 198 To juxtapose the multiplier derived from the arithmetic approach with that derived from the PIRC Tables (ie,25.08 years) and the precedent approach (ie, approximately 20 years based on a discount rate of 4.21% or 4.27%), I have created a list of combined multipliers based on differing discount rates. These multipliers can then be split up according to the four multiplicands across the different years of the plaintiff’s life. Applying the formula above,ris the discount rate,nis 40.333 years (approximately, 40 years and 4 months). Discount rateMultiplier (in years)Comments2.00%27.504The discount rate employed in Mr Potter’s analysis2.50%25.225-3.95%20.010A slight reduction of 0.05% from the traditional 4%–5% discount rate range4.00%19.860Lowest point in the traditional 4%–5% discount rate range4.21%19.251Discount rate inTeo Ai Ling4.27%19.083Discount rate inLee Wei Kong4.5%18.457Mid-point between the traditional 4%–5% discount rate range5.00%17.205The highest point in the traditional 4%–5% discount rate range 199 It should be noted that while the cases ofTeo Ai LingandLee Wei Kongare mentioned in the table above, reference is madeonlyto the discount rate used therein. The multipliers will necessarily be different given that the period of future loss used here (ie,n = 40.333 years) is not the same as in those cases (cf. Kenneth Quekat [72]). 200 As mentioned above at [196], if the precedent approach is used, the multiplier should strictly speaking be slightly lower than 20 years. This is illustrated by using the same discount rates as found in the three precedents (ie,4.21% and 4.27%). The lowest traditional discount rate of 4% will yield a multiplier just shy of 20 at 19.860 years. It is only if the discount rate is drastically reduced to 2.5% that a multiplier close to 25 years can be obtained. In the absence of the application of the PIRC Tables, such a figure would falltoofar outsidethe traditional discount rate range of 4% – 5%. I reiterate the Court of Appeal’s repeated admonishment that radical and sweeping revisions to the discount rate on account of accelerated receipt lie within the province of Parliament (Kenneth Quekat [59]) and not the courts. I thus eschew such a drastic reduction of the discount rate in this case, especially when there is also an absence of any expert actuarial or financial evidence independently justifying such a reduction. 201 Nonetheless, bearing in mind that the law has recently recognised the present lower rates of return on investment (and hence the lowered discounts for accelerated receipts) and incorporated these considerations into the Supreme Court Practice Directions by recognising the PIRC Tables, I am of the view that it is permissible in this case to departslightlyfrom the traditional discount rate range of 4% – 5% (see above at [196]). In my judgment, an appropriate discount rate in this case is 3.95%. This generates a multiplier of approximately 20 years (rounded down to the nearest whole number) which, in my judgment, remains in line with the precedents mentioned above. 202 Accordingly, I hold that the appropriate multiplier is20 yearsfor future loss of income. Summary of the awards for loss of income 203 In summary, the plaintiff is entitled to receive a total of$1,153,736for loss of income comprising$153,276for pre-trial loss of income and$1,000,460for future loss of income, calculated as follows: Head of lossCalculationsAwardPre-trialloss of income from 6 May 2018 to 6 May 2021(see above at [185]).Multiplicand: $51,092Multiplier: 3 years$153,276Futureloss of income from 7 May 2021 to 6 September 2061(see above at [186]–[187] and [202])Multiplicand up to 55 years (26 years and 4 months): $51,092Multiplicand up to 60 years (5 years): $49,334Multiplicand up to 65 years (5 years): $47,575Multiplicand up to 70 years (4 years): $46,916$1,000,460($50,023 x 20)Weighted average for the overall multiplicand for future loss of income:.Multiplier for future loss of income:20 yearsTotal loss of income:$1,153,736",
        "Loss of marriage prospects": "204 The parties agree that this should be quantified at$10,000and I award this sum as agreed.",
        "Other future losses (remaining lifespan)": "205 The remainder of the plaintiff’s future losses concern: (a) future medical expenses (“FME”); (b) future transport expenses (“FTE”); and (c) future caregiver costs. 206 Save for short term or one-off expenses like surgery to correct the plaintiff’s left lid ptosis and left contour deformity, these future losses are pegged to the plaintiff’s remaininglifespanand correspondingly require a separate multiplier. 207 The plaintiff submits that the appropriate multiplier is 26 years. This is calculated on the basis that the plaintiff is 28 years old. Given that the average life expectancy of a Singaporean male based on official statistics from the Singapore Department of Statistics is 81.4 years, he has a remaining life expectancy of 53 years. The plaintiff recognises that a multiplier of 20 years was applied inLee Wei Kong,but submits that this would undercompensate the plaintiff in the light of the PIRC Tables. The plaintiff therefore uses the PIRC Tables which gives a multiplier of 26.38 years, which he rounds off to arrive at a multiplier of 26 years.156Foot Note 156×PCS paras 4.22 – 4.26 [FTE], 6.8 [Future Caregiver costs].This is applied to both FME and future caregiver costs. The plaintiff does not use a multiplier for FTE. 208 The defendant on the other hand submits that the multiplier should be 18. It considers that as at 8 April 2021, the plaintiff would be 29 years old and states that his life expectancy is 73.5 years. It also takes reference from the case ofTV Media Pte Ltd v De Cruz Andrea Heidi[2004] 3 SLR(R) 543 (“TV Media”), in which a multiplier of 17 years was given to a 29-year-old claimant.157Foot Note 157×DCS paras 163 – 164. Analysis and decision on the multiplier 209 The multiplier ought to be pegged to the remaining life expectancy of the plaintiff. This in turn is to be determined by subtracting the plaintiff’s age at the time of the assessment of damages (notionally taken to be 6 May 2021 – see above at [183]) from the life expectancy of the average male Singapore citizen (Kenneth Quekat [68] andLee Wei Kongat [52]). 210 Based on data from the Singapore Department of Statistics submitted by the plaintiff,158Foot Note 158×PCS para 4.23.the average life expectancy of a male Singaporean born in 2019 is 81.4 years. The life expectancy of a male Singaporean born in 1991 is 73.5 years. InKenneth Quek,although the claimant was, like the plaintiff here, also born in 1991 (at [2]), the Court of Appeal did not use a life expectancy of 73.5 years, but instead looked to precedents which typically used 75 years as the average life expectancy of a male claimant in Singapore (at [69]), and eventually took a conservative estimate of 74 years because counsel was prepared to accept that figure. The plaintiff’s counsel makes no such concession here but nonetheless, I am of the view that 75 years is an appropriate figure to use. 211 Thus, for the purposes of the subsequent analysis, the plaintiff is taken to live up to 6 September 2066 (ie,his 75th birthday). Using the same provisional date of 6 May 2021 as the date of trial, the plaintiff (at the age of 29 years and 8 months) can expect to live for a further45 years and 4 months. (1) PIRC Tables 212 The four months from 6 May 2021 to 6 September 2021 needs no discount rate given the proximity to the present time. The multiplier for this period is therefore 1/3 of a year. 213 Having regard to the PIRC Tables, the plaintiff’s age at the start of payments (ie,7 September 2021) is 30 years old. At the end of the payments, he will be 75 years old. The multiplier for this is 25.58 years. 214 The combined multiplier is therefore 25.91 years. (2) Precedent approach 215 InKenneth Quek,the Court of Appeal had regard to various precedents and found that claimants with remaining life expectancies of approximately 50 years have received FME multipliers of between 17 and 20 years, while those with remaining life expectancies of between 30 and 35 years have received FME multipliers of between 15 and 18 years (at [71]). The Court of Appeal then went on to derive the annual discount rates for each of the precedents it had analysed. (a) InTV Media, a claimant with a remaining life expectancy of 51 years received a 17-year multiplier. The discount rate was 5.89%. (b) InLee Wei Kong,the claimant with a remaining life expectancy of 53 years received a 20-year multiplier. The discount rate was 4.80%. (c) InNg Song Leng,a claimant with a remaining life expectancy of 35 years received a 17-year multiplier. The discount rate was 5.10%. (d) InHafizul,a claimant with a remaining life expectancy of 34 years received an 18-year multiplier. The discount rate was 4.51%. (e) InTan Juay Mui,a claimant with a remaining life expectancy of 32 years received a 17-year multiplier. The discount rate was 4.78%. (f) InEugene Lai,a claimant with a remaining life expectancy of 30 years received a 15-year multiplier. However, the court there held that this award was “perhaps on the low side”. The discount rate was 5.72%. 216 After the Court of Appeal considered the precedents, it held that as the claimant inKenneth Quekhad a 50-year remaining life expectancy, it would be appropriate to use a discount rate of 4.8%. It again cautioned against the use of discount rates significantly outside the 4% – 5% range (at [78]–[79]). 217 In my judgment, these precedents display a general trend of the discount rates for awards pegged to a person’s remaining life span (eg,FME) being higher than those for loss of future income. This is not entirely surprising – the further into the future that losses must be projected into, the greater the discount necessary to account for the accelerated receipt of money as well as other vicissitudes of life. In my judgment, a slight uplift in the multiplier for FME is warranted for the same reasons elucidated at [196]. A reasonable multiplier is somewhere slightly above 20 years. (3) Arithmetic approach 218 Applying the same formula for calculating the multiplier as laid out inChristian Pollmannat [77]–[78] (as reproduced above at [197]),ris the discount rate andnis 45.333 (approximately 45 years and 4 months), I derive the following multipliers: Discount rateMultiplier (in years)Comments2.00%29.625The discount rate employed in Mr Potter’s analysis2.60%26.448The single discount rate that will yield a figure closest to the multiplier of 26.38 as proposed by the plaintiff.159Foot Note 159×PCS para 4.25.2.70%25.968The single discount rate that will yield a figure closest to the multiplier of 25.91 per the PIRC Tables (see [214] above).3.50%22.565-4.00%20.776Trough of the traditional range4.05%20.609-4.50%19.201-5.00%17.810Peak of the traditional range5.10%17.551The discount rate inNg Song Leng(see [215(c)] above). 219 It should be noted that whileNg Song Lengis mentioned in the table above, reference is madeonlyto the discount rate used therein. The multipliers will necessarily be different given that the period of future loss used here (ie,n = 45.333 years) is not the same as that inNg Song Leng. 220 Based on the precedents at [215], the discount rates for past cases range from 4.51% to 5.1%. I have disregarded the discount rates of 5.89% and 5.72% inTV MediaandEugene Lairespectively as both appear to be out of sync with the rest of the precedents. The Court of Appeal inEugene Laiexpressly recognised that the award in that case based on the discount rate was “perhaps on the low side” (at [43]). For the same reasons stated at [196] and [201] above, I am of the view that the discount rate in this case can be lowered to 4.05%. This would give a multiplier of approximately20.6 years(to the nearest decimal place). Future medical expenses 221 The plaintiff claims $289,008.60 for future medical expenses based on a multiplier of 26 years.160Foot Note 160×PCS para 4.26.The defendant argues that a sum of $19,012 is sufficient based on a multiplier of 18 years.161Foot Note 161×DRS para 8.The only item upon which they agree is for the defendant to bear the cost of surgery to correct the plaintiff’s left lid ptosis and left contour deformity (ie,$9,400).162Foot Note 162×DRS paras 5 – 8.I tabulate the parties’ positions below: Nature of FMEPlaintiff’s positionDefendant’s positionTBI$21,608.60$0Orthopaedic injuries$154,000$534 x 18 years = $9,612Psychiatric injuries$104,000$0Left lid ptosis and left contour deformity (one-off)$9,400$9,400Total$289,008.60$19,012 (1) Decision on FME (A) TBI 222 I deal first with the plaintiff’s anticipated expenses for TBI. With respect, the defendant’s position on this point is somewhat confusing. It agrees that “the FME would be in the form of medical follow-ups (as prescribed by Dr Chua)”.163Foot Note 163×DCS para 160.However, its calculations show that it is not agreeable to giveanydamages to the plaintiff for this. 223 The plaintiff also references Dr Chua’s report dated 30 March 2020 which states that the plaintiff will require twice yearly medical follow-ups for life due to his behavioural problems due to TBI. The estimated costs at TTSH for B1 rates (inclusive of goods and service tax) are $831.10 per annum broken down as follows:164Foot Note 164×PSBOD p 1514. (a) Medical costs per year: $206 x 2. (b) Laboratory tests per year: $209.55 x 2. 224 This is a reasonable sum. The annual medical expenses for the plaintiff’s TBI is therefore allowed at$17,120.66(ie,$831.10 x 20.6 years). (B) Orthopaedic injuries 225 The plaintiff claims a total of $154,000 for orthopaedic injuries. This being calculated as follows: (a) Five years of physiotherapy 2 times a week at $175 per session = $175 x 2 x 260 weeks = $91,000. (b) Cost of medication to be prescribed 4 times a year = $350 x 4 x 5 years = $7,000. (c) Heterotrophic ossification = $10,500. (d) Special garment brace or orthotic insert for gait disturbances = ($1,500 + $250) x multiplier of 26 years = $45,500. 226 At the outset, the claim for five years’ worth ofprivate physiotherapy sessions, twice a weekis excessive. As mentioned above at [97], the plaintiff has made a significant recovery from his injuries and regained most of the function in his lower limbs. Dr Chua, the plaintiff’s rehabilitation doctor, stated as far back as September 2018 that all rehabilitation interventions were complete for the plaintiff. She testified that the plaintiff’s physical rehabilitation for motor abilities “has actually reached a near plateau” and has “reached a ceiling, in a sense”.165Foot Note 165×PBOD Vol 1 p 266; NE 25 Nov 2020 19:18-22.While the plaintiff suffers from permanent residual disabilities, he is capable of ambulating independently around the community and can even do weight training at the gym. 227 While Dr Kannan and Mr John Abraham (the senior principal physiotherapist at Rapid Physiocare Pte Ltd) have both recommended that the plaintiff continues with maintenance physiotherapy over the next five years with two sessions a week,166Foot Note 166×PCS paras 4.6 – 4.8.this seems to be a luxury rather than a reasonable necessity. Mr Abraham stated in his report dated 26 November 2019 that the plaintiff is:167Foot Note 167×PBOD Vol 1 p 312. totally independent in activities of daily living. As far as the disability and strength that his left leg offers, he can walk, climb up and downstairs independently. His left hip bone can withstand normal load stress like running and jumping. The plaintiff was also observed to be able to tolerate up to 45 minutes of exercise. While there may have been a time where the plaintiff needed intensive physiotherapy to recover from his injuries, that time has long passed. The opinion of Mr Abraham that the plaintiff “is much moreindependent andcooperates well in the exercise program at homeas well” [emphasis added]168Foot Note 168×PBOD Vol 1p 312.shows that the plaintiff is capable of being independent in ensuring his own physical rehabilitation. 228 I am of the view that Dr Chua’s evidence is to be preferred over Dr Kannan’s. Dr Chua is the plaintiff’s rehabilitation doctor who has continuously seen and assessed him on numerous occasions from 2016 to 2020. Dr Kannan made it clear that his opinion on the plaintiff’s need for twice-weekly physiotherapy sessions for five years is for the purpose of “assessing him so that he does not deteriorate”.169Foot Note 169×NE 30 Nov 2020 33:27-28.While Dr Kannan is an orthopaedic surgeon with a sub-speciality in lower limb injuries, this is more properly a matter concerning long-term rehabilitation. Dr Kannan conceded that he is not a trained rehabilitation specialist like Dr Chua and that he would defer to her in matters of rehabilitation.170Foot Note 170×NE 30 Nov 2020 34:19 – 27.Pertinently, Dr Kannan stopped short of saying that the plaintiffwould requiresuch intensive physiotherapy and in fact acknowledged that the plaintiff “may need” such maintenance physiotherapy and that equally, the plaintiff “may not” need it [emphases added].171Foot Note 171×NE 30 Nov 3030 34:10-13. 229 I add that Dr Chua was alive to the need to ensure that the plaintiff’s condition does not deteriorate into the future. She termed it “secondary decline” which, in her experience, sometimes occurs in patients with injuries that are in the “worst 10%”. Dr Chua’s evidence on this is material and bears reproducing in full:172Foot Note 172×NE 25 Nov 2020 20:19 – 21:23. QThank you. So, clearly, if somebody says, well, you know, he needs another 5 years, 10 years, the rest of his life physiotherapy, that doesn’t seem quite right, does it?APatients of this nature, sometimes we get an issue of secondary decline.QUnderstand.AA patient who has such a severe injury as him, I mentioned that he belongs to the worst 10% of injuriesQOkay.AIt is important that they maintain a fitness.QUnderstand.ASo you can argue that intermittent reviews with a physiotherapist are possible.QUnderstand.AIt may not even be a physiotherapist. It can be a trainer in a gym.QUnderstand.AI’ve advocated two visits a year which I usually do for all my severely injured TBIs.QUnderstand.AThe purpose is actually to ensure that they are coping and functioning well.QUnderstand.AThere are psychosocial stressors that sometimes come upon the patient. It’s part of life. We also need to look out for late complications that can appear, alright. And there are a variety of these.QUnderstand.…QBecause you have gone a bit too far on what my question is. My question is basically: If somebody says ‘physiotherapy consistent, every week, three times a week, next 10 years, next 5 years’, that doesn’t sound quite right. Would that be correct for me to say that?ACurrently, I don’t think he needs that intensity unless there is a new problem.QThank you. So let me just get your evidence right so that I can understand this, okay. He has plateaued physically and as far as community walking is concerned. Alright.AYesQDo you agree with that?AYes. 230  Balancing the fact that the plaintiff has recovered well from his injuries and is independent in all motor ADL, with the fact that the plaintiff suffers from residual disabilities and faces a chance of secondary decline due to the severity of his injuries from the accident, I find that the plaintiff should be allowed to have two intermittent reviews a year with a physiotherapist for up to five years,perDr Chua’s advice and recommendation which I accept. These sessions can also help to serve as maintenance physiotherapy as advocated for by Dr Kannan. The five-year duration is justified on the basis of Dr Kannan’s evidence that there is a “phase to muscle memory” and “most of the studies out there have a 5-year follow up as opposed to a 15-year follow up”.173Foot Note 173×PCS para 4.11. 231 There is no need to apply any discount rate to this as five years is not very far into the future. As such, bearing in mind Dr Kannan’s evidence that the cost for 1 hour of physiotherapy in a hospital at B1 rates is around $80,174Foot Note 174×PBOD Vol 1 p 322.the FME for the plaintiff’s physiotherapy would be$800(ie,$80 x 2 times a year x 5 years) and I award this sum accordingly. 232 As for Dr Kannan’s opinion that the plaintiff will require medications on a three-monthly basis, which would cost about $150–$200 at B1 rates or $280–$350 at private patient rates, I was unable to find any elucidation in Dr Kannan’s report as to what these medications are for; nor was there any illumination provided in oral testimony or the plaintiff’s submissions. In the absence of justification, I am not persuaded that this claim for future medication amounting to $7,000 ($350 per prescription x 4 times a year x 5 years) can be sustained. Accordingly, I disallow it. 233 The plaintiff also claims for special garment braces and orthotic inserts for gait disturbance across the remaining years of the plaintiff’s life (ie,$1,500 + $250) x multiplier of 26 years = $45,500). This is based on Dr Kannan’s opinion in his medical report dated 3 February 2020 that:175Foot Note 175×PBOD Vol 1 p 322. To counter his subtle gait disturbance, he may require a special garment braceoran orthotic insert.This needs to be assessed with long term follow up.Such a customized orthotic brace may cost about $1000-$1500. A de-rotation garment brace is about $200-$250. Since the garment and orthotic is worn daily, it may very well be subject to wear and tear requiring refitting or replacement at various points in his life approximately once every 1 to 1.5 years depending on usage. [emphasis added] 234 In my view, the plaintiff’s claim for this head of loss is inflated. Dr Kannan did not opine that the plaintiff neededbotha garment brace and an orthotic insert. Rather, his evidence is thateither onemay be necessary. 235 That said, the defendant did not challenge or question Dr Kannan’s opinion on this during cross-examination and is taken to have accepted it at face-value.176Foot Note 176×PRS para 1.97.In my judgment, it would be reasonable to grant the plaintiff the cost of the lower value garment brace at $200 in the light of his permanent residual disabilities that have affected his gait. I have allowed the lower cost garment brace because Dr Kannan was somewhat equivocal in his opinion on whether the garment brace or orthotic insert would benecessary. His exact words were that “[t]his needs to be assessed with long term follow up”. 236 This being the case, the plaintiff is in my judgment entitled to $200 annually for a de-rotation garment brace, multiplied by 20.6 years. This works out to a sum of$4,120which I allow. 237 As for heterotrophic ossification, I agree with the plaintiff that he should be entitled to $10,500 (one-off) to correct this via surgery. While Dr Kannan did not say that the plaintiff currently has heterotrophic ossification, he opined that the likelihood of the plaintiff developing this is more than 50% as there is already some evidence of progressive stiffness developing in the plaintiff’s left hip177Foot Note 177×PRS para 1.96. Dr Kannan estimated that in a B1 restructured hospital setting, such an operation would cost would between $10,000 and $11,000 excluding implants and hospitalisation charges. 238 Given that the defendant did not specifically challenge Dr Kannan’s evidence on this front,178Foot Note 178×PRS para 1.96.I accept that the plaintiff should be entitled to this one-off expense at$10,500. 239 To summarise, the plaintiff’s FME award for orthopaedic injuries is$15,420broken down as follows: (a) Physiotherapy sessions 2 times a year for 5 years : $80 x 2 x 5 years = $800. (b) Garment brace to be replaced once a year: $200 x 20.6 years = $4,120. (c) One-off surgery to counteract heterotrophic ossification: $10,500. (C) Psychiatric injuries 240 The plaintiff claims the costs of life-long psychiatric treatment at $4,000 a year based on Dr Chan’s medical report dated 25 September 2020. In the light of the fact that the plaintiff has now developed PDD alongside behavioural issues associated with TBI, and the fact that the defendant did not challenge Dr Chan’s statement that “psychiatric treatment for behavioural management is expected to be lifelong”, I agree and accept that the plaintiff ought to receive$82,400for this claim, being $4,000 multiplied by 20.6 years. Future transportation expenses 241 The plaintiff claims a total of $25,350 for future transport expenses. He submits that he will have to take 845 trips related to his future medical expenses (ie,26 annual lab tests for TBI, 480 trips for physiotherapy sessions, one trip for the ossification surgery, 26 trips to replace his garment brace and 312 trips for psychiatric treatment) and that each round trip is expected to be $30.179Foot Note 179×PCS paras 5.1 – 5.2.The defendant submits that the plaintiff will only need to make two trips each year and each round trip is expected to cost $50.180Foot Note 180×DCS paras 167 – 168.Nonetheless, it is willing to concede a sum of $7,500.181Foot Note 181×DCS para 181. 242 As I have rejected the plaintiff’s argument that he will require twice weekly physiotherapy sessions for the next five years, the plaintiff can expect to have: (a) Physiotherapy sessions 2 times a year for the next 5 years (no discount rate is to be applied as this is not an overly lengthy period of time): 2 sessions x 5 years x $30 = $300. (b) One trip for heterotrophic ossification surgery = $30. (c) Annual trips to replace his garment brace for the rest of the plaintiff’s life: $30 x 20.6 years = $618. (d) As the plaintiff has provided no evidence of how often the psychiatric treatments will occur yearly, I will take it that it occurs once a year for the rest of the plaintiff’s life: $30 x 20.6 years = $618. 243 The total sum based on the plaintiff’s calculations is far lower than $7,500. As the defendant is agreeable to paying the plaintiff $7,500, I award the plaintiff$7,500for this head of claim. Cost of caregiver 244 The plaintiff submits that the current cost of a domestic helper is $1,500 a month (rounded down from $1,540), and a multiplier of 26 is appropriate.182Foot Note 182×PCS para 6.7.The defendant submits that no award ought to be made for future caregiver costs as the plaintiff no longer requires a full-time caregiver.183Foot Note 183×DCS para 18.In the alternative, if the court takes the view that the plaintiff does require a caregiver, the defendant submits that the costs of a caregiver should not be foisted upon the defendant because the psychiatric injuries as well as behavioural issues related to TBI were not caused by the accident. Further, it avers that the plaintiff’s father, Mr Lee Kim Lian @ Mohammad Lee, can serve as the plaintiff’s caregiver as he is retrenched and past the retirement age.184Foot Note 184×DCS para 150. (1) Decision on caregiver costs 245 In my judgment, the costs of a future caregiver ought to be awarded to the plaintiff. As stated above at [74], the relevant experts are unanimous in their opinions that the plaintiff requires some degree of supervision and will not be able to live independently. This stems from the plaintiff’s neurocognitive issues associated with TBI as well as his psychiatric issues – all of which are the proximate result of the accident (see [45] above). I have little hesitation rejecting out of hand the defendant’s somewhat callous argument that the plaintiff’s father can serve as his ‘free of charge caregiver’. While his family members have all pitched in to help the plaintiff (especially during certain pre-trial periods where the family did not engage a domestic helper), their care and efforts borne out of familial love and affection for the plaintiff should not be taken as a free resource that the defendant can take advantage of to reduce the sum that it ought to pay as fair compensation to the plaintiff. It is also, in my view, unreasonable for the defendant to expect the plaintiff’s father, who is already past the age of retirement, to take on the responsibility of being the plaintiff’s surrogate caregiver for the rest of his natural life. 246 The plaintiff’s rounded-down estimate of $1,500 per month is calculated based on a salary of $550, foreign worker levy of $450, food and miscellaneous expenses of $450 (based on $15 per day), two medical check-ups a month at $35 each and insurance of $20 (based on annual premium of $240). I agree that this estimate is reasonable. 247 The multiplicand is therefore $18,000 (ie,$1,500 x 12). Applying the multiplier of 20.6 years, the award for future caregiver costs is$370,800.",
        "Special damages": "",
        "Medical expenses and related expenses": "248 The plaintiff claims a sum of $239,115.77 for incurred medical expenses and related expenses broken down as follows:185Foot Note 185×PCS para 1.10 at p 84. (a) $237,464.03 for medical expenses after removing the following items disputed at trial by the defendant: dengue screening, dental paste, anti-fungal cream, vaccinations, two SAFRA Gym memberships.186Foot Note 186×PCS para 1.3 – 1.5, beginning from PCS p 80 under the heading “Special Damages”.I term this the “Original Medical Expenses” claim. (b) $1,343.45 for further medical expenses incurred during the trial period. These were provided to the defendant on 18 February 2021 after the conclusion of the evidentiary hearing.187Foot Note 187×PCS para 1.6 at p 82. (c) $308.29 for miscellaneous expenses.188Foot Note 188×PCS para 1.9 at p 83. 249 I should add that in its reply submissions, the plaintiff also seeks to claim for afurtherpair of biomechanical insoles worth $631.30.189Foot Note 189×PRS para 1.110.I refer to this expense as well as the claim for $1,343.45 at [248(b)] as the “New Medical Expenses”. 250 The defendant appears to think that the amount claimed by the plaintiff is $237,679.90 based on the Scott Schedule prepared by the parties.190Foot Note 190×DCS paras 175 - 176.It accepts a sum of $212,050.34 as appropriate but wishes to dispute the following items: (a) physiotherapy from Rapid Physiocare amounting to $22,944.30; (b) consultation and biomechanical insoles from Orthopaedia Pte Ltd amounting to $597.30; (c) gym memberships amounting to $545.70; (d) psychotherapy treatment amounting to $250; (e) vaccinations amounting to $105.20; (f) dental treatments amounting to $752.90; and (g) fungal creams amounting to $3191Foot Note 191×BAEIC Vol 3 p 711(or $1.40 after government subsidy). 251 It must first be said that it ought not to be the role of the court to comb through individual andde minimisexpenses such as fungal creams worth no more than $3. It is the overarching duty of both counsel to assist the court in its assessment of the plaintiff’s damages, instead of quibbling over comparatively minor and inconsequential matters. What is especially egregious in this case is that the plaintiff’s claim for expenses, even on thedefendant’saccount, is in the hundreds of thousands. In the overall scheme, the addition of a few hundred or even a few thousand dollars would make little difference to the overall claim and I would have expected parties’ counsel to be able to sort out issues of this nature without the intervention of the court. 252 To further complicate and compound matters, it appears to me that the parties are, to some extent, also at cross-purposes in relation to the Original Medical Expenses. For example, in arriving at the figure of $237,464.03 (see [248(a)], the plaintiff stated in his closing submissions that he hadalreadyremoved items (c), (e), (f) and (g) referred to above at [248].192Foot Note 192×PRS para 1.109.Nonetheless, and despite this state of affairs, the court has to press on. 253 I am of the view that items (a) and (b) referred to at [250] above are plausibly related to the plaintiff’s injuries from the accident and ought not to be deducted. As has been detailed extensively earlier in this judgment, the plaintiff suffered lower limb injuries as a result of the accident. While he has recovered well, there remains residual disability in his left hip and knee. I find it reasonable to allow the plaintiff to claim for fees incurred for special biomechanical insoles and rehabilitation by way of physiotherapy. The physiotherapy fees which amount to $22,944,30 are reasonable bearing in mind that they had been accumulating since at least August 2015 when the plaintiff was discharged from the hospital following the accident. 254 As for item (d) at [250], psychotherapy is commonly sought to help alleviate or control symptoms associated with mental illnesses. However, while the plaintiff submits that this claim is “supported by the “medical evidence”, he does not point me to any evidence suggesting that this has been prescribed by the plaintiff’s doctors. He has simply asserted that this is “necessary and incurred as a result of the accident”.193Foot Note 193×PRS para 1.107.I do not think that this suffices and therefore do not allow this claim. 255 The sum that I allow in respect of the plaintiff’s Original Medical Expenses claim is therefore$237,214.03(ie,$237,464.03 – $250). 256 As for the New Medical Expenses, the plaintiff only brought them and the supporting evidence to the defendant’s attention on 18 February 2021,afterthe conclusion of the evidential hearing in Suit 253. While these appear to be legitimate expenses, leave of court was not sought to adduce the new evidence. In the circumstances, I do not think that these are properly claimable and therefore disallow them. 257 As for the miscellaneous expenses amounting to $308.29, the defendant is prepared to pay a sum of $160.44 purely on a goodwill basis.194Foot Note 194×DCS para 179.As mentioned previously, it is not the court’s role to scrutinise every single receipt down to the last cent – the sum claimed of $308.29 was the aggregate of 17 individual receipts, some of which were for expenses amounting to as little as $2.45. The amount of time, energy and resources expended by the parties disputing this claim, and then by this court having to arrive at a decision on it, is wholly disproportionate. Ultimately, as the difference between $308.29 and $160.44 is, in my view,de minimisin the context of the plaintiff’s overall claim, I take the midpoint value of$234(to the nearest whole number) as a fair and reasonable sum for the miscellaneous expenses and award that amount to the plaintiff. 258 Finally, the defendant asks for an order that the plaintiff returns a sum of $174,301.19 to Prudential Assurance Company Singapore (“Prudential”) for the plaintiff’s hospitalisation fees paid by Prudential as the plaintiff’s insurer.195Foot Note 195×DCS para 177.While the plaintiff’s sister, Ms Ashikin, confirmed on the stand that the plaintiff is agreeable to returning this sum to Prudential,196Foot Note 196×PRS para 1.111 – 1.112.that is a matter between Prudential and the plaintiff. Moreover, given that Prudential is not a party to the present proceedings, I see no reason to make the specific order suggested by the defendant. 259 To summarise, I award the plaintiff the sum of$237,448.03for incurred medical and related expenses.",
        "Transport expenses": "260 The plaintiff claims a sum of $9,344.23 for incurred transport expenses including taxi fares, petrol, EZ-link card top-ups, and parking charges.197Foot Note 197×PCS para 2.5 at p. 84.The defendant is willing to concede a sum of $7,500 given the frequency of the plaintiff’s medical appointments since the accident occurred. 261 I do not think that $9,344.23 is an unreasonable figure. A large portion of the sum pertains to petrol costs incurred by Ms Ashikin when she ferried the plaintiff to and from his various medical appointments. Ms Ashikin candidly admitted during cross-examination that she used the petrol for other purposes like going to work, however, she had already accounted for this by claiming only half of her petrol costs from the defendant.198Foot Note 198×NE 10 Nov 2020 94:22 – 95:13. 262 I disagree with the defendant’s contention that Ms Ashikin was seeking to inflate the claim for transport expenses. While it is true that some of the original petrol receipts included items like M&M chocolates and mash potatoes, Ms Ashikin admitted that these items should have been taken out and stated that they had been inadvertently included in the calculations because mistakes were made while tallying up the sheer number of receipts. I accept her explanation. These items were taken out by the plaintiff’s counsel who sent an updated figure of $9,344.23 to the defendant on 27 November 2020.199Foot Note 199×PCS para 2.4 at p 84.Special damages for transport expenses are therefore allowed at$9,344.23.",
        "Pre-trial loss of income": "263 The plaintiff’s pre-trial loss of income has been dealt with above at [184]–[185] and I shall not repeat myself here. The plaintiff’s father (Mr Lee) 264 The plaintiff claims a sum of $91,533.28 as Mr Lee’s pre-trial loss of income.200Foot Note 200×PCS para 4.5 at p. 86.This is calculated on the basis that Mr Lee had left his job in June 2017 to take care of the plaintiff and there was a period of 34 months where the family was without a domestic helper (July 2017 to February 2020, and August 2020 to October 2020). Given that Mr Lee was previously employed as a logistics supervisor with RAK Logistics Holdings Pte Ltd (“RAK Logistics”) with a monthly salary of $2,576 (and an additional employer CPF contribution of 17%), the plaintiff claims 34 months’ worth of Mr Lee’s salary (after deducting the income he had earned during that period through part-time work). For the avoidance of doubt, the plaintiff does not appear to be claiming for any periods of leave taken by Mr Lee while he was still employed by RAK Logistics. 265 Having regard to the evidence, I do not think thatanyaward for Mr Lee’s pre-trial loss of income ought to be claimable. The objective evidence suggests that Mr Lee had been retrenched. In other words, it is not a case where Mr Lee had left RAK Logistics voluntarily to take care of the plaintiff. Mdm Noraini, Mr Lee’s wife, had informed Dr Fones that Mr Lee had been retrenched and this was recorded in Dr Fones’ report dated 17 January 2018.201Foot Note 201×DCS para 34 – 36.At trial, Mr Lee was unable to provide a satisfactory explanation for this. Furthermore, Mr Lim Hong Suan, Mr Lee’s former colleague at RAK Logistics testified that RAK Logistics was laying off its employees in July 2017 as its business was not viable, and Mr Lim himself was laid off around that time. Coincidentally, this was also around the same time that Mr Lee had purportedly resigned.202Foot Note 202×NEs 3 December 2020 5:1 – 24. 266 Overall, I found Mr Lee to be a poor witness whose evidence was incoherent at times and who was unable to recall too many important details about relevant events. While this may well have been attributable to Mr Lee being somewhat overwhelmed by the stress of giving evidence in court and having to recall the tragedy that had befallen his son, Mr Lee’s testimony in relation to why he had left RAK Logistics is difficult to reconcile with the more objective sources of evidence as laid out above. This being the case, the plaintiff has not, in my judgment, established that Mr Lee’s reduced income during the 34-month period is attributable to the accident and thus claimable from the defendant. I therefore disallow this claim entirely. The plaintiff’s mother (Mdm Noraini) 267 This claim is agreed at$3,306.77and I allow the amount as agreed.203Foot Note 203×DCS para 171; PRS para 1.101. The plaintiff’s sister (Ms Ashikin) 268 The plaintiff claims a sum of $8,221.88 for his sister’s pre-trial loss of income. The defendant agrees that Ms Ashikin should be entitled to compensation for the leave that she had taken on account of the plaintiff. However, the parties appear to be using different figures for the amount of leave taken by Ms Ashikin. Unfortunately, the plaintiff’s submissions do not contain much by way of references to the documentary evidence. 269 When Ms Ashikin was working at the Office of the Public Guardian, she took a total of 42.5 days and 12.75 hours of unpaid leave, and 2.5 days and 4.5 hours of paid annual leave. As stated in the letter from her employer, the total amount adds up to $4,552.25 (ie,$2,892.50 + $58.50 + $165.75 + $1,359 + $76.50).204Foot Note 204×3BAEIC 971 – 973.After factoring in employer’s CPF contribution of 17%, this adds up to $5,326.13.205Foot Note 205×PCS para 6.4 at p 88 – 89. 270 When Ms Ashikin was working at the Singapore Children’s Society, her base salary was $4,569.206Foot Note 206×3BAEIC p 1263.She took leave on 15 days. She therefore forfeited $4,009.29 (ie,$4,569/20 x 15 x 1.17). 271 I pause to state that this figure of $4,009.29 is higher than the figure given in the plaintiff’s closing submissions (see para 6.4 at p 89). I attribute this to an error of calculation on the part of counsel. Specifically, it appears that plaintiff’s counsel took Ms Ashikin’s base monthly salary at the Singapore Children’s Society as $3,300. However, a letter from the employer states that her base pay is $4,569 (albeit that the letter itself appears to mistakenly refer to that sum as Ms Ashikin’s “annual basic salary”).207Foot Note 207×3BAEIC p 1263$4,569 per month is the sum used by the defendant.208Foot Note 208×DCS para. 170(b). 272 Ms Ashikin therefore ought to be entitled to$9,335.42($5,326.13 + $4,009.29) and I award this amount.",
        "Costs of caregivers": "273 The family employed the following domestic helpers after the accident:209Foot Note 209×PCS para 7.5. (a) Ms Ulpiyah from May 2015 to August 2015; (b) Ms Masriyah from September 2015 to April 2016; (c) Ms Sulikatun from 29 February 2020 to 1 August 2020; (d) Ms Pungki who was unable to come to Singapore due to the COVID-19 pandemic; and (e) Ms Erni Marlina since 16 January 2021. 274 The plaintiff claims a sum of $36,499.12 for incurred caregiver expenses.210Foot Note 210×PCS para 7.5 at p 90.The defendant is prepared to concede a sum of $14,267.63 for Ms Ulpiyah and Ms Masriyah.211Foot Note 211×DCS para 148.The defendant takes the view that the plaintiff was independent from 16 June 2016 and even if he required a caregiver, there was no need for the family to employ one as Mr Lee had been retrenched and could therefore take on that role. 275 As I am of the view the plaintiff is entitled tofuturecaregiver expenses (see [247] above), it follows that the caregiver expenses incurred to take care of the plaintiff up till the point of trial are, in principle, also claimable. 276 Before going on to deal with Ms Ulpiyah’s and Ms Masriyah’s expenses, it bears mention that the plaintiff’s closing submissions contain paragraphs on how the plaintiff had, after trial, removed various expenses or receipts from the claim in relation to these two helpers after Mr Wee had pointed out during cross-examination that there were various wrongly included items.212Foot Note 212×PCS paras 7.3 – 7.4 at pp 89 – 90.The plaintiff’s counsel submits that the revised figures now stand at $444.67 for Ms Ulpiyah’s food expenses, $2,295.36 for Ms Masriyah’s food expenses and $783.68 for Ms Masriyah’s other expenses. I address these new figures in turn. 277 For Ms Ulpiyah, the plaintiff does not provide a breakdown of the $8,042.84 claimed in its closing submissions and simply refers to the table of expenses at para 15 of Mdm Noraini’s AEIC dated 20 November 2019.213Foot Note 213×PCS para 7.5 at p 90.This table states that the costs incurred in connection with Ms Ulpiyah amount to $8,042.84. 278 However, to the best of my abilities, I have not been able to determine where therevisedsumof $444.67 for Ms Ulpiyah’s food expenses features in the plaintiff’s ‘revised’ claim given that the claim in its closing submissions and the abovementioned AEIC filed two years ago areexactly the same.I would add that the sum of $8,042.84 in Mdm Noraini’s AEIC dated 20 November 2019 is inclusive of a sum of$1,800for Ms Ulpiyah’s food expenses.214Foot Note 214×4BAEIC p 1295.It therefore appears to me that the plaintiff’s counselhad not, in fact, removed the expenses or receipts that they were aware had been wrongly included for the claim in respect of Ms Ulpiyah. 279 For Ms Masriyah, the sum of $14,169.38 as claimed in the plaintiff’s closing submissions at para 7.5 is made up of $13,385.70 and $783.68 for “other expenses”. No breakdown for the $13,385.70 sum is provided in the plaintiff’s closing submissions. In fact, the plaintiff simply refers again to the table found at para 15 of Mdm Noraini’s AEIC dated 20 November 2019. Pertinently, this table shows that the sum of $13,385.70includesMs Masriyah’s food expenses which is quantified at$5,400. The point to note is that the plaintiff claims to have removed a list of wrongly added receipts for Ms Masriyah and accordingly arrived at a revised sum of $2,295.36 for food expenses.215Foot Note 215×PCS para 7.4 at p 90.I am, however, unable to find any indication that this reduced sum had been used in the calculation of expenses related to Ms Masriyah. Furthermore, I am unable to understand how the plaintiff or his counsel had removed various wrongly included receipts or items from the tabulation of expenses related to Ms Masriyah, but still somehow ended up with an additional claim for $783.68 for “other expenses” on top of the $13,385.70 sum which had already featured in Mdm Noraini’s AEIC filed two years ago.216Foot Note 216×4BAEIC p 1296.It further bears noting that the $13,385.70 sumalready included“Other expenses” for Ms Masriyah worth $394.80.217Foot Note 217×4BAEIC p 1296. 280 To describe as confusing the manner in which the plaintiff has sought to advance and explain this head of claim in relation to Ms Ulpiyah and Ms Masriyah would be an understatement. Despite my best efforts, I am befuddled by the plaintiff’s calculations and unable to understand how counsel arrived at ahigheror equal sum for their expenses afterremovingsome invoices or expenses which Mdm Noraini conceded were wrongly included. With respect, it appears that the invoices or expenses the plaintiff claims to have removed were not in fact removed from their ‘updated calculations’. In fact,afterMdm Noraini acknowledged during cross-examination that the original claim was inflated due to the incorrect addition of certain receipts, it appears that further expenses wereaddedto the plaintiff’s claim (eg,the other expenses amounting to $783.68 in respect of Ms Masriyah). In short, the picture before the court is not only incomplete and confusing but a somewhat misleading one. Unfortunately, this, and the plaintiff’s submissions did not assist this court in the least to assess the plaintiff’s claim in so far as this head of loss is concerned. 281 Nonetheless, as it is clear that the plaintiff should receive at leastsome amountfor the costs of the various caregivers engaged prior to trial, I take some time to go through the expenses of the various domestic helpers. Ms Ulpiyah 282 The plaintiff claims $8,042.84 for expenses incurred in relation to Ms Ulpiyah. As previously mentioned at [277] above,218Foot Note 218×PCS para 7.5 based on 4BAEIC p 1295 – 1296.no breakdown of this sum was provided in the plaintiff’s closing submissions and reference was made instead to para 15 of Mdm Noraini’s AEIC of 20 November 2019. 283 The defendant makes no submission as to the compensable sum in respect of Ms Ulpiyah’s salary from May to July 2015 (as claimed at para 15 of Mdm Noraini’s AEIC dated 20 November 2019). Its only dispute appears to be that the food expenses claimed are excessive.219Foot Note 219×DCS paras 140 - 143.The plaintiff claims a sum of $1,800 for Ms Ulpiyah’s food on the basis of $20 a day. The sum is rather large and the evidence in support of this sum is weak. The plaintiff only adduces evidence of some food receipts which provide no indication as to who consumed the food. I agree with the defendant that a more appropriate sum for food expenses is $15 a day. The defendant agrees for the plaintiff to claim a sum of $1,245 for Ms Ulpiyah’s food expenses. I therefore award this sum. 284 In my judgment, the plaintiff is entitled to claim$6,192.89in relation to Ms Ulpiyah, broken down into the following expenses:220Foot Note 220×4BAEIC p 1295 read with DCS para 140. (a) $2,800 for overseas placement fee (agreed); (b) $1,414 for agency fee, maid insurance, bond waiver (agreed); (c) $678.24 for foreign worker levy (agreed); (d) $55.65 for additional salary (agreed); and (e) $1,245 for food expenses. 285 The defendant had originally disputed the payment of Ms Ulpiyah’s overseas placement fee in the course of trial.221Foot Note 221×4BAEIC p 1305; NE 12 November 2020 90:10 – 92:13.This fee had been paid by Mdm Noraini on behalf of Ms Ulpiyah when she first came to Singapore.222Foot Note 222×4BAEIC p 1307.However, its most current position (as reflected in its closing submissions) is to agree to compensate the plaintiff for this sum. I agree that this sum is compensable. 286 As for Ms Ulpiyah’s salary from May to July 2015 quantified at $1,350,223Foot Note 223×4BAEIC p 1295.Mdm Noraini had conceded under cross-examination that Ms Ulpiyah was not paid any salary for these months, save for a sum of $22.85 in June 2015 and $32.80 in July 2015 (ie,a total of $55.65 in additional salary, see above at [284(d)]). This is because Ms Ulpiyah’s salary for those months went towards paying off the overseas placement fee.224Foot Note 224×4BAEIC p 1307; NE 12 November 2020 89:23 – 92:8.As Ms Ulpiyah did not stay with the family long enough to completely pay off the overseas placement fee through her monthly salary, I do not award the plaintiff any compensable sum for Ms Ulpiyah’s salary from May to July 2015, save for $55.65 which the defendant concedes was paid to Ms Ulpiyah on top of her monthly salary. Ms Masriyah 287 For Ms Masriyah, the plaintiff claims a sum of $14,169.38 (see [279]). The defendant disputes the foreign worker levy, food expenses and other expenses incurred by Ms Masriyah. It makes no submission as to the compensable sum for Ms Masriyah’s salary. The defendant takes the view that food expenses should be compensable at $3,705 (ie,$15 a day for 247 days between 27 August 2015 and 30 April 2015), the foreign worker levy should be compensable at $678.24 and other expenses should be compensable at $250. It agrees to pay the overseas placement fee of $2,800 and replacement fees, insurance and Settling in Programme fees (“SIP fees”) totalling $641.50.225Foot Note 225×DCS para 143 and 144. 288 In my judgment, the plaintiff is entitled to claim$8,926.06in relation to Ms Masriyah, broken down into the following expenses:226Foot Note 226×See 4BAEIC pp 1295 – 1296 as referred to in PCS para 7.5, read with paras 144 – 147. (a) $3,600 as salary from September 2015 to April 2016 (at $450 a month for eight months), inclusive of the $2,800 for overseas placement fee. (b) $641.50 for replacement fee, insurance and SIP fees (agreed).(c) $2,139.20 for foreign worker levy.(d) $2,295.36 for food expenses.(e) $250 for other expenses. Insofar as I have accepted one party’s figures over the other in relation to [(a)], [(c)], [(d)] and [(e)] above, these are my reasons. 289 The plaintiff claims the various sums paid to Ms Masriyah by way of her monthly salaries. As mentioned above at [279], the plaintiff does not provide a breakdown of the claimed amounts in respect of Ms Masriyah in his closing submissions and is content to refer to Mdm Noraini’s AEIC of 20 November 2019 at para 15. Mdm Noraini testified in her AEIC that Ms Masriyah’s total salary fromAugust 2015to April 2016 was $4,050, at a rate of $450 per month, as opposed to her total salary of $3,600 fromSeptember 2015to April 2016 as stated at para 7.5 of the plaintiff’s closing submissions. Based on the Standard Employment Contract, Ms Masriyah’s salary was $450 per month.227Foot Note 227×BAEIC Vol 4 pp 1378 – 1381 (in particular p 1379)I calculate Ms Masriyah’s salary on the basis of the plaintiff’s claim in his closing submissions as that represents his most updated position. I therefore award the plaintiff the sum of $3,600 representing eight months’ worth of Ms Masriyah’s salary from September 2015 to April 2016. 290 The defendant is amenable to paying the overseas placement fees and has conceded a sum of $3,705 for food expenses (notwithstanding the fact that the plaintiff’s own estimate is $2,295.36). In a similar vein to the arrangement with Ms Ulpiyah (see above at [285]), Ms Masriyah’s monthly salaries from September 2015 to March 2016 were used to pay off the overseas placement fee of $2,800.228Foot Note 228×4BAEIC p 1370.While the defendant makes no submission in respect of Ms Masriyah’s compensable salary across the various months, this is presumably because it agrees to compensate the plaintiff for Ms Masriyah’s overseas placement fee worth $2,800. This being the case, to allow the plaintiff to claimbothMs Masriyah’s monthly salary from September 2015 to March 2016andthe overseas placement fee would constitute double counting. I therefore disallow theadditionalclaim for Ms Masriyah’s overseas placement fee over and above her salary which I have allowed at [289]. 291 As for the food expenses, this pertains to incurred expenses and I therefore award only the sum of $2,295.36 for food expenses for Ms Masriyah as claimed by the plaintiff. This sum is lower than the defendant’s estimate and is the ‘revised figure’ put forth by the plaintiff in his closing submissions.229Foot Note 229×PCS para 7.4 at p 90. 292 As for the foreign worker levy, the sum of $678.24 suggested by the defendant is far too low given that Ms Masriyah had worked from September 2015 to April 2016 and the official monthly rate is $450. I thus accept the sum of $2,139.20 claimed as it is reasonable. 293 For the “other expenses” incurred by Ms Masriyah, the plaintiff has not provided any breakdown of how the sum of $783.68 was arrived at. Further, as I had mentioned above, I am unable to understand how the plaintiff could remove receipts from the original claim of $394.80 for “other expenses” and still end up with a higher figure. Even the original figure of $394.80 is suspect as it includes items such as swimwear, undergarments,230Foot Note 230×4BAEIC p 1495; DCS para 146.and Skechers shoes.231Foot Note 231×4BAEIC p 1494.I find the defendant’s figure of $250 to be more reasonable. 294 The plaintiff is accordingly awarded$8,926.06(see [288] for the breakdown) in relation to expenses pertaining to Ms Masriyah. Ms Sulikatun 295 For Ms Sulikatun, the plaintiff claims $6,620.89. I am unable to find a breakdown of how this figure was arrived at. The plaintiff provides the following references at para 7.5 of its closing submissions (at p 90): (a) 4BAEIC 1580: This document is titled “Table of Domestic Helper Expenses” but there are no references to who this helper is and how the figures in the table can be cross-checked with documentary evidence. (b) 6BAEIC 2266 – 2267: These contain a list of various food expenses, but it is unclear if they were incurred for Ms Sulikatun. (c) 6BAEIC 2285: This contains a table of foreign worker’s levies. For Ms Sulikatun, the levies for March 2020 to May 2020 total $896.10 (ie,$296.10 + $300 + $300). As these are backed by levy bills from the Ministry of Manpower, I accept that the plaintiff ought to be compensated for $896.10 worth of foreign worker’s levy.232Foot Note 232×6BAEIC p 2298 – 2300. 296 Having regard to the documentary evidence I can find for Ms Sulikatun and cross-checking it against the “Table of Domestic Helper Expenses” at 4BAEIC 1580, I was able to find some support for the following expenses: (a) $1,562.11 to the maid agency (inclusive of the deposit previously paid) for SIP course, medical fees, work permit, insuranceetc.233Foot Note 233×4BAEIC p 1584. (b) $3,600 for overseas placement fees.234Foot Note 234×4BAEIC p 1585. (c) $128.40 for insurance.235Foot Note 235×4BAEIC p 1587. 297 A further sum of $896.10 for foreign worker’s levy should also be addedper[295(c)] above. Given that Ms Sulikatun worked for the plaintiff from 29 February 2020 to 1 August 2020 (ie,a period of 154 days), it is reasonable to assume that she incurred food expenses of $15 per day. This works out to $2,310. 298 The total sum that the plaintiff ought to receive in relation to Ms Sulikatun is therefore $8,496.61.236Foot Note 236×PCS para 7.5.However, as the plaintiff only seeks the sum of$6,620.89, I award this sum instead. Ms Pungki and Ms Erni Marlina 299 As for Ms Pungki, she was unable to come to Singapore due to the COVID-19 pandemic. I am unable to understand how this event, by no means attributable to the defendant, ought to sound in caregiver costs borne by the defendant. I disallow this claim entirely. 300 As for Ms Erni Marlina, the expenses associated with her employment were only revealed to the court and to the defendant after the close of trial in the plaintiff’s letter dated 18 February 2021. As the plaintiff has not sought leave to adduce further evidence, I do not think that these sums are properly claimable and I accordingly disallow them. 301 To summarise, I award the plaintiff$21,739.84in special damages for incurred caregiver costs and expenses (ie,$6,192.89 + $8,926.06 + $6,620.89).",
        "Loss of polytechnic fees": "302 This is agreed at$1,219.55and I award this sum as agreed.",
        "Costs of application under the MCA": "303 The plaintiff claims $21,411.90 for the costs incurred in the litigation representatives’ application under s 20 of the Mental Capacity Act (Cap 177A, 2010 Rev Ed) (“MCA”) in FC/OSM 46/2016, comprising professional costs of $15,000 plus disbursements. The defendant agrees that some award should be given to the plaintiff for the contested portions of the MCA application and pegs it at $5,000.237Foot Note 237×DCS para 184. 304 It is clear that the MCA application was highly contentious.238Foot Note 238×PCS para 1.2 - 1.4.The plaintiff’s litigation representatives had filed the MCA application on 2 March 2016 and a decision was only rendered on 5 March 2018.239Foot Note 239×FC/ORC 1276/2018.It also resulted in two appeals being filed to the General Division of the High Court (Family Division), one of which culminating in a judgment published towards the end of 2018. It is evident the defendant’s contest had caused a not insignificant amount of delay. As the plaintiff has clarified that the sum of $21,411.90 sought doesnotinclude the costs of the joinder application and the plaintiff’s subsequent appeal to the High Court in relation thereto, and is limited only to the MCA application itself, I agree that the plaintiff should be allowed to claim the sum of$21,411.90and award this sum accordingly.",
        "Conclusion": "305 To conclude, for all of the reasons set out above, I grant the plaintiff final judgment in the sum of $2,186,182.40, broken down and as tabulated below: S/NHead of claimDamagesAwardReference paragraph in Judgment1.GeneralTBI overall$ 216,000.00[114]2.GeneralTBI: Structural3.GeneralTBI: Psychological4.GeneralTBI: Cognitive5.GeneralFacial Fractures6.GeneralLung Injuries and UTI7.GeneralLower Limb Injuries8.GeneralMultiple Bruises and Lacerations9.AggravatedAggravated damagesDisallowed[123]10.GeneralLoss of Future Earnings plus CPF$ 1,000,460.00[203]11.GeneralLoss of marriage prospects$ 10,000.00[204]12.GeneralFME: TBI$ 17,120.66[224]13.GeneralFME: Orthopaedic injuries$ 15,420.00[239]14.GeneralFME: Psychiatric injuries$ 82,400.00[240]15.GeneralFME: Left lid ptosis and left contour deformity$ 9,400.00[221]16.GeneralFuture Transportation Expenses$ 7,500.00[243]17.GeneralFuture Full-time Domestic Helper$ 370,800.00[247]18.SpecialMedical expenses and related expenses$ 237,448.03[259]19.SpecialTransportation expenses to date and continuing$ 9,344.23[262]20.SpecialPlaintiff's pre-trial loss of income$ 153,276.00[185] and [203]21.SpecialPre-trial loss of income for Plaintiff's fatherDisallowed[266]22.SpecialPre-trial loss of income for Plaintiff's mother$ 3,306.77[267]23.SpecialPre-trial loss of income for Plaintiff's sister$ 9,335.42[272]24.SpecialCost of caregiver$ 21,739.84[301]25.SpecialLoss of polytechnic fees$ 1,219.55[302]26.SpecialCosts of application under the MCA$ 21,411.90[304]Total$ 2,186,182.40 306 The plaintiff claims interest at the statutory rate of 5.33% per annum in his closing submissions240Foot Note 240×PCS p 95.but claims that pre-judgment interest ought to start running from three months after the date of the filing of the MCA application (ie,from 2 June 2016) as opposed to the date of filing of the writ (ie,8 March 2018)241Foot Note 241×PRS para 1.117.. The defendant makes no submissions on interest. In my view, the defendant was well within its rights to challenge an application (ie,the MCA application) which it did not believe ought to be brought. Thus, while I am prepared to allow pre-judgment interest, I see no reason in this case to award such interest otherwise than from the date of the writ. 307 Based on the state of play as described above at [306], I allowed pre-judgment interest on the entire judgment sum of $2,186,182.40, at the rate of 5.33% per annum from the date of the writ in my judgment released originally on 24 November 2021. 308 After my judgment had been released, counsel for the defendant, Mr Wee, wrote to the court requesting for further arguments on the question of pre-judgment interest. Among other points, the defendant submitted that no pre-judgment interest should be awarded on future losses, relying on the decision of the House of Lords inCookson(widow and administratrix of the estate of Frank Cookson, decd.) v Knowles[1979] 1 AC 556 (“Cookson v Knowles”) at 572 – 573 which was followed by our Court of Appeal inHitachi Zosen Robin Dockyard (Pte) Ltd v Lee Pui Keng[1988] 1 SLR(R) 524. Further, in relation to certain pre-trial special damages, the defendant submitted that pre-judgment interest should only be awarded at a half-rate,ie, at 2.67% per annum from the date of the accident, relying onJeffordand another v Gee[1970] 2 QB 130 andCookson v Knowles, which were cited with approval in,inter alia,Teo Sing Kengand another v Sim Ban Kiat[1994] 1 SLR(R) 340 (“Teo Sing Keng”) at [50]–[56].242Foot Note 242×Defendant’s Request for Further Arguments dated 25 November 2021. 309 I allowed the plaintiff’s counsel, Ms Sandhu, time to respond to Mr Wee’s request for further arguments and in the meantime, directed that the parties were not to extract or perfect the judgment. In the plaintiff’s response, the plaintiff agreed that no pre-judgment interest should be awarded on future losses.243Foot Note 243×Plaintiff’s solicitors’ letter to court dated 3 December 2021 at para 3.In reply to the other arguments raised by the defendant, the plaintiff contended simply that the court had a discretion in relation to the award of pre-judgment interest and that my earlier decision should be maintained. 310 After considering the plaintiff’s response, I acceded to the defendant’s request for further arguments. At the hearing of the further arguments on 7 December 2021, both Mr Wee and Ms Sandhu agreed that the court possessed the inherent power to recall its judgment and if necessary, to vary or even reverse it before the judgment had been perfected – seeThomson Plaza (Pte) Ltd v Liquidators of Yaohan Department Store Singapore Pte Ltd (in liquidation)[2001] 2 SLR(R) 246 andTan Chin Hoon and others v Tan Choo Suan (in her personal capacity and as executrix of the estate of Tan Kiam Toen, deceased) and others and other matters[2015] SGHC 306. I accordingly recalled my earlier judgment and heard the further arguments. 311 It is common ground that no pre-judgment interest should be awarded on damages for future losses – this would encompass the damages awarded at s/n 10 and 12–17 in the table at [305] above. I therefore vary my earlier decision and order that no pre-judgment interest is to run on these future losses. 312 It is also common ground that pre-judgment interest on the damages awarded for pain and suffering (s/n 1–8 in the table at [305]) and for loss of marriage prospects (s/n 11 in the table at [305]) should accrue at 5.33% per annum from the date of the writ. As that was my original decision, that order is to remain unchanged. 313 With regard to the pre-trial losses at s/n 18, 19, 22–26 in the table at [305], the defendant submits that interest should be awarded at the rate of 2.67% per annum from the date of the accident to the date of judgment. At the hearing for further arguments, Ms Sandhu accepted that based on the rationale as explained in the cases mentioned at [307], interest on the abovementioned heads of special damages should be awarded at the rate of 2.67% per annum from the date of the accident to the date of judgment. I therefore vary my earlier decision accordingly and award pre-judgment interest on the damages at s/n 18, 19, 22–26 in the table at [305] at the rate of 2.67% per annum from the date of the accident to the date of judgment. 314 That leaves the question of pre-judgment interest on the plaintiff’s damages for pre-trial loss of income (s/n 20 in the table at [305]). Mr Wee submitted that based on the same rationale that applies to the other claims for pre-trial losses, pre-judgment interest should accrue on this head of damages at the rate of 2.67% per annum but from 6 May 2018 which is the date on which  I found that the plaintiff would have entered the workforce but for the accident. Ms Sandhu disagreed. She maintained that the court has a discretion when it came to pre-judgment interest for pre-trial loss of income and given that the award for pre-trial loss of income had already factored a discount rate into it, this was an instance where the court should exercise its discretion and allow interest at 5.33% per annum from the date of the writ. Mr Wee countered that this submission was illogical. The rationale behind awarding interest at a half-rate was,inter alia, that the loss was accumulated over time (ie, between the date when the plaintiff would have started employment and the date of the trial) as opposed to a lumpsum loss. Mr Wee also submitted that as with all other instances where the court exercises its discretionary powers, the discretion must be exercised judicially, and awarding interest at half-rate from 6 May 2018 would be consistent with the rationale and principles enunciated by caselaw. 315 I agree with Mr Wee and see no reason to apply a different rationale to the pre-judgment interest for the plaintiff’s pre-trial loss of income. I note that inTeo Sing Kengat [50], the Court of Appeal allowed interest at the then prevailing half rate of 3% per annum from thedate of the accident. However, this can be explained by the fact that the plaintiff inTeo Sing Kengwas already employed at the time of the accident. Accordingly, I award pre-judgment interest on the plaintiff’s pre-trial loss of income (s/n 20 in the table at [305]) at the rate of 2.67% per annum from 6 May 2018 to the date of judgment. 316 Prior to the further arguments hearing, Mr Wee indicated to the court for the first time that the defendant also wished to address the court on how various interim payments made by the defendant to the plaintiff, amounting to $480,000, should be accounted for in the damages that I had awarded,ie, whether they should be deducted from the general damages or special damages that had been awarded. I agreed to hear arguments on this issue also and pointed out to both counsel at the hearing that this was clearly a relevant point that should have been brought to the court’s attention in their closing written submissions, as opposed to surfacing it belatedlypost-judgmentby way of further arguments. 317 Mr Wee submitted that following the decision of Justice Tay Yong Kwang (as he then was) inQuek Yen Fei Kenneth v Yeo Chye Huat[2016] 3 SLR 1106 (“Kenneth Quek(HC)”), the interim payments should be first applied towards the damages for pain and suffering. He acknowledged that none of the interim payments (paid in three tranches between April 2016 and January 2021 in the amounts of $180,000, $100,000 and $200,000 respectively) was made specifically on account of any particular item of special damages (for example, hospitalisation or other medical expenses). Thus, following the approach of Tay J inKenneth Quek(HC)at [120], the interim payments should first be deducted from the award for general damages for pain and suffering, and thereafter from the pre-trial special damages. Mr Wee submitted that it would be wrong to apply any part of the interim payments to the damages for future losses. In his submission, interim payments in personal injury cases were almost always ordered in relation to either general damages for pain and suffering or for special damages as they are, in a sense, accrued losses as opposed to future losses which are unascertained. 318 Ms Sandhu disagreed. She submitted that the first payment of $180,000 made by cheque which the plaintiff banked in on 25 April 2016 should be applied towards the special damages and the remaining $300,000 towards general damages. Ms Sandhu contended that there was no reason why the court could not deduct the interim payments from any component of general damages, including the damages for future loss of earnings. 319 I broadly agree with the defendant’s submissions. One of the purposes of making interim payments is so that the defendant can reduce his liability for interest, and in particular, pre-judgment interest. Following the approach inKenneth Quek(HC), the first interim payment of $180,000 and part of the second interim payment of $100,000 are to be deducted from the award of general damages for pain and suffering (including loss of marriage prospects) totalling $226,000. 320 After making the deduction at [319], the balance remaining from the second interim payment is $54,000. The third interim payment amounted to $200,000. The total remaining interim payment of $254,000 is to be deducted sequentially from the heads of special damages awarded at s/n 18–20 in the table at [305] until the balance of the interim payments made are exhausted. 321 The pre-judgment interest computations on the general damages for pain and suffering referred to at [319] and the special damages referred to at [320] are to take into account when the interim payments were made. If the parties are unable to agree on the interest computations based on my decision above, I reserve to the parties the liberty to come back before me to have the interest computation issue decided. 322 I end with some final comments. In quantifying the damages that a personal injury claimant ought to receive, the court is bound to apply the civil standard of proof on a balance of probabilities to assess his loss. The court strives, as far as possible, to provide compensation in monetary terms for the misfortune that has befallen the claimant as a result of the tort. However, the reality is that a monetary award will never truly be able to place the claimant in a position as if the tort had never occurred; nor can the court gaze into a crystal ball and determine definitively what may lie in the claimant’s future. This is especially in a case where the claimant suffers serious and permanent injuries. Nonetheless, the court does its best to provide the claimant fair compensation in accordance with the established legal principles. 323 The conclusions I have reached and the amounts I have awarded the plaintiff in this judgment, in particular those pertaining to his future employment prospects, are not meant to be foolproof predictions of the future. Rather, the conclusions are based on what this court thinks is more likely than not to occur (or which has already occurred), based on the evidence before it. Adam has displayed remarkable and commendable tenacity in recovering from some of his very serious injuries and in attempting to return to his pre-accident life. In this regard, he has no doubt been aided by the strong and enduring support and affection of his family members. One need look no further than the attempts made by Adam to return to his studies in the polytechnic after the accident. It is my fervent hope that Adam will not allow this accident and its effects, debilitating and long-lasting as they are, to define the rest of his life. 324 I shall decide the question of costs separately. S MohanJudge of the High Court Viviene Kaur Sandhu and Michelle Kaur (Clifford Law LLP) for the plaintiff; Anthony Wee and Pang Weng Fong (Titanium Law Chambers LLC) for the defendant."
    }
}