{
    "case_title": "Lee Hsien Loong vLeong Sze Hian",
    "ncitation": "[2021] SGHC 66",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The plaintiff sued the defendant in defamation for the defendant having shared on Facebook an article titled “Breaking News: Singapore Lee Hsien Loong Becomes 1MDB’s Key Investigation Target – Najib Signed Several Unfair Agreements with Hsien Loong In Exchange For Money Laundering” (the “Article”).1Foot Note 1×Agreed Bundle of Documents (“AB”) Volume II 1155 to 1157.The defendant had done this by sharing a hyperlink to the Article in a post on his Facebook Timeline (the “Post”) for about three days, during which time the Post attracted multiple responses from individuals who had seen it.2Foot Note 2×2 AB 1168 to 1171. 2 The parties raised a total of nine issues in this trial, which may be broadly categorised as issues relating to (a) meaning, (b) publication and re-publication, (c) quantum and loss, and (d) the available remedies, including whether or not these proceedings were an abuse of process.",
        "The Relevant Background to the Dispute": "",
        "Brief facts": "3 As I had previously outlined the salient facts of this dispute in an earlier judgment on the striking out of the defendant’s counterclaim in the tort of abuse of process (seeLee Hsien Loong v Leong Sze Hian[2019] SGHC 66), I will only briefly set out the facts most pertinent to the instant dispute. 4 The plaintiff, the Prime Minister of the Republic of Singapore,3Foot Note 3×Affidavit of evidence-in-chief (“AEIC”) of Lee Hsien Loong (“LHL”) at [5].brings this suit in his personal capacity. The defendant is, among other roles, a columnist who describes himself as a well-known campaigner for human rights and a government critic.4Foot Note 4×LHL at [5] and [6].It is uncontested that the defendant’s Facebook page is in his own name, and that he owns and manages the Facebook account from which the Post which forms the subject of this Suit was posted. 5 On or around 7 November 2018, the Article was published on a website titled “The Coverage”. “The Coverage” describes itself as a Malaysia-based social news network. The Article stated,inter alia, that ongoing Malaysian investigations concerning Malaysia’s 1Malaysia Development Berhad (“1MDB”) fund were “trying to find the secret deals between the two corrupted Prime Ministers of Singapore and Malaysia”. It is not in contention that this referred to the plaintiff and former Malaysian Prime Minister Mr Najib Razak. The Article also referenced several “unfair agreements” that Mr Najib Razak had entered into with the plaintiff, including the agreement to build the Singapore-Malaysia High Speed Rail, and included other details about the alleged investigations. 6 At around 6.16pm on 7 November 2018, the defendant shared a link to the Article in the Post on his Facebook Timeline.5Foot Note 5×2 AB 1168 and 1169.The Timeline on a Facebook user’s profile page sets out some of their Facebook activity. Among other functions, the Timeline showcases a user’s posts in roughly reverse chronological order, with the most recent post generally appearing first. The defendant did not include any accompanying text or commentary in the Post, which simply indicated that the defendant had shared a link, with part of the Article’s title and an image from the Article being displayed, as shown below:  The plaintiff identified the words of the Article’s title which are displayed in the Post as the “Offending Words in the Post”, while the words in the Article, including the title, were described in the plaintiff’s pleadings as the “Offending Words in the Article”. For ease of reference (and without acknowledging that the words are necessarily defamatory), I will refer to these words in both the Post and the Article collectively as the “defamatory words”. 7 By 10.16pm on 7 November 2018, the defendant’s Post had attracted 22 “reactions”, five “comments”, and 18 “shares”.6Foot Note 6×2 AB 1169.The Post had been made on the “Public” setting, meaning that other Facebook users apart from the defendant’s “friends” on Facebook would be able to view it. 8 The defendant removed the Post from his Facebook page at about 7.30am on 10 November 2018, after he read a notice from the Info-communications Media Development Authority (“IMDA”) that had been sent to him at around 11.00pm on 9 November 2018.7Foot Note 7×2 AB 1256 to 1261. 9 Various media outlets covered the Article over 8 and 9 November 2018, quoting the Article’s title and discussing its contents. On 8 November 2018, the Straits Times reported responses by the Minister for Law and Home Affairs, Mr K Shanmugam,8Foot Note 8×2 AB 1224 to 1227.as well as the High Commission of the Republic of Singapore in Malaysia, to the Article.9Foot Note 9×2 AB 1166 to 1167, 1224 to 1227.The responses reported uniformly sought to refute the Article and its contents. 10 On 9 November 2018, it was further reported in the Straits Times that the Monetary Authority of Singapore had filed a police report in respect of an article materially similar to the Article in question which had been published on 5 November 2018 on the States Times Review (the “STR”), a website which claims to be an Australia-based blog covering Singapore news.10Foot Note 10×2 AB 1236 to 1241.Further, the Straits Times also reported on the IMDA’s issuance of a statement that the article on the STR’s website was “baseless and defamatory”.11Foot Note 11×2 AB 1252 to 1253. 11 As outlined earlier, the defendant removed the Post from his Facebook Timeline on 10 November 2018. On 12 November 2018, he received a Letter of Demand from the plaintiff’s then-solicitors, Drew & Napier LLC, demanding,inter alia, a published apology and compensation.12Foot Note 12×2 AB 1271 to 1274.This letter does not appear to have been replied to. On 20 November 2018, the plaintiff commenced the instant suit.",
        "Procedural history": "12 The defendant previously sought to mount a counterclaim against the plaintiff in the tort of abuse of process. The plaintiff applied in SUM 148/2019 for the said counterclaim to be struck out pursuant to O 18 r 19 of the Rules of Court (Cap 322, R 5, 2014 Ed) (“ROC”). That application was granted, and the appeal against that decision was dismissed. 13 The defendant had also applied to strike out the plaintiff’s claim in SUM 428/2019 (“SUM 428”), but was unsuccessful. This application was heard together with SUM 148/2019. 14 At trial, two witnesses were called for the plaintiff – himself, and Dr Phan Tuan Quang (“Dr Phan”). At the close of the plaintiff’s case, the defendant made a submission of no case to answer. The effect of such a submission is set out in greater detail below, but it suffices to note at this point that the defendant acknowledged that his affidavit of evidence-in-chief (“AEIC”) would therefore not be admitted into evidence, and elected not to give any evidence in these proceedings. I subsequently directed that parties make written submissions before further oral arguments were heard before me on 30 November 2020.",
        "The Issues": "15 The issues which the parties have identified and joined issue over are as follows:13Foot Note 13×Plaintiff’s Opening Statement at [1]. (a) Whether the Offending Words in the Post, in their natural and ordinary meaning, meant and were understood to mean that the plaintiff was complicit in criminal activity relating to 1MDB; (b) Whether the Offending Words in the Article, in their natural and ordinary meaning, meant and were understood to mean that the plaintiff corruptly used his position as Prime Minister to help Mr Najib Razak launder 1MDB’s funds; (c) Whether there was substantial publication in Singapore of the Offending Words in the Post and/or the Offending Words in the Article; (d) Whether there was republication in Singapore of the Offending Words in the Post and/or the Offending Words in the Article; (e) Whether, by reason of the publication and/or republication of the Post and/or the Article, the plaintiff has been gravely injured in his character and reputation, and has been brought into public scandal, odium and contempt; (f) Whether the defendant aggravated the libels; (g) Whether there was malice on the part of the defendant; (h) Whether the plaintiff’s decision to issue these proceedings against the defendant was an abuse of process; and (i) Whether the plaintiff is entitled to the reliefs he is claiming and if so, what is the quantum of damages which he is entitled to? 16 In this judgment, I will address the issues in the following order: (a) The effect of the submission of no case to answer; (b) What the meaning of the defamatory words is; (c) Whether the defendant has substantially published and/or republished the defamatory words; (d) Whether the defendant has caused the plaintiff loss; (e) Whether there has been an abuse of process; and (f) What the appropriate remedies are.",
        "The Law on a Submission of No Case to Answer": "17 The law on a submission of no case to answer is well-settled following the recent decision by a five-membercoramof the Court of Appeal inMa Hongjin v SCP Holdings Pte Ltd[2020] SGCA 106 at [32] and [33] that: 32 Insummary, the plaintiffdoesindeed bear the legal burden of proving its case against the defendant in a civil case ona balance of probabilities. Where the defendant has made a submission of no case to answer, this particular standard of proof ismet or dischargedby the plaintiff satisfying the court that there is aprima faciecase on each of the essential elements of its claim. This is because in a situation where the defendant has made a submission of no case to answer, such a submissionmustbecoupledwith an electionnotto call evidence(pursuant to the principle laid down inHo Yew Kong[v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 (“Ho Yew Kong”)]), with the result being that if the plaintiff has established aprima faciecase on the facts in issue (that are essential to its claim), this wouldessentiallyresult in the court finding that the plaintiff has discharged its burden of proving the aforementioned factson a balance of probabilities. This is due to the fact that, upon the plaintiff establishing aprima faciecase with respect to the relevant facts in issue, theevidentialburden willshifttothe defendant.However, because the defendant hashad(in the situation of asubmission of no case to answer) toelecttocallnoevidence, it would beunableto adduce(any)evidencetoeither disprovethe plaintiff’s positionorweaken it such that the facts that the plaintiff relies upon are “not proved” … 33 We therefore affirm that, in the situation where the defendant has submitted that it has no case to answer and has (as it legally must) also elected to call no evidence if it fails in this submission, theplaintiffwouldsucceedif it can establish that it has aprima faciecase on each of the essential elements of its claim. For the avoidance of doubt (and also for the reasons stated above, the plaintiff would (simultaneously) havenecessarily provedits (overall) case against the defendant on abalance of probabilities. [Emphasis original] 18 Thus, a defendant who elects to make a submission of no case to answer must make an accompanying election not to call evidence in the event that submission fails. The defendant here has so elected. Following from that, the plaintiff will succeed so long as he can establish that he has aprima faciecase on each of the essential elements of his claim. 19 As the Court of Appeal observed inLena Leowardi v Yeap Cheen Soo[2015] 1 SLR 581 (“Lena Leowardi”) at [24], in assessing whether the plaintiff has managed to establish aprima faciecase, the Court will assume that any evidence led by the plaintiff is true, unless it is inherently incredible or against common sense. Further, as noted by the Court inRelfo Ltd v Bhimji Velji Jadva Varsani[2008] 4 SLR(R) 657 at [20], if circumstantial evidence is relied on by the plaintiff in a situation where the defendant has made a submission of no case to answer, the circumstantial evidence does not have to give rise to an irresistible inference as long as the desired inference is one of the possible inferences which might arise. 20 Viewed holistically, it is only if (a) the plaintiff’s evidence, at face value, does not establish a case in law, or (b) the evidence led by the plaintiff is so unsatisfactory or unreliable that his burden of proof has not been discharged that a submission of no case to answer by a defendant succeeds:Bansal Hemant Govindprasad v Central Bank of India[2003] 2 SLR(R) 33 from [14] to [16]. 21 A further issue which arises for my determination is whether or not an adverse inference should be drawn against the defendant for failing to testify or adduce evidence in his defence. The plaintiff contends that in certain circumstances, a defendant’s silence may be construed as strengthening the plaintiff’s case. The plaintiff points toThio Keng Poon v Thio Syn Pyn and others and another appeal[2010] 3 SLR 143 (“Thio Keng Poon”) at [43], where the Court of Appeal approved the views of Brooke LJ in the English Court of Appeal decision ofWisniewski v Central Manchester Health Authority[1998] PIQR P324 at 340, that: (1)In certain circumstancesa courtmaybe entitled to draw adverse inferences from the absence or silence of a witness who might be expected to have material evidence to give on an issue in an action. (2) If a court is willing to draw such inferences, they may go to strengthen the evidence adduced on that issue by the other party or to weaken the evidence, if any, adduced by the party who might reasonably have been expected to call the witness. (3) There must, however, have been some evidence, however weak, adduced by the former on the matter in question before the court is entitled to draw the desired inference:in other words, there must be a case to answer on that issue. (4) If the reason for the witness’s absence or silence satisfies the court, then no such adverse inference may be drawn. If, on the other hand, there is some credible explanation given, even if it [is] not wholly satisfactory, the potentially detrimental effect of his/her absence or silence may be reduced or nullified. [Emphasis original fromThio Keng Poon] Furthermore, an adverse inference will not be drawn immediately against the defendants simply because they chose to submit that there was no case to answer:Lim Eng Hock Peter v Lin Jian Wei and another[2009] 2 SLR(R) 1004 (“Lim Eng Hock Peter(HC)”)at [209]. 22 In this case, the plaintiff contends that an adverse inference may be drawn against a defendant who has made a submission of no case to answer if there is no credible explanation for his silence. The defendant did not appear to contest this proposition in principle. Rather, the crux of the defendant’s response in this regard was twofold: that (a) the defendant had good reason to not provide evidence, and (b) in any event, any adverse inference could only go towards the issue of whether the defendant was maliciously motivated, since that was the only issue of fact on which the defendant’s evidence might have been of assistance. However, whether the defendant was maliciously motivated was an issue which went towards the aggravation of damages, rather than towards establishing the defendant’s liability. Accordingly, the defendant took the view that any adverse inference, even if made, would not assist the plaintiff in substantiating the defendant’s liability. 23 In my view, no adverse inference can be drawn here. As noted inLim Eng Hock Peter(HC)at [209], an adverse inference does not automatically arise simply because of a submission that there is no case. An adverse inference can generally be properly drawn if there is something in the evidence that effectively demands an answer or response from the defendant, such as where the evidence all points to him and it is apparent that things could be made clear simply through his evidence coming in.  It would otherwise be rare for an adverse inference to be drawn, and I reject the plaintiff’s argument as lowering the threshold far too much.",
        "The Appropriate Meaning to be Attributed to the Allegedly Defamatory Words": "24 The plaintiff asserts that the defamatory words meant that (a) the plaintiff was complicit in 1MDB-related criminal activity, and (b) the plaintiff used his position as Prime Minister to help Mr Najib launder money from 1MDB. 25 As held by the Court of Appeal, the appropriate meaning to be attributed to allegedly defamatory words is their “natural and ordinary meaning”, with such meaning to be determined by reference to an ordinary reasonable person, not unduly suspicious or avid for scandal, using his general knowledge and common sense, including inferences from such general knowledge and experience:Review PublishingCo Ltd and another v Lee Hsien Loong and another appeal[2010] 1 SLR 52 (“Review Publishing”) at [27] to [31], and [81]. The intention of the defendant is irrelevant in determining the meaning of the impugned words:Slimand others v Daily Telegraph Ltd and others[1968] 2 QB 157 at 172, as applied inLow Tuck Kwong v Sukamto Sia[2014] 1 SLR 639 at [36]. 26 In bothReview Publishingat [81], andLee Hsien Loong v Roy Ngerng Yi Ling[2014] SGHC 230 at [32], the Court observed that the ordinary reasonable person is assumed to possess general knowledge and experience of worldly affairs. This general knowledge extends to matters of current affairs which have entered the public consciousness. The various matters canvassed by the Plaintiff do point to a general knowledge that there was wrongdoing in the affairs of 1MDB. In particular, several news reports indicated that (a) funds had been corruptly defalcated, (b) efforts were underway in various countries to try to recover them, and (c) Mr Najib was involved, along with a number of persons based in Singapore, Malaysia, and abroad.14Foot Note 14×Plaintiff’s Closing Submissions (“PCS”) at [13].This general knowledge concerning the misuse of 1MDB funds may be said to have arisen from,inter alia, the following sources: (a) On 2 July 2015, the Wall Street Journal reported that Malaysian investigators investigating 1MDB had traced nearly US$ 700 m of deposits into what they believed were the personal bank accounts of Mr Najib; (b) On 5 July 2015, the Straits Times reported that Malaysian authorities had raided several Malaysian firms in connection with the funds that Mr Najib was alleged to have received from 1MDB; (c) On 20 July 2016, the United States Department of Justice announced through a press release that it had filed civil forfeiture complaints seeking the forfeiture and recovery of more than US$ 1 bn in assets associated with an international conspiracy to launder funds misappropriated from 1MDB. This was also reported in the Straits Times; (d) On 2 September 2016, the Straits Times reported that it was Mr Najib whom the United States Department of Justice alleged had received large sums of 1MDB’s funds through his personal accounts; (e) In 2016 and 2017, it was reported by the Straits Times and Channel News Asia that a number of bankers in Singapore had been charged with and convicted of money laundering and other offences in connection with 1MDB; (f) On 21 May 2018, the Straits Times reported that the Malaysian government was investigating possible criminal conduct in relation to 1MDB, and had raided several residences linked to Mr Najib; (g) Over the course of July to September 2018, the Straits Times and Channel News Asia reported on the charges which Mr Najib faced. These included charges of criminal breach of trust, money laundering, and abuse of power. In any event, the defendant does not appear to seriously contend that knowledge of 1MDB and its association with corruption, abuse of power, and fraud is not within the scope of the reasonable person’s general knowledge. 27 The defendant’s Post, as reproduced above, states that he has shared a link, from THECOVERAGE.MY, with the following text:15Foot Note 15×See [6] above. Breaking News: Singapore Lee Hsien Long Becomes 1MDB’s Key Investigation Target – Najib Signed Several Unfair … 28 The title of the Article, which was linked from the Post, was: Breaking News: Singapore Lee Hsien Loong Becomes 1 MDB’s Key Investigation Target – Najib Signed Several Unfair Agreements with Hsien Loong in Exchange of Money Laundering. 29 The phrase “Lee Hsien Loong becomes 1 MDB’s key investigation target” clearly suggests that the plaintiff was involved at the heart of the 1MDB-related wrongdoing. After all, the connotation of one having become a “key” investigation target points strongly towards one’s deep involvement in the 1MDB scandal. The 1MDB scandal has also become, in effect, a byword for corruption and improper governmental dealings, and the average reader of the Post and/or Article would be amply aware of this given the multitude of news articles on the topic.16Foot Note 16×See PCS at [13].Moreover, the title of the Article further suggests that various “unfair” agreements had been entered into between the plaintiff and Mr Najib, which were the result of aquid pro quowith the plaintiff providing the assistance of Singapore banks in laundering stolen money. Against the backdrop of allegations of criminality surrounding the defalcation within 1MDB, the defendant’s Post extracting part of the title of the Article, and the Article itself, attract the meaning that the plaintiff is corrupt and, at the very least, implicated in the wrongdoing associated with 1MDB. The Article, in particular, clearly insinuates that the plaintiff was involved in criminal activities in order to obtain agreement on various deals with Mr Najib. The following extracts from the Article speak for themselves: Breaking News : Singapore Lee Hsien loong Becomes 1MDB’s Key Investigation Target – Najib Signed Several Unfair Agreements With Hsien LoongIn Exchange For Money Laundering It is believed that Najib Razak signed several unfair agreements with Singapore’s Lee Hsien Loong, like building the Singapore-Malaysia High Speed Rail when the country was in a trillion RM debt and a grossly under-priced water sale agreement,in exchange for Singapore banks’ assistance in money laundering 1MDB’s billions. If found guilty, Lee Hsien Loong and Singapore may be sanctioned internationally. […] Malaysian investigators are now trying to findthe secret deals between the two corrupted Prime Ministers of Singapore and Malaysiawhen Najib was still in power. It is believed that Najib Razak signed several unfair agreements with Singapore’s Lee Hsien Loong … in exchange for Singapore bank’s assistance in money laundering 1MDB’s billions. If found guilty, Lee Hsien Loong and Singapore may be sanctioned internationally. Singapore was forced to reopen the 1MDB investigationafter the Najib Razak dictatorship was voted out of power, despite closing it a year ago in May 2017. After Malaysians voted in a new government. The Singapore government was immediately summoned for questioning in Kuala Lumpur. According to a source closed [sic] withthe dictator, Lee Hsien Loongrefused to be personally interviewed. The new Malaysian Prime Minister Mahathir Mohammad has beenkeeping his distance away from Lee Hsien Loongafter his election. Just last week, the Malaysian PMrejected Lee Hsien Loong’s invitefor a holiday retreat and called for a bilateral discussion to increase water price. [Emphasis in bold original, emphasis added in underline] 30 The reference to the news sources cited at [26] above is not reliance on extrinsic evidence in construing the meaning of words, which is prohibited by cases such asReview Publishingat [29] andBank of China v Asiaweek Ltd[1991] 1 SLR(R) 230 at [16]. As the plaintiff has argued, the Court inLee Hsien Loong v Singapore Democratic Party[2007] 1 SLR 675accepted that news reports could be considered in determining how widely known certain facts are, and thus how an ordinary reasonable person would identify the natural and ordinary meaning of the words used. Given the sheer volume of reporting on the issue, the facts surrounding the 1MDB episode cannot be said to go beyond the ordinary reasonable person’s general knowledge. Furthermore, the point of the extrinsic evidence rule is that reference to such extrinsic evidence may take the meaning of the allegedly defamatory words out of their natural and ordinary meaning, such that the meaning then would really be one of innuendo:Goh Chok Tong v Joshua Benjamin Jeyaretnam[1997] 3 SLR(R) 46 at [93] to [100]. A case founded on innuendo would have to be specifically pleaded. However, there is no evidence to suggest that the plaintiff is in fact relying on some covert innuendo meaning on the instant facts. As observed by the Court inGordon Berkeley Jonesv Clement John Skelton[1963] 1 WLR 1362 from 1370 to 1371, what counts as impermissible extrinsic fact for the purpose of the extrinsic evidence rule is something that goes beyond general knowledge. 31 There was also some argument between the parties about theChasemeanings as laid down inChase v NewsGroup Newspapers Ltd[2002] EWCA Civ 1772 (“Chase”) at [45].17Foot Note 17×See, for example, PCS at [54]et seqand Defendant’s Closing Submissions (“DCS”) at [23]et seq.I am doubtful though that this was, in the end, useful. Such determination of meaning was considered inChasein the context of determining what was to be put forward in a defence of justification. One must bring in sufficient evidence to show the truth of what was asserted, which must in turn be dependent on what exactly was asserted. This thus gave rise to the need to calibrate, by reference to the three levels ofChasemeanings, what specifically was said in a libel. At [46] ofChase,Brooke LJ traced the distinction in levels of meaning to Lord Devlin inRubber Improvement Ltdand another v Daily Telegraph[1964] AC 234 at 282: I do not mean that ingenuity should be expended in devising and setting out different shades of meaning. Distinct meanings are what should be pleaded; and a reasonable test of distinctness would be whether the justification would be substantially different. In the present case, for example, there could have been three different categories of justification – proof of the fact of an inquiry, proof of reasonable grounds for it, and proof of guilt. Given that no plea of justification has been raised here, I could not see that reliance onChasewas useful in the analysis. In any event, I note the observation inNg Koo Kay Benedict and another v Zim Integrated Shipping Services Ltd[2010] 2 SLR 860 (“Ng Koo Kay Benedict”) at [17] that “All three [Chase] levels are generally regarded as being defamatory, though in varying degrees”. At highest, therefore, the defendant appears to contend that the effect of the defamatory words was not particularly impactful. However, this is simply not borne out on the facts, particularly in relation to the Article. In the Article, specific allegations are made regarding the plaintiff’s corruption, notably in relation to the provision of Singapore banks’ assistance in laundering 1MDB funds. Moreover, as the defendant himself acknowledges, relying onStocker v Stocker[2020] AC 593 from [41] to [46], a reader casually parsing a Facebook post adopts an impressionistic and fleeting response.18Foot Note 18×DCS at [20] to [22].He may not be entirely alive to the nuances of theChaselevels, and may instead only draw a loose and imprecise association between the wording of the Post and/or Article, and the criminality associated with 1MDB. Whatever the case, I do not find that the defendant can reasonably claim that the defamatory words did not impugn the plaintiff’s character and suggest that the plaintiff was, at the very least, involved in serious and dishonest criminal activity (see also [29] above).",
        "Whether the Defendant has Substantially Published or Republished the Defamatory Words": "32 There are two sub-issues that arise in relation to the question of whether or not there has been substantial publication or republication by the defendant of the defamatory words: (a) Whether the Post on Facebook amounts to publication of defamatory material; (b) Whether hyperlinking to the Article amounts to publication of defamatory material; Both questions may be answered in the affirmative on the instant facts.",
        "Publication": "33 The plaintiff bases his claim on both the Post, and the Article that was linked in the Post. As explained above, the Article was accessible through the Post, by way of a hyperlink. 34 The defendant accepts that he is responsible for having published the Post, though he contends that there has not been any “substantial” publication as not many individuals accessed and read the Post.19Foot Note 19×DCS at [2(a)].As for the Article, the defendant’s position is that he is not responsible for its publication because there is no evidence that anyone clicked on it as a result of his sharing the Post.20Foot Note 20×DCS at [2(b)]. 35 Implicit in the defendant’s position on the Article, however, is a recognition that had individuals clicked on the Article as a result of his sharing the Post, he would be responsible for publication of the Article. Put another way, the defendant does not appear to deny that providing a hyperlink to a separate article in a post can, in principle, be a basis for a finding that there has been publication of that article. 36 On the facts of this case, I find that there has been publication by the defendant of the Post. The defendant has conceded as much. The issue of how substantial the publication was will be dealt with subsequently, when I consider the question of quantum (see below from [92] to [106]). For the moment, it suffices for me to note the view of Belinda Ang J (as she then was) inQingdao Bohai Construction Group Co, Ltd and others v Goh Teck Beng and another[2016] 4 SLR 977 (“Qingdao Bohai”) at [61] and [136] that “substantial” publication simply refers to publication to a “sufficient number [of readers] to justify judgment for damages”. This, I should add, simply means that there must have been a real and substantial tort, and that the publication must not be, in effect,de minimis. As I will go on to explain, the instant publication can hardly be said to not have been substantial in Singapore. 37 As for the Article, I also find that it has been published by the defendant. This arises on two bases: First, because the Article is part of the Post, by virtue of having been hyperlinked from the Post. Second, because the Article itself has been published because the defendant has made it accessible, and individuals within Singapore have, through his link, accessed it. In my view, there is a platform of facts which suffices for me to rely on either of those two bases to conclude that there has been publication of the Article. 38 Turning to the first basis for finding that the Article has been published by the defendant, the reasoning is fairly straightforward: insofar as the Article forms part of the Post, and the Post has itself been published, the Article (and its content) can be said to have been published as well. 39 Support for this proposition may be drawn from the view of Nicklin J inDanielPoulter MP v Times Newspapers Limited[2018] 3900 QB (“Poulter”) at [21]: The position seems to me to be different in relation to the online publication. I noted inFalter v Altzmon[2018] EWHC 1728 QB that the rule fromCharlestonthat readers are taken to read the whole of a publication has its limits in relation to links provided in an online version of an article: [12] The Internet provides a degree of challenge to [the] orthodoxy [ofCharleston] because it is possible to set out in on-line publications many hyperlinks to external material. It is perhaps unrealistic to proceed on the basis that every reader will follow all the hyperlinks, but everything depends on its context. For example, if in a single tweet there is a single statement that says, “X is a liar” and then a hyperlink is given, it is almost an irresistible inference to conclude that the ordinary reasonable reader would have to follow the hyperlink in order to make sense of what was being said. At the other end of the spectrum, a very long article could contain a very large number of hyperlinks. Only the most tenacious or diligent reader could be expected to follow every single one of those hyperlinks. Such a reader could hardly be described as the ordinary reasonable reader. How many links any individual reader would follow would depend on an individual’s interest in or knowledge of the subject matter or perhaps other particular reasons for investigating each of the hyperlinks in question. Of particular note from this extract is the view that if only a single statement is made, and one hyperlink given, it is “almost an irresistible inference” to conclude that the ordinary reasonable reader would follow the hyperlink, thus triggering the rule inCharleston v News Group Newspapers Ltd[1995] 2 AC 65 that the material has to be read holistically and in full. It also bears note that the defendant himself relies onPoulter, and in fact on this specific extract at [21] of that case. 40 The instant facts, however, are not directly akin to the situation highlighted inPoulter, where an almost “irresistible inference” would be drawn. The main difference is that the defendant simply shared a link (with some of the text of the title of the linked Article shown), without any comment of his own.If there were some comment from the poster either endorsing or disparaging the linked remarks or the article, then the determination would be reasonably clear. But, if nothing else is appended, then whether the provision of the link amounts to a publication would have to be more carefully considered. 41 On one view, a bare link is all that it is: there is no publication, because all that is in fact published is the hyperlink, which on clicking, would bring the reader elsewhere. This would appear to be the position taken in Canada in the decision of the majority inCrookes v Newton[2011] 3 SCR 269. Specifically, Abella J (Binnie, LeBel, Charron, Rothstein, and Cromwell JJ concurring) held at [44] that “… in my view the use of a hyperlink cannot, by itself, amount to publication even if the hyperlink is followed and the defamatory content is accessed”. This somewhat absolute position was heavily influenced by the Canadian Charter of Rights and Freedoms, and has not been followed in both Australia (see for example,Bailey v Bottrill (No 2)[2019] ACTSC 167 at [54]) and England (see for example,Caine v Advertiser and Times Ltd & Ors[2019] EWHC 2278 (QB) at [61], relying on the decision of the European Court of Human Rights inMagyar Jeti Zrt v Hungary[2018] 12 WLUK 615 at [77]). In any event, I am not persuaded that Abella J’s position should be adopted in Singapore. It is not only predicated heavily on an instrument which does not have effect in Singapore, but more fundamentally, ousts an entire species of publication from potentially being defamatory without closer examination on the facts of what a bare hyperlink, with no added commentary, might convey in all the circumstances. A more holistic assessment should be preferred, and it is for that reason that I find the English and Australian cases I have cited above to be of greater utility on the facts. A fact-centric analysis should be pursued. 42 Considering the relevant facts and circumstances, I am satisfied that the Article should be construed as part of the Post for the following reasons: (a) First, the link to the Article was the only substantive content of the Post. Apart from the link, the only other content in the Post was an extract of the text of the Article’s title, and a photo from the Article. The entire content of the Post was, in effect, the Article, and it would be artificial to draw a bright-line distinction between the two. (b) Second, there does not appear to be any other plausible interpretation of the link to the Article in the Post apart from the defendant in some way supporting or endorsing the content in the link. The entirety of his message in the Post centred around the link to the Article, and he was at the very least drawing attention to the Article and providing access to it in the Post. Further, an interpretation that the defendant was endorsing the content of the Article would cohere with his own self-described role as a “staunch government critic”.21Foot Note 21×Transcript of 6 October 2020, Page 80 at Line 14; Page 120 at Line 24; Page 124 at Lines 19 to 20; Page 135 at Line 5; Page 138 at Line 9; and Page 154, Line 25 to Page 155, Line 1.This descriptor is present on,inter alia, the defendant’s own website. (c) Third, as alluded to at [19] above, one effect of the defendant’s submission of no case to answer is that the plaintiff does not need to establish an irresistible inference that the Article was part of the Post. All that is required is for the plaintiff to show that the desired inference is one of the possible inferences. 43 In addition, I note two Singaporean decisions pertaining to when publication online suffices as publication for the purposes of defamation. In bothQingdao Bohaiat [35] andGolden SeasonPte Ltd and others v Kairos Singapore Holdings Pte Ltd and another[2015] 2 SLR 751 (“Golden Season”) at [54], the High Court held that publication by the defendant occurred if (a) the defamatory statements were made available online, and (b) the defamatory material was received by a third party in such a way that it is understood and intelligible. (The related but separate question of where such publication occurred is determined by where the reader or end user accesses the statement:Ng Koo Kay Benedictat [26]). This implies that a Facebook post which carries a link, and which makes the defamatory statement available, would count as a publication if it could be established that third parties had accessed that link. In contrast, and subject of course to the precise facts, a hypothetical Facebook post that merely referred or alerted other users to the existence of the original defamatory statement, without carrying a link, might not count as publication. I do note that it is perhaps easier for a Facebook user to post or a share a link to the original statement than to compose and type out an entirely new statement alerting others to the original, but such ease of posting or sharing cannot rescue a post from being publication for the purposes of defamation. 44 The decisions inQingdaoBohaiandGoldenSeasonare decisions of coordinate jurisdiction, and therefore not binding on me.  But, with respect, their approach is sound in principle. Given that it is common ground that the defendant did make the Article available online by linking to it in the Post (thus satisfying the first requirement set out inQingdaoBohaiandGolden Season),the next issue is whether the second requirement, that a third party has accessed the defamatory material in an intelligible form, is met.22Foot Note 22×DCS at [2(a)]. 45 On the basis of what has been described as a “platform of facts”, there is at least aprima faciecase that the Article had been accessed through the link in the Post in an intelligible form. InKoh Sin Chong Freddie v Chan Cheng Wah Bernard and others and another appeal[2013] 4 SLR 629 (“Koh Sin Chong Freddie”) at [43] and [44], the Court of Appeal accepted that a platform of facts could be established from which the Court could properly infer that substantial publication had taken place. Some of the considerations which might form the basis for this platform of facts are as follows: (a) First, the number of “likes”, “shares”, “reactions” and comments which a post draws might provide insight into the number of individuals who accessed it, especially since not every individual who reads the post will necessarily respond in such a fashion:Bolton v Stoltenberg[2018] NSWSC 1518 at [154] and [155], as upheld inStoltenberg v Bolton; Loder v Bolton[2020] NSWCA 45 at [102]; (b) Second, the number of “friends” and “followers” the poster has on the relevant social media platform is also relevant in determining whether or not substantial publication has taken place:Pritchard v Van Nes[2016] BCJ No. 781 at [83]; (c) Third, setting the privacy settings of the relevant post to “public” is also more likely to give rise to an inference that the defamatory statement had been accessed by third parties and that substantial publication arose: Doris Chia,Defamation: Principles and Procedure inSingapore and Malaysia(LexisNexis, 2016) (“Doris Chia”) at [15.10] and [15.11]. 46 On the facts, it is uncontested that 45 persons responded to the Post containing the link to the Article in the manner outlined at [45(a)] above. It is similarly common ground that, at the material time, the defendant had about 5,000 Facebook friends, and 149 “followers”. Moreover, the privacy settings of the Post had been set to “public”. Given this evidence, I consider it exceedingly unlikely that it could seriously be the case that not asingleperson accessed the Article through the link in the Post. To my mind, insisting on direct evidence of such access is unrealistic, and does not reflect the simple truth of how hyperlinks are used on the internet. In any event, the circumstantial evidence outlined here does not need to give rise to an irresistible inference given the defendant’s submission of no case to answer. All that is required is that the desired inference is one of the possible inferences:Lena Leowardiat [24],Tan Juay Pah v Kimly Construction Pte Ltd[2012] 2 SLR 549 at [37]. I am satisfied that, on the facts outlined above, it is at least a possible inference that a third party had accessed the Article through the link on the Post, and that there had thus been publication of the Article. 47 In sum, there appears to me to be ample basis to find that both the Post and the Article have been published. The question of whether there has been substantial publication is considered more fully below from [92] to [106], where I conclude that there has been publication to a sufficient number of persons in Singapore to warrant substantial damages.",
        "Whether the boundaries of defamation should take into account alternative regimes": "48 An issue that I asked the parties to address me on was whether the enactment of the Protection from Online Falsehoods and Manipulation Act (Act 19 of 2019) (“POFMA”), potentially providing an alternative cause of action, should have any effect on defamation law. The defendant asserts that the POFMA has a direct and significant impact on defamation in that in circumstances where the facts of a case might be caught by the provisions of the POFMA, it should not be open to an individual to be able to bypass the Act and sue in defamation. The defendant contends that this would deny a citizen the protections built into the POFMA, and potentially upset the balance struck by Parliament in an act of “constitutional heresy”.23Foot Note 23×DCS at [84].By contrast, the plaintiff argues that the POFMA is separate from and has not changed the law of defamation in Singapore. 49 I am satisfied that the POFMA does not alter the law of defamation in Singapore. Given the stated purpose of the POFMA, and in particular the clear indication in the Ministerial speeches during the Second Reading of the Protection from Online Falsehoods and Manipulation Bill that the Act was not intended to alter the law of defamation, I did not see how the defendant’s position on the POFMA was at all tenable. Moreover, there was a marked absence of any provisions that could be interpreted as effecting the change in the law which the defendant asserted. 50 First, and in contradistinction to defamation, the POFMA is concerned with falsehood rather than the harm caused to reputation as such. The preamble to the POFMA describes it as “[a]n Act to prevent the electronic communication in Singapore of false statements of fact, to suppress support for and counteract the effects of such communication, to safeguard against the use of online accounts for such communication and for information manipulation, to enable measures to be taken to enhance transparency of online political advertisements, and for related matters”. The purpose of the POFMA is thus to avoid or minimise damage to the country and its people or public confidence in the government and its agencies engendered by online falsehoods. However, the POFMA does not provide individuals with any right or cause of action arising from a false and defamatory allegation against them. This is a key distinction. While the POFMA is aimed at online falsehoods which trigger questions of the public interest, a defamation action is “fundamentally an action to vindicate a person’s reputation on a matter as to which he has been falsely defamed”, and the damages awarded in a defamation action “have to be regarded as the demonstrative mark of that vindication”:Tang Liang Hong v Lee Kuan Yew and another and other appeals[1997] 3 SLR(R) 576 at [128]. It bears particular note that the POFMA does not introduce any causes of action for individuals. Rather, it imposes criminal liability, which arises in the public sphere and which is not a substitute for the tort of defamation, which operates in the private sphere. I am guided by the observation of the Court of Appeal inACB v Thomson Medical Pte Ltd and others[2017] 1 SLR 918 at [185] that “a criminal prosecution is, by design, a matter between the State and an accused person; it is not a mechanism for victims to seek vindication of their private interests”. The POFMA and the law of defamation thus serve markedly different ends, and I am unable to accept the defendant’s suggestion that the latter has been constrained by the former. 51 I am fortified in my conclusion on this point by the clear and unequivocal observations made in the Parliamentary Debates on the POFMA. In a response to questions posed during the passage of the Protection from Online Falsehoods and Manipulation Bill, Minister for Law Mr K Shanmugam, made the following observations:24Foot Note 24×Singapore Parliamentary Debates. Official Report(8 May 2019) vol 94, 8.01pm, per Minister for Law Mr K Shanmugam. Ms Irene Quay asked about the relationship of this Bill with the Defamation Act and the Internal Security Act. The Defamation Act deals in the private law sphere, with damage to reputation. For example, if someone says you are corrupt, then if it is not true, you can sue to clear your name. And many people will want to. The Internal Security Act (“ISA”) deals with threats to national security. This Bill deals with falsehoods, to mitigate the impact and deter those who deliberately peddle in falsehoods, with [a] specific framework that is different from ISA. 52 I note in addition that there is not a single provision of the POFMA which expressly deals with defamation. Parliament also did not, even in light of the POFMA, amend any provisions in the Defamation Act (Cap 75, 2014 Rev Ed) or the provisions providing for criminal defamation at ss 499 to 502 of the Penal Code (Cap 224, 2008 Rev Ed). Given such absence of any express reference to defamation, or even to anything that could be construed as having any such effect, it would be far too much for the Court to dramatically alter the law of defamation in the manner sought by the plaintiff. 53 In any event, I note that the instant suit was commenced on 20 November 2018, while the POFMA was only passed on 8 May 2019. It is fairly settled that legislation does not generally apply to actions which are pending at the time the legislation comes into force unless the language of the legislation compels the conclusion that Parliament intended that it should:Wilson and others v Secretary of State for Trade and Industry[2004] 1 AC 816 at [198] andZainal bin Hashim v Government of Malaysia[1980] AC 734 at 742C. I see no basis to foist a retrospective application of the POFMA on the instant facts.",
        "Article 14 of the Constitution": "54 Turning then to freedom of speech, while Article 14(1)(a) of the Constitution protects freedom of speech, it is expressly subject to such restrictions as may be imposed by law by Parliament, including those which protect against defamation: Art 14(2)(a). Thus, the right of free speech under Art 14(1)(a) may be circumscribed by laws enacted to deal with defamation. 55 Several cases illustrate this point. InJeyaretnam Joshua Benjamin v Lee Kuan Yew[1990] 1 SLR(R) 337 at [5], the Court of Appeal expressly observed that “the constitutional right of freedom of speech and expression is unarguably restricted by the laws of defamation”. Observations to similar effect have been made inJeyaretnam Joshua Benjamin v Lee Kuan Yew[1992] 1 SLR(R) 791 at [61], andLee Hsien Loong v Singapore Democratic Party and others and another suit[2009] 1 SLR(R) 642 at [102]. 56 I add for completeness that, given my finding that the POFMA does not infringe on the law of defamation, I do not see how the POFMA changes the balance struck between the constraints imposed by the law of defamation on the one hand, and the right to free speech and expression on the other. In any event, the balance to be struck between the right to free speech and the constraints which exist upon that right as a broad question is one for Parliament to address:Review Publishingfrom [269] to [271]. In passing the POFMA, while at the same time also making clear that the POFMA does not infringe on the law of defamation, Parliament must be taken to have at least tacitly endorsed the balance struck in the post-POFMA landscape. In any event, the defendant himself appears to have accepted that Parliament has struck the balance it deemed fit between freedom of expression and the private right to reputation following the passage of POFMA.25Foot Note 25×DCS at [112]. 57 I am therefore unable to accept that Art 14 of the Constitution necessitates that I constrain the law of defamation in the defendant’s favour. I note for completeness that the defendant has not sought to rely onReynoldsprivilege, as set out inReynolds v Times Newspapers Ltd[2001] 2 AC 127, in its submissions.",
        "Whether the Defendant has Caused the Plaintiff Loss": "58 The plaintiff argues that by virtue of the defendant’s substantial publication and/or republication of the defamatory words, the plaintiff has been gravely injured in his character and reputation, and has been brought into public scandal, odium, and contempt.26Foot Note 26×PCS at [219].The plaintiff’s case is that it therefore follows that loss was caused. 59 The defendant argues in response that (a) the Post and Article do not bear the meaning contended by the plaintiff, (b) the Post and Article are not defamatory, and (c) any damage to the plaintiff’s reputation has already been vindicated and/or rebutted by a series of statements and articles from government agencies and ministers refuting the allegedly defamatory meaning.27Foot Note 27×DCS at,inter alia¸[37] and [102]. 60 Having considered parties’ arguments, I find that loss was indeed caused. Arguments (a) and (b) by the defendant have already been addressed above when the meaning of the offending words was considered from [29] to [31]. The only argument by the defendant relating primarily to the existence of loss, argument (c), is the sole one which remains at this point. On that argument, I find that the plaintiff’s reputation was harmed irrespective of the actions or statements of the government agencies and ministers. I now turn to consider this in greater detail.",
        "The effect of the actions of the government agencies and ministers": "61 The defendant relied on the actions taken by various government agencies and ministers to counter the allegations in the Article. These actions include, but are not limited to:28Foot Note 28×DCS at [102]. (a) On 8 November 2018, the High Commission of the Republic of Singapore in Malaysia indicated that the defamatory words were “fake news and clearly libellous”; (b) On or around 9 November 2018, Mr K Shanmugam, Minister for Law and Home Affairs, stated that the defamatory words were “absurd”, “false”, and that “the police will take action against all involved”; and (c) On or around the same day, the Monetary Authority of Singapore stated that the defamatory words were “false and malicious” and that a police report had been filed, while the IMDA released a statement that the defamatory words were “baseless and defamatory”. The defendant specifically emphasised that the above actions had been carried out by individuals or institutions of high public standing, in credible publications. Accordingly, it was contended that any harm caused by the defamatory words was neutralised or in some sense ameliorated. 62 These actions and speeches did not, to my mind, reduce the harm caused to the plaintiff’s reputation for the purposes of ascertaining if there had been damage suffered in the tort of defamation. First, the law of defamation does not require proof of actual damage to reputation:Tang Liang Hong v Lee Kuan Yew and another and other appeals[1997] 3 SLR(R) 576 from [110] to [112]. Rather, the concern is with the effect on right-thinking members of society:Sim v Stretch[1936] 2 All ER 1237 at 1240. The standard is notional or fictional; one does not conduct a survey of a selected group of persons to determine the effect of the defamatory words and the loss suffered. As long as it is reasonable that one’s reputation could be harmed, it does not matter if no one with such a view is in fact found and produced to the court. 63 The fact that there may be countervailing information provided or statements made does not reduce or negate a defamation, particularly when those statements or pieces of information do not even originate from the party which is responsible for the defamation. The focus of the analysis on the extent of the injury is on the effect of the alleged defamatory statement on the claimant’s reputation. It is clear followingGoh Chok Tong v JeyaretnamJoshua Benjamin[1997] 3 SLR(R) 46 at [50] and [84] that even if a defamatory imputation is so incredulous or outrageous that it would not be believed, such an imputation would still be defamatory. This was explained on the basis that if the incredulity of the imputation were a relevant consideration, it would lead to the ironic situation where an extremely outrageous statement would never be actionable simply because it was especially outrageous and unbelievable. The claimant in such a context would never have a right to vindicate his reputation were that to be the case. Of course, it would be otherwise if the allegedly defamatory statement were, in and of itself, to be taken as humour, for instance, but the point I underscore is that reference must be had to the statement itself, rather than the countervailing or refuting statements made by other sources. 64 I note also that an ironic or perverse situation, akin to that referred to inGoh Chok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46, would arise on the instant facts if the aggrieved party were held to in fact improve the position of the defaming party simply because the aggrieved party tried to refute defamatory allegations. It cannot be the case in the context of defamation that simply speaking up for oneself to try and clear one’s own name improves the position of the defamer, nor was any authority to that effect cited to me.",
        "Has there been an Abuse of Process and if so, what is its Effect": "65 The defendant alleges that the instant proceedings are an abuse of process on two bases: (a) First, the defendant points to the rule inJameel (Yousef) v Dow Jones & Co Inc[2005] QB 946 (“Jameel”) that the plaintiff’s claim is an abuse of process because it does not disclose a real and substantial tort; (b) Second, the defendant argues that the plaintiff has brought the present action in an attempt to circumvent the rule inDerbyshire v Times Newspapers Limited[1993] AC 534 (“Derbyshire”) that a government cannot bring an action in libel. I am unable to accept that either of these bases is made out.",
        "The doctrine in Jameel": "66 InJameel, the English Court of Appeal concluded that, as there had been no real and substantial tort committed within England, it was an abuse of process for the plaintiff in that case to pursue his claim. InJameel, a foreign claimant commenced proceedings for defamation in England against the publisher of an American newspaper in respect of an article posted on a website in America. The publisher, in response, adduced evidence which showed that only five persons in the jurisdiction of the English courts had accessed the website, of whom three were associates of the plaintiff. The publisher thus applied to strike out the claim on the ground that it had no reasonable prospect of success. In upholding the decision to strike out the claim, the English Court of Appeal held that no real and substantial tort had been committed within the jurisdiction, and that it would be an abuse of process for the plaintiff to be permitted to proceed with his claim. This was despite the publisher not having previously objected to the jurisdiction of the English courts on the basis offorum nonconveniens. The English Court of Appeal specifically observed that even if the plaintiff succeeded, the vindication it received would be minimal and the cost of the entire suit would have been out of proportion to what had been achieved. 67 I have some difficulty with the conclusion the defendant invites me to draw fromJameel, that the case applies wholesale to the instant facts to render the plaintiff’s claim an abuse of process. First, it appears to me that the decision inJameelwas animated in large part by developments unique to the United Kingdom, and which find no ready parallel in Singapore. The application of the reasoning and principles inJameelto the Singapore context thus must be highly fact-specific, and a broad-brush approach to applyingJameeldoes not appear entirely appropriate. The Court inJameelmade the following significant observations: 40 We accept that in the rare case where a claimant brings an action for defamation in circumstances where his reputation has suffered no or minimal actual damage, this may constitute an interference with freedom of expression that is not necessary for the protection of the claimant’s reputation. In such circumstances the appropriate remedy for the defendant may well be to challenge the claimant’s resort to English jurisdiction or to seek to strike out the action as an abuse of process … 54 … An abuse of process is of concern not merely to the parties but to the court. It is no longer the role of the court simply to provide a level playing field and to referee whatever game the parties choose to play upon it. The court is concerned to ensure that judicial and court resources are appropriately and proportionately used in accordance with the requirements of justice … 55There have been two recent developments which have rendered the court more ready to entertain a submission that pursuit of a libel action is an abuse of process. The first is the introduction of thenew Civil Procedure Rules. Pursuit of the overriding objective requires an approach by the court to litigation that is both more flexible and more proactive. The second is thecoming into effect of the Human Rights Act 1998. Section 6 requires the court, as a public authority, to administer the law in a manner which is compatible with Convention rights, in so far as it is possible to do so. Keeping a proper balance between the article 10 right of freedom of expression and the protection of individual reputation must, so it seems to us, require the court to bring to a stop as an abuse of process defamation proceedings that are not serving the legitimate purpose of protecting the claimant’s reputation, which includes compensating the claimant only if that reputation has been unlawfully damaged. [Emphasis added in italics and bold italics] Neither the Civil Procedure Rules of England and Wales (“CPR”) nor the Human Rights Act 1998 of the United Kingdom are directly applicable to Singapore. 68 Of course, that is not to say that the principles outlined inJameelare of no value in Singapore. Notably, the Court of Appeal made the following observations onJameelat [120] ofYan Jun v Attorney-General[2015] 1 SLR 752 (“Yan Jun”): … In light of our decision above at [111]–[114], it is,strictly speaking, not necessary for us to decide whether the Judge was correct in followingJameel. That having been said, there is a relatively significant body of authority in England endorsing the general principle established inJameel,viz, that a claim which discloses no real and substantial tort is liable to be struck out for being an abuse of process of the court, and the real concerns (as we have seen above) relate to itsapplication. This last-mentioned point is not surprising in view of the fact that the line-drawing required is not only fact-centric but may also be difficult to effect in borderline situations. Further, and leaving aside the differences in the rules of civil procedure between England and Singapore,Jameelalso contains somegeneral principlesthat may be applicable in the Singapore context. Hence, applying the principle inJameelto the facts of the present case, we would be of the view that this was far from being a borderline situation and that the Judge was therefore correct in following and applyingJameeland holding that the Appellant’s claim in defamation did not disclose a real and substantial tort. This would have served as ayet furtherreason as to why the Appellant’s claim in defamation should fail. [Emphasis original] The upshot of this extract is twofold: First, there remain “real concerns” with the precise application ofJameel, which must be highly fact-centric, though certain general principles may be applicable to the Singapore context. Second, the discussion ofJameelinYan Junproceeded on the basis that the facts inYan Jundid not disclose a “borderline” situation. Instead, it was clear in that case that the claim for defamation inYan Junwas not only wholly untenable, but also that even if the claim had succeeded, any vindication received would be out of all proportion to the cost of procuring it. The reasoning inJameelwas merely a “yet further” (emphasis original) reason as to why the claim should fail. 69 The second reason why I am reluctant to directly applyJameelto the present facts is because the reasoning in that decision centres in very large part on the English Court’s concern with forum shopping. This is evident from the face ofJameelitself at [70]: If we were considering an application to set aside permission to serve these proceedings out of the jurisdiction we would allow that application on the basis that the five publications that had taken place in this jurisdiction did not, individually or collectively, amount to a real and substantial tort. Jurisdiction is no longer in issue, but, subject to the effect of the claim for an injunction that we have yet to consider, we consider for precisely the same reason that it would not be right to permit this action to proceed. It would be an abuse of process to continue to commit the resources of the English court, including substantial judge and possibly jury time, to an action where so little is now seen to be at stake. Normally where a small claim is brought, it will be dealt with by a proportionate small claims procedure. Such a course is not available in an action for defamation where, although the claim is small, the issues are complex and subject to special procedure under the CPR. As noted in my earlier decision in these proceedings in SUM 428,Jameelwas really a case concerned with private international law principles. The defendant inJameelwas, after all, a US publisher of a newspaper that had published an allegedly defamatory article on the internet, and the issue which arose was whether the defamation claim could be struck out if no significant publication had occurred in England. Requiring that a real and substantial tort be “committed within the jurisdiction” (Jameelat [50]) appears to go towards establishing a connexion with English jurisdiction in the first place. This is further evident from the reference at [70] ofJameelthat it would be an abuse of process “to continue to commit the resources of the English court, including substantial judge and possibly jury time, to an action where so little is now seen to be at stake”. The reference to “so little … at stake” must be understood by reference to the fact that onlyfivepersons within English jurisdiction had accessed the defamatory content. It is certainly arguable that, insofar as English courts have attracted defamation cases with little or no connection with England, possibly because of the attractiveness of English damages awards,Jameelis a response to these concerns. There is no suggestion that concerns of forum shopping apply on the instant facts. 70 The defendant suggests that the decision inQingdao Bohaiillustrates wholesale acceptance by the Singapore courts of the reasoning inJameel. I decline to go so far, and make three observations on that case. First,Qingdao Bohaiwas precisely a case where there were at least some concerns of forum shopping. As the Court observed at [1] ofQingdao Bohai, that case concerned 12 articles posted on several foreign websites, and two articles containing similar content which were published in Taiwan on 29 November 2013 in two newspapers. The Court even went so far as to conclude that the first plaintiff in that case did not even have a reputation in Singapore at the material time:Qingdao Bohaiat [49], [53], and [60]. Second,Jameelwas, at best, a highly secondary basis for rejecting the plaintiff’s claim. Significantly, the plaintiff could not even establish that the first requirement for making out publication in the context of online defamation, namely that the defendant had uploaded or posted the defamatory material on the internet: at [121].Jameelwas thus not central to the reasoning of the Court inQingdao Bohai. Third, and critically, the facts inQingdao Bohaiwere somewhat extraordinary in that the Court concluded that only one single third party had accessed the allegedly defamatory material. This quite exceptional consideration is not reflected in, for example, the present case, where (a) several dozen individuals had directly interfaced or responded to the Post containing the linked Article (see [7] above); (b) the Post was published on the defendant’s Facebook Wall, and would have been flagged to his 5,000 Facebook friends and 149 Facebook followers; and (c) the Post was published on the “public” setting, meaning that even individuals who were not friends of the defendant on Facebook could access it. 71 The third point I make above segues appropriately into the broader point I make in relation toJameel, which is that even if the approach inJameelwere to be applied wholesale in Singapore law, it is not applicable to the current factual matrix. InJameel, likeQingdao Bohai, very few individuals were found to have accessed the allegedly defamatory material. In the entirety of the English Court’s jurisdiction, the claimant could only point to five persons who had accessed the defamatory material, and three of those five persons were associated with the claimant himself. This paucity of individuals who had accessed the defamatory material is markedly absent on the instant facts. To illustrate the thrust of the mischief which the rule inJameelseeks to address, the following extract is apposite: 69 If the claimant succeeds in this action and is awarded a small amount of damages, it can perhaps be said that he will have achieved vindication for the damage done to his reputation in this country, but both the damage and the vindication will be minimal. The cost of the exercise will have been out of all proportion to what has been achieved. The game will not merely not have been worth the candle, it will not have been worth the wick. 70 … It would be an abuse of process to continue to commit the resources of the English court, including substantial judge and possibly jury time, to an action where so little is now seen to be at stake. Normally where a small claim is brought, it will be dealt with by a proportionate small claims procedure. Such a course is not available in an action for defamation where, although the claim is small, the issues are complex and subject to special procedure under the CPR. I am not satisfied that the present claim is one “where so little … is at stake”. As has been accepted inLee Kuan Yew v Seow Khee Leng[1988] 2 SLR(R) 252 (“Seow Khee Leng”) at [25] andLee Kuan Yew and another v Vinocur John and others and another suit[1995] 3 SLR(R) 38 (“Vinocur John”) at [55], allegations of corruption and criminal conduct are “very grave charges”, especially when made against the Prime Minister of a country. Such allegations are an “attack on the very core of [his] political credo” and erode his “moral authority”. As I observed at [53] of my decision in SUM 428, these grave allegations may mar the Prime Minister’s reputation even if they are published to only a small number of individuals. In any event, publication in this case was not only to a small number of individuals (see [92] to [106] below). I am accordingly unconvinced thatJameelis applicable to the present facts. 72 The decision inLaitv Evening Standard[2011] 1 WLR 2973 (“Lait”) was also referred to in argument before me, with the defendant arguing that it illustrates thatJameelextends beyond any basis in the civil procedure rules and is concerned with balancing the private right of reputation and the public interest in freedom of expression. Support for this proposition is said to derive from [41] and [45] ofLait: 41 … The principle identified in theJameelcase consists in the need to put a stop to defamation proceedings that do not serve the legitimate purpose of protecting the claimant’s reputation. Such proceedings are an abuse of process. The focus in the cases has been on the value of the claim to the claimant; but the principle is not, in my judgment, to be categorised merely as a variety of thede minimisrule tailored for defamation actions. Its engine is not only the overriding objective of the Civil Procedure Rules but also, in Lord Phillips MR’s words, the need to keep “a proper balance between the article 10 right of freedom of expression and the protection of individual reputation”. This will especially be so where a defence of honest comment is advanced by a responsible – I emphasise the adjective – journalist … Accordingly the balance to be struck between public interest and private right will be a material consideration when the court has to consider the application of theJameelprinciple in a case where a responsible media defendant pleads honest comment. This conclusion is I think fortified by section 12(4)(a) of the Human Rights Act 1998 … 45 I do not consider that this approach … should be regarded as a radical step. The balance to be struck between public interest and private right is increasingly to be seen as a function of our constitution; and the law of defamation is increasingly to be seen as an aspect of it. It is no more than an ordinary incident of the common law’s incremental method that familiar notions such as abuse of process should be fashioned for its service. 73 What is immediately apparent fromLaitis the observation that the balance to be struck between public interest and private rights is to be seen as a function of the constitution. This is a significant distinction which again is not applicable in the Singapore context – the United Kingdom’s unwritten constitution does not operate in quite the same manner that Singapore’s Constitution does. For one, Singapore’s Constitution is expressly stated as being the supreme law of the land, whereas the United Kingdom’s common law and/or unwritten constitution does not expressly provide so. 74 Moreover,Laitmakes clear the relianceJameelplaces on the requirement of proportionality under the English CPR, as well as the Article 10 right to freedom of expression under the European Convention on Human Rights. Once again, these instruments do not have direct cognates in Singapore, even if some of the principles invoked may, depending on the facts, be applicable. What is more significant, however, is that there is clear Court of Appeal authority inReview Publishing(at [269] to [271]) indicating that it is for Parliament to strike the balance between freedom of expression and the constraints placed upon it by the law of defamation. My analysis above from [54] to [57] would thus apply even if I were amenable to the exhortation inLaitthat the balance to be struck between public interest and private right is “a function of our constitution”. 75 In sum, what can be gleaned from the decision inLaitis that the substantive underlying factors behind the approach adopted in England include instruments which have no precise equivalent in Singapore.Laitalso involved a situation where the English Court of Appeal had found that the primary meaning of allegedly defamatory words was a comment that had been honestly expressed. The English Court thus was disinclined to expend time and money to determine the remaining issue, which was “theoretical” and could not succeed unless it had been maliciously advanced. Since malice had not even been pleaded, there was no realistic prospect of success. By contrast, a legitimate and viable endpoint, namely the pursuit of vindication of reputation and damages, is being pursued by the plaintiff on the instant facts. It thus suffices for me to note that even ifJameelgoes beyond a conflicts of law or forum shopping issue, the principle laid down is not applicable in this case. As Choo Han Teck J observedonJameelinChan Boon Siang and others v JasminNisban[2018] 3 SLR 498 at [7], “although the court’s resources ought not to be used for the pursuit of trivial or pointless claims, each case must be determined on its own facts”.",
        "The doctrine in Derbyshire": "76 The case ofDerbyshirestands for the proposition that a government organ or entity cannot sue in defamation, as that would otherwise impede criticism, and thus freedom of speech. In his speech at 547F, Lord Keith observed that: … it is of the highest public importance that a democratically elected governmental body, or indeed any governmental body, should be open to uninhibited public criticism. The threat of a civil action for defamation must inevitably have an inhibiting effect on freedom of speech. 77 The plaintiff argues that the rule inDerbyshireis not applicable as he is claiming here as an individual, and not as a government organ or entity. The defendant argues to the contrary that the instant proceedings have been brought by the plaintiff to circumvent the rule inDerbyshire, and that it is in fact the government bringing the action under the “unconvincing guise of a personal suit”.29Foot Note 29×DCS at [104].The defendant points to three pieces of evidence which he asserts illustrates the true nature of the present proceedings as beingde factogovernment actions: (a)  First, the plaintiff had stated while under cross-examination that “he was bringing the claim because ‘the defendant has been a thorn in our side’”.30Foot Note 30×DCS at [100].The defendant asserts that the use of the “majestic plural” as opposed to the phrase “my side” illustrates that the true plaintiff is the government. (b) Second, the plaintiff acknowledged that the defamatory words had been found and brought to his attention as a result of governmental scanning, rather than by the plaintiff as an individual.31Foot Note 31×DCS at [101]. (c) Third, once aware of the defamatory words, the plaintiff was said to have “set the full machinery of the State into action”, having various ministers and government entities like the Monetary Authority of Singapore issue refutations of the said words.32Foot Note 32×DCS at [102]. 78 I am unable to accept the defendant’s three arguments. The defendant’s citation of the plaintiff’s statement is out of context, and elides the fact that the plaintiff later went on to state that the consideration he faced was how to clear his name. In any event, the defendant’s position places undue emphasis on the mere use of the word “our” – the plaintiff had distinguished, in his response while under cross-examination, between actions relating to his role in government (“And our answer is, in the end, put it to the test, the test of the ballot”) and actions relating to his personal reputation (“but when somebody defames me, whether he happens to be a [government] critic or not … I have to think what to do and what my legal options are and how I can clear my name”).33Foot Note 33×Transcript of 6 October 2020, Page 132, Line 24 to Page 133, Line 25.Similarly, I do not accept that the means by which the plaintiff came to know about the defamatory words is relevant, nor am I persuaded that the statements and actions by ministers and government entities are decisive. After all, there was suggestion in the Article that the government, and specifically the plaintiff in his capacity as head of the government, had behaved improperly. There was thus good reason for the government to seek to refute allegations made against it. 79 I instead accept that the plaintiff here is indeed suing as an individual.  Even ifDerbyshirerepresents the law in Singapore, the present facts are quite different. Nothing inDerbyshirewould prevent an official such as the plaintiff from suing in his own name and in respect of his own injury. The language of the various judgments did not go so far. It is clear that the House of Lords was concerned with agencies or entities within the government, and differentiating such entities from private,ie, non-governmental, corporations. This can be seen at 547E–G: There are, however, features of a local authority which may be regarded as distinguishing it from other types of corporation, whether trading or nontrading. The most important of these features is that it is a governmental body. Further, it is a democratically elected body, the electoral process nowadays being conducted almost exclusively on party political lines. It is of the highest public importance that a democratically elected governmental body, or indeed any governmental body, should be open to uninhibited public criticism. The threat of civil action for defamation must inevitably have an inhibiting effect on freedom of speech. 80 It may be argued that a similar principle should apply to politicians:   That argument is, however, precluded by the Court of Appeal’s decision inTang Liang Hong v Lee Kuan Yewand another and other appeals[1997] 3 SLR(R) 576 from [116] to [119]. In particular, the Court observed that: Clearly these two cases [DerbyshireandCity of Chicago v Tribune Co(1923) 139NE 86] are distinguishable from the instant cases. In each of the two cases the party suing was a public authority and as a matter of policy the laws in those jurisdictions do not permit such an authority to bring an action for libel. In the cases before us, the plaintiffs are individuals suing as private citizens. None of them brought the actions in their official capacity. Even under English law, a prime minister of a minister in office may sue in their private capacity for damages in respect of defamatory matters published of them and depending on the circumstances may recover substantial damages. Mr Gray himself realises this crucial difference because, in the next breath, he says that Mr Tang “is not arguing that politicians should forfeit the right to protect their reputations by means of libel actions”. It was apparent in the present case that the plaintiff was suing in his own right. The suit is in his name and brings a claim for loss to his reputation. Crucially, nothing in the claim or arguments raised points to an attempt to vindicate anything other than the plaintiff’s own personal rights.",
        "Other collateral purposes": "81 The defendant asserts that the plaintiff’s bringing of this suit has a dominant improper purpose “because the [p]laintiff is trying to silence a critic, not trying to vindicate his reputation”.34Foot Note 34×DCS at [5].I do not see how the plaintiff’s actions can be construed as “not trying to vindicate his reputation”. Quite simply, the defendant has not shown that the proceedings were mounted to serve some other collateral purpose. 82 The motivations and objectives of litigants would generally be multifarious. Litigation may be intended to remedy a breach of some obligation, but may also be intended to obtain vengeance for some slight, to punish the other party, or to teach the other side a lesson of some sort. The mere possibility or even existence of such other motivation does not, without more, colour the proceedings as being abusive. As has rightly been observed, albeit in the context of shareholder disputes, “it is not the law that only a plaintiff who feels goodwill towards a defendant is entitled to sue”:Swansson v R A Pratt Properties Pty Ltd[2002] 42 ACSR 313 at [41]. I do not see how it can be contended that the plaintiff is not in fact trying to vindicate his reputation – he has sought an apology for the defamatory words, and is now seeking damages in defamation. It is well-established in the law of defamation that damages can vindicate a plaintiff’s reputation, and that they must in fact be of a sufficient quantum to have that effect:Broome v Cassell and Co Ltd[1972] AC 1027 at 1071B–E (“Cassell and Co Ltd”), as applied inTang Liang Hong v Lee Kuan Yew and another and other appeals[1997] 3 SLR(R) 576 at [128].",
        "The Appropriate Remedies": "83 The plaintiff sought two remedies: damages and an injunction.",
        "Damages": "84 An award of damages would follow from a finding that defamation has occurred: [62] above. Damages in the context of defamation may be broadly separated into general and aggravated damages. As observed inArul Chandranv Chew Chin Aik Victor[2001] 1 SLR(R) 86 (“Arul Chandran”) at [53], general damages serve three purposes: (a) First, they act as a consolation to the plaintiff for the distress the publication causes; (b) Second, they repair the harm to the plaintiff’s reputation; and (c) Third, they serve to vindicate the plaintiff’s reputation. 85 The plaintiff argues in favour of substantial damages, pointing to the existence of a number of factors which are material in determining the award to be made. InLim Eng Hock Peter v Lin Jian Wei and another and another appeal[2010] 4 SLR 357 (“Lim Eng Hock Peter”) at [7], the Court of Appeal highlighted the following factors as being relevant to determining the quantum of general damages: (a) The nature and gravity of the defamation; (b) The conduct, position and standing of the plaintiff and the defendant; (c) The mode and extent of publication; (d) The natural indignation of the Court at the injury caused to the plaintiff; (e) The conduct of the defendant from the time the defamatory statement is published to the very moment of the verdict; (f) The failure to apologise and retract the defamatory statement; and (g) The presence of malice. The plaintiff argues that every one of these factors is relevant on the instant facts in warranting a significant award of damages. The plaintiff also argues that another consideration relevant to the determination of the quantum of general damages is its intended deterrent effect:The Gleaner Co Ltd v Abrahams[2004] 1 AC 628 at [53], as approved at [8] ofLim Eng Hock Peter. 86 The defendant argues on the other hand that only nominal damages should be awarded. The libel was not serious, less believable because it was on social media, and did not originate from the defendant. Rather, it was only shared by him. Moreover, mitigation occurred, which reduced any effect of the defamatory words. It was also contended that there was very limited evidence of publication of the Post and none of the Article. Even if there was any such evidence, the defendant argued that the publication level was very low. It was further said that no malice was made out, nor was it properly pleaded. In addition, while the defendant did not apologise, he removed the post upon receiving the IMDA notice, had not repeated the libels, and had not defended the statements made as true. 87 While different cases were cited by the parties as authority, the specific factors going towards quantum were not in dispute. Given my findings above that the Post and Article were each published, and that the latter could in fact be seen as part of the former (see above at [42]), the consequences of such publication will be taken together. The plaintiff’s reputation 88 In the present case, a particularly significant factor in determining the precise quantum of damages is the effect of the defamatory words on the reputation of the plaintiff, a politician. As argued by the plaintiff, Singapore courts have drawn a distinction between public and private figures, with public figures typically awarded substantial damages if the defamation relates to their honesty, integrity or character. The following extract fromLim Eng Hock Peteris illustrative on this point: 12 Singapore courts have consistently awarded higher damages to public leaders than other personalities for similar types of defamation because of the greater damage done not only to them personally, but also to the reputation of the institution of which they are members  … Public leaders are generally entitled to higher damages also because of their standing in Singapore society and devotion to public service. Any libel or slander of their character with respect to their public service damages not only their personal reputation, but also the reputation of Singapore as a State whose leaders have acquired a worldwide reputation for honesty and integrity in office and dedication to service of the people. In this connection, it is pertinent that it has been said that the most serious acts of defamation are those that touch on the “core attributes of the plaintiff’s personality”,ie, matters such as “integrity, honour, courage, loyalty and achievement” (seeGatleyat p 267). 13 Defaming a political leader is a serious matter in Singapore because it damages the moral authority of such a person to lead the people and the country … Without a clean or credible reputation, their moral authority to lead the people is compromised. 89 InSeow Khee Leng, the High Court observed at [25] that: Allegations of corrupt and criminal conduct are very grave charges, especially if they are made against the Prime Minister of a country. Such charges unless challenged head on would destroy the plaintiff … as moral authority is the cornerstone of effective government. If this moral authority is eroded, the government cannot function. Defamation committed against the Prime Minister and political leaders would, given its serious nature, would have to attract damages that suffice to vindicate the Prime Minister’s reputation:Lee Hsien Loong v Singapore Democratic Party and others and another suit[2009] 1 SLR(R) 642 at [103]. The standing of the defendant 90 The plaintiff also points to the standing of the defendant, which, it is argued, goes to the impact of the defamation and the injury caused. InLee KuanYew v Jeyaretnam Joshua Benjamin[1979–1980] SLR(R) 24 at [70], F A Chua J observed that: … The standing of the plaintiff is such as to mean that the injury done to him was grave. It was spoken by the principal opposition speaker and a prominent person whose words would carry more weight than that of a lesser individual and his hearers would be inclined to believe that there must be something in the accusation he was making … I note for completeness that F A Chua J’s decision was upheld on appeal, both before the Court of Appeal and the Privy Council. 91 While the defendant describes himself as a staunch government critic, I am not persuaded that his standing went so far as argued by the plaintiff’s counsel. Unlike Mr Joshua Benjamin Jeyaretnam, the defendant was not the “principal opposition speaker”, nor is he a Member of Parliament. He holds no public office. InVinocur John, the defendants were the executive editor of the International Herald Tribune, the editor of the Far Eastern Economic Review, and the Chief Executive and publisher of the International Herald Tribune. The International Herald Tribune is a reputable and influential daily newspaper with a wide circulation both internationally and in Singapore. It could not, to my mind, be said that the instant defendant had a comparable level of standing or prominence to the individuals I have mentioned. While he has been involved in politics, there is a qualitative difference between him and the other individuals I have identified here. Reach of the publication 92 In determining the reach of the publication, the relevant evidence includes many of the matters which have been considered in determining if there has been publication and/or republication. The defendant has 5,000 friends and 149 followers on Facebook. These numbers do not seem to point to an exceptionally substantial following, at least in comparison to others on social media, and other types of social media such as YouTube, Twitter, Instagram, or Tiktok. Though not adduced before me, I think I can take judicial notice that follower numbers for various Singaporean personalities can number in the tens of thousands, if not more. 93 Be that as it may, the plaintiff argued that there would have been a wide reach for the defamatory material through the internet. However, there was no direct evidence, whether in the form of view counters or metadata printouts, that the Post and linked Article had a large circulation. Indeed, there was no evidence that the post went viral,ie, accumulating several tens if not hundreds of thousands of reactions, likes, and/or shares. What the plaintiff depended on to establish the reach of the publication was the likelihood or probability of broad circulation, based at least in part on (a) the number of followers and friends of the defendant’s Facebook account, and (b) the number of persons who had expressed their support or reaction to the Post. This turned in large part on the expert provided by the plaintiff’s expert, Dr Phan. 94 Dr Phan’s evidence was that the reach of the Post could be exponential because of the amplification of posts, especially of false news.35Foot Note 35×Bundle of AEICs (“BA”) Vol 2 at 400 and 401.However, Dr Phan was unable to specify exactly how much publication would have occurred on the instant facts through reposting and shares. On the instant facts, there had been five comments, 18 shares, and 22 reactions. The defendant, as previously noted, had 5,000 friends and 149 followers on his Facebook account. In my view, even if there was some spread in proportion to these approximately 5,000 friends and followers, and there was downstream spread from them, even taking in account the public privacy setting of the Post and the accelerated rate at which fake news was said to spread, I still could not find that the evidence showed that there such widespread distribution that would have approached anything like figures of tens of thousands. 95 Dr Phan also referred to a study showing that false political news would reach 20,000 persons three times faster than the time it took for other false news to reach 10,000 persons.36Foot Note 36×2 BA 402 at [32].In addition, the plaintiff’s counsel pointed out that this study had been cited by the Select Committee on Deliberate Online Falsehoods in its Report dated 19 September 2018, and by Singapore’s Minister for Education in the Parliamentary Debates on the POFMA.37Foot Note 37×2 BA 403 at [33].Be that as it may, I was not convinced that this study was of direct help on the instant facts. It does not prove anything in the case before me. Aside from that, this figure of 20,000 was only referred to in estimating or showing the speed with which fake political news could spread, especially relative to other forms of fake news. It could not be inferred, even on aprima faciestandard, that this figure of 20,000 and/or the rate of spreading was the reach of the Post and Article here. Thus, while I am prepared to accept the proposition that fake political news may spread faster than other forms of fake news, I did not see how this assisted my determination on the reach of the present publications. 96 The plaintiff argues, relying on Dr Phan’s evidence, that the total number of persons based in Singapore who accessed the Post is likely to be large and in the thousands.38Foot Note 38×PCS at [148(b)].I am not certain that Dr Phan’s evidence bears this out. The core thrust of Dr Phan’s reasoning in explaining why the number of views would be several times higher than the number of reactions, likes, comments, and/or shares of the Post is what is described as the “cascade effect”.39Foot Note 39×2 BA 401 at [27].Dr Phan, relying on a number of academic articles, explains the cascade effect as being that the reach of a Facebook post can extend exponentially as it is “reacted” to, commented on, or shared.40Foot Note 40×2 BA 401 at [27] and [28].Dr Phan pointed me to articles by Watts (2002),41Foot Note 41×Watts, Duncan. 2002 “A Simple Model of Global Cascades on random Networks”Proceedings from the National Academy of Sciences99: 5766–71. (Annex F to AEIC of Tuan Quang Phan).and Watts and Dodds (2007)42Foot Note 42×Watts, Duncan J., and Peter Sheridan Dodds. 2007. “Influentials, Networks, and Public Opinion Formation”Journal of Consumer Research34 (December): 441–58. (Annex G to AEIC of Tuan Quang Phan).to show that there may be exponential growth and cascades in the reach of posts made on social media networks. Papers by Vosoughi, Roy, and Aral (2018)43Foot Note 43×Vosoughi, Soroush, Deb Roy, and Sinan Aral. 2018. “The Spread of True and False News Online”Science359 (6380): 1146–51. (Annex H to AEIC of Tuan Quang Phan).and Bakshyet al(2012)44Foot Note 44×Bakshy, Eytan, Itamar Rosenn, Cameron Marlow, and Lada Adamic. 2012. “The Role of Social Networks in Information Diffusion”In Proceedings of the ACM Conference on the World Wide Web. Lyon, France. (Annex I to AEIC of Tuan Quang Phan).were said to show that the reach stemming from an initial post or “seed” could be extensive. 97 In terms of specifics, I sought to understand from Dr Phan the actual numbers which he estimated would have viewed the Post. Dr Phan gave evidence that, applying what in his view was a very conservative estimate of (a) a minimum of 22 users initially accessing the Post and reacting to/commenting on/sharing the Post, and (b) each of those 22 users having an average of 300 friends on Facebook, the Post would have appeared on the Facebook “news feeds” of up to 6,600 users.45Foot Note 45×2 BA 407 at [46] and [47].This was predicated on the assumption that the 6,600 users had logged in to Facebook during the time the Post was available on the defendant’s Facebook timeline. Dr Phan suggested that the actual number might be considerably higher than 6,600 users given the possibility that those 6,600 users may have themselves shared the Post. 98 I note, however, that there is a distinction to be drawn between individuals on whose Facebook news feeds the Post might have appeared, and individuals who actually were online at the relevant times and accessed the Post. After all, Facebook news feeds continue to update based on the actions of one’s Facebook friends, and the mere fact of a post potentially appearing at some point on one’s news feed cannot be taken, without more, to mean that the post was accessed by that particular user. Moreover, there is no suggestion that the 6,600 users referred to above were all from Singapore. 99 In relation to my latter concern, Dr Phan’s view was that the minimum number that would have accessed or downloaded the Post would have been 200 to 400, on the basis that 10 to 20% of the defendant’s 2,060 friends and followers and followers based in Singapore had done so.46Foot Note 46×2 BA 408 and 409.When queried further on this figure, Dr Phan indicated that these 10 and 20% estimates were “well below one standard deviation, almost two standard deviations below [that] which is published in the academic community”, and that these figures were “really a very conservative, a very lower bound”.47Foot Note 47×Transcript of 7 October 2020, Page 82, Line 21 to Page 83, Line 7. 100 The plaintiff argues that since 95% of all sample sizes fall within two standard deviations, there was a 95% probability that the number of individuals in Singapore for whom the Post would have been accessible would have been at or higher than Dr Phan’s estimates.48Foot Note 48×PCS at [161].The source the plaintiff relies on for this 95% probability is from the websiteInvestopedia.49Foot Note 49×Footnote No. 207 in PCS.I am, however, not persuaded that the conclusion the plaintiff invites me to draw is borne out on the evidence. On the plaintiff’s case, assuming a normal distribution of data, 95% of the data value will fall within the two standard deviations of the mean value. However, Dr Phan did not testify that the 10% and 20% figures he relied on, of about 200 to 400, were at the tail of a normal distribution. 101 Additionally, Dr Phan’s evidence only went so far as stating that the estimate he had reached was one or two standard deviations below what would be estimated in the academic community, presumably by reference to the typical reach of a published post or article. However, the role of this Court is not to consider what might be the case in abstract – it still had to be established what the actual reach of the Post was here. 102 Fundamentally, the estimate cited to me of over 2,000 individuals the Post had been published to in Singapore seemed somewhat speculative. Dr Phan testified that the posts would have appeared on newsfeeds of 6,600 users, but this referred to Facebook users generally, not users who were specifically in Singapore. Though the plaintiff points out that no contrary narrative had been put forward by the defence, the figures the plaintiff sought to rely on nonetheless remained speculative. In any event, even if the spread of the Post was to thousands, it is not clear that it would be in the region of tens of thousands or more. 103 Given what Dr Phan had actually testified, and in the absence of any support for any higher figure actually occurring on the facts, I could not accept the plaintiff’s account. I was mindful in this regard that, framed as it was in fairly general terms and in reliance on academic studies gauging overseas contexts, the plaintiff’s case could have been applied to a whole swathe of situations such that a broad reach for a post could be asserted for a huge number of posts. To my mind, context remains key. The Court has to be satisfied that the evidence goes beyond merely showing that a generic post (or even one spreading false political claims) could potentially spread widely, and instead that, on the facts of the case, there is enough context to ground the inference it is invited to draw. On the instant facts, and in relation to this specific Post and Article, I am not satisfied that there is enough basis for me to draw the inferences the plaintiff advocates. This is not to say that publication can only be established by direct evidence. Rather, the platform of facts upon which the precise extent of publication is made out must be a robust one, and must relate to the specific context in which publication took place, rather than merely on academic extrapolation. 104 I also note that the findings in SUM 428 do not show that the plaintiff’s assertions on the extent of the publication should, without more, be accepted. Those determinations had been made in the context of a striking-out application. The fact that the defendant eventually chose to submit that there was no case to answer in the substantive trial did not mean that the Court should conclude, without more, that there had been publication to the extent which the plaintiff asserted. Rather, the evidence, including that elicited through cross-examination, needs to be considered holistically. 105 In the circumstances, therefore, I find that the extent of the publication of the Post (which I refer to in this context as incorporating the Article: see above at [42]), would have been at most about 400 persons to whom the defamatory words had been published. I emphasise that this figure refers specifically to (a) users who were based in Singapore, (b) users to whom the defamatory words had been published, meaning that they must have received the information in such a way that it was understood (Qingdao Bohaiat [35]), and (c) users who received the information through, whether directly or indirectly, the defendant’s acts. 106 How this figure of 400 is reached is as follows: At the very least, there were 22 reactions, 5 comments, and 18 shares. The Post thus must have been published to at least these 45 individuals, though it is unclear if all of them were in Singapore, and it is further unclear whether the same person(s) may have likedandshared the same post. Accounting for the defendant’s friends and followers on Facebook, there were at least about 5,000 such Facebook users, though again it is unclear (a) whether all of the accounts in that figure are based out of Singapore, and (b) whether they would all have seen the Post on their Facebook Newsfeeds in an intelligible form. The plaintiff indicates that about 2,060 of the defendant’s 5,000 Facebook friends and followers are based in Singapore, and Dr Phan estimates that 10 to 20% of this figure would have accessed the Post in an intelligible form. These figures of 10 to 20% are 200 to 400 users, and the figure of 400 is reached accordingly. Impartiality 107 While the defendant took issue with Dr Phan’s expertise and impartiality, I do not find that there was any lack of impartiality as had been argued by the defendant. The thrust of the defendant’s submissions in this regard related to Dr Phan’s grant from the government for research funding, and the fact that his AEIC shadowed that of the plaintiff. 108 I do not find that the grant affected the credibility of any part of Dr Phan’s report or his testimony. Grants, particularly, government-related grants, are the lifeblood of academic research, and it is to be expected that many academic experts would have received a grant in one form or another. For an expert’s credibility to be impugned, there has to be some evidence put forward that the grant has somehow created a real and substantial risk of the expert opinion being subverted, breaching the obligation owed by the expert to the Court. There was no such evidence here. 109 As for the shadowing of the words of the plaintiff’s affidavit, deponents should generally depose using their own words, but some editing is to be expected. While there was some unfortunate similarity in language used between Dr Phan and the plaintiff’s affidavits, I do not find that the shadowing of the plaintiff’s words here went towards the substance of what Dr Phan had given evidence on. There was no indication that the words used conveyed anything other than what Dr Phan intended, and, in any event, the crux of Dr Phan’s evidence on the cascade effect and his estimates of the Post’s reach in this case were his own. I thus did not accept the defendant’s attempts to impugn Dr Phan’s credibility in this regard. The defendant’s conduct 110 The plaintiff sought to argue by reference to the defendant’s conduct that the defendant had aggravated the libels. In particular, he pointed to three broad categories of such acts:50Foot Note 50×PCS from [97]et seq. (a) First, the plaintiff asserted that the defendant repeatedly took steps to draw attention to the instant Suit and/or to the libels that are the subject of the Suit, which had the effect of keeping the libels fresh in the minds of the people in Singapore. Specifically, the plaintiff points to the following non-exhaustive examples: (i) several posts by the defendant on his Facebook page attaching,inter alia, segments of the pleadings in this Suit and the plaintiff’s letter of demand, (ii) a video interview dated 6 January 2019 given by the defendant to Amnesty International Hong Kong claiming that he was the “first person in history to be sued for just sharing information on Facebook” and that this was “really not justified”, and (iii) a paid advertisement on Facebook publicising a post on the defendant’s Facebook page containing a link to an article on The Online Citizen’s website titled “Leong Sze Hian counter-sues Prime Minister…” The alleged upshot of these examples was that the defendant had used the suit to wage a public campaign to gain sympathy and support, and had “cynically drawn attention to the Post and the Article to keep them fresh in the minds of people in Singapore”. (b) Second, the plaintiff alleges that the defendant continued to make false claims that the suit had been commenced for reasons other than to vindicate the plaintiff’s reputation. This was said to have included the defendant’s counsel’s conduct when conducting his cross-examination of the plaintiff. (c) Third, the plaintiff highlighted that the defendant had failed to make any sufficient apology or withdrawal of the defamatory words. The plaintiff relied onArul Chandranat [55] andKoh Sin Chong Freddieat [51] as authority for the proposition that the above acts would aggravate the injury inflicted by the defendant. 111 I note the observations of Lee Seiu Kin J inLee Hsien Loong v Ngerng Yi Ling Roy[2016] 1 SLR 1321 (“Roy Ngerng”) from [84] to [86] in relation to the nexus the defendant’s subsequent conduct must have to the original defamatory statement. Lee J recognised the appeal of the position in England as set out inCollins Stewart Ltd v The Financial Times Ltd[2006] EMLR 5 at [24] to [27], that the subsequent conduct must have aggravated the injury arising from the defamation for which the defendant has been sued in order for it to constitute an aggravating factor. However, Lee J concluded that this position was inconsistent with the approach taken by F A Chua J inLee Kuan Yew v Jeyaretnam Joshua Benjamin[1979–1980] SLR(R) 24 that casting aspersions over a plaintiff’s motives in the defamation action would in and of itself constitute an aggravating factor. As Chua J’s decision was upheld on this point on appeal inJeyaretnam Joshua Benjamin v Lee Kuan Yew[1979–1980] SLR(R) 255 at [17], Lee J found himself “constrained” to find, on the authority of the Court of Appeal’s decision, that the defendant’s acts were aggravating. 112 I have considerable sympathy for Lee J’s view. It would be difficult for the Court to form a view as to the defendant’s subsequent conduct, if actionable in itself, without a proper consideration of all relevant matters, including any defences that might be available to the defendant for that conduct. I also agree with Lee J that allowing the subsequent conduct to be considered in aggravation could essentially be a backdoor admission for an unproven tort in the assessment of damages. However, insofar as the Court of Appeal’s decision inJeyaretnam Joshua Benjamin v Lee Kuan Yew[1979–1980] SLR(R) 255 is binding on me and makes clear at [17] that subsequent conduct, particularly relating to the impugning of the plaintiff’s motives, can be a basis for aggravated damages, I accept the plaintiff’s submission on this point. 113 Turning to the plaintiff’s arguments arising out of the defendant’s conduct at trial, I was unpersuaded that the defendant’s conduct of the trial went so far as to warrant aggravated damages on this front. While propositions were robustly put to the plaintiff, and there was suggestion that there had been an abuse of process, I did not see these as being, without more, aggravating. The suggestions the defendant’s counsel invited the plaintiff to consider were not wholly contumelious, nor did they cause further harm to the plaintiff:Roy Ngerngat [91]. The defendant’s counsel’s lines of questioning on why the plaintiff had singled the defendant out from others who had shared the Article to sue was reasonable, and cohered with the allegation by the defence that there had been an abuse of process. I was not persuaded that this line of questioning was wholly irrelevant, and even if it was, I was not convinced that the defendant had pursued it in such a manner as to warrant aggravated damages on this front. 114 As for the plaintiff’s argument that the absence of any apology or refraining from publication is aggravating, I am prepared to place some limited weight on this. I accept, on the authority ofMaidstone Pte Ltd v Takenaka Corp[1992] 1 SLR(R) 752 at [51] and [60] andL K Ang Construction Pte Ltd v Chubb Singapore Pte Ltd[2003] 1 SLR(R) 635 at [24], that the failure or refusal to apologiseper seis not evidence of express malice amounting to an aggravating factor. Rather, the Court has to look at the reasons for this failure or refusal. On the instant facts, I accept that the defendant has failed to apologise, and that his removal of the defamatory material may have been animated in large part by the IMDA notice. I also accept that the defendant must have learned, at least over the disposal of SUM 428 and the substantive trial, that the content of the Article was false. No defence of justification was raised, and the defendant gave no evidence to the contrary to suggest that his refusal to apologise was animated by any other reason. The defendant might seek to argue that he had declined to apologise because he did not believe that the Post or Article was false or defamatory, but that appears very difficult to square with the fact that the Article made overt and grave allegations about the plaintiff, the truth of which the defendant did not seek to defend. Even a clarificatory message on the part of the defendant does not appear to have been contemplated. Accordingly, I accept that the defendant must have learned of the falsity of the defamatory words at some point over the course of proceedings, and that his continued refusal to apologise even thereafter can be a basis for granting aggravated damages. There is clear authority that aggravated damages may be awarded where the defendant refuses to apologise even after knowing of the falsity of the defamatory words:Lee Hsien Loong v Singapore Democratic Party and others and another suit[2009] 1 SLR(R) 642 at [120], [122]cf[215],Cheah Cheng Hoc & Ors v Liew Yew Tiam & Ors[2000] 6 MLJ 204 at 226I, andDoris Chiaat [20.45]. 115 My analysis in the preceding paragraph, however, does not render irrelevant the fact that the defamatory Post has been removed from the defendant’s Facebook page, nor does it detract from the fact that the offending Post was only available on the said Facebook page for a relatively short period of time. Given all the circumstances, I am prepared to recognise that there was at least some aggravation arising from the defendant’s conduct, though perhaps not nearly as much as the plaintiff sought to persuade me of. 116 In sum, while I accept that there has been aggravation on the instant facts, I do not consider that the allegedly aggravating conduct went so far as to attract a markedly increased award of damages. In particular, the defendant’s supposed drawing of attention to the statement had been done in the midst of explaining his position, and I am satisfied that the quantum of aggravated damages on these facts should be calibrated to reflect that. Malice 117 The Plaintiff argues that malice is made out on the facts. As the Court inLee Kuan Yew v Davies Derek Gwyn and others[1989] 2 SLR(R) 544 at [112] observed, malice in defamation refers to any “ill-will, spite, or some wrong or improper motive”. It is also generally accepted that malice may be inferred if it is abundantly plain that the defamatory statement is untrue:Mangena vEdward Lloyd Ltd(1908) LT 640 at 643. As is made clear in Richard Parkes QCet al,Gatley on Libel and Slander(Sweet & Maxwell, 12th Ed, 2017) at [32.45], malice may be inferred from the defendant’s conduct at any time, whether before or after the publication, his actions during the course of litigation, and his demeanour and attitude at trial. In this regard, the plaintiff points to three categories of behaviour it alleges make out malice on the instant facts: (a) First, the defendant’s conduct in publishing the defamatory words while knowing them to be untrue or recklessly not caring whether they are true or not; (b) Second, the defendant’s alleged conduct in using the suit to wage a public campaign to gain sympathy and support; and (c) Third, the defendant’s failure to make any sufficient apology or withdrawal of the defamatory words. As is readily apparent, items (b) and (c) are simply restatements of arguments the plaintiff had relied on in relation to the question of whether the defendant’s conduct was aggravating. Accordingly, I will focus on item (a) instead. Before that, however, I consider two preliminary objections by the defendant to allegations of malice. 118 First, the defendant alleged that malice had not been properly pleaded. I am unable to agree. I note that the Statement of Claim averred various matters, including statements from politicians, government agencies, and press reports which all stated categorically that the content in the Article was false, and that action was being taken: Statement of Claim from [3(l)] to [3(n)]. These averments were also the foundation of the claim for aggravated damages. Given the plain wording of these averments, which went towards suggesting that the defendant was aware of the false nature of the defamatory words from an early stage, no further pleading was required. 119 Second, the defendant appears to suggest, by referring to conduct that is “tantamount to dishonesty” in his submissions,51Foot Note 51×DCS at [126].that dishonesty is required in order to establish malice in the context of defamation. If this is the defendant’s suggestion, it is incorrect given the clear authority ofGoh ChokTong v Jeyaretnam Joshua Benjamin and another[1998] 2 SLR(R) 971 at [53]. 120 In relation to the plaintiff’s claim that the defendant had published the defamatory words while knowing them to be untrue or recklessly not caring whether they are true or not, I accept that there is at least aprima faciecase established that the defendant knew that the defamatory words were untrue. While the Article had referred to a quote from Ms Clare Rewcastle Brown, whom the defendant believed to be a respected investigative journalist who had played a role in uncovering the 1MDB scandal, that did notipso factoabsolve the defendant from verifying the veracity or otherwise of the Article before linking to it in his Post. It was, at the very least, reckless disregard of whether the Article was true or not for the defendant to have posted it without making any enquiries as to its truth whatsoever. In this regard, I was unassisted by the lack of any direct evidence from the defendant as to his state of mind, and am satisfied on the basis of the facts before me that his recklessness as to the truth of the Article may be inferred. 121 In any event, I am also satisfied that, when seen cumulatively with his refusal to apologise for the defamatory words, malice may be made out on the facts. However, a further significant question is the extent of the malice – any uplift to the damages on the facts will be tempered by the fact that the malice in this case, unlike in several of the other cases cited to me, did not involve a defendant wilfully posting something he knew to be false at the time of posting, nor did it involve a defendant who defiantly insisted on the truth of his libellous claims to the bitter end despite clear evidence to the contrary. Other factors 122 The plaintiff also argued that the Court should take into account the “natural indignation of the court” in determining the appropriate quantum of damages. Cases such asLim Eng Hock Peterv Lin Jian Weiand another and another appeal[2010] 4 SLR 357 at [7] andLee Kuan Yewand another v Tang Liang Hong and othersand other actions[1997] 2 SLR(R) 81 at [86] were cited in support of this proposition. Looking at the cases cited to me, I remain unsure what this factor adds, if anything, to the factors already discussed above. Given potential concerns of double-counting, I declined to place significant weight on this consideration. Quantum 123 The plaintiff argued for an award of damages in line with that made inRoy Ngerng. InRoy Ngerng, a total of S$150,000 was awarded, covering S$100,000 in general damages and S$50,000 in aggravated damages. 124 While it is trite that each case must be decided on its own facts, I accept that reference may be had to other cases involving similar circumstances in determining the broad range of damages payable within which the instant case falls. The plaintiff pointed me to a range of cases, but I am of the view that most of them were not directly applicable insofar as they (a) involved defendants who were of high public prominence as leaders of the opposition, or editors of major newspapers with worldwide distribution, and/or (b) involved far greater degrees of malice or contemptuous behaviour, even towards the Courts. 125Roy Ngerngwas indeed the most appropriate comparator to the instant factual matrix. Comparing the facts ofRoy Ngerngto those of the present case, it is immediately apparent that the number of views the defamatory material inRoy Ngerngreceived was far larger. The Judge inRoy Ngerngfound that some 95,443 may have seen the home page of the defendant’s website, which contained the defamatory words. After some calculating and giving the benefit of the doubt to the defendant in that case, the Court inRoy Ngerngfound that there would have been at least 37,223 distinct individuals who saw the article. I took the view that the standing of the instant defendant and that of Mr Ngerng was roughly comparable – both were socio-political commentators who did not hold any formal positions of public office, and both had some modicum of following on their websites and online pages. In addition, the Judge inRoy Ngerngappears to have adopted the view that there was significant malice and aggravation in that case, which I have not found, at least to the same extent, on the present facts. 126 While the allegation inRoy Ngerngwas described by the Judge in that case as one of the “gravest” (at [29]), the defamatory statement here was in fact worse: that the plaintiff was involved in a cross-border defalcation of the funds belonging to the citizens of another country, in cooperation with the leader of that country. For that reason, I would find that despite the lower reach, an award of S$100,000 in general damages was warranted. However, as for the quantum of aggravated damages, there was a more limited basis to award such damages on the instant facts, and it would thus suffice to award roughly a third of the general damages, or about S$33,000, for a total quantum of S$133,000.",
        "Injunction": "127 Turning to the second relief sought, I am doubtful that what has been shown in this case would justify the grant of an injunction. The greater threat of continued publication would arguably be from the originators of the article rather than this defendant, who had swiftly complied with the IMDA notice once it had been issued. While the defendant has not apologised, he also has not demonstrated any risk of resuming the publication of the defamatory material. Should he do so, he would, of course, run the risk of further claims being made, with potential attendant consequences in costs and damages.",
        "Miscellaneous": "128 At various points, the plaintiff referred to my earlier decision in these proceedings, in which I declined to strike out the Plaintiff’s claim in SUM 428. My findings in that decision were, of course, subject to the appropriate standard at that stage, namely, that there was a triable issue which warranted the matter proceeding to trial. Those findings did not control my determination at the close of proceedings, even with a submission of no case to answer being made. 129 The point of the determination in SUM 428 was to determine if there was enough before the court to warrant a trial; a finding that theprima faciestandard was met on the material before the Court at the interlocutory stage did not necessarily indicate that aprima faciestandard had been met at trial to warrant a finding for the plaintiff. One clear difference is that following the submission of there being no case to answer, the plaintiff’s evidence would have been tested in the cross-examination; it is entirely possible that sufficient doubt about the evidence may be raised through such questioning that aprima faciecase is not made out. I would thus generally caution parties against seeking to blithely rely on determinations at an interlocutory stage as somehow wholly determinative of the outcome for the substantive proceeding.",
        "Conclusion": "130 Given the entirety of the evidence placed before me, the defendant is to pay the plaintiff the sum of S$133,000. 131 I will deal with the matter of costs separately. Aedit AbdullahJudge of the High Court Davinder Singh s/o Amar Singh SC, Lin Xianyang Timothy, Fong Cheng Yee, David, Darveenia Rajula Rajah, and Shannon Valencia Peh (Davinder Singh Chambers LLC) for the plaintiff;Lim Tean (Carson Law Chambers) for the defendant."
    }
}