{
    "case_title": "Exim & Mfr Holdings Pte Ltd vTan Yee Ling Ivy and others(Ng Sin Kwee, third party)",
    "ncitation": "[2021] SGHC 263",
    "coram": "Andre Maniam J",
    "sections": {
        "Introduction": "1 After the court orders an account to be taken, when should the court also make an order for payment?",
        "Background": "2 The first defendant (“Ivy”) was the Human Resource and Finance Manager of the plaintiff (“Exim”) from 4 February 2016 to 27 April 2017. She was in charge of Exim’s Finance Department, and her responsibilities included preparing cheques for payment of dividends to Exim’s two shareholders, Mr Ng Sin Kwee (“Mr Ng”) and his wife, Mdm Lee Suan Ho (“Mdm Lee”). 3 For four of the dividend cheques, the proceedstotalling$631,285.62went to Ivy instead, directly or indirectly (including being spent by her, or for her benefit). 4 Instead of making out those cheques to Mr Ng and Mdm Lee, Ivy made out those cheques to third-party payees: (a) $67,601.60 to Royal Aroma Beauty & Holistic Pte Ltd (“RABH”), a company which Ivy’s friend Fiona (the fourth defendant) was a 25% shareholder of (instead of to Mdm Lee); (b)$203,684.02 toGary (the fifth defendant), another friend of Ivy’s (instead of to Mr Ng); (c)$98,999.55 toIvy herself (instead of to Mdm Lee); and (d)$261,000.45 toWedding Day (the third defendant) a company which Ivy and her husband Kau (the second defendant) were the founders and directors of, which Ivy eventually became sole shareholder of (instead of to Mr Ng). 5 The $67,601.60 cheque to RABH, dated 8 April 2016, was deposited by Ivy into RABH’s account on 11 April 2016. Ivy received the amount back in two tranches: $50,000 on 13 April 2016 and $17,601.60 on 15 April 2016. 6 The $203,684.02 cheque to Gary, also dated 8 April 2016, was deposited by Ivy into Gary’s account on 16 May 2016. Gary retained $53,750.02 (Ivy said, this was in repayment of a debt of $53,750 which she owed him). Gary paid Ivy the balance of $149,934 in two tranches: $60,000 on 19 May 2016 and $89,934 on 26 May 2016. 7 The $98,999.55 cheque to Ivy herself, dated 7 February 2017, was deposited by Ivy into her account on 8 February 2017. 8 The $261,000.45 cheque to Wedding Day, also dated 7 February 2017, was deposited by Ivy into Wedding Day’s account on 27 April 2017 (Ivy’s last day of work at Exim). The account was then in overdraft of $35, which was deducted from the cheque proceeds; a sum of $60,965.45 was withdrawn on 29 April 2017; overdraft interest of $30 was then deducted leaving a balance of $199,970, all of which was transferred or spent.1Foot Note 1×Ivy’s Affidavit of Evidence-in-Chief (“AEIC”), paras 30–34, pages 71–72; Ivy’s supplementary AEIC.",
        "Procedural history": "9 Exim sued Ivy and the other defendants in March 2020. 10 Wedding Day did not file a defence, and Exim entered default judgment against it in May 2020. 11 Kau, Fiona, and Gary defended the action, and also claimed a contribution and/or indemnity from Ivy. 12 Ivy defended the action; she also brought Mr Ng in as a third party, contending that he should be the party liable to Exim, alternatively that she was entitled to a contribution and/or indemnity from him. 13 On Exim’s application in HC/SUM 4838/2020, Ivy was ordered to furnish an account of the sums of money in respect of the four cheques. The taking of accounts proceeded by way of a five-day trial, and written submissions thereafter; Exim’s witnesses and Ivy filed Affidavits of Evidence-in-Chief (“AEIC”), and were cross-examined. 14 Ivy acknowledged that the cheque proceedstotalling$631,285.62had gone to her. But she contended that the court should not, at this juncture, order her to repay that sum to Exim, for two principal reasons: (a) Mr Ng had allegedly given her secret instructions to make out the cheques as she did (the “Secret Instructions”), which instructions were attributable to Exim; and (b) she had allegedly paid Mr Ng the$631,285.62(or thereabouts) from her own cash (the “Cash Payments”).",
        "The issue": "15 The issue was thus whether any order for payment should be made at this stage, or if that should await a full trial of all of the claims in this suit. 16 Order 43 r 1 of the Rules of Court (“2014 Rev Ed”) (“Rules of Court”), on accounts and inquiries, provides that the court may grant a summary order for an account to be taken (which, in this case, has already been ordered), and “… unless satisfied by the defendant by affidavit or otherwise that there is some preliminary question to be tried … [the court] may also order that any amount certified on taking the account to be due to either party be paid to him within a time specified in the order.” 17 Is there then some preliminary question to be tried such that an order for payment should not be made at this stage? 18 To answer that, I first consider Ivy’s allegations regarding the Secret Instructions and Cash Payments, and then the subsidiary points raised by her.",
        "The Secret Instructions": "",
        "No documentary evidence and inconsistent with contemporaneous documents": "19 There is no documentary evidence of the Secret Instructions – Ivy contends that this shows how secret those instructions were; Exim says there is no such evidence because there were no such instructions. 20 Ivy alleges that Mr Ng had told her that he did not want his wife, Mdm Lee, to know exactly how much Exim paid out in dividends – if the dividend cheques were in their names, the cheques would be deposited into their joint account, and Mdm Lee would come to know of the payments. Ivy says that, in response, she suggested that four (out of twenty) dividend cheques be paid to third parties, with Mr Ng receiving those sums in cash instead. She says Mr Ng agreed with this. 21 Ivy says that the Secret Instructions came about because she had prepared lump sum cheques for the full amount of the dividends in a financial year, one to Mr Ng and one to Mdm Lee; Mr Ng asked her to split that up into instalments, and it was then that they spoke about the Secret Instructions. This story is, however, contradicted by the contemporaneous documents: Exim produced the cheque stubs for the chequebooks from which the dividend cheques were drawn, and they do not reflect the alleged lump sum cheques which Ivy said were prepared, and then voided.2Foot Note 2×See exhibits P1 to P5: the cheque stubs from the period of 3 February 2016 to 26 May 2017, which cover the whole period of Ivy’s employment with Exim.I do not accept Ivy’s bare assertion that there may have been some other chequebook.",
        "The Secret Instructions would not have achieved their purpose": "22 The Secret Instructions make no sense: they would not have served to conceal from Mdm Lee the amount of dividends paid out by Exim. Mdm Lee was not only a shareholder, she was also a director: as such, she would know, or at least be entitled to find out, what was declared and paid out as dividends. This was moreover duly reflected in Exim’s audited financial statements, which were referred to, and accompanied by, directors’ statements signed by Mr Ng and Mdm Lee. 23 If, as Ivy claims, Mr Ng did not want all of the dividend payments to be paid into his joint account with Mdm Lee, the four cheques could simply have been issued to Mr Ng for him to deposit in a bank account in his sole name: he could have opened such an account, deposited the cheques, withdrawn the proceeds in cash, and closed the account – all without the risk of using Ivy or other third-party intermediaries. Of course, this would still be wrong in respect of the two cheques intended for Mdm Lee – it would still be misappropriation of payments meant for her, with attendant falsification of Exim’s records to make it appear that she was the payee of those cheques (see [69]–[76] below).",
        "The Secret Instructions are unlikely in the circumstances": "24 The first two of the four cheques were dated 8 April 2016 – Ivy had just joined Exim on 4 February 2016 and she was still on probation. It is unlikely that Mr Ng would trust a new employee like Ivy with the proceeds of the first two cheques, totalling $271,285.62 (a multiple of Ivy’s income from Exim – her salary was $5,000 a month). It is even more unlikely that Mr Ng would get into such a scheme with a new employee, to defraud Exim and his wife Mdm Lee, and to steal a portion of the dividend payments meant for his wife (totalling $166,601.15). That would be criminal both on Mr Ng’s part, and Ivy’s. 25 Ivy knew full well that the Secret Instructions involved criminal conduct: she was a trained accountant who had been working in the finance industry for some ten years before joining Exim. She also had a previous conviction for criminal breach of trust (“CBT”) under s 406 of the Penal Code (Cap 224, 2008 Rev Ed) in 2012.3Foot Note 3×Plaintiff’s Bundle of Documents (“PBOD”), Tab 1, p 133.Exim quite properly did not put this forward as propensity evidence (that because Ivy had committed CBT in her previous employment, she was likely to have committed CBT again), and I do not regard it as such. Rather, given Ivy’s previous conviction, she would have been more cautious about getting involved in such a scheme – and Ivy agreed with this.4Foot Note 4×Transcript, 4 August 2021, p 112 ln 29 to p 113 ln 1.She also agreed that her carrying out of the Secret Instructions would cause financial harm to Mdm Lee.5Foot Note 5×Transcript, 4 August 2021, p 105 at ln 10–16 and p 103, ln 22–31. 26 Ivy’s description of Mr Ng as a very meticulous micro-manager6Foot Note 6×Ivy’s AEIC, para 15.is incongruent with his alleged agreement to use RABH, Gary, Ivy herself, and Wedding Day as the payees of the cheques, without checking on them. It turns out that both RABH and Wedding Day were in poor financial health, Gary was owed money by Ivy, and Ivy had other debts besides this – bank loans and credit card debts. A common thread is that all of the third-party payees would welcome the cheque proceeds that they received.",
        "Proof of the Secret Instructions rests on Ivy’s own evidence": "27 Ivy testified on her own behalf. She did not call as witnesses her fellow defendants Gary, Fiona, or her husband Kau; or anyone else. 28 Gary’s version of what transpired between him and Ivy, contradicted Ivy’s version. Gary says that Ivy told him that the cheque of $203,684.02 had mistakenly been deposited into his account: he says this not only in his pleadings,7Foot Note 7×Fifth defendant’s third-party Statement of Claim (“SOC”), para 9.but also on affidavit.8Foot Note 8×Gary’s Affidavit dated 7 July 2020, para 15.Ivy, on the other hand, claims that she had told Gary that she was doing a personal favour for her boss.9Foot Note 9×Second third party’s Defence to the fifth defendant’s SOC, para 7. 29 Fiona says in her pleadings that Ivy had represented that due to certain tax reasons, her boss needed help depositing a cheque through another bank account, and she agreed to the use of RABH’s account for that purpose.10Foot Note 10×Fourth defendant’s third party SOC, paras 6 and 7.Ivy admits this.11Foot Note 11×Second third party’s Defence to the fourth defendant’s SOC, para 5.If that is what transpired between Ivy and Fiona, Ivy would have falsely represented to Fiona that the cheque was being deposited in RABH’s account for “tax reasons”. 30 Ultimately, Ivy only has her own evidence to rely on, to prove the Secret Instructions.",
        "Were the Secret Instructions given, and were they attributable to Exim?": "31 On the evidence, including that of Ivy and Mr Ng, I do not believe that the Secret Instructions were ever given. My findings on the alleged Cash Payments (discussed in the next section) reinforce this conclusion. It follows that there is no preliminary question in this regard that remains to be determined before an order for payment can be made against Ivy. 32 In any event, even if Ivy had been able to prove the Secret Instructions, that would not be a defence to Exim’s claim for repayment of the cheque proceeds. Ivy asserts that the Secret Instructions were “lawful and reasonable orders” of Exim,12Foot Note 12×Ivy’s Defence (Amendment No 2), para 9.but they are obviously not. Mr Ng had no actual or apparent authority from Exim to give the alleged Secret Instructions: they involved defrauding Exim and its other shareholder (Mr Ng’s wife, Mdm Lee), and stealing a portion of the dividends meant for Mdm Lee. 33 On a related note, Ivy does not say that she stood to get anything from this scheme; she simply claims she was following orders – but those were not lawful or reasonable orders, they were ones which would entail criminal conduct on her part.",
        "The Cash Payments": "",
        "No documentary evidence": "34 Ivy claims that she paid Mr Ng the full amount of$631,285.62(or thereabouts) from her own cash. She said she did so in Exim’s office, tens of thousands of dollars at a time. 35Ivy has no documentary evidence of any such payments. She did not get any acknowledgment of receipt from Mr Ng, and did not keep any record of what she had allegedly paid Mr Ng. Moreover, the payments were from cash which she claimed to have kept in a safe at home, so there were no bank withdrawal records that she could point to either. She says she had hundreds of thousands of dollars in cash from a side-line business of trading in branded handbags (the “Handbag Trading Business”) – I discuss this at [36]–[49] below.",
        "Ivy’s shifting position": "36 Ivy’s current position is that she usedher own cashto make all the payments to Mr Ng, and none of the payments came from thechequeproceeds. This was, however, not the position she took in her original defence filed on 30 March 2020. She had then pleaded that after the cheques were credited into the bank accounts of RABH, Gary, Ivy herself, and Wedding Day, she “thereafter arranged for these moneys to be transferred to the bank account of [Ivy] who then withdrew the amount in cash and handed it over to [Mr Ng]”,ie, the payments to Mr Ng came from the cheque proceeds. 37 The first allegation – that the cheque proceeds werealltransferred to Ivy’s bank account – is contradicted by the documentary evidence and Ivy’s own evidence. Gary retained $53,750.02 (Ivy said she allowed him to do so, to repay a debt of $53,750 which she owed him). Moreover, some amount of the money received by Wedding Day went towards bank charges, and some were otherwise expended; only a portion was transferred to Ivy’s account. 38 The second allegation – that the payments to Mr Ng came from the cheque proceeds – was abandoned when Ivy filed her affidavit dated 15 July 2020 (“15 July 2020 affidavit”) to resist Exim’s application for a Mareva injunction against her. In that affidavit, she said: (a) she had large sums of cash in her possession accumulated from theHandbag Trading Businessthat she had conducted for some years; (b) while she had debts, she did not pay them first as she had already negotiated a payment plan and there was very little interest on the sums owed; and (c) she was therefore able to draw on her reserve of cash for the cash delivered to Mr Ng.13Foot Note 13×Ivy’s 15 July 2020 Affidavit, para 10(g). 39 This was the first reference to the Handbag Trading Business being the source of the Cash Payments. Ivy then amended her defence on 10 September 2020 to track the position stated in her 15 July 2020 affidavit.14Foot Note 14×Ivy’s Defence (Amendment No 1), para 14. 40 It is quite a turnaround to go from saying thatallof the Cash Payments came from the cheque proceeds (version 1), to saying thatnoneof the Cash Payments came from the cheque proceeds, but instead the cash came from the Handbag Trading Business (version 2). Given the circumstances, not least the large sum involved, Ivy must have known which version was true when she filed her original defence. 41 Moreover, it is her pleaded position that the equivalent of the sums in the last two cheques was handed over to Mr Ng “sometime in February and March 2017”.15Foot Note 15×Ivy’s Defence (Amendment No 2), para 14.The $261,000.45 cheque to Wedding Day was deposited by Ivy into Wedding Day’s account on 27 April 2017, her last day at Exim. If Ivy paid Mr Ng in the office, tens of thousands of dollars at a time, she would know that the payments of the amount in that last cheque could not have come from the proceeds of a cheque that was cleared only on her last day at Exim. 42 Ivy sought to explain her original defence by saying that she did not tell her first set of solicitors about her Handbag Trading Business being the source of the Cash Payments, until after her defence had been filed. Even so, the defence did not merely omit reference to the Handbag Trading Business, it positively asserted that the Cash Payments came from the cheque proceeds, when the bank statements and Ivy’s own evidence are to the contrary. 43 Ivy also said that her solicitors knew the cash payments to Mr Ng had come from her Handbag Trading Business, before she provided further and better particulars on 28 May 2020; yet those particulars still maintain that she had withdrawn the cheque proceeds and used them to pay Mr Ng.",
        "The Handbag Trading Business": "44 The Handbag Trading Business featured in Ivy’s 15 July 2020 affidavit, only after Exim had applied, by HC/SUM 2288/2020 on 9 June 2020, for production of the relevant bank statements (which would show that the position pleaded in Ivy’s original defence, about the cheque proceeds going to her and then to Mr Ng, was false). 45 The documentary evidence Ivy put forward for the Handbag Trading Business comprised three receipts from Prada, and some WhatsApp messages.16Foot Note 16×Mr Lau Yew Khe’s (“Mr Lau”) AEIC, pp 379–381 and 411–420.The only messages which on their face appear to involve Ivy engaging with a potential buyer are the messages at p 415 of the AEIC of Mr Lau Yew Khe (“Mr Lau”); the messages at p 414 of Mr Lau’s AEIC could have involved Ivy buying for a friend. To the extent that the messages show Ivy engaging with suppliers (the oneswho would buy bags for her from Europe), those messages, and the receipts, are equally consistent with Ivy buying the bags for herself, or for her friends (not for profit). Ivy denied that the Prada bags were hers – she said she did not have those bags.17Foot Note 17×Transcript, 6 August 2021, p 124, ln 8–13.Even so, these documents were scant evidence of a Handbag Trading Business of the scale Ivy described, one which had generated hundreds of thousands of dollars in cash for her. 46 Ivy did not declare any income from her Handbag Trading Business for income tax purposes, although her alleged earnings from it were comparable to (or indeed, more than) the income from her full-time employment. As a trained accountant with experience in tax (as stated in hercurriculum vitae),18Foot Note 18×Agreed Bundle of Documents (“ABOD”), pp 8–9.Ivy must have known that she had to declare her income from the Handbag Trading Business, for tax purposes. 47 Ivy’s story about her Handbag Trading Business also suffered from inconsistencies. In her affidavit filed on 26 February 2021 (“26 February 2021 affidavit”), she said that the business took place between 2012and 2018and that she sold five to30items a month. However, during cross-examination, Ivy said instead that the business ran from 2010to 2017, and that she sold five totenitems a month.19Foot Note 19×Transcript, 5 August 2021, p 128 ln 23–25; p 131 ln 5–10 and ln 18–25. 48 As for the profits from the Handbag Trading business, Ivy said in para 4 of her 26 February 2021 affidavit that she could not recall the revenue and profit for each year, but the profit for each item ranged in value from $100 to $15,000. Under cross-examination, however, at first she said she sold five to ten items a month earning $500 to $2,000 per item, with profits of $30,000 to $50,000 a year;20Foot Note 20×Transcript, 5 August 2021, p 128 ln 23–25; p 131 ln 5–10 and ln 18–25.but thereafter she said that her reference to five to ten items a month did not include small items like wallets, and that she also did not include items that did not make a profit.21Foot Note 21×Transcript, 6 August 2021, p 5, ln 8–11 and p 6, ln 6–8.These inconsistencies did not help her cause. 49 Even on the basis of Ivy’s latest evidence that she earned $30,000 to $50,000 a year from a business that started in 2010, that does not gel with the amount of cash she claimed to have accumulated, from which to make the Cash Payments: (a) Ivy claims that by 2015 she had accumulated some $300,000 in cash, such that she could pay Mr Ng the amount of the first two cheques, totalling $271,285.62, in April–May 2016.22Foot Note 22×Ivy’s Defence (Amendment No 2), para 14.She would need to have earned at or near the top end of her $30,000 to $50,000 range, for the six years from 2010 to 2015, to accumulate that. (b) She claims that even after paying Mr Ng the amount of the first two cheques, she still had some $50,000 in cash.23Foot Note 23×Transcript, 5 August 2021, p 149, ln 10–15.She would then have needed to generate more cash to pay Mr Ng the amount of the next two cheques, totalling $360,000, in February–March 2017.24Foot Note 24×Ivy’s Defence (Amendment No 2), para 14That was less than a year after the first set of payments in April–May 2016, which means that Ivy would need to have earned another $310,000 in those ten months or so,ie, over $30,000 per month. That is inconsistent with her saying that she earned $30,000 to $50,000 a year from her Handbag Trading Business. (c) Put another way, for the period of just over seven years from 2010 to February–March 2017, for her Handbag Trading Business to generate$631,285.62in cash to pay Mr Ng, Ivy would have needed to earn some $90,000 a year from it, well beyond the $30,000 to $50,000 annual range she had stated.",
        "The making of payments in many tranches, some of which Ivy advanced": "50 Ivy claims that it took some 28–36 tranches for her to make the Cash Payments, for she was fearful of carrying large amounts of cash with her. This makes her story even more unbelievable. If it were true that Ivy feared carrying large amounts of cash, Mr Ng could have just visited Ivy (or arranged for someone to), to collect the cash from her on no more than four occasions, one for each cheque, rather than for her to pay him in dribs and drabs. 51 It is particularly difficult to believe Ivy’s story in relation to the last cheque, which went to Wedding Day for $261,000.45 on 27 April 2017 (Ivy’s last day at Exim, after she resigned on 1 April 2017). Ivy pleaded that sheadvancedthat sum to Mr Ng in cash, in February–March 2017,beforedepositing the Wedding Day cheque. There are several problems with this: (a) It is hard to believe that Ivy would advance some four years’ worth of her income to Mr Ng. A more likely story would be, her paying Mr Ng only after the Wedding Day cheque cleared – but that could not sit with her saying that that amount was paid in 12–14 tranches in Exim’s office, for the cheque only cleared on her last day at Exim. (b) Ivy claims that she kept large amounts of cash in a safe at home because of her mother’s creditors (she says her mother had a gambling habit), but it is incongruous with that for her to part with $261,000.45 in cash some one to two monthsbeforegetting that back through the Wedding Day cheque. (c) When para 14 of Ivy’s latest defence was highlighted to her, towards the end of her testimony, she then said it was wrong: she said that the Cash Payments for the last cheque in the sum of $261,000.45 were not made by March 2017 as pleaded, but only after she had resigned (which she did on 1 April 2017). Even so, since she said the Cash Payments were made in Exim’s office, they would have been made by 27 April 2017 (Ivy’s last day at Exim), which was also the day the cheque cleared. Ivy would still be advancing $261,000.45, or at least the bulk of it (if any cash were paid to Mr Ng on 27 April 2017 itself).",
        "Ivy’s indebtedness, which she used the cheque proceeds to reduce": "52 Another difficulty with Ivy’s case, is the fact that she was indebted: to Gary for $53,750, and also to banks and credit card companies. She was sued for principal sums totalling $56,989.75 (excluding interest, late charges, and costs): (a) by HSBC in MC Suit No 25001 of 2012 for the principal sums of $4,901.35 and $7,769.33, in which suit judgment against her was entered in October 2012, and consent to entry of satisfaction was only filed in June 2016; (b) by UOB in MC Suit No 25689 of 2012, for the principal sums of $10,468.62, $5,766.94 and $6,391.71, which suit was discontinued in January 2013; and (c) by HSBC in MC Suit No 11346 of 2014, for the principal sum of $21,691.80, in which suit judgment against her was entered in July 2014, an order for examination of judgment debtor was made in January 2016, and consent to entry of satisfaction was only filed in May 2016. 53 The Enhanced Consumer Credit Report dated 25 January 2017 from the Credit Bureau Singapore25Foot Note 25×PBOD, Tab 1, p 95.in respect of Ivy reflects various default records, including the following debts that were settled (leaving a zero balance) in May 2016: ProductClientDate loadedOriginal amountStatusStatus dateUnsecured credit cardDBS3 October 2012$20,521.81Full settlement20 May 2016Unsecured overdraftOCBC17 December 2012$10,242.97Full settlement23 May 2016Unsecured credit cardOCBC17 April 2013$11,099.10Full settlement23 May 2016Restructured loanCitibank12 January 2015$1,638.97Negotiated settlement31 May 2016Restructured loanCitibank12 January 2015$9,307.37Negotiated settlement31 May 2016 54 When Ivy paid off these debts in May 2016, she had received (in April 2016) the $67,601.60 proceeds from the first cheque (to RABH); in May 2016 she also received from Gary $149,934 of the proceeds from the second cheque: $60,000 on 19 May 2016 and $89,934 on 26 May 2016. Did Ivy use the cheque proceeds to pay her debts? 55 In Ivy’s AEIC, she said that part of the $67,601.60 she received from RABH had been used for a $4,400 “payment for my loan” on 13 May 2016 and a $3,376.05 credit card payment the same day. Some of the monies were transferred from her DBS Remix Account to her POSB Account and used for credit card payments of $5,850 and $2,048.50 on 3 May 2016, and another credit card payment of $8,000 on 13 May 2016. 56 Similarly, of the $149,934 she received back from Gary, Ivy said some of it was used for credit card payments of $8,500, $15,500, $15,700, and $8,500 on 20 May 2016. 57 The loan and credit card payments listed in the two preceding paragraphs amount to $71,874.55. There is also the sum of $53,750.02 which Gary had kept from the cheque proceeds he received, in repayment of Ivy’s debt to him. Ivy thus admits that she used a total of $125,624.57 from the proceeds of the first two cheques, to pay her debts. 58 In seeking a Mareva injunction against Ivy, Exim had referred to various loan / credit card repayments made by Ivy in May 2016.26Foot Note 26×Mr Lau’s affidavit dated 9 June 2020.Ivy responded to that as follows, in para 36 of her reply affidavit dated 15 July 2016 (“15 July 2016 affidavit”): I had already settled my outstanding debts between 2014 and 2016. In any event, that is irrelevant to the current case in hand. Just because I am hungry does not mean that I will steal food. I settled the debts by working harder and from the extra income that I earned aside from my employment with the Plaintiff. There are personal reasons for my decisions which are sensitive and are not relevant at this stage of the proceedings. 59 Given Ivy’s admission in her AEIC that repayments totalling $125,624.57 came from the cheque proceeds, what she said in her earlier affidavit was false: she hadnotsettled those debts “by working hard and from the extra income that [she] earned aside from [her] employment with the Plaintiff.” Instead, she had used cheque proceeds that Exim was suing her for. 60 This also undermines her story about her Handbag Trading Business generating hundreds of thousands of dollars in cash which she kept in a safe, sufficient to pay Mr Ng the$631,285.62value of the four cheques. 61If she had such a lucrative business, and so much cash on hand (by Ivy’s account, some $30,000 to $50,000 a year, from 2010 onwards; or more) why did she not use the cash to settle her debts? Instead, she allowed herself to be sued, and judgments to be entered against her, with attendant consequences for interest, late charges, and costs. Ivy claims that she chose not to use the cash she had to settle her debts, because she had negotiated a low interest repayment plan. She also said that she needed to keep large amounts of cash at home as her mother’s creditors might come calling. These explanations are not congruent with Ivy then using$125,624.57 from the cheque proceeds to pay her debts in May 2016, while claiming that she paid Mr Ng the full amount of the cheques from her cash. The net result is, the amount of Ivy’s cash would still be reduced by $125,624.57, as compared to her continuing to leave those debts unpaid. 62To borrow Ivy’s own analogy from para 36 of her 15 July 2016 affidavit, just because a person is hungry (in debt) does not mean she will steal food (the cheque proceeds). But if that person claims that she chose to remain hungry even though she had vast amounts of food (the cash from her Handbag Trading Business), and then promptly eats someone else’s food (the cheque proceeds she used for debt repayments in May 2016), only to give up her own food in return (the Cash Payments to Mr Ng), is this believable? I did not believe it.",
        "Mr Ng was not challenged on his denial of the Cash payments": "63 Mr Ng denied the Cash Payments,27Foot Note 27×Mr Ng Sin Kwee’s (“Mr Ng”) AEIC, paras 7–8.but he was not cross-examined on this. This is peculiar, for the Cash Payments are central to Ivy’s attempt to resist an order that she repay the sum to Exim, and Ivy had deposed to the payments in her AEIC at para 18. Perhaps there was a misguided belief that by avoiding the issue, Ivy could say that it should only be determined at a full trial. Ivy’s written submissions, however, recognise that the Secret Instructions and the Cash Paymentareissues at this stage of the matter: it is submitted that her version of events (on the Secret Instructions and the Cash Payment) should be preferred to that of Exim and/or Mr Ng. Indeed, providing a proper account, as Ivy had been ordered to do, entails not only explainingwherethe cheque proceeds had gone to, but alsowhy. The Secret Instructions and Cash Payments were part and parcel of that account, and so they were mentioned by Ivy in her AEIC. The crux of Ivy’s case is that she is entitled to keep the cheque proceeds, for they were made out in accordance with Mr Ng’s instructions, and she had paid Mr Ng the equivalent sums in cash. 64 Against that backdrop, not to cross-examine Mr Ng on his denial of the Cash Payments, but then to submit that he should be disbelieved, is unfair to him – and to Exim. This goes against the rule inBrowne v Dunn[1893] 6 R 67. I do not, however, need to invoke the rule to preclude Ivy from advancing her case on the Cash Payments: on the evidence, I find that the alleged Cash Payments were never made. 65 I thus reject Ivy’s allegations of the Secret Instructions and Cash Payments. I now turn to the subsidiary points raised by Ivy to resist an order for payment being made against her.",
        "Subsidiary points": "",
        "Alleged inconsistencies in Exim’s case": "66 Ivy contends that Exim’s case is internally inconsistent, and that the court should not order her to make payment unless Exim has explained the alleged inconsistencies. I do not accept this excuse. The financial years in question 67 First, Ivy makes much of the fact that the relevant financial years were referred to as “financial years 2015 and 2016” in para 9 of Exim’s statement of claim.28Foot Note 28×Ivy’s closing submissions, paras 15–23.This was a reference to Exim’s financial years ending 29 February 2016 and 28 February 2017, as explained at paras 35–36 of Mr Lau’s 13th affidavit dated 9 June 2021. This caused no confusion whatsoever, given that the four cheques were fully particularised, and everyone knew (not least Ivy) which financial years they pertained to. Indeed, Ivy only handled dividend cheques for two financial years – those two. Discovery of the misappropriation 68 Second, Ivy says Exim could not have discovered the alleged misappropriation only in 2019,ie, Exim must have discovered it earlier.29Foot Note 29×Ivy’s closing submissions, paras 24–29.Exim pleaded that it was only on or about 11 October 2019, during an audit by its Finance Department, that it discovered that the four cheques had been made out to third parties other than Mr Ng and Mdm Lee. In Ivy’s defence, she denied that paragraph. But all Ivy said affirmatively was that the cheques had been made out in accordance with Mr Ng’s Secret Instructions,ie, Mr Ng knew the four cheques were made out to third-party payees. Ivy did not say that anyone else in Exim, whether the Finance Department, or Mdm Lee, knew this; nor did she say that Exim’s auditors knew this. 69 In her submissions, however, Ivy asserts that not only did Mr Ng know that the cheque proceeds had gone to third parties, this must also have been discovered by Exim’s Finance Department, Mdm Lee, and Exim’s auditors, earlier than 11 October 2019. In other words, despite the Secret Instructions and steps taken by Ivy to conceal what had happened (see (b) and (c) below, and [70]–[76]), Ivy says her attempts to fool Exim, Mdm Lee, and Exim’s auditors, must have failed. This is farcical: (a) The taking of accounts process was forIvyto explain what had happened to the cheque proceeds, more than it was for Exim to say when, who, and how it had discovered that the cheque proceeds had not gone to Mr Ng and Mdm Lee, but to third-party payees – if Ivy intended to run some defence that Exim, Mdm Lee and Ivy’s auditors all acquiesced in her actions, she never put this forward. (b) Although Ivy had made out the cheques to third-party payees (by the time they were presented to the bank), on the corresponding cheque stubs she falsely wrote that the payees were Mdm Lee and Mr Ng. Similarly, on the payment vouchers Ivy falsely wrote that Mdm Lee and Mr Ng were the payees.30Foot Note 30×ABOD, pp 47–48 and PBOD, p 156.Someone looking at the cheque stubs and payment vouchers would have no inkling that the four cheques had in fact been made out to third parties. Mr Ng also explained that he had signed in the “received by” section of the third and fourth payment vouchers, in haste and erroneously – he had not received those cheques or their proceeds.31Foot Note 31×Transcript, 3 August 2021, pp 130–131. (c) Exim’s copy of one of the four cheques32Foot Note 32×ABOD, p 42.(number 002702) in the sum of $203,684.02 bore Mr Ng’s name as payee, but when it was presented to the bank, it bore Gary’s name as payee. Someone looking at that copy of the cheque would think the payee was Mr Ng, not Gary – see [70]–[76]) below. Exim did not have copies of the other three cheques in its records. (d) Exim did not contemporaneously have the bank statements with copies of the cheques as presented to the bank (with third-party payees).33Foot Note 33×Transcript, 3 August 2021, pp 95–98.Those were only obtained later on, which is how the third-party payees were discovered – Mr Ng explained that those bank statements with copies of cheques had to be applied for; they were not regularly received.34Foot Note 34×Transcript, 3 August 2021, p 104. (e) Exim did not contemporaneously have copies of the four cheques as presented to the bank (with third-party payees). Exim only obtained copies of these subsequently.35Foot Note 35×ABOD, pp 38 and 40. (f) Whoever was the exact person who discovered the third-party payees, I accept Mr Ng’s evidence that this was reported to him in October 2019.36Foot Note 36×Transcript, 3 August 2021, pp 95–100.Mr Ng says Ms Low Pit Tan (who was then the finance manager) informed him of this. Mr Melvin Chan succeeded Ms Low Pit Tan as finance manager, and Mr Chan was the one who made the police report on 29 October 2019.37Foot Note 37×ABOD, p 33.Mr Chan then informed his successor Mr Thomas Wong (Exim’s current finance manager, who testified) in January 2020,38Foot Note 38×Transcript, 3 August 2021, p 5, ln 12 to p 6, ln 25.which is not inconsistent with Ms Low rather than Mr Chan having discovered the problem. (g) One would not expect Exim’s auditors to detect that the four cheques had been made out to third parties, rather than to Mr Ng and Mdm Lee (as reflected on the cheque stubs, payment vouchers, and copies of cheques retained in Exim’s records). I reject Ivy’s assertion that the auditors must have discovered what she had done, prior to Exim itself finding out in October 2019. (h) I also reject Ivy’s assertion that Mr Ng and Mdm Lee must have known that the cheque proceeds had been taken by her. The fact that Mr Ng and Mdm Lee signed directors’ statements for the relevant financial years, and Exim’s auditors had audited the financial statements, does not mean any of them knew Ivy had taken the money. Mr Ng, Mdm Lee, Exim, and Exim’s auditors, were all in the dark until October 2019 – because Ivy had kept them in the dark. 70 The copy of the $203,684.02 cheque, as presented to the bank, had Gary as payee; but the copy in Exim’s records had Mr Ng as payee, as shown below.  71 Mr Ng’s position is, all the dividend cheques he signed bore his name or Mdm Lee’s as payee; he did not know how Ivy managed to change the names to third-party payees, before presenting the cheques to the bank. 72 Ivy’s position is, the four cheques bore the third-party payees’ names all along, and that is what Mr Ng signed. She says that after getting Mr Ng’s signature, she made a photocopy of those cheques, changed the payees’ names on those photocopies (two to Mr Ng, two to Mdm Lee), and made photocopies of the altered copies for retention in Exim’s records39Foot Note 39×Transcript, 4 August 2021, p 83 ln 21–31 and p 85 ln 1–3.– anyone looking at those copies would thus think that the payees were Mr Ng and Mdm Lee. This explanation was only offered by her in cross-examination; she had taken a different position earlier in the proceedings. 73 Exim’s copy of the$203,684.02 cheque (bearing Mr Ng’s name as payee) was exhibited to Mr Lau’s 9th affidavit dated 9 June 2020. In response, Ivy said in para 10(e) of her 15 July 2020 affidavit, “the Plaintiff surely cannot be suggesting that I had somehow changed the name of the payee of the cheque after Mr Ng had signed them.” 74 She then said in para 7 of her 4 January 2021 affidavit to resist the application for an account: With reference to paragraph 34 of the Plaintiff’s affidavit, I wish to state that I do not know the origin of the copy of the cheque. I did not originally handwrite Mr Ng’s name on the cheque when I presented it to him. It would not have been possible for me to have changed the payee of the cheque. When I presented the cheques to Mr Ng to sign, they were already in the names of the eventual payees. 75 Building on this, at the hearing of the application for Ivy to account, Ivy’s counsel informed me: “She does not know why there is a copy of a cheque bearing Mr Ng’s name. There is another copy of the same cheque with a different payee name.” 76 That contrasts sharply with Ivy’s evidence under cross-examination, which is that she knew full well why Exim had a copy of a cheque bearing Mr Ng’s name: because she had painstakingly prepared that copy. 77 The crux of the matter is: the four cheques as presented to the bank had third-party payee names. It would not afford Ivy a defence if, at the time Mr Ng signed the cheques, they had third-party payee names, but Mr Ng did not notice this. It would likewise not afford Ivy a defence if, at the time Mr Ng signed the cheques, they bore the names of Mdm Lee and Mr Ng, and Ivy somehow changed that to third-party payee names by the time they were presented to the bank. 78 Ivy contends that the second scenario (where she had altered the payees’ names) could not have happened, as the bank would not have cleared the cheques if she had altered the payees.40Foot Note 40×Ivy’s closing submissions, paras 56–58.I decline to draw that inference, especially since the original cheques were not before the court – I cannot tell just by looking at the photocopies whether there may have been some alteration, and I cannot preclude the possibility that the cheques were altered (perhaps, by the use of some erasable ink) but nevertheless cleared by the bank. Or, as in the first scenario in the preceding paragraph, the cheques may have borne the names of third-party payees all along, but that escaped Mr Ng’s notice when he signed them. 79 I remain satisfied that Mr Ng did not give Ivy the alleged Secret Instructions, and that he did not knowingly sign the four cheques with third-party payee names.",
        "Alleged “hacking” of Ivy’s personal files": "80 The evidence that Exim relied upon included the contents of Ivy’s Dropbox account – Ivy had either left those contents, or the means to access them (eg, by not logging out of her account) in Exim’s computer system. Ivy contends that this evidence should be excluded as a matter of discretion.41Foot Note 41×Ivy’s closing submissions, paras 30–41.I decline to do so. The probative value of the evidence is not outweighed by its prejudicial effect. 81 The evidence from Ivy’s Dropbox account shows that RABH was in poor financial health, and Ivy knew of this (she had a copy of RABH’s general ledger); and that Ivy was indebted (there is a table of her debts). These documents could have been obtained by Exim in discovery, and moreover Ivy’s indebtedness could independently be confirmed,eg, through the credit report, and searches on court proceedings to which she was a defendant. 82 In any event, the evidence from the Dropbox account reinforced my conclusions, but I would have reached the same conclusions even without it.",
        "Alleged incomplete discovery by Exim": "83 Ivy contends that an adverse inference should be drawn against Exim for refusing to disclose relevant documents.42Foot Note 42×Ivy’s closing submissions, paras 42–55.This was, in effect, an attempt to re-litigate Ivy’s failed attempt by way of HC/SUM 3515/2021 to strike out Exim’s claim, alternatively for an unless order. 84Ivy had earlier applied, by way of HC/SUM 2539/2021, for (among other things) Exim to file a supplementary list of documents verified by affidavit, stating whether it has, or had, certain categories of documents. That was granted by an Assistant Registrar (“AR”), but with the scope limited to: 1. All correspondence between the Plaintiff and its auditors (including but not limited to emails, letters and phone messages), and any minutes of meetings by the Plaintiff in respect of meetings between the Plaintiff and its auditors, relating to the dividends in respect of which the Citibank Cheques (as defined in the Statement of Claim) were or were intended to be issued (“Dividends”). 2. All internal correspondence between and/or amongst employees and staff of the Plaintiff (including but not limited to emails, letters and phone messages), and any minutes of meetings by the Plaintiff in respect of internal meetings, in relation to the Plaintiff’s alleged discovery on or about 11 October 2019 of the alleged misappropriation of the Dividends. 85 In compliance with the AR’s order, Exim filed its second supplementary list of documents, verified by affidavit.43Foot Note 43×Mr Lau’s 14th affidavit dated 25 June 2021.Correspondence ensued, including a 12 July 2021 letter from Exim’s lawyers explaining (in para 4) why there were no further documents to disclose.44Foot Note 44×Mr Lau’s 15th affidavit dated 2 August 2021.Ivy’s lawyers did not reply to that letter. Nor did they raise any issues with discovery, or otherwise with the taking of accounts trial proceeding, at the judge pre-trial conference on 12 July 2021. It had, moreover, been common ground at the hearing before the AR, that the documents sought were not relevant for the taking of accounts trial. 86 In the week before the taking of accounts trial was scheduled to commence, Ivy applied on 26 July 2021 to strike out Exim’s claim, or for an unless order, for alleged failure to give discovery. 87 I heard, and dismissed, the application immediately before the taking of accounts trial was scheduled to commence. I noted that the AR had not decided that documents in the categories requested must exist; rather, the AR considered that Exim ought to clarify its position as to existence of the documents and any claim to privilege. Exim did so by the further list and affidavit. 88 I remain unpersuaded that there has been any failure by Exim to meet its discovery obligations. Moreover, Ivy asks that I draw an adverse inference against Exim for not producing documents which her counsel had conceded (before the AR) were not relevant for the purposes of the taking of accounts trial. That just does not follow. 89 Ivy’s present position is: the documentsare relevant to the taking of accounts trial, because they will show if Exim only discovered the misappropriation in October 2019. I am not persuaded that Exim has any further documents to disclose in this regard, and I have rejected Ivy’s allegations that Exim must have discovered the misappropriation earlier – see [68]–[79] above.",
        "Exim’slocus standi": "90 Ivy contends that Exim has nolocus standito sue her for the cheque proceeds.45Foot Note 45×Ivy’s closing submissions, paras 59–72. 91 She says that Mr Ng’s Secret Instructions are attributable to Exim.46Foot Note 46×Ivy’s closing submissions, paras 60–68.I have rejected that – see [32]–[33] above; moreover, I have found that the Secret Instructions did not exist in the first place – see [19]–[33] above. 92 She then says that Mr Ng did not assign the chose in action to Exim,47Foot Note 47×Ivy’s closing submissions, para 69.but the cheque proceeds that Ivy misappropriated wereExim’smoney. There was nothing that Mr Ng needed to assign to Exim, for Exim to be able to sue her. 93 Finally, Ivy says that Exim’s loss has not crystallised. Her contention is that Exim would only suffer loss from her misappropriation of the cheque proceeds, when Exim actually pays Mr Ng and Mdm Lee the dividends (which Exim thought the cheque proceeds had gone to pay). Until then, Ivy says that only Mr Ng and Mdm Lee can sue her, Exim cannot. 94 This is all wrong. Exim intended the cheque proceeds to be payment of dividends to Mr Ng and Mdm Lee, and thought that payment had been made (as reflected in Exim’s audited financial statements). Mr Ng and Mdm Lee too, thought that they had been paid. What they all did not know, is that Ivy had diverted the cheque proceeds to third-party payees, and ultimately to herself. 95 Upon discovery of the misappropriation, an adjustment was duly made to Exim’s financial statements. That is reflected in the financial statements for financial year ended 29 February 2019, Note 22(a), on prior year adjustments and comparative figures.48Foot Note 48×ABOD, Tab 45, p 452.The prior years’ financial statements were restated accordingly, to reflect that Exim still owes Mr Ng and Mdm Lee the$631,285.62in dividends (which had previously been reflected as paid).49Foot Note 49×ABOD, Tab 45, pp 426 and 452.This is further explained in Note 23, on events after reporting period:50Foot Note 50×ABOD, Tab 45, p 455. Misappropriation of funds by a former employee – Note 22(a) Management lodged a police report on October 29, 2019 after discovering the theft or misappropriation of funds by a former employee. The sum involved is estimated to be $631,285. The company has also engaged solicitors to recover the sum from the former employee and her accomplices. Police investigations and the legal suit are ongoing. The company is obliged to repay the loss of dividends arising from the embezzlement of fund and therefore the aforesaid amount was accrued in dividend payables as at February 28, 2019. 96 Exim properly recognised that it still owes Mr Ng and Mdm Lee the amount of the dividends for which Ivy had taken the cheque proceeds. Ivy used the cheques to get Exim’s money under false pretences. Exim is entitled to sue Ivy for that.",
        "The making of an order for payment, following an account": "97 I thus certify, on the taking of the account ordered, that the amount of$631,285.62is due from Ivy to Exim. 98 InGoh Say Hun v Ooi Chit Lee[1994] 1 SLR(R) 958, the first respondent was a trustee for the appellant in respect of a sum of $963,100.43, of which the first respondent failed to account for a sum of $338,142.91. The Court of Appeal stated, “[i]t followed from this that, as a trustee, she was obliged to make good this amount to the appellant and an order for payment for this amount was irresistible and ought to have been made against her.” An order for payment was thus made. 99 InTa Tun Electrical Wire & Cable (Singapore) Pte Ltd v Toh You Kang (Zhuo Youkang) and others and anotherHC/S 124/2018 (19 August 2019), the first defendant was the general manager and director of the plaintiff. He was ordered to furnish an account of S$569,918.06 and US$428,950 which he had received. After the taking of accounts, the court held that no proper account had been given, and ordered payment. The court pithily stated, “[a]s a fiduciary, the first defendant has a duty to account and that must be the starting premise.” 100 Ivy was a fiduciary to Exim: Exim reposed trust and confidence in her as its Finance Manager, and expected her to act in Exim’s interests; she was the most senior person in the Finance Department; and she was solely entrusted with the responsibility of preparing dividend cheques. Contrary to what Exim expected of her, Ivy took the cheque proceeds for herself, when Exim intended them to be paid to Mr Ng and Mdm Lee as dividend payments.",
        "Conclusion": "101 Ivy was ordered to furnish an account of the cheque proceeds. The account Ivy provided amounted to an admission that she had taken the cheque proceeds. 102 With reference to O 43 r 1 of the Rules of Court (see [16] above), there is no preliminary question to be tried such that I should not make an order for payment now. Payment ought to be ordered: Ivy was a fiduciary, she was the one who caused the payments to be made, and she was the ultimate recipient of the cheque proceeds. I thus order Ivy to pay the sum of $631,285.62 to Exim forthwith. Ivy is also to pay Exim the costs of the taking of accounts, to be fixed or taxed, if not agreed. 103 I will hear the parties on any consequential orders that may be required. Andre ManiamJudge of the High Court Chia Jin Chong Daniel, Tan Ei Leen and Nicole Thong Wen Teng (Coleman Street Chambers LLC) for the plaintiff; Walter Ferix Silvester and Tan Hoe Shuen (Silvester Legal LLC) for the first defendant."
    }
}