{
    "case_title": "Composers and Authors Society of Singapore Ltd vGolden Village Multiplex Pte Ltd                                    (formerly known as Golden Village (Yishun) Pte Ltd)",
    "ncitation": "[2021] SGHC 2",
    "coram": "Andre Maniam JC",
    "sections": {
        "Introduction": "1 Mendelssohn’s “Wedding March” needs no introduction – at the sound of its distinctive opening fanfare, guests rise spontaneously to welcome newly-weds. Is a copyright licence, however, necessary for the “Wedding March” to be publicly performed? 2 Following the composer’s untimely death in 1847 (when he was just 38 years old), copyright would only have lasted for another 50 to 100 years, varying from jurisdiction to jurisdiction. By the time Singapore’s Copyright Act (Cap 63, 2006 Rev Ed) (“the Copyright Act”) came into force on 10 April 1987, there was no longer any copyright in the “Wedding March” – it had passed into the public domain, and could freely be performed in public without a licence. 3 The defendant (“GV”) contends that in 1995, it was misled into entering into a Copyright Music Licence-Contract1Foot Note 1×Plaintiff’s Core Bundle of Documents (“PCB”) at pp 4-6.(“the Licence”) with the plaintiff (“COMPASS”). GV says that because COMPASS had wrongly claimed to administer the copyright in the “Wedding March”, and made other misrepresentations, GV believed that COMPASS had the right to administer copyright inallmusical works in all films that GV might screen in its cinemas.",
        "Background": "",
        "Parties": "4 COMPASS, a company limited by guarantee, is a collective management organisation (“CMO”) operating in Singapore. GV is Singapore’s largest cinema operator with 14 multiplexes housing some 104 screens.",
        "The Licence": "5 The Licence,2Foot Note 2×PCB at pp 4-6.dated 22 June 1995, was signed by COMPASS’ general manager, Mr Edmund Lam (“Mr Lam”), and by GV’s Mr Lee Hwai Kiat (“Mr Lee”). Mr Lam testified at trial, but Mr Lee had left GV and was not called as a witness. 6 Pursuant to the Licence, GV paid COMPASS a licence fee equivalent to 0.2% of the gross ticket takings of GV’s cinemas. This fee was paid until the end of March 2016.",
        "The 16 June 2016 letter": "7 On 16 June 2016, GV and certain other cinema operators (collectively, “the Exhibitors”) wrote to COMPASS to say that they would “cease the current arrangement of paying COMPASS after the expiry of each quarter based on … gross ticket takings with effect from [1 April 2016]” (“the 16 June 2016 letter”).3Foot Note 3×PCB at pp 24-25.Consistent with that, GV has not paid COMPASS any licence fees since 1 April 2016. 8 The 16 June 2016 letter pointed out that COMPASS did not represent all composers and authors whose works may be included in movies screened at the Exhibitors’ cinemas. As such, COMPASS did not have the right to administer copyright in all musical works in all movies.",
        "The parties’ positions on the 16 June 2016 letter": "9 GV contends that the 16 June 2016 letter had the effect of terminating its Licence with COMPASS: (a) for breach of an express and/or implied term in the Licence; (b) by way of rescission for misrepresentation; and/or (c) pursuant to clause 6 of the Licence which allowed termination by notice. 10 COMPASS’ position is that the Licence has not been terminated, but remains in force to date.",
        "Issues": "11 The two main issues are: (a) has the Licence been terminated (and if so on what basis); and (b) what relief is either party entitled to?",
        "Has the Licence been terminated?": "",
        "GV’s case on contractual terms and misrepresentation": "12 In seeking to justify its termination of the Licence based on an express or implied term, or misrepresentation, GV contended that COMPASS promised or represented that COMPASS had the right to grant GV permission to perform publicly, or authorise the public performance of, any or all of the musical works in all movies screened by GV in its cinemas.4Foot Note 4×Defence and Counterclaim (“Defence and Counterclaim”) at paras 10, 12, 13 and 18. 13 Conceivably, any musical work might be used in a movie screened by GV, now or in the future. As such, GV contends that COMPASS had promised or represented that it had the right to administer copyright inallmusical works, whether existing or future.",
        "Did COMPASS breach the Licence by not having the right to administer copyright in all musical works?": "14 It is common ground that COMPASS does not have (and it never did have) the right to administer the copyright toallmusical works. 15 First, for a musical work in the public domain such as the “Wedding March” (see [2] above), copyright no longer subsisted and there was no copyright for COMPASS to administer. 16 Second, for a musical work where copyright still subsists, COMPASS would only have the right to administer that copyright if the composer was a member of COMPASS (or of another CMO affiliated with COMPASS). Otherwise, the copyright in that work would be administered by the composer himself, or whoever else he might have chosen to administer it. 17 GV’s case is that there was an express or implied term in the Licence that COMPASS had the right to administer copyright in all musical works in all movies screened by GV. COMPASS’ response is that it had never promised or represented this. Express term 18 Clause 1 of the Licence stipulates that “[COMPASS] grants permission to [GV] to perform publicly, or authorise the public performance of, any or all of the musical works for the time being in [COMPASS’] repertoire”.5Foot Note 5×PCB at p 4. 19 GV’s case is that COMPASS was in breach of clause 1 because it did not have the right to administer copyright in all musical works in all movies screened by GV. That is not what clause 1 says, and GV did not plead that that is what clause 1 meant, but GV submits that clause 1 should be interpreted that way. 20 If, however, the parties had meant for COMPASS to licence to GV all musical works in all movies screened by GV, clause 1 could simply have said that. Instead, clause 1 refers to “the musical works for the time being in [COMPASS’] repertoire”. 21 COMPASS’ position is simply that it only licenced what was in its repertoire, and not all musical works. GV, however, argues that it was a term of the Licence that COMPASS’ repertoire covered all musical works then in existence, and the reference in clause 1 to what was in COMPASS’ repertoire “for the time being” was to cover all musical works coming into existence in the future. 22 That still does not explain why clause 1 refers to the musical works “in [COMPASS’] repertoire”, rather than simply saying “all musical works”. GV says that the reference to COMPASS’ repertoire referred to the “all-encompassing” repertoire that COMPASS purportedly administered.6Foot Note 6×Defendant’s Closing Submissions dated 23 October 2020 (“DCS”) at para 200.In other words, “the musical works … in [COMPASS’] repertoire” meant “all musical works”. 23 GV did not, however, plead any facts about COMPASS purporting to have an all-encompassing repertoire to support its interpretation of clause 1 of the Licence. It did have a claim in misrepresentation, but (as I elaborate below) its pleaded misrepresentation was said to be contained in the licence scheme offered by COMPASS to GV, which the parties later signed and entered into as the Licence. Put that way, the misrepresentation claim adds nothing to what the Licence itself says, particularly in clause 1. 24 GV points to the payment of licence fees being based on 0.2% of its gross receipts to argue that it was licensing from COMPASS all musical works in all movies. This, however, conflates what was licensed, with how the parties agreed licence fees would be calculated. What was licensed is stated in clause 1 (ie, “the musical works for the time being in [COMPASS’] repertoire”) and what the parties agreed that GV would pay for that is stated in clause 2 (ie, the relevant tariff as in force from time to time, which is 0.2% of gross receipts). GV also points to films wherenoneof the musical works were in COMPASS’ repertoire, films where onlysomeof the musical works were in COMPASS’ repertoire, and instances where the copyright in a musical work might beshared(between a composer or author COMPASS represented, and a third party). 25 None of this adds to GV’s argument. On the face of clause 1 of the Licence, COMPASS only licensed to GV what was in COMPASS’ repertoire, and by virtue of clause 2, GV agreed to pay for that based on 0.2% of its gross receipts. 26 GV’s reading of clause 1 is an extreme one. On GV’s case, from the time COMPASS granted the Licence, it would have been in breach of it because it did not have the right to administer copyright in all musical works whatsoever. Even if COMPASS did have the right to administer copyright in all musical works where copyright still subsisted, it would nevertheless have been in breach because some musical works were already in the public domain, and for those works there was no copyright that COMPASS could still administer. 27 Moreover, on GV’s case, COMPASS would need to have the right to administer copyright in allfuturemusical works. If COMPASS did not have the right to administer copyright in a musical work that might one day be composed in a faraway land, which might find its way into a movie screened by GV, COMPASS would be in breach of the Licence. 28 GV submits that one of COMPASS’ witnesses, its Senior Licensing Manager, Mr Melvin Tan (“Mr Tan”), had agreed that the Licence was a “blanket licence” for all musical works in all movies.7Foot Note 7×Transcript, 7 September 2020, p 98 lines 13–18, p 100 lines 17–25, p 101 lines 1–2; 8 September 2020, p 7 lines 8–21, p 153 lines 3–11; 9 September 2020, p 131 lines 6–15.While Mr Tan appeared to accept in parts of his evidence that the Licence covered all musical works, he had linked that back to what belonged to COMPASS,ie, what was in COMPASS’ repertoire: “… it’s a blanket licence, so you – you – whatever musical works that is [sic] in the moviesbelonging to COMPASS, that is what material – is concerned” [emphasis added].8Foot Note 8×Transcript, 8 September 2020, p 7 lines 14–17. 29 GV does not say that Mr Lam, who signed the Licence for COMPASS, made any concession that COMPASS had purported to licence all musical works, and not only what was in its repertoire. 30 Whatever Mr Tan’s views were as to the scope of the Licence, or as to what COMPASS’ licensees thought they were licensing, the Licence still has to be construed. 31 GV contends that the commercial purpose of the Licence was to grant permission to publicly perform all musical works in all movies screened, and if COMPASS’ repertoire were not all-encompassing, then there would be some musical works for which GV did not have a copyright licence but had proceeded to publicly perform. 32 COMPASS responded to this contention in its 12 July 2016 letter9Foot Note 9×PCB at pp 29–31.by saying that it was not legally obliged by the Licence to cover works not in its repertoire, but that it would indemnify its licensees in this regard; COMPASS had set aside sums for claims to be made. 33 Even if GV had wished to have a single licence covering all copyrighted musical works, that cannot force upon clause 1 of the Licence a meaning which the clause cannot bear. I agree with COMPASS that, as an express term, clause 1 of the Licence did not oblige COMPASS to have the right to administer copyright in all musical works, but only what was in COMPASS’ repertoire for the time being. That is what clause 1 of the Licence says, and that is what it means. To say that COMPASS’ repertoire had to be all-encompassing is to read into clause 1 what is not there, and to oblige COMPASS to do the impossible. Implied term 34 GV’s alternative argument is that there is an implied term that COMPASS has the right to administer copyright in all musical works. I consider that the proposed implied term is inconsistent with the express term in clause 1 of the Licence, and as such cannot be implied. The proposed implied term would convert a licence of what was in COMPASS’ repertoire, into one for all musical works (which COMPASS could never provide, at least because there are some works already in the public domain). The parties would not have said “[o]h, of course” to such an implication; nor is it necessary for business efficacy (seeSembcorp Marine Ltd v PPL Holdings Pte Ltdand another and another appeal[2013] 4 SLR 193 at [101]). 35 It follows that COMPASS was not in breach of an express or implied term, in not having the right to administer copyright in all musical works.",
        "Did GV enter into the Licence because COMPASS misrepresented that it had the right to administer copyright in all musical works?": "GV’s pleaded case on misrepresentation 36 GV’s pleaded case is that “in or around 22 June 1995”,ie, when the Licence was entered into, COMPASS had misrepresented to GV that COMPASS had the “Right” to grant permission to GV to perform publicly, or authorise the public performance of, any or all of the musical works in all movies screened by GV in its cinemas.10Foot Note 10×Defence and Counterclaim at para 18.It was essentially GV’s case that COMPASS had misrepresented that it administered copyright in all musical works whatsoever. 37 GV provided the following further and better particulars of its allegation:11Foot Note 11×Further and Better Particulars to the Defence and Counterclaim dated 26 December 2018 in Set Down Bundle at p 20. (a) On whether the misrepresentation was made orally or in writing, GV said, “[b]y offering a licence scheme to [GV] (which later was signed and entered into by both parties and resulted in [the Licence]) and/or by entering into [the Licence] with [GV], [COMPASS] had made an express and/or implied representation to [GV] that it owns the Right in respect of musical works in all movies screened by [GV] in its cinemas”. (b) As to who in GV the alleged misrepresentation had been made to, GV repeated (a) above. (c) As to when and where the alleged misrepresentation had been made, GV likewise repeated (a) above. (d) As to who in COMPASS had made the alleged misrepresentation, GV referred to (a) above, and added that Mr Lam was the one who had entered into the Licence on behalf of COMPASS. 38 GV’s case, as pleaded and particularised, was thus that the proposed licence, and the Licence itself, constituted the very misrepresentation it relied upon. In view of my findings above as to the terms of the Licence, it follows that there was no such misrepresentation. What COMPASS proposed, and GV agreed to, was a licence of what was in COMPASS’ repertoire, not a licence of all musical works. 39 On GV’s pleaded case, there was thus no misrepresentation. GV’s hearsay evidence 40 At trial, GV put forward the case that COMPASS had madeearliermisrepresentations: in newspaper coverage, and on COMPASS’ website. 41 This was not GV’s pleaded case. In any event, I find that this expanded misrepresentation case is not made out. 42 GV’s case suffered from an obvious flaw: it had no evidence from anyone involved in GV’s decision to enter into the Licence. 43 GV’s witnesses only joined GV after the Licence had been entered into on 22 June 1995: its current Chief Executive Officer (“CEO”), Ms Cheo Boon Mui (“Ms Cheo”), joined in 1996;12Foot Note 12×Affidavit of Evidence-in-Chief of Cheo Boon Mui (“Ms Cheo’s AEIC”) at para 4.and its in-house counsel, Mr Min Qi Jia (“Mr Min”), joined in 201813Foot Note 13×Affidavit of Evidence-in-Chief of Min Qi Jia at para 3.(even after the 16 June 2016 letter). Ms Cheo and Mr Min had no personal knowledge of the alleged misrepresentation or the alleged inducement. 44 Mr Lee Hwai Kiat (“Mr Lee”) signed the Licence on behalf of GV, but he left GV thereafter, and GV did not call him as a witness. Instead, he was named in GV’s belated notice to admit hearsay evidence (which also identified another former GV representative, since deceased). 45 In her testimony, Ms Cheo did not refer to these two former GV representatives by name. Instead, she spoke of her “predecessor” or “colleagues” who had told her things.14Foot Note 14×Transcript, 11 September 2020, p 14 lines 1-3; p 28 lines 5-16; p 43 lines 11-19.Moreover, she mentioned this only when being cross-examined,15Foot Note 15×Transcript, 11 September 2020, p 47 lines 8-14.and the notice to admit hearsay evidence was given thereafter – after all the witnesses had finished testifying. This diminished the value of the notice (Jeffrey Pinsler,Evidence and the Litigation Process(LexisNexis, 4th Ed, 2013) at para 6.042, cited inGimpexLtd v Unity Holdings Business Ltd and others and another appeal[2015] 2 SLR 686 at [138] (“Gimpex”)): The purpose of notice is to enable the opposing party to carry out his own investigation prior to the trial in order to ascertain its significance and veracity and to secure information which may refute it or reduce its weight (if necessary). 46 One of the hearsay exceptions GV relied on is s 32(1)(j) of the Evidence Act (Cap 97, 1997 Rev Ed) (“the Evidence Act”), but to satisfy s 32(1)(j)(ii) of the Evidence Act, GV would need to show “that despite reasonable efforts to locate [Mr Lee], he cannot be found whether within or outside Singapore”. GV did not say what efforts it had made to locate Mr Lee (if it had made any efforts at all) – GV’s hearsay notice simply stated that Mr Lee’s address was unknown. Consequently, I find that GV cannot rely on s 32(1)(j) of the Evidence Act in relation to Mr Lee. InGimpexat [101], the Court of Appeal commented that potential witnesses’ resignation from an organisation is a relevant factor to consider, but “[e]vidence as to how they were previously contacted and what efforts had been made to contact them would have been more germane”. 47 Furthermore, why did the hearsay evidence not find its way into the affidavits of evidence-in-chief (“AEICs”) of GV’s witnesses in the first place? What Ms Cheo says her predecessor or colleagues had told her about what COMPASS had represented to them, or about why GV had decided to enter into the Licence, was hearsay. If these communications were important to GV’s case, one would have expected to see them in Ms Cheo’s AEIC, and for a notice to admit hearsay evidence to be given no later than two weeks after service of that AEIC, in accordance with O 38 r 4 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed). 48 Perhaps the hearsay evidence was not in the AEICs of GV’s witnesses because GV’s pleaded case on misrepresentation was simply about the licence scheme proposed by COMPASS to GV, which became the Licence. Ms Cheo’s AEIC went further in asking the court to draw inferences from the Licence, and from publicly available information. But she did not mention anything supposedly said by her predecessor or colleagues. 49 Ms Cheo referred to her predecessor or colleagues only when she was cross-examined on GV’s case that the licence scheme (and the Licence) was itself said to be the alleged misrepresentation.16Foot Note 16×Transcript, 11 September 2020, p 8 lines 18–25; p 9; p 10; p 11 lines 1–3.At that point, Ms Cheo said she knew “for a fact” that when COMPASS approached her predecessor, COMPASS represented that it “owned … the right” in all musical works.17Foot Note 17×Transcript, 11 September 2020, p 10 lines 21–24.But then she slid into rationalisation: “why would anyone sign a contract that give [sic] away 0.2 per cent of your revenue for every ticket you sell? I mean, it doesn’t make sense,if[the contract] hasn’t said so.” [emphasis added].18Foot Note 18×Transcript, 11 September 2020, p 10 line 25; p 11 lines 1–3.She further rationalised that if COMPASS did not in fact own the rights in all musical works, “why would – why would my – the predecessor sign the contract?”19Foot Note 19×Transcript, 11 September 2020, p 12 lines 6–7. 50 Ms Cheo did refer again to her predecessor or colleagues in talking about the alleged misrepresentation, but her response was vague and lacking in conviction:20Foot Note 20×Transcript, 11 September 2020, p 14 line 1–13. A.  So, you see, I -- the fact is I wasn’t in there in 1995, so I based on the information passed down by my predecessor, what happened -- Q.  All right. A. -- that time. So I -- I -- that is our position. I cannot tell you exactly which date, which, who, when. But the gist of it is they told me that – that some – that, you know, COMPASS has represented to them that, you know, you want to play music, look at the -- you don’t want to get -- run foul of the law. You have to take out this blanket licence that will covers us for every music played in our theatre. So that was the gist of the -- why they come about signing the agreement. 51 When specifically asked about GV allegedly being induced by the alleged misrepresentation to sign the Licence, Ms Cheo reverted to relying on inferences:21Foot Note 21×Transcript, 11 September 2020, p 21 lines 16–25; p 22 lines 1–8. Q.  Likewise, you wouldn’t be in a position to know whether the defendant had that contract by any way of inducement or not. Do you agree? A.  Inducement by -- is through the manner in which, you know, COMPASS acted. So -- so otherwise why would them [sic] -- enter into a contract, they give away a portion of their revenue? Q.  No, whoever signed the contract, or whoever negotiated the contract, what’s the reason he entered into the contract? You won’t be able to say whether he’s induced by any form of representation because you were not involved. A.  You see here, all these, you know, articles, you know, this is -- COMPASS acted in a manner that it is, like appointed by the government to regulate this, so if you want to get -- play music, you want to operate your business -- this is like a permit to operate your business, you would have to sign it. 52 She did, however, mention her predecessor or colleagues again, in subsequent responses:22Foot Note 22×Transcript, 11 September 2020, p 28 lines 5–14; p 43 lines 5–19. Q.  Mdm Cheo, all these reports before the contract, you were not with the company, and these reports were extracted recently. So from the reading of these reports, you came to the conclusion that, based on that, the plaintiff had made the representation of having all the rights in all the movies screened by the defendant. Is it? A.  No, the representation were made to my predecessor, and they told me that, based on all of these reports at that time, that they also had that same impression. … Q.  Then in paragraph 43, you are relying on further that based on the contract terms in the contract itself, it’s also another representation that induced the defendant into entering the contract. Is that correct? Is that correct? A. Yes. Q. What exactly the reason for the people in the defendant company to sign the contract on or before 1995, you have no knowledge at all, right? A. As I said earlier, based on the information passed down by my predecessor, that they were misled by all the impression that’s created prior to that, and the only -- in order for the business to be able to operate, you need to pay a licence so that to cover all music that we’re going to be playing in the movie. 53 I consider Ms Cheo’s reference to her predecessor or colleagues to be a belated attempt to shore up GV’s lack of evidence about the alleged misrepresentation and the alleged inducement. 54 As I mentioned above at [46], GV has not satisfied me that despite reasonable efforts to locate Mr Lee (who had signed the Licence for GV), he cannot be found. As such, GV cannot rely on s 32(1)(j) of the Evidence Act as a hearsay exception for what Mr Lee supposedly told Ms Cheo. Moreover, given Mr Lee’s potential availability as a witness, and the importance of his evidence, it would not be in the interests of justice to admit the hearsay evidence of what he and the other GV representative (since deceased) had supposedly told Ms Cheo, even if GV could fit the hearsay evidence within one of the subsections in s 32(1) of the Evidence Act: see s 32(3) of the Evidence Act. This conclusion is reinforced to the extent that the hearsay evidence relates to allegations that GV has not pleaded, and by how late in the day the hearsay evidence was introduced. 55 In any case, I am not convinced by Ms Cheo’s testimony that she had heard from her predecessor or colleagues that COMPASS had misrepresented the position to GV, or that GV had been induced by the misrepresentation to enter into the Licence. GV’s evidence of newspaper coverage and website printouts (1) COMPASS’ origins 56 GV submits that the fact that COMPASS was formed just two months after the Copyright Act first came into force in Singapore, gave rise to the impression that the formation of COMPASS was backed by the full force of the law, and that COMPASS had been tasked by the Singapore Government to administer copyright. This is fanciful and I reject it. The fact that COMPASS was formed two months after the Copyright Act came into force (or even because the Copyright Act came into force) says nothing whatsoever about whether COMPASS had links to the Government. 57 Ironically, the newspaper articles that GV relies on indicate that COMPASS’ reach only extends to works that are: (a) covered by copyright; and (b) owned by members of COMPASS. For instance, it was reported that “[COMPASS] does not expect much difficulty in enforcing the rights of itsmembersin Singapore Courts” (David Gabriel, “Play the right tune or face the music”,TheBusiness Times(21 November 1990) at 14) (Gabriel, “Play the right tune”) [emphasis added];23Foot Note 23×Ms Cheo’s AEIC at pp 75-76.“[a public performance licence] allows [karaoke lounges] to play music by artisteswhose works are covered by Compass” (Brendan Pereira, “Errant karaoke lounges taken to court by music rights society”,TheStraits Times(1 February 1993)) [emphasis added]24Foot Note 24×Ms Cheo’s AEIC at pp 77-78.and “[u]nder the Copyright Act, any person or organisation which gives or authorises the performance of a musical work in public places must obtain prior consentfrom the copyright owner” (Edmund Lam, “Compass will act only as last resort”,The Straits Times(24 December 1994) (Lam, “Compass will act only as last resort”) [emphasis added].25Foot Note 25×Ms Cheo’s AEIC at p 89.This goes against GV’s assertion that the newspapers fostered the impression that all musical works had copyright, and that all copyright was administered by COMPASS. (2) Did COMPASS create the impression that it was quasi-governmental, or had links to the Government? 58 GV submits that COMPASS misrepresented that it was a quasi-governmental body, or at least an entity with links to the Singapore Government. From COMPASS’ name in the Licence itself, however, GV would have known who it was contracting with - a limited liability company known as the “Composers and Authors Society of Singapore Ltd”26Foot Note 26×PCB at p 4.- a Singapore society of composers and authors, in corporate form; not a government ministry, nor a statutory body. 59 GV says that the use of the word “tariff” in the Licence gave the impression that COMPASS was quasi-governmental or had links to the Government, for “tariff” is synonymous with “tax”,ie, money paid to the Government. “Tariff” can, however, also just mean a list of prices charged by a company. The Licence says that GV would be paying “royalties” (see clause 2) to be calculated under COMPASS’ relevant tariff as in force from time to time.27Foot Note 27×PCB at p 4.The Licence did not give the impression that GV was paying a tax to the Government, and I do not believe that GV thought it was doing so. I believe GV knew full well that it was paying a commercial licence fee to a company known as COMPASS, for the public performance of musical works in COMPASS’ repertoire. 60 GV points to various newspaper articles in 1994 describing COMPASS as “a local copyright protectionagency” (Sanjay Perera “Music copyright violators taken to court in big numbers”,TheStraits Times(12 November 1994) (Perera, “Music copyright violators”) [emphasis added],28Foot Note 28×Ms Cheo’s AEIC at p 83-84.and “a local copyrightagency” (Leong Ching Ching, “Music played at D&Ds subject to copyright fee”,TheStraits Times(16 December 1994) (Leong, “Music played at D&Ds”) [emphasis added];29Foot Note 29×Ms Cheo’s AEIC at p 87-88.and its representatives as “officials” or “officers” (Brendan Pereira, “Copyright group wins fight against 40 karaoke lounges”,The Straits Times(6 January 1994);30Foot Note 30×Ms Cheo’s AEIC at p 79-80.Leong Ching Ching, “More nightclubs under scrutiny”,The Straits Times(28 November 1994) (Leong, “More nightclubs under scrutiny”);31Foot Note 31×Ms Cheo’s AEIC at pp 85-86.Leong, “Music played at D&Ds”). GV argues that this gave the impression that COMPASS had been vested with authority by the Singapore Government. I disagree: the use of the words “agency”, “officials” and “officers” does not connote that COMPASS was “governmental” in some way. An “advertising agency”, “match officials”, and “bank officers” are not governmental just because the words “agency”, “officials”, and “officers” are used. More fundamentally, the question is not what a newspaper reader might think, but whatGVthought when it entered into the Licence with COMPASS, at which point GV knew full well that it was contracting with a limited liability company, not a governmental or quasi-governmental organisation. (3) Did COMPASS create the impression that all musical works were licenced by it? 61 GV argues that COMPASS conveyed the message that anyone performing any musical work in public had to obtain a licence from COMPASS. 62 None of the newspaper articles cited by GV, however, said that COMPASS administered copyright in all musical works, or even that copyright subsisted in all musical works. 63 To the contrary, in “Join Compass, local composers urged”,The Straits Times(8 November 1989) (“Join Compass”), it was stated: “Compass also aims to make music users, who broadcastcopyrighted pieces of music, pay for a broadcast licence. This would apply even to shops which play background music.” [emphasis added]32Foot Note 32×Ms Cheo’s AEIC at p 74.The reference to “copyrighted pieces of music” would indicate to a reader that there were non-copyrighted pieces of music (as indeed there were, with musical works in the public domain). COMPASS was not portrayed as an entity administering copyright in all musical works, because copyright did not then subsist in all musical works. 64 Moreover, the article said, “[l]ocal composers have been urged to join [COMPASS] to protect the copyright of their works” and that “[o]ne of [COMPASS’] main responsibilities is to ensure thatmembersget royalties when their songs are performed”. [emphasis added]33Foot Note 33×Ms Cheo’s AEIC at p 74.COMPASS did not purport to have the right to administer copyright in musical works ofnon-members. 65 Similarly, in Leong, “More nightclubs under scrutiny”, it was stated: “[COMPASS] represents Singapore and overseas composers, and publishing housessuch asWarner, Polygram, BMG and EMI. It said most nightspots in Orchard Road have complied with its licensing scheme of collecting royalties … It protects thecopyright interestsof composers, authors and publishers of musical works and their lyrics by making music users, who broadcastcopyrighted pieces of music, pay for a broadcast licence” [emphasis added].34Foot Note 34×Ms Cheo’s AEIC at p 85. 66 Again, the reference to “copyright interests” and “copyrighted pieces of music”, indicated that COMPASS’ reach would not extend to musical works in which no copyright subsists. Furthermore, the reference to publishing houses “such as” the ones named in Leong, “More nightclubs under scrutiny” would indicate that COMPASS did not represent all publishing houses (or it would be simpler to just say so). Nor did the article say that COMPASS represents all composers. 67 Both these articles (“Join Compass” and Leong, “More nightclubs under scrutiny”) indicated that COMPASS was collectingroyalties, rather than some tax payable to the Government. The same word “royalties’ is also used in the Licence. 68 In similar vein is Leong, “Music played at D&Ds”, which said: The Composers and Authors Society of Singapore (Compass), a local copyright agency, is stepping up its collection of royalties from companies which play copyrighted music during their social functions. … If these are held in hotels which do not have a special licence for this purpose, each company has to apply for a separate licence. … Mr Melvin Tan, Compass’ licensing manager, said he is writing to all listed companies, asking them to apply for such a licence if they intend to play copyrighted music at company functions. … ‘Even the wedding march is copyrighted to us, and so couples getting married still have to pay us royalties,’ [he] said. 69 This article, like those mentioned above, mentioned “copyrighted music” for which “royalties” were payable, again suggesting that there was non-copyrighted music for which royalties need not be paid. Even Mr Tan’s reference to the “Wedding March” was in the context of: (a) there being copyright in the “Wedding March”; and (b) that copyright being administered by COMPASS. This does not suggest that copyright subsisted in all musical works, nor that COMPASS administered copyright in all musical works. Mr Tan was just citing the “Wedding March” as an example of a well-known musical work, that he claimed had copyright administered by COMPASS. 70 The “Wedding March” was, however, a poor example for Mr Tan to have chosen: it had ceased to enjoy copyright protection many years ago, and COMPASS did not administer copyright in it. In fact, COMPASS never did. Mr Tan thus suggested that COMPASS’ repertoire was more extensive than it in fact was, but still, he did not suggest that it was all-encompassing. 71 Later that month,TheStraits Timespublished a letter from Mr Lam on its Forum page (Lam, “Compass will act only as last resort”): Under the Copyright Act, any person or organisation which gives or authorises the performance of a musical work in public places must obtain prior consent from the copyright owner. … In practice, Compass has not and will not licence private birthday or wedding parties which only use the songs, Happy Birthday and Wedding March. My licensing manager, Melvin Tan, in the article entitled ‘Music played at D & Ds subject to copyright fee’ (ST, Dec 16), was merely trying to emphasise the point thateven these songs are copyrighted, not to mention themany other copyrighted songswhich are played at such functions frequently. [emphasis added] 72 Mr Lam did not take the opportunity to correct Mr Tan’s assertion that the “Wedding March” had copyright administered by COMPASS. Indeed, he furthered the incorrect assertion that there was still copyright in the “Wedding March”, by saying “even these songs are copyrighted”. He did not, however, claim that copyright subsisted in all musical works, or that COMPASS administered copyright in all musical works. Instead, in saying “these songs are copyrighted” and “many other copyrighted songs … are played at such functions”, he indicated that not all songs are copyrighted. 73 GV also referred to other newspaper articles warning users of musical works that their failure to obtain a licence from COMPASS would lead to serious legal consequences including criminal sanctions. There was nothing false or misleading in this. COMPASS did take legal action, and the Copyright Act does prescribe criminal sanctions. If anything, the articles cited continued to emphasise that it was only such copyrighted music as COMPASS administered that had to be licensed by COMPASS, for payment of royalties: (a) Gabriel, “Play the right tune”: The society intends enforcingits copyrightand collecting what is due – if necessary taking legal action to force reluctant music users to pay up or seeking injunctions to prevent further public performances. [emphasis added] (b) Perera, “Music copyright violators”: A local copyright protection agency took action against a record number of lounge, nightclub and pub owners this year. … Mr Edmund Lam, general manager, Composers and Authors Society of Singapore (Compass) said: ‘… [owners of entertainment outlets] must realise that they are violating the intellectual property of others.’ … Essentially, action was taken against them for not acquiring a licence to playcopyright musicat their outlets. [emphasis added] (c) Leong, “More nightclubs under scrutiny”: Apart from targeting the new lounges and pubs, it also hopes to collectroyaltiesfrom company functions which usecopyright music. [emphasis added] (4) Was COMPASS’ website misleading? 74 GV refers to a printout of COMPASS’ website dated 10 January 1998,35Foot Note 35×Ms Cheo’s AEIC at pp 60-72.but that was after the Licence had been entered into, and there was no evidence as to what the contents of COMPASS’ website were up to the point the Licence was entered into. In any event, the contents of COMPASS’ website (as at 10 January 1998) do not assist GV. For instance: (a) “COMPASS is a non-profit public company which administers the public performance, broadcast, diffusion and reproduction rights in music and musical associated literary works on behalf of its members. … the society has established a licensing department to ensure that members are duly compensated, in the form of royalties, for use of their material.”36Foot Note 36×Ms Cheo’s AEIC at p 60.Clearly, COMPASS did not claim to be some governmental organisation - it collected royalties (not some tax), and it did not purport to act for non-members. (b) “COMPASS administers the works of more than a million composers, lyricists and publishers world wide and controls more than 13 million musical works, which representsalmostall copyright musical works in the world.” [emphasis added].37Foot Note 37×Ms Cheo’s AEIC at p 60.Again, COMPASS did not claim to have the right to all copyrighted musical works - it made it clear that it did not. (c) “Generally speaking, the copyright of a musical work does not expire until 50 years after the end of the calendar year in which the writer of the work died.”38Foot Note 38×Ms Cheo’s AEIC at p 61.COMPASS did not say that copyright still subsisted in all musical works. In fact, it recognised that copyright has a time limit. (d) COMPASS stated the eligibility criteria to become a member of COMPASS,39Foot Note 39×Ms Cheo’s AEIC at p 63.and that there would be an assignment of rights by its members to COMPASS.40Foot Note 40×Ms Cheo’s AEIC at p 65.This indicated that if a local composer did not become a COMPASS member, or did not assign any rights to COMPASS, he would retain his copyright. Again, COMPASS did not claim that it had the right to the copyright in all musical works – it recognised that it did not. (e) The Frequently Asked Questions section41Foot Note 41×Ms Cheo’s AEIC at pp 66 and 69.referred to COMPASS’ repertoire and those of its affiliates (“the FAQ section”). In the FAQ section, COMPASS did not claim that it had an all-encompassing repertoire (even taken together with that of its affiliates). It recognised that only the copyright in members’ works – that had been assigned to it – was administered by COMPASS. 75 There is no evidence from those in GV who made the decision to enter into the Licence, that they had seen what was said in the newspaper articles and on COMPASS’ website (as relied on by GV in this suit), or that they had concluded thereby that all musical works were copyrighted and that all such copyright was administered by COMPASS (if indeed they had). As I stated above, I do not admit the hearsay evidence that GV belatedly sought to introduce, of what Ms Cheo’s predecessor or colleagues supposedly told her, and moreover I do not accept Ms Cheo’s evidence on that. 76 In any event, from my review of the coverage in the newspaper articles, and what COMPASS stated on its website (as at 10 January 1998), they do not convey the impression that GV alleges they did. 77 GV thus did not make out its misrepresentation case.",
        "Did GV terminate the Licence with notice?": "78 In view of my findings above, GV was not entitled to terminate the Licence with immediate effect by the 16 June 2016 letter.42Foot Note 42×PCB at pp 24-25.The question remains whether the 16 June 2016 letter had the effect of terminating the Licence with notice. If the 16 June 2016 letter were a termination notice under clause 6 of the Licence, when would the Licence have been terminated? 79 Clause 6 of the Licence stipulated that the Licence would remain in force from year to year until determined by either party giving one calendar month’s previous notice in writing to expire on the 30th day of June in any year.43Foot Note 43×PCB at p 4.The parties are agreed that if the 16 June 2016 letter were a notice under clause 6, the Licence would thereby have been terminated on 30 June 2017. 80 GV says that if the 16 June 2016 letter was not effective in terminating the Licence with immediate effect, it was nevertheless effective in terminating it on 30 June 2017. COMPASS says that by the 16 June 2016 letter, GV was not asking to terminate the Licence at all, and that the Licence is still alive to date. Was the 16 June 2016 letter a termination notice? 81 No particular form or wording is required for a notice of termination. Words like “terminate” or “termination” need not be used so long as “it is clear that the effect of the notice is to terminate the agreement”: seeThe “Chem Orchid”[2014] SGHCR 1 at [65]. Moreover, as held inSintraMerchants Pte Ltd v Brown Noel Trading Pte Ltd (Donald & McArthy Pte Ltd, third party)[1996] 1 SLR(R) 809 at [58]: The valid exercise of a right to terminate is a species of election and a promisee will satisfy the requirement, if by his words or conduct, he makes clear his intention to bring about the termination. In this regard, no particular form is necessary; a written or oral communication so long as the promisee uses a clear expression such as ‘cancel’, ‘rescind’, ‘annul’, ‘off’, ‘at an end’, ‘no longer binding’ … will suffice … 82 The phrase used in paragraph 5 of the 16 June 2016 letter was “cease the current arrangement”. 83 The Exhibitors (including GV) had been paying licence fees to COMPASS based on their gross receipts. In paragraph 2 of the 16 June 2016 letter, the Exhibitors stated that “payment should be based only on such a rate and basis to be agreed upon by all parties, and if ticket takings are relevant, onlynetticket takings (i.e. after deducting the amount of ticket takings due to the film distributors and other relevant taxes such as GST, if any) should be considered” [emphasis in original]. 84 The letter continued as follows (in paragraph 3): “Further as COMPASS does not representallcomposers and authors whose works may be included in the Films, in the interest of transparency and accountability from COMPASS, COMPASS has to show that it is entitled and/or authorised to collect the payments being demanded of the Exhibitors.” [emphasis in original]. 85 In paragraph 4, the Exhibitors then said that, with effect from 1 April 2016, they would each send their programming schedule for the preceding month to COMPASS and COMPASS should then inform each Exhibitor which of those movies (and for which musical works in those movies) COMPASS had the right to collect payment for. The Exhibitors said that they “[would] then make payment accordingly in respect of such [f]ilms based on such rate and other terms to be agreed by all parties.” 86 The letter concluded with paragraph 5: “As such, the Exhibitors will cease the current arrangement of paying COMPASS after the expiry of each quarter based on our gross ticket takings with effect from [1 April 2016].” 87 What was said in the 16 June 2016 letter was fundamentally different from what GV had agreed to in the Licence. 88 GV had contracted to pay licence fees of 0.2% of gross receipts, but by the letter GV said it would no longer do so. In the 16 June 2016 letter, GV said it would not make any payment to COMPASS until and unless COMPASS identified the musical works in the movies GV had screened, for which COMPASS had the right to administer copyright; payment would then be “based on such rate and other terms to be agreed by all parties”. Consistent with that letter, GV paid COMPASS nothing for the period from 1 April 2016 to date. 89 GV followed up on the 16 June 2016 letter by writing to COMPASS on 23 June 2016 with a list of the movies it had screened in April and May 2016, asking to know which of those movies (and for which musical works in those movies) COMPASS had the right to collect payment for (“the 23 June 2016 letter”). In that letter, GV reiterated:44Foot Note 44×PCB at pp 26-28. (a) “[e]xhibitors will then make payment accordingly in respect of such [f]ilms based on such rate and other terms to be agreed by all parties” (which was in paragraph 4 of the 16 June 2016 letter); and (b) “[e]xhibitors will cease the current arrangement of paying COMPASS after the expiry of each quarter based on our gross ticket takings” (which was in paragraph 5 of the 16 June 2016 letter). 90 COMPASS replied to GV on 12 July 2016 (“the 12 July 2016 letter”).45Foot Note 45×PCB at pp 29-31.COMPASS referred to its “extensive repertoire” but acknowledged that its repertoire did not cover all copyrighted musical works. It then said, “although COMPASS is not legally obliged in the agreement to cover for works not found in its repertoire, it has, however, acknowledges [sic] an inclusion of an implied indemnity to its licensees.” COMPASS thus said that “the notion that COMPASS does not represent all composers and authors whose works may be included in the [f]ilms is no longer an issue affecting or vitiating [GV’s] liability on claim against payment”. 91 COMPASS understood that GV’s correspondence indicated that GV intended not to comply with the Licence:46Foot Note 46×PCB at p 29. In your letter, although the rate and terms for the grant of licence have been agreed between your company and COMPASS,you are now indicating your intention of reneging from the performance of your contractual obligation by intending not to comply with the terms of agreementin making payment on works exploited by you, and you require proof of all works performed and exploited by you that belong to the repertoire we administer before you make payment and alluding payment to be pro-rated accordingly. [emphasis added] 92 COMPASS went on to say, “the manner and approach adopted to novate the terms of the existing agreement are deemed unreasonable and it is totally unacceptable to us”.47Foot Note 47×PCB at p 30. 93 COMPASS then warned GV that if GV acted against the terms of the Licence, COMPASS “would have no alternative but to consider such acts as non-compliance of the terms and a breach of the agreement, and COMPASS reserves the right to determine the agreement.”48Foot Note 48×PCB at p 30. 94 COMPASS now argues that GV intended to keep the Licence alive, and that GV was just saying that it would not perform its obligations under the Licence. In other words, GV wanted an ongoing licence of what was in COMPASS’ repertoire; GV just would not pay for it as it had initially contracted to on 22 June 1995. Instead, GV would only pay if COMPASS first identified the movies (and musical works) that COMPASS had the right to collect payment for, and even if COMPASS did so, payment would only be based on such rate and other termsto be agreed. 95 COMPASS says that GV could not have intended to end the Licence with COMPASS, otherwise GV’s continued screening of movies would be in breach of copyright. GV insists that it did intend to terminate the Licence and says that it had accrued moneys to pay the rightful copyright owners when they were ascertained. 96 I find that by the 16 June 2016 letter, which contents were then substantially repeated in the 23 June 2016 letter, GV did express its intention of terminating the Licence, and indeed that is how COMPASS understood the correspondence. 97 At trial, COMPASS’ Mr Tan agreed that GV was saying that it was stopping the arrangement,49Foot Note 49×Transcript, 8 September 2020, p 142 lines 14-17.and that GV was telling COMPASS, “[l]ook, we are no longer looking at the old agreement, we’re looking at the new agreement.”50Foot Note 50×Transcript, 8 September 2020, p 145 lines 4-8. 98 Moreover, when COMPASS’ counsel questioned GV’s CEO, Ms Cheo, about the 12 July 2016 letter, the tenor of that cross-examination was that COMPASS understood that GV was seeking to terminate the contract:51Foot Note 51×Transcript, 10 September 2020, p 144 lines 15-25; p 145 lines 1-2. Q.  Look at paragraph 5 -- sorry, page 30 is the second paragraph. You say: ‘We must draw your management’s attention that the manner and approach adopted to novate the terms of the existing agreement are deemed unreasonable and it is totally unacceptable to us.’ So if the defendant was trying to terminate or act contrary to --basically, the plaintiff is telling the defendant that we do not accept your novating the contract, in other words, terminating the contract. Do you agree with that? A.  Yeah, I think all along, COMPASS has been quite firm in what they want to do. [emphasis added] 99 This goes against COMPASS’ contentions that GV wasnotseeking to terminate the Licence, or that COMPASS never understood that to be the case. 100 In the 16 June 2016 letter and 23 June 2016 letter (“the June 2016 letters”), GV did not merely say that it would ceasepayment, it said that the Exhibitors would “ceasethecurrent arrangementof paying COMPASS … based on our gross ticket takings” [emphasis added].52Foot Note 52×PCB at pp 25-26.I accept that the use of the more general phrase “the current arrangement”, rather than a specific reference to the Licence, was because three of the five Exhibitors did not have written agreements with COMPASS, whereas GV and the remaining Exhibitor did. In relation to GV, “the current arrangement” was the Licence. 101 What happened in June 2016 was not a mere attempt to re-negotiate the licencerate(which GV had unsuccessfully tried to do in 2012, but ultimately continued to pay the licence fee in accordance with the Licence).53Foot Note 53×PCB at p 14.For the period from 1 April 2016 to date, GV stopped payment to COMPASS pending anew agreementas stated in the June 2016 letters. 102 I find that the 16 June 2016 letter was effective as a notice of termination under clause 6 of the Licence, and accordingly that the Licence has been terminated on 30 June 2017.",
        "Relief": "",
        "GV’s counterclaim": "103 In view of my findings above, GV succeeds only in obtaining a declaration that the Licence had been terminated such that 30 June 2017 was the last day on which the Licence was in force.54Foot Note 54×Defence and Counterclaim at p 7. 104 As I have found no breaches or actionable misrepresentation on COMPASS’ part, GV is not entitled to any damages.",
        "COMPASS’ claim": "105 COMPASS sought an order that GV submit its gross receipts from 1 April 2016 to date for computation of the licence fee; that GV be ordered to pay the computed licence fee to COMPASS forthwith; and that GV be ordered to pay late interest at 10% per annum in accordance with clause 3(1) of the Licence (“late payment interest”). 106 By consent, the trial of the suit was bifurcated such that I am only dealing with questions of liability; any issues of quantum are to be separately addressed later. 107 In the circumstances, I order GV to submit to COMPASS GV’s gross receipts from 1 April 2016 to 30 June 2017 for computation of the licence fee for that period. 108 In view of the bifurcation of issues, I do not make any orders in relation to the computation or payment of the licence fee, or late payment interest. If these matters cannot be agreed between the parties, they can be the subject of further proceedings.",
        "Conclusion": "109 For the above reasons: (a) I declare that the Licence has been terminated such that 30 June 2017 was the last day on which the Licence was in force; and (b) I order GV to submit to COMPASS GV’s gross receipts from 1 April 2016 to 30 June 2017 for computation of the licence fee for that period. 110 I will hear the parties on costs and any consequential orders.",
        "Postscript: discussions between witnesses in the course of trial": "111 During the lunch break on 9 September 2020, COMPASS’ Senior Manager of Finance Mr Raymond Tan (who was then in the midst of cross-examination) met with his colleagues Mr Melvin Tan (who had finished giving his evidence) and Mr Lam (who would be the next witness), together with COMPASS’ counsel. Whilst having coffee they were apparently seen, and overheard, by a trainee from GV’s lawyers’ firm – this led to Mr Raymond Tan, and then Mr Lam, being questioned about the coffee session. 112 At the close of the hearing the previous day (8 September 2020) and when the hearing was adjourned for lunch on 9 September 2020, the court had expressly cautioned Mr Raymond Tan that he should not discuss the case with anyone, nor should he discuss his evidence with anyone. Yet, he met with Mr Lam and the others during the lunch break on 9 September 2020. 113 When cross-examination resumed after lunch on 9 September 2020, Mr Raymond Tan initially denied having discussed what had gone on at the trial during the lunch break. He specifically denied having discussed the case with Mr Lam. He claimed he did not say a word to Mr Lam about the evidence in the trial, and that not a single word was discussed about the case.55Foot Note 55×Transcript, 9 September 2020, p 110 lines 11-25; p 111; p 112 lines 1-8. 114 Subsequently, however, Mr Raymond Tan admitted that Mr Lam had asked him: “what was the case, the questions that were being asked … and why is it taking so long”.56Foot Note 56×Transcript, 9 September 2020, p 112 lines 9-25; p 113 lines 1-2.Mr Raymond Tan, however, denied having spoken to Mr Lam about the distribution of royalties (which Mr Raymond Tan had been cross-examined on).57Foot Note 57×Transcript, 9 September 2020, p 113 lines 16-25. 115 When pressed further as to whether he had told Mr Lam, “[w]ith regard to distribution [of royalties], don’t answer”,58Foot Note 58×Transcript, 9 September 2020, p 114 lines 1-3.Mr Raymond Tan finally admitted, “I did say that it was a question that [GV’s counsel]  asked on distribution and I should be the one answering.”59Foot Note 59×Transcript, 9 September 2020, p 114 lines 4-7. 116 Mr Lam then took the stand the same day. Initially, he too denied having discussed the case during the coffee session that lunchtime – he claimed they only spoke about when he would give his evidence, and that Mr Raymond Tan had not said anything to him about the case at all.60Foot Note 60×Transcript, 9 September 2020, p 151 lines 15-25; p 152 lines 1-11. 117 However, when Mr Lam was shown the live trial transcripts of what Mr Raymond Tan had admitted to, he then said, “[t]here was no really specific discussion on what transpired regarding the distribution”,61Foot Note 61×Transcript, 9 September 2020, p 153 line 25; p 154 line 1.“there was no [sic] any specific discussion about the details about distribution, what [evidence] [Mr Raymond Tan] gave regarding distribution”.62Foot Note 62×Transcript, 9 September 2020, p 154 lines 23-25.Mr Lam maintained that they did not “go into details to discuss the case”,63Foot Note 63×Transcript, 9 September 2020, p 155 line 6.and they “specifically didn’t discuss any details about distribution or licensing”.64Foot Note 64×Transcript, 9 September 2020, p 155 lines 13-14. 118 Despite Mr Lam’s attempts to limit the damage, this incident should not have happened. Besides the court’s cautions to Mr Raymond Tan, the Supreme Court’s website states, regarding the responsibilities of witnesses: “Prior to giving evidence, do not discuss the case with anyone who has witnessed the ongoing proceedings (including other witnesses who have already given evidence)” (“Responsibilities of Witnesses” (Supreme Court of Singapore)(accessed 7 January 2021)). 119 It was unwise (to say the least) for COMPASS’ three witnesses to have met for coffee with COMPASS’ counsel, when one witness had finished testifying, a second witness was in the midst of cross-examination, and a third witness had yet to take the stand. It would be all too easy for there to be a discussion about the case, as there was. 120 In the event, this did not affect my findings, which did not turn on the credibility of COMPASS’ witnesses, or the issue of distribution. But such a discussion between a witness who was still testifying, and one who has yet to testify, should not have occurred. Andre ManiamJudicial Commissioner Lee Tau Chye (Lee Brothers) for the plaintiff; Tony Yeo Soo Mong, Rozalynne Asmali and Loo Fang Hui (Drew & Napier LLC) for the defendant.",
        "": ""
    }
}