{
    "case_title": "Yeow Khim Seng MarkvPhan Ying Sheng",
    "ncitation": "[2021] SGHC 145",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Introduction": "1 This is an appeal against the decision of the District Judge, who gave judgment for the plaintiff below (the “respondent”) in her claim for defamation.  The defendant below (the “appellant”) has appealed against almost all the findings of the District Judge, including her award for damages.  The respondent contends that the findings of the District Judge are unimpeachable and that the court should dismiss the appeal. 2 The respondent is a social media content creator in the motorcycling and travel industry.1Foot Note 1×Record of Appeal p 244 at para 4.The appellant is a motorcycle mechanic with 13 years of experience in dealing with motorcycles.2Foot Note 2×Record of Appeal p 599 at para 4. 3 The seed of the dispute between the parties in these proceedings lies in a separate dispute between the respondent and a motorcycle workshop, Revology Bikes Pte Ltd (“Revology”).3Foot Note 3×Record of Appeal p 249 at para 17 to p 255 at para 36.In October 2018, Revology provided and installed a dashboard camera on the respondent’s motorcycle, with the hope that she would review and promote the camera.4Foot Note 4×Record of Appeal p 249 at paras 17–18 and p 3895 line 18 to p 3896 line 22.However, the camera began malfunctioning. On 4 December 2018, the respondent brought her motorcycle to Revology to replace the camera, though ultimately she decided to have it removed entirely.5Foot Note 5×Record of Appeal p 250 at paras 21–22.Shortly after the removal of the camera, the respondent realised that her motorcycle fairings had been damaged.6Foot Note 6×Record of Appeal p 250 at para 22.The respondent filed a claim against Revology with the Small Claims Tribunal (“SCT”) on 21 December 2018 seeking damages,7Foot Note 7×Record of Appeal p 253 at para 29.and was awarded compensatory damages of $4,630 by the SCT on 29 March 2019.8Foot Note 8×Record of Appeal p 255 at para 36. 4 In the midst of this dispute between the respondent and Revology, the respondent published various posts on social media relating her side of the story.9Foot Note 9×Record of Appeal p 251 at para 24 and p 253 at para 30.The appellant responded to one of these posts on Facebook on January 2019, and continued to make posts and communications relating to the matter and to the respondent.10Foot Note 10×Record of Appeal pp 406–408, 412, 457 and 529.Broadly speaking, these posts and communications were sceptical of the respondent’s version of events, and of the respondent’s credentials as a biker. 5 Among these posts and communications, the respondent identified four sets of statements which she alleged were defamatory of her.11Foot Note 11×Record of Appeal p 9 at para 2 to p 14 at para 9.She proceeded with a claim in defamation in the District Courts, seeking general, special and aggravated damages.12Foot Note 12×Record of Appeal pp 7, 8 and 14–19.The appellant denied that the statements were defamatory, while pleading the defence of justification.13Foot Note 13×Record of Appeal p 20 at para 3 to p 24 at para 18.In particular, the appellant argued, notwithstanding the SCT decision in favour of the respondent, that the damage to the respondent’s motorcycle fairings had not in fact been caused by Revology.14Foot Note 14×Record of Appeal p 23 at para 12(5).There was no dispute that the appellant’s posts and communications had been published to a large number of readers, and that the words would be construed by the readers as referring to the respondent.15Foot Note 15×Record of Appeal p 4024 at para 18. 6 The District Judge found,inter alia, that all four sets of statements were defamatory in their ordinary and natural meaning,16Foot Note 16×Record of Appeal p 4024 at para 18 to p 4025 at para 27.and that the appellant had failed to make out his defence of justification.17Foot Note 17×Record of Appeal p 4027 at para 37 to p 4028 at para 43.In coming to her decision, the District Judge found that the extended doctrine ofres judicatabarred the appellant from challenging the findings made in the SCT decision.18Foot Note 18×Record of Appeal p 4027 at para 35–36.The District Judge awarded the respondent general and aggravated damages totalling $60,000, while declining to award special damages.19Foot Note 19×Record of Appeal p 4028 at para 46 to p 4030 at para 52.The District Judge further granted a final injunction ordering the defendant to remove the defamatory statements, and another final injunction prohibiting the defendant from making further publication of similar defamatory remarks or comments regarding the plaintiff.20Foot Note 20×Record of Appeal p 4028 at para 45.",
        "The issues on appeal": "7 There are essentially three broad issues on appeal: (a) The first issue is whether the District Judge was right in concluding that the four sets of statements in question were defamatory of the respondent. (b) The second issue is whether the appellant has made out his defence of justification in relation to all four sets of defamatory statements.  In this regard, one sub-issue here is whether the appellant is barred by the extended doctrine ofres judicatafrom challenging the findings of the SCT that the respondent’s motorcycle’s fairings had been damaged by Revology. (c) The third issue is whether the District Judge’s award of general and aggravated damages totalling $60,000 should be disturbed on appeal. 8 I shall deal with these three broad issues in turn.",
        "Whether the publications are defamatory of the respondent": "9 The appellant challenges the District Judge’s findings that each of the published statements was defamatory of the respondent.  The law in this area is well-settled, and I set out the general principles applicable here. 10 A statement is considered to be defamatory if it tends to (Golden Season Pte Ltd and others v Kairos Singapore Holdings Pte Ltd and another[2015] 2 SLR 751 at [36]): (a) lower the plaintiff in the estimation of right-thinking members of society generally;(b) cause the plaintiff to be shunned or avoided; or(c) expose the plaintiff to hatred, contempt or ridicule. 11 The defamatory nature of a statement may come about in two broad senses, as noted inReview Publishing Co Ltd and another v Lee Hsien Loong and another appeal[2010] 1 SLR 52 at [26]: (a) in their natural and ordinary meaning, which includes any meaning capable of being inferred from the offending words standing on their own in addition to their literal meaning; and(b) in their innuendo meaning,ie, in some other meaning (apart from the natural and ordinary meaning) which, although not defamatory from the viewpoint of the ordinary reasonable person, is nonetheless defamatory from the viewpoint of people with knowledge of the special meaning of the offending words or the relevant extrinsic facts. 12 It is the natural and ordinary meaning of the published statements which takes up most of the appellant’s and the respondent’s submissions.  In construing the natural and ordinary meanings of offending words, the general principles are as follows (Chan Cheng Wah Bernard and others v Koh Sin Chong Freddie and another appeal[2012] 1 SLR 506 (“Bernard Chan”) at [18]): (a) the natural and ordinary meaning of a word is that which is conveyed to an ordinary reasonable person;(b) as the test is objective, the meaning which the defendant intended to convey is irrelevant;(c) the ordinary reasonable reader is not avid for scandal but can read between the lines and draw inferences;(d) where there are a number of possible interpretations, some of which may be non-defamatory, such a reader will not seize on only the defamatory one;(e) the ordinary reasonable reader is treated as having read the publication as a whole in determining its meaning, thus “the bane and the antidote must be taken together”; and(f) the ordinary reasonable reader will take note of the circumstances and manner of the publication. 13 Before I proceed to consider each of the published statements in detail, I note that a common thread of the appellant’s submissions in relation to each set of statements is that the respondent’s reputation had not suffered, as she already had a poor reputation even prior to the making of the statements.  I reject this submission.  As I pointed out to counsel for the appellant during the hearing, the test for defamation is whether a statementtendsto cause the plaintiff’s reputation to be lowered in the eyes of right-thinking members of society generally.  It is not whether the defamatory wordsactuallycaused such lowering.  Words which are defamatory of a person remain as such even if they do not really lower him in the estimation of those to whom the words were uttered:Jeyaretnam Joshua Benjamin v Goh Chok Tong[1983–1984] SLR(R) 745 at [11].",
        "The first set of statements: the January 2019 Facebook statements": "14 From 5 to 9 January 2019, the appellant wrote 4 separate times in the “Comments” section of the respondent’s Facebook page.  These are set out as follows:21Foot Note 21×Record of Appeal pp 161 at para 17 and 406–408. Facebook comment dated 5 January 2019: Right in the first place if you are not socheapskateand still accept the installation of the camera this wouldn’t have happened. Of course the bike shop will refuse to cooperate with your dispute! Pls lah, give you free things still have to let you complain? Eh nabei u can promote whatever bike shop u want but remember whether u are aposer, people all know. Pls don’t expect people to sponsor you and at the end of the day still kah people lanjiao wei. Stop being f*ckingfree loaderand go overboard. You want to maintain your integrity? Pls! Talk to my hand. Did u even mentioned on your blog that it was a sponsored camera in the first place? Lanjiao Lang knn. Facebook comment dated 5 January 2019: you can have thousands of supporters. but your supporters cant repair your bike. looking forward to see her at wicked wallop until she really opens her eyes and realize how many workshops will never want to work with her. Facebook comment dated 7 January 2019: Fion Lim that’s not being an influencer. That’s fucking calledcyber bullying. Facebook comment dated 9 January 2019: Azhar Plemping she already has nowhere to put her face. Don’t be fooled by her following. Her number of dislikes among workshops will surprise you. Her social media conversion rates and her fans does not mostly ride bikes. 41k likes but with such ablack heartjust to prove her so call “justice” and “integrity”. I’ve seen and worked with real female bikers and real influencers who travel the world, aid needy communities and really just immerse themselves in their passion rather than wasting their time on such baseless contents that does not shed a light of their other side. She’s always dying for attention and leverage. Aposerwill always be aposer. [emphasis added] 15 I will refer to these as the first set of statements.  The respondent pleaded a list of meanings in relation to these published words.22Foot Note 22×Record of Appeal p 10 at para 3.These are too long for me to set out, but in summary, they are that: (a) the respondent was a person who took advantage of the generosity of others without giving anything in return;(b) the respondent was a person desperate for attention and leverage over other people, and who had falsified her image as a motorcyclist in order to garner attention;(c) the respondent had engaged in cyber bullying in order to further her interests; and(d) the respondent was a malevolent and malicious person. 16 The District Judge found that the ordinary and natural meanings of the words published were (i) in relation to the words “cheapskate” and “free loader”, that the respondent was a person who did not want to spend unnecessarily and would try to obtain as many things as possible without paying for them;23Foot Note 23×Record of Appeal p 4024 at para 19.(ii) in relation to the word “poser”, that the respondent was a person who was desperate for attention and would portray a false image of herself as a highly experienced or reputed motorcyclist to obtain attention;24Foot Note 24×Record of Appeal p 4025 at para 20.(iii) in relation to the word “cyber bullying”, that the respondent had exerted undue pressure on others to achieve what she wanted;25Foot Note 25×Record of Appeal p 4025 at para 21.and (iv) in relation to the words “black heart”, that the respondent was an evil person with ill intentions.26Foot Note 26×Record of Appeal p 4025 at para 21. 17 Although these meanings differed slightly from what was pleaded by the respondent, the appellant has not taken any issue with this in this appeal.  Instead, the appellant contends that the District Judge erred by failing to understand that many of the words used were colloquialisms and would have been understood by readers of the Facebook page of the respondent differently.  For example, the words “cheapskate” and “free loader” simply meant that the respondent got the dashboard camera from Revology for free.27Foot Note 27×Appellant’s Case at para 13(a)(i).The appellant also argues that his use of the term of “cyber bullying” was simply a factual description which applied to the respondent’s usage of her social media presence to rally support against Revology and to make bare, negative assertions regarding Revology’s mechanic and standard of service.28Foot Note 28×Appellant’s Case at para 13(a)(iii).As for the use of the term “black heart”, the appellant argues that the use of the phrase would have been understood to mean the respondent was cold-hearted and did not consider others’ emotions.29Foot Note 29×Appellant’s Case at para 13(a)(iv).The appellant did not make any submissions about the meaning found by the District Judge in relation to the use of the word “poser” to describe the respondent. 18 There is little doubt in my mind that the appellant’s contentions in relation to the first set of statements are without merit.  The ordinary meaning of the words “cheapskate” and “free loader” is that the respondent is a person who will try to take advantage of others to obtain things for free.  Applying the test described above (at [10]), this is clearly defamatory of the respondent, because it would lower her reputation in the eyes of an ordinary, right-thinking member of society.  I am unable to understand how a colloquial understanding of these words can mean anything else. 19 As for the use of the term “cyber bullying”, I think that the appellant has conflated the question of whether the published words are defamatory with the question of whether he has managed to prove the truth of his statements.  I agree with the District Judge that the use of the words “cyber bullying” to describe the respondent’s actions meant that the respondent was trying to exert undue pressure on Revology using her social media presence to get what she wanted.  That is defamatory of the respondent.  As to whether this imputation is true, that will be considered later when I consider the respondent’s defence of justification. 20 Finally, I find the meaning the appellant suggests as the natural and ordinary meaning for “black heart” to be quite strained.  Instead, I agree with the District Judge that the natural and ordinary meaning of the words is that the respondent is an evil person with ill intentions, and that this meaning is defamatory.  Alternatively, I accept that the respondent has made out its pleaded case that the words “black heart” do bear the higher meaning that the respondent is a malevolent and malicious person.",
        "The second set of statements: the February 2019 Facebook statement": "21 On 27 February 2019, the respondent wrote a long Facebook post, which read as follows:30Foot Note 30×Record of Appeal p 412. ***POST UPDATED*** Facts are facts and lies will be lies. Karma is also real.If you are an active member of the motorcycle community then it is YOU that I need your attention. Before I carry on with this long post and make this an essay. I would like you to take a closer look to our findings and seek clarifications from our dear Vaune Phan. I have come this far and I'm sure the community wants answers. The credit of this video should go to GakiMoto but unfortunately the video was removed one day after Vaune was reportedly seen from her IG at the state courts. Can this be a guilty conscious?! I really wonder the coincidence! But thank God, we have the youtube downloader and managed to screenshot the published date of the video which was uploaded in May 2018. Original video source was from https://www.youtube.com/watch ?v=H1mXMG8rea8&t=136s Vaune Phan accused Revology Bikes of breaking her fairings clip on December when she was being contacted to have her FREE AMACAM camera installed and eventually pursued legal actions to claim the loss of livelihood and income. Demanded compensation but also insisted to maintain her \"integrity\" to the viewers of her blog. Her recent IG post on 3rd February also displayed the same camera which was given to her. Now, my question is this. If it's a faulty camera why are you still using? What really caught me by surprise is this video which I have just reuploaded by GakiMoto. Its an 18 minute video you might not want to waste too much time watching. But let's move to 2:16 to 2:34 You got it? Now.... here's my other questions. 1.) It seem like these are the same set of fairings as the ones that she currently has and the chrome red paint job was done by none other than 7Angelz which I have verified earlier last year. Are they the same ones 2.) How can you not notice that there was already a gap in the fairing for almost 6 months since your first visit to the bike shop to dismantle the front fairings and have the camera installed? 3.) Whose integrity are we questioning right now? 4.) In your blogpost you mentioned \" There were gaps which NEVER existed\" How sure were you? 5.) Why was the YouTube video removed 24 hours after her instastory at the state court quoting \" all prepared for this mornings date\"? For picture reference. Vaune has circled the fairings gaps in purple which was the ENTIRE area and claimed that she has NEVER seen the gaps. Now this is can be a very serious eye sight problem maybe I can refer an optometrist. The other picture reference is zoomed in 2:16 to 2:34 of the video uploaded in May with a similar CHROMIE fairings. I have also confirmed with an authorised Ducati supplier and workshop and they even quoted that replica fairings are very likely to break. To anyone who owns a Panigale be it 899, 1199 or 1299 even. We all know that there is only one hinge which reinforce the fairings together on each side and I even have similar experience with my own bike. So, do we still need answers now? Who is telling the truth and who is lying? Could this trivial issue been avoided? What are your views guys? [emphasis added] The video linked in this post suggests that the gap in the respondent’s motorcycle’s fairings had existed even before she had sent her motorcycle to Revology on 4 December 2018 for the camera to be replaced. 22 In a follow-up comment, the respondent tagged many of the respondent’s sponsors and business partners, along with other motorcycle workshops.31Foot Note 31×Record of Appeal p 413.This meant that these sponsors and business partners would have been specifically alerted to the appellant’s Facebook post. 23 I will refer to this Facebook post and comment as the second set of statements.  The respondent pleaded that the words published mean,inter alia, that she had lied in the SCT proceedings that the damage to her motorcycle was caused by Revology, and that she was therefore an untrustworthy and deceitful person.32Foot Note 32×Record of Appeal p 12 at para 5. 24 The District Judge, considering the allegation in the Facebook post that the gaps had been there for almost six months prior to the installation of the camera, together with the appellant’s use of the words “facts”, “lies” and “karma”, found that the ordinary and natural meaning of the second set of statements was that the respondent was a liar.33Foot Note 33×Record of Appeal p 4025 at paras 22–23. 25 In this appeal, the appellant contends that what the words published by him on 27 February 2019 mean is that there is a question mark over whether the respondent had lied in the SCT proceedings, given the video evidence from May 2018.34Foot Note 34×Appellant’s Case at para 13(b)(ii).The appellant also submits that it would be an “unjustifiable exaggeration” to find that he meant that the respondent was a liar.35Foot Note 35×Appellant’s Case at para 13(b)(ii). 26 At the oral hearing of the appeal, the appellant also attempted to argue that all he was referring to was that the respondent had lied about there being no gap between the fairings and the body of the motorcycle before she sent the motorcycle to Revology on 4 December 2018.  The words in the second set of statements did not mean that he was accusing the respondent of falsely claiming that Revology had damaged her motorcycle’s fairings. 27 In my judgment, it is quite clear that the thrust of what was being conveyed to an ordinary, reasonable reader would have been that, in light of the linked video evidence of the state of the respondent’s motorcycle in May 2018, she had clearly lied in her blogpost concerning Revology having damaged her motorcycle’s fairings, and that she had lied in the SCT proceedings in order to get Revology to pay for damage which she knew was not caused by them.  While it is true that the appellant had posed a series of questions about the respondent’s complaint against Revology, the clear suggestion is that the respondent had made up this complaint, when she knew the damage to her motorcycle fairings already existed even before she had sent the motorcycle to Revology on 4 December 2018.  This is clear from the sarcastic reference to the respondent’s “very serious eye sight problem” for claiming to have not seen the gap in the motorcycle’s fairings until the visit to Revology on 4 December 2018, and the words “lies will be lies” and “[k]arma is also real”.  It is in this context that the questions posed by the respondent must be read in order to ascertain the meaning to be attributed to the words published. 28 I did not accept the point made by the appellant that he was only referring to the fact that the respondent had lied about there not being a pre-existing gap between the motorcycle fairings and its body, and not about any damage to the fairings caused by Revology.  This was an untenable argument given that his Facebook post actually states “[the respondent] accused Revology Bikes of breaking her fairings clip on December”, before referring to the specific parts of the video which he claims shows that the gap was already present.  This obviously was intended to convey the point that the presence of the gap prior to 4 December 2018 shows that the motorcycle fairings were already damaged by then.  This is also made clear by his statement towards the end of his post where he states: “I have also confirmed with an authorised Ducati supplier and workshop and they even quoted that replica fairings are very likely to break”.  To my mind, this reference to the respondent’s motorcycle’s fairings being likely to break is a clear indication that the appellant was referring to the damage to the fairings and not just the gap that existed before the motorcycle was sent to Revology on 4 December 2018. 29 Thus, I find that the District Judge was entirely correct in deciding that the second set of statements conveyed the meaning that the respondent was a liar.  This is clearly defamatory of the respondent.",
        "The third set of statements: the March 2019 WhatsApp statement": "30 The appellant is a member of a WhatsApp chat group, which according to his own evidence has approximately 100 members, who are all motorcycling enthusiasts.36Foot Note 36×Record of Appeal p 3975 line 9 to p 3976 line 8.Sometime in March 2019, the appellant sent a message to the chat group, containing a link to his Facebook post of 27 February 2019, and which stated:37Foot Note 37×Record of Appeal p 457. Vauhne Phancheatingah? [laughing face emoji] Karma coming soon https://www.facebook.com/508509211/posts/10156072425494212?sfns=mo [emphasis added] 31 I shall refer to this as the third set of statements, or the WhatsApp group message.  The respondent pleaded that what this message meant was that she had committed the offence of cheating, and was deserving of punishment.38Foot Note 38×Record of Appeal p 13 at para 7.The District Judge accepted that the words used bore the respondent’s pleaded meaning and that this was defamatory of the respondent.39Foot Note 39×Record of Appeal p 4025 at para 24. 32 The appellant argues before me that the WhatsApp message was sent to an audience of “local bikers”, who are not “academics or legal professionals”.  They would understand the word “cheating” to mean colloquially someone who was not being truthful.40Foot Note 40×Appellant’s Case at para 13(c)(i).The appellant also argues that the use of the Singlish term “ah?”, following the word “cheating”, would convey to the readers that this meant that he was only questioning whether what the respondent claimed against Revology in the SCT proceedings was true, rather than asserting that the respondent had definitely lied.41Foot Note 41×Appellant’s Case at para 13(c)(ii) and (iii).Further, the appellant argues that the laughing face emoji that appears after the statement about cheating downplays the seriousness of the statement.42Foot Note 42×Appellant’s Case at para 13(c)(iv). 33 I am unable to accept these contentions.  As already mentioned, the test for the meaning to be ascribed to an alleged defamatory statement is an objective one.  An ordinary, reasonable reader would read the WhatsApp message, together with the link to the longer Facebook post of 27 February 2019, as conveying the meaning that the respondent is a cheat, and that she had cheated by making a false claim to the SCT that Revology had damaged her motorcycle’s fairings.  I do not agree that the use of the word “ah?” or the laughing face emoji would somehow transform the meaning to a less serious one, or would render the allegation no longer defamatory.  I do not accept that the use of the word “ah” has a specific meaning in Singlish, as contended by the appellant.  Neither do I accept that the use of the laughing face emoji can somehow be a salve to remove the sting of the defamatory allegation.  More significantly, the link that was provided in the WhatsApp group message to the appellant’s Facebook post,iethe second set of statements, which would provide the reader a detailed account of why the respondent is alleged to be dishonest, shows that this was not meant to be a light-hearted joke by the appellant.  In fact, by using the words “[k]arma coming soon”, the appellant was in fact suggesting that the respondent would soon be punished for her dishonesty.",
        "The fourth set of statements: the May 2019 Facebook statements": "34 On 22 May 2019, the appellant, using an account named “Singapore Team Tmax”, commented on an advertisement featuring the respondent which was posted on Samsung’s Facebook page:43Foot Note 43×Record of Appeal p 529. Dear Samsung, I hope you start to take this more seriously and do some homework and fact finding before hiring an influencer. The biking community is very small in SG. Take a trip down to Ulu Chou dirt park and you will have plenty of capable young men/women who can show you what dirt biking means. 35 I will refer to this as the fourth set of statements.  The respondent pleaded that these statements meant she was an incompetent motorcyclist, that she was not capable of being a serious representative of Samsung, and that she was undesirable as a social media influencer to represent Samsung.44Foot Note 44×Record of Appeal p 14 at para 9.The District Judge found that the statements published on 22 May 2019 bore the meaning that the respondent was not worthy of being featured in the Samsung advertisement.45Foot Note 45×Record of Appeal p 4025 at para 26. 36 On appeal, the appellant contends that the meaning that the words convey is simply that there is great talent that exists in the Singapore biking scene, and that it is not a statement about the lack of talent of the respondent.46Foot Note 46×Appellant’s Case at para 13(d)(i).The appellant also points out that he did not make any disparaging or negative comments about the respondent, when he was making this comment about the availability of other capable bikers.47Foot Note 47×Appellant’s Case at para 13(d)(ii).The appellant also points out that, during cross-examination, when questioned about her ability in dirt-biking, the respondent had admitted that there were better dirt-bikers than her in Singapore.48Foot Note 48×Appellant’s Case at paras 38–39; Record of Appeal p 3719 lines 26–28. 37 I accept the arguments raised by the appellant in this respect.  When one examines the words used by the appellant in his 22 May 2019 comment on the Samsung Facebook page, it is clear that he was merely expressing the view that there are other motorcyclists that Samsung should have considered, who may not be social media influencers.  His point is that, if Samsung had done more research and checked with people in the “biking community”, they would have found out about other capable young men and women motorcyclists in Singapore.  That would be the natural and ordinary meaning of the words that he had used.  I do not think that the District Judge was correct in concluding that the meaning of the words was that the respondent was “not worthy” of being featured in the Samsung advertisement.  I find that the words used do not denigrate the respondent in this manner, but instead convey the view that there are other bikers that may be also worthy of consideration, if only Samsung had done their research. 38 At the oral hearing for the appeal, the respondent suggested that the phrases “I hope you start to take this more seriously” and “do some homework and fact finding before hiring an influencer” contained a certain venom and sting, and that the appellant’s comment was actually a “put down” of the respondent.  While I agree that the words used by the appellant were rather blunt and quite confrontational, I do not think that the overall meaning being conveyed is the one found by the District Judge, which is that the respondent is “not worthy” of being featured in the Samsung advertisement.  Rather, as already mentioned, the point that is conveyed is that there are other bikers who may be better representatives for Samsung. 39 In the alternative, the respondent had pleaded at first instance that the fourth set of statements was defamatory by way of innuendo.49Foot Note 49×Record of Appeal p 14 at para 9.This argument was not pursued in written submissions before me.  However, counsel for the respondent revived this contention during the hearing before me. 40 A plaintiff who alleges innuendo bears the burden of proving the following elements (Lim Eng Hock Peter v Lin Jian Wei and another[2009] 2 SLR(R) 1004 at [106]): (a) there are facts extrinsic to the words, where such facts give rise to a defamatory imputation;(b) those facts were known to one or more of the persons to whom the words were published; and(c) knowledge of those extrinsic facts could cause the words to convey the defamatory imputation on which the plaintiff relies, to a reasonable person possessing knowledge of those extrinsic facts. 41 The lateness of the respondent’s contention aside, I was not persuaded that the fourth set of statements constituted an innuendo.  Even in its pleadings and submissions at first instance, the respondent’s arguments in relation to innuendo failed to identify any pertinent extrinsic facts.  For instance, in its closing submissions at first instance, the respondent suggested that:50Foot Note 50×Record of Appeal p 1402 at para 69.1.4. By way of innuendo, the 4th Defamatory Statement as a whole suggests that there are many other capable people Samsung could have engaged “who can show you what dirt biking means”. This implies that the Plaintiff is not a capable and competent dirt biker, and that Samsung had erred by engaging the Plaintiff instead of others who are better riders and can better represent the biking community and/or Samsung. 42 The reasoning here does not refer to any extrinsic facts; instead, it is solely and inescapably rooted in the words of the fourth set of statements themselves.  It is an inference from the words published, which is often described as a “false innuendo”.  That argument is ultimately no different from one based on the natural and ordinary meaning of the words used, because such would include inferential meanings.  The respondent did not draw my attention to any extrinsic facts at the hearing before me either.  In my view, without identifying any such extrinsic facts, the argument that the fourth set of statements was defamatory by innuendo fails at the first hurdle. 43 For these reasons, I find that the meaning ascribed by the District Judge to the fourth set of statements is not borne out by the words used, whether by the ordinary meaning of the words or by innuendo.  In fact, none of the meanings pleaded by the respondent in relation to the fourth set of statements are made out.  The statements do not describe the respondent as an incompetent motorcyclist, or that she was not capable of being a serious representative for Samsung, or that she was an undesirable as a social media influencer to represent Samsung.  All these pleaded meanings are strained and unnatural readings of the words actually used by the appellant.",
        "The defence of justification": "44 I turn next to consider the appellant’s pleaded case of justification, and his appeal against the findings of the District Judge that the defamatory statements were not justified.  In this regard, I will consider only whether the appellant has justified the first three sets of defamatory statements.  Given my finding that the fourth set of statements is not defamatory, there is no need for me to consider any defences in relation to those statements. 45 For the defence of justification to succeed, a defendant need only prove that the “sting” of a defamatory statement is true or substantially true:Bernard Chanat [43]–[44].  It is also well-established that the burden is on the defendant pleading justification as a defence to prove that the sting of the defamatory statements is true:Bernard Chanat [43]. 46 It follows from my analysis of the first set of statements above that the stings of the libel therein are that (i) the respondent was trying to take advantage of Revology by taking the camera from them without paying for it (the “first sting”); and (ii) she used her position as a social media influencer to unfairly pressure Revology to get what she wanted (the “second sting”). 47 As for the second and third set of statements, the sting of the libel is that the respondent made a false claim in the SCT proceedings that Revology had damaged her motorcycle’s fairings, when she knew in fact that the damage already existed before she sent the motorcycle to Revology on 4 December 2018 for the camera to be removed and reinstalled (“the third sting”). 48 I will consider whether each of the three stings have been justified by the appellant on the evidence before the court.",
        "The first sting": "49 The appellant argues that he is justified in describing the respondent as a “free loader” and a “cheapskate” because other Internet users have used these words to describe her as well.51Foot Note 51×Appellant’s Case at para 27.He says that the respondent has removed her review of the camera, but her blogpost about her experience with Revology remains online.52Foot Note 52×Appellant’s Case at para 24(a)(ii).Significantly, according to the appellant, the respondent has not returned the camera, even though she complained that it was not working well.53Foot Note 53×Appellant’s Case at para 24(a)(iii).The appellant also points to the fact that the negative publicity caused by the respondent has caused damage to the business interests of Revology.54Foot Note 54×Appellant’s Case at para 24(d)(i). 50 I fail to see how the fact that there may be other people that have called the respondent a “free loader” and/or “cheapskate” on the Internet can in any way justify the first sting.  That does not follow as a matter of evidence, or even logic. 51 Also, the evidence before the District Judge was that the respondent had not solicited the free gift of the camera from Revology.  Rather, she was approached by Revology, who made a gift of the camera to her.  Mr Darren Sim, a director of the Revology, gave evidence that they did not ask for anything in return from the respondent for the gift of the camera,55Foot Note 55×Record of Appeal p 3893 lines 26–31.but he hoped that the respondent would help publicise the camera through her social media postings.56Foot Note 56×Record of Appeal p 3896 lines 14–22.I find that the District Judge was quite right in coming to the finding that the respondent was expected, though not obliged, to make a social media post to review the camera that Revology had sent her.57Foot Note 57×Record of Appeal p 4027 at para 38.Pursuant to this, the respondent did use the camera, and she did make a social media post where she reviewed the camera that had been gifted to her.58Foot Note 58×Record of Appeal pp 346–348.It was also the undisputed evidence of the respondent that Revology never asked her to return the camera, or raised any issue about her keeping the camera.59Foot Note 59×Record of Appeal p 3771 line 20 to p 3772 line 10 and p 3774 lines 12–25.Further, Mr Sim testified, under cross-examination, that he did not consider the respondent to be a “cheapskate” or a “free loader”.60Foot Note 60×Record of Appeal p 3899 lines 7–19.I also find that the respondent was perfectly entitled to keep her blogpost about her unhappy experience with Revology online.  If there was anything untruthful about what she said that damaged Revology’s business, this could have been taken up by Revology in separate proceedings. 52 Given the state of the evidence, I reject the appellant’s contention that the District Judge had erred in finding that he had not proven the first sting.",
        "The second sting": "53 The appellant argues that the second sting is justified because the respondent had made a social media posting about her unhappy experience with Revology, and that she had done this to put pressure on Revology to give in to her demands.61Foot Note 61×Appellant’s Case at paras 13(a)(iii) and 24(d).According to the appellant, this was “cyber bullying” by the respondent. 54 The District Judge found that the respondent was simply describing her experience with Revology in her blogpost.62Foot Note 62×Record of Appeal p 4027 at para 39.There was nothing wrong with the respondent describing the SCT ruling against Revology in her post.  Even if the post had the effect of pressuring Revology to resolve the dispute with the respondent, that cannot amount to any illegitimate pressure or “bullying”, if what was stated in the post was actually accurate.  Also, the language used in the respondent’s post was not intemperate, nor did she exaggerate any details in the incident.  I can find no error in this finding by the District Judge, and the appellant’s submissions in this regard are simply without any merit. 55 As such, I find that the appellant has failed to show that the District Judge had erred in finding that he had failed to justify the second sting.",
        "The third sting": "56 This sting concerns the allegation that since the respondent’s motorcycle’s fairings had already been damaged, the respondent had in fact lied in her blogpost and in the SCT proceedings when she claimed that Revology had caused the damage to her motorcycle’s fairings.  In this regard, the respondent pointed out that she had succeeded in her claim against Revology in the SCT proceedings, and the SCT had ordered Revology to compensate her in the sum of $4,630 for the replacement of the damaged fairings and the repair of the motorcycle.  As such, the respondent contended that the doctrine ofres judicata, in its extended form, would prevent the appellant from challenging the SCT’s findings.  The District Judge accepted this argument and found that it was not open to her to examine the SCT’s decision and its findings of fact.63Foot Note 63×Record of Appeal p 4027 at para 36. Res judicata and the SCT’s decision 57 The law as to the doctrine ofres judicatais well established.  The doctrine includes the distinct but interrelated principles of cause of action estoppel, issue estoppel and the extended doctrine ofres judicata(The Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 at [98]–[102]): (a) Cause of action estoppel prevents a party from asserting or denying against the other party the existence of a particular cause of action which has already been determined by a court of competent jurisdiction in previous litigation between the same parties. (b) Issue estoppel arises when a court of competent jurisdiction has determined some question of fact or law, either in the course of the same litigation (for example, as a preliminary point) or in other litigation which raises the same point between the same parties. (c) The extended doctrine ofres judicata(also referred to as the doctrine of abuse of process, or the rule inHenderson v Henderson(1843) 3 Hare 100; 67 ER 313) extends cause of action estoppel and issue estoppel beyond cases where the point sought to be argued in later proceedings had actually and already been decided by a court in earlier proceedings between the same parties, to cases where the point was not previously decided because it was not raised in the earlier proceedings even though it could and should have been raised in those proceedings. 58 Although the respondent had initially relied upon both issue estoppel and the extended doctrine ofres judicatain the proceedings below,64Foot Note 64×Record of Appeal p 1245 at para 29 to p 1252 at para 36.by the time of closing submissions it had come to rely only on the latter.65Foot Note 65×Record of Appeal p 1408 at para 79 to p 1416 at para 86.Similarly, in this appeal, the respondent is relying only on the extended doctrine ofres judicata.66Foot Note 66×Respondent’s Case at paras 29–32; Respondent’s Skeletal Arguments at paras 17–19. 59 In relation to the extended doctrine ofres judicata,Humpuss Sea Transport Pte Ltd (in compulsory liquidation) v PT Humpuss Intermoda Transportasi TBK and another[2016] 5 SLR 1322 (at [61]) andLim Geok Lin Andy v Yap Jin Meng Bryan and another appeal[2017] 2 SLR 760 (“Andy Lim”) (at [43]) have noted that it is not strictly necessary for the parties in the earlier proceedings to be identical to those in the later proceedings. Instead, the extended doctrine ofres judicatais applicable where some connection can be shown between the party seeking to relitigate the issue and the earlier proceeding where that essential issue was litigated, which would make it unjust to allow that party to reopen the issue:Andy Limat [44]. 60 I am unable to agree with the District Judge’s decision that the extended doctrine ofres judicatais applicable, and prevents the appellant from trying to prove that he was justified in making his allegation that the respondent had made a false claim against Revology.  First of all, the appellant was neither a party to the SCT proceedings nor a privy of Revology.  To put it simply, there is no connection between the appellant and the SCT proceedings which would make it unjust for him to reopen the issue of the respondent’s claim against Revology. 61 Further, taking a step back and considering the issue as a matter of principle, theraison d’êtreof the extended doctrine ofres judicatais the prevention of multiplicity of litigation so as to ensure that justice is achieved for all:Andy Limat [44].  But it cannot be said that this principle has any role to play in the present proceedings.  The appellant has not been harassing or vexing the respondent with multiple suits.  He was merely attempting to prove in these defamation proceedings brought against him that there was some justification for his defamatory statements.  He was defending himself by trying to show that it is true that the respondent had made a false claim against Revology that they had damaged her motorcycle’s fairings.  His conduct cannot be described as an abuse of process, given that he was never a part of the SCT proceedings.  Given the circumstances, I find that extended doctrine ofres judicatahas no application at all. 62 In my judgment, the District Judge erred in failing to consider and analyse the evidence in relation to whether it was in fact true that the respondent’s motorcycle’s fairings were indeed already damaged before she sent her motorcycle to Revology on 4 December 2018.  It is to this issue that I now turn. The evidence as to the damaged motorcycle fairings 63 There is no dispute between the parties that the respondent’s motorcycle’s fairings were damaged in that the catches of the fairings were broken.  These catches are beneath the exterior of the fairings, and they keep the fairings attached to the body of the motorcycle.  The main issue in contention is whether it was Revology which caused the damage.  In this regard, the main plank of the appellant’s arguments is a video uploaded on YouTube in or around May 2018 by a user named “GakiMoto”,67Foot Note 67×Record of Appeal p 23 at para 12(5).which shows the respondent’s motorcycle and its fairings.  The appellant points to the fact that, if one examines the video carefully, one can see that there is a gap between the fairings and the motorcycle’s body.  According to the appellant, this gap indicates that the catches of the fairings were already broken at that time,ieMay 2018.  This means that Revology could not have been responsible for the damage to the motorcycle’s fairings on 4 December 2018.68Foot Note 68×Appellant’s Case at para 24(b). 64 To support his contention that the pre-existing gap in the fairings indicates that their clips or catches were already broken, the appellant relies on the evidence of Mr Darren Sim (“Mr Sim”), a director of Revology, who was called to give evidence by the defence.69Foot Note 69×Appellant’s Case at para 24(b)(iii).I noted that Mr Sim’s affidavit of evidence-in-chief was silent on this point about the gap in the motorcycle’s fairings, and the broken catches.  It was only when Mr Sim was cross-examined that he raised this point about the gap indicating that the fairings’ catches were already broken.70Foot Note 70×Record of Appeal p 3910 lines 17–21.I found this to be rather unsatisfactory.  Since this was a critical part of the appellant’s case, in that he had to prove that Revology did not damage the respondent’s motorcycle’s fairings, this point should have been clearly set out in Mr Sim’s affidavit of evidence-in-chief, and not just raised only during the course of his oral evidence.  As a result of this, one could fairly say that the respondent was taken by surprise by this evidence, and that she did not have an opportunity to fully deal with this evidence by calling,eg, an expert witness to deal with the question of whether the existence of a gap between her fairings in May 2018 meant that the catches of the fairings were already broken by then. 65 There is an even greater difficulty faced by the appellant in terms of the evidence on this issue.  I reviewed the cross-examination of the respondent conducted by counsel for the appellant.  I noted that the respondent was cross-examined on the video of May 2018 and the gap was pointed out to her.71Foot Note 71×Record of Appeal pp 3809–3812.The respondent’s explanation that there might have been a small gap between her motorcycle’s fairings, but it was hardly noticeable.72Foot Note 72×Record of Appeal p 3815 line 12 to p 3816 line 4.The small size of the gap is borne out by a screenshot of the video that was tendered in evidence.73Foot Note 73×Record of Appeal p 835.She explained that her motorcycle was not fitted with original Ducati fairings, but with China-made replica fairings which she had purchased from a local dealer.74Foot Note 74×Record of Appeal p 3799 line 22 to p 3800 line 2 and p 3802 lines 15–17..Given that they were not original Ducati fairings, they did not fit her Ducati motorcycle perfectly, and there were some small gaps between the fairings.75Foot Note 75×Record of Appeal p 3815 line 29 to p 3816 line 4. 66 According to the respondent, after she sent her motorcycle to Revology for them to remove and reinstall the dashboard camera, when she got her motorcycle back, she immediately noticed the fairly large gaps between her fairings.  These gaps were a lot more obvious than before and the fairings appeared misaligned.76Foot Note 76×Record of Appeal pp 250–251 at para 22 and p 3816 lines 1–4.She then contacted Revology the next day, 5 December 2018, and sent them photographs of the gaps between her fairings.77Foot Note 77×Record of Appeal pp 355–357.When one examines the photographs of the gaps,78Foot Note 78×Record of Appeal pp 835, 849.it is quite clear, even to the untrained eye, that the gaps were significantly larger than what was shown in the screenshot from the video in May 2018.  The respondent then found out from her regular mechanic, Bikeworkz Pte Ltd, on 7 December 2018 that the catches of her fairings had been broken.79Foot Note 79×Record of Appeal pp 251–252 at para 25. 67 Critically, I noted from the transcript of the respondent’s cross-examination that the appellant’s counsel never put the following points to her.  First, that the small pre-existing gaps in her replica motorcycle fairings was not caused their poor fitting, but because the catches of the fairings were already broken, even before she sent the motorcycle to Revology on 5 December 2018.  Second, that the respondentknewabout the pre-existing damage to the catches of her motorcycle’s fairings, but she still proceeded toknowinglymake a false claim against Revology that they were responsible for the damage. 68 In my judgment, the appellant has failed to fully appreciate the import of the third sting, which is found in the second and third set of defamatory statements.  The sting is that the respondent hadcheatedRevology by making a false claim in the SCT proceedings that Revology had damaged her motorcycle, when she knew that they had not done so.  This is a serious allegation.  To succeed in the justification of this sting, the appellant must show that (i) it is indeed the case that the motorcycle’s fairings’ catches were already damaged before the motorcycle was sent to Revology on 4 December 2018, and (ii) the respondent knew that this damage was pre-existing, but proceeded to make a claim that was false.  Yet, neither of these critical points were put to the respondent when she was under cross-examination.  The issue here is the rule inBrowne v Dunn(1893) 6 R 67, the effect of which was aptly summed up inHong Leong Singapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 at [42]: … where a submission is going to be made about a witness or the evidence given by the witness which is of such a nature and of such importance that it ought fairly to have been put to the witness to give him the opportunity to meet that submission, to counter it or to explain himself, then if it has not been so put, the party concerned will not be allowed to make that submission. 69 It is clear that the allegation of cheating is precisely of such seriousness and importance that it needed, in the name of fairness, to have been put to the respondent if the appellant wished to persist in making it.  In this case, the respondent never had a chance to respond in her oral evidence to this allegation against her.  That being the case, I cannot fathom how the appellant expects this Court to come to a finding on the evidence that the respondent was indeed out to cheat Revology in her claim against them in the SCT proceedings. 70 In addition, I do not think that the appellant has satisfactorily dealt with another critical piece of evidence in relation to an admission by Revology that they were responsible for the damage to the respondent’s motorcycle.  Let me explain. 71 On 5 December 2018, the respondent had contacted Mr Sim of Revology and informed him of the damage to her motorcycle’s fairings.  Photographs of the gaps between the fairings were sent to Mr Sim.  On 7 December 2018, the respondent received a WhatsApp message from one Jerome Lee (“Mr Lee”), another director of Revology.80Foot Note 80×Record of Appeal p 888.He stated as follows: Dear Vaune, This is Jerome from Revology. I am one of the partners there and happen to be Winson’s cousin. I deeply apologise for the incident that occurred due to my staff’s negligence. I regret not looking into the matter earlier where my staffs lapse in addressing the issue to you and has led to this outcome. My mechanic has since tendered resignation on his own accord. With regards to your losses, I have contacted Hidayat and Ash. If you would wish to, we can arrange to order a brand new set of fairings which will take around 4 weeks and we have also checked a slot with Ash in January upon the shipment arrival. If you would like to have a different paintwork, we can arrange it as well. Once again, I deeply apologise for the inconvenience and distress caused. Let me know how we can resolve this amiably, I am contactable via this number directly. 72 In my view, it is quite clear that some form of internal review and discussion had taken place at Revology before this message was sent.  This was a director of Revology apologising for “the incident that occurred due to my staff’s negligence”.  Mr Lee also offered to arrange for an order of a brand-new set of fairings as a replacement. 73 Then, on 8 December 2018, Mr Lee sent another WhatsApp message to the respondent, which stated as follows: Dear Vaune, The management of Revology Bikes has reached a consensus in good faith to offer the following on our costs: •  A brand-new set of aftermarket coverset from ‘Yatz Industries’ •  A $2500 paintwork job at ‘7 Angelz Automotive Workshop’ for the above mention •  One-time installation at your preferred workshop, Bikeworkz •  One-time cash compensation of Singapore Dollars, $500 for estimated downtime and loss of transport On the acceptance of the offer, we request that you end the turmoil which viral across all social media platforms in the specific manner of: •  Remove all posts containing and/or relating to ‘Revology Bikes’ across your social media platforms •  Conclude the current commotion with a new post citing a misunderstanding and/or a miscommunication between us 74 In my view, theprima facieinference that can be drawn from these messages is that Revology had accepted responsibility for the damage to the respondent’s motorcycle’s fairings.  They offered to pay for a replacement set of fairings. 75 The appellant did not call Mr Lee to testify in order to deal with this difficulty in the evidence in relation to his case on justification. Instead, the appellant was content with calling only Mr Sim.  However, Mr Sim’s affidavit of evidence-in-chief was completely silent about these messages sent by Mr Lee.  He did not seek to explain the context of these messages, what Revology had decided, why these messages were sent, and if indeed it was the case that Revology accepted that it was responsible for the damage to the respondent’s motorcycle’s fairings. 76 It was only in his cross-examination that Mr Sim tried to explain Mr Lee’s two WhatsApp messages away.  He claimed that Mr Lee was only apologising for the long four-hour wait that the respondent had to endure while the mechanic was trying to remove and reinstall the camera on the motorcycle and their slow response to her questions.81Foot Note 81×Record of Appeal p 3914 line 18 to p 3915 line 13.Also, he gave evidence that the offer made on 8 December 2018 was purely a goodwill offer by Mr Lee that was without any admission of liability.82Foot Note 82×Record of Appeal p 3916 line 26 to p 3918 line 19.In my judgment, the appellant should have called Mr Lee to give evidence because he was the person who sent the two WhatsApp messages on 7 and 8 December 2018 to the respondent.  It is not satisfactory that Mr Sim was the one who was called to explain what his fellow director had stated.  He may be speculating as to the reasons for Mr Lee’s statements.  Consequently, I gave little weight to Mr Sim’s belated and second-hand explanations. 77 I also find that the respondent has given a clear and cogent explanation as to when she first noticed the gaps in her motorcycle fairings, and how these differed significantly in size from the ones that were pre-existing.  As already mentioned, her evidence is supported by the screenshot from the video taken in May 2018, and the photographs she sent to Mr Sim on 5 December 2018.  The respondent also gave consistent evidence as to how she first came to find out about the damage to her motorcycle’s fairings on 7 December 2018, when she had sent her motorcycle to Bikeworkz to be repaired, which was two days after the first visit to Revology.83Foot Note 83×Record of Appeal pp 251–252 at para 25.This must be compared with the quality of the evidence of the appellant, who had no personal knowledge of what transpired between the respondent and Revology, and whose entire case of justification of the third sting appeared to rest on a video taken in May 2018, which I have already explained does not fully support his allegation that the respondent is a cheat. 78 For the above reasons, I find on the evidence that the appellant has not established his defence of justification in relation to the third sting.",
        "Damages": "79 The District Judge awarded the amount of $40,000 as general damages for the four sets of statements and a further $20,000 as aggravated damages.84Foot Note 84×Record of Appeal p 4029 at paras 47 and 49.The appellant has appealed against these awards, which he describes as excessive and unwarranted. 80 While the appellant’s appeal is against the whole of the District Judge’s decision, and so extends to the final injunctions granted by the District Judge as well, the appellant did not address the final injunctions in either written or oral submissions before me.  In any event, I find that there is no basis to disturb the District Judge’s grant of the final injunctions, save that the injunctions in relation to the fourth set of statements in May 2019 should be set aside, given my finding that those statements are not defamatory of the respondent.  I turn now to address each of the categories of damages in dispute, bearing in mind that damages are awarded to compensate the plaintiff for the injury to his reputation and the hurt to his feelings, and not readily quantifiable by mathematical calculation:Goh Chok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46 at [147].",
        "General damages": "81 The starting point in respect of general damages is my finding that the fourth set of statements is not defamatory of the respondent, which indicates that the award of $40,000 as general damages must be adjusted downwards.  In this regard, the respondent has not cross-appealed on the quantum of general damages she was awarded by the District Judge. 82 In considering the appropriate adjustment, two of the usual factors relevant to the determination of the quantum of general damages (seeLim Eng Hock Peter v Lin Jian Wei and another and another appeal[2010] 4 SLR 357 at [7]) are particularly germane: the position and standing of the plaintiff; and the extent of publication. 83 The appellant argues that the respondent is not a professional, but simply an influencer on social media.85Foot Note 85×Appellant’s Case at para 56(b).Since an influencer on social media can become famous or infamous for reasons that have nothing to do with having a good reputation, the appellant argues that the respondent is not entitled to an award of general damages that is comparable to that for professionals.  I accept this argument as a matter of principle, but I think it does little to help me decide the appropriate quantum of general damages.  Also, the District Judge did not equate the respondent to that of a professional when she decided on the quantum of general damages.  All the District Judge observed was that the respondent was a “professional social media personality with [an] extensive number of followers”.86Foot Note 86×Record of Appeal p 4029 at para 47.I agree with the District Judge that these considerations are not irrelevant in determining the appropriate quantum of general damages. 84 In my view, the respondent’s position as an influencer on social media, with a significant number of followers, makes her position more akin to that of a performing artiste, such as a singer or an actor.  In this regard, I place some weight on the fact that the unchallenged evidence is that the respondent made her living from being an influencer on social media, and that her reputation and “brand” would be important to her, although not in the same way that a doctor’s or lawyer’s reputation would be.  Nonetheless, I do not think that it can be seriously disputed that an influencer’s profile, following, and number and type of sponsorships would all be relevant factors in assessing the appropriate quantum of damages for defamation. 85 A further, more relevant consideration is the extent of the publication of each of the three sets of statements, which is something that the District Judge did not appear to have considered. 86 The first set of statements would have been published to more people than the other two sets of statements.  This is because the first set of statements was published by the appellant on the respondent’s Facebook page, which was publicly available.  Also, the evidence is that the respondent had more than 40,000 followers on her Facebook page at the time when the first set of statements were published.  This number had increased to over 50,000 by the time of the trial.87Foot Note 87×Record of Appeal p 305. 87 The second set of statements was published on the appellant’s Facebook page.  While this was publicly available as well, the appellant has a far more modest audience on Facebook.  The evidence before the court is that his second statement garnered 346 reactions, 575 shares and 125 comments as of 24 March 2020,88Foot Note 88×Record of Appeal p 275 at para 68.which I accept is a rough indicator of the number of persons who would have read his Facebook post. 88 Finally, the appellant pleaded that the third set of statements,iethe WhatsApp message, was sent to a limited audience consisting of one WhatsApp group.89Foot Note 89×Record of Appeal p 22 at para 9.In the hearing, the respondent referred me to the transcript of the trial for an admission by the appellant that he had in fact circulated the WhatsApp message to a wider audience consisting of multiple WhatsApp groups.90Foot Note 90×Record of Appeal p 3974 lines 23–26.However, it is clear from the transcript that the appellant had made an immediate clarification that he had only sent the message to one WhatsApp group consisting of about 100 members.91Foot Note 91×Record of Appeal p 3975 line 9 to p 3976 line 8.While the possibility exists that the message was circulated thereafter by these WhatsApp group members, no evidence of such circulation was tendered before the court.  The respondent also did not make any submissions pertaining to this possibility either before the District Judge or for the appeal.  I therefore find that the number of people who would have seen the third set of statements was about 100. 89 These factors as to the extent of publication did not appear to have been considered by the District Judge.  Taking into account the limited publication in relation to the second and third set of statements, and the fact that I found the fourth set of statements not to be defamatory, I find that the appropriate quantum of damages for the defamatory statements should be adjusted downwards to a figure of $25,000.",
        "Aggravated damages": "90 The appellant argues that the District Judge erred in taking into account documents annexed to the respondent’s closing submissions as “evidence” that the appellant continued to attack the respondent’s reputation, and that this was a factor in the District Judge’s decision to award aggravated damages of $20,000.92Foot Note 92×Appellant’s Case at para 58.These documents were a set of social media posts that were made by the appellant from 12 August 2020 to 2 October 2020,93Foot Note 93×Record of Appeal pp 1460–1476.well after the alleged defamatory statements that were the subject of the suit.  The posts were also not raised during the trial, which took place on 2, 15 and 27 October 2020; nor was there any attempt by the respondent to adduce them in evidence.  It was only at closing submissions that these documents were put before the court.  As such, the appellant did not have the opportunity to address and explain these social media postings. 91 I agree with the appellant that the District Judge erred in this regard.  The key point here is that the relevant facts that are relied on for the claim for aggravated damages must be properly pleaded by the plaintiff.  This is so that the defendant can have a chance to respond and explain why these should not be considered in deciding the question of damages.  In cases where the court decides on liability first, and then orders an assessment of damages, this issue is not so acute because the factors that will be relied on for the appropriate quantum of damages will be fleshed out in the affidavit of evidence-in-chief of the plaintiff in the assessment phase or, at the very least, specifically particularised by the plaintiff in the lead up to the assessment hearing.  However, in this case, I find that the appellant did not have a proper opportunity to respond in his evidence in relation to the social media postings he made from 12 August 2020 to 2 October 2020.  At the very least, the respondent’s counsel should have sought leave from the District Judge to adduce these documents into evidence and cross-examined the appellant on them, if the respondent wanted to rely on these documents for the purposes of submitting that aggravated damages should be ordered.  In this regard, the respondent accepted in the course of the oral submissions before me that the social media postings oughtnotto have been taken into account for the purposes of assessing quantum, but only to show that the appellant’s malice and lack of remorse. 92 However, even if one were to disregard the documents annexed to the respondent’s closing submissions, there are sufficient factors in this case that would warrant an award of aggravated damages. 93 The factors which the court can take into account in deciding whether to award aggravated damages are not in dispute.  These factors were authoritatively set out by the Court of Appeal inArul Chandran v Chew Chin Aik Victor[2001] 1 SLR(R) 86at [55], citingGatley on Libel and Slander(Patrick Milmo & WVH Rogers eds) (Sweet & Maxwell, 9th Ed, 1998) at pp 212–213: The conduct of a defendant which may often be regarded as aggravating the injury to the plaintiff’s feelings so as to support a claim for ‘aggravated’ damages includes a failure to make any or any sufficient apology and withdrawal, a repetition of the libel; conduct calculated to deter the plaintiff from proceeding, persistence by way of a prolonged or hostile cross-examination of the plaintiff …, a plea of justification which is bound to fail; the general conduct either of the preliminaries or of the trial itself calculated to attract wide publicity; and persecution of the plaintiff by other means. 94 Three of these aggravating factors are particularly relevant in the present case: (a) First, the appellant refused to apologise.  This was even though he was aware that the respondent had succeeded in the SCT proceedings against Revology.  At that stage, he should have re-considered his allegations against the respondent. (b) Second, the appellant pursued a hopeless defence of justification.  I find it especially troubling that the appellant did not even adduce any proper evidence to show that the respondent was dishonest; instead, he simply insisted that he was justified in claiming that the respondent was a cheat.  Even if one takes the view that the appellant really believed in the truth of his allegation against the respondent that she had made a false claim against Revology, I find that this belief was not a reasonable one, or one that was grounded on any proper evidential basis.  As such, I find that the plea of justification was unreasonably maintained by the appellant at the trial. (c) Third, I find that the circumstances do demonstrate that the appellant harbours ill-will and feeling towards the respondent.  He was motivated by spite, and a misplaced sense of injustice.  The liberal use of expletives and the derogatory words he used, particularly in relation to the first set of statements, show this quite clearly.  I agree with the District Judge94Foot Note 94×Record of Appeal p 4028 at para 43.that the conduct of the appellant in tagging the respondent’s sponsors and business partners along with other motorcycle workshops in his second set of defamatory statements shows that he was acting maliciously.  There was no conceivable reason for the appellant to have done this, other than the fact that he must have had a dominant motive to damage the respondent.  In short, I find that there is evidence of actual malice on his part. 95 Taking into account all these factors, I find that the appropriate amount of aggravated damages in this case to be the amount of $15,000.",
        "Conclusion": "96   For the reasons set out above, I allow the appeal in part.  The order of damages by the District Judge is varied such that the respondent is awarded a global amount of $40,000, together with statutory interest from the time of the Writ to the date of this judgment. 97 I will deal separately with the issue of costs. Ang Cheng HockJudge of the High Court Luo Ling Ling and Sharifah Nabilah Binte Syed Omar (Luo Ling Ling LLC) for the appellant; Suresh Divyanathan and Cherisse Foo Ling Er (Oon & Bazul LLP) for the respondent."
    }
}