{
    "case_title": "Radha Properties Pte Ltd vLim Poh Suan and others",
    "ncitation": "[2022] SGHC 139",
    "coram": "Chan Seng Onn SJ",
    "sections": {
        "Introduction": "1 The tenant, Radha Properties Pte. Ltd. (the “plaintiff”), applied for an order for specific performance by the landlords, Lim Poh Suan, Ong Chin Tiong and Chong Sian Cheen (collectively the “defendants”) of an option clause in their tenancy agreement to renew the lease of the property at 727 Clementi West Street 2 #01-256 Singapore 120727 (the “premises”) for a further term of five years at S$9,500 per month from 1 May 2022. The plaintiff also sought a declaration that the option clause was valid and binding upon the defendants. 2 I determined that the option clause was not enforceable as parties had not mutually agreed on what the “prevailing market rate” was to be for the monthly rent for the purpose of renewing the lease pursuant to the option clause. 3 The plaintiff appealed and I now give my reasons.",
        "The Option Clause": "4 Clause 12 of the tenancy agreement (the “Option Clause”) provided as follows: If the Tenant desires to have a further tenancy of the said Premises for a further period of five (5) years after the expiration of the said term hereby demised and gives to the Landlord three (3) months’ notice in writing to that effect prior to the expiration of the said term hereby demised then (provided that at the date of the exercise of this Option and at the date of the expiration of the term hereby demised there is no subsisting breach by the Tenant of the covenants and conditions herein contained), the Landlord shall grant to the Tenant a tenancy of the said Premises for a further period of five (5) years commencing on the day following the expiration of the term hereby demised upon the same terms and conditions contained herein (but with the exception of this provision for renewal)ata revised monthly rent payable to the prevailing market rate to be mutually agreed upon. [Emphasis added in italics and bold italics] 5 On 28 January 2022, more than three months prior to the expiration of the lease on 30 April 2022, the plaintiff gave written notice of its exercise of the Option Clause to renew the lease. It was not disputed that there was no subsisting breach by the plaintiff of the covenants and conditions contained in the lease.",
        "No agreement reached for the monthly rent": "6 After an exchange of correspondence in relation to the parties’ respective positions on the “prevailing market rate”, the plaintiff engaged Colliers International Consultancy & Valuation (Singapore) Pte Ltd (“Colliers”) to provide an opinion on the prevailing market rent of the premises in the form of a valuation report. Colliers opined that the “gross monthly rental value of the Property, on standard lease terms and conditions, is in the region of S$9,500/-”. A copy of Colliers’ valuation report dated 25 January 2022 was provided to the defendants. 7 I noted however that Colliers did not say that the prevailing market rent for the premises was a certain and precisely ascertained value of S$9,500 per month. Colliers could only, and rightly so, provide a rough estimate or a broad indication of what the prevailing market rent might be by stating that it was “in theregionof S$9,500/-” [emphasis added]. Accordingly, a range of values for the “prevailing market rate” was possible. 8 I further noted that the phrase “prevailing market rate” was not a term of art with only one specific and precise meaning accepted by professional persons in the property valuation business. There were also many different possible valuation methodologies and processes (eg, whether by a joint valuer, by the average of the valuations from three independent valuers, by an assessment by an agreed arbitrator or by a court of law) by which to determine the “prevailing market rate” and even professional valuers might have differing views of what the “prevailing market rate” might be depending on what valuation methodologies and reference points were adopted. 9 The defendants claimed that they had received an expression of interest of a monthly rental of S$16,000 from their agent’s client. Notwithstanding the parties’ attempts at negotiation, the parties could not agree on the “prevailing market rate” or even the method/process for determining the “prevailing market rate”. 10 Consequently, no agreement was reached for the revised monthly rent to be fixed for the renewal of the lease.",
        "Interpretation of the Option Clause": "11 The main issue in dispute was the proper interpretation of the key words in the Option Clause “prevailing market rate to be mutually agreed upon”. 12 The plaintiff submitted that the Option Clause was not void for uncertainty. The court should give effect to the parties’ intention for the revised monthly rent to be fixed to the prevailing market rate. It should not be made conditional on the parties’ mutual agreement as to the prevailing market rate. In the absence of any machinery in the Option Clause to determine the prevailing market rate, the plaintiff contended that the court ought to provide the machinery to resolve the dispute as to the prevailing market rate. According to the plaintiff, the revised monthly rent should be fixed to the prevailing market rate at S$9,500 per month. 13 The plaintiff referred me toClimax Manufacturing Co Ltd vColles Paragon Converters (S) Pte Ltd[1998] 3 SLR(R) 540 at [26] for the proposition that the court should be reluctant to hold void for uncertainty any contract which was intended to have legal effect and therefore one must approach it with reasonable goodwill when determining whether it embodied such uncertainty of concept as to make it void. The plaintiff submitted that the mere presence of the words “to be agreed” did notipso factomean that no concluded contract was formed as parties might conclude a binding contract even when some terms were not yet agreed between them. The important question was whether, by their words and conduct objectively ascertained, the parties had demonstrated that they intended to be bound despite the unsettled terms. For this, the plaintiff referred me toRudhraMinerals Pte Ltd v MRI Trading Pte Ltd (formerly known as CWT Integrated Services Pte Ltd)[2013] 4 SLR 1023 (“RudhraMinerals”) at [27] to advocate the position that an existing contract is not invalidated unless the failure to reach agreement on terms to be agreed renders the contract as a whole unworkable or void for uncertainty. A term is not uncertain unless there is no objective or reasonable method of ascertaining how the term is to be carried out:RudhraMineralsat [32]. The plaintiff submitted that as long as it was conceptually possible to ascertain the substance of the agreement reached in respect of a clause, there was no uncertainty, and the clause should not be voided simply because its application was of some difficulty:British & Malayan Trustees Ltd vSindo Realty Pte Ltd (in liquidation) and others[1999] 1 SLR(R) 61 at [62]. 14 InMasa-KatsuJapanese Restaurant Pte Ltd v Amara Hotel Properties Pte Ltd[1998] 2 SLR(R) 662 (“Masa-Katsu”), the court had to interpret the following option for renewal clause: The lessors may at the written request of the lessees made not less than three (3) calendar months before the expiration of this lease hereby created and if there shall not at the time of such request and also at the time of expiry of this lease be any existing breach or non-observance of any of the terms conditions and provisions contained herein and on the part of the lessees to be observed or performed at the expense of the lessees renew the lease for a further period of three (3) years from the expiration of this leaseat the prevailing market rental or at the current rental plus 30% whichever is the lower upon the terms and conditions to be agreed. [Emphasis added in italics] 15 The High Court held at [24] that “[t]he rent has been fixed or is ascertainable. The other main terms of the tenancy (for the renewed term), namely, the duration and commencement of the renewed term and the identity of the premises are agreed.” The High Court concluded at [37] that “[w]hat is fair and reasonable in these circumstances can always be determined by judicial process if the parties cannot agree. The lease is most comprehensive in its provisions. The parties clearly intended the option clause to be of legal effect … [T]he option clause is not void for uncertainty.” 16 In my view, the option clause inMasa-Katsuwas very different because the important phrase “to be agreed” qualified only the words “upon the terms and conditions” but not “prevailing market rental”. That phrase “to be agreed” similarly could not possibly qualify the words “the current rental plus 30%” as that was a fixed and determinable number (after performing a simple computation) for which no further agreement of the parties was required for its determination. InMasa-Katsu, the rental was simply to be fixed at the “prevailing market rental” or “the current rental plus 30% whichever is the lower”. Unlike the present case, agreement of the parties was not specified as an essential requirement or an agreed process/methodology for determining the “prevailing market rental” in the option clause inMasa-Katsu. Hence, the fact that the option clause there was held not to be void for uncertainty was not at all helpful to the plaintiff’s case. I distinguishedMasa-Katsu. 17 InBrown v Gould[1972] Ch 53 (“Brown v Gould”), the English Court had to interpret an option to renew clause containing the following language: … such new lease to be for a further term of 21 years at a rent to be fixed having regard to the market value of the premises at the time of exercising this option taking into account to the advantage of the tenant any increased value of such premises attributable to structural improvements made by the tenant during the currency of this present lease … The English Court held (at 339D and 340G) that where the option was expressed to be exercisable at a price to be determined according to some stated formula without any effective machinery being in terms provided for working out that formula, the court had jurisdiction to determine the rent payable. The English Court further held (at p 341) that the option in that case was valid and enforceable since the formula stated did not embody such uncertainty of concept as to make it void or unascertainable by anyone genuinely seeking to discover its meaning. Generally, the court would be reluctant to hold void for uncertainty any provision that was intended to have legal effect. 18 As withMasa-Katsu,Brown v Gouldwas distinguishable. Unlike the present case, the option clause inBrown v Goulddid not contain the phrase “to be mutually agreed upon” qualifying the “rent” to be fixed for the new lease. Since there was no explicit requirement for the rent to be fixed by mutual agreement, in deciding that the court could step in to provide the machinery for fixing the rent, the court did not have to substitute or re-write the bargain between the parties by imposing the judicial process as the new machinery to determine the prevailing market rate for the parties in place of the mutual agreement of the parties. 19 In the present case, both parties had clearly intended mutual agreement to be their chosen methodology/process for determining “the prevailing market rate” for the monthly rental. Until mutual agreement was reached on what would possibly be one of the most essential elements of the clause (ie, the amount for the revised monthly rental for the further lease), the Option Clause was incomplete and hence, the parties had not intended it to come into existence as yet as a valid and enforceable option exercisable by the plaintiff, although other essential elements had been agreed (such as the duration of five years for the further lease and the applicability of the same terms and conditions as the existing lease). Understandably, the parties at the time of signing the lease were able to finalise and set out their agreement on all other aspects of the Option Clause but had, with good reason, deferred the finalisation of the quantum of the revised rent for the lease renewal. They deferred this until nearer the time of the renewal of the lease by making it essentially subject to the mutual agreement of the parties, as it was not practical to foresee what the prevailing market rental would be five years from the time the lease was signed. They explicitly adopted the efficient and fast mechanism of determining the quantum of the revised rent later by mutual agreement at a time envisaged to be probably closer to the end of the lease. The mutual agreement mechanism was what was expressly set out in the Option Clause. 20 In other words, although the parties reached agreement on all the other essential elements of the Option Clause, nevertheless they intended that the Option Clause would not become valid, binding and exercisable by the plaintiff until they could reach mutual agreement on the quantum of the prevailing market rate for the revised rent for the new lease at a later date. I did not think there were legal obstacles standing in the way of the parties agreeing on certain essential elements immediately at the time of signing the lease while deferring other important elements in the Option Clause to be agreed upon subsequently closer to the time of the lease renewal some five years later. 21 Apart from mutual agreement, the parties had not contemplated any other alternative machinery for fixing the prevailing market rent (eg, determination by a named expert valuer, a jointly appointed professional valuer, an average of the prevailing market rates provided by each party’s independent professional valuer, or by way of the judicial or arbitral process in the event that both parties have no idea what the prevailing market rent is or when the prevailing market rent is disputed.) 22 I could not for business efficacy simply imply into the Option Clause an alternative machinery of judicial determination on the basis that if the parties had thought about it, they would obviously have intended a relatively tedious, expensive, and slow judicial process to determine the quantum for the prevailing market rental, whether it was a situation where both parties were unable to ascertain it for themselves, or were able to ascertain it for themselves but unable to agree on a particular figure for it. Why imply into the Option Clause a judicial process when there were many other simpler, faster and more efficient machineries available (see some of the other examples set out in [21])? Time would usually be of the essence in situations of lease renewals for both landlords and tenants. Tenants would want to know quickly whether they could stay on in the premises, and if not, they would have to look for new premises. Landlords would want to know if their tenants would be agreeable to renew their lease, and if not, they would have to look immediately for new tenants as early as possible and even before the expiry of the existing lease (hence the three months’ notice period requirement in the Option Clause) as landlords would want to minimise the duration of vacancy of their premises in between tenancies. Accordingly, I was not at all surprised that the parties had chosen and agreed on a fast and easy method to ascertain the quantum for the “prevailing market rate” by way of their mutual agreement. If the “prevailing market rate” was not agreed after negotiations, both parties would simply walk away from the lease renewal and quickly move on. That was what I found was intended by the parties in the Option Clause as constructed and that was borne out not only by the words used in the Option Clause (“prevailing market rate to be mutually agreed upon”) but also by the conduct of the parties when they embarked on negotiations in an attempt to arrive at an agreed “prevailing market rate”. 23  The words “to be mutually agreed upon” (the “qualifying words”) immediately following and qualifying the phrase “the prevailing market rate” clearly emphasised that the prevailing market rate had to be mutually agreed upon. It did not admit of any other interpretation. If the qualifying words wereabsent, then perhaps the plaintiff would have had a more persuasive submission that the Option Clause was valid and enforceable as the parties would have intended the “prevailing market rate” to be somehow objectively determined by the judicial process, save if there was mutual agreement on it. 24 Unfortunately for the plaintiff, the present Option Clause had included the qualifying words immediately following the words “prevailing market rate”. I agreed with the defendants’ submission that the term “prevailing market rate to be mutually agreed upon” must be read together and construed as a whole. The important qualifying words could not be ignored and be given no effect. Further, the Option Clause did not expressly state any other means to determine the “prevailing market rate” except by way of mutual agreement. Since the Option Clause had unambiguously specified and chosen the “formula” (or the machinery) for the determination of the “prevailing market rate” to be the mutual agreement of the parties, the court should not rewrite the Option Clause and impose on the parties a process for determining the “prevailing market rate” that they had not agreed to. 25 From the foregoing, I found that one critical part of the Option Clause was more akin to an agreement to agree on the final essential element,ie, the “prevailing market rate” (all other essential elements having been agreed to already). Since no mutual agreement was reached on the “prevailing market rate”, the Option Clause was not enforceable by the plaintiff.",
        "Conclusion": "26 In the absence of an agreement on the “prevailing market rate” for the revised monthly rent, the quantum of which was critical for any new lease, the plaintiff had no enforceable right to a further five years’ lease pursuant to the Option Clause. The Option Clause was void and unenforceable as it was incomplete without the parties’ prior agreement on the quantum for the revised rental. A material term was not settled. Accordingly, I dismissed the plaintiff’s application and fixed costs plus disbursements at S$8,000 to be paid by the plaintiff to the defendants. Chan Seng Onn Senior Judge  Lee Jun Yong Daniel (Tan Peng Chin LLC) for the plaintiff; Joel Raj Moosa (Quahe Woo & Palmer LLC) for the defendants."
    }
}