{
    "case_title": "Management Corporation Strata Title Plan No 3724vExceltec Property Management Pte Ltd",
    "ncitation": "[2022] SGHC 44",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "Introduction": "1 This suit concerns a dispute between the Management Corporation Strata Title Plan No 3724 (“the plaintiff”) of Jurong Food Hub (“JFH” or “the Building”), a multi-storey flatted factory building in Jurong and the plaintiff’s former managing agent Exceltec Property Management Corporation Pte Ltd (“the Defendant”). The plaintiff was constituted under the Land Titles Strata Act Cap 158 on 13 March 20121Foot Note 1×See Certificate of Constitution, Agreed Bundle of Documents (“AB”) 760.while the defendant is a Singapore company incorporated on 3 December 1997 whose business is to provide estate and property maintenance and management services.2Foot Note 2×See ACRA search on Defendant, AB86.",
        "The facts": "2 The defendant was first appointed as the managing agent of JFH by its developer EL Development (Jurong) Pte Ltd (“the Developer”) on 10 May 2010.3Foot Note 3×See AB27.The defendant continued as JFH’s managing agent of the plaintiff by an agreement dated 1 May 2013 (“the Management Contract”) after the plaintiff’s first Management Council (“the MC”) was constituted. Under clause 4 of the Management Contract,  the defendant was paid $10,000 per month. The plaintiff took over management of JFH from the Developer on 12 April 2013 after the plaintiff’s first Annual General Meeting (“AGM”). Under clause 3 of the Management Contract, the defendant’s term as managing agent would be from 1 May 2013 until the conclusion of the plaintiff’s second AGM which took place on 30 April 2014.4Foot Note 4×See AB27. 3 The defendant continued as the managing agent of JFH from 30 April 2014 until 8 July 2014 when the plaintiff appointed a new managing agent Vinco Real Estate Management Pte Ltd (“Vinco”) to take over.5Foot Note 5×See Defendant’s emails, AB942–945. 4 The change in management agency for JFH was prompted by a dispute between the plaintiff and the defendant over a problem involving the grease interceptor system (“the Grease Trap” or “the System”) which is located below the ground level in the Building and is accessible by a room at the front driveway of the Building. The Grease Trap comprised of two units of grease (and solids) interceptors, an ejector system (consisting of one ejector tank and two ejector pumps) and a sump pump system which consists of two sump pumps.6Foot Note 6×See details, AB130.A simplified schematic diagram of the System can be found in Appendix 4 of the report of the defendant’s expert Mr Chong Seng Lai dated 1 March 2021. 5 The Grease Trap was part of the Building’s common property and it therefore came under the control of the plaintiff as well as the defendant’s responsibility. As its name implies, the function of the Grease Trap was to remove grease from the Building whose tenants’ main business was in food processing and storage. 6 The maintenance of the Grease Trap was carried out by a contractor called JOL Environmental Pte Ltd (“JOL”) engaged by the plaintiff. However, JOL’s engagement was not based on a contract but wasad hocas and when the defendant made a request. Thead hocmaintenance works for the Grease Trap consisted of manually removing the hardened grease through the ground level manhole. According to the plaintiff, because the Grease Trap was not maintained on a regular basis, there were frequent blockages that necessitated JOL’s services being called upon often on an urgent basis to clear the blockages. 7 In the affidavit of evidence-in-chief (“AEIC”) of the plaintiff’s only witness Mr Ow Yong Chaan Loung (“Mr Ow Yong”), he set out a number of occasions when JOL were called to clear blockages (emergency and non-emergency) of the Grease Trap.7Foot Note 7×See Ow Yong Chaan Loung’s AEIC at para 23.During his cross-examination, Mr Ow Yong clarified that the blockages were not in the Grease Trap itself but in the pipes from individual units that led to the common pipe and then to the grease tank. The causes of blockage were rubbish, plastic bags, debris raffia, cigarette butts and even a door hinge on one occasion.8Foot Note 8×See transcript of 7 July 2021 at pp 111–112. 8 On 30 April 2014, while the plaintiff was holding its second AGM meeting, council members detected an overpowering stench emitting from the Grease Trap. When the plaintiff’s council members inquired of the defendant’s building manager Mr Ahmad bin Mahamood (“Mr Ahmad”) they were told that the Grease Trap was choked and flooded. At their request, Mr Ahmad showed council members the Grease Trap. They saw that the entire Grease Trap pit was flooded to the floor level and it looked like a swimming pool.9Foot Note 9×See transcript of 6 July 2021 at p 28; See transcript of 7 July 2021 at p 117.According to Mr Ahmad, the grease in the Grease Trap had accumulated over time due to lack of maintenance. 9 The plaintiff alleged that as of 14 May 2014 when the plaintiff held a council meeting, the defendant had still not obtained any quotations for the repair of the Grease Trap. It was only when council members told him to do so (according to the plaintiff), that Mr Ahmad started looking for quotations to repair the Grease Trap. Mr Ahmad had told the council members he was using an in-house pump to suck out the water and it was only after the water level had gone down that a contractor could have access to the Grease Trap. 10 Eventually, on 27 May 2014, the defendant submitted two quotations to the plaintiff to repair the Grease Trap. On 24 June 2014, Mr Ahmad sent to council members of the Plaintiff a summary of quotations for the repair of the Grease Trap. The lowest quotation submitted was that from Red Power Engineering Pte Ltd (“Red Power”) in the sum of $4,601.00.10Foot Note 10×See Ow Yong Chaan Loung’s AEIC at p 357. 11 On 26 June 2014, Mr Ahmad informed the plaintiff that he would proceed to accept Red Power’s quotation due to the urgency of the situation. The Plaintiff’s then-chairman J Manickam (“Mr Manickam”) replied to say he had no objections. However, Red Power’s quotation was only to provide a temporary solution as its quoted services were to supply a temporary submersible sump pump to pump out excessive water in the ejector pit and provide labour to clean the tank. Red Power’s quotation did not include determining the cause of the Grease Trap’s malfunctioning or how to rectify the problem. 12 In July 2014, after it had taken over management of the Building from the defendant, Vinco engaged Goodwill Plumbing & Sanitary Enterprise (“Goodwill”) to flush out the flooded Grease Trap. Goodwill discovered that the Grease Trap installation had been disconnected resulting in regular blockage and the entire system namely, the ejector pumps, the sump pumps and the grease tanks, were not in working condition. As an interim measure, Goodwill used two sump pumps to drain out the grease via the manhole on the ground level. Vinco reported Goodwill’s findings to the plaintiff at its council meeting on 7 August 2014. Goodwill’s findings were contained in its report dated 26 August 201411Foot Note 11×See AB84–85.which included photographs Goodwill had taken on 17 July 2014. 13 In December 2014, the plaintiff engaged CC Building Surveyors Pte Ltd (“CCBS”) to carry out a survey of and to recommend repair and/or rectification works for the Grease Trap. After a site visit by its surveyor Mr Crispin Casimir (“Mr Casimir”), CCBS rendered a report dated 18 January 2015 (“CCBS’s report”)12Foot Note 12×See AB90–107.to the plaintiff. 14 The key findings of CCBS’s report were: (a) The Grease Trap installation had been disconnected in a haphazard manner; (b) The Grease Trap system and pipework were corroded; (c) The two collection tanks had been disconnected and were positioned facing each other such that simple reconnection was not possible (as the tanks had been placed on their sides). Recommissioning of the tanks would require them to be lifted and repositioned and the corroded pipework, nuts and bolts needed to be replaced. 15 CCBS’s report concluded that JFH was operating without the Grease Trap in working order – the system needed to be rectified and rectification works entailed practical problems which included the following: (a) Removing the accumulated grease and dirt; (b) Repositioning the grease tanks; (c) Replacing the missing and damaged pipework and fittings; (d) Cleaning of the temporary installations; (e) Recommissioning of the Grease Trap system at significant costs. 16 The plaintiff took the position that the damage to the Grease Trap took place under the defendant’s watch. Accordingly, on 10 March 2015, through its (former) solicitors, the plaintiff sent a letter of demand13Foot Note 13×See AB108.to the defendant giving notice that the plaintiff would be taking the necessary steps to investigate and rectify the problem of the Grease Trap and would seek to recover such costs “from the party liable for the Problems” (“Problems” were defined in the letter as “significant rectification works in order to address all associated problems arising from the Installation [of the large submerged grease trap]). 17 As a prudent measure, the solicitors wrote similar letters of demand to the Building’s architects, the M & E Engineers and the Developer on the same day. 18 In a follow-up letter dated 3 July 2015 to the defendant and the other parties stated above at [17],14Foot Note 14×See AB113–117.the plaintiff’s solicitors stated it had obtained a quotation from RJS Engineering Consultancy Services in the total sum of $600,000 to make good the damages associated with the Installation. The solicitors required the addressees of their letter to respond within 14 days with “an acceptable offer of compensation” failing which the plaintiff would proceed with repair works and commence legal action. All the addressees denied liability in their respective replies to the letters of demand from the plaintiff’s solicitors.15Foot Note 15×See AB118–123. 19 Much later, the plaintiff decided to replace the grease trap system in the light of the problems highlighted by CCBS (see above at [14]–[15]) if the Grease Trap was rectified. The plaintiff engaged Richard Lok M & E Consultants (“RL”) to conduct the tender exercise for the supply, installation, testing and commissioning of a new mechanical and electrical system grease trap system. 20 On 21 April 2017, RL notified the plaintiff that it had received four tenders for the new grease trap system. RL recommended that the tender be awarded to L-ONYX Pte Ltd (“L-ONYX”). The Plaintiff accepted RL’s recommendation and by RL’s letter dated 11 July 2017,16Foot Note 16×See Ow Yong Chaan Loung’s AEIC at p 391.L-ONYX was awarded the contract and paid $245,785.63 for the supply, installation, testing and commissioning of a new grease trap system at JFH.17Foot Note 17×See Ow Yong Chaan Loung’s AEIC at paras 56 and 58. 21 The plaintiff’s attempts to resolve its claim amicably or through mediation18Foot Note 18×Because of clause 20 of the Management Contract, AB 29.with the defendant were unsuccessful and/or rebuffed. Consequently, in January 2020, the plaintiff commenced Suit No 20 of 2020 (“this Suit”) against the defendant.",
        "The pleadings": "22 In the (amended) Statement of Claim (“SOC”), the plaintiff relied on a number of clauses in the Management Contract19Foot Note 19×See Statement of Claim (Amendment No. 1) at paras 4, 6, 7 and 8.to assert that the defendant failed to carry out its contractual duties as the Building’s managing agent when it did not maintain the Grease Trap on a regular basis resulting in frequent blockages and flooding of the grease trap pit. 23 The plaintiff alleged that the defendant had breached the following clauses in the Management Contract:20Foot Note 20×See AB27–30. Clause 721Foot Note 21×See AB27. During the management period, the [defendant] shall diligently manage and maintain [JFH] in a proper and business like manner and in compliance with the relevant legislation in force, and to the best advantage of the [plaintiff] shall without prejudice to the generality of the foregoing carry out all and every of the services set out in the First Schedule hereto; Clause 1422Foot Note 22×See AB28. The services to be rendered by the [defendant] pursuant to this Agreement shall be undertaken with that degree of skill, efficiency and judgment normally exercised by professional property management firm [sic] with regard to services of a comparable nature; Clause 15(b)23Foot Note 23×See AB28. The [defendant] shall indemnify the [plaintiff] against any loss and damage, cost and expense suffered or incurred by the [plaintiff] as the result of the [defendant], his servants or agents breaching any term in this Agreement or by any action taken by them on behalf of the [plaintiff] negligently or by their negligently not taking any action which ought to be taken under the terms of this Agreement; Clause 2024Foot Note 24×See AB29. Any dispute or difference between the parties hereto or any matter arising out of the construction or interpretation of this Agreement as to the rights duties or obligations [sic] of either party hereto shall be referred to mediation provided by any approved mediation centre first. The cost shall be shared equally between both parties. Failing which the parties shall refer to Small Claim [sic] Tribunal (SCT) or civil proceedings. Subsequent cost to be borne as per judgment by SCT or civil proceedings. 24 The plaintiff also placed reliance in its SOC25Foot Note 25×See Statement of Claim (Amendment No. 1) at para 5.on the following provisions in item A of the First Schedule26Foot Note 26×See AB31–34.that were part of the defendant’s duties: (a) to carry out 6-weekly inspection of [JFH] to ensure that [JFH] is in satisfactory and serviceable condition and properly maintained according to the standards required by the relevant authorities; and to recommend any works which are necessary to the [plaintiff]; (b) to prepare, call, evaluate and administer various tenders for routine maintenance works, services and supplies and to advise on the selection of suitable contractors/specialists and to award such tenders on behalf of the [plaintiff] subject to the approval of the [plaintiff]; (c) to ensure that all repairs and routine maintenance works undertaken by the contractors are carried out properly and completed satisfactorily in accordance with the terms and conditions of the contract; … (i) to ensure that the contractors carry out their duties and responsibilities properly; … (k)  to perform and comply with any applicable laws, regulations and directions affecting the [plaintiff] for the proper management and maintenance of buildings and common property in Singapore. 25 The plaintiff added that the defendant also owed implied duties to the plaintiff under the Management Contract which included: (i) a duty to manage, service and maintain the Grease Trap and to keep it functioning in a proper and efficient manner and (ii) a duty to investigate and identify the cause of and to recommend and promptly carry out rectification works for any blockage or malfunctioning of the Grease Trap.27Foot Note 27×See Statement of Claim (Amendment No. 1) at para 10. 26 The plaintiff averred that the plaintiff’s managing agent discovered in July 2014 that the Grease Trap installation had been disconnected which in effect trapped the grease therein. The disconnection had been done in a haphazard manner resulting in corrosion of the installation which required significant rectification works.28Foot Note 28×See Statement of Claim (Amendment No. 1) at paras 12–13. 27 The plaintiff claimed two sums from the defendant, the first for $118,533.50 (reduced from $128,533.50 at trial) being the cost of manual removal and maintenance of temporary grease trap installation for the period January 2013 to April 2018 and the second sum was for $241,796 (reduced from $245,785,63) for the cost of installation of a new grease trap interceptor by L-ONYX.29Foot Note 29×See Statement of Claim (Amendment No. 1) at paras 17–18.The Plaintiff’s claim totalled $360,329.50. 28 In its (amended) Defence and Counterclaim, the defendant admitted that the Management Contract contained the clauses the plaintiff relied upon but denied it was the defendant’s duty or contractual obligation to:30Foot Note 30×See Defence and Counterclaim (Amendment No. 1) at paras 6–7. (a) manage, service and maintain the Grease Trap; (b) keep the Grease Trap functioning in a proper and efficient manner; (c) investigate and identify the cause of any blockage or malfunctioning of the Grease Trap; (d) recommend and promptly carry out rectification works to correct any blockage or malfunctioning of the Grease Trap; and/or (e) to remove grease accumulated in the Grease Trap which work can only be carried out by a specialist contractor. 29 The defendant added that it had recommended to the plaintiff to engage a specialist contractor to carry out periodic removal of grease accumulated in the Grease Trap and it had engaged a specialist contractor JOL on behalf of the plaintiff to do the work.31Foot Note 31×See Defence and Counterclaim (Amendment No. 1) at paras 8 and 11. 30 The defendant denied it disconnected or caused the disconnection of the Grease Trap installation as alleged by the plaintiff.32Foot Note 32×See Defence and Counterclaim (Amendment No. 1) at para 13. 31 The defendant counterclaimed from the plaintiff (by way of setoff in extinction or diminution of the plaintiff’s claim) outstanding management fees due from the plaintiff for the period 1 May 2014 to 8 July 2014 amounting to $24,161.30.33Foot Note 33×See Defence and Counterclaim (Amendment No. 1) at paras 23–24. 32 In its reply and defence to the defendant’s counterclaim, the plaintiff disputed the defendant’s entitlement to be paid the management fees it claimed.34Foot Note 34×See Reply and Defence to Counterclaim at para 9.",
        "The evidence": "",
        "(i) The plaintiff’s case": "33 The plaintiff called one witness for its case while three persons testified for the defendant including Mr Ahmad and an expert. Initially, Mr Casimir had filed his affidavit of evidence-in-chief (“AEIC”) preparatory to being the Plaintiff’s witness. However, the court was informed by counsel of the Plaintiff that the defendant’s counsel (who confirmed) would not cross-examine Mr Casimir on his AEIC – which was then admitted as part of the evidence before the court.35Foot Note 35×See transcript of 7 July 2021 at pp 170–171. 34 The plaintiff’s witness Mr Ow Yong is the current chairman of the Eighth MC. The facts extracted from Mr Ow Yong’s AEIC have been set out earlier at [2] to [21]. 35 During Mr Ow Yong’s cross-examination, Mr J Balachandran, counsel for the defendant (“Mr Bala”), took issue with Mr Ow Yong’s AEIC where Mr Ow Yong had deposed that in July 2014 the plaintiff discovered the disconnection of the Grease Trap installation.36Foot Note 36×See Ow Yong Chaan Loung’s AEIC at para 41.When questioned, Mr Ow Yong clarified that the discovery was made by Goodwill who informed Vinco who in turn informed the MC.37Foot Note 37×See transcript of 6 July 2021 at p 13. 36 The defendant also took issue with Goodwill’s documents that were incorporated into the agreed bundles placed before the court – the defendant would not agree to the authenticity of those documents, including Goodwill’s report (mentioned above at [12]), without formal proof. In the defendant’s closing submissions,  it was submitted that Goodwill’s report was inadmissible as the maker was not called to testify.38Foot Note 38×See Defendant’s Closing Submissions at para 47.Mr Bala had pointed out to Mr Ow Yong that there were no service reports that recorded Goodwill’s visit to the Grease Trap on 17 July 2014 when Goodwill allegedly flushed out the grease trap nor of Goodwill’s visit on 12 August 2014 to install a sump pump.39Foot Note 39×See transcript of 6 July 2021 at pp 20-–21.Indeed, there were no records of Goodwill’s representative Mr Kenny Pang’s visit to JFH on 17 July 2014. 37 Mr Bala also questioned Vinco’s delay in finding out the disconnection of the grease trap installation only on 17 July 2014, which was a week after the handover by the defendant on 8 July 2014.40Foot Note 40×See transcript of 6 July 2021 at pp 25-–26.It is to be noted that there was a formal handing over by the defendant of the Building to Vinco on 8 July 2014; this is reflected in the documents listed at Pages 789 to 793 of the Agreed Bundle of Documents (“AB”) signed by Mr Ahmad and countersigned by Vinco’s Asher Toh (“Mr Toh”). Of particular relevance is Page 792 of the AB which itemised the list of outstanding works at JFH. The first item in the list stated: Sump pump/ejector pump out of order – to be rectify [sic] by Redpower Eng. PL (in progress). There was no mention of any equipment/item in the Grease Trap being disconnected. 38 On 23 July 2014, a contractor Everrise Maintenance Pte Ltd (“Everrise”) gave a quotation of $34,500 (before GST) to the plaintiff to remove the sludge from the ejector room and carry out other works that would solve the chokage problem.41Foot Note 41×See AB350.When cross-examined on why the plaintiff did not accept Everrise’s offer, Mr Ow Yong pointed out that Everrise’s quotation only gave a warranty of six months for the parts replaced and for workmanship. The plaintiff’s MC was afraid that after six months, the same problem may recur.42Foot Note 42×See transcript of 6 July 2021 at pp 32–33. 39 Mr Bala drew Mr Ow Yong’s attention to Goodwill’s quotation dated 6 August 201443Foot Note 43×See AB309.to the plaintiff which quoted a price of $36,580 for removing the existing two ejector pumps and sump pumps and replacing them with new ones as well as to repair the existing two control panels, one for the sump pump and the other for the ejector pump. Goodwill’s quotation was also not accepted by the plaintiff. Mr Ow Yong pointed out that Goodwill’s quotation did not provide for any warranties after the work was done. He explained that the plaintiff by then had appointed and was advised by consultants. The plaintiff required a permanent solution to the problem and relied on its consultants to tell the plaintiff what would be the best way going forward.44Foot Note 44×See transcript of 6 July 2021 at p 33. 40 The whole tenor of the plaintiff’s SOC was that the defendant mismanaged or failed to manage the Building properly resulting in the debacle surrounding the Grease Trap. In cross-examination, Mr Bala sought to disprove the plaintiff’s allegations of negligence against the defendant as seen in the following paragraphs. 41 Mr Bala referred to an email from Mr Ahmad to the MC members dated 4 February 2014 where Mr Ahmad reported that the grease tank and sump pump chokage problem in December 2013 had been rectified by his calling upon JOL who carried out desilting, flushing and washing out of the pit with a high pressure water jet. Mr Ahmad had also reported that he found one of the injector pumps out of order and some pipe breakages due to wear and tear. Mr Ahmad concluded his message by stating that to avoid a repeat of the chokage incident, the plaintiff must carry out monthly desilting of the grease tank, as required by the National Environment Agency (“NEA”).45Foot Note 45×See AB46.He also attached photographs of the grease tank pit with his email.46Foot Note 46×See AB47–51. 42 Based on Mr Ahmad’s above email, Mr Bala reasoned that the tanks had not been disconnected or repositioned then, as reported by Goodwill in July 2014. Mr Ow Yong however countered that he and other MC members would not know for a fact if what Mr Ahmad said was accurate/correct. There was no reason for them to check whether the grease tank was working or not. His position was that the pervasive foul smell had been ongoing since before December 2013 and whenever Mr Ahmad was queried on the same, he would brush off MC members with the remark “it’s from the grease tank issue”.47Foot Note 47×See transcript of 6 July 2021 at pp 35–36.Mr Ow Yong observed that there was nothing to indicate that Mr Ahmad had taken the attached photograph of the tanks which had neither been disconnected nor repositioned in December 2013 as he claimed.48Foot Note 48×See transcript of 6 July 2021 at p 41. 43 Mr Ow Yong testified that if the grease tank was in proper working condition, “the swimming pool” scenario would not have been repeated every couple of days (which it was) and the plaintiff would not have had to engagead hocservices of JOL to clear the grease or sludge around the grease tank periodically, as shown in JOL’s invoices.49Foot Note 49×See AB279–288; See transcript of 6 July 2021 at pp 43 and 46.Mr Ow Yong added that whenever he passed the driveway and for the longest time, he would see cone markers placed around the manhole where a temporary pump would be placed to periodically suck out the sludge/grease, because the grease tank was not functioning.50Foot Note 50×See transcript of 6 July 2021 at pp 49–50.Even then, the temporary pump could not pump out the sludge/grease fast enough and the foul smell remained. 44 Even after CCBS’ report, the plaintiff still engaged other contractors like Goal Link Pte Ltd (“Goal Link”) who on 16 January 201551Foot Note 51×See AB318-–319.rendered a report (“Goal Link’s report”) assessing the suitability of the equipment and machinery of the grease plant to be made functional again. Goal Link had apparently put upright the two grease tanks that Mr Casimir had previously found to be lying on their sides (see above at [14(c)]).52Foot Note 52×See AB318. 45 Mr Bala criticised the plaintiff for not acting on Goal Link’s report that assessed the grease tanks and the ejector tank to be in satisfactory condition even though the latter was totally submersed in water. However, the ejector tank was filled to the brim by grease deposits which had hardened into a “caked” condition.53Foot Note 53×See AB318.Mr Bala’s complaint was that the plaintiff was bent on replacing the Grease Trap with an entirely new system instead of trying to salvage and repair the existing system at lower cost. He alleged that the plaintiff then made the defendant the scapegoat to bear the costs.54Foot Note 54×See transcript of 6 July 2021 at p 91. 46 Mr Ow Yong defended the plaintiff’s decision in not following Goal Link’s recommendation and accepting any of three quotations for repair of the existing system that Mr Bala had referred to – those of Forge M &E Pte Ltd (“Forge”), Red Power and Utara Electrical Engineering and Services (“Utara”).55Foot Note 55×See AB306–307, 936.He explained that the entire grease system had been submerged in water for a significant period of time. There was no telling what damage had been done to the electrical components in the grease system by water. Machinery for the system was obsolete and the plaintiff could not find a like-for-like replacement. Even if replacement parts could be found, they were not of the same quality. Moreover, if the repaired system failed (bearing in mind Goodwill gave no warranty after repair whilst Everrise’s warranty was only for six months), he and his fellow council members would find it hard to explain to the subsidiary proprietors of JFH the reason. The subsidiary proprietors expected the MC to run the estate in the best or optimum condition. There was no guarantee that repairs would resolve the problem of the malfunctioning of the grease tank. Mr Ow Yong added that as a reflection of the careful deliberations made by the MC in going through so many quotations and brainstorming sessions, the plaintiff took four years to decide on the replacement system of the grease trap system.56Foot Note 56×See transcript of 6 July 2021 at pp 56–57, 95. 47 The above three companies had also submitted quotations for the monthly servicing of the two ejector pumps and two sump pumps of the Grease Trap57Foot Note 57×See AB935.but it would appear that none of them were accepted by the plaintiff. 48 Mr Ow Yong admitted that the plaintiff decided onad hocmaintenance of the Grease Trap as a cost saving measure.58Foot Note 58×See transcript of 6 July 2021 at p 75.As and when there was a need to remove the grease from the grease tank, the plaintiff would engage JOL to do the job. He explained thatad hocremoval of the grease was separate and distinct from the plaintiff’s complaint that the defendant (namely Mr Ahmad) failed to maintain the Grease Trap system.59Foot Note 59×See transcript of 6 July 2021 at pp 75–76. 49 By the defendant’s failure to maintain, Mr Ow Yong meant the grease system was not functioning properly due to chokage that resulted in the emission of a foul smell. Yet, the defendant/Mr Ahmad did nothing to find out the cause and did not inform the MC of the problem. The council members were alerted only because of the foul smell that they detected. Had Mr Ahmad inspected the Grease Trap at 6-weekly intervals, Mr Ow Yong testified60Foot Note 60×See transcript of 6 July 2021 at p 94.that the defendant and the plaintiff would have been alerted sooner to the fact that the system was not functioning and the equipment may not have been submerged in water for so long or at all. The plaintiff could then have taken immediate remedial action and saved a significant amount of time, perhaps costs and trouble.61Foot Note 61×See transcript of 6 July 2021 at p 98.To Mr Ow Yong, the defendant’s omission was a breach of clause 7 of the Management Contract read with item A(a) of the First Schedule set out earlier at [23] and [24] above. 50 During Mr Ow Yong’s cross-examination, it was adduced from a service report of JOL dated 8 May 201362Foot Note 62×See AB225.that when the latter was called to clear chokage, JOL found that the cause was a door hinge stuck in a pipe’s elbow joint. As a result (presumably on the advice of the plaintiff’s consultants RL (see above at [19])), when the plaintiff installed a new grease trap system in May 2018, it decided to install strainers and grilles in each of the 138 units in JFH to minimise the risk of blockages. This evidence led Mr Bala to suggest to Mr Ow Yong that had strainers and grilles been installed from the outset of construction of JFH, it would have helped the situation.63Foot Note 63×See transcript of 6 July 2021 at p 96. 51 The court queried Mr Ow Yong on the manner of access to the room where the Grease Trap was located.64Foot Note 64×See transcript of 6 July 2021 at p 40.He explained that the room was always locked and to gain access, contractors like JOL must obtain the key from the office of the managing agent and be accompanied by the managing agent to the room. That meant there could not have been unauthorised access to the room by whoever it was who placed the two tanks on their sides (see above at [14(c)]). However, none of the three factual witnesses who testified could throw any light on who could have done the repositioning and more importantly, why. 52 In the cross-examination of Mr Ow Yong, the defendant seemed to suggest that the plaintiff was expecting too much from the defendant as managing agent in return for the payment of $10,000 per month, by alleging the defendant had implied on top of express contractual duties. Besides Mr Ahmad, the defendant provided the plaintiff with a full-time technician for its management of JFH.",
        "(ii) The defendant’s case": "53 Mr Ahmad disclosed that on his first day of work with the defendant on 15 August 2013, he was deployed to JFH. He no longer works for the defendant and is now a condominium manager. 54 Nothing turns on Mr Ahmad’s AEIC. During his cross-examination, he agreed that his duties pursuant to clauses 7 and 14 of the Management Contract included checking that the Grease Trap functioned properly and efficiently and recommending rectification works to the MC. He agreed he also had to carry out 6-weekly inspections of the Grease Trap under item A(a) of the First Schedule set out earlier at [24].65Foot Note 65×See transcript of 7 July 2021 at pp 179–180.Mr Ahmad testified he performed all these duties for which there would be inspection lists where he recorded the outcomes but he could not recall what happened to those lists.66Foot Note 66×See transcript of 7 July 2021 at pp 180–181. 55 Mr Ahmad deposed in his AEIC that the MC wanted ad hoc servicing of the grease separator system to save costs although he had recommended monthly desilting of the grease tanks as required by the NEA.67Foot Note 67×See Ahmad bin Mahamood’s AEIC at paras 4 and 6.Counsel for the plaintiff (Mr Siaw) drew Mr Ahmad’s attention to various service reports of JOL for the period 18 December 2013 to 11 April 2014; he testified they related to normal servicing of the Grease Trap.68Foot Note 68×See transcript of 7 July 2021 at pp 185–186.Mr Ahmad denied he did not inform the MC of an incident on 22 August 2013 when the ejector tank overflowed but said he could not recall seeing the incident report.69Foot Note 69×See transcript of 7 July 2021 at p 188. 56 Until he was shown service reports of JOL stating that the company cleared blockages of pipes on 22 August 201370Foot Note 70×See AB233.and 1871Foot Note 71×See AB237.and 24 December 2013,72Foot Note 72×See AB239.Mr Ahmad claimed there was no blockage of the Grease Trap system in 2013.73Foot Note 73×See transcript of 7 July 2021 at pp 188–189.He then sought to explain that those reports related to ad hoc routine servicing even though in the service reports dated 22 August 2013 and 23 April 2014,74Foot Note 74×See AB233, 274–276.the words “Emergency work for clearing blockage pipes” were ticked. He then changed his testimony to say he could not recall/remember.75Foot Note 75×See transcript of 7 July 2021 at pp 190–192. 57 As for Mr Ahmad’s testimony that he would call JOL to do monthly servicing to desilt or maintain the Grease Trap (with prior approval from the MC),76Foot Note 76×See transcript of 7 July 2021 at p 192.there were no monthly service reports for September to December 2013 to corroborate his evidence. Mr Siaw added that the lack of documents must mean there was no servicing done for four months and this conclusion was reinforced by the fact that the MC detected a foul smell from the Grease Trap room. Mr Ahmad’s quick response was the grease tank pit “always [has] a foul smell.”77Foot Note 77×See transcript of 7 July 2021 at  pp 194–195.He disagreed that he failed to inform the MC of the blockage incidents in the period of August to December 2013. However, he was unable to recall the date of his last inspection of the Grease Trap in 201378Foot Note 78×See transcript of 7 July 2021 at p 195.but denied he failed to inspect until JOL carried out emergency work in December 2013.79Foot Note 79×See transcript of 7 July 2021 at p 196. 58  Although he claimed he reported to the MC on the emergency work done by JOL on Christmas Eve,  there was no record of the incident being reported in the minutes of the MC at the meeting it held on 27 December 2013.80Foot Note 80×See AB516--–518.In fact, it was the MC itself that raised the subject of every unit in JFH installing a strainer to avoid future chokages under the item “Any other business”.81Foot Note 81×See Minutes, AB518. 59 Mr Siaw highlighted to Mr Ahmad that if indeed (as Mr Ahmad claimed) he had informed the MC at the 27 December meeting of the chokage incident on 24 December 2013, Mr Ahmad would not have prefaced his own email to the MC on 4 February 2014 (see above at [41]) with the following sentence:82Foot Note 82×See transcript of 7 July 2021 at p 201. I would like to apologize for the late update to the councils [sic] on the grease tank and sum [sic] pump choke which happens [sic] in the month of December 2013 due to my preparation for the EOGM matters. 60 Mr Ahmad attempted to explain that his apology related to hisupdatingthe MC not to thelate reporting,of the December 2013 chokage. However, that cannot be correct as the second sentence/paragraph of his email said: On December I [checked] and found the grease tank pit is flooded due to the urgency I called JOL Environmental Pte Ltd to do the Desilting and flushing of the grease tank and ejector tank. The choke has also effect the sum pump pit which cause the pump not be able to pump the water out [sic]. However poor his English (which was Mr Ahmad’s excuse)83Foot Note 83×See transcript of 7 July 2021 at p 202.it was clear that Mr Ahmad was informing the MCfor the first timeof the December chokage, notrefreshingthe MC on the incident. Mr Ahmad’s lame excuse is untenable given the clear wording of his email. 61 In the last paragraph of his email, Mr Ahmad advised the MC that monthly desilting of the grease tank was a requirement by the ENV. Mr Ahmad claimed that he had given the MC this advice previously in a meeting but could not recall at which meeting and had not recorded it in any minutes.84Foot Note 84×See transcript of 8 July 2021 at p 207. 62 Mr Ahmad also claimed in the same email that he had arranged for contractors to give quotations on repair works. He maintained he requested quotations in March 201485Foot Note 85×See transcript of 8 July 2021 at p 209.even though the quotations from the two contractors that Mr Ahmad had identified, namely Red Power and Forge, were dated 16 May 201486Foot Note 86×See AB307.and 19 May 201487Foot Note 87×See AB306.respectively and were only passed to the MC by Mr Ahmad in his email dated 27 May 2014.88Foot Note 88×See AB55.When questioned by the court,  Mr Ahmad maintained his evidence and added that he requested quotations from two other companies besides Red Power and Forge but they declined to quote, and that his requests were made by telephone so he was unable to substantiate his testimony.89Foot Note 89×See transcript of 8 July 2021 at pp 230–232. 63 When cross-examined on his delay in obtaining the quotations, Mr Ahmad’s excuse was that the two named contractors only did a site inspection in April 2014 to check that the pumps were indeed not working before they issued their May 2014 quotations.90Foot Note 90×See transcript of 8 July 2021 at pp 208–209. 64 The MC’s chairman Mr Manickam responded to Mr Ahmad’s email on the same afternoon to inquire which of the two companies Mr Ahmad had used previously and requested a “report” on what happened, how long and what the reason was, so as to help the MC make a decision. Mr Ahmad disagreed with Mr Siaw’s suggestion that the request for a “report” meant that Mr Ahmad had not given the MC any update or report on the status of the grease trap. He claimed he did not provide a written report but had given a verbal report to the MC, although he could not recall when this was done.91Foot Note 91×See transcript of 8 July 2021 at p 211. 65 Mr Ahmad’s answer prompted him to be further cross-examined by Mr Siaw. His attention was drawn92Foot Note 92×See transcript of 8 July 2021 at p 211.to his email dated 29 May 2014 to the MC93Foot Note 93×See AB54.where he responded to Mr Manickam’s email inquiries (as set out in [64]) and added: Our grease tank had this problem for about 6 weeks already which all delayed due to invitation for 3 [quotations] from contractors. I hope we can move forward to agree on the lowest quotation out of the 2 contractors I submitted as not to delay further. The other contractors [sic] unable to give their quotations due to their own reasons. I already have 1 support from the council I am looking into more reply as I can proceed with the work [sic]. 66 The above email drew a swift response from Manickam who replied the same afternoon as follows:94Foot Note 94×See AB54. [Please] note that I do not agree with what you mentioned below. Only after the last MC meeting, you have started to look for the quote after the members insist [sic] that it should be resolved, Till then, you told us that you are waiting for the water level to go down to access the pump and you are using the in-house pump to suck the water. 67 Questioned on the email exchanges, Mr Ahmad (after prevaricating) agreed that the pump problem had lasted for more than 6 weeks.95Foot Note 95×See transcript of 8 July 2021 at pp 211–212.But he still insisted he had informed the MC at one of its meetings. He then referred to the minutes of the MC’s meeting on 14 May 2014 under item 9.2 headed “Any Other Business”96Foot Note 96×See AB528.which stated: Injector and Sump Pit tank, pumps and system rectification repair works It has been sometime the rectification work [sic] has not been rectified. The Council feels that the [defendant] is not giving the proper advice or [taking] proper action to rectify the issues. So Council requested the [defendant] to obtain quotations on the total rectification, repair and replacement of the above mentioned works to be done. 68 The above minutes prompted the court to question Mr Ahmad.97Foot Note 97×See transcript of 8 July 2021 at pp 214–215.It pointed out to Mr Ahmad that the minutes in fact contradicted his evidence in court that he had obtained quotations.98Foot Note 98×See transcript of 8 July 2021 at p 214.Notwithstanding a reminder from court that he was on oath and must be truthful, Mr Ahmad insisted he did obtain quotations for rectification works for the Grease Trap system, despite what the minutes recorded.99Foot Note 99×See transcript of 8 July 2021 at p 214. 69 Pressed further by the court on why the above minutes recorded otherwise, Mr Ahmad maintained he obtained quotations but it was not for the total repair and replacement of the pump. He claimed he had obtained quotations for desilting. The court pointed out that desilting work was already being done by an existing contractor JOL, so why was there a need for quotations for desilting work? Mr Ahmad’s answer (which was both untrue and absurd) was that JOL desilted the grease but not the water. Questioned by the court whether there was a difference between desilting for grease and water, Mr Ahmad confirmed there was.100Foot Note 100×See transcript of 8 July 2021 at pp 214–215. 70 Earlier, the court had alluded to Mr Manickam’s email to Mr Ahmad at [66]. Mr Ahmad had replied to that email on 29 May 2014101Foot Note 101×See AB53.– in one paragraph he said: Advice [sic] me if the [defendant] is not doing the right thing in the beginning by reducing the volume of water from the tank as a preventive [measure] before the fault can be [rectified] as this water will keep coming to this tank every seconds [sic]. I am just trying my best to prevent further damage here and I did accept councils [sic] request to call for overall rectifying quotation and I been chasing the contractor on their quotations and appointments to get it rectify fast [sic]. Mr Ahmad denied Mr Siaw’s suggestion he was asking the MC to advise him on how to do his job. Rather, he wanted the MC to advise him if he was not doing the right thing.102Foot Note 102×See transcript of 8 July 2021 at p 215. 71 Mr Ahmad’s email reply also drew a quick response from Mr Manickam who replied the following day. The relevant extracts of his reply read as follows:103Foot Note 103×See AB52. Thanks for the mail. It seems that you did not understand or not reading [sic] my mail properly. Please note that I never asked you why there is a delay since we all know the reason. I have asked you what has happened/reason for the chockage [sic] since this problem suddenly pop-up. You did not reply. So I asked you the same thing when you [came] to my office for the cheque signature. Then you explained that the grease is accumulated over … time  and the main reason, is no maintenance. So I asked you, in that case ask the maintenance contract also from those supplied that are quoted and this may bring down their quotation [sic]. You agreed. What I mentioned that I do not agree in your last mail is “Our grease tank had this problem for about 6 weeks already which all delayed due to invitation for 3 quotation from contractors [sic]”. This implies that the problem is delayed due to 3 quotations. That is why I mentioned that we have started getting the quotations only after the MC meeting. I no where mention anything about the [defendant’s] measures [sic]. This problem exists even before AGM. 72 The reference by Mr Manickam to the AGM was that held on 30 April 2014. According to Mr Ow Yong’s testimony, that apparently was the day that the MC members detected the stench coming from the Grease Trap room as well as saw its awful condition.104Foot Note 104×See transcript of 6 July 2021 at p 28.The court is making copious reference to email exchanges between the parties as it has a bearing on the court’s findings. 73 Prior to the AGM date, the service reports of JOL showed that the company came twice, once on 11 April 2014105Foot Note 105×See AB272–273.for ad hoc servicing/desilting and the second occasion on 23 April 2014106Foot Note 106×See AB274--–276.to carry out emergency desilting of the ejector tank and two grease tanks. 74 The managing director of the defendant, Mr Koh Hock Seng (“Mr Koh”), was also its witness. The ACRA search on the defendant107Foot Note 107×See AB86–87.shows Mr Koh is also a shareholder. Mr Koh’s AEIC was essentially a repeat of the defence and counterclaim of the defendant (see above at [28] to [31]). He denied that the defendant owed any obligation to the plaintiff to maintain the Grease Trap as maintenance of fixtures was the responsibility of maintenance contractors and the grease separator system in particular was maintained by JOL who was one of the plaintiff’s maintenance contractors. 75 Mr Koh further denied that the defendant owed implied duties to the plaintiff under the Management Contract. He deposed that the defendant could not have been required to manage, service and maintain the grease separator system and keep it functioning efficiently and properly at a management fee of $10,000 per month, while providing two onsite staff. Neither would the defendant be required to investigate, identify the cause or recommend and carry out rectification works to correct any blockage or malfunctioning of the grease separator system. 76 Mr Koh’s AEIC deposed that the plaintiff owed the defendant management fees totalling $24,161.30. He denied the plaintiff’s allegation (see above at [21]) that the defendant rejected mediation. He disclosed that the defendant did not receive the plaintiff’s solicitors’ letter dated 25 October 2019 addressed to the defendant’s solicitors as the defendant only appointed solicitors in January 2020. 77 During Mr Koh’s cross-examination, he disagreed with Mr Siaw’s reading of the defendant’s obligations to manage and maintain JFH as an obligation to include maintenance of the grease trap as such M&E installations (including lifts and electrical switch rooms) would be done by third party specialist contractors. The defendant’s function would only be to conduct a visual inspection to check if the equipment was functioning properly.108Foot Note 108×See transcript of 8 July 2021 at p 259.The visual inspections would apply to the defendant’s duties under the First Schedule item A(a) of the Management Contract of conducting 6-weekly inspections. 78 Mr Koh testified that servicing of equipment was not part of the defendant’s responsibility.109Foot Note 109×See transcript of 8 July 2021 at p 259.However, he agreed that it was the defendant’s responsibility to ensure that specialist contractors to whom maintenance work was contracted to carry out their duties properly and efficiently. He agreed with the court that the defendant must get the right people for the job(s).110Foot Note 110×See transcript of 8 July 2021 at p 261. 79 Mr Koh agreed with Mr Siaw that if the Grease Trap malfunctioned or was blocked, it was the defendant’s duty to get a specialist contractor to investigate the problem and to recommend rectification and/or replacement works.111Foot Note 111×See transcript of 8 July 2021 at pp 261–263. 80 During the period when the defendant was the managing agent of JFH, Mr Koh testified he had never visited the Building as he left matters relating to its management to the head/team manager of the defendant’s property and technical departments.112Foot Note 112×See transcript of 8 July 2021 at p 264. 81 When he was questioned whether it was reasonable for the defendant to take 5 months to obtain quotations to carry out rectification works for the Grease Trap system, Mr Koh did not give a definitive answer, saying it all depended on circumstances and who were the specialist contractors involved.113Foot Note 113×See transcript of 8 July 2021 at p 267. 82 In cases where the ejector pump and the sump pump were not working, Mr Koh testified he would have obtained quotations from contractors immediately to do the repairs.114Foot Note 114×See transcript of 8 July 2021 at p 267.A month’s delay may be reasonable but Mr Koh opined that two months’ delay in obtaining quotations would not be reasonable if the pumps were not functioning.115Foot Note 115×See transcript of 8 July 2021 at p 268. 83 As for the defendant’s counterclaim, it was in evidence that the defendant neither made a formal demand for payment of the outstanding management fees nor did it chase the plaintiff for payment (other than verbally according to Koh). Mr Siaw suggested to Mr Koh (who disagreed) that it was because the defendant knew and accepted it was in breach of the Management Contract.116Foot Note 116×See transcript of 8 July 2021 at p 273.The claim had been outstanding for almost 6 years by the time this suit was filed. It should be noted that because of the plaintiff’s refusal or failure to pay its outstanding management fees, the defendant held onto the plaintiff’s documents. This was reflected in the letter of demand from the plaintiff’s solicitors dated 23 September 2014117Foot Note 117×See AB683–684.for the return of the plaintiff’s books of accounts, records and other documents, and the defendant’s reply dated 26 September 2014.118Foot Note 118×See AB685.The defendant’s solicitors then issued a letter of demand to the plaintiff dated 3 October 2014119Foot Note 119×See AB686.for the outstanding management fees which drew a response dated 7 October 2014 from the plaintiff’s solicitors disputing liability.120Foot Note 120×See AB688. 84 The defendant’s third witness was its expert Mr Chong Seng Lai (“Mr Chong”) who is a chartered engineer by training. Mr Chong’s brief from the Defendant was to: (a)  inspect the grease separator system and review its design and operation at JFH; and (b) review technical reports, email correspondence, repair and maintenance quotations, work orders and invoices pertaining to the grease trap system at the material time. Mr Chong’s report dated 1 March 2021121Foot Note 121×See Chong Seng Lai’s AEIC, exhibit CSL-1 (Expert Witness Report) at pp 4–21 (excluding the appendices & photographs).(“Mr Chong’s report”) was prepared after 2 site visits, with the first visit on 28 September 2020 and the second on 16 October 2020. 85 Mr Chong’s report contained the following key conclusions after his review of the documents listed in [84(b)] of this judgment: (a) The Grease Trap system was severely overloaded because its capacity was about 45% of the PUB’s design guidelines; (b) CCBS’s report did not recommend extensive replacement save for damaged and missing pipework; (c) The scope of the total replacement contract awarded to L-ONYX could not be reasonably correlated to the last documented repair by Red Power which was some time between 27 June and 4 July 2014; (d) Other repair and replacement quotations showed that during the period of 23 July to 6 August 2014, the system could have been repaired at a cost ranging from $34,500 to $36,580 and restored to working condition; (e) The disconnection of the grease separator tanks most likely occurred between 6 August 2014 and January 2015 because the quotations submitted by Everrise and Goodwill did not refer to the re-connection of grease separator tanks in their recommended scope of works. 86 Mr Chong’s report stated that the cause of blockage/malfunctioning of the grease separator was likely due to undersized tank capacity coupled with insufficient frequency of desilting.122Foot Note 122×See Chong Seng Lai’s AEIC, exhibit CSL-1 (Expert Witness Report) at para 7.4.As for the flooding of the ejector pit, Mr Chong opined that the cause was the ejector pumps’ failure to empty the ejector tank which resulted in overloading of the grease separator tanks. Because of the failure of the ejector pumps, the sump pump could not clear or pump out the overflow of waste water into the ejector pit.123Foot Note 123×See Chong Seng Lai’s AEIC, exhibit CSL-1 (Expert Witness Report) at para 7.3. 87 During cross-examination, Mr Chong was referred to Appendix 9 of his report, Red Power’s invoice dated 4 July 2014124Foot Note 124×See AB62.in the sum of $4,815 covering the following 3 items of work: (a) to supply temporary sump pump or tanker to pump out excessive water in ejector pit; (b) to supply labour for cleaning of the tank; (c) to supply Tsurami submersible pump 2.2kw c/w hose clamp. 88 Apart from the above invoice, Mr Chong agreed when questioned by the court that that he had not seen any service reports that would confirm the quoted works were actually carried out by Red Power.125Foot Note 125×See transcript of 8 July 2021 at p 238.In answer to Mr Siaw’s question, Mr Chong confirmed he did not know whether the invoice was paid either.126Foot Note 126×See transcript of 8 July 2021 at p 236.In other words, there was no evidence that Red Power carried out the work itemised in [87]. What was also noteworthy is that Red Power’s aforesaid quotation was an exact mirror of its earlier quotations both dated 16 May 2014, one in the amount of $4.601.00127Foot Note 127×See AB307.and the other for $4,815.00.128Foot Note 128×See AB307(A).None of the three invoices were signed by the Plaintiff to indicate acceptance. 89 Apart from the issue of whether Red Power did the items of work set out in its invoices, the plaintiff did not challenge any of the findings made by Mr Chong or his conclusions.",
        "The issues": "90 The court must determine the following issues to arrive at its findings: (a) Was there a duty on the part of the defendant to maintain the Grease Trap under the Management Contract? (b) Did the defendant owe any implied duties to the plaintiff over and above those spelt out in the Management Contract? (c) Did the defendant disconnect the Grease Trap as the plaintiff alleged? (d) Did the disconnection in (c) cause the flooding incident on 30 April 2014? (e) Was the flooding on 30 April 2014 caused by the defendant’s failure to maintain? (f) Was it reasonable of the plaintiff to replace the entire grease trap installation system rather than to repair it? (g) Is the defendant liable for damages as claimed by the plaintiff? (h) Is the plaintiff liable for the defendant’s counterclaim?",
        "The findings": "91 At the outset, the Court accepts the defendant’s submissions129Foot Note 129×See Defendant’s Closing Submissions at paras 28–31.that the plaintiff should have called Vinco’s representative Mr Toh to testify. Even if Mr Toh was unwilling to come to court, he could and should have been subpoenaed. Mr Ow Yong had hinted during cross-examination130Foot Note 130×See transcript of 6 July 2021 at p 61.that the plaintiff had some disagreement with Vinco and he was certain that if Vinco had been called, it would not have agreed to testify for the plaintiff. Mr Bala had drawn Mr Ow Yong’s attention to the minutes of the meeting of the MC on 6 November 2015131Foot Note 131×See AB561–562.that showed that there was a possibility the plaintiff may sue Vinco whose management agency had (in or about October 2015) been terminated in favour of a new agent called Corporate Visions Pte Ltd (“Corporate Visions”). Even if there was bad blood between the plaintiff and Vinco, the plaintiff should have taken steps to procure the attendance of Vinco’s Mr Toh or Mr Alson Mak (whose name appears in the MC’s minutes of meetings) and if it failed, the court would not then draw an adverse inference against the plaintiff under Section 116(g) of the Evidence Act (Cap 97, 1997 Rev Ed) as the defendant submitted the court should.132Foot Note 132×See Defendant’s Closing Submissions at paras 29–31.The absence of a representative from Goodwill as the plaintiff’s witness did not help either. 92 As for the veracity of the parties’ witnesses, the Court was not impressed with Mr Ahmad. His testimony was heavily criticised in the plaintiff’s closing submissions, not without justification. The court accepts the plaintiff’s complaints of Mr Ahmad’s shortcomings133Foot Note 133×See Plaintiff’s Closing Submissions at paras 14–19.–  he was an untruthful witness who lied repeatedly and when he was caught lying, he had no compunctions in lying even more, entangling himself in his web of untruths. The court places little weight on Mr Ahmad’s testimony as it was riddled with untruths and contradictions. 93 The court entertains little doubt that Mr Ahmad was an incompetent building manager and/or derelict in his duties. His inordinate delay in obtaining quotations for the MC to stop the flooding and carry out necessary repairs after 30 April 2014 is telling. He was also slow to report previous blockage incidents, such as the one on 24 December 2013. Ahmad paid lip service to his duties as the Defendant’s onsite representative. His claim that he made 6-weekly inspections of the Grease Trap installation as envisaged under item A(a) of the First Schedule to the Management Contract is not believable. It is telling that whenever the MC members inquired as to the foul smell, he brushed them off with his explanation that it was a grease tank issue. Unfortunately, the MC being none the wiser, seemed to have accepted his explanation until 30 April 2014. The court does not accept that the presence of any grease trap installation is synonymous with foul odours. Otherwise, every such system in Singapore would emit foul smells. 94 Unfortunately, the defendant did not have any other employee who had oversight of Mr Ahmad as the other onsite representative of the defendant was a technician who was his subordinate. (a) Was there a duty on the part of the defendant to maintain the Grease Trap? 95 The defendant undoubtedly had a contractual duty under clause 7 of the Management Contract to maintain the Grease Trap installation. However, it would be unreasonable to expect the defendant to discharge this obligationpersonally.As Mr Koh testified (see above at [74]),  it was the responsibility of the defendant to engage competent specialist contractors to carry out maintenance of the fixtures at JFH, not that the defendant should do those works itself. It was not wrong of the defendant to engage the services of JOL in this regard. It bears noting that JOL was a contractor “inherited” from the Developer by the plaintiff. It was neither chosen by the plaintiff nor the defendant. (b) Did the defendant owe any implied duties to the plaintiff over and above those spelt out in the Management Contract? 96 The court does not think implied duties should apply in this case where there are express contractual provisions and there are no gaps or lacuna in the Management Contract to be filled in order to give the contract business efficacy (per Court of Appeal inCAA Technologies Pte Ltd vNewcon Builders Pte Ltd[2017] 2 SLR 940 at [66] andSembcorp Marine Ltd v PPL Holdings Pte Ltd[2013] 4 SLR 193 at [101]). Hence the court answers this question in the negative. (c) Did the defendant disconnect the Grease Trap as the plaintiff alleged? 97 The evidence suggests that the defendant could not have disconnected the Grease Trap installation. As the defendant’s closing submissions pointed out, there was no mention in any of JOL’s service reports in April 2014 that the System had been disconnected134Foot Note 134×See Defendant’s Closing Submissions at para 13.and this was confirmed by Mr Ow Yong during cross-examination.135Foot Note 135×See transcripts of 6 July 2021 at p 42.On the handover date of 8 July 2014, there was no disconnection recorded in the handover list of outstanding work.136Foot Note 136×See AB792. 98 During Mr Ow Yong’s cross-examination, it was established from the court’s questioning that the room where the Grease Trap was located was always locked and access was only available with a key that was kept by the managing agent (see above at [51]). Mr Ow Yong had agreed under cross-examination that Vinco could have disconnected the System, and so could Goodwill if it obtained access to the System using the key held by the managing agent.137Foot Note 137×See transcript of 6 July 2021 at p 41. 99 The neatness of the disconnection (according to the reports of CCBS and Chong) strongly suggests that the disconnection was done deliberately by people who knew exactly what they were doing. By process of elimination, the disconnection could only have been done by a contractor who was familiar with the System with the knowledge and acquiescence of Vinco, who gave access to the room with the key that it held. Ulterior motives may have prompted such conduct. The contractor in question probably hoped to procure the contract to replace the existing system while Vinco may have been prompted by the same motive or even malice (as it fell out with the plaintiff). Unfortunately, the court’s conclusions are purely speculative as there is no evidence to support either surmise. 100 Mr Chong’s report had concluded that disconnection took place between 6 August 2014 and January 2015 as connection works were not included in the quotations submitted by Everrise and Goodwill (see above at [85(e)]). When Goal Link inspected the Grease Trap between 8 to 10 January 2015,138Foot Note 138×See Goal Link’s report dated 16 January 2015, AB318–319.the grease tanks were found to be upright again. Based on the evidence adduced, the court does not disagree with Mr Chong’s conclusion. 101 At this juncture, the court would make an observation. After Goodwill and/or Vinco discovered the disconnection of the grease trap installation in July 2014, the quotations received from contractors increased dramatically. Under the watch of Vinco’s successor Corporate Vision, quotations that the plaintiff received from various contractors between January and September 2015 to dismantle and replace the existing grease trap system with a new one ranged from $130,000 to $267,400. Eventually, the plaintiff incurred $241,796.00 for the replacement. Hadpermanent(as opposed totemporary) repairs been carried out to the existing system immediately or soon after 30 April 2014, the costs involved would have been considerably less. The court’s observation is based on comparing the prices of replacement of the entire System with repair quotations from Everrise ($34,500),139Foot Note 139×See AB350.Goodwill ($36,580)140Foot Note 140×See AB309.and Goal Link ($41,850).141Foot Note 141×See AB316-–317. (d) Did the disconnection in (a) cause the flooding incident on 30 April 2014? 102 The answer would be “no” as it is the court’s finding that the disconnection took place after 30 April 2014 (see [100]). (e) Was the flooding on 30 April 2014 caused by the defendant’s failure to maintain? 103 As the defendant pointed out in its closing submissions, the plaintiff must prove causation in order to succeed in its claim. The defendant submitted that the appropriate test would be the “but for” test applied by the Court of Appeal to determine the issue of causation in contract cases142Foot Note 142×See Defendant’s Closing Submissions at paras 91–94.(Sunny Metal & Engineering Pte Ltd v NgKhim Ming Eric[2007] 3 SLR(R) 782 at [60] and [63]). 104 Applying the “but for” test, it cannot be said that a breach of the express terms of the Management Contract, in particular clause 7, caused the flooding on 30 April 2014. Causation must be proved as a matter of fact and in law. 105 The court finds that it is more likely than not that the flooding incident could have resulted from a combination of unfortunate factors. First, as found by Mr Chong (see above at [86]),  the Grease Trap was undersized in capacity and could not cope with the volume of grease output from the 128 units in the Building. Second, the desilting maintenance was not done often enough but only when there was blockage/chokage–it was corrective and not preventive maintenance that was practised. Third, the defendant/Mr Ahmad failed to carry out any 6-weekly inspections of the installation to ensure that the System was working properly. The pervasive foul smell raised by the MC should have alerted Mr Ahmad that the System (which he failed to check) was not working efficiently. Consequently, it was a combination of factors that may have caused the flooding incident. The court cannot determine on the evidence whether one or two or all three factors caused the flooding incident. It must be borne in mind that the burden is on the plaintiff to prove its claim against the defendant. Notwithstanding the court’s finding that Mr Ahmad was derelict in his duties as the defendant’s on-site representative, it is not for the defendant todisprovethat Mr Ahmad’s dereliction was the cause of the flooding incident on 30 April 2014. The plaintiff has toprovethat his negligence was thecauseof the flooding incident and theresultant loss/damagethat it suffered. The plaintiff did not discharge the requisite burden of proof. (f) Was it reasonable of the plaintiff to replace the entire grease trap installation system for $241,796.00 rather than to repair it? 106 Based on Mr Ow Yong’s testimony, the court does not fault the plaintiff for wanting to replace the entire grease trap system rather than repair it. Indeed, the court fully sympathises with the unenviable position the MC found itself in after 30 April 2014. There was a fear, not unfounded, by the MC that repair of a system that choked frequently and had been submerged in water may not be feasible or enable the system to continue operating permanently again. However, it also bears noting that Goal Link’s report (see above at [44])143Foot Note 143×See AB318–319.confirmed that the ejector and grease tanks were in good general condition. It was the piping works, fittings and attachments (parts of the tanks) that could not be re-used. Mr Ow Yong’s fears of electrical components being damaged by water would appear to relate to the attachments to the tanks. Those of course needed to be replaced. 107 The court finds that the plaintiff should have first arranged for the System to be repaired. It is only when the repaired System failed to function that an entire replacement of the grease trap installation should be carried out. The court accepts the defendant’s submission144Foot Note 144×See Defendant’s Closing Submissions at paras 107–117.that the plaintiff has failed to show that the Grease Trap could not be repaired. 108 Even if the court had found it was reasonable for the plaintiff to replace the entire grease interceptor system, the plaintiff would not have been entitled to its full claim. In its closing submissions, the defendant pointed out the plaintiff replaced: (a) Ejector pumps for $36,000; (b) Sump pumps for $16,000; (c) Mechanical and ventilation system for $43,911; (d) Electrical system for $24,890; (e) Existing ladders with aluminium ladders for $5,200; (f) Grating covers for $6,400; and (g) Waterproofing of the pit for $2,200 when the CCBS report did not state those items had any problems. The plaintiff also obtained 12 months’ warranties for maintenance and servicing for the plumbing and sanitary system ($1,500), ventilation fans ($3,230) and the electrical system ($1,300).145Foot Note 145×See Defendant’s Closing Submissions at paras 128–130. 109 CitingYip Holdings Pte Ltd v Asia Link Marine Industries Pte Ltd[2012] 1 SLR 131, the defendant submitted that the plaintiff was claiming for more compensation that what it was entitled to at law – which is to be put in as good a position as if its property had not been damaged; the court agrees.  Consequently, the plaintiff’s claim for $241,796.00 for the cost of installation of a new grease interceptor to replace the Grease Trap is unjustified and disallowed. (g) Is the defendant liable for the plaintiff’s claim for $118,533.50? 110 The plaintiff’s basis for this claim was a table exhibited in Mr Ow Yong’s AEIC. The defendant objected to its admissibility on the basis of hearsay as Mr Ow Yong was not the maker and he did not know who the maker was. There were no service reports or invoices or payment receipts to support the sums claimed. Moreover, the defendant is not responsible for claims that preceded its appointment as managing agent nor after 8 July 2014 when its services were terminated. As it is not substantiated, the court dismisses the plaintiff’s claim for $118,533.50. (h) Is the plaintiff liable for the defendant’s counterclaim? 111 The plaintiff did not pay the defendant’s outstanding management fees only because its claim exceeded the sum claimed of $24,161.30; it had no other defence. As the plaintiff has failed in its claim, the court awards judgment to the defendant on its counterclaim of $24,161.30 with interest from the date of filing of the defence and counterclaim (5 February 2020) until payment.",
        "Conclusion": "112 The plaintiff’s claim is dismissed with costs to the defendant. The defendant is awarded judgment on its counterclaim with interest and costs. Both sets of costs are on a standard basis.  Taking into consideration the parties’ costs schedules, the court awards the defendant a global sum of $92,000 for both sets of costs (inclusive of disbursement). Lai Siu ChiuSenior Judge Siaw Kheng Boon (Siaw Kheng Boon & Co) for the Plaintiff;Jawharilal Balachandran, Tanmanjit Singh Sidhu s/o Karam Jeet Singh (Ramdas & Wong) for the Defendant."
    }
}