{
    "case_title": "Kwan Yuen Heng vTeo Yong Soon",
    "ncitation": "[2022] SGHC(A) 9",
    "coram": "Chua Lee Ming J (delivering the judgment of the court)",
    "sections": {
        "Introduction": "1 The appellant, Mr Kwan Yuen Heng (“Kwan”), appeals against the judgment entered against him in High Court Suit No 777 of 2019 for $1.621m being the amount of loans extended to him by the respondent, Mr Teo Yong Soon (“Teo”). Both parties have consented to the appeal being decided by the Appellate Division of the High Court consisting of two Judges without hearing oral arguments, pursuant to s 36(1) read with para 2(k) of the Seventh Schedule to the Supreme Court of Judicature Act 1969 (2020 Rev Ed) (“SCJA”), and para 1(b) of the Eighth Schedule to the SCJA. 2 As the trial judge (the “Judge”) noted in his judgment (the “Judgment”), this was an acrimonious dispute in which both parties offered wildly different versions of events:Teo Yong Soon v Kwan Yuen Heng[2021] SGHC 112 at [3].",
        "Teo’s claim": "3 Kwan works in the finance industry and Teo runs a business in renovation, construction and goods trading. They were friends who had known each other since 1997. They also had several commercial dealings with each other. Kwan had engaged Teo to carry out renovation works on three of his properties. Teo and his wife invested $200,000 with Kwan in 2008, making a profit of $$89,350 within a year. In 2013, an arrangement was reached for Teo to broker property deals for Kwan’s clients although Teo’s efforts did not yield any results. 4 Teo claimed that he had made seven interest-free friendly loans (the “Loans”) to Kwan as follows: Loan No.DateAmount ($)113 November 2014500,000216 January 2015400,000330 June 201555,000411 July 2015245,000517 December 201515,00067 September 2016372,000720 October 201734,000Total1,621,000 There was no written documentation for the Loans. According to Teo, at the material times, Kwan was the director and shareholder of Quann Investments Pte Ltd together with his wife, and Kwan had requested Loans Nos 1–4 and 6 because he needed to make refunds to investors, Loan No 5 because he needed to pay staff salaries and Loan No 7 because he needed to pay legal costs. The amount for each loan was handed to Kwan in cash. Kwan denied having taken the Loans. 5 It was not disputed that Kwan gave Teo the following cheques: DateAmount ($)113 November 2016300,000218 July 201710,000322 July 201777,000412 October 2017757,000510 November 2017226,000610 December 2017251,000Total1,621,000 6 According to Teo, Kwan gave him these cheques as payments for the Loans. Teo said that he did not present the cheques for payment because on each occasion, Kwan told him not to do so until Kwan received funds. In his defence, Kwan pleaded that he had issued the cash cheques (and other cheques) because Teo compelled him to issue the cheques as collateral for amounts allegedly owed to Teo and that Teo would never encash the cheques.",
        "Kwan’s defence": "7 Kwan denied having taken the Loans. According to Kwan, he took the following interest-bearing loans from Teo: (a) A loan of $250,000 in June 2015 (the “$250,000 Loan”), on which interest was payable at $25,000 per month.1Foot Note 1×Defence (Amendment No 1) at para 30.In his defence, Kwan described this as a “loan of $250,000”; at the same time, he also pleaded that the first interest payment of $25,000 was deducted from the amount borrowed and therefore “the principal amount to be repaid was $275,000”. Kwan claimed that he subsequently paid the interest for the next three months from July to September 2015.2Foot Note 2×Defence (Amendment No 1) at para 32. (b) A loan of $29,800 in October 2015 (the “$29,800 Loan”), of which $25,000 was used to pay the interest on the $275,000 Loan for October 2015, $3,874 was used to pay the first month’s interest on the $29,800 Loan (at 13%) and $926 was kept by Teo as “coffee money”.3Foot Note 3×Defence (Amendment No 1) at para 34. (c) A loan of $300,000 in November 2015 (the “$300,000 Loan”), from which $45,000 was deducted as payment of interest for the first month and $10,000 was kept by Teo as “coffee money”.4Foot Note 4×Defence (Amendment No 1) at para 35. (d) A loan to pay $28,874 being the total interest on the $275,000 Loan and the $29,800 Loan for November 2015, purportedly extended by Teo to cover the interest.5Foot Note 5×Defence (Amendment No 1) at para 36.In his defence, Kwan stated that interest was payable on this loan at 13% but did not state when this loan was taken, or how much the loan amount was, or whether the first month’s interest was deducted from the loan amount. 8 Kwan claimed that between July 2015 and April 2018, he paid Teo a total amount of $1,497,000 as follows: DateAmount ($)July – September 201575,000December 201560,000January 2016120,000February 201660,000March 201623,200April 201656,000June 201663,000July 201641,000August 201656,000September 201656,500November 201661,500December 201662,500January 201763,000February 201772,800August 2017139,500April 2018487,000Total1,497,000 9 Teo denied Kwan’s allegations as set out in [7] and [8] above. 10 Kwan’s alternative defence was that Teo was operating as an unlicensed moneylender at all material times and the Loans were therefore not recoverable pursuant to s 14(2) of the Moneylenders Act (Cap 188, 2010 Rev Ed) (“MLA”).",
        "The Judge’s findings": "11 The Judge found that Teo did make the Loans to Kwan, the Loans were interest-free, Kwan failed to prove that he had made any repayments to Teo. Teo was not an unlicensed moneylender, and the Loans were therefore enforceable. Accordingly, the Judge entered judgment in favour of Teo for the sum of $1,621,000.",
        "Issues in this appeal": "12 In this appeal, Kwan challenges the Judge’s finding that: (a) the Loans were made to Kwan; and (b) Teo was not an unlicensed moneylender.",
        "The Judge’s finding that Teo did make the Loans": "13 Kwan submits that the Judge applied the wrong test as to the burden of proving the Loans. Kwan submits that the Judge appeared to be influenced by his view that Teo’s version of events was more probable than Kwan’s version of events. 14 It cannot be disputed that the burden was on Teo to prove on a balance of probabilities that he made the Loans to Kwan. This means Teo had to show that his case was more probably true than not, and not that his case was more probable than Kwan’s:Clarke Beryl Claire (personal representative of the estate of Eugene Francis Clarke, deceased), v SilkAir (Singapore) Pte Ltd[2002] 1 SLR(R) 1136 at [58]. 15 The Judge did state at one point in his judgment that Teo’s version of events was clearly more probable than Kwan’s. However, after analysing the evidence, the Judge concluded “on a balance of probabilities that Teo’s version of events [was] true” (Judgment at [34]). It is clear to us that the Judge applied the correct test. 16 Kwan next submits that the Judge was wrong in his assessment of the evidence. 17 It is trite that where the appeal largely involves the evaluation of the Judge’s finding of facts below, the appellant needs to show that the trial judge’s assessment is plainly wrong or against the weight of the evidence:Tat Seng Machine Movers Pte Ltd vOrix Leasing Singapore Ltd[2009] 4 SLR(R) 1101 at [41]. 18 The Judge found that Teo did make the Loans to Kwan for the following reasons: (a) The bank statements of Teo’s and his wife’s accounts showed cash withdrawals matching the Loans, save for Loan No 3 ($55,000) in respect of which the bank statement showed a cash withdrawal of $53,000. The Judge accepted Teo’s evidence that the balance $2,000 came from cash that he had in hand. These statements supported Teo’s evidence as to the dates and quantum of the Loans. (b) The total amount on the six cheques that Kwan had issued to Teo, matched the total amount of the Loans. These cheques were important evidence that pointed towards an intended repayment of the Loans by Kwan. (c) The Judge accepted Teo’s evidence that he did not ask for loan documentation because of his relationship with Kwan then. (d) Kwan’s Citibank account showed a balance of $3,174.31 on 1 July 2015 and a cash deposit of $250,000 on 13 July 2015. This supported Teo’s claim that he loaned $245,000 to Kwan on 11 July 2015 (Loan No 4). Kwan could not proffer a good explanation for the cash deposit. (e) The Judge rejected Kwan’s version of the loans that he allegedly took from Teo. Kwan’s version was contradicted by his own police report against Teo dated 25 June 2018 as to  (i) the first loan amount that he claimed to have borrowed from Teo, (ii) the total amount that he claimed to have borrowed from Teo, and (iii) the total amount that he claimed to have paid to Teo. In the police report, Kwan also claimed that he was forced to issue a cheque for $500,000 to Teo but there was no evidence of any such cheque. The Judge found these inconsistencies to be stark especially since Kwan claimed to have a spreadsheet (which he did not produce) recording the cash loans from Teo and his repayments in cash to Teo. In addition, Kwan gave inconsistent versions of the amounts he borrowed from Teo in his defence, his affidavit of evidence-in-chief and his oral testimony.  The Judge found that Kwan’s inconsistencies and explanations for the inconsistencies damaging to his credibility. 19 Kwan’s explanation for the six cheques that he gave to Teo was that he had been made to issue cash cheques to Teo regularly as collateral for the interest-bearing loans that he took from Teo, which were rolled into new loans each time Kwan failed to meet a payment. Kwan relied on WhatsApp messages which showed Teo reminding him to issue cheques for specified sums on specified dates. Teo explained that the messages referred to a loan that Kwan had taken from Malaysian loan sharks. Teo testified that Kwan continued to ask Teo for loans after end-2017. Teo informed Kwan that he was unable to extend any more loans to Kwan and at Kwan’s insistence, Teo asked his Malaysian friends who were loan sharks to lend Kwan $800,000 (the “Malaysian Loan”). Teo acted as a middleman between Kwan and the Malaysian loan sharks. 20 Kwan disputed the Malaysian Loan. However, the Judge accepted Teo’s explanation and found that the WhatsApp messages had nothing to do with the Loans. The amounts mentioned in the messages did not correspond to either party’s account of the amount of the loans given by Teo to Kwan. The messages also made numerous references to a third party. One message from Teo reminded Kwan that the moneys were owed to “them” and “they are not as good like me”. In another message, Teo told Kwan that he was “just getting [f––] from them”. Further, the messages were for the period from end 2017 to 2018,ie, after the last of the Loans given by Teo to Kwan on 20 October 2017. 21 We are satisfied that the Judge’s finding that Teo did make the Loans to Kwan cannot be said to be against the weight of the evidence or plainly wrong. In particular, we agree with the Judge that the six cheques issued by Kwan were strong evidence of the Loan. The Judge (in our view, correctly) rejected Kwan’s explanation for these cheques. In addition to the inconsistencies that were noted by the Judge, Kwan failed to produce any record of the alleged loans and payments. Neither did Kwan explain how his alleged repayments related to his version of the loans. Kwan claimed to have a spreadsheet containing such records, but no such spreadsheet was produced in court.",
        "The Judge’s finding that Teo was not an unlicensed moneylender": "22 Kwan submitted that the presumption in s 3 of the MLA applied because Teo had only ever made interest-bearing loans to him. However, Kwan’s version of interest-bearing loans from Teo had been rejected. Kwan’s reliance on the WhatsApp messages referred to in [19] and [20] above did not help him as these messages referred to the Malaysian Loan. There were no WhatsApp messages from Teo referring to or demanding payment of interest during the entire period from 13 November 2014 (Loan No 1) to 20 October 2017 (Loan No 7). There was no other evidence that Teo had extended interest-bearing loans to Kwan. The six cheques given by Kwan to Teo only covered the total principal amount of the Loans. 23 In the circumstances, the Judge’s finding that Teo was not an unlicensed moneylender was clearly not against the weight of the evidence.",
        "Conclusion": "24 We dismiss the appeal for the above reasons. We order the appellant to pay costs to the respondent fixed at $20,000 inclusive of disbursements. Quentin LohJudge of the Appellate DivisionChua Lee MingJudge of the High Court Lua Wei Liang Wilbur and Zhu Yujia (Covenant Chambers LLC) for the appellant; Cheah You Yuan, Suriya Prakash Uthayasurian and Uthayasurian s/o Sidambaram (Phoenix Law Corporation) for the respondent."
    }
}