{
    "case_title": "The “Sevilla Knutsen”",
    "ncitation": "[2022] SGHC 20",
    "coram": "S Mohan J",
    "sections": {
        "Facts": "1 At the approximate coordinates of Latitude 06o 21’ 12” N, Longitude 143o 04’ 047” E lies the small Western Pacific island atoll known as Eauripik (see Figure 1 below).  Figure 1: Satellite photo of Eauripik 2 According to Wikipedia, Eauripik has a total land area of only approximately 24 hectares. The coral reef which creates the atoll encloses a deep lagoon with an area of approximately 6km2.1Foot Note 1×Wikipedia(accessed 13 December 2021).Eauripik is a municipality of the island state of Yap, which in turn is part of four island states that make up the Federated States of Micronesia (“FSM”). The islands that make up the FSM, including Eauripik, are located in the Pacific Ocean close to the Marianas Trench where water depths can reach several thousand feet. The islands in the FSM including Eauripik are, some might say, home to some of the most biodiverse and beautiful coral reefs in the world. In the course of the proceedings before me, various epithets were used to describe the reef in question in Eauripik. For example, counsel for the plaintiffs, Mr Leong Kah Wah, described the reef as a “National Geographic standard” reef.2Foot Note 2×Transcript (2 November 2020) at p 6 (lines 22 to 23).I reproduce, at Annex 1 of this judgment, a selection of underwater photographs depicting sections of the reef located on the western leeward side of Eauripik (the “Reef”). 3 The Reef is characterised by a reef crest (or reef top) which slopes down seaward towards a reef wall. The reef wall extends downwards very steeply, in some parts almost vertically, to depths of at least 35m;3Foot Note 3×Nicole L Crane’s first Affidavit of Evidence-in-Chief (“AEIC”) dated 13 May 2020 (“NC1”) at p 7.given where Eauripik is located, it is likely that the Reef wall extends downwards to depths far beyond those visible to the naked eye. According to the plaintiffs’ expert, the Reef has exceptionally high biodiversity, high coral cover and high fish biomass.4Foot Note 4×Transcript (4 November 2020) at pp 56 (lines 14 to 17) and 57 (lines 5 to 11). 4 On 17 April 2017, the Liquefied Natural Gas carrier “SEVILLA KNUTSEN” (“Vessel”), whilst in the course of her ocean passage, struck the west-facing leeward side of the Reef at several locations, causing damage to it (the “Incident”). Figure 2 below is a screenshot from aerial drone video footage taken some seven weeks after the Incident and gives some visual indication of the damage caused by the Vessel to the Reef. The damaged areas are visible as white “scars” appearing on the outline of the Reef, and are denoted by the red arrows. There were a total of ten scars caused by the Incident. Using Figure 1 above (at [1]) as a reference, the damage occurred at the west-facing edge of the Reef on the left side of the photograph.  Figure 2 5 The plaintiffs in HC/ADM 91/2017 (“ADM 91”) are Jesse Remalmog, John Haglelgam and Santus Sarongelfeg. Collectively, they are the traditional leaders, or Chiefs, of Eauripik and represent its people. ADM 91 is an admiralty actioninrembrought by the plaintiffs against the defendant, the owner of the Vessel, seeking compensation as a result of the damage caused to the Reef by the Incident. It is accepted by the parties that (a) the law of FSM governs the plaintiffs’ claim in tort, and (b) under FSM law, the plaintiffs as the traditional Chiefs of Eauripik possess the requisite standing to bring this action against the defendant in their representative capacities on behalf of the people of Eauripik. 6 It is also common ground that (a) FSM law recognises a cause of action for damages in tort arising from negligent damage to a reef, and (b) that the people of Eauripik are entitled to sue (through their traditional Chiefs) based on a shared traditional and collective ownership right to use, and benefit from, the marine coral reef’s natural resources.5Foot Note 5×Plaintiffs’ Closing Submissions dated 26 May 2021 (“PCS1”) at para 6. 7 On 14 February 2019, the plaintiffs and the defendant entered into an agreement under O 70 r 34 of the Rules of Court (2014 Rev Ed) (“ROC”) to settle liability, which agreement was filed and accepted as an order of Court. Pursuant to that agreement, the defendant admitted 100% liability for the Incident. The hearing before me concerns a claim on reference brought pursuant to O 70 rr 40 and 41 of the ROC to assess the damages due to the plaintiffs as a result of the Incident. 8 The issues that arise in this claim on reference are not particularly complex but they belie the gulf between the parties as to the appropriate level of compensation the plaintiffs are entitled to. To give a flavour of the extent of the divergence in the parties’ positions, the plaintiffs seek an award of damages in the sum of approximately US$6.57m whereas the defendant contends that it should be no more than US$500,000.6Foot Note 6×PCS1 at para 164; Defendant’s Closing Submissions dated 26 May 2021 (“DCS1”) at paras 267 to 270. 9 Before I turn to the main issues for determination, it would be useful to first summarise the somewhat unusual procedural history surrounding this dispute which, by reason of the course it took, has resulted in this court deciding a claim for the people of Eauripik for tortious compensation, under FSM law, that has no connection to Singapore other than the fact that the Vessel was arrested by the plaintiffs here.",
        "Procedural history": "10 On 23 June 2017, the plaintiffs commenced ADM 91 and arrested the Vessel in Singapore. The Vessel was released on 27 June 2017 after the defendant provided security, under protest, by way of a letter of undertaking (“LOU”) from its Protection and Indemnity insurers (“P&I Club”) in the sum of US$9,247,220 (inclusive of interest and costs). 11 On 13 July 2017, the plaintiffs filed HC/SUM 3223/2017 (“SUM 3223”) seeking an order to stay their own action in ADM 91 in favour of the FSM on the grounds offorum nonconveniens. In response, the defendant commenced proceedings against the plaintiffs in the English courts seeking an anti-suit injunction against the plaintiffs to prevent the commencement or prosecution of legal proceedings in respect of the plaintiffs’ claim otherwise than before this court; the basis of the defendant’s application was that the LOU by its terms required the plaintiffs to only prosecute their claim in this court. An interim, and subsequently final, anti-suit injunction was granted by the English court in favour of the defendant. The English court also made a costs order in the defendant’s favour for the sum of £51,830 (the “UK Costs Order”). On 13 February 2019, an assistant registrar of the Supreme Court of Singapore ordered, pursuant to O 14 r 5 of the ROC, that judgment be entered for the defendant against the plaintiffs on its counterclaim for the UK Costs Order (with interest at 8% per annum calculated from 6 February 2018 until payment of the principal sum) and costs of $6,000 (the “Counterclaim Judgment”). 12 As a consequence of the English court’s anti-suit injunction against the plaintiffs, the plaintiffs decided to withdraw their stay application in SUM 3223 and were granted leave to do so on 27 October 2017. Thus, ADM 91 would continue on its course. 13  On 22 January 2018, the defendant requested for the plaintiffs’ agreement to a moderation of the amount of security that had been furnished. The plaintiffs agreed and the defendant furnished a fresh P&I Club letter of undertaking in the sum of US$5,034,647 (inclusive of interest and costs) in substitution for the LOU first furnished (see [10] above). 14 As stated at [7] above, on 14 February 2019, the defendant admitted liability. Parties also agreed that the quantum of the plaintiffs’ claim was to be assessed by way of a claim on reference, and for the costs of the action to be taxed if not agreed and paid by the defendant to the plaintiffs. 15 I heard the plaintiffs’ claim on reference over the course of two tranches. The first tranche was from 2 to 5 November 2020. Shortly before the hearing was to commence, in a letter dated 28 October 2020, the defendant’s solicitors PDLegal LLC wrote to the plaintiffs’ solicitors Rajah & Tann Singapore LLP making an open offer to the plaintiffs to pay a sum of US$750,000, after setting off the defendant’s Counterclaim Judgment, in full and final settlement of all claims, counterclaims and/or liabilities, whether known or unknown, that each party had arising out of and in connection with ADM 91. The offer was expressed to be an open global offer and the defendant expressly reserved its right to seek indemnity costs against the plaintiffs under O 59 of the ROC. On the first day of the hearing, the letter was brought to my attention, the fact of the offer having been made was placed on the record and the letter was marked as a defendant’s exhibit. The offer was not accepted by the plaintiffs and the hearing continued. 16 On the first day of the expert witnesses’ evidence, which was given by way of an expert witness conference, it transpired that the plaintiffs intended to put forward a revised set of measurements on the area of damage caused by the Incident and to adduce supplemental evidence from the plaintiffs’ expert to support the revised measurements. It was eventually agreed that pending the plaintiffs formally amending their pleadings and adducing further evidence in support of their amended case, and the defendant responding accordingly, the evidence of the expert witnesses on,inter alia, the issue of the extent of damage to the Reef would be postponed and further hearing dates fixed after matters had been regularised.7Foot Note 7×Transcript (4 November 2020) at pp 72 to 75.In the meantime, the hearing continued but the experts limited their evidence to issues pertaining to the nature of the Reef and its characteristics. The plaintiffs subsequently obtained leave to amend their Claim on Reference and to adduce further evidence from their experts, with the defendant being given consequential leave to file an amended Defence to Claim on Reference and responsive expert evidence. The second tranche of the hearing took place on 18 and 19 March 2021 and the experts gave their evidence on the remaining issues that had been held over from the first tranche.",
        "The parties’ cases": "17 The parties agree that the Incident left ten distinct scars on the Reef (see Figure 2 above at [4]). In this judgment, the scars will be referred to as Scars 1 to 10, with Scar 1 being the northernmost scar and Scar 10 the southernmost. It is also not in dispute that Scars 1 to 5 represent the more significant damage to the Reef, as is apparent just from the relative sizes of these scars. For all the scars, the “layer of living coral” was “scraped completely off”, leaving “large chunks of reefs dislodged, and cracks in the remaining underlying structure”.8Foot Note 8×Claim on Reference (Amendment No 2) dated 14 January 2021 (“COR2”) at para 8(3).I reproduce at Annex 2 of this judgment a selection of photographs depicting some of these scars from which it can be seen that the coral has either been completely or partially sheared or scraped off down to the Reef’s white calcium substrate. 18 The plaintiffs contend that the ten scars and/or gouges (the “Direct Impact Scars”) can be divided into seven groups or distinct zones known as “Impact Zones”, namely Impact Zones A to G.9Foot Note 9×COR2 at paras 8(3A) to 8(3C); Transcript (18 March 2021) at pp 27 (lines 10 to 25) to 29 (lines 1 to 4).In addition to the area of the Direct Impact Scars, these Impact Zones also represent (a) further damage that existsbelowthe Direct Impact Scars, largely due to what is termed as the “avalanche effect” of coral rubble/dislodged coral having been sheared off at the locations of the Direct Impact Scars and cascading down the Reef wall to a depth of at least 28m, thereby causingsecondarydestruction/damage to the corals on the Reef wall, and (b) further damage that existsbetweensome of the Direct Impact Scars, namely Direct Impact Scars 1 to 4. The plaintiffs’ current pleaded case is that the total area of damage, comprising the ten Direct Impact Scars and the seven Impact Zones, is 5,478.46m2.10Foot Note 10×COR2 at para 8(3C). 19 For completeness, the plaintiffs also refer to a Total DamageFieldArea of 9,862.72m2.11Foot Note 11×COR2 at para 8(4).This represents thetotal areabounded within all ten scars and seven Impact Zones, bearing in mind that the scars are not immediately adjacent to each other but some distance apart, as can be seen in Figure 2 (above at [4]). The Total Damage Field Area is arrived at by multiplying the total length between the extremities of all ten scars (ie, 352.24m) by a flattened width of 28m. The plaintiffs’ pleaded claim, however, isnotadvanced on the basis of theTotal Damage FieldArea; nor are the plaintiffs advancing their claim on the basis of theTotal Damage Field.12Foot Note 12×PCS1 at para 97.As stated in the preceding paragraph, the plaintiffs’ pleaded claim is based on an area of damage of 5,478.46m2. 20 The defendant, represented by Mr Ramachandran Raghunath Doraisamy as lead counsel, does not dispute that the Reef was damaged as a result of the Incident. It does however vigorously dispute theextentof the damage to the Reef said to be caused by the Incident. According to the defendant’s calculations and based on its expert’s evidence, the total area of the Reef that was damaged (including all the Direct Impact Scars and any damage on the Reef wall) is only approximately 742m2.13Foot Note 13×Defence to Claim on Reference (Amendment No 3) dated 20 March 2021 (“DCOR3”) at paras 8(a) and 10(e); Gregory Edward Challenger’s first AEIC dated 30 June 2020 (“GEC1”) at p 22.The defendant’s expert is adamant that beyond this, no further damage to the Reef was observed, whether on the Reef top or on the Reef wall. The defendant avers that the loss and damage asserted by the plaintiffs is manifestly exaggerated.14Foot Note 14×DCOR3 at para 10. 21 As for the monetary value to be ascribed to the damage to the Reef, both parties accept that based on FSM caselaw precedent, the court has a discretion to decide how much, in US dollars per square metre, the Reef is worth. This is an exercise to be undertaken based on a consideration of the evidence and various factors that have been alluded to in a number of FSM court judgments. There is some disagreement between the parties on the relevance or applicability to this case of some of these factors, and I will address these points in greater detail later in this judgment. 22 In essence, the plaintiffs claim that a valuation of US$1,200 per square metre for the Reef is appropriate, based on the “features of the coral reef damaged” including the “ecological and cultural significance of the damaged reef, the type of corals affected and density of the coral cover destroyed, as well as inflation”.15Foot Note 15×COR2 at para 10(3). 23 For completeness, while the plaintiffs had advanced a number of alternative methods of valuation in earlier iterations of their Claim on Reference, such as commodity value, contingency value, cost of replacement/restoration and a hybrid valuation method, these alternative bases of valuation were dropped by the plaintiffs in the latest version of their Claim on Reference (Amendment No 2) filed on 14 January 2021. Mr Leong confirmed that the plaintiffs’ case on valuation is based on and limited to a US dollar valuation per square metre of damage which can be accepted by the court.16Foot Note 16×Transcript (18 March 2021) at pp 10 (lines 20 to 25) to 11 (lines 1 to 8). 24 Mr Doraisamy on the other hand argues that under FSM law, the plaintiffs are entitled to be compensated on the basis of either diminution in value of the damaged property or the cost of replacement, whichever isless. With regard to ascribing a value to the Reef, the defendant submits that on the basis of FSM caselaw precedent, thecapon the value of a reef in FSM is US$600 per square metre. It contends that in this case, and for a variety of reasons, including the fact that Eauripik is an outer island atoll with fewer inhabitants and that these inhabitants rely on the Reef’s resources only for subsistence (as opposed to commercial exploitation), the valuation of the damaged areas of the Reef should be no more than US$251.85 per square metre; as justification for this figure, the defendant relies on one particular case decided by the FSM courts.17Foot Note 17×DCOR3 at para 10(d).Alternatively, the defendant claims that the compensation the plaintiffs are entitled to should not exceed US$500,000 (ie, the cost of restoring the damaged portions of the Reef). This is a figure put forward by the defendant’s expert as the cost to restore the damaged parts of the Reef. Restoration in this context involves replacing the damaged or destroyed corals with at risk or dislodged corals recovered from other parts of Eauripik and re-attaching them to the damaged sections of the Reef, thereby allowing the damaged Reef to recover and regenerate itself in time.",
        "Issues to be determined": "25 From the potted summary above of the parties’ cases, it can be seen, and indeed is common ground between the parties, that the two main issues that arise for my consideration in this claim on reference are: (a) what is the area (in square metres) of the damage caused to the Reef by the Incident (“the Damage Issue”); and(b) what is the value (in US$) of the area of the Reef damaged by the Incident (“the Valuation Issue”). 26 As I mentioned at [8] above, while both issues are, in and of themselves, not particularly complex, the parties’ positions on both issues are sharply divided.",
        "Issue 1: The Damage Issue": "27 Both parties engaged experts to measure and opine on the area of damage. The plaintiffs engaged Professor Nicole L Crane (“Professor Crane”), a marine biologist and faculty member of Cabrillo College (Biology Department) in California. Aside from her teaching responsibilities, Professor Crane is also a Project Co-Leader for an ocean conservation project known as One People One Reef (“OPOR”). The OPOR project is a collaboration between a multidisciplinary science team and communities in the outer islands of Micronesia (including the FSM) that work on ocean conservation and management initiatives. Part of the work that OPOR undertakes involves conducting reef surveys and assessments.18Foot Note 18×NC1 at para 4.Professor Crane attended at the Reef site on 9 June 2017, some seven weeks after the Incident, together with other members of the OPOR project team (“OPOR Team”). Professor Crane was personally involved in the survey of the damage of the Reef and also directed and coordinated the survey of the Reef by members of the OPOR Team.19Foot Note 19×NC1 at para 6.The OPOR Team was not commissioned or instructed specifically to undertake the damage survey to the Reef. OPOR happened to be on an expedition to survey reefs in the outer islands of Yap and were requested by the people of Eauripik to assess the damage to the Reef. 28 The defendant engaged Mr Gregory Challenger (“Mr Challenger”) as its expert. Mr Challenger is a senior marine scientist and ecologist and the President of Polaris Applied Sciences Inc (“Polaris”), with 35 years of experience in “natural resource assessment and restoration”.20Foot Note 20×GEC1 at para 1.Mr Challenger and his team attended at the Reef from 21 to 23 November 2017, some seven months after the Incident. As part of the brief, Polaris was instructed to provide coral reef technical expertise, as well as an assessment of the condition of the Reef, its restoration potential, consequences of the injuries from the Incident and recovery projections.",
        "Professor Crane’s evidence": "29 According to the OPOR Team’s preliminary assessment in 2017, the Incident appeared to be a series of “scrapes” where the Vessel “bounced along” the Reef and struck it repeatedly. Some of the impact areas resulted in gouges on the Reef (indicating a more direct impact) while others were a glancing blow, shearing off reef material. The living coral material that was scraped off fell down the Reef wall in debris flows, creating an “avalanche”;21Foot Note 21×Nicole L Crane’s fourth AEIC dated 18 February 2021 (“NC4”) at p 6; NC1 at pp 17 to 18.this was explained by Professor Crane in the following terms:22Foot Note 22×Transcript (18 March 2021) at pp 14 (lines 16 to 25) to 15 (lines 1 to 3). Professor Crane: So we are looking at very steep reef from this picture. This is a picture from deep around the reef that shows you the near vertical nature of this reef. Here is a diver here for context. We cannot see how steep this reef is. So I want to point out with these pictures that damage to this portion of the reef when it is sheered [sic] off, it doesn’t disappear. So many kilos or pounds of material that is scraped off the surface of this reef is going to fall and it will fall down the face of the reef. And this will cause what we have termed as an avalanche effect, or a landslide effect, and not unlike what will happen out here on land. 30 The OPOR Team mapped out rough polygons and recorded the latitude and longitude of each scar.23Foot Note 23×NC1 at p 8.It measured the total area of the scars as 1,178m2. However, the plaintiffs contend that these measurements did not include a significant amount of damage that had occurred down the Reef wall. During the survey, the OPOR Team had also noted that below the direct impact scar areas, broken coral and rubble fields were seen to depths of at least 28m.24Foot Note 24×NC1 at p 11.As the OPOR Team did not have adequate diving equipment to safely dive to depths close to or beyond 30m or to stay at those depths for very long, the actual area of damage noted and measured by OPOR was limited to the damage to the reef top.25Foot Note 25×Nicole L Crane’s fifth AEIC dated 14 March 2021 (“NC5”) at pp 5 to 6.The other areas of damage on the Reef wall were either photographed or recorded on video by the OPOR Team. 31 Subsequently, in or about October 2020, Professor Crane re-analysed the aerial drone imagery of the Reef using a software known as ImageJ and re-calculated the measurements of the damage to Direct Impact Scars 1 to 5; these revised calculations were, according to Professor Crane, limited to the damage on theReef top only,ie, they served as a refinement of the OPOR measurements done in 2017. ImageJ is an open-source image processing/analysis software designed for multidimensional imaging that utilises photogrammetry. Professor Crane used the ImageJ software on Figure 3 below. According to Professor Crane’s evidence, this aerial image was taken while the drone was directly above the Reef, and therefore the camera was facing directly downwards on to and capturing the full length of the damage field.26Foot Note 26×NC4 at p 14.Mr Challenger disputes this assertion, and I will explain the relevance of this point below.  Figure 3 Using the known length of the boat visible on the left side of Figure 3 above (circled in red) of 6.5m, ImageJ is able to appropriately scale the length of the scars. The total length of the damage field differed slightly from the preliminary OPOR measurements. It was assessed using ImageJ at a shorter distance due to latitude and longitude fixes and some of the scars had updated measurements as there was better spatial visibility of the scars in the aerial imagery. This resulted in a smaller area measured for the scars on the Reef at 1,091m227Foot Note 27×NC4 at pp 17 to 19; Transcript (18 March 2021) at pp 22 to 25 (lines 1 to 2).as compared to 1,1178m2 in the OPOR 2017 measurements. 32 Professor Crane then utilised Figure 4 (reproduced at [34] below) to explain the plaintiffs’ current case of a total damage area of 5,478.46m2. This damage area comprises (a) Direct Impact Scars 1 to 10 (with Direct Impact Scars 1 to 5 re-calculated using ImageJ), (b) the damage along the Reef wall beneath Direct Impact Scars 1 to 5 as a result of the “avalanche effect” and (c) secondary damage in between Direct Impact Scars 1 to 4. 33 The area of damage at, below and between Scars 1 to 4 are categorised by the plaintiffs as Impact Zone A while the area of damage at and below Scar 5 is identified as Impact Zone B.28Foot Note 28×COR2 at paras 8(3B) and 8(3C).The damage that is alleged to have been caused at Impact Zones A and B was calculated by Professor Crane using aflattenedwidth of 28m (ie, see the line marked as “3” in Figure 4 below). According to Professor Crane, using a flattened width of 28m was conservative. Professor Crane explained that 28m was a depth that could be verified from the diving depth data in some of the dive computers of the OPOR Team and the divers’ logs/notes. That was also the average depth to which the divers with scuba diving gear descended when taking photographs and video recordings of the damage. However, the OPOR Team had visually observed damage at depthsgreaterthan 28m. Nonetheless, Professor Crane’s calculations were limited to a depth (or flattened width) of 28m and hence conservative.29Foot Note 29×NC4 at p 18; NC5 at p 6; Transcript (18 March 2021) at pp 63 (lines 13 to 22), 64 (line 10) to 66 (line 4).Using the ImageJ-based re-calculations, the damage to Impact Zones A and B was assessed at 4,887.80m2 and 481.66m2 respectively.30Foot Note 30×COR2 at paras 8(3B) and 8(3C). 34  As for the damage at Scars 6 to 10 (categorised as Impact Zones C to G), due to insufficient objective data, the original measurements from the OPOR assessment undertaken in June 2017 were maintained; these gave a combined area of 109m2.31Foot Note 31×PCS1 at paras 88 and 92; Transcript (18 March 2021) at p 27 (lines 21 to 25).The sum of the damage to Impact Zones A to G is 5,478.46m2.32Foot Note 32×COR2 at para 8(3C); NC4 at p 19 (and Figure 16).  Figure 4 35 Professor Crane’s evidence is that even the revised estimate of 5,478.46m2 is itself likely to be an underestimate of the actual damage. While the OPOR Team observed additional significant damage down the Reef wall below all the scars evenbeyond28m, this additional damage was not surveyed or documented due to the lack of specialised diving equipment to allow the team to dive safely for any prolonged periods at depths of 30m and greater.33Foot Note 33×Transcript (18 March 2021) at pp 14 to 18.",
        "Mr Challenger’s evidence": "36 Polaris used two methods to compute the damage area measurements: downward-looking scaled photomosaic images, and underwater length and width measurements using what is known as the “fishbone technique”.34Foot Note 34×GEC1 at p 16.Both methods are used to assist in computing the areas of three-dimensional objects as if they are two-dimensional polygons. Mr Challenger described the photomosaic imaging method as follows: [A] measuring tape was carefully placed around the perimeter of the injury and a series of overlapping photographs are taken from 90˚ above the injury. These photographs were stitched together using Agisoft PhotoscanTM software, scaled using the measured perimeter and known reference materials (i.e. m2 quadrats), and digitized for area calculations using ArcMapTM GIS software. The rendered image provides a base for subsequent spatial analysis and display. The fishbone estimate technique was explained as follows: [This] use[s] a measuring tape centerline as a backbone across which numerous cross section measurements are taken creating a diagram that resembles a fish bone. The outer edge of the evidence of scarring from the vessel hull is included in the perimeter. The area of the scar is calculated using the sum of incremental length and width measurements or the average widths of equidistant measurements multiplied by the overall length … 37 Rough sea conditions persisted on the site for the duration of the assessment and the resulting swells did not allow divers to reliably deploy perimeter tapes or collect steady overhead images for photomosaic production for each injury area. As a result, Polaris measured each area using the fishbone method and successfully used the photomosaic technique on two injury sites when conditions permitted for corroboration.35Foot Note 35×GEC1 at p 22. 38 The Polaris measurements yielded an area of damage of 742m2, bound by length and width rectangles with an area of 1,022m2.36Foot Note 36×GEC1 at p 22; Gregory Edward Challenger’s third AEIC dated 5 March 2021 (“GEC3”) at p 6.Mr Challenger gave evidence that Polaris measured “to the edge of where [they] saw coral that was denuded, including not just completely denuded but damaged”.37Foot Note 37×Transcript (18 March 2021) at p 52 (lines 21 to 25).Critically, he said that they “saw no injury beyond the depth [they] dove” and that they had dived beyond the depth where they could discern injury. In other words, the Reef wall below had live corals and no obvious signs of injury.38Foot Note 38×Transcript (18 March 2021) at p 113 (lines 1 to 5).He also stated that “[a]ll visible scars, including those extending partway down the [Reef] wall in some locations have been included in [his] measurements”.39Foot Note 39×GEC3 at p 6.",
        "The parties’ arguments": "80 As I noted above (at [23]), the plaintiffs had advanced a number of alternative methods of valuation in earlier iterations of their Claim on Reference. For instance, in their Claim on Reference (Amendment No 1) dated 20 October 2020, the plaintiffs advanced a claim based on a hybrid valuation approach, which adopted the mid-point of the cost of replacement and restoration of the coral destroyed and the value of the total damage field area.101Foot Note 101×Claim on Reference (Amendment No 1) dated 20 October 2020 at para 10.4(5). 81 However, following the plaintiffs’ amendments to their pleadings after the first tranche of the hearing, the plaintiffs’ Claim on Reference (Amendment No 2) pleads a claim based on a valuation of US$1,200 per square metre and an area of damage of 5,478.46m2,102Foot Note 102×COR2 at para 10.and this is the sole basis upon which the plaintiffs’ claim is currently based (see [18] above). By comparison, as discussed above (at [24]), the defendant submits on the basis of FSM case law that the value of a reef should be capped at US$600 per square metre, and that in this case, the valuation should not exceed US$251.85 per square metre. In the alternative, the defendant argues that compensation should not in any event exceed the cost of restoration,ie, US$500,000. 82 As regards the Valuation Issue, the plaintiffs engaged Dr Richmond, a research professor and director of Kewalo Marine Laboratory, University of Hawaii at Manoa, as an expert to opine on the valuation of damages resulting from the Incident.103Foot Note 103×Dr Robert H Richmond’s first AEIC dated 29 June 2020 (“RHR1”) at paras 1 to 2.His research interests are primarily in the area of marine conservation biology, with a focus on coral reefs.104Foot Note 104×RHR1 at p 5 (para 6).Dr Richmond was provided the OPOR preliminary report and the Polaris Report and was asked to provide his views on the methods adopted by OPOR and Polaris in their respective reports and how the value of damages should be assessed in this case.105Foot Note 105×RHR1 at p 6 (paras 10 to 13).For the defendant, Mr Challenger was also their expert on valuation.106Foot Note 106×GEC1 at p 2 (para 4(b)). 83 In their closing submissions, the plaintiffs contend that they are no longer “claiming compensation in this case based on the commodity value or the cost of restoration of the Damaged Reef” but maintain that it is nevertheless useful to consider these alternative methods for “context”.107Foot Note 107×PCS1 at para 143.Nor do the plaintiffs advance any arguments on the basis of a hybrid valuation approach. 84 Yet, I note that in Dr Richmond’s third AEIC filed after the plaintiffs had filed Claim on Reference (Amendment No 2), he still posits a hybrid approach as being “the more appropriate value of the damage caused by the Vessel”. Dr Richmond’s hybrid valuation ranges between US$28,464,641.43 and US$30,826,353.43. 85 As the plaintiffs themselves are no longer advancing a pleaded claim based on commodity value, cost of restoration or a hybrid valuation, I am unsure what “context” the plaintiffs wish that the court has in presenting those alternative approaches. While Dr Richmond’s preferred view is a hybrid valuation, that valuation method is not whatthe plaintiffsare advocating or currently basing their claim on. 86 In the circumstances, I do not consider any of these alternative calculations to be of assistance or relevantsavewhere they might be relevant in shedding light on what the appropriate value per square metre should be in this case, applying FSM law.",
        "Analysis and decision": "87 I therefore turn to the pith and marrow of Issue 2 – what is the appropriate value per square metre of the damaged Reef in this case? For the following reasons, I find that a fair and reasonable value to be ascribed to the damage to the Reef in this case isUS$785 per square metre. 88 The parties are in agreement that under FSM law, the assessing court has a discretion in awarding monetary damages for damage to a reef. It is also not disputed that the FSM courts have not prescribed a particular method or set of considerations to be taken into account when quantifying damages in cases of damage caused to coral reef and are open to persuasion as to the proper way to measure damages by taking into account all relevant factors in each case. “More reef and fewer people” 89 In this regard, both parties also accept that precedent cases from the FSM courts, whilst not binding, can provide some guidance on the factors considered by the FSM courts in similar cases of this nature. 90 The defendant contends that one such factor, or “principle”, that the court may have regard to is that of “more reef and fewer people”. I use the word “principle” within quotation marks because the plaintiffs dispute that there is any such binding principle under FSM law. Going forward, whilst I use the word “principle” as a convenient reference in my analysis below, it is not meant to convey that the existence of such a principle is accepted by the plaintiffs. 91 It would be useful to first explain the genesis of this principle. The phrase “more reef and fewer people” appears to have first been used in the FSM Supreme Court decision inPeople ofEauripik ex rel Sarongelfeg v F/V Teraka No 168, 18 FSM Intrm 532 (Yap 2013) (“TheTeraka No 168”) decided by FSM Chief Justice Martin G Yinug in 2013.TheTeraka No 168involved a case of reef damage caused by the fishing vesselTerakaNo 168running aground on a reef in Eauripik. Proceedings were brought against,inter alia, the vessel owners by the people of Eauripik through the relevant Chiefs at the time, which included the second and third plaintiffs in ADM 91. In considering the claimants’ application for summary judgment, Yinug CJ stated as follows:108Foot Note 108×DBOD at pp 129 to 130. Eauripik also contends that a material fact that exists without substantial controversy is that the damaged reef is valued at $600 a square meter.While it may be uncontested that the value of the reef on the main island of Yap is $600 per square meter…the court cannot presume, without evidence, that $600 a square meter is an accurate valuefor anyparticular Yap outer island reef, especially where on the outer island there may be more reef and fewer people who have the right to rely on or depend on the reef’s resources. The parties are free to prove that Eauripik’s reef or that the damaged part of it, is worth more or less than $600 per square meter. [emphasis added in italics and bold italics] 92 The passage above was cited by the FSM Supreme Court in 2018 inPeople ofSorol ex rel Marpa v M/Y Truk Master,22 FSM R 14 (Yap 2018)(“TheTruk Master”). That case involved damage caused by the motor yachtTrukMasterto a reef located in Truk in the municipality of Sorol. In the context of an application for summary judgment, Associate Justice Larry Wentworth stated as follows:109Foot Note 109×DBOD at p 173. Furthermore, when it comes to Yapese outer island reefs, the court has previously noted that: While it may be uncontested that the value of the reef on the main island of Yap is $600 per square meter, the court cannot presume, without evidence, that $600 a square meter is an accurate value for any particular Yap outer island reef, especially where on the outer island there may be more reef and fewer people who have the right to rely on or depend on the reef’s resources. People of Eauripik ex rel. Sarongelfeg v. F/V Teraka No. 168, 18 FSM R. 532, 541 (Yap, 2013) (citations omitted). The court also notes that an appropriate measure of damages for a damaged coral reef may be “the cost of restoration … without grossly disproportionate expense.” … Or it may be that, in this case, the cost of restoration would not be an appropriate measure because it would entail a grossly disproportionate expense. Damages could also be measured by the economic value of the marine resources lost or diminished by the reef damage … The court is thus open to persuasion on the proper way to measure damages in this case. 93 I agree with the plaintiffs’ submissions that the “more reef and fewer people” principle isobiter dictumoriginating fromTheTeraka No 168and is not a binding statement of principle.110Foot Note 110×Reply (Amendment No 3) at para 5C.To be fair, the defendant does not pitch its case on the basis that the principle is binding. The defendant contends that the cases referred to above provide a clear enough reference that the principle does exist and is a relevant one to consider in assessing the value of the damage to the Reef. I agree with the defendant. The “more reef and fewer people” principle is, in my view, a relevant consideration. Let me explain. 94 At a conceptual level, it is logical for a court to take into account the fact that if there are less people on an island atoll such as Eauripik, it would almost inexorably follow that, all other things being equal, there would be more of the reef’s resources to go around, bearing in mind that the right of the plaintiffs in question is tied, not so much to the ownership of the physical reefper se, but to the exclusive right to exploit or use theresourcesof the reef based on the Yapese traditional concept of a “tabinaw”. 95 A tabinaw is,inter alia, a traditional Yapese concept of community and family which recognises that the people of Yap, or rather the people of a particular municipality or village in Yap, possess the right, as members of a tabinaw, to use or exploit (and in that sense, “own”) the natural resources of a reef to the exclusion of others, as was well-explained by Yamase J inKyowa Violet First Instance. This right is recognised by and enshrined in the Constitution of the State of Yap 2006 (FSM). 96 An analogy (albeit inexact) can be drawn between the “more reef and fewer people” principle and the concepts of supply and demand in economics – if there is more supply (eg, the reef’s marine resources like fish and scallops) than demand (ie, from human inhabitants on the atoll),generallythe price (or value) of the resources would belowerthan in the converse situation. 97Kyowa Violet First InstanceandKyowa VioletAppellate Court(collectively, “The Kyowa Violet”), which I have referred to earlier in this judgment, are possibly the leading cases in the FSM on reef damage. The incident involved a vessel running aground and damaging a reef in Tomil in Colonia on the main island of Yap, causing both damage to the reef and oil pollution damage. InKyowa VioletAppellate Court, the FSM Supreme Court Appellate Division, in summarising one of the appellant shipowner’s arguments on why the trial judge was wrong to award damages based on a valuation of US$600 per square metre, noted that among a number of factors considered by Dr Richmond (who was also the expert in that case for the claimants) was the fact that “the reef areawas closely inhabited” [emphasis added]. Chief Justice Andon L Amaraich, delivering the judgment of the appellate court, noted as follows:111Foot Note 111×DBOD at pp 75 to 76. Kyowa Violet raises an additional issue on appeal concerning the sufficiency of the evidence to support the amount of damages that the trial court awarded to the People of Rull and Gilman. According to Kyowa Violet, although they do not contest the trial court’s finding that 1,463 square meters of reef was damaged in the incident involving theKyowa Violet, they believe that the trial court’s calculation of damages at $600 per square meter was clearly erroneous and not supported by the record. In support of this argument, Kyowa Violet maintains that the only evidence presented to the trial court concerning a valuation of these damages was thetestimony ofDr. Richmond, who was an expert witness testifying on behalf of the People of Rull and Gilman. Kyowa Violet notes that Dr. Richmond testified that he had previously assessed the damage to the reef in another case in Yap involving West Fayu at $304 per square meter,and because of the factors present in the case at hand,including the fact that the reef area was closely inhabited,he doubled the value to $608 per square meter, which the trial court apparently rounded to an even $600 per square meter, as Kyowa Violet so contends. [emphasis added in italics and bold italics] 98 The plaintiffs also allude to the passage above in their closing submissions.112Foot Note 112×PCS2 at para 70 (and footnote 53).There was no suggestion by Dr Richmond or the plaintiffs that that factor (ie, of the reef area being closely inhabited) had not been considered by Dr Richmond inKyowa VioletFirst Instanceor that the case report had incorrectly summarised his considerations or assumptions in that case. The point I am making is thatKyowa VioletAppellate Courtdoes indicate that Dr Richmond himself appears to have had regard to the fact,andnumber, of inhabitants in or near the reef concerned asoneof the factors relevant to assessing the monetary value per square metre to be ascribed to the damaged sections of the reef. That factor was one of the bases for hisdoublingof the value of the Tomil reef inKyowa VioletFirst Instanceto US$608 per square metre (eventually rounded down by the court to US$600 per square metre) compared to the value of US$304 per square metre estimated by Dr Richmond for theuninhabitedWest Fayu reef damaged in the earlier case ofPeople ofSatawal ex rel Ramoloilug v Mina Maru No 3,10 FSM Intrm 337 (Yap 2001) (“People ofSatawal”).113Foot Note 113×DBOD at pp 7 and 76.As I indicated at [92], the notion of “more reef and fewer people” first mentioned inTheTeraka No 168was also alluded to inTheTruk Master. 99 In my judgment, it would not be an unreasonable inference to draw that the demand for resources from the Reef on the basis of say 60 inhabitants on Eauripik would be different to the demand if there were 200 inhabitants. Further, the demand on a reef’s resources from the larger number of inhabitants or residents on themain islandof Yap is also likely to be different to that from the smaller number of inhabitants on anouter islandatoll like Eauripik. In my judgment, that is in substance the meaning intended to be conveyed by the phrase coined by the FSM courts of “more reef and fewer people”. That principle may, as noted by the FSM court in cases such asTheTeraka No 168andTheTruk Master(and implicitly fromKyowa Violet Appellate Court), be a relevant consideration thrown into the mix or basket of factors to which the court may have regard, when exercising its discretion to determine the monetary value to be ascribed to the reef in question. The appropriateweightthat factor should be accorded in the court’s assessment is a separate matter and would depend on the factual matrix of each case and the evidence before it. 100 In this regard, I prefer the evidence of Mr Seth Forman, the defendant’s FSM law expert, to that of Mr Steven Pixley, the plaintiffs’ FSM law expert. Mr Pixley’s evidence was that the last sentence in the passage I quoted above at [91] meant that the court was free to fix the value at higher or lower than US$600 per square metre and it was for the plaintiff to prove their case for damages. Mr Forman’s evidence was more nuanced. He opined that it was clear enough from the language used inTheTeraka No 168andTheTruk Masterthat if there were fewer people on an outer island,prima faciea court would consider the value per square metre of damaged reef to be less than US$600, but that having been said, the parties were free to prove their respective positions. Mr Forman also acknowledged that there was no fixed formula adopted by the FSM courts to calculate the value of a reef on a per person basis. His point remained that the court has a discretion to consider the principle and calibrate the value of the reef accordingly.114Foot Note 114×Transcript (3 November 2020) at pp 42 to 45 (lines 1 to 7). Loss of “cultural value” 101 I turn next to discuss what is termed as “cultural value”. In short, this is the value of the reef as an outlet for cultural activities. Dr Richmond referred to two examples. The first was group fishing among men and its enhancement of cooperation between them as well as building of community cohesion. The second was the communal gleaning of reef resources by women, which activity also afforded an opportunity for the children to be taught and for them to socialise. 102 The parties’ reef damage experts disagree on whether the cultural value of the Reef to the plaintiffs is a relevant factor to be considered in assessing the value of the damage to the Reef.115Foot Note 115×DBOD at p 208 (para 15). 103 Notwithstanding this disagreement, it is ultimately unnecessary for me to decide this point as theevidencefrom the plaintiffs does not indicate that there had beenanyloss of cultural value as a result of the damage to the Reef caused by the Vessel. For example, there is no evidence that the damage to the Reef had resulted in the plaintiffs being deprived of a “local educational classroom”.116Foot Note 116×John Haglelgam’s 1st AEIC dated 26 May 2020 (“JH1”) at para 25.In contrast, during cross-examination, Mr Haglelgam stated that as far as he was aware, the damage to the Reef had not resulted in a loss of opportunity for the Eauripik inhabitants to fish, to teach their children how to fish, or to swim in the lagoon bounded by the Reef.117Foot Note 117×Transcript (2 November 2020) at pp 122 (lines 21 to 25) to 123 (lines 1 to 4).The plaintiffs’ counter is that the defendant presents an incomplete picture of the evidence before the court because none of the questions posed to Mr Haglelgam by the defendant during cross-examination pertained to the Reef but to general activities on Eauripik. His answers thus do not mean that there was no effect on these activities. The fact that the people on Eauripik are still able to carry out the various activities does not mean that they are not diminished in their ability to do so.118Foot Note 118×PCS2 at paras 23 and 24.However, these objections miss the point since it is for the plaintiffs to show that the ability of the inhabitants of Eauripik to carry out the various activities has in fact diminished as a result of the Incident and to what extent. They have not done so. Further, fromKyowa VioletFirst Instance, it is clear that even if cultural damage is recognised, it must at least translate toan economic loss. For instance, inKyowa VioletFirst Instance, the court found that the inability of the plaintiffs in that case to swim and bathe in the lagoon due to oil contamination from the ship had aneconomiceffectand thus damages were awarded for thateconomic loss. The inhabitants either had to find a substitute for the therapeutic effects of bathing and swimming in the lagoon or do without it, and any substitute had an economic cost.119Foot Note 119×DBOD at p 25.In contrast, the plaintiffs in the present case have not adduced any evidence of any economic or monetary loss even assuming there was any loss of cultural value. Therefore, whether or not FSM law recognises such “cultural value” as a relevant factor is moot in this case, and I say nothing more about it. What is the value of the Reef? 104 SinceTheKyowa Violet, a number of first instance FSM Supreme Court decisions have adopted a per square metre valuation for reef damage cases in the FSM. Specifically, the value of US$600 per square metre has been adopted in a number of cases. The defendant argues that the value of US$600 per square metre represents acapon the value per square metre of a reef in the FSM. The plaintiffs disagree. They contend that the FSM law experts aread idemthat under FSM law, parties are at liberty to prove that the value of a reef damaged by a tortfeasor is worth more or worth less than US$600 per square metre. 105 The FSM law experts also agree that no FSM court has determined, by way of a judgment, the value of a reef in Eauripik, and that the parties are free to prove this value. As an aside, whileThe Teraka No 168involved a vessel grounding on a section of reef on Eauripik, that case was settled before trial. Thus, the task of deciding for the first time what the value is, in per square metre terms, of a reef on Eauripik falls on the shoulders of this court. 106 The plaintiffs argue that the value of the damaged reef should be US$1,200 per square metre,ie,double the value that was assessed inThe KyowaViolet. In this regard, the plaintiffs rely largely on the evidence and assessment of Dr Richmond. Dr Richmond’s opinion as to why a value of US$1,200 per square metre is appropriate is summarised in his third AEIC thus:120Foot Note 120×Dr Robert H Richmond’s third AEIC dated 18 February 2021 (“RHR3”) at paras 65 to 67. 65. Having said that, if the Court prefers to quantify and value the damages resulting from the Reef Damage Incident solely based on previous cases decided in the FSM, my view is that a higher value than the $600/m2 used in the Kyowa Violet case is justified both because the value of coral reefs has increased in the 18 years since the Kyowa Violet incident in 2002, and because it must be recognized that the relative value of the Damaged Reef to the people of Eauripik is greater than the value of the Yap reef to the Yap islanders who have greater access to imported resources and locally grown food. 66.  An appropriate value per square meter in this case which would account for these differences is $1,200/m2, which yields an assessment of $11,835,264 for the total damage field area of 9,862.72 m2, and $6,574,152 for the area of destroyed corals of 5,478.46 m2. If the Kyowa Violet case was to take place today, I would have valued the Tomil reef at a much greater valuation than the $608/m2 assessment which I made in 2002, as our understanding and the value of coral reefs have increased substantially since 2002. 67. If $1,200/m2 is not accepted, the bare minimum which the Court should consider is $785/m2 (the equivalent of $600/m2 in 2020 according to Challenger), which yields values of at least $7,742,235.20 for the full damage field of 9,862.72 m2, and at least $4,300,591.10 for just the area of destroyed corals. 107 The defendant takes issue with Dr Richmond’s assessment as unsupported by any evidence. Firstly, the defendant contends that there is no evidence that the “value of coral reefs has increased in the 18 years since theKyowa Violetincident in 2002”.121Foot Note 121×DCS2 at para 105; RHR3 at para 43(c). 108 I agree with the defendant’s submission. I would have expected evidence to be adduced on the appreciation in the value of corals, not just generally, but at the very leastin the FSM, since 2002 to the time of the Incident; but no such evidence was led. Dr Richmond’s statement is thus a bare one. 109 Next, insofar as Dr Richmond opines that “it must be recognized that the relative value of the Damaged Reef to the people of Eauripik is greater than the value of the Yap reef to the Yap islanders who have greater access to imported resources and local grown food”, this is also a statement made with no supporting basis, and is in my view beyond Dr Richmond’s remit as an expert. Significantly, the AEICs of the namedplaintiffs(ie, the three Chiefs) did not containanystatement or evidence to that effect. I am not convinced that it is appropriate for Dr Richmond, as a coral scientist and expert witness, to opine on the value placed by the Eauripikislanderson their reef as compared to Yapislanders. Dr Richmond’s evidence or opinion on this point is speculative, and not within the realm of his expertise. I therefore place little weight on it. 110 However, and more fundamentally, the difficulty I have with Dr Richmond’s evidence is that, in the final analysis, his opinion on a US$1,200 per square metre value is not based on any scientific formula but is really aqualitativeassessment – for example, why is the value only double compared to the US$600 per square metre awarded inThe Kyowa Violetand not triple or quadruple that value, since Dr Richmond feels that US$1,200 per square metre is itselfconservative? 111 Dr Richmond also seeks to benchmark his US$1,200 per square metre value to valuations derived from various reef damage incidents in the United States of America that were settled. As I discuss in greater detail below, I do not think it appropriate or useful to refer to settlements involving reef damage cases in the waters of the US or other jurisdictions outside the FSM. I note, however, that neither party referred me toany casein the FSM, whether reported or settled, where the value per square metre of a reefanywherein the FSM has been assessed at even US$1,000 per square metre, let alone US$1,200 per square metre. 112 In my judgment, the conclusions drawn by Dr Richmond are, in essence, “guesstimates” as opposed to being grounded on any scientific or mathematical basis. I am therefore not satisfied that the plaintiffs haveproven, on the balance of probabilities, thatbased on the evidence, the value per square metre of the Reef damaged by the Incident is US$1,200 per square metre. I accordingly decline to accept that value. 113 On the other hand, the value of US$251.85 per square metre advocated by the defendant, which is derived from the amounts awarded inPeople ofSatawalfor damage to an outer island reef in West Fayu, is also not necessarily reflective of the value of the Reef. Nor is that a value binding on me. That having been said, and as I have concluded above at [99], the court can and, in this case ought to, have regard to the fact that Eauripik, like West Fayu, is also an outer island atoll, and therefore more remote and less inhabited as compared to, for example, the main island of Yap. I also note that unlike West Fayu which was uninhabited, Eauripikisinhabited. 114 Mr Haglelgam stated in his AEIC sworn in May 2020 that there were, at that time, 84 people resident on Eauripik.122Foot Note 122×JH1 at para 58.During cross-examination on 2 November 2020, Mr Haglelgam clarified that there were then only about 60 people residing on Eauripik.123Foot Note 123×Transcript (2 November 2020) at p 116 (lines 4 to 6). 115 Aside from the fact of and the number of inhabitants, the court can also take into the account the likelihood that the nature and extent of biodiversity, coral cover and fish biomass in the Reef are similar to those in other outer island atolls in the FSM like Ulithi (alluded to by Professor Crane)124Foot Note 124×Transcript (4 November 2020) at p 84 (lines 3 to 13).and West Fayu (the reef in question inPeople ofSatawal). 116 With regard to settlements in other cases, while they do give this court some indications as to the values that may be extrapolated from the settlement amounts and the extent of damage in those cases, I am hesitant to venture beyond that. Quite simply, this is because a case may be settled for a variety of reasons. A claimant may, in the context of a negotiated settlement, be prepared to accept a discount on the value of the reef in return for an upfront payment and the attendant savings in costs and time as well as avoidance of litigation risk. Therefore, the evidential value of such settled cases is, in my view, not significant. As the parties’ FSM law experts themselves note, settled cases have limited value in assisting the court to assess the damages to be awarded in any particular case before it (see [79(e)] above). 117 Mr Challenger compiled a table of various reef damage cases in the FSM and other jurisdictions like the US with corresponding settlement sums and extrapolated per square metre values for each case for comparison.125Foot Note 125×GEC3 at pp 22 to 24. 118 Firstly, although both experts referred to cases in the US and other jurisdictions outside of the FSM, as I indicated above at [111], I do not consider that to be an appropriate approach. Among others, the nature of the reefs and the type of corals and coral cover may well be different in, for example, Florida or Hawaii than in Eauripik. If at all, any consideration of past settled cases and settlement ranges ought to be limited to cases in the FSM or alternatively, in jurisdictions within the Indo-Pacific region. Even then, the purpose of bringing such settled cases to the attention of the court would be limited to providing those details by way of information and nothing more. 119 With these observations in mind, I reproduce below the table referred to by Mr Challenger in his evidence, butlimitedit to the cases in the Indo-Pacific region (including the FSM):126Foot Note 126×GEC3 at pp 22 to 24. Vessel NameYearRegionInjury area (m2)Settlement (US$)US$ per square metrePacific Falcon2000Indo Pacific1,439$1,000,000$695Bunga Teratai Satu2000Indo Pacific1,500$600,000$400Micronesian Heritage2003Indo Pacific350$2,000,000$5,714Kyowa Violet2005Indo Pacific1,436$861,000$600Shen Neng 12010Indo Pacific>50,000$29,660,000$593Mel Sentosa2011Indo Pacific419$285,000$680Guardian2013Indo Pacific2,345$2,000,000$853Palau Siren2015Indo Pacific698$723,684$1,037Belle Rose2016Indo Pacific28,800$1,500,000$52Caledonia Sky2017Indo Pacific1,600 - 18,882$1,200,000 to 451,000,000$38 to $28,188Lewang2017Indo Pacific>2,000$75,000$37Alex2017Indo Pacific10,177$1,379,338$136Lyric Poet2017Indo Pacific8,416$1,140,662$136Marshall 2012018Indo Pacific4,000$1,250,000$313 120 Leaving aside “outliers” like theMicronesian HeritageandCaledonia Skycases, the average equivalent value per square metre of the reef damage cases in the Indo-Pacific that were settled is approximately US$461. 121 The defendant also submits that the court should award either the value of the damaged reef or the cost of restoration, whichever is the lower, and relies on the FSM Supreme Court decisions inPohnpei vThe Ping Da 7, 20 FSM R 75 (Pon 215) (“Ping Da 7”) andTheTruk Masteras support.127Foot Note 127×DBOD at pp 150 and 173.The plaintiffs argue that true and complete restoration is unrealistic and simply not practicable in this case as it would entail replacing upwards of 24,000 corals even on the defendant’s estimate of 742m2 of damage. In any event, the defendant’s definition of “restoration” does not entail completely restoring the Reef, which is an ecosystem, but merely re-attaching “at risk” or dislodged corals from elsewhere in Eauripik onto damaged sections of the Reef in order to allow the damaged sections to start recovering and regenerating.128Foot Note 128×PCS1 at para 156; GEC2 at p 47.This method of “restoration” is merely, in Dr Richmond’s words, to “borrow from Peter to pay Paul” and would undercompensate the plaintiffs. 122 As stated at [42] above, under FSM law, the “general purpose of tort law is to afford a victim compensation for the injuries or damages sustained as the result of another’s unreasonable or socially harmful conduct. In other words, tort law’s purpose isto make the victim whole” [emphasis added].129Foot Note 129×DBOD at p 23.Both parties’ FSM law experts agree that this is the overarching principle applicable under FSM tort law.130Foot Note 130×DCS1 at para 181.In thePing Da 7, Acting Chief Justice Ready E Johnny observed that: … the usual remedy for trespass to land (and when applicable nuisance and negligence claims are based on similar facts) is either a judgment for an amount equal to the diminution in the land’s value or a judgment for an amount that would be needed torestore the landto its previous condition, whichever is the lesser amount … To award both would constitute an impermissible double recovery … [emphasis added] 123 Bearing in mind the overarching purpose of FSM tort law, and whilst the FSM courts have recognised that the cost of restoring a damaged reef is an acceptable measure of compensation, restoration cost must, if awarded as damages, make the victimwhole. In order to do that, the restoration proposed mustrestore, in the true sense of the word – the dictionary meaning of “restore” is “to bring backto the original state; to improve, repair, or retouch (a thing)so as to bring it back to its original condition.” [emphasis added].131Foot Note 131×Oxford English Dictionary (2nd ed). 124 I agree with the plaintiffs that what is being proposed in this case by Mr Challenger is not restoration in the true sense of the word, butpartialrestoration in order to jumpstart or shorten the reef recovery process and duration. Mr Challenger’s method of restoration is to re-attach up to 1,000 corals at the damaged parts of the Reef.132Foot Note 132×GEC2 at p 47.Mr Challenger candidly acknowledged that his proposed method of restoration would not immediately restore the Reef to itsoriginalcondition. The following extract from the trial transcript bears this out:133Foot Note 133×Transcript (5 November 2020) at pp 28 (lines 12 to 25) to 29 (lines 1 to 9). Mr Doraisamy: Just on this issue of your method of restoration, what would you say would be the likely percentage of recovery of the reef after restoration? What is the likelihood of recovery? Mr Challenger: The reef will recover. I believe the reef will recover if we do nothing, it will just take a lot longer.But if we go out and actively restore it and find as many corals from the site and attach as many corals as you can,will it immediately be just like the old reef? No.It will be in a condition where at that point there is nothing more we can do and Mother Nature takes over and your recovery time is greatly reduced. We’ve done this before where we end up with coral cover that is statistically similar to the coral cover prior to the grounding, but, you know, it takes time for the other things to come in, all the little boring critters and urchins and the ecosystem that Prof Crane discussed yesterday. But if we build it, they will come and once the coral cover and the diversity and things start to recover, that’s – those techniques of restoration have been widely accepted. [emphasis added in italics and bold italics] 125 In the circumstances, the cost of restoration of approximately US$500,000 (to replace up to 1,000 corals) as put forward by the defendant would not, in my judgment, make the plaintiffs whole. On the contrary, I am of the view that it would undercompensate them. Accordingly, I reject the defendant’s contention that their proposed cost of restoration would be an acceptable measure of damages to award the plaintiffs. 126 There is no other evidence put forward by the defendant on the cost of complete restoration. On the other hand, Dr Richmond posits that the cost of restoration could be in excess of US$28m. While that figure is also, in my view, overstated, of greater relevance is the fact that apart from the restoration costs estimate of approximately US$500,000 put forward by the defendant (which, as I have found, amounts only to a partial restoration at best), there is no evidence before the court that the costs of a true and complete restoration would costlessthan the diminution in value of the damaged Reef. In the circumstances, in my view, theonlymeasure of damages that this court can usefully consider and award the plaintiffs in this case would be based on the diminution in value of the damaged reef as established in accordance with (a) the evidence and (b) acceptable methods recognised under FSM law. 127 Since I have rejected the plaintiffs’ case that the value of the Reef is to be assessed at US$1,200 per square metre, I turn to the plaintiffs’alternativesubmission that the value of US$785 per square metre should be accepted by the court. This is on the basis that it represents the 2020 value of the US$600 per square metre value affirmed inKyowa VioletAppellate Court, after taking into account inflation. 128 This figure of US$785 per square metre was put forward by the defendant’s expert Mr Challenger in his second AEIC.134Foot Note 134×GEC2 at p 51 (Table 1).The defendant argues that there is no basis for the plaintiff to rely on this alternative figure as the plaintiff has not adduced any evidence of the rate of inflation.135Foot Note 135×DCS2 at para 104.I do not consider this a valid objection. This figure was referred to and put into evidence by the defendant’s own expert. I fail to see how the plaintiff is barred from relying on it as an alternative, particularly when the plaintiffs did not challenge that figure as being inaccurate. I take guidance from the approach of the Singapore High Court inJet Holding Ltd and others v Cooper Cameron (Singapore) Pte Ltd and another[2005] 4 SLR(R) 417 (at [161]) where Belinda Ang Saw Ean J (as she then was) dealt with the plaintiffs’ claim for damages as follows: These are thus far my views on the evidence of JSL and JHL in terms of proving their pleaded loss. But independent of that, upon Cameron’s evidence there is Chiasson who was aware that the BOP stack that was lost was at least 20 years old and opined that if it was properly maintained over the 20-year period, it would probably be worth about US$1m. He explained that the BOP stack is made of components and went on to testify on the ready availability of second hand components for a BOP stack and then assembling the components to make a BOP stack at a total cost of US$1m. Cameron or several of its competitors could easily undertake the assembling. Mr Chandra contends that Chiasson is not an expert and cannot give expert opinion on the value of BOP at the time of the loss. Whilst Chiasson is not an expert,he is in the business and his testimony is of some assistance to put a monetary figure as representing the market value of what was lost and to which I am entitled to take on board.Where there is no precise evidence, Ihave to do the best I can with the little or limited evidence in order to do justice.… [emphasis added] 129 Given that I have rejected both the plaintiffs’ and defendant’s respective primary contentions on the value of the Reef (ie, US$1,200m and US$251.85m), I see no impediment in utilising an alternative figure that both parties’ experts agree on, especially if it will assist in doing justice in this case in the absence of other more precise evidence. 130 Based on the totality of the evidence and having regard to the relevant factors as gleaned from available FSM caselaw as I have discussed above, in my judgment, a fair and reasonable value to be ascribed to the Reef that was damaged in this case isUS$785 per square metreand I do so find accordingly. Alternative orders in lieu of damages 131 Mr Doraisamy submits thatin lieuof damages, this court has the discretion to make alternative orders as it deems fit. One such alternative proposed by the defendant is for the court to orderthe defendantto “install navigational aids in the channel”in lieuof awarding the plaintiffs damages so as “to prevent future incidents from happening”. The defendant’s second alternative is for the court to order thatthe defendantcarries out restoration works on the Reef, on the basis of the defendant’s expert’s (ie, Mr Challenger’s) view that “it would cost ‘not more than 500,000’ to do so” [emphasis in original in italics].136Foot Note 136×DCS1 at paras 245 to 253. 132 The plaintiffs object to the defendant’s submissions. Firstly, they were not pleaded and thus take the plaintiffs by surprise. Secondly, the court is being asked to assess thedamagesdue to the plaintiffs and it would be inappropriate for the court to consider, let alone award the plaintiffs, any substantive relief other than damages.137Foot Note 137×PCS2 at paras 78 to 79. 133 I agree with the plaintiffs. The alternative options proposed by the defendant are not pleaded and no evidence was properly led on it. While Mr Doraisamy posed certain questions to Dr Richmond on whether, in his view, monetary compensation or restoration of the Reef would be preferred, those were purelyhypothetical questionsseeking Dr Richmond’s personal opinion. They were not even hypothetical questions askedwith reference toEauripik. I am thus unable to see the relevance of the answers given by Dr Richmond to those hypothetical questions or how Dr Richmond’s hypothetical responses support the defendant’s arguments on the alternative orders they wish me to make. 134 Further, I also agree with Mr Leong that the task of this court is to assess thedamagesdue to the plaintiffs. The plaintiffs do not seek any other relief apart from damages. Therefore, whilst the plaintiffs’ Claim on Reference (Amendment No 2) contains, in the relief section, the generic incantation of such “further or other relief as this Honourable Court deems fit”, that does not translate to thedefendantbeing entitled to ask the court to make either of the alternative orders it suggests in its closing submissions. In addition, no evidence was led by the defendant on whether,under FSM law, the granting of such alternative “relief”in lieuof an award of monetary damages is permissible or recognised. I accordingly reject the defendant’s submissions and decline to make either of the proposed alternative orders.",
        "Issue 2: The Valuation Issue": "78 Having decided the area of damage caused to the Reef by the Incident, I turn now to consider the value to be placed on the damage per square metre in monetary terms.",
        "The applicable law": "79 As this issue engages more extensively with FSM law, it would help that I first set out the common ground between the parties’ FSM law experts as far as FSM law on damage valuation is concerned:98Foot Note 98×DBOD at pp 211 to 212. (a) The court has a discretion in determining monetary damages for damage to a reef. There are various methods that have been recognised for assessing damages in reef damage incidents, including: (i) damages on the basis of the cost to replace, restore and repair the reef; and (ii) damages representing the value of the reef to the people of Eauripik, based on a value per square metre of the reef. (b) While the FSM courts have awarded US$600 per square metre in cases involving reef damage at the main island of Yap, no FSM court has determined the value of a reef in Eauripik. The parties are free to prove the value of a square metre of reef in Eauripik, and may submit evidence of a value higher or lower than the value of US$600 per square metre. (c) Under FSM case law, attorneys’ fees are usually not awarded to the prevailing party in cases involving reef damage, although it is open to a prevailing party to ask for such fees. (d) Under FSM law, pre-judgment simple interest at 9% per annum is usually awarded retroactively from the date of the incident in cases involving reef damage. (e) Summary judgment cases and previous cases involving settlements between parties have limited value when assessing damage to coral reefs.99Foot Note 99×Transcript (3 November 2020) at pp 29 (lines 14 to 25), 30, 31, 32 (lines 1 to 17) (on previous cases involving settlements); 38 (lines 21 to 25), 39, 40 and 41 (lines 1 to 25) (on summary judgment cases). (f) How compensation for other grounding incidents at Eauripik has been utilised has no bearing on the quantum of damages to be awarded in the present case.100Foot Note 100×Transcript (3 November 2020) at pp 46 (lines 10 to 25), 47, and 48 (lines 1 to 25).",
        "Conclusion": "135 On Issue 1 (the Damage Issue), I find that on the available evidence, an area of1,056.88m2of the Reef was damaged by the Vessel as a result of the Incident. 136 On Issue 2 (the Valuation Issue), I find that a fair and reasonable estimate of the value of the damaged Reef under FSM law isUS$785per square metre. 137 The plaintiffs are accordingly entitled to US$829,650.80as damages from the defendant, being the product of 1,056.88m2 of damage and US$785 per square metre. Accordingly, I grant final judgment for the plaintiffs against the defendant in the sum ofUS$829,650.80. 138 As for pre-judgment interest, it is common ground that under FSM law, a successful party is usually awarded pre-judgment simple interest at the rate of 9% per annum from the date of the incident ([79(d)] above). The defendant accepts that the court has a discretion under section 12(1) of the Civil Law Act 1909 (2020 Rev Ed) (“CLA”) to award pre-judgment interest. It however contends that the plaintiffs should not be entitled to any pre-judgment interest at all, or at the rate of 9% per annum applicable under FSM law. In the alternative, it submits that the court should only award pre-judgment interest at the Singapore default rate of 5.33% per annum. Further, the court should also take note of the plaintiffs’ dilatoriness in the conduct of their case which caused significant delay to the progress of the claim on reference hearing, including the belated amendment to their claim on reference which necessitated a second tranche of hearing dates some four months later.138Foot Note 138×DCS2 at paras 127 to 140. 139 The plaintiffs also accept that the court has a discretion under section 12(1) of the CLA to award pre-judgment interest. They maintain that they should be awarded pre-judgment interest at the rate of 9% per annum as allowed by FSM law. The plaintiffs disagree with the defendant that there is any basis in this case to depart from the default position under FSM law. 140 Having considered the arguments raised by both parties, I disagree with the defendant that the court should not award any pre-judgment interest or only utilise the default pre-judgment interest rate applied in Singapore. I have taken into consideration the common ground between the parties on the interest rate utilised by the FSM courts for pre-judgment interest in similar cases and the delay to the proceedings occasioned by the amended claim on reference that was eventually put forward by the plaintiffs. I exercise my discretion under s 12(1) of the CLA and award the plaintiffs simple interest on the principal judgment sum at the rate of 9% per annum, not from the date of the Incident, but from 23 June 2017 (ie,the date on which the writ in ADM 91 was filed) to the date of judgment. 141 I shall hear the parties separately on costs. S MohanJudge of the High Court Leong Kah Wah, Aleksandar Anatoliev Georgiev and Chan Qin Pei (Rajah & Tann Singapore LLP) for the plaintiffs; Ramachandran Doraisamy Raghunath, Quek Wen Jiang Gerard, Nicole Kwan Tung Yan and Josiah Fong Ren Jing (PDLegal LLC) for the defendant.",
        "Annex 1: Photographs depicting sections of the undamaged Reef on the western side of Eauripik": "Undamaged section of the Reef   Undamaged section of the Reef  Undamaged section of the Reef (showing steepness of Reef wall and extent of coral cover)   Undamaged section of the Reef",
        "Annex 2: Photographs depicting sections of the damaged Reef after the Incident": "Damaged section of the Reef (coral sheared off down to the calcium substrate) Damaged section of the Reef (coral sheared off down to the calcium substrate) Metal debris from the Vessel found at sections of the Reef  Damaged section of the Reef (with coral partially sheared off down to the calcium substrate)"
    }
}