{
    "case_title": "Public ProsecutorvGunalan Goval",
    "ncitation": "[2022] SGHC 62",
    "coram": "Andre Maniam J",
    "sections": {
        "Introduction": "1 The Accused, Gunalan Goval, was a delivery driver who drove a trailer between Malaysia and Singapore. 2 On the night of 18 March 2019, Central Narcotics Bureau (“CNB”) officers arrested him in the trailer he had parked at Pandan Loop, Singapore. A haversack holding three bundles of vegetable matter was recovered from the trailer’s driver centre console – those bundles were later analysed and found to contain not less than 1,276.6g of cannabis.1Foot Note 1×Statement of Agreed Facts (“SOAF”), para 13. 3 The Accused was charged for trafficking in cannabis under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “MDA”). The charge read as follows: That you,GUNALAN GOVAL, on 18 March 2019, at about 10.50pm, in a trailer bearing the registration plate number JMP2388, which was parked along the road near 234 Pandan Loop, Singapore, did traffic in a Class A controlled drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”),to wit, by having in your possession for the purpose of trafficking, three blocks of vegetable matter which were analysed and found to contain not less than 1,276.6g of cannabis, without authorisation under the MDA or the regulations made thereunder, and you have thereby committed an offence under Section 5(1)(a) read with Section 5(2) and punishable under Section 33(1) of the MDA and alternatively, upon conviction, you may be liable to be punished under section 33B of the MDA.",
        "Issues": "4 The elements of an offence under s 5(1)(a) of the MDA are (MuhammadRidzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59]): (a) possession of a controlled drug; (b) knowledge of the nature of the drug; and (c) proof that possession of the drug was for the purpose of trafficking which was not authorised. 5 The Defence accepted that the first element – possession – was established, for the Accused knew he had in his possession the haversack containing the three bundles: see s 18(1)(a) of the MDA.2Foot Note 2×Closing submissions of the Defence, para 60. 6 For the second element – knowledge of the nature of the drug – it was common ground that the Accused’s possession of the cannabis meant that under s 18(2) of the MDA, he was presumed to have known the nature of the drug,ie, that it was cannabis.3Foot Note 3×Closing submissions of the Defence, paras 59 – 61.The issue here is: has the Accused rebutted that presumption? 7 The Defence also disputed the third element – the purpose of the possession – contending that at the time of his arrest, the Accused’s possession of the cannabis wasnotfor the purpose of trafficking. Specifically, the Defence contended that the Accused had changed his mind about delivering the cannabis to third parties: instead, he wanted to leave the scene.4Foot Note 4×Closing submissions of the Defence, paras 110 and 114. 8 I address the disputed elements in turn.",
        "Has the presumption of knowledge been rebutted?": "9 To rebut the presumption of knowledge under s 18(2) of the MDA, an accused person must prove, on a balance of probabilities, that he did not know the nature of the drug in his possession:Gobi a/lAvedian v Public Prosecutor[2021] 1 SLR 180 (“Gobi”) at [57]. 10 The Accused’smaindefence is that he believed he was smuggling illegal reading books, rather than vegetable matter containing a controlled drug.5Foot Note 5×Closing submissions of the Defence, paras 68 – 84. 11 In oral reply submissions, analternativedefence was added: that even if the Accused believed he was carrying an illegal drug, he did not knowwhichillegal drug it was – so, it was contended, the presumption that he knew it was cannabis has been rebutted.6Foot Note 6×Notes of Evidence (“NE”), 28 February 2022, page 25, lines 5 – 15 and page 29 line 7 – page 40 line 20.",
        "The Accused’s main defence: he thought the bundles were reading books": "The Accused’s statements 12 The Accused testified that he thought he was carrying “wrongful book[s]”.7Foot Note 7×NE, 2 November 2021, page 9, lines 24 – 30.By “books”, he meant reading books; books that could be read.8Foot Note 8×NE, 2 November 2021, page 2, lines 18 – 21.He did not, however, say so in the 14 statements that he had provided to the CNB. (1) The Initial Statement 13 Immediately after his arrest, the Accused gave a statement (the “Initial Statement”) to Sergeant 3 Syazwan bin Daud Mohamed (“Sgt3 Syazwan”). This was recorded by Sgt3 Syazwan in the field book9Foot Note 9×Exhibit D1.as follows [English translation10Foot Note 10×Exhibit D2.added]: After the arrest, Sgt(3) Syazwan asked the following questions to B1 [the Accused] in Malay language: Q1: Kau ada apa-apa nak surrender tak? [Do you have anything to surrender?] A1: Ada bang. [Have brother.] Q2: Apa? [What?] A2: 3 buku kat dalam bag hitam. [3 books/blocks inside the black bag] Q3: 3 buku apa? [3 books/blocks of what?] A3: Tak tau bang. [I don’t know brother.] 14 The Accused used the Malay word “buku” [book], but when asked “buku apa?” [books of what?] his response was “I don’t know”. The Accused did not then say that he thought he was carrying three wrongfulreadingbooks. 15 Questioned about this at trial,11Foot Note 11×NE, 3 November 2021, page 24 line 10 – page 25 line 10.the Accused could not satisfactorily explain why he had not said to Sgt3 Syazwan, that he thought he was carrying reading books. He was repeatedly asked why he did not say this, to which his responses were: “I did not tell him”, “I did not inform him”, and “I would have missed it out at that point”. The Accused eventually admitted that he had no explanation why he had “missed out” saying that the books were reading books, in response to Sgt3 Syazwan’s question: “books of what?”. (2) The Contemporaneous Statement 16 The Accused’s second statement (the “Contemporaneous Statement”) was recorded by Sergeant Yogaraj s/o Ragunathan Pillay (“Sgt Yogaraj”) from 12.10am to 1.00am on 19 March 2019,12Foot Note 12×Agreed Bundle (“AB”) 123.ie, some one to two hours after the arrest. Prior to recording the statement, Sgt Yogaraj had read to the Accused (in Tamil) the Mandatory Death Penalty (“MDP”) Notification, notifying theAccused of the requirements under s 33B of the MDA;13Foot Note 13×Exhibit D3.a copy of the MDP Notification was then served on the Accused. 17 Sgt Yogaraj posed 22 questions in Tamil, and the Accused answered in Tamil. The Contemporaneous Statement comprised these questions and answers, as recorded by Sgt Yogaraj in English in the field book.14Foot Note 14×AB 126 – 130. 18 In the Contemporaneous Statement, the Accused admitted in his answer to question 13 that he knew the “buku”/“booku” [books] were drugs: Q8: Why did you come here? A8: Siva ask me to wait here. Q9: Who is Siva? A9: Siva is a friend of mine in Malaysia. Q10: Have you seen him? A10: Yes. Q11: Do you have his number? A11: Yes. He will call me using +60 18-782-8314. Q12: Why did he ask you to come here? A12: He ask me to deliver 3 ‘booku’ to a person. Q13: What is ‘booku’? A13: I don’t know what it is but I know it is drugs. Q14: Did he tell you who to pass the 3 ‘booku’ to? A14: No. He just told me when someone come to my lorry, just pass all the 3 ‘booku’. … Q22: How much are you being paid for sending the 3 ‘booku’? A22: 200 ringit [sic] a ‘booku’. [emphasis added in bold] 19 The Accused’s admission that he knew the “books” were drugs, is inconsistent with his testimony that he thought they were wrongful reading books, not drugs. 20 The Accused sought to explain away that admission, by claiming that Sgt Yogaraj had told him the “books” were drugs, and that was why he said he knew the “books” were drugs.15Foot Note 15×NE, 2 November 2021, page 5, lines 11 – 14, 25 – 27; 3 November 2021, page 26 line 28 – page 27 line 6. 21 This allegation was not put to Sgt Yogaraj when he testified. Sgt Yogaraj’s testimony was that he did not say anything to the Accused about what the bundles were suspected to contain.16Foot Note 16×NE, 27 October 2021, page 26 lines 30 – 32.He was not questioned on this. If the Accused intended to say that his admission of knowledge was based on what Sgt Yogaraj had allegedly told him, that should have been put to Sgt Yogaraj. 22 The rule inBrowne v Dunn(1894) 6 R 67 requires that where a submission is going to be made about a witness, which is of such a nature and of such importance that it ought fairly to have been put to that witness to give him the opportunity to respond to it, then if it has not been so put, that submission will not be allowed; this is generally required where the submission is “at the very heart of the matter”:Lo Sook Ling Adela v Au Mei Yin Christina[2002] 1 SLR(R) 326 at [40];Ong Jane Rebecca v Lim LieHoa[2005] SGCA 4 at [49]–[50];Hong LeongSingapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 at [42]. 23 The Accused’s admission in the Contemporaneous Statement that he knew the three “books” were drugs, and his explanation that he said this because that was what Sgt Yogaraj had allegedly told him, are at the very heart of the case. The Defence invited me to believe the Accused, and disbelieve Sgt Yogaraj, but the Accused’s allegation was never put to Sgt Yogaraj. 24 Sgt Yogaraj’s evidence – that he had not told the Accused what the bundles were suspected to contain – went unchallenged during cross-examination.17Foot Note 17×NE, 27 October 2021, page 26, lines 28 – 32.When the Accused was asked why Sgt Yogaraj’s testimony on this was not challenged, all the Accused could say was, “It did not occur to me”.18Foot Note 18×NE, 3 November 2021, page 26 line 28 to page 28 line 20, specifically at page 28 lines 6 – 8 and 14 – 17. 25 The allegation against Sgt Yogaraj was a very serious one: that he, a CNB officer, had told an accused person that certain items were drugs, obtained an admission of knowledge on that basis, and then lied to the court about it. Yet the allegation was not put to Sgt Yogaraj. Instead, various other possible explanations were suggested to Sgt Yogaraj for the Accused’s admission that he knew the “books” were drugs. In particular, it was suggested that the Accused might only have realised, and admitted to knowing that the “books” were drugs: from being arrested by the CNB, being shown the bundles, and being read the MDP Notification (which in Tamil mentioned “bothai porul” – illegal drugs).19Foot Note 19×NE, 27 October 2021, page 37, lines 6 – 11; page 35, lines 8 – 10.In his testimony, however, the Accused did not say that his admission arose from the matters his counsel had suggested to Sgt Yogaraj; instead the only explanation proffered by the Accused was that Sgt Yogaraj hadtold himthe “books” were drugs.20Foot Note 20×NE, 3 November 2021, page 26 line 2 to page 28 line 20. 26 Indeed, the Accused had, in his ninth long statement recorded on 28 March 2019 under s 22 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (the “CPC”),21Foot Note 21×AB 237.explained answer 13 in the Contemporaneous Statement (“… I know it is drugs”) by claiming that he had said this because the officers told him that the “books” were drugs.22Foot Note 22×AB 249.What the Accused said in his ninth long statement was as follows: Qn 35a: … You stated in your contemporaneous statement you know the 3 ‘booku’ are drugs but why did you tell me that you did not know the contents of the 3 “books”? Ans 35a: I only came to know that there were drugs after I was arrested. Qn 35b: How did you get to know that the 3 ‘booku’ are drugs? Ans 35b: Because they arrested me, I then only knew it was drug. Qn 35c: How did you know it was drugs? Ans 35c: The officers are the ones who told me they were drugs. Qn 35d: So you are saying that you answered the question and said it was drugs because officers told you it was drugs? Ans 35d: Yes. Because I was already arrested and I knew it was drugs. So I told the officers that they were drugs. [emphasis added in bold] 27 Yet this version of events was not put to Sgt Yogaraj. Instead, Sgt Yogaraj was presented with various other possibilities which did not include him (or any other officer) telling the Accused that the “books” were drugs. In the present case, it would be appropriate to apply the rule inBrowne v Dunnto preclude the Accused’s submission on the point. 28 In any event, I accept Sgt Yogaraj’s testimony over that of the Accused for the following reasons: (a) First, it is unlikely that a CNB officer would tell an accused person what certain items (under investigation) were, only to then ask the accused person what those items were – as Sgt Yogaraj did in question 13 of the Contemporaneous Statement.23Foot Note 23×AB 128. (b) Second, if the Accused’s version of events had happened and Sgt Yogaraj had told him that the “books” were drugs, one would expect his answer to question 13 (“What is ‘booku’?”) to be something like, “you told me the ‘books’ were drugs”, rather than “I know it is drugs” (which is what he said). (c) Third, if the Accused had truly believed that the “books” were wrongful reading books, but Sgt Yogaraj then told him they were drugs, one would expect the Accused to mention in the Contemporaneous Statement that he thought they were reading books and not drugs. The Accused could not explain why he had not mentioned this, other than to say that it did not occur to him at that moment because he was in a state of panic.24Foot Note 24×NE, 3 November 2021, page 30 lines 4 – 25; page 31, lines 16 - 31Panic is, however, an unlikely explanation for an accused person to have said “I know it is drugs”, rather than to say that is what the CNB officer had told him, and that he thought he was carrying reading books, not drugs. (3) The Cautioned Statement 29 In his Cautioned Statement25Foot Note 25×AB 186 – 188.recorded on 19 March 2019 under s 23 of the CPC, the Accused did not say that he thought he was carrying wrongful reading books, rather than drugs. He was informed that he was being charged for trafficking in not less than 500 grams of cannabis. He was informed that if he kept quiet about any fact or matter in his defence, and raised it only at trial, he might be less likely to be believed. Yet the Accused did not say he thought he was carrying wrongful reading books, and not drugs. What he said was: I don’t know how to say. I know I committed an offence but I don’t know that it is so serious that it carries a death sentence. I need to call back home. That is all. 30 The Accused’s failure to mention that he thought the bundles were wrongful reading books, not drugs, justifies an adverse inference being drawn against the Accused pursuant to s 261(1)(c) of the Criminal Procedure Code 2010 (2020 Rev Ed). One would expect him to have said to the CNB officers in his Cautioned Statement, and at the latest in the course of the investigation in his long statements, that he thought the bundles were reading books, not drugs – if that was what he truly believed. The fact that the Accused did not say so in any of his statements to the CNB, justifies drawing the inference that that is not what he believed:GovindarajuluMurali v Public Prosecutor[1994] 2 SLR(R) 398 at [32]–[33]. (4) The Long Statements 31 Under s 22 of the CPC, 11 long statements were recorded from the Accused from 21 March 2019 to 30 March 2019. He did not say in any of them that he thought the “books” were wrongful reading books, and the Accused acknowledged this in his testimony:26Foot Note 26×NE, 2 November 2021, page 76 lines 9 – 16. Q And when you stated that it is---when you said just now, when you testified that you thought it was a [sic] unlawful book, that would be---that was not something that anyone told you, right? That was just your idea? A Yes, Your Honour. Q And, in fact, this thing that you thought it was a [sic] unlawful book doesn’t appear in any of the investigation statements done by---recorded by ASP Yang, correct? A Yes, Your Honour. 32 The Accused said he had not mentioned this because the long statements were recorded by a female officer, and so he did not mention that he thought the “books” were wrongful reading books with embarrassing contents.27Foot Note 27×NE, 2 November 2021, page 45 line 9 – page 47 line 21; page 49 lines 7 – 23.I do not accept this explanation: (a) First, the Accused’s Initial Statement and Contemporaneous Statement were recorded by male officers, and he had not said to them that he thought the “books” were wrongful reading books. (b) Second, in the course of recording the long statements, the Accused never said that he was uncomfortable speaking with a female officer, and that there was something he would like to say to a male officer. (c) Third, in his long statements the Accused had variously mentioned the “things” and “books” he was carrying, yet he stopped short of saying he thought they were wrongful reading books. Instead, he said heassumedthey were books because Siva (who had given them to him) said they were books, but when he opened the bag and checked the “things”, they did not look like reading books to him:28Foot Note 28×AB 234 – 235. Qn 12a: At Q&A 10b, you said you did not know what kind of “thing” that is even if you check. At Q&A 11i, you said “Siva” asked you to open and check if got three “books” inside. So how would you know how a “book” is supposed to look like when you said you do not even know how the “thing” is supposed to look like? Ans 12a: Because “Siva” told me it is a “book”. And that was when I know that “thing” is a “book”. Qn 12b: But how do you know how it is supposed to look like? Ans 12b: Because “Siva” told me that it would look like a “book”. When I opened the bag and saw the things, only then I realized that they are books. … Qn 12d: Did you check with “Siva” how a “book” is supposed to look like? Ans 12d: I did not ask “Siva” how the “books” looked like. When he told me to check the bag, I saw the three “things” inside and I assumed they are “books”. Because “Siva” is the one that told me that there will be “books” inside. Qn 12e: What is your definition of “book? Ans 12e: To me, book means a reading book. A book that can be read. Qn 12f: How is a “book” supposed to look like. Ans 12f: You can flip pages of book and read. Qn 12g: So, when you said you assumed the three items in Photos 9, 10 and 11 are “books”, was it because they look like reading books? Ans 12g: No, they are not like reading books, they look like packets. Qn 12h: You said the three items look like packet in Q&A 12g, then how did you assume they are the “books” that “Siva” was referring to? Ans 12h: I am saying these are “books” because “Siva” told me these are “books”. Qn 12i: How did “Siva” tell you these are “books”? Ans 12i: “Siva” told me these are book. Then only I knew these are “books”. Qn 12j: Did “Siva” tell you specifically what to look out for? Ans 12j: “Siva” told me to check the bag and he told me to check whether there were three “books” inside. So I touched the things and I told him that there were three books inside. He said that one would be in plastic and the other two would not be in plastic. [emphasis added in bold] 33 Throughout this process, the Accused had ample opportunity to say that he thought the “books” were wrongful reading books. Instead, he merely said that “Siva” had referred to the “things” he was carrying as “books”, and that he assumed that they were books because “Siva” said so. However, that assumption was not based on the “books” looking like reading books – when he checked them, they looked like packets, not reading books. The circumstances of the transaction 34 The circumstances of the transaction also go against the Accused believing that he was merely carrying wrongful reading books – specifically: (a) what the Accused collected from third parties for the bundles; (b) what the Accused was paid for delivering the bundles; (c) the fact that both “Siva” and the Accused viewed the deliveries as dangerous transactions; and (d) the checks done by the Accused on the bundles. 35 Where an accused person has said what he thought the items in his possession were (here, wrongful reading books), the court will assess that against the objective facts and examine his actions accordingly to determine if the presumption of knowledge under s 18(2) of the MDA has been rebutted. The court will consider factors such as the nature, the value and the quantity of the items, any reward for transporting it, and any amount that was to be collected upon delivering it:Obeng Comfort v Public Prosecutor[2017] 1 SLR 633 (“Obeng”) at [40],SaravananChandaram v Public Prosecutor[2020] 2 SLR 95 (“Saravanan”) at [34],Gobiat [57(c)]. (1) What the Accused collected from third parties for the bundles 36 The Accused said that the occasion on which he was arrested was the fourth such delivery of bundles for “Siva”.29Foot Note 29×AB 192, para 13 and 193, para 18.When he was arrested, a sum of S$5,260 was recovered from the trailer,30Foot Note 30×SOAF at para 3 and Schedule A, para 2.which the Accused said (in the Contemporaneous Statement) was payment he had collected for two bundles on the third delivery: S$2,860 for one bundle, S$2,400 for another.31Foot Note 31×AB 129.The total of S$5,260 is equivalent to some RM15,780. 37 InRamesh a/l Perumal v Public Prosecutor[2019] 1 SLR 1003 (“Ramesh”), the accused person, Chander, claimed that he thought he was delivering betel nuts. In fact, he was delivering diamorphine, and had been handed a sum of S$2,300 for a previous delivery. The court observed that given the large sum of money involved, he must have known that what he had previously delivered, and was again delivering, could not have been betel nuts: at [43]. 38 Similarly, I find that the substantial payment of an average of S$2,630 (RM7,890) per bundle goes against the Accused’s claim that he thought they were merely wrongful reading books. 39 The Defence submitted that the collection of S$5,260 on the third occasion was at best a neutral factor, for the Accused had not collected any money on the first two occasions when he had delivered bundles for “Siva”.32Foot Note 32×Further Closing Submissions of the Defence, para 27.The Defence asked, rhetorically, “Might the relatively large sum collected during the third delivery job have been intended to cover the cost of the “books” delivered for the first and second jobs as well?”33Foot Note 33×Further Closing Submissions of the Defence, para 28.There is no evidence on the point, and I consider it unlikely that payment for the first two deliveries would be deferred until the third job. But even if the S$5,260 collected was meant to cover the cost of the three deliveries in total, the amount of that payment would still go against the Accused’s claim that he thought he was delivering wrongful reading books, which would likely not cost over S$5,000. (2) What the Accused received for delivering the bundles 40 In the Contemporaneous Statement, the Accused said he was paid RM200 for delivering each “book”.34Foot Note 34×AB 129.In his third long statement recorded on 22 March 2019, he changed that to RM200 for every “job”35Foot Note 35×AB 204, para 61; AB 208, para 77.– which he explained meant he was paid RM200 per trip (in his ninth long statement recorded on 28 March 2019).36Foot Note 36×AB 238, Qn and Ans 15a.He said he had lied in the Contemporaneous Statement about receiving RM200 per “book” because he was scared from having been arrested.37Foot Note 37×AB 261, Qn and Ans 52a – 52c.This would mean the Accused had lied about receivingmoremoney than he was actually paid, because he was scared. 41 I doubt that explanation. But whether the Accused was paid RM200 per “book”, or RM200 per trip, it was more than what his employer paid him – which was only RM120–125 per trip from Malaysia to Singapore to deliver goods including pellets, detergents and bread (with his monthly salary averaging RM3,500).38Foot Note 38×AB 214, paras 103 – 105.This further supports the conclusion that he did not think the “books” were merely wrongful reading books. 42 InSaravanan, the accused person claimed he believed he was transporting tobacco, not drugs. He was paid either S$5,000 (per the statement of facts), or RM2,000 (the figure given by him at trial). The court noted that in either case, it undermined the economics of a deal that purportedly involved tobacco worth at most RM7,000 on the accused person’s own evidence:Saravananat [35(d)]. Here, both the amounts the Accused collected from third parties, and what he was paid for making the deliveries, suggest that he was not merely carrying wrongful reading books, and that the Accused knew that. 43 It is also notable that the Accused gave inconsistent accounts of whether he had actually received payment from “Siva”, or just a credit in reduction of a loan he had taken from “Siva”. In his long statements, he said that he was paid by “Siva” transferring the money into his Maybank account.39Foot Note 39×AB 204, para 61; AB 208 – 211, paras 77, 81 and 88; AB 214 – 215, para 105.At trial, however, the Accused said that this statement about “Siva” paying him RM200 for every job was not true.40Foot Note 40×NE, 2 November 2021, page 7 lines 1 – 18.He said, the truth was that he had borrowed some RM3,000 from “Siva”, and RM200 was deducted from that loan for every job he did for “Siva”. He said he did not inform the investigator about the loan from “Siva” as it was his “personal thing”. This explanation makes no sense – the Accused had shared with the investigator various personal matters about his family, and he could not explain why the supposed loan from “Siva” was even more personal, such that he would decline to mention it, and instead lie about receiving payments into his Maybank account.41Foot Note 41×NE, 2 November 2021, page 35, lines 16 – 28; page 39, lines 20 – 28; page 72 line 28 – page 73, line11; 3 November 2021, page 4, line 4 – page 8 line 17.Perhaps the Accused considered it somehow advantageous to say there was a deduction from what he owed “Siva”, rather than payments received through his bank account, but the distinction does not help him. In any event, it damages his credibility to have either lied to the investigator, or lied to the court. (3) Both “Siva” and the Accused viewed the deliveries as dangerous transactions 44 The Accused said in his long statements that “Siva” had told him that bringing the “books” into Singapore was a dangerous job,42Foot Note 42×AB 204, para 61; AB 223, Qn and Ans 3a.and that he had initially told “Siva” that he did not want to do the job because it was dangerous and he was scared.43Foot Note 43×AB 206, para 69, AB 220, Qn and Ans 1a.He said he still chose to do it despite being scared: “The only one reason is for the money.”44Foot Note 44×AB 220 – 221, Qn and Ans 1b – 1e; AB 222, Qn and Ans 2d, 2e; AB 223, Qn and Ans 3e, 3f; AB 225, Qn and Ans 4e – 4g.This extract from his third long statement gives a flavour of the Accused’s thinking in that regard:45Foot Note 45×AB 205, paras 64 – 65. 64. [“Siva”] did not explain what this “book” was about. He only said it was a dangerous job because I had to deliver the “thing” to someone in Singapore and that I had to be very careful when doing this job and also be very careful when delivering the “thing” to someone in Singapore. He did not mention any reason on why I needed to be careful. He also did not explain why it was dangerous. He just told me to be careful and that was all. 65. I did not ask him why I had to be careful. I did not ask him why it was dangerous. I did not ask him what was that “thing”/”book” about. I did not ask him why I needed to collect the money from the people in Singapore. I did not bother much and did not ask him anything because all I wanted was the money from him. 45 In a later statement, the Accused sought to recast the above, to say he thought his deliveries for “Siva” were dangerous because if his boss found out, he would be sacked from his job as a delivery driver.46Foot Note 46×AB 225 – 227, Qn and Ans 5b – 5j.This does not sit well with his earlier statements, which included him saying that he was scared to bring the “things” into Singapore “[b]ecause [he] needed to pass through customs and bring the thing into Singapore.”47Foot Note 47×AB 223, Qn and Ans 3b – 3c.Moreover, on his own account, he knew that he was smuggling something illegal into Singapore, save that he claimed he believed it was just wrongful reading books, not drugs. His concern about the deliveries of the “books” being dangerous was not limited to the fear of losing his job as a delivery driver – he knew he was breaking the law. 46 I find that the Accused’s statements about the deliveries being dangerous, and him being scared, do not support his assertion that he thought the books were merely wrongful reading books. They suggest that he knew he could get into more serious trouble, than if he were merely delivering wrongful reading books. Moreover, he had not – when expressing his concerns about carrying out the deliveries – said in his statements that he thought he was delivering wrongful reading books. 47 It is unlikely that the Accused would simply have accepted that the bundles were “books” as “Siva” had allegedly told him. The Defence submitted that unlike the accused person inMohamedShalleh, the Accused had no knowledge that “Siva” was involved in illegal activity.48Foot Note 48×Further Closing Submissions of the Defence, para 19.However, this is not borne out by the Accused’s testimony, which was merely to the effect that he did not know “Siva’s” background or whether “Siva” was a licenced moneylender.49Foot Note 49×NE, 2 November 2021, page 9, lines 20 – 23.Nor is the Defence’s contention supported by the other evidence here, specifically: (a) the Accused himself described the “things” he was carrying, aswrongfulreading books; (b) both “Siva” and the Accused regarded the job as a dangerous one (see [44]–[46] above); (c) the Accused was fearful because he needed to pass through customs and bring the “things” into Singapore (see [45] above); and (d) the Accused had surrendered the “things” to Sgt3 Syazwan when he was asked if he had anything to surrender (see [13] above).50Foot Note 50×AB 108, para 9. 48 In those circumstances, the Accused would have “proceed[ed] with caution in his dealings” with “Siva” rather than believed whatever “Siva” had said about the things he was asked to carry (MohamedShallehat [34]). (4) The checks done by the Accused on the bundles 49 The Accused gave different accounts of whether he had checked the “books” only on the fourth occasion (when he was arrested), or also on the earlier three occasions when he had delivered bundles for “Siva”. He also gave different accounts of whether he could properly see the “things” in the bag. 50 In his second long statement recorded on 21 March 2019, the Accused said that on each of the four occasions that he had delivered the “things”, he had opened the bags in which the “things” were, and checked them.51Foot Note 51×AB 198, para 32. 51 In his seventh long statement recorded on 26 March 2019, however, he said he had only checked the “things” in the bag on the fourth occasion, just before he was arrested.52Foot Note 52×AB 227, Qn and Ans 7.That was also his position at trial.53Foot Note 53×NE, 2 November 2021, page 51, line 3.At trial, he also sought to deny having said in his second long statement that he had checked the “things” on the three previous occasions. He could not, however, explain why a different account was provided in his second long statement, or why he had not asked to correct it after the second long statement was read back to him in Tamil.54Foot Note 54×NE, 2 November 2021, page 50, line 25 – page 51, line 27.On this, I find that the Accused had, as recorded in his second long statement, checked the “things” on all four occasions. This is how it was recorded:55Foot Note 55×AB 198, para 32. 32. Normally, I would only take the bag and opened [sic] to see before the person comes and collect the thing. This is the same for all the previous three times that I brought the “things” into Singapore. Because I am very scared to do all these things, so I would only open the bag to check before the person comes and collect the “things”. 52 The Accused also provided inconsistent accounts of whether he had touched the “things”. At trial, the Accused said that when he had checked the “things” on the fourth occasion, just before he was arrested, it was dark inside the trailer as he had not switched on the light.56Foot Note 56×NE, 3 November 2021, page 12, lines 22 – 28.He also said that he had unzipped the bag buthadnottouched the “things”.57Foot Note 57×NE, 2 November 2021, page 57, line 9 – page 59, line 10.That was also the position stated in his second long statement recorded on 21 March 2019:58Foot Note 58×AB 198, paras 27 and 28. 27 … I turned over to the back passenger seat, reached for the black colour school bag, and then opened the zip. I looked inside that bag but did not place my hand inside the bag.I did not touch anything inside the bag. When I looked inside that bag, I saw the “things” in bundles and bundles. I saw the three “things”. It seemed to be like a book all stacked up. 28 One of the bundles was inside a white plastic bag. The other two bundles were not inside any plastic bag, but were placed on top of a cloth. I think it was a black colour cloth which looked like a shirt. I think so only, I cannot confirm the exact colour of the cloth but I can confirm it was a dark colour cloth. I can also confirm it looked like a t-shirt. I cannot confirm if that t-shirt has a collar but it definitely looked like a t-shirt to me. I just saw the three “things” and the dark colour cloth that looked like a t-shirt and that was all. I know for sure I saw three “things” because they were right at the top of the black colour school bag. [emphasis added in bold] 53 In his eighth long statement recorded on 28 March 2019, however, the Accused said hehadtouched the three “things” in the bag – he said he had touched them because he needed to count the “things”. Indeed, he said that he had brought one of the “things” a bit forward and then pushed it back inside the bag.59Foot Note 59×AB 235 – 236, Qn and Ans 12j to 13f; AB 270.That was a reference to the bundle that was in a white plastic bag (as shown in Photo 11), although the Accused said he was not sure if he had touched the bundle itself, or the plastic bag holding it. The Accused was specifically referred to para 27 of his second long statement (quoted at [52] above) where he said he had not touched anything in the bag; he was asked which version of events was correct, and he maintained that hehadtouched the “things”. 54 The Accused continued to maintain that he had touched the “things” in his tenth long statement recorded on 29 March 2019 – he again said that para 27 of his second long statement (where he said he had not touched the “things”), was wrong.60Foot Note 60×AB 256, Qn and Ans 42. 55 At trial, however, the Accused reverted to saying that he had not touched the “things” in the bag.61Foot Note 61×NE, 2 November 2021, page 57, line 9 – page 59, line 10.He could not explain his vacillating positions, except to say that he was very confused.62Foot Note 62×NE, 2 November 2021, page 57, line 9 – page 59, line 10.The statements do not, however, bear out this alleged confusion: in his eighth long statement, the Accused had described in some detail which of the “things” he had touched, why he had touched them, and the manner in which he had touched them. In particular, the Accused had explained that he had touched the “things” because he had to count them, and added that he had even pulled one of the “things” a bit forward and then pushed it back, specifically identifying the one of the three bundles that was in the white plastic bag (see [53] above). Moreover, he maintained this on a separate occasion when his tenth long statement was recorded, further confirming that the version of events stated in the second long statement was incorrect (see [54] above). Notably, he did not say at any time in the statement recording process that he was confused. 56 On a related note, in his second long statement, the Accused described the “things” in some detail (see the extract quoted at [52] above), and that is inconsistent with his claim at trial that he had simply looked into the bag, with the light off. This suggests that even if the light was off, he was still able to see what he had described in his statements. 57 In any event, I find that the Accused had touched the bundles, as he had admitted in his eighth and tenth long statements. His having checked and touched the bundles is consistent with his ability to describe them as looking like packets (see [32(c)]–[33] above), with other details besides (see [52] above). This goes against his main defence that he thought they were wrongful reading books. 58 The Accused seemed to be distancing himself from the contents of the bag, so as to deny knowledge of what they were. When confronted about why he thought the “things” in the bag were “books” despite not having touched them, he started by saying “what was told to me [was] that it was books and it looked like books to me”. He was then asked how he could say they looked like reading books if the cab was dark, and his responses were: “Because Siva told me that it was books.” and “What was informed to me, that it was books. That’s all.”63Foot Note 63×NE, 3 November 2021, page 13, lines 1 – 24; page 14, line 18 – page 15, line 7. 59 It is significant that the Accused’s fallback was that“Siva” saidthe “things” were “books”, rather than thatthe Accusedhimself thoughtthey were “books” because ofwhat they looked like to him. This was reminiscent of what he said in his eighth long statement (discussed at [32(c)]–[33] above): “Siva” referred to the “things” as “books”, and the Accused assumed that they were books because “Siva” said so, not because the “books” looked like reading books. Indeed, when he checked them, they looked like packets, not reading books. 60 As the Court of Appeal observed inMohamedShalleh bin Abdul Latiff v Public Prosecutor[2022] SGCA 23 (“MohamedShalleh”) at [32]: It would rarely, if ever, be sufficient for an accused person to rebut the s 18(2) presumption by stating simply that he believed whatever he was told in relation to what was in his possession. Where such a claim is made, the court will, of course, have to consider whether it believes that bare claim and in that regard, it will be necessary to consider the entire factual matrix and content, including the relationship between the parties, and all the surrounding circumstances. 61 The Accused had never seen “Siva”.64Foot Note 64×NE, 2 November 2021, page 23, lines 17 – 19.He did not know “Siva’s” full name65Foot Note 65×NE, 2 November 2021, page 24, lines 5 – 7.or whether “Siva” was his real name,66Foot Note 66×NE, 2 November 2021, page 24, lines 28 – 30.where “Siva” lived,67Foot Note 67×NE, 2 November 2021, page 24, lines 8 – 9.what “Siva’s” job was or what business “Siva” was doing.68Foot Note 68×NE, 2 November 2021, page 24, lines 10 – 11; page 50, lines 10 – 12. 62 What the Accused did know, is that he was doing something illegal on behalf of “Siva” (save that he claimed he believed that he was just carrying wrongful reading books); that he was scared because he needed to pass through customs and bring the “thing” into Singapore; that Siva had said the job was a dangerous one; and that he chose to do the job despite being scared because he wanted the money (see [44]–[45] above). 63 Any relationship between the Accused and “Siva” was essentially transactional and superficial in nature, like that inMohamedShalleh(see [35]). As such, it is implausible that the Accused would simply have believed what “Siva” had told him – that the bundles were books – despite having personally checked and touched the bundles. 64 Moreover, as inMohamedShalleh, the fact that the Accused had himself seen, checked, and touched the bundles (as I found at [51] and [57] above) is highly relevant. In that case, the bundles were roughly palm-sized, rounded packages which the accused person could not have thought to contain two and a half cartons of cigarettes (which is what he said he was told they contained). The Court of Appeal upheld the trial judge’s decision that the appearance of the bundles must have caused the accused person to know that they contained something else, and whatever he had been told about them containing cartons of cigarettes was therefore manifestly unreliable:MohamedShallehat [36]. 65 In the present case, the Accused admitted that he had checked the bundles, and that he saw that “they [were] not like reading books, they look[ed] like packets” (see [32(c)]–[33] above). Thus, even if the Accused had understood from Siva’s use of the term “buku” that he was carrying reading books, he would have known they werenotreading books after having seen what they looked like. 66 I thus find that the Accused has not rebutted the presumption by stating simply that he believed the bundles were books because Siva had said they were books. Conclusion on the Accused’s main defence that he thought the bundles were “reading books” 67 In view of the above, I do not accept the Accused’s testimony that he thought the bundles were “reading books”. His main defence on the element of knowledge thus fails. I go on to consider his alternative defence on this.",
        "The Accused’s alternative defence: even if the Accused believed he was carrying an illegal drug, he did not know which drug it was": "68 The Accused’s alternative defence (that he did not knowwhichillegal drug he was carrying) was not mentioned in his testimony, and understandably so: it is inconsistent with his main defence of believing that the bundles were “reading books”. 69 The alternative defence was put forward only in oral reply submissions, after the exchange of written closing submissions. The contention is: even if the Accused did not genuinely believe the bundles were “reading books”, and instead he knew the bundles were drugs (as he had said in the Contemporaneous Statement – see [16]–[19] above), the presumption of knowledge is nevertheless rebutted for the Accused did not know if the drug he was carrying was cannabis or some other drug.69Foot Note 69×NE, 28 February 2022, page 25, lines 5 – 15 and page 29 line 7 – page 40 line 20. 70 InGobiat [59], the court noted that the cases in which the presumption of knowledge has successfully been rebutted can broadly be divided into two categories: (a) First, where the accused person is able to prove that he believed he was carrying somethinginnocuous,even if he is unable to specify exactly what that was. Such a belief, by definition, excludes a belief that he was in possession of a controlled drug, let alone the specific drug in his possession. (b) Second, where the accused person is able to prove that he believed he was in possession ofsome contraband item or drug other thanthe specific drug in his possession. 71 The Accused’s alternative defence would not fall in either category: (a) It would not fall in the first category, for the Accused would not be thinking he was carrying something innocuous. (b) It would not fall in the second category – the contention is not that the Accused thought the drug he was carrying wasnotcannabis; rather, it is that the Accused thought he was carrying a drug, which might be cannabis, but he did not know if it was cannabis or some other drug. 72 If the Accused believed he was in possession of an illegal drug that might be cannabis, but simply asserts that he did not know what type of drug it was, that does not rebut the presumption under s 18(2) of the MDA that he knew the drug was cannabis. 73 The court inGobinoted at [57(a)] that an accused person who seeks to rebut the presumption of knowledge “should be able to say what he thought or believed he was carrying, and a claim that he simply did not know what he was carrying would not usually suffice”. Nor will it suffice for the accused person simply to claim that he did not know what he was carryingsave that he did not think it was drugs:Saravananat [33],Obengat [39]. As the court inObengput it, if such a simplistic claim could rebut the presumption of knowledge, the presumption would be “all bark and no bite”. The Accused cannot be in a better position by claiming that even if he knew he was carrying illegal drugs, he did not knowwhichillegal drug. 74 The Defence’s contention is not that the Accused thought he was carrying something other than cannabis, it is that he simply did not know which illegal drug it was. This is not a case likeKhor Soon Leev Public Prosecutor[2011] 3 SLR 201, orPublic Prosecutor v Phuthita Somchit and another[2011] 3 SLR 719 where the court accepted that the accused persons knew they were in possession of drugs, but believed that they were drugsother than diamorphine(which is what the drugs in those cases actually were). 75 The Defence’s contention simply means the Accused was indifferent as to which illegal drug he was transporting. As the Accused said in his third long statement (quoted at [44] above), he did not even ask “Siva” what he was delivering: “I did not bother much and did not ask him anything because all I wanted was the money from him.” His ninth long statement recorded on 28 March 2019 is in similar vein. When questioned whether he had asked “Siva” about the contents of the “things”, he responded as follows:70Foot Note 70×AB 237, Qn and Ans 14a – 14d. Qn 14a: Have you ever thought about what was the content of the “thing” or “book” that “Siva” asked you to bring into Singapore for all the four times? Ans 14a: No, I did not think anything about the contents. Qn 14b: For these four jobs that you did, do you know what were the content [sic] of the “things” that you brought into Singapore? Ans 14b: I do not know. Qn 14c: Have you ever asked “Siva” what was the “thing” or “book” that you were supposed to bring into Singapore? Ans 14c: No. I did not ask him. I only followed his instruction. Qn 14d: Why did you not ask him? Ans 14d: I did not ask him because I was getting salary from him for doing this job. 76 An accused person who is indifferent as to what he is carrying would not have formed any view as to what the thingisoris not; he cannot be said to believe that the nature of the thing in his possession is something other than or incompatible with the specific drug he is in possession of. Accordingly, he would not have rebutted the presumption in s 18(2) of the MDA (Gobiat [65] and [69]). The Accused’s claim that he did not know which illegal drug he was transporting just means he thought that it might be cannabis, or it might be some other illegal drug. That is not “a positive belief that wasincompatiblewith knowledge that the thing he was carrying was the specific drug in his possession” which would rebut the presumption in s 18(2) of the MDA (Gobiat [60]). 77 The Defence contended that the Accused was unfamiliar with cannabis, and would not be able to recognise cannabis even if he opened the bundles.71Foot Note 71×Further Closing Submissions of the Defence, para 15.Attempting to distinguish the present case fromMohamedShalleh, the Defence cited the court’s observation at [31] that “[t]he [accused person’s] case wasnotthat he did not know what diamorphine was or that he would not have recognised it if he had seen it”.72Foot Note 72×Further Closing Submissions of the Defence, para 13.However, the court inMohamedShallehdid not say that such a claim would have rebutted the presumption of knowledge; the court was simply saying that that was not the accused person’s case. Instead, the accused person’s only case was that he never saw what was in the package he was asked to deliver and did not check because he was told that it contained cigarettes, and he believed what he was told. That case failed. 78 In the present case, the Accused did not say that because he could not recognise cannabis, he believed he was carrying somethingother than cannabis. Instead, his case was that he thought the bundles were wrongful reading books, because of:73Foot Note 73×NE, 3 November 2021, page 13, lines 1 – 24; page 14, line 18 – page 15, line 7; Closing Submissions of the Defence, paras 76 and 82. (a) “Siva’s” use of the term “buku”; and (b) what they looked like to him (which contradicts his eighth long statement that they looked like packets, not reading books) (see [32(c)]–[33] above). 79 The Accused never asked “Siva” what the bundles he was asked to carry contained; and he never checked what he was carrying beyond observing that the bundles looked like packets, not reading books. He did not care what he was carrying – that is indifference, which is insufficient to rebut the presumption of knowledge. It follows that the Accused’s alternative defence in relation to the element of knowledge fails. 80 In deciding whether the presumption of knowledge has been rebutted, the court must ask itself: “does it believe the accused person’s story?”(MohamedShallehat [32] and [45]). I do not believe the Accused’s story in the present case; I do not accept either his main or alternative defence. Accordingly, the presumption of knowledge has not been rebutted, and the element of knowledge is made out.",
        "Was the Accused in possession of the cannabis for the purpose of trafficking?": "81 It was submitted on behalf of the Accused that he had resiled from his intention to traffic by the time he was arrested.74Foot Note 74×Closing submissions of the Defence, paras 99–114.It is implicit in that submission, that the Accused had earlier intended to traffic in the bundles but changed his mind at some point. 82 The Accused admitted that he had delivered (ie,traffickedas defined under s 2 of the MDA) bundles for “Siva” on three previous occasions.75Foot Note 75×Closing submissions of the Defence, paras 30 – 31; AB 207 – 211, paras 73 – 88.On the fourth occasion, he had intended to deliver the bundles in his possession as well. The narrow submission by the Defence is that the Accused had changed his mind shortly before he was arrested – when he told “Siva” he wanted to leave the place where he had been waiting. 83 The Accused did not, however, say this in his testimony, nor in any of his statements. If in fact he had changed his mind about trafficking, one would expect him to have said so at some point. 84 As there was no testimony from the Accused that he had changed his mind, the Defence’s submission is instead based on the following:76Foot Note 76×Closing submissions of the Defence, paras 110 and 114; NE, 28 February 2022, page 54 line 17 – page 55 line 8. (a) on the fourth occasion, the Accused waited for over an hour for third parties to collect the bundles, which was longer than he had on the three previous occasions; (b) while waiting, the Accused made quite a few missed phone calls to “Siva”; (c) the Accused then received a call from “Siva” and that call was still in progress when the Accused was arrested; and (d) the contents of that last call show that the Accused had changed his mind about trafficking – instead, he had decided to leave without waiting further for the three “books” to be collected. 85 That last phone call was described by the Accused as follows in his first long statement recorded on 21 March 2019:77Foot Note 77×AB 194, para 20. 20. When I was waiting at that location, I did give “Siva” a few missed calls on my black hand phone because no one came and I waited quite long. I cannot recall how many missed calls I gave “Siva” but I know I did give him a few missed calls. In the last phone conversation, I also told “Siva” nvm [never mind] and that I wanted to leave first because the person was not here. So I said I wanted to leave first. I also told him how long he wanted me to wait? I have been waiting for a long time already and I also told him this was a dangerous job and the person was still not here, so I wanted to leave already. “Siva” told me to just wait a while, just wait a while, let’s just finish this job. And then when I was still talking to “Siva”, the officers came and arrested me already. We haven’t even finish talking on the phone yet. 86 The Accused was cross-examined on that aspect of his statement, as follows:78Foot Note 78×NE, 3 November 2021, page 41 line 23 – page 42 line 14. Q So my question is that Siva told you to wait for a [while] and to finish the job and that was your intention. A Yes, Your Honour. Q And when you say here in this statement, “finish the job”, that means to pass the three bundles to Siva’s contact? A Yes, Your Honour. [emphasis added in bold] 87 The Defence contended that the first question set out above (in bold) lacked precision, and that when the Accused answered “yes” he was only agreeing to the first part of the question – that “Siva” had told him to wait and to finish the job; he was saying nothing about the second part of the question – whether it was his intention to finish the job. 88 I do not accept that. If the Accused meant to say that is what “Siva” told him, but it wasnothis intention to do what “Siva” told him, he should have said so, rather than simply saying “yes”. Moreover, the Defence did not seek to clarify this aspect of his evidence in re-examination. 89 Further, the first part of the question – that “Siva” told him to wait and to finish the job – was quite uncontroversial. That is what the Accused had already said in his first long statement: ““Siva” told me to just wait a while, just wait a while, let’s just finish this job.” (quoted at [85] above). It would therefore have been clear to the Accused that the thrust of the question was its second part – whether it was the Accused’s intention to do what “Siva” had told him to do – and the Accused agreed with that. 90 This is reinforced by the cross-examination immediately preceding that question, where the Accused confirmed that he would follow whatever “Siva” told him, and in particular that he would pass all the three “books” to the person coming to collect them. The Accused was referred to question and answer 14 of the Contemporaneous Statement, which were as follows:79Foot Note 79×AB 128. Q14: Did [“Siva”] tell you who to pass the 3 ‘booku’ to? A14: No. He just told me when someone come to my lorry, just pass all the 3 ‘booku’. 91 The cross-examination of the Accused on this then went as follows:80Foot Note 80×NE, 3 November 2021, page 41, lines 5 – 22. Q So my question is---okay, so you confirm that this was Siva’s instruction, when someone came to your lorry, that your lorry being actually your trailer, you passed all the three books to that person, correct? A Yes, Your Honour. Q And your---what you’ve testified in Court several times is that you will follow whatever Siva told you, is that correct? A Yes, Your Honour. 92 That the Accused still intended to deliver the three bundles at the time of arrest, is further reinforced by his responses to the Prosecution’s concluding questions:81Foot Note 81×NE, 3 November 2021, page 53, lines 6 – 18. Q Okay. And as far as---so I put to you that as far as these books are concerned, we put aside the issue of what they contained, as far as these books were concerned, my case is that you collected them in Malaysia, you brought them into Singapore, correct? A Yes, Your Honour. Q Okay. And your intention was to pass it to whoever Siva’s contact was who would come to collect the three books? A Yes, Your Honour. 93 The evidence does not bear out any change in the Accused’s intention to traffic the three bundles. When he was arrested, he was still waiting at the place where he was expecting someone to come for the bundles. As recounted in his first long statement (see [85] above), the Accused had said to “Siva” that he wanted to leave and not keep waiting, but he had not left; “Siva” had asked him to wait for a while longer and finish the job, and his testimony was that he had intended to follow “Siva’s” instructions. 94 Furthermore, even if the Accused had intended to leave the place where he had been waiting, it does not follow that he had ceased to have the intention to traffic in the bundles. The Defence relied onRameshwhere the Court of Appeal had observed (at [110]): … a person who returns drugs to the person who originally deposited those drugs with him would not ordinarily come within the definition of “trafficking”. It follows that a person who holds a quantity of drugs with no intention of parting with them other than to return them to the person who originally deposited those drugs with him does not come within the definition of possession of those drugs “for the purpose of trafficking”. (See alsoRoshdibin Abdullah Altway v Public Prosecutor and another matter[2021] SGCA 103 at [103]–[120] for the Court of Appeal’s discussion ofRamesh.) 95 The observations of the Court of Appeal inRameshdo not assist the Accused. There was no evidence from the Accused as to what he intended to do with the bundles if he had left the place. He did not say that he intended to go back to Malaysia with the bundles and return them to “Siva”. He might simply have intended to go to another location in Singapore pending further instructions from “Siva” as to the delivery of the bundles. The evidence does not support a finding that he had changed his mind about delivering the bundles to third parties. 96 I thus find that the Prosecution has proved that the Accused was in possession of the cannabisfor the purpose of trafficking.",
        "Conclusion": "97 For the above reasons, I find that all three elements of the charge have been made out: (a) it is not disputed that the Accused had a controlled drug – cannabis – in his possession; (b) the Accused had knowledge of the nature of the drug – the presumption of knowledge under s 18(2) of the MDA not having been rebutted; and (c) the Accused’s possession of the drug was for the purpose of trafficking which was not authorised. 98 I thus convict the Accused of the charge. I will proceed to sentencing. Andre ManiamJudge of the High Court   Mark Jayaratnam, Jaime Pang and Kwang Jia Min (Attorney-General’s Chambers) for the Prosecution; Eugene Singarajah Thuraisingam and Hamza Zafar Malik (Eugene Thuraisingam LLP), Balakrishnan Chitra (Regency Legal LLP) and Dierdre Grace Morgan (Drew & Napier LLC) for the Accused.",
        "": ""
    }
}