{
    "case_title": "Bit Baltic Investment & Trading Pte Ltd (in compulsory liquidation)  vWee See Boon",
    "ncitation": "[2022] SGHC 110",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 This is an application by BIT Baltic Investment & Trading Pte Ltd (in compulsory liquidation) (“Plaintiff”) against its former director, Mr Wee See Boon (“Defendant”), for damages in respect of alleged breaches of fiduciary and statutory duties arising from alleged unfair preference payments amounting to US$1,472,500 (“Principal Sum”). Having considered the parties’ submissions, I dismiss the application. These are my reasons.",
        "Background": "",
        "The parties and other personalities": "2 Incorporated on 8 April 2011, the Plaintiff was in the business of chartering ships, tankers and vessels, as well as their management and operations. Between 8 April 2011 to 26 March 2020, the Defendant was the local resident director of the Plaintiff. Mr Peter Christian Harren (“Mr Harren”) and Dr Martin Harren (“Dr Harren”) were the other two directors. They are both Germans and reside in Germany.1Foot Note 1×Wee See Boon (“WSB”)’s affidavit dated 7 February 2022 at paragraph 1.All three directors were signatories of the Plaintiff’s DBS accounts. 3 The Plaintiff’s former immediate holding company is Harren & Partner Singapore Holding Pte Ltd (“HPSH”), and its former ultimate holding company is HPS International Holding GmbH.2Foot Note 2×Awe Cheok Huat (“ACH”)’s affidavit dated 5 July 2021 at paragraph 11.The Defendant was also a director of HPSH, and a signatory of HPSH’s bank account. 4 Between 12 December 2018 and 27 December 2018, HPSH partially repaid a loan from the Plaintiff to HPSH. In total, HPSH made six payments amounting to US$1,461,000 (“Repayments”). In turn, between 12 December 2018 and 27 December 2018, payments amounting to the Principal Sum were made by the Plaintiff to HARPA Service & Support GmBH & Co. (“HARPA”) and HPS Shipping & Management GmbH & Co. KG (“HPS”) in the respective sums of US$790,500 and US$682,000 (“Payments”). At the material time, Dr Harren was a director of HARPA and HPS. 5 According to the Defendant, the Payments were in relation to services furnished by HARPA and HPS to the Plaintiff from March 2014 to August/September 2016 concerning the vessel Blue Giant in the Gulf of Mexico. The service agreements signed by the Defendant, however, were both dated 1 October 2018.3Foot Note 3×ACH’s affidavit dated 5 July 2021 at paragraphs 17–20, and 24; see also ACH’s affidavit at pages 592 and 595.In a letter from Luther LLP on 11 September 2020 (“11 September 2020 letter”), on behalf of the three former directors, it was explained that the service providers “reserved the right to settle the group-wide costs at a later stage”. As such, the costs of the services were settled in 2018. This was said to be a “usual setup that a number of companies active in the business choose”.4Foot Note 4×ACH’s affidavit dated 5 July 2021 at pages 820–822.In a letter from I.N.C Law LLC dated 15 June 2021 (“15 June 2021 letter”) on behalf of the Defendant, again, it was explained that “it is not uncommon to distribute project-related costs among the project sponsors at a later point in time”. This is found in the reply to question 19 in the 15 June 2021 letter.5Foot Note 5×ACH’s affidavit dated 5 July 2021 at page 39. 6  The Plaintiff’s case is that that the Principal Sum comprised unfair preference payments under s 329 of the Companies Act (Cap 50, 2006 Rev Ed) (“CA”) read with s 99 of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“BA”). Allegedly, the Defendant “facilitated, permitted, acquiesced in or did not take any steps to prevent the payments of the [Principal Sum]”, and thus was in breach of a range of fiduciary and/or statutory duties.6Foot Note 6×ACH’s affidavit dated 5 July 2021 at paragraph 39.At the commencement of these proceedings, the Plaintiff primarily sought to recover the Principal Sum from the Defendant. On 23 December 2021, however, HARPA and HPS refunded the Principal Sum to the Plaintiff. This is preceded by a letter from Luther LLP on 1 December 2021 stating that “HARPA and HPS consider their claims against [the Plaintiff] to be well founded”. However, if the payments were seen to be giving them “preferential treatment” over other creditors under Singapore law, they were prepared to repay the sums, and “justify their claims in the same way as the other creditors would do.”7Foot Note 7×WSB’s affidavit dated 7 February 2022 at pages 15 to 16. 7 Notwithstanding the refund of the Principal Sum, the Plaintiff now seeks the recovery of damages as follows: (a) interests for the loss on the Principal Sum for the period between December 2018 to 22 December 2021 at 5.33% per annum amounting to US$256,026.41 (“Interest Payment”); and (b) costs incurred by the liquidator in reviewing the Plaintiff’s financial affairs, as well as the costs of the petitioning creditor, OIG Giant 1 Pte Ltd (“OIG”)  in investigating and commencing the winding up proceedings against the Plaintiff amounting to S$175,781.30 (“Cost Payment”). I will refer to these heads of claim collectively as “Additional Damages”. Additionally, the Plaintiff seeks legal costs against the Defendant on an indemnity basis. 8 The Defendant’s response is twofold. In the main, the Defendant denies the breach of fiduciary and/or statutory duties, and states that he acted in “good faith”.8Foot Note 8×WSB’s affidavit dated 7 February 2022 at paragraph 2.In the alternative, the Defendant submits that the principle of restitution ought to apply to the Interest Payment and that the applicable rate of interest should be the then-prevailing fixed deposit interest rate of the Plaintiff’s bank, that of 0.8% per annum.9Foot Note 9×Letter from Defendant dated 1 March 2022.The Defendant further contends that the Plaintiff was wound up due to business failure, and that the sums accrued under the Cost Payment would have been incurred in any event.10Foot Note 10×Defendant’s written submissions at paragraph 45.",
        "Duties owed by the Defendant": "9 It is important to begin by ascertaining the duties owed by the Defendant before examining his role vis-à-vis the Payments. 10 The company-director relationship is a well-established category of fiduciary relationship. The Plaintiff submits that the Defendant owed duties such as,inter alia, the duty to actbona fidein the best interests of the company, as well as to exercise care, skill and diligence. These duties are also respectively grounded in ss 156 and 157(1) of the CA. The Plaintiff further argues that as it was nearing insolvency, insolvent, or in a parlous financial position, the Defendant’s fiduciary duty would extend to taking into account the interests of the Plaintiff’s creditors when making decisions. These propositions of law concerning the Defendant’s duties are not disputed. 11 The fact that the Defendant was the local resident director whose primary responsibility was to ensure that the necessary paperwork with auditors, agencies and regulatory authorities in Singapore,11Foot Note 11×Defendant’s written submissions at paragraph 6.does not relieve him of these duties. Similarly, the fact that the Defendant might have been a nominee director does not absolve him of these duties.12Foot Note 12×WSB’s affidavit dated 7 February 2022 at paragraph 1.That there is a minimum standard required from all directors, executive or otherwise, is well-established and recognised:Ho Soo Fong and another v Ho Pak Kim Realty Co Pte Ltd (in liquidation) [2021] SGCA 35 at [10]. 12 It is, however, important to distinguish between the types of duties owed by the Defendant to the Plaintiff. Certain duties, such as the duty to actbona fidein the best interests of the company, are core fiduciary duties, as compared to the duty of care, skill and diligence:ThenKhek Koon and another v Arjun Permanand Samtani and another and other suits[2014] 1 SLR 425. Depending on the nature of the duty involved, different remedial consequences follow. By way of example, the breach of a non-custodial fiduciary duty (namely, the duty to act in good faith, the duty of no-conflict and the duty of no-profit) entitles a claimant to the relief of equitable compensation. In contrast, the breach of the duty of care and diligence only allows the claimant to obtain the common law remedy of compensatory damages measurable by reference to the losses suffered. 13 As it stands, the Plaintiff’s case appears to centre heavily on demonstrating that the Defendant breached core fiduciary duties. This is evident from the Plaintiff’s submissions as well as in the nature of the relief sought, that being equitable compensation. Relying onSim Poh Ping vWinsta Holding Pte Ltd and another and other appeals[2020] 1 SLR 1199, the Plaintiff argues that it is entitled to equitable compensation, and that the Defendant is liable for the Additional Damages as he has failed to rebut the presumption that his breaches did not cause the Additional Damages. 14 To assess whether a director has breached his duty to actbona fidein the best interests of the company, the test is both subjective and objective. The subjective element lies in the court’s consideration of whether the director had exercised his discretionbona fidein what he considered was in the interests of the company while the objective test requires an assessment of whether an intelligent and honest man in the position of a director of a company concerned could, in the whole of the existing circumstances, have reasonably believed that the transactions were for the benefit of the company:Goh Chan Peng and others vBeyonics Technology Ltd and another and another appeal[2017] 2 SLR 592 at [35] and [36]. As for the duty to act with care, skill and diligence, the standard expected of a director in these respects is subject to the minimum objective standard which entails the obligation to take reasonable steps to place oneself in a position to guide and monitor the management of the company:Ho Yew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 at [137]. 15 I now turn to the key allegations raised by the Plaintiff against the Defendant.",
        "Whether the Defendant was in breach of any of his fiduciary or statutory duties": "16 The Plaintiff contends that the Defendant was in breach of his fiduciary or statutory duties for: (a) failing to determine whether or not it was permissible for the Plaintiff to make the Payments; (b) failing to ascertain whether or not the other directors of the Plaintiff acted in breach of their statutory duties under the Companies Act in facilitating the Payments; (c) failing to ascertain whether or not the other directors of the Plaintiff acted in breach of their fiduciary duties in facilitating the Payments; and (d) failing to ascertain whether the other directors of the Plaintiff acted in breach of the Plaintiff’s Constitution in facilitating the Payments. 17 As stated above, underlying the Plaintiff’s case against the Defendant is that the Payments were unfair preference payments. Taken together with the omissions at [16], the Plaintiff avers that the Defendant is in breach of his various duties, such as to actbona fidein the best interests of the company and to exercise care, skill, and diligence. 18 In response, the Defendant argues that he was a local resident director and acted in good faith in the discharge of his duty and responsibility. Moreover, the Defendant avers that at the material time, he was not in the know about the Payments. In fact, the Defendant contends that the Payments were authorised by the German directors, Mr Harren and/or Dr Harren. They had full management and conduct of the Plaintiff’s business operations and financial matters. He was only subsequently informed by the Finance Manager, Ms Lim Woan Ching, that the Payments had been made, and that the Payments were “approved by the German finance department via the authorised digitpass token”.13Foot Note 13×WSB’s affidavit dated 20 September 2021 at paragraphs 6,15 to 19.",
        "Whether the Payments constitute unfair preference payments": "19 From the outset, I observe that the Defendant does not heavily contest that the Payments were unfair preference payments. On an examination of the Payments and the statutory requirements, I agree with the Plaintiff that they were unfair preference payments. 20 First, the Principal Sum was paid to HARPA and HPS, who were creditors of the Plaintiff by virtue of the service agreements signed between HARPA, HPS and the Plaintiff. Pursuant to these agreements, invoices totaling the Principal Sum were issued by HARPA and HPS. 21 Second, the Plaintiff was insolvent or became insolvent because of the Payments, as per s 100(4) of the BA. As of 31 December 2018, the Plaintiff had net liabilities of US$1,132,751.14Foot Note 14×ACH’s affidavit dated 5 July 2021 at paragraphs 30–31.Additionally, the Plaintiff had stopped generating revenue by the end of 2017.15Foot Note 15×ACH’s affidavit dated 5 July 2021 at paragraph 32. 22 Third, the payment of the Principal Sum placed HARPA and HPS in a better position as compared to their position if the Plaintiff was wound up and the Principal Sum was not paid out. Apart from HARPA and HPS, the Plaintiff owed OIG, a sum of S$1,805,568.10. The Plaintiff would not have had sufficient assets to satisfy all the Plaintiff’s creditors. Consequently, HARPA and HPS were unlikely to have received the full sum of moneys owing. 23 Fourth, the Payments occurred within the relevant time frame of two years from the date of the making of the winding up application (19 April 2020 by OIG). The time frame of two years is based on HPS and HARPA being associates with the Plaintiff, by virtue of their sharing of a common director, Dr Harren: s 99(5) of the BA. 24 Fifth, a rebuttable presumption that the Plaintiff was influenced by a desire to prefer in making the Payments arises on the basis that HARPA and HPS are associates with the Plaintiff: s 99(4) of the BA read with s 329(1) of the CA. Accordingly, the payees,ie, HARPA and HPS, bear the burden to rebut the presumption that the Payments were not influenced by the Plaintiff’s desire to prefer the payees. The Defendant has not sought to do so and indeed, HARPA and HPS have repaid the Payments. 25 Based on the above, I find that the Payments were unfair preference payments.",
        "Whether the Defendant failed to determine or ascertain whether the Plaintiff or the other directors should have facilitated the Payments": "26 The Plaintiff’s quarrel with the Defendant concerns his omissions or inaction in relation to the Payments, in particular, for failing to determine whether it was permissible for the Plaintiff to make the Payments and for failing to ascertain to ascertain whether theother directorswere acting in breach of their various duties in facilitating the Payments. 27 In my view, it is clear that the Defendant neither determined whether it was permissible for the Plaintiff to make the Payments nor ascertained whether the other directors acted in accordance with their duties in facilitating the Payments. This is not disputed by the Defendant, who avers that he was completely unaware of the Payments at the material time. To reiterate, on the Defendant’s account, he was only informed about the Payments by the Finance Manager subsequently, and that the Payments were authorised by the other directors. If so, there is no doubt that the Defendant did not check whether the Plaintiff should have made the Payments or if the other directors were acting in accordance with their duties in facilitating the Payments. 28 The issue, however, is whether the Defendant, in the course of his various omissions, was aware or should have been aware of the Payments. On this point, the Plaintiff’s case is equivocal. While the Plaintiff argues that the Defendant “cannot feign ignorance over the unfair preference payments”,16Foot Note 16×Plaintiff’s written submissions at paragraph 44.it is unclear whether the Plaintiff’s position is that the Defendant had actual knowledge or that the Defendant should have known about the Payments. In any event, I find that the evidence does not support either formulation of the Plaintiff’s case. 29  I begin with the affidavit of Mr Aw Cheok Huat (“Mr Aw”) dated 5 July 2021 at paragraph 41, in reply to the Defendant’s denial of responsibility for the impugned transactions on the basis that it was the “other directors of [the Plaintiff] and the H&P German’s finance department” which allegedly authorised the Payments. Mr Aw’s affidavit highlights that the Defendant was aware that the Plaintiff had other creditors apart from HARPA and HPS, such as OIG, based on the signed audited financial statements of the Plaintiff as well as the Defendant’s answer to a question in the 15 June 2021 letter. 30 On the face of Mr Aw’s response, it is unclear how this meets the Defendant’s point that he was unaware of the Payments, and that the Payments were authorised by the other directors of the Plaintiff. The mere fact that the Defendant was aware that there were other creditors does not mean that the Defendant knew or should have known about the Payments. Looking at the signed audited financial statements, the statements do not go any further than to indicate that the Defendant would have been aware of the debt owing to OIG. In fact, on a holistic assessment of the 15 June 2021 letter, the Defendant’s answers to questions 22 to 36 (including question 26) areconsistentwith the Defendant’s contention that he did not know that the Payments had occurred. Without more, the documents are of little use in showing that the Defendant was aware of the Payments. Indeed, I also note that it was the Defendant’s position that he did not know about the Repayments from HPSH prior to the Payments (in reply to question 16 of the 15 June 2021 letter).17Foot Note 17×ACH’s affidavit dated 5 July 2021 at p 39. 31 Going further, examining the totality of the evidence adduced by the Plaintiff, I, once again, am unpersuaded that the Defendant knew or should have known about the Payments. 32 The Plaintiff, in their written submissions, canvassed the following evidence: first, the Defendant signed the HARPA agreement and the HPS agreement, as well as the audited financial statements from 2014 to 2017;18Foot Note 18×Plaintiff’s written submissions at paragraph 40(a).and second, the contents of the 11 September 2020 letter.19Foot Note 19×Plaintiff’s written submissions at paragraph 40(b).Based on the foregoing, the Plaintiff argues: (a) By the HARPA and HPS agreements, the Defendant would have known that Dr Harren is a director of HARPA and HPS,ie, that HARPA and HPS are associates of the Plaintiff.20Foot Note 20×Plaintiff’s written submissions at paragraph 40(d). (b) The audited financial statements would have indicated that the Plaintiff was insolvent or nearing insolvency in the month of December 2018 as well as that there was a further creditor,ie,OIG, apart from HARPA and HPS.21Foot Note 21×Plaintiff’s written submissions at paragraph 40(e).Concurrently, the audited financial statements did not reflect the Plaintiff’s debts owed to HPS and HARPA.22Foot Note 22×Plaintiff’s written submissions at paragraph 47. (c)  Based on the 11 September 2020 letter, the omission of the Plaintiff’s debts owed to HPS and HARPA was due to a decision by the former directors (including the Defendant) to conceal the true state of the Plaintiff’s indebtedness to HARPA and HSP.23Foot Note 23×Plaintiff’s written submissions at paragraph 48.In this connection, the Plaintiff argues that this is contrary to the responsibilities of the directors to prepare financial statements that are true and fair of the Plaintiff’s financial position.24Foot Note 24×Plaintiff’s written submissions at paragraph 49. 33 Once again, taking the Plaintiff’s case at its highest (without delving into the specifics of the evidence), the documents do not show that the Defendant knew or should have known about the Payments. At best, the documents demonstrate that had the Defendant known about payments being made to HARPA and HPS, the Defendant would have known that these were likely to be unfair preference payments. Fundamentally, these documents do not go towards the anterior factual question of whether the Defendant was aware that the payments were made to HARPA or HPS. Similarly, the Plaintiff does not demonstrate how these documents would have placed the Defendant in a position such that he should have been aware that payments were being made to HARPA or HPS. 34 I only wish to add one point in relation to the Defendant’s conduct vis-à-vis the financial statements. As explained by the former directors in the 11 September 2020 letter, arising from the arrangements within the group of companies, the amounts to be paid to HARPA and HPS were only finalised for settlement in 2018. Even though I found that the Payments to be unfair preference payments (which should not have been made), I did not accept the Plaintiff’s contention that there was something amiss in finalising the amounts due to HPS and HARPA only in 2018.25Foot Note 25×Plaintiff’s written submissions at paragraph 47.Without more, it did not seem to me that these debts were deliberately kept out of the audited financial statements prior to 2018. In any event,even ifit were the case that the amounts owing to HARPA and HPS should have been recorded on the financial statements (which I do not accept), it is unclear what is the causal link between the purposedly defective financial statements and the payment of the Principal Sums, let alone the Plaintiff’s claim for the Additional Damages. 35 Accordingly, I agree that the Defendant failed to determine whether it was permissible for the Plaintiff to make payment of the Principal Sums and for failing to ascertain whether the other directors were acting in breach of their various duties in their facilitating the payments of the Principal Sum. However, the evidencedoes notdemonstrate that the Defendant knew or should have known about the Payments. In fact, I should point out that prayer one of Plaintiff’s originating summons seems to tacitly accept that the other directors (and not the Defendant) were responsible for facilitating the payment of the Principal Sum. As such, I reject the Plaintiff’s contention that the Defendant was aware or should have been aware of the payments of the Principal Sum.",
        "Whether the Defendant was in breach of his duty to act bona fide in the best interests of the Plaintiff": "36 My finding at [35] forms the basis from which I determine whether the Defendant has breached any of his obligations as a director of the Plaintiff. At this juncture, I note that the Plaintiff has not expressly identified the particular obligation that the Defendant had purportedly breached in relation to his omissions. Apart from broad statements that the Defendant was in breach of his various duties, there is nothing to tie the Defendant’s conduct to the specific duties breached. Instead, the Plaintiff relies solely onLiving the Link Pte Ltd (in creditors’ voluntary liquidation) and others v Tan Lay Tin Tina and others[2016] 3 SLR 621 (“Living the Link”) in their written submissions.26Foot Note 26×Plaintiff’s written submissions at paragraph 54. 37 InLiving the Link, the liquidator sought to reverse certain transactions executed by the defendant (the director of the company in liquidation) on the basis that the transactions were unfair preference payments. The liquidator also concurrently brought a claim against the defendant for breach of her fiduciary duties in procuring undue preferences. The court agreed that the transactions constituted unfair preference payments, and that such a finding “ipso factoled to the conclusion that the conclusion that [the defendant] breached her fiduciary duty to ensure that the company’s assets were not misapplied to the prejudice of creditors’ interests” (see [78]).  The court also observed that, “[t]he fact that the purpose of this duty mirrors that of the statutory avoidance provisions makes this inference practically inevitable in every case although I accept thatthere may be exceptional circumstances where a director may be found to have acted bona fide in the best interests of the company even though he or she might have procured an undue preference ...” [emphasis added] (see [78]). Consequentially, the court ordered that the defendant be required to restore the company to the position it would otherwise have been,ie, to repay the sum of the total value of the undue preference (see [87] and [90]). 38 The Plaintiff, in relying onLiving the Link, seems to suggest that the Defendant breached his duty to actbona fidein the best interests of the company, as he did not ensure that its assets were not misapplied to the prejudice of some creditors. However,Living the Linkis readily distinguishable. InLivingthe Link, there was no dispute as to the defendant’s involvement in executing the transactions in question (at [11]), and the liquidator’s claim against the defendant was for her procurement of the transactions (at [5]). In contrast, the Defendant’s offending act consists of the failure to prevent certain payments (which he was not aware of). In other words, the nature of the offending conduct giving rise to the purported breach of obligation greatly differs. Without more, the Plaintiff cannot baldly rely onLiving the Linkfor the submission that the Defendant has breached his duty to actbona fidein the best interests of the company by failing to perform the requisite checks. This is especially so considering the absence of evidence to suggest that the Defendant knew or should have known about the Payments. 39 In the course of oral submissions, the Plaintiff argues in the alternative thateven ifthe Defendant did not know about the Payments, this was insufficient to excuse the Defendant from any liability. In this connection, the Plaintiff relies onHo Pak Kim Realty Co Pte Ltd (in liquidation) v Ho Soo Fong and another[2020] SGHC 193 (“Ho Pak Kim”) at [100], where the court held that the second defendant was not absolved of liability on the basis that he was a “sleeping” or “nominee” director. 40 InHo Pak Kim, the liquidators of the company commenced a suit against the defendants (who were the ex-directors of the company) for failing to recover a sum of moneys from related parties. The second defendant therein argued that he was a “sleeping” director (at [19]). Flowing from this, the second defendant averred that he was unaware of his obligations to the company and left the management of the company fully to the first defendant (at [17] to [20]). The court rejected the second defendant’s argument based on his extensive involvement in the running of the company (at [86], [88] and [100]). In particular, the second defendant had signed a financial statement which would have informed him that there were moneys owing from related parties and was also a shareholder and director of the related parties (at [88] and [89]). In these circumstances, the court found at [89] that the second defendant “knew that the Related Parties were HTS and IH and he was equally privy to the decision to collect the $3.59m Sum from them to the prejudice of [the plaintiff company] and its creditor, Revitech” and was thus in breach of his duty to actbona fidein the best interests of the company. 41 In my view,Ho Pak Kimis of limited assistance to the Plaintiff. There, the court made afactualfinding that the defendant was not a mere “sleeping” or “nominee” director, and was, on the contrary, aware of the moneys owing from the related parties that were not collected. Thus, the defendant was held to be in breach of his duty to actbonafidein the best interests of the company. In contrast, the Plaintiff has not shown that the Defendant was aware (or placed in a position such that he should have been) of the payments of the Principal Sum. 42 As such, I am not satisfied that the Plaintiff has demonstrated that the Defendant breached his fiduciary duty to actbona fidein the best interests of the Plaintiff and its creditors, by failing to determine whether it was permissible for the Plaintiff or the other directors to have facilitated or made payments of the Principal Sum. At the nub of the matter, the Plaintiff has not shown that the Defendant was aware or should have been aware of the Payments. In such circumstances, the Defendant’s failures cannot be described as unreasonable or dishonest.",
        "Whether the Defendant was in breach of his duty to exercise skill, care and diligence": "43 The Plaintiff’s submissions on the Defendant’s duty to exercise skill, care and diligence is primarily based inHo Pak Kim, which was raised in the course of oral submissions. 44 InHo Pak Kim, the court found thateven ifthe second defendant was a “sleeping” director,ie, that the second defendant was unaware of his obligations and the ongoings of the company, the second defendant was still in breach of his duty to exercise skill, care and diligence (at [100]). The second defendant was “not a greenhorn to business or to [the plaintiff company]” (at [97]). In particular, the court observed that it would “not have gone unnoticed” to the second defendant, had he taken some steps to monitor the company’s management, that the company’s main asset was the moneys owed from the related parties which remained uncollected (at [97]). This was further in the context that the second defendant should have known that the company, by way of various court decisions, owed money to creditors (at [97]). 45 Beyond a bare reliance onHo Pak Kim, again, the Plaintiff does not provide any particularisation of the manner in which the Defendant’s omissions were in breach of his duty to exercise skill, care and diligence. The Plaintiff also does not make clear what the Defendant’s experience and background was, and what was expected of the Defendant in the circumstances. For instance, was the Defendant required to review all telegraphic transfers by the Plaintiff in the period on the basis that the Plaintiff was nearing insolvency and/or insolvent? Did the other directors’ actions in financial and operational matters give rise to any concerns such that Defendant should have been more closely monitoring the company’s management? In this respect, the Plaintiff does not provide any evidence or make any arguments. 46 In assessing whether it was reasonable that the Defendant was unaware of the payments of the Principal Sum, I further note that the Defendant is the sole local director of the Plaintiff. On the Defendant’s account, the other two directors were the material directors who had full management and conduct of the Plaintiff’s business operations and financial matters.27Foot Note 27×WSB’s affidavit dated 20 September 2021 at paragraphs 6–7.As such, the Defendant’s primary responsibilities were limited to that of doing the necessary paperwork with auditors, relevant agencies, and dealing with regulatory authorities in Singapore.28Foot Note 28×Defendant’s written submissions at paragraph 6.This is not disputed by the Plaintiff. While this does not absolve the Defendant of his duties, it impacts the extent to which the Defendant is expected to be informed of the Plaintiff’s affairs. This was also recognised inPrimaBulkship Pte Ltd (in creditor’s voluntary liquidation) and another v Lim Say Wan and another[2017] 3 SLR 839 at [49] where the court recognised that the fact that the defendants were appointed to fulfil the statutory requirement of a local resident director impacted the extent to which the defendants were expected to be informed of the company’s affairs. 47 As such, I do not find that the Defendant failed to exercise due care, skill and diligence. Materially, it is unclear what was expected from the Defendant, and what was the basis for such an expectation, especially having regard to the Defendant’s seemingly limited role in the Plaintiff.",
        "Conclusion": "49 Before I conclude, I note that the Defendant had applied for the originating summons to be converted to a writ by way of HC/SUM 3987/2021, so that the substantial disputes in relation to the Payments, as well as his conduct may be tested at a trial. In fact, the Defendant wanted Mr Harren and Dr Harren to be called as witnesses at the trial – to ascertain their intentions in making the Payments (which would, in turn, throw light on the Defendant’s conduct at the material time). However, the Plaintiff objected to the application, and the application was not allowed. Further, the Plaintiff did not apply for cross-examination of the Defendant. 50 Given the Plaintiff’s stance, I do not have the benefit of having the Defendant’s evidence tested in cross-examination, or having full evidence from the other relevant witnesses, in order to determine the Defendant’s knowledge and state of mind which form the nub of the case (as indicated at [14]). Instead, I am left to assess the case based on the affidavits and documentary evidence. For reasons I have stated above, in light of the Defendant’s consistent explanations, I find that the Plaintiff has failed to prove the Defendant’s breach of fiduciary and/or statutory duty. Accordingly, I dismiss the Plaintiff’s prayers for damages against the Defendant. 51 Parties may provide cost submissions within two weeks of this judgment. Hoo Sheau PengJudge of the High Court Ponnampalam Sivakumar and Phang Shi Ting (BR Law Corporation) for the plaintiff;Lai Kwok Seng (Lai Mun Onn & Co) for the defendant.",
        "": ""
    }
}