{
    "case_title": "EFA RET Management Pte Ltd (as Trustee of EFA Real Economy Income Trust) vDinesh Pandey and another matter",
    "ncitation": "[2022] SGHCR 3",
    "coram": "General Division of the High Court — Bankruptcy No 1010 of 2021 and Originating Summons (Bankruptcy) No 109 of 2021AR Randeep Singh Koonar15 February 2022",
    "sections": {
        "Introduction": "1  Originating Summons (Bankruptcy) No 109 of 2021 (“OSB 109”) was the debtor’s application to set aside a statutory demand issued by the creditor, which gave rise to the proceedings in Bankruptcy No 1010 of 2021 (“B 1010”). The application was based on a purported dispute over the debt claimed in the statutory demand. 2 I dismissed OSB 109 on 15 February 2022, finding that the debtor had not established genuine triable issues in respect of the purported disputes over the debt. 3 Since it was undisputed that the conditions for making a bankruptcy order in B 1010 were otherwise met and because I disallowed the debtor’s request for an adjournment to raise funds to repay the debt, I further made a bankruptcy order against the debtor. 4 The debtor has appealed against my decisions in OSB 109 and B 1010. I now set out the grounds of my decision in full, expanding on the oral judgment I delivered on 15 February 2022.",
        "Facts": "",
        "Parties": "5 The creditor, EFA RET Management Pte Ltd (as Trustee of EFA Real Economy Income Trust) (“EFA”) is the plaintiff in B 1010 and the defendant in OSB 109. 6 The debtor, Dinesh Pandey (“Mr Pandey”) is the defendant in B 1010 and the plaintiff in OSB 109.",
        "Parties enter the Original Facility Agreement": "7 Pursuant to a written facility agreement dated 18 March 2019 (“the Original Facility Agreement”), EFA agreed to lend US$20m (“the Loan Sum”) to Anant International (HK) Limited (“Anant”), Som International (HK) Limited, Som Shipping & Trading Limited, Crystal Shipping Limited and Vector Shipping Limited (“the Borrowers”). The loan was intended for the Borrowers to finance the purchase of vessels to on-sell for scrap and/or recycling. 8 Mr Pandey and Somap International Pte Ltd (“Somap”) were the guarantors (“the Guarantors”) under the Original Facility Agreement. Mr Pandey did not dispute EFA’s evidence that he was the sole director and ultimate beneficial owner of all the Borrowers and the sole director and shareholder of Somap. Mr Pandey also executed the Original Facility Agreement on behalf of each of the Borrowers and Somap, in addition to him signing in his personal capacity as a guarantor. 9 On 6 May 2019, EFA disbursed the Loan Sum into an account held in Anant’s name with DBS Bank Ltd in Singapore. This was a “Funding Account” which Anant was obliged to hold under the terms of the Original Facility Agreement to receive the Loan Sum. All drawdowns from the Funding Account required EFA and Anant’s joint signatures and would be deposited into the relevant “Vessel Owner Transaction Accounts”. These accounts were used by the Borrowers to make payments for the purchase of vessels.",
        "The Borrowers and Guarantors default on the Original Facility Agreement": "10 It was not disputed that the Borrowers and the Guarantors defaulted on repayments under the Original Facility Agreement. 11 On 3 March 2020, EFA wrote to the Borrowers and the Guarantors. EFA noted the default and required that it be rectified within three business days, failing which EFA reserved its right to accelerate repayment of all amounts due under the Original Facility Agreement. 12 On 18 March 2020, EFA issued a letter of demand to the Borrowers and Guarantors. As the Borrowers and Guarantors had failed to rectify their default, EFA demanded immediate repayment of all sums then due under the Original Facility Agreement, which was US$20,453,496.86.",
        "EFA issues the 10 April 2020 Statutory Demand": "13 When the Borrowers and Guarantors failed to satisfy EFA’s demand, EFA issued a statutory demand to Mr Pandey on 10 April 2020 (“the 10 April 2020 Statutory Demand”), demanding repayment of all sums then due under the Original Facility Agreement, which was US$20,560,692.99. 14 On 27 April 2020, Mr Pandey filed Originating Summons (Bankruptcy) No 48 of 2020 (“OSB 48”), to apply for an extension of time to apply to set aside the 10 April 2020 Statutory Demand. Mr Pandey’s solicitors in the present proceedings, Haridass Ho & Partners (“HHP”), also acted for Mr Pandey in OSB 48. The application was made on the ground that Mr Pandey was unable to give HHP complete instructions on his defence due to circuit breaker and other lockdown measures imposed in Singapore and India as a result of the COVID-19 pandemic.",
        "Parties enter the Amended Facility Agreement": "15 While OSB 48 was pending, EFA and Mr Pandey engaged in negotiations to restructure the debt. This culminated in EFA, the Borrowers and the Guarantors entering the First Amended Agreement dated 12 June 2020 to the Original Facility Agreement (“the Amended Facility Agreement”). The salient features of the Amended Facility Agreement were as follows: (a) While the contracting parties remained the same as under the Original Facility Agreement, Mr Pandey and Somap’s became “Additional Debtors” under the Amended Facility Agreement, as opposed to “Guarantors” under the Original Facility Agreement. (b) The Borrowers and Additional Debtors (collectively, “the Obligors”) admitted to the occurrence and continuance of events of default under the Original Facility Agreement. (c) The Obligors agreed to be jointly and severally liable to repay the Loan Sum and interest, in accordance with the Repayment Schedule of the Amended Facility Agreement. Briefly, the Repayment Schedule allowed for the Loan Sum and interest to be paid in instalments between 5 May 2020 and 5 February 2021. 16 OSB 48 was thereafter withdrawn by consent on 22 July 2020.",
        "The Obligors default on the Amended Facility Agreement": "17 Between 5 September and 15 October 2020, the Obligors failed to make full payment of the sums due under the Amended Facility Agreement, only paying U$172,000 out of a total US$2,048,596.72. 18 On 15 October 2020, EFA’s solicitors wrote to Mr Pandey to note that the Obligors were in default of the Amended Facility Agreement. EFA’s solicitors gave notice that if the default was not rectified by 19 October 2020, the entire loan in the sum of US$19,818,803.78 would be accelerated and payable in full by 20 October 2020.",
        "EFA issues the 21 October 2020 Statutory Demand": "19 As payments were not forthcoming from the Obligors, EFA’s solicitors issued a statutory demand dated 21 October 2020 (“the 21 October 2020 Statutory Demand”) to Mr Pandey, demanding payment of all sums then due under the Amended Facility Agreement, which was US$19,666,979.03. 20 After the 21 October 2020 Statutory Demand was issued, there were discussions between Mr Pandey and EFA’s representative, Mr Xavier de Nazelle (“Mr de Nazelle”). Following these discussions, EFA received two further payments of US$100,000 each on 2 and 11 November 2020. EFA did not receive any further payments thereafter.",
        "EFA commences the English proceedings": "21 On 18 December 2020, EFA made an ex parte application to the English High Court for a world-wide freezing injunction (“the WWFO”) against Mr Pandey and the other Obligors in relation to EFA’s claims under the Amended Facility Agreement. The WWFO was granted on 21 December 2020. On the same day, EFA commenced a civil action in the English High Court against the Obligors to recover the unpaid sums. 22 During this period, around 20 November 2020, Mr Pandey was remanded in prison in India, after his arrest for suspected fraud. Mr Pandey was only released on bail on 3 September 2021. However, EFA’s evidence (which Mr Pandey did not challenge) was that while Mr Pandey was in prison, he had arranged through an intermediary to speak to Mr de Nazelle over the phone. During the calls with Mr de Nazelle, Mr Pandey reiterated his commitment to paying EFA in full.",
        "EFA issues the 12 January 2021 Statutory Demand": "23  On 12 January 2021, EFA issued a further statutory demand (“the 12 January 2021 Statutory Demand”), demanding payment of all sums then due under the Amended Facility Agreement, which was US$20,414,208.61. The 12 January 2021 Statutory Demand was served on HHP on the same day, following HHP’s confirmation that they were authorised to accept service. 24 Mr Pandey did not comply with the 12 January 2021 Statutory Demand, in that he did not pay, secure or compound the debt claimed within 21 days from the date the demand was served.",
        "EFA commences B 1010 against Mr Pandey": "25 On 27 April 2021, EFA commenced B 1010 against Mr Pandey. As HHP did not accept service of the bankruptcy papers, EFA applied for and obtained leave, by way of Summons No 2262 of 2021, to effect substituted service of the bankruptcy papers on Mr Pandey out of jurisdiction (“the Service Out Order”). 26 After B 1010 was commenced, Mr Pandey filed several applications in relation to the bankruptcy proceedings. These may be summarised as follows: (a) On 28 April 2021, Mr Pandey filed Originating Summons (Bankruptcy) No 46 of 2021 (“OSB 46”). In OSB 46, Mr Pandey applied for an extension of time to file an application to set aside the 12 January 2021 Statutory Demand, until after his release from prison in India. On 10 September 2021, a consent order was entered in OSB 46. Mr Pandey was given until 11 October 2021 to file a setting aside application. (b) On 10 June 2021, Mr Pandey filed Summons No 2695 of 2021 (“SUM 2695”). In SUM 2695, Mr Pandey applied to set aside the Service Out Order, and the service of the bankruptcy papers effected pursuant to it. SUM 2695 was dismissed by an assistant registrar on 12 October 2021. Mr Pandey’s appeal against the assistant registrar’s decision was dismissed by a High Court judge on 18 January 2022. (c) On 11 October 2021, Mr Pandey filed Originating Summons (Bankruptcy) No 91 of 2021 (“OSB 91”). In OSB 91, Mr Pandey applied for a further extension of time to file an application to set aside the 12 January 2021 Statutory Demand. Although Mr Pandey had been released from custody in India by this time, a further extension sought on the basis that Mr Pandey was allegedly in a poor physical and psychological state and unable to instruct his solicitors. On 26 October 2021, Mr Pandey was granted an extension of time until 31 December 2021 to file the setting aside application. (d) OSB 109 was filed on 31 December 2021. It came up for hearing before me on 15 February 2022, together with B 1010. By that time, B 1010 had been adjourned three times pending the determination of the related applications.",
        "Mr Pandey’s application in OSB 109": "27 In OSB 109, Mr Pandey raised a litany of grounds to have the 12 January 2021 Statutory Demand set aside: (a)Ground 1: He had signed the Amended Facility Agreement under duress. (b)Ground 2: EFA breached their obligations as a mortgagee to obtain the best possible price for the sale of a vessel, to reduce the outstanding loan. (c)Ground 3: The default interest payable under the Amended Facility Agreement was a penalty. (d)Ground 4: EFA failed to disburse the Loan Sum in full, in breach of the Original Facility Agreement. This prevented the Borrowers from performing their obligations in respect of the purchase and sale of vessels and entitled them to damages against EFA. (e)Ground 5: The WWFO obtained by EFA was an abuse of the English Court’s process, and the Singapore Court should not assist in that abuse of process. (f)Ground 6: The commencement of B 1010 pursuant to the 12 January 2021 Statutory Demand resulted in parallel proceedings in Singapore and England between the same parties and in respect of the same claim under the Amended Facility Agreement. Based on the doctrine oflis alibi pendens, EFA was required to elect which set of proceedings to pursue. (g)Ground 7: The Amended Facility Agreement was void for a want of consideration. 28 At the hearing on 15 February 2022, Mr Pandey’ counsel, Mr Shaun Tien (“Mr Tien”), confirmed that Grounds 6 and 7 were being abandoned. 29 Based on the remaining grounds raised, it was evident that Mr Pandey’s challenge in OSB 109 was against the debt on which B 1010 was founded, both in terms of his liability on the debt and the extent (or quantum) of that liability. Therefore, if Mr Pandey failed to have the 12 January 2021 Statutory Demand set aside on these grounds, any challenge to the underlying debt in B 1010 would likewise fail. 30 Mr Pandey accepted this. Ms Sharmini Yogarajah (“Ms Yogarajah”), Mr Pandey’s other counsel, said that if I was minded to dismiss OSB 109, her instructions were to ask for a three-month adjournment for Mr Pandey to arrange for funds to repay EFA. Notably, Ms Yogarajah confirmed that there would be no substantive challenge to B 1010, save for the grounds raised in OSB 109.",
        "My Decision": "",
        "The relevant legal principles": "31 I begin by examining the legal principles which govern when a statutory demand should be set aside. 32 Rule 68(2) of the Personal Insolvency Rules 2020 (“the PIR”) sets out the circumstances in which the Courtmustset aside a statutory demand. The provisions relevant to OSB 109 read: Hearing of application to set aside statutory demand … (2) The Court must aside a statutory demand if — (a) the debtor in question appears to the Court to have a valid counterclaim, set-off or cross demandwhich is equivalent to or exceeds the amount of the debt or debts specified in the statutory demand; (b) the debt is disputed ongrounds which appear to be substantial; … (e) the Court is satisfied,on any other ground, that the demand ought to be set aside. [emphasis added] 33 Mr Pandey relied on r 68(2)(b) and (e) of the PIR in his application to set aside the 12 January 2021 Statutory Demand. It is well settled in this regard that: (a) Summary judgment principles apply in determining whether a statutory demand ought to be set aside on the ground that the debt is disputed:Mohd Zain Bin Abdullah v Chimbusco International Petroleum (Singapore) Pte Ltd and another appeal[2014] 2 SLR 446 (“Chimbusco CA”) at [16]–[18]. (b) The Court willnormallyset aside a statutory demand where there is a genuine triable issue. However, it does follow that the Court will always do so. The criterion of “grounds which appear to be substantial”, is a higher threshold than a genuine triable issue:Chimbusco CAat [28]–[29]. (c) The Court retains a residual discretion under r 68(2)(e) to set aside a statutory demand even if it is satisfied that there are no triable issues. This discretion is analogous to the Court’s power to deny summary judgment if it feels that there ought to be a trial for “some other reason”. However, while this power exists, the circumstances where it is exercised in insolvency proceedings will be rare:Chimbusco International Petroleum (Singapore) Pte Ltd v Jalalludin bin Abdullah and other matters[2013] 2 SLR 801 (“Chimbusco HC”) at [46]. 34 Keeping with the above, the key issue before me was whether Mr Pandey had demonstrated the existence of genuine triable issues in respect of the grounds mentioned at [27] above.",
        "The affidavits filed by HHP on Mr Pandey’s behalf in OSB 109": "35 Before turning to whether Mr Pandey had demonstrated grounds for setting aside the 12 January 2021 Statutory Demand, I deal with a preliminary issue. This concerns the fact that the deponent for all the affidavits filed on Mr Pandey’s behalf in OSB 109 was Ms Subashini d/o Narayanasamy (“Ms Subashini”), who was one of the counsel acting for Mr Pandey in OSB 109, together with Ms Yogarajah and Mr Tien. In fact, Ms Subashini was the deponent ofallthe affidavits filed on Mr Pandey’s behalf in B 1010 and its related matters (see [26] above). As for the supporting affidavit in OSB 48, Ms Yogarajah was the deponent. 36 This was a wholly unsatisfactory state of affairs. 37 First, Ms Subashini’s affidavits in OSB 109 spoke to variousfactualissues which she did not have personal knowledge of. As I pointed out during the hearing, the Court might draw inferences based on Ms Subashini’s lack of personal knowledge concerning the facts and place the appropriate weight on the evidence. 38 Second, a lawyer’s role is to present his or her client’s case in accordance with the lawyer’s duty to the client and subject to the lawyer’s overriding duty to the Court. It isnota lawyer’s role topersonally vouchfor the veracity of his or her client’s case, let alone, to do so under oath. Moreover, by filing affidavits deposing to the facts in issue, Ms Subashini placed herself in a position where she could have been a material witness of fact in the proceedings. 39 Third, the reasons proffered for why Ms Subashini had to depose the affidavits were unpersuasive. At the hearing, Mr Tien initially claimed that Mr Pandey had been incarcerated between November 2020 and September 2021 and was in hospital thereafter. When I pointed out that there was no medical evidence before the Court to show that Mr Pandey remained medically and/or mentally unfit to depose an affidavit when Ms Subashini’s affidavits were filed on 31 December 2021 and 25 January 2022, Mr Tien changed tack and claimed that Mr Pandey was travelling instead. 40 This was not a proper reason for Ms Subashini deposing affidavits on Mr Pandey’s behalf. Even if Mr Pandey was travelling, there was no apparent impediment to Mr Pandey filing an unaffirmed affidavit under cover of a solicitor’s affidavit with an undertaking to file the affirmed affidavit within a reasonable time. However, this was not done for reasons only known to Mr Pandey and his solicitors.",
        "Mr Pandey failed to raise genuine triable issues in respect of the debt claimed under the 12 January 2021 Statutory Demand": "41 I turn to consider the purported triable issues raised by Mr Pandey in OSB 109. The Amended Facility Agreement was not signed under duress 42 The first purported triable issue raised by Mr Pandey was that he had signed the Amended Facility Agreement under duress and it was therefore voidable. 43 A defence of duress requires proof of two elements: (a) there must be pressure amounting to compulsion of the victim’s will; and (b) the pressure exerted must be illegitimate:E C Investment Holding Pte Ltd v Ridout Residence Pte Ltd and another (Orion Oil Ltd and another, interveners)[2011] 2 SLR 232 at [51]. 44 As regards the first element, Mr Pandey’s case was that EFA had pressured him to enter the Amended Facility Agreement. Mr Pandey claimed EFA had exerted such pressure by issuing the 10 April 2020 Statutory Demand, which EFA said it would withdraw if Mr Pandey signed the Amended Facility Agreement. Mr Pandey claimed to have been placed in a position where he was compelled to accede to EFA’s demand that he sign the Amended Facility Agreement to stave off the draconian consequences of bankruptcy proceedings. 45 As regards the second element, Mr Pandey’s case was that a threat of lawful action could amount to illegitimate pressure where the threat is not made bona fide and/or where the demand is unreasonable: seeTamTak Chuen v Khairul bin Abdul Rahman and others[2009] 2 SLR(R) 240 at [50]. In this regard, Mr Pandey’s case was that EFA’s demand was not made bona fide and was unreasonable because it was intended to pressure him into altering his capacity from a Guarantor to an Obligor and to capitalise on the fact that HHP was unable to take complete instructions from him at the time. 46 In my judgment, Mr Pandey had failed to demonstrate the existence of genuine triable issues in respect of his allegation of duress. 47 First, I noted that Mr Pandey did not even file an affidavit in OSB 109 or B 1010 to substantiate his allegations of duress. Apart from the sweeping and unsubstantiated statements made in Ms Subashini’s affidavits filed on 31 December 2021 and 25 January 2022, there wasno evidencefrom Mr Pandey himself on the circumstances in which he entered the Amended Facility Agreement, the nature of the pressure he was allegedly subjected to, or how the alleged pressure had resulted in his will being overborne. 48  Second, I found the allegation that Mr Pandey’s will was overborne when entering the Amended Facility Agreement to be inherently incredible. 49 To begin with, the Amended Facility Agreement did not entail asubstantive changeto Mr Pandey’s liability to repay the Loan Sum. At the hearing, Mr Tien made much of the fact that Mr Pandey’s capacity as “Guarantor” under the Original Facility Agreement was changed to an “Additional Debtor” under the Amendment Facility Agreement. However, when pressed on how this constituted a change in thesubstanceand not just the form of Mr Pandey’s obligations, Mr Tien conceded that the terms of the Amended Facility Agreement were not more onerous on Mr Pandey. In fact, Mr Tien accepted that the terms of the Amended Facility Agreement could be said to befavourableto Mr Pandey, as it gave him and the other Obligors more time to repay the Loan Sum, which had been accelerated and was payable in full under the Original Facility Agreement. 50 Moreover, Mr Pandey was a highly experienced businessman with lawyers (i.e., HHP) acting for him at the time he entered the Amended Facility Agreement. Mr Tien submitted that although HHP was acting for Mr Pandey in OSB 48, HHP did not advise Mr Pandey on the Amended Facility Agreement. Even if that were so, Mr Pandey could still have sought legal advice if he felt he was being pressured into signing the Amended Facility Agreement. Moreover, Mr Tien was evasive on whether Mr Pandey obtained legal advice, even if not from HHP. When I asked Mr Tien whether Mr Pandey had in fact received legal advice, Mr Tien’s answer was “not by our firm”. Mr Tien also confirmed that there was no evidence as to whether Mr Pandey received such legal advice, although Mr Pandey could easily have clarified the same. The absence of such evidence did not assist Mr Pandey’s case. 51 Finally, I agreed with the submission made by counsel for EFA, Ms Ramandeep Kaur (“Ms Kaur”), that if there was any substance to Mr Pandey’s allegation of duress, it would have been raised earlier. Tellingly, not only was this allegation belatedly raised on 31 December 2021 (in Ms Subashini’s affidavit filed in OSB 109), EFA’s unchallenged evidence was that Mr Pandey had re-affirmed his commitment to repaying the debt during the intervening period. 52 In the circumstances, Mr Pandey’s claim that he signed the Amended Facility Agreement under duress was quite plainly a contrived afterthought. 53 Third, even if EFA had exerted “pressure” on Mr Pandey to enter the Amended Facility Agreement, this was not illegitimate pressure. Mr Tien did not suggest that the pressure exerted on Mr Pandey was unlawful. Indeed he could not have credibly done so. Any pressure exerted on Mr Pandey by EFA was no different from that faced by every debtor seeking to negotiate a settlement with his or her creditors to avoid bankruptcy proceedings. While Mr Tien submitted that EFA’s demand was unreasonable because it altered Mr Pandey’s capacity from Guarantor to an Additional Debtor, this cut no ice for the reasons given at [49] above. Mr Tien further submitted that EFA had “capitalised” on the fact that HHP was unable to take complete instructions from Mr Pandey at the time. There was no evidence to support this submission. To start, the submission rested on a bald assertion made by Ms Subashini in her affidavit filed on 25 January 2022 and was wholly unsubstantiated. Moreover, as discussed at [50] above, there is considerable doubt as to whether Mr Pandey had obtained legal advice on the Amended Facility Agreement; and even if he did not, he plainly could have done so. It is baseless for Mr Pandey to suggest that EFA had somehow taken advantage of the situation. Mr Pandey’s allegation of an undervalue sale of a vessel was irrelevant and unsubstantiated 54 The second purported triable issue raised by Mr Pandey was that EFA had failed in its obligations as a mortgagee to obtain the best possible price for the sale of the vessel. 55 The vessel in question was sold by EFA in May 2021 for US$3,763,803.75. In doing so, EFA had exercised its rights under a mortgage dated 25 November 2019 (“the Mortgage”) which was registered in Palau, where the vessel was flagged. The Mortgage was governed by Palau law. 56 Mr Pandey’s case was that EFA effected the sale at an undervalue. To support this contention, Mr Tien referred to market reports for the week of 30 April 2021 which showed that the market price for recycling vessels for demolition was about US$520 to US$550 per light displacement tonne, translating to a market price of approximately between US$6.3m and US$6.5m for the vessel at the time of the sale. Mr Tien thus contended that the sale was at a significant undervalue. 57 Mr Tien further submitted that under Palau law, EFA was under a duty to use reasonable care in the custody and preservation of the vessel while the vessel was in its possession. Mr Tien submitted that this was an obligation which EFA could not contract out of under Palau law; and therefore, it did not matter that Clause 7.2.3 of the Mortgage expressly provided that EFA was entitled to “sell the Ship…upon such terms…as [EFA], in its absolute discretion, may determine…without being answerable for any loss occasioned by such sale”. 58 In my judgment, Mr Pandey had failed to demonstrate the existence of genuine triable issues in relation to the alleged undervalue sale of the vessel. 59  To begin with, given the alleged undervalue sale took place close tofive monthsafterthe 12 January 2021 Statutory Demand was issued, it was difficult to see how the sale was even relevant to the validity of the debt claimed in the statutory demand. 60 And even if the alleged undervalue sale was relevant to the existence of the debt, for the purposes of the bankruptcy application, the allegation was wholly unsubstantiated. 61 As a matter of law, Mr Tien relied on Palau law to contend that EFA had breached their obligations as a mortgagee in conducting the sale. The fatal flaw in this submission was that no admissible evidence of Palau law was adduced. Keeping with the theme of Ms Subashini filing affidavits on substantive matters in the proceedings, the only evidence of Palau law came from Ms Subashini. However, Ms Subashini was quite clearly not an expert on Palau law and not competent to give such evidence. 62 The veracity of Ms Subashini’s attempt at giving expert evidence was also highly questionable on its face. The provision of Palau law cited provided that: Both the debtor and creditor have an obligation to exercise their rights in the propertyin good faithandwith regard for the rights of others. Each must use reasonable care in the custody and preservation of the property while in his possession. [emphasis added] 63 It was unclear how this translated to a duty on EFA’s part to “obtain thebest price possiblefor the vessel [emphasis added]” which Ms Subashini claimed existed under Palau law. 64 At the hearing, Mr Tien conceded that Palau law had to be proven as a fact and by expert evidence. However, Mr Tien claimed that he was simply referring to the relevant Palau legislation and he was not making submissions on the effect of Palau law. I disagreed. Quite plainly, Palau law was not being raised for purely for the Court’s information. On the contrary, Mr Tien was relying on Palau law to assert the existence of a duty on EFA’s part, a breach of that duty and that EFA could not contract out of liability for breach. 65 As a matter of fact, there was also no credible evidence supporting EFA’s allegation of an undervalue sale. In particular, no valuation of the vessel was conducted. Once again, in lieu of expert evidence, Mr Pandey’s case was based principally on Ms Subashini’s opinion of the value of the vessel. 66 In expressing this opinion, Ms Subashini relied on market reports reflecting transacted prices of vessels sold during that period. These transacted prices, however, were mere estimates and the actual sale price would have depended on various factors. In this regard, Mr de Nazelle gave unchallenged evidence that the vessel was contaminated with toxic material and costs had to be incurred in cleaning the vessel. Mr de Nazelle also gave unchallenged evidence that an associate of Mr Pandey’s, Mr Ajay, had earlier offered to arrange for the sale of the vessel for $1.5m. While Mr Pandey’s position was that Mr Ajay was not his agent, he did not disclaim knowledge of Mr Ajay’s offer or provide any explanation as to the circumstances in which it was made. There was no factual basis to Mr Pandey’s allegation of an undervalue sale. The default interest payable under the Facility Agreements was not a penalty 67 The third purported triable issue raised by Mr Pandey was that the default interest payable pursuant to the Original Facility Agreement and the Amended Facility Agreement was a penalty. 68 The law on the enforceability of default interest clauses is settled. InHong Leong Finance Ltd v Tan Gin Huay and another[1999] 1 SLR(R) 755 (“Hong Leong Finance”) at [26], the Court of Appeal stated the position as follows: On the authorities which we have considered, a provision in a contract stipulating an increased rate of interest applicable from the date of default is, depending on the circumstances, enforceable and will not be struck down as a penalty, provided that the increase (or difference) is not “extravagant and unconscionable in amount in comparison with the greatest loss that could conceivably be proved to have followed from the breach” (per Lord Dunedin inDunlop Pneumatic Tyre([18] supra) at 87). It is otherwise, if the increased rate is “exceptionally large”. 69 It should be noted that: (a) a contractual clause providing for additional interest (or default interest) to be payable upon breach is enforceable unless it is shown to be a penalty; (b) to determine whether default interest is a penalty, the Court will consider whether theincrease in the interest payableis extravagant and unconscionable in comparison with the greatest loss that could conceivably be suffered upon breach; and (c) the Court will consider whether theincreased rateis exceptionally large. 70 In my judgment, Mr Pandey had failed to demonstrate the existence of genuine triable issues in respect of his allegation that the default interest was a penalty. 71 In the present case, Clause 8.1 of the Original Facility Agreement provided for basic interest of 13.5% per annum. Clause 8.3, in turn, provided for default interest at a rate which was 3% higher than the basic interest rate (i.e., 16.5%). 72 Mr Tien submitted that the default interest payable was a penalty. This was misconceived. Mr Tien was clutching at straws in relying on the total interest payable to obfuscate the fact that theadditionalinterestpayable upon breach was only 3%. As the passage inHong Leong Finance(see [68] above) shows, the Court’s focus when determining whether a default interest clause is a penalty is on theincreasein the interest payable. 73 I simply could not see how a 3% increase in the interest payable upon default could be regarded as “extravagant” or “unconscionable”, either in and of itself, and especially given parties had contractually agreed that 12% interest would be payable on the loan. Mr Tien did not suggest that the basic interest component was a penalty or seek to impugn it in any way. 74 Mr Tien submitted that the 3% increase was “extravagant” because the basic interest of 12% was already “quite high”. This was an unmeritorious submission since it would have effectively precluded EFA from imposing any further interest although the risk to EFA (and therefore the costs of funds) would be considerably higher upon default. Moreover, when I invited Mr Tien to explain what a reasonable increase in the interest payable upon default would be, his reply was “I cannot answer that question”. 75 Mr Tien further relied on the facts inHong Leong Financeto make good his submission that the default interest payable in the present case was a penalty. In particular, Mr Tien relied on the fact that the Court inHong Leong Financehad found a default interest rate of 18% per annum to be a penalty. Mr Tien contended that the default interest rate of 16.5% per annum in the present case should similarly be considered a penalty. 76 With respect, this submission misrepresents what the Court inHong Leong Financehad decided. In that case, the Court found (at [27]) that the default interest rate was “an extravagant increase from the rate of 5.5% for the first two years of the term loan and 6.75% thereafter”. Put differently, it was the 11.25 to 12.5% increase in the interest payable upon default which the Court found to be objectionable, and not the total interest payable in itself. 77 In the circumstances, there was no merit in Mr Pandey’s allegation that the default interest payable under the Original Facility Agreement and the Amended Facility Agreement was a penalty. EFA did not breach the Original Facility Agreement 78 The fourth purported triable issue raised by Mr Pandey was that EFA breached the Original Facility Agreement by failing to allow for the release of the full Loan Sum of US$20m, which resulted in the Borrowers being unable to perform their onward obligations in the buying and selling of vessels. This was said to give rise to a claim on the Borrowers’ part for damages against EFA. 79 Mr Pandey’s case was that although the Loan Sum was US$20m, EFA only disbursed US$18,616,268.44 to the Borrowers. It is pertinent to explain here that the US$20m was in fact disbursed by EFA into the Funding Account. Mr Pandey’s complaint was that EFA did not permit the balance funds to be released from the Funding Account to the Vessel Owner Transaction Accounts. 80 In my judgment, Mr Pandey had failed to demonstrate the existence of a genuine triable issue in respect of his allegation that EFA had breached the Amended Facility Agreement. 81 First, Mr Pandey’s allegations were bereft of any particulars, let alone supported by evidence. No particulars were given as to the opportunities the Borrowers had allegedly lost or the damages they suffered. Mr Pandey’s failure to particularise his allegation was glaring since EFA had refused the requested drawdown sometime in January 2020, more than two years before OSB 109 was heard. 82   Second, apart Mr Pandey having a potential (but unquantified) counterclaim, the withheld amount was irrelevant to the issues in OSB 109 as the debt claimed under the 12 January 2021 Statutory Demand did not include the withheld amount nor was the withheld amount part of the debt on which B 1010 was founded. 83 At the hearing, Mr Tien further submitted that EFA had overcharged interest by charging interest based on the Loan Sum of US$20m. This submission was unmeritorious. As Ms Kaur pointed out, under Clauses 8.1 and 8.2 of the Original Facility Agreement, interest was payable on the “Total Commitments”, which was defined in Clause 1 to mean the sum of US$20m. This made commercial sense since EFA had parted with the funds once they were transferred to the Funding Account, even if the Borrowers had not utilised the funds. Mr Tien’s answers were unsatisfactory when questioned on this aspect of his case. When asked whether the funds were in the Funding Account, Mr Tien said he did not have an answer. While Mr Tien maintained that interest should not be charged on amounts which were not disbursed to the Borrowers (presumably out of the Funding Account) he was unable to identify any contractual clauses supporting this. 84 Moreover, the Repayment Schedule under the Amended Facility Agreement cohered with EFA’s position that once the withheld amount was returned to EFA from the Funding Account, this had the effect of reducing the principal and interest payable by Mr Pandey. There was no merit in the allegation of an overcharging of interest. 85 Third, I agreed with EFA’s submission that it had acted in accordance with the Original Facility Agreement in withholding the balance sum. Ms Kaur submitted that EFA had only refused one drawdown request and had done so because the Borrowers were already in default. Ms Kaur cited Clause 25.1.5(b)(i) of the Original Facility Agreement to show that EFA was entitled to refuse further drawdowns in such circumstances. Mr Kaur further took me through correspondence between EFA’s representatives and Mr Pandey, where EFA had explained the reasons for refusing the drawdown request to Mr Pandey. This correspondence showed that Mr Pandey did not challenge EFA’s entitlement to refuse the drawdown request at the time. Mr Pandey’s change in position in OSB 109 is a plain afterthought. Mr Pandey failed to establish any abuse of process 86 The fifth purported triable issue raised by Mr Pandey was that the WWFO was an abuse of process of the English Court and the Singapore Court should not assist in EFA’s abuse of process. 87 Mr Pandey’s case took two discernible forms: (a) In applying for the WWFO, EFA’s Singapore solicitors deposed an affidavit in the English proceedings on 18 December 2020 stating that although a statutory demand had been served on Mr Pandey, they had no instructions to commence bankruptcy proceedings against Mr Pandey. However, after the WWFO was granted on 21 December 2020, EFA issued a fresh statutory demand on 12 January 2021 and commenced B 1010 on 26 April 2021. Mr Pandey’s case was that this showed EFA was using the WWFO for the purposes of Singapore proceedings and not the English proceedings. (b) Mr Pandey’s further case was that by commencing bankruptcy proceedings in Singapore, EFA placed itself in a position where it would simply need to file a proof of debt in Mr Pandey’s bankruptcy without having to prosecute its claim in the English Courts. 88 In my judgment, Mr Pandey’s allegations of an abuse of process were confused and ultimately devoid of merit. 89 First, I simply could not see where the alleged abuse of process lay. In particular, it was entirely unclear whether Mr Pandey’s case was that the process of the English Court, the Singapore Court, or both was being abused. 90 Second, and insofar as Mr Pandey alleged that EFA had abused the English Court’s process in obtaining the WWFO, Mr Pandey’s obvious  recourse was to apply to the English Court to have the WWFO set aside. There was no evidence before me as to whether this was even done. 91   Third, it was unclear what EFA’s alleged collateral purpose in obtaining the WWFO was. Unsurprisingly, Mr Tien struggled to articulate this in oral argument. From what I could surmise, Mr Tien’s submission was that the WWFO was taken out to strongarm Mr Pandey in respect of the Singapore bankruptcy proceedings by making it difficult for him to repay his debts. This was untenable. 92 Not only was this submission was based on pure speculation, but it also seemed illogical. Presumably, EFA’s aim would have been to recover the debt owed to it. It would therefore have made little sense for EFA to take calculated steps aimed at stifling Mr Pandey’s ability to repay that very debt. I could not see anything sinister in EFA’s actions. 93 Fourth, and as regards the second principal form of the alleged abuse of process, this had little to do with EFA allegedly using the WWFO obtained in the English proceedings for a collateral purpose in the Singapore proceedings. Instead, it seemed that Mr Tien was attempting to resurrect his argument that there were parallel proceedings in England and Singapore and this was objectionable based on the doctrine oflis alibi pendens. As I mentioned at [28] above, this was a ground which Mr Tien had expressly abandoned. In fairness to Mr Tien, when I pointed this out in oral argument, he did not pursue the point further. Mr Pandey’s challenges to the quantum of the debt claimed under the 12 January 2021 did not warrant it being set aside 94 It will be evident by now that several of Mr Pandey’s purported grounds for setting aside the 12 January 2021 Statutory Demand (i.e., Grounds 2 to 4) only went towards the extent of Mr Pandey’s liability, or the quantum of the debt. 95 In oral argument, Mr Tien submitted that if there were genuine disputes over the quantum of the debt, the entire statutory demand could not stand. This issue was ultimately academic given my finding that there were no genuine triable issues on any of the grounds advanced. For completeness, however, I shall explain why I did not consider the disputes relating purely to the quantum of the debt to warrant the 12 January 2021 Statutory Demand being set aside, or B 1010 being dismissed, even if they were substantiated. 96 First, I had regard to r 68(2)(b) of the PIR which requires proof that “the debt is disputed on grounds which appear to the Court to be substantial”. The use of the word “substantial” is significant because it shows that not every dispute regarding a debt warrants setting aside. In the context of the present case, even if the quantum of the debt was reduced based on the purported disputes raised under Grounds 2 to 4, the debt left standing was still extremely large and considerably above the threshold for commencing bankruptcy proceedings. 97 Second, as discussed at [33] above, there are parallels between the tests applied when granting summary judgment and for setting aside a statutory demand. This is because both procedures share the common aim of avoiding a costly full trial on issues which are plainly appropriate for summary determination. To this end, it is trite that summary judgment may be entered onpartof a claim where there are no triable issues: Cavinder Bull SC (gen ed),Singapore Civil Procedure Volume I(Sweet & Maxwell, 2021) at 14/1/11. By analogy, I did not see why a plaintiff in bankruptcy proceedings should be prevented from obtaining a bankruptcy order if his entitlement to the order is clear based on the quantum of the debt which is not impugned. In practical terms, there is also no impediment against the plaintiff issuing a fresh statutory demand based on the undisputed debt and instituting bankruptcy proceedings again. It is unclear why the Court should insist on a potential wasteful course of the action where the plaintiff’s entitlement to a bankruptcy order is clear based on the undisputed debt. 98 Third, I agreed with Ms Kaur’s submission that there was independent evidence of Mr Pandey’s inability to pay his debts, without recourse being made to the presumption of insolvency under s 312 of the Insolvency, Restructuring and Dissolution Act 2018 (“IRDA”). Hence, the issue was not simply whether the 12 January 2021 Statutory Demand should be set aside, but rather, whether Mr Pandey was indebted to EFA in an amount which allowed EFA to file a bankruptcy application against Mr Pandey under s 311 of the IRDA. There was no doubt that the monetary threshold under s 311 of the IRDA was crossed even if Mr Pandey had made good his allegations on Grounds 2 to 4.",
        "Mr Pandey failed to establish that there were other grounds for setting aside the 12 January 2021 Statutory Demand": "99 In OSB 109, Mr Pandey also relied on r 68(2)(e) of the PIR to support his setting aside application. As the High Court held inChimbusco HCat [46], this is a residual ground for setting aside a statutory demand even if there are no triable issues and the power is analogous to the Court’s power to deny summary judgment if the Court feels that there ought to be a trial for “some other reason”. However, the High Court also cautioned that while this power exists, the circumstances where it is exercised in insolvency proceedings will be rare. 100 In my judgment, the circumstances did not merit the 12 January 2021 Statutory Demand being set aside under r 68(2)(e) of the PIR. Having found that Mr Pandey had failed to demonstrate the existence of genuine triable issues, exceptional grounds had to exist to show that there were nevertheless issues that should be tried. Quite plainly, no such grounds existed. On the contrary, I had no doubt that Mr Pandey was raising frivolous objections to stave off a bankruptcy order being made against him.",
        "There was no merit in Mr Pandey’s belated request for an adjournment to raise funds to repay the debt": "101 As I alluded to earlier at [30], Ms Yogarajah informed me at the hearing that if I dismissed OSB 109, her instructions were to ask for a three-month adjournment for Mr Pandey to raise funds to repay the debt. Ms Kaur objected to the request for an adjournment. 102 I was not inclined to grant the adjournment. First, the size of the debt was substantial. Second, I had serious reservations about Mr Pandey’s willingness and ability to pay the debt given the background to the bankruptcy proceedings. 103 As the conditions for making a bankruptcy order were met, I granted an order-in-terms of B 1010.",
        "Conclusion": "104  For these reasons, I dismissed OSB 109 and made an order-in-terms of B 1010. I further ordered that Mr Pandey pay EFA’s costs of OSB 109, fixed at $10,000 (all-in), and EFA’s costs of B 1010, fixed at $2,500 (all-in). Randeep Singh KoonarAssistant Registrar Ramandeep Kaur and Baldev Bhinder (Black Stone & Gold LLC) for the plaintiff; Shawn Tien Si Yuan, Sharmini Yogarajah and Subashini d/o Narayanasamy (Haridass Ho & Partners) for the defendant.",
        "": ""
    }
}