{
    "case_title": "Haotanto Anna Vanessa vFang Ching Wen Ted",
    "ncitation": "[2022] SGHC 216",
    "coram": "General Division of the High Court — Bankruptcy No 35 of 2021 (Summons No 425 of 2022) Aedit Abdullah J22 April 2022",
    "sections": {
        "Background": "2 On 6 April 2021, one Haotanto Anna Vanessa, the petitioning creditor (the “PC”), filed a bankruptcy application against the Bankrupt.1Foot Note 1×2nd affidavit of Fang Ching Wen Ted dated 28 January 2022 (“2B”) at para 4.On 15 April 2021, Mr Fang Ching Wen Ted was declared bankrupt.2Foot Note 2×2B at para 5.The Official Assignee (“OA”) was appointed as the trustee of the Bankrupt’s estate. A Statement of Affairs dated 14 July 2021 (“SOA”) was submitted by the Bankrupt to the OA.3Foot Note 3×2B at para 6.The OA determined the Bankrupt’s monthly contribution and target contribution to be $2,620 and $136,240 respectively (“OA’s Determination”).4Foot Note 4×2B at para 7.This was communicated to the Bankrupt via a notice of determination in or around 27 August 2021.5Foot Note 5×2B at para 7. 3 For context, the monthly contribution refers the amount that a bankrupt is required to pay to the OA on a monthly basis out of the bankrupt’s income, while the target contribution refers to 52 payments of the monthly contribution: s 273 of the IRDA. On fulfilment of the target contribution and other conditions, the bankrupt may be discharged from bankruptcy under the differentiated discharge regime. 4 On 9 September 2021, the PC applied for the appointment of a private trustee to administer the Bankrupt’s estate.6Foot Note 6×2B at paras 8 and 9. See also 2nd affidavit of Farooq Ahmad Mann dated 8 March 2022 (“2PT”) at para 10.On 2 November 2021, the PT was appointed on the basis that he would be in a better position to administer the Bankrupt’s estate, given that the Bankrupt had assets overseas.7Foot Note 7×2B at para 9. 5 On 10 January 2022, the PT revised the applicant’s monthly contribution and target contribution to $10,620 and $552,240 respectively (“PT’s Determination”).8Foot Note 8×2B at para 13. See also 2PT at paras 43 and 44.An explanation for the basis of the determination, alongside the notice of determination, was served to the Bankrupt.9Foot Note 9×2PT at para 44. 6 On 26 January 2022, the Bankrupt requested the PT to reduce the monthly contribution and target contribution based on his financial predicament.10Foot Note 10×2B at para 17.The PT refused.11Foot Note 11×2B at para 18.Thereafter, the Bankrupt commenced the present application.",
        "Summary of the Bankrupt’s case": "7 The Bankrupt’s case is that the PT erred in increasing his monthly contribution and target contribution. The OA’s Determination is to be preferred. First, he fully complied with the PT by furnishing the requested information.12Foot Note 12×Fang Ching Wen Ted’s written submissions dated 18 April 2022 (“Bankrupt’s submissions”) at para 13.There is no evidence that the Bankrupt concealed any information, and in any event, allegations of concealments are irrelevant to the core issue of whether there is adequate disclosure of his income for the determination of his monthly contribution and target contribution.13Foot Note 13×Bankrupt’s submissions at paras 15 to 17.Second, the PT failed to properly consider the factors enumerated under s 339 of the IRDA. In this regard, the Bankrupt advances three points. One, the Bankrupt’s current monthly income, as anad hocconsultant to Rhine Valley Partners (“RVP”), is $4,000. This is proven by his bank statements.14Foot Note 14×Bankrupt’s submissions at paras 20 and 21.Two, there is little scope for his earning capacity to increase. Having specialised in finance and hospitality, he is unable to work in the former due to his bankruptcy and the latter has been decimated by the COVID-19 pandemic.15Foot Note 15×Bankrupt’s submissions at para 23.His earning capacity has been further hamstrung by online harassment inflicted on him by the PC and other persons.16Foot Note 16×Bankrupt’s submissions at 24 to 26.Three, the Bankrupt is living hand to mouth. To meet his monthly expenses, he relies on handouts from his family and friends.17Foot Note 17×Bankrupt’s submissions para 31. 8 In the final analysis, the Bankrupt submits that the PT’s Determination renders it difficult for him to free himself from bankruptcy.18Foot Note 18×Bankrupt’s submissions at para 37.Given his financial predicaments, the conditions imposed are unreasonable and preclude the Bankrupt from having a reasonable chance of qualifying for discharge from bankruptcy.19Foot Note 19×Bankrupt’s submissions para 38 and 39. 9 In oral submissions, the Bankrupt argues that the court has a wide discretion in reviewing the PT’s Determination, akin to the court’s discretion in granting a discharge of bankruptcy. In this regard, the perversity standard, as outlined inZhang Hong En Jonathan v Private Trustee in Bankruptcy of Zhang Hong’En Jonathan[2021] 4 SLR 139 (“Jonathan Zhang”), should not apply. This is for two reasons: first, the application is sought pursuant to s 340 of the IRDA (as opposed to s 43 of the IRDA, which was the relevant provision inJonathan Zhang); and second, the determination of the monthly contribution and target contribution of a bankrupt is fundamental to when a bankrupt may be discharged from bankruptcy under the differentiated discharge regime. In the main, the Bankrupt submits that the PT failed to take into account relevant factors. The Bankrupt emphasises that he only earns $4,000 monthly and requires assistance from his friends and family to meet his monthly expenses. His earning capacity is also unlikely to increase. As for the payments made by the Bankrupt pre-bankruptcy, he asserts that these were funded by his companies, and are, in any event, irrelevant.",
        "Summary of the PT’s case": "10 The PT maintains his determination of the Bankrupt’s monthly contribution and target contribution, which is based on the documents available to him at the point of determination. In this regard, the PT emphasises that the onus is on the Bankrupt to provide all relevant information to him for his determinations.20Foot Note 20×Farooq Ahmad Mann’s written submissions dated 18 April 2022 (“PT’s submissions”) at para 25. 11 Based on the documents, there are several grounds to infer that the Bankrupt has other sources of income.21Foot Note 21×PT’s submissions at para 26.First, the Bankrupt was able to repay loans of significant sums while he was unemployed. By way of example, the Bankrupt was able to repay a loan worth $116,237.35 to Chatsworth Asset Holdings Ltd on 24 November 2020 even though he states in his SOA that his last date of employment was 1 October 2018 and he had no cash in hand or in any bank accounts as well as any other sources of income.22Foot Note 22×PT’s submissions at paras 28(a), 28(b) and 28(c).In an affidavit filed subsequent to the SOA, the Bankrupt then avers that his last date of employment was 1 October 2018.23Foot Note 23×PT’s submissions at para 29. See also 3rd affidavit of Fang Ching Wen Ted dated 5 April 2022 (“3B”) at para 7.This meant that the Bankrupt was able to repay an even larger sum of loans, namely $641,132.25, while unemployed. Second, the Bankrupt’s declarations of income are patently inconsistent.24Foot Note 24×PT’s submissions at para 32.As against his Notices of Assessment, it is unclear whether the Bankrupt earned $18,000 monthly up to 1 October 2019 (as stated in the SOA).25Foot Note 25×PT’s submissions at para 34.The documents subsequently relied on by the Bankrupt, such as his CPF statements and bank account statements, were belatedly provided, and do not, in any event, justify a downward variation.26Foot Note 26×PT’s submissions at paras 35 and 36. 12 Other factors under s 339 of the IRDA were also considered by the PT in arriving at his determination. The PT found it questionable that the Bankrupt’s last drawn monthly income was on either 1 October 2019 or 1 October 2018,27Foot Note 27×PT’s submissions at paras 55 to 56 and 58 to 62.and found that it was likely that the Bankrupt has a greater income-earning capacity than claimed.28Foot Note 28×PT’s submissions at para 63(d).In the PT’s assessment, the Bankrupt is well-educated, sophisticated, and savvy, and notably, was able to secure employment despite his age.29Foot Note 29×PT’s submissions at paras 76 to 80.The Bankrupt has also continued to associate with companies but has been less than forthcoming in disclosing such information.30Foot Note 30×PT’s submissions at paras 88 and 89. 13 In oral submissions, the PT argues that the perversity standard should apply to the court’s review under s 340 of the IRDA. Essentially, the determination of the monthly contribution and target contribution by the PT involves a business judgment. In this regard, the logic underlyingJonathan Zhangapplies with equal force. In reply to the Bankrupt, the PT highlights that several of the documents relied on were provided after the PT’s Determination, and that these were used by the Bankrupt to patch up his case as the hearing developed. Based on the SOA, there are numerous indications that the Bankrupt has an earning capacity greater than what he claims. Several other documents, such as the Bankrupt’s Notices of Assessment, similarly indicate so.",
        "The Decision": "14 Having considered the parties’ submissions, there is no reason to disturb the PT’s determination of the Bankrupt’s monthly contribution and target contribution.",
        "Analysis": "",
        "The role of the Private Trustee": "15 Division 2 of Part 3 of the IRDA governs,inter alia, the appointment, functions, and powers of the trustee in bankruptcy. Generally, a person other than the Official Assignee (also referred to as the private trustee), may be appointed as the trustee of a bankrupt’s estate: s 36 of the IRDA. When appointed, the private trustee steps into the shoes of the Official Assignee in administering the estate of the bankrupt, with the same functions and duties in relation to the conduct of the bankrupt in question and administration of the bankrupt’s estate: s 39(1)(a) of the IRDA. Barring the carve-out of certain provisions in the IRDA that directly pertain to the powers or duties of the Official Assignee, the private trustee is otherwise no different from the Official Assignee: ss 39(2) and 39(3) of the IRDA. Section 39(2), in fact, explicates that any references in the IRDA to the Official Assignee includes a reference to a trustee in bankruptcy. It is therefore unsurprising that the functions and duties of a private trustee are materially similar to that of the Official Assignee, that is, to supervise the conduct and affairs of the bankrupt and to administer the estate of the bankrupt. 16 The first iteration of the provisions in Division 2 of Part 3 of the IRDA is found in the Bankruptcy Act 1995. Private trustees were introduced to the bankruptcy regime to encourage unsecured creditors to assume a more active role in bankruptcy proceedings:Singapore Parliamentary Debates, Official Report(25 August 1994) vol 63 at col 402 (Prof S. Jayakumar, Minister for Law). It is notable that since the Bankruptcy Act 1995, the private trustee has had all the functions and duties of the Official Assignee in relation to the conduct of the bankrupt and the administration of the bankrupt’s estate: ss 36(1)(a) and 36(1)(b) of the Bankruptcy Act 1995. Material amendments to the provisions concerning private trustees were then made by way of the Bankruptcy (Amendment) Bill in 2015 (“the Bill”), to require or incentivise institutional creditors to appoint private trustees to administer some bankruptcies. This was done with a view of ensuring a better utilisation of public resources, by having institutional creditors who have sufficient resources and expertise to make credit assessments to consider carefully whether to apply for a bankruptcy order:Singapore Parliamentary Debates, Official Report(13 July 2015) vol 93 (Ms Indranee Rajah, Senior Minister of State for Law). In the course of the Second Reading of the Bill, the role of the private trustee vis-à-vis that of the Official Assignee was explained by Ms Indranee Rajah, Senior Minister of State for Law: regardless of whether the Official Assignee or a private trustee is appointed by the court, the same functions will be performed, that being, to administer the bankruptcy by,inter alia, investigating the bankrupt’s financial affairs to ascertain what is available for distribution. Since then, the provisions have been largely ported over from the Bankruptcy Act to the IRDA in their current form:Singapore Parliamentary Debates, Official Report(1 September 2018) vol 94 (Mr Edwin Tong Chun Fai, Senior Minister of State for Law). Consistently, the private trustee is envisaged to administer and supervise the affairs and the estate of the bankrupt, much like the Official Assignee. Nothing in the legislative history suggests otherwise. 17 Division 2 of Part 3 the IRDA, read alongside its legislative history, invariably suggests that the private trustee is entrusted with the administration of the affairs of the bankrupt. This is done with an eye towards both promoting recovery for the creditors and rehabilitating the credit of the bankrupt. 18 No specific duty, however, is owed to either the creditors or the bankrupt. As explained, the duty of the private trustee is no different from that of the Official Assignee, namely, to carry out the statutory obligations outlined in the IRDA. As for the supervision of the private trustee, this is largely left to the court. In doing so, the court would not generally interfere with the discretion exercised by the private trustee: for the private trustee to carry out his functions, the trustee must be empowered to act in respect of the bankruptcy estate and to exercise his own discretion. As succinctly explained by Harman J inRe A Debtor (No 400 of 1940); Ex parte The Debtor v Dodwell(The Trustee)[1949] 1 All ER 510 at 512, “[a]dministration in bankruptcy would be impossible if the trustee must answer at every step to the bankrupt for the exercise of his powers and discretions in the management and realisation of the property”, a view that this Court accepted at [42] ofJonathan Zhang. 19 Lack of good faith or abuse of process would be reason to interfere, but the court would not readily find such being made out. Any bankrupt making such allegations should have good grounds in support, lest it be found that the bankrupt has himself committed abuse of process through making unwarranted allegations. Counsel putting forward such arguments on behalf of a bankrupt should be mindful of their instructions and would be expected to exercise their professional judgment and expertise in advising their bankrupt clients accordingly.",
        "The applicable standard for review": "20 Under the IRDA, s 43 establishes the general supervisory jurisdiction of the court over the acts, omissions or decisions of a private trustee. Section 340 of the IRDA, on the other hand, expressly provides for the court’s review of the determination of the monthly contribution and target contribution. Parties’ disagreement over the applicable standard for review concerns whether the perversity standard, as perJonathanZhang, should apply. 21 Briefly, the perversity standard was held inJonathan Zhangto be the applicable standard of review in respect of s 43 of the IRDA. This Court found that it adequately balanced the considerations of, on one hand, the court having broad powers to disturb the private trustee’s decision and substitute its own, and on the other, to give the private trustee the control and management of the estate:Jonathan Zhangat [42] and [43]. 22 The Bankrupt contends that the perversity standard is inapplicable as the application is made pursuant to s 340 of the IRDA. As such, the court is required only to carry out a factual determination based on the factors in s 339 of the IRDA, on a wide discretionary basis.31Foot Note 31×Fang Ching Wen Ted’s reply submissions dated 21 April 2022 (“Bankrupt’s reply submissions”) at paras 4 to 6. See also minute sheet dated 22 April 2022.This is unpersuasive. The application being made under s 340 of the IRDA does not detract from the supervisory jurisdiction conferred on the court over a private trustee via s 43 of the IRDA. The ordinary language of s 43 of the IRDA makes clear that it applies to all decisions of a private trustee. This is even more apparent when the section is viewed contextually. Section 43 is parked under Part 3, Division 2 of the IRDA which contains provisions that are of an overarching application to the private trustee. Even applying the interpretive principle that generally the specific provision excludes the general nothing in s 340 of the IRDA, either expressly or impliedly, suggests that a different standard from that in s 43 of the IRDA is required. Section 340 of the IRDA does not address the standard of review to be applied; it predominantly sets out the procedural steps involved in an application for review. Nothing in s 340 suggests that s 43 of the IRDA, and the standard it imports, is to be disapplied. 23 While the Bankrupt sought to distinguish the nature of the present review from other applications, in that the monthly contribution and target contribution affects the Bankrupt’s possible discharge from bankruptcy under the differentiated discharge framework, this should not be overstated. InJonathan Zhang, the bankrupt sought to impugn his private trustee’s decision to grant him sanction to defend a third-party action only on the fulfilment of certain conditions. The participation (or lack thereof) by the bankrupt in the third-party proceedings would have had a bearing on his estate, and consequently, on his discharge. Quite simply, most, if not all, of the decisions by a private trustee have a bearing on a bankrupt’s discharge, and it is an inadequate basis to suggest that a different standard should apply. 24 Given the above, the standard of review of the decisions of the private trustee would, I accept, be based on the perversity standard, as stated inJonathanZhang. The PT’s determination of monthly contribution and target contribution is a function of his business and commercial judgment. It is part and parcel of his administration of the Bankrupt’s estate. For the PT to do so effectively, he cannot be in a position where he is constantly looking over his back. This is consonant with the exposition of the role of the private trustee in the bankruptcy regime, as outlined above, and is further consistent with the court’s general reluctance to interfere too readily with the decisions of the private trustee.",
        "Application to the facts": "25 On the perversity standard, the question to be asked is if no other private trustee would have done what the Private Trustee has done; in other words, was the Private Trustee’s decision so absurd that no private trustee properly advised or properly instructing himself could have so acted:Jonathan Zhangat [31] and [46]. In answering this question, reference must be had to the reasons underpinning the PT’s decision:Jonathan Zhangat [46]. 26 In my assessment, the Bankrupt has failed to be forthright and forthcoming with information. The PT’s Determination was not so perverse that it was one that could not have been reached by any other trustee acting reasonably. It was based on the information provided to him at the point he made his determinations, namely the SOA and the Bankrupt’s Notices of Assessment. 27 The thrust of the Bankrupt’s application concerns the PT’s determination of his monthly income and/or earning capacity. On the Bankrupt’s case, he has a monthly income of $4,000 with little scope for increase.32Foot Note 32×Bankrupt’s written submissions from paras 20 to 30.Because of this, he struggles to meet his monthly expenses, and is only able to get by with the assistance of friends and family.33Foot Note 33×Bankrupt’s written submissions from paras 31 to 35.Without a revision of the PT’s determination of his monthly contribution and target contribution, he is shackled to bankruptcy indefinitely.34Foot Note 34×Bankrupt’s written submissions at para 37. 28 On a holistic review, the PT’s finding that it is more likely than not that the Bankrupt is earning more than $4,000 monthly and has undisclosed sources of income is not so improper or unreasonable to warrant intervention. The primary evidence the Bankrupt relies on is his bank statements from United Overseas Bank Limited (“UOB”).35Foot Note 35×Bankrupt’s written submissions at para 21.These, however, were not available to the PT at the point of his determination and were only provided on 26 January 2022 despite the PT having sought these documents previously.36Foot Note 36×PT’s written submissions at para 40 and 41. See also 2PT at para 58.Instead, the PT’s finding is based on the SOA, which indicates that the Bankrupt repaid a loan of $116,237.35 to Chatsworth Asset Holdings Limited on 24 November 2020. This was even though he was allegedly unemployed since 1 October 2019 without any cash in hand or in any bank accounts.37Foot Note 37×PT written submissions at para 28.To exacerbate matters, the Bankrupt then revised his last date of employment to that of 1 October 2018.38Foot Note 38×3B at para 35.On the Bankrupt’s revised date of last employment, the PT’s inference that the Bankrupt has undisclosed sources of income is strengthened: from 1 October 2018 till date, the Bankrupt repaid loans totalling $641,132.35 despite being unemployed.39Foot Note 39×PT’s written submissions at para 30.Such an inference cannot be impugned to be unreasonable or improper. In any event, the PT has assessed the UOB bank statements to be incomplete and to contain inconsistencies that raise doubts as to whether the Bankrupt truly receives a monthly income of $4,000.40Foot Note 40×PT’s written submissions at para 68. 29 In a bid to rebut the PT’s finding arising from his repayment of substantial loans, the Bankrupt asserts that he took a loan from Tera Realty Limited, one of his companies, to repay the sum of $641,132.35.41Foot Note 41×Bankrupt’s reply submissions at para 17.It is worth noting that this was only first mentioned in the Bankrupt’s reply submissions, and was initially unsupported by any affidavit evidence. In affidavits subsequently filed, the Bankrupt averred that the loan originated from an investment of US$1,000,000 into Tera Realty Limited, and the loan is reflected in Tera Realty Limited’s bank statements.42Foot Note 42×4th affidavit of Fang Ching Wen Ted dated 20 May 2022 (“4B”) at paras 6 to 10.The details of the purported investment and loan, however, are sparse, and it is unclear why Tera Realty Limited would agree to extend a loan to the Bankrupt for his personal use. Moreover, the bank statements of Tera Realty Limited merely indicate a transfer of moneys to the Bankrupt, and do not show that moneys were used to repay the debts in the SOA. An analysis of the dates of the transfers of moneys also suggests that the moneys were not used in such a manner.43Foot Note 43×3rd affidavit of Farooq Ahmad Mann dated 7 June 2022 (“3PT”) at para 9.After the PT highlighted the deficiencies of the Bankrupt’s account that the loan originated from an investment into Tera Realty Limited, the Bankrupt then sought to tender a letter separately to demonstrate that the said investment was indeed made.44Foot Note 44×3PT at para 10. See also 5th affidavit of Fang Ching Wen Ted dated 1 July 2022 (“5B”) at paras 19 and 20.This was eventually done by way of an affidavit deposed on his behalf by Mr Loganathan Ravishankar (“Mr Loganathan”), who claims to have extended the said investment.45Foot Note 45×1st affidavit of Loganathan Ravishankar dated 19 August 2022.At its highest, Mr Loganathan’s affidavit merely confirms that he invested moneys into Tera Realty Limited but does little to cure the other defects of the Bankrupt’s claim: critically, it remains indeterminate if the moneys were used to repay the debts listed in the SOA. For context, all of this information was only provided in or after the Bankrupt’s fourth affidavit (dated 1 July 2022) in the present application. It is peculiar and puzzling that all of the above (including the allegation that the payment originated from a loan taken from Tera Realty Limited), which was well within the Bankrupt’s knowledge, was only first raised to the PT by way of his reply submissions dated 21 April 2022, with the relevant information being drip-fed to the PT via various affidavits and documents. Against this context, there is no basis to fault the PT’s assessment of the Bankrupt’s monthly income and/or earning capacity. 30 Part of the PT’s assessment concerning the Bankrupt’s monthly income and/or earning capacity relates to the Bankrupt’s inconsistent declarations of income. The SOA indicated that the Bankrupt’s last date of employment is 1 October 2019.46Foot Note 46×2B at p 12.This raised suspicions given that the Bankrupt’s 2020 Notice of Assessment indicated that he had an annual income of $14,000, which is irreconcilable with his last date of employment being 1 October 2019.47Foot Note 47×2PT at paras 45(f) and 60.This was pointed out in the PT’s affidavit dated 8 March 2022. In what appears to be an attempt to reconcile these conflicting positions, the Bankrupt then asserted in a reply affidavit to the PT dated 5 April 2022 that his last date of employment is 1 October 2018.48Foot Note 48×3B at para 7.This is so even though he indicated that his last date of employment was 1 October 2019 in both his SOA and his second affidavit dated 28 January 2022.49Foot Note 49×2B at p 12. See also 2B at para 22.In a bid to shore up his position, the Bankrupt belatedly provided his 2018 CPF statement (which was not available to the PT previously). The 2018 CPF statement, however, is of limited utility: it shows that CPF contributions by the employer were only made till July 2018 (as opposed to 1 October 2018).50Foot Note 50×PT’s written submissions at para 34(b).When confronted, the Bankrupt then alleges that his employer had problems contributing to employees’ CPF accounts.51Foot Note 51×5B at para 6. See also 3PT at para 5(a).On this front, again, not all relevant information was expeditiously provided to the PT for his determination. Instead, new evidence was provided in a fragmented and haphazard manner. 31 Much of the other Bankrupt’s contentions fall away given that they are premised on the Bankrupt having a monthly income of $4,000 with little scope for increase. For completeness, it should be noted that even the Bankrupt’s claim that he received financial assistance from his family and friends to meet his monthly expenses is afflicted by his reticence. His SOA indicates that he receives assistance of $2,700 from Mr Chua Eng Hong Julius (“Mr Chua”) and Mr Tan Kia Siew David (“Mr Tan”). The PT thus assessed the Bankrupt’s financial situation with reference to that position. Only after the PT’s determination did the Bankrupt sought to give nuance to his position and suggest that the stated amounts were an average of their contributions, and that the sums fluctuated as the assistance was provided on anad hocbasis.52Foot Note 52×2B at para 26.Full details of Mr Chua and Mr Tan’s assistance were only provided when the Bankrupt filed supplementary affidavits, when all this information was well within his possession previously. 32 Given the above, the assessment made by the PT was not so perverse that the Court should interfere. The PT’s determination was based on the information available to him at that point. His determinations were neither unreasonable nor objectionable. Documents that were subsequently provided were also done so in a haphazard manner, suggesting that the Bankrupt has failed to ensure complete and candid disclosure. There is no absurdity on the PT’s decision that requires intervention. 33 But given the information coming in such a way as was done here, I will direct the PT to require the Bankrupt to submit within three weeks all supplementary information (with all relevant documentation). This is to be consolidated in a single letter, and for the PT to thereafter conduct a final determination of the Bankrupt’s monthly contribution and target contribution.",
        "Cost orders": "34 Directions for submissions on costs will be given separately.",
        "Conclusion": "35 For these reasons, the application is dismissed. Aedit AbdullahJudge of the High Court Siraj Omar SC and Joelle Tan (Drew & Napier LLC) for the plaintiff (watching brief); Lim Hui Li Debby and Cheng Si Yuan Shaun (Dentons Rodyk & Davidson LLP) for the defendant; Tito Shane Isaac, Wong Hui Min and Sindhu Nair (Tito Isaac & Co LLP) for the private trustee."
    }
}