{
    "case_title": "Siraj Ansari bin Mohamed Shariff vJuliana bte Bahadin and another",
    "ncitation": "[2022] SGHC 186",
    "coram": "Kannan Ramesh J",
    "sections": {
        "The parties": "3 As noted earlier, the plaintiff and first defendant are husband and wife. They were married on 29 May 1999 and have two sons. The elder son is the second defendant, and the younger son is Matin Ansari bin Siraj Ansari (“Matin”). Both the plaintiff and first defendant are well educated and were senior civil servants at the material time. 4 The plaintiff describes himself as a “senior officer in the Singapore civil service”. He held the position of Head of Department at a junior college in 2015. The plaintiff holds a bachelor’s degree in history and political science, and a master’s degree in education. He testified that he pursued a doctorate in education which he did not conclude. 5 The first defendant is a medical doctor by training, having graduated from the National University of Singapore (“NUS”) in 1997. She joined SingHealth Polyclinics (“SingHealth”) in 2007 and held the position of Director of the Bedok Polyclinic from 2012 to 2018. After spending several years in a predominantly administrative capacity within the public healthcare sector, the first defendant decided that she wanted a change of environment so that she could focus on clinical work and teaching. 6 To this end, she left SingHealth on or about 16 July 2018 and started Saudara Clinic by A+J General Physicians Pte Ltd (“Saudara Clinic”), a private clinic located at 228 Changi Road, #01-01 Icon @ Changi, Singapore 419741. Saudara Clinic is owned by A+J General Physicians Pte Ltd (“A+J”), a company incorporated by the plaintiff and first defendant holding 45% and 50% shares respectively. The remaining 5% shares in A+J was held by the company’s accountant, Maggie Hung Pei Ring. Both the plaintiff and first defendant are directors of Saudara Clinic, though it is unclear from the available evidence whether the plaintiff is also a director of A+J. It is undisputed that the first defendant is the one who ran Saudara Clinic on a full-time basis. The first defendant is also an adjunct lecturer with the NUS Yong Loo Lin School of Medicine and an adjunct assistant professor with the Duke-NUS Medical School. 7 The second defendant is presently pursuing a degree in medicine at the University of Auckland, New Zealand. He was previously offered a scholarship to pursue a degree in biological sciences at the Nanyang Technological University, Singapore, but turned down the offer as it was his “greater aspiration … to be able to read medicine”. At the time of the trial, he was attending lessons virtually from Singapore. He expressed his intention to move to New Zealand to complete his studies once border restrictions were lifted. 8 Prior to 27 June 2020, the family resided in 1 Bowmont Gardens, Singapore 459850 (“Bowmont Gardens”). Bowmont Gardens was purchased on or about 11 May 2012 by the plaintiff and first defendant as joint tenants, partly in cash and partly with borrowings, for approximately $3.8 million. 9 The plaintiff and first defendant’s marriage started to deteriorate between January 2020 and April 2020, and broke down in late May 2020. On 27 June 2020, the defendants and Matin left Bowmont Gardens and moved into the Trust Property. Bowmont Gardens has since been sold. On or about 4 November 2020, the first defendant filed for divorce in the Syariah Court. Several days later, the plaintiff’s solicitors sent a letter dated 10 November 2020 to the first defendant (“the 10 November 2020 Letter”) that challenged the validity of the Trust Deed and asserted the plaintiff’s intention to commence the present action.",
        "Background to the dispute": "10 It is common ground between the plaintiff and first defendant that in early 2015, they discussed setting aside funds for their children’s tertiary education and other needs. They felt that purchasing properties for their children would ensure that there would be sufficient funds to meet such needs as and when they arose. The first defendant’s position is that the properties would be purchased on trust for the children, and the proceeds of sale or rental income from a subsequent sale or tenancy respectively would provide the necessary funds to meet their anticipated needs,ie,the costs associated with the children’s tertiary education and other needs. According to her, a trust was necessary because the children were minors and could not hold properties in their own names. To this end, the plaintiff and first defendant began to search for suitable properties. 11  Mr Marcus Fan (“Mr Fan”), a real estate agent with Propnex Realty Pte Ltd, assisted the plaintiff and the first defendant with their search. After visiting several show apartments, the plaintiff and first defendant came across the Trust Property in early 2015. Mr Fan informed them that the purchase price of the Trust Property was $1,490,000. The plaintiff and first defendant were interested and informed Mr Fan that they wished to purchase the Trust Property on trust for the second defendant. Mr Fan then prepared a cash flow analysis of the various payments that were required to purchase the Trust Property. I elaborate on the significance of Mr Fan’s cash flow analysis at [51] below. As the Trust Property was to be purchased on trust for the second defendant, Mr Fan’s cash flow analysis stated that no ABSD was payable for the purchase. As the plaintiff and first defendant were owners of Bowmont Gardens, ABSD would have been payable if they were purchasing the Trust Property for themselves (see [8] above). 12 Subsequently, Mr Fan introduced the plaintiff and first defendant to Mr Seng Ren Hao, Cannis (“Mr Seng”), a lawyer from Ascentsia Law Corporation (“Ascentsia”). Mr Seng was instructed by the plaintiff and first defendant to (a) prepare the Trust Deed and facilitate its execution, (b) handle the conveyancing matters concerning the purchase of the Trust Property, and (c) liaise with the Inland Revenue Authority of Singapore (“IRAS”) on the issue of ABSD. 13 The Trust Deed was executed on 2 March 2015. Under its terms, an irrevocable trust for $1,550,000 was created in favour of the second defendant. As noted earlier at [1], the plaintiff and first defendant were named as trustees. I reproduce several clauses from the Trust Deed that are relevant to the present action: WHEREAS … B. The [plaintiff and first defendant] intend to createan irrevocable trustfor the sum of SGD$1550000/- in favour of the [second defendant]. C. In pursuance of this trust arrangement and in order to protect the value of the trust set up in favour of the [second defendant],the [plaintiff and first defendant] intend to purchasethe [Trust Property] for the [second defendant] and hold it on trust for the benefit of the [second defendant]. D.This is further because the [second defendant] is a minor and may not purchase the [Trust Property] in [his] own name. The [plaintiff and first defendant] therefore wish to protect the interests of the [second defendant] in the [Trust Property] and all rights arising thereunder by declaring themselves a trustee for the [second defendant]. NOW THIS DEEDwitnesses as follows:- … 2. An irrevocable trust in favour of the [second defendant] shall be formed over the [Trust Property], any income which may accrue from the rental of the [Trust Property] and the sale proceeds which may result from the sale of the [Trust Property]. The [plaintiff and second defendant] shall retain no claim whatsoever over the same. … To rent the [Trust Property] 5. The [plaintiff and first defendant] shall be further empowered and upon the [plaintiff and first defendant’s] joint discretion, upon the receipt of vacant possession of the [Trust Property]; to rent out the property for the purposes of the collection of rental income to be used for the welfare and benefit of the [second defendant]. In this regard, the [plaintiff and first defendant are] further empowered to:- … d.payallfees,taxes,rates, service and conservancy charges, expenses, penalties, and other outgoings whatsoever payablefor or on account of the [Trust Property] or any part thereof; … l. pay all taxes rates charges expenses and other outgoings whatsoever payable by [the plaintiff and first defendant] for or on account of the said property or any part thereof; m.deposit any money which may come from the rental of the [Trust Property] to be also kept in trust for the [second defendant] with any bank account kept in the [plaintiff and first defendant’s] favour. … General Duties and Powers 7. Pending transfer of the [Trust Property] to the [second defendant], or determination of the Trust, whichever is earlier, the Trustee shall and is empowered to:- … c. [d]oall such acts and things as may be necessary or expedient in connection with the care, maintenance and/or management of the[Trust Property]; d. [p]ay all rates,taxes, fees service and conservancy charges, loan instalments, penalties expensesand other outgoings payable by[the plaintiff and first defendant]  for or on account of the Property e. [a]ccept service or [sic] writs, summonses, notices and todefend all legal proceedings brought in relation to the[Trust Property]; … Utilization of Sale Proceeds in the event of the Sale of the [Trust Property] 9. The [plaintiff and first defendant] shall be further authori[s]ed to reinvest the sale proceeds from the sale of the [Trust Property] in any way in which they deem fit. However, the reinvestment and use of the sale proceeds must be done with the object of ensuring and/or paying for the benefit and/or welfare of the [second defendant]. … [emphasis added in italics] 14 Following the execution of the Trust Deed, an Option to Purchase dated 4 March 2015 (“the OTP”) was issued by the developer in favour of the plaintiff and first defendant for the purchase of the Trust Property at $1,490,000. The OTP was exercised on or about 7 April 2015 and a sale and purchase agreement was entered into on or about 6 May 2015 (“the SPA”). Notably, both the OTP and the SPA expressly stated that the plaintiff and first defendant were purchasing the Trust Property for the second defendant as trustees. This was consistent with the terms of the Trust Deed. ABSD was not payable because the second defendant (a) was the beneficial owner of the Trust Property under the Trust Deed, and (b) did not own any other properties in Singapore at that time. As noted earlier at [11], had the plaintiff and first defendant purchased the Trust Property for themselves, ABSD would have been payable. The Trust Deed was therefore critical to whether the purchase of the Trust Property attracted ABSD.",
        "The parties’ cases": "",
        "The plaintiff’s case": "15 The plaintiff pleads four alternative grounds to set aside the Trust Deed. The four grounds are: (a) the first defendant’s misrepresentation; (b) mistake; (c) the first defendant’s exercise of undue influence; and (d) the first defendant’s unconscionable conduct and/or that the Trust Deed was an unconscionable transaction. 16 The plaintiff relies on a fifth ground that has not been pleaded. Crucially this ground is the thrust of his case at trial and in his closing submissions on the Trust Deed. As regards the fifth ground, the plaintiff asserts that the Trust Property was never purchased for the second defendant and that the Trust Deed was executed in order to evade ABSD. The plaintiff therefore asserts that the Trust Deed is a “sham instrument” and that it was entered into “for an illegal purpose … to wit the evasion of ABSD”. 17 I pause here to address the question of whether I may consider the unpleaded issue of illegality. The Court of Appeal’s endorsement ofEdlerv Auerbach[1950] 1 KB 359 inFan Ren Ray and others v Toh Fong Peng and others[2020] SGCA 117 at [13] is instructive: However, it is also clear that, in certain very specific and limited circumstances, the court would be bound to consider the issue of illegality.In this regard, we endorse the following observations by Devlin J (as he then was) in the leading English decision ofEdlerv Auerbach[1950] 1 KB 359 at 371 (and cited with approval by the Singapore High Court inKoon Seng Construction Pte Ltd v Chenab Contractor Pte Ltd and another[2008] 1 SLR(R) 375 at [31]): [F]irst, that, where a contract isex facieillegal, the court will not enforce it, whether the illegality is pleaded or not; secondly, that, where … the contract is notex facieillegal, evidence of extraneous circumstances tending to show that it has an illegal object should not be admitted unless the circumstances relied on are pleaded; thirdly, that, where unpleaded facts, which taken by themselves show an illegal object, have been revealed in evidence (because, perhaps, no objection was raised or because they were adduced for some other purpose), the court should not act on them unless it is satisfied that the whole of the relevant circumstances are before it; but, fourthly, that,where the court is satisfied that all the relevant facts are before it and can see clearly from them that the contract had an illegal object, it may not enforce the contract, whether the facts were pleaded or not. [emphasis added] It is clear from this extract that there is no procedural impediment to considering the issue of illegality if it is apparent from the relevant facts that the Trust Deed had an illegal object. 18 In any event, I also observe that the defendants are not prejudiced by the plaintiff’s failure to plead that the Trust Deed is a sham. Significantly, the defendants do not take the position that the court should not consider this issue because it has not been pleaded. While the defendants have highlighted in their closing submissions that the plaintiff has “deviated from its [sic] pleaded case” in taking the position that the Trust Deed is a sham instrument entered into to avoid ABSD, they acknowledge that the issue of illegality was “evident from the [p]laintiff’s AEIC and [p]laintiff’s counsel’s cross-examination of the [d]efendants’ witnesses”. As such, the defendants were able to fully address this issue at trial and in their closing submissions. I note in this regard that the defendants’ closing submissions focus primarily on defending thebona fidesof the Trust Deed. The defendants therefore cannot and do not say that they have been taken by surprise or irreparably prejudiced by the plaintiff’s failure to specifically plead the issue of illegality:JTrustAsia Pte Ltd v Group Lease Holdings Pte Ltd and others[2020] 2 SLR 1256 at [130]. 19 I return to the plaintiff’s case to summarise the pleaded reliefs. 20 By reason of the five vitiating factors at [15]–[16] above, the plaintiff seeks (a) to set aside the Trust Deed, (b) a declaration that the plaintiff and first defendant are the legal and beneficial owners of the Trust Property, and (c) a declaration that the first defendant and/or the second defendant hold the Trust Property on resulting trust and/or constructive trust for the plaintiff and first defendant.",
        "The defendants’ case": "21 The defendants’ overarching position is that the Trust Property was purchased by the plaintiff and first defendant with the common intention of benefiting the second defendant and providing for his needs. The Trust Deed was executed in furtherance of this shared intention. As such, the non-payment of ABSD was “a simple corollary of their intention and does not itself demonstrate any dishonesty on the part of the [p]laintiff and the [first d]efendant”. Accordingly, the defendants’ position on the issue of illegality is that there was no common intention between the plaintiff and first defendant to evade ABSD as the Trust Property was purchased for the second defendant. Accordingly, the Trust Deed is not a sham. The defendants’ position on the four pleaded vitiating factors at [15] above is that the plaintiff has failed to establish the facts to support them. In other words, a finding that the Trust Deed was executed for thebona fidepurpose of purchasing the Trust Property on trust for the second defendant would strip the plaintiff’s case of its factual foundation. 22 The defendants have also counterclaimed for a declaration that the plaintiff be removed as a trustee of the Trust Property. They argue that in commencing the present action, the plaintiff has, as trustee, (a) failed to act in the best interest of the second defendant, and (b) placed his personal interests in conflict with those of the second defendant. 23 For completeness, I should note that the defendants also brought a counterclaim for defamation against the plaintiff which was withdrawn on the third day of trial following a settlement of that claim.",
        "Issues": "24 It is clear that the five grounds raised by the plaintiff to set aside the Trust Deed centre on a common question – whether the Trust Deed is abona fideinstrument executed for the purpose of purchasing the Trust Property on trust for the second defendant or a sham instrument executed for the purpose of evading ABSD. This is the central issue in this action, and as noted at [16], the bulwark of the plaintiff’s case against the Trust Deed. Accordingly, a finding that the Trust Deed is abona fideinstrument is dispositive of the plaintiff’s claim. It is also to a large measure dispositive of the defendants’ counterclaim, as if the plaintiff’s claim is not made out, his conduct as trustee will militate strongly in favour of his removal. I shall explain. 25 The plaintiff’s four pleaded grounds to set aside the Trust Deed are predicated on the common factual basis that in the plaintiff’s mind, the legal and beneficial ownership of the Trust Property always remained with the plaintiff and first defendant as the Trust Deed was a sham instrument executed to evade payment of ABSD. In other words, in his mind, the Trust Deed was a sham and not abona fidetrust instrument. A review of the plaintiff’s Statement of Claim (“SOC”) makes this clear. I begin with the plaintiff’s pleaded case on misrepresentation as detailed at [11] and [42.1]–[42.3] of the SOC: 11. Upon her enquiry and upon informing the Plaintiff of her said enquiry, the 1st Defendant represented to the Plaintiff that:- 11.1.The avoidance of any additional buyer’s stamp duty lied[sic] in the purported placement of the beneficial ownership of 70 Saint Patrick’s in a party other than the Plaintiff and the 1st Defendant; 11.2. The beneficial ownership be placed in the 2nd Defendant as the eldest child of the Plaintiff and the 1st Defendant; and 11.3.Despite the said placement of the said beneficial ownership, for all intent and purpose 70 Saint Patrick’s shall, in all regard, belong to both the Plaintiff and the 1st Defendant and for them to deal with 70 Saint Patrick’s as they desired. … 42.  By reason of the above the Plaintiff avers:- 42.1.The 1st Defendant made the representation set out in para 11 above, 42.1.1. Fraudulently and either with the knowledge that it is false or made in the absence of any genuine belief that it is true or recklessly not caring whether they were true or false; or. [sic] 42.1.2. Innocently; and 42.1.3. In either event, with the intention that the Plaintiff act upon her said representation. 42.2.The Plaintiff acted on the 1st Defendant’s said representation as set out above and to his detriment. 42.3 By reason of the 1st Defendant’s said misrepresentation, the Plaintiff suffered loss of his beneficial interest in 70 Saint Patrick’s. … [emphasis added] 26 This was expanded on in the plaintiff’s affidavit of evidence-in-chief (“the plaintiff’s AEIC”) where he asserts the following: At all times, the 1[st] Defendant and I knewand as the 1[st] Defendant represented to me, that the then intended trust was simply to ensure that we were able to avoid paying the additional stamp dutiesand that at all times and for all intent and purpose the 1[st] Defendant and I were the owners of 70 Saint Patrick’s for us to do with the same as we deemed fit. I did not need much convincing as I trusted the 1[st] Defendant and relied on her said representation … [emphasis added] 27 It is clear from the extracts above that the essence of the plaintiff’s claim in misrepresentation is that the first defendant lied that the Trust Deed was a sham to avoid paying ABSD. The predicate of the assertion is that there was no common intention to purchase the Trust Property on trust for the second defendant, pursuant to which the Trust Deed was executed. It follows that if the plaintiff and first defendanthadthis common intention, the first defendant would not have lied as alleged. These are mutually exclusive positions. 28 The same point may be made as regards the pleas of mistake, undue influence and unconscionability as they rest on the same factual basis as the plea of misrepresentation. This is clear from [42.4], [42.7] and [42.9] of the SOC, which aver as follows: 42.4 Further and/or in the alternative,by reason of the 1st Defendant’s said misrepresentation and/or in the circumstancesset out above, the Plaintiff had executed the Trust Deed under a mistakeas to the Trust Deed’s legal effect and to his detriment. … 42.7 Further or in the alternative,by reason of the 1st Defendant’s said misrepresentation and/or in the circumstances set out above, the 1st Defendant exercise undue influence upon the Plaintiffcausing the Plaintiff execute [sic] the Trust Deed and to his detriment. … 42.9 Further or in the alternativeand in the circumstances set out above, the 1st Defendant had acted unconscionably and/or the Trust Deed is an unconscionable transaction. [emphasis added] 29 As such, the central inquiry is whether the Trust Deed is abona fideinstrument executed pursuant to the plaintiff and first defendant’s common intention to purchase the Trust Property on trust for the second defendant. 30 Accordingly, the issues are: (a) whether the Trust Deed was executed for the purpose of evading ABSD or whether it was abona fidetrust instrument (“Issue 1”);(b) whether any of the plaintiff’s four pleaded grounds to set aside the Trust Deed has been made out (“Issue 2”); and(c) whether the plaintiff ought to be removed from his position of trustee of the Trust Property (“Issue 3”).",
        "Issue 1": "31 Before I turn to consider Issue 1, I begin by highlighting an important shift in the plaintiff’s case. This concerns the amount of ABSD that would have been payable if the Trust Property had not been bought on trust for the second defendant. In gist, the plaintiff’s position on the amount of ABSD that was payable changed from $178,800 to $104,300 over the course of the trial. To understand how this happened, I begin with the SOC at [10]: About or in the course of the purchase of 70 Saint Patrick’s, both the Plaintiff and 1[st] Defendant became aware of the fact that the intended purchase of 70 Saint Patrick’s wouldattract additionalbuyer’s stamp duties of 12% of the purchase price of 70 Saint Patrick’s, corresponding with the sum of $178,800.00 or thereabouts. [emphasis added] 32 The position alleged in the SOC was affirmed by the plaintiff on the first day of trial. His evidence in examination-in-chief was that (a) the first defendant’s research had shown that “a 12 per cent ABSD which would amount to about $178,000” was payable, and (b) “she was not willing to pay for the ABSD and as such … through her own research, she found out that [they] could circumvent it by actually … buying the property via a trust”. 33 However, on the fifth day of trial, it emerged that the prevailing ABSD rate at the time the Trust Property was purchased in 2015 was in fact 7% and not 12%. Counsel for the plaintiff acknowledged the error and stated that the “exact amount … payable then … but for the trust instrument is [$]104,300 based on the purchase price of [$1,490,000]”. Any ABSD that might have been payable on the Trust Property would thus have been $104,300 and not $178,800. This was not a mere correction of the rate of ABSD at the material time or a matter of arithmetic. The change is material as it casts doubts on the plaintiff’s case. I make two points. 34 First, the change raises questions as to whether the plaintiff’s evidence as set out in [32] above is truthful,ie, whetherthe first defendant did in fact research and ascertain that “a 12 per cent ABSD” amounting to “about $178,000” was payable. It is important that the assertion was made in the SOC and confirmed on the first day of trial in examination-in-chief. That suggested that there was no inadvertent error in the evidence. 35 Second, the change goes to the essence of the plaintiff’s case that the quantum of ABSD, $178,800, was so large that it pushed the plaintiff and first defendant to enter into a sham instrument. If the first defendant did not in fact research and ascertain that the ABSD was $178,000, this point becomes unsustainable. This narrative is further weakened if the ABSD was in fact considerably lower at $104,300. 36 It is significant that despite the correction on the rate and the quantum of ABSD by plaintiff counsel, the plaintiff madenoattempt to clarify his evidence as set out in [32] above. He also did not clarify what the true position was – for instance, whether at the material time he and the first defendant (a) mistakenly thought the ABSD payable was $178,800 and proceeded on that basis, or (b) in fact knew that the ABSD payable was $104,300. There is therefore a disconnect between the plaintiff’s case as pleaded and the facts. This raises further questions on the truthfulness of his claim that the Trust Deed was executed to evade ABSD. This brings me to my third point. 37 While the sum of $104,300 for ABSD is not insignificant, it is considerably less than the sum of $178,800 that was pleaded. There is no evidence that the plaintiff and first defendant did not have the means to pay ABSD of $104,300 or for that matter $178,800. Would the plaintiff and first defendant have run the risk of losing their jobs and reputation, and facing possible penal consequences, for an amount which appeared to be well within their means? They were both senior civil servants holding good positions with a fairly long runway in their careers at the material time (see [3]–[6] above). It is difficult to accept that they would have found it worth the risk to evade ABSD for $104,300 and it is relevant to examine Issue 1 through this lens. 38 With these prefatory observations, I turn to consider Issue 1. I begin by outlining the relevant legal principles.",
        "Applicable legal principles": "39 The applicable legal principles in determining whether a document is a sham were summarised inChngBee Kheng and another (executrixes and trustees of the estate of Fock Poh Kum, deceased) v Chng Eng Chye[2013] 2 SLR 715 (“ChngBee Kheng”) at [50]–[51]: 50 The basic idea of a sham can be found in Lord Diplock’s statement inSnook v London and West Riding Investments Ltd[1967] 2 QB 786 at 802: As regards the contention of the plaintiff that the transactions between himself, Auto Finance and the defendants were a ‘sham,’ it is, I think, necessary to consider what, if any, legal concept is involved in the use of this popular and pejorative word. I apprehend that, if it has any meaning in law, it meansacts done or documents executedby the parties to the ‘sham’ which areintended by themto give to third parties or to the court the appearance of creating between the parties legal rights and obligations different from the actual legal rights and obligations (if any) which the parties intend to create. But one thing, I think, is clear in legal principle, morality and the authorities … that for acts or documents to be a ‘sham,’ with whatever legal consequences follow from this,all the parties theretomust have a common intention that the acts or documents are not to create the legal rights and obligations which they give the appearance of creating. 51 There are two important general points to note in relation to the Sham Argument raised by the Defendant. First, the person alleging that a document is a sham has the burden of proving that the parties intended the document to be a pretence:National Westminster Bank plc v Rosemary Doreen Jones[2001] 1 BCLC 98 (“National Westminster Bank”) at [68]. Second, there is a very strong presumption that parties intend to be bound by the provisions of agreements which they enter into. As Neuberger J (as he then was) explained in the same case (at [59]): … Because a finding of sham carries with it a finding of dishonesty, because innocent third parties may often rely upon the genuineness of a provision or an agreement, and because the court places great weight on the existence and provisions of a formally signed document, there is astrong and natural presumption against holding a provision or document a sham. [emphasis in original in italics and bold italics] 40 At its core, the inquiry is directed at whether there was a common intention between the parties that the document in question is not to create the legal rights and obligations which it gives the appearance of creating:ChngBee Khengat [50]. As the “inquiry is one into the subjective intentions of the parties, the court is not restricted to the usual rules governing the interpretation of documents” and “may have regard to a wider category of evidence, such as the parties’ subsequent conduct”:ChngBee Khengat [55]. The court may therefore consider the subsequent actions of parties to determine whether or not parts of the agreements are a sham in the sense that they were intended merely as “dressing up” and not as provisions to which any effect should be given:AG Securities v Vaughan[1990] 1 AC 417 and cited with approval inChngBee Khengat [55]. 41 Having considered the evidence, I find that the conduct of the plaintiff and first defendant and the contemporaneous evidence point to the Trust Deed beingbona fide.I shall explain.",
        "The conduct of the plaintiff and first defendant and the contemporaneous evidence point to the Trust Deed being bona fide": "The plaintiff and first defendant’s execution of documents as trustees 42 First, the plaintiff and first defendant executed several documents as trustees for the second defendant that affirmed the legitimacy of the Trust Deed. 43 As I noted at [14] above, the OTP and the SPA were executed by the plaintiff and first defendant as trustees. On the face of these documents, the plaintiff appears to have accepted, vis-à-vis the vendor (the developer), that the first defendant and him were purchasing the Trust Property as trustees. 44 The plaintiff and first defendant also signed a declaration form to IRAS dated 24 July 2017 (“the Declaration”) that (a) the Trust Property was acquired under a trust arrangement dated 2 March 2015 (ie,the Trust Deed), and (b) no ABSD was payable for the Trust Property. In this regard, it is relevant that the Declaration was made after IRAS initiated an audit on 14 June 2017 (well after the SPA had been signed on 6 May 2015) on why ABSD was not paid for the purchase of the Trust Property and after it specifically questioned the plaintiff and first defendant, through Ascentsia, on why this was the case. The plaintiff and first defendant must have been aware of the serious consequences that would result from the evasion of ABSD or the making of a false Declaration. The Declaration explicitly stated the following: ABSD is payable within 14 days of the date of execution of the Agreement/Contract.IRAS takes a very serious view on non-payment of stamp duty.Penalties of up to 4 times the stamp duty owed will be imposed on the purchaser/beneficiary if the stamp duty is not fully paid or not paid on time. Please note thatany person who furnishes information that isfalse or misleading shall be guilty of an offence under Section 65 of the Stamp Duties Act. [emphasis added]. 45 The plaintiff did not assert that he continued the lie as disclosing the truth would have carried serious ramifications. In fact, the plaintiff was careful to confirm in cross-examination that the information in the Declaration was accurate. He accepted that he understood that the Trust Deed “had to follow whatever … a trust instrument ought to be” and that “if it is supposed to be a trust document, then it ha[d] to follow certain rules of what makes this document a trust document”. Thus, the OTP, the SPA and the Declaration are clear evidence that the Trust Deed is abona fideinstrument. 46 Finally, several tenancy agreements for the Trust Property were also executed by the plaintiff and first defendant as trustees. In this regard, the opening recital and signature blocks of these tenancy agreements explicitly identify the plaintiff and first defendant as “the Trustee[s]” of the Trust Property for the second defendant. 47 When viewed together, I find that these documents show a consistent pattern of behaviour by the plaintiff and first defendant demonstrating that they understood that they were trustees of the Trust Property under the Trust Deed and acted as such in accordance with its terms. The plaintiff and first defendant’s communication with third parties 48 Second, the plaintiff and first defendant informed third parties of their intention to create a trust for the second defendant. In this regard, the evidence of Mr Seng and Mr Fan, two individuals who were involved in the purchase of the Trust Property and the creation of the Trust Deed, is critical. Their evidence is consistent with the Trust Deed being abona fideintsrument. 49 Mr Seng testified that it was his practice to ensure that all his clients, including the plaintiff and first defendant, were aware of what they were signing. He testified that “the heart of the issue is always does the client understand what they are doing when they are signing this document” and that “the emphasis is always … on the understanding … that they must understand what they are signing up for”. The following extract from Mr Seng’s cross-examination makes this clear: Q: Okay, but if I could direct your--- A: Sure, sure, sure. Q: ---attention to trust instrument, specifically. A: Yes. Q: Yes. A: The emphasis is the same, okay. As with any other legal document that they sign, such as the mortgage, such as the trust deed. Q: I see. A: The emphasis is on them understanding what they are doing so that when, invariably, when there is a dispute that arises, and the lawyer gets called on to the stand, okay, they might not---we---we definitely do not remember the individual client, okay - that---that---that is the God honest truth - but it is always part of that protocol that is seared into our memory, okay, that they must understand these points in relation to what they are signing. “If you cannot agree to these points, okay, then my job is to tell you that you cannot sign this in my presence, and I cannot be a witness, okay, to this document, because part of it is that you must understand what you are signing.” [emphasis added] 50 The plaintiff accepts that he informed Mr Seng of the intention to create a trust. In the plaintiff’s AEIC at [31], he states that: Prior to the signing of the Trust Deed, the 1[st] Defendant and I attended Ascent[s]ia Law Corporation once to have a short consultation andto inform Mr Sheng [sic] of the intention to create a trust.Mr Sheng [sic] informed us then that it was a standard document and that it would not be too difficult to do … [emphasis added] 51 Mr Fan testified that he was informed by the plaintiff and first defendant that they intended to create a trust for the second defendant. Thus, on 21 February 2015, Mr Fan provided the plaintiff and first defendant with a cash flow analysis for the purchase of the Trust Property that was computed on the basis that “there will be no ABSD since [the plaintiff and first defendant would] be buying under a trust”. This was affirmed by the following exchange during Mr Fan’s cross-examination: Court: … The question is: were you told that the property was being bought on trust and Mr Singh is asking why would you as an estate agent leave ABSD as 0 in this email unless you were told by the client they were buying it on trust? … Court: But Mr Singh's question was whether you were told? A:   Yes. Court:  So what is your answer? A:  (Pause) I was told that they want to create a trust,okay?And I don't know whether they duly go ahead. So when I follow-up, I do the progressive payment,so Iassume there will be no ABSD if they create a trust. Court:   Mr Singh? Mr Singh:  Mr Fan, I think His Honour has taken it as far as possible, but let me just tell you this. They saw the lawyers after your email. They saw the lawyers you can take it from me on 2 March 2015. Your email is dated 21 February 2015. So it must be that by this time, by 21 February 2015,you already knew that they were setting up a trust in favour of their son, which is why youdidn’t indicate ABSD in your cashflow analysis.Would you agree or disagree? “Yes” or “No”, Mr Fan? A:Yes. [emphasis added] 52 Accordingly, I find that the testimonies of Mr Seng and Mr Fan – that the plaintiff and first defendant had informed them of their intention to create a trust in favour of the second defendant – are consistent with the conclusion that the Trust Deed is abona fideinstrument. 53 I should add that the first and second points also put to rest the plaintiff’s assertion that the first defendant misrepresented to him that the Trust Property would be theirs notwithstanding the Trust Deed (see [15(a)] and [27] above) or that he was mistaken as to what the effect of the instrument was (see [15(b)] and [28] above). It is evident that the plaintiff was well aware of the purport and implications of the Trust Deed and executed it fully understanding this position. The plaintiff’s conduct prior to commencing the present action 54 Third, the plaintiff’s conduct prior to the commencement of the present action was generally consistent with the terms of the Trust Deed and the belief that the Trust Deed was abona fideinstrument. 55 The letter from the plaintiff’s former solicitors dated 28 September 2020 (“the 28 September 2020 Letter”) to the first defendant’s solicitors concerning the division of matrimonial assets of the plaintiff and first defendant is pertinent. It is important that by this time, the plaintiff had received the Trust Deed from Ascentsia and his relationship with the first defendant had broken down or at the very least deeply frayed (see [9] above). In the 28 September 2020 Letter, the plaintiff described the Trust Property in the following terms: The second immovable property acquired is the [Trust Property] purchased in 2015.The said property is held on trust by two (2) trustees, namely, both parties to the marriage, and decisions made pertaining to the property requires approval from both parties.The property is on trust for the parties’ child (i.e. Mohamed Mirza Ansari Bin SirajAnsari)(“Mohamed Mirza”)till he reaches the age of forty (40). This means that the legal ownership of the property is vested on [sic] both parties to govern the property for the next twenty (20) years, till the said child turns forty (40). We have clear instructions that should your client agree to the proposals contained in this letter,our client agrees to transfer his trusteeship and legal ownership to your client entirely to grant her sole discretion as to how the property will be managed… … Essentially, this means that [the first defendant] has profound influence on the children,including Mohamed Mirza, the child to which the [Trust Property] is held on trust for, and may direct how the [Trust Property] is to be governed in the event our client renounces his trusteeship … [emphasis added] 56 Despite the breakdown in their relationship, the plaintiff’s proposal in the 28 September 2020 Letter assumed the validity of the Trust Deed. It relied on and was consistent with the terms of the Trust Deed, in particular Recitals B, C and D and Clause 2 of the Trust Deed (see [13] above). The plaintiff accepted this in cross-examination, when he admitted that there was nothing in the 28 September 2020 Letter that suggested that the Trust Deed was entered into to evade ABSD. 57 The same position was taken by the plaintiff in a subsequent letter to the first defendant’s solicitors, again from his former solicitors, dated 14 October 2020 (“the 14 October 2020 Letter”). This was a letter of demand concerning the “[r]etainment of rental proceeds of [the Trust Property] and equal profits share in Saudara Clinic”. The following extract from the 14 October 2020 Letter is pertinent: 2. We are instructed that Mr Siraj Ansari (“our Client”) and you entered into a trust agreement on 02 March 2015 to hold [the Trust Property] on trust for your child, one Mr Mohamed Mirza (“Mirza”).The property is held on joint trusteeship since its acquisition and has remained unchanged till to-date[sic]. 3. Pertinently, the said trust declaration provides that any decisions pertaining to the [Trust Property] must be made by way of joint consent of both our Client and you. Impliedly, this includes the manner in which any rental money obtained from the [Trust Property] is to be governed for Mirza’s benefit,i.e.both trustees must agree as to how the rental proceeds are to be used for Mirza’s benefit.As both trustees are entitled to make a decision, this entails that our Client has a legal share on the rental proceeds of an amount equal to you (50%). [emphasis added] It is apparent that the 14 October 2020 Letter also proceeded on the premise that the Trust Deed wasbona fide. 58 The plaintiff only departed from this position after the first defendant commenced divorce proceedings on or about 4 November 2020. The plaintiff challenged the validity of the Trust Deed for the very first time in the 10 November 2020 Letter (see [9] above). The 10 November 2020 Letter, written by the plaintiff’s present solicitors, was issued to the first defendant and alleged that the Trust Deed was “voidable, if not void … for reasons [the plaintiff] will expand upon in his intended action to revoke the same”. No further details were provided to justify the new position the plaintiff was taking. It was not until the plaintiff’s AEIC was filed on 10 December 2021, that the plaintiff asserted clearly that the Trust Deed was void because it was a “sham instrument with the objective of avoiding [ABSD]”. 59 I find that the plaintiff’s new position is not an honest one. It is nothing but an afterthought. A number of features betray its lack of credibility. 60 First, the plaintiff has failed to offer a credible explanation for his change of position. It is important to remember that the 28 September 2020 Letter and the 14 October 2020 Letter were written with the advice of the plaintiff’s former solicitors. Both letters specifically addressed the Trust Deed and the Trust Property. It is inconceivable that the plaintiff would not have conveyed the true facts concerning the trust arrangement to his then solicitors, because his relationship with the first defendant had already frayed by the time those letters were sent (see [9] above). Acrimony had set in and the plaintiff was trying to deal with the Trust Property. If his position was that the Trust Property belonged to the first defendant and him and the Trust Deed was a sham, he would surely have said so in explicit terms and not purport to rely on the terms of the instrument. If hedid notconvey the true position to his solicitors then, it would surely be incumbent upon him to explain why, and why it only dawned on him in November 2020 to present his changed position to his new solicitors. 61 In this regard, it is pertinent that the plaintiff’s change in position occurred on 10 November 2020,afterthe first defendant had commenced divorce proceedings on or about 4 November 2020 (see [9] above). Even then, the 10 November 2020 Letter kept the allegation deliberately vague, with the plaintiff essentially choosing not to reveal his concerns with the Trust Deed with any specificity. Even when the present action was commenced, the issue of the illegality of the Trust Deed was not pleaded and particularised. It was only a year later in December 2021 when the plaintiff suggested, somewhat belatedly, that the Trust Deed was entered into for an illegal purpose. Something this fundamental ought to have been raised and explicated in the correspondence and the pleadings at the earliest opportunity. 62 The plaintiff never explained why the 28 September 2020 Letter and the 14 October 2020 Letter were written in the manner that they were. He only offered an explanation for why the 10 November 2020 Letter was the first time that the validity of the Trust Deed was challenged. However, I find his explanation to be contrived. 63 The plaintiff claims that he only looked at the Trust Deed in earnest when the divorce proceedings were commenced in November 2020. When he finally did so, he was left “in shock” as he discovered that “the Trust Deed was a sham instrument” entered into with the objective of evading ABSD. He asserts that he was previously “labouring under the belief that [the Trust Property] belonged to the [plaintiff and first defendant]”, and it was this mistaken belief that led him to “agree to … the execution of the Trust Deed”. Given the evidence of Mr Seng, Mr Fan and the Declaration, which I find credible, this is a difficult assertion to accept. In any event, this does not explain why the assertion that the Trust Deed was a sham instrument was not made in the 28 September 2020 Letter or the 14 October 2020 Letter, bearing in mind that these letters were written under advice and made express reference to the Trust Deed and the Trust Property. 64 The plaintiff also sought to portray himself as someone who only did the first defendant’s bidding. The plaintiff submits that he “was never the party who acted on his own accord without the [first d]efendant’s directions and/or agreement”. He also points to several messages from the first defendant that directed him to pay his income taxes and submits that these messages are “sufficient evidence to show that the [first] defendant had directed the [p]laintiff with instructions and information”. 65 The plaintiff’s characterisation of himself does not comport with my assessment of him. He is no wallflower. He is quite capable of asserting himself in his relationship with the first defendant and the children, and disagreeing, vigorously, on issues. The first defendant explained in cross-examination that the plaintiff never took her words at face value and would demand proof before he could be convinced. The second defendant testified that the plaintiff had anger management issues and would “often vent his frustration” on the defendants and Matin. It is telling that the plaintiff himself makes the following admission in his counselling form that was submitted to the Syariah Court: … I have made life difficult for my wife with my jealousy,controlling ways, my trust issues, my own anger management issues, my lies and double standards … I revert to my jealous, controlling ways and I will throw accusations at my wife that are all unfounded … [emphasis added] 66 Thus, I find it difficult to accept that this was a case where the plaintiff went along with the first defendant’s instructions despite knowing the gravity of the conduct that was asked of him. In the round, the absence of any credible explanation as to the plaintiff’s change of position in the 10 November 2020 Letter leads to the inexorable conclusion that the new position is not an honest one. 67 Second, the new position itself is difficult to accept. In effect, the plaintiff was accepting that he had intentionally evaded ABSD. This carries obvious legal, professional and reputational ramifications. Yet, when cross-examined on whether he had taken the risk of “being sacked because of tax evasion” in spite of his position as a “senior officer in the Singapore civil service”, the plaintiff claimed that “[he] didn’t know the ramifications at that point in time” but accepted that “[his] mistake was [that he] allowed it to happen”. I find this to be a highly implausible explanation. The plaintiff’s position was that the Trust Deed was executed for the specific purpose of evading ABSD. It is therefore inconceivable that he would not have understood that entering into a sham instrument for this purpose would carry deleterious consequences. Also, the circumstances in which the Declaration was executed and the terms thereof would have reinforced to the plaintiff the consequences of his conduct (see [44]–[45] above). On the evidence and my assessment of the plaintiff, he is an educated and intelligent man well capable of understanding exactly what he was doing. It is most unlikely that he would have been ignorant of the potential ramifications of his purported actions. In the same vein, it is most unlikely that he would have intentionally or knowingly exposed himself to those ramifications by setting out to evade ABSD. The more likely inference, therefore, is that there was never any such attempt to evade ABSD in the first place. 68 This impression was reinforced when the plaintiff was questioned on why he did not object to the evasion of ABSD after he became aware of the ramifications. His explanation was that “[the first defendant and him] were no longer together at that point in time”. The nonchalant response can only be understood as a concession that there was no credible explanation. It is a flippant excuse that is entirely at odds with the gravity of the circumstances. The inference, again, is that there was never any illegality to begin with. 69 Accordingly, I find that the premise of the 28 September 2020 Letter and 14 October 2020 Letter, that the Trust Deed was executed for the purpose of holding the Trust Property on trust for the second defendant, was the true position. The plaintiff’s arguments 70 Finally, I turn to address two arguments advanced by the plaintiff to demonstrate that the first defendant and him did not intend to abide by the terms of the Trust Deed. 71 The first is that the first defendant contemplated the sale of the Trust Property following disciplinary proceedings that were purportedly brought against her which caused her to resign from SingHealth. The plaintiff relies on several WhatsApp messages dated 11 April 2018 (“the WhatsApp Messages”) between the first defendant and him which purportedly show that the first defendant intended to sell the Trust Property in order to obtain $20,000 to invest in Saudara Clinic. I reproduce the relevant messages from the first defendant below: 3:24pm Can check w Marcus start of tenancy and update abt potential buyers … 3:34pm We overshot the budget for clinic. Selling 70 will return my 20k back to pump to clinic. Really hope Marcus is for real. 72 The first defendant explained that the WhatsApp Messages were written because she was upset that the plaintiff did not take responsibility for the finances of Saudara Clinic as a fellow shareholder (see [6] above). She was thus goading him to sell the Trust Property because she wanted him to “do something” aside from just “talking”. The first defendant testified that it was “ludicrous for [her] to honestly want to sell a [$]1.5 million property for the [$]20,000”. She also added that it would not make sense to sell the Trust Property in 2018, as the Trust Property would attract seller’s stamp duty if it was sold less than four years from the date of purchase in 2015. I find her explanation to be credible and accept it. 73 More fundamentally, for the plaintiff’s allegation to have any foundation, it must be first shown that disciplinary proceedings were brought by SingHealth against the first defendant. The plaintiff has failed to do this. In fact, he conceded in cross-examination that he has no evidence to support his assertion. In any event, the plaintiff’s allegations are inconsistent with the testimonial provided by Mr Adrian Ee, the Chief Executive Officer of SingHealth, dated 1 September 2020 (“the Testimonial”). The Testimonial makes no mention of any disciplinary proceedings. Instead, it contains an exemplary assessment of the first defendant in the following terms: … … She has served with distinction in various roles covering service, education, research and most significantly leadership as Clinic Director, SingHealth Polyclinics – Bedok from 2012 to 2018. … Dr Juliana has been an invaluable team member and an effective leader, and she is best recognised for her contribution to the growth of the organization and her staff, a Mentor and Educator. 74 Further, the first defendant had begun looking for a suitable space for Saudara Clinic on or about 11 March 2018 and incorporated Saudara Clinic on 3 April 2018. She served notice on SingHealth on 15 April 2018 before leaving on 15 July 2018. It is clear from this timeline that the first defendant only left SingHealthafter taking the necessary steps to set up Saudara Clinic. This indicates that she had planned to leave SingHealthto pursue her own plansrather than because of any pressure to resign. Further, it is pertinent that the first defendant had not tendered resignation from SingHealth when the WhatsApp Messages were sent on 11 April 2018. If she really needed $20,000 for Saudara Clinic, she could very well have continued working until she had the required funds, rather than sell the Trust Property for that purpose. Her monthly income of about $20,000 would have been adequate to meet the $20,000 that she needed for Saudara Clinic. Selling the Trust Property to raise $20,000 would thus have been a disproportionate and excessive measure. 75 The second argument by the plaintiff is that the first defendant’s reminder to him on 11 April 2018 to include the rental income of the Trust Property in his income tax filing, was evidence that the “[Trust Property] is the plaintiff’s property”. Contrary to the plaintiff’s assertion, I find that the first defendant’s reminder is consistent with Clause 5(d) of the Trust Deed (see [13] above), which provides that the trustees are to “pay all … taxes … for or on account of the [Trust Property] or any part thereof”. 76 Section 31(1) of the Income Tax Act 1947 (2020 Rev Ed) provides that the income of a trust shall be deemed to be the income of the settlor until the beneficiary attains 21 years of age: Income arising from settlements 31.—(1)  Where under the terms of any settlement and during the life of the settlor any income, or assets representing it, will or may become payable or applicable to or for the benefit of any relative of the settlor and at the commencement of the year of assessment such relative is unmarried and has not attained 21 years of age, such income or assets are deemed to be income of the settlor and not income of any other person. 77 As the second defendant was under 21 years old when the reminder was sent, the first defendant was correct to have reminded the plaintiff to declare the rental income from the Trust Property as part of his income. Thus, the plaintiff’s declaration of the rental income under his own income tax filing was in keeping with his role as trustee of the Trust Property and was not evidence that the Trust Property belonged beneficially to him. 78 The plaintiff has therefore failed to demonstrate a common intention that the Trust Deed was entered into to evade ABSD. In the absence of evidence of a common intention to mislead, the court will simply construe an agreement according to the actual objective intention of the parties:ChngBee Khengat [52]. In this case, the objective intention of the plaintiff and first defendant as captured in the terms of the Trust Deed is consistent with their conduct subsequent to the execution of the Trust Deed. From the evidence before me, I find that the Trust Deed was executed pursuant to a common intention of the plaintiff and first defendant to purchase the Trust Property on trust for the second defendant and not to evade ABSD. This is entirely consistent with responsible parents wanting the best for their children.",
        "Issue 2": "79 In view of my conclusion that the Trust Deed isbona fide,it follows that none of the four pleaded grounds that the plaintiff has raised at [15] above is factually sustainable. For the reasons provided at [24]–[29] above, none of these four pleaded grounds is consistent with my finding that the Trust Deed was executed to benefit the second defendant. It would also follow that the allegation of illegality fails. Accordingly, the plaintiff’s pleaded relief of setting aside the Trust Deed and the consequential declarations set out at [20] above should not be granted.",
        "Issue 3": "80 Finally, I turn to consider the defendants’ counterclaim to have the plaintiff removed as a trustee of the Trust Property. 81 The test for whether a trustee should be removed is whether the trustee has acted in a manner “such as to endanger the trust property to [show] a want of honesty, or a want of proper capacity to execute [his or her] duties, or a want of reasonable fidelity”:Yusof bin Ahmadand others v Hongkong Bank (Singapore) Ltd and others[1990] 1 SLR(R) 369 at [10]. 82 Given that the thrust of the plaintiff’s case is that (a) the Trust Deed was entered into for the purpose of evading ABSD, and (b) the Trust Property was therefore the first defendant’s and his, it is unsurprising that he has acted in breach of his duties as a trustee of the Trust Property in bringing and pursuing the present action. In doing so, the plaintiff has demonstrated a want of reasonable fidelity in executing his duties as a trustee. Moreover, the plaintiff has placed his personal interests in actual conflict with the second defendant’s interests as a beneficiary. Apart from the obvious point that the plaintiff’s claim to the Trust Property is in direct conflict with the second defendant’s claim as the sole beneficiary, his repeated demands for a half share of rental proceeds from the Trust Property are also in direct breach of Clause 5 of the Trust Deed (reproduced at [13] above) which states that the “collection of rental income [is] to be used for the welfare and benefit of the Beneficiary”. 83 Accordingly, I find that the plaintiff is unsuitable to be a trustee of the Trust Property and exercise my discretion to remove him.",
        "Conclusion": "84 For all the above reasons, I dismiss the plaintiff’s claim and allow the defendants’ counterclaim. I invite submissions on costs, including quantum, which are to be filed within 14 days from the date hereof, limited to 5 pages each. Kannan RameshJudge of the High Court Mohamed Hashim bin Abdul Rasheed,  Sofia Bennita Mohamed Bakhash and Sean Muhammad Marican (A Mohamed Hashim) for the plaintiff; Salem Ibrahim, Bernice Goh and Rebecca Yeo (Salem Ibrahim LLC) (instructed), Kirindeep Singh, Toh Wei Qing Geraldine and Shim Eunkyung (Dentons Rodyk & Davidson LLP) for the defendants.",
        "": ""
    }
}