{
    "case_title": "Alternative Advisors Investments Pte Ltd and anothervAsidokona Mining Resources Pte Ltd and another",
    "ncitation": "[2022] SGHC 41",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 In this suit, the first plaintiff, Alternative Advisors Investments Pte Ltd (“AAI”), claims the outstanding sum and interest due and owing from the defendants pursuant to a S$2m loan granted to the first defendant, Asidokona Mining Resources Pte Ltd (“Asidokona”), and personally guaranteed by the second defendant, Soh Sai Kiang (“Mr Soh”). The loan was extended by the second plaintiff, Supreme Star Investments Ltd (“SSI”), in 2016. In 2018, SSI assigned the loan to AAI. 2 The defendants do not dispute receipt of the loan amount and making certain repayments. They resist the claim on numerous grounds. That said, a core aspect of the pleaded defence – that the loan is a personal loan to Mr Soh, and not a corporate loan to Asidokona – was not pursued at the trial. With this late change in position, many factual disputes fall away. Specifically, allegations attacking AAI’s witnesses for forcing Mr Soh into accepting a last-minute increase to the interest rate, and of forgery and fabrication of the corporate loan and personal guarantee documents (after Mr Soh allegedly signed on blank pages merely to effect the personal loan to him), are abandoned. None of AAI’s witnesses were cross-examined on such matters. Instead, at the close of AAI’s case, the defendants submitted that there is no case to answer and elected not to adduce any evidence. 3 Having considered the parties’ submissions and the evidence before me, I grant judgment in favour of the plaintiff. These are my reasons.",
        "Background": "",
        "The parties and other personalities": "4 AAI is a company registered in Singapore. As an independent boutique advisory firm, it is in the business of providing professional services to companies and investors. Mr Wong Joo Wan (“Mr Wong”) is the managing director of AAI.1Foot Note 1×Wong Joo Wan’s Affidavit of Evidence-in-Chief (“AEIC”) dated 5 March 2020 (“WJWA”) at para 3.Mr Wong is a chartered accountant, and an insolvency practitioner by profession.2Foot Note 2×Transcript dated 1 September 2021 at p 16, lines 5–6. 5 SSI is an investment holding company incorporated in the British Virgin Islands (“BVI”).3Foot Note 3×WJWA at para 4.Ms Lou Swee Lan (“Ms Lou”), also known as Stephanie, is the sole shareholder and director of SSI.4Foot Note 4×Lou Swee Lan’s AEIC dated 26 July 2021 (“LSLA”) at para 1.On 1 November 2019, SSI was struck off the BVI Register of Companies.5Foot Note 5×Wong Joo Wan’s Affidavit in HC/SUM 1629/2020 dated 6 April 2020 at para 9.After SSI was restored to the BVI Register of Companies on 23 July 2021,6Foot Note 6×Agreed Bundle of Documents (“AB”) (Vol 4) at p 174.it did not take any active steps to participate in the action. 6 Ms Lou and her husband, Mr Wong Koon Lup, also known as William (“Mr William Wong”), were clients of Mr Ong Su Aun Jeffrey (“Mr Ong”), the former managing partner of JLC Advisors LLP (“JLC Advisors”).7Foot Note 7×Ong Su Aun Jeffrey’s AEIC dated 7 July 2021 (“JOA”) at para 10.SSI was also a client of Mr Ong. According to AAI, in relation to the loan transaction, at all material times, Mr Ong was authorised to act as SSI’s solicitor, while Mr Wong was authorised to act as SSI’s agent.8Foot Note 8×WJWA at paras 2, 9 and 10; Wong Joo Wan’s Supplementary Affidavit dated 26 July 2021 (“WJWSA”) at para 6.The defendants, however, dispute the authority of Mr Ong and Mr Wong to represent SSI. 7 Turning to the defendants, Asidokona is a company registered in Singapore and is in the business of mining activities. Mr Soh, also known as Philip, is the sole director and shareholder of Asidokona. He is an experienced banker and businessman.9Foot Note 9×WJWA at paras 5–7.Mr Wong and Mr Soh are old acquaintances.",
        "Circumstances surrounding the loan": "8 According to Mr Wong, sometime in or around June 2016, Mr Soh contacted him to ask if he could assist to arrange a loan of S$2m to Asidokona for the purpose of funding its working capital. Mr Wong informed Mr Soh that he would reach out to Mr Ong as he was aware that Mr Ong had clients who may be willing to extend such a loan to Asidokona.10Foot Note 10×WJWA at paras 11–12. 9 When Mr Wong contacted Mr Ong, he was told that Mr Ong’s client, whom Mr Ong described as the “Hong Kong side”, was prepared to contribute only 50% of the loan amount,ie,S$1m. Further, Mr Ong’s client would like to “take charge” of the loan. As for the terms of the loan, it would be for three months with 5% interest per month coupled with security for the loan.11Foot Note 11×WJWA at para 13. 10 Mr Wong decided that he would personally contribute towards the remaining 50% of the loan,ie,S$1m. On or around 30 June 2016, Mr Wong updated Mr Soh of the outcome of his discussion with Mr Ong. On or around 4 July 2016, Mr Soh confirmed that he would proceed with the loan.12Foot Note 12×WJWA at para 14.Following Mr Soh’s confirmation that Asidokona would proceed with the loan, Mr Wong informed Mr Ong to prepare the necessary documents for the loan.13Foot Note 13×WJWA at para 16. 11 On 18 July 2016, at 5.10pm, Mr Ong sent the following email to Mr Soh (copying Mr Wong) regarding “Project Gold”:14Foot Note 14×AB (Vol 1) at p 236. Dear Phillip Please find attached the draft loan documentation in respect of the $2 million loan for your review and confirmation. Briefly, the loan is guaranteed by you personally and a share charge shall be lodged against the share capital of [Asidokona] and blank share transfer forms shall be held in escrow pending the repayment of the loan. Kindly let us know should you have any comments. RegardsJeffrey Ong The documents attached were a power of attorney between Mr Soh and SSI (“Power of Attorney”), a deed of charge between Mr Soh and SSI of the shares in Asidokona (“Deed of Charge”), an instrument of transfer for the transfer of the shares in Asidokona from Mr Soh to a corporate buyer (“Share Transfer Form (corporate buyer)”), an instrument of transfer for the transfer of the shares in Asidokona from Mr Soh to an individual buyer (“Share Transfer Form (individual buyer)”), directors’ resolutions in writing passed pursuant to article 90 of Asidokona’s Articles of Association (“Board Resolutions”) and a personal guarantee between Mr Soh and SSI (“Personal Guarantee”). 12 On 19 July 2016 at 8.18am, Mr Soh replied to Mr Ong’s email highlighting that the draft loan agreement was not attached.15Foot Note 15×AB (Vol 1) at p 293.In response, at 10.38am, Mr Ong sent Mr Soh (copying Mr Wong) the draft loan agreement between Asidokona and SSI (“Loan Agreement”).16Foot Note 16×AB (Vol 1) at p 293.On 21 July 2016, Mr Soh decided to “sign off” on 22 July 2016 and confirmed the following with Mr Wong through WhatsApp messages:17Foot Note 17×AB (Vol 2) at pp 130–132 and 135. Mr Soh: Shall we sign off tom mrg at 1030am? Mr Wong: …I can’t be there and in any event, Jeff is handling. I have to conduct a training… ... Spoke to [Jeff]. All ready for tmr. Cheque release tmr after 2 pm. Can I take it that the interest is returned to investors immediately and they only hound me close to 3 mths period? Mr Soh: Basically.We will return 2 million based on 1.7 million. If we need to extend after 3 months we will continue to pay the 100k interest.Extension is up to 3 months. As per my understanding. Mr Wong: Yup. The hope is we get the CB in before 3 mths. No need to waste the interest. Rather we start the full productions as the earnings is impt. Mr Soh:Ok. As what we agreed bro … Can Jeff side do [telegraphic transfer] to us tom? Mr Wong: Yes But via cheque Mr Soh: Use uob cheque. Can? Mr Wong: They using DBS. If u want.. they can release in 2 cheques.. $1.1m and $600k. $1.1 m morning ok. Mr Soh:Ok. We do it this way. 2 cheques [emphasis added] Thus, the common understanding was that Mr Ong was to transfer only S$1,700,000 as the remaining S$300,000 was to be used for the interest payment for three months at the rate of 5% a month as set out in the draft loan agreement.18Foot Note 18×WJWA at para 26. 13 Meanwhile, Mr Ong informed Ms Pok Mee Yau (“Ms Pok”), also known as Karen, that Mr Soh would attend at the JLC Advisors’ office to sign the loan documents. Ms Pok was previously a partner of JLC Advisors. She had drafted the documents attached to Mr Ong’s emails to Mr Soh dated 18 and 19 July 2016 (as mentioned at [11]–[12]), which I shall refer to collectively as the “Loan Documents”. Mr Ong requested Ms Pok to attend to the signing by Mr Soh as he would be occupied then.19Foot Note 19×Pok Mee Yau’s AEIC dated 17 March 2020 (“PMYA”) at paras 1 and 3–6. 14 According to Ms Pok, on 22 July 2016, Mr Soh attended at the JLC Advisors’ office in the morning. Ms Pok introduced herself to Mr Soh as a partner of JLC Advisors. During the meeting which took about 25 minutes, Ms Pok flipped through the relevant documents and briefly explained them to Mr Soh. Ms Pok also told Mr Soh that he could take his time to review the documents before signing and he informed her that he was ready to sign. Ms Pok then asked Mr Soh to sign on the execution pages.20Foot Note 20×PMYA at paras 10–12.Mr Soh did so.21Foot Note 21×WJWA at pp 1172–1204 and 1205–1237; pp 1238–1255 and 1256–1273; pp 1274–1300 and 1301–1327; pp 1328–1332 and 1333–1337; pp 1338–1339; and pp 1340–1343.After Mr Soh had signed the documents, Ms Pok stamped her name and profession and signed in the signature block as the witness for the Loan Agreement, Personal Guarantee, Deed of Charge and Power of Attorney.22Foot Note 22×PMYA at para 13. 15 I should point out that the defendants plead an entirely different version of events. In particular, the defendants aver that, at all times, the loan was meant to be personal to Mr Soh at an interest rate of 3% per month. Mr Ong and Mr Wong, who were present at the meeting at JLC Advisors on 22 July 2016, essentially compelled Mr Soh to agree to an increase of the interest rate from 3% to 5% per month. Due to his urgent need for funds, Mr Soh agreed. Further, as Mr Soh was informed by a female staff that the agreements were not ready for his perusal, out of trust, he signed off on blank pages.23Foot Note 23×Asidokona’s Defence (Amendment No 4) at paras 8–9; Mr Soh’s Defence (Amendment No 4) at paras 8–9.It is patently clear to me that this account is completely unbelievable. Even if one were to disregard the evidence of Mr Wong, Mr Ong or Ms Pok, the defendants’ version is completely undermined by the wealth of objective evidence in the form of the contemporaneous communications between the parties (including some crucial pieces which I have referred to in [11]–[12] above). As I observed at [2] above, at the trial, the defendants dropped these challenges.",
        "The Loan Agreement, Personal Guarantee and the Deed of Charge": "16 Turning to the Loan Agreement, the key terms are as follows:24Foot Note 24×Plaintiff’s Bundle of Documents Volume 1 (“1PBD1”) at pp 1–66. (a) by the preamble read with Item 5 of Schedule 1, SSI is the lender, Asidokona is the “Borrower” and Mr Soh is the “Guarantor”;(b) by cl 2 read with Items 2 and 3 of Schedule 1, the “Principal Amount” of the loan is S$2m for an “Initial Term” of three months from the “Drawdown Date”. By cl 1.1, the Drawdown Date is “the date on which the Loan is disbursed, or is to be disbursed by the Lender to the Borrower”;(c) by cl 6.1 read with Items 11, 12 and 13 of Schedule 1, the “Interest” is “5% per month accruing on a daily basis from the commencement of the Initial Term” to be paid on the last day of each Interest Period (being one month) beginning from the Drawdown Date;(d) by cl 7.1, if the Borrower does not pay any amount it is obliged to when it is due, the Borrower shall pay interest on the unpaid amount outstanding “for the period beginning on its due date and ending on the date the Lender receives it, both before and after judgment”. Item 14 of Schedule 1 provides that such “Default Interest” is “6% per month accruing on a daily basis”;(e) by cl 3 read with Item 9 of Schedule 1, the “Security Documents” comprise of a charge on shares (the “Charged Shares”), share transfer forms in respect of the Charged Shares, a power of attorney, personal guarantee, and three cheques for certain amounts for the repayment of the loan; and(f) by cl 3 read with Item 8 of Schedule 1, the Charged Shares comprise 500,000 ordinary shares, representing 100% of the issued and paid up capital of Asidokona. 17 In the Personal Guarantee furnished by Mr Soh, pursuant to cl 1.1 read with cl 2.1(b), Mr Soh guaranteed that should Asidokona not pay any amount when due under or in connection with the Loan Agreement, Mr Soh would immediately on demand pay that amount to SSI as if he was the principal obligor up to the secured amounts, being the principal sum of S$2m, “all legal costs and other costs, charges and expenses whatsoever (on a full indemnity basis) and interest” accrued on the same. By cl 3, should Mr Soh not make any payment of any sum due and owing under the Personal Guarantee, he shall, to the extent permitted by law, pay interest on such amount due from and including the due date to the date of actual payment (whether before or after judgment) at 6% per month accruing on a daily basis.25Foot Note 25×1PBD at pp 67–102. 18 As for the Deed of Charge, by cll 1.1 and 2, as well as the Recital (D) of the Preamble, Mr Soh agreed to charge 100% of the entire shareholding in the issued and paid-up capital of Asidokona to SSI by way of a first fixed charge for due performance and discharge of all his obligations arising under the Loan Agreement. By cl 4, Mr Soh is to deliver to SSI the share certificates for the Charged Shares, together with two share transfer forms executed in blank, and a certified true copy of the Register of Members of Asidokona duly noting that the shares are subject to the charge.26Foot Note 26×1PBD at pp 103–156.",
        "Disbursement of the loan and contributions towards the loan amount": "19 On 22 July 2016, the S$2m loan was fully disbursed by DBS cheques dated the same date for S$1.1m and S$590,000 to Asidokona. Apart from the actual disbursement of S$1.69m, interest for three months of S$300,000 and transaction expenses of S$10,000 under cl 9.2 of the Loan Agreement were accounted for.27Foot Note 27×AB (Vol 1) at pp 205–206; WJWA at paras 57–58. 20 Of the S$2m principal sum, Mr Wong contributed a total of S$1m to SSI.28Foot Note 28×WJWA at para 68.Mr Wong contributed S$500,000 of his own money, and approached some other people to extend personal loans to him to raise the remaining S$500,000 as follows:29Foot Note 29×WJWA at paras 64–65. (a) S$200,000 from Lee Thiam Seng, a director in Ecowise Holdings Limited which has an office located one floor above AAI’s office;(b) S$100,000 from Aveline Chen, a tenant in Mr Wong’s office;(c) S$100,000 from Wilson Chua, Mr Wong’s colleague in AAI; and(d) S$100,000 from Mr Yong Chor Ken (“Mr Yong”), Mr Wong’s colleague, director and shareholder of AAI. Due to the time constraints, Mr Wong told the four parties to make payments directly to the JLC Advisors’ clients’ account. Mr Wong has since repaid everyone for the full sums except for Mr Yong’s S$100,000.30Foot Note 30×WJWA at paras 67 and 69.As for Mr Ong’s client, the “Hong Kong” investor contributed the remaining sum of S$1m. More will be said about this from [27] below.",
        "Asidokona’s default in repaying the loan": "21 As the loan was disbursed on 22 July 2016, the Initial Term of the loan expired on 21 October 2016. This was the common understanding among Mr Wong, Mr Soh and Mr Ong. According to Mr Wong, in accordance with cl 2 read with Item 3 of Schedule 1, Asidokona was granted an extension of the loan by a further three months to 21 January 2017. Thereafter, Mr Wong alleged that Asidokona unilaterally extended the loan on multiple occasions.31Foot Note 31×WJWA at para 73. 22 In October 2016, via a series of WhatsApp exchanges with Mr Wong, Mr Soh confirmed that he would renew the Loan Agreement on a “month to month basis”. As regards the interest payment, Mr Soh also agreed with Mr Wong’s confirmation that the interest payment liable would be S$100,000.32Foot Note 32×AB (Vol 2) at pp 156–157; AB (Vol 1) at pp 341–342.Mr Soh stated that “[w]e will still pay interest. 5 per cent per month”.33Foot Note 33×AB (Vol 2) at p 186.Further, on 5 March 2017, Mr Soh also confirmed that “[i]n terms of interest … [w]e will not dispute. Sin 100k …” and that he was of the view that “[they] should be [paying off the loan] by mid March as paper work delay due to [his] hospitalisation”.34Foot Note 34×AB (Vol 2) at pp 252–253. 23 According to AAI, during the period between July 2016 and May 2017, Asidokona made various interest payments to SSI aggregating S$900,000.35Foot Note 35×WJWA at para 134; AB (Vol 4) at p 90.The defendants do not dispute making payments amounting to S$900,000. However, they plead that these were repayments towards the loan (not interest), and that the repayments were not made to SSI. 24 In any event, Asidokona failed to comply fully with its payment obligations under the Loan Agreement.36Foot Note 36×WJWA at para 73.As of 15 May 2017, Asidokona failed to redeem the loan and SSI issued a statutory demand (through its solicitor Mr Ong) to Mr Soh for the sum of S$2,128,904 on the same date.37Foot Note 37×AB (Vol 4) at pp 85–88; WJWA at para 109.Between the period from end June 2017 to March 2018, Mr Soh reassured Mr Wong that Asidokona would repay the loan and interest. However, nothing materialised.38Foot Note 38×WJWA at paras 114–120.Thus, SSI’s position is that it is clear from the correspondence that Mr Soh had “repeatedly admitted Asidokona’s liability under the Loan Agreement”.39Foot Note 39×WJWA at para 122.",
        "The assignment of SSI’s rights to AAI": "25 According to Mr Wong, in and around March 2018, Mr Ong expressed to Mr Wong SSI’s disappointment and frustration with the empty promises made by the defendants. As the loan was referred to SSI by Mr Wong, Mr Wong decided to arrange for AAI to take over the loan from SSI to “manage the direction forward in recovering the loan debt”. Since Mr Wong had personally invested moneys to fund the loan for Asidokona and Mr Yong had indirectly contributed to the loan (as mentioned at [20] above), both Mr Yong and Mr Wong have an interest in the repayment of the loan. Thus, Mr Yong and Mr Wong decided that their company, AAI, would be the assignee of the Loan Agreement, Personal Guarantee and Deed of Charge. In that respect, Mr Wong “irrevocably assigned [his] interest of S$1,000,000 from SSI to AAI”. The arrangement pursuant to the assignment was that after the payment of costs, any sums recovered from the present proceedings are to be repaid to AAI and SSI in equal proportions. Thus, there is “no avenue for AAI to profit from these proceedings”.40Foot Note 40×WJWA at paras 128–129. 26 On 30 March 2018, all rights under the Loan Agreement and the Personal Guarantee were assigned from SSI to AAI (the “First Deed of Assignment”), notice of which was given to Asidokona and Mr Soh on 28 August 2018.41Foot Note 41×Plaintiff’s Core Bundle (“PCB”) at pp 1–5; AB (Vol 1) at pp 232–233.However, due to an oversight, the Deed of Charge was not assigned from SSI to AAI under the First Deed of Assignment. The Deed of Charge was assigned only on 15 November 2018 (the “Second Deed of Assignment”), notice of which was likewise given on the same date.42Foot Note 42×PCB at pp 6–11; AB (Vol 1) at pp 232–233.In relation to the two deeds of assignments which I shall refer to as the “Deeds of Assignments”, Mr Wong signed on behalf of SSI and Mr Yong signed on behalf of AAI.",
        "The source of the remaining S$1m": "27 According to Mr Wong, it was also only “during the assignment that [Mr Wong] found out from [Mr Ong] that the Hong Kong investor is [Ms Lou]”. At the time of signing the Loan Agreement, Mr Wong did not know the identity of the “Hong Kong” investor (see [9] above).43Foot Note 43×WJWA at para 70.As such, Mr Wong referred to the other funder for the loan as the “HK” lender in his communications with Mr Soh at the material time.44Foot Note 44×See,eg, AB (Vol 2) at pp 123–124, 301, 318. 28 After Mr Wong became aware that the Hong Kong investor was in fact Ms Lou, Mr Wong called up Mr William Wong (ie, Ms Lou’s husband) sometime in June or July 2018. During that call, Mr William Wong confirmed that SSI had sufficient moneys in July 2016 to fund the loan, that Mr Wong could sign off on the Loan Documents on behalf of SSI, and that Mr Wong could initiate a suit against the defendants.45Foot Note 45×WJWSA at para 10–11. 29 Indeed, on 22 July 2016, when Mr Soh signed the Loan Documents, SSI did not execute them. Around the time of the assignment from SSI to AAI, this was discovered by Mr Wong. Based on what Mr William Wong communicated, Mr Wong executed the Loan Documents on behalf of SSI.46Foot Note 46×Transcript dated 1 September 2021 at p 21, lines 13–21.This was witnessed by Mr Ong.47Foot Note 47×JOA at para 28. 30 Mr Ong’s evidence is broadly consistent with Mr Wong’s account. In particular, Mr Ong also referred to Ms Lou as the “Hong Kong” investor.48Foot Note 48×JOA at para 16.According to Mr Ong, he referred to Ms Lou as such because “Mr William Wong and [Ms Lou] preferred to remain anonymous” behind SSI. Mr Ong remained the “point of contact” at all material times between Mr Wong and SSI. Ms Lou wanted to be a “‘sleeping’ contributor” and was “content to have the [l]oan administered by [Mr Wong] and/or his nominees” for SSI. In that regard, Ms Lou and SSI had “expressly authorised [Mr Wong] to act as SSI’s principal and agent”.49Foot Note 49×JOA at paras 16–17.In his testimony, Mr Ong clarified that Mr William Wong was “the primary person who is in charge of the group of funds and William is based in Hong Kong”. Ms Lou and Mr William Wong were “often in Hong Kong” and they “often remit funds from Hong Kong”.50Foot Note 50×Transcript dated 3 September 2021 at p 18.Mr Ong confirmed that the remaining sum of S$1m extended to Asidokona was deducted from the pool of funds which Mr William Wong and Ms Lou maintained in JLC Advisors’ client account.51Foot Note 51×Plaintiff’s Closing Submissions at para 84; Transcript dated 3 September 2021 at p 27, lines 1–18. 31 In an interesting twist, Ms Lou denied that she knew about the Loan Documents or that SSI had authorised the same to be entered into at the material time. In a slightly incoherent fashion, she nevertheless said that she understood that Mr Ong was acting for SSI in relation to the Loan Documents.52Foot Note 52×LSLA at para 9.Ms Lou deposed that since she had “no idea of the Loan Agreement at the material time”, the issue of the source of funds for the same is “best answered by Mr. Jeffrey Ong”.53Foot Note 53×LSLA at para 12.In due course, I shall discuss Ms Lou’s evidence in more detail.",
        "The proceedings": "",
        "AAI’s claim": "32 On 20 July 2018, this action was filed by AAI in its capacity as the equitable assignee of the loan, and as the only plaintiff in the action.54Foot Note 54×WJWSA at paras 10–12.AAI’s claim against the defendants is straightforward. While there was one round of amendments to the Statement of Claim on 8 February 2019 (the “Amended Statement of Claim”), the case remained substantially unchanged. 33 In essence, AAI avers that Asidokona is “in default of its payment obligations under the Loan Agreement”. Therefore, AAI claims against Asidokona for:55Foot Note 55×Statement of Claim (Amendment No 1) at para 27 and pp 23–24. (a) the outstanding principal sum due under the Loan Agreement;(b) the interest due under the Loan Agreement payable under cl 6.1 of the Loan Agreement (read with Schedule 1);(c) the default interest due under the Loan Agreement payable under cl 7.1 of the Loan Agreement (read with Schedule 1);(d) alternatively, interest assessed pursuant to s 12 of the Civil Law Act 1909 (2020 Rev Ed) (“CLA”) on such sums as may be found payable to AAI; and(e) costs on an indemnity basis pursuant to cl 10 of the Loan Agreement. 34 Based on the Personal Guarantee and the Deed of Charge, AAI claims against Mr Soh for: (a) the outstanding principal sum due under the Loan Agreement;(b) the interest due under the Loan Agreement payable under cl 6.1 of the Loan Agreement (read with Schedule 1);(c) the default interest due under the Loan Agreement payable under cl 7.1 of the Loan Agreement (read with Schedule 1) from 22 June 2017;(d) alternatively, interest assessed pursuant to s 12 of the CLA on such sums as may be found payable to AAI;(e) an order for delivery up of:(i) all share certificates representing the Charged Shares;(ii) two share transfer forms duly executed by Mr Soh, in blank, in respect of the Charged Shares; and(iii) a certified true copy of the Register of Members of Asidokona duly annotated by the company secretary of Asidokona to note that the Charged Shares are the subject of a charge in favour of AAI; and(f) costs on an indemnity basis pursuant to cl 2.1 of the Personal Guarantee.",
        "The defendants’ original Defences, and the first and second round of amendments": "35 The defendants made four rounds of amendments to their original Defences, on 30 August 2018, 22 February 2019, 18 September 2020 and 22 July 2021 respectively. 36 From the outset, the defendants deny that the loan was between SSI and Asidokona. Instead, they aver that the loan was between Mr Wong and Mr Soh in their personal capacities only “for a short term” at an interest of only 3% per month.56Foot Note 56×Asidokona’s Defence (Amendment No 4) at para 8; Mr Soh’s Defence (Amendment No 4) at para 8.In that regard, payments made (totalling S$900,000) in repayment of the principal amount and/or interest werenevermade to SSI and one payment of S$50,000 was made to Mr Ong’s personal bank account.57Foot Note 57×Asidokona’s Defence (Amendment No 4) at para 13; Mr Soh’s Defence (Amendment No 4) at para 13.It was only at the signing on 22 July 2016 at the office of JLC Advisors that Mr Wong insisted for the interest to be increased to 5% per month.58Foot Note 58×Asidokona’s Defence (Amendment No 4) at para 9(b); Mr Soh’s Defence (Amendment No 4) at para 9(b). 37 The defendants contend that AAI/SSI is in breach of s 3 of the Moneylenders Act 2008 (2020 Rev Ed) (the “MLA”), as AAI/SSI “seeks to claim a sum … which is significantly larger than the sum … ‘lent’”. Also, AAI/SSI is not an “excluded moneylender” under s 2 of the MLA as it lent the money to Mr Soh, and not Asidokona. Relying on ss 2, 3, 5 and 14, the defendants contend that the Loan Agreement and Personal Guarantee fall foul of the MLA and are unenforceable.59Foot Note 59×Asidokona’s Defence (Amendment No 4) at paras 16–17; Mr Soh’s Defence (Amendment No 4) at paras 17–18.This is the “Illegal Moneylending Defence”. 38 Further, the interest rates under the Loan Agreement are unconscionable, and the interest clauses are unenforceable penalty clauses at law. Consequently, the interest provisions of the Personal Guarantee and Deed of Charge are also unenforceable.60Foot Note 60×Asidokona’s Defence (Amendment No 4) at para 18; Mr Soh’s Defence (Amendment No 4) at para 19.I shall refer to this as the “Penalty Clause Defence”. 39 In any event, the defendants also plead that default interest should only take effect after March 2018 (and not from 22 June 2017). This is based on AAI’s position that “SSI was not agreeable to any further extension … beyond March 2018” of the loan.61Foot Note 61×Asidokona’s Defence (Amendment No 4) at para 19; Mr Soh’s Defence (Amendment No 4) at para 20. 40 In the first round of amendments, in support of the Illegal Moneylending Defence, the defendants introduced their version of what happened at the meeting on 22 July 2016 at the office of JLC Advisors. 41 In the second round of amendments, the defendants allege that the First Deed of Assignment,ie,the assignment of the Loan Agreement and the Personal Guarantee,is unenforceable as it falls foul of s 5A(2) of the CLA in that it savours maintenance and champerty.62Foot Note 62×Asidokona’s Defence (Amendment No 4) at para 12; Mr Soh’s Defence (Amendment No 4) at para 12.This is the “Maintenance and Champerty Defence”.",
        "The third round of amendments to the Defences": "42 On 26 November 2018, AAI applied under O 15 r 6 of the Rules of Court (2014 Rev Ed) (“ROC”) to join SSI as the second plaintiff to the action. This was to meet the defendants’ objection that as an equitable assignee, AAI may not proceed with the action without the presence of SSI. This application was granted on 7 February 2019, and SSI was joined as co-plaintiff to the action. 43 By about mid-2019, Mr Ong had run into trouble with the law. At the time of the trial, he was in remand for a range of criminal charges,inter alia,involving misappropriation of clients’ funds.63Foot Note 63×AB (Vol 4) at pp 169–172. 44 On 27 September 2019, the defendants applied for specific discovery against the plaintiffs for communications between Mr Wong and the fellow contributors towards the loan, including Ms Lou. The plaintiffs were ordered to provide further discovery by 5 November 2019. As set out above at [5] above, on 1 November 2019, SSI was struck off the BVI Register of Companies.64Foot Note 64×Wong Joo Wan’s Affidavit in HC/SUM 1629/2020 dated 6 April 2020 at para 9 and Exhibit WKW–49 at p 10.Upon the defendants’ application, on 17 March 2020, an unless order was made against the plaintiffs that the claim be struck out unless they comply with the specific discovery order by 7 April 2020. 45 One particular issue raised in the application was whether Mr Wong’s affidavitsboundSSI. On 21 March 2020, Mr Wong sent a WhatsApp message to Ms Lou to explain the developments in the proceedings, including the question of his authority to act for SSI, and offered Ms Lou three options in respect of the action:65Foot Note 65×AB (Vol 3) at pp 511–517. … At the assignment, Jeff passed me the loan agreement with the borrower. While the borrower side was signed, the lender being [SSI] was not. So I asked Jeff why do. He said that the HK side didn’t even know the details of the loan and have authorised me to sign off. The second document was the assignment of the loan to [AAI]. The agreement was that I would fund the litigation to recover the loan and when we succeed, half of the loan recovered less cost would be returned to SSI. I then enquired who is the owner of SSI. That was the first time I was told that you were the sole owner and sole director. I did at Jeff’s disclosure, call [Mr William Wong]. I asked him 3 things, namely does SSI have the funds to do the loan (in July 2016), I informed him that I signed the documents and lastly, I would commence the suit against the borrower. He replied that SSI should have sufficient funds to do this and ok to the other 2. With that a suit was commenced. Initially the plaintiff was Alternative Advisors Investment (my company). During the initial discovery process, the borrower challenged the assignment. So i instructed the lawyers to add SSI as the plaintiff. At no point was I even looking for cost from SSI and was prepared to fund this action. The hearing is fixed for May 2020. After 2 years of going thru discovery etc. The last hearing, the borrower challenged my authority of SSI. … …the judge during the discovery asked me to either confirm that I have authority to act for SSI or for the owner to file an affidavit to confirm SSI has no other documents requested. … along the way, I even asked [Mr William Wong] to keep SSI alive simply because SSI is a plaintiff and shouldnt be disposed. … My lawyers have essentially said there are 3 options: 1. If you as director or if u authorise [Mr William Wong] and he then authorise me, can confirm or rectify that I had the authority, the suit can continue. And also confirm that SSI has no other documents. 2. If u maintain that u knew nothing about the loan and I acted without authority, I respect your position … So if that is your position, I would discontinue the suit. But in doing so, both my lawyer and I would need your authority to file the notice of discontinuance. I will be liable for legal cost of the borrower. 3. If I cannot get your authority, then I can only file the notice of discontinuance for AAI but not SSI. … It is not my intention to have troubled u. It appears I trusted Jeffrey too much and relied on his representations. But I did check with William somewhat. [emphasis added]  46 By 31 March 2020, Ms Lou replied to Mr Wong, “Joo Wan, thank you for your note. I want to help you and I believe our lawyers are meeting to work out how I can help you”.66Foot Note 66×AB (Vol 3) at p 518. 47 Meanwhile, on 6 April 2020 (ie, just one day prior to the ordered deadline of 7 April 2020), AAI filed an appeal against the unless order. AAI submitted “it would have been impossible to comply with the 31 March 2020 Unless Order” given that SSI “had been struck off” by that point.67Foot Note 67×AAI’s Written Submissions in HC/RA 80/2020 dated 4 June 2020 at para 4.On 18 June 2020, the appeal was allowed. Justice Choo Han Teck held inAlternative Advisors Investments Pte Ltd and another v Asidokona Mining Resources Pte Ltd and another[2020] SGHC 125 that Mr Wong’s affidavits “expressly state that they were made on behalf of both plaintiffs and confirm that both plaintiffs do not have in their possession, custody or power the documents which the defendants seek”. Thus, it was not necessary to order that Ms Lou confirm that she and/or SSI are bound by Mr Wong’s affidavits, or that they do not have the relevant documents in their possession, custody or power (at [9]). As against AAI, the unless order was set aside (at [10]). Therefore, AAI’s claim survived. 48 On 18 September 2020, in the third round of amendments, the defendants allege for the first time that Mr Wong “had no authority to sign the Loan Agreement, the Personal Guarantee, [and] the Deed of Charge” on behalf of SSI.68Foot Note 68×Asidokona’s Defence (Amendment No 4) at para 9(l); Mr Soh’s Defence (Amendment No 4) at para 9(l).Prior to that, the defendants previously admitted that Mr Wong was “SSI’s principal”.69Foot Note 69×Asidokona’s Defence (Amendment No 2) at para 4; Mr Soh’s Defence (Amendment No 2) at para 4.The defendants aver that SSI did not authorise the Loan Agreement and Deeds of Assignments. I shall refer to this as the “Lack of Authority Defence”. 49 Relatedly, the defendants aver that the Loan Agreement and Personal Guarantee are tainted with illegality as part of the moneys used to disburse the loan were illegally obtained.70Foot Note 70×Asidokona’s Defence (Amendment No 4) at para 14; Mr Soh’s Defence (Amendment No 4) at para 15.In that regard, Ms Lou, the sole director and shareholder of SSI at all material times, did not advance S$1m to JLC Advisors. As such, the money used to fund the loan were other client moneys from JLC Advisors’ client accounts which was misappropriated by Mr Ong.71Foot Note 71×Asidokona’s Defence (Amendment No 4) at para 14; Mr Soh’s Defence (Amendment No 4) at para 15.I refer to this as the “Illegality Defence”. 50 Further, the defendants deny that the Deeds of Assignments are valid under s 4(8) of the CLA by reason of AAI’s and/or SSI’s failure to give written notice for the assignment to the defendants and are thus ineffectual. The defendants plead that AAI, as equitable assignee, cannot carry on the action when SSI is no longer a party to the action.72Foot Note 72×Asidokona’s Defence (Amendment No 4) at para 12(c); Mr Soh’s Defence (Amendment No 2) at para 12(c).I shall refer to this as the “Locus StandiDefence”.",
        "The fourth round of amendments to the Defences": "51 In early 2021, the parties applied for interrogatories against Ms Lou. In response to AAI’s interrogatories, Ms Lou stated that she had never appointed JLC Advisors to act for her or SSI. Ms Lou also stated that she was not the “HK investor” and was Singaporean.73Foot Note 73×Defendants’ Bundle of Relevant Cause Papers at p 282 (Ms Lou’s Answer to Interrogatories dated 3 March 2021 at para 4(a)).Ms Lou’s position was that SSI did not contribute to the loan to Asidokona74Foot Note 74×Defendants’ Bundle of Relevant Cause Papers at p 278 (Ms Lou’s Answer to Interrogatories dated 3 March 2021 at para 1(a)(iii)).and that she never maintained a pool of funds in JLC Advisors’ client account in her sole name or in joint names with her husband.75Foot Note 75×Defendants’ Bundle of Relevant Cause Papers at p 288 (Ms Lou’s Answer to Interrogatories dated 19 April 2021 at para 1(a)). 52 Subsequently, on 22 July 2021, the defendants introduced the fourth round of amendments to the Defences, and expressly disputed that SSI appointed JLC Advisors to act as SSI’s solicitors and that SSI authorised any moneys for the loan.76Foot Note 76×Asidokona’s Defence (Amendment No 4) at para 13A; Mr Soh’s Defence (Amendment No 4) at para 14.Up to the defendants’ third amendment to the Defences on 18 September 2020, the defendants averred that JLC Advisors “were the appointed solicitors of SSI at the material time” and the partner “assigned to SSI’s case was [Mr] Ong”.77Foot Note 77×Asidokona’s Defence (Amendment No 3) at para 14(d); Mr Soh’s Defence (Amendment No 3) at para 15(d).I shall include this as another aspect of the Lack of Authority Defence.",
        "The ratification, AAI’s Reply and SSI’s Rejoinder": "53 AAI disputes all of defences raised by the defendants. 54 On 23 July 2021, SSI was restored to the BVI Register of Companies.78Foot Note 78×AB (Vol 4) at p 174.Shortly thereafter, SSI passed certain director’s resolutions (ie, signed by Ms Lou) on 26 July 2021 ratifying and adopting in entirety the Loan Documents, the Deeds of Assignments, AAI’s commencement of the action, and the execution of the Loan Documents and Deeds of Assignments by Mr Wong on SSI’s behalf (the “Ratification”).79Foot Note 79×AB (Vol 4) at pp 179–180.A deed of undertaking was entered into between AAI, SSI and Ms Lou (the “Deed of Undertaking”) to provide for the arrangements for the Ratification, the funding of the action and the conduct of the action.80Foot Note 80×AB (Vol 4) at pp 341–345. 55 In response to the defendants’ contention that Mr Wong and Mr Ong lacked the authority to act for SSI, AAI relied on the Ratification.81Foot Note 81×Plaintiff’s Reply Closing Submissions at para 11.SSI’s ratification is “sufficient, in and of itself, to dispose of the [d]efendants’ averments that SSI did not authorise the execution and assignment of the Loan Documents”.82Foot Note 82×Plaintiff’s Closing Submissions at para 65. 56 In this regard, the defendants aver that SSI’s Ratification is invalid.83Foot Note 83×Asidokona’s Rejoinder at para 3; Mr Soh’s Rejoinder at para 3.I shall refer to this as the “Invalid Ratification Defence”.",
        "Issues to be determined": "57 As AAI highlights, AAI has clearly established that Asidokona took a loan of S$2m sometime in July 2016, Mr Soh personally guaranteed Asidokona’s obligation to repay the loan, and the defendants have not repaid the loan and interest in full to the present date.84Foot Note 84×Plaintiff’s Reply Closing Submissions at para 2.The defendants have essentially not adduced any evidence to dispute the above. 58 To deny liability for the claim, the defendants raise seven grounds. AAI challenges each one of them. Therefore, the issues to be determined are as follows:85Foot Note 85×Defendants’ Closing Submissions at para 24. (a) theLocus StandiDefence – whether AAI, as the equitable assignee, may proceed with the action against Asidokona and Mr Soh when SSI, the equitable assignor, is no longer a party to the action;(b) the Lack of Authority Defence – whether SSI authorised the Loan Agreement and Deeds of Assignments (which turns on whether Mr Wong or Mr Ong possessed the requisite authority from SSI to do so);(c) the Invalid Ratification Defence – whether the Ratification is valid in the circumstances so as to cure any lack of authority on the part of Mr Wong and or Mr Ong;(d) the Illegality Defence – whether AAI’s claim is tainted by illegality on the basis that part of the funds used to finance the loan were in fact misappropriated client moneys from JLC Advisors’ client accounts (and thus illegal funds);(e) the Maintenance and Champerty Defence – whether the Deeds of Assignments contravene s 5A(2) of the CLA on the basis that they savour maintenance and champerty;(f) the Illegal Moneylending Defence – whether the loan is an illegal moneylending transaction under the MLA; and(g) the Penalty Clause Defence – whether the interest clauses under the Loan Agreement amount to penalty clauses in law, which are unenforceable.",
        "The applicable legal principles upon a submission of “no case to answer”": "59 I will deal with the applicable law in relation to the issues in due course. At this juncture, I set out the legal principles where the defendants submit that there is no case to answer. 60 In relation to any cause of action pleaded by the plaintiff, the legal burden of proof lies on the plaintiff, and will only be discharged if the court is satisfied that the plaintiff has proved its pleaded case against the defendant on a balance of probabilities. 61 It is, however, always open to a defendant, having heard the evidence adduced on behalf of the plaintiff, to elect to call no evidence on the basis that the evidence put forth by the plaintiff is insufficient to transfer the evidential burden onto the defendant so that the plaintiff has failed to prove its case. Hence the expression, “no case to answer” (O 35 r 4(3) and O 110 r 3(1) of the ROC). While the legal burden rests on the plaintiff throughout the proceedings as the party making the claim against the defendant, the evidential burden can shift as the civil trial progresses. That evidential burden rests on the party on whom the responsibility lies to contradict, weaken or explain away the evidence that has been led (Ma Hongjin v SCP Holdings Pte Ltd[2021] 1 SLR 304 (“Ma Hongjin”) at [28]). 62 Crucially, the establishment of aprima faciecase by the plaintiff on a particular point on which it bears the legal burden denotes the point at which the evidential burden will shift to the defendant (Ma Hongjinat [30]). Following any shift in evidential burdenat the point that aprima faciecase against the defendant is established, the plaintiff would have succeeded in proving the case on abalance of probabilitiessince there is simply no evidence forthcoming from the defendant to disprove the plaintiff’s position or otherwise weaken the case against it (Ma Hongjinat [31]). 63 Thethresholdto succeed on a “no case to answer” submission is ahighone. InLena Leowardi v Yeap Cheen Soo[2015] 1 SLR 581 at [23]–[24], the Court of Appeal held that it is established law that a submission of “no case to answer” will only succeed if the evidence led by the plaintiff, at face value, does not establish a case in law or is so unsatisfactory or unreliable that the plaintiff has not discharged its burden of proof. If circumstantial evidence is relied on, it does not have to give rise to an irresistible inference as long as the desired inference is one of the possible inferences. 64 Bearing in mind the foregoing applicable principles, I turn to consider the issues.",
        "Whether AAI, as an equitable assignee, may proceed with the action against the defendants when SSI, the equitable assignor, is no longer a party": "",
        "The parties’ arguments": "128 It is undisputed that under the Loan Agreement, the contractual interest rate is 5% a month while the contractual default interest rate is 6% a month.151Foot Note 151×Defendants’ Closing Submissions at para 240; Plaintiff’s Reply Closing Submissions at para 131.This amounts to S$100,000 and S$120,000 a month respectively based on the outstanding principal amount of S$2m. 129 AAI submits that it is for the defendants to show that the contractual default interest rate amounts to a penalty clause. As the defendants cannot prove that the default interest is extravagant and unconscionable in comparison with the greatest loss that could conceivably be proved to have followed from the breach, the defendants cannot prove that it amounts to a penalty clause and thus unenforceable. AAI also distinguishes the present case from that ofE C Investmentas the security provided in the two cases are very different.152Foot Note 152×Plaintiff’s Closing Submissions at paras 90–103. 130 The defendants submit that both interest rates are clearly extortionate, especially in the light of the fact that there is no evidence that it is a genuine pre-estimate of AAI’s losses. In that regard, the defendants submit that it is for AAI to prove that the interest claimed is a reasonable estimate of their loss. The defendants also rely onE C Investment, where Loh J found that a monthly interest rate of 6% “can be considered extortionate or usurious” (at [138]).Thus, the respective interest rates are penal in nature and ought to be rendered enforceable.153Foot Note 153×Defendants’ Closing Submissions at paras 239–247.",
        "Analysis and findings": "131 I set out the legal principles applicable to the issue as follows: (a) the rule against contractual penalties (the “Penalty Rule”) applies only to secondary obligations (ie, obligations which arise upon a breach of contract) and not primary obligations:Leiman, Ricardo and another v Noble Resources Ltd and another[2020] 2 SLR 386 at [100];(b) where parties stipulate in a contract the sum to be paid in the event of a breach, it is for the party being sued on the agreed sum to show that the term is a penalty:CLAAS Medical Centre Pte Ltd v Ng Boon Ching[2010] 2 SLR 386 at [63]; and(c) the test for penalty clauses is whether the sum stipulated for is extravagant and unconscionable in amount in comparison with the greatest loss that could conceivably be proved to have followed from the breach:Dunlop Pneumatic Tyre Co, Ltd v New Garage and Motor Co, Ltd[1915] AC 79 at 87, affirmed inDenka Advantech Pte Ltd and another v Seraya Energy Pte Ltd and another and other appeals[2021] 1 SLR 631 (“Denka”). 132 To elaborate, the Court of Appeal held inDenkathat the rule against penalties “appliesonlywhere there has first been abreachof contract” [emphasis in original] (at [99]). As explained by the Court of Appeal, “the utilisation of breach of contract as a prerequisite is not a mere arbitrary drawing of a legal line but is related to the objective of the Penalty Rule in regulatingsecondary(andnotprimary) obligations” [emphasis in original] (at [100]). Such prerequisite ensures that the Penalty Rule is “confined to the sphere ofsecondaryobligationsonly– specifically, the obligation on the part of the defendant topay damages to the plaintiff”, such that the “primaryobligationsbetween contracting parties arenotinterfered with at all” [emphasis in original] (at [92]). 133 As the Penalty Rule applies only to secondary obligations, I accept AAI’s argument that it “cannot even be engaged” on the contractual interest rate of 5% per month since that “concerns a primary obligation to repay the [l]oan, and isnotone which comes into effect only upon a breach of the Loan Agreement” [emphasis in original].154Foot Note 154×Plaintiff’s Closing Submissions at para 96; Plaintiff’s Reply Closing Submissions at para 133.I note that this specific point is not addressed by the defendants. In particular, the defendants persist in their submissions that both the contractual interest and default interest clauses are unenforceable as they are penalty clauses without more.155Foot Note 155×Defendants’ Closing Submissions at para 239.The defendants’ position is not legally tenable. 134 Next, the defendants have no evidence to show that such rates are “extravagant and unconscionable in amount in comparison with the greatest loss that could conceivably be proved to have followed from the breach”. In that regard, the defendants merely assert that the interest rate of 6% per month is “clearly” extortionate (relying onE C Investment) and contend that it is for AAI to show that the clauses are reasonable estimates of its losses.156Foot Note 156×Defendants’ Closing Submissions at paras 244–246. 135 Again, the defendants’ position is not legally tenable since the burden of proof falls on the defendants (see [131(b)]). I note that Mr Soh is an experienced banker and businessman. From the communications produced before me, when he entered into the Loan Agreement, Mr Soh was well aware of the applicable interest rates. Once again, I reiterate that Mr Soh has dropped his allegations that the bargaining process was imbalanced, he was pressured into accepting the high interest rates, and that the interest rate was meant to be 3% per month. Certainly, it is not for the court to question the commercial decision made by parties. It could be that, depending on the totality of the circumstances (such as the principal sum concerned, the urgency of the loan, and the type and nature of security for the loan, if any), such a default interest clause with such a default interest rate may amount to a penalty clause. Indeed, I note that inE C Investment,the loan of S$1.5m for 60 days was secured by real property worth S$29m, and it was in view of such circumstances that Loh J found the interest on the loan at 6% per month “can be considered extortionate or usurious” (at [138]). Here, the short-term loan was secured only by Mr Soh’s personal guarantee, and Mr Soh’s shares in Asidokona which is a private company incorporated a year prior to the loan. The defendants have simply failed to adduce evidence to show that the interest rate of 6% per month (which is 1% above the applicable interest rate of 5% per month) is extravagant and unconscionable.",
        "Whether SSI authorised the Loan Agreement and Deeds of Assignments and whether the Ratification is valid": "80 The Lack of Authority and Invalid Ratification Defences are related, and I propose to deal with the Invalid Ratification Defence first. Specifically, even if the defendants could prove on the evidence that Mr Wong and Mr Ong lacked the requisite authority at all material times, the argument would be moot if the Ratification is valid. Indeed, it bears reminding that it was subsequent to Ms Lou’s unexpected stance on the loan that the defendants mounted challenges regarding the authority of Mr Wong and Mr Ong to act for SSI. These were contained in the third and fourth rounds of amendments to their Defences. In response, SSI ratified the various matters. Thereafter, the defendants plead in the Rejoinders that the Ratification is not valid.",
        "Whether AAI’s claim is tainted with illegality": "",
        "Whether the Deeds of Assignments savour maintenance and champerty": "",
        "Whether the loan is an illegal moneylending transaction under the Moneylenders Act": "111 I begin by setting out the applicable legal principles. Section 5(1) of the MLA prohibits a person from carrying on the business of moneylending in Singapore as follows: A person must not carry on or hold out in any way that the person iscarrying on the business of moneylendingin Singapore, whether as principal or as agent,unlessthe person — (a) is authorised to do so by a licence; (b)is an excluded moneylender; or (c) is an exempt moneylender. [emphasis added] 112 InSheagar s/o T M Veloo v Belfield International (Hong Kong) Ltd[2014] 3 SLR 524 (“Sheagar”) at [30], the Court of Appeal remarked that to put this in positive terms, the “business of moneylending” may be carried out by those who are licensed to do so, or by excluded or exempt moneylenders. 113 The consequences of unlicensed moneylending are set out in s 19(3) of the MLA as follows: Where any contract for a loan has been granted by an unlicensed moneylender, or any guarantee or security has been given for such a loan — (a) the contract for the loan, and the guarantee or security (as the case may be) is unenforceable; and (b) any money paid by or on behalf of the unlicensed moneylender under the contract for the loan is not recoverable in any court of law. 114 InSheagar, the Court of Appeal summarised the framework in relation to s 14(2) of the Moneylenders Act 2008 (Act 31 of 2008) (which isin pari materiawith s 19(3) of the MLA) as follows (at [75]): (a) To rely on s 19(3) of the MLA, the borrower must prove that the lender was an “unlicensed moneylender”. (b) If the borrower can establish that the lender has lent money in consideration for a higher sum being repaid, he may rely on the presumption contained in s 3 of the MLA to discharge this burden. For completeness, s 3 provides that “[a]ny person, other than an excluded moneylender, who lends a sum of money in consideration of a larger sum being repaid is presumed, until the contrary is proved, to be a moneylender.” (c) The burden then shifts to the lender to prove that he either does not carry on the business of moneylending or possesses a moneylending licence or is an “exempted moneylender”. (d) However, if there is an issue as to whether the lender is an excluded moneylender, the legal burden of proving that he is not will fall on the borrower. In this regard, by s 2 of the MLA, an “excluded moneylender” includes “any person” who “lends money solely” to “corporations” (under s 2(e)(iii)(A) of the MLA). 115 I should add that inE C Investment Holding Pte Ltd v Ridout Residence Pte Ltd andanother (Orion Oil Ltd and another, interveners)[2011] 2 SLR 232 (“E C Investment”) at [135], two tests were put forth to determine if a person is carrying on the business of moneylending. The first is “whether there was a certain degree of system and continuity in the transactions” (the “Continuity Test”) and, if the answer is no, then the second is whether the alleged moneylender is one who is ready and willing to lend to all and sundry provided that they are from his point of view eligible” (the “All and Sundry Test”).",
        "Whether the interest clauses under the Loan Agreement are enforceable": "",
        "Commencement of default interest": "136 Having found that the default interest clause is valid and enforceable, a further issue arises as to when default interest should start running. 137 According to Mr Wong, as at 5 March 2020, the balance sum due under the Loan Agreement (deducting the payments already made of S$900,000) as set out at [23] above is calculated to be as follows:157Foot Note 157×WJWA at para 137. ParticularsS/NItem DescriptionOutstanding Amount / S$1.Loan Principal Amount2,000,0002.Interest payable under cl 6.1 of the Loan Agreement200,0003.Default interest payable under cl 7.1 of the Loan Agreement (calculated from 22 June 2017 to 20 July 2018)1,554,410.964.Default interest payable under cl 7.1 of the Loan Agreement (calculated from 21 July 2018 to 5 March 2020)2,335,092.75Total6,089,503.71 138 Mr Wong explained that the loan was extended until 21 January 2017 only (see [21] above). Even though Asidokona is liable for default interest from 22 January 2017 onwards, on a goodwill basis, AAI calculated default interest from 22 June 2017 onwards at 6% per month of S$2m being S$120,000 per month.158Foot Note 158×WJWA at para 136. 139 Indeed, in the Amended Statement of Claim, the table after paragraph 22 shows a tabulation of default interest from 22 June 2017 to 20 July 2018 (being the date of the Statement of Claim). However, I note that at paragraphs 11, 14 and 15 of the Amended Statement of Claim, AAI states that the parties agreed to three extensions of the Loan Agreement until 21 January 2017, 31 August 2017 and 30 September 2017 respectively. For each of these extensions, AAI pleads that the loan may be extended thereafter on a month-to-month basis at the discretion of AAI. At paragraph 19 of the Amended Statement of Claim, AAI pleads that “[a]s a result of the repeated delays and failure on the part of the [d]efendants to repay the Loan, SSI was not agreeable to any further extension of the Loan beyond March 2018”. 140 In response, the defendants plead that in any event, the default interest should only take effect after March 2018. This is based on AAI’s position that “SSI was not agreeable to any further extension… beyond March 2018.”159Foot Note 159×Asidokona’s Defence (Amendment No 4) at para 19; Mr Soh’s Defence (Amendment No 4) at para 20.However, at the trial, the defendants appeared to have conceded the point. The defendants accepted the calculations set out at [138] above, and made no mention of this in the closing submissions.160Foot Note 160×Transcript dated 7 September 2021 at p 4, lines 24–30.Upon the issue being raised with the parties, the defendants retracted the concession, and maintains that the calculation of default interest should, in any event, commence on 1 April 2018.161Foot Note 161×Oral Submissions of 14 February 2022. 141 In my view, AAI cannot claim what has not been clearly and consistently pleaded. Despite the table after paragraph 22 of the Amended Statement of Claim setting out the calculation of default interest from 22 June 2017, the other paragraphs state AAI’s position to be that the Loan Agreement was extended to the end of March 2018 (apparently on the same basis as the very first extension to 21 January 2017 – which AAI does not dispute is based on the interest rate of 5% per month). Indeed, AAI does not plead that the second and third extensions were on terms different from the first extension. Further, from Mr Soh’s WhatsApp messages set out at [22] above, it appears to me that the parties’ understanding was that such extensions on a month-to-month basis would be based on the interest of $100,000 per month,ie,interest of 5% per month and not default interest of 6% per month. Therefore, I am of the view that default interest should only run from 1 April 2018.",
        "Conclusion": "142 To conclude, on the evidence before me, I am satisfied that AAI has proven its case against both defendants. I am also of the view that the defendants’ grounds for disputing the claim are not made out on the law and evidence before me. As such, I grant judgment in favour of AAI against the defendants for the principal amount of the loan of S$2m, with interest payable under cl 6.1 of the Loan Agreement at 5% per month to be calculated from 22 July 2016 to end March 2018, and default interest under cl 7.1 of the Loan Agreement at 6% per month from 1 April 2018 to date of payment. AAI is to give credit to the defendants for payment of the sum of S$900,000 which I accept to be made towards the interest on the Loan Agreement only (and not the principal amount). In my judgment, it is plain from the objective contemporary communications from Mr Soh to Mr Wong that the money set aside (being the initial sum of S$300,000) and subsequent payments of S$900,000 were intended for the payment of interest (see [12] and [22] above). 143 Pursuant to cl 4 of the Deed of Charge, Mr Soh is also to deliver to AAI (a) all share certificates representing the Charged Shares; (b) two share transfer forms duly executed in respect of the Charged Shares; and (c) a certified true copy of the Register of Members of Asidokona duly annotated by the company secretary of Asidokona to note that the Charged Shares are the subject of a charge in favour of AAI. 144 In relation to costs, AAI submits that the defendants should be ordered to pay costs on an indemnity basis for two reasons. First, it is contractually provided for at cl 10 of the Loan Agreement, as well as cl 2.1 of the Personal Guarantee. Second, this is an appropriate course for the present case given the defendants’ conduct of pursuing an entirely unmeritorious defence.162Foot Note 162×Plaintiff’s Closing Submissions at paras 116–119.The defendants “vehemently deny and oppose” this submission, and argue that they have “only raised legitimate issues that have arisen over the course of the proceedings, specifically through [Ms Lou]”.163Foot Note 163×Defendants’ Closing Submissions at para 248. 145 Where there is a contractual agreement between parties prescribing that, in the event of a dispute, legal costs are to be paid by one party to another on an indemnity basis, the court “must have the power to override the parties’ agreement as to costs in order to preserve the integrity of the administration of justice” such that “where the claim for costs on the basis of a contractual provision is manifestly unjust, the court can and should intervene to disallow the claim in the exercise of its discretion” (Abani Trading Pte Ltd v BNP Paribas and another appeal[2014] 3 SLR 909 (“Abani”) at [93]). In that regard, “in the absence of manifest injustice, the court will tend towards upholding the contractual bargain entered into by both parties” (Abaniat [93]). 146 On all the circumstances of the present case, I see no reason to depart from the contractual agreement that the defendants pay costs on an indemnity basis. No “manifest injustice” can be said to arise in the circumstances to justify the court exercising its discretion to override the parties’ agreement for indemnity costs. Such costs order should be unsurprising, given that the defendants had agreed to indemnity costs under the Loan Agreement and the Personal Guarantee. This is sufficient to dispose of the defendants’ objection to paying costs on an indemnity basis. Nevertheless, since both parties also submitted on the defendants’ conduct, I make the following remarks. 147 This should have been a straightforward claim for the recovery of the loan. To support the Illegal Moneylending Defence, the defendants made many bare allegations contrary to the objective contemporaneous evidence, including unwarranted and unnecessary allegations against Ms Pok. In particular, the allegation that Mr Soh signed blank pages flies in the face of clear WhatsApp messages and emails exchanged at the material time. Indeed, the communications clearly show that at all material times, Mr Soh was fully aware that the loan was meant to be granted to Asidokona, with Mr Soh as the guarantor. Having made these unsubstantiated allegations, Mr Soh elected (unsurprisingly) not to testify to substantiate his assertions. Further, after Mr Ong’s legal troubles in 2019, Ms Lou began distancing herself from the loan transaction. In my view, the defendants capitalised on the situation and introduced a number of unmeritorious defences so as to evade liability. Accordingly, I have no hesitation in awarding costs to AAI on an indemnity basis against the defendants. Such costs are to be taxed (if not agreed). Hoo Sheau PengJudge of the High Court Narayanan Sreenivasan SC, Rajaram Muralli Raja and Tan Si Xin Adorabelle (K&L Gates Straits Law LLC) for the plaintiff; Mulani Prakash P and Ruelia Nesaranjini d/o Ravindran Rufus (M & A Law Corporation) for the first and second defendants."
    }
}