{
    "case_title": "Public Prosecutor vJeganathan Balan",
    "ncitation": "[2022] SGHC 37",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 The accused, Mr Jeganathan Balan, pleaded guilty to a charge of trafficking by having in his possession for the purpose of trafficking one packet containing not less than 1,068g of granular/powdery substance which was analysed and found to contain not less than 9.99g of diamorphine under s 5(1)(a) read with s 5(2) and punishable under s 33(1) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the Act”). After convicting him of the charge, I imposed the sentence of 13 years of imprisonment (backdated to the date of arrest of 30 April 2019) with 10 strokes of the cane. The accused has appealed against the sentence. I now provide my reasons.",
        "The facts": "2 These material facts are set out in the Statement of Facts. The accused is a 29-year-old male Malaysian. On 30 April 2019, at about 2.15pm, the accused entered Singapore from Malaysia on a motorcycle bearing registration number JQE1840 (“Motorcycle”) via the Tuas Checkpoint. 3 The accused travelled on the Motorcycle to an apartment development known as Straits Residences at 156 Joo Chiat Road, located in the vicinity of Joo Chiat Road and Rambutan Road (adjacent roads). At about 4.20pm, he arrived in the vicinity of Straits Residences. 4 Sometime between 4.29pm and 4.39pm, Mr Nor Azman bin Mustaffa (“Mr Nor Azman”), a 51-year-old male Singaporean, walked out of Straits Residences onto Joo Chiat Road. He was carrying a red, green and blue paper bag (the “Paper Bag”) which contained a stack of cash amounting to S$13,800 (the “Cash”) and one plastic wrapper containing brown granular substance (initially marked together as exhibit “L1” before the brown granular substance was marked as exhibit “L1A” during exhibit processing) (the “Drugs”). 5 Acting on his drug supplier’s instructions, Mr Nor Azman placed the Paper Bag with its contents on the ground between a green dustbin and a blue dustbin along Rambutan Road. 6 The accused was waiting at the bus stop opposite Straits Residences on the Motorcycle. He then rode the Motorcycle from Joo Chiat Road to Rambutan Road. The accused stopped near to Mr Nor Azman who pointed to the Paper Bag and told the accused that the “thing” was there. Mr Nor Azman then returned to Straits Residences. 7 The accused understood that he was supposed to collect the Paper Bag along with its contents. Subsequently, he took possession of the Paper Bag and its contents,ie,the Cash and the Drugs. The accused knew the nature of the Drugs and possessed the Drugs for the purpose of trafficking. 8 Then, the accused left the vicinity of Joo Chiat Road and Rambutan Road and travelled towards the Pan-Island Expressway (“PIE”), carrying the Paper Bag, the Cash and the Drugs with him. At PIE Exit Number 27 leading to Clementi Ave 6, the accused threw the Paper Bag and the Drugs onto the grass patch next to electrical box number 1387S1. However, he kept the Cash with him. 9 At about 5.35pm, a party of officers from the Central Narcotics Bureau (“CNB”) arrested the accused at the traffic junction of Toh Guan Road and Toh Guan Road (towards the PIE). 10 At about 6.25pm on the same day, at the grass patch next to electrical box number 1387S1 in the vicinity of PIE Exit Number 27, a CNB officer seized the Paper Bag and the Drugs. 11 Later that day at about 7.00pm, the CNB officers conducted a search of the accused. They seized the Cash from his backpack, and loose cash and coins amounting to S$829.65 and RM7.85 which were on him. 12 On 3 May 2019, the Drugs were submitted to the Health Sciences Authority (“HSA”) for analysis. On 3 July 2019, Ms Lim Jong Lee Wendy, an analyst with the Illicit Drugs Laboratory of the HSA issued a certificate under s 16 of the Act stating that the packet containing not less than 1,068g of granular/powdery substance was found to contain not less than 16.19g of diamorphine. 13 Diamorphine is a Class “A” controlled drug listed in the First Schedule to the Act. The accused was not authorised to possess or traffic in diamorphine under the Act or the Regulations made thereunder.",
        "Conviction": "14 By virtue of the facts stated in the Statement of Facts as admitted by the accused, I found that the accused possessed for the purpose of trafficking not less than 9.99g of diamorphine, and that he has thereby committed the offence as charged under s 5(1)(a) read with s 5(2) of the Act. Accordingly, I convicted the accused of the charge.",
        "Sentence": "15 By s 33(1) read with the Second Schedule of the Act, the prescribed punishment for the offence is a minimum of five years’ imprisonment and five strokes of the cane, and a maximum of 20 years’ imprisonment and 15 strokes of the cane. 16 The parties were not far apart in their sentencing positions. The Prosecution argued for a sentence of 13 to 14 years’ imprisonment and 10 strokes of the cane, with no objections for the imprisonment term to be backdated to the date of the accused’s arrest. In the mitigation plea, Defence Counsel urged the court to impose a sentence of not more than 13 years’ imprisonment with 10 strokes of the cane. 17 For first time offenders convicted for trafficking in diamorphine in quantities up to 9.99g, the sentencing framework is set out inVasentha d/o Joseph v Public Prosecutor[2015] 5 SLR 122 (“Vasentha”) at [44]–[50], as affirmed by the Court of Appeal inSuventher Shanmugam v Public Prosecutor[2017] 2 SLR 115 at [28]–[30],  which I summarise as follows: (a) First, the sentencing judge identifies an indicative starting point based on the quantity of the diamorphine, based on the following table: Diamorphine QuantitiesImprisonmentCaningUp to 3g5–6 years5–6 strokes3–5g6–7 years6–7 strokes5–7g7–8 years7–8 strokes7–8g8–9 years8–9 strokes8–9g10–13 years9–10 strokes9–9.99g13–15 years10–11 strokes (b) Second, the sentencing judge should then consider the necessary adjustments upwards or downwards based on the offender’s culpability and the presence of relevant aggravating or mitigating factors. This inquiry would require a holistic assessment of all the circumstances. In a case where no adjustment is necessary, the indicative starting point might well be the appropriate sentence to be imposed. (c) Third, the sentencing judge might, where appropriate, take into account the time that the offender had spent in remand prior to conviction either by backdating the sentence or discounting the intended sentence. 18 I turn to the application of the framework. It was not disputed by the parties that given the quantity of the Drugs,ie,not less than 9.99g, the indicative starting range is 13 to 15 years of imprisonment and 10 to 11 strokes of the cane. Further, given that the quantity of the Drugs is at the uppermost limit of the quantity of diamorphine for the indicative starting range, I agreed with the Prosecution that the appropriate starting point is 15 years’ imprisonment and 11 strokes of the cane. This recognises that the greater the quantity of drugs trafficked, the higher the sentence to be imposed (Vasenthaat [46]). Therefore, where the quantity of drugs falls at the upper limit of the relevant range, the upper limit in terms of the sentencing range is the appropriate starting point. 19 Turning to the other facts and circumstances, the accused has no antecedents. As for his culpability, I agreed with the parties that the accused’s role in the transaction was merely that of courier. There was no evidence that he played a coordinating or directive role. In the mitigation plea, Defence Counsel highlighted that the accused received a call on 30 April 2019 from an older relative, one “Mr Murthi”, to do a favour for him by helping with the collection of a package in Singapore. Being naïve, the accused agreed to do so. He performed a limited function under the directions of Mr Murthi. Defence Counsel also stressed that the accused received no financial benefit from Mr Murthi. Accepting these points made by Defence Counsel which were not challenged by the Prosecution, I found the accused’s culpability to be at the low end of the spectrum. 20 For completeness, I should add that I did not rely on the Prosecution’s submission that it can be inferred that the accused discarded the Drugs at PIE Exit Number 27 because he had realised that the authorities were on his tail. In assessing his culpability, the attempt to escape detection by CNB, the Prosecution contended, should be taken to be an aggravating factor. Defence Counsel disputed this position, and I found insufficient basis to consider this to be an aggravating factor. 21 Moving on, as accepted by the parties, the accused’s admission of guilt is a mitigating factor. Indeed, it is well accepted that an admission of guilt that reflects genuine remorse is a mitigating factor (Vasenthaat [71]). Here, the accused was not caught red-handed with the Paper Bag. Nonetheless, the accused decided to plead guilty. The accused’s stance had clearly saved time and resources. Due weight should be given to this. 22 In the light of the above facts and circumstances, a reduction from the starting point of 15 years’ imprisonment and 11 strokes of the cane is warranted. In making this adjustment, I arrived at 13 years’ imprisonment and 10 strokes of the cane (which is at the lowest end of the indicative starting range). As pointed out at [16] above, Defence Counsel had pressed the court to impose this very sentence. This is backdated to his date of arrest,ie,30 April 2019. I am of the view that the sentence is not manifestly excessive. Hoo Sheau PengJudge of the High Court Jotham Tay and Audrey Choo (Attorney-General’s Chambers) for the Prosecution;Jerrie Tan and N K Rajarh (K&L Gates Straits Law LLC) for the accused."
    }
}