{
    "case_title": "Song JianbovSunmax Global Capital Fund 1 Pte Ltd",
    "ncitation": "[2022] SGHC 229",
    "coram": "Goh Yihan JC",
    "sections": {
        "Background": "1 This was the claimant’s application for an order that the defendant be wound up pursuant to s 125(1)(e) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed) (“IRDA”). After hearing the parties on 5 August 2022, I ordered that the defendant be wound up. On 18 August 2022, the defendant’s solicitors requested for further arguments to be made. I rejected this request and certified that I did not need to hear further arguments. On 2 September 2022, the defendant filed a notice of appeal against my original decision. While I had furnished brief oral reasons for my decision to the parties on 5 August 2022, I expand on those reasons and also explain why I did not need to hear further arguments in these grounds. 2 By way of background, the claimant, Mr Song Jianbo, is a judgment creditor of the defendant, Sunmax Global Capital Fund 1 Pte Ltd. The claimant had been granted judgment against the defendant and Mr Li Hua (“Mr Li”) in High Court Suit No 427 of 2019 (“Suit 427”). More specifically, the defendant and Mr Li are jointly and severally liable to the claimant for the judgment sum. The outstanding debt at the time of the issuance of the statutory demand on 6 April 2022 is S$1,320,780.15.1Foot Note 1×1st Affidavit of Song Jianbo dated 19 May 2022 at [20].However, owing to recovery actions taken by the claimant, the outstanding debt at the time of the filing of the affidavit in support of this application is S$1,317,268.08.2Foot Note 2×1st Affidavit of Song Jianbo dated 19 May 2022 at [19] and [22].",
        "The parties’ respective cases": "3 The claimant’s case for seeking an order that the defendant be wound up was premised on s 125(1)(e) of the IRDA (“s 125(1)(e)”), which provides that the court may order the winding up of a company if the company is unable to pay its debts. The claimant then relied on two deeming provisions in s 125(2) of the IRDA (“s 125(2)”) to show that the defendant was unable to pay its debts. For completeness, s 125(2) provides as follows: 125.—(2)  A company is deemed to be unable to pay its debts if — (a) a creditor (by assignment or otherwise) to whom the company is indebted in a sum exceeding $15,000 then due has served on the company, by leaving at the registered office of the company, a written demand by the creditor or the creditor’s lawfully authorised agent requiring the company to pay the sum so due, and the company has for 3 weeks after the service of the demand neglected to pay the sum, or to secure or compound for it to the reasonable satisfaction of the creditor; (b) an enforcement order or other process issued to enforce a judgment, decree or order of any court in favour of a creditor of the company is returned unsatisfied in whole or in part; or (c) it is proved to the satisfaction of the Court that the company is unable to pay its debts; and in determining whether a company is unable to pay its debts the Court must take into account the contingent and prospective liabilities of the company. 4 First, the claimant relied on s 125(2)(a) of the IRDA (“s 125(2)(a)”), which deems the defendant to be unable to pay its debts as it has not paid any part of the debt demanded for in the statutory demand issued on 6 April 2022.3Foot Note 3×Claimant’s Skeletal Submissions dated 20 July 2022 at [4] and [8].This statutory demand was issued in accordance with the terms of s 125(2)(a). The defendant did not dispute the debt.4Foot Note 4×Defendant’s Written Submissions dated 4 August 2022 at [3].Nor did the defendant dispute that the statutory demand was validly served on it in accordance with the terms of s 125(2)(a). Given the defendant’s position (which is well made out on the facts), then, subject to the court exercising its discretion not to wind up the defendant, the claimant was entitled to the winding up order sought. This is because the three grounds under s 125(2) for deeming a company to be unable to pay its debts are disjunctive; the claimant needs only to satisfy one of the grounds for a company to be deemed unable to pay its debts. As such, subject to the court’s overriding discretion not to order a winding up, this case could have been resolved on this simple ground alone. 5 Second, and in the alternative, the claimant relied on s 125(2)(c) of the IRDA (“s 125(2)(c)”) and argued that the defendant should be deemed unable to pay its debts as it is cash flow insolvent.5Foot Note 5×Claimant’s Skeletal Submissions dated 20 July 2022 at [9].It was this ground that the defendant contested with some vigour. However, it bears repeating that even if I had agreed with the defendant’s arguments against s 125(2)(c), it must remain the case that the claimant would still beprima facieentitled to the winding up order sought under s 125(1)(e) read with s 125(2)(a) of the IRDA. Be that as it may, given that the defendant had contested the claimant’s arguments under s 125(2)(c), I dealt with them in some detail at the hearing before me. 6 In essence, the defendant’s case in relation to s 125(2)(c) was premised on three arguments, all of which demonstrate, in some way or another, that it can pay its debts. These arguments were that: (a) First, if the claimant were to prevail in a pending appeal concerning a writ of seizure and sale in respect of Mr Li’s share in a certain property, the debt that the defendant and Mr Li were jointly and severally liable to the claimant for would be completely satisfied. (b) Second, that the defendant was solvent based on a correct understanding of the Court of Appeal’s decision inSun Electric Power Pte Ltd vRCMA Asia Pte Ltd (formerly known as Tong Teik Pte Ltd)[2021] 2 SLR 478 (“Sun Electric”) (“the Solvent Argument”). (c) Third, that I should exercise my discretionnotto wind up the defendant even if I were satisfied that a ground for winding up has been met (“the Discretion Argument”). 7 I now deal with each of the defendant’s three arguments in turn. In doing so, I explain why I had decided that the defendant should be wound up.",
        "My decision: the defendant should be wound up": "",
        "The claimant’s action against Mr Li": "8 In its written submissions for the hearing before me, the defendant raised “a matter of importance”6Foot Note 6×Defendant’s Written Submissions dated 4 August 2022 at [4].which may completely satisfy the debt, thereby rendering the claimant’s application otiose. According to the defendant, Mr Li and his former wife, Ms Xia Zheng (“Ms Xia”), are the registered owners of a property at Orchard Boulevard (“the Orchard Property”).7Foot Note 7×Defendant’s Written Submissions dated 4 August 2022 at [5].In their divorce, it was ordered that Mr Li should transfer his entire interest in the Orchard Property to Ms Xia. However, the transfer could not take place due to an injunction the claimant obtained against Mr Li in Suit 427.8Foot Note 8×Defendant’s Written Submissions dated 4 August 2022 at [5].After obtaining judgment against Mr Li in Suit 427, the claimant issued a writ of seizure and sale in respect of Mr Li’s share in the Orchard Property. However, Andre Maniam J in the High Court decision ofXia Zheng v Song Jianbo and another[2022] SGHC 124 had set aside the writ of seizure and sale on the ground that the claimant could not seize and sell any of Mr Li’s interest since the Orchard Property had been dealt with in the divorce.9Foot Note 9×Defendant’s Written Submissions dated 4 August 2022 at [6]. 9 The claimant has since appealed against Maniam J’s decision. The defendant therefore argued in the present case that, if the claimant succeeds, the claimant may well end up being able to claim 50% of the net sale proceeds of the Orchard Property, which, after considering the amount owing to the mortgagee, could amount to some S$6.3m. This, the defendant submitted, would completely satisfy the debt that is the subject of the present application.10Foot Note 10×Defendant’s Written Submissions dated 4 August 2022 at [8]. 10 I disagreed with the defendant that this was a valid ground for me not to make the winding up order. The fact remained that the claimant is not able to seize and sell the Orchard Property. It is therefore entirely the defendant’s speculation as to what might happen on the claimant’s appeal. Further, it is unclear how much the Orchard Property will fetch. While the defendant had put forth a possible figure at which the Orchard Property could be sold at, that was in fact the reserve price in the collective sale agreements circulated among the owners of the development.11Foot Note 11×Owe Kok Liang’s 2nd Affidavit dated 29 July 2022 at [35].There had been no offer made by any developer at that price. Ultimately, it is the defendant’s own speculation that the Orchard Property will be successfully sold in an en-bloc sale. Finally, Mr Li is an adjudicated bankrupt with liabilities. His assets would be distributed among his creditors and not just to the claimant alone. 11 For these reasons, I rejected the defendant’s submission. In my view, the claimant’s pending appeal against Maniam J’s decision to set aside the writ of seizure and sale in respect of Mr Li’s share in the Orchard Property had no bearing on the present application.",
        "The “Solvent Argument”": "12 Second, the defendant raised what it termed the “Solvent Argument”. This argument is that contrary to the claimant’s assertion, the defendant was actually solvent.12Foot Note 12×Defendant’s Written Submissions dated 4 August 2022 at [3(a)].The defendant citedSun Electricfor the proposition that the cash flow test is the sole test of solvency, that is, whether the company’s current assets exceed its current liabilities such that it can meet all its debts as and when they fall due.13Foot Note 13×Defendant’s Written Submissions dated 4 August 2022 at [11].In this regard, “current assets” and “current liabilities” refer to assets which will be realisable and debts which will fall due within a 12-month timeframe (seeSun Electricat [65]). Applying this test, the defendant argued that there were two matters relevant to its solvency. 13 The first matter was the defendant’s action in Suit No 164 of 2021 (“Suit 164”) against one Tanoto for the sum of S$3,072,000. The defendant said that the claim is meritorious because: (a) Aedit Abdullah J had granted Tanoto leave to defend the action on the condition that he furnishes security in the sum of S$1m, and (b) Audrey Lim J had allowed the defendant’s appeal against the Assistant Registrar’s decision ordering the defendant to furnish security of costs.14Foot Note 14×Defendant’s Written Submissions dated 4 August 2022 at [14].The defendant took Lim J’s decision to mean that Lim J was of the view that the defendant’s claim in Suit 164 wasbona fideand has reasonable prospects of success.15Foot Note 15×Defendant’s Written Submissions dated 4 August 2022 at [14(b)].Thus, if the defendant succeeded in Suit 164, which the defendant said is slated for trial at the end of this year or early next year,16Foot Note 16×Defendant’s Written Submissions dated 4 August 2022 at [15].there would be every chance that the defendant does not end up with a paper judgment as,inter alia, Tanoto has provided the security of S$1m.17Foot Note 17×Defendant’s Written Submissions dated 4 August 2022 at [16]. 14 I disagreed with the defendant that its pending action in Suit 164 is relevant in the present application. In the first place, it is purely speculation on the defendant’s part that the trial will happen relatively quickly. The fact is that no trial dates have been fixed. Also, even if the defendant were to prevail, there is no indication that the defendant would be able to realise its claim within such time as to make it a relevant consideration in relation to its solvency. Moreover, it is pure speculation for the defendant to think that it is likely to win the case. Indeed, as the claimant pointed out, the Court of Appeal inSun Electricdid not consider an impending investment into the company there (evinced by a cashier’s order) as a valid reason not to wind up the company (at [34]). By that threshold, it is more so that the defendant’s pending claim in Suit 164, which has no certainty of success or timing, cannot be a relevant factor against winding up. 15 The second matter the defendant said is relevant to its solvency is its legal action in Suit No 163 of 2012 (“Suit 163”). The defendant asserted that there is a judgment in the sum of S$17,488,000 against the eight counterparties there. Of this sum, S$9,032,000 is in favour of the defendant while the rest is in favour of Mr Li. Mr Li has assigned his portion of the judgment sum to the defendant, which has recovered S$581,417.49.18Foot Note 18×Defendant’s Written Submissions dated 4 August 2022 at [17]. 16 I disagreed with the defendant that its legal action in Suit 163 is relevant for present purposes. First, there does not appear to be any reasonable prospect of further recovery. The Asset Tracing Report that the defendant exhibited in relation to Suit 163 was prepared some two years ago.19Foot Note 19×Owe Kok Liang’s 2nd Affidavit dated 29 July 2022 at [35].Yet, the defendant has not managed to recover anything beyond what it had already recovered, even with the findings in the report. More substantively, the eight judgment debtors for the Suit 163 judgment are mostly bankrupted, defunct, in liquidation, or have limited assets within the jurisdiction. It is unlikely therefore that the defendant will make any further recovery in respect of Suit 163. 17 Accordingly, given that I did not consider either the action in Suit 164 or the judgment in Suit 163 to be relevant in assessing the defendant’s solvency, I concluded that the defendant is unable to pay its debts within the meaning of s 125(1)(e), even if I were to consider the deeming provision under s 125(2)(c). This is because the defendant’s assertion of solvency was dependent on it being able “to reap from the fruits of S163 and S164”.20Foot Note 20×Defendant’s Written Submissions dated 4 August 2022 at [20]–[29].If, as I had concluded, it was not relevant to consider the purported potential gains from Suit 163 and Suit 164 for ascertaining the defendant’s solvency, then there was also no need for me to further consider the extent of the defendant’s liabilities and whether that would be satisfied by these supposed gains. I should add that counsel for the defendant, Mr Naidu Devadas (“Mr Devadas”), agreed with me when I asked if the Solvent Argument was entirely dependent on me agreeing with his submissions on Suit 163 and Suit 164.21Foot Note 21×Minute Sheet dated 5 August 2022 for HC/CWU 116/2022 at p 2. 18 In any event, it bears repeating that I did not actually need to consider s 125(2)(c) since it is undisputed that the deeming provision under s 125(2)(a) is met. A creditor is entitled to choose any of the deeming provisions in s 125(2) to prove the company’s insolvency. This would have been sufficient to satisfy the ground for winding up under s 125(1)(e), subject to the court exercising its discretion not to wind up the defendant.",
        "The “Discretion Argument”": "19 The defendant’s final argument was the “Discretion Argument”, which is that I should exercise my discretionnotto wind up the defendant even if I were satisfied that a ground for winding up has been met. In this regard, it is not disputed that where a company is unable or deemed to be unable to pay its debts, the starting point is that a creditor isprima facieentitled to a winding-up orderex debito justitiae(seeSun Electricat [85], citing the decision of the Court of Appeal inBNPParibas v Jurong Shipyard Pte Ltd[2009] 2 SLR(R) 949 at [15]). Nevertheless, the court has the overriding discretion to decline to make a winding up order when appropriate. 20 The main point that the defendant made was that a winding up order will disrupt its efforts to pursue or recover its claims under Suit 163 and Suit 164. In this regard, the defendant accepted that, if it is wound up, a liquidator can continue those efforts. However, the defendant argued that time and money would be lost for the liquidators to get up to speed. It would therefore be more expeditious for the defendant to continue to spearhead those efforts.22Foot Note 22×Defendant’s Written Submissions dated 4 August 2022 at [37]. 21 I rejected this argument for the same reasons that I have given above, that is, it is speculation that those efforts in relation to Suit 163 and Suit 164 will lead to the sufficient realisation of assets for the defendant to satisfy the debt. Furthermore, the fact remained that the liquidator will be empowered to continue the action in Suit 164 (see s 144(1) of the IRDA) and the recovery efforts for Suit 163. In doing so, the liquidator must act in the best interests of the creditors and properly manage the affairs of the defendant. 22 For completeness, I also saw no other reason, such as those exceptions articulated by the Court of Appeal inSun Electric(at [85]), for me to exercise my discretion not to grant the winding up order. In fact, the relevant factors all pointed towards me granting the winding up order, such as there being no relevant interests of the defendant’s employees and suppliers, there being no objections from creditors, there being no group companies, and there being no public interest element in keeping the defendant afoot.",
        "Conclusion in relation to the winding up application": "23 In conclusion, it bears repeating (again) that based on s 125(1)(e) read with s 125(2)(a), grounds on which the defendant has not disputed, I could, subject to exercising my discretion not to do so, already make a winding up order against the defendant. But since the defendant had raised several other reasons largely premised on s 125(2)(c) against the winding up application, and the claimant had responded extensively to them, I also examined those reasons in my brief oral reasons to the parties and in these detailed grounds. Accordingly, I rejected these reasons given by the defendant in opposition to the winding up application, even though it was not strictly necessary for me to have done so. 24 In summary, I ordered the defendant to be wound up pursuant to s 125(1)(e) of the IRDA read with s 125(2)(a)ors 125(2)(c).",
        "The defendant’s request for further arguments": "",
        "Overview": "25 Shortly after my decision to order the defendant to be wound up, the defendant’s solicitors wrote in to request for me to hear further arguments. I rejected this request and certified that I did not need to hear further arguments. For completeness, I set out my reasons for declining to hear them. 26 In essence, the defendant requested me to hear further arguments on three issues, namely, whether:23Foot Note 23×Defendant’s Request for Further Arguments dated 18 August 2022 at [3]. (a) the three limbs of s 125(2)(a) of the IRDA should be construed conjunctively;(b) the court has a duty and obligation to delve further into whether the defendant should be deemed to be unable to pay its debts even when s 125(2)(a) is satisfied; and(c) the list of factors to be considered when applying the cash flow test is “non-exhaustive”.",
        "The three limbs of s 125(2)(a)the IRDA should be construed conjunctively": "27 The defendant’s first potential further argument was premised on my supposed position that “the 3 limbs of Section 125(2)(a) are disjunctive, meaning that if the applicant/claimant can establish the company’s inability to pay its debts by reference to any one of the above limbs, then the court can deem the company to be unable to pay its debts”.24Foot Note 24×Defendant’s Request for Further Arguments dated 18 August 2022 at [5].While I would have been open to hearing further arguments had there be a plausible argument I had not considered, the defendant’s potential further argument, with respect, was premised on a misunderstanding of my decision. 28 In my oral reasons furnished to the parties (in writing) at the conclusion of the hearing on 5 August 2022, I had stated the following: On this basis alone, subject to the court exercising its discretion not to wind up the defendant, the claimant is entitled to the winding up order sought.This is because the three grounds unders 125(2) for deeming a company to be unable to pay its debts are disjunctive; the claimant needs only to satisfy one of the grounds for a company to be deemed unable to pay its debts. [emphasis added] From the above, the point I made was that the three grounds under s 125(2) of the IRDA,ie, ss 125(2)(a), 125(2)(b), and 125(2)(c), are disjunctive. I did not say that the three limbswithins 125(2)(a) are to be construed disjunctively, which formed the premise of the defendant’s request for further arguments. My point was simply that, from a plain reading of s 125(2), so long as the claimant can make use of one of three deeming provisions to show that the defendant was unable to pay its debts, then the ground for winding up under s 125(1)(e) would be made out (seeWoon’s Corporations Law(Walter Woon gen ed) (LexisNexis, 2021, Issue 26) at para 601). This was why, as I had made clear to Mr Devadas at the hearing before me, I can order the defendant to be wound up based ons 125(1)(e) read witheithers 125(2)(a)ors 125(2)(c), subject to me exercising my discretion not to do so. 29 For completeness, however, I deal with the defendant’s argument on the three limbswithins 125(2)(a) being read conjunctively. The defendant had relied on the Court of Appeal’s interpretation of s 254(2)(a) of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”) inSun Electric, which is substantively identical with s 125(2)(a) of the IRDA, to argue that the three limbs within s 125(2)(a) should be read conjunctively. The Court of Appeal had said this (at [92]): We begin by highlighting two issues with the drafting of this provision. First, it seems to us that the word ‘or’ appearing before ‘compound for it…’ may lead to some confusion. Its use may seem to indicate that the three limbs it qualifies are disjunctive such that the company will be deemed unable to pay its debts if it merely neglects to satisfy one of the three limbs. It is, however, plain to us that the intention was that the limbs be considered conjunctively so that the company willnotbe deemed to be unable to pay its debts as long as it has been able to satisfy one of the limbs. It is clear that this must be what is meant, as a disjunctive reading leads to an absurd result. [emphasis in original] 30 I respectfully agree with the Court of Appeal’s reading of s 254(2)(a) of the Companies Act (“s 254(2)(a)”). I also agree with a similar reading of s 125(2)(a) of the IRDA, in so far as it is substantively similar with s 254(2)(a). This means that I actually agree with the defendant that the three limbswithins 125(2)(a) are to be read conjunctively. But this does not assist the defendant’s case against winding up. This is because this wasnotthe basis of my decision to order the winding up. Also, there is no dispute – and in fact, the defendant itself admits this – that the threeconjunctiverequirements as to the statutory demand within s 125(2)(a) have been met in the present case. Accordingly, I did not see a basis for hearing further arguments with respect to this point.",
        "The court has a duty and obligation to delve further even when s 125(2)(a) is satisfied": "31 The defendant’s second potential further argument was that, even if s 125(2)(a) has been satisfied, the court has a duty and obligation to investigate further to determine, based on the evidence tendered by the defendant, whether it should be deemed to be unable to pay its debts. In particular, the defendant said that if I was not convinced by the evidence adduced by the defendant, I should have directed that other evidence be placed before me so that I can better appreciate the defendant’s actual business and cash flow positions.25Foot Note 25×Defendant’s Request for Further Arguments dated 18 August 2022 at [7]. 32 I had no hesitation in indicating that I did not wish to hear further argument on this point. First, I did not see the basis for the defendant’s submission that the court had such a duty and obligation to delve further. The whole point of a deeming provision is to establish a factual paradigm upon the satisfaction of certain factual parameters. It is then left to the party who wishes to rebut this factual paradigm to adduce evidence to do so, within what may be permissible within the relevant statutory regime. I did not see such a basis within the IRDA. There was no real reason to engage in a detailed inquiry into the defendant’s financial standing where the winding-up petition was based on an unsatisfied statutory demand. As Choo Han Teck J said in the High Court decision ofBWUmuroa Pte Ltd v Tamarind Resources Pte Ltd[2020] 4 SLR 1294 at [25]: … if the defendant is genuinely solvent as it claims, it should have satisfied the statutory demand. It is no defence to a valid statutory demand for the defendant to say that it is solvent, but that it refuses to pay, compound or secure the debt. … 33 Second, and in any event, it is undisputed (and in fact accepted by the defendant) that the requirements under s 125(2)(a) have been met. I therefore do not see any basis to re-examine whether those requirements have been met.",
        "The list of factors to be considered when applying the cash flow test is “non-exhaustive”": "34 The defendant’s third potential further argument was that the Court of Appeal inSun Electrichad set out a non-exhaustive list of factors that should be considered under the cash flow test to ascertain if a company is deemed to be unable to pay its debts under s 125(2)(c). The defendant seemed to be suggesting that I should consider other factors specific to the present case, such as the true merits of Suit 164 and its current assets.26Foot Note 26×Defendant’s Request for Further Arguments dated 18 August 2022 at [13]. 35 Again, I had no hesitation in indicating that I did not wish to hear further argument on this point. First, it was not my place to conduct an extensive adjudication of the merits of Suit 164. All that I had before me was that Suit 164 is a pending action with no reasonable prospect of final resolution within the 12-month timeframe prescribed for the cash flow test (seeSun Electricat [65]). Second, given that I was not with the defendant on its supposed potential gains from Suit 163 and Suit 164, it followed that there was no need for me to examine its current assets. This is because, as I said earlier, the defendant’s argument of being cash flow solvent is contingent on it being able to reap its potential gains from Suit 163 and Suit 164 (see above at [17]). 36 In any event, it remained that I could have granted the order to wind up the defendant without the need to rely on s 125(2)(c) of the IRDA. 37 For all these reasons, I certified that I did not need to hear further arguments from the defendant. Goh YihanJudicial Commissioner Lem Jit Min Andy, Toh Wei Yi and Ng Hua Meng Marcus (Harry Elias Partnership LLP) for the claimant; Naidu Devadas and Abirame S (Metropolitan Law Corporation) for the defendant; Nadine Victoria Neo Su Hui and Wu Siyue (Quahe Woo & Palmer LLC) for the first non-party; Poon Chun Wai (WongPartnership LLP) for the second non-party; Benjamin Yim for the Official Receiver (Ministry of Law (IPTO))."
    }
}