{
    "case_title": "DMX Technologies Group Ltd (in liquidation)v Deloitte & Touche LLP",
    "ncitation": "[2022] SGHCR 2",
    "coram": "Justin Yeo AR",
    "sections": {
        "Background Facts": "3 The Plaintiff, DMX Technologies Group Ltd (in liquidation) (“the Plaintiff”) brought the present suit against the Defendant, Deloitte & Touche LLP (“the Defendant”), for breach of contract and breach of duties owed under tort. On 23 July 2021, an Assistant Registrar (“the AR”) made an order for specific discovery against the Plaintiff (“the Discovery Order”), which provided as follows: 1.  The Plaintiff do file and serve on the Defendant the following within 28 days from the date of the order made herein: (a)  A further supplementary list of documents (“SLOD”) enumerating all documents relating to the 13 categories of documents listed in the Schedule annexed herein that it has, or has had at any time in its possession, custody or power, and if not presently in its possession, custody or power, to state when it parted with the documents and what has become of these documents; (b)  An affidavit verifying the aforesaid SLOD (the “Verifying Affidavit\"). 2.  There be inspection of the originals (if any) of the documents listed in the aforesaid SLOD within 14 days from the time the SLOD and Verifying Affidavit are served on the Defendant; 3.  The Plaintiff is to provide to the Defendant at the time of service of the aforesaid SLOD and Verifying Affidavit, copies of the documents listed in the SLOD which are presently in the Plaintiff’s possession, custody or power; and 4.  The costs of and incidental to this application shall be fixed at S$5,000 (all-in) to be paid by the Plaintiff to the Defendant. 4 The Plaintiff appealed against the Discovery Order to a Judge of the General Division of the High Court (“the Judge”). The Judge dismissed the appeal on 30 September 2021 and ordered the Plaintiff to comply with the Discovery Order by 28 October 2021. 5 On 28 October 2021, the Plaintiff filed and served the Plaintiff’s 4th Supplementary List of Documents (“P4SLOD”) and an affidavit verifying the P4SLOD (“Verifying Affidavit”), purportedly in compliance with paragraph 1 of the Discovery Order. The Plaintiff listed documents in Categories 1, 9, 11, 12 and 13 of the Schedule to the Discovery Order and explained in the Verifying Affidavit that it was not aware of any documents in the remaining categories. The Plaintiff did not provide copies of the documents listed in P4SLOD at the time of service of P4SLOD and the Verifying Affidavit. 6 The descriptions in P4SLOD were as follows: S/No.DateDescription (copies unless otherwise stated)A. CATEGORY 11.UndatedGeneral Ledgers of DMX Technologies (Hong Kong) Limited and DMX Technologies (Macao Commercial Offshore) Company Limited for FY2008 – FY2015B. CATEGORY 92.UndatedSales and Purchase Ledgers of DMX Technologies (Hong Kong) Limited and DMX Technologies (Macao Commercial Offshore) Company Limited for FY2008 – FY2015C. CATEGORY 113.VariousContracts, Invoices, Purchase Orders, Goods Received Notes, Sales Order Forms, Delivery Notes, Project Cost Analyses, Journal Entries and Offset Instructions in relation to Transactions in Question entered into between FY2007 and FY2012D. CATEGORY 124.VariousCorrespondence and/or communications with PWC, including but not limited to:(a) correspondence and/or communications in relation to the engagement of PWC for a review of the Plaintiff’s existing risk management processes referred to at paragraph 7 of the SOC;(b) instructions given to PWC; and(c) any terms on which PWC was engaged by the Company and/or its subsidiariesE. CATEGORY 135.VariousCause papers filed in HCA 896/2016 7 Various exchanges of correspondence ensued between the parties’ solicitors. On 31 October 2021, the Defendant’s solicitors requested softcopies of the documents within the various categories listed in P4SLOD. On 1 November 2021, the Plaintiff’s solicitors informed the Defendant’s solicitors that the Plaintiff was compiling the softcopies and that the originals were located overseas (iein Hong Kong Special Administrative Region (“HKSAR”)). On 3 November 2021, the Defendant’s solicitors highlighted to the Plaintiff’s solicitors that (a) the Plaintiff failed to sufficiently enumerate documents in P4SLOD; (b) the Plaintiff failed to produce softcopies of the documents ostensibly listed in P4SLOD; and (c) the Defendant wished to inspect originals of the documents. On 5 November 2021, the Defendant’s solicitors reiterated the Defendant’s positions on the issues above, but there was no response from the Plaintiff’s solicitors. 8 On 8 November 2021, six working days after the 28 October 2021 deadline, the Plaintiff’s solicitors provided softcopies of the documents to the Defendant’s solicitors. These softcopy documents were organised in folders, with each document bearing a detailed filename (see a simplified representative schematic in the appended table). According to the Plaintiff, the additional six working days were required to organise the documents in this manner, “to enable the Defendant to clearly see what documents were being disclosed”.1Foot Note 1×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraph 16.This included, in relation to the documents in S/No 3 of P4SLOD, “organis[ing] documents connected to individual transactions into Portable Document Format Files, and then label[ing] them according to the corresponding transaction numbers”.2Foot Note 2×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraph 16. P4SLOD > A. Category 1 >1. General LedgersTypeNamePDFGeneral Ledger of DMX HK for FY 2008.pdfXLSGeneral Ledger of DMX HK for FY2009.xlsPDFGeneral Ledger of DMX HK for FY2010.pdf……P4SLOD > B. Category 9 >2. Sales and Purchase LedgersXLSSales and Purchase Ledger of DMX HK for FY2008.xlsXLSSales and Purchase Ledger of DMX HK for FY2009.xlsXLSSales and Purchase Ledger of DMX HK for FY2010.xls……P4SLOD > C. Category 11 >3. Documents in relation to Transactions in QuestionPDFOffset Instructions.pdfPDFSO 07HK192.pdfPDFSO 07HK204.pdf……P4SLOD > D. Category 12 >4. Correspondence with PWCMSG20130610 – Email from Skip Tang to Sharon Chow.msgMSG20130715 – Email from Benson Leung to Astor Cheung.msgMSG20130628 – Email from Astor Cheung to Eric Tse.msg……P4SLOD > E. Category 13 >5. Cause papers filed in HCA 896 of 2016PDF20160407 – Writ of Summons.pdfPDF20160714 – Amended Writ of Summons.pdfPDF20160914 – Statement of Claim.pdf…… 9 On 15 December 2021, the Defendant brought the present application, seeking an order that the action be struck out pursuant to O 24 r 16 of the Rules of Court unless, within seven days, the Plaintiff: (a) complies with paragraph 1 of the Discovery Order by filing and serving on the Defendant a supplementary list of documents (“SLOD”) enumerating all documents relating to categories 1, 9, 11, 12 and 13 listed in the Schedule to the Discovery Order;(b) complies with paragraph 2 of the Discovery Order by providing inspection of the originals (if any) of the documents listed in the aforesaid SLOD; and(c) explains on affidavit why the Plaintiff acted in breach of the Discovery Order, and the steps taken by the Plaintiff’s solicitors to discharge their duties to the Court to supervise the discovery process.",
        "Issues": "10 Based on the written submissions and oral arguments, the key issues arising in this application are: (a) whether the Plaintiff had complied with paragraph 1 of the Discovery Order given the manner in which the Plaintiff enumerated and described documents in P4SLOD (“the Enumeration and Description Issue”);(b) whether the Plaintiff had complied with paragraph 2 of the Discovery Order concerning inspection of the originals (if any) of the documents listed in P4SLOD (“the Inspection Issue”);(c) whether the Plaintiff’s solicitors had complied with their duty to supervise the discovery process (“the Duty Issue”); and(d) whether any unless order should be made (“the Unless Order Issue”).",
        "The Enumeration and Description Issue": "",
        "Relevant Law and Principles": "30 The relevant provisions are O 24 rr 11(1) and 13(1) of the Rules of Court, which provide as follows: Order for production for inspection (O. 24, r. 11) 11.—(1) If a party who is required by Rule 9 to serve such a notice as is therein mentioned or who is served with a notice under Rule 10(1) — (a)  fails to serve a notice under Rule 9 or, as the case may be, Rule 10(2); (b)  objects to produce any document for inspection; or (c)  offers inspection at a time or place such that, in the opinion of the Court, it is unreasonable to offer inspection then or, as the case may be, there, then, subject to Rule 13(1), the Court may, on the application of the party entitled to inspection, make an order in Form 42 for the production of the documents in question for inspection at such time and place, and in such manner, as it thinks fit. … Production to be ordered only if necessary, etc. (O. 24, r. 13) 13.—(1) No order for the production of any documents for inspection or to the Court shall be made under any of the foregoing Rules unless the Court is of the opinion that the order is necessary either for disposing fairly of the cause or matter or for saving costs. … 31 In relation to the time and place for inspection, the parties are expected to agree to a reasonable time and place, which is usually during office hours at the office of the solicitor of the party offering inspection (Singapore Court Practice 2021, at paragraph 24/11/1). 32 If the time or place stated is unreasonable, the court may order inspection at a different time or place (O 24 r 11(1)(c) of the Rules of Court). However, this is subject to the overarching consideration of whether production of the document for inspection is necessary “either for disposing fairly of the cause or matter or for saving costs” (O 24 r 13(1) of the Rules of Court). As observed by the learned author ofSingapore Court Practice2021(at paragraph 24/13/1), O 24 r 13(1) of the Rules of Court “imposes a paramount condition” in respect of the production of a document.",
        "Decision": "33 In the present case, the Defendant has not controverted the practical difficulties cited by the Plaintiff concerning conveying the originals to Singapore. In addition, the Defendant’s need to examine the originals is motivated by the need to detect forgery – in particular, to consider potential issues with documents bearing wet-ink signatures or seals (see [29] above). In the circumstances, the necessity requirement in O 24 r 13(1) of the Rules of Court is best met by adopting a calibrated approach in relation to the time and place for the production of originals for inspection, as follows: (a) The Plaintiff is to provide inspection of the originals of the documents in S/No 3 of P4SLOD, limited to those which exist in their original form in hardcopy (including, for the avoidance of doubt, documents with wet-ink signatures and seals, electronic documents which were printed out and annotated,etc), at the office of the Plaintiff’s solicitors, at a reasonable time to be agreed by parties. Failing agreement, either party is at liberty to apply to the court for directions. (b) For all other documents, it is unclear why the production of originals for inspection in Singapore is necessary for fairly disposing of the cause or matter, or for saving costs in the present suit. Many of the documents mentioned in S/No 1, 2 and 4 of P4SLOD appear to exist originally in electronic format (egPDF, Microsoft Excel spreadsheets (*.xls) or Microsoft Outlook email (*.msg)). In any event, it is unclear what possible forgery-related issues the Defendant is concerned with in relation to these documents. Likewise, it is difficult to see why it is necessary to inspect the original cause papers filed in HKSAR court proceedings (see S/No 5 of P4SLOD) and what authenticity-related issues the Defendant surmises will arise out of these. In the circumstances, should the Defendant wish to inspect originals falling outside [33(a)], the Plaintiff is to provide inspection of the originals at a reasonable time and place to be agreed by the parties, failing which at the Plaintiff’s or its representative’s offices in HKSAR at a reasonable time to be agreed by the parties. Failing agreement, either party is at liberty to apply to the court for directions.",
        "The Inspection Issue": "26 Paragraph 2 of the Discovery Order provides for inspection of theoriginals(if any) of the documents listed in P4SLOD within 14 days from the time P4SLOD and the Verifying Affidavit are served on the Defendant. 27 In the “Notice to Inspect” found within P4SLOD, the Plaintiff stated that the documents listed in Part 1 of P4SLOD may be inspected at the office of the Plaintiff’s solicitors by prior appointment between 10am and 4pm. However, in Part 1 of P4SLOD, the Plaintiff listed the documents as “copies unless otherwise stated”. In other words, the Plaintiff’s position was that it would provide inspection only ofcopiesin Singapore. While one possible argument may be that this technically constitutes a breach of paragraph 2 of the Discovery Order (as there is no stated offer for the inspection oforiginals), the parties did not proceed on this basis. Instead, they crossed swords on the Plaintiff’s indication that it would provide the inspection of originalsin HKSAR. 28 The Plaintiff explained that it had offered the inspection of originals in HKSAR due to numerous practical difficulties in bringing the originals to Singapore, namely: (a) the originals are within the purview of the liquidators of a related HKSAR company; (b) the originals are relevant to ongoing legal proceedings in HKSAR; and (c) it is not feasible for the Plaintiff to incur the hefty costs of shipping the voluminous originals to Singapore when the Defendant has not disputed the authenticity of any of the documents and has not identified exactly which originals it wishes to inspect.7Foot Note 7×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraphs 9 and 18.The Plaintiff’s position was that the Defendant should make arrangements to inspect the originals in HKSAR8Foot Note 8×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraph 17.or identify exactly which documents it disputes the authenticity of and wishes to inspect.9Foot Note 9×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraph 23.In this regard, Plaintiff’s counsel submitted that the Defendant had failed to demonstrate the prejudice it would suffer if it was required to inspect the originals in HKSAR, or that a fair trial would not be possible if the originals were not brought to Singapore for inspection.10Foot Note 10×Plaintiff’s Written Submissions (dated 7 February 2022) at paragraphs 22 and 24. 29 In response, Defendant’s counsel relied on O 24 r 11(1)(c) of the Rules of Court (which was one of the stated grounds for the present application), and argued that offering inspection in HKSAR was unreasonable in the light of the prevailing COVID-19 pandemic and the attendant travel restrictions for in-bound travellers to HKSAR from Singapore.11Foot Note 11×Affidavit of Geraldine Yeong (dated 15 December 2021) at paragraph 30(c).The Defendant also explained that it had to inspect the originals as this “may be relevant to determine issues such as whether there are wet-ink signatures, seals, or any indication of forgery”.12Foot Note 12×Affidavit of Geraldine Yeong (dated 15 December 2021) at paragraph 31.",
        "The Duty Issue": "34 The Defendant sought an order that an explanation be made on affidavit on the conduct of the Plaintiff and its solicitors in relation to the failure to provide copies of the documents at the time of service of P4SLOD, and the steps taken by the Plaintiff’s solicitors to discharge their duty to supervise the discovery process.13Foot Note 13×Defendant’s Written Submissions (dated 7 February 2022) at paragraph 40.The Defendant provided two reasons for seeking this order: (a) First, the Plaintiff has not explained the failure to provide copies of the documents at the time of service of P4SLOD and the Verifying Affidavit. If the Plaintiff’s solicitors had the relevant documents in softcopy and had reviewed the documents prior to the filing of P4SLOD, they would have been able to provide copies of the same.14Foot Note 14×Defendant’s Written Submissions (dated 7 February 2022) at paragraph 42. (b) Second, given that the originals of the documents are in HKSAR, it is unclear how the Plaintiff’s solicitors went through the documents to ensure that no documents were omitted.15Foot Note 15×Defendant’s Written Submissions (dated 7 February 2022) at paragraph 43.There is a possibility that the Plaintiff was left to simply decide on its own what documents it wished to provide to its solicitors.16Foot Note 16×Defendant’s Written Submissions (dated 7 February 2022) at paragraph 46.The Plaintiff’s solicitors may therefore have breached their duty to supervise discovery (citingTeo Wai Cheong v Credit Industriel et Commercial and another appeal[2013] 3 SLR 573 (“Teo Wai Cheong”) at [43] to [49]). 35 I do not think that these are sufficient reasons to warrant the order sought by the Defendant. I acknowledge that the Plaintiff has technically breached paragraph 3 of the Discovery Order by failing to provide the copies of the documents on 28 October 2021 or to seek an extension of time to do so. However, the Plaintiff has provided an explanation for this delay (see [8] above) and stated on affidavit that the Plaintiff’s solicitors had reviewed the documents prior to the filing of P4SLOD.17Foot Note 17×Affidavit of Bob Yap Cheng Ghee (dated 12 January 2022) at paragraph 20. 36 InTeo Wai Cheong, when considering the practical applications of a solicitor’s duty in discovery, the Court of Appeal cited a passage fromMyers v Elman[1940] AC 282, as follows: He is at an early stage of the proceedings engaged in putting before the Court on the oath of his client information which may afford evidence at the trial. Obviouslyhe must explain to his client what is the meaning of relevance: and equally obviously he must not necessarily be satisfied by the statement of his client that he has no documents or no more than he chooses to disclose.If he has reasonable ground for supposing that there are others, he must investigate the matter; but he need not go beyond taking reasonable steps to ascertain the truth. He is not the ultimate judge, and if he reasonably decides to believe his client, criticism cannot be directed to him. [emphasis added inTeo Wai Cheong] 37 On the facts ofTeo Wai Cheong, the party in question had breached its discovery obligations by failing to disclose certain evidence. In those circumstances, the Court of Appeal invited the party to consider waiving privilege and disclosing the legal advice it received in relation to discovery (Teo Wai Cheongat [46]). The Court of Appeal also took the view that the documents that the party had failed to disclose appeared to be the sort that would likely have emerged had the party’s solicitors taken the necessary steps in relation to discovery (seeTeo Wai Cheongat [49]). 38 In contrast, in the present case, there is no indication or finding made that the Plaintiff had failed to disclose any documents. The Defendant’s main concern relates to precisely how the Plaintiff’s solicitors supervised the discovery process given that the originals of the documents were in HKSAR, but the Defendant was unable to provide any basis (beyond suspicion and speculation) for suggesting that the Plaintiff’s solicitors had failed to provide the necessary supervision, or that the Plaintiff’s solicitors had failed to investigate when there was reasonable ground for supposing that the disclosed documents were inadequate. As such, I decline to grant the order sought, without prejudice to the Defendant’s right to apply afresh if any non-disclosure has been positively identified.",
        "The Unless Order Issue": "39 It is well established that an unless order, particularly one with the effect that an entire action be struck out, is an order of last resort when the defaulter’s conduct is inexcusable (seeMitora Pte Ltd v Agritrade International (Pte) Ltd[2013] 3 SLR 1179 (“Mitora”) at [45(a)]). The conditions appended to an unless order should, as far as possible, be tailored to the prejudice which would be suffered should there be non-compliance (Mitoraat [45(b)]). As explained inMitoraat [46], the “draconian sanction of striking out a litigant’s claim… in its entirety should not be the default consequence of an ‘unless order’ as it would effectively deprive the litigant of itssubstantiverights on account of aproceduralfault” (emphasis in original). 40 In the present case, there is simply no evidence that the Plaintiff has routinely or repeatedly failed to comply with orders, or that the Plaintiff’s conduct is inexcusable. The Defendant also did not attempt to tailor the order sought to the prejudice suffered in the event of non-compliance. The Defendant’s seeking of an unless order with the effect that the Plaintiff’s action be struck out upon non-compliance is, to adapt language fromMitoraat [44], an attempt to crack a walnut with a sledgehammer. I therefore decline to make any unless order in the present case.",
        "Conclusion": "41 For the foregoing reasons, I decline to grant the unless orders sought. Instead, I make the following orders: (a) The Plaintiff is to comply with paragraph 1 of the Discovery Order by filing and serving on the Defendant a fresh SLOD and Verifying Affidavit within 21 days of this order. The fresh SLOD is to comply with the requirements in O 24 r 3(1) of the Rules of Court.(b) The Plaintiff is to provide inspection of the originals of the documents in S/No 3 of P4SLOD, limited to those which exist in their original form in hardcopy (including, for the avoidance of doubt, documents with wet-ink signatures and seals, electronic documents which were printed out and annotated,etc), at the office of the Plaintiff’s solicitors, at a reasonable time to be agreed by parties. Failing agreement, either party is at liberty to apply to the court for directions.(c) For all other documents, should the Defendant wish to inspect originals, the Plaintiff is to provide inspection of the originals at a reasonable time and place to be agreed by the parties, failing which at the Plaintiff’s or their representative’s offices in HKSAR at a reasonable time to be agreed by the parties. Failing agreement, either party is at liberty to apply to the court for directions. 42 I will hear parties on costs. Justin YeoAssistant Registrar Ms Premalatha Silwaraju and Ms Joelle Tan(M/s Drew & Napier LLC) for the Plaintiff.Mr Niklas Wong and Mr Uday Duggal(M/s TSMP Law Corporation) for the Defendant."
    }
}