{
    "case_title": "Public Prosecutor vMuhammad Hamir B Laka",
    "ncitation": "[2022] SGHC 203",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1 The accused is Muhammad Hamir B Laka (“Hamir”), a 56-year-old male Singaporean. Hamir faces three charges (the “Charges”) under the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”). The Charges read as follows: That you, Muhammad Hamir B Laka, 1st Charge(Amended)are charged that you, on 23 September 2019, between 3 p.m. and 5 p.m., in Singapore, did traffic in a Class A Controlled Drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “Act”), to wit, by having in your possession for the purpose of trafficking:(a) 112 packets and 38 straws containing not less than 1,525.55 g of granular/powdery substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than37.91 gofdiamorphine, at your residence in Block 174C Hougang Avenue 1 #05-1565; and(b) 11 packets and 35 straws containing not less than 68.16 g of granular/powdery substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than1.8 gofdiamorphine, on your person,totalling39.71 gofdiamorphine, without any authorisation under the Act or the Regulations made thereunder, and you have thereby committed an offence under Section 5(1)(a) read with Section 5(2) and punishable under Section 33(1) of the Act.2nd Chargeon 23 September 2019, at or around 3 p.m., in Singapore, did traffic in a Class A Controlled Drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “Act”), to wit, by having in your possession for the purpose of trafficking:(a) 52 packets containing not less than 299 g of crystalline substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than 202.03 g of methamphetamine, at your residence in Block 174C Hougang Avenue 1 #05-1565; and(b) 7 packets containing not less than 3.26 g of crystalline substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than 2.18 g of methamphetamine, on your person,totalling 204.21 g of methamphetamine, without any authorisation under the Act or the Regulations made thereunder, and you have thereby committed an offence under Section 5(1)(a) read with Section 5(2) and punishable under Section 33(1) of the Act.3rd Chargeon or around 21 September 2019, in Singapore, did traffic in a Class A Controlled Drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “Act”), to wit, by selling to one Zainudin Bin Mohd Seedee (NRIC No. S1583213D) 12 straws containing not less than 8.49 g of granular/powdery substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than 0.13 g of diamorphine, without any authorisation under the Act or the Regulations made thereunder, and you have thereby committed an offence under Section 5(1)(a) and punishable under Section 33(1) of the Act. 2 At the trial, the Prosecution proceeded against Hamir on the 1st Charge (Amended) and applied for the 2nd Charge and the 3rd Charge to be stood down.",
        "The facts": "",
        "The arrest of Hamir": "3 On 23 September 2019 at about 9.09am, a party of officers from the Central Narcotics Bureau (“CNB”) arrested one Zainudin bin Mohd Seedee (“Zainudin”) at the ground floor lift landing of Blk 15 Marine Terrace. The CNB officers who arrested Zainudin included Assistant Superintendent Peter Tan Teo Hai (“ASP Tan”) and Staff Sergeant Mohammad Fazuri bin Isnin (“SSgt Fazuri”). During the arrest, three exhibits comprising 12 straws containing diamorphine were recovered from Zainudin (marked as “ZMS-A1”, “ZMS-A2A” and “ZMS-A3A”).1Foot Note 1×Prosecution’s Opening Statement (“POS”) at para 4.ASP Tan recorded a contemporaneous statement from Zainudin at the latter’s residential address. Subsequently, Zainudin was escorted to the CNB office at Tanglin Police Divisional Headquarters (the “Enforcement ‘E’ office”) for further investigations.2Foot Note 2×PS16 at paras 2–3, Agreed Bundle (“AB”) at p 137; PS19 at paras 2–3, AB at p 166. 4 While at the Enforcement “E” office, SSgt Fazuri searched Zainudin’s mobile phone to determine the phone number of Zainudin’s drug supplier. According to Zainudin, his drug supplier was a male Malay by the name of “Amir”. Sometime later, a call from “Amir” came through on Zainudin’s mobile phone, and SSgt Fazuri instructed Zainudin not to answer the call.3Foot Note 3×PS19 at para 4, AB at pp 166–167. 5 Later the same day, between 12.00pm and 3.00pm, SSgt Fazuri instructed Zainudin to call and message “Amir” pretending that he (Zainudin) would like to buy drugs from “Amir”. “Amir” and Zainudin agreed to meet in the vicinity of the Marine Parade underpass leading towards East Coast Park (the “Marine Parade Underpass”), located near the NTUC FairPrice supermarket at 6 Marine Parade Central (the “NTUC FairPrice”), for the drug purchase.4Foot Note 4×PS19 at para 5, AB at p 167.SSgt Fazuri informed ASP Tan of this arrangement.5Foot Note 5×PS16 at para 4, AB at p 137; PS19 at para 6, AB at p 167. 6 Subsequently, at about 1.58pm, ASP Tan conducted an operational briefing at the Enforcement “E” office to a party of CNB officers (collectively, the “officers”) comprising:6Foot Note 6×PS16 at para 4, AB at pp 137–138; PS19 at para 6, AB at p 167. (a) SSgt Fazuri;(b) Staff Sergeant Poh Hong Leng (“SSgt Poh”);(c) Sergeant (2) Wee Heng Long, Roy (“Sgt (2) Wee”);(d) Senior Staff Sergeant Mansor Bin Zaiman (“SSSgt Mansor”);(e) Sergeant (2) Nurfatin Binte Kamsani (“Sgt (2) Nurfatin”); and(f) Volunteer Special Constabulary Staff Sergeant William Teo (“VSC SSgt Teo”). 7 ASP Tan briefed the officers that Zainudin indicated that Hamir, who was known to Zainudin as “Amir”, was believed to be a drug trafficker selling heroin (the street name for “diamorphine”) in Marine Parade and he would be in the vicinity of the NTUC FairPrice later that day. ASP Tan then instructed the officers to proceed to the vicinity of the NTUC FairPrice and wait for further instructions.7Foot Note 7×PS16 at para 5, AB at p 138; PS19 at para 7, AB at p 167.SSgt Fazuri handed Zainudin’s mobile phone over to Sergeant (3) Ibrahim bin Jaafar (“Sgt (3) Ibrahim”) who remained at the Enforcement “E” office with Zainudin, so that he could supervise the communication between Zainudin and “Amir”.8Foot Note 8×PS19 at para 8, AB at pp 167–168. 8 On the same day at about 2.41pm, the officers arrived at the vicinity of the NTUC FairPrice. ASP Tan then deployed the officers to look out for Hamir.9Foot Note 9×PS16 at para 6, AB at p 138; PS19 at para 9, AB at p 168. 9 At around 3.00pm, Sgt (2) Wee spotted Hamir walking on the pavement in the vicinity of the NTUC FairPrice. He took a photograph of Hamir and sent it to the officers’ internal WhatsApp group chat, seeking confirmation that the person in the photograph was Hamir. When Hamir’s identity was confirmed, the officers arrested him. ASP Tan instructed Sgt (3) Ibrahim to use Zainudin’s mobile phone to call Hamir’s mobile phone to confirm that the person that they had arrested was Hamir (or “Amir” as known to Zainudin). A photograph of Hamir was also taken and sent to Sgt (3) Ibrahim, who then showed it to Zainudin who confirmed that the person arrested was indeed his drug supplier, “Amir”.10Foot Note 10×PS16 at para 7, AB at p 138. 10 Thereafter, SSgt Poh conducted a search on Hamir while Sgt (2) Wee searched a brown paper bag and the items therein carried by Hamir.11Foot Note 11×Statement of Agreed Facts (“ASOF”) at para 3; PS17 at para 6, AB at p 156; PS18 at para 6, AB at p 159.From Hamir’s front right pocket, SSgt Poh recovered one pouch (marked as “MHL-A2”) which contained seven packets containing granular/powdery substance (marked as “MHL-A2A”).12Foot Note 12×POS at para 8; PS17 at para 6, AB at p 156; Exhibit P60. 11 Sgt (2) Wee recovered one brown paper bag which Hamir was carrying in his hand (marked as “MHL-A1”).13Foot Note 13×ASOF at para 3.The brown paper bag contained the following:14Foot Note 14×ASOF at para 3; POS at para 8; PS18 at para 6, AB at p 159; PS17 at para 6, AB at p 156. (a) one packet secured with a rubber band (marked as “MHL-A1A”) containing four packets of granular/powdery substance (marked as “MHL-A1A1”);15Foot Note 15×Exhibit P58.(b) one pouch (marked as “MHL-A1B”) containing 35 straws containing granular/powdery substance (marked as “MHL-A1B1”);16Foot Note 16×Exhibit P59.and(c) one pouch (marked as “MHL-A1B2”) containing seven packets containing crystalline substance (marked as “MHL-A1B2A”),17Foot Note 17×Exhibit P59.which was subsequently analysed and found to be methamphetamine. This forms part of the quantity of methamphetamine in the 2nd Charge which has been stood down. 12 The search ended at 3.23pm and SSgt Poh took custody of all the seized exhibits. Thereafter, the officers escorted Hamir to his official residential address located at Blk 174C Hougang Avenue 1, #05-1565 (the “Unit”) to conduct a house raid.18Foot Note 18×PS16 at para 9, AB at p 138; PS17 at para 7, AB at p 156; PS19 at para 12, AB at p 168. 13 At about 3.45pm, together with Hamir and the seized exhibits, the officers arrived at the Unit to conduct a search. At about 3.50pm, Hamir surrendered to SSgt Fazuri items that were suspected to be drugs or related to drugs from six different locations in the master bedroom of the Unit.19Foot Note 19×PS16 at para 9, AB at p 139; PS17 at para 8, AB at p 157; PS19 at para 13, AB at p 168.These locations were pointed out to the officers by Hamir. The search ended at 5.00pm and SSgt Fazuri took custody of all the seized exhibits found in the master bedroom.20Foot Note 20×PS16 at para 10, AB at p 139; PS17 at para 9, AB at p 157; PS19 at para 14, AB at p 170.The seized exhibits from the master bedroom were subsequently analysed by the Health Sciences Authority (“HSA”) to contain diamorphine and methamphetamine. As the proceeded charge deals with diamorphine, the focus will be on diamorphine. The following exhibits, among others, were seized by SSgt Fazuri:21Foot Note 21×POS at para 11; PS19 at para 13, AB at pp 168–170. (a) from the first rack of the shelf in the master bedroom (“Location A”), one black shoe box (marked as “A1”), containing:(i) one black bundle secured with black tape (marked as “A1A”) and granular powdery substance (marked as “A1A1”);(ii) one black bundle secured with black tape (marked as “A1B”) and granular powdery substance (marked as “A1B1”);(iii) one packet of granular/powdery substance (marked as “A1C”);(iv) one packet tied with one rubber band containing granular/powdery substance (marked as “A1D”);(v) one packet of granular/powdery substance (marked as “A1E”);(vi) one packet of granular/powdery substance (marked as “A1F”);(vii) one packet of granular/powdery substance (marked as “A1G”);(viii) one packet of granular/powdery substance (marked as “A1H”); and(ix) one packet and one straw containing granular/powdery substance (marked as “A1J”);(b) from under the bed in the master bedroom (“Location B”):(i) one packet (marked as “B1A”) containing 20 packets of granular/powdery substance (marked as “B1A1”);(ii) 12 packets of granular/powdery substance (marked as “B1B”);(iii) one packet (marked as “B2A”) containing 37 straws of granular/powdery substance (marked as “B2A1”);(iv) one packet (marked as “B2B”) containing two packets of granular/powdery substance (marked as “B2B1”); and(v) one packet (marked as “B2C”) containing four packets of granular/powdery substance (marked as “B2C1”);(c) from a white drawer in the master bedroom (“Location C”):(i) one packet (marked as “C1”) containing five packets of granular/powdery substance (marked as “C1A”);(ii) one packet (marked as “C2”) containing five packets of granular/powdery substance (marked as “C2A”);(iii) one packet (marked as “C3”) containing five packets of granular/powdery substance (marked as “C3A”);(iv) one packet (marked as “C4”) containing five packets of granular/powdery substance (marked as “C4A”);(v) one packet (marked as “C5”) containing five packets of granular/powdery substance (marked as “C5A”);(vi) one packet (marked as “C6”) containing five packets of granular/powdery substance (marked as “C6A”);(vii) one packet (marked as “C7”) containing five packets of granular/powdery substance (marked as “C7A”);(viii) one packet (marked as “C8”) containing five packets of granular/powdery substance (marked as “C8A”);(ix) one packet (marked as “C9”) containing five packets of granular/powdery substance (marked as “C9A”);(x) one packet (marked as “C10”) containing five packets of granular/powdery substance (marked as “C10A”);(xi) one packet (marked as “C11”) containing five packets of granular/powdery substance (marked as “C11A”);(xii) one packet (marked as “C12”) containing five packets of granular/powdery substance (marked as “C12A”); and(xiii) one packet (marked as “C13”) containing five packets of granular/powdery substance (marked as “C13A”). 14 At about 5.28pm, in the living room of the Unit, ASP Tan recorded a contemporaneous statement from Hamir under s 22 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) regarding the seized drug exhibits and his drug activities (“P165” – the “First Contemporaneous Statement”).22Foot Note 22×ASOF at para 5; AB at pp 142–146.Hamir chose to speak in English. ASP Tan posed questions to Hamir in English and Hamir answered in English.23Foot Note 23×PS16 at paras 11–12, AB at p 139.The recording of the First Contemporaneous Statement concluded at about 6.43pm and it was given by Hamir voluntarily without inducement, threat or promise.24Foot Note 24×ASOF at para 21; NEs 4 May 2022 at p 19 lines 16–26. 15 Subsequently, at about 7.40pm on the same day, Investigation Officer Station Inspector Asilah Binte Rahman (“IO Asilah”) arrived at the Unit together with Inspector Yip Lai Peng (“Insp Yip”) and officers from the CNB Forensic Response Team (“FORT”) to conduct preliminary on-scene investigations.25Foot Note 25×PS34 at para 3, AB at p 203; PS36 at para 3, AB at p 214. 16 At about 8.06pm, ASP Tan informed IO Asilah that he needed to record another contemporaneous statement from Hamir to obtain more information about his drug supplier, one “Rosli”. IO Asilah, Insp Yip and the FORT officers then left the Unit and waited outside the Unit. At about 8.16pm, in the living room of the Unit, ASP Tan recorded a further contemporaneous statement under s 22 of the CPC from Hamir (“P166” – the “Second Contemporaneous Statement”).26Foot Note 26×ASOF at para 7; AB at pp 147–148.Hamir chose to speak in English. ASP Tan posed questions to Hamir in English and Hamir answered in English.27Foot Note 27×PS16 at paras 14–15, AB at pp 139–140.The Second Contemporaneous Statement was given voluntarily by Hamir without inducement, threat or promise.28Foot Note 28×ASOF at para 21; NEs 4 May 2022 at p 19 lines 16–26. 17 At about 8.36pm, IO Asilah, Insp Yip and the FORT officers entered the Unit again and commenced photo-taking of the Unit. The photo-taking ended at 8.53pm.29Foot Note 29×PS36 at para 5, AB at p 215.At about 9.26pm, a final search of the Unit was conducted. The search ended at 9.36pm. Thereafter IO Asilah, Insp Yip and the FORT officers left the Unit.30Foot Note 30×ASOF at para 8.",
        "Post-arrest events at the Enforcement “E” office": "18 On the night of 23 September 2019 at 9.50pm, Hamir was escorted by the officers from the Unit to the Enforcement “E” office.31Foot Note 31×PS16 at para 17, AB at p 140.At about 10.20pm, urine samples were collected from Hamir for an Instant Urine Test and Hamir was asked by Sgt (2) Nurfatin to verify his particulars on the labels.32Foot Note 32×ASOF at paras 9–10; PS19 at para 20, AB at p 171; PS22 at paras 13–15, AB at p 181.Hamir then signed on the labels.33Foot Note 33×ASOF at para 10.Hamir’s urine samples were handed to the staff of the Analytical Toxicology Laboratory of the HSA on 24 September 2019.34Foot Note 34×ASOF at para 11.",
        "Post-arrest events at CNB HQ": "Processing of exhibits 19 On 24 September 2019 at about 2.20am, Hamir and the officers arrived at the CNB Headquarters (“CNB HQ”) Exhibit Management Room 2 (“EMR 2”) with the seized exhibits. At about 2.27am, IO Asilah and Insp Yip arrived at Exhibit Management Room 1 (“EMR 1”), which was located beside EMR 2. With the assistance of the FORT officers, the exhibits were photographed individually in EMR 1, with Hamir witnessing the entire process from EMR 2 through a glass panel. Concurrently, the FORT officers took DNA swabs of the drug exhibits. The photographing of the exhibits concluded at about 6.48am.35Foot Note 35×PS19 at para 22, AB at p 172; PS18 at para 18, AB at p 162. 20 At about 6.54am in EMR 1, the exhibits were weighed by Insp Yip and IO Asilah noted down the gross weight of the exhibits in her field diary. Hamir witnessed the weighing process from EMR 2 through a glass panel. The exhibit weighing process concluded at about 7.22am. Hamir appended his signature on IO Asilah’s field diary to acknowledge the weight of the drug exhibits. Thereafter, the officers at Central Police Division Lock-up took custody of Hamir.36Foot Note 36×ASOF at para 12; PS19 at para 23, AB at p 172; PS34 at para 9, AB at p 206; PS36 at para 13, AB at p 218; PS18 at para 19, AB at p 162. Medical and psychiatric examinations 21 On 24 September 2019 at about 3.20pm, Hamir was examined by Dr Lin Hanjie of the Healthway Medical Group Pte Ltd (“Dr Lin”) before Hamir’s statements were recorded (see [24(c)] below).37Foot Note 37×ASOF at para 13.Later that day at about 5.20pm, Hamir was again examined by Dr Lin for a post-statement medical examination.38Foot Note 38×ASOF at para 14. 22 On 14 October 2019, 16 October 2019 and 17 October 2019, Dr Sajith Sreedharan Geetha of the Institute of Mental Health (“Dr Geetha”) conducted a psychiatric assessment on Hamir by interviewing and examining Hamir at the Complex Medical Centre, Changi Prison.39Foot Note 39×ASOF at para 15. DNA sampling 23 On 27 September 2019 at about 3.55pm, at the Central Police Division Lock-up, Hamir’s blood specimen was obtained for DNA profiling and analysed by the HSA.40Foot Note 40×ASOF at para 16.",
        "Statements given by Hamir": "24 During and following the raid of the Unit, a total of eight statements were recorded from Hamir between 23 September 2019 and 26 May 2020 pertaining to the proceeded charge. Hamir confirmed that all of his statements were given by him voluntarily without any inducement, threat or promise.41Foot Note 41×ASOF at para 21; NEs 4 May 2022 at p 18 lines 30–32, p 19 lines 20–26, p 20 lines 7–15, p 21 lines 24–27, p 25 lines 3–5, p 28 lines 24–32, p 29 lines 1–3, p 30 lines 17–22.Therefore, they were admitted as evidence. Hamir’s statements were taken on the following occasions: (a) On 23 September 2019, the day of Hamir’s arrest, from about 5.28pm to about 6.43pm in the living room of the Unit, ASP Tan recorded P165, the First Contemporaneous Statement from Hamir under s 22 of the CPC (see [14] above).42Foot Note 42×AB at pp 142–146. (b) On 23 September 2019, the day of Hamir’s arrest, from about 8.16pm to about 8.23pm in the living room of the Unit, ASP Tan recorded P166, the Second Contemporaneous Statement from Hamir under s 22 of the CPC (see [16] above).43Foot Note 43×AB at pp 147–148. (c) On 24 September 2019 from 3.56pm to 5.01pm in the Police Cantonment Complex (“PCC”) Lock-up Interview Room 4, IO Asilah recorded a cautioned statement pursuant to s 23 of the CPC from Hamir (“P169” – the “Cautioned Statement”).44Foot Note 44×AB at pp 236–239, PS36 at para 19, AB at p 220.Hamir chose to speak in Malay, and Malay Language Officer Farhan Bin Sani (“Farhan”) served as the interpreter.45Foot Note 45×PS36 at paras 16–21, AB at pp 219–221; PS35 at paras 4–7, AB at pp 207–208. (d) On subsequent occasions, five long statements were given by Hamir voluntarily without inducement, threat or promised pursuant to s 22 of the CPC as follows: (i) a statement recorded on 26 September 2019 from 3.49pm to 5.41pm in the PCC Lock-up Interview Room 12 by IO Asilah, where Farhan served as the interpreter (“P170” – the “First Long Statement”);46Foot Note 46×AB at pp 240–243; PS36 at paras 28–32, AB at pp 222–223; PS35 at paras 13–15, AB at pp 209–210.(ii) a statement recorded on 28 September 2019 from 10.23am to 1.12pm in the PCC Lock-up Interview Room 12 by IO Asilah, where Farhan served as the interpreter (“P171” – the “Second Long Statement”);47Foot Note 47×AB at pp 244–248; PS36 at paras 33–37, AB at pp 223–224; PS35 at paras 16–18, AB at p 210.(iii) a statement recorded on 30 September 2019 from 2.03pm to 4.56pm in the PCC Lock-up Interview Room 12 by IO Asilah, where Farhan served as the interpreter (“P172” – the “Third Long Statement”);48Foot Note 48×AB at pp 249–253; PS36 at paras 38–42, AB at pp 224–225; PS35 at paras 20–22, AB at p 211.(iv) a statement recorded on 1 October 2019 from 10.56am to 12.55pm in the PCC Lock-up Interview Room 11 by IO Asilah, where Farhan served as the interpreter (“P173” – the “Fourth Long Statement”);49Foot Note 49×AB at pp 254–257; PS36 at paras 43–47, AB at pp 225–226; PS35 at paras 23–25, AB at pp 211–212.and(v) a statement recorded on 1 October 2019 from 3.09pm to 6.20pm in the PCC Lock-up Interview Room 11 by IO Asilah, where Farhan served as the interpreter (“P174” – the “Fifth Long Statement”).50Foot Note 50×AB at pp 258–262; PS36 at paras 48–52, AB at pp 226–227; PS35 at paras 27–29, AB at pp 212–213.",
        "Drug analysis": "25 The exhibits that were found on Hamir at the time of his arrest at Marine Parade (see [10] and [11] above) were analysed by Analyst Lim Hui Jia Stephanie of the HSA. These were 11 packets and 35 straws containing not less than 68.16g (gross) of granular/powdery substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than 1.8g (net) of diamorphine:51Foot Note 51×POS at para 9; AB at pp 29–31. S/NExhibit NoDescriptionRaw weight of granular/ powdery substance (g)Analysed weight of diamorphine (g)1MHL-A1A1Four packets of granular/powdery substance14.070.322MHL-A1B135 straws of granular/powdery substance29.300.823MHL-A2ASeven packets of granular/powdery substance24.790.66Total68.161.8 26 The exhibits that were seized by the officers from the Unit (see [13] above) were analysed by Analysts Lim Hui Jia Stephanie and Yu Lijie of the HSA. These were 112 packets and 38 straws containing not less than 1,525.55g (gross) of granular/powdery substance which was pulverised and homogenised into a powdery substance analysed and found to contain not less than 37.91g (net) of diamorphine, as follows:52Foot Note 52×POS at para 12; AB at pp 16–28, 32–47. S/NExhibit NoDescriptionRaw weight of granular/ powdery substance (g)Analysed weight of diamorphine (g)1A1A1One packet of granular/powdery substance282.28.152A1B1One packet of granular/powdery substance177.84.853A1COne packet of granular/powdery substance145.44.204A1DOne packet of granular/powdery substance228.55.335A1EOne packet of granular/powdery substance3.920.116A1FOne packet of granular/powdery substance27.470.537A1GOne packet of granular/powdery substance2.070.038A1HGranular/powdery substance found between the sticky tape and the packet0.35Contained diamorphine9A1JOne packet and one straw of granular/powdery substance1.32Contained diamorphine10B1A120 packets of granular/powdery substance70.441.9311B1B12 packets of granular/powdery substance41.960.8512B2A137 straws of granular/powdery substance33.360.9413B2B1One packet of granular/powdery substance3.470.01One packet of granular/powdery substance7.540.0414B2C1Four packets of granular/powdery substance13.810.1615C1AFive packets of granular/powdery substance37.140.4716C2AFive packets of granular/powdery substance37.360.5317C3AFive packets of granular/powdery substance37.451.0118C4AFive packets of granular/powdery substance37.371.0919C5AFive packets of granular/powdery substance37.321.0620C6AFive packets of granular/powdery substance37.520.8721C7AFive packets of granular/powdery substance37.411.0122C8AFive packets of granular/powdery substance37.420.8623C9AFive packets of granular/powdery substance37.440.9624C10AFive packets of granular/powdery substance37.150.9725C11AFive packets of granular/powdery substance37.450.4626C12AFive packets of granular/powdery substance37.441.0127C13AFive packets of granular/powdery substance37.470.48Total1525.55At least 37.91 27 On 23 September 2019 at about 10.20pm, urine samples were taken from Hamir.53Foot Note 53×PS19 at para 20, AB at p 171.The analysis of the urine samples by the HSA revealed a negative result,ie, Hamir did not consume any drugs prior to his arrest.54Foot Note 54×PS12 and PS13, AB at pp 103–124.",
        "DNA analysis": "28 Eighty-seven exhibits taken from the Unit were analysed by the HSA for DNA. No interpretable DNA profile was obtained from most of the exhibits.55Foot Note 55×PS10, AB at pp 67–93.Hamir’s DNA profile was detected from the following exhibits as follows:56Foot Note 56×POS at para 14; AB at pp 94–98. S/NExhibit NoDescription1A1One black shoe box with tape retrieved from Location A2A1AOne taped black bundle with plastic packaging found in A13C7One re-sealable plastic bag retrieved from Location C",
        "Mobile phone forensics": "29 Various mobile phones and one SIM card were seized from Hamir during his arrest.57Foot Note 57×PS34 at para 5, AB at pp 204–205.These were submitted to the Technology Crime Forensic Branch (“TCFB”), Technology Division of the Criminal Investigation Department, for forensic examination.58Foot Note 58×ASOF at para 18; AB at pp 279–462.The TCFB reports containing the results of the mobile phone forensic examination were translated by Malay Language Officer Nor Zahirah Binte Zainuddin.59Foot Note 59×ASOF at para 19; AB at pp 474–574.",
        "The parties’ cases": "",
        "The Prosecution’s case": "30 The Prosecution submits that the search of Hamir’s person and the Unit uncovered a total of not less than 39.71g (net) of diamorphine (“the Drugs”) in Hamir’s possession. Diamorphine is a Class A Controlled Drug listed in the First Schedule to the MDA. At all material times, Hamir was not authorised under the MDA or the Misuse of Drugs Regulations (1999 Rev Ed) to possess diamorphine.60Foot Note 60×POS at para 13. 31 The Prosecution’s case against Hamir is that Hamir had actual possession and actual knowledge of the nature of the Drugs, and that he possessed the Drugs for the purpose of trafficking. In the alternative, the Prosecution submits that Hamir had actual possession and actual knowledge of the nature of the Drugs, and he is unable to rebut the presumption of trafficking under s 17(c) of the MDA.61Foot Note 61×POS at para 19. 32 The Prosecution relies on the HSA’s analyses showing that Hamir’s DNA was found on some of the seized exhibits,namely Exhibits A1, A1A, and C7.62Foot Note 62×POS at para 14.The Drugs and the DNA analyses by the HSA corroborate the admissions in Hamir’s statements, which were voluntarily given by Hamir and accurately recorded by the recording officers (see [24] above). Essentially, Hamir admitted that he purchased the Drugs (which he refers to as “panas”, the street name for diamorphine) from Rosli and one “Thambi” for the purpose of selling them to others. Hamir would repackage the “panas” he bought from them into smaller quantities to be resold for a profit.63Foot Note 63×POS at para 15. 33 Finally, the Prosecution relies on the evidence of Dr Geetha to show that Hamir was not of unsound mind at or around the time of the offence, and that he is fit to plead in Court.64Foot Note 64×POS at para 18. 34 To prove all of the above, the Prosecution relies on the evidence of 45 witnesses by way of their respective conditioned statements pursuant to s 264 of the CPC and supplemented, where necessary, with their oral testimony.65Foot Note 65×POS at para 3.",
        "Hamir’s defence": "Inaccuracy of the statements 35 The Defence argues that the statements taken from Hamir were inaccurately recorded. The Defence submits that the First Long Statement and the Third Long Statement were not read back to Hamir.66Foot Note 66×NEs 13 April 2022 at p 9 line 2 to p 10 line 22, p 14 line 23 to p 15 line 20.In addition, while it is written in the Cautioned Statement that Farhan served as the interpreter,67Foot Note 67×Exhibit P169, AB at p 236.Hamir claims that this was not actually the case. Instead, IO Asilah was the one who interpreted the charge in the Cautioned Statement to Hamir and acted as translator.68Foot Note 68×NEs 4 May 2022 at p 15 lines 5–30, p 40 line 29 to p 41 line 13. 36  Hamir also claims that he could not recall making certain parts of his long statements: (a) In his First Long Statement, Hamir stated that during the raid on the Unit, “[t]hroughout the whole time, I witnessed the officers packing the ‘stuff’”.69Foot Note 69×Exhibit P170 at para 9, AB at p 243.Hamir claims that he did not make this statement.70Foot Note 70×NEs 4 May 2022 at p 25 lines 7–19. (b) In his Second Long Statement, Hamir stated that after the raid on the Unit, “one officer placed my jewelleries and cash into two ziplock bags which were sealed”.71Foot Note 71×Exhibit P171 at para 11, AB at p 244.Hamir claims that he did not actually witness the sealing of the ziplock bags that contained his personal items.72Foot Note 72×NEs 4 May 2022 at p 22 lines 8–11.He also did not state “… I was escorted to Cantonment CNB office where I witnessed the photo-taking of all the item seized”.73Foot Note 73×Exhibit P171 at para 13, AB at p 245; NEs 4 May 2022 at p 22 lines 14–19. 37 As for the contemporaneous statements, ASP Tan testified that when he recorded the First Contemporaneous Statement at the Unit, he showed Hamir photographs of the coffeeshop at Blk 136 Marsiling Road where Hamir claimed he met Rosli (“P165A” and “P165B” – the “Coffeeshop Photographs”) on his mobile phone.74Foot Note 74×NEs 6 April 2022 at p 19 lines 1–6.However, Hamir claims that ASP Tan did not show him the Coffeeshop Photographs at the Unit.75Foot Note 75×NEs 4 May 2022 at p 11 lines 3–32, p 12 lines 1–8.Hamir further claims that it was IO Asilah who showed him the Coffeeshop Photographs later on at the PCC.76Foot Note 76×NEs 4 May 2022 at p 11 lines 31–32, p 12 lines 3–6. 38 Hamir maintains that all his statements were nevertheless given voluntarily without any inducement, threat or promise.77Foot Note 77×ASOF at para 21; NEs 4 May 2022 at p 18 lines 30–32, p 19 lines 20–26, p 20 lines 7–15, p 21 lines 24–27, p 25 lines 3–5, p 28 lines 24–32, p 29 lines 1–3, p 30 lines 17–22. Break in the chain of custody 39 The Defence also argues that there is a reasonable doubt that Hamir was not in fact in possession of the Drugs as specified in the 1st Charge (Amended). The Defence argues there was a break in the chain of custody, such that the total weight of the Drugs reflected in the 1st Charge (Amended),ie, 39.71g, is not the actual weight of the Drugs that were seized from Hamir at the time of his arrest and during the subsequent house raid on the Unit.78Foot Note 78×NEs 5 April 2022 at p 43 lines 15–28. 40 Hamir seeks to cast a reasonable doubt on the officers’ accounts of his arrest and the subsequent processing of the exhibits by raising the following: (a) ASP Tan was not present when the weighing of the Drugs was done after the raid on the Unit.79Foot Note 79×NEs 6 April 2022 at p 9 lines 4–7; NEs 4 May 2022 at p 10 line 30 to p 11 line 2. (b) Hamir was handcuffed at the back and showed SSgt Fazuri the location of the Drugs in the master bedroom of his Unit by using his lips and moving his head.80Foot Note 80×NEs 4 May 2022 at p 12 lines 21–32.This is a material difference from SSgt Fazuri’s account, where he claimed that Hamir was handcuffed at the front and used his fingers to point out the location of the Drugs in the master bedroom of the Unit.81Foot Note 81×NEs 6 April 2022 at p 51 lines 18–29. (c) When Hamir was witnessing the officers weighing the Drugs in EMR 1 from EMR 2 through the glass panel, he did not see the weight of the Drugs as he was seated “quite a distance” away (around one to two feet), and he was very tired as the weighing was done early in the morning.82Foot Note 82×NEs 4 May 2022 at p 22 line 23 to p 23 line 9.Contrary to what they claim, the officers also did not read the weight of the exhibits out to Hamir.83Foot Note 83×NEs 4 May 2022 at p 23 lines 10–12. Possession for the purpose of consumption 41 Hamir stated in the First Contemporaneous Statement and during his in-Court testimony that some of the “panas” he had in his possession was for his own consumption.84Foot Note 84×AB at p 143.Out of the 11 packets and 35 straws found on him when he was arrested by the officers, only five packets were meant for sale to Zainudin.85Foot Note 85×NEs 4 May 2022 at p 44 lines 7–24.The 35 straws of diamorphine (Exhibit MHL-A1B1) found in the black pouch (Exhibit MHL-A1B)86Foot Note 86×Exhibit P59.were meant for his own consumption.87Foot Note 87×NEs 4 May 2022 at p 47 lines 27–32.According to Hamir, Exhibits MHL-A1B1 and MHL-A1B were found in his pocket, not in the brown paper bag as stated by the officers.88Foot Note 88×NEs 4 May 2022 at p 50 lines 5–18.The seven packets of diamorphine (Exhibit MHL-A2A) in the pouch (Exhibit MHL-A2),89Foot Note 89×Exhibit P60.which the officers described as being seized from his pocket, were in fact in the brown paper bag he was carrying in his hand.90Foot Note 90×NEs 4 May 2022 at p 50 lines 14–18. 42 As for the Drugs found in the Unit, the following drugs found at Location B,ie, under the bed in the master bedroom of the Unit, were meant for his own consumption:91Foot Note 91×NEs 4 May 2022 at p 52 lines 1–15; Exhibit P41. (a) 37 straws of diamorphine (Exhibit B2A1);(b) two packets of diamorphine (Exhibit B2B1); and(c) four packets of diamorphine (Exhibit B2C1). 43 Accordingly, there is reasonable doubt as to whether the entirety of the diamorphine found in his possession was for the purpose of trafficking. Knowledge of the Drugs and possession for the purpose of trafficking 44 Hamir admits to having knowledge of the nature of the Drugs and to possessing some of the Drugs for the purpose of trafficking. Hamir’s admissions in this regard are reflected in his statements: (a) In the First Contemporaneous Statement, Hamir stated that the drug exhibits found in the master bedroom of the Unit were “[h]eroin and [i]ce”.92Foot Note 92×Exhibit P165, AB at p 142.Ice is the street name for methamphetamine. Hamir also stated that the diamorphine, which he refers to as “panas”, were “meant for selling and [his] own consumption”, while the ice was “only meant for selling as [he did not] abuse ice”.93Foot Note 93×Exhibit P165, AB at p 143. (b) In the Cautioned Statement, Hamir stated that he initially sold “ice” in June 2019. He subsequently started selling “heroin” after he was informed in August 2019 that his wife needed to undergo a medical operation.94Foot Note 94×Exhibit P169, AB at p 239. (c) In the First Long Statement, Hamir stated that on 23 September 2019 at about 1.50pm, he left the Unit with the “panas” and “ice” that Zainudin, his regular customer, had ordered earlier that day at about 1.00pm.95Foot Note 95×Exhibit P170 at paras 4–5, AB at pp 241–242. (d) In the Second Long Statement, Hamir stated that he started selling “ice” in early April 2019 by obtaining the “ice” from suppliers in Geylang96Foot Note 96×Exhibit P171 at paras 16–18, AB at pp 245–246.and later, Rosli.97Foot Note 97×Exhibit P171 at paras 19–23, AB at pp 246–248.Hamir would repack the “ice” into smaller ziplock bags before selling it to customers in the Geylang area.98Foot Note 98×Exhibit P171 at para 16–17, AB at pp 245–246. (e) In the Third Long Statement, Hamir explained that he started selling “panas” in early September 2019 by obtaining it from Rosli and Thambi.99Foot Note 99×Exhibit P172 at paras 29–34, AB at pp 250–253. (f) In the Fourth Long Statement, Hamir stated that he started selling the “panas” he obtained from Rosli and Thambi after asking his addict friends and customers about the market rate of “panas” and repacking the “panas” into smaller packets and short straws.100Foot Note 100×Exhibit P173 at paras 38–41, AB at pp 255–256. (g) In the Fifth Long Statement, Hamir explained that he had about six to seven regular customers and he also sold “panas” to passers-by. One of his regular customers was Zainudin, who had bought “panas” from him on three occasions.101Foot Note 101×Exhibit P174 at paras 44–45, AB at p 258. Hamir’s account of the drug trafficking 45 Since 2016, Hamir was working part-time to deliver items for one “Abang Jo”. However, in early 2019, the job offers he received from Abang Jo decreased and Hamir struggled to financially support his family. It was around this time that his wife had diabetic symptoms and her leg started swelling. As it was difficult for Hamir to find a job because of his past convictions and he needed money urgently to pay for his wife’s medical bills, Hamir decided to sell “ice” in early April 2019.102Foot Note 102×NEs 4 May 2022 at p 6 lines 11–18; Exhibit P171 at paras 15–16, AB at p 245. 46 Hamir bought “ice” from a variety of suppliers in Geylang, including one “Ah Ti”.103Foot Note 103×Exhibit P171 at para 16, AB at p 245.After buying “ice” from these suppliers, Hamir would repack the “ice” into smaller ziplock bags to sell in the Geylang area.104Foot Note 104×Exhibit P171 at paras 16–18, AB at pp 245–246. 47 Hamir then came to know of one supplier called “Rosli”, and met him in early May 2019 to buy “ice”.105Foot Note 105×Exhibit P171 at paras 19–21, AB at pp 246–247.Rosli recognised Hamir as they were both previously detained at the drug rehabilitation centre (“DRC”) at Selarang Park in 1983 or 1984, and saw each other during yard time.106Foot Note 106×Exhibit P165, AB at p 143; Exhibit P174 at para 47, AB at p 259.Hamir met Rosli at a coffeeshop at Blk 136 Marsiling Road Singapore 730136, to buy drugs.107Foot Note 107×Exhibit P165, AB at pp 143–145; Exhibit P171 at paras 20–23, AB at pp 247–248; Exhibit P172, AB at pp 249–250; NEs 5 April 2022 at p 96 line 4 to p 97 line 11.I pause to note that Hamir stated in his First Contemporaneous Statement that he met Rosli at a coffeeshop located at Blk 136 Marsiling Road.108Foot Note 108×Exhibit P165 at Q9 and A9, AB at p 145.However, he claimed in his Second Long Statement109Foot Note 109×Exhibit P171 at para 20, AB at p 247.and Third Long Statement110Foot Note 110×Exhibit P172 at paras 26 and 31, AB at p 249 and p 251.that he met Rosli at a coffeeshop located at “Woodlands Blk 36”. I shall address this discrepancy at [64] below. 48 In June 2019, Rosli asked Hamir if he would like to sell “panas”.111Foot Note 111×Exhibit P172 at para 29, AB at p 250.Hamir agreed and he saved up $9,000 to purchase “panas” from Rosli and Thambi in early September 2019.112Foot Note 112×Exhibit P172 at paras 29–34, AB at pp 250–253.After obtaining the “panas”, Hamir asked his addict friends and customers about the market rate of “panas”. He then repacked the “panas” he obtained from Rosli and Thambi into smaller packets to sell at Geylang.113Foot Note 113×Exhibit P173 at paras 38–41, AB at pp 255–256. 49 On 22 September 2019, one of Hamir’s customers at Geylang ordered 30 packets of “panas” from him. Hamir collected $2,100 in cash and promised to deliver the “panas” to the customer the next day. Hamir and the customer exchanged numbers and Hamir saved the customer’s name as “Anel” in his mobile phone.114Foot Note 114×Exhibit P173 at para 41, AB at p 256. 50 On 23 September 2019 at about 10.00am, Hamir called Anel and Anel asked Hamir to meet at around 4.00pm. Hamir then switched off his mobile phone until 12.00pm, which was when he received a missed call alert from Zainudin. Hamir was subsequently arrested on his way to meet Zainudin to sell him the “panas” Zainudin ordered. When Hamir was arrested he did not bring along the “panas” Anel ordered as he did not want to bring too much “panas” with him.115Foot Note 115×Exhibit P173 at para 42, AB at pp 256–257. Necessity 51 Hamir relies on his account of the facts at [45] above to plead the common law defence of necessity.116Foot Note 116×Defence’s Closing Submissions (“DCS”) at paras 39–45.Hamir claims that he was “financially strapped” and “urgently needed money for his wife’s operation to save her life”. Hamir thus “committed the offence under duress of circumstances or necessity”.117Foot Note 117×DCS at para 46.",
        "Issues to be determined": "52 The main issues are as follows: (a) Were Hamir’s statements recorded accurately? (b) Are the elements of the 1st Charge (Amended) made out beyond a reasonable doubt? In particular, has the Prosecution established beyond a reasonable doubt that Hamir possessed the Drugs for the purpose of trafficking? (c) Was there a break in the chain of custody of the Drugs seized such that the weight of the Drugs reflected in the 1st Charge (Amended) comprising 39.71g of diamorphine is not the actual weight of the Drugs that were seized from Hamir at the time of his arrest and during the raid on the Unit? (d) Is Hamir entitled to rely on the defence of necessity?",
        "My decision": "",
        "Accuracy of the statements": "53 I shall first consider the accuracy and truth of Hamir’s statements which he had acknowledged were given by him voluntarily without inducement, threat or promise. The applicable law 54 Illustration (d) to s 279(1) of the CPC provides that “[n]o ancillary hearing is necessary” where the challenge does not relate to the voluntariness of the statement. 55 Under Explanation 2(e) to s 258(3) of the CPC, a statement that is otherwise admissible will not be rendered inadmissible merely because the recording officer or the interpreter did not fully comply with the procedure in s 22 or s 23 of the CPC when recording the accused’s statement. My findings 56 Hamir gave his confirmation that all his statements were given voluntarily without any inducement, threat or promise.118Foot Note 118×ASOF at para 21; NEs 4 May 2022 at p 18 lines 30–32, p 19 lines 20–26, p 20 lines 7–15, p 21 lines 24–27, p 25 lines 3–5, p 30 lines 17–22.Hamir gave this confirmation for each of his statements after he was given time to look through them and had them translated to him. In these circumstances, I found that there was no need for an ancillary hearing and admitted Hamir’s statements as evidence. 57 It is clear from the several statements given voluntarily by Hamir that he confessed to the 1st Charge (Amended), namely, that on 23 September 2019 the diamorphine that was found on him at the time of his arrest near the NTUC FairPrice and in his Unit were for the purpose of trafficking, although he alleged that a small quantity was meant for his own personal consumption. When Hamir gave evidence in Court he substantially maintained his confession in his statements to the officers. Although Hamir disputes certain minor matters in his statements, these are not serious and do not affect his confession to the charge of possession of diamorphine for the purpose of trafficking. I shall deal with these matters below. 58 The qualification that a small quantity of the diamorphine was for his own consumption was not borne out from the evidence and it does not have a ring of truth. I shall deal with this claim at [(3)(A)]–[95] below. 59 The uncontested portions of Hamir’s statements are as follows. Hamir explained that he was so driven by desperation for money to pay for the medical bills of his wife, Zainab Binte Hashim, who was suffering from diabetes, that he had to turn to drug trafficking. On 25 December 2019, her right leg had to be amputated below the knee because of systemic sepsis following from her background of peripheral arterial disease and diabetes.119Foot Note 119×AB at p 595. 60 In his defence, Hamir explained that he first started to sell “ice” in early April 2019 and he bought the supply of “ice” from his friends in Geylang which he would repack into smaller quantities to sell to others.120Foot Note 120×Exhibit P171 at para 16, AB at pp 245–246.In early May 2019 he met Rosli, whom he knew previously from their detention in the DRC together. Hamir then bought his supply of “ice” from Rosli.121Foot Note 121×Exhibit P171 at para 21, AB at p 247.Later, Rosli introduced him to sell “panas” as well.122Foot Note 122×Exhibit P172 at para 29, AB at p 250.Hamir was a former abuser of “panas” and he bought supplies of “panas” from Rosli and Thambi for the purpose of selling them to others in smaller quantities. Eventually, Hamir was arrested when he arranged to sell “panas” to Zainudin on 23 September 2019. This evidence is not disputed by Hamir. 61 I shall now deal with the minor matters that Hamir raised regarding his statements. He raised the following minor procedural lapses: (a) the First Long Statement and the Third Long Statement were not read back to him; (b) the Cautioned Statement was not translated to him by Farhan and instead it was IO Asilah who acted as the translator (see [35] above); and (c) IO Asilah (and not ASP Tan) only showed him the Coffeeshop Photographs of Blk 136 Marsiling Road at the PCC.123Foot Note 123×NEs 4 May 2022 at p 11 line 31 to p 12 line 8. 62 First, I note that IO Asilah wrote at the end of both the First Long Statement and the Third Long Statement that the statements were read back to Hamir. According to IO Asilah, Hamir also made amendments to the First Long Statement and the Third Long Statement.124Foot Note 124×NEs 13 April 2022 at p 16 lines 12–17, p 20 lines 11–13.In Court, Hamir also confirmed that the contents of the First Long Statement and the Third Long Statement were largely accurate,125Foot Note 125×NEs 4 May 2022 at p 20 line 7 to p 21 line 14, p 25 line 21 to p 26 line 6.save for a minor inaccuracy which I consider at [68]–[69] below. This put to rest the concerns that the contents of the First Long Statement and the Third Long Statement were inaccurate as they were purportedly not read back to Hamir. 63 Second, as the Prosecution points out, when Farhan was on the stand, it was not put to Farhan that Farhan did not interpret the charge in the Cautioned Statement to Hamir. I agree with the Prosecution that this shows that Hamir’s belated claim that Farhan did not interpret the Cautioned Statement to him is an afterthought.126Foot Note 126×NEs 4 May 2022 at p 41 lines 8–13. 64 Third, I note that the coffeeshop is located at Blk 136 Marsiling Road as recorded in the First Contemporaneous Statement and not Woodlands Blk 36 as recorded in Hamir’s Second Long Statement and Third Long Statement. This was confirmed by ASP Tan.127Foot Note 127×NEs 5 Apr 2022 at p 96 line 28 to p 97 line 11.Even if ASP Tan did not show Hamir the Coffeeshop Photographs at the Unit itself, Hamir agreed that ASP Tan showed him the following:128Foot Note 128×NEs 4 May 2022 at p 40 lines 10–20. Q So Mr Hamir, I’m putting it to you that ASP Peter Tan did show you these two photographs, except that they were on his phone and not in the hard copy printed out that you see now at P165A and P165B. A  I disagree, Sir. Q  ASP Peter had to have shown you the photograph of the kopitiam, otherwise you would not have been able to confirm that that was the kopitiam in your answer at A9 in your contemporaneous statement. A  ASP Tan showed me a photograph from his phone. And it is like a GPS map showing an arrow pointing towards a certain area, certain place. I told him thekopitiamis at Block 136 so using his phone, he showed me that is this the road I took a taxi to go to thatkopitiam, yes. Yes, Sir. [emphasis in original] 65 Even if ASP Tan only showed Hamir a “GPS map” or “the road [Hamir] took a taxi to go to [the coffeeshop]”, it is clear that what was shown enabled Hamir to confirm that the coffeeshop he met Rosli at was indeed located at Blk 136 Marsiling Road. Thus, even if ASP Tan did not show Hamir the Coffeeshop Photographs specifically, this minor difference does not detract from the accuracy of Hamir’s First Contemporaneous Statement,ie, that he met Rosli at a coffeeshop located at Marsiling Road. Hamir confirmed that the contents of the First Contemporaneous Statement are accurate.129Foot Note 129×NEs 4 May 2022 at p 35 lines 7–9.Further, Hamir also affirmed that he met Rosli at a coffeeshop located in Woodlands in his Second Long Statement,130Foot Note 130×Exhibit P171 at para 20, AB at p 247.the contents of which Hamir also confirmed were accurate.131Foot Note 131×NEs 4 May 2022 at p 23 line 29 to p 24 line 13. 66 I turn to consider the substantive inaccuracies in Hamir’s statements as alleged by Hamir. I find that the alleged inaccuracies in Hamir’s statements pointed out by the Defence are minor. The alleged minor inaccuracies do not affect the material portions of Hamir’s statements which concern his confessions that go towards proving the elements of the 1st Charge (Amended), in particular, his confession that the diamorphine found on him at the vicinity of the NTUC FairPrice and in the Unit were for the purpose of sale or trafficking. Further, Hamir’s alleged inaccuracies are rebutted by the evidence of the officers. 67 First, I find Hamir’s claim that he did not see the officers seal the ziplock bag containing his personal items to be of no consequence. Hamir’s failure to witness the sealing of the ziplock bag is immaterial as it contained only personal items such as jewellery and do not concern the subject matter of the 1st Charge (Amended). 68 Second, Hamir claims that he did not make the following statements in the First Long Statement and the Second Long Statement respectively (see [36] above): (a) “[t]hroughout the whole time, I witnessed the officers packing the ‘stuff’”;132Foot Note 132×Exhibit P170 at para 9, AB at p 243.and(b) “… I was escorted to Cantonment CNB office where I witnessed the photo-taking of all the item seized”.133Foot Note 133×Exhibit P171 at para 13, AB at p 245. 69 Regarding the statement at [68(a)] above, multiple officers gave evidence that Hamir witnessed them weigh the Drugs and pack them into ziplock bags. Both ASP Tan and SSgt Fazuri testified that Hamir witnessed the seizure and weighing of the exhibits as he was in the master bedroom when the weighing was conducted in front of him.134Foot Note 134×NEs 6 April 2022 at p 7 lines 16–25, p 54 lines 4–11. 70 Regarding the statement at [68(b)] above, multiple officers gave evidence that Hamir witnessed the photo-taking and weighing of the drug exhibits in EMR 1 while seated in EMR 2: (a) Sgt (2) Wee gave evidence that Hamir witnessed the entire photo-taking and exhibit weighing process from EMR 2 through the glass panel separating EMR 1 from EMR 2.135Foot Note 135×PS18 at paras 18–19, AB at p 162.Sgt (2) Wee’s role was to hand the exhibits to IO Asilah for the photo-taking. After which, he joined Hamir in EMR 2 while the exhibits were being weighed in EMR 1.136Foot Note 136×NEs 7 April 2022 at p 31 lines 2–8. (b) SSSgt Mansor gave evidence that Hamir witnessed the entire exhibit weighing and photo-taking process in EMR 1.137Foot Note 137×PS20 at paras 14–15, AB at p 175; NEs 7 April 2022 at p 76 line 18 to p 77 line 4.SSSgt Mansor testified that Hamir, while in EMR 2, could “see through the glass panel… what is happening in the other side”,ie, EMR 1.138Foot Note 138×NEs 7 April 2022 at p 72 line 31 to p 73 line 4. 71 Having regard to all of the above, I find that the purported inaccuracies alleged by Hamir to be present in his statements are minor and do not raise a reasonable doubt as to the accuracy of his statements that go towards proving the elements of the 1st Charge (Amended). Accordingly, I ascribe full weight to Hamir’s statements.",
        "Whether the elements of the 1st Charge (Amended) are made out beyond a reasonable doubt": "The applicable law and presumptions 72 I shall consider the applicable law and presumptions that go towards determining whether the elements of the 1st Charge (Amended) are made out beyond a reasonable doubt. 73 It is well-established that in order to make out an offence of trafficking in a controlled drug under s 5(1)(a) of the MDA, the Prosecution must prove three elements (seeMuhammad Ridzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59]): (a) the accused had possession of a controlled drug (which may be proved or presumed under s 18(1) of the MDA or deemed under s 18(4) of the MDA);(b) the accused had knowledge of the nature of the drug (which may be proved or presumed under s 18(2) of the MDA); and(c) the accused’s possession of the controlled drug was for the purpose of trafficking which was not authorised. 74 In relation to the first element of possession, apart from proving actual possession, consideration may also be had to the presumption of possession as set out in s 18(1) of the MDA, which reads as follows: 18.—(1)  Any person who is proved to have had in his possession or custody or under his control — (a)  anything containing a controlled drug; (b)  the keys of anything containing a controlled drug; (c)  the keys of any place or premises or any part thereof in which a controlled drug is found; or (d)  a document of title relating to a controlled drug or any other document intended for the delivery of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug in his possession. 75 In relation to the second element of knowledge, apart from proving actual knowledge, consideration may also be had to the presumption of knowledge as set out in s 18(2) of the MDA, which reads as follows: (2)  Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. 76 The Court of Appeal inObeng Comfort v Public Prosecutor[2017] 1 SLR 633 at [34]–[36] explained the presumptions under s 18 of the MDA as follows: 34 … For the purposes of s 18(1), what we are concerned with iswhether the thing in issue exists and whether the accused in fact has possession, control or custody of the thing in issue. The thing in issue is the container, the key or the document of title. In this sense, this provision deals with secondary possession of the drug in that the accused possesses, controls or has custody of something which has the drug or which relates to the title in, or delivery of, the drug. … Once the Prosecution proves that the thing in issue exists and that the accused has possession, control or custody of the thing in issue, the effect of s 18(1) is to raise a presumption of fact, which is that the accused, by virtue of his possession, control or custody of the thing in issue, is presumed to possess the drugs which are contained in or are related to the thing in issue. 35To rebut the presumption in s 18(1), the accused has to prove, on a balance of probabilities, that he did not have the drug in his possession. In this context, the most obvious way in which the presumption can be rebutted is by establishing that the accused did not know that the thing in issue contained that which is shown to be the drug in question. Thus, for instance, the presumption could be rebutted successfully if the accused is able to persuade the court that the drug was slipped into his bag or was placed in his vehicle or his house without his knowledge. … 36 Where the presumption in s 18(1) of the MDA is invoked by the Prosecution and is then rebutted successfully by the accused, the Prosecution would have failed to prove that the accused was in possession of the drug. There would be no need to consider the next issue of whether the accused had knowledge of the nature of the drug. However,if an accused is either (a) proved to have had the controlled drug in his possession; or (b) presumed under s 18(1) of the MDA to have had the controlled drug in his possession and the contrary is not proved, the presumption under s 18(2) that he has knowledge of the nature of the drug would be invoked. This follows because an accused person, who, it has been established, was in possession of the controlled drug should be taken to know the nature of that drug unless he can demonstrate otherwise.To rebut the presumption in s 18(2), the accused must prove, on a balance of probabilities, that he did not have knowledge of the nature of the controlled drug(in effect, that he did not have themens reaof the offence). InDinesh Pillai a/l K Raja Retnam v PP[2012] 2 SLR 903 (“Dinesh Pillai”), this court observed (at [18]) that the accused can do so by showing that “he did not know or could not reasonably be expected to have known the nature of the controlled drug”. [emphasis added] 77 In relation to the third element concerning such possession being for the purpose of trafficking, s 2 of the MDA defines trafficking as follows: “traffic” means — (a)  to sell, give, administer, transport, send, deliver or distribute; or (b)  to offer to do anything mentioned in paragraph (a), otherwise than under the authority of this Act, and “trafficking” has a corresponding meaning; 78 With regard to the Prosecution’s alternative argument, the presumption concerning trafficking is laid out in s 17 of the MDA: 17.Any person who is proved to have had in his possession more than — (a)  100 grammes of opium; (b)  3 grammes of morphine; (c)2 grammes of diamorphine; (d)  15 grammes of cannabis; (e)  30 grammes of cannabis mixture; (f)  10 grammes of cannabis resin; (g)  3 grammes of cocaine; (h)25 grammes of methamphetamine; (ha)  113 grammes of ketamine; or (i)  10 grammes of any or any combination of the following: (i)  N, α-dimethyl-3,4-(methylenedioxy)phenethylamine; (ii)  α-methyl-3,4-(methylenedioxy)phenethylamine; or (iii)  N-ethyl-α-methyl-3,4-(methylenedioxy)phenethylamine, whether or not contained in any substance, extract, preparation or mixture, shall be presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his possession of that drug was not for that purpose. [emphasis added] 79 The reference to “possession” in s 17 of the MDA entails proof of both the fact of possessionandknowledge of what is being possessed (seeZainal bin Hamad v Public Prosecutor and another appeal[2018] 2 SLR 1119 (“Zainal”) at [49]). Therefore, where the Prosecution intends to rely on the presumption of trafficking in s 17 of the MDA, the facts of both possession and knowledge must be proved(seeZainalat [52]). Where the Prosecution relies on the presumption of trafficking under s 17 of the MDA, they cannot simultaneously rely on the presumptions of possession and knowledge under ss 18(1) and 18(2) of the MDA respectively (seeZainalat [38] and [42]–[45]). My findings 80 Having considered all the relevant evidence at the conclusion of the trial, I am satisfied that the elements of the 1st Charge (Amended) under s 5(1)(a) read with s 5(2) of the MDA are made out beyond a reasonable doubt. (1) Possession of the Drugs 81 It was not contested that Hamir had physical possession and custody of the brown paper bag in which some of the Drugs were contained. Therefore, by virtue of s 18(1)(a) of the MDA, he would be presumed to have had those Drugs in his possession. It was also not contested that Hamir had access to the Unit in which the Drugs were found. Accordingly, by virtue of s 18(1)(c) of the MDA, he is presumed to have had possession of the Drugs which were seized from the Unit. Finally, it is also not disputed that Hamir had physical possession and custody of the Drugs that were found in his pocket. 82 In any event, actual possession has been proven on the facts. Hamir consistently admitted across all his statements that the Drugs belonged to him. From as early as in his First Contemporaneous Statement, Hamir admitted that he had physical possession and custody of the Drugs: Q3)  What are all these? (pointing to all the drug exhibits found inside the master bedroom occupied by [Hamir]. Please refer to the field diary for the details of the case exhibits seized) A3) Heroin and ice. Q4) Who does all the drugs belong to? A4)  All mine. 83 I, therefore, find that Hamir had possession of the Drugs. (2) Knowledge of the nature of the Drugs 84 I am satisfied that Hamir had actual knowledge of the nature of the Drugs. It is clear from the First Contemporaneous Statement that Hamir knew the nature of the Drugs as he was able to identify them as [h]eroin and [i]ce” when asked by ASP Tan.139Foot Note 139×Exhibit P165, AB at p 142.Hamir also admitted in his Fifth Long Statement that “[a]ll [his] ‘ice’ and ‘panas’ supplies, which was found during [his] arrest, were supplied by “Rosli”.140Foot Note 140×Exhibit P174 at para 47, AB at p 259.This clearly shows that Hamir had knowledge of the nature of the Drugs. In any event, I am of the view that pursuant to s 18(2) of the MDA, Hamir may be presumed to know the nature of the Drugs. (3) Possession for the purpose of trafficking (A) Hamir’s allegation that some of the Drugs seized were meant for his own consumption 85 To summarise, for the Drugs seized from his person during the arrest, Hamir claims that the 35 straws of diamorphine (Exhibit MHL-A1B1) were meant for his own consumption. For the Drugs seized from the Unit during the raid, Hamir claims that the following were meant for his own consumption: (a) 37 straws of diamorphine (Exhibit B2A1);(b) two packets of diamorphine (Exhibit B2B1); and(c) four packets of diamorphine (Exhibit B2C1). 86 Hamir also relies on the psychiatric report of Dr Geetha. Dr Geetha noted that Hamir had a history of heroin abuse and “used to take 1-2 straws per day”.141Foot Note 141×AB at p 132 at para 12; DCS at para 38. 87 Hamir’s claim that the drugs stated at [85] above were meant for his own consumption is unconvincing based on the evidence before this Court. Hamir’s description of Exhibit MHL-A1B1,ie, the 35 straws of diamorphine found on him during his arrest, was materially different from the version given by the officers. While Hamir asserted that the straws were found in his pocket, the arresting officers, namely SSgt Poh and Sgt (2) Wee, gave evidence that the straws were found in the brown paper bag Hamir was carrying in his hand.142Foot Note 142×PS17 at para 6, AB at p 156; PS18 at para 6, AB at p 159.Further, when SSgt Poh and Sgt (2) Wee were on the witness stand, it was not put to them by Hamir’s counsel that they had mistakenly recorded the location from which the 35 straws of diamorphine were retrieved. This leads me to conclude that Hamir’s claim that the officers had confused their description of where the Drugs were found on Hamir is an afterthought. 88 Further, Hamir’s claim that some of the Drugs found on him at the time of his arrest and at the Unit were meant for his own consumption was raised belatedly. The first time Hamir identified the specific Drugs that were meant for his own consumption was when he was questioned by the Court, after being cross-examined by the Prosecution and re-examined by the Defence counsel.143Foot Note 143×NEs 4 May 2022 at p 47 line 27 to p 52 line 15.Save for Hamir’s First Contemporaneous Statement, nowhere in his other statements did Hamir mention that some of the Drugs were meant for his own consumption. In fact, Hamir went into great detail in his statements as to how he procured “panas” from Rosli for the purpose of trafficking. Hamir admitted in the First Contemporaneous Statement that the Drugs were purchased from Rosli for the purpose of selling them to others for a profit.144Foot Note 144×Exhibit P165, AB at p 143.There were also numerous other admissions in the First Contemporaneous Statement and his long statements which he gave voluntarily to IO Asilah, where Hamir gave details on why he purchased the Drugs for the purpose of reselling them at a profit and how much he would sell them for: (a) In his First Contemporaneous Statement, Hamir stated that he would sell the Drugs at: (i) three straws of “panas” for $50, (ii) one packet of “panas” for $120, and (iii) one set of 16 packets of “panas” for $600.145Foot Note 145×Exhibit P165, AB at p 143. (b) In his Second Long Statement, Hamir explained that he decided to sell drugs as he needed money urgently in order to pay for his diabetic wife’s medical bills.146Foot Note 146×Exhibit P171 at para 15, AB at p 245. (c) In his Third Long Statement, Hamir detailed how Rosli asked him if he wanted to sell “panas” instead of “ice” and Hamir agreed.147Foot Note 147×Exhibit P172 at para 29, AB at p 250. 89 Hamir explained why he did not mention his defence of consumption in his long statements as follows:148Foot Note 148×NEs 4 May 2022 at p 52 lines 20–28. Court:  Right, can you tell us which part of your statement that you informed the CNB officers that the drugs were meant for your own consumption and some of them were meant for you to sell. Witness: It’s not mentioned in the statement. Court:   Why didn’t you mention it in your statement? Witness: When I was arrested at that time, Sir, I was having a lot of things in my mind. It disturbed my---my---my mind---my mind, Sir. When they asked me questions, I merely answered to their questions. That’s all. 90 Most crucially, Hamir’s claims that he was consuming diamorphine at the time of his arrest and intended to consume some of the diamorphine he was in possession of is rebutted by his negative urine test result of his urine sample taken on the day of his arrest. Further, Hamir also denied consuming drugs in his statement. In his Second Long Statement, Hamir stated the following:149Foot Note 149×Exhibit P171 at para 14, AB at p 245. I am not a drug abuser and that is why my urine samples were negative. The last time I abused drugs was in 2009. I was abusing ‘panas’ at that point of time. I was sent to DRC and I was released in 2010. Since then, I did not abuse any type of drugs. 91 Similarly, in his Fifth Long Statement, Hamir stated that “[t]ill today, I do not abuse any types of drugs”.150Foot Note 150×Exhibit P174 at para 55, AB at p 262.Hamir also told Dr Geetha that he had stopped consuming diamorphine.151Foot Note 151×Exhibit P164 at para 14, AB at p 132.Dr Geetha’s opinion is that “[t]here is no history of consumption of any drugs in the past year”.152Foot Note 152×Exhibit P164 at para 25, AB at p 134. 92 Finally, Hamir also readily admitted during cross-examination that he had possession of the Drugs for the purpose of sale :153Foot Note 153×NEs 4 May 2022 at p 44 lines 1–27. Q:  The drugs in your home you bought from one Rosli and one Thambi, you had packed or repacked these drugs for the purpose of selling. A:  Yes, that’s correct. Q:  All these drugs found in your home, the la---the 112 packets and 38 straws, you kept them in your home for the purpose of selling. A:  Yes, for selling, Sir. ... Q:  And the total amount of heroin found on your person and in your house totalled 39.71 grams of diamorphine, all of which were intended for sale. A:  I agree, Sir. 93 Having regard to the above, I find that Hamir’s belated assertion that some of the Drugs were meant for his consumption is an afterthought. Thus, the Defence has failed to raise a reasonable doubt in the Prosecution’s case that Hamir possessed the Drugs for the purpose of trafficking. (B) Quantity of the Drugs seized that were allegedly meant for Hamir’s consumption 94 In any case, the breakdown of the weight of the Drugs that Hamir identified in Court as meant for his own consumption is as follows: S/NExhibitDescriptionAnalysed weight of diamorphine (g)1MHL-A1B135 straws of diamorphine found on Hamir’s body at the time of his arrest0.822B2A137 straws of diamorphine found at Location B (under the bed in the master bedroom)0.943B2B1Two packets of diamorphine found at Location B (under the bed in the master bedroom)0.054B2C1Four packets of diamorphine found at Location B (under the bed in the master bedroom)0.16Total Analysed Weight of Diamorphine (g)1.97 95 Therefore, for completeness, even taking Hamir’s case at its highest and assuming the drugs identified at [(B)] above were indeed meant for his own consumption, the remaining weight of diamorphine in Hamir’s possession for the purpose of trafficking is 37.74g. This remains above the capital threshold of 15g. 96 The Defence has thus failed to raise a reasonable doubt that the Drugs reflected in the 1st Charge (Amended) were meant for Hamir’s consumption. Conclusion on the elements of the 1st Charge (Amended) 97 In summary, I make the following findings: (a) The Drugs were found on Hamir at the time of his arrest and in the Unit during the subsequent house raid. The presumption of possession in s 18(1) of the MDA thus applies. In any event, I am satisfied that actual possession has been proven on the facts. (b) Hamir admitted to knowing the nature of the Drugs in his First Contemporaneous Statement and Fifth Long Statement. In any event, he is presumed to know the nature of the Drugs under s 18(2) of the MDA. (c) Hamir’s belated assertion that some of the Drugs were meant for his own consumption is contradicted by evidence and is an afterthought. It is clear from Hamir’s various statements which I am satisfied were given by him voluntarily that he possessed the Drugs for the purpose of trafficking. 98 I, therefore, find that all three elements of the 1st Charge (Amended) under s 5(1)(a) read with s 5(2) of the MDA are made out beyond a reasonable doubt.",
        "Chain of custody": "99 The key issue to be determined is whether there was a break in the chain of custody of the Drugs from the time they were seized from Hamir and the Unit, such that the weight of the Drugs reflected in the 1st Charge (Amended),ie, 39.71g, is not the actual weight of the Drugs. The applicable law 100 The Court of Appeal inMohamed Affandi bin Rosli v Public Prosecutor and another appeal[2019] 1 SLR 440 explained the applicable principles when considering whether a reasonable doubt has been raised as to the integrity of the chain of custody. The majority of the Court comprising Sundaresh Menon CJ and Chao Hick Tin SJ stated the following at [39]: … It is well established that the Prosecution bears the burden of proving beyond a reasonable doubt that the drug exhibits analysed by the HSA are the very ones that were initially seized by the CNB officers from the accused. …it is first incumbent on the Prosecution to establish the chain.This requires the Prosecution to account for the movement of the exhibits from the point of seizure to the point of analysis. In the context of the Prosecution establishing the chain of custody, the Defence may also seek to suggest that there is a break in the chain of custody. This refers not necessarily to challenging the Prosecution’s overall account but to showing that at one or more stages, there is a reasonable doubt as to whether the chain of custody may have been broken. Where this is shown to be the case and a reasonable doubt is raised as to the identity of the drug exhibits, then the Prosecution has not discharged its burden … To put it another way, the Prosecution must show anunbroken chain. There cannot be a single moment that is not accounted for if this might give rise to a reasonable doubt as to the identity of the exhibits … [emphasis in original] 101 I turn to consider the chain of custody of the drug exhibits. My findings (1) Seizure of the Drugs at Marine Parade 102 Sgt (2) Wee and SSgt Poh were the arresting officers who recovered the Drugs from Hamir. At the trial, both officers gave cogent and clear evidence on how this occurred. SSgt Poh recovered one pouch (MHL-A2) which contained seven packets containing granular/powdery substance (MHL-A2A) from Hamir’s right pocket. Sgt (2) Wee recovered a brown paper bag carried by Hamir (MHL-A1) containing: (a) one packet with a rubber band (MHL-A1A) containing four packets of granular/powdery substance (MHL-A1A1); and(b) one pouch (MHL-A1B) containing 35 straws containing granular/powdery substance (MHL-A1B1). 103 Exhibits MHL-A1, MHL-A1A, MHL-A1A1, MHL-A1B, MHL-A1B1 and MHL-A2A were subsequently analysed by the HSA and found to contain diamorphine.Both officers were also able to identify the exhibits they seized in the bundle of photographs.154Foot Note 154×NEs 7 April 2022 at p 7 line 1 to p 8 line 14 and p 41 lines 3–7.Sgt (2) Wee testified that he handed over custody of the exhibits he seized from Hamir (ie, MHL-A1, MHL-A1A, MHL-A1A1, MHL-A1B and MHL-A1B1) to SSgt Poh,155Foot Note 155×PS18 at para 7, AB at p 159.who held onto custody of all the exhibits. The exhibits were placed in ziplock bags.156Foot Note 156×NEs 7 April 2022 at p 44 lines 7–23.Sgt (2) Nurfatin testified that she recorded the seizure of the exhibits in the field diary used by the officers for Hamir’s case (“P343” – the “Field Diary”). (2) Seizure of the Drugs from the Unit and the Field Diary 104 An integral piece of evidence relating to the issue of the chain of custody is the Field Diary. The Field Diary contained contemporaneous records of the drug exhibits that were seized at the time of Hamir’s arrest and during the house raid on the Unit, along with the weight of each drug exhibit. SSgt Fazuri explained that he would: (a) retrieve the Drugs from one location in the master bedroom of the Unit as pointed out by Hamir, (b) weigh them in front of Hamir using Hamir’s weighing scale,157Foot Note 157×NEs 6 April 2022 at p 67 lines 14–15.and (c) place them inside a ziplock bag. SSgt Fazuri then moved to a different location in the master bedroom of the Unit and repeated the process.158Foot Note 158×NEs 6 April 2022 at p 45 lines 11–14, p 54 lines 1–11.Both ASP Tan and SSgt Fazuri testified that Hamir witnessed the seizure and weighing of the drug exhibits, and the recording of the weight of the drug exhibits in the Field Diary in the Unit.159Foot Note 159×NEs 6 April 2022 at p 7 lines 14–22, p 54 lines 7–11.ASP Tan testified that Hamirsawthe drug exhibits being weighed and that Hamir alsoheardthe weight of each drug exhibit as the officers “talked about” the weight of the drugs as Hamir was close by.160Foot Note 160×NEs 6 April 2022 at p 8 lines 21–26.SSgt Fazuri also corroborated ASP Tan’s account that ASP Tan was present as the drug exhibits were being weighed.161Foot Note 161×NEs 6 April 2022 at p 52 lines 19–32.This rebutted Hamir’s claim that ASP Tan was not present. 105 In Court, Hamir testified that he did not see the weight of the drug exhibits while they were being weighed in the master bedroom of the Unit, because he was located “quite a distance from” the officers.162Foot Note 162×NEs 4 May 2022 at p 10 lines 21–26.This, in my view, did not raise a reasonable doubt about the integrity of the chain of custody. I find that it is sufficient for Hamir to have witnessed theprocessof weighing the drug exhibits, as opposed to the exact individual weights that were being noted and written down. 106 Hamir claims that he was handcuffed at the back and not the front as SSgt Fazuri described. ASP Tan testified that he could not remember whether Hamir was handcuffed at the back or the front. Nonetheless, according to ASP Tan, it was possible that Hamir was handcuffed at the front because of his hefty size. If the officers were to handcuff him to the back, they would have required more than one handcuff.163Foot Note 163×NEs 5 April 2022 at p 106 lines 14–22.In any case,howHamir was handcuffed is not material as the parties are not in dispute that Hamir did indeed show the officers where the Drugs were located in the master bedroom of the Unit. 107 Regarding the entries in the Field Diary, Sgt (2) Nurfatin wrote most of the entries on 23 September 2019 which were timed “1503” and “1523 hrs”, with the notable exceptions being a few cancellations (“the earlier entries”).164Foot Note 164×NEs 7 April 2022 at p 12 lines 3–13, p 33 lines 8–11, p 88 line 3 to p 90 line 14.Sgt (2) Wee wrote most of the entries on 23 September 2019 which were timed “1545 hrs” to “1700 hrs” (“the later entries”).165Foot Note 165×NEs 7 April 2022 at p 11 lines 18–21. 108 The Field Diary contains contemporaneousrecords of the exhibits seized with their gross weight from Hamir when he was arrested and also during the raid of the Unit. Thus, I ascribe significant weight to the Field Diary in my analysis of whether there was a break in the chain of custody between the initial seizure of the exhibits and when the exhibits were later weighed in the EMR 1. 109 Sgt (2) Wee confirmed that he was the author of the later entries. He also testified that the earlier entries were written by Sgt (2) Nurfatin.166Foot Note 166×NEs 7 April 2022 at p 12 lines 3–17.When Sgt (2) Nurfatin was cross-examined, Sgt (2) Nurfatin initially denied writing any of the entries in the Field Diary, even after having sight of the original Field Diary:167Foot Note 167×NEs 7 April 2022 at p 87 lines 1–13. Johan:  Your Honour, I would like to---witness to refer to the field diary, P343. I’m going to ask the witness one question and see how it goes from there. Q: Did you make any entries in the field diary, P343? Any? A: No, Your Honour. (Conferring) … Yap:  If I may assist, Your Honour. Perhaps I could just give the original to the witness stand? Just for the witness to refer to. Johan:  Sure. Court:  So, Ms Nurfatin? Q:  Yes, what’s your answer, witness? A: No, Your Honour, none of it is my handwriting, Your Honour. 110 However, when she was specifically asked to look at the earlier entries during re-examination by the Prosecution, she identified that the handwriting of the earlier entries matched her own. She also explained that she had misheard the Defence counsel and believed the Defence counsel’s question was limited to a specific page of the Field Diary:168Foot Note 168×NEs 7 April 2022 at p 88 lines 3–14, p 90 line 21 to p 91 line 14. Q: Now, witness, can I trouble you to refer to the field diary in front of you? Turn with me to the first page. You see the entry under 1503? A:  Yes, Your Honour. Q:  On the left column, right? A:  Yes, Your Honour. Q:  There are words beside it: “Arrested B1 Muhammad Hamir B Laka”. And the NRIC number is as stated. You see that? A:  Yes, Your Honour. Q: Now, look carefully and see, tell me whether you recognise whether this handwriting belongs to---whose handwriting this belongs to. A:  That belongs to me, Your Honour. … Q: So earlier, when my learned friend, the defence counsel, asked you did you make any entries in the field diary, why did you say no and none of it was yours? A: I believe he was referring to page 3 of 3, yah. Page 3 of the field diary, Your Honour. … Court:   Well, Ms Nurfatin, Mr Johan didn’t refer you to page 3. He refer you to the field diary. Witness: I wrongfully listen, Your Honour. My apologies, Your Honour. 111 When Sgt (2) Nurfatin was asked by the Court to explain the inconsistency in her evidence again, she gave the same explanation:169Foot Note 169×NEs 7 April 2022 at p 92 lines 1–19. Court: Now, Ms Nurfatin, I just want to understand what was in your mind when Mr Johan asked you whether did you make any entries in the field diary. Witness: Your Honour, I listened---I rem---remember he asked about page 3, Your Honour. That’s why I said I did not make any writings, Your Honour, for the page 3, which I thought he was referring to, Your Honour. Court:  What? Witness: I thought he was referring to page 3 of the field diary, Your Honour. Court:  Yes, but when you saw---when the field diary---when the actual field diary was given to you to take a look at it, you had a look at it? Witness: Yes, and I still thought he was referring to only page 3, Your Honour. Court:  So did you explain to us that there were other entries made by you? Witness: No, because I was only replying with regards to page 3, Your Honour. 112 Apart from this inconsistency, the Defence also points to another inconsistency in Sgt (2) Nurfatin’s evidence with regard to the weighing of the seized exhibits in EMR 1. While Sgt (2) Nurfatin stated in her conditioned statement that the weighing was done by Insp Yip, she stated in Court that the weighing could have been done byeitherIO Asilah or Insp Yip and that she could not remember. Accordingly, the Defence argues that Sgt (2) Nurfatin was evasive in her answers170Foot Note 170×NEs 7 April 2022 at p 86 lines 25–28.and that her authorship of the earlier entries in the Field Diary is unreliable. 113 I accept Sgt (2) Nurfatin’s explanation that she had misheard the question from the Defence counsel. In that regard, I wish to highlight that the Defence counsel only asked Sgt (2) Nurfatin if she wrote any entries in the Field Diaryonce. When Sgt (2) Nurfatin gave an unexpected answer, she was not asked a follow-up question that could have led her to either realise the flaw in her understanding or to qualify her answer,ie, that she did not write any of the entrieson page 3. Sgt (2) Nurfatin also gave the same explanation,without hesitation, when she was questioned by both the Prosecution and the Court on the inconsistency in her evidence.171Foot Note 171×NEs 7 April 2022 at p 90 lines 21–30 and p 91 line 12 to p 92 line 19.In these circumstances, I accept Sgt (2) Nurfatin’s explanation that she had misheard or misunderstood the question and that she was not being evasive or uncooperative. There was really no reason for her to deny that she had made entries in the Field Diary. 114 An entirely different conclusion would be reached if: (a) the Defence counsel had specifically pointed Sgt (2) Nurfatin to the earlier entries and specifically asked her if she wrote those entries in the Field Diary, and she answered no; and (b) she answered yes when asked the same question by the Prosecution. This would be a glaring inconsistency and would raise grave cause for concern on her reliability and credibility as a witness. This was, however, not the case. 115 Thus, I find that Sgt (2) Nurfatin’s reliability and credibility as a witness is not impaired by the apparent inconsistency in her evidence. 116 On a close examination of the Field Diary, I find the contemporaneous recording of the weight of the seized exhibits to be meticulous and thorough. Each individual exhibit was carefully marked and weighed. I wish to point out that this was done with a great deal of granularity. For instance, under the entry timed “1550 hrs”, notwithstanding that there were multiple packets referenced under one exhibit “C2”, the weight of five out of six of thepackets containing granular substances was recorded. To illustrate, I reproduce the first page of the Field Diary below:  117 Further, I note that corrections were made by other officers when they came across inaccurate entries. For instance, under the entry timed “1503” which was authored by Sgt (2) Nurfatin, Sgt (2) Wee made a cancellation and ASP Tan edited the quantities of two exhibits. These edited quantities reflect the number of exhibits that were eventually analysed by the HSA. For instance, for the drug exhibit that was contemporaneously marked “A2B” in the Field Diary, Sgt (2) Nurfatin had initially recorded that the exhibit was 25 straws of heroin. ASP Tan edited this entry to denote 26 straws of heroin. The next entry marked “A2C” was correctly recorded by Sgt (2) Nurfatin to be three packets containing three straws of heroin each (nine straws in total). Adding the 26 straws (A2B) to the nine straws that were found in packets (A2C), in total, 35 heroin straws were seized from Hamir when he was arrested. This corresponds with the 35 heroin straws that were later sent to the HSA for analysis as Exhibit MHL-A1B (see [11(b)] and [25] above). 118 Having regard to the above, I find that the contemporaneous recording of the seized exhibits and their corresponding weight was carefully done in granular detail and are accurate. I, therefore, find no reason to doubt the accuracy of the contents in the Field Diary. 119 Overall, the description of the drug exhibits recorded in the Field Diary corresponds with what was eventually sent to the HSA for analysis (see,eg, [117] above). This leads to the irresistible inference that the Drugs sent to the HSA for analysis were the same as those seized from Hamir at the time of his arrest and during the raid on the Unit. This inference is further fortified by the analysis below. (3) Transport of the Drugs to the Enforcement “E” office and CNB HQ 120 After the Drugs were seized from the Unit, SSgt Fazuri and Sgt (2) Wee took custody of them before handing them over to ASP Tan at the Enforcement “E” office.172Foot Note 172×PS19 at para 20, AB at p 171; NEs 6 April 2022 at p 57 lines 23–31; PS18 at para 15, AB at p 161; NEs 7 April 2022 at p 24 lines 3–12.ASP Tan, SSgt Fazuri and Sgt (2) Wee gave evidence that after the raid on the Unit, at about 10.20pm on 23 September 2019, ASP Tan took over custody of the Drugs from SSgt Fazuri and Sgt (2) Wee for the purpose of lodging an arrest and seizure report in respect of Hamir.173Foot Note 173×PS16 at para 18, AB at p 140.Thereafter, ASP Tan described his actions as follows:174Foot Note 174×PS16 at para 20, AB at p 141. After lodging the report, I placed all the case exhibits in my cabinet and locked it. I was the only person who had custody of the key to the locked cabinet. On 24 September 2019, at about 1.45 a.m., I retrieved the case exhibits from my locked cabinet and handed these exhibits along with the abovementioned police report, to Sgt (2) Roy Wee, for him to hand over to IO Asilah for further investigations. I then left for other duties. 121 ASP Tan’s account is corroborated by Sgt (2) Wee, who stated in his conditioned statement as follows:175Foot Note 175×PS18 at paras 17–18, AB at p 162. 17. On 24 September 2019, at about 1.45 am, I took over the police report together with all the seized exhibits from ASP Peter Tan. Thereafter, SSS Mansor, SS Fazuri, Sgt (2) Nurfatin and I escorted Hamir, with all the seized items, and left Enforcement “E” office for CNB Headquarters (“CNB HQ”). 18. At about 2.10 am, my party arrived at CNB HQ. At 2.20 a.m., my party arrived at the CNB HQ Exhibit Management Room 2 (“EMR 2”) located on the third floor of CNB HQ, with Hamir and all the seized exhibits. SS Mansor then informed IO Asilah that our party of officers, together with Hamir, had arrived at EMR 2, and were ready for the photo-taking process. At about 2.27 a.m., IO Asilah and Insp Yip then arrived at Exhibit Management Room 1 (“EMR 1”), which was located beside EMR 2. Thereafter, the photo-taking process of the exhibits commenced with the assistance of the FORT officers. … [emphasis in original omitted] 122 Sgt (2) Wee’s account of the chain of custody of the Drugs as they were transported from the Enforcement “E” office to CNB HQ was corroborated by and consistent with the accounts of SSSgt Mansor, SSgt Fazuri and Sgt (2) Nurfatin.176Foot Note 176×PS20 at paras 13–14, AB at p 175; PS19 at paras 21–22, AB at pp 171–172; PS22 at paras 16–17, AB at pp 181–182. 123 The officers’ accounts of the chain of custody from the time the Drugs were seized from Hamir and the Unit to the time they were transported to the CNB HQ were consistent and withstood scrutiny during cross-examination by the Defence counsel. I find that no reasonable doubt was raised as to the integrity of the chain of custody from the time the Drugs were seized from Hamir and the Unit until they arrived at CNB HQ for processing. (4) Processing of the Drugs in EMR 1 124 The officers gave clear, detailed and consistent accounts of how they processed the exhibits at CNB HQ. After leaving the Enforcement “E” office, SSSgt Mansor, SSgt Fazuri, Sgt (2) Wee and Sgt (2) Nurfatin arrived at CNB HQ at about 2.10am with Hamir and the Drugs. At 2.20am, the officers and Hamir arrived at EMR 2 with the Drugs. At about 2.27am, IO Asilah and Insp Yip arrived at EMR 1 located next to EMR 2 to commence the photo-taking process of the exhibits in EMR 1.177Foot Note 177×PS18 at para 18, AB at p 162; PS19 at para 22, AB at p 172; PS22 at para 17, AB at p 182.During the photo-taking process, Sgt (2) Wee stood at the doorway of EMR 1 and handed over the drug exhibits individually to IO Asilah for the photo-taking.178Foot Note 178×PS18 at para 18, AB at p 162.According to IO Asilah, the drug exhibits were in ziplock bags when they were handed to her.179Foot Note 179×NEs 12 April 2022 at p 61 lines 21–26.IO Asilah would then check the drug exhibits handed to her against the arrest and seizure report lodged by ASP Tan.180Foot Note 180×NEs 12 April 2022 at p 62 lines 13–15.She then handed the individual exhibits to FORT officer, Koh Soon Kim (“Mr Koh”), who would lay out the exhibits on a piece of brown paper181Foot Note 181×NEs 12 April 2022 at p 34 lines 4–5.for photo-taking.182Foot Note 182×NEs 12 April 2022 at p 62 lines 15–16.FORT officer, Loi Kai Jun (“Mr Loi”) took photographs of the exhibits in EMR 1 under the directions of IO Asilah.183Foot Note 183×PS1 at para 3, AB at p 1.Concurrently, under IO Asilah’s instructions, FORT officer, Gayathre Kalimuthu Mogan (“Ms Mogan”), swabbed the exhibits using wet and dry cotton swabs for forensic DNA analysis. The swabs were then given to IO Asilah.184Foot Note 184×PS3 at paras 2–3, AB at p 4.After each exhibit was photographed and swabbed, it would be placed into a tamper-proof bag and handed over to either IO Asilah or Insp Yip.185Foot Note 185×NEs 12 April 2022 at p 79 lines 14–18.IO Asilah then checked the exhibits again.186Foot Note 186×NEs 12 April 2022 at p 62 line 21.The exhibit photography concluded at about 6.48am.187Foot Note 187×PS18 at para 18, AB at p 162; PS20 at para 14, AB at p 175; PS22 at para 17, AB at p 182. 125 I note that the discrepancy in the Prosecution witnesses’ description of how the drug exhibits were stored prior to the photo-taking in EMR 1 was minor. IO Asilah testified that the drug exhibits were placed in ziplock bags when they were brought into EMR 1, while valuable personal items were stored in polymer or tamper-proof bags.188Foot Note 188×NEs 12 April 2022 at p 61 lines 14–26.On the other hand, Mr Loi testified that the drug exhibits were brought into EMR 1 in tamper-proof bags.189Foot Note 189×NEs 5 April 2022 at p 52 lines 13–32.In my view, this is a minor and insignificant discrepancy which would not raise a reasonable doubt as to the integrity of the chain of custody. First, Mr Loi testified that he believed tamper-proof bags were used as it is presently CNB’s protocol.190Foot Note 190×NEs 5 April 2022 at p 53 lines 5–9.However, he could not recall if tamper-proof bags were used in the present case when the exhibits were processed in 2019.191Foot Note 191×NEs 5 April 2022 at p 68 lines 3–9.Second, and in any event, the exact type of bag in which the Drugs were stored is of little relevance. The location and movement of the drug exhibits to and within EMR 1 were still accounted for. The Defence has also not raised a shred of evidence to suggest that the drug exhibits were tampered with by virtue of their containment in ziplock bags as opposed to tamper-proof bags. 126 The Defence claims that Mr Koh lied in evidence when he claimed that he did not handle the exhibits beforethey were processed, and only packed the exhibits after the photo-taking of the exhibits had concluded.192Foot Note 192×DCS at para 10; NEs 5 April 2022 at p 79 lines 16–17.After being questioned on whether he assisted IO Asilah, Mr Koh then stated that he also helped to lay out the exhibits for the photo-taking.193Foot Note 193×NEs 5 April 2022 at p 83 lines 27–29 and p 84 lines 4–8.Again, this is a minor discrepancy in Mr Koh’s evidence and does not suggest that he was lying or was otherwise an unreliable witness. In any event, whether Mr Koh assisted with laying out the exhibits for photo-taking or not is also of no significance. 127 I shall now consider the weighing of the drug exhibits in EMR 1. At about 6.54am, the officers commenced the weighing process of the drug exhibits and IO Asilah recorded the weights in her field diary (“P345” – the “IO’s field diary”). As each exhibit was being weighed by Insp Yip,194Foot Note 194×NEs 12 April 2022 at p 35 lines 21–24.IO Asilah would ask Hamir to read out the weight of each exhibit and she would “echo” after him.195Foot Note 195×NEs 12 April 2022 at p 63 lines 7–21; NEs 13 April 2022 at p 3 lines 1–5.Hamir could, through the glass panel separating EMR 1 from EMR 2, see the weight of the exhibit reflected on the weighing scale.196Foot Note 196×NEs 12 April 2022 at p 63 lines 22–29.Multiple witnesses gave evidence that Hamir witnessed the weighing of the drug exhibits in EMR 1 from EMR 2: (a) SSgt Fazuri testified that he was seated next to Hamir in EMR 2 as Hamir looked at the weighing process happening in EMR 1.197Foot Note 197×NEs 6 April 2022 at p 61 lines 9–13. (b) IO Asilah, Sgt (2) Wee, SSSgt Mansor and Sgt (2) Nurfatin all gave evidence that Hamir witnessed the weighing of the exhibits.198Foot Note 198×PS36 at para 12, AB at p 217; PS18 at para 19, AB at p 162; PS20 at para 14, AB at p 175; PS22 at para 18, AB at p 182.Sgt (2) Wee gave further oral evidence in addition to his conditioned statement as to how he had personal knowledge that Hamir witnessed the weighing of the exhibits,ie, that he joined Hamir in EMR 2 after handing the individual exhibits to IO Asilah (see [70(a)] above). 128 Hamir disagreed that IO Asilah read out the weight of each drug exhibit after it had been weighed.199Foot Note 199×NEs 4 May 2022 at p 23 lines 10–12.I agree with the Prosecution that it is highly likely that IO Asilah did read out the weight of each drug exhibit, but Hamir could not remember this as he was not paying attention.200Foot Note 200×NEs 4 May 2022 at p 42 line 29 to p 43 line 12.This is consistent with Hamir’s testimony that he “did not give any attention” to the weighing process as the weighing was done early in the morning and he was very tired and sleepy.201Foot Note 201×NEs 4 May 2022 at p 23 lines 10–12.In any case, whether IO Asilah did in fact read out the weight of each drug exhibit is not crucial to the integrity of the chain of custody. What is important is that Hamirsawthe weighing process and appended his signature to the IO’s field diary as a mark of his assent as to the accuracy of the weights therein. These were done, and accordingly, no reasonable doubt arises from the issue of whether the weight of each drug exhibit was read aloud to Hamir. 129 After the weighing of the drug exhibits concluded at 7.22am, IO Asilah went to EMR 2 to obtain Hamir’s signature on her IO’s field diary.202Foot Note 202×PS36 at para 13, AB at p 218.Thereafter, she took custody of all the exhibits and placed them in her locked cabinet at CNB HQ to which only she had access.203Foot Note 203×PS36 at para 13, AB at p 218.The next day, on 24 September 2019 at about 2.00pm, IO Asilah handed over the exhibits to Inspector Jessica Ting Hui D’Cruz (“Insp Jessica”) of the Special Investigation Team for her to submit the exhibits to the CNB Exhibit Management Team (“EMT”).204Foot Note 204×PS36 at para 14, AB at p 219; PS31 at para 2, AB at p 198.At about 2.30pm, Insp Jessica passed the exhibits to EMT officer, Senior Staff Sergeant Chang Tat Yien (“SSSgt Chang”).205Foot Note 205×PS31 at para 3, AB at p 198; PS32 at para 2, AB at p 200.SSSgt Chang then kept the exhibits in a locked cabinet in the EMT room, to which only the EMT officers had access.206Foot Note 206×PS32 at para 3, AB at p 200; NEs 8 April 2022 at p 73 lines 3–9.The exhibits remained in the locked cabinet until EMT officer, Staff Sergeant Goh Yang Lun handed them over to the HSA on 25 September 2019 at about 3.41pm and 3.57pm.207Foot Note 207×PS28 at paras 2–3, AB at p 193; PS7 at para 2, AB at p 14; PS8 at para 2, AB at p 32. 130 The movement of the Drugs from the time they arrived at the CNB HQ to when they were eventually sent to the HSA for analysis was clearly detailed by the relevant officers. These officers also gave comprehensive and consistent accounts as to how the Drugs were processed in EMR 1,ie, the Drugs were brought into the room individually, photographed and weighed in Hamir’s presence. Having regard to all the above, I find that the Defence has not raised a reasonable doubt that there was a break in the chain of custody from the time the Drugs were seized from Hamir and the Unit to when they were processed at the CNB HQ, and when they were sent to the HSA for analysis. (5) Weight discrepancy 131 IO Asilah recorded in the IO’s field diary the weight of the drug exhibits when they were weighed in EMR 1. The pages of the IO’s field diary in which she recorded the contemporaneous weight of the drug exhibits were signed by Hamir.208Foot Note 208×Exhibit P345; NEs 4 May 2022 at p 42 lines 13–19.Given that the IO’s field diary contains the contemporaneous weight of the drug exhibits when they were weighed in EMR 1, I accord significant importance to the weight of the drug exhibits recorded therein. 132 I note that there were differences in the gross weight of each drug exhibit when weighed by IO Asilah in EMR 1 and by the HSA: ExhibitGross weight in IO’s field diaryGross weight by the HSADifference in gross weight between IO’s field diary and the HSAA1A1290.41282.2-8.21g (-2.83%)A1B1186.18177.8-8.38g (-4.50%)A1C147.75145.4-2.35g (-1.59%)A1D230.84228.5-2.34g (-1.01%)A1E8.143.92-4.22g (-51.84%)A1F32.6527.47-5.18g (-15.87%)A1G8.612.07-6.54g (-75.96%)A1H14.650.35-14.3g (-97.61%)A1J1.531.32-0.21g (-13.73%)B1A176.0670.44-5.62g (-7.39%)B1B45.6441.96-3.68g (-8.06%)B2A137.7433.36-4.38g (-11.61%)B2B112.1011.01-1.09g (-9.01%)B2C115.1013.81-1.29g (-8.54%)C1A38.9337.14-1.79g (-4.60%)C2A38.8937.36-1.53g (-3.93%)C3A38.8537.45-1.40g (-3.60%)C4A38.7637.37-1.39g (-3.59%)C5A38.7837.32-1.46g (-3.76%)C6A38.8537.52-1.33g (-3.42%)C7A38.8437.41-1.43g (-3.68%)C8A38.8137.42-1.39g (-3.58%)C9A38.8037.44-1.36g (-3.51%)C10A38.8037.15-1.65g (-4.25%)C11A38.9637.45-1.51g (-3.88%)C12A38.8337.44-1.39g (-3.58%)C13A38.9737.47-1.50g (-3.85%)MHL-A1A115.2314.07-1.16g (-7.62%)MHL-A1B133.9829.30-4.68g (-13.77%)MHL-A2A26.7424.79-1.95g (-7.29%)Total1688.4221593.71-94.71g (-5.61%) 133 InLim Swee Seng v Public Prosecutor[1995] 1 SLR(R) 32 (“Lim Swee Seng”), there was a serious discrepancy of 16.49% between the gross weight of the drugs calculated by the scientific officer and that measured by the investigating officer. While the investigating officer measured the bundles of drugs as weighing 474.11g, the scientific officer measured them as weighing 395.98g. The majority of the Court of Appeal, nevertheless, held that it was safe to convict the offender notwithstanding the substantial discrepancy in weight of 78.13g. The majority of the Court of Appeal found that the trial judge was entitled to draw an inference that the discrepancy was attributed to an error in the use of the weighing machine or in the method of weighing adopted by the investigating officer (Lim Swee Sengat [25]). 134 In the present case, the discrepancies in the weight of the drug exhibits recorded by IO Asilah versus the weight recorded by the HSA are mostly a few grams. While the eventual discrepancy of 94.63g may appear to be substantial it must be borne in mind that this figure is but a fraction of the gross weight of over 1kg or 1000g. The apparent discrepancy is still within an acceptable margin of error of 5.61%, and is much lower than that inLim Swee Seng. 135 Further, IO Asilah provided a reasonable explanation for why the weights in the IO’s field diary were greater than that recorded by the HSA. IO Asilah testified that she weighed each exhibit together with the original packaging in which the exhibit was seized. The weight of the packaging would thus add to the weight of each exhibit as recorded in the IO’s field diary.209Foot Note 209×NEs 12 April 2022 at p 69 lines 24–32.I find that her explanation is supported by the objective evidence. For instance, the weight discrepancy of Exhibit A1H is most significant at 97.61%. Exhibit A1H was recorded in ASP Tan’s arrest and seizure report to be one of “06 big pkts of granular substances btb CD”.210Foot Note 210×Exhibit P167, AB at p 151.The logical explanation from IO Asilah’s evidence is that she had weighed the entire packet with the granular/powdery substance and arrived at a weight of 14.65g. However, in the HSA report, Exhibit A1H is stated to be “not less than 0.35 gram [net] of granular/powdery substance which was found between the sticky tape and the packet”.211Foot Note 211×Exhibit P104, AB at p 21.It is clear that, unlike IO Asilah, the HSA did not weigh the entire packet, but only the granular substance found between the sticky tape and the packet. Further, I note that the weights recorded by the HSA are consistently lower than that recorded by IO Asilah. This further supports the point that IO Asilah had weighed the drug exhibits together with their original packaging, but the HSA did not. Thus, I find that the weight discrepancies are adequately explained by the evidence and circumstances. 136 In any event, as it was found earlier that the exhibits had been accounted for at every point in time from seizure to photo-taking and weighing, the existence of weight discrepancies cannot raise any doubt as to theidentityof the exhibits such as to call into question the chain of custody (seePublic Prosecutor v Muhammad Shafiq bin Shariff[2021] 5 SLR 1317 at [189]). (6) DNA evidence 137 I shall now deal with the DNA evidence. The seized exhibits were swabbed and sent to the HSA for analysis. The DNAs of other persons, namely that of the photographer, Mr Loi212Foot Note 212×NEs 5 April 2022 at p 35 line 21 to p 37 line 6.and the swabber, Ms Mogan,213Foot Note 213×NEs 8 April 2022 at p 14 line 24 to p 15 line 11.were found on some of the exhibits and swabs which were sent to the HSA for analysis, namely Exhibits C11A-SW,214Foot Note 214×Exhibit P146, AB at p 89.A1B,215Foot Note 215×Exhibit P146, AB at p 87.C1216Foot Note 216×Exhibit P146, AB at p 88.and MHL-A1B2A-SW.217Foot Note 217×Exhibit P146, AB at p 93. 138 The Prosecution’s witness, Ms Wong Hang Yee (“Ms Wong”), who approved the relevant HSA report, explained how the DNAs of the photographer and the swabber could have been found on some of the exhibits and swabs which were sent to the HSA for analysis. According to Ms Wong, it was possible that personal protective gear was not worn or not worn properly. For example, if the officer was not wearing a mask and spoke over the exhibit, his or her saliva may have landed onto the exhibit, thereby transferring his or her DNA onto the exhibit.218Foot Note 218×NEs 8 April 2022 at p 46 lines 7–23.I see no reason to doubt Ms Wong’s explanation, which was also echoed by Mr Loi when he was asked to explain how his DNA could have been found on Exhibit C11A-SW.219Foot Note 219×NEs 5 April 2022 at p 36 line 30 to p 37 line 6.I, therefore, find that the fact that the DNAs of other persons were found on the exhibits did not raise a reasonable doubt on the integrity of the chain of custody. Conclusion on the chain of custody 139 I find that the Prosecution has established the integrity of the chain of custody in handling the drug exhibits and has proven beyond a reasonable doubt that the drug exhibits analysed by the HSA are the same as those seized from Hamir at the time of his arrest and during the raid on the Unit. The Defence has failed to raise a reasonable doubt that there was a break in the chain of custody. In summary, I make the following findings: (a) The officers were thorough and meticulous when they recorded contemporaneously in the Field Diary the weight of the drug exhibits seized from Hamir at the time of his arrest and during the raid on the Unit. The descriptions of the drug exhibits in the Field Diary also match the eventual descriptions of the drug exhibits which were analysed by the HSA. (b) The officers gave detailed and consistent accounts of how the drug exhibits were transported from the Unit, to the Enforcement “E” office, to the CNB HQ for processing, and finally to the HSA for analysis. No reasonable doubt arose as to the integrity of the chain of custody when the drug exhibits were transported to the various locations. (c) At EMR 1, the drug exhibits were photographed and weighed in Hamir’s presence. The officers’ evidence on this process was clear, comprehensive and consistent. (d) There was an apparent discrepancy of 5.60% in the overall weight of the drug exhibits as weighed and recorded by IO Asilah as compared to when they were analysed by the HSA. However, this apparent discrepancy does not raise a reasonable doubt as to the integrity of the chain of custody of the drug exhibits. This is because IO Asilah proffered a reasonable explanation for this discrepancy,ie, that she had weighed the drug exhibits together with the packaging, while the HSA only weighed and recorded the weight of the granular substance. (e) The fact that the DNA of the photographer and the swabber were found on some of the exhibits and swabs did not indicate that there was a break in the chain of custody. The presence of the DNAs of the photographer and the swabber on these exhibits and swabs was conclusively explained by the circumstances and by the relevant Prosecution witness.",
        "Necessity": "The applicable law 140 The Defence argues that the MDA does not exclude the common law defence of necessity. The Defence relies on the English case ofR v Shayler[2001] 1 WLR 2206 to argue that there exists a defence of necessity at common law. There, Lord Woolf CJ stated the following: 42In the case of the great majority of statutory criminal offences the common law defences of necessity and duress are available. Those defences have in recent years been extended by the courts to cover what is usually described as duress or necessity of circumstances. … … 57The authorities speak of imminent or immediate threat of a greater harm occurring as being central to the defence of necessity. This indicates that it is insufficient for the defendant to believe that at some uncertain point in the future harm will occur if he does not act to avoid it;he must reasonably believe he has to act now to avert harm in the imminent future.… … 63So in our judgment the way to reconcile the authorities to which we have referred is to regardthe defence as being available when a defendant commits an otherwise criminal act to avoid an imminent peril of danger to life or serious injury to himself or towards somebody for whom he reasonably regards as being responsible.… Thus if the threat is to explode a bomb in a building if defendant does not accede to what is demanded the defendant owes responsibility to those who would be in the building if the bomb exploded. [emphasis added] 141 In Singapore, the defence of necessity is codified in s 81 of the Penal Code (Cap 224, 2008 Rev Ed) (“the Penal Code”), which reads as follows: Act likely to cause harm but done to prevent other harm 81.Nothing is an offence merely by reason of its being done with the knowledge that it is likely to cause harm, if it be done in good faith for the purpose of preventing or avoiding other harm to person or property. Explanation.—It is a question of fact in such a case whether the harm to be prevented or avoided was of such a nature and so imminent as to justify or excuse the risk of doing the act with the knowledge that it was likely to cause harm. Illustrations (a)A, the captain of a steam vessel, suddenly and without any fault or negligence on his part, finds himself in such a position that, before he can stop his vessel, he must inevitably run down a boatB, with 20 or 30 passengers on board, unless he changes the course of his vessel, and that, by changing his course he must incur risk of running down a boatC, with only 2 passengers on board, which he may possibly clear. Here, ifAalters his course without any intention to run down the boatC, and in good faith for the purposes of avoiding the danger to the passengers in the boatB, he is not guilty of an offence, though he may run down the boatC, by doing an act which he knew was likely to cause that effect, if it be found as a matter of fact that the danger which he intended to avoid was such as to excuse him in incurring the risk of running down the boatC. (b)Ain a great fire pulls down houses in order to prevent the conflagration from spreading. He does this with the intention, in good faith, of saving human life or property. Here, if it be found that the harm to be prevented was of such a nature and so imminent as to excuseA’s act,Ais not guilty of the offence. … My findings 142 The Defence argues that the defence of necessity is made out as Hamir trafficked drugs in order to pay for his wife’s medical bills.220Foot Note 220×DCS at para 46.I find that the defence of necessity under s 81 of the Penal Code is not made out on this basis. 143 The illustrations to s 81 of the Penal Code encapsulate situations where there is an imminent danger to lives and where the accused person, believing he can prevent harm to other persons or property, does an action that he believes to be the lesser evil and which reduces the risk of harm to others. The factual matrixes encapsulated in the illustrations to s 81 of the Penal Code are drastically different from the present case. The medical condition of Hamir’s wife, though grave, can hardly be said to be “of such a nature and so imminent as to justify or excuse” Hamir’s actions. Hamir also cannot be said to have been acting in good faith when he deliberately sought out Rosli for supplies of “panas” and “ice”, and when he actively approached customers to resell them. Hamir may have been worried for his wife’s medical condition and was financially strapped, but this did not mean that he had to resort to selling drugs. While I accept that Hamir was working as a part-time mover with little or no income at the time,221Foot Note 221×DCS at para 46.he could have sought alternative ways of earning an income instead of resorting to illegally selling drugs at the first instance. Indeed, when Hamir was arrested, he was found to be in possession of numerous valuable items, namely a gold bracelet, two watches and jewellery.222Foot Note 222×Exhibits P52 and P53.Hamir claims in his Fifth Long Statement that the jewellery were “all real gold” and that he bought them “for investment”.223Foot Note 223×Exhibit P174 at para 51, AB at p 261.Hamir could have sold these valuables and used the proceeds to pay for his wife’s medical bills. Instead, he willingly chose to sell diamorphine. Hamir also admitted that he “constantly had money with [him]” in his Second Long Statement.224Foot Note 224×Exhibit P171 at para 23, AB at p 248.In these circumstances, Hamir’s attempt to paint his drug trafficking as a desperate, last-ditch attempt to raise money for his wife’s medical bills rings hollow. 144 For the above reasons I, therefore, find that the defence of necessity under s 81 of the Penal Code is not made out.",
        "Conclusion": "145 In conclusion, I find that the Prosecution has proven the 1st Charge (Amended) against Hamir beyond a reasonable doubt. 146 First, I find that the Prosecution has proven beyond a reasonable doubt that Hamir had possession of the Drugs for the purpose of trafficking. The presumption of possession pursuant to s 18(1) of the MDA applies and Hamir has not successfully rebutted the presumption. In any case, it has been proven beyond a reasonable doubt that Hamir hadactualpossession of the Drugs. 147 Second, it is undisputed that Hamir had knowledge of the nature of the Drugs. This is clearly borne out in his statements which were given voluntarily. In any case, the presumption of knowledge of the nature of the Drugs pursuant to s 18(2) of the MDA applies and Hamir has not successfully rebutted this presumption. 148 Third, the Prosecution has proven beyond a reasonable doubt that Hamir’s possession of the Drugs was for the purpose of trafficking which was not authorised. Hamir clearly detailed in his statements how he approached Rosli to acquire the Drugsfor the very purpose of selling themto earn money for his wife’s medical bills. Hamir’s claim that some of the Drugs were meant for his own consumption is an afterthought. More importantly, the evidence shows that there is no truth that some of the Drugs were for his own consumption as he had stopped consuming diamorphine way before his arrest. 149 Fourth, the Prosecution has proven beyond a reasonable doubt the integrity of the chain of custody of the drug exhib--its. The Defence has failed to raise a reasonable doubt that there was a break in the chain of custody. The movement of the Drugs as they were transported from the Unit, to the Enforcement “E” office, to the CNB HQ for processing and finally to the HSA for analysis was described in detail by the comprehensive evidence of the officers. 150 Finally, I find that the defence of necessity under s 81 of the Penal Code is not established. The defence of necessity under s 81 of the Penal Code applies to situations where there is an imminent danger to lives and where the accused person, believing he can prevent harm to other persons or property, does an action that he believes to be the lesser evil and which reduces the risk of harm to others. In the present case, the medical condition of Hamir’s wife, though grave, can hardly be said to be “of such a nature and so imminent as to justify or excuse” Hamir’s actions of trafficking the relevant controlled drugs. 151 For these reasons, I find that the Prosecution has proven the 1st Charge (Amended) against Hamir beyond a reasonable doubt. Accordingly, I convict Hamir on the 1st Charge (Amended) under s 5(1)(a) read with s 5(2) of the MDA.",
        "Sentence": "152 Pursuant to s 33(1) read with the Second Schedule to the MDA, the prescribed punishment for the unauthorised trafficking of more than 15g of diamorphine is death. The facts are clear that Hamir was a drug trafficker and not a courier whose involvement fell within s 33B(2)(a) of the MDA. The Prosecution also did not issue a certificate of substantive assistance under s 33B(2)(b) of the MDA to Hamir. Thus, Hamir does not qualify for the alternative sentencing regime under s 33B(1) of the MDA. Therefore, I sentence Hamir to the mandatory sentence of death. Tan Siong ThyeJudge of the High Court Kevin Yong, Samuel Yap and Charis Low (Attorney-General’s Chambers) for the Prosecution; Johan bin Ismail (Johan Ismail & Co), Elengovan s/o V Krishnan (Elengovan Chambers), Haziq Ika bin Zahidi (Ika Law LLC) and Wong Li-Yen Dew (Dew Chambers) for the Defence."
    }
}