{
    "case_title": "Wang Fumin vCitibank Singapore Ltd",
    "ncitation": "[2022] SGHC 106",
    "coram": "Kwek Mean Luck J",
    "sections": {
        "Introduction": "1 The plaintiff is a 69-year-old citizen of the People’s Republic of China.1Foot Note 1×English translation of the plaintiff’s Affidavit of Evidence-in-Chief (“AEIC”) dated 20 October 2021 (“Plaintiff’s AEIC”) found at exhibit “LY-11” of Li Ying’s AEIC dated 20 October 2021 (“Li Ying’s AEIC) at paras 1 and 3.The defendant is a bank incorporated in Singapore.2Foot Note 2×Statement of Claim (Amendment No 1) dated 27 December 2021 (“SOC”) at para 3.The plaintiff claims that due to the defendant’s misrepresentations and breaches of duty, the defendant is liable for investment losses suffered by the plaintiff in the course of banking with the defendant.",
        "Undisputed facts": "2 The following facts are not in dispute.",
        "The plaintiff’s background": "3 The plaintiff was a shareholder and director of Shandong Fuerda Aircondition Equipment Co Ltd (“Fuerda”), a Chinese company in the water source and geothermal heat pump sector.3Foot Note 3×Defence (Amendment No 2) dated 3 January 2022 (“Defence”) at para 4.Fuerda had a revenue of over US$30m in 2010.4Foot Note 4×Defence at para 4.In or around 2011, Fuerda had more than 300 employees, a manufacturing facility and 23 sales offices covering 20 provinces in China.5Foot Note 5×Defence at para 4. 4 Sometime in 2011, the plaintiff sold part of his shares in Fuerda to Carrier Corporation (“Carrier”) for the sum of RMB156m.6Foot Note 6×Reply (Amendment No 2) dated 5 January 2022 (“Reply”) at para 5.From 1998 until the sale of his shares to Carrier, the plaintiff was the Chairman of Fuerda and oversaw its operations.7Foot Note 7×Reply at para 5.",
        "The dispute": "5 In October 2011, the plaintiff began banking with the defendant.8Foot Note 8×SOC at para 7.On 14 October 2011, the plaintiff met with an employee of the defendant, Ms Chiu Lee Lee (“Ms Chiu”), at the Citigold Private Client Centre at Capital Square (“Capital Square Branch”).9Foot Note 9×Chiu Lee Lee’s AEIC dated 18 October 2021 (“Chiu’s AEIC”) at para 9 and Defence at para 38.Ms Chiu was later assigned to be the plaintiff’s Relationship Manager (“RM”).10Foot Note 10×Chiu’s AEIC at para 19. 6 Between March 2012 and March 2019, the plaintiff engaged in various transactions and investments using the money deposited in his accounts and a loan from the defendant.11Foot Note 11×SOC at para 25.These transactions included conversions of account deposits from one currency to another, drawing down of the loan for investment purposes, and conversions of the loan from one currency to another.12Foot Note 12×Defence at para 58.These transactions were executed by employees of the defendant following telephone calls with the plaintiff.13Foot Note 13×Defence at para 59. 7 Throughout his banking with the defendant, the plaintiff communicated with various employees of the defendant over the telephone andviaWeChat. He also met Ms Chiu and other employees of the defendant, in Singapore, a few times a year for updates on his accounts.14Foot Note 14×SOC at para 24.The other employees of the defendant who interacted with the plaintiff while he held accounts with the defendant include:15Foot Note 15×Defence at para 45.(a) Mr Gerald Teo (“Mr Teo”), a Treasury Service Manager (“TSM”); (b) Mr Ryan Foo (“Mr Foo”), an Assistant Relationship Manager (“ARM”) and (c) Mr Stephen Tay (“Mr Tay”), a Market Manager (“MM”). 8 In March 2019, the plaintiff raised complaints with the defendant regarding his accounts. The plaintiff’s complaints are expressed in a letter from him addressed to Mr Tay dated 28 March 2019 (“March 2019 Letter”), alleging,inter alia, the following:16Foot Note 16×Plaintiff’s AEIC at para 383.(a) he had just realised that he had been suffering losses in his accounts with the defendant every year since their opening; (b) the defendant had caused these losses; (c) the defendant had concealed these losses from him; (d) Ms Chiu had always told him that his accounts were profitable; and (e) he would have stopped approving investments with the defendant if he had been aware of the losses suffered in his accounts as early as 2012. 9 Sometime in September or October 2019, the plaintiff closed his accounts with the defendant.17Foot Note 17×Plaintiff’s AEIC at para 437.He commenced these proceedings against the defendant on 6 November 2019.",
        "Relevant documents": "10 There were various documents which governed the relationship between the plaintiff and the defendant. 11 At the meeting with Ms Chiu on 14 October 2011, the plaintiff signed the following documents:18Foot Note 18×Defence at para 47.(a) the Account Opening Application (“Account Opening Application”); (b) the Premium Account Agreement (“Premium Account Agreement”); and (c) the Investment Risk Profile dated 14 October 2011 (“2011 Risk Profile”). 12 The 2011 Risk Profile indicated,inter alia, that: (a) the plaintiff’s investment objectives were growth and income; (b) he had a moderate tolerance for risk fluctuation in the value of his investments; and (c) he had limited investment knowledge and/or experience but had knowledge and/or experience in investment products such as mutual funds, bonds and notes, equities, physical commodities, premium accounts, margin/leverage trading and portfolio finance.19Foot Note 19×Defence at para 28. The 2011 Risk Profile is at 9AB 5147–5148.The 2011 Risk Profile was in Mandarin. 13 On 17 July 2012, the plaintiff met with Ms Chiu at the Capital Square Branch of the defendant.20Foot Note 20×Plaintiff’s AEIC at para 57.The plaintiff signed the following documents:21Foot Note 21×Chiu’s AEIC at paras 49 and 54–55.(a) the Investment Risk Profile dated 17 July 2012 (“July 2012 Risk Profile”); (b) the Structured Note Transactions Agreement (“SN Agreement”); (c) the Citibank-Equity Linked Account(s) Agreement (“ELA Agreement”); (d) the Citibank Brokerage – Customer Account Review (“CAR”); and (e) the Customer Knowledge Assessment (CKA) Declaration (“CKA Declaration”). 14 The July 2012 Risk Profile bore some differences to the 2011 Risk Profile. The July 2012 Risk Profile provided,inter alia,that: (a) the plaintiff’s investment objective was to engage in specialist investing; (b) the plaintiff had a high tolerance for risk fluctuation in the value of his investments such that he could tolerate investments or financial contracts that may have a high risk of losses beyond the amount initially invested; and (c) that the plaintiff had extensive knowledge and understanding of investments, and that he also had knowledge and/or experience in gold (in addition to the investment products listed in the 2011 Risk Profile).22Foot Note 22×Defence at para 30.The July 2012 Risk Profile was in English and Mandarin.23Foot Note 23×Defence at para 30. The July 2012 Risk Profile is at 9AB 5633–5635. 15 On 28 August 2012, the plaintiff signed a facility letter for a loan of up to US$10m (the “Loan” and “1st Facility Letter”).24Foot Note 24×Chiu’s AEIC at para 87.The maximum limit of the Loan was later increased to US$15m by way of a second facility letter dated 20 August 2013 (“2nd Facility Letter”), also signed by the plaintiff.25Foot Note 25×Chiu’s AEIC at para 104. 16 Each month, the defendant prepared Statements of Accounts for the plaintiff’s accounts in English and Mandarin (“Monthly Statements”).26Foot Note 26×Defence at para 61.The Monthly Statements were sent to the plaintiff every month, initially to his address and later via e-mail.27Foot Note 27×Defence at para 62.On a number of occasions, the plaintiff requested printed copies of the Monthly Statements and acknowledged receipt of the same. On 22 July 2016, the plaintiff signed a letter requesting printed Monthly Statements from January to June 2016. On 26 July 2016, the plaintiff signed a letter acknowledging receipt of these Monthly Statements.28Foot Note 28×Plaintiff’s AEIC at paras 252–255.On 26 April 2017, the plaintiff signed a letter acknowledging the receipt of printed Monthly Statements from July 2016 to March 2017.29Foot Note 29×Plaintiff’s AEIC at paras 270–272.On 17 January 2018, the plaintiff signed two letters requesting and acknowledging the receipt of printed Monthly Statements from April 2017 to December 2017.30Foot Note 30×Plaintiff’s AEIC at paras 273–274.On 8 March 2019, the plaintiff signed two letters requesting for and acknowledging the receipt of printed Monthly Statements from January 2018 to February 2019.31Foot Note 31×Plaintiff’s AEIC at paras 354–355. 17 In a meeting on 17 August 2015, the plaintiff signed a letter which,interalia, provided that the defendant would not be liable for any misunderstanding or uncertainty created by phone-based discussions in which employees of the defendant did not mention the specific amounts involved in transactions (“2015 Indemnity Letter”).32Foot Note 32×Defence at para 78.On 26 April 2017, the plaintiff signed English and Mandarin copies of a similar letter which provided that, over the telephone, the defendant’s employees would abbreviate specific amounts by dividing them by one million (“2017 Indemnity Letter”).33Foot Note 33×Defence at paras 79–80.The circumstances leading up to the 2015 Indemnity Letter and the 2017 Indemnity Letter are disputed, but it is common ground that the plaintiff repeatedly told employees of the defendant that there was “no need” to provide him with specific details of transactions over the telephone from as early as September 2012.34Foot Note 34×Plaintiff’s AEIC at paras 190 and 194.",
        "Plaintiff’s case": "18 The plaintiff’s case is premised on his claim that he has limited understanding of finance and investment, and the employees of the defendant who interacted with him knew this. The plaintiff’s inability to understand financial matters rendered him unable to understand the Monthly Statements. He could not even derive his net asset value from them.35Foot Note 35×SOC at para 20. 19 Another aspect of the plaintiff’s case is that some of the key agreements between him and the defendant were signed in circumstances such that he was unaware of and did not understand their terms. 20 The plaintiff claims that he signed a blank copy of the July 2012 Risk Profile and the answers were later entered by Ms Chiu. He did so because Ms Chiu told him that it was a requirement of the defendant that he sign, and that she would complete it with the answers he had given in the 2011 Risk Profile.36Foot Note 36×Plaintiff’s AEIC at paras 59–61. 21 The plaintiff completed further risk profile forms every year from 2013 to 2019. Other than in 2014 when the risk profile form was completed over the phone,37Foot Note 37×Plaintiff’s AEIC at para 202.all risk profile forms were signed by the plaintiff.  Where the forms were signed, the plaintiff’s case is that he signed them at the request of Ms Chiu and did not read their contents. He did so because Ms Chiu told him that their content would be the same as the previous year’s risk profile.38Foot Note 38×Plaintiff’s AEIC at paras 195–199. 22 The plaintiff’s case is that he signed the 2015 Indemnity Letter after Mr Tay told him that it was a bank requirement and that it was a “compensation” agreement. Ms Chiu told the plaintiff that the 2015 Indemnity Letter provided that the defendant would compensate him in certain circumstances. The plaintiff claimed that he did not understand the contents of the 2015 Indemnity Letter as it was in English, but he signed because of what Mr Tay and Ms Chiu had told him.39Foot Note 39×Plaintiff’s AEIC at paras 155–159. 23 As for the 2017 Indemnity Letter, he signed it without reading it even though a Mandarin copy was provided to him. He was again told by Mr Tay that it was a bank requirement that he sign. Ms Chiu also told him again that the letter was to protect his interests. He trusted Mr Tay and Ms Chiu’s account of the contents of the 2017 Indemnity Letter and signed it.40Foot Note 40×Plaintiff’s AEIC at paras 160–166. 24 The plaintiff claims that he has suffered loss of around US$12.5m. This figure was arrived at by the plaintiff’s expert witness, Mr Thong Kum Keen Benjamin (“Mr Thong”) in his report dated 10 August 2021, by obtaining the difference between the initial amount deposited by the plaintiff with the defendant in 2012 and the final amount withdrawn when his accounts were closed in 2019, taking into account withdrawals over the years.41Foot Note 41×Plaintiff’s Expert Report, found at exhibit TKKB-1 of Thong Kum Keen Benjamin’s AEIC dated 10 August 2021 (“Thong’s AEIC”), at para 5.6.The plaintiff claims that this loss was caused by the defendant’s misrepresentations and/or breach of the duties it owed to him.",
        "Misrepresentation": "42 The plaintiff alleges that the defendant is liable for either fraudulent67Foot Note 67×SOC at para 37.or negligent68Foot Note 68×SOC at para 41.misrepresentation. The requirements for a claim in fraudulent misrepresentation are set out inSyed Ahmad JamalAlsagoff (administrator of the estates of Shaikah Fitom bte Ghalib bin Omar Al-Bakri and others) and others v Harun bin Syed Hussain Aljunied and others and other suits[2017] 3 SLR 386 at [47], which followed the Court of Appeal’s decision inPanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at [14]. A plaintiff must prove that: (a) a representation of fact was made by words or conduct; (b) that representation was made with knowledge that it was false, or without any genuine belief that it was true; (c) that representation was made with the intention that it should be acted upon by the plaintiff (or by a class of persons which includes the plaintiff); (d) the plaintiff acted upon that representation; and (e) the plaintiff suffered loss as a result of so acting. 43 The requirements for a claim in negligent misrepresentation are set out inMaHongjin v Sim Eng Tong[2021] SGHC 84 (“MaHongjin”) at [20]. The plaintiff must show that: (a) the defendant made a false representation of fact to the plaintiff; (b) the representation induced the plaintiff’s actual reliance; (c) the defendant owed the plaintiff a duty to take reasonable care in making that representation; (d) the defendant breached that duty of care; and (e) the breach caused damage to the plaintiff. 44 Common to claims in fraudulent and negligent misrepresentation is the requirement that a false statement of fact was made by the defendant to the plaintiff. The plaintiff asserts that it is the “overall pattern of conduct” of the defendant that should be scrutinised.69Foot Note 69×PCS at para 17.It is however clear from the above authorities that in a claim for misrepresentation, a plaintiff must first identify a specific false representation of fact. 45 In my view, it is helpful to deal with the representations in three separate categories: (a) Category 1: Statements by the defendant’s employees in meetings and telephone conversations that the plaintiff was making profits from specific transactions carried out from his account; (b) Category 2: Statements by the defendant’s employees to the plaintiff that his investments had made net profits; and (c) Category 3: Omissions by the defendant’s employees to tell the plaintiff that he was making losses from his investments. I will deal with each of these in turn.",
        "Breach of duty": "139 The plaintiff has claimed for breach of duties arising from negligence or the implied terms of his contractual agreement with the defendant. The defendant accepts that it owes the plaintiff an implied contractual duty to exercise reasonable skill and care in rendering its services to him (seeGo Dante Yap v Bank AustriaCreditanstalt AG[2011] 4 SLR 559 at [24]), but submits that beyond that, the alleged duties are precluded by the contractual terms of the parties’ agreements. 140 Given my factual findings above, even if the duties alleged by the plaintiff were owed by the defendant, they were clearly not breached. 141 The plaintiff’s claim for breach of duty is underpinned by the allegations that the defendant failed to provide him with regular and accurate updates on his accounts and the Loan, correct any obvious misunderstanding on the state of his accounts and the Loan, answer reasonable questions on the state of his accounts and the Loan, inform him of any substantial losses made from the transactions carried out from his accounts and propose investments in accordance with this risk appetite and investment experience. 142 However, as set out above, the documentary evidence is clear that the defendant provided the plaintiff with Monthly Statements of his account. There were regular and accurate updates on his account, which would correct any misunderstanding he may have of his account and inform him on the state of losses in his accounts. The transcript of the phone conversations that the plaintiff had with the defendant’s employees also show that they answered his questions on his transactions. 143 Even if the plaintiff could not understand the Monthly Statements or the numerous phone conversations that he had with the defendant’s employees, there is no evidence that he conveyed such inability to the defendant. Neither is there any evidence of his ignorance in his interactions with the defendant’s employees, such that they would be put on notice that he could not read or understand his Monthly Statements. The plaintiff asserts that even though he was the Chairman of Fuerda and received awards and recognition from the Chinese government and industry, his training was in political doctrine and he was actually not sensitive to numbers, and as such he was not able to derive the net asset position even when shown the total asset and total liabilities of his account. Even in the unlikely event that that was the case, which I do not find, none of this would have been apparent to any outsider, such as the defendant’s employees. Without such notice, providing the Monthly Statements to the plaintiff was sufficient to fulfil any duty that the defendant owed to him to keep him informed of the state of his accounts. In any event, following examination of the evidence, as set out above, I find that the plaintiff was able to read the Monthly Statements issued by the defendant, to derive his net asset position for his account. 144 There is also no evidence that the investments proposed to the plaintiff were not in accordance with his risk appetite and investment experience. As set out above, the plaintiff had signed off on eight investment risk profiles from 17 July 2012 to 6 March 2019 that placed him as a “very aggressive investor”. The plaintiff had also signed off on the Account Opening Application, which contained a non-reliance clause, stating that the plaintiff would make his decisions solely in reliance on his own judgment. 145 Hence on the evidence, I find that there can have been no breach of the alleged duties, even if they existed. 146 The plaintiff also submitted that the defendant’s employees had “churned” his accounts. By this, he means that the defendant’s employees deliberately made as many transactions as possible from his accounts, without regard for whether the transactions were profitable or not. They did this just to generate revenue for the bank, so that they would perform well in their key performance indicators.176Foot Note 176×PCS at paras 93 and 179.While the legal import of this allegation was not set out, I understand this to be an allegation that the defendant breached its duty owed to the plaintiff to exercise reasonable skill and care. It can be dealt with shortly. 147 First, it was not part of the plaintiff’s pleaded case that the defendant or Miss Chiu had a scheme to churn transactions. Second, no evidence, whether expert or otherwise, was adduced to show that any of the transactions made were irresponsible, excessive, or unnecessary. Third, the plaintiff’s account was a non-discretionary account where his approval is required for trades, and he does not dispute authorising the trades in his account. The mere fact that the plaintiff made losses trading regularly over the years does not mean that there was a scheme to “churn”. It is also not the case, as the plaintiff submits, that the onus is on the defendant to justify the transactions.177Foot Note 177×PRS at para 91.If it is the plaintiff’s case that the defendant caused him to enter into excessive or irresponsible transactions, he must prove it.",
        "Defendant’s case": "33 The defendant’s case is that the plaintiff is actually a highly sophisticated businessman and an aggressive investor. This is evinced by the fact that on eight occasions, he signed or gave responses to risk profiles that indicated he was a “very aggressive” investor. The July 2012 Risk Profile, which first indicated this, was read, completed and signed by the plaintiff in Ms Chiu’s presence.53Foot Note 53×Chiu’s AEIC at paras 47–53.He was fully aware of the risk involved in the transactions that he engaged in through the defendant, and they were consistent with his risk appetite. 34 The plaintiff was also fully aware of his net asset position at all times while banking with the defendant.54Foot Note 54×Defendant’s Closing Submissions dated 29 March 2022 (“DCS”) at para 20(c).Between October 2011 and October 2014, hard copies of the Monthly Statements were mailed to the plaintiff’s registered mailing address.55Foot Note 55×Chiu’s AEIC at para 165.From October 2014 onwards, electronic copies of the Monthly Statements were emailed to the plaintiff instead, at his request.56Foot Note 56×Chiu’s AEIC at para 165.The plaintiff was able to understand the Monthly Statements and was therefore always aware of his net asset position. 35 The defendant’s position is that the plaintiff is bound by all the agreements signed by him.57Foot Note 57×DCS at para 20(e).The defendant relies on certain express terms contained in its agreements with the plaintiff that it argues defeat the plaintiff’s claims. The Account Opening Application provided,inter alia:58Foot Note 58×Defence at para 19.(a) that the plaintiff understood the terms governing his account with the defendant; (b) that the analysis and information provided to him about investments were not offers to purchase investments and are not investment advice; (c) investments made in his account were made solely upon his own judgment, at his own discretion, and at his own risk; (d) he would make an independent analysis and decision with respect of his investment; and (e) every investment he made shall be deemed to be undertaken by him in reliance on his own judgment and not in reliance on any views, representations, advice, recommendations, or any other statements by the defendant’s employees. 36 The defendant also relies on the following provisions of the Citibank Singapore Limited International Bank Terms and Conditions (“T&Cs”):59Foot Note 59×Defence at para 21.(a) clauses 13.1.3 and 13.8, which relate to the plaintiff’s responsibility for his investment decisions; (b) the risk disclosure statement; and (c) clauses 5.19, 5.2 and 6.2, which are conclusive evidence clauses in relation to the Monthly Statements.60Foot Note 60×Defendant’s Opening Statement dated 20 December 2021 at para 39. 37 Finally, the defendant also relies on the 2015 Indemnity Letter and the 2017 Indemnity Letter. These letters were prepared by the defendant to accommodate the plaintiff’s wish that details about his transactions and account balances were not to be communicated over the phone, due to his fears that his phone was being tapped.61Foot Note 61×Chiu’s AEIC at paras 149–153.",
        "Category 1 representations": "46 The plaintiff alleges that the defendant’s employees orally represented to him in meetings and telephone calls that he was making profits from the transactions carried out from his account. 47 The defendant’s case is that where it is alleged that the defendant’s employees informed the plaintiff that he made profits or earned money on a transaction, or could take profits on a transaction, that was true. I find the defendant’s case to be amply supported by the documentary evidence. 48 Using one transaction as an illustrative example, on 21 October 2014, in a telephone conversation between Ms Chiu and the plaintiff, Ms Chiu said:70Foot Note 70×Chiu’s AEIC at paras 249–252. … Mr. Wang, then by the way, I would like to report to you that you have one sum of New Zealand dollar Japanese Yen [sic], we placed the order but it hasn’t been achieved yet,but we will directly, uh, that is, take profits and close the deal, we can, that is to say, sell that NZD to that, [more] than last time, uh, that is to say, uh, more JPY than October 13th.I will directly do [it] for you, is that OK? Because the order is placed until 5:00, [it] has already, uh, expired. [emphasis added] The transaction documents indicate that the plaintiff started with ¥225,807,116. This was used to buy NZ$2,657,179.52. This sum of New Zealand dollars (plus interest that had been earned) was used to buy ¥226,406,339. The plaintiff thus ended up with more Japanese Yen than he started with, as represented by Ms Chiu. 49 The plaintiff relied on the expert report of Mr Thong to support his claim that he suffered losses. In his report, Mr Thong set out various call transcripts between the plaintiff and the defendant’s employees, analysed the transactions that were referred to, and concluded that they were not profitable. However, during cross-examination, Mr Thong acknowledged that there were two flaws with the methodology he used in his report. 50 First, Mr Thong made his analysis by converting two traded currencies into a third currency, US dollar (“USD”) that was not being traded. While, the plaintiff’s Monthly Statements were reflected in USD, the defendant’s expert, Mr Christopher Paul Matten (“Mr Matten”) testified that the presentation of a customer’s overall assets and liabilities in a single reference currency is “merely an accounting convention and is irrelevant to actual profit or loss on the particular transaction”.71Foot Note 71×Christopher Paul Matten’s Expert Report found at exhibit “CPM-2” of Christopher Paul Matten’s AEIC at pp 16–17, paras 11 and 15.This was not disputed during the cross-examination of Mr Matten. Mr Thong also conceded under cross-examination that the profitability of a foreign exchange (“FX”) transaction should be considered by reference to the actual traded currency pair instead of a third currency (USD). He agreed that where it was possible to determine the open and close position in the same currency, there would be no basis to refer to a third currency such as USD to determine profit or loss.72Foot Note 72×18 January Transcript at p 22 line 4 to p 24 line 24.His analysis was thus, on his own admission, inaccurate in this respect. 51 Second, Mr Thong’s conclusions in his report were based on isolated currency conversions between different currencies, rather than a comparison between the open and close position of a series of FX trades, which is what the defendant’s employees referred to in their telephone calls with the plaintiff. During cross-examination, Mr Thong accepted that the correct method to determine the profitability of a trade in a specific currency or gold, is to measure the gain or loss in the actual traded currency or gold itself.73Foot Note 73×18 January Transcript at p 62 line 13 to p 63 line 3. 52 During cross-examination, Mr Thong was referred to transaction confirmations for the trades mentioned in his report and provided with the calculations showing that those trades were profitable. He agreed that those trades were profitable. During re-examination, Mr Thong was shown those trades again. He was then given time to verify the position based on the actual documents. After he took the stand, he confirmed again that the trades were profitable.74Foot Note 74×18 January Transcript at p 31 line 21 to p 50 line 12 and p 96 line 15 to p 97 line 23. 53 In summary, there is no evidence that the defendant misrepresented that any specific transaction was profitable, or that profits could be taken on a specific transaction. The plaintiff has not shown that any of these assertions were false. On the contrary, the documentary evidence supports the defendant’s case that such assertions were true when made. 54 Thus, the representations in Category 1 cannot form the basis for a claim in misrepresentation, whether fraudulent or negligent.",
        "Category 2 representations": "55 The defendant denies that the Category 2 representations were made. As the plaintiff’s case is that such representations were orally made, and he has no documents to support his case, the credibility of the plaintiff and the defendant’s witnesses who were alleged to have made such representations becomes important. Nine key areas 56 However, before I provide my overall assessment on the witnesses’ credibility, I will first examine nine areas where the plaintiff’s evidence was inconsistent, either internally or externally with regard to documentary evidence: (a) Plaintiff’s ability to derive net asset position from Monthly Statements; (b) Plaintiff’s HSBC account; (c) Plaintiff’s account opening at the defendant; (d) Plaintiff’s risk profile forms; (e) Assistance to review the Monthly Statements; (f) Plaintiff informing the defendant not to tell him details; (g) Plaintiff’s indemnity letters; (h) Plaintiff’s facility letters; and (i) Plaintiff’s appreciation of risks. (1) Plaintiff’s ability to derive net asset position from Monthly Statements 57 It is a key plank of the plaintiff’s case that he did not know of the losses that he suffered until 2019. This is despite the defendant regularly sending the Monthly Statements to the plaintiff since 2011.75Foot Note 75×3AB 1740–5AB 3036.Between 2016 and 2019, the plaintiff also requested for and received additional printed hard copies of his Monthly Statements every year.76Foot Note 76×Defendant’s Core Bundle (“DCB”) at pp 136–143.During trial, the plaintiff admitted receiving such hard copies.77Foot Note 77×11 January Transcript at p 41 lines 14–22.His case therefore rests on his claim that he has always been unable to understand the Monthly Statements and derive his net asset position from them. 58 The plaintiff emphasises that due to his poor education, he has poor numeracy and literacy, resulting in him being unable to understand the Monthly Statements.78Foot Note 78×PCS at para 70.However, even if such background were true, it does not assist him. The plaintiff admitted on the stand that he understands Mandarin sufficiently to comprehend the Mandarin terms in the Monthly Statement, and that he is able to read the numbers next to them and understand what the numbers refer to when the Mandarin terms and numbers are taken together. I elaborate on this below. 59 The Monthly Statements are in both English and Mandarin. At the top half of the first page of each Monthly Statement, are the terms “Assets”, Liabilities” and “Total”. There are numbers next to these terms. An example is set out below:79Foot Note 79×30 April 2017 statement at 4AB 2592. 60The plaintiff testified that although he is able to understand the Mandarin terms and the numbers next to them, he still did not know how to derive his net asset position. 61 The plaintiff maintains that he was unable to derive his net asset position from his Monthly Statements, despite Mr Teo, an employee of the defendant, having explained to him in detail how to do so in a call on 14 March 2018, as set out below:80Foot Note 80×12AB 7279–7282. TimestampSpeakerTranslation01:53Gerald Teo… Mainly, OK, that monthly statement's side should have two main parts, one of which is your, that total assets' side, that one will include your, those cash parts ah, investment ah, uh, this part. Then, the second part is those, uh, uh, loan parts ah, so, ah, this total assets' side and [then] remove the loan parts, then [you] will get that amount of that total net value. Right?…04:57Gerald TeoUh... Let's look at it in a simple way ah, that is, you received the monthly statements every month, right?05:10WangAh.05:11Gerald TeoThen for the monthly statements, just like what I said just now, there's a part on total assets, and that part on total loan amount. So, that, your that net value, is the assets' part deducting that loan part, that is that data. Then, if you take this data, you compare [it] this way every month, you [will] roughly know how's the performance of that account for that month. This is the easiest way.05:43WangThe easiest ah, OK.05:45Gerald Teo[If] you use this method, [it] is relatively easier. Because if you compare loans one by one this way ah, it is very difficult to compare, [because] the price is changing everyday ah.05:57WangOkay, then, this, I'll take a look, and if I have any questions, [I'll] then consult you, OK?06:00Gerald TeoRight, if you look at [it] in this way, the data does not \"jump\" too much, and there won't be too much difference.06:08WangOK, OK, OK, OK. Thank you. Then I'll contact you again [later]. 62 When referred to this exchange, the plaintiff claimed that even if he was told the method, he did not know which numbers represented the total assets and which represented the total liabilities.81Foot Note 81×12 January Transcript at p 24 lines 16–25. 63 However, the plaintiff acknowledged on the stand that he understood the concepts of “assets” and “liabilities”, and that he understood that a net asset position could be obtained by deducting liabilities from assets.82Foot Note 82×5 January Transcript at p 33 line 9 to p 34 line 13.He later also acknowledged that he could perform basic arithmetic,83Foot Note 83×17 January Transcript at p 9 line 24 to p 10 line 6.he understood the Mandarin words for “Total”, “Asset” and “Liabilities” which were in the Monthly Statements and that he understood numbers next to these terms. He also understood that “liabilities” referred to the total amount of his loan.84Foot Note 84×17 January Transcript at p 12 line 24 to p 15 line 6. 64 However despite that, he maintained that he was still not able to derive the net asset position from the Monthly Statements, because he did not understand the “logic”.85Foot Note 85×17 January Transcript at p 11 lines 17–18.Yet, when asked what “logic” he was referring to, since there are Mandarin words and numbers next to them, he could only respond that he only knows when they are pointed out one by one.86Foot Note 86×17 January Transcript at p 14 line 16 to p 15 line 6.This answer makes no sense in light of what he acknowledged as his level of understanding. It fails to explain his alleged inability to execute the very simple task of noting what were the numbers next to the Chinese terms which he understood and then performing the basic arithmetic that he knew how to perform. 65 The plaintiff’s position is even more unconvincing considering that he served as the Chairman of Fuerda. As Chairman of Fuerda, the plaintiff said that he understood concepts such as assets and liabilities and that to obtain net asset position, one would have to subtract net liabilities from net assets.87Foot Note 87×5 January Transcript at p 34 lines 8–13.Moreover, he had received RMB156m from the sale of 70% of his Fuerda shares to Carrier.88Foot Note 88×Plaintiff’s AEIC at para 11.He testified that he had rejected an offer to buy his shares from another company for RMB100m as he did not think it was fair value.89Foot Note 89×17 January Transcript at p 2 line 20 to p 3 line 6.He concluded that the Carrier offer was fair, based on the performance of his corporation, his assessment of the performance and profit formula provided by Carrier and in comparison to the earlier offer.90Foot Note 90×17 January Transcript at p 3 lines 10–23.In other words, on his own evidence, the plaintiff was able to make his own assessment of whether the offer from Carrier to buy his Fuerda shares was fair. 66 During his re-examination, the plaintiff sought to downplay his ability to understand financial numbers by saying that for the calculation provided by Carrier, Fuerda had a department to deal with these matters, and on his part, he only compared the prices.91Foot Note 91×17 January Transcript at p 28 lines 9–19.However, this directly contradicts his earlier testimony that he assessed fair value, not just on a comparison of the prices offered between the two companies that made offers, but based on his assessment of the performance and profit formula provided by Carrier.92Foot Note 92×17 January Transcript at p 3 lines 10–23.In any case, even on the evidence that he simply compared the prices, the plaintiff was clearly able to compare two financial numbers. 67 The plaintiff also said that when he was a factory manager in Fuerda, he only read the numbers on the reports and did not need to write the numbers.93Foot Note 93×17 January Transcript at p 32 line 17 to p 33 line 4.However, the issue here is not the plaintiff’s ability to write a Monthly Statement, but the ability to read the part of it that sets out the total assets and total liabilities. By his own evidence, he was able to read the numbers in the reports in Fuerda. This raises serious questions as to why he would not be able to read the numbers in the Monthly Statements, questions which the plaintiff does not answer. 68 Indeed, when he was asked about the inconsistency between his earlier admission that he knew how to obtain net asset position and his later testimony that he could not derive the net asset value of his account from the Monthly Statements, the plaintiff chose not to answer:94Foot Note 94×12 January Transcript at pp 6–7, and p 11. Q:  Mr Wang, you are again being dishonest and lying. On the very first day of my cross-examination, I already brought you through your Fuerda's accounts and you had admitted to me during that cross-examination that you knew you can obtain net asset value by deducting total liability from total assets.  So stop lying again, Mr Wang. A:I wish not to answer you this question. … Q:  On the first day of my cross-examination in relation to Fuerda's account, you already admitted you knew how to obtain net asset by deducting total liability from total asset. Since you already knew this, why can't you apply it to your Citibank account and obtain the net asset value by the same method which you know? A: So, counsel, I have a question for you.  So if I deposit my money into any bank, not only into Citibank, do I need to bring my accountant who could report the net asset value to me. Q:    Mr Wang, you don't ask me any question.  I am requesting that you answer my question. A:I could have the choice not to answer this kind of questionbecause I already mentioned in my former section. [emphasis added] 69 The plaintiff also argues that he must not have been able to understand his Monthly Statements, because any reasonable person who did would have been unable to accept the losses that his account was suffering.95Foot Note 95×PCS at para 41.However, the fact that investment losses have been suffered does not naturally lead to the inference that an investor was not able to understand his statement of accounts. It could also be that an investor engaging in high-risk investment would be prepared for, and might even expect, large losses. The plaintiff had signed off on numerous investment risk profiles that stated that he was of an aggressive risk profile. He also testified that he understood that there are no guaranteed profits in investment.96Foot Note 96×13 January Transcript at p 54 lines 9–16. 70 The transcripts of the plaintiff’s phone and WeChat conversations with the employees of the defendant, also indicate that the plaintiff was able to gather numerical information from the Monthly Statements. 71 In a call between Mr Teo and the plaintiff on 2 March 2018, the plaintiff made reference to specific sums:97Foot Note 97×Plaintiff’s AEIC p 1015. The ones that you have already, already taken out, that is, this has already been settled, [it] used around five hundred thousand [500,000], five hundred thousand plus [500,000+], right? That one, uh, some [made] losses, [some] with quite a big amount. [For] one sum, I think, uh, EUR against USD, that sum is three hundred thousand [300,000], right? There are a few more sums, still have, I think the losses are, are around four hundred thousand [400,000], right? 72 In another call on 2 March 2018 between Mr Teo and the plaintiff, the plaintiff said:98Foot Note 98×12AB 7267 at 03:23. This, I, I studied, uh, last time, this (stutter), [when] I went over and saw this, I originally sold this EUR [for] USD that time. [It] was sold at 1.059 that time. Then, now our, this EUR exchanging into GBP is, for, uh, exchanging into USD, how much is it? I think that sum [has a] difference of three hundred and fifty thousand [350000]. This, this, this can lose three hundred and fifty thousand [350000]. 73 The natural inference from the plaintiff being able to refer to these details is that he was able to read his Monthly Statements. He sought to explain that this call was only about foreign currency and only part of his account, and that he consulted a banker friend, Mr Jin Tao (“Mr Jin”) before making this call.99Foot Note 99×12 January Transcript at p 58 line 19 to p 59 line 10.However, if he was able to consult a friend to go into such detail about part of his account on foreign currency, why was he not able to do so about a more basic issue, that is, his net asset position? I will address later, the external assistance received by the plaintiff in reading his Monthly Statements. 74 Further, in the same call, the plaintiff said “…this I know, you, take a look, take a look, at the first half of [20]17, it was OK.” He then said that the second half of 2017 was “basically losing money”.100Foot Note 100×12AB 7273 at 04:43 to 04:48.The natural inference is that he was referring to the Monthly Statements to draw these conclusions. This is supported by the positions in his Monthly Statements for that period, which showed a slight increase of US$48,864.27 in his net assets for the first half of 2017,101Foot Note 101×29 April 2017 monthly statement at 4AB 2592 and 31 July 2017 monthly statement at 4AB 2634.while his net assets decreased by US$948,895.28 by the December 2017 monthly statement.102Foot Note 102×30 December 2017 monthly statement at 4AB 2705.When pressed on this, the plaintiff denied this, saying that he formed his impression of his investment performance from the number of telephone calls he received from the defendant’s employees.103Foot Note 103×12 January Transcript at p 61 lines 7–10.It is not clear how there can be any sensible correlation between the number of calls received and the extent of profits or loses made. In any event, this is not a credible explanation, since the plaintiff told Mr Teo in the same call “you take a look, take a look, at the first half…” The reasonable inference is that he was referring to something which Mr Teo could look at, such as the Monthly Statements. The plaintiff did not mention in his call that his impression was based on the number of phone calls. 75 In the same call, the plaintiff said the loans alone lost about US$500,000 plus interest.104Foot Note 104×12AB 7274 at 05:17.In his April 2017 Monthly Statement, the interest for the loan was about US$445,791.99, close to the figure of US$500,000 that he referred to in this conversation. The plaintiff was not able to give any explanation of how he derived this figure without understanding the Monthly Statement.105Foot Note 105×12 January Transcript at p 70 line 2–11. 76 There is similar documentary evidence from the plaintiff’s WeChat conversations with Ms Chiu. In a 15 March 2018 WeChat conversation between the plaintiff and Ms Chiu, the plaintiff wrote:106Foot Note 106×6AB 3661 at 12:58. Hello Miss Chiu. The monthly statement for December that was sent only has the details of the transaction accounts, in which not much information was indicated. It only indicated: the accumulated interest that was paid in December is about 9700, 10000 was withdrawn from the time deposit [account] to make repayment. As at the end of December 2017, the deposit of Japanese Yen is about 345 million, equivalent to about US$3.25 million. 77 From this, the plaintiff demonstrated that he could read the Monthly Statement to derive the amount of accumulated interest and Japanese Yen deposits. 78 The plaintiff’s evidence that he is unable to his derive net assets from his Monthly Statements, is thus inconsistent with the documentary evidence of his conversations with the defendant’s employees, where he referred to numerical information, which were in his Monthly Statements. 79 In addition to the above, the plaintiff’s evidence that he was unaware of his net asset position, is also undermined by Mr Teo’s evidence of that he had directly informed the plaintiff of his net asset position. Mr Teo’s testimony is supported by contemporaneous documentary evidence. 80 Mr Teo also testified that he took screenshots of the plaintiff’s net position on 24 April 2017 before his meeting with the plaintiff on 26 April 2017, which he used to inform the plaintiff of his net asset position at the meeting.107Foot Note 107×Gerald Teo’s AEIC (“Teo’s AEIC”) at paras 179–183.Mr Teo produced a copy of this screenshot, which shows the plaintiff’s net asset position as of 24 April 2017.108Foot Note 108×10AB 6350.He also took a screenshot on 16 January 2018, a day before his meeting with the plaintiff.109Foot Note 109×10AB 6353.Mr Teo also took a screenshot of the plaintiff’s net asset position as of 6 August 2018,110Foot Note 110×10AB 6355.which Mr Teo testified he used to update the plaintiff of his net asset position at their meeting on the same day. I accept Mr Teo’s evidence that there was no reason for him to take such screenshots, for any purpose other than to update the plaintiff on his net asset position at the meetings. 81 The plaintiff seeks to support his case by referring to a WeChat conversation around 6 March 2018, where the plaintiff said to Ms Chiu that based on his calculations, there was a total loss of more than US$500,000 and “that’s a lot of money”.111Foot Note 111×5AB 3361.The plaintiff submits that by inference he would have been more upset if he knew of his actual losses, which were much bigger, earlier.112Foot Note 112×PCS at para 198.However, the plaintiff’s reaction to the loss of US$500,000 on this occasion does not lead to an inference that he did not know of the earlier losses. Moreover, as set out above, the overwhelming evidence is that the plaintiff had the ability to understand the Monthly Statements sufficiently to know what his net asset position was. In any event, the plaintiff never told the defendant about this supposed inability to understand his Monthly Statement throughout his banking relationship with the defendant, and in fact asked for the Monthly Statements. 82 I therefore find on review of the plaintiff’s evidence, the documentary evidence and the evidence of the defendant’s witnesses such as Mr Teo, that contrary to the plaintiff’s claims, the plaintiff was able to read the Monthly Statements that the defendant sent him and understand from them his net asset position. (2) Plaintiff’s HSBC account 83 Prior to trial, the defendant sought specific discovery of documents relating to the plaintiff’s accounts with other banks, including HSBC Hong Kong (“HSBC”).113Foot Note 113×PCS at para 604.As a result, certain documents relating the plaintiff’s account with HSBC were disclosed, and the plaintiff was referred to them in cross-examination. I will next deal with the contradictions in the plaintiff’s evidence on his HSBC account. 84 The plaintiff testified in court that he did not receive any monthly statements from HSBC.114Foot Note 114×5 January Transcript at p 49 line 25 to p 50 line 2.His evidence is that HSBC representatives briefed him every half year on what was in his HSBC account when he went to Hong Kong.115Foot Note 115×5 January Transcript at p 51 lines 1–5.However, there were in evidence before the court, HSBC monthly statements that were addressed to the plaintiff at his residential address.116Foot Note 116×For example, 13AB 7607.When confronted with the HSBC monthly statements, the plaintiff claimed that HSBC may have prepared them, but he never received them.117Foot Note 117×5 January Transcript at p 57 lines 9–10.He was not able to explain why HSBC would go through the trouble of preparing monthly statements addressed to him at his residential address, but not send them. 85 In addition, the plaintiff testified in court that he did not have any overdraft or credit facilities with HSBC Hong Kong.118Foot Note 118×5 January Transcript at p 49 lines 1–21.However, this is contradicted by HSBC monthly statements showing that he had overdraft of 5 million Hong Kong dollars (“HKD”), and subsequently HKD15m. In his HSBC monthly statement dated 21 June 2016,119Foot Note 119×13AB 7683.there is an entry for “Secured OD – HKD $5m”. The same statement showed that the plaintiff had drawn down HKD4.29m from this overdraft facility (“OD facility”). In his HSBC monthly statement dated 21 July 2016,120Foot Note 120×13AB 7685.the OD facility is reflected as having increased from HKD5m to HKD15m. 86 When asked whether he was aware of such a significant increase in his credit facility, as he would have had to apply for it and sign off on documents authorising HSBC to do so, the plaintiff asserted that he had no impression of such a facility.121Foot Note 121×5 January Transcript at p 73 lines 17–24.I do not find it believable that HSBC would have increased the credit facility for the plaintiff without him seeking it, or even being aware of it. 87 The plaintiff also testified in court that he did not make gold or FX trades through HSBC.122Foot Note 122×5 January Transcript at p 58 lines 23–25.This was however plainly contradicted by his HSBC monthly statements. There were entries for “Gold/Exchange Debit” in his 21 October 2014123Foot Note 123×13AB 7623.and 21 January 2016124Foot Note 124×13AB 7670.HSBC monthly statements. 88 The plaintiff sought to explain that he entrusted his HSBC RM to do the transactions for him.125Foot Note 125×5 January Transcript at p 59 line 18 to p 60 line 7.According to him, his HSBC RM did not confirm each transaction with him before execution. The HSBC RM would make the decision himself. Moreover, whenever he visited his HSBC RM, which he said he did twice a year, they did not tell him what investments he made nor did he think of asking them what investments they made for him.126Foot Note 126×5 January 2022 Transcript at p 61 line 14 to p 62 line 5.This, however, goes against his HSBC account opening form, which he signed, and which states that any decision on making transactions shall be based on his judgment and he should place no reliance on HSBC to give advice or make recommendations.127Foot Note 127×13AB 7596. 89 The plaintiffs’ evidence on his HSBC account, shows him being caught out on numerous occasions, flatly contradicted by objective documentary evidence. His subsequent explanations are not credible and hard to believe. (3) Plaintiff’s account opening with the defendant 90 The third area relates to the plaintiff’s evidence on his account opening with the defendant. 91 The plaintiff’s account opening forms were in English and Mandarin. He signed on both versions. The Account Opening Application contains an acknowledgment that the plaintiff will make all investments solely on his judgment and at his own discretion and risk. 92 The plaintiff sought to distance himself from this clause by saying that he did not see this clause when he signed the form.128Foot Note 128×5 January 2022 Transcript at p 87 lines 7–13.However, earlier during the trial, the plaintiff had testified that in business, the bigger the business deal that he would enter in, the more careful he would be in studying the terms of the business deal before committing.129Foot Note 129×5 January 2022 Transcript at p 38 lines 4–13.Yet, despite him depositing what eventually amounted to US$18m with the defendant, who were located in another country, he claimed that he did not review the terms and conditions of his account opening at all. Further, the term in question was not insignificant. It was a fundamental term which determined who, as between him and the defendant, was responsible for exercising judgment in respect of investments. 93 The plaintiff’s alleged reason was that the defendant is a world renowned bank and he trusted the bank.130Foot Note 130×5 January 2022 Transcript at p 80 line 3 to p 81 line 5.When it was cited to him that he was an experienced entrepreneur, who had won recognition and awards from the state and peers in China, and he should have known to read the contract with the bank carefully before opening an account with the bank, he said that he should have, but he trusted Ms Chiu, his RM.131Foot Note 131×5 January 2022 Transcript at p 89 at lines 5–6.Yet, at this point, he had met Ms Chiu on only a few occasions. There was no reason for him to trust her so fully as to sign documents without reviewing them simply because she asked him to do so. Moreover, Ms Chiu testified that the checks during account opening were carried out by another bank officer and were not part of her work scope.132Foot Note 132×18 January 2022 Transcript at p 182 lines 10–13. (4) Plaintiff’s risk profile forms 94 The fourth area where there are contradictions in the plaintiff’s evidence is in relation to his risk profile forms. 95 It is undisputed that the plaintiff signed eight investment risk profiles from 17 July 2012 to 6 March 2019.133Foot Note 133×DCB 24–105.Each of the plaintiff’s risk profiles was evaluated with a risk level which placed the plaintiff as a “very aggressive” investor. A “very aggressive” risk profile is described in the investment risk profile forms as having a risk tolerance where “it appears that you can buy investments or enter financial contracts with a risk of substantial negative price trends, that have a significant risk of losing their entire value, that may be difficult to sell or have an uncertain price at any given time, or are not allowed to sell over an extended period.” The description of product rating for this risk profile is “Very significant risk of loss associated with strategy and event risks, erratic price and liquidity conditions and/or products with strict redemption conditions”. There were Mandarin versions of all the investment risk profiles. 96 On the stand, the plaintiff sought to distance himself from his investment risk profiles. The plaintiff said that he did not intend to do investment with Citibank, but only wanted to move his moneys from his account in Hong Kong to Citibank in Singapore to keep it safe.134Foot Note 134×Plaintiff’s AEIC at para 24.He did not explain why he could not keep the moneys safe in Hong Kong. 97 The plaintiff claimed that he signed the July 2012 Risk Profile in blank, as he was given the form just before he left for the carpark.135Foot Note 135×6 January 2022 Transcript at p 7 lines 6–12.At this meeting, the plaintiff signed five other documents, the CAR,136Foot Note 136×9AB 5623–5624.the ELA Agreement,137Foot Note 137×9AB 5625–5630.the CKA Declaration,138Foot Note 138×9AB 5631–5632.the SN Agreement139Foot Note 139×9AB 5645–5647.and the Risk Disclosure Statement.140Foot Note 140×9AB 5648.It does not seem likely that if these five documents were given to the plaintiff to sign during the meeting, that the investment risk profile form would be raised only at the last minute before he left for the carpark. Even if it was, there is no explanation as to why he could not stay slightly longer to review the document or go through it with Ms Chiu before signing. In addition, the plaintiff suggested that during his meetings with Ms Chiu, they would only discuss matters at the “very first few minutes of one meeting or the last several minutes of one meeting”, and that 90% to 95% of his meeting time would be spent with Mr Teo.141Foot Note 141×6 January 2022 Transcript p 21 line 18 to p 22 line 6.However, the plaintiff did not suggest in his AEIC that he had met Mr Teo in 2012, and Mr Teo’s unchallenged evidence was that he first met the plaintiff only in 2016.142Foot Note 142×Teo’s AEIC at [11]. 98. The plaintiff said that he trusted Ms Chiu and hence signed a blank July 2012 Risk Profile.143Foot Note 143×6 January 2022 Transcript at p 42 lines 7–21.But at this point, he had only known her for about nine months. There was no reason for him to trust her to such an extent as to sign important documents in blank. When this was pointed out to the plaintiff, he replied that he did not understand the significance of the risk profile form at that time.144Foot Note 144×6 January 2022 Transcript at p 43 lines 4–13.I do not find this to be a credible explanation. The risk profile form was in Mandarin. It was open for the plaintiff to read it and ascertain its import for himself. Moreover, as of 17 July 2012, the plaintiff had not made any losses.145Foot Note 145×PRS at p 49.There was no apparent reason why Ms Chiu would deliberately fill in this form inaccurately, as there was no loss to cover up. 99 Even if the plaintiff signed a blank form on 17 July 2012 and did not know that his risk profile had increased to “very aggressive”, which I do not find to be the case, there is no explanation as to why the plaintiff continued signing risk profile forms with the same risk profile, from October 2012 till 2019. 100 Moreover, on 5 September 2014, Ms Chiu sent an e-mail containing a risk profile form in Mandarin to the plaintiff, for him to fill in his answers.146Foot Note 146×Plaintiff’s AEIC at p 2053.This investment risk profile form reflected his risk rating at the highest level, level 5. Ms Chiu also spoke with the plaintiff about his risk rating on 5 September 2014 and informed him that his risk profile was “P5”, which is the “very aggressive type”.147Foot Note 147×11AB 6841–6842. 101 If Ms Chiu intended to manipulate the plaintiff’s risk rating to a higher level as alleged by the plaintiff, there would be no reason for her to expressly inform the plaintiff in that phone conversation about his risk profile being level 5.  The plaintiff also acknowledged that he did not object to the risk rating of level 5 that Ms Chiu communicated to him.148Foot Note 148×6 January 2022 Transcript at p 71 lines 11-–17. 102 There is no explanation from the plaintiff as to why he did not object if he did not agree with such a risk profile. Instead, the plaintiff sought to explain that when he heard the word in Chinese for “aggressive”, that word could also mean “positive”, and having heard “positive” he was very happy.149Foot Note 149×17 January 2022 Transcript at p 63 lines 11–17 and p 64 line 15–18. 103 However, when it was pointed out that the conversation was about risk profiles and when asked what he understood a “positive” risk profile to be, the plaintiff was not able to explain. He said he only focused on the word “positive” and not “risk profile”.150Foot Note 150×17 January 2022 Transcript at p 65 lines 10–21.When it was pointed out to him that in the short span of the conversation, the word “risk profile” was mentioned five times, he simply replied “that is one of my habit… I didn’t ask them what’s the meaning of that word.”151Foot Note 151×17 January 2022 Transcript at p 66 lines 11–15.The plaintiff’s answers make no sense. 104 In any event, the plaintiff’s explanation that he did not read those documents does not help his case. It is trite law that as a general rule, a party is bound by their signature. The risk profiles were in Mandarin. The plaintiff had no excuse for not reading them. He was not misled as to their contents. The plaintiff is not allowed to take advantage of his own negligence and carelessness in failing to read the documents to avoid the consequences of his signature:Oversea-Chinese Banking Corp Ltd v Frankel Motor Pte Ltdand others[2009] 3 SLR(R) 623 at [25]–[26]. (5) Assistance to review Monthly Statements 105 The fifth area that highlights inconsistencies in the plaintiff’s evidence is the assistance he received in reviewing his Monthly Statements. 106 The plaintiff informed the defendant’s employees that his accountant was helping him to review his Monthly Statements. In a text that the plaintiff sent to Ms Chiu on 25 April 2017,152Foot Note 152×8AB 4749.he said: “This is from my accountant, for you to provide the information this time”. When referred to this message, the plaintiff said that he lied to Ms Chiu that his accountant wanted the information. The information was actually for his friend, Mr Jin, who was from another bank. The plaintiff also testified that he did not reveal the Monthly Statements to Mr Jin, as Ms Chiu said that the Monthly Statements were confidential.153Foot Note 153×11 January 2022 Transcript at p 92 lines 11–21.He also testified that at the time, he did not fully trust Mr Jin.154Foot Note 154×11 January 2022 Transcript at p 71 lines 4–13. 107 The plaintiff’s evidence that he did not reveal the Monthly Statements to Mr Jin is inconsistent with his oral evidence about another call with Mr Teo, on 14 March 2018. There, the plaintiff told Mr Teo, “This, I initially looked [at it], I initially [looked at it], this is also, my accountant also [looked at it]…”155Foot Note 155×12AB 7281 at 03:22.When referred to this, the plaintiff said that he was also talking about Mr Jin here and not his accountant.156Foot Note 156×11 January 2022 Transcript at p 90 line 13–14.But that would mean that on the plaintiff’s evidence, Mr Jin looked at the Monthly Statements, contrary to his later testimony that he did not. 108 In addition, the plaintiff’s evidence is that Mr Jin was able to provide him with numerical information on his account with the defendant, which the plaintiff used in his message to Mr Teo on 2 March 2018 discussed earlier at [73].157Foot Note 157×Plaintiff’s AEIC at para 284, 5AB 3310.Such information related to the realised profit being about US$500,000 and unrealised loss being about US$920,000. Given that the plaintiff’s evidence is that he could not understand the numbers in his Monthly Statements and that he did not disclose his Monthly Statements to Mr Jin, there is no explanation as to how Mr Jin would have been able to provide the plaintiff with such numbers. (6) Plaintiff informing the defendant not to tell him details 109 The sixth area of inconsistency in the plaintiff’s evidence relates to him informing the defendant’s employees not to tell him details of his transactions over the phone. 110 The plaintiff’s explanation for doing so is that the calls were too frequent and he was bored by the details. He did not agree with the defendant’s understanding of his reason for not wanting the details, which is that the plaintiff was concerned about his phone being bugged.158Foot Note 158×5AB 3043–3044, 12 January 2022 Transcript at p 107 lines 5–12. 111 However, the plaintiff also testified that one reason why he did not want the employees of the defendant to mention the numbers for individual transactions over the phone was that he did not want his friends or subordinates to know that his money was kept in his account with the defendant in Singapore.159Foot Note 159×12 January 2022 Transcript at p 101 lines 8–18.If this was so, it is unclear why he would want the defendant’s employees to mention his total account balance over the phone, which is even more sensitive information than the fact that his money was kept with the defendant. When posed this question, the plaintiff did not have a satisfactory reply and simply reiterated his other reason, which was that he did not want the defendant to tell him individual transaction numbers because they made him feel “bored”.160Foot Note 160×17 January 2022 Transcript at p 22 lines 8–19. (7) Indemnity letters 112 The seventh area of inconsistency in the plaintiff’s evidence relates to his evidence on the two indemnity letters that he signed. The plaintiff signed the 2015 Indemnity Letter, which confirms that he requested the defendant not to state account balances specifically during phone discussions. The plaintiff also signed the 2017 Indemnity Letter. Mr Tay testified that he brought the plaintiff through the 2017 Indemnity letter to explain to him the terms.161Foot Note 161×Tay Cheng Chun’s AEIC dated 19 October 2021 at paras 55–60.The 2017 Indemnity Letter was in Mandarin. 113 On the stand, the plaintiff’s case was that Ms Chiu and Mr Tay told him that the indemnity letters were compensation letters, from which he could claim for losses in his account. For example, if he suffered a loss of $500,000, the bank promised to compensate him $100,000 or $200,000.162Foot Note 162×12 January 2022 Transcript at p 130 lines 9–22.The indemnity letter, as the plaintiff claims he understood it, was clearly something beneficial to him and detrimental to the bank. When he was asked if he paid for the benefit of this alleged compensation letter, the plaintiff said: “There was no point for me to answer you your question because your question is based on a false document.”163Foot Note 163×12 January 2022 Transcript at p 134 lines 4–17.Yet, on the plaintiff’s case, he did not take this to be a false document when he first signed it. It is thus a relevant question, which the plaintiff chose not to answer. 114 I find it highly unlikely that the bank would blatantly lie about the nature of these indemnity letters, when their lie would be instantly exposed if the plaintiff decided to show the 2015 Indemnity Letter to someone else or to read the Mandarin version of the 2017 Indemnity Letter himself. (8) Facility Letters 115 The eighth area relates to the plaintiff’s evidence on the two facility letters that he signed. His evidence is that he signed the 1st Facility Letter without reading its contents, because he trusted Ms Chiu. Ms Chiu, on the other hand, testified that she took him through the letter and explained its purpose to him. 116 The plaintiff’s evidence on this does not make sense. He claims that Ms Chiu told him that by taking a loan and doing investments this way, it would only make profits and not lose money.164Foot Note 164×Plaintiff’s AEIC at para 64.He said that when Ms Chiu spoke with a firm tone, he accepted the loan that she suggested. 117 However, it is also not denied that the plaintiff has experience in the manufacturing business. He also testified that in his industry, he could not guarantee profits or losses, because sometimes the market is good and sometimes not.165Foot Note 165×17 January 2022 Transcript at p 16 lines 15–22.But despite this, he maintained that it was believable that someone such as Ms Chiu, could guarantee him making money. 118 Neither is it believable that as a successful entrepreneur recognised by the Chinese government and industry, who was the ex-Chairman of a company that did well enough for him to sell out his shares to an international company, would sign a facility letter, simply because his RM, Ms Chiu, took a firm tone. 119 The plaintiff signed the 2nd Facility Letter to increase his loan from US$10m to US$15m. The plaintiff claimed that Ms Chiu also told him he still had a lot of unutilised loan facility.166Foot Note 166×Plaintiff’s AEIC at para 78.If that were true, there would have been no reason for him to increase the loan facility amount. The plaintiff’s response when queried on this, was that Ms Chiu said that the loan was for two currencies, so he signed.167Foot Note 167×13 January 2022 Transcript at p 65 lines 16–20.This response does not make sense. (9) Appreciation of investment risks 120 The ninth area of inconsistency in the plaintiff’s evidence relates to his appreciation of investment risks. The plaintiff’s evidence is that he was not told about investment risks by the defendant. However, there are several documented instances where the employees of the defendant informed him of the investment risks. 121 For example, in a call between Ms Chiu and plaintiff on 5 September 2014, Ms Chiu referred to offer documents for structured note investments. She explained the risks and asked if he understood. The plaintiff said “OK” when Ms Chiu asked if she should confirm the order for him.168Foot Note 168×11AB 6845–6849. 122 In a phone call between Ms Chiu and the plaintiff on 7 July 2016,169Foot Note 169×12AB 7134.she explained to him that FX, like other investments, may go up or down and there may be profits or losses. The plaintiff said “OK”. 123 The plaintiff sought to explain that the short answers given by him in such examples, showed that he did not understand what was being said to him. However, the documentary evidence also shows that where the plaintiff had questions, he did probe. This is seen in his call with Mr Bernard Chua, an employee of the defendant, on 28 August 2013.170Foot Note 170×11AB 6656–6657.There, he further queried on a point he did not understand before he made a decision. This shows that where the plaintiff was not clear, he would query and did so till he understood. 124 The plaintiff’s evidence is also that during his time with the defendant, he was not told about risks associated with structured notes. However, he had signed a document “Risk Wrappers for RA, Structure Notes”.171Foot Note 171×Chiu Lee Lee’s Supplementary AEIC dated 22 December 2021 at pp 69–71.This contained a series of reminders, including that “Coupons/Returns are not guaranteed and may even be zero in adverse market conditions” and “you may not receive ALL of your principal at maturity”. This document was in Mandarin and the plaintiff signed off against the Mandarin portion of the document. Plaintiff’s credibility 125 After reviewing the evidence, I find that the plaintiff is not a credible witness. As can be seen from the above, his testimony on the stand was shown to be contradictory to documentary evidence in numerous areas. It was also frequently internally inconsistent. For example, in the key area of whether he could derive his net asset position from the Monthly Statements, his evidence was inconsistent and did not make sense. It was also contrary to the documentary evidence of phone call transcripts where the plaintiff made reference to specific details in his accounts. Another example is the plaintiffs’ evidence on his HSBC account, which shows him being caught out on numerous occasions, flatly contradicted by documentary evidence. There are many other areas, highlighted above, where the plaintiff’s evidence was contradicted by documentary evidence or where his answers to relevant questions did not make sense or were hard to believe. 126 Moreover, these were not inconsequential inconsistencies. They were contradictions that went to the crux of the plaintiff’s case. The frequency with which his oral testimony was contradicted by documentary evidence, and the range of areas in which this occurred, suggests that he was not averse to being economical with the truth in court, in order to serve his case. Adverse inference 127 In view of my findings above, it is unnecessary to go into the defendant’s submission that an adverse inference be drawn against the plaintiff for failing to comply with an order of court for discovery of his ICBC bank account documents and his other discovery obligations, as well as the incomplete discovery of his correspondence with Mr Jin. Credibility of defendant’s witnesses 128 In contrast to the plaintiff’s evidence, I found the evidence of the defendant’s witnesses to be credible. Their assertions were often backed up by supporting documents. Their evidence was unshaken during cross-examination. Many aspects of their evidence on the key issues were unchallenged during trial. I do not find reason to disbelieve their evidence. Conclusion on Category 2 129 The plaintiff has not produced any documentary evidence to support his allegations that the Category 2 representations were made. He relies only on his oral evidence. However, as set out above, many of his assertions were contradicted by documentary evidence. For the reasons set out above, I do not find him to be a credible witness. He was prepared to give false evidence to support his case. In contrast, the defendant’s witnesses have given unshaken testimony that the Category 2 representations were not made. As such, I find that the plaintiff has not proven, on a balance of probabilities, that the Category 2 representations were made. Thus, the Category 2 representations cannot form the basis for a claim in fraudulent or negligent misrepresentation.",
        "Category 3 omissions": "130 Category 3 involves alleged representations from the defendant’s employees, through omission or silence, that is, the silence of the defendant’s employees during their telephone conversations and meetings with the plaintiff about the losses in his account.172Foot Note 172×SOC at para 33.The plaintiff relies onBroadley Construction Pte Ltd vAlacran Design Pte Ltd[2018] 2 SLR 110 (“Broadley”) for the proposition that silence can in appropriate circumstances amount to a representation. In response, the defendant argues this applies only in limited circumstances. The defendant citesBroadleyat [28], where the Court of Appeal held that: The law has always been cautious in ascribing legal significance to a party’s silence. This applies to silence as acceptance of terms in a contract (seeR1 International Pte Ltd vLonstroff AG[2015] 1 SLR 521 at [53]–[54]), silence as waiver of rights (seeAudi Construction Pte Ltd v KianHiap Construction Pte Ltd[2018] 1 SLR 317 (“Audi Construction”) at [58]–[61]), and squarely in cases of misrepresentation by silence (seeWeeChiaw Sek Anna v Ng Li-Ann Genevieve[2013] 3 SLR 801 at [65]). Silence, being passive conduct, and inherently lacking the definitive quality of an active statement, is rarely considered sufficient to amount to a representation. But the courts have also made it clear that silence can in appropriate circumstances acquire a positive content and amount to a representation. Such cases have been characterised as situations where there is a duty on the alleged representor to speak or disclose certain facts, and in cases of misrepresentation, that failure to do so renders a statement previously made by the representor false or (more rarely) itself constitutes a false statement. Such a duty may arise out of the relationship of the parties and/or other circumstances in which the silence is maintained, and is to be assessed by reference to how a reasonable person would view the silence in the circumstances:Audi Constructionat [61]. 131 It is clear from this passage that a duty on the alleged representor to speak or disclose certain facts is necessary for silence to amount to a representation. Such a duty may arise out of the relationship between the parties or from how a reasonable person would understand the silence in the circumstances. In my view, neither gives rise to a duty to speak here. There cannot have been a duty on the defendant to tell the plaintiff his net asset position over telephone calls when the defendant was conveying that very information through the Monthly Statements that it sent to the plaintiff every month. 132 Thus, the defendant’s silence which the plaintiff relies on, cannot amount to a representation as perBroadley. The plaintiff’s claims for misrepresentation therefore fail in respect of Category 3.",
        "Contractual preclusion of negligent misrepresentation claim": "133 In view of my factual findings above, the defendant’s submission that any claim in negligent misrepresentation is precluded by contract, is not engaged. I will thus make only a few observations in this respect. 134 First, the plaintiff claimed at trial, that he did not review the account opening documents. This does not assist him, even if true. It is trite that in the absence of fraud or misrepresentation, a party is bound by all the terms of the contract he signs, even if he did not read or understand those terms:BintaiKindenko Pte Ltd v Samsung C&T Corp and another[2019] 2 SLR 295 at [58]. In any event, for the reasons stated earlier, I do not accept the plaintiff’s bare assertion that he did not review the account opening documents. 135 Second, the plaintiff did not plead the defence ofnon estfactum. In any event, it would not have been applicable here. InLee Siew Chun vSourgrapes Packaging Products Trading Pte Ltd and others[1992] 3 SLR(R) 855 at [62],the court made clear that to rely on the doctrine ofnon estfactum, the onus was on that party to prove that they had not been careless. In this case, the Account Opening Application was in Mandarin, which the plaintiff was fully literate in. The plaintiff could have easily read and understood this document. If he did not, that was his own choice and he cannot rely on the doctrine ofnon estfactum. 136 Third, the plaintiff pleaded that the contractual clauses are subject to ss 2 and 3 of the Misrepresentation Act (Cap 390, 1994 Rev Ed). However, these provisions deal with misrepresentations made before a contract was made, whereas the alleged misrepresentations took place after the relevant contractual documents were signed. 137 Fourth, it appears that the plaintiff’s approach to counter the contractual clauses relied on by the defendant, is to rely on the plaintiff’s evidential case rather than specific legal arguments. For example, the Account Opening Application, which was in English and Mandarin, contains a non-reliance clause, stating that the plaintiff would make his decisions solely in reliance on his own judgment and that he would not rely on views, representations, advice or recommendations from the defendant in making his decisions.173Foot Note 173×9AB 5141–5412.The plaintiff’s submission in response is that it would not be reasonable for the defendant to rely on the non-reliance clause, when it had not been informing the plaintiff of his losses.174Foot Note 174×PRS at paras 40–42.Similarly, with respect to the conclusive evidence clause found in the T&Cs, which provides that the plaintiff bears responsibility for verifying the correctness of his account balances as stated in his Monthly Statements, the plaintiff’s submission is that this does not apply because the plaintiff did not see the contents of his Monthly Statements.175Foot Note 175×PRS at para 43.These evidential submissions of the plaintiff are not borne out by my findings, as set out above.",
        "Conclusion on misrepresentation": "138 In summary, I find that there is no evidential basis for any of the plaintiff’s claims in misrepresentation. The Category 1 representations were true. In fact, the plaintiff did not even attempt to prove that they were false. The Category 2 representations were not made, taking into consideration the documentary evidence and the credibility of the plaintiff and the defendant’s witnesses. The Category 3 omissions did not fulfil the requirements needed to found a misrepresentation claim on the basis of silence.",
        "Conclusion": "148 In conclusion, for the reasons above, I dismiss the plaintiff’s claims against the defendant. I will hear parties on costs. Kwek Mean LuckJudge of the High Court Aqbal Singh s/o Kuldip Singh, Wong Yiping and Cheng Cui Wen (Pinnacle Law LLC) for the plaintiff; Gary Leonard Low, Tan Wee Kio Terence, Tong Yi Keat Zachary and Lin Qingxun (Drew & Napier LLC) for the defendant."
    }
}