{
    "case_title": "OP3 International Pte Ltd (in liquidation)  vFoo Kian Beng",
    "ncitation": "[2022] SGHC 225",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 The plaintiff, OP3 International Pte Ltd (“OP3”), is a company in liquidation. This is an action by OP3’s liquidator against its former director, Mr Foo Kian Beng (“Mr Foo”), for alleged breaches of duties. Having considered the evidence and the parties’ closing submissions, I allow OP3’s claim in part.",
        "Background": "",
        "Parties and other personalities": "2 OP3 was incorporated on 20 December 2006, to engage in interior design, decorating consultancy and construction activities.1Foot Note 1×Statement of Claim (Amendment No 1) (“SOC”) at para 1 and Defence (Amendment No 1) (“Defence”) at para 3.Between 1 August 2010 and 3 April 2020, Mr Foo was the sole director of OP3. He was employed as its managing director.2Foot Note 2×Affidavit of evidence-in-chief (“AEIC”) of Foo Kian Beng (“FKB”), pp 32 to 33. 3 On 3 April 2020, pursuant to an order of court obtained by Smile Inc Dental Surgeons Pte Ltd (“Smile Inc”), OP3 was wound up. Smile Inc’s application for the winding up order was based on the judgment debt it obtained against OP3 in HC/S 498/2015 (“Suit 498”) on 11 November 2019. 4 I should also mention OP3 Creative Pte Ltd (“OP3 Creative”), which was incorporated on 4 May 2010, to carry out activities including manufacturing of carpentry and other construction works. Mr Foo is the sole director and shareholder of OP3 Creative.3Foot Note 3×SOC at paras 25 and 26 and Defence at para 18.",
        "Suit 498": "5 Suit 498 arose from an agreement between OP3 and Smile Inc dated 19 July 2013, whereby OP3 was to provide,interalia, fitting out works (including design and construction) at Smile Inc’s clinic located at Suntec City Mall (the “Clinic”). Under the contract, OP3 was to be paid $158,010. Half the sum was to be paid upon execution of the contract and the balance to be paid on the completion of the works.4Foot Note 4×Agreed Bundle of Documents (“ABD”), Vol 1, p 30. 6 On 9 January 2014, Smile Inc discovered mould growing on the walls of the Clinic. This was caused by a flood in the Clinic (“the First Flood”). OP3 carried out and completed remedial and rectification works on 17 January 2014.5Foot Note 5×AEIC of Don Ho Mun-Tuke (“DHM”) at para 13.On 21 July 2014, Smile Inc, again, discovered mould growth on the walls. Similarly, this was caused by a flood in the Clinic (“the Second Flood”).6Foot Note 6×AEIC of DHM at para 14.Rectification works were carried out by a third party. 7 On 22 August 2014, Smile Inc sent a letter of demand to OP3 claiming a sum of $676,715.68 on the basis that the floods were caused by OP3’s defective works (“the LOD”).7Foot Note 7×ABD, Vol 28, pp 21924 to 21927.On 22 May 2015, Smile Inc commenced Suit 498, seeking a sum of $$1,807,626.8Foot Note 8×AEIC of DHM at para 16.The Writ of Summons and Statement of Claim were served on OP3 on 25 May 2015. 8 On 5 October 2017, following the trial on liability, the High Court found OP3 liable to Smile Inc for damages but granted judgment for OP3 on its counterclaim for $87,432.50 comprising a substantial part of the balance sum under the agreement and an amount for some variation works.9Foot Note 9×ABD, Vol 6, pp 4383 to 4384.After the assessment of damages, on 11 November 2019, Smile Inc’s damages were quantified at $621,621.69. Accounting for the set-off sum of $87,432.50, OP3 owed Smile Inc damages of $534,189.19 (excluding interest and costs).10Foot Note 10×ABD, Vol 6, p 4476.",
        "Dividend payments, repayment of moneys and loss of revenue": "9 Meanwhile, between 2015 and 2017, OP3 declared and paid dividends to Mr Foo, as well as repaid moneys to Mr Foo. These transactions form the subject matter of the present action. The details are as follows:11Foot Note 11×Defendant’s Closing Submissions (“DCS”) at para 65. See also Plaintiff’s Reply Submissions (“PRS”) at para 150. Declaration and payment of dividends to Mr FooS/NDate of resolutionDate of paymentPurposeAmount (S$)110 December 201511 December 2015Dividends for 20121,200,000210 December 201511 December 2015Dividends for 2014700,00038 July 201613 July 2016Dividends for 2015400,000427 December 2016OP3 claims that this was paid in December 2016. Mr Foo argues, however, that this was paid out as part of s/n 6 below in 2017.Dividends for 2015500,000Subtotal2,800,000Repayment of moneys owing to Mr FooS/NDate of paymentAmount (S$)511 December 2015138,35262017682,394Subtotal820,746Total3,620,746 10 At this juncture, I note that OP3’s financial year ends on the last day of each year. In relation to s/n 3 above, the parties accept that the dividend sum of $400,000 was erroneously recorded in OP3’s financial statements for the year ending 31 December 2015. Instead, it should have been recorded in OP3’s financial statements for the year ending 31 December 2016. The significance of this error is explored further at [93] and [121] below. 11 In relation to s/n 4 above, Mr Foo claims that the dividend sum of $500,000 formed part of s/n 6,ie,the sum of $682,394 paid to him in 2017, and that there was a double counting of the sum of $500,000. OP3’s position, in turn, is that these were separate transactions. Apart from this issue, the parties accept that the other transactions occurred as set out in the table. 12 On a separate note, it is also not disputed by the parties that OP3 experienced a drop in revenue during the relevant period.",
        "The parties’ cases": "",
        "OP3’s case": "13 OP3’s case is that from 2015 to 2017, Mr Foo wrongfully dissipated and/or diverted funds and business of OP3 by way of three broad categories of acts. The first relates to the procuring and causing of the payments of dividends to himself amounting to $2,800,000 (as set out at [9] above) (“the Dividend Payments”). The second relates to the repayment of moneys in the sum of $820,746 (as set out at [9] above) to himself (“the Repayment of Moneys”). That said, OP3 accepts these were valid debts owing to Mr Foo. The third relates to the diversion of business to OP3 Creative (quantified at trial as $1,993,788) (“the Diversion of Business”).12Foot Note 12×SOC at para 22 and Plaintiff’s Closing Submissions (“PCS”) at para 230. 14 By carrying out these acts, Mr Foo allegedly acted in breach of a range of overlapping statutory, fiduciary and common law duties. These include the duty to actbona fideand with reasonable diligence in the interests of OP3, the duty to not place himself in a position of conflict of interest with OP3, and the duty to act for proper purposes. Most significantly, OP3 alleges that Mr Foo breached his duty to consider the interests of creditors. Such a duty arises when a company is insolvent or financially parlous. 15 In fact, OP3’s primary case is that it was insolvent at the material time,ie,at the latest from 25 May 2015 onwards. A company is insolvent if it is unable to pay its debts. Under s 125(2)(c) of the Insolvency, Restructuring and Dissolution Act (No. 40 of 2018) (“IRDA”), in determining whether a company is unable to pay its debts, a court must take into account contingent liabilities. A contingent liability arose from Suit 498. It was reasonably likely to materialise and thus should have been taken into account in assessing the solvency of OP3 at the material time.13Foot Note 13×PCS at paras 10 and 89.Specifically, it should have been accounted for at a value of either $1,542,206 or $534,189 as at 17 January 2014 (which was after OP3 had carried out rectification works at the Clinic following the First Flood), or at the latest, 25 May 2015 (the date that Suit 498 was served on OP3).14Foot Note 14×SOC at paras 20, 27 and 31. PCS at para 24(c).Taking into account this contingent liability, OP3 would have been cash flow insolvent as at 31 December 2015, and balance sheet insolvent as at 31 December 2015, 31 December 2016 and 31 December 2017.15Foot Note 15×PCS at paras 108, 111, 114 and 117. 16 In the alternative, OP3 avers that it was financially parlous at the material time. Primarily, OP3 relies onDynasty Line Ltd (in liquidation) vSukamto Sia[2014] 3 SLR 277 (“Dynasty Line”) to argue that based on a broad assessment of the facts, OP3 was in such a state from 25 May 2015 onwards.16Foot Note 16×PCS at para 130. 17 Accordingly, OP3 alleges that the Dividend Payments and the Repayment of Moneys were improper. These transactions caused OP3 to be unable to make payment of the judgment debt accruing under Suit 498.17Foot Note 17×SOC at para 35.As for the claim of Diversion of Business, OP3 points to a drop in its revenue following the commencement of Suit 498 to suggest that Mr Foo had diverted its business to OP3 Creative to put its assets out of the creditors’ reach. 18 These breaches caused loss and damage to OP3. In total, OP3 seeks $5,614,534 from Mr Foo.",
        "Mr Foo’s case": "19 Core to Mr Foo’s case is that he was not under an obligation to consider the interests of creditors. Such a duty only arises if OP3 was insolvent or on the verge of insolvency (and notmerely when the company is in a parlous financial situation). OP3, at the material time, was in neither state.18Foot Note 18×DCS at paras 80 and 82. 20 Pertinently, Suit 498 was not a contingent liability that was reasonably likely to materialise. Additionally, no provision was to be made of Suit 498 in the preparation of OP3’s financial statements based on the Financial Reporting Standards (“FRS”). Thus, there was no reason to consider Suit 498 when assessing OP3’s solvency at the material time.19Foot Note 19×DCS at paras 122 to 130.Underlying these contentions is Mr Foo’sbona fidebelief that OP3 had a strong and legitimate defence against Smile Inc’s claim. This is based on his knowledge of the facts in Suit 498 at the material time and the legal advice he received from the lawyer engaged for the case, Mr Vijai Parwani from Parwani Law LLC (“Parwani Law”).20Foot Note 20×Defence at para 6.Consequently, based on technical accounting standards, OP3 was not insolvent or on the verge of insolvency. Even if OP3 was insolvent or on the verge of insolvency at the time of the Dividend Payments, Mr Foo contends that he had discharged his duty to consider the interests of creditors.21Foot Note 21×DCS at paras 131, 146 and 147. 21 As for the transactions, Mr Foo argues that OP3’s claim for the repayment of the sum of $682,394 (s/n 6 at [9] above) contains a double claim. The sum of $682,394 paid to him included the dividend sum of $500,000 declared on 27 December 2016 which was paid out in 2017 (s/n 4 at [9] above).22Foot Note 22×DCS at para 190. 22 Lastly, for the Diversion of Business, Mr Foo denies diverting any of OP3’s business to OP3 Creative.23Foot Note 23×DCS at paras 203 to 217.Any drop in revenue suffered by OP3 was caused by Suit 498.24Foot Note 24×DCS at paras 218 to 225. 23 In the final analysis, Mr Foo contends that even if he is found to be in breach of any of his duties, he should be excused of liability under s 391 of the Companies Act 1967 (“CA”) as he acted honestly and reasonably.25Foot Note 25×DCS at paras 247 to 266.",
        "The issues": "24 Based on the parties’ cases, the issues for determination, broadly framed, are: (a) Whether the duty to consider the interests of creditors arises when a company is financially parlous. (b) Whether OP3 was insolvent at the material time. The sub-issues which are subsumed within this issue include whether the liability pursuant to Suit 498 is a contingent liability that should be taken into account in assessing the solvency of OP3, and if so, the quantum to be ascribed to the contingent liability. (c) Assuming the duty to consider the interests of creditors arises when a company is financially parlous, whether OP3 was financially parlous at the material time. (d) Whether Mr Foo breached his duties in relation to the Dividend Payments and the Repayment of Moneys. (e) Whether Mr Foo engaged in the Diversion of Business, and if so, whether he was in breach of his duties. (f) If Mr Foo is found to be in breach of his duties, whether he should be excused of liability under s 391 of the CA. 25 I shall deal with these issues in turn.",
        "Whether the duty to consider the interests of creditors arises when a company is financially parlous": "26 The company-director relationship is a well-established category of fiduciary relationship, which encompasses, among others, the duty to act in the best interests of the company. Where a company is solvent, the company’s directors owe no duty to creditors:Liquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 (“Progen Engineering”) at [48]. Such a duty, however, arises when a company is insolvent. Directors then have a fiduciary duty to take into account the interest of the company’s creditors when making decisions for the company:Progen Engineeringat [48] andTraxiar Drilling Partners II Pte Ltd (in liquidation) v Dvergsten, Dag Oivind[2019] 4 SLR 443 at [83]. These propositions of law are accepted by the parties. 27 The parties also do not dispute that a company need not be insolvent by technical accounting standards (ie, on the balance sheet or cash flow test) before a director is required to consider the interests of creditors. This is explained by the Court of Appeal inDynasty Lineat [33] and [34]. For the purpose of establishing whether a director has breached his duty by failing to consider the interests of its creditors in carrying out certain transactions, the Court of Appeal noted that beyond technical insolvency, a broad assessment of the circumstances of the case, including “all claims, debts, liabilities and obligations”, is to be undertaken. The general financial health of a company is to be considered in context, so as to ascertain if there was “reason to doubt or to be concerned over the financial viability of the company”, especially at the time of the disputed transactions. 28 Where parties diverge iswhenthe duty to consider the interests of creditors arisespriorto the insolvency of a company. OP3 suggests that it arises when the company is financially parlous while Mr Foo submits that the true test is whether the company is on the verge of insolvency.26Foot Note 26×PCS at paras 9 and 122 to 126; Plaintiff’s Opening Statement dated 22 February 2022 (“POS”) at para 30. See also DCS at para 80.In this regard, Mr Foo’s submission is not entirely clear. It is not clear whether Mr Foo means to argue that prior to the company being insolvent, such a duty only arises when the company is on the verge of insolvency (ie, that the duty does not arise when a company is merely in a parlous financial state), or that being on the verge of insolvency is synonymous to being in a parlous financial situation. 29 On either formulation, Mr Foo’s submissions are unpersuasive. On the former, this goes against the weight of the authorities. InProgen Engineeringat [48], the Court of Appeal held that the duty to consider the interests of creditors arises when a company is in a financially parlous situation. The term, “parlous financial situation”, was then also used inParakou InvestmentHoldings Pte Ltd and another v Parakou Shipping Pte Ltd (in liquidation) and other appeals[2018] 1 SLR 271 (“Parakou (CA)”) at [99], albeit indirectly, when the Court of Appeal discussed whether the company was in such a state, to determine whether the director owed a duty to consider the interests of creditors. I further note that Mr Foo appears to rely primarily onW&P Piling Pte Ltd (in liquidation) v Chew Yin What and others[2007] 4 SLR(R) 218 (“W&P Piling”), as the basis to suggest that such a duty only arises when a company is on the verge of insolvency. None of the other authorities highlighted by Mr Foo indicates such a duty arises only when the company is on the verge of insolvency. However,W&P Pilingpre-datesProgen Engineering. 30 As for the latter formulation of Mr Foo’s submissions, I, again, cannot agree. On a plain reading of the two terms, it is apparent that they bear different meanings. A company on the verge of insolvency is clearly in a worse position than a company in a parlous financial situation. This also seems to be the view taken inDiabloFortune Inc v Duncan, Cameron Lindsay and another[2018] 2 SLR 129 (“Diablo Fortune”). There, the court was concerned with the appropriate characterisation of liens on sub-freights. The court rejected that such liens should be understood as agreements to create a charge. On such an understanding, the lien would only be registrable when the lien is exercised in response to a default by the charterer, and “[b]y this time, the charterer would likely be in a parlous financial situation,teetering on the verge of insolvency” [emphasis added], thus allowing “the shipowner to steal a march on the other creditors”: at [65]. While the observation was made in a different context, nothing suggests that it should not apply with equal force in the present situation, in distinguishing between being in a parlous financial situation and being on the verge of insolvency. After all, the comment was made in relation to the financial health of an entity. 31 Therefore, I do not agree with Mr Foo’s submissions. It cannot be that such a duty only arises when a company is on the verge of insolvency, given that it arises when a company is in a parlous financial situation (which I understand to be a state of affairs that is less severe than that of being on the verge of insolvency). Having said that, the real difficulty is that it remains unclear when one would consider a company to be in a parlous financial situation or on the verge of insolvency. No serious attempt has been made by parties to delineate the parameters of these terms. 32 In these circumstances, it is apposite to note the rationale underlying such a duty, that being to ensure that a company’s assets are not wrongfully dissipated so that debts owing to creditors may be met. InProgen Engineeringat [52], it is observed that the company in such a state is “effectively trading and running the company’s business with the creditors’ money”. Further,Dynasty Lineis particularly instructive as to when such a duty is triggered as the Court of Appeal explained at [34]: … The weight to be accorded to [the creditors’] interests willvary according to the financialhealth of the company. Where the company is in robust financial health with little, if any, risk to the interests of its creditors a director would be entitled to pay greater heed to what is best for the shareholders. But where there are mounting concerns over its financial health, the pendulum will swing towards its creditors... [emphasis added] 33 To reiterate, as mentioned in [27] above,Dynasty Linecalls for a broad-based assessment to be undertaken as to the financial health of the company. In my view, whether and to what extent the director should consider the interests of creditors requires a practical assessment of the financial health of the company. There is no fixed or static point on a continuum to determine whether the company is in a parlous financial situation or on the verge of insolvency. This is not only consistent with the rationale underlying such a duty, but also sufficiently encompasses the different nomenclature used in the cases. 34 In conclusion, the duty to consider the interests of a company’s creditors does not arise only when a company is on the verge of insolvency; instead, it arises when the company is financially parlous. In any event, these terms, in themselves, are of limited utility in shedding light on when the duty would arise. In this inquiry, a practical and broad assessment of the financial health of the company should be undertaken to decide when, as indicated inDynasty Line, the pendulum should swing towards the interests of the creditors.",
        "Whether OP3 was insolvent or financially parlous at the material time": "35 With that, I turn to consider OP3’s financial health at the material time. In this regard, OP3 argues that it was insolvent or financially parlous as at 17 January 2014 or at the latest on 25 May 2015. Before getting there, the two matters for determination are whether liability pursuant to Suit 498 is a contingent liability to be taken into account in assessing the solvency of OP3, and if so, the value to be ascribed to Suit 498.",
        "Whether liability pursuant to Suit 498 is a contingent liability to be taken into account in assessing OP3’s solvency, and if so, the value to be ascribed": "36 As set out at [15] above, s 125(2)(c) of the IRDA states that in assessing whether a company is unable to pay its debtsie,the solvency of a company, so as to wind up a company, the court “must take into account thecontingentand prospective liabilities of the company [emphasis added]”. The parties accept that similarly, where the solvency of a company is being considered in the context of breach of a director’s duties over transactions entered into before liquidation, contingent liabilities should be taken into account:ParakouShipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 15(“Parakou (HC)”)at [76]. The applicable test 37 The parties further accept that a contingent liability is a liability or loss which arises out of an existing legal obligation or state of affairs but which is dependent on the happening of an event which may or may not occur, and that whether a contingent liability should be taken into account will depend on whether it is reasonably likely to materialise:Parakou (HC)at [76], [77]–[78]. 38 Apart from the above, parties also refer to the standards set out in the FRS. Under the FRS, a provision should be made in a company’s accounts under three conditions: (a) an entity has a present obligation (legal or constructive) as a result of a past event; (b) it is probable that an outflow of resources embodying economic benefits will be required to settle the obligation; and (c) a reliable estimate can be made of the amount of the obligation.27Foot Note 27×ABD, Vol 29, pp 22136 to 22152.The term “probable” is defined at paragraph 23 of the FRS to mean “more likely than not”. 39 Mr Foo relies on the FRS to contend that the liability pursuant to           Suit 498 need not be provided for. OP3’s position, however, is that the FRS does not necessarily determine the question.28Foot Note 28×PCS at para 106.I agree with OP3. While the test outlined in the FRS is proximate to the test outlined under s 125(2)(c) of the IRDA and inParakou (HC),it is the latter which is applicable in considering the question of insolvency. Mr Foo, in arguing that no provision should be made under the FRS, also relies substantially on the same points as those raised in arguing that the liability pursuant to Suit 498 was not a contingent liability that was reasonably likely to materialise. Little to no distinction is made by Mr Foo between the two tests. In my view, the applicable test would be that set out under s 125(2)(c) of the IRDA andParakou (HC). 40 Based on the applicable test, the nub of the issue is whether the liability arising from Suit 498 was reasonably likely to materialise. To be exact, this refers to the likelihood of an unfavourable judgment being granted against OP3. It does not merely refer to the likelihood of the action itself materialising. Mr Foo, however, disagrees with OP3’s contentions in relation to how the inquiry as to the reasonable likelihood of a contingent liability materialising is to be undertaken. I now deal with these two issues briefly. Whether the court is entitled to employ the benefit of hindsight 41 First, OP3 argues that in undertaking the inquiry, the court is entitled to employ the benefit of hindsight. That being the case, the court should consider the eventual outcome of Suit 498. 42 Many of the points relied on by OP3 in support of this proposition are bare and unsubstantiated. OP3, for instance, highlights that in the preparation of accounts, auditors take on board events that occur after the date of the accounts.29Foot Note 29×Plaintiff’s Reply Submissions dated 13 April 2022 (“PRS”) at para 98.This is completely unpersuasive. The fact that auditors do so for the purpose of the preparation of accounts is not a reason for the court to do so. 43 OP3 also attempts to rely onParakou (HC)andParakou (CA).30Foot Note 30×PCS at paras 19, 20, 21 and 23(a).These authorities, however, do not support their argument. InParakou (HC), the court’s reference to the events that happened after the fact was merely confirmatory of the finding of the insolvency of the company at the material time. InParakou (CA), the issue of hindsight was not raised at all. 44 I reiterate that the court’s inquiry is whether at the material time, a liability was reasonably likely to materialise. This must necessarily be rooted in the facts and circumstances at that point in time. Ultimately, the court’s inquiry is undertaken to assess the conduct of a company and its directors. As Mr Foo argues, a company and its directors cannot possibly be expected to act on the basis of facts and circumstances of which they are unaware, and of which they would only become aware of at some point in the future. I accept his argument. Such an approach is similarly taken in assessing the conduct of auditors and solicitors, in that the court does not rely onex post factoknowledge but instead rely on the circumstances at the material time:Tan & Au LLP v Goh Tee Lee[2012] 4 SLR 1 at [63]–[66], where it was observed that in assessing whether a solicitor had exercised reasonable skill and care, the solicitor should be judged in light of the circumstances at the time;PlanAssure PAC (formerly known as Patrick Lee PAC) v Gaelic Inns Pte Ltd[2007] 4 SLR(R) 513 at [54], which held that the auditors should not be assessed with the benefit of hindsight. Should the court employ hindsight to consider the question of contingent liability, it is tantamount to indirectly relying onex post factoknowledge to examine the conduct of the company and its directors. In my view, this would be wrong. 45 I accept that subsequent events that occur may be useful in the court’s assessment of a company’s solvency in so far as such events form the factual substratum from which certain inferences may be drawn concerning the state of affairs or state of mind of persons at the material time. However, in so far as OP3 seems to argue that the fact that certain events occurred, in themselves, can be relied on to show that it was reasonably likely that they would eventually occur, and that a company and its directors should or ought to have known of this, I do not agree with OP3. The burden in proving that the likelihood of the contingent liability materialising was too remote 46 Second, OP3 submits that the party who disputes the existence or extent of the contingent liability bears the burden in proving that the likelihood of the contingent liability materialising was too remote. In particular, OP3 relies onParakou (CA)at [46] as well asKon Yin Tong and another v Leow Boon Cher and others[2011] SGHC 228 (“Kon Yin Tong”).31Foot Note 31×PCS at paras 21 and 23(c).Mr Foo disputes OP3’s interpretation of the cases. 47 InParakou (CA), the Court of Appeal observed at [46] that “the [appellants], as the party asserting that the claim by [a third party] was only worth S$3,000,000, bear the burden of proving that fact”. OP3 relies on this in support of the proposition advanced. This is erroneous. As Mr Foo correctly argues, the party that puts forward a figure has the burden of establishing the correctness of the figure but the legal burden of demonstrating the existence and extent of the contingent liability remains on the party who asserts so.32Foot Note 32×Defendant’s Reply Submissions (“DRS”) at para 7.The comment at [46] ofParakou (CA)relates to theevidentialburden borne by the appellants in asserting the value of the claim as being lower than that put forth by the respondents. This was in reply to the respondents, who had demonstrated the existence and extent of the contingent liability.  48 As forKon Yin Tong, it, too, does not lay down any such rule pertaining to the burden of proof. InKon Yin Tong, the court sought to assess the solvency of a company to decide whether to claw back certain payments. One of the issues concerned whether a successful claim by a third party (known as Soon Li Heng) should be taken into account in the assessment of the company’s solvency (see [21]). Part of the company’s argument was that Soon Li Heng’s claim was to be disregarded as the company had commenced a counterclaim (see [95]). In this context, OP3 relies on the court’s observation at [95] that as the company’s counterclaim was subsequently found to be without merit, “the [defendants] (or [one of the defendants], at least, since he was aware of what went on at the site) could not reasonably believe that the counterclaim had much of success.” This, OP3 submits, demonstrates that the burden of proof is shifted to the disputing party. This is incorrect. The observation at [95] relates to one of the defendants’ contemporaneous knowledge of the facts on the site such that they could not have reasonably believed that they would succeed in their counterclaim. Indeed, at [10], the court highlighted that generally, the burden of proof is borne by the party making the allegation of insolvency. 49 In sum, the burden of proof remains on the party that seeks to demonstrate the existence and extent of the contingent liability. In so far as that party has adduced sufficient evidence to meet their evidential burden on the relevant facts, the evidential burden will then shift to the disputing party to dispute either the existence or the extent of the contingent liability. Whether liability pursuant to Suit 498 was reasonably likely to materialise 50 OP3 argues that liability pursuant to Suit 498 is a contingent liability that was reasonably likely to materialise as at 17 January 2014 or latest by 25 May 2015,33Foot Note 33×PCS at paras 26 to 34.and that it should have been accounted for at a value of either $1,542,206 or $534,189. As stated above, this should be demonstrated by OP3 based on the facts known at the material time. In response, Mr Foo argues that the liability pursuant to Suit 498 was not reasonably likely to materialise on those dates.34Foot Note 34×DCS at para 122. (1) 17 January 2014 51 I do not find that as at 17 January 2014, the liability pursuant to Suit 498 was reasonably like to materialise. The mere fact that OP3 carried out rectification works after the First Flood is inadequate. At that time, the Second Flood had not yet happened. Also, neither the LOD nor the Writ of Summons had been issued. Plainly, Suit 498 was not in existence. On an interconnected note, it bears reminding that OP3’s case on the possible amounts to be ascribed to Suit 498 rests on the sums indicated in the Writ of Summons or the liability judgment. Even the amount in the Writ of Summons was not known to Mr Foo on 17 January 2014. (2) 25 May 2015 52 To determine if, as at 25 May 2015, it was reasonably likely that liability pursuant to Suit 498 would materialise, I consider the following factors raised by the parties: (a) Objective assessment of the merits of Suit 498. (b) Legal advice on the merits of Suit 498 from Parwani Law. (c) The LOD and the closure of the Clinic following the First and Second Floods. (A) Objective assessment of the merits of Suit 498 53 OP3 argues that Suit 498 concerns two main issues: first, whether OP3 designed the drainage system for the Clinic, and second, whether the design and construction of the drainage system was defective. OP3 contends that Mr Foo must have known whether OP3 designed the drainage system,35Foot Note 35×PCS at paras 53 to 59 and 71.and that a reasonable person at the material time would have concluded that the design and construction of the drainage system was defective.36Foot Note 36×PCS at paras 72 to 77.Mr Foo disputes OP3’s assessment of the facts of Suit 498. The present proceedings are not a forum for the defences raised in Suit 498 to be re-tried.37Foot Note 37×DRS at para 35.In any event, what is significant is the legal effect of these facts (which would require Mr Foo to rely on the legal advice he received).38Foot Note 38×DRS at para 56. 54 The parties accept that, as of 25 May 2015, the following had occurred: (a) the First Flood and rectification works by OP3 by 17 January 2014; (b) the Second Flood on 21 July 2014, with rectification works done by a third party; and (c) the service of the Writ of Summons and Statement of Claim on OP3.39Foot Note 39×AEIC of FKB at FKB-8 and FKB-9, pp 63 to 81.I analyse each of these in turn. 55 Concerning the First Flood, Mr Foo argues that the performance of rectification works by OP3 did not mean that OP3 was liable for damages.40Foot Note 40×DRS at para 39.An examination of the nature of rectification works performed suggests otherwise. According to Mr Foo, the First Flood was caused by Smile Inc’s failure to clear the floor trap of debris.41Foot Note 41×Defence at paras 6(d) and 6(e).As such, an access panel was added to enable Smile Inc to carry out regular monthly maintenance of the drainage system. However, prior to the addition of the access panel, the drainage system was completely sealed off. This meant that Smile Inc was unable to clear the debris in the floor trap (which resulted in the First Flood)becauseof OP3’s omission in providing an access panel. This was conceded by Mr Foo in the course of cross-examination and demonstrates that, based on his contemporaneous knowledge, he could not have reasonably believed that OP3 should not bearanyliability for the First Flood.42Foot Note 42×Transcript, 3 March 2022, p 132, lines 21 to 25. 56 As for the Second Flood, Mr Foo argues that it was unclear what caused it, and that an inquiry had to be carried out to determine the cause of the flooding.43Foot Note 43×DRS at para 40.Given so, it is tenuous for Mr Foo to then aver that it was not reasonably likely thatanyliability from Suit 498 would materialise. In so far as he concedes that an inquiry was required, it beggars belief that he could have taken the position that OP3 should not bear any liability for the matters in Suit 498. 57 As for the Statement of Claim, Smile Inc had,inter alia, alleged that OP3’s works were defective, which resulted in the floods in the Clinic.44Foot Note 44×AEIC of FKB at FKB-8, p 69.In particular, Smile Inc averred that OP3 had caused a hole in the drainage pipe in the Clinic (under Particulars following para 15, at para 18(b)) and failed to ensure that the design and construction of the plumbing and drainage works were properly carried out (under Particulars following para 15, at para 18(a)). In his defence, Mr Foo denied both allegations. 58 With respect to the former, I find that there was adequate basis for Mr Foo to reasonably hold the view that the hole in the drainage pipe was not caused by OP3 at the time. He had engaged a third party known as AXN Engineering Pte Ltd on 28 August and 29 August 2014 to conduct water pressure tests, and the reports showed that there were no defects with the drainage pipes.45Foot Note 45×AEIC of FKB at FKB-7. 59 However, as for Smile Inc’s latter allegation, Mr Foo’s basis for taking the view that OP3 was not responsible is not clear to me. On one hand, Mr Foo asserts that OP3 was not responsible for the design of the drainage pipes at the Clinic, thereby completely disclaiming any responsibility on this front.46Foot Note 46×AEIC of FKB at para 29(a).On the other hand, he accepts that during a pre-trial conference for Suit 498, Parwani Law clarified to the court that the design of the drainage system was undertaken solely by OP3.47Foot Note 47×DRS at para 58.Given that whether OP3 designed the drainage system should have been an issue well within Mr Foo’s knowledge, it is peculiar that Mr Foo’s position is equivocal. In the alternative, Mr Foo’s view that the design and construction of the drainage system was not defective may be supported by the expert report obtained from Dr Chee Yan Pong (“Dr Chee”), who opined that the design and construction of the drainage system was not defective.48Foot Note 48×ABD, Vol 28, p 21976.This report, however, was prepared around 8 July 2016, well after 25 May 2015. 60  Accordingly, it is unclear to me on what basis Mr Foo, as at 25 May 2015, considered that the design and construction of the drainage system were not defective and that OP3 would not have to bearanyliability for the Second Flood. 61 On balance, therefore, based on the facts and circumstances known at 25 May 2015, it could not be said that Mr Foo could reasonably opine that OP3 would not face any liability in Suit 498. The fact of the matter is that the Second Flood occurred even after rectification works. That said, I am mindful that Mr Foo’s position is not based solely on the facts known at the material time, but that it is also in part due to the legal advice from Parwani Law. With that, I turn to the issue of the legal advice on the merits of Suit 498. (B) Legal advice on the merits of Suit 498 from Parwani Law 62 Mr Foo emphasizes that after receiving the LOD, he was advised by Parwani Law that “[OP3] hada strong defenceagainst any claims from Smile Inc and that Smile Inc washighly unlikely to succeed in its claimagainst [OP3]” [emphasis added]. This is stated in paragraph 24 of Mr Foo’s affidavit of evidence in chief (“AEIC”). To this end, Mr Foo exhibits a letter from Mr Parwani dated 20 January 2022 to confirm that Parwani Law provided advice to Mr Foo that the claim in Suit 498 had no merit, and that OP3 had a strong defence (“the Letter”).49Foot Note 49×ABD, Vol 28, pp 22060 to 22061.The Letter states: ... 3. I confirm that I orally advised you, as Director of OP3 at that the relevant time that, in my view, the entirety of the claim against OP3 has no merit. I advised you of this on at least 2 occasions, firstly on or around 22 August 2014, when Smile Inc issued its letter of demand; and second on or around 25 May 2015 when Smile Inc filed its Writ of Summons. I did not make written notes of these conversations.I also sent you an emaildated 15 December 2015 reiterating my opinion that OP3 had a strong defence”. 4. I continued to hold this view throughout the proceedings, and as such at no time during the proceedings did I advise you that my view had changed. ... [emphasis in original] 63 In the email of 15 December 2015 at 12.25pm (the “Email”), Parwani Law updated Mr Foo on the progress of Suit 498, and then stated that “You have a strong defence and it is unfortunate that both [Smile Inc] and their solicitors are being unreasonable in this matter.” This was referred to and exhibited at paragraph 36 of Mr Foo’s AEIC. Additionally, Mr Foo contends that Parwani Law was well placed to make an assessment of Suit 498 as it had access to all relevant materials. 64 In turn, OP3 seeks to distinguish Suit 498 from other cases which turn on technical legal issues, such as statutory interpretation, and, in what appears to be an attempt to downplay the significance of legal advice, argues that Suit 498 was determined primarily on factual issues.50Foot Note 50×PCS at paras 47, 48 and 70.Moreover, OP3 contends that the quality of legal advice may have been undermined by the fact that Mr Foo did not provide all relevant information to Parwani Law.51Foot Note 51×PCS at paras 52 to 61.Finally, OP3 argues that the legal advice amounts to hearsay. 65 To begin, OP3’s attempt to distinguish Suit 498 from other suits is unpersuasive. Even if Mr Foo were aware of certain facts, it is the legal significance of these facts that determines whether OP3 could bear any liability for the floods that occurred.52Foot Note 52×DRS at para 56.In this regard, the role of legal advice cannot be understated. 66 As for whether Parwani Law’s legal advice amounts to hearsay, OP3’s position suffers from a lack of clarity – it is unclear whether OP3 objects generally to Parwani Law’s legal advice or specifically to the Letter or Email as inadmissible.53Foot Note 53×PRS at paras 77 and 80. See also PRS at para 81.In the Notice of Objection to Mr Foo’s AEIC dated 28 January 2022, OP3 objects to the entire of paragraphs 24 and 36 therein (which refers to the Letter and the Email as exhibits respectively) as “hearsay evidence”. However, both the Email and the Letter are included in the Agreed Bundle of Documents.54Foot Note 54×ABD, Vol 28, pp 21930 and 22062.Further, OP3 also asserts that their arguments pertain to both admissibility and weight. 67 In light of the above, I consider it necessary to determine whether Parwani Law’s legal advice, the Letter and or the Email amount to hearsay. I begin with the Letter. This is not a contemporaneous document sent to Mr Foo in the course of Suit 498 but was specifically sent to Mr Foo for the purpose of the litigation in the present suit to confirm that legal advice was rendered, the dates on which legal advice was rendered, and the nature of the legal advice rendered. However, there is no one from Parwani Law to testify as to its contents. Such evidence is hearsay and inadmissible. Mr Foo is not relying on the mere fact of the Letter, as he contends. He seeks to demonstrate that he received legal advice of a certain nature on a particular date. For him to do so, he must rely on the contents of the Letter, namely, the confirmation by Parwani Law that they previously informed him on 15 December 2015 by way of email that he had a strong defence in Suit 498. In doing so, he is relying on an out-of-court statement (the Letter) that has been tendered to prove the facts that it refers to (the confirmation that they had provided legal advice of a certain nature on a certain date). This puts him in breach of the rule against hearsay. 68 In contrast, Mr Foo’s evidence of Parwani Law’s legal advice to him at the material time, as set out in paragraphs 24 and 36 of his AEIC, is not hearsay evidence. It amounts to direct evidence by Mr Foo.55Foot Note 55×AEIC of FKB at para 24.As for the Email, it is similarly not hearsay evidence. Mr Foo received the Email, and relies on the fact of the Email to show that he received such legal advice at the time. Unlike the Letter, Mr Foo does not rely on the truth of the contents of the Email,ie, that he had a strong defence in Suit 498 (which would then put into issue the factual contents of the Email), but merely the existence of such a communication from Parwani Law. 69 With that, I turn to the nub of the issue, that is, the extent to which Mr Foo could have relied on the legal advice. Here, OP3 seeks to impugn the quality of Parwani Law’s legal advice by suggesting that Mr Foo failed to provide all relevant information to Parwani Law. OP3 highlights the equivocal position taken in Suit 498 vis-à-vis the design works for the Clinic to suggest that an incomplete account of the facts was provided to Parwani Law.56Foot Note 56×PCS at paras 52 to 61.In response, Mr Foo argues that the assertion by OP3 is baseless and that there is no evidence to suggest that Mr Foo should not have relied on Parwani Law’s legal advice. Additionally, Mr Foo contends that if OP3 had sought to advance such a proposition, OP3 should have called a representative of Parwani Law as a witness.57Foot Note 57×DRS at para 8. 70 I am unpersuaded by OP3’s attempt to undermine the quality of the legal advice provided by Parwani Law on the basis of an incomplete picture being furnished to Parwani Law. On OP3’s case, this is put forth as a mere suggestion, with OP3 arguing that “[Mr Foo]may nothave given the full picture to Parwani Law LLC” [emphasis added].58Foot Note 58×PCS at para 52.In any event, as Mr Foo contends, it was indicated at a pre-trial conference of Suit 498 that OP3 was involved in the design of the works at the Clinic. For present purposes, it suffices to note that Parwani Law was informed that OP3 was involved in the design works, as evinced by the position communicated at the pre-trial conference, which directly contradicts OP3’s factual basis for impugning the quality of Parwani Law’s legal advice. 71 Having said that, it is unclear whether Mr Foo may rely on the legal advice provided by Parwani Law to the extent that he seeks to justify his position that it was not reasonably likely thatanyliability would arise from Suit 498. 72 InTurf Club Auto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal[2018] 2 SLR 655 (“Turf Club Auto Emporium”), the court outlined the extent to which a fiduciary may rely on legal advice in the context of deciding whether the director had breached his fiduciary duties to the company. In particular, the court noted: 338 The more critical inquiry is whether and to what extent the fact that a defendant-director acted on legal advice before adopting a certain course may be relied on to prove that he had actedbona fidein the interests of the company. In our view, that mere fact cannot necessarily mean that the defendant-directorhadactedbona fide– this would, as the Respondents submit, encourage and enable directors to use their lawyers as “legal cover”. Rather, it is simply one factor to be considered in the overall analysis. Further, where a person attempts to rely on the fact that he had acted on legal advice to prove hisbona fides, it is necessary for the court to be given sufficient information about the circumstances under which such advice was provided so as to be able to evaluate the appropriateextentto which that person can rely on that fact. [emphasis in original] 73 InTurf Club Auto Emporium, the court placed little weight on the advice provided to the defendant-director as it was unclear what the terms of the advice provided were (as it was not given in written form) and that there were “no briefs, instructions, letters or attendance notes on this matter (if any at all) in evidence” (see [339]). As such, there was no real clarity as to what the legal counsel was consulted on, or as to what background information was provided by the defendant-director. 74 Drawing guidance fromTurf Club Auto Emporium, for legal advice to meaningfully form the basis for a course of action, there must be sufficient information about the circumstances in which such advice has been provided. On Mr Foo’s case, apart from the Email referred to in the Letter, he has not provided any further evidence concerning the circumstances and context in which the legal advice was provided. As I pointed out, the contents of the Email cannot be referred to, and the Letter is inadmissible for hearsay. Even if I were to consider the contents of the Email and or the Letter, both are short on details. They only state an overall assessment of the merits of the case. They do not contain any analysis of the factual and legal disputes. No reasons are furnished. No information concerning the surrounding context and circumstances of the legal advice are set out, and there is no reference to any other briefs, instructions, letters or attendance notes. 75 While the present proceedings are not concerned with the merits of the legal advice provided by Parwani Law, the chink in Mr Foo’s position is that not enough has been done to demonstrate the context and circumstances under which the legal advice was obtained to justify his reliance on the legal advice to the extent that he did. In this regard, I disagree with Mr Foo that it fell upon OP3 to call a representative from Parwani Law to dispute his position. In the absence of any further evidence, it is difficult for Mr Foo to seek to rely on the legal advice to the extent he seeks – that OP3 bears no liability for the matters in Suit 498. (C) LOD and the closure of the Clinic 76 In its case against Mr Foo, OP3 further relies on the LOD and the closure of the Clinic following the First and Second Floods. For both items, I accept that they are not in themselves indicative of liability. In response, Mr Foo deals with both matters as part of his broader narrative that OP3 was not liable based on an objective assessment of the merits of Suit 498 and the legal advice received from Parwani Law. As such, I rely on my earlier findings at [61] and [75]. (3) Conclusion 77 In the round, I find that Suit 498 is a contingent liability that was reasonably likely to materialise as at 25 May 2015. Based on an objective assessment of Suit 498, Mr Foo could not have reasonably opined that it was not likely that OP3 would face any liability at all. The legal advice provided to Mr Foo cannot be relied on by him for such a position. The value to be ascribed to Suit 498 as a contingent liability 78 Parties agree that the value to be ascribed to Suit 498 should be based on an objective assessmentof the facts and evidence:Parakou (CA)at [44]. OP3’s position is that Suit 498 should have been accounted for either at the sum of $1,542,206, as provided by OP3’s expert Mr Ramchand Nanikram Jagtiani (“Mr Jagtiani”), or the judgment sum award of $534,189. Between the two values, OP3 argues that Mr Foo, being a director, should have accounted for the larger sum. 79 Mr Foo, in turn, maintains that no value should be ascribed to Suit 498 as a contingent liability. Given the various figures provided by OP3’s witnesses, there is no way to reliably estimate the value of Suit 498.59Foot Note 59×DCS at para 115.Moreover, the value proposed by Mr Jagtiani is undermined by his partisanship as well as his flawed methodology.60Foot Note 60×DCS at para 117 and 118.As a back-up, Mr Foo avers that even if (which Mr Foo denies) some liability should have been accounted for, the sum to be accorded would not have been so great to render OP3 insolvent or on the verge of insolvency.61Foot Note 61×DRS at para 61. 80 To begin, I reject OP3’s argument that the sum of $534,189, being the judgment sum awarded, should be ascribed to Suit 498. Based on my observations at [77], Mr Foo could only have assessed the possible liability arising from Suit 498 based on facts known as at 25 May 2015. At that date, Mr Foo would not have known of the eventual judgment sum. 81 As for the sum of $1,542,206, Mr Jagtiani arrived at this value by deducting the claim for loss of management time and effort, being a sum of $265,420, from the full sum claimed by Smile Inc in the Statement of Claim, being that of $1,807,626.62Foot Note 62×AEIC of Ramchand Nanikram Jagtiani (“RNJ”) at RNJ-1, paras 4.10 to 4.13, p 18.In Mr Jagtiani’s view, it was clear that the claim for loss of management and time lacked robust evidence or support. In response, Mr Foo highlights that Mr Jagtiani’s assessment was made without reference to the Defence or Counterclaim filed in Suit 498, Parwani Law’s legal advice, the expert report by Dr Chee, or the judgment on liability issued in Suit 498. I agree with Mr Foo’s criticisms of Mr Jagtiani’s methodology. Based on paragraph 3.4 of Mr Jagtiani’s report, his assessment was undermined by the limited documents provided to him.63Foot Note 63×AEIC of RNJ, RNJ-1, p 19.Mr Jagtiani’s reasoning in the report is also unsatisfactory. For instance, it is unclear on what basis Mr Jagtiani takes the full sum claimed by Smile Inc to be the starting point. 82 Turning to Mr Foo’s case, I agree that OP3 has associated various figures with Suit 498. They are: (a) the LOD which claimed a sum of $676,715.68; (b) the Statement of Claim which initially sought $1,807,626 (and was later amended to $1,975,483.74); (c) the judgment sum of $534,189; (d) an estimate of $1,318,020, a figure provided by Mr Donald David Ho Chjuen Meng (“Mr Ho”), an associate who assisted the liquidator in the review of OP3’s financial affairs;64Foot Note 64×AEIC of David Donald Ho Chjuen Meng (“DDH”) at paras 15, 18, 19, 20 and 21.and (e) an estimate of $1,542,206 provided by Mr Jagtiani. I make two brief observations. First, OP3 has abandoned the sum proposed by Mr Ho in their closing submissions without explanation and relies on the value proposed by Mr Jagtiani. Second, both Mr Ho and Mr Jagtiani claimed to have provided an estimate of the liability to Suit 498 with reference to the Writ of Summons and Statement of Claim.65Foot Note 65×AEIC of DDH at para 17. See also AEIC of RNJ at RNJ-1, para 4.14.Yet, between the two estimates, there is a noticeable difference of $224,186. 83 That said, I have rejected Mr Foo’s primary case that no value should be ascribed to Suit 498. Mr Foo’s secondary case is that even if a value is to be ascribed, it will not be insolvency inducing. The issue, however, is that Mr Foo has not indicated what such a value would be. While it might appear that there is some difficulty in estimating the value of liability arising from Suit 498, this should not be overstated. It is not for Mr Foo to argue that the difficulty of estimating the liability of Suit 498 is so insurmountable that no value should be ascribed. This is especially so when Mr Foo bears the evidential burden, on its secondary case, in asserting that any value that might be ascribed would not be insolvency inducing, as indicated at [49]. 84 Keeping in mind that an objective (and not a subjective) inquiry is to be undertaken to determine the liability to be ascribed to Suit 498, I broadly consider the following factors: (a) the LOD, Writ of Summons and Statement of Claim; (b) the legal advice provided by Parwani Law; and (c) the events leading up to Suit 498. 85 I begin with the full sum claimed in the Writ of Summons and Statement of Claim of $1,807,626. This is not only a fair reflection of the facts known to Mr Foo as at 25 May 2015 but it also takes OP3’s case at its highest at the time. Both the liquidator and Mr Jagtiani take the view that the claim for loss of management time and effort, amounting to $265,420, was without basis. For the liquidator, he explained that it is difficult to obtain a reliable estimate of such costs.66Foot Note 66×AEIC of DDH at para 20.As for Mr Jagtiani, he opined that there was no robust evidence to demonstrate a loss of management time and effort.67Foot Note 67×AEIC of RNJ at RNJ-1, paras 4.12, p 18.Given so, it would have been reasonable for Mr Foo to find that this head of claim was without merit. This would leave Mr Foo with a sum of approximately $1,551,206 (by taking off $265,420 from sum of $1,807,626), based solely on the Statement of Claim. Further, Mr Foo had abona fidebelief in the counterclaim he had commenced against OP3, in the sum of approximately $79,000 for the amount owing under the original contract. Accounting for this figure, and rounding off, Mr Foo would have had to consider a sum of approximately $1,470,000. 86 At the material time, Mr Foo received legal advice in OP3’s favour. Weight can be placed on the legal advice given (although not to the extent that Mr Foo had sought to do so in their primary case). Specifically, he was informed that he had a “strong defence”. Ordinarily, such advice would be understood to mean that there is a more than likely chance that the claim would be successfully defended. However, as pointed out earlier, no details to support the advice are given. That said, as the advice is couched in strong terms, it would have been fair and reasonable for Mr Foo to apply not an insubstantial discount on the working sum of $1,470,000. Conservatively, it would have been fair and reasonable for Mr Foo to understand that Smile Inc might only have a 35% to 40% chance of winning the case in its entirety and conservatively apply a discount between 60% and 65% to the working sum of $1,470,000. This would also broadly take into account Mr Foo’s view that OP3 was not responsible for the hole in the drainage pipe, as explained at [57]. 87 Further, Mr Foo would have also reasonably perceived the figures to be inflated. It cannot be gainsaid that the Writ of Summons sought a sum that was close to triple the amount sought in the LOD that was sent on 22 August 2014. Put simply, within a year, the claim sought by Smile Inc almost tripled in value. Following the receipt of the LOD, Mr Foo, sought a breakdown of the sum sought in the LOD to no avail.68Foot Note 68×AEIC of FKB at paras 25 and 26.Further, Suit 498 originated from a dispute over a contract with a value of $158,010. That said, a major part of the increase in the claim arose from the closure of the Clinic for an additional period after the Second Flood. These factors, in the round, would have given some basis for Mr Foo to have applied a further marginal discount of about 5%. On a rough and ready basis, it would have been reasonable for Mr Foo to have discounted between 65% to 70% from $1,470,000, to arrive at a range of around $441,000 to $514,500. 88 For the reasons stated above, based on an objective assessment of the evidence placed before me, OP3 is unable to prove that either the sum of $1,542,206 or the sum of $534,189 should be attributed to the contingent liability. Instead, I find that the liability likely to arise from Suit 498 would range between $441,000 and $514,500. Conclusion 89 In conclusion, I find that it was reasonably likely that some liability arising from Suit 498 would materialise. Arising from Mr Foo’s position that no liability of any extent was reasonably likely to materialise, the mere finding that some liability was reasonably likely to materialise means that Mr Foo’s primary case must be rejected. Based on an objective assessment of the evidence, as at 25 May 2015, a sum of between $441,000 to $514,500 should have been accounted for.",
        "Whether OP3 was insolvent or financially parlous from 25 May 2015 onwards": "90 Before determining OP3’s solvency from 25 May 2015 onwards, I make two observations. First, both parties primarily rely on the technical accounting tests,ie,the balance sheet test and the cash flow test, to submit on the financial health of OP3 at the end of 2015, 2016 and 2017. No financial documents were available for the dates of the impugned transactions. This gap was especially glaring for the dividend sum of $400,000 paid on 13 July 2016 – which is a date sandwiched between the close of two financial years,ie,31 December 2015 and 31 December 2016. 91 Bearing in mind the contingent liability arising from Suit 498, I will analyse OP3’s solvency with reference to these tests for the end of financial years of 2015, 2016 and 2017. In this process, the reports of Mr Jagtiani and Mr Foo’s expert witness, Mr Kon Yin Tong (“Mr Kon”), could not be fully relied on. In respect of Mr Jagtiani, I do not accept the figures he attributed to the contingent liability arising from Suit 498. As for Mr Kon, he proceeded on the premise that no contingent liability should be accounted for in December 2015 (which I disagree with). 92 Second, in line withDynasty Line,the parties also rely on a broad assessment of the facts and circumstances of the case to argue whether OP3 was financially parlous at the material time. I agree, and it is the approach I adopt below. With that said, I will begin to consider OP3’s financial health. Financial state of OP3 as at 31 December 2015 93 Beginning with the balance sheet test, as at 31 December 2015, OP3 had net assets of $1,136,982. This is an updated figure after correcting for the erroneous recording of the payment of the dividend sum of $400,000 (see s/n 3 of the table at [9]) in the 2015 financial statement when it was, in fact, declared and paid in 2016.69Foot Note 69×Defendant’s Core Bundle (“DCB”) at p 286. See also DCS at para 84.The parties agree that the sum should be added back, and also agree that there is no impact on the retained earnings in 2016 of $586,982.70Foot Note 70×DCS at paras 67 to 71; see also PRS at paras 22 to 29.This was the state of affairsafterthe dividend sums totalling $1,900,000 paid on 11 December 2015 and the repayment of $138,352 (see s/n 1, 2 and 5 of the table at [9] above). Factoring in the contingent liability likely to arise from Suit 498, of between $441,000 to $514,500, OP3 was balance sheet solvent. 94 Turning to the cash flow test, as at 31 December 2015, OP3 had cash and cash equivalents of $1,551,604. OP3’s bank balance was $1,289,216.30. The invoices due and payable as at 31 December 2015 amounted to a sum of $941,224.81. However, if the invoices which have no specified due dates (which amounted to a sum of $456,349.12) were considered, OP3 would be cash flow insolvent. In this regard, Mr Foo avers that he would, in any event, have provided the necessary funds to OP3 to make the payments. 95 InKon Yin Tong, the court offered guidance on the application of the cash flow test in the context of ascertaining the solvency of a company to decide whether a director has breached his duties. The primary concern of the cash flow test is whether a company’s financial position allows it to continue in business and pay its way:Kon Yin Tongat [38]. Essentially, the company should be able to meet its obligations as and when they fall due. The court further clarified that obligations “as they fall due” indicates a continuous succession of debts rather than a calculation of debts existing on any particular day:Kon Yin Tongat [38]. Further considerations in the application of the cash flow test include a determination of all of the assets of the company as at that time in order to determine the extent to which those assets were liquid or were realisable within a timeframe that would allow each of the debts to be paid as and when it becomes payable:Kon Yin Tongat [37(b)]. 96 Keeping in mind that the burden of proof is borne by the party making the allegation of insolvency, it falls on OP3 to demonstrate that it was cash flow insolvent at the material time:Kon Yin Tongat [35]. To this end, if OP3’s case rests on the invoices with no specified due dates being taken into account, OP3 must establish why these invoices ought to be considered. While Mr Foo has not provided evidence as to his assertion that he would provide the necessary funds for OP3, this presupposes that the invoices with no due dates ought to be considered such that funds would be required. Further, OP3 has not shown, for instance, that the assets of OP3 were illiquid or not realisable within a timeframe which would have enabled OP3 to pay the debts as and when they became payable. As such, I find that OP3 has failed to show that it was cash flow insolvent as at 31 December 2015. 97 I am unpersuaded by OP3’s alternative case that it was in a parlous financial state. Briefly, OP3 alleges that: (a) there was no doubt that the contingent liability for Suit 498 would materialise; (b) Mr Foo knew that OP3  was likely to be held liable based on the facts known to him; (c) Mr Foo started preparations to move the business from OP3 to OP3 Creative since May 2015; and (d) Mr Foo diverted all new business to OP3 Creative and/or that OP3’s revenue was at risk because of Suit 498.71Foot Note 71×PCS at para 130. 98 On points (a) and (b), I have rejected OP3’s suggestion that either $1,542,206 or $534,189 should have been considered. Even if these amounts were considered in full, it is unclear if OP3 was in a parlous financial state. The present situation is quite unlikeDynasty Linewhere the court held at [36] that the company was in a position of or approaching insolvency. There, the company faced significant liabilities of HK$230m. Yet, the director therein pledged away the company’ssoleasset. Point (c) is entirely unsubstantiated and lacking in particularity. As for point (d), this is discussed further at [131]. For present purposes, it suffices to note that OP3 secured five contracts between June 2015 and October 2015. OP3’s position cannot be compared to that of the company inDynasty Line.72Foot Note 72×PCS at para 185. 99 For these reasons, I find that OP3 was not insolvent or in a parlous financial state at the end of 2015. Financial state of OP3 in 2016 100 As at 31 December 2016, OP3 had net assets of $157,683.73Foot Note 73×Plaintiff’s Core Bundle (“PCB”) at p 52.Factoring in the contingent liability arising from Suit 498, of between $441,000 and $514,500, OP3 would have been balance sheet insolvent. 101 Moreover, based on an audit of the 2016 financial statements (which was done on 12 December 2019), the auditors expressed the qualified opinion that there is the “existence of a material uncertainty that may cast significant doubt about the [plaintiff’s] ability to continue as a going concern”.74Foot Note 74×PCB at p 47.This is due to OP3 having incurred a net loss of $72,299. As explained by Mr Kon, the concept of “going concern” pertains to the position of a company at a particular point in time to determine if there is sufficient working capital to carry on business for the next 12 months, in a manner that is not dissimilar to that of the balance sheet test.75Foot Note 75×Transcript, 8 March 2022, p 39 line 7 to p 40, line 5.I am mindful that the auditors arrived at this opinion in part also due to the judgment debt awarded against OP3 (which was attributed by the auditors as $669,000).76Foot Note 76×PCB at p 47, under “Basis for Qualified Opinion”.As I have indicated at [44], while auditors use hindsight in the audit of statements, for present purposes, events that occur after-the-fact, such as the liability judgment, should not be taken into account. In other words, at the point of the preparation of the 2016 financial statements, the judgment debt would not have been known by OP3. That said, the contingent liability of between $441,000 and $514,500 for Suit 498 should have been factored in. 102 Mr Foo, in turn, argues that OP3 had $87,747 in cash or cash equivalents at the end of 2016 as well as ongoing projects which were generating profits. The latter point is bare and unsupported. As for the former, it is unclear what the thrust of Mr Foo’s argument is. By itself, the sum does not indicate that OP3 was cash flow solvent, given my observations at [95]. It also would not have satisfied the value that I have ascribed to Suit 498. Without further analysis, it does not demonstrate OP3’s solvency at the material time. 103 No cash flow test was done at the end of 2016. Based on the balance sheet test, I am satisfied that OP3 was insolvent at the end of 2016. This is shortly after the transaction involving the dividend sum of $500,000 (s/n 4 of the table at [9]). 104 I note, however, that the dividend sum of $400,000 (s/n 3 of the table at [9]) was declared on 8 July 2016, and then paid out on 13 July 2016. Therefore, it is necessary to consider whether OP3 was insolvent or financially parlous in mid-2016. In this connection, as conceded by the liquidator, there are no financial documents regarding OP3’s financial position in mid-2016.77Foot Note 77×Transcript, 1 March 2022, p 105, lines 13 to 20.On the basis that by the end of the year, OP3 still had net assets of $157,683, prior to the transaction involving the dividend sum of $500,000, it does not appear that OP3 was balance sheet insolvent. In particular, OP3 would be in the position to provide for the contingent liability of $441,000 to $514,500 arising from Suit 498. 105 OP3 argues that it was financially parlous from 25 May 2015 onwards (see above at [97]) and relies mainly on the same arguments for its financial health in mid-2016. Compared to the situation at the end of 2015 as analysed in [97] and [98], one noteworthy development is the sharp drop in revenue from the end of 2015 to the end of 2016 of 87.6%. While parties dispute the reason for the decline (which I set aside for now), I am mindful that Mr Foo does not deny the significant year-to-year drop in revenue. Such effects would arguably have been felt by mid-2016, as confirmed by a net loss of $72,299 at the close of the year. That said, the drop in revenue, by itself, is inadequate. It only reflects a general fall in earnings on a year-to-year basis but says little about whether the drop of revenue experienced by July 2016 should raise concerns about OP3’s financial situation. More context is required. For instance, it would have been useful to have some evidence concerning the status of OP3’s business contracts such that the fall in revenue by July 2016 may be appropriately assessed. It bears reminding that at the close of 2015, OP3 had cash and cash equivalents of $1,551,604, a bank balance of $1,289,216.30, and net assets of $1,136,982. It had sufficient funds to provide for the contingent liability, and to pay the dividend sum of $400,000. Even against the backdrop of worsening business, it seems to me there is insufficient basis to find that OP3 was in a financially parlous state by mid-2016. Financial state of OP3 as at 31 December 2017 106 Without factoring in the contingent liability arising from Suit 498, as at 31 December 2017, OP3 was clearly balance sheet insolvent, bearing negative assets of $545,568.78Foot Note 78×PCB at p 99.This is further bolstered by the auditors’ opinion, which, similar to the 2016 financial statements, indicates that there is significant doubt about OP3’s ability to continue as a going concern.79Foot Note 79×PCB at p 94, under “Basis for Qualified Opinion”.No cash flow test was done at the end of 2017. However, it was clear that OP3 was insolvent at the end of 2017.",
        "Whether Mr Foo was in breach of his duties in carrying out the transactions": "107 I now turn to consider whether Mr Foo was in breach of his duties in carrying out the transactions,ie, the Dividend Payments and the Repayment of Moneys. 108 Specifically, to assess whether Mr Foo breached his duty to actbona fidein the best interests of OP3 (and the creditors, where relevant), the test is both subjective and objective. The subjective element lies in the court’s consideration of whether the director had exercised his discretionbona fidein what he considered was in the interests of the company while the objective test requires an assessment of whether an intelligent and honest man in the position of a director of a company concerned could, in the whole of the existing circumstances, have reasonably believed that the transactions were for the benefit of the company:Goh Chan Peng and others v Beyonics Technology Ltd and another and another appeal[2017] 2 SLR 592 at [35] and [36]. 109 Whether Mr Foo was in breach of his duties in carrying out the transactions turns on two issues: (a) whether OP3 was insolvent or financially parlous at the material time; and (b) if so, whether Mr Foo acted in the interests of OP3 by taking into account the interests of the creditors in carrying out the transactions.",
        "Whether Mr Foo was in breach of his duties in relation to the Dividend Payments": "110 Before dealing with Mr Foo’s conduct in relation to the Dividend Payments, I consider a preliminary issue concerning the scope of this aspect of OP3’s case. Whether OP3 has adequately pleaded the issue of declarations of dividends 111 For context, this issue arose in the course of parties’ opening statements, where OP3 clarified that its case was not only that the payments of dividends were objectionable, but also that the declarations of dividends were objectionable. OP3 argues that this was pleaded and understood to be the case by Mr Foo, as evinced by the position taken by Mr Foo in the Defence (Amendment No 1). In turn, Mr Foo contends that OP3’s pleaded case did not raise any issues concerning Mr Foo’s declarations of dividends. OP3 also failed to make clear the basis on which the declarations of dividends were impugned.80Foot Note 80×PCS at paras 148 to 161.As such, Mr Foo was prejudiced as the evidence required to counter allegations of improper declarations of dividends is very different from that relating to improper payments of dividends.81Foot Note 81×DCS at para 159. 112 I begin with the pleadings. In the Statement of Claim, OP3 states at paragraph 22(b) that “[Mr Foo] procured and/or caused OP3  to make backdated payments of dividends to himself”.82Foot Note 82×SOC at para 22(b), p 12.OP3 argues that the terms “cause” or “procure” would naturally include the declaration of dividends, as it is part of the process of “causing” or “procuring” a dividend.83Foot Note 83×PCS at para 151.On the other hand, Mr Foo highlights that there is no mention of the declaration of dividends at any point in the Statement of Claim. I agree with OP3 that the terms “cause” or “procure” would encompass the declaration of dividends. This understanding appears to be shared by Mr Foo, as seen from the Defence (Amendment No 1) at paragraph 21, which states that “[Mr Foo] avers that he had reasonable grounds to believe that OP3 International was solvent and not in a financially parlous situation at the material time that the dividends weredeclared”[emphasis added].84Foot Note 84×Defence at para 21, p 30.This is further apparent on an examination of the list of agreed issues in Mr Foo’s Lead Counsel Statement, at s/n 6, which states: “Whether it was lawful for Mr Foo to havedeclareddividends out of the Company’s retained earnings for the years 2012 to 2015” [emphasis added].85Foot Note 85×Defendant’s Lead Counsel’s Statement, Part Two (List of Issues), Agreed List of Issues, p 3. 113 As for Mr Foo’s suggestion that he is prejudiced by OP3’s failure to specify the basis for its allegation that the dividends were not properly declared, I, again, accept OP3’s response that it seeks to impugn the declarations of dividends on the sole basis that OP3 was insolvent or in a parlous financial situation. It is on this ground alone that OP3 alleges that the declarations of dividends were improper. That Mr Foo has been able to meet OP3’s case on this front is apparent from a review of its closing submissions, which focuses heavily on demonstrating the solvency of OP3 at the material time. As such, I cannot agree that Mr Foo was prejudiced. Declaration and payment of dividends in 2015 114 By 31 December 2015, OP3 was not insolvent or financially parlous (see [99]). Therefore, in acting in the interests of OP3, Mr Foo did not have to consider the interests of creditors. In this regard, OP3’s allegation, which is premised on Mr Foo having such a duty, falls away. Without more, Mr Foo was not in breach of his duties by way of the declarations and payments of the dividend sums in 2015 out of retained earnings for 2012 to 2014 (s/n 1 and s/n 2 at [9]). Declaration of dividends in 2016 115 In mid-June 2016, OP3 was not insolvent or financially parlous. Therefore, for the same reasons stated above, there is nothing objectionable about the transaction involving the dividend sum of $400,000. 116 However, by 31 December 2016, OP3 was insolvent (see [103] and [105] above). As such, close to the end of December 2016, Mr Foo must consider the interests of creditors. Mr Foo contends that he did so by obtaining legal, technical and accounting advice.86Foot Note 86×PCS at paras 146 to 147.In particular, he sought the opinion of Dr Chee (see [59]) and Mr Wong King Kheng (“Mr Wong”), an auditor usually engaged by OP3 to assist with the preparation of the audited accounts. 117 I disagree that Mr Foo has discharged his duty to consider the interests of creditors. His reliance on the legal advice from Parwani Law and the opinion of Dr Chee is misplaced. The advice provided by both pertain to the merits of Suit 498, and not on Mr Foo’s declaration and payment of dividends in the face of a pending suit. I have also rejected Mr Foo’s reliance on the legal advice from Parwani Law as the basis to suggest that no liability should be ascribed to Suit 498. As for Mr Wong, his advice was premised on the assumption that there was no need for Mr Foo to have made any provision for Suit 498 (which I have rejected). Further, I note that when Mr Foo sought Mr Wong’s advice, it was on an informal basis. Mr Wong was not the auditor engaged by OP3 at the relevant time (as it so happened that Mr Wong was changing his place of employment). When Mr Wong subsequently audited OP3’s 2016 financial statement on 12 December 2019, he expressed doubt about the ability of OP3 to continue as a going concern in part due to the net loss incurred by OP3 of $72,299 (see [101]). 118 Accordingly, I find that Mr Foo was in breach of his fiduciary duty to actbona fidein the best interests of OP3 (including the creditors) through his declaration and payment of the dividend sum of $500,000 (see s/n 4 at the table at [9]). By doing so, Mr Foo reduced the assets of OP3 that should have been available for the discharge of liabilities to its creditors. Moreover, the dividend declaration and payment were clearly for his benefit. I should add that I deal with Mr Foo’s contention that there was a double-counting of this amount below at [120].",
        "Whether Mr Foo was in breach of his duties in relation to the Repayment of Moneys": "Repayment of $138,352 119 I begin with the repayment of the sum of $138,352 to Mr Foo on 11 December 2015. The premise of OP3’s claim is that it was financially parlous or insolvent as at the end of 2015. Thus, the repayment would amount to an unfair preference payment. However, as I have found at [99], OP3 was not insolvent or in a parlous financial state at the end of 2015. This claim thus falls away. Repayment of $682,394 120 As for the repayment of the sum of $682,394 which occurred sometime in 2017, Mr Foo contends that the figure is erroneous as part of the sum consists of the dividend sum of $500,000 in 2016, which was allegedly also paid in 2017. By seeking $682,394, OP3 has double counted the sum of $500,000. OP3, on the other hand, argues that the dividend sum of $500,000 was paid in 2016. The sum of $682,394 paid in 2017 was a distinct payment. 121 The starting point of Mr Foo’s argument is that the general ledger shows that $500,000 was owing to Mr Foo as at 31 December 2016, and that a sum of $500,000 was paid to Mr Foo on 25 January 2017.87Foot Note 87×ABD, Vol 25, p 19068. See also ABD, Vol 27, p 21018.As there is no evidence that the dividend sum of $500,000 was paid in 2016, it must have been paid on 25 January 2017 (in accordance with the general ledger). To explain the statement of cash flow for 2016, which shows that the dividend sum of $500,000 was indeed paid in 2016, Mr Foo highlights the erroneous booking of the dividend sum of $400,000 for 2016 into the 2015 accounts. This error is accepted by parties (see [93]). Mr Foo suggests that the auditors, at the point of auditing the financial statements, were aware that $2.8m in dividends had been declared in 2015 and 2016. However, because of the error in booking the dividend sum of $400,000 in the 2015 accounts, the 2015 financial statements indicate that $2,300,0000 in dividends have been issued and paid. The auditors then “proceeded on the erroneous assumption that since a total of $2,300,000 in dividends were issued and paid in 2015, the remaining S$500,000 in dividends must have been paid in 2016”.88Foot Note 88×PCS at para 194.This explains why the dividend sum of $500,000 was reflected in 2016 statement of cash flow, when it was paid in 2017. 122 OP3’s explanation, on the other hand, is that the 2016 and 2017 audited financial statements show that the dividend sum of $500,000 is distinct from the repayment sum of $682,394. The cash flow statements of the two years reflect them as distinct entries.89Foot Note 89×PCB at p 100.The sum of $683,294 is also reflected at note six of the 2017 audited financial statements, which show a decrease of $682,394 in the amount due to a director between 2016 and 2017. As for the general ledger that shows that a sum of $500,000 was advanced to Mr Foo in 2017, OP3 contends that it is of little assistance as it shows nothing more than an advancement of the said sum. 123 Mr Foo’s analysis is sound in so far as it accounts for the absence of the dividend sum of $400,000 from the 2016 statement of cash flow due to the erroneous booking of the sum in the 2015 accounts. However, I am unpersuaded by Mr Foo’s contrived explanation that this led to the purported erroneous recording of the dividend sum of $500,000 in the 2016 statement of cash flow. It is unclear why the auditors would have assumed that the 2016 dividend sum of $500,000musthave been paid in 2016 just because the prior dividend sums were purportedly paid in 2015. This also appears to be an afterthought that was not put to Mr Wong, who audited the 2016 and 2017 financial statements. Moreover, the significance of the absence of any direct evidence that the dividend sum of $500,000 was paid in 2016 should not be overstated. For the dividend sum of $400,000, there is similarly no clear evidence to confirm that it was paid in 2016. 124 In my view, OP3’s explanation for the two separate payments is clear and persuasive. As Mr Foo asserts that the sum of $500,000 is double counted, he must demonstrate this, and show that there were errors in the 2016 and 2017 statements of cash flow. Mr Foo has not done so. I should further add that when Mr Kon was asked to opine about the two separate entries,ie, $682,394 (repayment to related parties) and $500,000 (payment of dividends) under the comparative 2016 and 2017 statements of cash flow, his tentative view was that the separate entries indicate that they are separate figures.90Foot Note 90×Transcript, 8 March 2022, p 58 line 17 to p 61, line 12.Further, considering that these financial statements were audited, and that no issues were raised regarding the cash flow statements, it appears to be against the weight of the evidence that the sum of $500,000 was double counted in the disbursement of $682,794 that was paid to Mr Foo in 2017. 125 Given my findings that OP3 was insolvent as of end 2016 (see [103] and [106]), Mr Foo would have had the duty to consider the interests of creditors. The question is therefore whether the repayment of $682,794 to Mr Foo was in the interests of the creditors. In the absence of any legitimate reasons for Mr Foo to procure repayment of the sum to himself in preference to the other creditors, I find that Mr Foo failed to actbona fidein the best interests of OP3 (and the creditors) as he had misapplied OP3’s assets to the prejudice of the creditors.",
        "Whether Mr Foo engaged in Diversion of Business, and if so, whether he was in breach of his duties": "126 I move on to the allegations in relation to the Diversion of Business. OP3 alleges that Mr Foo started moving OP3’s business and assets to OP3 Creative from 25 May 2015 (the date on which Suit 498 was served on Mr Foo). This is to put the assets of OP3 out of reach of its creditors. For this, OP3 seeks to recover a sum of $1,993,788, which was arrived at by doubling the net profits of OP3 in 2015 (that being, $996,894).91Foot Note 91×PCS at para 230.There is a factual dispute over whether Mr Foo engaged in the Diversion of Business, and I begin with this. 127 OP3 argues that Mr Foo used OP3 Creative to take over its work. Mr Foo did so by associating the email and website of OP3 Creative with OP3 sometime in May 2015, and subsequently transferring the ownership of OP3 Creative to himself on 22 December 2015.92Foot Note 92×PRS at para 136.That business was diverted is evinced by the precipitous drop in OP3’s revenue between 2015 and 2017. As pleaded, in 2015, OP3’s revenue in 2015 was $10,834,505. This dropped by 87.6% to $1,343,323 at the end of 2016. By 31 December 2017, the revenue dropped to $316,888 (which was a 97% decline from 31 December 2015). From a profit of $996,894 in 2015, OP3 suffered losses by 2017. 128 Mr Foo, in turn, argues that OP3’s allegations lack particularity. No specific contract or business opportunity has been identified by OP3. Moreover, OP3 has failed to demonstrate how the association of OP3 Creative’s email and website with OP3 caused the alleged diversion of OP3’s business. As for OP3’s drop in revenue between 2015 and 2017, Mr Foo avers that this was due to Suit 498. 129 From the outset, OP3’s claim suffers from a lack of particularity. Not a single contract or business opportunity has been particularised to have been diverted from OP3 to OP3 Creative. This stands in stark contrast from other instances where the court has found that there was a diversion of business. OP3 has also failed to demonstrate how Mr Foo allegedly diverted these opportunities, as conceded by the liquidator.93Foot Note 93×Transcript, 1 March 2022, p 117 line 25 to p 118 line 8.Instead, OP3’s case is heavily reliant on OP3’s drop in revenue and the association of OP3 Creative’s email and website with OP3. 130 Turning first to the association of OP3 Creative’s email address and website with OP3, OP3 has not demonstrated how these associations have caused business opportunities to be diverted. As Mr Foo contends, it is unclear if any business opportunities were even acquired via these channels.94Foot Note 94×DCS at para 227. See also DRS at para 92.Moreover, OP3 Creative’s email address was amended and posted on OP3 Creative’s Facebook page as of 29 September 2020.95Foot Note 95×PCS at para 188(e).In so far as OP3’s case is that the email address created the impression that OP3 Creative and OP3 are the same (thus diverting business to OP3 Creative), OP3 Creative’s email address would only have had such an effect after 29 September 2020. It is thus primafacieirrelevant to the time frame highlighted by OP3, of between 2015 and 2017. 131 As for the drop in OP3’s revenue between 2015 and 2017, this, by itself, lends little weight to OP3’s claim. Mr Foo claims that this was caused by Suit 498. Potential clients who conducted litigation searches would view OP3 unfavourably.96Foot Note 96×DCS at para 220.OP3, however, disputes Mr Foo’s explanation, and points to companies that previously engaged OP3 despite OP3’s prior involvement in other suits.97Foot Note 97×PCS at para 178 to 182.This suggests that Suit 498 would not have affected OP3’s revenue significantly. In reply, Mr Foo distinguishes these prior suits, claiming that they involved significantly lower values and were of a different nature, with many of them being claims for non-payment that were quickly resolved.98Foot Note 98×DCS at para 223.Suit 498 may be distinguished in so far as it involved a claim sevenfold greater than the next most significant claim brought against OP3 in 2014 for a sum of $266,126.65.99Foot Note 99×ABD, Vol 10, pp 8122 to 8123.To this extent, Suit 498 stands sufficiently apart from prior suits, and provides a basis for Mr Foo’s suggestion that Suit 498 had an adverse effect on OP3’s revenue that was unobserved hitherto. 132 OP3 further argues that Mr Foo has overstated the effect of Suit 498 on the willingness of clients to engage OP3. Following Suit 498, OP3 located seven contracts entered in by OP3 between 25 October 2015 and 17 August 2016, suggesting that Suit 498 did not have any adverse impacts.100Foot Note 100×PCS at paras 184 to 187.To this, Mr Foo avers that Suit 498 made it more difficult, but not impossible, for OP3 to obtain contracts. The effects of Suit 498 were felt over a period of time, where it was increasingly difficult to obtain contracts with large corporations.101Foot Note 101×DCS at para 225.While there is some intuitive appeal to Mr Foo’s explanation, it is neither here nor there. As pointed out by OP3, a number of companies were still willing to work with OP3 between 2015 and 2016. Only after 2016 did OP3’s revenue fall precipitously. 133 Be that as it may, the above analysis concerns OP3’s response to Mr Foo’s explanation for the drop in OP3’s revenue. It does not detract from OP3’s more fundamental failure to meet its burden, that is to demonstrate that the drop in revenue was caused by Mr Foo’s diversion of businesses of OP3 from OP3 to OP3 Creative.102Foot Note 102×DRS at para 93.Further, in the final analysis, even if OP3 has demonstrated that Mr Foo diverted business, the claim for $1,993,788 rests on a baseless assumption that OP3 would have earned the same profits in 2016 and 2017 as in 2015. 134 In sum, OP3 has failed to demonstrate, on a balance of probabilities, that Mr Foo diverted businesses of OP3 from OP3 to OP3 Creative. Crucially, OP3 has failed to demonstrate any particulars of the alleged diversion. It is unclear what business opportunities specifically belonging to OP3 were diverted and by what means Mr Foo effected such diversions, if any. As such, OP3’s claim that Mr Foo was in breach of his duties by engaging in the Diversion of Business must be dismissed.",
        "Whether relief should be granted under s 391 of the Companies Act": "135 Based on the above, I find that Mr Foo is in breach of his fiduciary duty to actbona fidein the best interests of OP3 (and creditors) by way of the declaration and payment of the dividend sum of $500,000 as well as the repayment of the sum of $682,794 to himself. For relief to be granted under s 391 of the CA, it must be shown that Mr Foo acted honestly and reasonably, and that it is fair to excuse him for his default. These are cumulative requirements. 136 Mr Foo contends that he acted honestly and reasonably. Mr Foo carried out water pressure tests and sought advice from experts (such as Parwani Law, Dr Chee, and Mr Wong). Similarly, for the Repayment of Moneys, on the advice of various experts, Mr Foo opined that OP3 was not insolvent or on the verge of insolvency. Mr Foo relies on similar reasons to argue that it would be fair to excuse him for his default. I am unable to agree with Mr Foo. These factors mostly pertain to Mr Foo’s reliance on advice from experts pertaining to the likelihood of liability from Suit 498 materialising. They do not go towards Mr Foo’s state of mind at the point that Mr Foo declared and paid the dividends of $500,000 in 2016 or made the repayment of $682,394 in 2017. For instance, the legal advice sought concerned the merits of Suit 498 and not whether Mr Foo should have declared another dividend of $500,000 in face of a pending suit. In any event, as I found above, Mr Foo has no reason to rely on the legal advice to the extent he did. These factors do not demonstrate Mr Foo’s honesty and reasonableness, or that it is fair to excuse him of liability. I decline to grant relief under s 391 of the CA.",
        "Conclusion": "137 Based on the above, I find that a sum totalling $1,182,394, comprising the dividend of $500,000 and the sum of $682,394, should be returned to OP3. This reflects the loss caused by Mr Foo’s breaches of his duty to actbona fidein the best interests of OP3 and its creditors. 138 Accordingly, I grant judgment against Mr Foo for the sum of $1,182,394. Interest is to be paid on all sums payable to OP3 at 5.33% from the date of the writ until judgment. Parties may provide cost submissions within two weeks of this judgment.  Hoo Sheau PengJudge of the High Court Lee Ming Hui Kelvin and Ong Xin Ying Samantha (WNLEX LLC) for the plaintiff;Nair Suresh Sukumaran, Noel Chua Yi How and Sylvia Lem Jia Li (PK Wong & Nair LLC) for the defendant."
    }
}