{
    "case_title": "Aw Chee Peng vAw Chee Loo",
    "ncitation": "[2022] SGHC 68",
    "coram": "Philip Jeyaretnam J",
    "sections": {
        "Introduction": "1 A father makes two of his sons equal co-owners with him of an investment property whose purchase he mostly funds. Initially, he manages the properties without accounting to them. When he decides to seek his fortune in China, he leaves it to one of his sons to manage the properties. After many years, the other son seeks an accounting from his brother. 2 Whether that other son may do so and for what period mostly depends on what was agreed, if anything, between the father and the two sons, but there is one question of law, namely whether the liability to account arises only by statute or also in equity.",
        "Facts": "3 The plaintiff, Mr Aw Chee Peng, is the older brother of the defendant, Mr Aw Chee Loo. Their father is Mr Aw Gim Hua, who is 83 years old this year. I will refer to Mr Aw Gim Hua as the father. The Aw family owns a residence at 75 Dedap Road (the “Dedap Residence”). Currently, the defendant, the plaintiff and their younger brother live at the Dedap Residence. The defendant’s wife and son live with him there while the plaintiff is unmarried and has no children.1Foot Note 1×Plaintiff’s AEIC dated 10 January 2022 (“Plaintiff’s AEIC”) at para 10. 4 The suit concerns the rental proceeds in respect of two properties which are registered in the joint names of the plaintiff, the defendant, and the father.2Foot Note 2×Plaintiff’s AEIC at para 7.The properties are located at 12 Jalan Gelenggang (“No 12”) and 12A Jalan Gelenggang (“No 12A”) (collectively, the “Properties”).3Foot Note 3×Plaintiff’s AEIC at para 4.No 12 is the ground floor unit and No 12A is the unit above it. 5 The Properties were purchased for the sum of $400,000 in 1989.4Foot Note 4×Plaintiff’s AEIC at paras 22–23.Both plaintiff and defendant contributed to the purchase price, but most of it was provided by the father and by an overdraft facility of $200,000 from OCBC bank in the joint names of the plaintiff, defendant and the father (the “Overdraft”).5Foot Note 5×Plaintiff’s AEIC at 23, Defendant’s AEIC at para 13.Parties agree that they and their father hold the Properties as tenants in common in three equal shares, as is reflected on the register.6Foot Note 6×1AB 8. 6 The father managed the Properties from the time that they were purchased until some time in 2003, when, not long after his wife passed away, he decided to move to China to run his businesses there. He then left the defendant to manage the Properties.7Foot Note 7×Defendant’s AEIC dated 10 January 2022 (“Defendant’s AEIC”) at para 17.According to the plaintiff, the defendant was to receive the rental income from the Properties, pay the necessary outgoings (such as the property tax in respect of the Properties),8Foot Note 8×NE 16 March 2022, p 81 lines 12–21.and account to the other two co-owners,iethe plaintiff and the father, for their respective one-third shares of the balance. According to the defendant on the other hand, the father told him to use the rental income for three further purposes: paying off the Overdraft, paying the income tax arising from the rental income, and renovating and maintaining the Properties and the Dedap Residence. The defendant also alleges that the father told him that any balance after the rental income had been applied to these purposes could be retained by him for his and his family’s use.9Foot Note 9×Defendant’s AEIC at paras 20–21. 7 No 12 has been rented out for most of the time between 2003 and the present. In that time, it was rented to tenants who used the premises as a coffeeshop for approximately 5 years between 2004 and 2010.10Foot Note 10×NE 10 March 2022, p 71 lines 2–21.No 12A was first rented out only in May 2010. It has been let out for most of the time since then.11Foot Note 11×Defendant’s AEIC at para 30. 8 There are three key events after 2003 that are worth noting. 9 First, after the defendant had taken over management of the Properties in 2003, No 12 was renovated such that the premises could be used to operate a coffeeshop. The renovations were completed in early 2004. According to the defendant, the renovations, which cost approximately $339,319.57, were fully paid for by him.12Foot Note 12×Defendant’s AEIC at paras 28–29.Immediately after the renovations were completed, the defendant himself operated a coffeeshop at No 12, but because business was slow the father suggested that he rent the unit out instead. It was then rented out in July 2004.13Foot Note 13×Defendant’s AEIC at para 30. 10 Second, the Overdraft was fully repaid in November 2012. While the Overdraft was initially for the sum of $200,000 only, it had been further drawn down between 1989 and 2012 such that in March 2012 the total sum owed was $653,504.99. In November 2012 this sum was fully repaid after the father made substantial repayments and the defendant contributed around $40,000. According to the defendant, he had been using the rental income from the Properties to make periodic repayments of the Overdraft between 2003 and 2012, as per the father’s instructions.14Foot Note 14×Defendant’s AEIC at paras 34–37. 11 Third, in 2019, there was an incident between plaintiff and defendant regarding the plaintiff’s income tax payments arising from the rental of the Properties. The plaintiff and defendant exchanged text messages, which were produced in evidence. The plaintiff complained by text messages in English sent to the defendant in January 2019 that the defendant had not paid his income tax, saying:15Foot Note 15×Defendant’s AEIC at para 25. Aw Chee loo as promised by you to pay the Rental tax for Aw Chee Peng as you have arrange to pay by giro uptodate you didn’t put money for the deduction Hope you can honour your arrangement with income Tax Dept. and All the year you collected the rent we didn’t get a cent as you agreed to pay the tax now you keep avoiding to pay the said tax. 12 On 26 March 2021, by letter from his solicitors, the plaintiff requested various documents from the defendant in relation to the Properties. This letter alleged, among other things, that the defendant had “failed, neglected and/or refused to provide any account to [the plaintiff and the father] of the dealings undertaken by [the defendant] in respect of the Properties” despite collecting substantial rental income from the Properties since January 2004.16Foot Note 16×Plaintiff’s AEIC at p 89.Further correspondence ensued between plaintiff and defendant, but this suit was ultimately commenced in May 2021 when the defendant did not provide the plaintiff with the requested documents or an account of the rental income from the Properties.17Foot Note 17×Plaintiff’s AEIC at para 38.The plaintiff seeks the following principal relief:18Foot Note 18×Statement of Claim at para 18. (a) a declaration that the defendant has acted in breach of his duties owed to the plaintiff to account for the rental income from the Properties; (b) an order for the defendant to give particulars of the rental income received, spent, and the balance; (c) an order for inquiries to be conducted and accounts taken of the said rental income received by the defendant; (d) an order restraining the defendant from expending, transferring or dealing with one-third of the balance rental income pending the outcome of this suit; and (e) damages to be assessed. 13 Besides plaintiff and defendant, a key figure in this dispute is obviously the father. Unfortunately, the father no longer had mental capacity to give evidence by the time of trial.19Foot Note 19×NE 16 March 2022, p 13 lines 3–6.Consequently, he played no part in these proceedings.",
        "The parties’ cases": "",
        "The plaintiff’s case": "14 The plaintiff’s factual case is simple. He is a one-third co-owner of the Properties, the Properties have been rented out, all the rental income was collected by the defendant, and the defendant has never provided him with an account in respect of one-third of that rental income.20Foot Note 20×NE 16 March 2022, p 67 line 12 to p 68 line 19. 15 Section 73A of the Conveyancing and Law of Property Act (Cap 61, 1994 Rev Ed) (“CLPA”) provides that: 73A.A joint tenant or tenant in common shall be liable to account to his co-owner for receiving more than his share or proportion of any rents or profits arising from the property. On this basis, the defendant is obliged to account to the plaintiff for his one-third share of the rental income. 16 The plaintiff’s legal case is slightly more complex because he argues that the defendant is subject to a separate equitable duty to account to him for his share of the rental income.21Foot Note 21×NE 16 March 2022, p 74 lines 4–8.As a result of this equitable duty, the plaintiff’s share of the rental income that was retained by the defendant was held by him on constructive trust for the plaintiff.22Foot Note 22×NE 16 March 2022, p 77 lines 9–16.",
        "The defendant’s case": "17 The defendant accepts that as a general matter of law, a co-owner must account to his fellow co-owners for rental income from co-owned property, by virtue of s 73A of the CLPA.23Foot Note 23×NE 16 March 2022, p 20 lines 19–21.He also accepts that he has never accounted to the plaintiff for the rental income from the Properties from 2003 to present.24Foot Note 24×Defendant’s AEIC at para 22.However, his primary case is that because of an arrangement between him and the father that was accepted by the plaintiff, his statutory duty to account to the plaintiff was fulfilled by his abiding by that arrangement.25Foot Note 25×NE 16 March 2022, p 29 lines 15–24. 18 The nature of this arrangement, which I will refer to as “the arrangement”, is as follows. The defendant was to apply the rental income received to make payments towards the Overdraft, pay for property tax and income tax (for all three co-owners) arising from the Properties and to renovate and maintain the Properties and the Dedap Residence. If there was still income left after this had been done, the defendant could retain that money for himself and his family because he alone had paid for the renovation of No 12. As for accounting, the defendant was only to account to the father as and when the father required, and the father would update the plaintiff where necessary.26Foot Note 26×Defendant’s AEIC at paras 20–22.The arrangement was permanent.27Foot Note 27×NE 16 March 2022, p 64 lines 18–21.The defendant claims that the arrangement is in part evidenced by or at least consistent with certain notes from the father to him.28Foot Note 28×Defendant’s AEIC at para 17.The plaintiff disputes the existence of the arrangement in its entirety. 19 The defendant argues that the plaintiff accepted the arrangement because he deferred to the father. It was therefore binding on the plaintiff and the defendant fulfilled his statutory duty to account to the plaintiff by dealing with the rental income in accordance with the arrangement, and accounting to the father as and when required.29Foot Note 29×NE 16 March 2022, p 63 line 25 to p 64 line 6. 20 Alternatively, the defendant raises three defences to the plaintiff’s claim. The first two defences purportedly defeat the plaintiff’s claim while the third simply limits it. 21 The first defence is that of acquiescence. The plaintiff knew that the defendant was responsible for managing the Properties and collecting rental from 2003 onwards.30Foot Note 30×NE 16 March 2022, p 56 lines 11–14.Yet, the plaintiff never once asked the defendant for an account in respect of those rental proceeds.31Foot Note 31×NE 16 March 2022, p 37 lines 17–21.The plaintiff stood by and did nothing while the defendant failed to account to him, and thus represented to the defendant that he was doing no wrong by not accounting. 22 The second defence is that of laches. The plaintiff commenced this suit in 2021, some 17 years after the earliest date for which he is seeking an account. He has provided no adequate explanation for this delay.32Foot Note 32×NE 16 March 2022, p 43 lines 18–24.Crucially, his delay has made it substantially more difficult for the defendant to produce evidence in his defence: in part because of difficulty in locating or obtaining documents from many years ago, but mostly because the suit was commenced only once the father was no longer able to testify.33Foot Note 33×NE 16 March 2022, p 43 line 24 to p 44 line 8.The defendant accepts that this defence is only available as against equitable, rather than statutory, duties. While the defendant’s case is that the duty to account is purely statutory, this defence is a response to the plaintiff’s case that the duty was also an equitable one.34Foot Note 34×NE 16 March 2022, p 20 line 22 to p 21 line 8. 23 The third defence is that of the statutory time bar of six years arising from s 6(2) of the Limitation Act (Cap 61, 1994 Rev Ed) (“LA”). The plaintiff has failed to show that any exceptions to the time bar apply, and thus no remedy can lie in respect of rental income more than six years before the suit was commenced.35Foot Note 35×NE 16 March 2022, p 56 line 16 to p 57 line 4. 24 Finally, the defendant argues that his duty to account to the plaintiff arises only from s 73A of the CLPA, and there is no separate equitable duty to which he is subject. Accordingly, none of the rental income was held on constructive trust for the plaintiff.36Foot Note 36×NE 16 March 2022, p 27 line 21 to p 28 line 3.",
        "Issues to be determined": "25 I will address the issues in this case under the following broad headings: (a) What was the nature and extent of the defendant’s duty to account to the plaintiff? (b) Did the father make an arrangement with the defendant that modified the duty to account? (c) Was the plaintiff bound by such arrangement whether by acquiescence or otherwise? (d) Is the defence of laches available? (e) Did the arrangement come to an end, and if so when? (f) Is the defence of time bar made out?",
        "Issue 1: What was the nature and extent of the defendant’s duty to account to the plaintiff?": "",
        "What is the nature and extent of the statutory duty of a co-owner to account?": "26 Two questions arise regarding the nature and extent of the duty imposed by s 73A of the CLPA. 27 First, the plaintiff argues that s 73A of the CLPA imposes an absolute duty on co-owners who receive more than their share of rental income that cannot be qualified by acquiescence or agreement.37Foot Note 37×NE 16 March 2022, p 140 lines 9–10.The plaintiff relies on the use of the word “shall” in s 73A of the CLPA, which he argues creates a mandatory obligation.38Foot Note 38×NE 16 March 2022, p 69 lines 1–7.Certainly, I agree that s 73A of the CLPA imposes a mandatory obligation on a co-owner receiving more than his share of rental income. The true question, however, is how this mandatory obligation is to be fulfilled. While a co-owner receiving more than his share of rental income cannot unilaterally decide how to fulfil his duty under s 73A of the CLPA, agreement with or consent by theotherco-ownerwill certainly modify the content of the duty. I cannot accept the proposition that the right of a co-owner in the position of the plaintiff to an account under s 73A of the CLPA is absolute and cannot be qualified by his own agreement, whether express or tacit. Accounting to a co-owner in a manner satisfactory to him is sufficient to fulfil the duty imposed by s 73A of the CLPA. 28 The second question is whether, generally, co-owners are subject to an equitable duty to account for receipt of more than their share of rental income, such that a constructive trust arises in respect of that rental income. 29 Section 73A of the CLPA was derived from the repealed English statute, s 27 of 4 and 5 Ann, c.3 Administration of Justice Act 1705. It was inserted into the CLPA in 1993, when the Application of English Law Act 1993 was enacted. Peter Butt,Land Law(Thomson Reuters, 6th Ed, 2010) (“Butt”) at para 14-42 explains the background to the English statute: History Originally, the law provided no general remedy to compel a co-owner to account to other co-owners for receiving more than his or her proportionate share of the income and profits from the property. An exception was where the co-owner had received the income as “bailiff’ for the other co-owners, whether appointed expressly or self-appointed by conduct. The lack of a general remedy was partly rectified in 1705, when the Statute 4 and 5 Anne c 3, s 27, permitted a co-owner to bring an action of account against a fellow co-owner “for receiving more than comes to his just share or proportion”. [emphasis added] 30 Thus, s 73A of the CLPA provides co-owners with a remedy against their fellow co-owners for an account for rental income from co-owned property where there would otherwise be none. Importantly, s 73A is not a statutory embodiment of a pre-existing duty at common law. This much is evident from the following passage fromHalsbury’s Laws of Singaporevol 14(Butterworths Asia, 2014) at para 170.0037, which refers to section 73A of the CLPA: Account between joint tenants At common law no action of account could be maintained by a joint tenant against another joint tenant who had occupied the whole property. However, a right to account as between joint tenants (and tenants in common) has been given by statute; and an action of account lies where the joint tenant has been in sole occupation, as well as where he has been in receipt of the rents. Joint tenants are not otherwise in a fiduciary relation to one another. 31 I conclude that the general duty of a co-owner to account for rental income is purely statutory and contained in s 73A of the CLPA. There is no suggestion in the section that it reflects, or creates, an equitable duty to account. The plaintiff did not cite any authority to this effect. 32 It is neither necessary nor helpful to introduce the law and language of trusts or constructive trusts when there is no hint of this in s 73A of the CLPA. I therefore hold that rental income that is subject to the duty under s 73A is not held on trust, whether implied or constructive.",
        "Was there an equitable duty to account in this case?": "33 The plaintiff then argues that the circumstances of this case are such that the defendant was subject to an equitable duty to account, separate from the statutory duty under s 73A of the CLPA. Specifically, the plaintiff argues that the voluntary assumption by the defendant of the management of the Properties has made him a fiduciary.39Foot Note 39×NE 16 March 2022, p 90 lines 1–18.Consequently, one-third of any balance rental income was held by him on constructive trust for the plaintiff, and he was therefore subject to an equitable duty to account for it.40Foot Note 40×NE 16 March 2022, p 77 lines 11–16. 34 The plaintiff citesYong Kheng Leong v Panweld Trading Pte Ltd[2013] 1 SLR 173 (“Panweld”) at [45], where the Court of Appeal approved the remarks of Millett LJ inParagon Finance plc v D B Thakerar & Co (a firm)[1999] 1 All ER 400 (“Paragon Finance”) about the two types of constructive trustees. The plaintiff argues that this is a situation where “the defendant, although not expressly appointed as trustee, has assumed the duties of a trustee by a lawful transaction that was independent of and preceded the breach of trust” and is therefore a Class 1 constructive trustee (as defined inPanweldat [44]–[46], citingParagon Financeat 408). 35 The plaintiff also relies on the remarks of the Court of Appeal inChng Weng Wah v Goh Bak Heng[2016] 2 SLR 464 (“Chng Weng Wah”) at [23] that: In determining whether a claimant has a right to an account, the court has to first ascertain whether the defendant has received property in circumstances sufficient to import an equitable obligation to handle the property for the benefit of another:Associated Alloys Pty Ltd v ACN001 452 106 Pty Ltd(2000) 171 ALR 568 at 585. 36 The plaintiff thus argues that the defendant, having assumed responsibility for the management of the Properties, has created a situation whereby he is subject to an equitable obligation to hold rental income received by him for the benefit of the plaintiff. This voluntary assumption of the management of the Properties therefore made him a Class 1 constructive trustee in respect of the plaintiff’s share of the balance rental income. 37 In my view, this analysis is not on point. There is an established class of fiduciary, namely an agent. To the extent that someone described as a manager is clothed with agency by another, that person would be subject to fiduciary obligations under the law of agency. The role of manager is not itself a legal term, and there is no need or room to introduce a new category of fiduciary by that name. Similarly, fiduciary obligations arise in the context of partnership. It would also be possible for co-owners to enter into a partnership in respect of co-owned property. However, both agency and partnership would require something more being agreed, expressly or impliedly, beyond the fact of co-ownership. That additional element would have to be pleaded, and proven. In this case, neither agency nor partnership was pleaded or argued. 38 I return to the cases cited by the plaintiff. Neither assists him.Chng Weng Wahwas a case where the defendant held the property in question on trust for the plaintiff:Chng Weng Wahat [25].Panweldinvolved a plaintiff company and a defendant director, between whom there was clearly a fiduciary relationship. Both authorities presuppose the state of affairs that the plaintiff is trying to establish: that the defendant has received property impressed with fiduciary obligations owed to the plaintiff. 39 There is therefore no basis for the plaintiff’s argument that the defendant was subject to fiduciary duties in respect of the plaintiff’s share of the balance rental income. Accordingly, he did not hold the plaintiff’s share of the balance, if any, on constructive trust for the plaintiff. There was no equitable duty to account to the plaintiff. 40  Given my conclusion on this issue, I proceed with the rest of the issues in terms only of the statutory duty to account under s 73A of the CLPA.",
        "Issue 2: Did the father make an arrangement with the defendant that modified the duty to account?": "41 For this question to be answered in the affirmative, I would have to find, first, that the father did make the arrangement and, second, that the plaintiff accepted it. As the father did not give evidence, this issue depended on my assessment of the defendant’s account of his conversations with the father as well as my assessment of whether the plaintiff knew of the arrangement, notwithstanding his denial of knowledge.",
        "Direct evidence of the arrangement and the plaintiff’s knowledge of it": "42 Significant direct evidence of the arrangement and the plaintiff’s knowledge of it emerges from the plaintiff’s text messages to the defendant in English, in particular the one on 28 January 2019, described at [11] above. It bears repeating: “All the year you collected the rentwe didn’t get a cent as you agreed to pay the taxnow you keep avoiding to pay the said tax” (emphasis added).41Foot Note 41×1AB28.By this message, the plaintiff confirmed that he knew that the defendant was collecting the rental from the Properties for many years and that he did not receive his share of it (not even one cent) because the defendant had agreed to pay the plaintiff’s income tax chargeable on it. 43 This text message is difficult to explain unless the arrangement existed and the plaintiff knew of and assented to it, especially given that once the defendant paid the outstanding income tax the plaintiff did nothing in respect of the rental proceeds until his letter before action two years later described at [12] above. 44 Moreover, the text message revealed that there had been a longstanding arrangement for the defendant to pay the income tax chargeable on rental in respect of the Properties. The plaintiff as taxpayer would know or be able to find out readily how much income was being reported to the tax authorities on his behalf and how much tax was being assessed on that income. As he confirmed during cross examination, it was only in 2018 that he authorised the defendant to have direct access to his income tax assessments concerning the Properties.42Foot Note 42×NE 9 March 2022, p 54 line l to p 55 lines 5.The same point follows from the fact that property tax was assessed and paid on the Properties. As co-owner, he could also check this at any time with the tax authorities. In these circumstances, where the plaintiff knew that there was rental income that he was not receiving, it is incumbent on the defendant to explain why he did nothing about it if the arrangement did not exist. 45 The plaintiff argues that by “didn’t get a cent”, he simply meant that he had not received his share yet, but remained entitled to it.43Foot Note 43×NE 16 March 2022 p 136 line 22 to p 137 line 13.However, this explanation does not make sense in the context of the messages read together and as a whole. The plaintiff clearly stated that he “didn’t get a centas[the plaintiff] agreed to pay the tax…”(emphasis added).This message implies an arrangement whereby the plaintiff gave up an entitlement in exchange for the defendant taking on a responsibility. Further, if he was expecting payment of his share of the rental income he would surely have asked for it at this juncture but instead did nothing until another two years had gone by. 46 The plaintiff did not initially offer any explanation of what he understood had been agreed in respect of the Properties. It was only after the defendant amended his defence to plead laches that the plaintiff, while explaining why he took no action for so long, outlined his understanding of it in his supplementary affidavit of evidence-in-chief filed on the first day of trial:44Foot Note 44×Plaintiff’s supplementary AEIC dated 8 March 2022 at paras 8–12. 8. Ever since the Properties were purchased, Father had assured me from time to time that although I was not the one managing the Properties on a day-to-day basis, my one third share of the Properties, as well as any income earned therefrom, would be taken care of and fully accounted for to me. In particular, Father had given me these assurances sometime in 2003 just before he had left to attend to his business ventures in China. 9. In particular, I understood from Father that any rent generated from the Properties would be used to pay for any taxes arising from Father’s, and the Defendant’s and my ownership of the Properties. 10. Based on the understanding and assurances from Father as recounted above, and out of respect for and deference to him as the patriarch of the Family, I left it to Father to manage and handle all matters pertaining to the Properties. 11. On 14 October 2018, I signed a letter of authorisation to authorise the Defendant to collect my Notices of Assessment for the years of assessment 2014 to 2018. 12. On 2 November 2018, the Defendant signed a GIRO application form authorising his payment on my behalf of my share of tax for the rental income in respect of the Properties, which payment I understood would come from the said rental proceeds. 47 The plaintiff’s evidence in these paragraphs indicates that he was happy to leave matters in his father’s hands, and also that he understood all along that there was rental income from the Properties.",
        "The relationship between father and sons": "48 I also accept that the arrangement made sense in the context of the father’s relationship with his children. He was obviously a shrewd and capable businessman who looked after his family. Originally a pig farmer, he responded to the government’s phasing out of pig farms by venturing overseas, first to Malaysia and then to China.45Foot Note 45×Defendant’s AEIC at para 7.As the plaintiff said, he was the patriarch. His word carried great, if not decisive, weight with both plaintiff and defendant. It appears to have been the father’s decision to allocate ownership of a third of the Properties to each of the plaintiff and defendant regardless of their actual contribution. From 1989 until 2003, he took charge of the Properties and did not account for the rental to either plaintiff or defendant.46Foot Note 46×NE 16 March 2022, p 3 lines 4–9.Unsurprisingly, both accepted this. In the plaintiff’s words, reproduced in full in the extract at [46] above: “…out of respect for and deference to him as the patriarch of the Family, [the plaintiff] left it to [the father] to manage and handle all matters pertaining to the Properties”. 49 When, after his wife passed away, the father decided to seek a fortune (for the family) in China, he put the defendant in charge. In a sense, the defendant took his father’s place as far as the management of the Properties were concerned. The defendant produced a number of notes from his father in Chinese, some typed and others handwritten (“the father’s notes”).47Foot Note 47×1AB72 – 90, translations from 1AB91 to 110.Admittedly, nothing in the father’s notes directly dealt with rental income. Instead, they contained detailed instructions on other matters, including the Dedap Residence.48Foot Note 48×1AB96.Plaintiff’s counsel suggested that this meant there was no arrangement on the basis that, if there was, the father would have put it in writing. I cannot accept this suggestion. Read as a whole, the father’s notes are consistent with the defendant’s evidence of his conversations with the father. They show how the father trusted the defendant to manage his affairs in the interests of the family, and in particular thought of him as the member of the next generation who would take on future responsibilities for the family.49Foot Note 49×1AB97.For example, in a note dated 14 July 2003, the father said:50Foot Note 50×1AB92. Chee Loo father instructs and empower you at 14–07–03. I will leave you SGD 1000 and RM 1000, totalling SGD 1500. Do record the accounts, and I will keep in touch with you. You must hold the situation, assets and the family together and we must also move and make peace with each other! … 50 I conclude from the defendant’s relationship with his father as demonstrated by the father’s notes, that it was natural for him to be principally accountable to the father, who remained overall in-charge, rather than being separately accountable to the plaintiff. The plaintiff’s relationship with the father, whereby he deferred to the father generally, supports the inference that he accepted the arrangement. 51 Further, the defendant has remained in charge of the Properties from 2003 until present day. While the father has now lost mental capacity, this did not occur until the later part of 2020 at the earliest. Given the authority that the father had over his two sons, and his concern for taking care of the family’s assets, he would not have allowed the defendant to remain in charge if he did not approve of how the defendant was applying the rental income.",
        "The arrangement itself": "52 I also consider that the instructions attributed by the defendant to the father make practical sense both individually and together.51Foot Note 51×Defendant’s AEIC paras 20 and 21.This is all the more the case in the light of the nature of the parties’ relationships that I have outlined at [48] to [51] above. 53 First, the rental income was to be used to pay for property tax on the Properties, as well as to renovate and maintain them. Such expenses come within the ambit of outgoings on real property. Secondly, income tax would be chargeable to each of the co-owners and it made sense for the defendant to take care of this, especially as the father was overseas in China. Thirdly, it made sense to use the rental proceeds to pay down the overdraft. The overdraft account was held in all three names of defendant, plaintiff and father. It is true that the overdraft was drawn upon for purposes other than purchase of the property but on the evidence before me, such purposes were approved by the father. Fourthly, using the rental proceeds to renovate and maintain the Dedap Residence also made sense, given it was in the father’s name and both the plaintiff and defendant resided there. 54 This leaves the last alleged instruction, namely that the father told the defendant he could retain any balance for his own and his family’s use (referring to the defendant’s wife and son). It is this instruction that the plaintiff takes the most issue with.52Foot Note 52×NE 16 March 2022 at p 93 line 21 to p 94 line 7.The defendant’s case is that his father gave this instruction because the defendant had fully paid for the cost of renovating No 12 to make it suitable for use as a coffee shop.53Foot Note 53×Defendant’s AEIC at para 21.The plaintiff’s response rests, in essence, on three points. 55 First, the plaintiff highlights that in the defendant’s first lawyer’s letter in response to the claim,54Foot Note 54×2AB894.he dated this instruction to 2012 instead of 2004 as he subsequently pleaded and asserted in his testimony. This discrepancy, while real, is not something to which I am able to put much weight. It is not surprising, given the lapse of time, that the defendant’s first response might have been temporally inaccurate. 56 Secondly, the plaintiff submits that the father had not wanted to join the defendant in his coffee shop business and the defendant began it as a “solo venture”.55Foot Note 55×Defendant’s AEIC para 30.This meant that the defendant should personally bear the risks of that venture and the father would not have agreed to its costs being borne out of the rental proceeds. However, this point overlooks the fact that when the defendant stopped operating the coffee shop as his own venture, the property was then let out as a coffee shop. Thus, it could be said that the conversion to coffee shop contributed to obtaining that rental. It certainly is not implausible that the father would have seen it that way. 57 Thirdly, the plaintiff submits that this instruction had the effect of depriving him of his one-third share in the Properties. The father would never have given this instruction because he could not have intended this. The plaintiff would have never accepted an arrangement which contained this instruction for the same reason. However, this submission overstates matters. There was never any suggestion that the plaintiff would be deprived of his one third share of the Properties themselves. Not sharing in the rental income is a separate matter. It is plausible that the father felt that the defendant should retain the balance rental income because he was responsible for the effort that went into finding and managing tenants, and had alone paid for the renovation of No 12. As for the plaintiff’s acceptance of the arrangement, he may have agreed for the same reason or simply out of deference to his father. After all, the father gave him the one-third share in the first place, notwithstanding his having contributed less than a third of the purchase price.",
        "The defendant’s credibility": "58 Finally, I do not accept plaintiff’s counsel’s criticisms of the defendant’s evidence. One such criticism concerned when the defendant was asked why he did not keep the plaintiff informed of how he was using the rental proceeds. The defendant ended his list of reasons by saying that those were what he could think of “currently”.56Foot Note 56×NE 9 March 2022, p 86 lines 16–23.Plaintiff’s counsel suggested that this showed he was just making things up as he went along. However, I assess the witnesses’ credibility as a whole, bearing in mind that this was their first experience of giving evidence in court. In addition, they gave evidence via an interpreter (notwithstanding some ability to converse in English, a facility which sometimes makes it harder for witnesses giving evidence in their preferred language). I assess that both plaintiff and defendant were trying to tell the truth as they saw it, but in the plaintiff’s case I conclude that he had mistakenly convinced himself that he had not known of or assented to the arrangement when in fact he had, in part due to his deference to the father. 59 Moreover, I am not impressed by arguments that the defendant might have unnecessarily incurred some expenses on the Properties that ought to have been borne by the tenant instead, or that he failed to keep the Dedap Residence in good condition. Such arguments had no bearing on whether the arrangement existed.",
        "Conclusion on Issue 2": "60 For the reasons above, I conclude that the arrangement existed and that the plaintiff accepted it. I add that part of the arrangement was that it was the father to whom the defendant accounted. It was up to the father, as it had been in previous years, to decide how he would keep the plaintiff informed. I draw the inference that, as a matter of family dynamics, the two brothers were more comfortable relating to their father than to each other. 61 The defendant contends that the arrangement was a permanent one and could not be terminated. I do not agree. It was not a contractual agreement. Rather, it was a voluntary arrangement in a family context. When and to the extent it was carried out, whatever was done could not be undone, but it could always be ended prospectively. This analysis follows that of the law of gifts, where a gift can be revoked until, but not after, it has been conveyed to the donee. The effect of the arrangement was not that the other co-owners gave up their rights to rental income in perpetuity. It was an arrangement that would last only for so long as the other co-owners did not put an end to it in respect of their own share of the rental income. Thus, at least from 2012 onwards (when the Overdraft was repaid) it was open to the plaintiff to bring the arrangement to an end and assert his right to an account as co-owner from the date of such notice, unmodified by any arrangement. 62 For completeness, I do not find that the arrangement displaced or ousted the operation of s 73A of the CLPA. Rather, I analyse the arrangement as modifying the defendant’s duty to account under s 73A of the CLPA such that it was fulfilled by the defendant acting in accordance with the arrangement, which included dealing with the father and not directly with the plaintiff.",
        "Issue 3: Was the plaintiff bound by the arrangement, whether by acquiescence or otherwise?": "63  It follows from the discussion above that the plaintiff knew of the arrangement and assented to it. Consequently, he was bound by it until such time as he notified the defendant that he was putting an end to it. 64  Given my finding that there was a positive assent, it is not necessary to consider the doctrine of acquiescence, by which assent is implied from a person’s standing by and permitting another to do an act that infringes a right of his, so that he cannot thereafter complain of the infringement.",
        "Issue 4: Is the defence of laches available?": "65  As the liability to account is statutory and not equitable, laches has no application or relevance. I do not consider it further.",
        "Issue 5: Did the arrangement come to an end, and if so, when?": "66  On 26 March 2021, Wong Tan & Molly Lim LLC wrote to the defendant on behalf of the plaintiff and also purportedly on behalf of the father.57Foot Note 57×1AB31–33.While not stated in the letter, it was clarified at trial by plaintiff’s counsel that they did so relying on a lasting power of attorney executed by the father.58Foot Note 58×NE 9 March 2022 pp 25–29.As there is separate litigation concerning the validity of this lasting power of attorney, and as this action is brought only by the plaintiff and not the father, I proceed on the basis that the letter was sent only on the plaintiff’s behalf. 67 The letter effectively demanded a full account from the defendant. While it asserted that there was an understanding that the defendant “would fully account… as and when requested, for any and all dealings”, which I have found did not exist, the letter does have the effect of terminating the arrangement that I have found did exist. Thus, at least from 26 March 2021, the defendant was liable to account personally to the plaintiff “for receiving more than his share or proportion of any rents or profits arising from [the Properties]” under s 73A of the CLPA, and could no longer rely on the modification of his duty by the (now terminated) arrangement 68 I also consider whether the arrangement terminated automatically upon the father’s incapacity. The plaintiff’s position is that the father ceased to have capacity in January 2021 while the defendant considers that it happened prior to the father’s execution of the lasting power of attorney on 28 October 2020.59Foot Note 59×NE 9 March 2022 pp 32–34.In my view, on the facts of this case, once the father was clearly not able to deal with the defendant, the defendant could no longer rely on the arrangement and would have to account directly to the plaintiff as his co-owner. The arrangement depended on the father’s continuing role, a role that he could no longer play once he lost capacity. There is sufficient evidence before me to conclude that this occurred latest by January 2021. I therefore find that the defendant’s full and unmodified liability to account to the plaintiff dates from 1 January 2021. 69 I hold that the defendant need not account for rental income received prior to 1 January 2021 even if not expended by him. This is because under the arrangement he was entitled to retain the balance for his own and his family’s use. 70 Thus, the plaintiff succeeds on his claim for an account but only for rental income received from 1 January 2021 onwards.",
        "Issue 6: Is the defence of time bar made out?": "71 The defendant relies on s 6(2) of the LA which provides that an action for an account shall not be brought in respect of any matter which arose more than six years before the commencement of the action. On this basis, any account would be limited to the period from 25 May 2015.60Foot Note 60×Defence (Amendment No. 1) para 19. 72  The plaintiff’s pleading concerning the defence of limitation was only a non-admission.61Foot Note 61×Reply (Amendment No 1) para 12.In closing, however, he relied on the exceptions under ss 22 and 29 of the LA. 73 It is not necessary for me to consider limitation further, given my finding that the defendant’s liability to account is only for the period from 1 January 2021. 74 For completeness, however, I would express my views as follows: (a) Section 6(2) of the LA applies to an action for an account under s 73A of the CLPA. (b) Section 22 of the LA is not available to the plaintiff as there is no fraud on the part of the defendant nor is this an action in respect of trust property or its income. (c) Section 29 of the LA is not available to the plaintiff as the action is neither based on the fraud of the defendant nor concealed by the defendant’s fraud. 75 Even leaving aside my finding that the plaintiff knew of and assented to the arrangement, this is not a case where anything was concealed. All these years, the plaintiff has known of rental income being reported to the tax authorities, that the defendant was collecting this income, and that he was not receiving his share of it.",
        "Conclusion": "76 I have found that the arrangement existed. The plaintiff knew of and assented to it. The defendant fulfilled his statutory duty to account to the plaintiff by abiding by the arrangement so long as it remained in force. Nonetheless, the plaintiff was entitled to bring the arrangement to an end and attempted to do so shortly before commencing this action. In fact, the arrangement had already come to an end before that, by 1 January 2021, due to the father’s loss of mental capacity. The plaintiff has thus succeeded in his action for an account only in respect of a limited period, namely from 1 January 2021. I will hear counsel for plaintiff and defendant on the form of the order and on costs. 77 I end by thanking counsel for agreeing to oral submissions within the period originally allocated for the evidentiary hearing. Having oral submissions upon or soon after the conclusion of the evidence is helpful because the evidence is fresh in everyone’s mind. It is my preferred practice for this reason. I consider that doing so fosters the just and expeditious resolution of disputes. Nonetheless it depends on the hard work and efficiency of counsel and I am grateful to them for that. Philip JeyaretnamJudge of the High Court    Ling Daw Hoang Philip, Yap Jie Han (Ye Jiehan) and Lim Haan Hui (Wong Tan & Molly Lim LLC) for the plaintiff; Narayanan Sreenivasan SC and Tan Si Xin Adorabelle (K&L Gates Straits Law LLC) for the defendant;"
    }
}