{
    "case_title": "Hardman, Michael Jon and anothervSAIS Ltd and another",
    "ncitation": "[2022] SGHC 38",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Background to the dispute": "",
        "The parties": "2The two plaintiffs were employed in the latter half of 2017 by Sarment Pte Ltd (“SPL”), which was part of the Sarment Group of companies (“the Sarment Group”).1Foot Note 1×Affidavit of Evidence-in-Chief of Chiarugi Quentin Jean Ernest (“Mr Chiarugi’s AEIC”) at para 3.The Sarment Group operated a wine business under the brand name “Sarment”.  This wine business had two components.2Foot Note 2×Affidavit of Evidence-in-Chief of Michael Jon Hardman (“Mr Hardman’s AEIC”) at para 6.One was the sale of wines, spirits and related products, mostly to corporate buyers.  The second component was providing professional services such as sommeliers selections, event planning, wine tasting and related events, often done in partnership with bars and hotels internationally. 3The second defendant, then known as Sarment (S) Pte Ltd (not to confused with SPL), was incorporated in December 2017 after the two plaintiffs had already started work with the Sarment Group.3Foot Note 3×Mr Chiarugi’s AEIC at p 69.Its business was the development of e-commerce applications.  It later changed its name to Kaddra Pte Ltd (“Kaddra”).4Foot Note 4×Mr Chiarugi’s AEIC at para 6. 4The first defendant, formerly known as Sarment Holdings Ltd, was incorporated in late-January 2018 as the holding company of the Sarment Group.5Foot Note 5×Mr Chiarugi’s AEIC at para 7 and p 65.From 21 August 2018 to 16 March 2020, the shares of Sarment Holdings Ltd were publicly listed on the Toronto Stock Exchange (“TSX”) Venture Exchange in Canada (“TSX-V”).6Foot Note 6×Mr Chiarugi’s AEIC at paras 90-92 and p 752; Mr Hardman’s AEIC at para 23 and p 44.On 16 September 2019, its name was changed to SAIS Ltd.7Foot Note 7×Mr Chiarugi’s AEIC at p 65. 5The first plaintiff (“Mr Hardman”) is an experienced senior marketing and communications executive in a global company, and he is now based in Tokyo, Japan.  He started work in the Sarment Group as its Chief Marketing Officer on 28 August 2017.8Foot Note 8×Mr Hardman’s AEIC at paras 10-11 and p 42. 6The second plaintiff (“Mr Finck”) has his expertise in the area of business development and in particular, sourcing clients and partners for organisations in the lifestyle and luxury industry.  He started work with the Sarment Group on 10 August 2017 and held the title of “Head of Partnership”.9Foot Note 9×Mr Chiarugi’s AEIC at p 52.",
        "The employee share grant scheme": "7Before they agreed to join the Sarment Group, both the plaintiffs were separately informed by Mr Quentin Chiarugi (“Mr Chiarugi”), the defendants’ Chief Executive Officer (“CEO”), that there were plans for a public listing and, in that regard, there were also plans for a share incentive or grant scheme where employees may be granted shares in the listed company.10Foot Note 10×Mr Hardman’s AEIC at paras 7-8; Affidavit of Evidence-in-Chief of Nicolas Finck (“Mr Finck’s AEIC”) at para 7. 8As already mentioned, the first defendant was listed on the TSX-V on 21 August 2018.11Foot Note 11×Mr Hardman’s AEIC at para 23 and p 44.Shortly before that, the Sarment Group introduced the “Sarment Holding Limited Restricted Share Unit Plan” (“the RSU Plan”), which was the employee share grant or incentive scheme that the plaintiffs had been informed of.  This scheme came into operation on 3 August 2018,12Foot Note 12×Affidavit of Evidence-in-Chief of Gouw Togi Arif (“Mr Gouw’s AEIC”) at para 29.shortly before the public listing of the first defendant.  Under the RSU Plan, the first defendant can award Restricted Share Units (“RSUs”) to employees of the Sarment Group.  The RSUs would vest at various points in time, and on vesting, a specified number of shares in the first defendant would be provided to the employees. 9Various reasons were given by Mr Chiarugi in his evidence about the purpose of the RSU Plan.  In summary, it is not in dispute that the RSU Plan was a way of fostering a sense of belonging among the employees of the Sarment Group by giving them a stake in the company they were helping to build.13Foot Note 13×Transcript, 22 Sep, p 28 lines 24-29.It was to reward them for the work done and for the “success of the whole company”, and to help the Sarment Group retain talent and to incentivise its employees to work with its future in mind.14Foot Note 14×Transcript, 22 Sep, p 27 lines 22-25.It is also not in dispute that the implementation of the RSU Plan was included as part of the first defendant’s listing on the TSX-V.  This was the evidence of Mr Togi Gouw (“Mr Gouw”), the defendants’ Chief Financial Officer (“CFO”).15Foot Note 15×Mr Gouw’s AEIC at para 23.The initial public offering prospectus of the first defendant describes the purpose of the RSU Plan in the same way that Mr Chiarugi did in his evidence and states that it is a mechanism pursuant to which the company is able to issue “share-based compensation in the form of RSUs” to its employees, officers, employee directors and consultants.16Foot Note 16×Mr Chiarugi’s AEIC at para 27(a) and pp 191 and 210.The terms of the RSU Plan also suggest that it is premised on the first defendant being a publicly listed company.  For instance, one of the defined terms at Art 1.1(p) of the RSU Plan is “Exchange”, which is defined as the TSX, TSX-V or any other stock exchange on which the first defendant’s shares are listed for trading.  Under Art 4.3, one of the two ways by which the first defendant may provide its shares to the RSU Plan’s participants pursuant to vested RSUs was to purchase those shares on the TSX-V or any other Exchange (as defined). 10On 21 September 2018, Mr Finck was granted a “one-off gift” of an award of 38,260 RSUs which would entitle him to shares in the first defendant.  A letter dated 21 September 2018, which informed Mr Finck of the award, valued those RSUs as CAD 122,433 worth of shares as at that date based on then “open market trading prices”.17Foot Note 17×Mr Finck’s AEIC at pp 28-29.The letter went on to provide that the RSUs would vest over three years in three tranches.  Mr Finck would receive in total 38,260 shares.  Attached to the letter was a document titled “Schedule A - Form of Restricted Share Unit Agreement” (the “RSU Agreement Form”), which sets out the terms and conditions on which RSUs were awarded by the first defendant and the schedule over which such awarded RSUs were to vest.  The RSU Agreement Form attached to Mr Finck’s letter provided that the RSUs awarded to him would vest as follows: Number of RSUs  Vesting On 12,753    September 21, 2019 12,753    September 21, 2020 12,754    September 21, 2021 11Mr Finck accepted the terms of the award by executing the RSU Agreement Form on 28 February 2019.  It bears noting that the RSU Agreement Form executed by Mr Finck states that the agreement therein is made pursuant to the RSU Plan.18Foot Note 18×Mr Finck’s AEIC at pp 29A-29C.A copy of the RSU Plan was also provided to Mr Finck.  The RSU Plan sets out the detailed terms and conditions of the award of RSUs, which I will return to later in this judgment (see [37]-[38] and [43]-[45] below). 12As for Mr Hardman, his employment contract with SPL dated 28 August 2017 provided, as part of his remuneration package, that he would “qualify for Sarment stock option scheme for which details will be communicated when the scheme is approved by our board some later in 2017”.19Foot Note 19×Mr Hardman’s AEIC at p 36.This was a reference to the RSU Plan that was eventually introduced by the first defendant in August 2018.20Foot Note 20×Mr Hardman’s AEIC at para 28. 13On 29 March 2019, the first defendant awarded Mr Hardman 199,619 RSUs.  Like Mr Finck, Mr Hardman too executed the RSU Agreement Form.  In terms of vesting dates, the RSU Agreement Form executed by Mr Hardman provided as follows:21Foot Note 21×Mr Hardman’s AEIC at p 272. Number of RSUs  Vesting On 66,540    August 21, 2019 66,540    August 21, 2020 66,539    August 21, 2021",
        "The Sarment Group’s financial performance": "14From 2017, the Sarment Group had been developing a new business idea, which was the establishment of a digitalised lifestyle mobile phone application with a concierge service for luxury goods and services.  The business proposition was for revenue to be generated through subscription fees for users of the application and from retailers who wanted access to the application’s subscribers.22Foot Note 22×Mr Chiarugi’s AEIC at para 10.The Sarment Group named this project as “Keyyes”.23Foot Note 23×Mr Chiarugi’s AEIC at para 11.In addition to their other responsibilities, both plaintiffs worked on the Keyyes project.24Foot Note 24×Mr Chiarugi’s AEIC at paras 18-23.Mr Hardman reported to the CEO, Mr Chiarugi.  Mr Finck reported to Mr Hardman and also to Mr Chiarugi.25Foot Note 25×Mr Hardman’s AEIC at paras 17-20. 15As it turned out, the funds raised through the public listing of the first defendant in 2018 were not sufficient to fund the full business plans in relation to the launch of Keyyes.26Foot Note 26×Mr Chiarugi’s AEIC at para 29.Also, the number of subscribers that Keyyes managed to attract and the revenue generated fell below expectations.27Foot Note 27×Mr Chiarugi’s AEIC at paras 42 and 44.In the latter part of 2018, the Sarment Group’s wine business also suffered significantly because it lost several distribution contracts.  As a result of all this, the financial performance of the Sarment Group deteriorated, and employees of the company started to be laid off.  In the team headed by Mr Hardman, 23 of his staff were asked to leave by March 2019.28Foot Note 28×Mr Chiarugi’s AEIC at para 46. 16Eventually, Mr Hardman was given a new role as the Chief Creative Officer of the second defendant, Kaddra.  He signed a new employment contract with Kaddra on 11 July 2019.29Foot Note 29×Mr Chiarugi’s AEIC at pp 383-388.As already mentioned, Kaddra’s focus was more on e-commerce, and it sold “white label” mobile commerce technology solutions to retailers. 17Mr Finck was also given a new role – that of General Manager for Keyyes.30Foot Note 30×Mr Finck’s AEIC at para 23.This took effect from May 2019, although Mr Finck only executed a new employment contract with Kaddra sometime in July 2019.31Foot Note 31×Mr Finck’s AEIC at para 24; Mr Chiarugi’s AEIC at pp 422-426.He was tasked with the job of selling the technology behind “Keyyes” as a “white label” mobile commerce solution to the retail partners for “Keyyes”.  In his new role, Mr Finck now reported only to Mr Hardman. 18By August 2019, it became clear to the senior management of the Sarment Group that Keyyes was not financially sustainable and a decision was made thereafter to shut down that part of its business.32Foot Note 32×Mr Chiarugi’s AEIC at paras 61-62; Mr Gouw’s AEIC at paras 58-59.This necessarily led to the termination of Mr Finck’s employment, which I will return to later in this judgment (see [25] below).",
        "The corporate restructuring": "19Given its poor financial performance, the senior management of the Sarment Group decided in early 2019 to restructure it. 20On 29 May 2019, the first defendant announced that its board of directors had been “evaluating options” for a sale of its “traditional luxury distribution business”.33Foot Note 33×Mr Chiarugi’s AEIC at para 68 and p 440.It is not disputed that this was a reference to a potential sale of the Sarment Group’s wine and spirits distribution business that was, or intended to be, housed under one of its subsidiaries, Sarment Wine & Spirits Holding Pte Ltd (“Sarment Wines”).34Foot Note 34×Mr Chiarugi’s AEIC at pp 447-448.The announcement also stated that the sale was “subject to applicable approvals, including any necessary shareholder, regulatory and [TSX-V] approvals”.35Foot Note 35×Mr Chiarugi’s AEIC at p 441. 21Then, on 29 July 2019, the first defendant issued a news release, announcing that it had, on that day, entered into a sale and purchase agreement to sell Sarment Wines (“the SPA”) to El Greco International Investments SRI (“El Greco”), the Claude Dauphin Estate (“CDE”), and Mr Mark Joseph Irwin (“Mr Irwin”) (collectively the “Buyers”).36Foot Note 36×Mr Chiarugi’s AEIC at paras 70-72 and pp 475-480.I will refer to this as the “Wine Business Sale”.  It is clear from the terms of the sale that the Buyers would furnish consideration by assuming approximately US$20.5 million of the Sarment Group’s debt.37Foot Note 37×Mr Chiarugi’s AEIC at p 477.The Buyers were all existing shareholders of the first defendant.  On that same date, the first defendant’s board of directors also issued a notice of an annual general meeting (“AGM”) and an extraordinary general meeting (“EGM”) to be held on 30 August 2019 (“the Shareholders’ Meetings”) for the shareholders of the first defendant to, amongst other things, vote on the Wine Business Sale.38Foot Note 38×Mr Chiarugi’s AEIC at para 70. 22In that same news release, the first defendant also announced that, in connection with the Wine Business Sale, one of the Buyers, Mr Irwin, was expected to acquire a significant portion of El Greco’s and CDE’s shareholding stakes in Sarment Holdings Ltd.39Foot Note 39×Mr Chiarugi’s AEIC at p 478.As such, the news release stated that this would result in Mr Irwin becoming a new “control person” of the first defendant with 53.5% of its shares.40Foot Note 40×Mr Chiarugi’s AEIC at p 478. 23On 30 August 2019, the Shareholders’ Meetings were held.  The shareholders voted by the requisite majorities to approve the Wine Business Sale and Mr Irwin becoming a “control person” of the first defendant.41Foot Note 41×Mr Chiarugi’s AEIC at para 73 and pp 483 and 525.It appears that, under the TSX-V rules, approval by a majority of disinterested shareholders is required where a transaction results in the creation of a new “control person”, defined as any person that holds a sufficient number of the company’s shares as to materially affect the control of the company, or who holds more than 20% of the outstanding voting shares of the company.42Foot Note 42×Mr Chiarugi’s AEIC at p 525.At the Shareholders’ Meetings,the shareholders also approved the change of the first defendant’s name from “Sarment Holdings Limited” to “SAIS Limited” (see [4] above), which was to be effective as soon as the first defendant filed the necessary regulatory documentation with the TSX-V.43Foot Note 43×Mr Chiarugi’s AEIC at p 526.I will refer to the first defendant hereafter in this judgment as “SAIS” and the “Sarment Group” as the “SAIS Group”. 24On 13 September 2019, SAIS obtained TSX-V’s approval for the Wine Business Sale and it made a press announcement about the closing of the Wine Business Sale on that day.44Foot Note 44×Mr Chiarugi’s AEIC at para 74(a) and pp 706-707.Then, on 16 October 2019, SAIS announced that Mr Irwin had acquired the additional shares in SAIS from El Greco and CDE on 15 October 2019, and was the owner of approximately 53% of SAIS’s shareholding pursuant to the acquisition.45Foot Note 45×Mr Chiarugi’s AEIC at para 74(b) and p 708.",
        "The termination of Mr Finck’s employment": "25On 5 September 2019, less than two months after he signed his new employment contract with Kaddra (see [17] above), Mr Finck was informed that his employment with Kaddra would be terminated with immediate effect.46Foot Note 46×Mr Finck’s AEIC at para 35.He was told that he would be receiving his outstanding salary and his bonus for 2018 in instalments over a period of four months.47Foot Note 47×Mr Finck’s AEIC at para 37.Although Mr Finck had signed a new employment contract in July 2019, it had been agreed between Kaddra and him in late-August 2019 (as evidenced by a letter dated 27 August 2019 that was annexed to his new employment contract) that his accrued bonus for 2018 under the previous employment contract with SPL remained outstanding and would be paid by Kaddra.48Foot Note 48×Mr Finck’s AEIC at para 24 and p 26. 26Mr Finck was unhappy with the terms of redundancy that he had been offered.  He was particularly dissatisfied with the fact that his employment was being terminated so close to when the first one-third of his awarded RSUs (12,753 RSUs) would be vesting,ie, 21 September 2019 (see [10] above).49Foot Note 49×Mr Finck’s AEIC at para 37.He believed that the termination of his employment meant that he would lose all his awarded RSUs.50Foot Note 50×Transcript, 21 Sep, p 45 lines 14-17.He informed Mr Hardman and Ms Brigit Bong (“Ms Bong”), SAIS’s human resource manager, that he would be taking legal advice on his options.  He told Mr Hardman and Ms Bong that he wanted all his outstanding salary and bonus to be paid at once, and also that he wanted to keep the first one-third of his awarded RSUs,ie, 12,753 RSUs.  He then left the office.51Foot Note 51×Mr Finck’s AEIC at para 38; Transcript, 21 Sep, p 45 lines 30-31, p 46 lines 1-10 and 30-31, p 47 lines 1-11 and 26-30. 27Later that day, Mr Hardman called Mr Finck to inform him that the terms of his redundancy had been revised (“the Redundancy Agreement”).  He would be paid all his outstanding salary and bonus from 2018 in a lump sum as soon as tax clearance was obtained.52Foot Note 52×Mr Finck’s AEIC at para 40.Further, the first one-third of his awarded RSUs (12,753 RSUs) would continue to vest on 21 September 2019 in spite of the termination of his employment.53Foot Note 53×Mr Chiarugi’s AEIC at para 77(b).The termination of Mr Finck’s employment was finalised on 6 September 2019 and the full terms of the Redundancy Agreement were set out in a letter from Kaddra to him of that same date (“the 6 Sep 2019 Letter”).54Foot Note 54×Mr Chiarugi’s AEIC at pp 434-437.",
        "The termination of Mr Hardman’s employment": "28On 4 October 2019, Mr Hardman was provided with 66,540 shares in SAIS.55Foot Note 55×Mr Hardman’s AEIC at para 56.According to SAIS, this was pursuant to the first one-third of Mr Hardman’s awarded RSUs that he was contractually entitled to under the terms of the RSU Agreement Form that he executed on 29 March 2019, which had vested on 21 August 2019 (see [13] above).56Foot Note 56×Mr Chiarugi’s AEIC at para 77(a). 29In the month of October 2019, Mr Hardman’s bonus for the year 2018 was also agreed (“the 2018 Bonus”).57Foot Note 57×Mr Hardman’s AEIC at para 95.At that time, Mr Hardman was already employed by Kaddra instead of SPL.  Mr Chiarugi asked Mr Hardman to accept the 2018 Bonus in the form of RSUs, instead of cash.  This was because, Mr Hardman was informed, Kaddra was short of cash.58Foot Note 58×Mr Hardman’s AEIC at para 95.Mr Hardman agreed to receive the 2018 Bonus in RSUs (“the Bonus Agreement”).  This was later approved at a compensation meeting of Kaddra on 15 October 2019 and it was confirmed that Mr Hardman would receive 72,590 RSUs as payment for the 2018 Bonus.59Foot Note 59×Mr Hardman’s AEIC at para 95 and pp 383-384; Statement of Claim (Amendment No 2) (“SOC”) at para 33.So, on 9 December 2019, Mr Hardman executed another RSU Agreement Form for an award of 72,590 RSUs.60Foot Note 60×Mr Hardman’s AEIC at para 96 and pp 391-393.Mr Hardman was later informed by Kaddra that the 72,590 RSUs would vest by the end of February 2020.61Foot Note 61×Mr Hardman’s AEIC at para 100.It does not appear that Mr Hardman had expressed any objections to this. 30Sometime in early January 2020, Mr Hardman was informed that he would be made redundant.  He asked whether he could be given the option to resign instead, so as not to prejudice any future job opportunities.  This request was acceded to.62Foot Note 62×Mr Hardman’s AEIC at para 103. 31On 29 January 2020, Mr Hardman executed a letter issued by Kaddra titled “Terms & Conditions of your resignation dated 15 January 2020” (“the Resignation Letter”).63Foot Note 63×Mr Hardman’s AEIC at para 104 and p 388.Amongst other things, the Resignation Letter stated that the 72,590 RSUs (representing the 2018 Bonus) that had been awarded to Mr Hardman would be “issued and vesting” by the end of February 2020.  That letter also recorded that, as agreed, in lieu of three months’ notice, Mr Hardman would provide consulting services to Kaddra for the period from 16 January 2020 to 13 April 2020.  On 29 January 2020, Mr Hardman also executed a letter dated 15 January 2020 tendering his resignation from Kaddra and entered into an agreement on consulting services with Kaddra.64Foot Note 64×Mr Hardman’s AEIC at para 106.",
        "The delisting of SAIS": "32On 19 February 2020, SAIS announced that it had filed an application with the TSX-V to voluntarily delist its shares from the exchange.65Foot Note 65×Mr Chiarugi’s AEIC at p 750.SAIS’s delisting application was approved on 5 March 2020 and its last day of trading on the TSX-V was 16 March 2020.66Foot Note 66×Mr Chiarugi’s AEIC at paras 90-92 and p 752.",
        "The commencement of the suit": "33On 17 June 2020, Mr Hardman’s solicitors sent a letter to Kaddra to complain that, amongst other things, “Kaddra failed to issue the RSUs [representing the 2018 Bonus] and ensure their vesting at the end of February 2020” (“the 17 Jun 2020 Letter”).67Foot Note 67×Mr Hardman’s AEIC at pp 395-397.Mr Hardman took the position that this was a breach of the Bonus Agreement, and he was electing to treat that agreement as discharged.68Foot Note 68×Mr Hardman’s AEIC at p 396. 34On 17 July 2020, both the plaintiffs commenced this suit.",
        "The plaintiffs’ case": "35Mr Hardman claims to be entitled to the 2018 Bonus in cash.  In the plaintiffs’ closing submissions, Mr Hardman explains that he had accepted SAIS’s repudiatory breach of the Bonus Agreement by its failure to provide him with 72,590 SAIS shares by the end of February 2020 as the 2018 Bonus.69Foot Note 69×Plaintiffs’ Closing Submissions (“PCS”) at paras 119-120 and 135-139.As such, he claims the cash equivalent of 72,590 SAIS shares as at 15 October 2019, which is said to be the amount of CAD 101,626.70Foot Note 70×SOC at paras 33-34.Despite Mr Hardman’s reference to SAIS, I note that the party that wasprima faciein breach of the Bonus Agreement as a result of SAIS’s failure to provide the 72,590 SAIS shares to Mr Hardman by the end of February 2020 must be Kaddra and not SAIS.  It was Kaddra (rather than SAIS) that had been a party to the Bonus Agreement.  While SAIS was obliged to provide Mr Hardman 72,590 RSUs and the corresponding shares, that was pursuant to the RSU Agreement Form which Mr Hardman executed on 9 December 2019 (see [29] above), and not because SAIS was a party to the Bonus Agreement.  Under the Bonus Agreement, it was Kaddra’s obligation alone to procure that SAIS provided Mr Hardman with those shares by the end of February 2020.  That is also consistent with how the 17 Jun 2020 Letter by Mr Hardman’s counsel had been addressed to Kaddra rather than SAIS (see [33] above). 36Mr Finck claims that he never received the 12,753 shares which SAIS was to provide him, pursuant to the Redundancy Agreement reached between him and Kaddra on 6 September 2019, when his employment was terminated.  As such, he claims the cash equivalent of these 12,753 SAIS shares. 37Both plaintiffs also claim that, by reason of the corporate restructuring undertaken by SAIS in 2019 (see [19]-[24] above), certain provisions in the RSU Plan were triggered, which had the effect of causing all the RSUs that they had been awarded to immediately vest and become payable on either 13 September 2019 or alternatively, 15 October 2019.71Foot Note 71×SOC at paras 19-28.In particular, the plaintiffs rely on Art 5.3 of the RSU Plan: In the event of a Change of Control,all Restricted Shares Unitsshall bedeemed to have vested immediately prior to the occurrence of the Change of Control and shall become payable effective immediately on such dateand, to the extent the Corporation is involved in a transaction where the occurrence of the Change of Control is dependent on actions to be taken by the Corporation, it shall ensure that all entitlements relating to such Restricted Share Units are paid to Participants concurrently with and as a condition of closing of such Change of Control transaction. [emphasis added] 38In so far as it is material to the parties’ cases, the term “Change of Control” is defined at Art 1.1(i) of the RSU Plan as:72Foot Note 72×Mr Chiarugi’s AEIC at pp 362-363. … (ii) the sale, lease, exchange or other disposition, in a single transaction or a series of related transactions, of all or substantially all of the assets, rights or properties of the Corporation and its Subsidiaries on a consolidated basis to any other person or entity, other than transactions among the Corporation and its Subsidiaries; … (iv) any person, entity or group of persons or entities acting jointly or in concert (an ‘Acquiror’) acquires, or acquires control (including, without limitation, the right to vote or direct the voting) of, Voting Securities of the Corporation which, when added to the Voting Securities owned of record or beneficially by the Acquiror or which the Acquiror controls, would entitle the Acquiror and/or Associates and/or Affiliates of the Acquiror, to cast or to direct the casting of 50% or more of the votes attached to all of the Corporation’s outstanding Voting Securities which may be cast to elect directors of the Corporation or the successor corporation (regardless of whether a meeting has been called to elect directors); … 39The plaintiffs’ case is that the Wine Business Sale was a sale of “substantially all of the assets … of the Corporation [ie, SAIS]” and thus on its completion on 13 September 2019 (see [24] above), a Change of Control event took place.  That entitled both plaintiffs to have all their awarded RSUs vested and SAIS shares provided to them pursuant to those vested RSUs immediately upon or concurrently with the close of the Wine Business Sale. 40Alternatively, the plaintiffs say that the completion of Mr Irwin’s acquisition of shares from El Greco and CDE on 15 October 2019, which resulted in him acquiring a controlling stake of SAIS (see [22] and [24] above), constituted a Change of Control event.  Again, that meant that both the plaintiffs were entitled to have all their awarded RSUs vested, and SAIS shares provided to them pursuant to those vested RSUs, immediately upon or concurrently with the completion of Mr Irwin’s acquisition of a controlling stake in SAIS.  While both the plaintiffs and defendants have referred to the date of this Change of Control event as 16 October 2019 in their pleadings, submissions and during the trial,73Foot Note 73×SOC at para 25; PCS at para 67; Defence & Counterclaim (Amendment No 2) (“D&CC”) at para 18; Defendants’ Closing Submissions (“DCS”) at para 31; Transcript, 22 Sep, p 18 lines 22-25.the correct date, however, must be 15 October 2019, as SAIS’s press release on 16 October 2019 confirms that Mr Irwin’s acquisition of shares took place on the former and not the latter date (see [24] above). 41The plaintiffs claim the cash equivalent of these shares using the market prices of SAIS’s shares as at 13 September 2019 or, alternatively, 15 October 2019.",
        "The defendants’ case": "42In their Defence & Counterclaim (Amendment No 2) (“D&CC”), the defendants accepted that a Change of Control event took place on 15 October 2019, with Mr Irwin becoming a new controlling shareholder of SAIS, or alternatively, on 13 September 2019, with the closing of the Wine Business Sale.74Foot Note 74×D&CC at para 18.However, in their opening address and in closing submissions, the defendants take the position that a Change of Control event only took place on 15 October 2019 andnot13 September 2019.75Foot Note 75×Transcript, 22 Sep, p 18 lines 4-26; DCS at paras 27-31; Defendants’ Reply Submissions (“DRS”) at paras 14-16.In any case, the defendants do not agree that the plaintiffs are entitled to be provided with their shares on either 13 September 2019 or 15 October 2019. 43In respect of Mr Hardman’s claim to his awarded RSUs that remained outstanding (“the Outstanding RSUs”), the defendants’ pleaded defence differs from the position that they take in their closing submissions.  The Outstanding RSUs, totalling 133,079 RSUs, comprise the total number of RSUs which Mr Hardman was contractually entitled to under the RSU Agreement Form executed on 29 March 2019 (199,619 RSUs) and which were to vest over three tranches (see [13] above) minus the first one-third of Mr Hardman’s awarded RSUs (66,540 RSUs) which had vested on 21 August 2019 and pursuant to which shares were issued to Mr Hardman on 4 October 2019 (see [28] above).   In their D&CC, the defendants’ position is that Mr Hardman’s awarded RSUs were to vest according to the terms of the vesting schedule as set out in the RSU Agreement Form executed on 29 March 2019 by Mr Hardman.76Foot Note 76×D&CC at para 13.This meant that the Outstanding RSUs were not scheduled to vest until August 2020, at the earliest.  On 13 August 2020, SAIS “caused [the Outstanding RSUs] to be issued and vested” to Mr Hardman, and the corresponding shares were subsequently issued to Mr Hardman on 21 September 2020. Therefore, the defendants say, Mr Hardman’s claim for any SAIS shares pursuant to the Outstanding RSUs is extinguished.77Foot Note 77×D&CC at para 23.Evidently, the import of the defendants’ pleaded defence is that any Change of Control event has no effect whatsoever on the awarded RSUs’ original vesting schedule. 44In their closing submissions, however, the defendants take a different position.  They rely on Art 4.3 of the RSU Plan which provides,inter alia, that: On a date (the ‘RSU Payment Date’) to be selected by the Board following the date a [RSU] has become a Vested [RSU], which date shall be within fifteen (15) days of the Vesting Date and which date shall not, in any event, extend beyond December 15th of the third year following the year of grant for the particular [RSU], the Corporation, at its sole and absolute discretion, shall have the option of settling the Vested [RSU] by any of the following methods or by a combination of such methods … [by the purchase of Shares in the open market, or the issuance of Treasury Shares] … The Participant shall not transfer, sell or assign any Shares or Treasury Shares received by the Participant pursuant to the settlement of Vested [RSUs] until six months following the date of settlement of such Vested [RSUs]. 45The defendants also refer to Art 4.6 of the RSU Plan which provides that: Notwithstanding any other provision of [the RSU Plan], all amounts payable to, or in respect of, a Participant under [Art 4.2 of the RSU Plan], including, without limitation, the issuance or delivery of Shares and/or Treasury Shares, shall be paid or delivered on or before December 31 of the third calendar year commencing immediately following the year of grant in respect of the particular [RSU]. 46Relying on these clauses, the defendants’ eventual position in their closing submissions is that, regardless of any Change of Control event, they had up to the end of three years from the grant of the RSUs,ie, end of 2022, to settle the Outstanding RSUs.  Therefore, even if the Outstanding RSUs vested on the date of the Change of Control event, the defendants say they have until 31 December 2022 to issue Mr Hardman SAIS shares pursuant to the Outstanding RSUs.78Foot Note 78×DCS at paras 24-25 and 32.Since SAIS shares corresponding to the Outstanding RSUs were eventually issued to Mr Hardman on 21 September 2020, the defendants have performed their contractual obligations under the RSU Plan.79Foot Note 79×DCS at para 35(a).As such, it is said that Mr Hardman’s claims to SAIS shares pursuant to the Outstanding RSUs have been extinguished. 47In relation to the 72,590 RSUs, representing the 2018 Bonus, the defendants accept that these RSUs were to vest, and shares issued by the end of February 2020, as set out in the Resignation Letter (see [31] above).80Foot Note 80×D&CC at para 27(c); DCS at para 36(b).However, they submit that this deadline should be read together with the defendants’ obligation to comply with all other regulatory and legal requirements for the issuance of shares.81Foot Note 81×DCS at para 36(b).The defendants say that they have complied with their obligations since shares were issued pursuant to these RSUs as soon as the defendants could do so, which was on 21 September 2020.82Foot Note 82×D&CC at para 27(e); DCS at para 36(b).As such, the defendants’ position is that Mr Hardman has no claim for the 2018 Bonus, whether in the form of SAIS shares or cash. 48With regards to Mr Finck’s claims to all the RSUs that had been awarded to him on 28 February 2019 (see [10]-[11] above), the defendants take the position that he is not entitled to any of these RSUs.  This is because any awarded but unvested RSUs at the date of the termination of Mr Finck’s employment with Kaddra,ie, 6 September 2019, would “automatically and immediately terminate” asperArt 5.1 of the RSU Plan.83Foot Note 83×D&CC at para 24; DCS at para 39.This took place before the occurrence of the Change of Control event, whether it was 13 September 2019 or 15 October 2019, and hence Mr Finck had no legal entitlement to any of his awarded RSUs. 49Notwithstanding this, the defendants’ position is that the Redundancy Agreement made between Kaddra and Mr Finck on 6 September 2019 amounted to a settlement on the amounts due to the latter upon the termination of his employment (see [27] above).  Pursuant to this settlement, the defendants agreed to the vesting of the first one-third of Mr Finck’s awarded RSUs,ie, 12,753 RSUs, but Mr Finck is not entitled to claim for shares pursuant to the remaining two-thirds of his awarded RSUs.84Foot Note 84×D&CC at para 24A; DCS at para 39.These 12,753 RSUs would have vested on 21 September 2019 asperthe terms of the settlement.85Foot Note 85×D&CC at para 24A(b)(vi).In so far as no shares were provided to Mr Finck pursuant to these RSUs, this was only because of his own failure to take steps to open a brokerage account and provide details of that brokerage account to TSX Trust, the share depository.86Foot Note 86×D&CC at para 27C; DCS at para 38(c).As such, the defendants deny that they are liable to Mr Finck in respect of his alternative claim for the cash equivalent of 12,753 shares in SAIS. 50The defendants have an alternative case on the quantum of damages as claimed by the plaintiffs.  They say that, even if either of the plaintiffs have a claim to their RSUs and the corresponding shares, whether on the Change of Control date, on 21 September 2019 (in the case of Mr Finck under the Redundancy Agreement), or by end-February 2020 (in the case of Mr Hardman under the Bonus Agreement), the following portion of Art 4.3 (already set out at [44] above), is relevant:87Foot Note 87×DCS at paras 7(b), 35(b) and 36(c). … The Participant shall not transfer, sell or assign any Shares or Treasury Shares received by the Participant pursuant to the settlement of Vested [RSUs]until six months following the date of settlement of such Vested [RSUs]. [emphasis added] 51The defendants point out that this part of Art 4.3 imposes a “moratorium” on the sale of any of shares issued pursuant to vested RSUs for a period of six months after the settlement of the RSUs.  As such, the defendants take the position that the plaintiffs would not be entitled to damages based on the cash equivalent of shares which they claim they were entitled to receive based on the market price of SAIS’s shares on the date when the Change of Control took place, whether it is 13 September 2019 or 15 October 2019, or 21 September 2019, in respect of Mr Finck’s 12,753 RSUs which vested as part of his settlement with Kaddra following the termination of his employment, or as at end-February 2020, in respect of Mr Hardman’s 72,590 RSUs representing the 2018 Bonus.  Instead, the defendants argue that the operative date for assessing the plaintiffs’ damages is six months following the date which the court finds the plaintiffs should have received their SAIS shares.",
        "The defendants’ counterclaim against Mr Hardman": "52The defendants have also made a claim against Mr Hardman for breaching his duties as an employee of SAIS and/or Kaddra, arising from the manner in which he handled the departure of Mr Finck on 5 and 6 September 2019.  Specifically, the defendants say that Mr Hardman breached his “fiduciary and other duties” by causing Kaddra to include in the Redundancy Agreement the clause which provided that the first one-third of Mr Finck’s RSUs that he was contractually entitled to,ie, 12,753 RSUs, would vest as scheduled on 21 September 2019 notwithstanding the termination of his employment before that date.88Foot Note 88×D&CC at paras 29-30.The defendants claim that Mr Hardman had placed himself in a position of conflict of interest because, at that time, he had a dispute with the defendants over his claim for the 2018 Bonus and for his awarded RSUs.  He also allegedly gave a false impression to the defendants that Mr Finck would not subsequently commence legal proceedings against them if the clause providing for the vesting of the first one-third of Mr Finck’s RSUs was included in the Redundancy Agreement.89Foot Note 89×DCS at paras 44-46. 53Mr Hardman denies that he was in a position of conflict of interest when he dealt with the terms of Mr Finck’s exit.  Mr Hardman said that he simply communicated Mr Finck’s demands to the senior management of the defendants, and he did not seek to persuade Mr Chiarugi or Mr Gouw to accede to Mr Finck’s demands.90Foot Note 90×Mr Hardman’s AEIC at paras 86-87.He denies that he was in any dispute with the defendants at that time concerning his claim to the 2018 Bonus or his awarded but unvested RSUs.  He also denies being aware, on 6 September 2019, that Mr Finck would sue the defendants later.",
        "The issues": "54From my review of the parties’ cases and the defendants’ counterclaim, the key issues thrown up for determination are as follows: (a) Was Art 5.3 of the RSU Plan, relating to a Change of Control, triggered on 13 September 2019, when the Wine Business Sale closed? (b) When Art 5.3 of the RSU Plan was triggered, whether on 13 September 2019 or 15 October 2019, what is the impact, if any, on the plaintiffs’ awarded but unvested RSUs? (c) Is Mr Hardman entitled to claim the 2018 Bonus in cash?  If not, by when should he have been provided with the 72,590 SAIS shares pursuant to the 72,590 RSUs representing payment for the 2018 Bonus, and is Mr Hardman entitled to any damages as a result of those shares being provided to him only on 21 September 2020? (d) Did the provision of SAIS shares to Mr Hardman on 21 September 2020 extinguish his claims for breach of Art 5.3 of the RSU Plan in respect of the Outstanding RSUs and/or his claim to the 2018 Bonus completely? (e) Did Mr Finck compromise his claim to the remaining two-thirds of his awarded RSUs by entering into the Redundancy Agreement with Kaddra on 6 September 2019? (f) Did Kaddra breach the Redundancy Agreement by failing to ensure that Mr Finck’s 12,753 RSUs vested on 21 September 2019 and that the corresponding shares were provided to him? (g) Have the defendants established their counterclaim against Mr Hardman for breach of his duties? 55It is to these issues that I now turn.",
        "Was Art 5.3 of the RSU Plan triggered on 13 September 2019?": "56The purpose of contractual interpretation is to give effect to the objectively ascertained expressed intentions of the contracting parties as it emerges from the contextual meaning of the relevant contractual language (Yap Son Onv Ding Pei Zhen[2017] 1 SLR 219 (“Yap Son On”)at [30]).  Since the object of interpretation is the verbal expression used by the parties, the text of the contract is the first port of call for the court (YapSon Onat [30];Y.E.S. F&B Group Pte Ltd v Soup Restaurant Singapore Pte Ltd (formerly known as Soup Restaurant (Causeway Point) Pte Ltd)[2015] 5 SLR 1187 (“Soup Restaurant”)at [32]).  However, the court must also consider the relevant context and circumstances in which the contract was made, which would reflect the intention of the parties when they entered into the contract and why they utilised the contractual language they did (Zurich Insurance(Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”)at [106] and [114]).  The relevant context, however, places the court in the position of the party that drafted the contract andnotthe drafter’s subjective intention as such (Soup Restaurantat [33]). 57With these principles in mind, the critical question to be answered is whether the completion of the Wine Business Sale on 13 September 2019 falls within Art 1.1(i)(ii) of the RSU Plan and constitutes a Change of Control event. 58On 29 July 2019, SAIS entered into the SPA with the Buyers to sell Sarment Wines (see [21] above).  Clause 3.1 of the SPA sets out a number of conditions precedent to the sale.  It is not disputed that all these conditions were satisfied by 13 September 2019.  In particular, the approval of the shareholders of SAIS was obtained on 30 August 2019 at the Shareholders’ Meetings held on that day (see [23] above).  On 13 September 2019, an agreement for the purchase of El Greco’s and CDE’s shares in SAIS by Mr Irwin was executed.91Foot Note 91×Exhibit D1.The defendants say that this had the effect of satisfying another condition precedent in the SPA, which is that an agreement for the purchase of El Greco’s SAIS shares by Mr Irwin be executed.92Foot Note 92×Transcript, 23 Sep, p 6 lines 1-3 and 24-26, p 7 lines 8-25.Further, on 13 September 2019, SAIS obtained TSX-V’s approval of the Wine Business Sale (see [24] above).  Mr Chiarugi himself admitted that, from the point of view of the SPA, SAIS had sold Sarment Wines on 13 September 2019.93Foot Note 93×Transcript, 22 Sep, p 77 lines 22-31, p 78 lines 1-12.Given all this evidence, I accept the submission by the plaintiffs that, by 13 September 2019, the Wine Business Sale had become unconditional and a sale of SAIS’s assets had taken place. 59The next issue is whether the Wine Business Sale constituted a transaction where there was a sale of “all or substantially all of the assets, rights or properties of [SAIS] and its Subsidiaries on a consolidated basis” (perArt Art 1.1(i)(ii) of the RSU Plan) to the Buyers.  In their evidence, both of the defendants’ witnesses, Mr Chiarugi and Mr Gouw, denied that there had been a sale of substantially all of the assets of SAIS.  However, I find their evidence in this regard to be rather problematic for several reasons. 60When the first defendant issued the notice of the Shareholders’ Meeting, which was held for its shareholders to,inter alia, consider and approve the Wine Business Sale, an information circular about the transaction (“the Information Circular”) was sent to the shareholders at the same time.94Foot Note 94×Mr Gouw’s AEIC at pp 486-538.The Information Circular described the Wine Business Sale in some detail, including its commercial rationale and the various steps that had to be taken within the Sarment Group to effect the sale. 61The Information Circular stated that the first defendant’s wine and spirits distribution business (defined as “Transferred Business” in the circular)95Foot Note 95×Mr Gouw’s AEIC at p 486.that is to be transferred to Sarment Wines “materially consists ofall fixed assetsof the [first defendant], except for certain non-wine assets (predominantly computer equipment, certain trademarks and other intangible assets) from the … wine and spirits distribution business” [emphasis added].96Foot Note 96×Mr Gouw’s AEIC at pp 511-512.It also stated that the wine and spirits distribution business represented approximately 99.1% of the first defendant’s revenue for the year ending 31 December 2018, and 95.7% of the same for the period ending 31 March 2019.97Foot Note 97×Mr Gouw’s AEIC at p 512.There was also a part of the Information Circular which dealt with the “Risks of Proceeding with the Transaction”, which included the following portion:98Foot Note 98×Mr Gouw’s AEIC at p 531. Substantial part of the Assets and Revenue of the Company would be Sold Upon the completion of the Transaction, the Company will lose a substantial part of the assets and revenue of the Company.  The future success of the Company will be dependent on ‘KADDRA’, its CEM platform, and digital media and services, all of which are at an early stage of commercialization with the Company having operated these services for a relatively short period of time.  There is limited financial, operational and other information available from which to evaluate the prospects of the Company following completion of the Transaction.  There can be no assurance that the Company’s operations will be profitable in the future or will generate sufficient cash flow to satisfy its working capital requirements. This was a reference to the fact that the traditional business of the Sarment Group was its wine and spirits distribution business and, with the disposal of that business, the group was now left to focus on its technology and e-commerce business, which was then only at its infancy.  Hence, there was reference to “KADDRA”, which was the group’s Customer Experience Management or “CEM” online platform. 62Given the above, it cannot be seriously disputed that the Wine Business Sale disposed of substantial assets of the first defendant.  Indeed, Mr Chiarugi’s oral evidence is consistent with this.  When he was referred to the portion of the Information Circular on “Risks of Proceeding with the Transaction” (see [61] above), he agreed that most of the inventory (of wines) held by the Sarment Group would have been disposed of through the Wine Business Sale.99Foot Note 99×Transcript, 22 Sep, p 139 lines 30-31, p 140 line 1.He believed that the sale of the wine inventory would be regarded by the shareholders as a sale of substantial assets of the first defendant.100Foot Note 100×Transcript, 22 Sep, p 140 lines 2-4.That was why this risk factor was specifically flagged out in the Information Circular.101Foot Note 101×Transcript, 22 Sep, p 140 lines 4-7.Nevertheless, Mr Chiarugi insisted that the Wine Business Sale did not constitute a removal of most of the assets of the first defendant because the company still had KADDRA, which is also “worth … millions of dollars”.102Foot Note 102×Transcript, 22 Sep, p 140 lines 11-13. 63The thrust of Mr Chiarugi’s evidence is that, even if the completion of the Wine Business Sale disposed of substantial assets of the first defendant, it nevertheless still had other assets associated with KADDRA, and so the Wine Business Sale did not constitute a sale of “all or substantially all of the assets” of the first defendant within the meaning of Art 1.1(i)(ii) of the RSU Plan.  Given the public statements of the first defendant in relation to the transaction, I find that the evidential burden was on the defendants to show that the value of the assets which remained with the first defendantafterthe Wine Business Sale were such that the sale of its wine and spirits business (which was undisputedly a substantialasset) nevertheless did not constitute a sale of “all or substantially all of the assets” of the first defendant.  However, in these proceedings, the defendants have not provided any evidence on the assets that remained with the first defendant after the Wine Business Sale and what their actual financial worth might have been.  More specifically, there was no evidence as to the actual financial worth of the assets associated with KADDRA (such as its intellectual property, goodwill or any value associated with the CEM online platform).  In any case, I find that the commercial value associated with KADDRA’s assets at that time could not have been significant relative to the value of the wine and spirits distribution business given that the development of KADDRA was in its infancy and its prospects remained uncertain.  That was the very reason it had been pointed out in the Information Circular that there can be “no assurance” that the first defendant’s operations, which would have involvedonlyKADDRA and its related services following the Wine Business Sale, “will be profitable in the future or will generate sufficient cash flow to satisfy its working capital requirements”. 64I therefore find that the Wine Business Sale was a sale of “all or substantially all of the assets” of SAIS within the meaning of Art 1.1(i)(ii) of the RSU Plan.  I am also reinforced in this conclusion by two further points.  First, it is not in dispute (as the terms of the Information Circular which I referred to earlier at [61] make clear) that following the Wine Business Sale, KADDRA was the only remaining potential revenue-generating business of SAIS.  The wines and spirits distribution business had accounted for 95.7% of SAIS’s revenue for the period that ended in March 2019.  Therefore, from a commercial and business risk perspective, it is difficult to regard the Wine Business Sale, which removed from SAIS itsonlyreliable revenue-generating business that had accounted for almost theentiretyof its revenue, as anything but a sale of “all or substantially all of the assets” of SAIS.  Second, and as the plaintiffs pointed out, there was also an 86% difference in the book value of the assets of SAIS and its subsidiaries before and after the closing of the Wine Business Sale on 13 September 2019 - the unaudited consolidated financial statements of SAIS for the period ending 30 September 2019 record that the total asset value of SAIS and its subsidiaries was US$13.071m as at 31 December 2018, and US$1.866m as at 30 September 2019.103Foot Note 103×SOC at para 24; Mr Hardman’s AEIC at para 34 and p 292; PCS at para 44. 65Within the SAIS Group itself, it appears that the senior management of the company did consider the completion of the Wine Business Sale on 13 September 2019 as an event that triggered a Change of Control.  In an email dated 6 September 2019, Mr Chiarugi was advised by Mr Gouw that all the RSUs that had been granted to the SAIS Group’s employees would vest “when we close the Sale, sometime next week”.104Foot Note 104×Agreed Bundle of Documents (“ABOD”) at p 481.That was a reference to the Wine Business Sale.  When Mr Gouw was cross-examined, he tried to explain that what he meant was that a Change of Control event would only take place when Mr Irwin acquired his controlling stake in SAIS.105Foot Note 105×Transcript, 23 Sep, p 49 lines 27-31, p 50 lines 11-23, p 51 lines 8-25.I cannot accept this attempt by Mr Gouw to distance himself from the clear words of his email.He was intimately involved in the corporate restructuring exercise, and knew precisely when the Wine Business Sale would take place and when Mr Irwin would become the new controlling shareholder of SAIS. 66I find that the senior management of SAIS did act on the basis that the completion of the Wine Business Sale on 13 September 2019 would constitute a Change of Control event which had the effect of vesting the RSUs that had been awarded to the SAIS Group’s employees.  In fact, this very position was communicated to Mr Hardman.  In Ms Bong’s email to him on 13 February 2020, she set out, amongst other things, a summary of the position in relation to his awarded RSUs and stated “2/3 has vested due to change of control with Wine sale”.106Foot Note 106×Mr Hardman’s AEIC at pp 417-418.Mr Gouw was copied in this email, and he does not appear to have sent any follow up email to correct this. 67In my judgment, the completion of the Wine Business Sale on 13 September 2019 constituted a Change of Control event under Art 5.3 of the RSU Plan.  I move on now to consider the implications of that event in relation to the plaintiffs’ awarded RSUs that had yet to vest.",
        "The impact of a Change of Control on the plaintiffs’ awarded but unvested RSUs": "",
        "Mr Hardman’s RSUs awarded in March 2019": "68The contest between the plaintiffs and the defendants is whether Art 4.3 of the RSU Plan would continue to apply even when a Change of Control event under Art 5.3 has already taken place.  In their closing submissions, the defendants argue that, while the Change of Control might cause the awarded RSUs to vest immediately on the date of the event, they still retain the option under Art 4.3 of “settling” the vested RSUs by either purchasing shares in the open market or by issuing Treasury Sharesby the end of the third year following the year of the grant of the RSUs.  I note that this was a departure from their pleaded defence, which was that Mr Hardman’s awarded RSUs vested according to the scheduled vesting dates (see [13] above), and so the Outstanding RSUs did not vest until sometime in August 2020, even if the Change of Control event took place in September or October 2019 (see [43] above).107Foot Note 107×D&CC at paras 13 and 23.The plaintiffs, on the other hand, argue that Art 5.3 is a specific provision that must take precedence over the general position set out in Art 4.3, and that the shares due to them pursuant to any awarded but unvested RSUs must be provided at the time of the occurrence of the Change of Control event,ie, 13 September 2019. 69In my judgment, the defendants’ position in their pleaded defence is an entirely untenable one to take.  It is clear from a plain reading of Art 5.3 (as set out at [37] above) that it governs what must happen when a Change of Control event occurs.  In such a situation, as Art 5.3 provides, “allRSUs shall be deemed to havevestedimmediately prior to the occurrence of the Change of Control” [emphasis added].  As such, all the awarded but unvested RSUs of Mr Hardman must be taken to have vested immediately prior to 13 September 2019, which I have found is the date of the Change of Control event (see [67] above).  This is regardless of the scheduled vesting dates set out in the RSU Agreement Form executed by Mr Hardman on 29 March 2019. 70Article 5.3 goes on to provide that the deemed vested RSUs “shall becomepayable effective immediatelyon such date” [emphasis added].  The date referred to is the one on which the Change of Control event has occurred.  In my view, this makes it crystal clear that the defendants do not have any option (which they otherwise had under Art 4.3) to defer the actual purchasing of shares for, or issuing of shares to, Mr Hardman.  The defendants must do soimmediatelyon the occurrence of the Change of Control event.  It did not suffice for the defendants to issue SAIS shares to Mr Hardman pursuant to the Outstanding RSUs only on 21 September 2020, more than a year after the Change of Control event. 71To underline the point that SAIS must take immediate steps to ensure that the SAIS Group’s employees’ awarded RSUs and the corresponding shares are made available to the employee upon the Change of Control event, Art 5.3 actually goes further to provide that, to the extent that SAIS is involved in a transaction where the occurrence of the Change of Control is dependent on actions to be taken by SAIS, the company must ensure that all entitlements relating to those RSUs deemed vested by Art 5.3 are paid to the RSU Plan’s participantsconcurrently with and asa conditionprecedent of any such transaction. 72The defendants’ case, as set out in their closing submissions, that they had, pursuant to Arts 4.3 and 4.6 of the RSU Plan, up to three years from the date of the grant to “settle” RSUs notwithstanding the occurrence of the Change of Control event (see [46] above), does not accord with a proper interpretation of the RSU Plan.  I will explain how I came to this view shortly, but let me say something first about the defendants’ own evidence on this issue of when the awarded RSUs vested and when the corresponding SAIS shares were to be provided to the participants of the RSU Plan. 73From my review of the evidence that emerged under the cross-examination of their witnesses, I find the conduct of the defendants at the material time to be quite inconsistent with the various positions that they have put forward in these proceedings.  I have already referred to the internal position taken by the senior management where Mr Gouw had advised Mr Chiarugi that the awarded RSUs would vest upon the close of the Wine Business Sale (see [65] above).  I have also referred to the email sent by Ms Bong to Mr Hardman, copied to Mr Gouw, in February 2020, where Mr Hardman was informed that two-thirds of his RSUs (corresponding to the Outstanding RSUs) had vested upon the close of the “Wine sale” (see [66] above).  The fact that the defendants saw these RSUs as vesting on the closing of the Wine Business Sale, and not pursuant to the vesting schedule that had been set out in the respective RSU Agreement Forms signed by the SAIS Group’s employees (see,eg, [10] and [13] above), contradicted their pleaded defence (see [43] above) and showed their recognition that Art 5.3 was the operative provisionvis-à-visthese employees’ entitlement to their outstanding RSUs once the Wine Business Sale was completed.  As will be explained further (see [78]-[86] below), the defendants were also operating under the assumption that, upon vesting, SAIS had an obligation to issue the corresponding shares to Mr Hardman. 74The oral evidence of the defendants’ witnesses showed up the irreconcilable inconsistencies in their case.  Mr Chiarugi gave evidence that he knew that the awarded but unvested RSUs of the employees would immediately vest and become payable the moment the Change of Control event took place.108Foot Note 108×Transcript, 22 Sep, p 39 lines 20-26, p 118 lines 13-17.He agreed that the shares should be provided to the employees at the time of the closing of a transaction which constitutes a Change of Control event.109Foot Note 109×Transcript, 22 Sep, p 118 lines 18-22.In other words, his own evidence contradicted the defendants’ position at the trial and in their closing submissions that SAIS shares did not have to be provided to Mr Hardman on 13 September 2019 (which I have found to be the date the Change of Control event occurred). 75In his oral evidence, and contrary to the defendants’ pleaded defence, Mr Gouw accepted that the awarded but unvested RSUs would vest on the date when the Change of Control event occurred, but he attempted to draw a distinction between the time of the vesting of the awarded RSUs and their “settlement” for the purposes of Art 5.3.  Mr Gouw’s position was that the Change of Control event occurred on 15 October 2019,110Foot Note 110×Transcript, 23 Sep, p 25 lines 19-24, p 26 lines 6-11.when Mr Irwin became the owner of more than 50% of SAIS’s shares.  Leaving aside the question of the date on which a Change of Control occurred, the point being made by Mr Gouw was that there was no requirement for these vested RSUs to be “settled” or “paid” immediately on the occurrence of the Change of Control event.111Foot Note 111×Transcript, 23 Sep, p 26 lines 12-21.In their closing submissions, the defendants take up this new but unpleaded point raised by Mr Gouw and say that SAIS had up to three years from the date of the grant to ensure that these vested RSUs were “settled” or “paid” (see [44]-[46] above). 76I reject this interpretation of the RSU Plan.  It is plainly inconsistent with the unambiguous terms of Art 5.3, which uses the word “immediately” twice, in terms of both vestingandpayment (see [69]-[70] above).  The use of the term “settling” is found in Art 4.3, and it is used in the context of SAIS having a choice of purchasing shares in the open market or issuing Treasury shares to “settle” its obligation of providing shares to the RSU Plan’s participants pursuant to their vested RSUs.  The use of the term “settle” is no more than a description of the manner in which SAIS can fulfil its obligation to provide shares to the RSU Plan’s participants.  It does not tell us aboutwhenSAIS is required to fulfil this obligation.  The timeline for the fulfilment of this obligation is instead set out by the remaining terms of Art 4.3 (apart from “settling”) itself.  That timeline, however, can have no effect on the first defendant’s obligations under Art 5.3.  I have already rejected the contention that the timeline in Art 4.3 applies to a situation involving a Change of Control event contemplated in Art 5.3 (see [69]-[70] above). 77The use of the word “payable” in Art 5.3, in my view, simply refers to the act of providing SAIS shares to the RSU Plan’s participants.  That this is the proper interpretation is borne out by the use of “payable” in a similar fashion in Art 4.6.  In the context of Art 5.3, that is expressed as something that must be done “immediately” upon the occurrence of the Change of Control event (see [70] above).  As such, there is really no basis for Mr Gouw to draw a distinction between the time of vesting of the awarded RSUs and their “payment” which he says will come much later. 78In fact, it became quite apparent from the evidence of both Mr Chiarugi and Mr Gouw as to what had been operating on their minds when they delayed the issuance of shares to Mr Hardman, instead of immediately doing so on the closing of the Wine Business Sale, which they knew they were required to do. 79Under cross-examination, Mr Chiarugi explained that, while he was aware all the unvested RSUs would vest upon a Change of Control and that SAIS should provide the shares to the RSU Plan’s participants immediately,112Foot Note 112×Transcript, 22 Sep, p 39 lines 20-25, p 40 line 14.it turned out that it was not possible to give the shares to Mr Hardman at that time.  He explained that there were “laws and regulations” of Singapore and Canada that SAIS had to comply with,113Foot Note 113×Transcript, 22 Sep, p 40 lines 14-23.but he gave no evidence of what these “laws and regulations” were that prevented SAIS from complying with its contractual obligation under Art 5.3 of the RSU Plan to give the shares to Mr Hardman on 13 September 2019. 80In both their affidavits of evidence-in-chief, Mr Chiarugi and Mr Gouw explained that, according to the constitution of SAIS, the issuance of new shares had to be approved by an ordinary resolution of its shareholders.114Foot Note 114×Mr Chiarugi’s AEIC at para 78; Mr Gouw’s AEIC at para 78.The senior management of SAIS had intended to obtain the required shareholders’ approval for the issuance of new shares to fulfil SAIS’s obligation under the RSU Plan at an AGM that was held on 29 July 2019.115Foot Note 115×Mr Chiarugi’s AEIC at para 78; Mr Gouw’s AEIC at para 78.However, Mr Chiarugi and Mr Gouw say that SAIS’s company secretary “erroneously omitted” to include the required shareholders’ approval for the issuance of new shares as an action item when the notice of AGM was issued.116Foot Note 116×Mr Chiarugi’s AEIC at para 79; Mr Gouw’s AEIC at para 79.I note that it is not in evidence before me that there had been any other AGM in or around that period save for the Shareholders’ Meetings on 30 August 2019, the notice of which was issued on 29 July 2019 (see [21] above).  So, the reference to an AGM held on 29 July 2019 in Mr Chiarugi’s and Mr Gouw’s affidavits of evidence-in-chief might have been an error.  In any event, in his oral evidence, Mr Gouw explained that the mandate given to the board of SAIS for the issuance of new shares pursuant to vested RSUs had to be renewed every year, but the lawyers which were advising SAIS on the restructuring of the group did not realise this.117Foot Note 117×Transcript, 23 Sep, p 46 lines 24-26, p 47 lines 7-9.As a result, the required resolution was not found in the notice for the AGM supposedly held on 29 July 2019. 81SAIS was then advised by the company secretary and its legal counsel that the earliest time an EGM could be convened to obtain the requisite shareholders’ approval was in November 2019.118Foot Note 118×Mr Chiarugi’s AEIC at para 79; Mr Gouw’s AEIC at para 79.So, the senior management of SAIS decided to hold an EGM on 6 November 2019 to obtain shareholders’ approval for the issuance of new shares.119Foot Note 119×Mr Chiarugi’s AEIC at para 94; Mr Gouw’s AEIC at para 94.However, while Mr Chiarugi and Mr Gouw both say that the requisite shareholders’ approval was obtained at that EGM in November 2019,120Foot Note 120×Mr Chiarugi’s AEIC at para 94; Mr Gouw’s AEIC at para 94.it appears that no new shares were issued then or before the end of 2019 to Mr Hardman in respect of the Outstanding RSUs, which Mr Gouw accepts in his oral evidence as having vested on 15 October 2019 (see [75] above).121Foot Note 121×Transcript, 23 Sep, p 51 lines 7-9, p 68 lines 14-20.Mr Gouw attributes SAIS’s omission to issue these shares to the senior management’s plans to take the company private,ie, delist its shares from the TSX-V.122Foot Note 122×Transcript, 23 Sep, p 71 lines 7-11.That idea, according to Mr Gouw (as well as Mr Chiarugi) had been under consideration by SAIS’s management since December 2019.123Foot Note 123×Mr Chiarugi’s AEIC at para 89; Mr Gouw’s AEIC at para 89.The application to delist SAIS was eventually filed in February 2020 (see [32] above).  Mr Gouw explained that, while SAIS’ delisting application was under consideration by the TSX-V, it was not allowed to issue any new shares pursuant to vested RSUs.124Foot Note 124×Transcript, 23 Sep, p 71 lines 11-15. 82Thereafter, Mr Chiarugi explained that the senior management of SAIS was busy with the process of migrating SAIS’s issued shares to Singapore, which followed from the delisting of its shares from TSX-V on 17 March 2020.125Foot Note 125×Transcript, 22 Sep, p 95 lines 19-25.This required the approval of SAIS’s shareholders, which was obtained at the AGM held in August 2020.126Foot Note 126×Transcript, 22 Sep, p 95 lines 30-31, p 96 lines 1-2.Consequently, it was only in September 2020 when SAIS could issue new shares to Mr Hardman, both in respect of the Outstanding RSUs and the 72,590 RSUs representing the 2018 Bonus.127Foot Note 127×Transcript, 22 Sep, p 96 lines 2-4. 83I make several observations about the defendants’ explanations for their failure to provide the SAIS shares to Mr Hardman on 13 September 2019, as they were otherwise required by Art 5.3. 84First, even if I accept the defendants’ explanation about the need to renew the shareholders’ mandate to the board for the issuance of new shares, it is unclear to me whether this is the reason they had been unable to issue shares to Mr Hardman pursuant to their obligations under Art 5.3.  Insufficient documentary evidence has been placed before the court as to the content of this mandate and when exactly it expired, as to show that it was the failure to renew this mandate at the supposed 29 July 2019 AGM that had been responsible for the defendants’ subsequent omission to issue Mr Hardman’s shares.  Also, there has not been a satisfactory explanation as to how, in spite of the alleged lack of mandate (which was only later obtained at the EGM in November 2019), SAIS was somehow able to issue Mr Hardman 66,540 SAIS shares on 4 October 2019, which corresponds to the first one-third of Mr Hardman’s awarded RSUs that vested on 21 August 2019 (see [28] above). 85Second, the defendants have not pleaded any defence in law that arises out of these facts and circumstances concerning the lack of a shareholders’ mandate, or the inability to issue new shares because of the delisting of SAIS from the TSX-V and the subsequent migration of its shares to Singapore.  Thus, strictly speaking, these facts and circumstances are not relevant matters that the court should consider in deciding whether the defendants have a good defence to Mr Hardman’s claim that there had been a breach of contract because of SAIS’s failure to provide him with the requisite number of SAIS shares that he became entitled to on the date of the Change of Control,ie, 13 September 2019. 86Third, it is quite apparent that the defendants had failed to take the required stepsto ensure that SAIS was able to comply with its obligations under Art 5.3 of the RSU Plan to provide Mr Hardman with SAIS shares pursuant to his vested RSUs on 13 September 2019.  Even if the court is prepared to accept that the defendants’ omission was the result of the lack of a share mandate, that is not a defence to Mr Hardman’s claim for breach of contract.  A contractual obligation must be complied with strictly (see,eg, Edwin Peel,Treitel on The Law of Contract(Sweet & Maxwell, 14th Ed, 2015) (“Treitel”) at para 17-065).  It is generally immaterial why a defendant has failed to fulfil his contractual obligations in a claim for breach of contract, and it is no defence to plead that he has done his best (seeRaineri v Miles[1981] AC 1050 at 1086).  A supervening event can only provide a party with an excuse for non-performance if it occurs without the fault of the party relying on it (Treitelat para 17-070).  The failure to comply with a contractual obligation because of negligence, lack of attention, or because of poor advice obtained from professional advisers, cannot constitute any legal justification that excuses compliance by the obligor.  Therefore, if indeed it is the case that SAIS could not comply with Art 5.3 by issuing shares to Mr Hardman on 13 September 2019 because of a lack of a mandate to issue new shares, that cannot serve as any defence in law because this unfortunate situation was a consequence of its own negligence and/or poor advice obtained from its professional advisers. 87As such, I find that SAIS has breached Art 5.3 of the RSU Plan by failing to provide Mr Hardman 133,079 SAIS shares, which corresponds to the shares which ought to have been provided to him pursuant to the Outstanding RSUs, on 13 September 2019 as required by that clause. 88In this regard, it must be recalled that 66,540 shares were issued to Mr Hardman on 4 October 2019 (see [28] above).  That was pursuant to the first one-third of his awarded RSUs, which had vested on 21 August 2019, asperthe scheduled vesting date in the RSU Agreement Form executed by Mr Hardman on 29 March 2019 (see [13] above).  Despite the late provision of these shares, counsel for the plaintiffs confirmed to the court that Mr Hardman was not making any claim for breach of contract in respect of these 66,540 shares given to him on 4 October 2019, instead of on 13 September 2019.",
        "Mr Finck’s RSUs granted in February 2019": "89In the case of Mr Finck, the difference in his situation in so far as his awarded RSUs are concerned is that his employment at Kaddra was terminated on 6 September 2019.  The defendants submit that this meant that Mr Finck had no legal entitlement to the RSUs awarded to him because the first one-third of his awarded RSUs was only due to vest on 21 September 2019.  The defendants rely on Art 5.1 of the RSU Plan, which provide that: any [RSUs] granted to [the RSU Plan participant] which have not become Vested [RSUs] prior to [the date of the termination of his employment] shall automatically and immediately terminate. 90However, it is clear from the plain wording of Art 5.1 that the automatic termination of Mr Finck’s entitlement to his RSUs is subject to,inter alia, Art 5.3.  The opening words of Art 5.1, which precede the portion quoted above, provide as follows: “[n]otwithstanding the provisions of Article 4 andsubject to the remaining provisions of this Article 5and to any express resolution by the Board …” [emphasis added].  Thus, if Art 5.3 is applicable to Mr Finck, then his entitlement to awarded RSUs would not automatically terminate upon the termination of his employment on 6 September 2019. 91The chronology of events is significant.  As already recounted, in May 2019, SAIS announced that it was exploring the possibility of entering into a transaction for the sale of its wine and spirits distribution business (see [20] above).  On 29 July 2019, SAIS entered into the SPA in relation to Sarment Wines, pursuant to which the Wine Business Sale would be effected (see [21] above).  This sale was subject to certain conditions.  On 30 August 2019, one of the key conditions – that of shareholder approval – was fulfilled.  Before the sale was completed on 13 September 2019, which was when the other conditions of the Wine Business Sale were fulfilled (see [58] above), Mr Finck’s employment was terminated (on 6 September 2019). 92The definition of a Change of Control in Art 1.1(i)(ii) (as set out at [38] above) refers to a sale of SAIS’s assets in “a single transaction or a series of related transactions”.   In my view, the Wine Business Sale was effected through a series of related transactions, as is clear from the terms of the SPA between SAIS and the Buyers.  Also, in connection with the Wine Business Sale, the Buyers had to enter into agreementsinter sefor Mr Irwin to acquire their shareholdings in SAIS.  I find that the series of “transactions” (perArt 1.1(i)(ii)) started on 29 July 2019 with the entering into of the SPA between SAIS and the Buyers, and these series of transactions culminated in the Wine Business Sale being completed on 13 September 2019, which I have already found to be the date when the Change of Control event occurred (see [67] above). 93Mr Finck was still an employee of Kaddra and the SAIS Group when the first of the series of transactions was entered into (namely, SAIS’s entry into the SPA on 29 July 2019), and in my judgment, Art 5.3 was already engaged then.  Art 5.3 draws a distinction between when SAIS’s obligation to ensure immediate vesting and payment of RSUs isengagedand when that obligation falls due forperformance.  The opening words of Art 5.3 (“[i]n theeventof a Change of Control”), read together with the definition of a “Change of Control” in Art. 1.1(i)(ii) (which contemplates a sale of SAIS’s assets giving rise to a Change of Control taking place in a single transaction or a series of related transactions) make it clear that, in cases where the sale of SAIS’s assets occurs through a series of related transactions, SAIS’s obligation in Art 5.3is engaged once thefirsttransaction in the entire series occurs.  On the other hand, the part of Art 5.3 that follows (“all [RSUs] shall be deemed to have vested immediately prior to theoccurrenceof the Change of Control and shall become payable effectively immediately on such date”) shows that this obligation subsequently falls due for performance when the sale of the assetsoccurs,ie, when it is completed.  Accordingly, the fact that the completion of the Wine Business Sale and hence the Change of Control event took place after Mr Finck’s employment was terminated does not take away his legal rights to his RSUs that had accrued conditionally from 29 July 2019 pursuant to Art 5.3.  Those rights became enforceable against SAIS on 13 September 2019 when the last condition precedent was met (namely, the approval from TSX-V for the Wine Business Sale). 94In his oral evidence, Mr Chiarugi agreed with counsel’s suggestion that the transaction involving the Wine Business Sale involved several steps, and all the steps were part of that transaction.128Foot Note 128×Transcript, 22 Sep, p 68 lines 8-12 and 23-30, p 69 lines 1 and 8-14.Mr Gouw agreed that the transaction involving the Wine Business Sale involved “a series of related transactions”, starting with the signing of the SPA, the completion of the sale (as it happened on 13 September 2019) and finally Mr Irwin’s acquisition of a controlling stake in SAIS.129Foot Note 129×Transcript, 23 Sep p 52 line 8, p 56 lines 6-13.Mr Gouw therefore accepts that the transaction involving the Wine Business Sale had startedbeforethe termination of Mr Finck’s employment.  Thus, the evidence of the defendants is consistent with my finding that, whether one views the Wine Business Sale as comprising one transaction with many steps, or a series of related transactions, the process which led to the Change of Control event (the completion of the Wine Business Sale) startedbeforeMr Finck’s employment was terminated.  In my view, it could not possibly have been the intention of SAIS and the RSU Plan’s participants that SAIS could unilaterally extinguish the participants’ legal rights to their awarded but unvested RSUs by simply terminating their employment before the Change of Control event happened.  If the SAIS Group’s employees had no certainty whatsoever over their RSU entitlements, that would be plainly inconsistent with the purposes which the RSU Plan intended to achieve (see [9] above). That would be a commercially absurd result which the parties could not have intended when SAIS granted the RSU awards to the SAIS Group’s employees who accepted them by executing their respective RSU Agreement Forms, like Mr Finck did (see,eg,Soup Restaurant([56] above)at [31]). 95Thus, I find that, even though Mr Finck’s employment was terminated before the Wine Business Sale was completed, his rights to his awarded but unvested RSUs remain governed by Art 5.3 of the RSU Plan.  That means that, on 13 September 2019, Mr Finck should have been provided with 38,260 shares in SAIS, pursuant to all his awarded RSUs which were deemed to vest immediately prior to the completion of the Wine Business Sale.  This is, of course, all subject to whether, on 6 September 2019, Mr Finck had compromised his rights to the remaining two-third of his awarded RSUs,ie, 25,507 RSUs, and only agreed to accept one-third of his awarded RSUs,ie, 12,753 RSUs to be vested on 21 September 2019, by virtue of entering into the Redundancy Agreement with Kaddra (see [27] above).  That is a point which I will deal with later in this judgment (see [111] below).",
        "Mr Hardman’s claim to the 2018 Bonus": "96Mr Hardman claims that, under the terms of his employment with Kaddra, he was entitled to receive his bonus in cash.  From my review of the terms set out in Mr Hardman’s employment contracts, first with SPL dated 28 August 2017 (see [12] above), and then later with Kaddra dated 11 July 2019 (see [16] above), it does appear that he should receive his bonus in cash.  These two contracts provide at the material portion that “[t]he variable bonus entitlement is up to 40% of annual base, upon meeting KPI targets agreed mutually”.130Foot Note 130×Mr Hardman’s AEIC at p 36; ABOD at p 161.The “annual base” is not specifically defined but appears to be based on Mr Hardman’s gross monthly salary, which is expressed in a cash amount, and multiplied by 12 months.  Thus, the fact that the bonus is expressed as up to 40% of a cash amount indicates that the bonus would also be paid in cash, and not in some other form.  That would accord with an interpretation that is consistent with the commercial context of this arrangement between Mr Hardman and Kaddra. 97Be that as it may, the evidence before me shows that, when the issue of the 2018 Bonus was finalised in October 2019, Mr Hardman had entered into the Bonus Agreement with Kaddra and agreed that he could be paid the 2018 Bonus in the form of RSUs (see [29] above).  This was because, at that time, Kaddra simply did not have enough available cash to pay Mr Hardman his bonus.  While Mr Chiarugi did agree under cross-examination that he had quantified Mr Hardman’s bonus with some cash value in mind, and thus the number of RSUs to be awarded must have been decided based on the prevailing market price of the SAIS shares in October 2019,131Foot Note 131×Transcript, 22 Sep, p 128 lines 28-31, p 130 lines 4-8.this does not change the fact that Mr Hardman did agree with Kaddra that he would receive 72,590 RSUs as the 2018 Bonus, and not any cash amount. 98Following from the Bonus Agreement, on 9 December 2019, Mr Hardman was granted 72,590 RSUs.  He executed another RSU Agreement Form on 9 December 2019 for these 72,590 RSUs (see [29] above).  This agreement was with SAIS.  In the agreement, there is no vesting date for these RSUs.  However, the agreement did provide that “[t]he performance period for this grant of RSUs commence[d] on [9 December 2019] and ends at the close of business on 18 March 2020 …”.132Foot Note 132×Mr Hardman’s AEIC at p 391.This suggested to me that SAIS had up to 18 March 2020 to vest these RSUs and provide the corresponding shares to Mr Hardman.  There was some evidence to indicate that Mr Hardman was informed in December 2019 that he would be given these shares by the end of February 2020, to which he expressed no objections. 99The issue of when Mr Hardman would get his 72,590 shares was put to rest in January 2020.  When Mr Hardman resigned from his position in January 2020, Kaddra agreed in writing that his 72,590 RSUs would “be issued and vesting [sic] at end February 2020”.  This was set out in the Resignation Letter, which was executed by Mr Hardman on 29 January 2020 (see [30]-[31] above), and appeared to be part of the payments he would get upon resignation.  As the RSUs had already been granted on 9 December 2019 when Mr Hardman executed the RSU Agreement Form, it must mean that the word “issue” used in the Resignation Letter referred to the issuance of new shares in SAIS, and not the issuance of the RSUs.  In these circumstances, I find that Mr Hardman and Kaddra had agreed in January 2020 that he would be provided his 72,590 SAIS shares pursuant to those vested RSUs by the end of February 2020,ie, 29 February 2020.  In other words, the Bonus Agreement was varied by the parties, when Mr Hardman resigned, to include a date by which Mr Hardman would get his 72,590 SAIS shares.  In fact, I note from the evidence that it is common ground between Mr Hardman and the defendants that Mr Hardman was to be provided with those shares by the end of February 2020.133Foot Note 133×Transcript, 22 Sep, p 123 lines 2-5 and 14-16; 23 Sep, p 114 lines 14-24, p 115 lines 1-13. 100The defendants’ position in this suit is that these 72,590 RSUs vested on or about 13 August 2020 (together with the Outstanding RSUs),134Foot Note 134×D&CC at para 23.and the corresponding shares were issued to Mr Hardman on 21 September 2020, which was the earliest time at which SAIS shares could have been issued to Mr Hardman (see [47] above).  Therefore, it is not in dispute that SAIS did not vest the 72,590 RSUs by the end of February 2020 or provide Mr Hardman with the corresponding shares.  Whether it is because of the lack of a shareholders’ mandate for the issuance of new shares (see [80] above) or that SAIS was not permitted by the TSX-V to issue new shares as plans were already afoot for SAIS to be delisted (see [81] above), it is quite clear to me that Kaddra was in breach of the Bonus Agreement by failing to ensure that Mr Hardman was provided with his 72,590 SAIS shares by the end of February 2020 (ie, 29 February 2020).  This was a repudiatory breach of the Bonus Agreement because it was a failure to give Mr Hardman the subject-matter of what it was agreed he be given by the appointed date. 101Mr Hardman chased several times for these 72,590 shares in the months that followed.  Eventually, his solicitors sent the 17 Jun 2020 Letter to Kaddra (see [33] above) where they communicated his election to accept the repudiatory breach, and to terminate the Bonus Agreement.135Foot Note 135×Mr Hardman’s AEIC at pp 395-396. 102Every breach of contract gives rise to a secondary obligation on the part of the contract breaker to pay monetary compensation to the innocent party for the loss sustained by him in consequence of the breach (Out of the Box Pte Ltd v Wanin Industries Pte Ltd[2013] 2 SLR 363 at [10], citingPhoto Production Ltd v Securicor Transport Ltd[1980] AC 827 at 848-849).  The general aim of damages for breach of contract is to compensate the innocent party for the loss which he suffered by reason of the breach, and place him, as far as a payment of money allows, in the same position as if the contract had been performed (seeTurf Club Auto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal[2018] 2 SLR 655 at [123]-[124]).  Damages are therefore to be assessed by reference to what a plaintiff would have obtained had the contract been performed in accordance with its terms. 103In this case, if Kaddra had performed its end of the bargain under the Bonus Agreement, Mr Hardman would have been provided with the 72,590 SAIS shares by 29 February 2020 at the latest.  As such, Mr Hardman is entitled to damages assessed by reference of the market value of 72,590 SAIS shares as at 29 February 2020. 104I do not accept the plaintiffs’ counsel submission that Mr Hardman would be entitled to claim for cash as the 2018 Bonus, and the amount should be calculated on the basis of some date in October 2019.136Foot Note 136×PCS at paras 138-148.That would be an unprincipled approach which ignores the fact that Mr Hardman had agreed to accept the 2018 Bonus in the form of 72,590 RSUs and to receive the corresponding shares by the end of February 2020.  By entering into the Bonus Agreement, Mr Hardman had thus agreed with Kaddra to vary the terms in his employment contract which otherwise governed the payment of his bonus.  In doing so, Mr Hardman took on the risks and benefits of accepting RSUs in lieu of cash.  Mr Hardman did not reserve his right to seek payment in cash of a specified amount, if he was not given his shares by the end of February 2020, by the inclusion of an appropriate term in the Resignation Letter, which set out the terms and conditions of his resignation from Kaddra (see [31] above).  Since there has been a variation, and no reservation of Mr Hardman’s rights to seek his bonus in any specified cash amount, there is no longer any legal basis for Mr Hardman to seek payment of the 2018 Bonus in cash, based on some date in October 2019. 105The plaintiffs’ counsel submits that Mr Hardman is entitled to such a claim because Mr Hardman has accepted the Kaddra’s breach of the Bonus Agreement and so he is entitled to treat himself as discharged from that agreement.137Foot Note 137×PCS at para 138.While I agree that Mr Hardman’s acceptance of Kaddra’s repudiatory breach, which was communicated to Kaddra by the 17 Jun 2020 Letter, would have brought the Bonus Agreement to an end (see,eg,Orix CapitalLtd v Personal Representative(s) of the Estate of Lim Chor Pee (deceased) and others[2009] 4 SLR(R) 1062at [28]), that does not return the parties to the position as if that agreement had never been made so that Mr Hardman is entitled to claim for the 2018 Bonus in cash pursuant to the terms of his employment contract.  Termination only discharges the parties from all their outstanding obligations under the contract, and the contract breaker’s primary obligation to perform is substituted by a secondary obligation to pay damages, which places the innocent party in the position that he would have beenif the contract had been performed.",
        "The issuance of SAIS shares to Mr Hardman on 21 September 2020": "106I have already found that SAIS was in breach of Art 5.3 of the RSU Plan by failing to give Mr Hardman 133,079 SAIS shares on 13 September 2019, pursuant to his rights to those shares upon the completion of the Wine Business Sale (see [87] above).  Mr Hardman is thusprima facieentitled to damages for this breach.  These damages are to be assessed by references to the market value of these 133,079 shares as at 13 September 2019. 107I have also found that Kaddra was in breach of the Bonus Agreement by failing to ensure that Mr Hardman was provided with 72,590 SAIS shares by 29 February 2020.  He isprima facieentitled to damages for this breach, which I have explained earlier (see [103] above). 108On or about 13 August 2020, SAIS caused the vesting of the remaining two-thirds of Mr Hardman’s awarded RSUs (ie, the Outstanding RSUs), as well as the 72,590 RSUs representing the 2018 Bonus (see [46]-[47] above).138Foot Note 138×D&CC at para 23.On 21 September 2020, it issued 205,669 SAIS shares to Mr Hardman pursuant to these vested RSUs.139Foot Note 139×D&CC at para 27(e); Mr Chiarugi’s AEIC at p 825.Of these, 133,079 shares were issued pursuant to the Outstanding RSUs.  This was in purported compliance with SAIS’s obligations under the RSU Plan.  By this time, Mr Hardman had already filed this suit seeking relief in the form of damages for the failure to give him all his shares pursuant to the Outstanding RSUs by the date of the Change of Control event.  I accept that, by the commencement of this action, Mr Hardman had accepted SAIS’s repudiatory breach of Art 5.3 of the RSU Plan and treated the agreement in relation to those awarded RSUs as at an end. 109The remaining 72,590 shares were issued by SAIS in purported compliance with Kaddra’s obligation under the Bonus Agreement to pay Mr Hardman the 2018 Bonus in RSUs.  I have already dealt with this earlier (see [96]-[105] above).  To recapitulate, I find that the Kaddra was in repudiatory breach of that agreement by failing to ensure that Mr Hardman was provided with those 72,590 SAIS shares by 29 February 2020, and Mr Hardman accepted this repudiatory breach by the 17 Jun 2020 Letter and terminated the Bonus Agreement. 110In so far as any new shares have been issued to Mr Hardman and he has accepted them, then Mr Hardman is required to give credit for the value of those shares.  However, as far as the evidence before me is concerned, it does not appear that Mr Hardman ever accepted those shares as part compensation of the damage he had suffered from the breaches of Art 5.3 of the RSU Plan and the Bonus Agreement.  The defendants certainly did not adduce any evidence that Mr Hardman had accepted those 205,669 shares issued on 21 September 2020.  That being the case, I find that SAIS’s issuance of the 205,669 shares to Mr Hardman did not amount to any part payment to Mr Hardman. 111In any event, the defendants have placed no evidence before me as to the value of these 205,669 SAIS shares as at 21 September 2020.  I appreciate that there would be some difficulty in determining the value of these shares as at that time, given that by 17 March 2020, SAIS was no longer a publicly listed company (see [32] above).  However, the onus is on the defendants to show that the issuance of these shares would reduce the amount of damages that they have to pay Mr Hardman, and their failure to adduce any evidence of the value of these shares meant that I had little option but to attribute a nil value to these shares. 112I should add that the defendants have not taken the position that Mr Hardman is obliged to accept these shares as mitigation of his loss.  In any case, if any such position had been taken, it would not have been sustainable.  While an aggrieved party is under a “duty” to take all reasonable steps to mitigate his loss consequent on the breach of contract and cannot profit or behave unreasonably at the expense of the defaulting party, he is not required to do anything outside of what a reasonable and prudent man would have done in the ordinary course of his business if he had been in the aggrieved party’s shoes, for instance, by acting in a way that exposes himself to financial hazard (The“Asia Star”[2010] 2 SLR 1154at [24], [30] and [31]).  In this case, the 205,669 SAIS shares issued by SAIS on 21 September 2020 were shares in a private limited company, which value was uncertain and could not be readily realised given their lack of marketability.  The acceptance of the 205,669 SAIS shares would not be a reasonable mitigatory step for Mr Hardman to have taken because that would have required Mr Hardman to act against his own commercial interests and it is not something which a reasonable man in his shoes would have done.",
        "Mr Finck’s agreement with Kaddra on 6 September 2019 regarding his redundancy payments": "113The dispute regarding the Redundancy Agreement of 6 September 2019, which sets out Mr Finck’s redundancy payments, is whether it was a term of the agreement that he would be waiving his claims to the remaining two-thirds of his awarded RSUs in exchange for the payments to be made to him, including the vesting of the first one-third of his awarded RSUs on 21 September 2019. 114A review of the terms set out in the 6 Sep 2019 Letter (see [27] above) does not indicate that Mr Finck had given up his claims against SAIS for the remaining two-thirds of his awarded RSUs by agreeing to accept the payments set out in the letter.  One does not see the usual “wavier and release” clause seen in settlement agreements where the parties waive all their other claims against each other apart from what is set out in the agreement.  The evidence of Mr Finck, and that of the defendants, also do not support any conclusion that the two sides had come to a compromise or settlement of any dispute, and that in consideration of these payments to be made to Mr Finck, he would give up his claim against SAIS for the remainder of his awarded RSUs. 115Mr Finck’s evidence is that he was unhappy with the draft redundancy package that had been offered to him.  He was unhappy about the sudden termination of his employment, that it had come so close to when the first one-third of his awarded RSUs would vest (ie, 21 September 2019), and that Kaddra was intending to pay his outstanding bonus and salary by way of instalments (see [26] above).  He conveyed what he was unhappy about to Mr Hardman and Ms Bong, and he mentioned that he would be seeing a lawyer to seek advice on his rights.  Then, later that day, on 5 September 2019, Mr Finck was offered a revised redundancy package, which he accepted.  The terms of this package were set out in the 6 Sep 2019 Letter, nothing more and nothing less.  Mr Finck was of the view that he had reached an agreement with Kaddra as to what he would be paid as part of his redundancy, but there was no settlement reached where he gave up all his outstanding rights against the defendants (specifically,vis-à-visSAIS in connection with the awarded but unvested RSUs).140Foot Note 140×Transcript, 21 Sep, p 57 lines 13-17.In fact, Mr Finck was not even aware at that time that the impending Change of Control event meant that all his awarded RSUs would vest and that he should be given all the corresponding shares.141Foot Note 141×Transcript, 21 Sep, p 45 lines 18-29. 116Mr Chiarugi’s evidence was that there were no real negotiations with Mr Finck because Kaddra agreed to give him whatever he wanted.142Foot Note 142×Transcript, 22 Sep, p 110 lines 14-16.What is clear from Mr Chiarugi’s evidence is that Kaddra did not ask for anything in return from Mr Finck, such as a waiver and release of all his other claims against the defendants.  Under cross-examination, Mr Chiarugi even agreed with counsel for the plaintiffs that Mr Finck did not enter into any agreement on 6 September 2019 pursuant to which Mr Finck would not sue for the rest of his other awarded RSUs.143Foot Note 143×Transcript, 22 Sep, p 120 lines 28-31, p 121 lines 1-2. 117Mr Gouw’s evidence was also not helpful to the defendants.  His impression was that, in the lead up to the agreement on the terms of the Redundancy Agreement, Mr Finck never said that he would not come back and sue the defendants for anything else in relation to his employment, in return for being given the first one-third of his awarded RSUs.144Foot Note 144×Transcript, 23 Sep, p 101 lines 13-18.Mr Gouw expressed the view that it was “implicit” that Mr Finck had given up all his other claims,145Foot Note 145×Transcript, 23 Sep, p 101 lines 22-31, p 102 lines 1-6.though he candidly accepted that it would have been better if there had been an express waiver and release clause in the 6 Sep 2019 Letter.146Foot Note 146×Transcript, 23 Sep, p 102 lines 7-10.In my view, this was as good as an admission that Mr Finck had not compromised his claims against SAIS in relation to the remaining two-thirds of his awarded RSUs. 118In sum, I find that Mr Finck is entitled to damages for breach of Art 5.3 of the RSU Plan in respect of the failure by SAIS to provide him with 38,260 shares on 13 September 2019 when the Change of Control event occurred, pursuant to which all his awarded RSUs were deemed vested immediately prior to that event.  He did not compromise or give up on any of his legal rights in relation to the remaining two-thirds of his awarded RSUs by the Redundancy Agreement on 6 September 2019.  Further, in so far as the 6 Sep 2019 Letter recorded that the first one-third of Mr Finck’s awarded RSUs would vest on 21 September 2019 asperthe schedule set out in the grant of 28 February 2019 (see [10] above), it did no more than simply oblige Kaddra to procure the maintenance by SAIS of the first one-third of Mr Finck’s RSUs, and the existing obligations in respect of those RSUs.  When the Change of Control event then occurred on 13 September 2019,all of Mr Finck’sawarded RSUsvested immediately prior to that event, and the corresponding shares should have been provided to him according to Art 5.3 of the RSU Plan on 13 September 2019.",
        "Did Kaddra breach the Redundancy Agreement by failing to ensure Mr Finck’s 12,753 RSUs vested on 21 September 2019 and that the corresponding shares were provided to him?": "119Given my findings above in relation to Mr Finck’s rights to all his awarded RSUs following the completion of the Wine Business Sale on 13 September 2019 pursuant to Art 5.3 (see [95] and [118] above), it is not strictly necessary for me to express any view on the events that transpired in relation to the first one-third of his awarded RSUs,ie, 12,753 RSUs, which Kaddra had agreed (as a term of the Redundancy Agreement) to ensure vested on 21 September 2019, and for the corresponding shares to be provided to Mr Finck.  Nevertheless, it may be useful for me to set out my findings on this issue. 120Each side blamed the other for the shares not being issued to Mr Finck as promised.  When Mr Finck was cross-examined, he agreed that he had not opened a brokerage account at that time to receive those 12,753 SAIS shares.147Foot Note 147×Transcript, 21 Sep, p 60 lines 16-23.His explanation is that he did not know that he had to open a brokerage account and inform the TSX-V of the details of his brokerage account in order to receive the shares.148Foot Note 148×Transcript, 21 Sep, p 60 lines 20-31, p 61 lines 1-14.Counsel for the defendants then informed the court that Mr Finck was required to provide his brokerage account details in a form that TSX Trust was supposed to have sent him.149Foot Note 149×Transcript, 21 Sep, p 70 lines 30-31, p 71 lines 1-6.In response, Mr Finck explained that he did not receive any form from TSX Trust, and he also did not know that he had to follow up with TSX Trust to get such a form.150Foot Note 150×Transcript, 21 Sep, p 75 lines 4-14, p 76 lines 9-13. 121I noted that what counsel for the defendants had informed the court about the procedures for the shares to be issued to Mr Finck was a statement from the bar and not properly supported by any clear evidence from the defendants.  What is worse is when Mr Gouw, the defendants’ CFO, was cross-examined.  He explained that all that was needed for the shares to be issued to Mr Finck, when SAIS was still a publicly listed company on the TSX-V, was Mr Finck’s email and address.151Foot Note 151×Transcript, 23 Sep, p 83 lines 21-26.Mr Gouw accepted that Mr Finck had provided such information to the defendants.152Foot Note 152×Transcript, 23 Sep, p 86 lines 1-4.Eventually, Mr Gouw conceded that the reason Mr Finck was not issued his 12,753 shares in September 2019 was because of the lack of a shareholders’ mandate for SAIS to issue new shares.153Foot Note 153×Transcript, 23 Sep, p 95 lines 2-7. 122In my judgment, it is quite clear that the defendants have not coherently explained why Mr Finck’s 12,753 SAIS shares was not provided to him as promised in the Redundancy Agreement set out in the 6 Sep 2019 Letter.  Whatever reasons have been proffered are either unsupported by evidence or do not provide any legal justification for the failure to give Mr Finck what he was contractually entitled to, even if one is to completely leave aside the issue of the Change of Control event and its impact on Mr Finck’s awarded RSUs.  As such, if I am wrong about Mr Finck’s entitlement to all his awarded RSUs and the corresponding shares on 13 September 2019, I find that Kaddra has breached the Redundancy Agreement by failing to ensure that Mr Finck was provided with 12,753 SAIS shares on 21 September 2019, or any time thereafter.",
        "Have the defendants established their counterclaim against Mr Hardman for breach of his duties?": "123The evidence as to Mr Hardman’s conduct in handling the redundancy package for Mr Finck’s departure appears fairly innocuous.  He informed Mr Finck on 5 September 2019 about the termination of his employment.154Foot Note 154×Mr Hardman’s AEIC at para 65.Mr Finck expressed his unhappiness about various matters, and he informed Mr Hardman (and Ms Bong, who was also present at that meeting) that, amongst other things, he wanted the first one-third of his awarded RSUs that were due to vest on 21 September 2019 (see [26] above).  Mr Hardman then passed all this information to Mr Chiarugi and Mr Gouw, including the fact that Mr Finck had said that he would see a lawyer for advice on his rights.155Foot Note 155×Mr Hardman’s AEIC at paras 66-68.Mr Hardman did not express any view on Mr Finck’s demands.156Foot Note 156×Transcript, 20 Sep, p 86 lines 5-13.He left it to Mr Chiarugi and Mr Gouw to decide whether to accede to Mr Finck’s demands.157Foot Note 157×Transcript, 20 Sep, p 87 lines 16-21 and 29-31, p 88 line 1.Mr Hardman gave evidence that, at that time, he was not thinking about his own RSU entitlements or his 2018 bonus, which had not been finalised then.158Foot Note 158×Transcript, 20 Sep, p 88 lines 8-13, p 89 lines 18-31. 124The defendants’ pleaded case on their counterclaim is premised on Mr Hardman being in a position of conflict of interest.  But, I am unable to discern what was the alleged conflict of interest on the part of Mr Hardman at that material time.  It was never properly explained by the defendants, even in their closing submissions, what was the nature of this supposed conflict of interest.  Apart from this, it also appears to me from the oral evidence of Mr Chiarugi and Mr Gouw that the defendants are suggesting that Mr Hardman knew on 6 September 2019 that Mr Finck would later sue the defendants for all his RSUs, but that he withheld this information from the defendants, presumably because he was in a position of conflict of interest.159Foot Note 159×Transcript, 22 Sep, p 47 lines 26-30, p 48 lines 1-25; 23 Sep, p 129 lines 2-26. 125The defendants gave no evidence of any dispute that they were having with Mr Hardman as at 5 or 6 September 2019.  In fact, Mr Chiarugi agreed that the defendants did not have any dispute with Mr Hardman at that time.160Foot Note 160×Transcript, 22 Sep, p 44 lines 24-30, p 63 lines 21-30.While it was true that Mr Hardman was asking for his 2018 bonus, Mr Chiarugi was of the view that it was fair for Mr Hardman to be pursuing the payment of his bonus.161Foot Note 161×Transcript, 22 Sep, p 45 lines 1-6.He also explained that the defendants had decided that it was going to pay Mr Hardman a bonus and it was just a question of when they would do it.162Foot Note 162×Transcript, 22 Sep, p 45 lines 7-11.When pressed on in cross-examination to explain why the defendants took the view that Mr Hardman was in a position of conflict of interest, Mr Chiarugi testified that he thought that Mr Hardman had reason to believe on 6 September 2019 that Mr Finck would later sue the defendants for all his RSUs, but he also agreed that he was merely making an assumption about Mr Hardman’s state of mind.163Foot Note 163×Transcript, 22 Sep, p 49 lines 24-30, p 50 lines 1-5. 126Mr Gouw’s evidence is similar.  He agreed with counsel’s suggestion that Mr Hardman was not in any position of conflict of interest, when the latter was handling the discussions with Mr Finck regarding his redundancy package.164Foot Note 164×Transcript, 23 Sep, p 120 lines 15-16.Mr Gouw’s evidence was also that, looking at the fact that Mr Hardman and Mr Finck later commenced this suit, he thinks that “maybe” Mr Hardman knew that Mr Finck always harboured the intention to sue the defendants.165Foot Note 165×Transcript, 23 Sep, p 121 lines 14-19.He accepted that this was just a “hunch”, and he had no evidence to show that Mr Hardman knew then that Mr Finck would later decide to sue the defendants.166Foot Note 166×Transcript, 23 Sep, p 121 lines 23-26. 127In my judgment, the evidence adduced by the defendants falls far short of showing the Mr Hardman had breached his duties when he was dealing with Mr Finck’s redundancy package.  In fact, the evidence showed that Mr Hardman was simply acting as a conduit for demands and offers to be passed between the senior management and Mr Finck.  There is no evidence that he attempted to influence the terms of the Redundancy Agreement that was eventually offered to Mr Finck.  There is no evidence also that he was in a position of conflict and could not discharge his duties as an employee of the defendants properly and faithfully. 128I also do not accept the defendants’ speculative assertion that Mr Hardman knew of Mr Finck’s intentions to sue all along, and that he withheld this information from the defendants.  It is quite clear from Mr Finck’s evidence and his conduct that he never thought, at that time, about suing for the SAIS shares corresponding to the remaining two-thirds of his awarded RSUs which were not the subject of the Redundancy Agreement.  In fact, on 9 September 2019, Mr Finck wrote an email to Mr Gouw expressing his gratitude to the latter for the terms that had been agreed to in the Redundancy Agreement and apologised that he “had to threaten legal actions [sic] to get this done”.167Foot Note 167×Mr Gouw’s AEIC at p 441.That makes it clear that Mr Finck never intended to take legal action when negotiating the terms of the Redundancy Agreement.  This is also consistent with Mr Finck’s oral evidence that he neither sought nor intended to seek legal advice after being informed of his termination on 5 September 2019, but only told Mr Hardman and Ms Bong that he was seeking legal advice on his options as a negotiation tactic (see [26] above).168Foot Note 168×Transcript, 21 Sep, p 47 lines 9-17, p 51 line 31, p 52 lines 1-11.His evidence was that it was only much later, after receiving legal advice, that he realised that he had such a claim for his other RSUs.169Foot Note 169×Mr Finck’s AEIC at para 64.I accept that evidence as being truthful.  As such,a fortiori, Mr Hardman could not have held back any material information about Mr Finck’s intentions from the defendants. 129For these reasons, I find that there is no basis for the defendants’ counterclaim against Mr Hardman.",
        "Damages": "130As at 13 September 2019 and 29 February 2020, SAIS was still a listed company on the TSX-V and the market value of its shares at those times can be derived from its closing prices on the TSX-V.  SAIS shares closed at CAD 2.00 on 13 September 2019 and CAD 0.13 on 28 February 2020 (29 February 2020 being a Saturday).170Foot Note 170×Mr Hardman’s AEIC at pp 515-517; Mr Chiarugi’s AEIC at pp 755-760.On that basis, the damages which Mr Finck and Mr Hardman are entitled to, in respect of their respective SAIS share entitlements, are as follows (see also [87], [103] and [118] above): Number of SAIS sharesValuation dateMarket price / CADMarket value / CADMr Hardman133,07913 September 20192.00266,158.0072,59028 February 20200.139,436.70Mr Finck38,26013 September 20192.0076,520.00 131On the issue of damages, the defendants have raised an argument that the assessment of the value of any SAIS shares that may have been due to the plaintiffs should take into account the restrictions in Art 4.3 of the RSU Plan.  To recap, there is a portion of Art 4.3 which provides that a RSU Plan participant “shall not transfer, sell or assign [any shares] received” until six months following the settlement of the vested RSUs (see [44] above).  Based on this “moratorium”, with respect to the RSUs granted to the plaintiffs prior to the Change of Control date of 13 September 2019, the defendants argue that the plaintiffs would not have been permitted to monetise the shares pursuant to the RSU grants, even if those shares had been given to them on the occurrence of the Change of Control event, by selling them in the open market until 13 March 2020.  In the same vein, Mr Hardman’s claim for the value of the 72,590 shares, representing the 2018 Bonus, should not be assessed by reference to the market value of the shares as at 29 February 2020, but on 29 August 2020, because of the “moratorium” in Art 4.3. 132As will be recalled, SAIS was delisted from the TSX-V on 17 March 2020 and its last day of trading was on 16 March 2020 (see [32] above).  If the defendants were correct and the “moratorium” in Art 4.3 applied, the market value of those SAIS shares which the plaintiffs should have been provided with on 13 September 2019 would have to be assessed based on the closing price of SAIS shares on 13 March 2020, which was CAD 0.08.171Foot Note 171×Mr Hardman’s AEIC at p 517; Mr Chiarugi’s AEIC at p 759.That means Mr Hardman and Mr Finck would respectively be entitled to CAD 10,646.32 and CAD 3,060.80 in damages in respect of those share entitlements.  On the other hand, there was no evidence before me as to what the value of Mr Hardman’s 72,590 SAIS shares provided in respect of the 2018 Bonus would have been on 29 August 2020.  I appreciate the difficulties Mr Hardman would face in proving the value which those shares would have been worth on that date, given that it represents a small shareholding in a private company.  But, leaving that all aside, I find myself unable to accept the defendants’ contention on the applicability of Art 4.3 to what has happened in this case in the first place.It is quite clear that the “moratorium” in Art 4.3 applies in the typical situation when new shares are given to the RSU Plan’s participant upon the vesting of their RSUs in accordance with the scheduled dates of vesting as set out in the grants.  Where shares are to be provided to plan participants pursuant to Art 4.3, SAIS retains adiscretionas to whenthat will take place, so long as it happens by the end of the third year following the year of the grant of those RSUs which have vested (see [44] above).  On the other hand, where there has been a Change of Control event, Art 5.3 provides that shares must be provided to plan participants pursuant to awarded and vested RSUs “immediately” (see [70] above).  This distinction between Arts 4.3 and 5.3 suggests that where shares are provided to a plan participant on the occurrence of a Change of Control event, he must also be able to realise his RSU entitlements in a timely fashion.  Otherwise, that will make a nonsense of the requirement in Art 5.3 for shares to be provided “immediately”, as opposed to at a time of SAIS’s choosing.  I thus find that Art 4.3 does not apply to the atypical situation where a Change of Control event has occurred.  A more precise or detailed provision like Art 5.3 should override a general or widely expressed provision like Art 4.3, which is inconsistent with it (seeZurich Insurance([56] above) at [131]). 133Likewise, I find it difficult to accept that the Art 4.3 “moratorium” can apply to a situation where shares were promised to be given to an employee by a certain date, as part of the payments due to him upon his resignation from the company, as in the case of Mr Hardman’s 72,590 SAIS shares given for the 2018 Bonus and which should have been provided by the end of February 2020.  Such a situation is similar to one where Art 5.3 applies because the relevant SAIS shares are also to be provided to the employee by a particular time agreed to bybothparties, as opposed to at a time of SAIS’s choosing.  In such a situation, the employee should also be able to realise his RSU entitlements in a timely fashion.  Otherwise, it would have been pointless for parties to have entered into an agreement in the first place for those shares to be provided by a particular date. The “moratorium” in Art 4.3 should therefore also not apply to the SAIS shares that ought to have been given to Mr Hardman by the end of February 2020. 134I should add that it accords with commercial sense and the purpose of the RSU Plan that there should not be any “moratorium” period when a Change of Control event has occurred, or when the RSU Plan participant’s employment has already been terminated.  As a matter of business reality, when there has been a Change of Control, this is often followed by or accompanied with changes being made to the business direction of the company.  It is commonplace that new controllers may decide to bring in new management.  That, in turn, may lead to existing members of management leaving the company or the group.  Given that one of the key underlying purposes of the RSU Plan is to provide the SAIS Group’s employees with a stake in the company in which they are working, it would make business sense that they have the choice of selling off their shares on the occurrence of a Change of Control event.  Being able to monetise their shares by selling them also provides the departing employee with a financial cushion as he moves on to another opportunity, especially if he is leaving because he has been made redundant.  As such, I reject the argument by the defendants (see [50]-[51] above) that the “moratorium” period in Art 4.3 is in any way relevant to the shares that the plaintiffs should have been provided with on 13 September 2019, or 29 February 2020, in the case of Mr Hardman’s 72,590 shares given for the 2018 Bonus.",
        "Conclusion and orders made": "135Although the parties’ submissions have at times referred to the defendants collectively and drew no distinction between the conduct of SAIS and/or Kaddra, it is not the plaintiffs’ pleaded position that the defendants should be jointly and severally liable to them for damages for breach of contract.   In respect of those SAIS shares which the plaintiffs say should have been provided to them on 13 September 2019 under Art 5.3 of the RSU Plan but which were not provided as such (see [87] and [118] above), the plaintiffs pleaded that it is SAIS alone that is liable to pay damages.172Foot Note 172×SOC at paras (1), (3) and (3A) on pp 16-18; SOC at paras (1), (3) and (3A) on pp 19-20.In respect of the 72,590 SAIS shares representing the 2018 Bonus which should have been provided to Mr Hardman by the end of February 2020 under the Bonus Agreement (see [103] above), the plaintiffs pleaded that it is Kaddra alone that is liable to pay damages.173Foot Note 173×SOC at paras (2) and (4) on pp 17-18. 136The plaintiffs’ pleaded position is sensible and appropriate.  Although the SAIS shares were promised to the plaintiffs as part of their employment in SPL/Kaddra, both of which are companies within the SAIS Group, the plaintiffs’ entitlement to be provided with SAIS shares on 13 September 2019 stem from the agreement between themselves and SAIS, as constituted by the RSU Agreement Forms which they have executed, as well as the RSU Plan (and Art 5.3) that is incorporated by those forms.  Kaddra is not a party to that agreement and cannot be made liable for SAIS’s failure to provide shares to the plaintiffs under the terms of that agreement.  On the other hand, in respect of the 72,590 SAIS shares representing the 2018 Bonus, while Mr Hardman’s entitlement to those shares would also stem from a similar agreement between himself and SAIS, his claimto be provided with those shares by the end of February 2020 stems from the Bonus Agreement, in respect of which Kaddrahad undertaken to ensure the same.  It is the latter agreementwhich Mr Hardman relies upon for his claim in the present proceedings, and so only Kaddra (but not SAIS), which is a party to that agreement, can be liable in damages as a result of Mr Hardman not being provided with the 72,590 SAIS shares by the end of February 2020. 137Therefore, for the reasons set out above, I find that: (a) SAIS is liable to pay Mr Hardman CAD 266,158.00 in damages for failing to provide Mr Hardman with 133,079 SAIS shares on 13 September 2019 as it had been required under Art 5.3 of the RSU Plan; (b) Kaddra is liable to pay Mr Hardman CAD 9,436.70 in damages for failing to ensure that Mr Hardman was provided with 72,590 SAIS shares by 29 February 2020 as it had been required under the terms of the Bonus Agreement; and (c) SAIS is liable to pay Mr Finck CAD 76,520.00 in damages for failing to provide Mr Finck with 38,260 SAIS shares on 13 September 2019 as it had been required under Art 5.3 of the RSU Plan. 138For the reasons explained at [123]-[129] above, I dismiss the defendants’ counterclaim against Mr Hardman for his breach of fiduciary duties to the defendants. 139I will deal separately with the issue of interest on the sums owing by the defendants and also on the issue of costs of these proceedings. Ang Cheng HockJudge of the High Court Samuel Richard Sharpe (Sharpe & Jagger LLC) for the plaintiffs; Leong Li Shiong and Goh Peizhi Adeline (Withers KhattarWong LLP) for the defendants.",
        "": ""
    }
}