{
    "case_title": "Affle Global Pte LtdvOSLabs Pte Ltd and another and another matter",
    "ncitation": "[2022] SGHC 65",
    "coram": "Andrew Ang SJ",
    "sections": {
        "Introduction": "1 This dispute was in regard to the validity of resolutions of the first defendant (“OSLabs”) passed at an extraordinary general meeting (“EGM”) on 15 July 2021. The EGM was proposed to,inter alia, “consider and if deemed fit ratify” two earlier resolutions dated 3 and 5 May 2021 (collectively, the “May Resolutions”) for the purchase of shares in OSLabs by the second defendant (“PhonePe”).1Foot Note 1×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 6; pp 396–408 (Notice of the EGM dated 23 June 2021). 2 On or around 3 May 2021, OSLabs circulated a written shareholders’ resolution pursuant to s 184A of the Companies Act (Cap 50, 2006 Rev Ed) (the “Companies Act”) to approve PhonePe’s proposed acquisition of 91.8% of the shares of OSLabs from the then-existing shareholders of OSLabs, including the founders’ and key shareholder’s shares, (the “Proposed Transaction”) pursuant to a term sheet dated 18 March 2021 (the “Term Sheet”),2Foot Note 2×Lee Wen Rong Gabriel’s Affidavit in OS 800 dated 12 August 2021 at p 16 (Statement of Claim (Amendment No 1) in HC/S 449/2021 at para 11); Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 9 and pp 320–326 (Term Sheet dated 18 March 2021).and to confirm that the Proposed Transaction was an “Exit Event” within the meaning of the Shareholders’ Agreement dated 22 June 2020 (the “SHA”) (the “3 May Resolution”).3Foot Note 3×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at p 349 (3 May 2021 Resolution at para 1).Under the SHA, a sale, transfer or disposition of the equity securities of OSLabs which results in achange of controlin OSLabs amounts to an “Exit Event” which may only be passed with the consent of investor shareholders (“Investor Shareholders”) who collectively own and hold at least 60% of the total share capital owned and held by said Investor Shareholders, on a fully diluted basis (the “Majority Investors”).4Foot Note 4×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at p 55–56; 60 and 70 (SHA dated 22 June 2020).Since PhonePe sought to purchase almost all of the shares in OSLabs, the Proposed Transaction amounted to an “Exit Event” under the SHA.5Foot Note 5×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at p 157 (Schedule 3 to the SHA dated 22 June 2020 at para 5). 3 Parties agreed that the 3 May Resolution was signed and approved by 22 shareholders, representing either 72% of the total shares in OSLabs (according to OSLabs) or 69% of the same (according to PhonePe).6Foot Note 6×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 22; Sameer Nigam’s Affidavit in OS 468 dated 27 May 2021 at para 29.The discrepancy is immaterial since the relevant threshold of Majority Investors (ie, at least 60% of the total share capital owned and held by the Investor Shareholders under the SHA) was crossed regardless of which figure was used. 4 On or around 5 May 2021, OSLabs circulated a written shareholders’ resolution pursuant to s 184A of the Companies Act for various matters unrelated to the Proposed Transaction itself. This written resolution was signed by 24 shareholders of OSLabs holding approximately 90% of the total shares therein (the “5 May Resolution”).7Foot Note 7×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 10; Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 23.The 5 May Resolution was proposed to “clear up the pending businesses with regards to the shareholdings of the members” of OSLabs such as,inter alia, the authority to issue duplicate share certificates to the members whose certificates were missing.8Foot Note 8×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at p 360 (Notice of the 5 May Resolution). 5 Most of OSLabs’ shareholders had signed the May Resolutions. The 3 May Resolution was signed by all shareholders except for the plaintiff (“Affle”) and Ventureast Proactive Fund II (“VPF”).9Foot Note 9×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at p 405 (Explanatory Statement to Resolution No 1(1) to (8)); Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at para 37; Sameer Nigam’s Affidavit in OS 468 at para 29.The 5 May Resolution was signed by all shareholders except for Affle.10Foot Note 10×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at paras 9–11, p 406 (Explanatory Note to Resolution No 4).The shareholders of OSLabs as of 3 May and 5 May 2021 were as follows:11Foot Note 11×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 24. S/NShareholder (Relationship with OSLabs)Shareholding %1.Rakesh Deshmukh (Founder 1) (“Mr Deshmukh”)5.962.Akash Dongre (Founder 2)5.393.Sudhir Bangarambandi (Founder 3)5.114.Hariharan Padmanabhan (“Key Shareholder”)5.495.SVIC No 32 New Technology Business Investment LLP (“SVIC”) (Investor 1)16.196.VPF (Investor 2)15.627.ON Mauritius (Investor 3)15.248.Affle (Investor 4)89.JSW Ventures (“JSW”) (Investor 5)4.1610.Micromax FZE, Dubai (“Micromax”) (Ordinary Shareholder)7.5811.“Angel Investors”5.4312.Employee Stock Ownership Plan (notional, non-vested)5.83Total100 6 As mentioned at [3], since the relevant threshold to satisfy under the SHA is at least 60% of the total share capital (on a fully diluted basis) owned and held by theInvestor Shareholders(ie, Investors 1–5 listed above, holding a total share capital of about 59%), the Investor Shareholders’ votes were particularly pertinent to the May Resolutions. A group of Investor Shareholders holding more than 40% of that group’s total share capital on a fully diluted basis (ie, 40% of about 59%, or about 24% of the share capital in OSLabs) would suffice to veto the May Resolutions. 7 Pursuant to the May Resolutions, PhonePe purchased shares of OSLabs’ shareholders, including ON Mauritius, JSW and Micromax (the “Vendor Shareholders”). The share transfers for ON Mauritius, JSW and Micromax were registered on or about 16 May 2021.12Foot Note 12×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 27(a).As between the Vendor Shareholders, they held 26.98% of the shares in OSLabs. Without the votes attaching to their shares, it would not be possible to achieve the 60% vote of the Majority Shareholders. For completeness, PhonePe had also signed share purchase agreements (“SPA”) with the Angel Investors and Key Shareholder though they have yet to be registered.13Foot Note 13×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 27(b)–(c). 8 As will be elaborated upon below, the validity of the May Resolutions (and consequently, the validity of the transfers of shares which were registered pursuant to the May Resolutions) was in dispute (the “Validity Issue”). This, in turn, gave rise to further complications as towhich shareholderhad the right to voteat a subsequent EGM ordered by the court which was held on 15 July 2021. In particular, if the share transfers were valid and properly registered, then PhonePe would be entitled to vote at the EGM. If, however, the share transfers were invalid and therefore not properly registered, then the proper shareholders would have been the members on the register as at 3 and 5 May 2021 (ie, the Vendor Shareholders).",
        "Facts": "",
        "The parties": "9 OSLabs is a Singapore-incorporated company. It is a holding company that owns, operates and holds the intellectual property to “Indus OS”, which is a mobile application and content discovery platform operating the “Indus App Bazaar”. “Indus App Bazaar” is India’s largest independent indigenous application store.14Foot Note 14×Lee Wen Rong Gabriel’s Affidavit in OS 800 dated 12 August 2021 at para 7.Mr Deshmukh is a director of OSLabs and authorised to represent OSLabs in the present proceedings.15Foot Note 15×Rakesh Deshmukh’s Affidavit in OS 800 dated 31 August 2021 at para 1. 10 Affle is a Singapore-incorporated company in the business of research and experimental development on information technology.16Foot Note 16×Lee Wen Rong Gabriel’s Affidavit in OS 800 dated 12 August 2021 at para 5.It is one of OSLabs’ shareholders.17Foot Note 17×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 5.Affle’s chairman and director, Anuj Khanna Sohum (“Mr Sohum”), represented Affle at OSLabs’ 15 July 2021 EGM.18Foot Note 18×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 1. 11 PhonePe is a Singapore-incorporated company, which functions primarily as a holding company.19Foot Note 19×Lee Wen Rong Gabriel’s Affidavit in OS 800 dated 12 August 2021 at para 4.VPF is a fund constituted as a trust under the laws of India, and was registered as an “Alternative Investment Fund” in India through its trustee, Ventureast Trustee Company Private Limited, a company incorporated under the laws of India.20Foot Note 20×Lee Wen Rong Gabriel’s Affidavit in OS 800 dated 12 August 2021 at para 6.",
        "Background to the dispute": "12 On 9 March 2021, Affle’s board gave its in-principle approval for PhonePe to become a majority shareholder of OSLabs21Foot Note 21×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 268 (Anuj Khanna Sohum’s E-mail to Sameer Nigam dated 9 March 2021).by acquiring,inter alia, all of Affle’s shares in OSLabs.22Foot Note 22×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 269 (Sameer Nigam’s E-mail to Anuj Khanna Sohum dated 4 March 2021).On 10 March 2021, OSLabs circulated to its shareholders PhonePe’s term sheet for such acquisition of shares to be signed by 12 March 2021. As two shareholders failed to sign using DocuSign by 12 March 2021, the initial term sheet expired. The same term sheet was uploaded onto DocuSign on 13 March 2021 for shareholders to re-sign by 18 March 2021.23Foot Note 23×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at paras 11–13; Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 377 (Rakesh Deshmukh’s E-mail to Anuj Khanna Sohum dated 2 May 2021). 13 On 16 March 2021, Affle re-signed and returned the term sheet in portable document format and requested that it be duly signed by all parties for “mutual validity of the executed version”.24Foot Note 24×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 13; Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 375 (Anuj Khanna Sohum’s E-mail to Rakesh Deshmukh dated 16 March 2021).On 18 March 2021, the Term Sheet was signed in counterparts by PhonePe, OSLabs and OSLabs’ shareholders.25Foot Note 25×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 14.OSLabs sent the Term Sheet duly executed by PhonePe to OSLabs’ shareholders (including Affle) and informed them that the date of expiry was changed to 18 March 2021 while the rest of the contents remained the same.26Foot Note 26×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 15; Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 261 (Rakesh Deshmukh’s E-mail dated 18 March 2021 at 11.31pm).However, that e-mail was sent by Mr Deshmukh to himself, with Mr Sohum (and other persons) in the blind carbon copy field. 14 On 21 April 2021, Affle objected to the Term Sheet for the first time.27Foot Note 27×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at paras 16–17.Affle informed PhonePe that Affle “won’t be interested in selling [their] equity in OSLabs to PhonePe”. Affle also alleged that the Term Sheet was “non binding” and Affle “did not receive the duly executed [Term Sheet] at all or certainly not by the specified date”. Affle’s position was thus that the Term Sheet was “invalid and it must not be relied upon for any purposes”.28Foot Note 28×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 372 (Anuj Khanna Sohum’s E-mail dated 21 April 2021 at 6.04am).In the same e-mail, Affle also clarified that it “welcome[s] PhonePe as a strategic investor / shareholder on the cap table of OSLabs”. 15 Mr Deshmukh replied to the allegation by stating that the signed Term Sheet had been sent “on 18 March 2021” and thus, Affle’s “argument challenging the validity does not align with the fact that it is signed by all parties”.29Foot Note 29×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 374 (Rakesh Deshmukh’s E-mail to Anuj Khanna Sohum dated 21 April 2021 at 11.06pm).Mr Sohum explained, in response, that he “recall[ed] waiting till midnight Singapore time on 18th March 2021 and not receiving any emails in our records from anyone at OSLabs with the duly signed expired termsheet for which Affle had clearly set the deadline of 18th March 2021”.30Foot Note 30×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 374 (Anuj Khanna Sohum’s E-mail dated 21 April 2021 at 9.52pm). 16 On 29 April 2021, Affle maintained its position that the “execution version of the [Term Sheet] which was circulated had the expiry date of 12th March 2021 Singapore time” and was “an expired document by the time [Mr Sohum] was asked to sign it on 16th March 2021”. Affle raised a separate objection for the first time that the Term Sheet on which OSLabs relied contained “Affle’s signature block” which was “added by someone at OSLabs and it is not a valid document as [Mr Sohum] never received or signed any document with expiry date 18th March 2021”.31Foot Note 31×Rakesh Deshmukh’s Affidavit in OS 468 dated 29 May 2021 at p 377 (Anuj Khanna Sohum’s E-mail dated 29 April 2021). 17 Under the circumstances, the May Resolutions were proposed and passed so as to approve the Proposed Transaction. Affle then challenged the validity of the May Resolutions. 18 Affle filed its Application for Emergency Interim Relief at the Singapore International Arbitration Centre (“SIAC”) against OSLabs (“ARB 140”) on 7 May 2021 to enforce its rights under the SHA.32Foot Note 32×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 13.In particular, Affle was of the view that the sale of shares by the Vendor Shareholders, the Key Shareholder, Founders (ie,Founders 1–3 as listed in the table at [5] above) and other Investor Shareholders was not in accordance with the SHA. Affle alleged that cl 5 of the SHA was not complied with (see [20] below). Affle had commenced ARB 140 against OSLabs rather than the other aforementioned shareholders as OSLabs has obligations under the SHA not to facilitate or register any transfers of shares where the relevant restrictions on share transfers in the SHA have not been complied with.33Foot Note 33×Anuj Khanna Sohum’s Affidavit in OS 468 dated 17 May 2021 at p 230 (Emergency Arbitration Award dated 15 May 2021 at para 7.7). 19 On the same day after commencing ARB 140, Affle received letters from the Board of Directors of OSLabs stating, amongst other things, that the 3 and 5 May Resolutions “have been duly passed by the shareholders in writing pursuant to [s 184A of the Companies Act] as ordinary resolutions”. The next day, Affle replied to give notice that it objected to the passing of the May Resolutions in writingwithoutconvening a general meeting. It invoked s 184D of the Companies Act and called for a general meeting to be convened for the May Resolutions. The section provides as follows:34Foot Note 34×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at paras 14–15; at pp 376–378 (OSLabs’ Notifications dated 7 May 2021; E-mail from Anuj to OSLabs Board Members and Investors dated 8 May 2021); Rakesh Deshmukh’s Affidavit in OS 800 dated 31 August 2021 at para 25. 184D.—(1)  Any member or members of a private company … representing at least 5% of the total voting rights of all the members having the right to vote on a resolution at a general meeting of the company may, within 7 days after — (a) the text of the resolution has been sent to him or them in accordance with section 184C; … … … give notice to the company requiring that a general meeting be convened for that resolution. (2)  Where notice is given under subsection (1) — (a) the resolution is invalid even though it may have in the meantime been passed in accordance with section 184A; and (b) the directors shall proceed to convene a general meeting for the resolution. 20 At a hearing on 15 May 2021 before the arbitrator (the “Emergency Arbitrator”), the latter issued an award that pending a further order in due course, “OSLabs must not take any further steps to facilitate or register the transfers of shares by the Founders or the Key Shareholder to PhonePe without the Right of First Refusal process set out in clause 5 of the SHA first being complied with”.35Foot Note 35×Anuj Khanna Sohum’s Affidavit in OS 468 dated 17 May 2021 at p 255 (Emergency Arbitration Award dated 15 May 2021 at para 15.1).However, he also opined that whether Affle had the right to call for a shareholder meetingunder s 184D of the Companies Actwas beyond his jurisdiction.36Foot Note 36×Anuj Khanna Sohum’s Affidavit in OS 468 dated 17 May 2021 at p 251 (Emergency Arbitration Award dated 15 May 2021 at para 12.17).That prompted Affle to file HC/OS 468/2021 (“OS 468”). The Emergency Arbitrator also opined that the transfer of shares from the Vendor Shareholders appeared to be valid and declined to grant Affle an injunction restraining the registration of the transfers of shares from the Vendor Shareholders in PhonePe’s favour.37Foot Note 37×Anuj Khanna Sohum’s Affidavit in OS 468 dated 17 May 2021 at pp 251–252 (Emergency Arbitration Award dated 15 May 2021 at paras 12.18–12.19); Parag Mathur’s Affidavit in OS 800 dated 4 September 2021 at para 12. 21 I should clarify that cll 17.2–17.3 of the SHA provides that any dispute arising in relation to or in connection with the SHA (including any alleged breach thereof) which could not be resolved through discussions between the senior executives of the disputing parties and a person jointly appointed by the Founders may be submitted “to be finally settled by arbitration”.38Foot Note 38×Anuj Khanna Sohum’s Affidavit in OS 468 dated 17 May 2021 at p 82 (SHA at Clause 17).For the avoidance of doubt, the present matters before me do not relate to any findings of breaches of the SHA or the interpretation of the SHA. Those matters were properly determined by the Emergency Arbitrator as mentioned at [20]. 22 For completeness, I should perhaps mention that on 20 May 2021, PhonePe commenced HC/S 449/2021 (“Suit 449”) against OSLabs, VPF, and Affle, for claims arising in relation to the Term Sheet executed on or around 18 March 2021 and its intended purchase of substantially all of the shares of OSLabs (ie, the Proposed Transaction). The issues therein were not relevant to the present applications. 23 OS 468, filed on 17 May 2021, was anexparteapplication by Affle for: 1. An order that the [May Resolutions] that were (i) purportedly passed in accordance with Section 184A of the [Companies Act] and (ii) relies on a shareholder resolution purportedly passed in accordance with Section 184A of the [Companies Act], any share transfers filed, or sale and purchase agreements signed by [OSLabs] in furtherance of the transaction with [PhonePe] (the transaction that the [May Resolutions] seek to authorise) are invalid; 2. An interim injunction restraining [OSLabs] from taking any further action or steps in furtherance of the PhonePe transaction envisaged in the [May Resolutions]; 3. An interim injunction restraining [OSLabs] from registering any transfer of shares to PhonePe with the Accounting and Corporate Regulatory Authority (“ACRA\"), or in any other manner, until the requirements under Section 184D of the [Companies Act] are fulfilled; and 4. An order for [OSLabs] to convene a general meeting pursuant to Section 184D of the [Companies Act]. I will refer to each of the foregoing prayers as “OS 468 Prayer 1”, “OS 468 Prayer 2”, “OS 468 Prayer 3” and “OS 468 Prayer 4” respectively. 24 At the hearing before me on 20 May 2021, I granted leave for Affle to amend theexparteapplication to aninterpartesapplication, with proper notice to OSLabs. At the hearing before me on 21 May 2021, I granted OS 468 Prayers 2 and 3 in terms, subject to Affle’s undertaking to abide by any order the court may make as to damages in case the court should thereafter be of the opinion that OSLabs and PhonePe had sustained any by reason of such order which Affle ought to pay. HC/ORC 2881/2021 (“ORC 2881”) in relation to OS 468 Prayers 2 and 3 was extracted on 24 May 2021. On 24 May 2021, PhonePe was joined as the second defendant in OS 468 and the defendants sought to set aside ORC 2881: OSLabs filed HC/SUM 2394/2021 (“SUM 2394”) and PhonePe filed HC/SUM 2410/2021 (“SUM 2410”). In SUM 2394, OSLabs contended that even if the May Resolutions were invalidated by s 184D(2)(a) of the Companies Act, such invalidation had “no impact whatsoever on the validity of the [sale and purchase agreements] and share transfers” from the Vendor Shareholders to PhonePe.39Foot Note 39×OSLabs’ Written Submissions in OS 468 (SUM 2394 and 2410) dated 28 May 2021 at para 14.In SUM 2410, PhonePe contended that there would “be no order to be made” by the court if s 184D(2)(a) of the Companies Act “would automatically render the Resolutions invalid”.40Foot Note 40×PhonePe’s Written Submissions in OS 468 (SUM 2394 and 2410) dated 28 May 2021 at para 81. 25 The hearing before me on 31 May 2021 was in respect of SUM 2394, SUM 2410, as well as OS 468 Prayers 1 and 4. At that hearing, Affle made an oral application to proceed only with the first part of OS 468 Prayer 1 (ie, the part relating to the invalidity of the May Resolutions). I granted the first part of OS 468 Prayer 1 and HC/ORC 3587/2021 (“ORC 3587”) was subsequently extracted on 30 June 2021 holding that the “3 May 2021 and 5 May 2021 resolutions (collectively, the “Resolutions”) that were purportedly passed in accordance with [s 184A of the Companies Act] are invalid”. Counsel for Affle also agreed, in respect of OS 468 Prayer 4, that PhonePe could vote as proxy for the Vendor Shareholders. I granted an order in terms of OS 468 Prayer 4, with the following two qualifications: (a) until the Emergency Arbitrator or some other arbitrator in his stead has decided on the validity (or otherwise) of the transfers which have been registered in its favour, PhonePe shall not exercise any voting right in relation to the subject shares at the said EGM; and (b) that the EGM shall not be convened before the decision of the Emergency Arbitrator (or his replacement) has been made. 26 On 10 June 2021, OSLabs wrote to PhonePe and Affle to propose to convene the EGM (withoutwaiting for the decision of the Emergency Arbitrator): (a) by way of shorter notice; and (b) where the shareholders entitled to attend and vote be the shareholders on record as at 3 May 2021 and 5 May 2021.41Foot Note 41×Parag Mathur’s Affidavit in OS 800 dated 4 September 2021 at para 18 and pp 21–24 (Letter from Counsel for OSLabs to Counsel for Affle dated 10 June 2021).On 11 June 2021, PhonePe responded that it would be agreeable to convening the EGM as proposed, but that such agreement was without prejudice to its position adopted in OS 468.42Foot Note 42×Parag Mathur’s Affidavit in OS 800 dated 4 September 2021 at para 19 and pp 25–27 (E-mail from Counsel for PhonePe to Counsel for OSLabs dated 11 June 2021).On 14 June 2021, Affle responded that it was not agreeable to convening the EGM by way of shorter notice and maintained that it be “duly convened with 21 days’ notice”.43Foot Note 43×Parag Mathur’s Affidavit in OS 800 dated 4 September 2021 at para 20 and pp 28–29 (Letter from Counsel for Affle to Counsel for OSLabs dated 14 June 2021).It did not specifically object to the proposal as to the members entitled to attend and vote. 27 The hearing before me on 18 June 2021 was in respect of SUM 2394 and SUM 2410. Parties indicated that it would take a long time for the Validity Issue to be decided by the Emergency Arbitrator and parties thus applied to amend the order relating to OS 468 Prayer 4. I allowed the amendment (a) authorising the convening of the EGM notwithstanding the fact that the Validity Issue remained unresolved and (b) stipulating that the parties entitled to vote at the EGM would be the members reflected on the company register as at 3 and 5 May 2021 (which therefore included the Vendor Shareholders). The matter was adjourned to a date after the EGM. I should also mention that, contrary to its earlier position adopted at the hearing on 31 May 2021, counsel for Affle took the position that neither PhonePe nor the Vendor Shareholders could vote at the EGM. I will come back to address this last point later in [36]. 28 On 23 June 2021, OSLabs sent out a notice for the EGM to be convened on 15 July 2021.44Foot Note 44×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at para 31.The EGM was eventually held on 15 July 2021. The Vendor Shareholders attended the meeting (by their respective authorised representatives). All the members “present at the meeting, except [Affle] and VPF, approved the appointment of Mr. Suresh Nair [“Mr Nair”], as the Chairman”. Mr Sohum (representing Affle) raised an objection that the Vendor Shareholders in attendance and voting were “not members of [OSLabs] as on the date of this meeting”.45Foot Note 45×Rakesh Deshmukh’s Affidavit in OS 800 dated 1 September 2021 at p 61 (Minutes of the EGM of OSLabs on 15 July 2021 at 3.30pm at p 2). 29 The resolutions tabled at the EGM were approved by the requisite majority of OSLabs’ shareholders on record as at 3 and 5 May 2021 present at the meeting, save for Affle and VPF.46Foot Note 46×Rakesh Deshmukh’s Affidavit in OS 800 dated 31 August 2021 at para 37. 30 On 6 August 2021, Affle filed HC/OS 800/2021 (“OS 800”). In OS 800, Affle applied,inter alia, for: (a) an order that the EGM was not properly convened and held, and therefore the EGM was invalid (“OS 800 Prayer 1”); (b) an order that all the shareholders’ resolutions tabled on 23 June 2021 and passed at the EGM are invalid (“OS 800 Prayer 2”); and (c) an injunction to restrain OSLabs from taking any further action or steps in furtherance of the aforementioned shareholders’ resolutions including but not limited to the Proposed Transaction with PhonePe (“OS 800 Prayer 3”). 31 Pending the determination of OS 800, Affle also applied in HC/SUM 3963/2021 (“SUM 3963”, filed on 24 August 2021), for an interim injunction to restrain OSLabs from taking any further action or steps in furtherance of the shareholders’ resolutions tabled on 23 June 2021 and passed at the EGM of OSLabs on 15 July 2021, including but not limited to the Proposed Transaction with PhonePe. 32 At the hearing before me on 9 September 2021, I delivered anex temporejudgment dismissing Affle’s applications in OS 800 and, consequently, SUM 3963. In light thereof, with regard to OS 468, counsel for Affle asked that ORC 2881 be discharged and I did so order. Consequently, I need not elaborate further on SUM 2394 and SUM 2410. 33 On 10 September 2021, Affle filed its Notice of Appeal against the whole of my decision given on 9 September 2021:47Foot Note 47×AD/CA 89/2021 Notice of Appeal dated 10 September 2021. (a) that OSLabs’ EGM held on 15 July 2021 was properly convened and held, and therefore valid; (b) that the shareholders’ resolutions tabled on 23 June 2021 and passed at the EGM are valid; and (c) that the interim injunction in ORC 2881, as varied at the hearings on 31 May 2021 and 18 June 2021, be discharged forthwith. 34 On 15 November 2021, Affle much belatedly filed another Notice of Appeal against my decision given on 18 June 2021 that the parties entitled to vote at the EGM would be the shareholders on record on 3 May 2021 and 5 May 2021 respectively.48Foot Note 48×AD/CA 117/2021 Notice of Appeal dated 15 November 2021.",
        "The parties’ cases": "",
        "OS 468": "35 At the hearing before me on 31 May 2021 (see [25] above), in respect of OS 468 Prayer 4, counsel for Affle had argued thatPhonePecould not be allowed to vote at the EGM even though it had been registered as a member pursuant to the transfers by the Vendor Shareholders. Affle’s position was that PhonePe could not vote until the decision of the Emergency Arbitrator (which would be quite a long time later, and thus a cause of concern). Significantly, counsel for Affle maintained that the shareholders who signed the s 184A resolutions (ie, the May Resolutions) should be the ones voting at the EGM. Counsel for Affle conceded that, to be fair, the original shareholders should vote. In that regard, PhonePe could ask the Vendor Shareholders for authority to voteon their behalfbut PhonePe could not vote as PhonePe (ie, could not vote in its own right but could vote as proxy). 36 At the hearing before me on 18 June 2021 (see [27] above), counsel for Affle reiterated its position that PhonePe should not vote at the EGM. However, contrary to what he had earlier conceded, he also objected to the Vendor Shareholders voting. Counsel for Affle argued that it would be a “fictitious” vote since the shareholders would not be expressing their own independent view in the vote and it would really be PhonePe voting. Affle submitted that it would be only after the Emergency Arbitrator had determined the validity of the registration of shares that it would be possible to determine which party (ie, either PhonePe or the Vendor Shareholders) would have the right to vote at the EGM. In that regard, to allow PhonePe to vote in substance would be afait accompli. 37 Affle’s underlying reasoning could perhaps be expressed thus. The May Resolutions were invalid. Therefore, the transfers of OSLabs shares by the Vendor Shareholders were also invalid. OS 468 Prayer 1 originally specifically sought an order to this effect. Although at the request of Affle, OS 468 Prayer 1 was later narrowed down to seek only an order as to the invalidity of the May Resolutions (see [25]), it remained Affle’s position that the transfers by the Vendor Shareholders in favour of PhonePe were invalid. Hence the provision in OS 468 Prayer 4 for determination of their validity by the Emergency Arbitrator. 38 On the basis that the transfers by the Vendor Shareholders were invalid, it was understandable that Affle sought to prevent PhonePe from exercising voting rights in respect of their shares.Exhypothesi, the Vendor Shareholders therefore retained the right to vote. If the share transfers were invalid, the Vendor Shareholders remained as shareholders and could vote as such. I address this point at [44] below.",
        "OS 800 and SUM 3963": "39 Affle’s case was that the EGM held on 15 July 2021 was not properly convened and held, thereby resulting in the resolutions passed thereat being invalid. In particular, Affle submitted that an invalid EGM “must mean that the resolutions passed are invalid”. This would, in turn, determine OS 800 Prayers 1, 2, and 3.49Foot Note 49×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at pp 9–10. 40 Affle argued that the 15 July 2021 EGM was not properly convened and held for two main reasons: first, non-members (ie, the Vendor Shareholders) were permitted to attendand voteat the EGM; and second, the representative of anon-member(ie, ON Mauritius) was appointed as theChairmanof the EGM. Affle submitted that “OSLabs [had] blatantly violated the trite principle thatonly registered members of a company may vote at a shareholders meeting” [emphasis added].50Foot Note 50×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at paras 25 and 49.The key issue was thus whether the Vendor Shareholders were entitled to vote. If they were, there was nothing to prevent the representative of one of the Vendor Shareholders (ie, the representative ofON Mauritius) from chairing the EGM. 41 Affle had a second argument. It contended that OSLabs’ attempt toratifythe May Resolutions at that EGM was wrong at law for two reasons: (a) Affle argued that the May Resolutions were invalid to begin with (ie,pursuant to ORC 3587; see [25] above) such that OSLabs could not ratify the May Resolutions at the 15 July 2021 EGM.51Foot Note 51×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at paras 52–54.Thus, OSLabs ought to have tabledfresh resolutionsto be passed at the EGM instead ofratifyingthe invalidated Resolutions.52Foot Note 52×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at para 64. (b) In any case, pursuant to s 184DA of the Companies Act, the May Resolutions had lapsed and any purported agreement to the May Resolutions was ineffective.53Foot Note 53×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at paras 59–60. 42 OSLabs and PhonePe submitted that the Vendor Shareholders’ votes “are proper and do not invalidate the resolutions”. In particular, it was Affle’s own position that “PhonePe can vote as proxy for the [Vendor Shareholders] who had already sold their shares”. Furthermore, Affle’s argument that the May Resolutions cannot be ratified by operation of s 184DA of the Companies Act was “misconceived”.54Foot Note 54×Defendants’ Joint Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at paras 24, 26 and 41.",
        "Issues to be determined": "43 The main issues were as follows: (a) whether the EGM was properly convened given that the Vendor Shareholders were permitted to vote (“Issue 1”); and (b) whether the May Resolutions were incapable of ratification (“Issue 2”).",
        "Issue 1: whether the EGM was properly convened given that the Vendor Shareholders were permitted to vote": "",
        "Affle’s own initial position was that the Vendor Shareholders were entitled to vote": "44 At the hearing before me on 31 May 2021, Affle had quite rightly taken the position (as summarised at [35]) that the shareholders who signed the May Resolutions should be the ones voting at the EGM. I agreed with the defendants that it was Affle’s own position that PhonePe could not itself vote at the EGM but could vote as proxy for the Vendor Shareholders at the EGM. In other words, the Vendor Shareholders were entitled to vote.",
        "Affle’s subsequent position was untenable at law": "45 However, and as noted at [36], despite this earlier acknowledgement that the Vendor Shareholders should be the ones voting and that PhonePe could vote as proxy for the Vendor Shareholders, Affle sought to disenfranchise the Vendor Shareholders at the hearing before me on 18 June 2021. 46 In effect, Affle was blowing hot and cold. In my view, they could not have it both ways. It could not be that the shares were in no man’s land such thatneitherthe Vendor Shareholders nor PhonePe could vote. Whilst the logic of their contention was difficult to follow, their motives were not. Having successfully obtained a court order to convene the EGM, they wanted to ensure that the proposed resolutions would fail to find the requisite majority support at the EGM. Affle’s stand was particularly unmeritorious in light of the fact that, regardless of whether the Vendor Shareholders or PhonePe voted, their votes would most likely, if not certainly, be the same (ie, in favour of the resolutions). Affle was not prepared to abide by the majority vote which they knew or feared would eventuate unless the Vendor Shareholders were stopped. 47 Affle cited ss 180, 19(6A) and 64(1) of the Companies Act in regard to the issue of voting rights on resolutions at company meetings in the present matter.55Foot Note 55×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at paras 26–30. 48 Section 180 of the Companies Act sets out a member’s rights at meetings: 180.—(1)  A member shall … have a right to attend any general meeting of the company and to speak on any resolution before the meeting. (2)  In the case of a company limited by shares, the holder of a share may vote on a resolution before a general meeting of the company if, in accordance with the provisions of section 64, the share confers on the holder a right to vote on that resolution. As to the meaning of “members”, s 19(6A) of the Companies Act makes clear that: (6A)  Apart from the subscribers referred to in subsection (6), every other person who agrees to become a member of a company and whose name is entered — … (b) in the case of a private company, in the electronic register of members kept by the Registrar under section 196A, is a member of the company. Finally, s 64(1) of the Companies Act confers one vote per share to a shareholder: 64.—(1)  Subject to subsections (2) and (3), sections 21 and 76J, and any written law to the contrary, a share in a company confers on the holder of the share the right to one vote on a poll at a meeting of the company on any resolution. 49 Affle relied on the foregoing provisions to support its position that by “allowing non-members” (ie, the Vendor Shareholders) “to attend and vote at the EGM, OSLabs had blatantly violated thetrite principle that only registered members of a company may vote at a shareholders meeting” [emphasis added].56Foot Note 56×Affle’s Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at para 25.Crucially, such submission demonstrated that Affle acknowledged that a registered shareholder may vote on a poll at a meeting of the company on any resolution. However, by the time of the EGM, the Vendor Shareholders had transferred their shares to PhonePe and PhonePe was a registered shareholder (see [7] above). Affle’s position that PhonePe was not entitled to vote at the EGM was itself contrary to the same legal principle Affle sought to rely on. 50 Taking Affle’s position at its highest (ie, that the share transfers and registration were invalid), it necessarily must also be the case that the shares remained with the Vendor Shareholders. Yet, Affle simultaneously contended that the Vendor Shareholders were not entitled to vote at the EGM. I was not persuaded that Affle’s position that neither could vote could be maintained as a matter of law. In that regard, the insurmountable difficulty with Affle’s position was thatnobody was a registered shareholder such that neitherPhonePe nor the Vendor Shareholders were entitled to vote at the EGM. Thus, I had little hesitation in dismissing OS 800.",
        "The voting shareholders and elected Chairman of the EGM": "51 For the foregoing reasons, I decided (at the hearing before me on 18 June 2021) that those voting at the EGMhad to bethe shareholders on record as at 3 and 5 May 2021 respectively.There was no appeal against my orderat that point in time. The EGM was duly held on 15 July 2021 with the Vendor Shareholders exercising their voting rights. 52 The question whether the Vendor Shareholders could vote had already been decided at the hearing before me on 18 June 2021. Affle’s applicationin OS 800 and SUM 3963therefore amounted to animpermissible back-door appeal. Even assuming,arguendo, that I was wrong in allowing the Vendor Shareholders to vote, until I was reversed, my decision on 18 June 2021 stood at the time OS 800 and SUM 3963 were filed. Under s 182 of the Companies Act, it is clear that the court has the power to “order a meeting to be called, held and conducted in such manner as the Court thinks fit, and may give such ancillary or consequential directions as it thinks expedient”. I agreed with the defendants that OSLabs, in convening the EGM on 15 July 2021 and allowing the Vendor Shareholders (ie, the members on the register as at 3 and 5 May 2021) to vote, was merely abiding by my order.57Foot Note 57×Defendants’ Joint Written Submissions in OS 800 and SUM 3963 dated 2 September 2021 at para 30.As mentioned above at [34] and [51], Affle had only recently filed its Notice of Appeal against my decision given on 18 June 2021, long after it had filed OS 800 and SUM 3963 and I had dismissed them. 53 As mentioned at [40], Issue 1 is also directly related to the issue of whether the EGM was not properly convened because Mr Nair of ON Mauritius had chaired the EGM.58Foot Note 58×Anuj Khanna Sohum’s Affidavit in OS 800 dated 6 August 2021 at para 39.As the Vendor Shareholders were entitled to vote, there was nothing to prevent Mr Nair from chairing the EGM.",
        "Issue 2: Whether the May Resolutions were incapable of ratification and of no effect": "54 As earlier recounted at [41], Affle contended that OSLabs’ attempt to have the May Resolutions ratified was wrong at law for two reasons: (a) As the May Resolutions had been declared invalid in ORC 3587 pursuant to s 184D(2) of the Companies Act, they were incapable of being ratified at the 15 July 2021 EGM. Fresh resolutions ought to have been tabled instead. (b) In any case, pursuant to s 184DA of the Companies Act, the May Resolutions had lapsed so that any purported agreement to the May Resolutions was ineffective. 55 I shall deal first with Affle’s contention regarding s 184DA. In my view, it is clear that s 184DA is inapplicable to this case and Affle’s reliance thereon is misplaced. Section 184DA provides as follows: 184DA.—(1)  Unless the constitution of a company otherwise provides, a resolution proposed to be passed by written means lapses if it is not passed before the end of the period of 28 days beginning with the date on which the written resolution is circulated to the members of the company. (2)  The agreement to a resolution is ineffective if indicated after the expiry of that period. 56 A plain reading of the provision shows that it applies where a resolution has been proposed to be passed by written means but was not so passed within 28 days after the proposed written resolution was circulated to the members of the company. The result is that it lapses. Section 184DA(2) makes clear that after the proposed resolution lapses, it is incapable of being passed as such. 57 If there be need for support for the interpretation, reference may be made to the Ministry of Finance (“MOF”),Report of the Steering Committee for Review of the Companies Act(April 2011) at Recommendation 2.7, para 31 (Chairman: Walter Woon SC) which states: (a) It isnot desirable to have aproposed written resolution, which was not signed or acted upon, left lying around. It isnecessary to let such a proposed resolution lapse. If the 28-day period is too short, the company’s articles could provide for a longer period. If there is a need to resurrect the proposal, a new written resolution can be proposed again. … (d) The directors and shareholders of a company might change over time. In view of this, it is logical to stipulate that a written resolution would lapse if the required majority vote is not attained by the end of the 28-day period, as this would address changing circumstances. [emphasis added in italics and bold italics] 58 The aforementioned recommendation was accepted by the MOF (Ministry of Finance,Ministry of Finance’s Responses to the Reportof the Steering Committee for Review of the Companies Act) (3 October 2012)): 13.MOF accepts Recommendation 2.7. The [Steering Committee] had considered the administrative concerns of companies but on balance had proposed the recommendation as it was not desirable to have a proposed written resolution which was not signed or acted upon. As the directors and shareholders of a company might change over time, it is prudent to stipulate that a written resolution would lapse if the required majority vote is not attained by the end of a certain period. It is noted that the UK had provided for a 28-day period, unless otherwise stated in the companies’ Articles. MOF agrees with the views of the [Steering Committee], and notes that a company may provide a longer lapsing period in its Articles where necessary. [emphasis in original] 59 In the present case, the proposed resolutions were passed on 3 and 5 May 2021 respectively. They were not left as mere proposed resolutions such as to attract the application of s 184DA. 60 Before I leave this topic, I should perhaps add that even if s 184DA was applicable, nothing in the section precludes a company from subsequently proposing a fresh resolution identical to the lapsed resolution for adoption by written means or at a general meeting. 61 I go on to deal with Affle’s submissions that the May Resolutions having been declared invalid by ORC 3587, they were incapable of being ratified. As mentioned at [1], the EGM was proposed to,inter alia, “consider and if deemed fit ratify” the May Resolutions. 62 The word “ratify” is capable of more than one single meaning. As in agency law, it could mean approving or adopting a contract entered into by an agent purportedly on the principal’s behalf. In that sense, ratification “is akin to an assent by the principal to the transaction entered into by the unauthorised agent by adopting the agent’s otherwise unauthorised acts” (CavenaghInvestment Pte Ltd v Kaushik Rajiv[2013] 2 SLR 543 at [31]). In such a case by ratifying the contract the principal becomes legally entitled and bound as though he had authorised the agent’s action from the beginning; the ratification  thus has retrospective effect. The retrospective effect of ratification causes the “legal consequences of the agent’s act to relate back to the time the agent performed those acts as if they had been properly authorised at the outset” (Tan Cheng Han SC,The Law of Agency(Academy Publishing, 2nd Ed, 2017) at para 6.009). As Lord Sterndale, MR explained inKoenigsblattv Sweet[1923] 2 Ch 314 at 325, ratification is “equivalent to an antecedent authority” and “when there has been ratification the act that is done is put in the same position as if it had been antecedently authorized”. 63 This first meaning of the word did not sit comfortably in the context of the May Resolutions for two reasons. Firstly, it would be senseless for any ratification to applyretrospectively. If the May Resolutions were adopted retrospectively by way of ratification, then the transfers and registration of the shares purchased from the Vendor Shareholders in favour of PhonePe were valid. It would then follow that the Vendor Shareholders had no right to vote in the ratification exercise; the result would then be that the ratification failed. To interpret “ratify” in this sense leads to an intractable conundrum. Moreover, as Affle itself pointed out, the May Resolutions had been declared invalid, in line with s 184D(2). Secondly, and in any case, there was nounauthorised actcommitted by any agent to speak of. On the contrary, the May Resolutions were passed with the requisite majority of the shareholders (see [3]–[4] above). I thus concluded that the parties could not have intended the word “ratify” in this technical sense. 64 There is another more general sense in which “ratify” is used in plain English,viz, to approve and give formal consent to something. Under s 184D(2)(a), the May Resolutions which had been passed by written means became invalid once Affle called for a general meeting to be “convened for that resolution” in exercise of its right so to do under s 184D(1). In the circumstances of the present case, it was clear that the word “ratify” was used in this ordinary sense. 65 The EGM ordered by the court on 31 May 2021 (and as later amended on 18 June 2021; see [25] and [27] above) was pursuant to Affle’s application in OS 468 where Affle invoked s 184D(1). In the light of s 184D(2)(b) which requires that a general meeting be convened for that “particular resolution”, it made no sense for Affle to contend that the same resolutions which had been passed by written means (but later invalidated) could not be passed at the EGM of 15 July 2021. Indeed, Affle’s position effectively rendered s 184D(2)(b) otiose if a resolution invalidated pursuant to s 184D(2)(a) could not be put to the vote at the EGM. Seen in that light, it is abundantly clear that Affle’s objection to the EGM on 15 July 2021 on account of the use of the word “ratify” (see [1] above) is merely a technical one which is untenable in the context of s 184D(2) of the Companies Act. In any case, on the facts, I found that the parties’ clear intention in holding the EGM was for the purpose of satisfying s 184D(2)(b). Accordingly, the resolution passed at that EGM must be valid notwithstanding Affle’s technical objection.",
        "Conclusion": "66 For the foregoing reasons, I dismissed OS 800. SUM 3963 also fell away with the dismissal of OS 800. As mentioned at [32], with regard to OS 468, Affle requested that ORC 2881 be discharged and I did so order at the hearing before me on 9 September 2021. 67  After hearing parties’ submissions on costs, I made the following orders: (a) for OS 468, costs fixed at $20,000 plus disbursements to be borne equally by OSLabs and PhonePe; and (b) for OS 800, costs fixed at $10,000 plus respective disbursements to be paid by Affle to each defendant. Andrew AngSenior Judge Kenneth Tan SC (Kenneth Tan Partnership) (instructed), Tan Soo Peng Daniel, Lee Yew Boon and Jonas Chung Teck Hong (Dan Tan Law Corporation) for the plaintiff; Tan Teng Muan and Loh Li Qin (Mallal & Namazie) for the first defendant; Sarbjit Singh Chopra, Lee Wen Rong Gabriel and Luis Inaki Duhart Gonzalez (Selvam LLC) for the second defendant.",
        "": ""
    }
}