{
    "case_title": "DMX Technologies Group Ltd (in liquidation)vDeloitte & Touche LLP(George, Richard John Weir and another, non-parties)",
    "ncitation": "[2022] SGHC 218",
    "coram": "Goh Yihan JC",
    "sections": {
        "Background": "3 By way of background, these are the relevant parties. The respondent is a Bermuda-incorporated company in the business of providing networking, security, and software solutions. In the underlying case, the defendant was the appointed auditor for the respondent between the financial years of 2011 and 2013 (“the Relevant Audit Years”). For each of those audit years, the defendant was engaged to audit the respondent’s and its subsidiaries’ consolidated financial statements (“the Audit”). As I mentioned above, the non-parties, who are the appellants in the present appeal, are both partners in Deloitte HK. The first non-party, Mr Richard John Weir George (“Mr George”), is a partner in Deloitte HK and the Reputation and Risk Leader of Deloitte China (including Deloitte HK). His duties include overseeing quality and risk management across Deloitte China’s multi-disciplinary practice. The second non-party, Ms Tse Fung Chun (“Ms Tse”), is also a partner in Deloitte HK. She was the audit partner having overall responsibility for the conduct of the Audit for the financial year 2011. 4 In October 2017, the respondent commenced Suit 920 of 2017 against the defendant for allegedly acting in breach of duties owed to the respondent in contract and in tort. These breaches had allegedly come about in the planning, preparing, and/or conducting the audit of the respondent’s consolidated financial statements for the Relevant Audit Years and/or in the making of the subsequent audit report. While Deloitte HK (which is a separate and independent firm from the defendant) was a component auditor for certain parts of the Audit, the respondent has expressly confirmed that it does not intend to assert any claim against Deloitte HK or the appellants. 5 On 21 June 2021, the respondent commenced a non-party discovery application against Mr George, seeking 13 categories of documents (“the Documents”). The Documents largely comprise audit working papers relating to the work done in the Audit, which the respondent asserts are relevant to the issues in its claim against Deloitte SG. The respondent took the position that Mr George’s position as a partner of Deloitte HK meant that the Documents are in his possession, custody, or power. On 28 June 2021, the respondent appliedex partefor leave to serve the non-party discovery application and relevant papers out of jurisdiction on Mr George in Hong Kong (“the First Leave Application”). The High Court granted the order on 29 June 2021 (“the First Service Order”). 6 In response to being served in Hong Kong, Mr George filed his reply affidavit on 4 October 2021, in which he stated that he was not involved in the Audit. The respondent then explained in its rejoinder affidavit that it thought that the partners with overall responsibility for the Audit in the Relevant Audit Years, being Mr Martin Hills and Ms Tse, were no longer partners of Deloitte HK. As such, the respondent was not able to file the discovery application against them but chose Mr George as he remains a partner of Deloitte HK. 7 As it turned out, Ms Tse was still a partner of Deloitte HK. Instead of withdrawing its discovery application against Mr George, the respondent thereafter commenced aseconddiscovery application against Ms Tse for the Documents as well. On 31 March 2022, the respondent sought leave to serve the non-party discovery application and relevant papers out of jurisdiction on Ms Tse in Hong Kong (“the Second Leave Application”). On 1 April 2022, the High Court granted, on anex partebasis, leave to serve out of jurisdiction (“the Second Service Order”). 8 On 9 June 2022, the appellants filed Summons 2153 and Summons 2154. These were applications to set aside the First Service Order and the Second Service Order (collectively, “the Service Orders”) respectively. These applications were those that the AR dismissed and whose decision the appellants now appeal against before me.",
        "The relevant issues": "9  While the present appeal is by way of a rehearing, I am grateful to the AR’s clear summary of the grounds supporting her decision, from which I can discern the relevant issues before me. The AR gave the following reasons for dismissing Summons 2153 and Summons 2154: (a) In relation to Mr George’s submission that there was material non-disclosure by the respondent in the First Leave Application, the AR was not persuaded that the First Service Order should be set aside based on non-disclosure. The AR considered that the non-disclosure, while material, was not intended to mislead the court. (b) In relation to both Mr George’s and Ms Tse’s submission that the correct test which should have been applied in the First Leave Application and the Second Leave Application (collectively, “the Leave Applications”) is the “close connection test” as set out in the decision of the Court of Appeal inBurgundy Global Exploration Corp v Transocean Offshore International Ventures Ltdand another appeal[2014] 3 SLR 381 (“Burgundy”), the AR decided that that test was not applicable outside of the fact situation inBurgundyitself. However, even if the close connection test were applied in the present case, the AR held that there would be a proper basis for the court to assume jurisdiction over the appellants. As such, the AR did not set aside the Service Orders. 10 Accordingly, there are two issues to be decided in the present appeal: (a) First, which applies only to Mr George, whether the First Service Order should be set aside because the respondent failed to make full and frank disclosure of all the material facts in the First Leave Application. (b) Second, which applies to both Mr George and Ms Tse, whether the Service Orders should be set aside because the applicable legal test for leave to serve the discovery applications on them in Hong Kong has not been met. 11 It is the second of these issues that raises the unexplored question of the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction pursuant to O 11 r 8 of the ROC 2014. I turn to consider each issue in turn.",
        "Whether the First Service Order (against Mr George) should be set aside for non-disclosure of a material fact": "",
        "Overview": "12 The first issue relating to the non-disclosure of a material fact is only relevant to Mr George’s appeal against the decision in Summons 2153. Mr George’s case is that the respondent had failed to disclose the fact that he wasnotinvolved at all in the Audit. 13 While it is common ground that the respondent did not disclose this fact at the First Leave Application, the parties disagree on the effect this should have on the First Service Order. In particular, the parties disagree on: (a) whether this fact is a material one; and (b) whether, considering factors such as the materiality of this fact and if the non-disclosure was deliberate, I should exercise my discretion to set aside the First Service Order.",
        "Whether the non-disclosure was of a material fact": "The parties’ arguments 14 I turn to the first point of disagreement, which is whether the fact of Mr George’s non-involvement in the Audit is a material one. Mr George’s case is that this fact is material because the court deciding whether to grant leave to serve out of jurisdiction would undoubtedly have considered relevant facts such as the recipient’s connection to the underlying claim. As such, Mr George argues that his lack of involvement in the underlying dispute is something that the court would have considered to be relevant and even determinative of whether leave should be granted to serve out of jurisdiction. 15 The respondent argues that the fact of Mr George’s non-disclosure is not material to the discovery application as the only relevant issue to that application is whether he isa partnerof Deloitte HK. This is because whether Mr George is a partner forms the basis that he can be ordered to provide discovery so long as the Documents are in his possession, custody, or power. As such, the respondent says that Mr George had prematurely raised the issue of material non-disclosure in a bid to stifle the respondent’s application for discovery. The fact of Mr George’s non-involvement is thus, by this argument, not a material one in the First Leave Application. My decision: the non-disclosure was of a material fact 16 In my judgment, the fact of Mr George’s non-involvement in the Audit is a material one. The starting point is the High Court decision ofBahtera Offshore (M) Sdn Bhd v Sim Kok Bengand another[2009] 4 SLR(R) 365, where it was held (at [23]) that material facts are those which a court should consider in making its decision. Further, whether a fact is a material one depends on the facts and circumstances of each case and the relief sought. 17 Applying this test, I disagree with the respondent’s argument. It seems clear that Mr George’s non-involvement in the Audit would be a fact that a court would consider relevant when making its decision whether to grant leave to serve the discovery application out of jurisdiction. While the respondent’s argument – that this fact was only relevant to the discovery application proper, but not to the application for leave to serve the application out of jurisdiction – appeared superficially attractive, it is inconsistent with a common-sense approach that the courts take in assessing materiality. Applying this approach, I find that Mr George’s non-involvement is a material fact.",
        "Whether the First Service Order should be set aside for non-disclosure of such a material fact": "The parties’ arguments 18 On the second point of disagreement, Mr George argues that I should exercise my discretion to set aside the First Service Order for two reasons. The first reason is that the non-disclosure was clearly deliberate. Mr George takes issue with the respondent’s reason for non-disclosure, which is that it simply did not perceive the relevance of the fact as it had wrongly thought that all the audit partners had left Deloitte HK. Mr George says that the respondent’s bare assertions are not credible, especially when the two affidavits filed by the respondent in the Leave Applications against Mr George and Ms Tse are compared. When this comparison is made, Mr George says that when the facts are in the respondent’s favour,ie, Ms Tse was a “key member” of the audit team, it chose to make disclosure. However, when the facts were against the respondent,ie, Mr George was not involved in the Audit, it chose to omit this fact. As such, Mr George says that the respondent was cherry-picking the information to be disclosed in the Leave Applications. It can thus be surmised that the respondent’s non-disclosure was deliberate. 19 The second reason Mr George raises in urging me to set aside the First Service Order is that there would be no prejudice to the respondent if this were done. This is because, among others, the basis for the respondent’s application for discovery against Ms Tse is the same as that for its application for discovery against Mr George. This is that Ms Tse, as with Mr George, is a partner of Deloitte HKper seand not that she was the engagement partner for any specific audit year. Accordingly, the respondent would be in as good a position as it is against Mr George. Therefore, if the First Service Order against Mr George is set aside, the respondent would not be prejudiced. Furthermore, the respondent is pursuing what are essentially two duplicative applications in respect of the same set of Documents. 20 The respondent understandably disagrees with these two reasons advanced by Mr George. As to the supposed deliberateness of the non-disclosure, the respondent argues that it had no intention to mislead the court. The respondent says that, at the time it filed the discovery application against Mr George, it believed that the audit partners who had overall responsibility for the conduct of the Audit had left Deloitte HK. It was only after the respondent was served with Mr George’s second affidavit that it became aware that Ms Tse was one of the audit partners who had overall responsibility for the conduct of the Audit, and she remained a current partner of Deloitte HK. As such, the respondent had no intention to conceal Mr George’s non-involvement from the court. Rather, it merely did not perceive the relevance of the facts to the First Leave Application. Also, the First Service Order did not confer the respondent with an advantage over Mr George. 21 As to the prejudice point, the respondent argues that it would suffer “grave prejudice”. This is primarily because Ms Tse was the audit partner from Deloitte HK only for the financial year 2011. Hence, if the First Service Order (against Mr George) were set aside, the respondent may not be able to obtain documents for the other years concerned. Conversely, no irreparable damage would be caused to Mr George if the First Service Order were allowed to stand. Ultimately, the respondent also says that it would be premature to drop Mr George from the discovery applications because Ms Tse has yet to take a position on the discovery application served on her, beyond challenging the Singapore court’s jurisdiction. My decision: the First Service Order should be set aside for non-disclosure of such a material fact 22 In my judgment, the First Service Order (against Mr George) should be set aside due to the non-disclosure of the material fact of his non-involvement in the Audit. I say this for three reasons. 23 First, while it is not necessary for me to find that the respondent’s non-disclosure was deliberate, I am of the view that the respondent should have taken care to disclose the material fact of Mr George’s non-involvement in the Audit. In other words, while I do not necessarily think that the respondent was intentionally withholding material facts from the court, I do find that it was at the very least being inadvertent in not disclosing that fact concerning Mr George. Although this may not amount to bad faith on the respondent’s part, I do not think the respondent can also claim to be wholly innocent. 24 The starting point in this regard is that the duty to make full and frank disclosure is an onerous one. Therefore, a party may be found to have breached this duty even if it had not acted in bad faith (see the High Court decisions ofLakshmi Anil Salgaocar v Hadley James Chilton and others[2018] 5 SLR 725 (“Lakshmi”)at [100] and6DM (S) Pte Ltd v AE Brands Korea Ltd and others and another matter[2022] 3 SLR 1300 at [121]). Of course, if a party had deliberately withheld facts from the court, then it would certainly be found to have breached this duty. In my judgment, Mr George has not shown that the respondent’s non-disclosure was deliberate. I do not think that such a serious finding can be reached by simply comparing the two affidavits filed by the respondent in the Leave Applications. It seems a bit of a stretch to say that the respondent was deliberately withholding information just because it had disclosed favourable facts in one affidavit but not the other. Be that as it may, as cases such asLakshmishow, there is no need for me to find that the respondent’s non-disclosure was deliberate to find that it had breached the duty to make full and frank disclosure. In my judgment, the respondent had, at the very least, been careless in not disclosing the fact of Mr George’s non-involvement in the Audit. Indeed, a reasonable applicant in the respondent’s position ought to have known that the fact of Mr George’s non-involvement in the Audit would be a highly relevant factor for the court hearing theex parteleave application to consider. Thus, I do not think that the respondent can brush aside any responsibility by simply saying that it thought that this fact was not relevant to the First Leave Application. 25 Second, I agree with Mr George that the respondent wouldnotbe prejudiced if I were to set aside the First Service Order. This is because the very basis of the respondent’s discovery application against Ms Tse is the same as that against Mr George. Indeed, the respondent’s position is that an order for discovery may be made against Ms Tse because “every partner of Deloitte HK would have possession, custody or power over the documents of Deloitte HK”.1Foot Note 1×Yap’s 4th Affidavit filed on 17 March 2022 at [15].This is the same position the respondent had taken in justifying its application for discovery against Mr George. Accordingly, I do not think the respondent is correct in overplaying its supposed prejudice due to Ms Tse being the audit partner from Deloitte HK only for the financial year 2011. By the respondent’s own case in its discovery applications, Ms Tse, being a partner of Deloitte HK just as Mr George is, has thesamepossession, custody, or power over the Documents. The fact that Ms Tse was the audit partner for the financial year 2011 only makes her abettersource for the Documents than Mr George. I therefore cannot see how the respondent will be prejudiced should I set aside the First Service Order against Mr George. 26 Third, I also agree with Mr George that the discovery applications against him and Ms Tse are duplicative, being for the same common reason that both are partners of Deloitte HK, andfor the same set of Documents. While not a determinative factor, I am of the view that this is a factor that I can consider in deciding whether to set aside the First Service Order for the respondent’s failure to make full and frank disclosure. In this connection, I do not think it is material that the relief sought against Mr George, which is for leave to serve out of jurisdiction, would not cause him irreparable damage unlike, for instance, a Mareva injunction. In my view, this is at best a neutral consideration in the present case and should yield to or at least be cancelled out by the consideration that the respondent has, in effect, made two duplicative discovery applications. 27 For all these reasons, I exercise my discretion, consequent upon the respondent’s failure to disclose the material fact of Mr George’s non-involvement in the Audit, to set aside the First Service Order made against Mr George.",
        "Whether the Service Orders (against Mr George and Ms Tse) should be set aside for not meeting the applicable legal test for leave to serve out of jurisdiction on a non-party": "28 While my decision above to set aside the First Service Order renders any discussion of the applicable legal test for leave moot in relation to Mr George, this issue would be conclusive of my decision in relation to the Second Service Order against Ms Tse. It also raises, as I mentioned at the outset, an unexplored question about the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction pursuant to O 11 r 8 of the ROC 2014.",
        "The parties’ arguments": "29 The appellants’ primary point is that the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction is whether the person on whom service is sought is “so closely connected to the substantive claim that the Singapore Court is justified in taking jurisdiction over him”.2Foot Note 2×Non-Parties’ Written Submissions for Summons 2153 and Summons 2154 filed on 22 July 2022 at [38].The appellants derive support for this “close connection test” through the Court of Appeal decision ofBurgundy.In this connection, the appellants also argue that, contrary to the respondent’s arguments before the AR, there is no legal basis to apply O 11 r 1 of the ROC 2014 in determining the leave applications, and that O 11 r 8 is the correct rule to apply as the discovery applications are summonses and not originating processes. Finally, the appellants argue that the respondent has failed the close connection test because it has not shown how the appellants are so closely connected to the substantive claim to justify the Singapore court exercising jurisdiction over them. 30 The respondent’s argument in its written submissions is that the close connection test inBurgundyshould not be extended to cases involving applications for non-party discovery. This is because the Court of Appeal had specifically formulated the close connection test in relation to examination of judgment debtor orders (“EJD orders”) in the context ofBurgundy. As such, the respondent argues that the court did not establish a general test for service of a summons out of jurisdiction, but rather a test that should be limited to EJD orders, or orders which are more intrusive in nature and require personal attendance before the court. A non-party discovery order may be distinguished from an EJD order, in that the non-party can comply with the order by causing the documents to be produced without attending personally. In any event, even if the close connection test ought to have been applied, the respondent says that I should grant leave to serve the summonses retrospectively. This is because the appellants are closely connected to the substantive claim as they are likely to have power over documents which are relevant and necessary for the respondent’s claim.",
        "My decision: only the First Service Order (against Mr George) should be set aside for not meeting the close connection test for leave to serve out of jurisdiction on a non-party": "31 For reasons I will now develop, I find that the First Service Order against Mr George shouldalsobe set aside for not meeting the close connection test, which I regard as the applicable test to be applied for leave to serve a summons on a non-party out of jurisdiction. However, I find that the Second Service Order against Ms Tse should remain as the close connection test is satisfied with respect to the respondent’s attempt to serve its discovery application on her out of jurisdiction. The relevant provisions in the ROC 2014 32 I turn first to consider the relevant provisions in the ROC 2014. The respondent’s Leave Applications against the appellants were both purportedly made pursuant to O 11 r 8 of the ROC 2014, read with O 11 r 1(c), r 1(e), r 1(f)(i) and/or r 1(p). In this regard, O 11 r 8 provides as follows: Service of summons, notice or order out of Singapore (O. 11, r. 8) 8.––(1) Subject to Order 69, Rule 10, service out of Singapore of any summons, notice or order issued, given or made in any proceedings is permissible only with the leave of the Court but leave shall not be required in any proceedings in which leave for service of the originating process has already been granted. (2) Rule 2 shall, so far as applicable, apply in relation to an application for the grant of leave under this Rule. (3) Rules 3, 4 and 6 shall apply in relation to any document for the service of which out of Singapore leave has been granted under this Rule as they apply in relation to an originating process. In my view, the respondent’s Leave Applications against the appellants were correctly made pursuant to O 11 r 8. This is because the discovery applications are summonses that fall within the processes referred to in O 11 r 8(1). 33 InSingapore Civil Procedure 2021vol 1 (Cavinder Bull gen ed) (Sweet & Maxwell, 2021) (“White Book”) at para 11/8/1, the learned authors explain that O 11 r 8 relates to service of processes other than notices, originating or interlocutory, “on persons, such as third parties … who are necessary respondents to proceedings or on which further proceedings are to be based, or on which jurisdiction is sought to be found over persons abroad”. TheWhite Bookcontinues to explain that the main thrust of O 11 r 8 is that “leave is always required for service of documents, made in the course of any proceedings out of Singapore, save that no further leave is required for service of any document for which leave to serve the originating process in that matter has already been obtained beforehand”. Indeed, the Court of Appeal in the recent case ofShee See Kuenand others v PT Trikomsel Oke Tbk and another matter[2022] SGCA 27 had occasion to consider that applications which are, in form, commenced by an originating summons but are in substance interlocutory summonses, come within the ambit of O 11 r 8(1) (at [20]). 34 However, what is unclear is the test to be applied in determining whether to grant such leave to serve a summons out of jurisdiction, especially in relation to non-parties. In this regard, O 11 r 8(2) does provide that “Rule 2 shall, so far as applicable, apply in relation to application for the grant of leave under this Rule”. O 11 r 2 provides as follows: Manner of application (O. 11, r. 2) 2.––(1) An application for the grant of leave under Rule 1 must be made by ex parte summons supported by an affidavit in Form 7 stating –– (a) the grounds on which the application is made; (b) that in the deponent’s belief the plaintiff has a good cause of action; (c) in what place or country the defendant is, or probably may be found; (d) where the application is made under Rule 1(c), the grounds for the deponent’s belief that there is between the plaintiff and the person on whom an originating process has been served a real issue which the plaintiff may reasonably ask the Court to try; and (e) whether it is necessary to extend the validity of the writ. (2) No such leave shall be granted unless it shall be made sufficiently to appear to the Court that the case is a proper one for service out of Singapore under this Order. (3) An order granting leave under Rule 1 shall be in Form 8 and shall allow the defendant 21 days to enter an appearance unless the Court otherwise orders or any written law provides. The applicable test is not based on the grounds in O 11 r 1 35 I pause here to address the appellants’ procedural point that the respondent had wrongly relied on the grounds contained in O 11 r 1 as being, in effect, the applicable test in determining whether to grant leave to serve a summons on a non-party out of jurisdiction pursuant to O 11 r 8(1). In this regard, a plain reading of O 11 r 2 shows it is not meant to apply wholesale to an application for leave under O 11 r 8. This is because O 11 r 2 is expressly stated to refer to O 11 r 1, which concerns the service oforiginating processesout of Singapore. Therefore, as the appellants rightly argue, O 11 r 1, and the grounds therein, cannot apply in the present case because O 11 r 1 deals with the service of anoriginating processout of jurisdiction, whereas the discovery applications aresummonses. 36 It must follow that the respondent’s argument before the AR (which it also made before me), that the grounds in O 11 r 1 are somehow engaged in the present case by virtue of O 11 r 8(2), is misplaced. More specifically, as I understand it, the respondent argues that the “grounds” referred to in O 11 r 2(1)(a) – O 11 r 2 being made applicable by the reference to it in O 11 r 8(2) – refer to the “grounds” in O 11 r 1. However, not only does a plain reading of O 11 r 1 show that it is concerned with the service of anoriginating processand not asummonsout of jurisdiction, a more considered reading of the grounds within O 11 r 1 shows that they cannot apply to the service of a summons out of jurisdiction. This is because these grounds are all crafted with the service of an originating process in mind. 37 To explain, I take as examples the very grounds that the respondent purportedly relies on. To begin with, all these grounds, r 1(c), r 1(e), r 1(f)(i), and r 1(p), commence with the words “the claim is”. This clearly shows that they are meant to apply to a substantive claim brought about by an originating process, as opposed to a mere application made through a summons. Moreover, those grounds from O 11 r 1 cannot sensibly apply to a summons. For example, r 1(e) refers to the claim being brought in respect of a breach of contract – this clearly relates to a substantive claim and cannot sensibly be thought to apply to a discovery application which, by itself, is not a claim. Finally, O 11 r 8(2) is also clear that O 11 r 2 shall apply only “so far as applicable” to an application for leave under O 11 r 8. This must mean that the drafters of the ROC 2014 recognise that O 11 r 2 cannot be taken to import wholesale the grounds in O 11 r 1 to such an application under O 11 r 8. I therefore agree with the appellants that the more sensible reading of O 11 r 8(2) is that it imports the procedural requirements of O 11 r 2 but not the grounds in O 11 r 1 (see also the Hong Kong Court of First Instance decision ofA& Anor v C[2007] HKCU 1340 at [5]). 38 For all these reasons, I dismiss the respondent’s argument that the grounds in O 11 r 1 are engaged in an application for leave under O 11 r 8(1). In my view, the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction cannot be based on the grounds set out in O 11 r 1. However, while the appellants argue that the respondent’s reliance on the grounds found in O 11 r 1 is misplaced, I do not think that the respondent’s application can be dismissed for this reason alone. This is because the respondent did correctly provide that its applications were premised on O 11 r 8. It has also advanced grounds to support its application that, while replicating the grounds in O 11 r 1 (and hencein relianceof O 11 r 1), can also be regarded asindependentgrounds on their own. In other words, it is possible to regard the respondent’s grounds as identical to thoseas described inO 11 r 1 but notpursuant toO 11 r 1. Accordingly, I disagree with the appellants that I should set aside the service orders on the procedural basis that the respondent had wrongly relied on O 11 r 1. It may well turn out these grounds premised on those in O 11 r 1 are insufficient to support the respondent’s Leave Applications. But that is a question of substance rather than procedure, and I do not set aside the Service Orders on this procedural point. Returning then to the question of the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction, if it is not based on the grounds in O 11 r 1, what is it? The applicable test is the close connection test 39 In my view, the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction pursuant to O 11 r 8(1) is the close connection test laid down inBurgundy. For reasons that I will explain, I do not consider the Court of Appeal inBurgundyto have restricted the close connection test only to EJD orders. (1) The Court of Appeal’s formulation of the close connection test inBurgundy 40 I start with the Court of Appeal’s formulation of the close connection test inBurgundy. In that case, Transocean had obtained summary judgment against Burgundy in a contractual claim for over US$105m. Transocean then obtained EJD orders against the directors of Burgundy. While the directors were resident in the Philippines, Transocean did not apply for leave under O 11 r 8(1) to serve the EJD orders out of jurisdiction. After several unsuccessful attempts to serve the EJD orders on the directors in the Philippines, Transocean obtained leave to effect substituted service of those orders by serving them on Burgundy’s Singapore lawyers. Among other arguments, Burgundy argued that the EJD orders could not be served out of jurisdiction on a foreign company director. 41 In this context, the Court of Appeal held that O 11 r 8(1) did not allow a party to serve EJD orders out of jurisdiction without first obtaining leave. More specifically, the court also held that the 1991 amendment which added the clause “but leave shall not be required in any proceedings in which leave for service of the originating process has already been granted” to O 11 r 8(1) was not intended to allow a party to serve summonses, notices, or orders out of jurisdiction without first obtaining leave specifically to serve the process on non-parties, even if it related to the substantive proceedings for which leave to serve on the parties had already been obtained (seeBurgundyat [105]). Rather, the court explained that the 1991 amendment was meant to eliminate duplicative applications for leave (at [105]): … it seems to us that the rationale underlying the 1991 Amendment was to eliminate duplicative applications for leave – where leave to serve the originating process on a defendant abroad had already been granted, the issue of whether this was an appropriate case to exercise extraterritorial jurisdiction overthat particular defendantwould have already been considered, and it would be unnecessary and inefficient to require leave to be sought repeatedly for overseas service of every subsequent document in the proceedings. [emphasis in original] 42 Importantly for present purposes, the court explained that this rationale does not apply to a non-party to the proceedings. This is because the basis for exercising extraterritorial jurisdiction against such a party has not yet been established. Thus, the court said that “[i]f leave for overseas service had not previously been granted in respect of an individual or entity that is not a party to the suit, then leave would need to be sought afresh under O 11 r 8(1) for service out of the jurisdiction on that individual” (at [107]). 43 The Court of Appeal then turned to the substantive question of whether leave should be retrospectively granted under O 2 r 1(2) for Transocean to serve the EJD orders out of jurisdiction. The court outlined its reasoning in two important paragraphs that warrant quotation substantively (at [111] and [112]): 111 In our judgment, however, the discretion to grant leave to serve an EJD order out of jurisdiction is one that must be exercised sparingly. As we noted inPT Bakrie Investindo v Global Distressed Alpha Fund 1 LtdPartnership[2013] 4 SLR 1116 at [16], the predominant purpose of an EJD order is to obtain information to assist the judgment creditor in executing his judgment. In this respect it is very similar to a subpoena – both are orders directed at persons who might not necessarily be parties to the suit requiring them to provide relevant information to the court. Both are equally intrusive in that they generally require the person against whom the order is made to attend court personally. … We also return here to the observation we have made at [82] above, which is that even though the application for leave might appear to be one that is directed at invoking the court’s personal jurisdiction over the non-party in question, that is only anterior to the further question of whether this will ultimately entail the exercise of exorbitant substantive jurisdiction to an impermissible degree. 112 Having said that, we do not think it would be appropriate to lay down strict or exhaustive rules as to when a court may exercise its discretion to allow service abroad of an EJD order.The fundamental question is whether the foreign officer is so closely connected to the substantive claim that the Singapore court is justified in taking jurisdiction over him. We nevertheless make two tentative points. First, as the whole point of an EJD order is to obtain information about the judgment debtor’s finances, the extent of the foreign officer’s knowledge of his company’s financial affairs will be an important threshold consideration. Parties should not be allowed to haul before the court a foreign officer who is unlikely to possess any relevant information. But even if a foreign officer has relevant information, that fact alone would generally be insufficient; after all, the same could be said about any individual sought to be subpoenaed to give evidence. Something more would be required. For example, the court might wish to consider the extent of the foreign officer’s involvement in the matters relating to the claim. It might be easier to justify invoking the court’s jurisdiction over a foreign officer who has played a key role in the events giving rise to the judgment creditor’s successful claim. Ultimately, the duty is on the judgment creditor to persuade the court that this is a proper case to grant leave to serve out of the jurisdiction. [emphasis added] The italicised words form the basis of the appellants’ submission that the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction is whether the person on whom service is sought is “so closely connected to the substantive claim that the Singapore Court is justified in taking jurisdiction over him”. (2) The Court of Appeal inBurgundyintended to lay down a test of general application 44 Reduced to its essence, the parties’ disagreement is whether the Court of Appeal inBurgundyintended to lay down a test ofgeneralapplication, or whether it intended only to state a test thatspecificallyapplied to EJD orders only. In my judgment, while the court was specifically concerned with the grant of leave to serve EJD orders out of jurisdiction, its concerns extended beyond this specific context. I say this for the following reasons. 45 First, the Court of Appeal was clearly setting out a general concern about the constraints that should govern the exercise of jurisdiction over a non-partyoverseas. In this regard, the court was concerned, in relation to EJD orders, whether invocation of the court’s personal jurisdiction over the non-party concerned is “anterior to the further question of whether this will ultimately entail the exercise of exorbitant substantive jurisdiction to an impermissible degree” (at [111]). The danger of exercising exorbitant substantive jurisdiction is not a concern that applies only to EJD orders. Rather, it applies to all or most of the processes that come under O 11 r 8(1). Thus, as Hoffmann J put it in the English High Court decision ofMackinnon v Donaldson, Lufkin and JenretteSecurities Corporation and others[1986] 2 WLR 453 (“Mackinnon”), albeit in the context of a subpoena to produce documents, “a state should refrain from demanding obedience to its sovereign authority by foreigners in respect of their conduct outside the [j]urisdiction”. As such, I am of the view that the Court of Appeal inBurgundywas setting out ageneralconcern about an overreach in the exercise of its extraterritorial jurisdiction particularly over non-parties. This general concern was addressed by the close connection test formulated therein. As such, this shows that the close connection test is meant to apply generally to the processes (or more narrowly, summonses) referred to in O 11 r 8(1), and not restricted only to EJD orders. 46 Second, the Court of Appeal inBurgundyclearly stated it was not laying down strict or exhaustive rules in relation to leave to serve an EJD order overseas. It therefore set out the “close connection” test as a “fundamental question” (at [112]). In my view, this is further support that the court was setting out ageneraltest in respect of O 11 r 8(1) for non-parties. While it is true that the court declined to set out exhaustively how this test should apply in the specific context of EJD orders, that does not detract from an intention to set out agenerally applicabletest beyond EJD orders. Further, this reading of the court’s intention is also supported by the court’s allusion to the concern of exercising exorbitant substantive jurisdiction – which can be applied beyond EJD orders – just a few sentences before it set out the close connection test. Thus, it can be surmised that the close connection test was meant to apply generally in O 11 r 8(1) to address the general concern of exorbitant substantive jurisdiction in relation to service out of jurisdiction on non-parties. 47 Third, while the Court of Appeal inBurgundyset out two tentative points in relation to how the close connection test is to be applied to EJD orders, that did not mean it was restricting the close connection to such orders only. Rather, in my view, the court wascontextualisingthe general close connection test to this specific situation involving EJD orders. It would otherwise be an inelegant situation if the court is taken to have established a test for EJD orders under O 11 r 8(1) but left open the formulation of different tests for different processes (or more narrowly, summonses) in relation to non-parties that can possibly come within the rule. That would be too messy and run counter to the general concern that the court inBurgundywas addressing, which was that of exorbitant substantive jurisdiction. 48 For all these reasons, I am of the view that the Court of Appeal inBurgundyhad laid down the close connection test as a general test to be applied in an application for leave under O 11 r 8(1) in relation to non-parties. For present purposes, I do not need to decide the broader point of whether this test applies to all processes under O 11 r 8(1) since I am only concerned with its application to summonses. Accordingly, to put it more specifically, the applicable test to apply for the court to determine if leave should be granted to serve a summons on a non-party out of jurisdiction is whether the person on which service is sought is so closely connected to the substantive claim that the Singapore court is justified in taking jurisdiction over him. The application of this close connection test iscontext specific. This can be seen from the Court of Appeal’s careful (if tentative) outline of the relevant concerns in relation to EJD orders. Thus, theextentof the close connection required in each case will depend on the nature of the summons being served on the non-party. Above all, the overarching concern addressed by the close connection test is to avoid the over-extension of the Singapore courts’ extraterritorial jurisdiction on a non-party. 49 While not relevant in the present case, I should mention that the relevant test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction remains relevant in O 8 r 1(4) of the new Rules of Court 2021 (“ROC 2021”). O 8 r 1(4) of the ROC 2021 contemplates that the court’s approval “is not required for service of court documents other than the originating process if the [c]ourt’s approval has been granted for service of the originating process out of Singapore”. This appears to contemplate the alternative situation where approval has not been granted, which would then raise the question of what the applicable test to govern the court’s grant of approval should be. (3) The close connection test is consistent with the approach in other jurisdictions 50 I am fortified in my conclusion by the consistent approaches taken by other jurisdictions. As I shall explain, these jurisdictions all look for a connection between the person being served out of jurisdiction and the underlying substantive claim. I begin with the position in the United Kingdom (“UK”). Prior to the introduction of the Civil Procedure Rules 1998 (“CPR”), civil procedure in the UK courts (or, more precisely, the courts of England and Wales) was primarily governed by the Rules of the Supreme Court 1965 (“RSC”). The English Court of Appeal inNational Justice Compania NavieraS.A. v Prudential Assurance Co. Ltd. (No 2)[2000] 1 WLR 603 (“The Ikarian Reefer (No 2)”) had to consider the application of O 11 r 9(4) of the RSC, which was substantively like O 11 r 8(1) of the ROC 2014. The issue inThe Ikarian Reefer (No 2)was whether the court had jurisdiction to order costs against a non-party and to serve process on that party out of jurisdiction. In this regard, Waller LJ held that O 11 r 9(4) allowed leave to be granted for service of the summons out of jurisdiction on a director of a party although the director was not himself a party to the proceedings. In particular, the learned judge said that the court had jurisdiction to decide whether a non-party had taken such steps in relation to an action to become liable to pay costs of that action. In that case, as the non-party director had control of the ship-owning company and directed it to institute a false claim, the court had jurisdiction to order the director to pay the costs of the false claim. Thus, underlying the jurisdiction was theclose connectionbetween what the non-party did in relation to the action and the subject matter of the action over which the court had jurisdiction. 51 The present civil procedure regime in the UK does not map neatly onto Singapore’s ROC 2014, but the closest analogue is found in r 6.38(1) of the CPR (as introduced by the Civil Procedure (Amendment) Rules 2008 (SI 2008/2178)). I reproduce the relevant portion here: Service of documents other than the claim form – permission 6.38 (1) Unless paragraph (2) or (3) applies, where the permission of the court is required for the claimant to serve the claim form out of the jurisdiction, the claimant must obtain permission to serve any other document in the proceedings out of the jurisdiction. (2) Where – (a) the court gives permission for a claim form to be served on a defendant out of the jurisdiction; and (b) the claim form states that particulars of claim are to follow, the permission of the court is not required to serve the particulars of claim. (3) The permission of the court is not required if a party has given an address for service in Scotland or Northern Ireland. 52 In the English High Court decision ofCInc plc v L and another[2001] 2 All ER (Comm) 446, Aikens J held that he had power under r 6.30(2) (which was the then equivalent of rule 6.38(1) of the CPR prior to the changes introduced by the Civil Procedure (Amendment) Rules 2008) to grant a claimant permission to serve an application for a freezing order against a non-party out of jurisdiction. The claimant had sought an order against the judgment debtor for the appointment of a receiver and it was anticipated that the receiver would claim an indemnity against the said non-party. Given that there was a risk that the non-party’s assets would be dissipated, the claimant sought permission to serve the application for a freezing order. Aikens J considered that, under r 6.30(2), the claimant had to satisfy the court that there was a head of jurisdiction which permitted the court to grant permission to serve the application notice against the non-party out of jurisdiction. The learned judge considered that this requirement was satisfied because the non-party was a necessary or proper party to the application against the judgment debtor for the appointment of a receiver. Also, the relief sought against the non-party was incidental to the application to appoint a receiver. Thus, while couched as coming within one of the jurisdictional gateways under the CPR (specifically, under what is now para 3.1(3) of the Practice Direction 6B of the CPR), the essence of Aikens J’s decision was to find aclose connectionbetween the non-party and the underlying claim. Tomlinson J later in the English High Court decision ofVitol SA v Capri Marine Ltd[2008] EWHC 378 (Comm) agreed with Aikens J’s interpretation of r 6.30(2) (at [9]). 53 Turning then to the position in Hong Kong, inChangfeng Shipping Holdings Ltdv Sinoriches Enterprises Co Ltd[2020] HKCFI 2703 (“Changfeng Shipping”), the Hong Kong Court of First Instance laid down the principles applicable to service out of jurisdiction of examination orders on officers of corporate judgment debtors pursuant to O 48 r 1 and O 11 r 9(4) of the Rules of the High Court (Cap 4A) (HK). Deputy High Court Judge To held thatBurgundywas thought to be authoritative due to similarities in the service out regimes in Hong Kong and Singapore (at [14]). The learned judge then applied the Singapore approach (at [22]–[23]) as follows: The applicable principles in Hong Kong 22. On the true construction of O 48 r 1 and O 11 r 9(4), the Hong Kong court has jurisdiction to issue examination orders against officers of corporate judgment debtor resident inside and outside Hong Kong and to grant leave to serve such orders on the officers out of the jurisdiction. The Hong Kong regime of issuing examination orders and serving out is very similar to that in Singapore. I respectfully adopt the reasoning of Lord Mance inMasriand the approach of the Singapore Court of Appeal inBurgundy Global, in the exercise of the court’s discretion in granting leave to issue examination order out of the jurisdiction against officers of a judgment debtor.The fundamental questions are whether the foreign officer has knowledge of the corporate debtor’s finance and is so closely connected to the substantive claim that the court is justified in taking jurisdiction. 23. I agree with the Singapore Court of Appeal that the officer’s knowledge of the finance of the judgment debtor is a prerequisite for invoking the court’s jurisdiction. If the officer has no knowledge of the finance of the debtor or if the extent of his knowledge is not even of marginal utility, the question of service out does not even arise. That knowledge is information in the possession of the officer. It is a prerequisite rather than part of the close connection as could justify overriding the jurisdiction of the foreign state over its own nationals within its geographical jurisdiction. As the knowledge is something personally known to the officer and not to the applicant, what the applicant has to prove is its subjective belief on reasonable grounds that the officer has knowledge of the finance of the corporate debtor. This threshold is not a particularly high one, particularly at theex partestage. [emphasis added] Thus, as with the Singapore approach, the Hong Kong approach is to look for a close connection, albeit decided in the specific context of an EJD order. 54 That said, it is worth highlighting that the Hong Kong approach differs from the Singapore approach in two aspects. First, while Deputy High Court Judge To agreed withBurgundythat the officer’s knowledge of the finance of the judgment debtor is a prerequisite for invoking the court’s jurisdiction (seeChangfeng Shippingat [23]), he preferred to formulate the close connection test along the lines ofThe Ikarian Reefer(No 2)(at [24]). Thus, the discretion is exercisable where there is a close connection between the officer’s conduct in relation to the action from which the judgment debt arose and the subject matter of that action which makes it unjust not to exercise the jurisdiction. However, it should be remembered this was in the specific context of an EJD order. 55 Second, Deputy High Court Judge To did not accept that the discretion to exercise jurisdiction should be sparingly exercised (seeChangfeng Shippingat [28]). In this regard, the learned judge held that while special care should be taken in exercising long-arm jurisdiction, the Hong Kong courts have always taken a robust approach. They should therefore continue to adopt a pragmatic, instead of an unnecessarily restrictive approach, given the internationalisation of commercial activities in the jurisdiction (at [31]). 56 From the above, the broader point is that the approach taken inBurgundyhas been endorsed by the Hong Kong courts inChangfeng Shipping. Despite the presence of some differences in the formulation of the close connection test, the gist of it is thatChangfeng Shippingagreed with the rationale underlyingBurgundy, and this bolsters the point that the close connection test is an appropriate test to be applied. Application to the present case 57 I turn now to apply the close connection test to the present case. In terms of the context-specific application of the close connection test, a significant factor is that the respondent is seeking leave to serve discovery applications on non-parties. Unlike the EJD orders inBurgundy, such applications are not intrusive and do not require the person against whom the application is made to attend court personally. Further, as the respondent argues, a person served with a subpoena to produce documents could comply by causing the documents to be produced without attending personally. Thus, I accept that unlike the discretion to grant leave to serve an EJD order out of jurisdiction, the discretion to grant leave in respect of non-party discovery applications need not be exercised quite as sparingly. 58 However, it remains the case that, whether the subject of the leave application to serve out of jurisdiction is an EJD order or a discovery application, the Singapore court is exercising extraterritorial jurisdiction over a non-party. Leaving aside the convenience (or inconvenience) to the party being served, this exercise of extraterritorial jurisdiction is still not a matter to be taken lightly. It is trite, as Hoffmann J put it inMackinnon, that a state should refrain from demanding obedience to its sovereign authority by foreigners in relation to their conduct outside of the jurisdiction. There must therefore still be a close connection shown on the facts, even if the threshold can be adjusted depending on the context. 59 With the above principles in mind, I find that the respondent does not satisfy the close connection test in relation to Mr George. This is for the simple reason that Mr George was not involved in the Audit. In this regard, I disagree with the respondent that Mr George’s role as the Reputation and Risk Leader of Deloitte China, which would involve managing risk and quality issues arising from Deloitte HK’s engagements, is relevant. As Mr George rightly points out, the respondent’s own position is that it does not assert any claim against Deloitte HK or Mr George. For these reasons, I do not see how Mr George could be said to be closely connected to the underlying claim. I therefore set aside the First Service Order against Mr George for the respondent’s failure to satisfy the close connection test, in addition to the respondent’s failure to disclose the material fact of Mr George’s non-involvement in the Audit at the First Leave Application. 60 As for Ms Tse, I find that the respondent has satisfied the close connection test. This is because she was involved in the Audit for one of the financial years concerned. I disagree with Ms Tse that this alone should not lead to the conclusion that she was so closely connected. Indeed, given also the relatively non-draconian nature of a discovery application (as compared to a Mareva injunction, for instance), this amounts to a sufficiently close connection for the Singapore courts to exercise extraterritorial jurisdiction against Ms Tse. I therefore do not set aside the Second Service Order against Ms Tse.",
        "Conclusion": "61 In summary, I allow the appeal in respect of the AR’s decision in Summons 2153 but dismiss the appeal in respect of the AR’s decision in Summons 2154. 62 It remains for me to thank the parties, especially Mr Koh Junxiang, who appeared for the appellants, and Mr See Chern Yang, who appeared for the respondent, for their helpful submissions on what was an unexplored point of law concerning the applicable test to determine if leave should be granted to serve a summons on a non-party out of jurisdiction pursuant to O 11 r 8. 63 Unless the parties can agree on the appropriate costs order, they are to write in within 14 days of this judgment with their brief submissions on costs. Goh YihanJudicial Commissioner Koh Junxiang and Charis Toh (Clasis LLC) for the appellants; See Chern Yang, Premalatha Silwaraju, Joelle Tan and Joshua Quek Wen Chieh (Drew & Napier LLC) for the respondent."
    }
}