{
    "case_title": "Public Prosecutor vMohd Noor bin Ismail",
    "ncitation": "[2022] SGHC 66",
    "coram": "General Division of the High Court — Criminal Case No 32 of 2018Aedit Abdullah J3–5 August, 4 October 2021",
    "sections": {
        "Background": "6 On the night of 10 September 2015, in Malaysia, Zaini, Noor and a person referred to as “Apoi” packed 14 bundles containing not less than 249.63g of diamorphine into Zaini’s car.4Foot Note 4×Prosecution’s closing submissions dated 25 February 2019 (“PCS”) at para 8.The next morning, Noor drove the car (with Zaini inside) laden with the drugs into Singapore, to be delivered to Mutaleb. This was pursuant to a conspiracy involving all four parties (the three co-accused and “Apoi”).5Foot Note 5×PCS at para 8. 7 Noor and Zaini were arrested at Tuas Checkpoint upon their arrival. Zaini then made a number of monitored calls to Mutaleb. The Central Narcotics Bureau (“CNB”) arranged for a fake delivery to Mutaleb, who was then arrested.6Foot Note 6×PCS at paras 9–10. 8 Noor was charged under s 7 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”) read with s 34 of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”) for importing not less than 12 bundles containing 5,520.4g of granular/powdery substance which was analysed and found to contain not less than 212.57g of diamorphine (a Class A controlled drug listed in the First Schedule to the MDA), in furtherance of the common intention with Zaini.7Foot Note 7×Charge sheet filed on 30 December 2019 at p 2.Zaini also faced the same charge.8Foot Note 8×Charge sheet filed on 30 December 2019 at p 1. 9 Both Noor and Zaini indicated that they wished to plead guilty to the charges against them,9Foot Note 9×Notes of Evidence (“NE”) for 23 October 2018 at pp 2–4.but as required under s 227(3) of the CPC, the matter proceeded to trial. 10  Zaini gave evidence, which indicated that his involvement was limited to transportation.10Foot Note 10×PCS at para 27.Noor elected not to give evidence in his defence, choosing to remain silent.11Foot Note 11×NE for 22 November 2018 at p 13, line 11 to p 14, line 17.Mutaleb was convicted on the basis of Zaini’s evidence against him, as well as evidence from phone records, his actions on the day the drugs were brought into Singapore, the funds found on him and inculpatory portions of his own statements.12Foot Note 12×Grounds of Decision [2019] SGHC 162 at [32]–[81]. 11 I convicted all three co-accused of the charges after trial.13Foot Note 13×NE for 21 March 2019 at pp 2–4.However, Noor was not sentenced at the same time as the other two accused persons as the Prosecution applied to defer his sentencing, pending the resolution of other matters.14Foot Note 14×NE for 21 March 2019 at p 5, lines 3–20.During Noor’s sentencing hearing, the Prosecution tendered a certificate of substantive assistance (“CSA”) determining that Noor had substantively assisted the CNB in disrupting drug trafficking activities within and outside Singapore.15Foot Note 15×NE for 26 February 2020 at p 1, line 31 to p 2, line 8.I had also accepted that Noor was merely a courier.16Foot Note 16×NE for 26 February 2020 at p 2, lines 14–20.Hence, Noor fulfilled the requirements under s 33B(2)(a)–(b) of the MDA and qualified for alternative sentencing under s 33B(1)(a) of the MDA. Under the exercise of my discretion, Noor was accordingly sentenced to life imprisonment and 15 strokes of the cane, the stipulated statutory sentence.17Foot Note 17×NE for 26 February 2020 at p 4, lines 3–6. 12 Noor appealed against both his conviction and sentence. In the course of his appeal hearing, Noor made allegations in respect of the conduct of his previous counsel and in respect of an inducement, threat or promise made by the investigation officer. These allegations led to the present remittal which will consider these issues. References to “the Defence” shall be taken to refer to Noor’s case in this remittal hearing.",
        "Summary of the Defence’s arguments": "13 I am afraid that the Defence’s position appears to have shifted at various times on the precise allegations raised by Noor, including whether he was making an issue out of not seeing his trial counsel earlier. 14 Regarding the first allegation, Noor complains that the previous trial counsel, Mr Nicholas Aw Wee Chong (“Mr Aw”), had fallen so clearly below the objective standard of what a reasonable counsel would have done, and his inadequate legal assistance had caused a miscarriage of justice.18Foot Note 18×Second accused’s written submissions dated 6 September 2021 (“2AWS”) at para 6.Guidance on what a reasonable counsel would have done can be obtained from the various rules set out in the Legal Profession (Professional Conduct) Rules 2015 (“PCR”), which includes the need for a legal practitioner to keep proper contemporaneous records of interactions with the client.19Foot Note 19×NE for 4 October 2021 at pp 3–4. 15 Mr Aw failed to keep proper contemporaneous records of the advice he had rendered to Noor at critical junctures of the case, such as whether Noor should have remained silent or to give evidence at trial.20Foot Note 20×NE for 4 October 2021 at p 5, lines 10–27.In the attendance notes which were available, there was nothing to show that Mr Aw had advised Noor on the “available options” (ie, to contest the case or to co-operate with a view to obtaining a CSA).21Foot Note 21×NE for 4 October 2021 at p 5, lines 1–7.Mr Aw also failed to engage and pursue Noor’s defence that he had no knowledge of the drugs in question.22Foot Note 22×NE for 4 October 2021 at p 7, lines 5–10 and lines 20–26.The court should therefore draw an adverse inference against Mr Aw’s testimony that he had properly advised Noor as there were missing attendance notes.23Foot Note 23×NE for 4 October 2021 at p 8, lines 5–7 and p 9, lines 3–11. 16 Furthermore, the Defence argues that Mr Aw had formed a view about Noor’s case that it was best for him to admit knowledge and co-operate with the authorities (rather than raise any defence).24Foot Note 24×2AWS at para 65.This is borne out from the fact that in the 19 November 2018 statement that was recorded after Mr Aw had advised Noor on 16 October 2018, Noor had suddenly changed his story and admitted to having knowledge of the drugs in question (contrary to his previous statements where he denied having such knowledge).25Foot Note 25×2AWS at paras 218–219; NE for 4 October 2021 at p 9, lines 22–32 to p 10, lines 1–18. 17 Even if Noor had made an informed decision choosing not to give evidence at trial, this was made on a Hobson’s choice as there were no options left for him because Noor was unsure if Mr Aw would assist him if he took the stand (as Noor was always told by Mr Aw to be co-operative with the authorities).26Foot Note 26×2AWS at para 65; NE for 4 October 2021 at p 11, lines 13–20 and p 14, lines 12–17. 18 In essence, Mr Aw failed to give proper advice and assistance as he held on to the mistaken conclusion that Noor could not contest the charge and told Noor to admit to the offence without asking about his defence.27Foot Note 27×2AWS at para 29b; NE for 4 October 2021 at p 15, lines 15–18.Further, Noor had not been allowed by Mr Aw to take the stand to give evidence,28Foot Note 28×2AWS at para 29c; NE for 4 October 2021 at p 15, lines 18–21.and in any event, Noor felt that he had no choice but to opt to remain silent as he believed that Mr Aw would not help him otherwise.29Foot Note 29×2AWS at paras 77–78.Mr Aw’s conduct of the case fell below the objective standard expected of reasonable counsel and led to a real possibility of a miscarriage of justice, within the meaning laid down inMohammad Farid bin Batra v Public Prosecutor and another appeal and other matters(“Mohammad Farid”) [2020] 1 SLR 907 at [135]. Otherwise, the charge against Noor could have been contested and a different result could be obtained other than a conviction.30Foot Note 30×2AWS at paras 84–85. 19 The Defence also made submissions regarding the fact that Mr Aw did not visit Noor for two years while he was in remand.31Foot Note 31×2AWS at paras 53–62.However, the Court of Appeal had already rejected this allegation and was of the view that this part of the complaint was unsustainable.32Foot Note 32×CA minutes at timestamp 1435hrs.Nevertheless, in oral submissions, the allegation seemed to shift to being that even if Mr Aw had visited Noor approximately ten months after he was appointed, this was still unreasonable conduct as multiple pre-trial conferences were conducted in the meantime and Noor was not regularly updated.33Foot Note 33×NE for 4 October 2021 at p 12, lines 5–18 20 Regarding the second allegation, the Defence submits that the investigation officer who recorded Noor’s statements, Deputy Superintendent Prashant Sukumaran (“IO Prashant”), had issued threats to Noor in order to obtain his admission.34Foot Note 34×2AWS at para 28. 21 The Defence argues that IO Prashant had given a fictitious account of events to Noor concerning an additional bundle of drugs that was found in Zaini’s car with the intention of obtaining an admission from Noor.35Foot Note 35×2AWS at paras 33–35; NE for 4 October 2021 at p 15, lines 28–32.IO Prashant did not inform Noor that the additional bundle had been found earlier through a scan of the car and he made it seem as though the bundle was just discovered.36Foot Note 36×NE for 3 August 2021 at p 15, lines 23–32.However, this attempt to secure an admission from Noor was unsuccessful. The Defence claims that this also sets the backdrop of why IO Prashant had to issue a threat to Noor on 5 November 2015 – as IO Prashant was unable to obtain the information he needed.37Foot Note 37×2AWS at para 36; NE for 4 October 2021 at p 16, lines 4–7 and lines 11–14. 22 The Defence alleges that IO Prashant had told Noor that he would be sentenced to hang if he did not admit that he knew that Zaini was bringing drugs into Singapore.38Foot Note 38×2AWS at para 37.The fact that such a threat was made is evidenced by the attendance notes of Mr Aw on 12 April 2018.39Foot Note 39×2AWS at paras 50–51; NE for 4 October 2021 at p 16, lines 14–19.It is also relevant to highlight that the Defence takes the rather unconventional position that although the threat did not operate on Noor, this had placed him in a “dilemma” and affected his decision-making process on whether to co-operate with authorities later on when considering the advice of Mr Aw.40Foot Note 40×2AWS at paras 38–41; NE for 3 August 2021 at p 18, lines 18–23.",
        "Summary of the Prosecution’s Arguments": "23 To begin with, the Prosecution points out that a breach of the PCR does not automatically mean that there is inadequate legal assistanceper se.41Foot Note 41×NE for 4 October 2021 at p 21, lines 6–7.Notwithstanding the missing attendance notes on some occasions, there was still quite a number of attendance notes and instructions present, which demonstrates that proper advice was rendered.42Foot Note 42×NE for 4 October 2021 at p 21, lines 8–21. 24 Noor had instructed Mr Aw to try to reduce the capital charge by writing to the Attorney-General’s Chambers (“AGC”) by way of representations, and that if this was not successful, then Noor wished to defend the case – this must have flowed logically from Mr Aw having advised Noor on his available options.43Foot Note 43×NE for 4 October 2021 at p 21, lines 20–31.Other attendance notes also showed that Mr Aw had laid out options for Noor and did not force him to admit to knowledge of the nature of the drugs.44Foot Note 44×Prosecution’s submissions dated 24 September 2021 (“PS”) at paras 14–15; NE for 4 October 2021 at p 22, lines 1–26. 25 Mr Aw did not force Noor to remain silent and to not take the witness stand as evidenced by an attendance note on 24 October 2018 which suggested that there was a discussion of trial strategy.45Foot Note 45×NE for 4 October 2021 at p 23, lines 1–10.The “admission” by Noor that was supposedly done on Mr Aw’s advice in the 19 November 2018 statement, was not an admission to the knowledge of the nature of drugs (required to make out the offence) and Noor goes on to state that he had no involvement at all.46Foot Note 46×NE for 4 October 2021 at p 24, lines 13–23. 26 The evidence of Mr Aw and the assisting counsel, Mr Mahadevan Lukshumayeh (“Mr Mahadevan”), should be preferred.47Foot Note 47×NE for 4 October 2021 at p 23, lines 10–18.Mr Mahadevan was present at most interactions with Noor and corroborated Mr Aw’s version of events that Noor was not forced to admit to knowing that Zaini brought drugs into Singapore and Noor was not prevented from giving evidence in court.48Foot Note 48×PS at paras 17–20. 27 The Prosecution argues that Noor had made an informed decision not to give evidence in the original trial.49Foot Note 49×PS at paras 33–34; NE for 4 October 2021 at p 23, lines 28–31 to p 24, lines 1-12.Noor testified that Mr Aw had prevented him from doing so and that this could be verified by asking the court interpreters.50Foot Note 50×PS at para 24.However, the court interpreters confirmed that Mr Aw did not ask them to interpret and relay instructions to Noor, telling him not to take the stand.51Foot Note 51×PS at paras 28–29; NE for 4 October 2021 at p 25, lines 18–21.The test inMohammad Faridhas not been met. 28 As for the allegations against IO Prashant, the two statements recorded by IO Prashant on 5 November 2015 did not even contain an admission by Noor as to his knowledge of the nature of the drugs, which meant that any alleged threats that were made did not even operate on Noor.52Foot Note 52×PS at paras 42–44; NE for 4 October 2021 at p 24, lines 28–32.For completeness, the denial of knowledge by Noor was maintained consistently in his earlier statements recorded in September 2015 and in his later statements recorded on 9 October 2018 and 19 November 2018.53Foot Note 53×PS at para 43. 29 The reason why IO Prashant did not inform Noor of the circumstances surrounding when the additional bundle of drugs was found in the car was because he wanted to provide Noor with an opportunity to give his version of events.54Foot Note 54×PS at para 46.This was not to trick Noor into giving information. Hence, IO Prashant did not record the statements on 5 November 2018 with the intention of securing an admission (just because he was unable to get the information he wanted).55Foot Note 55×PS at para 45. 30 The Prosecution submits that IO Prashant’s account, where he denied telling Noor to admit to knowing that Zaini had brought in drugs and that Noor would be sentenced to death if he did not do so, is to be preferred. This is supported by the evidence of the interpreter who was present and assisting IO Prashant during the recording of the two statements on 5 November 2018.56Foot Note 56×PS at paras 47–48; NE for 4 October 2021 at p 24, lines 24–28.",
        "The decision": "31 There are two broad issues before me: (a) Whether there was inadequate legal assistance by Mr Aw which breached the required standard laid down inMohammad Farid, leading to a real possibility of a miscarriage of justice. (b) Whether any admission made by Noor in his statements recorded by IO Prashant was caused by the alleged inducement, threat or promise made by IO Prashant, and whether this would affect the position of Noor in considering the advice given by Mr Aw. 32 Having considered the evidence and arguments, I find that the conduct of Mr Aw did not breach the standards expected, and that there was no real possibility of a miscarriage of justice. 33 I also find that there was no inducement, threat or promise made by IO Prashant. Even if any threat was made, there is no assertion that it led to the involuntary giving of any statement. This allegation was therefore immaterial and irrelevant.",
        "Issue 1: Whether there was inadequate legal assistance": "34 It was common ground between the parties that the governing standard in determining whether there was inadequate legal assistance is the Court of Appeal’s decision inMohammad Farid(at [134]) which laid down a two-step approach: firstly, to assess the previous counsel’s conduct of the case and secondly, to assess whether such conduct affected the outcome of the case, in that it resulted in a miscarriage of justice. 35 The Court of Appeal then elaborated upon the analysis to be conducted under the first step (Mohammad Faridat [135]): 135 An appellant seeking to overturn his conviction on the basis that he did not receive adequate legal assistance must show that the trial counsel’s conduct of the case fell so clearly below an objective standard of what a reasonable counsel would have done or would not have done in the particular circumstances of the case that the conduct could be fairly described as flagrant or egregious incompetence or indifference. In other words, the incompetence must be stark and glaring. Certainly, it will not be enough to show that some other counsel, especially eminent or experienced ones, would have taken a different approach or perhaps would have been more combative towards the Prosecution’s witnesses. As long as counsel, whether at trial or on appeal, are acting in accordance with their clients’ instructions and in compliance with their duty to the court and their professional obligations, they must be given the deference and the latitude in deciding how to conduct the case after studying all the evidence and the applicable law. Legitimate and reasonable strategic or tactical decisions do not come within the very narrow class of cases where inadequate assistance of counsel can be said to have occurred. 36 If inadequate legal assistance from previous counsel is proved under the first step of the inquiry, then subsequently under the second step, a nexus must be shown between the counsel’s conduct of the case and the court’s decision in the matter (Mohammad Faridat [138]), namely, “that there is a real possibility that such inadequate assistance has caused a miscarriage of justice on the particular facts of the case” (Mohammad Faridat [139]). 37 While the Court of Appeal did not specify the appropriate standard of proof, this would presumably require the Defence to only raise a reasonable doubt.",
        "Conduct of the trial counsel": "38 I find that the conduct of the trial counsel complained of did not, except in one area, fall short of the standards required. While there could have perhaps been better engagement and fuller discussions by the trial counsel, I cannot find that there was flagrant or egregious incompetence or failings in this case. 39 Essentially, while not expressly sorted as such by Noor, the complaints raised against Mr Aw may be categorized as follows: (a) not giving and recording proper advice, in relation to contesting the charge, including, concluding that the best course of action was to admit to knowledge of the drugs and to co-operate with authorities;57Foot Note 57×2AWS at para 63. (b) not advising on the decision to testify and not allowing Noor to take the stand at trial;58Foot Note 58×2AWS at para 77.and (c) not visiting Noor sufficiently while he was in remand.59Foot Note 59×2AWS at para 53. Not advising Noor to contest the charge 40 The complaint concerning the failure to render proper advice to Noor failed. The giving of legal advice calls for the exercise of judgment and skill. It is not enough to point to a different approach being possible, reasonable, or even desirable. What must be shown is that the trial counsel failed in his judgment and consideration to the extent that it fell far short of the expected standard,ie, that no reasonable lawyer of reasonable competence could have come to such a conclusion or conducted himself in such a manner. (1) The absence of attendance notes of the advice given 41 The Defence argues that Mr Aw failed to produce the attendance notes capturing a discussion of advice to Noor on whether to contest the charge or to co-operate. An adverse inference should thus be drawn.60Foot Note 60×NE for 4 October 2021 at p 8, lines 3–7.What can also be inferred is that there was no such record made, which is a breach of r 5(2)(k) of the PCR which requires one to “keep proper contemporaneous records of all instructions received from, and all advice rendered to, the client”,61Foot Note 61×NE for 4 October 2021 at p 3, lines 28–30 and p 4, lines 10–17.thus showing a failure to meet the objective standards required of counsel. 42 The Prosecution argues that notwithstanding some of the missing attendance notes, there are other attendance notes and instructions which demonstrates that Noor was properly advised, and that even if there was any failure to record each interaction, a breach of the PCRper sedoes not automatically mean that there is inadequate legal assistance.62Foot Note 62×NE for 4 October 2021 at p 21, lines 6–13. 43 As noted above at [34], the governing standard is that as laid down inMohammad Farid, which requires the counsel’s conduct of the case to fall so clearly below an objective standard, such that it raises a real possibility of a miscarriage of justice. A breach of the PCR provisions may not always amount to such egregious or flagrant conduct leading to a real possibility of a miscarriage of justice. The obligations under the PCR are a matter of professional responsibility, and whether the trial counsel has breached the PCR provisions is a separate matter for a different forum. 44 As stated by the Court of Appeal inMohammad Farid(at [136]), the spectrum of a legal practitioner’s duties to his client in a criminal case includes “advising a client on whether to plead guilty or to claim trial, whether to accept an offer made as part of plea bargaining, on matters prior to and during trial and also on whether to appeal and the grounds for doing so”. It is immediately clear that the PCR has obligations much wider than these core duties, some of which have nothing to do with (or are merely tangential to) whether an accused is provided adequate legal assistance in the criminal proceedings. 45 Much depends on the gravity of the breach and the type of PCR obligation in question. For example, inZhou Tong and others v Public Prosecutor[2010] 4 SLR 534 (“Zhou Tong”), the counsel had failed to undertake any legal research and did not provide sentencing precedents to substantiate his clients’ positions (Zhou Tongat [8]). The counsel was “dreadfully unprepared” and had manifested a “disturbingly careless attitude” towards the matter (Zhou Tongat [11]). There was no doubt that the counsel had fallen short of the standards laid down in the previous version of the PCR relating to, amongst other obligations, the need to act with diligence and competence (Zhou Tongat [14]–[16]). It was in this context of inadequate legal assistance rendered by counsel that theobiterobservation was made that it could have resulted in a miscarriage of justice (Zhou Tongat [2]). 46 Here, the failure to keep contemporaneous records is not the kind of breach that would immediately imply that counsel’s conduct of the case fell so clearly below an objective standard. However, I will reiterate what the Court of Appeal had advised inMohammad Farid(at [151]) that it is indeed good practice for counsel to keep written records and notes when interacting with clients as it could protect them against unwarranted allegations in future. This is connected to the next point, which is that a legal practitioner who fails to keep contemporaneous records does so at his own peril. 47 In the absence of contemporaneous records, the court may come to a view that an adverse inference should be drawn against the legal practitioner:Law Society of Singapore v Leong Pek Gan[2016] 5 SLR 1091 at [48]. While the absence of attendance notes does not by itself deprive the legal practitioner’s testimony of all credibility (seeLaw Society of Singapore v Tan Phuay Khiang[2007] 3 SLR(R) 477 at [83]), the veracity of the legal practitioner’s account could be doubted more readily due to this handicap. 48 Mr Aw was unable to produce all the attendance notes detailing his interactions with Noor. Mr Aw testified that some of them were located at his previous law firm and he had difficulty accessing them.63Foot Note 63×NE for 4 August 2021 at p 30, lines 17–20.Nevertheless, I do not find it necessary to draw an adverse inference against Mr Aw’s testimony that he had properly advised Noor on his options, as there were other attendance notes and written instructions present. While there were no attendance notes produced by Mr Aw which directly showed that he had advised Noor on the option of contesting the charge,64Foot Note 64×NE for 4 August 2021 at p 35, lines 8–10.the remaining documents can provide the context of what was advised. I do not, therefore, make an adverse inference. (2) Advising Noor not to contest the charge against him 49 The primary complaint was that Mr Aw reached the conclusion that in the circumstances, the better course of action was for Noor to co-operate with the authorities and admit that he had knowledge, rather than contest the charge against him even though Noor had constantly denied knowledge of Zaini bringing drugs into Singapore. As such, Mr Aw did not allow Noor to raise his defence. (A) The Defence’s arguments 50 The Defence contends that it is clear that Mr Aw had formed such a view from the attendance note of 3 April 2018 which stated in the relevant part:65Foot Note 65×Conditioned statements of Prosecution witnesses filed on 21 October 2021 (“CSPW”) at p 915–916. … Explain capital offence - death Unless certificate – live v death  Accused carried everything He did not know Did not check coz it was his car … From the first two lines in the quoted excerpt, Mr Aw had explained to Noor that he was charged with a capital offence, and that he would be facing the death penalty unless he obtained a CSA. It was either one or the other. These were the only two options that Mr Aw had laid out for Noor to choose from, and the Defence argues that there is no indication in this attendance note that there was the third option for Noor to contest the charge against him.66Foot Note 66×2AWS at para 65–68.This was despite the fact that, in the next three lines of the quoted excerpt, Noor had informed Mr Aw that it was Zaini who had “carried everything”, that Noor “did not know” that there were drugs in the bundles and Noor did not check.67Foot Note 67×NE for 4 October 2021 at p 7, lines 5–10.The Defence claims that no third option, to contest the charge and engage the defence of a lack of knowledge, was laid out by Mr Aw for Noor because his assessment of the case was that the evidence against Noor was overwhelming.68Foot Note 68×2AWS at para 69. 51 Again, at a meeting with Noor on 12 April 2018, Mr Aw only listed two options for Noor, either to challenge his statements via avoir dire, or to co-operate with authorities with a view to obtaining a CSA.69Foot Note 69×2AWS at paras 70–71; NE for 4 October 2021 at p 7, lines 20–22.However, Noor’s defence relating to his lack of knowledge was never pursued and there was no third option.70Foot Note 70×NE for 4 October 2021 at p 7, lines 23–26.The relevant portion of the attendance note is as follows:71Foot Note 71×CSPW at p 918. … Option A – trial challenge voir dire Option B – don’t challenge, cooperate , have chance Will consider if he is courier – cooperation … Though Mr Aw denied that it was his plan for the trial to argue that Noor was a courier, to try to obtain a CSA, and to not cross-examine the Prosecution’s witnesses to show co-operation, the Defence submits that the attendance notes strongly suggest that this was the case.72Foot Note 72×2AWS at paras 72–73. 52 Lastly, the fact that Mr Aw had essentially pressured and advised Noor into admitting that he had knowledge of the drugs can be inferred from the attendance note of 16 October 2018, which provides in part:73Foot Note 73×CSPW at p 922. … If no cert – can we fight His statements are damning … The Defence argues that this note is important as Noor had changed his position from not admitting to knowing that Zaini was bringing drugs into Singapore (in his earlier 9 October 2018 statement) to admitting that he had knowledge of this (in the further statement on 19 November 2018).74Foot Note 74×NE for 4 October 2021 at p 9, lines 18–32 and p 10, lines 2–4.This change in position was brought about because Mr Aw formed the view that Noor’s statements were “damning” and the evidence against Noor was overwhelming.75Foot Note 75×2AWS at paras 69; NE for 4 October 2021 at p 10, lines 9–13. (B) The Prosecution’s arguments 53 The Prosecution argues that the evidence showed that the trial counsel did not advise Noor to admit to knowing that Zaini had brought drugs into Singapore.76Foot Note 76×PS at para 11.Under cross-examination, Mr Aw maintained that he had advised Noor on the available options, including, to contest the case or to co-operate with a view to obtaining a CSA.77Foot Note 77×NE for 4 August 2021 at p 17, lines 26–31.This can be seen in the written instructions from Noor on 3 April 2018 which stated in the relevant part:78Foot Note 78×CSPW at p 926. … 1. PLEASE WRITE TO AGC TO HAVE CAPITAL CHARGE REDUCED. 2. IF NOT SUCCESSFUL I WISH TO DEFEND MY CASE. 3. I AM AWARE OF THE CONSEQUENCES OF DEFENDING THE CASE, THAT I MAY FACE THE DEATH PENALTY IF CONVICTED. … This excerpt of Noor’s multi-tiered instructions to Mr Aw must have logically flowed from some advice to him on his available options. Amongst the advice would be that Noor was facing a capital charge and that writing to the AGC by way of representations is one way to reduce the capital charge; and if this is not successful, then defending the case is another option.79Foot Note 79×NE for 4 October 2021 at p 21, lines 20–31.In other words, Mr Aw was not forcing Noor to admit and to co-operate. Mr Aw elaborated that in the attendance note on 3 April 2018, he merely sought to explain what a capital offence meant and to outline options for Noor.80Foot Note 80×PS at para 14. 54 The outlining of options by Mr Aw is also clearly evident from the 12 April 2018 attendance note where “Option A” and “Option B” were laid out for Noor and Mr Aw explained that Noor could either dispute the charge or co-operate with the CNB.81Foot Note 81×PS at para 14; NE for 4 October 2021 at p 22, lines 1–8.Again, the Prosecution submits that Mr Aw did not force Noor to take a particular course of action, but had explained the options and left the choice to him. 55 Turning to the subsequent written instructions by Noor on 16 October 2018, the Prosecution submits that the instructions did not show that Noor was forced by Mr Aw to admit to knowledge of the drugs, but that rather, Noor understood that he merely had to tell the truth about his role to the investigation officer.82Foot Note 82×NE for 4 October 2021 at p 22, lines 9–26.The relevant portion is as follows:83Foot Note 83×CSPW at p 927. … 1. I UNDERSTAND THAT I HAVE TO TELL THE TRUTH ABOUT MY ROLE TO THE IO. 2. I AGREE THAT I WILL SPEAK WITH THE I.O. AND INFORM ME (HIM) EVERYTHING I KNOW 3. I ACKNOWLEDGE THAT THE CASE AGAINST ME IS VERY AGAINST ME AND THAT I MAY STAND A BETTER CHANCE COOPERATING WITH THE DPP/CNB, TO GET A CERTIFCATE [sic]. 4. I UNDERSTAND THAT THE DECISION OF WHETHER I AM A COURIER IS FOR THE JUDGE TO DECIDE EVEN IF I HAVE A CERTIFICATE. … 56 In any event, the Prosecution submits that the fact that Noor repeatedly denied knowledge of the drugs in the further statements recorded, including the statement on 19 November 2018 (contrary to what the Defence asserts), supported Mr Aw’s testimony that Noor had not been asked to admit to having knowledge.84Foot Note 84×PS at para 16; NE for 4 October 2021 at p 24, lines 13–23.The assisting counsel, Mr Mahadevan, who was present at most interactions with Noor also corroborated Mr Aw’s version of events that Mr Aw did not force Noor into admitting to knowledge of the drugs.85Foot Note 85×PS at para 17–20; NE for 4 October 2021 at p 23, lines 13–18. (C) Determination on whether there was proper advice 57 Having looked through all the attendance notes and written instructions, my view is that Mr Aw had properly advised Noor on his options, and did not pressure Noor into admitting that he had knowledge of the drugs. A strategic decision was made. An assessment was reached that contesting the charge at trial would entail a risk of an adverse finding. The Court of Appeal inMohammadFarid(at [135]) stated that deference and latitude would be given to counsel in the conduct of the case, and the court would not question legitimate and reasonable strategic or tactical decisions. 58 To my mind, there was a logical sequence of events that culminated in the strategic choice made by Noor to co-operate with authorities, after Mr Aw had advised him on the appropriate options. 59 Starting with the attendance note on 3 April 2018 (reproduced in part above at [50]), it appears to me that Mr Aw had explained to Noor what the consequence of being charged with a capital offence entailed, and that if Noor did not obtain a CSA, the likelihood would be that he could possibly face the death penalty.86Foot Note 86×NE for 4 August 2021 at p 34, lines 25-–28 and p 35, lines 5–7.I cannot see how there was any exhortation by Mr Aw for Noor to take a particular course of conduct at this juncture. While it is true that within this attendance note, it seemed that Noor had highlighted to Mr Aw that he did not know that Zaini had carried drugs into Singapore, on the other hand, nothing in the attendance note demonstrates that Mr Aw had completely chosen to ignore the possibility of this defence. 60 There are also the written instructions by Noor on 3 April 2018 (reproduced above at [53]). Noor expressly mentioned that he would like to try to reduce the capital charge against him by way of representations to the AGC, and should this fail, that he wished to defend his case. This suggests that Mr Aw did not force Noor into admitting knowledge of the drugs and co-operating with authorities at this point in time. 61 Looking at the attendance note on 12 April 2018 (reproduced in part above at [51]), two options were outlined by Mr Aw to Noor in the form of “Option A” and “Option B”. Within “Option A” it was stated: “trial challengevoir dire”.87Foot Note 87×CSPW at p 918.The Defence interpreted that line to mean that the admissibility of Noor’s statements would be challenged, but this does not show that Noor’s defence of lack of knowledge was considered. I do not think that it is necessary to take such a restrictive reading of this line. During cross-examination, Mr Aw explained that “Option A” meant that Noor would go for trialandchallenge the statements via avoir dire.88Foot Note 88×NE for 4 August 2021 at p 17, lines 27-–28.It is inherent that in taking the case to trial, Noor would have to dispute the charge and raise every possible defence, including the fact that he did not know Zaini had brought drugs into Singapore. There was no need to detail what this defence would entail at this point, as it seemed that Mr Aw was still considering if Noor could be described as merely a courier as seen from the line right after he set out the two options: “Will consider if he is courier – cooperation”.89Foot Note 89×CSPW at p 918.No concrete decision had been taken yet and things were still up in the air. 62 I turn to the attendance note taken on 16 October 2018. From my reading of the note, for the most part, nothing suggests that Mr Aw was telling Noor to admit to having knowledge of the drugs. The most that can be said is that Noor understood that he had to be truthful and to proffer a complete account when giving statements to the investigation officer:90Foot Note 90×CSPW at p 922. … Will try again to speak to IO and tell everything  Truthfully and complete  To be less angsty and contrite Q – if he tells everything If no cert – can we fight His statements are damning … Further, it seems that a question was asked of whether “if he tells everything” to the investigation officer, and if “no cert” (ie, the CSA) was given, whether Noor could still “fight” the case. Once again, this meant that at this juncture, no decision had been made yet on whether to co-operate or to contest the charge. Options were being carefully weighed. 63 However, there is one portion of the attendance note of 16 October 2018 which is open to some doubt, and the relevant portion is reproduced:91Foot Note 91×CSPW at p 923. Must admit to be a courier before  He just followed Zaini Statements say he knew about the drugs  Don’t question IO Don’t lie … What was recorded could be interpreted in a number of ways. On the one hand, it could have recorded an exhortation or advice by the trial counsel to Noor that he had to admit to being a drug courier but that his role was limited to following Zaini, and to perhaps give statements stating that he knew about the drugs. On the other hand, the note is also capable of being interpreted to mean that the statements recorded earlier from Noor indicated that he knew about the drugs. Mr Aw’s explanation for this note was that the statements suggested that Noor knew about the drugs,92Foot Note 92×NE for 4 August 2021 at p 36, lines 1–2.and that Mr Aw did not tell Noor to inform authorities that he had knowledge of the drugs.93Foot Note 93×NE for 4 August 2021 at p 36, lines 6–8.I am more inclined to take the latter interpretation and believe Mr Aw’s explanation. Mr Aw’s explanation is corroborated by that of assisting counsel, Mr Mahadevan, who went through the statements with Mr Aw at the material time. It was explained that while Noor’s statements were not directly pointing to the fact that he had knowledge of the drugs, there were incriminating aspects where Noor explicitly detailed what he saw and did, and where Noor conceded that he could have asked Zaini about certain things.94Foot Note 94×NE for 4 August 2021 at p 53, lines 26–32.Further, if we look further down the attendance note, the only exhortations that can be found are “[d]on’t question IO” and “[d]on’t lie”. It is clear that Mr Aw advised Noor to be truthful in his statements and to not antagonize the investigation officer, but not necessarily to admit to having knowledge of the drugs. 64 The written instructions dated 16 October 2018 from Noor to Mr Aw supports what has been set out in the 16 October 2018 attendance note. In the first two paragraphs from the relevant portions of the written instructions (reproduced at [55] above), we are told that Noor understood that he had to tell the truth about his role to the investigation officer and to inform of everything he knew. Once again, nothing shows that Mr Aw had coerced him into admitting that he had knowledge of the drugs, but he was only told to “tell the truth”. Moving down the document, the third paragraph of the 16 October 2018 written instructions is crucial. It suggests that Noor had finally chosen to make an election after weighing his options, as he acknowledged that the case was against him and that he “may stand a better chance cooperating” with the relevant authorities to get a CSA. In the fourth paragraph, Noor also understood that even if he obtained a CSA, it was for the “judge to decide” if he could be considered as being merely a courier. Hence, it is clear that Mr Aw had never forced Noor to admit to knowledge of the drugs and that Noor made a strategic choice after weighing his options. Ultimately, Noor did not pursue his defence that he lacked knowledge of the drugs and contest the charge against him as he had expressly chosen to take on a different course, and not because Mr Aw repeatedly told him not to contest the case. As such, Noor’s allegation against Mr Aw on this score does not meet the first step of the two-step approach laid out inMohammad Farid. Mr Aw was not acting incompetently and did not wrongfully coerce Noor into abandoning a potentially viable defence. 65 In any event, I agree with the Prosecution that the further statement taken from Noor on 19 November 2018 (where Noor supposedly admitted to knowledge of the drugs) was not actually an admission as to the knowledge of the nature of the controlled drug in question, which is required to make out the offence.95Foot Note 95×NE for 4 October 2021 at p 24, lines 13–17.To make out the offence of drug importation under s 7 of the MDA, there must be knowledge of the nature of the drugs – which refers to “knowledge of the actual controlled drug referred to in the charge” (seePublic Prosecutor v Muhammad Shafiq bin Shariff[2021] 5 SLR 1317 at [15]). In the 19 November 2018 statement, Noor merely said that he saw Zaini taking out plastic bundles from a haversack containing a “brown substance” and Zaini told him that “it is drug[s] but never told [him] what kind of drugs”.96Foot Note 96×Defence bundle of documents filed on 11 August 2021 (“DBD”) at p 35, para 62.In other words, this was not an admission as to the knowledge of the nature of drugs required for the offence. Noor also goes on to deny any involvement in the latter part of the statement.97Foot Note 97×DBD at p 35, para 64. (3) Not listening or taking instructions 66 The Defence points to what they argue to be Noor’s consistent and constant denial of knowledge of the drugs. Noor maintained that he thought that Zaini had been dealing with fertilizer on at least three separate occasions in 2018.98Foot Note 98×2AWS at para 75.Thus, another aspect of the challenge to the advice given seemed to be that Mr Aw did not abide by the instructions given by Noor to raise this defence (which overlaps with the points made above). The difficulty I have with this contention is that the evidence before me fell short of showing that there was an adamant and unequivocal assertion of that at the material time by Noor to Mr Aw. What was on evidence pointed otherwise. 67 The Prosecution highlights that the assisting counsel, Mr Mahadevan, supported Mr Aw’s version of events, and no evidence was given to undermine Mr Mahadevan’s evidence in this regard. Mr Mahadevan explained that they had always abided by the instructions of Noor. While Noor wanted to maintain the position denying knowledge of the drugs, Mr Aw and Mr Mahadevan were concerned about whether that position could be sustained as certain aspects of the statements given by Noor were incriminating.99Foot Note 99×NE for 4 August 2021 at p 53, lines 26–32 to p 54, line 1.Further, Noor was very confident in holding on to that position as Zaini had allegedly promised him to inform the court and the investigation officers that Noor did not have knowledge of the drugs and the transactions.100Foot Note 100×NE for 4 August 2021 at p 54, lines 1–3.However, Mr Aw became concerned when he had checked with the lead counsel for Zaini on whether this was true, and realised that there was “[n]o such thing” (ie, Zaini was not going to exculpate Noor).101Foot Note 101×NE for 4 August 2021 at p 54, lines 4–7.Nevertheless, despite these concerns, Mr Aw and Mr Mahadevan acted on Noor’s instructions to make representations to the AGC on the basis that Noor had no knowledge of the drugs and the transactions.102Foot Note 102×PS at para 19; NE for 4 August 2021 at p 54, lines 11–15. 68 In my view, while Mr Aw and Mr Mahadevan did express their disquiet on the viability of the position that Noor was taking, as any reasonable and competent counsel might, nothing suggests that they did not follow Noor’s instructions. 69 Furthermore, there was no settled conclusion after this. Mr Aw’s presentation of “Option A” and “Option B” to Noor as captured in the notes on 12 April 2018 was to highlight that there were two alternatives open to Noor – either to contest the charge or to co-operate. This was in accordance with Noor’s instructions as the option of contesting the charge was still on the table. 70 The other problem with this contention is that lawyers are not to be passive when engaging with their clients: they should not heedlessly follow what their clients say or want without further engaging with the matter. Counsel should advise, and in doing so, may disagree with the inclinations of their clients. Certainly, if the client were to insist, counsel may need to choose whether to abide by the wishes of their client or to discharge themselves. It must be remembered that the advocate is not merely the client’s unwitting or unthinking mouthpiece and should not be taking untenable positions that he cannot in good conscience advance, whilst hiding behind the veil of his client’s instructions (seePrometheus Marine Pte Ltd v King, Ann Rita and another appeal[2018] 1 SLR 1 at [70]). But until that point of final resolution is reached, it is expected that counsel would consider the law, the evidence, and weigh the likelihood of success. 71 I accept that, as observed from the 16 October 2018 written instructions, Mr Aw might have advised Noor that it may be better to co-operate given the merits of his case. I cannot see how else Noor could have come to the conclusion that he stood a better chance otherwise. But the suggestion of a better course to take is not the same as disregarding the client’s instructions. Here, while there did not appear to be extensive discussions about the viability of Noor’s defence, I cannot conclude that Mr Aw, in coming to the conclusion that he did that the interests of his client would be better served by co-operating with the authorities and avoiding the risks of challenging the Prosecution’s case, had fallen short of the required standard that applied under the first step inMohammad Farid(at [135]). 72 The determination made by Mr Aw was one based on a proper assessment of the law and evidence. Mr Aw’s considerations were not wanting, as there was evidence from his perspective pointing to the possible guilt of Noor. These included the fact that the bundles of drugs were found in the vehicle that Noor was driving, with a co-accused that did not absolve him, and that Noor’s own statements suggested that he might have had knowledge of the drugs given his detailed involvement in the process. Furthermore, the excuse given that Noor thought that he was coming into Singapore to secure a job or get a possible share of Zaini’s winnings at the casino is a very thin reason.103Foot Note 103×Prosecution’s bundle filed on 17 October 2018 (“PB”) at p 496–497, para 25. 73 It has not been Noor’s case that he gave an unequivocal and categorical instruction to contest the charge, which was not adhered to by the trial counsel. This would have jarred with his behaviour at the close of the Prosecution’s case in electing not to give evidence. Even leaving aside the election made, had there been an instruction given to counsel to contest the charge, one would have expected that Noor would have registered some protest or surprise at trial. There was nothing of that nature here. Not allowing Noor to testify 74 The Defence submits that Noor’s position was not that the trial counsel had prevented him from taking the stand, but rather, Noor felt that he had to follow the trial counsel’s advice not to take the stand, as he believed that Mr Aw would not help him otherwise.104Foot Note 104×2AWS at para 78; NE for 4 October 2021 at p 11, lines 13–18 and p 14, lines 9–15.Noor had decided on a Hobson’s choice. The Defence argues that Mr Aw had made it clear in his advice that he had advised Noor to remain silent. No attendance notes recorded the advice that was given, or instructions given about this, but it was consistent for the accused not to take the stand, given the trial counsel’s view that a CSA should be secured and the accused should not say anything to obstruct this.105Foot Note 105×2AWS at paras 81–82. 75 The Prosecution argues that Noor made an informed decision not to give evidence. Mr Aw had denied giving advice to Noor to remain silent, which was corroborated by the assistant counsel, Mr Mahadevan, who also emphasised that the decision to remain silent was Noor’s.106Foot Note 106×PS at paras 25–27.The two court interpreters who were present at the relevant time both said that Mr Aw had not asked them to tell Noor not to testify.107Foot Note 107×PS at paras 28–29; NE for 4 October 2021 at p 25, lines 17–21.Noor had been given the opportunity to give evidence; his choice was confirmed in court at the original trial.108Foot Note 108×PS at para 31; NE for 4 October 2021 at p 23, lines 28–32 and p 25, lines 14–17.The allegation that he had been prevented from giving evidence was raised belatedly, only in the submissions to the Court of Appeal more than one year after the original trial.109Foot Note 109×PS at para 32; NE for 4 October 2021 at p 25, lines 2–6.Even then, under cross-examination, Noor agreed that he had a choice to give evidence.110Foot Note 110×PS at para 33; NE for 4 October 2021 at p 25, lines 2–6.This supports Mr Aw’s testimony that Noor had told him that he did not wish to give evidence after seeing how Zaini had been cross-examined.111Foot Note 111×PS at para 32; NE for 4 October 2021 at p 24, lines 1–4. 76 I find that the decision not to testify was that of Noor’s – it was not alleged that he had been pressured or coerced. Rather, the argument of the Defence was that Noor was given bad advice, and should have been advised to testify. The difficulty with this position is that it does not explain why Noor initially indicated that he wanted to give evidence. 77 I do not think that Mr Aw had inadequately advised Noor on whether to take the stand. During cross-examination, Noor agreed that he had made a conscious choice whether to give evidence, and this was borne out of advice given to him:112Foot Note 112×NE for 3 August 2021 at p 50, lines 29–31 to p 51, lines 1–2. Q: But the choice was still yours, right? A: Yes. Q: So you agree that you had a choice of whether to take the stand or not? A:  Yes, but he did say to me that if I were to make mistakes in my evidence, I could spoil my own case. It seems to me that Noor had made an informed decision to not take the stand as he might undermine his own case if mistakes were made, stemming from advice given by Mr Aw. Further, I am inclined to believe Mr Aw’s version of events that Noor had deliberately chosen not to take the stand after witnessing Zaini being cross-examined in court.113Foot Note 113×NE for 4 August 2021 at p 39, lines 13–16.Mr Aw’s account is corroborated by Mr Mahadevan, who had accompanied Mr Aw when meeting Noor. Mr Mahadevan confirmed that it was Noor who took the initiative to inform the trial counsel that he did not want to give evidence.114Foot Note 114×NE for 4 August 2021 at p 48, lines 1–5. 78 This is also consistent with the evidence from the court interpreters which showed conclusively that there was no advice given in the courtroom from the trial counsel to Noor for the latter not to testify. Ms Nurfarhana binte Mohamed Rehan (“Nurfarhana”) was the interpreter on 21 November 2018 that was rendering the interpretation at the dock for Noor while Zaini was giving evidence.115Foot Note 115×CSPW at p 938, para 4.Noor alleged that Mr Aw advised him not to take the stand to give evidence after Zaini had given his evidence and that the court could ask the interpreter present on that day to confirm this as “[she] is the only witness who could prove the veracity” of this.116Foot Note 116×DBD at p 12, para 3.However, Nurfarhana stated the contrary – that after Zaini had testified, Mr Aw did not inform her to relay to Noor that he did not have to take the stand the next day.117Foot Note 117×CSPW at p 938, para 5.During cross-examination, Nurfarhana explained that she was certain that her recollection was accurate as no lawyer had ever asked her to interpret instructions to their client. If a lawyer had instructed her to do so, she would have remembered this as it was out of the norm.118Foot Note 118×NE for 4 August 2021 at p 60, lines 24–27.For completeness, there was another court interpreter assigned for the trial on 21 November 2018, Ms Mariana binte Osman, who states in her conditioned statement that Mr Aw did not ask her to convey to Noor that he did not have to take the stand the next day after Zaini had given evidence.119Foot Note 119×CSPW at p 936 at para 5. 79 Against the backdrop of the evidence of the court interpreters, all that Noor could respond was that these interpreters did not want to be involved in this case and that they had forgotten what happened.120Foot Note 120×NE for 3 August 2021 at p 56, lines 8–11.This bare assertion was unconvincing. 80 The court had also carefully confirmed with Noor twice on 22 November 2018 that he did not wish to testify.121Foot Note 121×NE for 22 November 2018 at p 13, lines 12–21 and p 14 lines 6–17.If there had been any question on his mind on the appropriate course of action, one would have expected him to have raised this in the open courtroom. If Noor thought that he was faced with a Hobson’s choice as he was unsure if Mr Aw would assist him if he took the stand, it would have been open to him to say to the court that he did not know what to do and had not been getting proper advice.122Foot Note 122×NE for 4 October 2021 at p 14, lines 18–22. 81 Even if Mr Aw did advise Noor not to take the stand, I cannot see that in fact, contrary to the trial counsel’s evidence, that any advice not to take the stand would have been faulted either. Again, the standard applied is not whether the advice was objectively correct, but whether the conduct fell so far short of what was expected that it could be described as flagrant or egregious incompetence or indifference, and that a real possibility of a miscarriage of justice would result. If the accused’s counsel, in conducting a case, made a decision or took a course which later appeared to have been mistaken or unwise, that, generally speaking, has never been regarded as a proper ground of appeal (seeJuma’at bin Samad v Public Prosecutor[1993] 2 SLR(R) 327 at [36]). In balancing whether or not adverse inferences would be drawn against the accused, or whether exposure to cross-examination would worsen the accused’s case, the court would not be overly astute in second-guessing the appropriate course of action taken by trial counsel, unless it is very clear that one course would be preferred in the discharge of the legal practitioner’s duty. This is not at all the case here. As will be discussed further below, Noor’s case in the present remitted hearing, in reality, hinges on the fact that his case could have been defended. That is not enough. Not visiting or consulting Noor earlier 82 The Court of Appeal noted that the allegation of insufficient frequency of visits by Mr Aw was rejected as there was evidence to show that Mr Aw had made a number of attempts to visit Noor and did in fact visit Noor on a number of occasions.123Foot Note 123×CA minutes at timestamp 1435hrs.However, at the remittal hearing and in the submissions before me, the question of the trial counsel not visiting Noor came up once more, though it was argued by the Defence to be in a slightly different context. The assertion was that a substantial period of time had passed (approximately ten months) after Mr Aw was appointed as Noor’s counsel before Mr Aw first visited Noor.124Foot Note 124×NE for 4 October 2021 at p 12, lines 1–12. 83 Between 18 May 2016 (the date Mr Aw was appointed as counsel) to 6 March 2017 (the date of the first meeting),125Foot Note 125×CSPW at p 878, paras 2 and 4.there were various pre-trial conferences which were conducted and which Mr Aw attended. The Defence questions how one could even convey the client’s position at the pre-trial conferences if Mr Aw had not even met Noor then.126Foot Note 126×NE for 4 October 2021 at p 12, lines 9–13.Further, Mr Aw did not keep Noor reasonably informed about what went on during the pre-trial conferences. The Defence argues that this conduct was in breach of r 5(2)(e) of the PCR, which requires a legal practitioner to “keep the client reasonably informed of the progress of the client’s matter” and amounts to unreasonable conduct.127Foot Note 127×NE for 4 October 2021 at p 12, lines 13–19. 84 Here, I raise some doubts about Mr Aw’s conduct. Not seeing Noor for approximately ten months after being appointed was somewhat lacking. When asked about this delay, Mr Aw explained that as a matter of practice, he would only meet with his client before the committal hearing as he was awaiting the relevant documents to be sent to him.128Foot Note 128×NE for 4 August 2021 at p 18, lines 7–18.That may well be Mr Aw’s practice, but in my view, a legal practitioner has a responsibility to counsel or engage with his client within a few months of assignment. I will not specify the frequency and when to commence the visits, but I would have expected some engagement before the next mention at the State Courts. 85 The failure to provide regular updates to the client on the progress of the matter regarding what was said in the various pre-trial conferences could also amount to a breach of the PCR (see,eg,The Law Society of Singapore v Yeo Kan Kiang Roy[2017] SGDT 7). Nevertheless, as identified by the Prosecution, the breach of the PCRper se, does not automatically mean that there was inadequate legal assistance.129Foot Note 129×NE for 4 October 2021 at p 21, lines 6–7.Taking into account the conduct of Mr Aw holistically, I do not think that his overall conduct of the case could fairly be described as involving flagrant or egregious incompetence or indifference. 86 Nothing in the above allegations demonstrated that Mr Aw’s conduct of the case fell so clearly below an objective standard of what a reasonable counsel would have done, and the first step in theMohammad Faridtest is not satisfied.",
        "Effect on hearing and determination": "87 I also cannot see that the facts disclosed enough of a possible defence to lead to the conclusion that Noor should have been advised to contest the charge; in other words, that he was ill-advised by Mr Aw to co-operate with authorities with a view to obtaining a CSA. Thus, even if the first step of theMohammad Faridtest had been satisfied, I do not find that there was a real possibility that the inadequate assistance had caused a miscarriage of justice on the particular facts of the case under the second step. 88 The Defence argues that there was enough to secure an acquittal, arguing that possession, knowledge of the nature of the drug and furtherance of the common intention were contestable. However, the Prosecution would still have been able to rely on the evidence of Zaini which implicated Noor. Zaini had testified and admitted he received drugs, that Noor assisted him in packing the drugs into the car, and that the both of them, in furtherance of their common intention, imported the drugs into Singapore.130Foot Note 130×Grounds of decision [2020] SGHC 76 at [18].The presumptions of possession under s 21 of the MDA and the presumption of knowledge under s 18(2) of the MDA would have applied to Noor as he drove the vehicle into Singapore knowing that the bundles were in the vehicle.131Foot Note 131×Grounds of decision [2020] SGHC 76 at [39]–[42].Noor also accepted in his statement that he should have asked Zaini what were in the bundles that were being delivered when he had the opportunity.132Foot Note 132×PB at p 636, para 58.Despite Noor feigning ignorance, I found in the earlier grounds of decision that his own statements supported that he had knowledge of the drugs given his elaborate involvement.133Foot Note 133×Grounds of decision [2020] SGHC 76 at [25]–[29].It would have been difficult for Noor to rebut these presumptions in light of the cogent evidence against him. As for what Noor would have testified and how he would have held up under cross-examination, that would also be speculative, and it cannot be said that his defence would have been made out. I do not think that the eventual outcome would be very much different. 89 The Defence makes a number of substantive arguments in their written submissions that goes beyond the issues to be ventilated for this remittal hearing. For example, the Defence argues that Noor cannot be said to have physical possession of the bundles of drugs as they were not on his person134Foot Note 134×2AWS at paras 143–144.-– but it is not clear to me that this is so. Similarly, as regards arguments put forward by the Defence on the issue of custody and control of the drugs,135Foot Note 135×2AWS at paras 145 and 148.or the application of the presumptions under the MDA,136Foot Note 136×2AWS at paras 152 and 168.these are matters of substance for the Court of Appeal to assess; and I will not go further into them. 90 It is only if the propositions of law were so clear and unambiguous, that no reasonable assessment would have pointed to the advice given by the trial counsel, that it could be concluded that an injustice would occur. Legal advice must of necessity point to a particular course of action whilst forsaking others, and choices have to be made. It is not enough to establish injustice by showing that a possible line of defence not pursued (if it was properly considered) was the better one, or that there was a possibility that his current defence could have been raised or made out. It must be remembered that legitimate and reasonable strategic or tactical decisions do not come within the very narrow class of cases where inadequate assistance of counsel can be said to have occurred (seeMohammad Faridat [135]). Accordingly, the Defence must show that either that the trial counsel ignored instructions (which had not been proven), or that the trial counsel clearly failed the objective standard showing egregious incompetence or indifference. It is always easy to comment on what could have been done better with the full benefit of hindsight and upon further reflection (see Nazeri bin Lajim v Public Prosecutor[2021] SGCA 41 at [29]). But as long as counsel has acted in accordance with the client’s instructions and their duty to the court, then they must be given deference in the assessment of how to conduct the case (seeMohammad Faridat [135]). 91 There is also no duty on the part of counsel to ensure that the accused is not in a quandary or has no uncertainty as to the course of action. It may be of little comfort to the client, but all litigation carries uncertainty and risk. The lawyer can only advise, but cannot eliminate that uncertainty or remove it from the mind of the client. When a lawyer makes an assessment on how to conduct the case, the relative risks and consequences would have to be taken into account as well. Where a capital sentence may be imposed, the risk of a conviction that warrants the death sentence must feature in the deliberation and advice. That no doubt is part and parcel of the current regime – those who are accused of capital drug offences must weigh the consequences of not rendering co-operation to the relevant authorities and forgo the possibility of obtaining a CSA.",
        "Issue 2: Whether there was an inducement, threat or promise made": "92 Noor alleges that IO Prashant had asked him to admit that he knew that Zaini had brought drugs into Singapore, and that if Noor did not admit, he would be sentenced to hang while Zaini would be released.137Foot Note 137×DBD at p 2. 93 Noor did not argue that the alleged inducement, threat or promise from IO Prashant led to the making of an involuntary statement. Rather, Noor’s position was stated in the submission as such:138Foot Note 138×2AWS at para 3. 3It is relevant to highlight the Appellant’s position that although threats had been made and/or inducements offered by IO Prashant, the Appellant had not given in to these when his statements had been recorded by IO Prashant. However, these threats and/or inducements did place him in a dilemma and in turn became relevant within the context of the allegations of improper legal advice advanced against his former counsel. 94 It seems that Noor is suggesting that the inducement, threat or promise did not operate on Noor, but it had placed him in a “dilemma” and affected his decision-making process on whether to co-operate with authorities subsequently.139Foot Note 139×2AWS at paras 38–41; NE for 3 August 2021 at p 18, lines 18–23.This goes against the grain of most allegations of inducement, threat or promise, which involves the giving of a false admission to escape such pressure, resulting in an involuntary statement being made. The relevant law relating to such allegations is captured in s 258(3) of the CPC which provides that “the court shall refuse to admit the statement of an accused” if the making of the statement appears to have been caused by any inducement, threat or promise having reference to the charge,etc. The section requires that the alleged inducement, threat or promise must have caused the accused to make the statement. I cannot see how Noor’s allegation fits into this provision. The issue would be moot if the inducement, threat or promise did not even operate on Noor and give rise to those impugned statements recorded by IO Prashant. 95 The Court of Appeal had elaborated upon the relevant principles when assessing the admissibility of a statement under s 258(3) of the CPC inSulaiman bin Jumari v Public Prosecutor[2021] 1 SLR 557 at [39]: 39 … The first stage considers objectively whether any inducement, threat or promise was made. This entails a consideration of what might be gained or lost as well as the degree of assurance (see, for example,Poh Kay KeongandIsmail bin Abdul Rahman v Public Prosecutor[2004] 2 SLR(R) 74). The second stage, which is the subjective limb, considers the effect of the inducement, threat or promise on the mind of the accused person. If Noor’s allegation is that there was an inducement, threat or promise (which satisfies the first objective stage of the inquiry), but that he did not give in to them when IO Prashant recorded his statements, then this would not satisfy the second stage of the inquiry, which is the subjective limb, as it did not operate on his mind. This alone would suffice to dispose of Noor’s allegation on this score. I cannot see how the fact that he was placed in a “dilemma” and felt as though he had to eventually admit to having knowledge of the drugs and to co-operate,140Foot Note 140×2AWS at para 41.is of any legal significance if the admission was not in his recorded statements. 96 Even if I were to take a charitable interpretation that Noor was alleging that he was under some form of oppression, Noor’s “dilemma” would not pass the litmus test for oppression. The test for oppression was whether the accused’s mind and will was sapped such that he spoke when he otherwise would have remained silent (Tey Tsun Hang v Public Prosecutor[2014] 2 SLR 1189 at [113]). In the present case, Noor’s free will cannot be said to be sapped, as Noor did not give in to the alleged inducement, threat or promise from IO Prashant but was instead, placed in a “dilemma”. In any case, this is not a typical situation of oppression which concerns whether the nature, duration or other attendant circumstances of the investigations was oppressive. Again, I cannot see how this allegation against IO Prashant is of any legal relevance then. 97 In any event, since serious allegations have been made against IO Prashant, their veracity will need to be considered. These allegations are that: (a) IO Prashant had lied to Noor to obtain an admission; and (b) IO Prashant had told Noor that he would hang if he did not admit to knowledge of the drugs.",
        "Lying to Noor to obtain an admission": "98 Noor alleges that IO Prashant had lied to him regarding the recovery of an additional bundle of drugs that was found in Zaini’s car. IO Prashant had informed him on 21 September 2015 that they were made aware of the bundle following a scan of the vehicle, but Noor claims that the results of the scan were already out much earlier and IO Prashant had lied to him.141Foot Note 141×DBD at p 1; NE for 3 August 2021 at p 15, lines 23–32 and p 16, lines 14–30.Apparently, the purpose of this lie was so that IO Prashant could try to deceive Noor into giving an explanation as to why there was this additional bundle in Zaini’s car.142Foot Note 142×2AWS at para 34–35. 99 To the contrary, IO Prashant denies that he had any ulterior motive and that he had offered an incomplete account to Noor in order to allow Noor to give his own account as to why there was the additional bundle in Zaini’s car.143Foot Note 143×NE for 4 August 2021 at p 11, lines 9–14.IO Prashant asserts that he never had the intention of securing an admission from Noor regarding knowledge of the drugs when recording his statements.144Foot Note 144×NE for 4 August 2021 at p 12, lines 17–21. 100 I do not find that IO Prashant had intended to mislead Noor into giving an admission. I cannot see that the approach that was taken by IO Prashant as described in the evidence was improper. It is within the acceptable bounds of conduct for an investigator to test what has been told to him – while the investigator is not the trier of fact, the police will need to sift through and eliminate possibilities in trying to determine whether there is reasonable suspicion of the commission of an offence. 101 In any event, this allegation does not hold water as I note that both of Noor’s statements recorded by IO Prashant on 5 November 2015 were negative as to Noor’s knowledge of the nature of the drugs or that Zaini had brought drugs into Singapore. Noor maintained that he did not know what were in the black bundles that Zaini had brought in and assumed that they contained “cigarettes” in the statement taken at 10.00am.145Foot Note 145×PB at p 619, para 40.This was again reiterated in the further statement taken at 2.30pm.146Foot Note 146×PB at p 635, para 54 and p 636, para 58.",
        "Threat that Noor would be hanged": "102 I do not accept that IO Prashant made any such exhortation or threat that Noor would be sentenced to hang if he did not admit to having knowledge that Zaini brought drugs into Singapore. In addition to IO Prashant’s own denial, the interpreter who assisted him during the recording of the statements on 5 November 2015, Mr Mohammad Farhan bin Sani (“Farhan”), had also supported IO Prashant’s denial. There was nothing before me to cast doubt on the versions given by them, and nothing was of the sort was raised in cross-examination. 103 Farhan confirms that IO Prashant never made such threats to Noor and that the allegation was untrue.147Foot Note 147×CSPW at p 935, para 3–4.Farhan was certain of his recollection of events that there was no such threat made, as if it were otherwise, he would have recorded it down in his notes.148Foot Note 148×NE for 5 August 2021 at p 3, lines 1–2 and p 7, lines 9–10.Based on Farhan’s review of his notes, there was no such threat. During cross-examination, when Farhan’s account was put to Noor, Noor seem to allude to the fact that Farhan was not telling the truth as he was working for the CNB.149Foot Note 149×NE for 3 August 2021 at p 46, lines 10–13.But I do not think that this bare assertion, without further supporting evidence, would suffice. 104 While Farhan’s interpreter notes were not adduced at trial, as argued by the Prosecution, its absence alone would not support an adverse inference being drawn against the Prosecution.150Foot Note 150×PS at paras 48–51.For an adverse inference to be drawn against the Prosecution under s 116 illustration (g) of the Evidence Act (Cap 97, 1997 Rev Ed) for the failure to adduce evidence which could be produced, it must be shown that, inter alia, the non-adducing of evidence was done with an ulterior motive to hinder or hamper the Defence (seePublic Prosecutor v Yue Roger Jr[2019] 3 SLR 749 at [84]). However, nothing was shown that this absence was motivated by a desire to hinder or hamper the Defence. I note that the Prosecution did offer to produce Farhan’s notes during his cross-examination when it became clear that the Defence was pursuing the point (albeit rather belatedly).151Foot Note 151×NE for 5 August 2021 at p 5, lines 22–26. 105 The Defence also argues that there is circumstantial evidence pointing to the truth of Noor’s allegations that IO Prashant had made a threat towards him. Firstly, there was a need to obtain an admission from Noor, as there was little evidence linking him to the drug transactions.152Foot Note 152×2AWS at para 43.This ties in with the other allegation the Defence makes, regarding how IO Prashant had lied to Noor in an attempt to get an admission but failed, and thus he issued a threat to Noor out of desperation.153Foot Note 153×2AWS at para 36; NE for 4 October 2021 at p 16, lines 4–7 and lines 11–14.Secondly, IO Prashant had interviewed Noor on 5 November 2015, even after Noor had given five statements in which he had consistently denied knowledge of the drugs. There was no need for yet another interview on that day with the same questions pertaining to the same events.154Foot Note 154×2AWS at paras 45–46.The Defence argues that the inexorable inference was that IO Prashant was trying to get a different answer,ie, an admission from Noor that he had knowledge of the drugs. Further, the fact that such an inducement, threat or promise was uttered by the IO on 5 November 2015 is confirmed by the attendance notes of Mr Aw on 12 April 2018,155Foot Note 155×2AWS at paras 50–51; NE for 4 October 2021 at p 16, lines 14–22.which states in the relevant part:156Foot Note 156×CSPW at p 918. … IO nothing on him – does not know Inducement Told hm he was part of the group so must be guilty IO – told him zani had drug But no death (penalty) But he has to face death (penalty) … 106 I do not, however, find that any reasonable doubt was raised by the Defence here. The inferences are speculative. I had already found above at [100] that IO Prashant never had the intention to mislead Noor in order to secure an admission from him. The fact that IO Prashant had asked yet again the same questions that were previously posed to Noor, did not indicate the truth of Noor’s version of the events that there was a threat – IO Prashant had testified that he was merely testing what Noor had said,157Foot Note 157×NE for 4 August 2021 at p 11, lines 9–14.which he was entitled to do. 107 Turning to the attendance note, what was recounted to Mr Aw in the 12 April 2018 note did not, in the end, support Noor’s version that there was an inducement, threat or promise – particularly as it ran up against IO Prashant’s denial of the exhortation as well as the credible supporting account given by interpreter Farhan. Further, this one-sided recounting by Noor of the supposed threat to his trial counsel is also rather belated and unconvincing as a significant period of time had passed since then. 108 In any event, I find that what was recorded in the attendance note was simply the laying out of the consequences by IO Prashant to Noor, including the possible punishments involving the death penalty. Even if this laying out of consequences was seen as an exhortation to tell the truth or to admit (when combined with the suggestion that Noor “must be guilty”), such an exhortation must be assessed according to the part objective and part subjective test in determining voluntariness (seeLim Thian Lai v Public Prosecutor[2006] 1 SLR(R) 319 at [18]). As reiterated earlier, there was (as accepted by Noor himself), no effect of whatever alleged inducement, threat or promise made as it did not subjectively operate on his mind. In the final analysis, regardless of what IO Prashant had allegedly uttered to Noor, it is clear that there were no admissions by Noor in the statements recorded by IO Prashant on 5 November 2015 as noted above at [101]. Influencing the effect of the alleged lack of proper advice 109 Noor makes a rather unorthodox argument – that even if there were no involuntary statements made by Noor, this was the backdrop against which bad advice was given by his trial counsel. However, it is hard to see how this backdrop could have influenced the outcome. If anything, it would have actually reinforced the conclusion that in the face of the thorough investigations by the police, and the position taken by Zaini, it was entirely reasonable for Mr Aw to have concluded that the best option for Noor was to co-operate with the authorities and obtain a CSA in the hopes of possibly averting capital punishment.",
        "Conclusion": "110 In conclusion, the additional evidence received as regards the allegations made by Noor against his counsel at the trial, as well as against the investigation officer, do not show any basis to revisit the conclusion reached that Noor should be convicted of the charge against him. His factual allegations were not made out, and I prefer the evidence of the Prosecution witnesses. Noor’s allegations ultimately do not show that there was anything improper in what transpired at the first trial. 111 In the alternative, should I be wrong on the allegations raised by Noor, the best course I would suggest would be a retrialab initioon the merits of the charge against him. Aedit AbdullahJudge of the High Court Lau Wing Yum, Kenny Yang and Chng Luey Chi (Attorney-General’s Chambers) for the Prosecution; Thrumurgan s/o Ramapiram, Tan Jun Yin, U Saranya Naidu (Trident Law Corporation), Sureshan s/o T Kulasingam and Samuel Ang Rong En (Sureshan LLC) for the accused."
    }
}