{
    "case_title": "Kong Swee EngvPublic Prosecutor",
    "ncitation": "[2022] SGHC 50",
    "coram": "Kannan Ramesh J",
    "sections": {
        "Background": "2 The applicant, Ms Kong Swee Eng (“Kong”) had claimed trial to ten charges under s 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed) (“the PCA”) in the State Courts. Broadly, the ten charges were that she corruptly gave gratification to personnel in JSPL to induce them into favouring her business interests in Rainbow and DMH. Both companies were in the business of supplying shipping materials and parts, with JSPL being one of their principal customers. Importantly, in Rainbow’s case, JSPL was itsonlycustomer. Kong directly or indirectly owned or was involved in both companies. 3 To establish its case, the Prosecution had to prove beyond a reasonable doubt that Kong had given gratification to JSPL personnel, and that this gratification was an inducement or reward for a conferment of a benefit. The Prosecution also had to show that there was an objectively corrupt element in the transaction which Kong was subjectively aware of: seePublic Prosecutor vLeng Kah Poh[2014] 4 SLR 1264 at [20]. 4 At first instance, Kong denied giving gratification for several of the charges. More importantly, she argued that there was a “special relationship” with the then managing director of JSPL, Wong, and that this acted as a defence to the charges. The special relationship, according to Kong, was agreed sometime in 2003 or 2004 between (a) herself and Huan; and (b) Wong and the then CEO of JSPL, KK Tan Senior. Wong played an integral role in this relationship which continued until 2013. The special relationship was initiated by Wong who proposed that Rainbow give up all of its existing customers in return for being the exclusive supplier to JSPL. Whenever an order was intended to be placed by JSPL, Wong would email Kong to request that she send an invitation to quote. Following review of the quotation, Wong would indicate to Kong if the price was too high and invite her to lower it to meet his expectations. If she agreed, Rainbow would secure the job. Kong testified that although she would negotiate over price, she would ultimately capitulate since JSPL was Rainbow’s only customer. This meant that, as a result of the special relationship, Rainbow was almost always guaranteed JSPL’s custom. This was referred to as the “special relationship defence”. 5 The upshot of Kong’s position was that it was unnecessary for her to offer gratification to anyone in JSPL. In other words, even if she had given gratification, it was not an inducement or reward, and thus it was not tainted by an objectively corrupt element. It also followed that she did not have subjective guilty knowledge. Thus, the mental element of a charge of corruption would not be established. 6 At first instance, Kong was acquitted of all ten charges by the Judge on the basis of the special relationship defence. The Judge found that Kong had met her evidential burden with regard to the existence of the special relationship, and that the evidential burden had shifted to the Prosecution to rebut it which it failed to do: seePublic Prosecutor v Kong Swee Eng[2020] SGDC 140 at [30], [31], [47], and [57]. Crucially, he pointed out that the Prosecution ought to have called Wong to rebut the existence of the special relationship: at [58]. Accordingly, Kong was acquitted on all charges on the basis that there was no reason for her to bribe anyone in JSPL, which meant that there was reasonable doubt as to the elements of the charges: at [81]–[83]. 7 The Prosecution appealed, arguing that the Judge had erred in finding that Kong had met her evidential burden in proving the existence of the special relationship. I heard the appeal and allowed it in part for several reasons. Relevant to the present application, I found that Kong had not discharged her evidential burden with regard to the special relationship. Accordingly, I found that the Prosecution did not need to rebut the special relationship: the GD at [56]. I went on to consider the ten charges faced by Kong and found that the Prosecution had proven its case beyond a reasonable doubt for eight of the charges, and convicted Kong accordingly. I gave oral grounds on 30 August 2021. I delivered my full grounds, the GD, on 13 January 2022.",
        "The present application": "8 Before the release of the GD, Kong made the present application on 18 November 2021. The crux of her application is a set of two statements from Wong dated October and November 2021 (“the October 2021 statement” and “the November 2021 statement” respectively, “Wong’s 2021 statements” collectively). Briefly summarised: (a) The October 2021 statement primarily explains the “Strategic Supplier” arrangement that JSPL had with several vendors who were regarded as reliable and could supply reasonably priced materials. Rainbow was the Strategic Supplier for piping. While JSPL’s procurement process usually required three quotes, that would be dispensed with if the Strategic Supplier was able to meet certain requirements. (b) The November 2021 statement first describes an incident where Wong had instructed Koay to request Rainbow to “participate in a bid by alternative equipment makers” for products that were then being supplied by one of JSPL’s other suppliers, “Emerson”. The statement explains that the bid was organised because Emerson had increased its prices to JSPL, and that the bid was eventually awarded to DMH as negotiations with Emerson were unsuccessful. The statement then details instances where Wong had asked Kong to help train personnel in Rainbow’s procurement department. 9 For Kong to be granted leave under s 394H of the CPC to make a review application, she must “disclose a legitimate basis” for review:Kreetharans/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175 at [17]–[18],Rahmatbin Karimon v PP[2021] 2 SLR 860 (“Rahmat”) at [21] andMoadFadzir bin Mustaffa v Public Prosecutor[2020] 2 SLR 1364 at [10]. InRahmat, it was stated that in determining whether such a basis exists, it is necessary to examine whether the sufficiency and miscarriage of justice requirements have been satisfied,ie, all the requirements set out in s 394J(3) of the CPC. This was also the position inMurugesan a/l Arumugam v Public Prosecutor[2021] SGCA 118 at [9]. 10 In the present case, it is undisputed that the first requirement in s 394J(3)(a) is satisfied – Wong’s 2021 statements have not been canvassed at any stage of the proceedings in which my decision was made. This stands to reason as Wong’s 2021 statements were only taken in late 2021afterI gave oral grounds convicting Kong. This leaves as issues the two requirements in s 394J(b) and (c) of the CPC. 11 Thus, there are two main issues: first, could the evidence that is set out in Wong’s 2021 statements have been adduced earlier with reasonable diligence, the requirement in s 394J(3)(b) (“the non-availability requirement”); and second, are Wong’s 2021 statements reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice, the requirement in s 394J(3)(c)? 12 Kong argues that Wong’s 2021 statements could not have been adduced earlier even with reasonable diligence. In particular, she argues that the relevance of Wong’s evidence only became apparent to her after my decision on appeal. Further, she argues that the evidence contained in the statements supports the existence of the special relationship and thus there is “more than a real possibility” [emphasis in original omitted] that my earlier decision was wrong, this being a reference to s 394J(5)(a) read with s 394J(6) of the CPC. 13 The Prosecution seeks a summary dismissal of the present application, pursuant to s 394H(7) of the CPC. It argues that Wong’s 2021 statements are not “new” evidence, relying on statements given by Wong in the course of investigation (“Wong’s investigative statements”). These statements include a statement recorded on 2 October 2014 and two further statements recorded on 14 May 2019 and 11 November 2019. In this regard, the Prosecution argues that the contents of Wong’s 2021 statements are in fact substantially reproduced from Wong’s investigative statements, pointing out that they were disclosed to Kong at trial for her to make “an informed decision on whether to call Wong as a witness” [emphasis in original omitted]. As Kong did not call Wong following disclosure of Wong’s investigative statement, she had made “a considered decision not to call” [emphasis in original omitted] him and elicit evidence in accordance with the said statements. Accordingly, the evidence as set out in Wong’s 2021 statements,although availableto Kong, was not adduced at trial or on appeal. 14 The Prosecution further argues that in any event, Wong’s 2021 statements do not support the existence of the special relationship. They are thereforenot“compelling” material that is reliable, substantial, powerfully probative, and “capable of showing almost conclusively” that there has been a miscarriage of justice”.",
        "Analysis": "",
        "The evidence in Wong’s 2021 statements could have been adduced earlier": "The importance of evidence from Wong was clear from the trial 15 Kong argues that Wong’s 2021 statements could not have been adduced in court earlier even with reasonable diligence. Her main point is that it was only after my decision on appeal that Wong’s evidence became “relevant and material” to her defence, in particular, the special relationship. This argument has no merit for two reasons. 16 First, the requirement in s 394J(b) of the CPC is whether the material could have been adduced earlier with reasonable diligence. It isnot when it became apparent to the accused that the material was relevant.The inquiry is an objective factual one as to whether the material could have been procured by the accused person with reasonable diligence, and not a subjective inquiry into when it dawned on the accused that the evidence was significant. Errors of judgment or misapprehension of the significance of the material by the accused or counsel cannot be a basis for contending that the requirement has been satisfied. 17 Second, it is abundantly clear that Kong knew all along of the importance of Wong’s evidence to her case on the special relationship. According to her, Wong was the central figure in the special relationship.  Indeed, when Kong first articulated the special relationship at trial during her examination-in-chief, the importance of his role was crystal clear. The relevance of any evidence from him would have been inescapably clear to her. Thus, it is simply not credible for Kong to assert that she did not appreciate the importance and relevance of Wong’s evidence to the special relationship defence. 18 It would therefore follow that Kong could have called Wong to adduce evidence on the areas covered in his 2021 statements. There is no suggestion that Kong could not have procured such evidence even if she had exercised reasonable diligence. She has not said that Wong would have been unwilling to give a statement similar in content to Wong’s 2021 statements and testify. Indeed, the fact that she was able to procure Wong’s 2021 statements would suggest that it would not have been a problem. Further, it is important that Wong was raised as a potential witness during the trial. In fact, as noted earlier at [13], Wong’s investigative statements were disclosed by the Prosecution to Kong, and she was invited to consider whether she wished to call him as a witness (the relevance of which will be considered later on in this judgment). 19 If Kong thought that Wong could have supported her case, she could have called him to give evidence on the areas covered in Wong’s 2021 statements. However, instead, she made a considered decision not to call him. The contents of Wong’s 2021 statements were similar to his investigative statements 20 The Prosecution has introduced Wong’s investigative statements in the present application. It argues that the statements cover much of the same ground as Wong’s 2021 statements which reinforces the fact that Kong could have adduced the evidence contained in Wong’s 2021 statements at trial. The argument in essence is that given the similarity between the two sets of statements, it is not open to Kong to argue that the evidence in Wong’s 2021 statements could not have been adduced in court earlier with reasonable diligence. 21 Kong argues that the Prosecution’s reliance on these statements is improper by virtue of s 259 of the CPC. Section 259 (asperthe version of the CPC in force on the date that the present application was made) provides that witness statements are “inadmissible in evidence” except in certain circumstances. Witness’s statement inadmissible except in certain circumstances 259.—(1)  Any statement made by a person other than the accused in the course of any investigation by any law enforcement agency isinadmissible in evidence, except where the statement — (a) is admitted under section 147 of the Evidence Act (Cap. 97); (b) is used for the purpose of impeaching the person’s credit in the manner provided in section 157 of the Evidence Act; (c) is made admissible as evidence in any criminal proceeding by virtue of any other provisions in this Code or the Evidence Act or any other written law; (d) is made in the course of an identification parade; or (e) falls within section 32(1)(a) of the Evidence Act. [emphasis added] 22 It is not immediately clear to me that s 259 of the CPC applies to the present application. In particular, it is not clear to me that the Prosecution, by introducing Wong’s investigative statements in response to an application under s 394H of the CPC for leave to make a review application, has admitted Wong’s investigative statements “in evidence” aspers 259 of the CPC. On one hand, the phrase “in evidence” could be read narrowly whereby s 259 of the CPC would only apply where a party attempts to adduce evidence to prove certain facts in a trial. On the other, it could be read broadly such that s 259 of the CPC would apply in all sorts of proceedings, including criminal motions. This specific issue has not been considered before it would seem. To resolve this, I consider the purpose underpinning s 259 of the CPC:Tan Cheng Bock v Attorney-General[2017] 2 SLR 850 at [37]. 23 As was observed by the Court of Three Judges inLaw Society of Singapore v Shanmugam Manohar[2021] SGHC 201 (“Manohar”), there are two related purposes underlining s 259 of the CPC (at [79] and [83]): 79 …first, the protection of accused persons from the risk of untruthful witnesses; and second, ensuring that only reliable evidence is admitted (by permitting the use of witness statements, which constitute hearsay evidence, only under limited conditions).In short, s 259 seeks to advance these purposes by regulating and limiting the use that may be made of witness statements recorded by the police. … 83 … s 259 of the CPC is intended,at least in part, to protect accused persons and to ensure that only reliable evidence is admitted against them. As indicated at [79] above, this is achieved by regulating the use and limiting the admissibility of witness statements to certain specified situations.This is rooted in the fact that such statements constitute hearsay evidence, which is admissible only in limited circumstances. In the context of criminal proceedings, this would further the purpose of protecting accused persons by helping to ensure a fair trial. [emphasis added] 24 It is clear from the observations inManoharthat the underlying concern in s 259 of the CPC is that of hearsay evidence from unreliable witnesses. Hearsay evidence is an out of court statement adduced in evidence to prove its contents: seeChan Sze Ying v Management Corporation Strata Title Plan No 2948 (LeeChuen T’ng, intervener)[2021] 1 SLR 841 at [95], affirmingSoon Peck Wah vWoon Che Chye[1997] 3 SLR(R) 430 at [26]. That hearsay evidence is the main concern of s 259 is further reinforced by Aedit Abdullah J’s observation inLim Hong Liang v Public Prosecutor[2020] 5 SLR 1015 that the various limbs of s 259(1) of the CPC “are targeted at the use ofthe contents of the statement, rather than the fact that the statement was given” [emphasis added]: at [27]. Thus, if the statements are admitted for the purpose of proving the truth of the contents therein, they would fall within the ambit of s 259(1) of the CPC. 25 In the present case, the Prosecution has introduced Wong’s investigative statements not to prove their contents. Instead, they have introduced Wong’s investigative statements to show their similarity with his 2021 statements, in order to rebut Kong’s argument that she has satisfied s 394J(3)(b) of the CPC, namely, the non-availability requirement. Arguably, such use is not admitting Wong’s investigative statements “in evidence”, and thus does not come under the ambit of s 259 of the CPC. 26 Further, to shut out such evidence would be incongruous with the purpose of an application for leave to make a review application, and a review application proper. The court’s role in both is to consider whether the new material relied upon by the applicant is “sufficient” to show a miscarriage of justice. “Sufficient” is defined in s 394J(3) of the CPC, under which three requirements must be met. As noted above at [11], one of these requirements is to demonstrate that the material could not have been adduced earlier with reasonable diligence. In establishing that this requirement has been satisfied, the applicant must place all relevant facts before the court. Thus, if the applicant has been given investigative statements that cover the same ground as the alleged “new material”, surely it must be incumbent upon the applicant to disclose that fact and produce those statements. 27 That this is the case is embodied in the Criminal Procedure Rules 2018 (“the CPR”). Rules 11(2)(a)(iii)(iv) and (b)(iii)(iv) require an applicant in a leave application to make an affidavit stating good reason why the material could not have been adduced earlier, with details of such reason (whether or not they are represented by a lawyer). It is also significant that where the applicant is represented by a lawyer, the lawyer is required to make an affidavit stating that he genuinely believes the application to be of merit: CPR r 11(2)(a)(v). These rules underscore the need forfull disclosureof all relevant material. This being the case, it would be contrary to the CPR if an applicant could choose to omit relevant investigative statements simply by relying on s 259 of the CPC to exclude such evidence. 28 Equally, if such investigative statements exist, and the applicant has not drawn the court’s attention to them, the respondent must be entitled to produce the investigative statements so that the court is apprised of all relevant facts. When the respondent has introduced such statements because the applicant has failed to do so, it cannot be the case that the court must shut its eyes to them if the respondent can show that the material relied upon could have been adduced earlier at trial with reasonable diligence. This would essentially allow applicants who have strategically decided to omit relevant witness statements to hide behind s 259 and mislead the court as to the true circumstances, thereby stymieing the efforts of the respondent to present the true picture. 29 Accordingly, I am of the opinion that s 259 of the CPC ought to be read narrowly. In the present situation, the Prosecution has not adduced Wong’s investigative statements for the purpose of proving their contents. Instead, they are being adduced to demonstrate that thecontentsof Wong’s 2021 statements are not new evidence that could not have been adduced in court earlier through reasonable diligence (as it was available to Kong at the material time in the form of Wong’s investigative statements). Thus, the use of Wong’s investigative statements for this purpose does not come within the purview of s 259. As such, there is no bar to considering whether Wong’s investigative statements are the same or similar to Wong’s 2021 statements in determining if the non-availability requirement in s 394J(3)(b) of the CPC is satisfied. 30 Indeed, after an examination of both Wong’s investigative statements and Wong’s 2021 statements, it is quite apparent that they cover much of the same ground. The Prosecution has reproduced a comprehensive comparative table of these similarities, but for the purposes of this judgment, some examples suffice. (a) Both the October 2021 statement and the 11 November 2019 investigative statement explained, in very similar language, how the relationship with Strategic Suppliers worked. The October 2021 statementThe 11 November 2019 statement7. As this was and still is a key strategy of JSPL, I personally get involved in discussions with these Strategic Suppliers on the deliverables and commitment on their side, together with my procurement staff. However, JSPL does not have written contracts with any of our Strategic Suppliers to confirm the relationship as we wish to retain the flexibility of not using their products if they do not meet our customers’ requirements or if the customers have another preference based on our contract. If everything goes smoothly, it is normal for the specific Strategic Suppliers to get a continuous stream of orders from JSPL.A8 … However we do engaged [sic] other companies to be our Strategic Supplier in specific products … I will personally attend the meetings with these suppliers on the deliverables and commitment on their side, together with my procurement people. We do not have a rigid contract on such supplies because we cannot give 100% commitment to them if their product does not meet the customers’ requirements or if the customer has another preference based on our contract. Also when their performance is not up to expectation. This is to protect the company’s interest. But if everything goes accordingly, the suppliers such [sic] be given the orders continually. (b) This was repeated and elaborated on in both the November 2021 statement and the 11 November 2019 investigative statement respectively, once again in very similar language. The November 2021 statementThe 11 November 2019 statement13. … [Rainbow] will receive the lion’s share of the orders for their products that meet our major projects’ technical specifications, if they provide competitive pricing and deliver within JSPL expectations. In the event that their pricing falls out of expectation, instructions will be passed down to procurement department to conduct negotiation exercises with Rainbow to push down their pricing to acceptable levels.A11 … [Rainbow] will get continuous good base load of business from [JSPL] for big projects, which they can also plan ahead of time. But the pricing must be based on what we have mutually agreed. In the event of surprises to their cost, they can bring it up for discussion with my procurement side. (c) Both the October 2021 statement and the 14 May 2019 investigative statement explained that Wong had asked Kong to build up the competency of JSPL’s staff, also in similar language. The October 2021 statementThe 14 May 2019 statement12. … I recall asking rainbow through [Kong] to help raise the competency of bulk material knowledge for JSPL’s staff. My intent is for my staff to know the ins and outs of the industry from Rainbow as they have vast experience in this area. I have also asked her to help build up the competency of my procurement staff by helping them whenever there was any problem.A20 … But I did ask [Kong] to help us raise the competency of bulk material knowledge for JSPL’s technical staff … My idea is for my technical staff to know the in and out from Rainbow as they have vast experience in this area. I have also asked her to help build up the competency of my procurement staff by helping them whenever there is any problem, and not to try and take advantage of the situation. 31 It is undisputed that Wong’s investigative statements were handed over to Kong at trial on 11 November 2019, albeit after Kong had testified, pursuant to the Prosecution’s additional disclosure obligations, and that she chose not to call Wong as a witness and/or use them. Thus, the substance of Wong’s 2021 statements was available for Kong to use at trial, yet she chose not to. This reinforces my above conclusion that Kong had made a considered decision not to call Wong as a witness at trial, or adduce any evidence from him (see [19] above). In the final analysis, this case was never about whether the evidence could not have been adduced with reasonable diligence – it was about Kong’s considered decision not to adduce the evidence even though it was available to her. The present application therefore fails on the non-availability requirement.",
        "Wong’s 2021 statements do not conclusively show a miscarriage of justice": "32 The next requirement is that Wong’s 2021 statements be reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice. I must stress that this is a high bar. In the present case, Kong’s contention is that Wong’s 2021 statements would show that my earlier decision was wrong,ie, s 394J(5)(a) of the CPC, which states that it may be concluded that there has been a miscarriage of justice if the earlier decision was “demonstrably wrong”. For my earlier decision to be demonstrably wrong, it is not sufficient that there is areal possibilitythat it is wrong; it must be apparent,based only onWong’s 2021 statements, that there is apowerful probabilitythat it is wrong: s 394J(6) of the CPC. 33 The Prosecution raised a preliminary objection as to the reliability of Wong’s 2021 statements, pointing out that there was no affirmation of truth by Wong. Wong has since signed such an affirmation on 3 January 2022, which was placed before me. Thus, for present purposes, I shall proceed on the basis that Wong’s 2021 statements are reliable – this leaves the requirement that they must be powerfully probative and capable of showing almost conclusively that there has been a miscarriage of justice. 34 To reiterate, the key issue with regard to the special relationship defence was whether Kong had discharged her evidential burden, thus placing the onus on the Prosecution to rebut the existence of the special relationship. On appeal, I found that on the evidence, the special relationship defence was inherently incredible, that is, Kong had not discharged her evidential burden. Thus, the question in this application is: would Wong’s 2021 statements change this? 35 Kong submits that they would, arguing that Wong’s 2021 statements confirm the special relationship, thus contradicting my earlier finding that the special relationship was inherently incredible. Specifically, she argues that Wong’s 2021 statements show how the special relationship would influence JSPL’s procurement process, and why the special relationship was never documented. These submissions seem to focus on the October 2021 statement which deals mainly with the Strategic Supplier arrangement. It explains that no written contracts were made between JSPL and the Strategic Suppliers, and that although the normal procurement process of JSPL was to require three quotes, that would not be insisted upon if the Strategic Supplier fulfilled JSPL’s requirements. It is apparent from this that the thrust of Kong’s submissions is that the special relationshipisthe Strategic Supplier arrangement and thus, Wong’s 2021 statements show that the special relationship/Strategic Supplier arrangement existed. 36 I do not accept this submission. The effect of the Strategic Supplier arrangement was not the same as the alleged effect of the special relationship. It must be remembered that the essence of the special relationship defence was that the special relationship meant that Rainbow’s business from JSPL wasguaranteed. This meant that Kong had no reason to bribe anyone in JSPL. In turn, this would negate the mental element of the offence: if Kong had no reason to bribe anyone, it would cast doubt on whether any gratification she gave was an inducement, and consequently, whether the transaction was tainted with an objectively corrupt element. 37 But in Wong’s 2021 statements, it is clear that the Strategic Supplier arrangement did not guarantee contracts from JSPL for Rainbow. Three examples stand out in my opinion: (a) First, paragraph 7 of the October 2021 statement explains that a Strategic Supplier would receive a continuous stream of ordersonlyif“everything goes smoothly”. This suggests that Rainbow still needed to perform up to standard,ie, there was no guarantee. (b) Second, in paragraph 14 of the October 2021 statement it states that Wong had made it clear to Kong that he expected Rainbow to be competitive in delivery schedules with “the lowest possible pricings” [emphasis added]. In short, Rainbow still had requirements to meet if it wanted JSPL’s business. (c) Third, in paragraph 13 of the November 2021 statement, Wong states that Rainbow would receive most of the orders, but only “if they provide competitive pricing and deliver within JSPL expectations”. Once again, it is clear that there was no guarantee of business from JSPL. 38 The three examples above show that, even on the state of affairs laid out in Wong’s 2021 statements, Kong still had reason to give gratification to personnel in JSPL’s procurement department. This would help her meet JSPL’s expectations and maintain their business. Thus, Wong’s 2021 statements are not probative of a state of affairs where Kong had no incentive to bribe anyone in JSPL’s procurement department. This is very different from the effect which Kong alleged the “special relationship” would have had. Accordingly, Wong’s 2021 statements do not conclusively show that my earlier decision was wrong or that there has been a miscarriage of justice.",
        "Conclusion": "39 Kong’s application does not meet the requirements in s 394J(3) of the CPC and thus I summarily dismiss it pursuant to s 394H(7) of the CPC:Mohammad Yusof binJantan v Public Prosecutor[2021] SGHC 82 at [31]. 40 The Prosecution has made submissions seeking personal costs against Mr Michael Khoo SC (“Mr Khoo”), who was Kong’s lawyer at the time this application was made (Kong has since discharged Mr Khoo and appointed new lawyers). Before his discharge, Mr Khoo argued that it was premature for the Prosecution to seek personal costs against him. 41 I agree with Mr Khoo’s submission and will consider the issue at a later time. It should be noted that through Kong’s new lawyers, Mr Khoo filed an additional affidavit on 7 March 2022. This affidavit was originally filedwithoutleave of court, but as the Prosecution did not object to its filing, I retrospectively granted leave for it to be filed. The new affidavit mainly restated points already made in submissions, albeit reframed in a way that responded to the Prosecution’s submission that personal costs should be ordered against Mr Khoo. Accordingly, I do not find this new affidavit to be material to the present application and will only consider it in the context of the parties’ submissions on personal costs against Mr Khoo. In this regard, I direct that parties file submissions on costs within 14 days. Kannan RameshJudge of the High Court Sunil Sudheesan, Ngiam Hian Theng, Diana (Yan Xianting) and Khoo Hui-Hui Joyce (Quahe Woo & Palmer LLC) for the applicant; Jiang Ke-Yue, Jasmin Kaur and Dhiraj G Chainani (Attorney-General’s Chambers) for the respondent."
    }
}