{
    "case_title": "Public Prosecutor vMuhammad Rais bin Abdul Rashid",
    "ncitation": "[2022] SGHC 99",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 The accused pleaded guilty to a charge of importing methamphetamine into Singapore under s 7 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”) on 11 March 2022. The charge read as follows: That you,MUHAMMAD RAIS BIN ABDUL RASHID, on 31 March 2018 at or about 10.33 p.m., at Tuas Checkpoint, Singapore, did import into Singapore a Class 'A' controlled drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (\"MDA''),to wit, two (02) packets containing not less than 818.2 g of crystalline substance which were analysed and found to contain not less than 249.99 g of methamphetamine, without authorisation under the said Act or the regulations made thereunder, and you have thereby committed an offence under section 7 and punishable under section 33(1) of the MDA.  2 A second charge of consumption under s 8(b)(ii) of the MDA was taken into consideration for the purposes of sentencing. I sentenced the accused, then 30 years of age, to 25 years’ imprisonment and 15 strokes of the cane. The accused has appealed against his sentence.",
        "Facts": "",
        "The arrest of the accused": "3 On 30 March 2018, the accused was recruited by Muhammad Syafie bin Mohd Din (“Syafie”) to import methamphetamine (“the Drugs”) from Johor Bahru, Malaysia, into Singapore for Syafie’s “boss”. The accused agreed to do so for $700. The next day, 31 March 2018, he met Syafie twice to discuss the final arrangements in person.1Foot Note 1×Statement of Facts (“SOF”) at paras 14–16.After their meeting, the accused also sent a message to Syafie asking for the Drugs to be broken into two bundles so that it would be easier for the accused to store it within the seat compartment of his motorcycle as he transported it back to Singapore.2Foot Note 2×SOF at para 15. 4 At about 6.58pm on 31 March 2018, the accused left Singapore for Johor Bahru on his motorcycle. He met with Syafie’s contact in Johor Bahru and collected the Drugs, placing them in the seat compartment of his motorcycle.3Foot Note 3×SOF at para 16.The accused returned to Singapore through the Tuas Checkpoint at about 10.25pm, when his motorcycle was searched by Auxiliary Police Officer Iryani bin Ismail and Immigration and Checkpoints Authority (“ICA”) officers Staff Sergeant Muhammad Rafeuddin bin Buang (“SSgt Rafeuddin”) and Sergeant Muhammad Thermidzi bin Mohamad Tayib (“Sgt Thermidzi”).4Foot Note 4×SOF at para 4. 5 Asked to open the seat compartment during the search, the accused’s first response was to maintain that the motorcycle seat was stuck and that the seat compartment could not be opened as a result. SSgt Rafeuddin proceeded to insert one of the keys of the motorcycle into the keyhole beneath the motorcycle seat and told the accused to turn the key. The motorcycle seat then unlocked and lifted up.5Foot Note 5×SOF at para 4. 6 Sgt Thermidzi proceeded to search the motorcycle seat compartment in the accused’s presence. Under two bags containing work tools, Sgt Thermidzi found two black taped bundles. Each of these black taped bundles contained one packet of crystalline substance (“A1A” and “A2A” respectively). When Sgt Thermidzi asked the accused what the black taped bundles were, the accused did not respond. The accused was then arrested and referred to officers from the Central Narcotics Bureau (“CNB”).6Foot Note 6×SOF at paras 5 and 6. 7 Analysis of the crystalline substances by the Health Sciences Authority revealed that A1A contained 270.2g of methamphetamine, while A2A contained 284.2g of methamphetamine. The Drugs collectively contained not less than 249.99g of methamphetamine.7Foot Note 7×SOF at para 12; SOF Annex A Tab A.",
        "The arrest and sentence of co-accused Syafie": "8 About two weeks later, on 16 April 2018, Syafie was arrested by CNB officers at about 12.35pm at the carpark of RV Edge Condominium, 2 Shanghai Road.8Foot Note 8×SOF at para 10. 9 The accused and Syafie were initially scheduled for a joint trial. The accused faced a single charge of importing a capital amount of methamphetamine. Syafie was charged with abetting the accused’s offence. 10 On 25 January 2022, Syafie pleaded guilty to an amended charge of abetting the importation of not less than 192.99g of methamphetamine. He was sentenced by another judge to 22 years’ imprisonment and 15 strokes of the cane. 11 Subsequently, on 11 March 2022, the accused pleaded guilty to the present charge of importation. This charge involved not less than 249.99g of methamphetamine, a higher quantum than that contained in the charge which Syafie pleaded guilty to.",
        "Parties’ positions and issues": "",
        "Undisputed issues": "12 The prescribed punishment for the offence in the charge was a minimum of 20 years’ imprisonment and 15 strokes of the cane and a maximum of 30 years’ imprisonment or imprisonment for life and 15 strokes of the cane: s 33(1) of the MDA read with the Second Schedule to the MDA. 13 It was not disputed that the applicable sentencing framework for drug trafficking or importation offences is that set out inVasenthad/o Joseph vPublic Prosecutor[2015] 5 SLR 122 (“Vasentha”) and endorsed by the Court of Appeal inSuventherShanmugam v Public Prosecutor[2017] 2 SLR 115 (“Suventher”).9Foot Note 9×Prosecution’s Submission on Sentence (“PSS”) at para 3; Mitigation at paras 6 and 7.This comprises three steps. First, the court considers the quantity of the imported drugs and arrives at an indicative starting point. Second, upward or downward adjustments are made to the starting point based on the offender’s culpability, and any aggravating or mitigating factors. Third, the time spent by the offender in remand may be taken into account by either backdating or discounting the sentence:Vasenthaat [44];Suventherat[28]. 14 Regarding the first stage, the gravity of the offence is measured by the quantity of drugs involved and that quantity would have a direct correlation with the degree of harm to society:Suventherat [21].  The framework that was first designed for diamorphine inVasentha, was endorsed by the Court of Appeal inSuventherin the context of cannabis. Subsequently, the Court of Appeal inAdri AntonKalangie v Public Prosecutor[2018] 2 SLR 557 (“Adri”) then extrapolated the framework for use in methamphetamine cases, where the amount of methamphetamine in question (249.99g) was the same as the present case.10Foot Note 10×PSS at paras 4 and 5; Mitigation at para 6.The applicable sentencing bands for the importation of methamphetamine was set out by the CA inAdri(at [80]) as follows:   Sentencing BandQuantity of methamphetamine imported (grams)Imprisonment (years)Caning1167.00–192.9920–2215 strokes2193.00–216.9923–253217.00–250.0026–29 15 In the present case, the amount of methamphetamine involved placed the accused at the highest band and range of the framework. Both sides agreed that the applicable indicative starting point, as set out inAdri, was 26–29 years’ imprisonment, with 15 strokes of the cane. 16 Turning to the second step, the Defence largely agreed with the Prosecution that the following points were salient:11Foot Note 11×Mitigation at paras 8–9. (a) The accused’s culpability was relatively low, particularly as he had imported the Drugs on Syafie’s instructions and directions.12Foot Note 12×PSS at para 7. (b) There were no aggravating factors, with the accused being a first-time offender and the only charge taken into consideration being one of consumption rather than importation.13Foot Note 13×PSS at para 9; Notes of Evidence (“NE”) for 11 March 2022 at p 5, lines 5–8. 17 Regarding the third step, there was no dispute that the accused’s sentence should be backdated to 31 March 2018.",
        "Issues in dispute": "18 The Prosecution submitted that an imprisonment term of 26 years was appropriate, while the Defence was of the view that 24 years was more so; both sides agreed that 15 strokes of the cane was apposite. The issue at hand was the relevance of various precedents adduced, and how these precedents applied in the present case at the second step of the three-step analysis. 19 The Prosecution relied on the cases ofAdri,Public Prosecutor v Vashan a/l K Raman[2019] SGHC 151 (“Vashan”), andMurugesan a/l Arumugam v Public Prosecutor[2021] SGCA 32 (“Murugesan”). In each of these cases, 25 years’ imprisonment had been imposed. The Prosecution argued that the present case was more serious than this trio of cases, and the accused should be sentenced to 26 years’ imprisonment. In particular, they contended that the accused’s plea of guilt and his provision of assistance to the CNB in apprehending another offender should be accorded limited mitigating effect. This was because the accused had only elected to plead guilty late in the day and only after Syafie had done so. Further, he did not assist the CNB in any way for the arrest of Syafie,14Foot Note 14×PSS at para 10.although he assisted with the arrest of one Abdul Rahman, known as “Amigo”, against whom the Prosecution did not proceed against after investigations.15Foot Note 15×NE for 11 March 2022 at p 5, lines 31–32 to p 6, lines 1–3. 20 Pressing instead for a 24-year imprisonment term,16Foot Note 16×Mitigation at para 13.the Defence agreed with the Prosecution’s assessment on culpability and the lack of aggravating factors,17Foot Note 17×Mitigation at paras 8 and 9.but challenged the Prosecution’s characterization of the accused’s guilty plea, contending that these proceedings were initially instituted on the basis of a capital charge and that the opportunity to plead guilty was not available at the early stage of criminal proceedings.18Foot Note 18×Transcript, 11 March 2022 at p 13, lines 20–29.The facts of this case were said to be less serious than those ofAdri,meriting downward calibration of the sentence there imposed. The cases ofPublic Prosecutor v Pham Duyen Quyen[2016] 5 SLR 1289 (“Pham(HC)”), Public Prosecutor v Tan Swim Hong and others[2019] SGHC 246 (“Tan Swim Hong”) andPublic Prosecutor v Abdul Qayyum Bin Abdul Malik[2021] SGDC 89(“Abdul”) were also relied upon and I discuss these cases below.",
        "Decision": "",
        "Relevant cases": "21 I start my analysis withAdri, because of the reliance placed by both sides on this case. Adri had pleaded guilty to importing not less than 249.99g of methamphetamine into Singapore. Recruited by a drug syndicate to assist in the transportation of drugs between Guangzhou and Jakarta, Adri had ingested, inserted into his anus or hidden in his clothing 43 pellets of methamphetamine. He flew from Guangzhou to Singapore, intending to take a connecting flight to Jakarta, but he missed his connecting flight. At Changi Airport, he confessed to a customer service officer while in the transit area of the airport that he was in possession of drugs and was thereafter arrested. The Court of Appeal upheld his sentence of 25 years’ imprisonment and 15 strokes of the cane. It considered as aggravating (at [82]) that the accused took active and sophisticated steps to avoid detection of the offence. The Defence emphasised the absence of this aggravating factor in their argument for a downward calibration for this accused. At the same time, the Court of Appeal regarded as mitigating (at [83]) that Adri had voluntarily confessed to his crime, co-operated with authorities and pleaded guilty at an early stage. The Prosecution relied on the absence of the same mitigating factors in the present case to press for an upward calibration for the accused. 22 The exercise of comparing a case with a precedent must be a contextual one; a matter of weighing the various factors, rather than adding and subtracting in a mathematical exercise. In context, the specific aggravating factor found inAdridid not have as much significance as the particular mitigating factors in the same case. In general, an offender who takes active and sophisticated steps has made more effort and put more intention into his actions. Hence the Court of Appeal’s characterisation of the sophisticated scheme used inAdrias an aggravating factor. Here, the means of concealment was simpler than that used inAdri.There was, I would agree, the absence of the particular aggravating factor. Nevertheless, a courier, because of his limited role within a necessarily larger enterprise, typically does not have full control in respect of the plan for the transport of the drugs. Thus, while the accused was able to exercise limited control over the means by which the Drugs were packaged, having requested through Syafie for the Drugs be broken into two (see [3]), he remained under Syafie’s direction. In contrast, in considering the particular mitigating factors found inAdri, whether and to what extent any accused person chooses to co-operate with investigations is a matter entirely within his control. Further, public resources are saved wherever remorse on the part of the accused results in an early admission of guilt; and Adri’s confession was extremely timely. For this reason, the importance of the mitigating factors outstripped the importance of the aggravating factor in comparing the context at hand withAdri. The three operative factors highlighted by the Court of Appeal inAdriat [83] were very strongly mitigating: (a) Adri voluntarily confessed to his crime, a factor that Sundaresh Menon CJ characterised as “highly significant”; (b) Adri co-operated with the authorities from the outset; and (c) Adri pleaded guilty at an early stage. His early expression of contrition would have had a tangible and practical effect on public resources that would otherwise have been expended on investigation and trial. In contrast, the accused in the present case first attempted an excuse that his seat compartment could not be opened. Next, when questioned about the two bundles thereafter found when the compartment was opened, he chose to remain silent. He did not admit to the offence in any of his statements. His plea of guilt came after his case was readied for trial. It would not be a fair result for the present accused to be given a lighter sentence than Adri. 23 In this context, I deal withMurugesanandVashan, with which, in my judgment, the present case had substantial commonality. In particular,Murugesanconcerned an accused person in fairly similar circumstances. Murugesan pleaded guilty to trafficking not less than 14.99g of diamorphine, which placed the indicative starting point at the same point of the matrix as this offence. Using his motorcycle to transport two packets containing diamorphine, he parked at a HDB carpark where two others, Ansari and Bella, arrived in a car driven by a fourth person. Murugesan delivered the two packets of diamorphine to Ansari at the void deck of an adjoining block of HDB flats. All four were arrested shortly after. The High Court highlighted that the accused was a mere courier and exhibited genuine remorse in pleading guilty. The Court of Appeal, dismissing Murugesan’s appeal, observed that the sentence of 25 years’ imprisonment and 15 strokes was consistent with authorities such asVashanandPublic Prosecutor v Hari Krishnan Selvan[2017] SGHC 168 (“Selvan”): at [9]–[10]. 24Vashan, too,concerned a one-off transaction. Vashan, a 25-year old male, pleaded guilty to importing not less than 14.99g of diamorphine, which placed the indicative starting point at 26–29 years’ imprisonment pursuant to theVasenthaframework. He received two packets containing diamorphine from a Malaysian acquaintance. His instructions were to keep the packets in his underwear as he entered Singapore and thereafter to deliver them to a third person at a traffic light after he cleared the Tuas Checkpoint. He was promised RM1,000 in return. He was a first-time offender, had pleaded guilty and there was substantial co-operation with the CNB. The court imposed a sentence of 25 years’ imprisonment and 15 strokes of the cane: at [24]. 25 In submitting on a 26-year term, the Prosecution contended that this accused’s plea was late in the day, The fact remains that his plea has obviated the public expense of trial. Insofar as his change of heart came after Syafie’s plea of guilt, the charge the accused faced, too, was more serious than Syafie’s. InSelvan, where the High Court imposed 26 years’ imprisonment, two aggravating figures were highlighted (at [19], referring to [11]): Selvan had recruited two others to assist in his act of trafficking; and there was an element of concealment. In the present case, the act of concealment was more rudimentary. While Selvan placed, within his lorry, baskets of vegetables atop the baskets containing cabbages with diamorphine hidden within them, in the present case, the accused had merely placed the two bags of methamphetamine under bags of work tools. More importantly, the accused had not recruited others to assist in the plan, but was himself recruited to function as a courier. For this reason, I did not find the Prosecution’s suggestion of 26 years’ imprisonment persuasive. Returning toAdriin this context, while there was logic in the Prosecution’s submission that the present case merited a harsher sentence thanAdribecause of the absence of the operative factors highlighted at [21], it seemed to me fairer to considerAdritogether withMurugesan,Vashan and Selvanin context, viewing the precedents as a whole.",
        "Other cases cited by the Defence": "26 I deal here with three other cases cited by the Defence.19Foot Note 19×Mitigation at para 11b. 27 InPham(HC),the High Court sentenced the accused to 24 years’ imprisonment despite his having claimed trial. Defence counsel omitted to mention, and the Prosecution helpfully brought to my attention, that the Court of Appeal subsequently delivered grounds of decision in a later appeal:PhamDuyen Quyen v Public Prosecutor[2017] 2 SLR 571 (“Pham (CA)”). There, Tay Yong Kwang JA observed that the decision in the lower court was given prior toSuventher,and using theSuventherbenchmark, the appropriate sentence would have fallen within the top range of 26 to 29 years’ imprisonment (at [55]). Further, using the methodology adopted by Chao Hick Tin JA prior toSuventher, inthe case ofLoo Pei Xiang Alan v Public Prosecutor[2015] 5 SLR 500 at [14]–[18] also yielded a sentence at the top end of the sentencing range: at [57]. The Court of Appeal therefore held that there was no basis to reduce the sentence, and in fact, the sentence of 24 years’ imprisonment imposed by the lower court was “was lower than it would have been had the equivalent sentencing ranges inSuventherbeen applied”: at [58]. 28 Similarly, inTan Swim Hong,one of the accused in the joint trial was sentenced by the High Court to 24 years’ imprisonment despite having claimed trial. Defence counsel omitted to mention that this sentence was considered by the Court of Appeal inMohammadReduan bin Mustaffar v Public Prosecutor and another appeal and another matter[2021] SGCA 64. Again, the Court of Appeal noted that “the sentence of 24 years’ imprisonment can, in fact, be said to be relatively lenient” (at [68]). 29 Lastly, inAbdul,an accused was sentenced to 25 years’ imprisonment in a more serious situation involving a syndicate. This case was not relevant as the sentence there was imposed in the context of multiple offences where the totality principle was in play. The district judge stated that a sentence of 26 years was suitable but adjusted this downwards to 25 years in the light of the sentences to be made consecutive (at [39] and [43]).",
        "Specific factual context": "30 Coming to the specific context of this case, the starting point for analysis was the highest end of the sentencing band of 26–29 years' imprisonment as the charge was framed for the importation of not less than 249.99g of methamphetamine. Regarding the factors relevant at the second step, the accused performed a limited function under the direction of Syafie. He was not an orchestrating hand in the illicit activities: seeVasenthaat [51]. There were no aggravating factors and the accused had no antecedents. In light of the accused’s plea of guilt, his limited role as a courier and some co-operation with authorities in investigations, a discount from this starting point was appropriate. The accused was 30 years of age at the time and a sentence of 25 years’ imprisonment would not be crushing. 31 Pertinent to this is the sentence imposed on Syafie, who had offered the accused the task. In a query posed directly by the accused at his sentencing, he asked for a sentence lower than Syafie’s. It was not disputed that the accused had a smaller role in the overall transaction than Syafie. However, as mentioned at [10], Syafie had been charged with abetting the accused to import a lower amount of methamphetamine under s 7 read with s 12 of the MDA. The applicable range for the amount of methamphetamine Syafie was charged with was 20–22 years’ imprisonment and 15 strokes of the cane. Syafie received 22 years’ imprisonment and 15 strokes of the cane, which is the highest end in the sentencing band applicable. As I explained to the accused, Syafie’s lower sentence resulted from his charge specifying the importation of a smaller amount of methamphetamine. In drug importation cases, the gravity of the offence is measured by the quantity of drugs involved: seeSuventherat [21], [29] and [32]. The fact that both these charges were reduced from capital charges is not relevant; the relevant fact is the amount specified in the particular amended charge: seeSuventherat [36]. Differentiating between offenders in this manner is a legitimate exercise of prosecutorial discretion: seeRamalingamRavinthran v Attorney-General[2012] 2 SLR 49 at [65]. Syafie’s lower sentence was a function of the exercise of prosecutorial discretion. InLim Bee Ngan Karen v Public Prosecutor[2015] 4 SLR 1120, while discussing the parity principle, Chao JA highlighted at [41] that the principle should not be used to correct sentences which are disproportionate as a result of charging decisions made by the Prosecution. Chao JA explained, in this context at [38] and [45], the comment made by Yong Pung How CJ inPhua Song Hua v Public Prosecutor[2004] SGHC 33 at [38] when comparing an accused who claimed trial with co-offenders who had pleaded guilty to less serious charges. In declining to apply the parity principle, Yong CJ concluded that there was “no longer any common basis for comparison”. The same principle applies in the present case. Syafie’s less serious charge reflects the exercise of prosecutorial discretion and it would not have been appropriate for the accused to be sentenced to a term lower than Syafie’s. 32 The relative roles played by the two men did have impact, nevertheless, on their individual sentences. As a result of his larger role, Syafie was sentenced to a term of imprisonment at the top of his applicable range. For the present accused, his smaller role was one of the reasons that I reduced the term of imprisonment to a term that was below the sentencing range applicable to him. The two sentences sit well one with the other.",
        "Conclusion": "33 For these reasons I sentenced the accused to 15 strokes of the cane and 25 years’ imprisonment, backdated to 31 March 2018. Valerie Thean Judge of the High Court Mark Jayaratnam, Lim Shin Hui and Pavithra Ramkumar (Attorney-General’s Chambers) for the Prosecution;Gino Hardial Singh and Joel Wang (Abbots Chambers LLC) for the accused."
    }
}