{
    "case_title": "The Online Citizen Pte Ltd  vAttorney-General",
    "ncitation": "[2022] SGHC 177",
    "coram": "General Division of the High Court — Originating Summons 563 of 2021 Aedit Abdullah J1, 15 December 2021, 8 March 2022",
    "sections": {
        "Background": "2 On 18 May 2021, a series of Instagram stories was posted with captions criticising the police for ill-treating an elderly lady (“Instagram Stories\"). The material portions of the Instagram Stories are reproduced as follows:1Foot Note 1×Affidavit of Ng Yong Sin Willy (“NYS”) dated 29 October 2021 at Annex B. “Do we really need 4 policemen to cluster an elderly auntie that took off her mask because she was feeling breathless?!?” “Poor auntie already put back on her mask, but they continued to tell her off to the extent someone had to come and salvage the situation.” “Please @singaporepoliceforce there are people not wearing a mask and asking why people no badge, go and spend your time and make yourself more useful! Not taunt an old cardboard collection auntie!” “Instead of helping each other get through this, you taunt others with your authority?!?!” An Instagram story is a photo or video shared temporarily on an Instagram account. Captions, effects, or layers may be added to these photos or videos. 3 Subsequently, TOC published three posts on its Facebook, YouTube and Instagram pages with each containing a video of the Instagram Stories (“TOC Posts”) on 18 May 2021.2Foot Note 2×Appellant’s written submissions dated 24 November 2021 (“AWS”) at para 3; Respondent’s written submissions dated 24 November 2021 (“RWS”) at para 3.On 19 May 2021, the Singapore Police Force issued a press statement taking issue with the Instagram Stories.3Foot Note 3×AWS at para 4; RWS at para 4; Affidavit of Xu Yuan Chen @ Terry Xu (“TX”) dated 8 June 2021 (“Affidavit of TX”) at p 19.TOC then amended its posts to refer to the press statement from the police.4Foot Note 4×RWS at para 4; Affidavit of TX at pp 13–17.Two days later, on 21 May 2021, the Protection from Online Falsehoods and Manipulation Act Office (“POFMA Office”), which is responsible for the administration of the Act, issued a correction direction against the TOC (“the Correction Direction”), stipulating the posting of a correction notice in a new Facebook post on TOC’s Facebook page.5Foot Note 5×AWS at para 5; RWS at para 5; Affidavit of TX at pp 21–24.While TOC complied with the Correction Direction, it also pursued an application to the Minister for the cancellation of the Correction Direction. This was rejected, leading to the present appeal.6Foot Note 6×Affidavit of TX at para 5. 4 At the initial hearing on 1 December 2021, I invited both sides to consider if they wished to have further evidence brought before me, namely the body-worn camera footage of the officers at the scene, and the transcript and interpretation of what was said by the elderly lady to Ms Pak Geok Choo (“Ms Pak”), a friend of Xu Yan Chen (“Terry Xu”).7Foot Note 7×1 December 2021 Minute Sheet at p 8.Terry Xu is the chief editor and director of the appellant.8Foot Note 8×Affidavit of TX at para 2.By the next hearing, additional camera footage was adduced, as well as new transcripts and translations of the interview of the elderly lady.",
        "Summary of the appellant’s case": "5 The appellant argues the Correction Direction was wrongly issued on various grounds. First, the subject statement contained in the Correction Direction is a creation of the Minister. The subject statement does not appear in the Instagram Stories or in the appellant’s posts. Moreover, the statement in the Instagram Stories is one of opinion only (as opposed to fact).9Foot Note 9×AWS at para 9(a). 6 Second, even if the statements in the appellant’s post were of fact, the Minister failed to discharge his burden to show that the statements are false.10Foot Note 10×AWS at para 9(b).The complaints by the police posted on its Facebook page (which I understand to refer to the press statement issued by the police on 19 May 2021), have nothing to do with the contents of the subject statement; the police’s press statement concerns the allegation that four police officers crowded around the elderly lady and told her off for not wearing a face mask. This is true based on the video evidence: there were four police officers around her, and a police officer did speak loudly to the elderly lady and took issue with her not wearing a mask. This is further supported by evidence obtained by Ms Pak from the elderly lady. In contrast, the police failed to provide video evidence which is in their possession. 7 Third, there has also been an abuse of power by the Minister in his directing that TOC post the corrective notice as a new Facebook post, as opposed to a corrective notice atop the offending post.11Foot Note 11×AWS at para 9(c). 8 In further arguments, after the respondent adduced additional video footage, the appellant contends that s 116(g) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) is applicable to the present case. The appellant’s argument is twofold. First, the decision inThe Online CitizenPte Ltd v Attorney-General[2020] SGHC 36 (“TOC (HC)”)should not be followed in so far as it concluded that s 2(1) of the EA disapplied various parts of the EA (including s 116(g) of the EA) in proceedings where evidence has been led solely by affidavit, such as in an appeal under the Act.12Foot Note 12×Appellant’s supplementary written submissions dated 16 February 2022 (“ASWS”) at paras I(ii) and I(v).Alternatively, the adverse inference is an evidential principle in the common law available to the court. Thus, the court is able to draw an adverse inference presently. Second, an adverse inference ought to be drawn despite the respondent having adduced additional footage. Only select extracts from the body-worn camera footage of the officers were produced, leaving large gaps in the footage which remained unproduced.13Foot Note 13×ASWS at para I(xii). 9 Separately, the appellant contends that no weight should be placed on the police report filed by the elderly lady’s daughter-in-law, which the respondent relies on to suggest that the elderly lady suffered from dementia. The circumstances surrounding the making of the report as well as the contents of the report cast doubt on its veracity. Notably, the police report was not tendered before the first hearing and is a belated attempt by the respondent to bolster its case.14Foot Note 14×ASWS at paras II(xxvi), II(xxvii) and II(xxviii). 10 Finally, the translation produced by the appellant through a translation service company, Raffles Translation Services, should be preferred over the respondent’s translation.15Foot Note 15×ASWS at paras III(xxxv) and III(xxxvi).",
        "Summary of the respondent’s case": "11 Applying the approach laid down inThe Online CitizenPte Ltd v Attorney-General and another appeal and other matters[2021] 2 SLR 1358 (“TOC (CA)”), the respondent argues that the Correction Direction was correctly issued. First, the identified subject statement was contained in the TOC Posts.16Foot Note 16×RWS at para 15. 12  Second, the subject statement is a statement of fact. Connectedly, that TOC had only reported on the subject statement does not render it any less a statement of fact. Similarly, it is immaterial that the TOC Posts were amended to include quotations from the police’s press release; the nature of the subject statement remains the same.17Foot Note 17×RWS at paras 19, 21, and 22. 13 Third, the subject statement is false. The respondent offers four reasons: one, the subjective view of the original poster that the elderly lady was yelled at for not wearing a mask is irrelevant as an objective approach is applied in determining the falsity of a subject statement;18Foot Note 18×RWS at para 25(a)two, the factual allegations have been refuted via the affidavit of Ng Yong Sin Willy (“Willy Ng”) which contains a statutory declaration by one of the officers present, Station Inspector Lim Kok Hwee Jeff (“SI Jeff”), that the elderly lady was not reprimanded or taunted;19Foot Note 19×RWS at para 25(b).three, the video footage (as originally adduced), from SI Jeff, did not assist the appellant’s case;20Foot Note 20×RWS at para 25(c).and four, the interview with the elderly lady should not be relied upon either for reasons, inter alia, such as that her responses were not given on oath, that her memory and mental state is unclear, and that parts of her response were contradicted by the police’s evidence.21Foot Note 21×RWS at para 25(d).Ultimately, the elderly lady did not say that the police had reprimanded and taunted her.22Foot Note 22×RWS at para 25(d(ii)). 14 In further submissions, after additional video footage, and a separate translation of the transcript of the interview of the elderly lady were adduced, the respondent argues that it is no longer necessary to determine whether s 116(g) of the EA or common law principles on the drawing of adverse inferences apply in an appeal under the Act.23Foot Note 23×Respondent’s further submissions dated 11 February 2022 (“RFS”) at paras 8 and 9.The respondent further reiterates that the police report filed by the daughter-in-law of the elderly lady as well as the elderly lady’s own responses during her interview with Ms Pak raises serious concerns about her mental faculty and the reliability of what she said.24Foot Note 24×RFS at para 13.And finally, the respondent argues that the transcripts produced by the respondent should be preferred, as the appellant’s latest version, procured from a transcription service, was not properly adduced by way of affidavit, and contained various inaccuracies.25Foot Note 25×RFS at paras 15 and 16.",
        "The decision": "15  The appeal fails as the outcome of the appeal is moot, given that TOC is unable to operate its websites and social media accounts. In any event, as the subject statement is an untrue statement of fact, the requirements under s 17(5) of the Act for a successful appeal are not made out.",
        "Analysis": "16 The application, an appeal to the Court in respect of the setting aside of a correction direction, is governed by s 17(5) of the Act, meaning that one of the following grounds must be made out: (a) there was no communication in Singapore; (b) the subject statement is not a statement of fact, or is a true statement of fact; or (c) technical compliance with the correction direction is not possible. What is in play in the present case is only whether the subject statement is a statement of fact or that it is true. 17 The controlling authority isTOC(CA). As argued by the respondent, a number of steps were laid out byTOC (CA)at [163], which in summary are as follows: (a) the determination of the Minister’s intended meaning of the subject statement;(b) whether the subject material contains the subject statement identified in the direction by the Minister;(c) whether the subject statement is a statement of fact;(d) whether the subject statement is false; and(e) whether the statement has been or is being communicated in Singapore.",
        "The Issues": "18 The specific main issues arising are: (a) Whether the proceedings are moot. (b) The intended meaning of the subject statement. (c) Whether the subject statement is contained in the underlying material. (d) Whether the subject statement is a statement of fact or is a true statement of fact. (e) Other matters: (i) Whether the elderly lady suffers from dementia. (ii) Whether a presumption could arise under s 116(g) of the EA. (iii) Whether there was abuse by the Minister in the issuing of the correction direction.",
        "Whether the proceedings are moot": "19 While this was not raised initially by the parties, I was concerned at the further hearing that any decision by the Court would be moot. 20 The defendant, TOC, is subject to licencing under the Broadcasting Act 1994 (2020 Rev Ed) and its regulations, as a registered Internet Content Provider. This licence was cancelled as of 15 October 2021: Infocomm Media Development Authority, “Cancellation of The Online Citizen Pte Ltd Class Licence”, press release (15 October 2021),(“15 October 2021 Press Release”). As the TOC website was no longer appropriately licenced, it could no longer use its websites and social media accounts at the time of the hearing, and certainly by the time of this judgment. In fact, it had been suspended from doing so as of 14 September 2021 due to its “fail[ure] to comply with the requirement to make an annual declaration of its funding sources in respect of TOC’s 2020 Undertaking and Statutory Declaration”: 15 October 2021 Press Release. 21 The Correction Direction issued by the Minister was made under s 11 of the Act, and specified that the correction notice should be posted on TOC’s Facebook page. The present appeal is against the Correction Direction. As the Correction Direction required action with respect to a specific social media site,ie, TOC’s Facebook page, if that site is no longer operated or in use, the Correction Direction is not displayed. Since the Correction Direction is not displayed, it cannot be removed, even if the appeal is successful. 22 Mr Lim Tean, counsel for the appellant, maintained that his client still wishes to pursue the application as a matter of principle. While that is understandable, to my mind, the Court should only make an order under the Act if there is some practical effect. Courts would be slow to grant relief, especially in a public law setting, if the relief sought would be futile, and of no effect:AG (Pakistan) (R on the application of)v Secretary of State for the Home Department[2011] EWCA Civ 998 at [7] to [9]; see alsoPannir Selvam a/lPranthaman v Attorney-General[2022] SGCA 35 at [29], which affirmed the High Court’s decision inPannir Selvam a/l Pranthaman v Attorney-General[2022] 3 SLR 838 at [73] where the relief sought by the applicant was denied on the basis that it would be of “zero or very limited utility, whether to the Applicant or the criminal Bar as a whole”. This is all the more so when the issues are factual and would not have a wider import. 23 Here, any vindication of TOC’s position would not lead to any practical consequence. It cannot operate its websites or social media accounts. The Correction Direction does not appear anywhere, so there is nothing to complain of. While it is true that the fact that the Correction Direction was issued would always remain, I could not see that that fact would engage any substantive interest of TOC. No harm or injury arose from the issuing of the Correction Direction alone. Though this is not a public or administrative law case, I am of the view that the same approach should apply: the underlying basis is simply that the Court should not be asked for orders that are ultimately futile or moot. A similar approach was taken inHengHoldings SEA (Pte) Ltd v Tomongo Shipping Co Ltd[1997] 2 SLR(R) 669 (“Heng Holdings(SEA)”), where the Court refused to deal with the appellant’s contention therein that an injunction should not have been granted or ought to have been discharged or set aside earlier. This was as the injunction had been discharged and parties had entered final judgment by consent with regard to the claim giving rise to the injunction by the time of the hearing:Heng Holdings (SEA)at [29]. Pertinently, as part of the final judgment (which was granted by consent), no injunction was sought as such relief was no longer necessary:Heng Holdings (SEA)at [29]. Any pronouncement or order granted on this front would thus have been academic. The appeal should be dismissed on this ground alone. Nonetheless, I turn to consider the other grounds for completeness.",
        "The intended meaning of the subject statement": "24 The Correction Direction issued specifies that the subject statement, which is false, had been communicated. The subject statement as contained in the Correction Direction reads:26Foot Note 26×Affidavit of TX at Annex C. The Police reprimanded and taunted the elderly woman, shown in the Instagram story by Instagram user [the original poster] on 18 May 2021, for not wearing a mask. 25 The Correction Direction further specifies that the text from which the Subject Statement is derived reads:27Foot Note 27×Affidavit of TX at Annex C. The Instagram story by [the original poster] was replicated in the abovementioned online locations, and contained the following statements: •  “Do we really need 4 policemen to cluster an elderly lady that took off her mask because she was feeling breathless?!?” •  “Poor auntie already put back on her mask but they continued to tell her off to the extent someone had to come and salvage the situation.” •  “Please @singaporepoliceforce there are people not wearing a mask and asking why people no badge, go and spend your time and make yourself more useful! Not taunt an old cardboard collection auntie!” •  “Instead of helping each other get through this, you taunt others with your authority?!?!” 26 A subject statement is defined by s 10(1)(a) of the Act to be the false statement that has been or is being communicated in Singapore. The meaning that the Minister intended to place on the subject statement 27  This must be determined, as the Court can neither consider subject statements that were not identified by the Minister nor uphold the Correction Direction on the basis of another subject statement that has not been articulated in the correction direction:TOC(CA)at [125]. In doing so, the Court must proceed on an objective construction of the subject statement, in light of the Correction Direction as a whole, with the starting point being the words used in the subject statement:TOC (CA)at [133]. 28 Here, I am satisfied that the text of the subject statement provides sufficient certainty, without the need to delve into the context. 29 ‘Reprimand’ is defined, in the Shorter Oxford English Dictionary as follows: Rebuke or censure sharply. 30 As for ‘taunting’, the Shorter Oxford English Dictionary defines the verb ‘taunt’ in its non-obsolete meaning as follows: Utter a taunt or taunts to (a person); reproach (a person) with something in a sarcastic, scornful, or insulting way. The noun ‘taunt’ in turn is defined as: An insulting or provoking remark or speech; a thing said to anger or pain a person; a jib, a jeer. What is at the core of the meaning of the word, whether as a verb or a noun, is the element of being insulting or scornful, or a showing of disrespect to the person being taunted.",
        "Whether the subject material is contained in the underlying material": "31 -The appellant appears to contend in its written submissions that the subject statement is a creation of the Minister that is not based on the subject material.28Foot Note 28×AWS at para A(i).The appellant argues that the subject statement was a creation of the Minster, not appearing in any post. It is also said that it has no connection to the complaint made by the police on 19 May 2021 (posted on the police’s Facebook page), which did not contain any refutation of any allegation of intimidation or taunting by the police.29Foot Note 29×AWS at paras B(4) and B(5). 32 An objective approach is taken here as well:TOC (CA)at [136].   Furthermore, for present purposes, what is important is that the subject statement need not be expressly stated as such in the subject material, but only that it could be construed or interpreted as such. The guidance from the Court of Appeal is that the material should be interpreted objectively in its context, regardless of the subjective intention of the statement maker:TOC (CA)at [156]. At the nub of the exercise is whether there would be “an appreciable segment or a particular class of the potential readership … who would construe [the subject material] as making or containing the subject statement, or regard the subject statement as a reasonable interpretation of the subject material”:TOC (CA)at [156].  This is done as a matter of impression:TOC (CA)at [157]. 33 The subject material refers to the material in respect of which the correction direction was issued:TOC (CA)at [109]. Presently, this refers to the Instagram Stories reported in the TOC Posts which included the following captions: (a) “Do we really need 4 policemen to cluster an elderly auntie that took off her mask because she was feeling breathless?!?”;(b) “Poor auntie already put back on her mask but they continued to tell her off to the extent someone had to come and salvage the situation.”;(c) “Please @singaporepoliceforce there are people not wearing a mask and asking why people no badge, go and spend your time and make yourself more useful! Not taunt an old cardboard collection auntie! ”; and(d) “Instead of helping each other get through this, you taunt others with your authority?!?!”. 34 An objective interpretation of the subject material discloses that there were four policemen telling off and taunting an elderly lady. Thus, there is sufficient basis for the subject statement, which, to recap, states that the police reprimanded and taunted an elderly woman for not wearing a mask: see [24].",
        "Whether the statement is a statement of fact or is a true statement of fact": "35 The subject statement is one of fact, but is not a true statement. It is not a statement of an opinion and it is clear on the evidence that the statement was not in fact true. Whether the subject statement is one of fact 36  Section 2(2)(a) of the Act defines a statement of fact as follows: General interpretation 2.— (2) In this Act — (a) a statement of fact is a statement which a reasonable person seeing, hearing or otherwise perceiving it would consider to be a representation of fact; and This is an objective assessment:TOC(CA)at [158]. 37 Two sub-issues need to be examined. Firstly, whether the statement is one of opinion, as a statement of opinion is not a statement of fact. Secondly, whether it is material that TOC had only reported on the posts of the original poster. (1) Whether the subject statement is one of opinion 38 The appellant argues that the original poster’s statement is one of opinion only, and not a statement of fact.30Foot Note 30×AWS at para A(iii).The appellant points to the text of the Instagram Stories as showing that it indicated an opinion, and this is reinforced in an email sent by the original poster to the TOC as exhibited in the appellant’s affidavit. 39 The contention is without basis. The Instagram Stories are clear in stating a fact: it refers to actions and remarks made by the police officers that were observed by the original poster. While the Instagram Stories also contain a subjective assessment or evaluation of what was perceived,viz, the original poster’s opinion on the propriety of the actions of the police officers, the parts that were complained about by the Minister were the characterisation of things occurring or said. In this regard, the original poster’s explanation in his email is irrelevant. (2) Whether it is material that TOC had only reported on the posts of the original poster 40 The appellant further argues that it only reported what had been posted, and had edited its report to take in the response by the police. The appellant thus argues that the post it made was balanced and neutral.31Foot Note 31×AWS at para A(iv).As noted by the respondent, the appellant’s arguments are essentially an invocation of a defence of honest orbona fidereporting. That is not however catered for under the Act. There is no carve out for any repetition of a statement by a media outlet, or any third party. Additionally, that TOC had only reported on the posts does not detract from the subject statement falling within the definition of a statement of fact as per s 2(2)(a) of the Act. Plainly, the representations of facts emanating from the subject statement remain unaffected. 41 It is also irrelevant that TOC edited its report to take in the response of the police on 19 May 2021. The Correction Direction was directed at the posts of the TOC as they were on 18 May 2021 and in any event, the amendments did not alter the nature of the subject statement. Whether the subject statement is true 42 The bulk of the arguments put forward by the appellant is directed to maintaining that the subject statement is true. The appellant relies on the fact that the police did not dispute that there were four police officers at the scene, and that one of the police officers was speaking loudly at the elderly lady, taking issue with her not wearing a mask. This is said to be supported by the elderly lady’s recounting of events to Ms Pak. The appellant also takes issue with the police not releasing the video footage, and instead relying on a statement of just one of the four officers. 43 To reiterate, the subject statement reads: The Police reprimanded and taunted the elderly woman, shown in the Instagram story by Instagram user [the original poster] on 18 May 2021, for not wearing a mask. 44 What needs to be shown is that the police officers did in fact reprimand and taunt the elderly woman because she was not wearing a mask. The burden lay on the appellant to show this. (1) Whether the police officers were reprimanding and taunting the elderly lady 45 I am satisfied that it is not true that the officers were reprimanding and taunting the elderly lady. In determining this, I had to consider issues of evidence, and the initial absence of certain video footage. On review of the evidence (including the additional footage), there are deficiencies which cannot be resolved in favour of the appellant, who bore the burden. (A) Video footage 46 Initially only the body-worn camera footage from one officer was adduced. Additional footage was subsequently adduced after the Court’s initial remarks. 47 The respondent argues that the further footage shows that the police did not scold or taunt the elderly lady. I accept from viewing the evidence that there was no taunting or scolding. If anything, what was done was more of inquiry and advice. I note that from the video evidence, what is apparent is that at least two of the officers present were initially under the impression that the lady had lost her way. What was expressed was of concern with the aim of rendering assistance, by getting the elderly lady to put on her mask. The officer mainly dealing with her sat down next to her to talk to her and eventually helped her don on a mask. There is no room on an objective assessment to conclude that the elderly lady was being reprimanded or taunted. There was also no scolding. While the officers were not soothing, or obsequious, or mollifying, it would be a very long stretch to characterise their behaviour as scolding in any way, and certainly not reprimanding or taunting. At the very most, they were perhaps paternalistic or nagging, but there was no element of sharpness, insult, scorn, disrespect, or cruelty, let alone any hint of an intention to anger or cause pain or jeer. There was also no sarcasm present. 48 In fact, I could not see how the original poster could have in good faith concluded that there was reprimanding or taunting. In addition, I note that one of the officers bought food for the elderly lady, and from the additional videos, that two of the officers interacted with her in a similar manner (as observed at [47]) earlier in the day. (B) The interview with the elderly lady 49 The elderly lady gave an interview to Ms Pak. The appellant adduced this evidence to demonstrate the truth of the subject statement, namely that the elderly lady was indeed taunted, or at least treated badly by the police officers.32Foot Note 32×AWS at para B(9).This interview was captured on video and transcripts, which included a translation of the Hokkien used in the interview. The appellant had two sets of transcripts: an initial set filed as part of the appeal papers, and a subsequent one provided to the Court subsequently. On the basis that the appellant’s transcript contained inaccuracies, the respondent also adduced its own transcript of the interview. 50 As it was, the appellant did not in the end take issue with the accuracy of the respondent’s transcripts where it differs from the appellant’s. In the final analysis, I do not find that the transcripts could assist much in the Court’s determination of the material issues. 51 The assessment of what transpired is made objectively:TOC (CA)at [159]. How the elderly lady felt she was treated would be of some relevance in the Court’s assessment whether she was taunted or reprimanded. If the intended subject of a remark were to regard what was said as scolding or insult, that should be taken into account. But it would not be determinative. Neither would the speaker’s intentions, thought it may also be somewhat relevant. What matters is the objective assessment by the Court, from the video evidence capturing what transpired, and for the Court to come to a conclusion about what happened. How the actions and statements of the police officers may have been construed by those present, including the elderly lady, who was the one being spoken to, matters much less.",
        "Other matters": "Whether the elderly lady suffers from dementia 52 The respondent further argues that the elderly lady’s response during the interview, taken together with the police report, raise concerns about her mental faculties.33Foot Note 33×RFS at para 13.Specifically, the respondent refers to the possibility that the elderly lady may have been suffering from dementia. To this end, the respondent also points to discrepancies in the elderly lady’s answers to Ms Pak in the interview, including the fact that she kept saying that it was about to rain, when it was not, and her denial that the police officers had bought her dinner, though the police officer bought food for her. A police report filed by the elderly lady’s daughter-in-law was also adduced by the respondent: that report stated that the elderly lady had been suffering from dementia. 53 There is insufficient evidence before the Court for me to make any finding on this. The evidence before me is untested, and the elderly lady’s purported condition of dementia is unsupported by any medical report or any other form of corroboration. In the absence of medical evidence, the Court should not make such a finding. Whether a presumption could arise under s 116(g) of the EA 54 The issue arises because the respondent previously had not adduced all the relevant video footage of the incident. Having adduced the additional footage, the respondent argues that the Court need not determine whether any adverse inference may be drawn.34Foot Note 34×RFS at paras 8 and 9.While it may be that relevant footage has been adduced, the question of an adverse inference should still be addressed in these grounds, since the further video was only adduced following the Court’s indication that it would not follow Justice Belinda Ang’s decision inTOC(HC). 55 Section 116(g) of the EA reads: Court may presume the existence of certain facts 116.  The court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct, and public and private business, in their relation to the facts of the particular case. Illustrations The court may presume — … (g) that evidence which could be and is not produced would if produced be unfavourable to the person who withholds it; … 56 Section 2(1) of the EA reads: Application of Parts 1, 2 and 3 2.—(1)  Parts 1, 2 and 3 apply to all judicial proceedings in or before any court, but not to affidavits presented to any court or officer nor to proceedings before an arbitrator. Section 116(g) is in Part 3 of the EA, and is thus subject to s 2(1). 57 I am afraid, with respect, I remain unpersuaded that s 2(1) of the EA excludes the operation of s 116(g) entirely in respect of evidence contained in affidavits, for the reasons given by the respondent in that case. I read s 2(1) as excluding the operation of s 116(g) to the contents of affidavits, that is, affidavit contents are not to be struck out even if they contravene Parts 1 to 3 of the EA.  How the evidence contained in the affidavits are to be weighed and treated, in particular, their admissibility, relevance, and weight, and other effects, are matters that remain governed by Parts 1 to 3, including s 116(g) of the EA. 58 I further note that the Court inTOC (HC)did nonetheless conclude that the provisions of the EA that were to be disapplied embodied general common law principles. Section 116(g) too merely encapsulates a general inference available in the common law. I am of the view at this time that if evidence is not brought forward, an adverse inference may be drawn at the level of general law in some instances, that the truth of the matter lies against the party that should have brought in that evidence. 59 As it is, on the facts, s 116(g) need not be invoked, as further evidence was given in the form of the additional video footage. Whether there was abuse by the Minister in the issuing of the correction direction 60 The appellant argues that it was improper for a Correction Direction to stipulate that the correction notice be in the form of a new post on its Facebook page, rather than the norm which is for it to be posted on top of the offending post.35Foot Note 35×AWS at paras C(1) and C(2).This departure from the norm shows that there was no basis for the corrective notice to appear on top of the posts complained of. There is, however, no merit in this submission. Not only is there no evidence of such a norm, the specific manner in which the present correction notice is to be displayed is not proscribed by the Act. Under s 11(2) of the Act, the Minister may require the correction notice to be communicated in a specified online location; s 11(5)(a) further defines “specified” as what is specified in the correction direction, which, in the present case, has been stipulated to be a new post on the appellant’s Facebook page. 61 It is further said that the use of a subject statement not contained in any of the appellant’s posts demonstrates a lack ofbona fides. This has been largely dealt with in my analysis above on the issue of the content of the Minister’s statement: see [31] to [34]. It suffices to note that the allegation of abuse has not been made out.",
        "Conclusion": "62 For the above reasons, the appeal is dismissed. Aedit AbdullahJudge of the High Court Lim Tean (Carson Law Chambers) for the appellant; Tan Ee Kuan, Sivakumar Ramasamy, Jocelyn Teo Meng Hui (Attorney-General’s Chambers) for the respondent."
    }
}