{
    "case_title": "Bagadiya Brothers (Singapore) Pte Ltd vGhanashyam Misra & Sons Pte Ltd",
    "ncitation": "[2022] SGHC 246",
    "coram": "S Mohan J",
    "sections": {
        "Facts": "5 The plaintiff is a company incorporated in Singapore and is in the business of the import and export of various commodities. The defendant is a company incorporated in India and is in the business of mining and trading iron ore.1Foot Note 1×1st affidavit of Mahesh Kumar Agrawal dated 3 November 2021 (“MKA-1”) paras 6–7.",
        "The sale of iron ore fines": "6 In February 2017, the parties entered into two contracts for the sale of iron ore fines (the “Iron Ore Fines”) from the defendant to the plaintiff, as follows:2Foot Note 2×MKA-1 para 8. (a) A sale and purchase contract executed on 9 February 2017 (the “Tiger Shanxi Contract”); and(b) A sale and purchase contract executed on 13 February 2017 (the “Asia Ruby Contract”); (collectively, the “Contracts”). 7 Under the Tiger Shanxi Contract, the defendant agreed to sell to the plaintiff 23,000 wet metric tonnes (“WMT”) of iron ore fines with 57% Fe (ie, iron) content at a base price of US$33.50 per dry metric ton (“DMT”), on a free on board basis. The port of loading was Haldia Port, India, and the port of discharge was in China. The parties subsequently agreed that the vessel “Tiger Shanxi” would be the vessel nominated to carry the cargo from India to China.3Foot Note 3×MKA-1 paras 13, 14 and 16. 8 Under the Asia Ruby Contract, the defendant agreed to sell to the plaintiff 10,000 WMT of iron ore fines with 57% Fe content, at a base price of US$34.50 per DMT, on a free on board basis. The port of loading was Dhamra Port, India and the port of discharge was in China. The parties subsequently agreed that the vessel “Asia RubyIII” would be the vessel nominated to carry the cargo from India to China.4Foot Note 4×MKA-1 paras 30, 31 and 33. 9 The Contracts each contained a price adjustment clause, which described how the base price of the Iron Ore Fines would be adjusted in the event that the iron content, impurities and physical specifications of the Iron Ore Fines delivered to the plaintiff deviated from the contractual specifications (the “Adjustment Clause”). The plaintiff also had the right under the Contracts to reject the entire cargo or renegotiate the price, if the iron content of the Iron Ore Fines fell below 56%.5Foot Note 5×MKA-1 paras 15, 21, 32 and 39. 10 The Contracts also each contained an arbitration agreement (collectively, the “Arbitration Agreements”), which provided as follows:6Foot Note 6×MKA-1 pp 188 and 194, cl 15. Any dispute between Seller and Buyer which may arise hereunder and which cannot be settled by mutual accord shall be referred to Singapore International Arbitration Centre (SIAC) for arbitration in Singapore in English Language. Seat of Arbitration will be in Singapore. English Law shall apply. The arbitration award shall be final and binding upon both parties and the arbitration fee shall be borne by the losing party. 11 Pursuant to the Contracts, the defendant loaded the Iron Ore Fines onto theTiger Shanxiand theAsia Ruby IIIby 28 February 2017 and 21 February 2017 respectively.7Foot Note 7×MKA-1 paras 49 and 53.TheAsia Ruby IIIarrived at her nominated port of discharge in Shandong, China, on or around 11 March 2017 and discharge was completed on the same day. TheTiger Shanxiarrived at her nominated port of discharge in Tangshan, China, on or around 1 April 2017 and discharge was completed on or around 3 April 2017.8Foot Note 8×MKA-1 paras 52 and 54. 12 It was not in dispute that the Iron Ore Fines did not meet the specifications stated in the Contracts (the “cargo defects”). In particular, the iron content of the Iron Ore Fines fell below the contractually specified minimum of 56%. The Iron Ore Fines supplied under the Tiger Shanxi Contract also contained an excess of silica content, while the Iron Ore Fines supplied under the Asia Ruby Contract contained an excess of silica and moisture content.9Foot Note 9×MKA-1 paras 20 and 38. 13 In light of the cargo defects, on 4 April 2017, the parties agreed to an addendum to each of the Contracts (collectively, the “Addenda”), with the aim of revising the final price of the Iron Ore Fines payable by the plaintiff to the defendant.10Foot Note 10×MKA-1 para 57.The material terms of the Addenda were as follows: (a) The plaintiff would pay a provisional price of US$21 per DMT for the Iron Ore Fines supplied under the Tiger Shanxi Contract, and US$26 per DMT for the Iron Ore Fines supplied under the Asia Ruby Contract.11Foot Note 11×MKA-1 paras 58(3) and 62(3).(b) The plaintiff would try to sell the Iron Ore Fines “as is” or by blending it with other cargoes, in order to improve the realisation from the sale of the Iron Ore Fines locally in China. The final price of the Iron Ore Fines would be the actual amount realised from their sale, after deducting related costs such as freight, discharging costs, taxes and duties. Payment of the provisional price would be offset against the final price (the “Price Adjustment Mechanism”).12Foot Note 12×MKA-1 paras 58(5)–(6) and 62. 14 The Iron Ore Fines were blended with other cargoes purchased by the plaintiff. The Iron Ore Fines supplied under the Asia Ruby Contract were sold to third parties from April 2017 onwards, while the Iron Ore Fines supplied under the Tiger Shanxi Contract were sold to third parties from May 2017 onwards.13Foot Note 13×MKA-1 paras 82 and 92.According to the plaintiff, the sales were completed by Glencore International AG (“Glencore”), in its capacity as the plaintiff’s agent.14Foot Note 14×MKA-1 paras 74–75. 15 On 30 May 2017, the plaintiff made a provisional payment of US$417,555.06 to the defendant in respect of the Contracts (the “Provisional Payment”). This amount was lower than the provisional price that the parties had agreed to under the Addenda, as the plaintiff alleged that the defendant had agreed to lower the provisional price of the Iron Ore Fines.15Foot Note 15×MKA-1 paras 68(5) and 68(7).",
        "The arbitration proceedings": "16 Disputes subsequently arose between the parties as to whether they had each fulfilled their obligations under the Contracts, as amended by the Addenda. On 13 August 2019, the defendant commenced two sets of arbitration proceedings against the plaintiff pursuant to the Arbitration Agreements, in SIAC Arbitration No 279 of 2019 (in respect of the Tiger Shanxi Contract) and SIAC Arbitration No 280 of 2019 (in respect of the Asia Ruby Contract). Both arbitration proceedings were subsequently consolidated by the consent of the parties.16Foot Note 16×MKA-1 pp 53–54 paras 116 and 118. 17 The defendant’s primary claim in the Arbitration was for the original price of the Iron Ore Fines agreed upon by the parties under the Contracts (ie, US$33.50 and US$34.50 per DMT, see [7]–[8] above). The defendant contended that the plaintiff had failed to intimate it of the final price at which the Iron Ore Fines had been sold to third parties, and that the plaintiff should therefore be presumed to have utilised the entirety of the Iron Ore Fines for its own gain.17Foot Note 17×MKA-1 pp 672–673 (Statement of Claim para 11.4).In the circumstances, the defendant’s position was that the parties should “revert” to the prices agreed upon by them under the Contracts.18Foot Note 18×MKA-1 p 849 (Claimant’s Written Opening Submissions para 41). 18 On the other hand, the plaintiff’s case was that pursuant to the Price Adjustment Mechanism in the Addenda, the final price of the Iron Ore Fines should be determined by the actual price that they had been sold to third parties for. Further, the plaintiff highlighted that the Iron Ore Fines had been blended with the plaintiff’s own cargoes, and had been sold in various quantities on different dates and at different prices.19Foot Note 19×MKA-1 p 696 (Statement of Defence and Counterclaim para 62).Accordingly, the plaintiff claimed that the final price of the Iron Ore Fines should be calculated with reference to the quantity and quality of the Iron Ore Fines that had been blended with the plaintiff’s cargo, and the prevailing market price of iron ore fines with similar iron content on the particular day of sale, as indicated by industry publications such as the “Mysteel” price index (the “plaintiff’s calculations”).20Foot Note 20×MKA-1 p 696 (Statement of Defence and Counterclaim paras 62.3 and 63).The plaintiff’s calculations were set out in the witness statement of the plaintiff’s executive director, Mr Mahesh Kumar Agrawal (“Mr Agrawal”), which was filed in the Arbitration.21Foot Note 21×MKA-1 p 379 para 2; MKA-1 pp 408–416.Based on the plaintiff’s calculations, the final price of the Iron Ore Fines should have been approximately US$58,678.80lessthan the Provisional Payment.22Foot Note 22×MKA-1 p 52 para 113.The plaintiff therefore counterclaimed for this sum. Additionally, the plaintiff raised various counterclaims for damages for the defendant’s alleged breaches of the Contracts.23Foot Note 23×MKA-1 pp 705–706 (Statement of Defence and Counterclaim paras 80 and 83). 19 The hearing of the Arbitration took place from 24 March 2021 to 25 March 2021.24Foot Note 24×MKA-1 p 62 para 95.In the defendant’s opening statement on the first day of the hearing, the defendant’s counsel in the Arbitration appeared to question the precise role of Glencore in the sale of the Iron Ore Fines to third parties. In particular, it was suggested that Glencore had not acted as the plaintiff’s agent and had instead purchased the Iron Ore Fines from the plaintiff, as a buyer.25Foot Note 25×MKA-1 p 958 (Hearing transcript from 24 March 2021, p 18 lines 5–10).In response to this contention, the plaintiff’s counsel in the Arbitration sought to introduce into evidence copies of invoices from Glencore, which had been translated from Mandarin to English (the “Glencore Invoices”).26Foot Note 26×MKA-1 p 63 para 98.The plaintiff’s counsel in the Arbitration claimed that the Glencore Invoices would establish that Glencore had only acted as the plaintiff’s agent in the sale of the Iron Ore Fines, and that the Iron Ore Fines had not been sold to Glencore.27Foot Note 27×MKA-1 p 1057 (Hearing transcript from 25 March 2021, p 2 line 19 to p 3 line 1). 20 The Arbitrator did not grant leave for the Glencore Invoices to be admitted during the hearing and took the matter under advisement.28Foot Note 28×MKA-1 p 64 para 99.Following the conclusion of the hearing on 25 March 2021, the Arbitrator requested that the parties file post-hearing submissions on several issues, including: (a) the admissibility of the Glencore Invoices; and (b) any agency relationships that might have existed among the parties and Glencore.29Foot Note 29×MKA-1 p 64 para 100; MKA-1 p 1280 (Procedural Order No 7). 21 In the Award dated 5 August 2021, the Arbitrator found,inter alia, that: (a) The Glencore Invoices were adduced too late and would therefore not be admitted into evidence.30Foot Note 30×MKA-1 p 152 (Award at para 66). (b) The plaintiff was in breach of the Contracts and the Addenda, by failing to make payment of a 20% advance agreed to by the parties under the Contracts, and the provisional price as agreed to under the Addenda.31Foot Note 31×MKA-1 pp 154 and 161 (Award at paras 78 and 110). (c) Given the plaintiff’s failure to make payment for the Iron Ore Fines, title for the Iron Ore Fines had not passed from the defendant to the plaintiff. Accordingly, the plaintiff had acted as the defendant’s agent in the onward sale of the Iron Ore Fines to third parties, and therefore owed the defendant fiduciary duties.32Foot Note 32×MKA-1 pp 167–168 (Award at paras 138, 145 and 146). (d) The Price Adjustment Mechanism required both parties to consider the actual amounts realised from the sale of the Iron Ore Fines, and to jointly calculate the amounts due to the defendant. As the defendant’s fiduciary, the plaintiff was obliged to account to the defendant. The plaintiff had breached its fiduciary duties to the defendant by unilaterally calculating the final price of the Iron Ore Fines. The plaintiff had failed to keep the defendant informed of,inter alia, who the Iron Ore Fines had been sold to and the payment terms on which they had been sold. While some of this information had been provided by the plaintiff for the purposes of the Arbitration, this information had been adduced “too little, too late”.33Foot Note 33×MKA-1 pp 168, 169 and 171 (Award at paras 147–149, 151 and 160). (e) The parties had not agreed upon a final price for the Iron Ore Fines in the Contracts, and the Price Adjustment Mechanism set out in the Addenda was “vague and ambiguous”. This had also been the first time that the parties had done business together. In the circumstances, applying s 8 of the Sale of Goods Act 1979 (c 54) (UK) (the “SOGA”), the plaintiff was obliged to pay the defendant a “reasonable price”.34Foot Note 34×MKA-1 p 170 (Award at para 154). (f) The plaintiff’s calculations were not helpful. While the plaintiff’s calculations had been endorsed by its expert witness, Mr Roger Emmott (“Mr Emmott”), Mr Emmott was a metallurgist who had no experience in the purchase and sale of iron ore fines.35Foot Note 35×MKA-1 p 171 (Award at para 158). (g) The appropriate final price of the Iron Ore Fines was the original price agreed upon by the parties under the Contracts, with downward revisions made pursuant to the Adjustment Clause to take into account the cargo defects.36Foot Note 36×MKA-1 p 171 (Award at para 161). (h) Given the plaintiff’s breach of the fiduciary duties it owed to the defendant in failing to account to the defendant how the final prices of the Iron Ore Fines were arrived at, the actual amount of proceeds realised from the sale of the Iron Ore Fines was immaterial. It was therefore not necessary to make a formal decision on the nature of the relationship between the plaintiff and Glencore, or on the precise role of Glencore in the sale of the Iron Ore Fines.37Foot Note 37×MKA-1 pp 162 and 174 (Award at footnote 52 and para 174). (i) The plaintiff’s counterclaims were dismissed.38Foot Note 38×MKA-1 p 179 (Award at para 198).",
        "The parties’ cases": "22 The plaintiff filed OS 1115 on 3 November 2021, seeking to set aside the Award on the basis that (a) there had been a breach of the rules of natural justice in connection with the making of the Award under s 24(b) of the IAA; (b) the plaintiff had been unable to present its case under Art 34(2)(a)(ii) of the Model Law; and (c) the Award dealt with issues beyond the scope of the parties’ submission to arbitration under Art 34(2)(a)(iii) of the Model Law. Based on its written submissions, the plaintiff’s grievances appeared to concentrate on the following aspects: (a) The Arbitrator had allowed the defendant to belatedly raise an issue about Glencore’s role in the onward sale of the Iron Ore Fines to third parties (the “Glencore Issue”). The plaintiff had not been afforded a reasonable opportunity to present its case on the Glencore Issue, which in any case was outside the scope of the parties’ submission to arbitration.39Foot Note 39×Plaintiff’s Written Submissions dated 26 January 2022 (“PWS”) para 54. (b) The Arbitrator had failed to appreciate the issues in the Arbitration, as evidenced by the fact that the Arbitrator had refused to admit the Glencore Invoices and had accorded little weight to the plaintiff’s calculations.40Foot Note 40×PWS paras 73–74.Consequently, the plaintiff had also been deprived of an opportunity to present its case in respect of the Glencore Invoices.41Foot Note 41×PWS para 79.This was a breach of the rules of natural justice and prevented the plaintiff from presenting its case. (c) The Arbitrator had not given the plaintiff a chance to be heard or an opportunity to present its case on the existence of a fiduciary relationship between the parties, before finding that the plaintiff had acted as the defendant’s agent in the sale of the Iron Ore Fines to third parties. This was also an issue beyond the scope of the Arbitration.42Foot Note 42×PWS para 90. (d) The Arbitrator failed to address the issues that the parties had submitted to arbitration, when the Arbitrator re-grouped the 17 issues in the “Agreed List of Issues” into seven headings in the Award.43Foot Note 43×PWS paras 111–112. 23 At the hearing before me on 4 February 2022, counsel for the plaintiff, Mr Kelvin Kek (who was not the plaintiff’s counsel in the Arbitration), appeared however to rely on afifthground for setting aside the Award, which was that s 8 of the SOGA had not been pleaded or relied on by either party in the Arbitration. Indeed, this argument did not even form the crux of Mr Kek’s oral submissions, and was instead only raised fleetingly in his oral reply submissions at the end of the hearing.44Foot Note 44×Minute sheet for HC/OS 1115/2021 dated 4 February 2022, p 11. 24 Following the hearing on 4 February 2022, I directed the parties to address me on whether s 8 of the SOGA had been pleaded or otherwise raised by either party during the Arbitration. The parties tendered further submissions on this issue on 15 March 2022. On 12 April 2022, I further directed the parties to address me on the applicability of Art 34(4) of the Model Law to the present application, and whether it would be appropriate in the present case to remit the Award to the Arbitrator. 25 The plaintiff utilised this opportunity to forcefully argue that neither party had pleaded nor raised (a) the alleged ambiguity in the Price Adjustment Mechanism contained in the Addenda (the “Ambiguity Issue”) (see [21(e)] above); or (b) the applicability of s 8 of the SOGA to the Arbitration (the “SOGA Issue”) (see [21(e)] and [21(g)] above).45Foot Note 45×Plaintiff’s further submissions dated 15 March 2022 (“PFS”) paras 3–4.The plaintiff highlighted that the parties’ positions in the Arbitration had not been that the Price Adjustment Mechanism was ambiguous, but rather that the final price of the Iron Ore Fines should be determined having regard to the Contracts and/or the Addenda.46Foot Note 46×PFS para 5.Any reference made to the SOGA during the Arbitration had been to provisions other thans 8, and in relation to issues unrelated to the final price of the Iron Ore Fines.47Foot Note 47×PFS para 6.Accordingly, the Arbitrator had deprived the parties of a reasonable opportunity to be heard on the Ambiguity Issue and the SOGA Issue, and this was a breach of the rules of natural justice.48Foot Note 48×PFS paras 8 and 12. 26 The plaintiff further submitted that it was not appropriate in the present case to remit the Award to the Arbitrator, and that the Award should instead be set aside in its entirety. The plaintiff contended that the court’s power to remit an arbitral award under Art 34(4) of the Model Law can only be exercised at the request of a party. The defendant, having failed to make a request to remit the Award in its affidavits, written submissions or at the hearing on 4 February 2022, should therefore not be allowed to avail of this power.49Foot Note 49×Plaintiff’s 2nd further submissions dated 22 April 2022 (“2PFS”) para 2.The present case was also not suited to remission as, similar to the facts ofBZW and another v BZV[2022] 1 SLR 1080 (“BZW”), the Arbitrator’s breaches of natural justice were “fundamental and woven deeply” into the Award. There were also concerns that the Arbitrator would not be able to approach the remitted issues in a fair and balanced way.50Foot Note 50×2PFS paras 5 and 11. 27 The defendant acknowledged in its further submissions that s 8 of the SOGA had not been expressly pleaded or otherwise referred to by parties during the Arbitration.51Foot Note 51×Defendant’s further submissions dated 15 March 2022 (“DFS”) para 3.Nonetheless, the defendant contended that the “substance” of the provision had been pleaded and submitted on by parties. For ease of reference, s 8 of the SOGA provides as follows: 8 Ascertainment of price. (1) The price in a contract of sale may be fixed by the contract, or may be left to be fixed in a manner agreed by the contract, or may be determined by the course of dealing between the parties. (2) Where the price is not determined as mentioned in sub-section (1) above the buyer must pay a reasonable price. (3) What is a reasonable price is a question of fact dependent on the circumstances of each particular case. 28 The defendant submitted that its pleaded claim had effectively been based on s 8(1) of the SOGA, as its position in the Arbitration had been that the price of the Iron Ore Fines had been “fixed by the [Contracts]”.52Foot Note 52×DFS para 6.Likewise, the plaintiff’s reliance on the Price Adjustment Mechanism was essentially an argument that the price had been “left to be fixed in a manner agreed by the [Contracts]”, within the meaning of s 8(1) of the SOGA.53Foot Note 53×DFS para 7.Accordingly, when the Arbitrator rejected both parties’ arguments and instead turned to apply s 8(2) of the SOGA, the Arbitrator’s chain of reasoning arose naturally from the parties’ pleaded cases.54Foot Note 54×DFS para 11.2.In any case, the plaintiff had not raised any complaints in relation to the SOGA Issue in any of its affidavits or its written submissions filed prior to the hearing on 4 February 2022. Curial intervention was therefore not warranted.55Foot Note 55×DFS para 11.1. 29 In the alternative, if the court held the view that there were grounds for setting aside the Award, the defendant requested that the Award be remitted to the Arbitrator in exercise of the court’s powers under Art 34(4) of the Model Law.56Foot Note 56×Defendant’s 2nd further submissions dated 22 April 2022 (“2DFS”), para 4.The defendant contended that none of the concerns that arose inBZW, which militated against the remission of the award to the arbitral tribunal in that case, were present in this case.57Foot Note 57×2DFS paras 5.5–5.6.If the Award were remitted, the Arbitrator would be confined to re-considering her decision on the appropriate final price of the Iron Ore Fines, and nothing more.58Foot Note 58×2DFS para 5.12.5.",
        "Issues to be determined": "30 Based on the arguments advanced by the parties as summarised above, I considered that the following issues arose for my determination: (a) Was the plaintiff precluded from relying on the Ambiguity Issue or the SOGA Issue as a ground for setting aside the Award (“Issue 1”)?(b) If Issue 1 was answered in the negative, did the Ambiguity Issue or the SOGA Issue provide a basis for setting aside the Award (“Issue 2”)?(c) If Issue 2 was answered in the affirmative, was it appropriate to remit the Award to the Tribunal (“Issue 3”)?",
        "Issue 1: Was the plaintiff precluded from relying on the Ambiguity Issue or the SOGA Issue as a ground for setting aside the Award?": "31 As noted above at [23], the Ambiguity Issue and the SOGA Issue were not front and centre of the plaintiff’s challenge to the Award. Instead, these issues only came to the fore in the parties’ further submissions following the hearing on 4 February 2022. In the circumstances, while neither party submitted extensively on this point, I found it apposite to first consider if the plaintiff was precluded from relying on these grounds of challenge by reason of the fact that they had not been sufficiently canvassed in the supporting affidavit filed with OS 1115. 32 Order 69A r 2(1)(d) of the Rules of Court (2014 Rev Ed) (“ROC”) provides that an application to set aside an arbitral award under s 24 of the IAA or Art 34(2) of the Model Law must be made by originating summons. Further,perO 69A r 2(4A) of the ROC, the affidavit in support must,inter alia, “state the grounds in support of the application” and “be served with the originating summons”. In my view, it was clear from a plain reading of these provisions that an affidavit filed in support of a setting aside application must reasonably containallthe grounds relied upon for the application. To the extent necessary to expound on this point, I refer to my observations inBTN and another v BTP and another and other matters[2021] SGHC 271 at [62]–[63], which I reproduce below: 62 In my judgment, the affidavit(s) in support served with the originating summons must reasonably contain all the facts, evidence and grounds relied upon in support of an application under O 69A r 2(1)(d) of the ROC to set aside an award. This coheres with the procedure set out in O 69A r 2(4C) of the ROC in which the defendant must, if he wishes to oppose the application, file an affidavit stating the grounds on which heopposesthe application 14 days after being served with the originating summons.When the defendant is served with the originating summons (and any affidavit or affidavits in support which are required to be served with the originating summons), the originating summons and the affidavit(s) in support are meant, compendiously, to inform the defendant of the specific grounds on which the arbitral award is being challenged.The facts and circumstances and the grounds relied upon to challenge the award should therefore be detailed with sufficient particularity in the affidavit or affidavits that are served on the defendant with the originating summons. Having been served with that compendious ‘package’ comprising the application, and the supporting grounds and evidence for the application, the defendant will then know the case being mounted and will put forth its defence or opposition to the application by way of an affidavit or affidavits in reply filed in accordance with O 69A r 2(4C) of the ROC. 63 While it may be common practice for a plaintiff to file further reply affidavits after the defendant has filed its affidavit in opposition to the application, this does not mean that the plaintiff should be permitted to advancenew groundsinsubsequentaffidavits by introducing new facts and circumstances that could and should have been raised at first instance. That does not sit well with the procedure contemplated in O 69A r 2 of the ROC, and does violence to the clear language in O 69A r 2(4A)(d) requiring any supporting affidavitto be served with the originating summons. Similarly, even in cases where there is a related appeal pending, a plaintiff ought not to be permitted to hedge its bets by drafting the initial affidavit in support in vague terms and then introducing new grounds in subsequent reply affidavits. Not only would that amount to springing a surprise on the defendant, but such conduct would also contribute to greater inefficiency by prolonging the proceedings, and possibly also encourage abuse of process.In such a scenario, a plaintiff/applicant should be forewarned that the court may well preclude it from raising such new grounds belatedly. [emphasis in original in italics; emphasis added in bold italics] 33 A plaintiff in a setting aside application therefore cannot hope to steal a march on his opponent by omitting or obfuscating the grounds of challenge in an affidavit filed in support of the application, only to raise those grounds later in his submissions. Nonetheless, there will be cases falling on the borderline. It appeared to me thatCNQ v CNR[2021] SGHC 287 (“CNQ”) was such a case. InCNQ, the parties had entered into a contract for the sale and purchase of optical fiber preforms. In the arbitration proceedings, the buyer was found to have breached the contract by its non-acceptance of the goods, and had been ordered to pay damages to the seller under s 50(3) of the Sale of Goods Act (Cap 383, 1999 Rev Ed) (the “SOGA (SG)”). The buyer sought to set aside the award, on the basis that it had been unable to present its case and that the tribunal had acted in breach of the rules of natural justice. At the oral hearing of the setting aside application, the buyer alleged for the first time that the reason why it had been unable to present its case was that the tribunal had unilaterally decided to award damages under s 50(3) of the SOGA (SG). The seller’s position throughout the arbitration had been that s 50(2), and not s 50(3) of the SOGA (SG), was the applicable provision (the “SOGA (SG) Issue”) (at [2]). In connection with the SOGA (SG) Issue, the buyer also contended that the tribunal had exceeded its jurisdiction by awarding damages under s 50(3) of the SOGA (SG), contrary to Art 34(2)(a)(iii) of the Model Law (“the excess of jurisdiction ground”). This was not a ground of challenge that had been raised in the buyer’s originating summons, affidavits or written submissions (at [4]). 34 Andre Maniam J noted that there was therefore “some element of surprise to the Seller”, caused by the introduction of the SOGA (SG) Issue and the excess of jurisdiction ground at the oral hearing (at [103]). Nonetheless, the learned Judge observed that these grounds of challenge were “based on evidence already before the court” (at [101]). While the distinction between ss 50(2) and 50(3) of the SOGA (SG) had not featured prominently until the oral hearing, the buyerhadcomplained that the tribunal had not considered its contentions in relation to certain issues pertinent to s 50(3) of the SOGA (SG) (such as “market price”, “available market”, and “hypothetical market price”): at [102]. Moreover, the buyer’s allegation that the tribunal had denied it a right to be heard on the SOGA (SG) Issue rested on the same factual matrix as the excess of jurisdiction ground (at [101]). Following the oral hearing of the setting aside application, the seller was also granted leave to make further arguments in correspondence, and the buyer was allowed to reply (at [103]). In the circumstances, Maniam J decided to deal with the merits of the SOGA (SG) Issue and the excess of jurisdiction ground, although the Judge forewarned that other cases “may well merit stricter treatment in this regard” (at [104]). 35 With this in mind, I turned to consider the facts of the present case. The plaintiff filed one affidavit with its originating summons, namely that of Mr Agrawal (“Mr Agrawal’s affidavit”). Mr Agrawal’s affidavit did not expressly frame the Ambiguity Issue or the SOGA Issue as breaches of natural justice, warranting the setting aside of the Award. Nonetheless, Mr Agrawaldidcomplain that the Tribunal had found the Price Adjustment Mechanism to be ambiguous despite the defendant having not taken this position:59Foot Note 59×MKA-1 p 26 para 63. 63. The Tribunal made a number of incorrect findings in respect of the terms of the Addenda. … (2) Second, the Tribunal concluded that the specific terms agreed between the Parties in respect of the provisional price, apportionment of costs and expenses for onward sales, were contradictory to the reference to ‘FOBST’. This was not alleged by [the defendant],nor did[the defendant] contend in the Arbitration that any the Addenda [sic] suffered from any ambiguity, or that any legal consequences followed from such an alleged ambiguity. (3) Third,although[the defendant] did not put forth such a contention in the Arbitration, the Tribunal took the view that there was some ambiguity as to the price mechanism agreed between the parties in the Addenda(Final Award at [102] to [104]). [emphasis in original omitted; emphasis added in bold italics] 36  In my judgment, the above passage brought the plaintiff just over the line. Similar to the facts ofCNQ, it was evident in the present case that the SOGA Issue and the Ambiguity Issue had not featured prominently in the plaintiff’s case, up until the filing of the parties’ further submissions following the hearing on 4 February 2022. Nonetheless, thesubstanceof the plaintiff’s grievances had, to some extent, been canvassed in Mr Agrawal’s affidavit. This could be seen from para 63(2) of Mr Agrawal’s affidavit, where he complained that the defendant had not contended in the Arbitration that (a) the Addenda suffered from any ambiguity; or (b) that “any legal consequences” followed from the ambiguity in the Addenda. In my view, this encapsulated the essence of the plaintiff’s grounds of challenge in relation to the Ambiguity Issue and the SOGA Issue, which were that (a) the Tribunal had found the Addenda to be ambiguous, despite neither party taking this position; and (b) the Tribunal had found that the “legal consequence” of the ambiguity in the Addenda was that the plaintiff was obliged to pay the defendant a reasonable price under s 8(2) of the SOGA, without giving the parties an opportunity to be heard on the same. 37 Moreover, even if there had been “some element of surprise” occasioned to the defendant in the present application, I found that the defendant had been given sufficient opportunity to respond to the Ambiguity Issue and the SOGA Issue in the two rounds of further submissions filed pursuant to my directions. In this regard, I also noted that there was no allegation by the defendant that it had been deprived of the opportunity to file the requisite affidavit evidence, or to otherwise resist the setting aside application, by reason of the plaintiff’s belated arguments on the Ambiguity Issue and the SOGA Issue. 38 I therefore found that it was not appropriate in the present case to exclude the Ambiguity Issue and the SOGA Issue from my consideration, as possible grounds for setting aside the Award. Even if these grounds of challenge had not been at the forefront of the plaintiff’s submissions, they had been canvassed in substance in Mr Agrawal’s affidavit. In any event, limited prejudice, if at all, had been occasioned to the defendant. Nonetheless, and as I have mentioned above, I stress that the present case fell on the borderline. It would be ill-advised for a similarly placed applicant to be, whether inadvertently or worse, deliberately, anything short of transparent and unequivocal in setting out its grounds of challenge in the affidavit(s) filed in support of a setting aside application.",
        "Issue 2: Did the Ambiguity Issue or the SOGA Issue provide a basis for setting aside the Award?": "39 Having answered Issue 1 in the negative, I turned to consider whether the Ambiguity Issue or the SOGA Issue provided a possible basis for setting aside the Award. In my judgment, the mere fact that the Arbitrator referred tos 8(1) of the SOGA and concluded that the Price Adjustment Mechanism was ambiguous did not, in itself, amount to a breach of the rules of natural justice that prejudiced the rights of the parties. However, as I stated at the beginning of these grounds of decision, the breach of natural justice in this case lay in the Arbitrator’s failure to allow the parties a reasonable opportunity to be heard, in adopting a chain of reasoning based on s 8(2)of the SOGA. Let me elaborate on why I came to this conclusion. 40 I begin by setting out the relevant paragraphs of the Award:60Foot Note 60×MKA-1 pp 170–171 (Award at paras 153–164). Issue 4: What are the appropriate Final Sale Prices of the Cargoes? [Questions (e) (f) (g) (h) and (j)] 153. The [SOGA] provides at section 8 as follows: ‘(1) the price in a contract of sale may be fixed by the contract, or may be left to be fixed in a manner agreed by the contract, or may be determined by the course of dealing between the parties. (2) where the price is not determined as mentioned in subsection (1) above the buyer must pay a reasonable price. (3) what is a reasonable price is a question of fact dependent on the circumstances of each particular case.’ 154. There was no final price agreed in the Contracts.The manner of fixing the prices as set out in the Addenda was vague and ambiguous.This was the first time the[p]arties had done business together.The law obliges the buyer to pay a reasonable price in the circumstances of the case. 155. The wording of Point 2 of the Addenda does not say who is responsible for putting together the raw data from onward sales and, for precisely what items could be included in the calculations. It also does not specify that this will be the final price, but ‘the basis of final price/value’. That implied further calculations to which no one but the [plaintiff] was privy. Furthermore, the items listed as expenses in the Addenda are costs for which the [plaintiff] is responsible under the FOBST Incoterm used in the Contract and repeated in the Addenda. 156. The [defendant] has claimed damages based on the original prices of USD33.50 and USD34.50 agreed in Clause 4 of the Contracts. That cannot be right, as the price was to be adjusted for variations in quality, and the [defendant] did deliver ore below the contractual level of 57%. 157. In the context of these proceedings the [plaintiff] has produced a lengthy and complex analysis for the calculation of the appropriate final sales price based on the proceeds of sale, without consulting the [defendant]. 158. Mr. Agrawal’s calculations were endorsed by his expert witness, Mr. Emmott, who himself appeared to have used a different set of calculations. Unfortunately, Mr. Emmott himself agreed at the hearing, that as a metallurgist, he has no experience in the real-life purchase and sale of the products he analyses. His endorsement could only rely on information from Mr. Agrawal and from a consultant who did not sign the witness statement and who did not appear at the hearing. As such, it is not helpful. 159. The [plaintiff’s] ‘accounting’ results in a figure lower than the [plaintiff’s] partial payment of 30 May 2017, so that the [defendant] is not entitled to any further payment but in fact owes the [plaintiff] money. 160. For the reasons already set out above, the calculations provided by the [plaintiff] in the course of this arbitration are too little, too late. The [plaintiff] failed to provide the [defendant] with either information or the opportunity to consult and agree the final prices. In light of the ambiguity of the provision in Point 2 of the Addenda, this was particularly important. 161. The appropriate calculation of damages, payable to the [defendant] as a result of the [plaintiff’s] breach of the Contracts, of the Addenda, and of its fiduciary duty to the [defendant], is to be calculated on the basis of the prices of the cargoes actually furnished, as of the effective date of the Contracts, that is, 2 February 2021. By reason of its ambiguity, and in light of the [plaintiff’s] breach of the Addenda, the original contractual price, as adjusted for quality in accordance with the Contracts, must be the basis of calculating damages. 162. To calculate the final price for the Tiger Shanxi cargo, certified as 55.57% Fe, the contractual formula yields an adjustment of USD5.65 and an adjusted price of USD27.85 PDMT. 163. To calculate the final price for the Asia Ruby cargo, certified as 55.35% Fe, the contractual formula is applied to the level of 55.50%. A further reduction of USD3 on the next 0.5% is prorated for the remaining 0.15% below 55.5%, to produce an adjustment of USD6.90 and an adjusted price of USD27.60 PDMT. 164. These adjusted prices are used in calculating the Final Sale Price for the purpose of assessing damages. [emphasis in original omitted; emphasis added in bold italics] 41 As noted above at [25], the plaintiff contended that the Arbitrator had deprived the parties of their right to be heard, by relying on s 8 of the SOGA in the Award when no submissions had been made on the same. I was not completely persuaded by this submission. As noted by the Court of Appeal inBZW, a breach of the fair hearing rule occurs if the tribunal adopts a chain of reasoning that (a) the parties did not have reasonable notice it would adopt; or (b) does not have sufficient nexus to the parties’ arguments. A party has reasonable notice of a particular chain of reasoning if (a) it arose from the parties’ pleadings; (b) it arose by reasonable implication from their pleadings; (c) it is unpleaded but arose in some other way in the arbitration and was reasonably brought to the party’s actual notice; or (d) it flows reasonably from the arguments actually advanced by either party or is related to those arguments:BZWat [60(b)], citingJVL Agro Industries Ltd v Agritrade International Pte Ltd[2016] 4 SLR 768 (“JVL Agro Industries”) at [150], [152], [154] and [156]. 42 In addition, in order for there to be grounds for setting aside an arbitral award under s 24(b) of the IAA, the applicant must establish that the breach of the fair hearing rule was connected to the making of the award, and that the breach caused it prejudice. This requires the applicant to demonstrate that as a result of the breach, “the arbitrator was denied the benefit of arguments or evidence that had a real as opposed to a fanciful chance of making a difference to his deliberations”; or put another way, that “the material could reasonably have made a difference to the arbitrator”:JVL Agro Industriesat [194], citingLW Infrastructure Pte Ltd v Lim Chin San Contractors Pte Ltd[2013] 1 SLR 125 at [54]. 43 In the present case, it was evident that the question of the final price of the Iron Ore Fines fixed under the Contracts was an issue that arose out of the parties’ pleadings. As noted at [17]–[18] above, the parties had asserted contrary positions on this issue. In any event, the appropriate final price of the Iron Ore Fines had also been expressly listed in the parties’ Agreed List of Issues, which was submitted to the Arbitrator prior to the hearing. Specifically, the Agreed List of Issues stated as follows:61Foot Note 61×MKA-1 p 833, Issues 6 and 8. 6. Whether the final price for the cargoes is to be fixed at USD 33.50 in respect of the cargo shipped by the [defendant] under [the Tiger Shanxi Contract] and at USD 34.50 in respect of the cargo shipped by the [defendant] under [the Asia Ruby Contract]? … 8. Whether the [defendant] is entitled to payment from the [plaintiff] of any monetary sum in respect of the cargoes shipped by it under [the Contracts]? In particular, whether the [defendant] is entitled to payment from the [plaintiff] of the balance, final price of the cargoes and if so, in what amount? 44 The parties were also clearly aware that English law and the SOGA were the applicable laws in the Arbitration, the parties themselves having referred to provisions within the SOGA in their submissions in the Arbitration (albeit to provisions other than s 8; see [25] above). Moreover, I agreed with the defendant’s submission that the parties’ pleaded cases had effectively corresponded with the first two limbs of s 8(1) of the SOGA – the defendant had taken the position that the price of the Iron Ore Fines had been “fixed by the [Contracts]”, whereas the plaintiff’s case was that the final price had been “left to be fixed in a manner agreed by the [Contracts, as amended by the Addenda]” (ie,the Price Adjustment Mechanism). 45 Accordingly, I found that by simply making reference to the first two limbs of s 8(1) of the SOGA, the Arbitrator could not be said to have adopted a chain of reasoning that the parties did not have reasonable notice of, or which had an insufficient nexus to the parties’ arguments. Given that the parties’ cases had corresponded to the first two limbs of s 8(1) of the SOGA, the Arbitrator’s reference to these provisions could be said to arise directly out of the parties’ pleadings, or at the very least, by reasonable implication from their pleadings. There was therefore no breach of the rules of natural justice in this regard. 46 Alternatively, even if the parties did not have reasonable notice of the Arbitrator’s reliance on the first two limbs of s 8(1) of the SOGA, no prejudice had been occasioned to the parties for similar reasons. The parties had, in substance, presented their cases on the first two limbs of s 8(1) of the SOGA, even if they may not have expresslyreferred to the provision. It therefore could not be said that the Arbitrator had been denied the benefit of arguments or evidence that had a real chance of making a difference to her deliberations. Accordingly, I found that the Arbitrator’s reference to the first two limbs of s 8(1) of the SOGA did not warrant setting aside the Award under s 24(b) of the IAA. 47 Similarly, in my view, the fact that the Arbitrator rejected both parties’ cases under s 8(1) of the SOGA did not in itself present a ground for setting aside the Award under s 24(b) of the IAA. In this regard, I disagreed with the plaintiff’s argument that the parties had been deprived of a reasonable opportunity to be heard, solely because the Arbitrator had concluded that the Price Adjustment Mechanism set out in the Addenda was “vague and ambiguous”. To begin with, it might be argued that it was at least implicit in the defendant’s pleaded position that the Price Adjustment Mechanism had become unworkable by the time of the Arbitration, such that it could not be relied upon to calculate the final price of the Iron Ore Fines. As noted above at [17], the defendant pleaded in its Statement of Claim that as the plaintiff had failed to intimate it of the prices at which the Iron Ore Fines were actually sold, the plaintiff should be “presumed” to have utilised the Iron Ore Fines for its own gains, such that the defendant was entitled to the original price under the Contracts. Similarly, the defendant contended as follows in its written opening submissions in the Arbitration:62Foot Note 62×MKA-1 p 849 (Claimant’s Written Opening Submissions paras 40–41). 40. The [plaintiff] places reliance on the Mysteel index in order to determine the final price of the Cargo. This reliance is, in fact, misplaced for various reasons as elucidated in the [defendant’s] submissions further. What is relevant is the actual final price fetched by the Cargos in China. The [plaintiff] has repeatedly concealed this actual price. 41.In the absence of the actual final price of the Cargo in China, the parties must revert to the prices agreed by them – that is the only option. These prices are found only in the original Sale Contracts. Therefore, the final price for the Cargo is to be fixed at USD 33.50 in respect of the [Tiger Shanxi Contract] shipped on MV Tiger Shanxi from Haldia and USD 34.50 in respect of the [Asia Ruby Contract] shipped on MV Asia Ruby-III from Dhamra. [emphasis added in bold italics] 48 In my view, it was implicit in the defendant’s pleaded position that the Addenda had become unworkable because of the plaintiff’s failure to inform the defendant of the prices at which the Iron Ore Fines had been sold. This was the reason why the defendant asserted that the parties had to “revert” to the original price under the Contracts. Indeed, during oral closing submissions at the hearing of the Arbitration, it was argued by the defendant that the Addenda had “almost become impossible to understand” for this very reason:63Foot Note 63×MKA-1 pp 1082 and 1091 (Hearing transcript from 25 March 2021, p 102 line 24 to p 103 line 17, p 139 line 8 to p 140 line 13). MR SHANKER: … So we submit that [the plaintiff has] completely failed to show the relationship with Glencore, and therefore failed to show how they have onward sold this cargo. If this has not been done, then what price am I supposed to I paid [sic] for the cargo that I have undoubtedly sold? All I'm saying is: give me the price that I paid minus the shortfall in the quality. So instead of 57, I sold roughly 55.5, give me that minus the advance that I have received, as on the date when I -- as on the date -- the amounts are already known, the prices are already known, as per the original unamended contract. Becausethe amended contract has now almost become impossible to understand what the realisations are, given the mystery behind the documents that [the plaintiff] and Glencore have. We don't know who the buyer is, we don't have any proof of sale, we just have these little random email chips saying ‘sold’, ‘sold’, ‘sold’, and refer to telephonic conversation that we are hearing of for the first time. … ARBITRATOR: Mr Shanker, I'm having a problem, conceptually, with using your original figures, which were for 57 per cent, and you're saying we don't look at the -- I'm not sure what -- we're supposed to use those figures, but we're also supposed to be using the addendum, and that the addendum purchase -- the addendum adjustments -- how can we use the addendum if we don't use these adjustments? I don't understand how that -- surely that part of the addendum would have modified the original figures if it's -- MR SHANKER: Yes, it does. ARBITRATOR: If it's effective. MR SHANKER: Yes, it does, the addendum does modify the original figures, but the addendum also requires to be operated in a particular way which formula and pricing has become either mistimed or not available to us at all. … But the way [the plaintiff] on-sold the cargo is they didn't sell it, they kept it for themselves.There'sa mystery behind what happened and therefore it's impossible to apply that formula at all under the addendum.And if you cannot apply that formula under the addendum, and you follow the unamended-- I don't -- when you say ‘unamended’, you may say ‘no’, but when you follow the retention of title clause, which continues unamended even in the amendment, the retention of title clause entitles [the defendant] to the market value of the product that they were deprived of, that they were owners of in February 2017, which is the same as the contract price. [emphasis added in bold italics] 49 In my judgment, it could not therefore be said that the Arbitrator’s finding that the Price Adjustment Mechanism was ambiguous was a complete or surprising departure from the arguments actually advanced by the parties, although I note that the defendant only made clear its position that the Addenda had become “impossible to apply” somewhat late in the day (ie, during oral closing submissions). 50 In any event, I found that it was open to the Arbitrator to conclude that the Addenda was “vague and ambiguous” even if neither party had taken that position. In so far as the nub of the plaintiff’s complaint pertained to the Arbitrator’s departurefrom the methods proposed by the parties for determining the final price of the Iron Ore Fines, I disagreed that the Arbitrator was obliged to chooseeitherthe plaintiff’s calculations,orthe method proposed by the defendant, and nothing else. As observed by the Court of Appeal inSoh Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007] 3 SLR(R) 86 at [65(e)], an arbitrator is “perfectly entitled to embrace a middle path (even without apprising the parties of his provisional thinking or analysis) so long as it is based on evidence that is before him”. This principle is illustrated by the decision inTMM Division Maritima SA de CV v Pacific Richfield Marine Pte Ltd[2013] 4 SLR 972 (“TMM Division”). In that case, one of the issues before the arbitrator was whether a particular contractual clause was a condition precedent or an innominate term. The arbitrator found that the contractual clause was neither a condition precedent nor an innominate term, but instead a collateral warranty. Chan Seng Onn J (as he then was) found that this did not breach the fair hearing rule. This was because the arbitrator’s conclusion was a “reasonable follow-through” from his finding that the clause was not a condition (at [70]). 51 In the present case, the Arbitrator was thus not limited to the binary positions taken by the parties. In my view, she was entitled to reject both the plaintiff’s and the defendant’s calculations. It was also open to her to conclude, on the evidence before her, that the Addenda was ultimately ambiguous even if neither party had made this specific argument. In my judgment, to hold otherwise would be to unduly straitjacket the latitude given to the Arbitrator. 52 Having rejected both parties’ cases under the first two limbs of s 8(1) of the SOGA, and having found that the Price Adjustment Mechanism was in fact “vague and ambiguous”, the next step in the Arbitrator’s reasoning was to consider thethirdlimb of s 8(1) of the SOGA (ie, that the price in a contract of sale may also be “determined by the course of dealing between the parties”). It appears that the Arbitrator concluded that this limb of s 8(1) of the SOGA was also inapplicable to the present case, given her observation that “[t]his was the first time the [p]arties had done business together”.64Foot Note 64×MKA-1 p 170 (Award at para 154).While the plaintiff did not specifically take issue with this aspect of the Arbitrator’s reasoning in its submissions before me, I found for completeness that the Arbitrator’s reliance on this limb of s 8(1) of the SOGA did not cause any relevant prejudice to the parties that would warrant a setting aside of the Award. During the hearing of the Arbitration, both parties expressly took the position that the Contracts had been thefirsttime that the parties had done business with each other; in other words, there had been no prior dealings between the parties. In particular, in response to questions from the Arbitrator on the existence of a prior relationship between the parties, the defendant’s counsel stated as follows:65Foot Note 65×MKA-1 p 968 (Hearing transcript from 24 March 2021, p 59 lines 3–14). ARBITRATOR: Counsel, I'm puzzled by something here. You've referred twice to long-term relationship [sic] between these two parties but, as far as I've seen, there doesn't seem to have been a prior relationship between the parties. MR SHANKER: No, there wasn't. I think it was just a goodwill thing, trying to extract what was due to us. It was just being polite. There was no long-term – ARBITRATOR:So these two contracts of 2 February were indeed the first time the parties had done business; is that correct? MR SHANKER:That's correct.It was just us being nice to them to get our money which was being withheld. [emphasis added in bold italics] 53 For the avoidance of doubt, I note that the Contracts were dated 2 February 2017 but were executed on 9 and 13 February 2017 (see [6] above).66Foot Note 66×MKA-1 pp 184 and 190.The plaintiff’s counsel in the Arbitration also confirmed in his opening address and closing submissions that the Contracts were the first time the parties had done business with each other: Opening address67Foot Note 67×MKA-1 p 996 (Hearing transcript from 24 March 2021, p 169 line 21 to p 170 line 3). MR VIVEKANANDA: … Contrast this, of course, to the background of what the [plaintiff] was dealing with.It'sdealing with a party for the first time ever.The party supplies non-conforming cargoes. The party is not able even to provide a copy of the shipping documents. It is not able to provide the originals of the shipping documents. It enters into an amendment. It then further delays the shipping documents. … Closing submissions68Foot Note 68×MKA-1 p 1099 (Hearing transcript from 25 March 2021, p 169 line 25 to p 170 line 4; p 171 lines 13–20). MR VIVEKANANDA: … And again, the other context to the amendment and what resulted there from is the delay in the provision of the documentsfrom a party that we were dealing with for the very first timein a dropping international market for iron ore fines. … So, therefore, the only reasonable view to take is what Mr Emmott suggests, is prudencein dealing with a party which is, perhaps, somebody you are dealing with for the first timein the background of the fact that, perhaps, they have not been the most robust in their commercial practice, they have not been able to provide documents, they have not really been seen as somebody who understands the trade. [emphasis added in bold italics] 54 In the circumstances, I found that the Arbitrator had not been deprived of any material that could reasonably have made a difference to her conclusion that the third limb of s 8(1) of the SOGA did not apply. Even if the Arbitrator had expressly invited parties to tender further submissions or evidence on the third limb of s 8(1) of the SOGA, I did not see how the parties could have adduced any material that had a real chance of making a difference to the Arbitrator’s deliberations, without undermining and making an about-turn from the factual positions they expressly took in the Arbitration on the absence of any prior course of dealing between them. In any event, as I have noted above, no submission was made to the contrary by either party before me. As such, regardless of whether the Arbitrator could be said to have breached the fair hearing rule by referring to the third limb of s 8(1) of the SOGA, I found that no relevant prejudice had arisen. This was therefore not a ground for setting aside the Award under s 24(b) of the IAA. 55 However, when the Arbitrator went on to apply s 8(2)of the SOGA, I agreed with the plaintiff that the parties were deprived of a reasonable opportunity to be heard. Counsel for the defendant in OS 1115 (who was not the defendant’s counsel in the Arbitration), Mr Mohammad Haireez, fairly conceded in his further submissions that s 8 of the SOGA was not expressly pleaded or otherwise referred to by the parties during the course of the Arbitration.69Foot Note 69×DFS para 3.While the Arbitrator’s reliance on s 8(1) of the SOGA could nonetheless be said to align with and arise out of the parties’ pleadings, or at least to have caused no relevant prejudice to the parties (as I have explained above at [43]–[54]), the concept of a “reasonable price” under s 8(2) of the SOGA was neither raised nor submitted on by the parties. Although both parties had proposed various alternative methods for calculating the final price of the Iron Ore Fines during the Arbitration, there was no evidence that the parties had contended that these calculations were “reasonable” prices for the Iron Ore Fines,independentof what the parties had agreed to under the Contracts and/or the Addenda. On the contrary, the parties’ positions throughout the Arbitration were that the final price of the Iron Ore Fines had beenfixedin some way by the Contracts and/or the Addenda. I elaborate further below. 56 I begin with the defendant’s case. As is clear from the summary at [47]–[48] above, the defendant’s pleaded case in the Arbitration was that the parties should “revert” to the original price for the Iron Ore Finesagreed upon by the partiesunder the Contracts. For completeness, I noted that notwithstanding the defendant’s pleaded position, the defendant’s counsel in the Arbitration put forth a set of alternative calculations during his opening address, which was based on the prevailing price of iron ore fines on 2 February 2017 (ie, the date of the Contracts) according to the Mysteel price index.70Foot Note 70×MKA-1 p 971 (Hearing transcript from 24 March 2021, p 70 line 22 to p 71 line 11).It became clear from the defendant’s oral closing submissions that these alternative calculations were only relevant if the Arbitrator found that the Addenda had effectivelymodifiedthe price fixed by the parties under the Contracts. The relevant exchange between the defendant’s counsel and the Arbitrator was as follows:71Foot Note 71×MKA-1 p 1095 (Hearing transcript from 25 March 2021, p 155 line 16 to p 156 line 14). ARBITRATOR: Tell me what you want the disposition to look like in the award. MR SHANKER:Sothe prayer that we've got in the claim submissions, that's in paragraph 14(a), is the award that we are seeking. That is $677,147 as of 15/7/2019, and further interest thereon. ARBITRATOR: That brings a valid question, what is 15 July 2019? MR SHANKER: It's the date of invocation of the arbitration. … MR SHANKER:Alternately, if you feel that the addendum overrides and has been worked[sic], then you should award the amounts payable as of 2 February 2017, which is the same date as the contract date, and the date that [the plaintiff] confirmed that they could have on-sold the cargo. ARBITRATOR: If the addendum overrides what? MR SHANKER: Yes, overrides the original contract price. ARBITRATOR: The original contract price. MR SHANKER: Then what should be paid is the -- should be paid is the Mysteel CNF price as of 2 February 2017 minus [the plaintiff’s] freight, minus [the plaintiff’s] fixed costs and VAT. And the alternate case will end up at a larger resultant number. [emphasis added in bold italics] 57 Based on the exchange reproduced above, it appeared to me that by the conclusion of the hearing of the Arbitration, the defendant’s case was as follows: the defendant should either be awarded (a) the sum of US$677,147 being the price fixed by the parties under the Contracts, which had not been overridden by the Addenda; or (b) a sum based on the prevailing price of iron ore fines on 2 February 2017, being the price the parties had agreed upon under the Contractsas modifiedby the Addenda. Crucially for present purposes, there was no submission by the defendant that either of those sums should be awarded because they would constitute areasonableprice for the Iron Ore Fines, in the absence of any price being fixed for the Iron Ore Fines under the Contracts. I therefore found that it could not be said that the concept of a “reasonable price” formed part of the defendant’s case or flowed from any arguments actually advanced by it. In any event, as I have noted at [28] above, it was the defendant’s submission before me that its case in the Arbitration had corresponded to s 8(1) of the SOGA; there was no suggestion by the defendant that its case in the Arbitration had in fact corresponded to both s 8(1)and8(2) of the SOGA. 58 Turning to the case advanced by the plaintiff in the Arbitration, the plaintiff’s position was that the final price of the Iron Ore Fines should be calculated based on the Price Adjustment Mechanism, because that had been what the parties had agreed to under the Addenda. In my judgment, this was clear from the plaintiff’s pleadings and submissions in the Arbitration. For instance, in its Statement of Defence and Counterclaim, the plaintiff alleged that based on the “specific contractual agreements among the parties”, the plaintiff had in fact overpaid the defendant for the Iron Ore Fines and was therefore entitled to make a counterclaim for the overpayment.72Foot Note 72×MKA-1 p 706 (Statement of Defence and Counterclaim para 86).Likewise, the plaintiff stated as follows in its written opening submissions in the Arbitration:73Foot Note 73×MKA-1 p 936 (Respondent’s Opening Submissions para 260). 260. The [plaintiff] submits that it is clear as night and day that the original prices under the Sale Contracts can no longer apply because: … (b) Secondly,the sale contracts were amended and new provisional prices were agreed and a clear mechanism was agreed to determine the final price. (c) Thirdly, as a consequence of the mechanism agreed to in the amendments to the sale contracts, the [plaintiff] has accounted for the price at which the cargoes were sold and the determination of the final price. The [defendant’s] simplistic reliance on the original sale contract prices can only be described as the [defendant’s] commercial nostalgia for what cannot be. [emphasis added in bold italics] 59 Accordingly, although the plaintiff had pleaded in its Statement of Defence and Counterclaim that it would be “eminently reasonable”74Foot Note 74×MKA-1 pp 699 and 704 (Statement of Defence and Counterclaim paras 64.9 and 75.9).to include a profit margin of US$2 in its calculations of the final price of the Iron Ore Fines (even though this was not expressly provided for in the Price Adjustment Mechanism, as conceded by the plaintiff’s counsel in his opening address in the Arbitration75Foot Note 75×MKA-1 p 992 (Hearing transcript from 24 March 2021, p 153 lines 6–8).), I did not read this to mean that the plaintiff was proposing a “reasonable price” within the meaning of s 8(2) of the SOGA. As I have explained above, it was clear from the plaintiff’s pleadings and submissions that the crux of its case was that the final price of the Iron Ore Fines should be determined by the parties’agreement,ie, the Price Adjustment Mechanism set out in the Addenda. The concept of a “reasonable price” formed no part of its case. 60 In the circumstances, had the Arbitrator intended to adopt a chain of reasoning based on s 8(2) of the SOGA, she was, in my judgment, obliged to ensure that the parties had been put on notice that they were expected to address that chain of reasoning:JVL Agro Industriesat [159]. This, however, was not done. As noted at [21(g)] above, the Arbitrator concluded in the Award that a “reasonable price” would be the original price of the Iron Ore Fines, with downward revisions pursuant to the Adjustment Clause to take into account the cargo defects. It appears that the basis for her conclusion may have been limited to the following exchange with the plaintiff’s counsel during oral closing submissions:76Foot Note 76×MKA-1 pp 1091–1092 (Hearing transcript from 25 March 2021, p 140 line 23 to p 142 line 9). MR SHANKER: I need to be upfront with the tribunal on one point … It's when we made our claim, our claim is made on the basis of the calculations which we saw. We made a basis [sic] the grade that was payable for [57% Fe content], but in reality I did not supply [57% Fe content], I supplied a [55.6% Fe content] grade and, therefore, there must be that downward revision between 57 to 55.6 minus the advance that I received plus the interest plus the costs. Now we asked their witnesses repeatedly what is the price difference between these two and they did not tell us what the price difference between the two is. ARBITRATOR: So we have heard nothing at all about a 55.6 price point. We've had 57, 56, we've got an adjustment down to 56. MR SHANKER: Correct. ARBITRATOR: We've been told that it's not linear. MR SHANKER: Correct. ARBITRATOR: But considering the magnitude of the ones between 57 and 56, which are of the order of 1.5 or 1.0, you know -- MR SHANKER: It's roughly about $2, $3. ARBITRATOR: Yeah. But that's as far as we've got. We don't have anything closer than that. MR SHANKER: Yeah, but really that is something that [the plaintiff] should be showing, because I'm making a concession what the value of that is what [the plaintiff] should be showing, as to what the true value of its cargo is, and we asked them because they were not responding. ARBITRATOR:Okay, it would have been helpful for someone to showit but we haven't got anything, so ... MR SHANKER:But if you look at the sale contract and apply that formula, it seems to go down by about $2 to $3. ARBITRATOR: Well, that's what I was looking at, yes. Okay, thank you. 61 In my judgment, there was nothing in the above exchange that indicated to either party that the Arbitrator would rely on s 8(2) of the SOGA in her reasoning. While the defendant had referred the Arbitrator to the Adjustment Clause in the Contracts, this was entirely consistent with its pleaded position that the final price of the Iron Ore Fines should be determined by the price agreed upon by the parties under the Contracts (albeit with the added caveat that the price should be revised to take into account the cargo defects). At the risk of repetition, there was nothing in the defendant’s submissions or the Arbitrator’s responses to indicate that the Arbitrator would ultimately decide the case based on what constituted a “reasonable price” for the Iron Ore Fines. It was also plain from the transcript of the hearing of the Arbitration that the Arbitrator did not invite the parties to address her on what would constitute a “reasonable price” for the Iron Ore Fines. I therefore found that the Arbitrator did not give notice to the parties that she would rely on a chain of reasoning based on s 8(2) of the SOGA in the Award. 62 The defendant contended in its further submissions that there was no breach of the rules of natural justice, as the Arbitrator’s reference to s 8(2) of the SOGA arose naturally out of her conclusion that the price of the Iron Ore Fines had not been fixed within the meaning of s 8(1) of the SOGA (see [28] above). The defendant argued that the Arbitrator’s reliance on s 8(2) of the SOGA could be characterised as a “reasonable follow-through” from the issue before her (applyingTMM Divisionat [70]).77Foot Note 77×DFS para 11.3.In my view, the defendant might well have been correct to observe that the Arbitrator’s recourse to s 8(2) of the SOGA waspremisedon her conclusion that s 8(1) did not apply to the present facts, given that s 8(2) of the SOGA expressly states that “[w]here the price is not determinedas mentioned in sub-section (1) abovethe buyer must pay a reasonable price” [emphasis added]. Yet, in my judgment, the fact that there was a logical link between the Arbitrator’s reliance on s 8(2) of the SOGA, and her rejection of the parties’ cases under s 8(1) of the SOGA, did not necessarily mean that the parties hadreasonable noticethat the Arbitrator would adopt a chain of reasoning based on s 8(2) of the SOGA. As I have explained above, the fact remained that the concept of a “reasonable price” was not part of either party’s case, and the Arbitrator did not provide any intimation that she would be relying on the same in the event she was not persuaded that s 8(1) of the SOGA did apply. It therefore could not be said that the parties had reasonable notice that the Arbitrator would ultimately adopt a chain of reasoning based on s 8(2) of the SOGA. 63 Moreover, while the decision inTMM Divisionmay have provided some assistance to the defendant in relation to the Ambiguity Issue (see [50] above), I found that it could be distinguished from the present case in so far as the Arbitrator’s reasoning in relation to s 8(2) of the SOGA was concerned. In this regard, I was cognizant that the extent to which a tribunal must afford a party an opportunity to be heard depends on the nature of the issue involved:Phoenixfin Pte Ltd and others v Convexity Ltd[2022] 2 SLR 23 (“Phoenixfin”) at [52]. InTMMDivision, the issue before the tribunal was essentially one of contractual interpretation – as noted at [50] above, the parties had taken the position that the clause in question was either a condition or an innominate term. Accordingly, it was open to the tribunal, on the evidence before it, to take the middle path of concluding that the clause wasneithera condition nor an innominate term, but instead a collateral warranty. A similar case in this regard isCJA v CIZ[2022] SGCA 41 (“CJA”). InCJA, the Court of Appeal observed that the issue before the tribunal had been a legal question of contractual interpretation. The parties had submitted on this issue before the tribunal and had sufficient opportunity to canvass evidence on, amongst other things, the contextual dimension and commercial purpose of the contract. Accordingly, even though the tribunal ultimately adopted an interpretation of the contract that neither party had expressly pleaded, there was no breach of the fair hearing rule (at [77]). 64 By contrast, the issue of what constitutes a “reasonable price” is not a purely legal question, but instead “a question of fact dependent on the circumstances of each particular case”,pers 8(3) of the SOGA. As the Court of Appeal observed inPhoenixfinat [52], where the issue before the tribunal is a factual one or a mixed fact and law question, then “apart from submitting on the law, a party needs to be able to question the evidence produced in support of the issue as well as have the chance to itself introduce relevant rebuttal evidence”. Moreover, the cases ofTMM DivisionandCJAconcerned instances where the arbitral tribunal had arrived at a different conclusion from the parties, based on the evidence that wasalreadybefore it. On the contrary, it was reasonable in the present case that the parties would have sought to adduce evidence thatdifferedfrom the evidence already before the Arbitrator, had they been asked to present their cases on s 8(2) of the SOGA. As is clear from the wording of the provisions, the inquiries under ss 8(1) and 8(2) of the SOGA are conceptually distinct – s 8(1) focuses on whether any price has been fixed by the contract of sale or a course of dealing between the parties, whereas s 8(2) focuses on what a “reasonable price” for the goods would be, in theabsenceof any price being fixed as such. Given that the parties had advanced cases in the Arbitration that corresponded only with s 8(1) of the SOGA, they may well have desired to introduce new evidence or submissions on the question of what would constitute a “reasonable price” for the Iron Ore Fines under s 8(2) of the SOGA. For the reasons I have detailed above, it was evident that the parties had not been given an opportunity to do so. 65 I therefore disagreed with the defendant that the Arbitrator’s reliance on s 8(2) of the SOGA could be characterised as a “reasonable follow-through” from the arguments advanced by the parties, such that it was open to her to adopt such a chain of reasoning without apprising the parties of her intention to do so. 66 In the circumstances, I was persuaded that the fair hearing rule was breached in this instance when the Arbitrator adopted a chain of reasoning in relation to s 8(2) of the SOGA, without inviting further evidence and/or submissions on the same. This was, in my judgment, a breach of the rules of natural justice that was causally connected to the making of the Award, since the Arbitrator’s reliance on s 8(2) of the SOGA determined the final price of the Iron Ore Fines payable by the plaintiff. Moreover, it was plain to me that the Arbitrator’s failure to afford the parties a reasonable opportunity to be heard denied her the benefit of arguments orevidencethat could reasonably have made a difference to her decision (JVL Agro Industriesat [194]). There was therefore prejudice ensuing from this failure of process. As I have stated above, it was not inconceivable that had the parties been made aware that the Arbitrator was considering the application of s 8(2) of the SOGA and a chain of reasoning based on that provision, the parties would have sought to present their respective cases on this question of fact, whether in terms of evidence, submissions, or both. Indeed, the plaintiff complains in its further submissions that the parties were not able to “tender any factual evidence or submissions on fact or law” as a result of the Arbitrator’s failure to afford the parties an opportunity to be heard.78Foot Note 78×PFS para 10.In my view, such further evidence and/or submissions could have reasonably made a difference to the Arbitrator’s decision on the final price of the Iron Ore Fines. At the very least, no reason was suggested to me as to why this would not be the case. 67 In these circumstances, I was satisfied that there existed grounds for setting aside the Award under s 24(b) of the IAA. However, rather than setting aside the entire Award, and given the defendant’s alternative position raised in its further submissions requesting the court to remit the Award to the Tribunal if appropriate to do so, I turned to consider whether remission would be appropriate in this case.",
        "Issue 3: Was it appropriate to remit the Award to the Tribunal?": "68 The court’s power to remit an arbitral award to the tribunal is found in Art 34(4) of the Model Law, which provides as follows: (4) The court, when asked to set aside an award, may,where appropriate and so requested by a party, suspend the setting aside proceedings for a period of time determined by it in order to give the arbitral tribunal an opportunity to resume the arbitral proceedings or to take such other action as in the arbitral tribunal’s opinion will eliminate the grounds for setting aside. [emphasis added in bold italics] I found that it was appropriate in the present case to remit the Award for the Arbitrator to consider whether to receive further evidence and/or submissions (as the Arbitrator deems appropriate) on the issue of what would constitute a “reasonable price” for the Iron Ore Fines under s 8(2) read with s 8(3) of the SOGA. I detail my reasons below. 69 First, I disagreed with the plaintiff’s submission that the defendant’s failure to request for remission of the Award at the time of the hearing before me on 4 February 2022 necessarily meant that it was not possible or appropriate to remit the Award (see [26] above). To begin with, Art 34(4) of the Model Law imposes no such time limit on when a request for remission must be made. On a plain reading of the provision, Art 34(4) provides that a court, when asked to set aside an award, may remit the award to the tribunal “where appropriate and so requested by a party”. Given that the defendant had made a request in its further submissions for the court to consider remitting the Award, I did not see why the power under Art 34(4) of the Model Law should be unavailable in the present case. To construe Art 34(4) as requiring any request for remission to be raised by a certain point in the setting aside proceedings would, in my view, place a strain on the plain meaning of the provision, and I rejected such an interpretation. 70 In any case, it was clear to me that at the hearing on 4 February 2022, the focus of the parties’ submissions had not been on the issue of remission, or s 8 of the SOGA. As I have noted at [23] above, the SOGA Issue was raised, literally in one sentence, by Mr Kek in his oral submissions in reply at the end of that hearing. Moreover, it was only in the parties’ further submissions, which had been occasioned by Mr Kek’s fleeting remark, that the question of remission came to the fore. In the circumstances, I found there to be no merit to the argument that remission of the Award should be refused simply because the defendant had not requested for it earlier. 71 Next, I disagreed with the plaintiff’s contention that the Arbitrator’s breaches of natural justice were inextricably intertwined with the Award, or that the Arbitrator would not be able to approach the remitted issues in a balanced and open-minded manner, such that remission of the Award would be inappropriate. In this regard, both parties referred me to the case ofBZWin their further submissions.BZWconcerned an appeal against the decision of Vinodh Coomaraswamy J inBZV v BZW and another[2022] 3 SLR 447 (“BZW (HC)”). InBZW (HC), Coomaraswamy J found that the arbitral tribunal had acted in breach of the rules of natural justice, but declined to remit the award for two reasons: (a) First, the tribunal’s breaches of natural justice were “fundamental and woven deeply into the analytical exercise” that the tribunal had undertaken. The tribunal had fundamentally misapprehended the parties’ arguments. Eliminating any grounds for setting aside would require the tribunal to undertake its entire analytical taskde novo, which would go beyond the purpose of remission (at [222]). (b) The tribunal had acknowledged in the addendum to the award that it had committed a manifest factual error but sought to deny the effect of the error on its reasoning. This did not inspire confidence that remission would afford the applicant a genuine opportunity to persuade the tribunal to arrive at a different result (at [224]). 72 The decision of Coomaraswamy J was affirmed by the Court of Appeal inBZW. In doing so, the Court of Appeal made the following observations regarding Art 34(4) of the Model Law: (a) The drafters of Art 34(4) intended that in determining whether to remit an award, the court should consider whether (i) the tribunal’s error is remediable; and (ii) whether, by its error, the tribunal’s mandate no longer continues (at [65]). (b) The principle of limited curial intervention militates against the exercise of the Art 34(4) power rather than in favour of it (at [66(b)]). (c) In deciding whether to remit an award, the court should consider whether the breach is in respect of a single isolated or standalone point (at [66(c)]). (d) The court should also take into account whether the arbitrators are unfit to continue the hearing. If the court is of such a view, the correct approach is the setting aside of the award and the appointment of a fresh tribunal (at [66(d)]). (e) Finally, it has been observed in the UK that the court should consider whether (i) there is a real risk, judged objectively, that even a competent and respectable arbitral tribunal may sub‑consciously be tempted to achieve the same result as before; and (ii) that a reasonable person would no longer have confidence in the tribunal’s ability to come to a fair and balanced conclusion on the issues remitted (at [67]). 73 On the facts ofBZW, the Court of Appeal observed that the breach of natural justice did not involve a standalone issue, but instead concerned the tribunal’s complete failure to appreciate the correct questions it had to pose to itself (at [68]). A reasonable person would no longer have confidence in the tribunal’s ability to come to a fair and balanced conclusion on the issues remitted, given the tribunal’s denial of the effect of its factual error (see [71(b)] above) (at [69]). There were also no time and cost savings that would arise from remitting the award, given that a substantial amount of time had elapsed since the hearing of the evidence and submissions (at [70]). Remission was therefore inappropriate in that case. 74 I agreed with the defendant that the present case could be distinguished fromBZWon several counts. 75 First, I considered that the Arbitrator’s breach of natural justice involved a sufficiently discrete and standalone factual issue – namely, what would constitute a “reasonable price” within the meaning of s 8(2) of the SOGA. The plaintiff claimed that the Arbitrator’s reliance on s 8(2) of the SOGA was not an isolated issue, as it was tied to her findings on the Glencore Issue and the Ambiguity Issue.79Foot Note 79×2PFS paras 7–8.In my view, this was incorrect. In the Award, the Arbitrator made clear that she ultimately regarded the precise role of Glencore to beirrelevant, given her finding that the plaintiff had breached its fiduciary duties to the defendant (see [21(h)] above).80Foot Note 80×MKA-1 pp 162 and 174 (Award at footnote 52 and para 174).The Arbitrator’s findings on the Glencore Issue therefore cannot be said to have had any material bearing on her consideration of s 8(2) of the SOGA. 76 In so far as the Arbitrator’s reference to s 8(2) of the SOGA arose out of her conclusion that the Price Adjustment Mechanism was ambiguous (and that no price had been fixed under s 8(1) of the SOGA), I have explained above that I did not find that the Arbitrator acted in breach of natural justice when she reached her conclusion on the Ambiguity Issue or made reference to s 8(1) of the SOGA. I therefore did not see a need for the Arbitrator to re-open her findings of fact in relation to those issues, for the purposes of considering what would be a “reasonable price” under s 8(2) of the SOGA. In my judgment and as I have explained at [64] above, it was also clear from the wording of s 8 of the SOGA that the inquiries under ss 8(1) and 8(2) are entirely separate exercises. Accordingly, this was not a case where, to quoteBZW (HC)at [222], the Arbitrator’s breaches were “fundamental and woven deeply into the analytical exercise” that she undertook. 77 Neither did I agree with the plaintiff that the available evidence demonstrated that the Arbitrator had entirely failed to apply her mind to the issues before her, or that in a similar vein, a reasonable person would no longer have confidence in her ability to come to a fair and balanced conclusion on the remitted issues.81Foot Note 81×2PFS paras 6 and 14.In my view, the Arbitrator’s failure to afford the parties an opportunity to present their cases on s 8(2) of the SOGA was essentially a procedural misstep which occasioned a process failure. This was unlikeBZW, where the tribunal had failed entirely to appreciate the correct questions it had to pose to itself –ie, it had completely misunderstood what the case and the issues were about. UnlikeSai Wan Shipping Ltd v Landmark Line Co, Ltd[2022] SGHC 8 (“Sai Wan Shipping”), this was also not a case where the failure to accord one side a reasonable opportunity to be heard was “the product of a haste quite out of keeping with the time accorded to the [other party] for its submissions”, such that a “lack of confidence in the arbitrator to decide the matter fairly if remitted [was] not without reasonable basis” (Sai Wan Shippingat [78]). In the present case, there was no suggestion that the Arbitrator had failed to accord the parties an opportunity to be heard on s 8(2) of the SOGA out of a desire for haste, or that the Arbitrator had acted partially by only affording one side such an opportunity. In the circumstances, thetotalityof the Arbitrator’s conduct did not, in my mind, raise questions as to her ability to decide any remitted issues fairly, objectively and even-handedly. 78 I was also unpersuaded by the plaintiff’s attempts to distinguish the present case fromCKG v CKH[2021] 5 SLR 84 (“CKG”) on the basis that the arbitral tribunal inCKGconsisted of three “distinguished members”, whereas the Tribunal in the present case consisted of a sole arbitrator.82Foot Note 82×2PFS para 15.While the learned Judge inCKGmay have remarked that the “distinction of the Tribunal” formed part of the reason for his decision to remit the arbitral award (at [70]), I did not read the learned Judge’s comments to mean that the qualifications or eminence of the tribunal members should be an important or the determinative factor in deciding whether to remit an award back to the tribunal. In my view, the distinction of a tribunal is, at best,aconsideration in determining whether to remit an award. Be that as it may, I was not given any reason to doubt the Arbitrator’s qualifications in the present case. 79 Finally, I disagreed with the plaintiff that there would be no time and cost savings from the remission of the Award. The Award was dated 5 August 2021, and I made the order to remit the Award on 27 May 2022. By way of comparison, the final award inBZWwas dated 25 October 2018, and the decision of the Court of Appeal was issued on 12 January 2022. On the present facts, it could not be said that a substantial amount of time had passed since the making of the Award, such that the Arbitrator would necessarily have to spend considerable time, effort and costs reviewing the evidence afresh. 80 For completeness, there was no allegation that the Arbitrator had acted in excess of her jurisdiction in considering a chain of reasoning based on s 8(2) of the SOGA. In any event, it was plain that s 8 of the SOGA was generally within the scope of the disputes referred to the Arbitrator, given that the final price of the Iron Ore Fines was indubitably an issue in dispute (see [43] above). Accordingly, while it has been observed by the Court of Appeal that remission would be inappropriate if, in doing so, the tribunal would be asked to deal with an issue outside the scope of its jurisdiction (seeCAJ and another v CAI and another appeal[2022] 1 SLR 505 at [70]), that concern did not, in my view, arise in the present case.",
        "Conclusion": "81 For the reasons set out above, I exercised my power under Art 34(4) of the Model Law, at the defendant’s request, to suspend the setting aside proceedings and remit the Award to the Arbitrator, for the Arbitrator to consider whether to receive further evidence and/or submissions (as the Arbitrator deems appropriate) on the issue of what would constitute a “reasonable price” for the Iron Ore Fines within the meaning of s 8(2) read with s 8(3) of the SOGA. I further ordered that the defendant’s solicitors were to (a) notify the Tribunal of my orders within seven days of the date of my orders; and (b) furnish the Tribunal with a certified copy of the Notes of Arguments containing my oral grounds of decision and the orders made therein, within ten days of the date of my orders. 82 Following from my decision to remit the Award, it was not necessary or appropriate for me to address or reach any decision on the rest of the plaintiff’s arguments for why the Award should be set aside (see [22] above), at least not at this juncture of the matter. I thus reserved my decision on the other grounds raised, pending the Arbitrator’s decision in relation to my remission order. 83 The costs of the application thus far were reserved and are to be dealt with when the matter comes back before me. S MohanJudge of the High Court Kek Meng Soon Kelvin and Gan Yun Han Rebecca (Allen & Gledhill LLP) for the plaintiff; Mohammad Haireez Bin Mohameed Jufferie, Ow Jiang Meng Benjamin and C Sivah (Incisive Law LLC) for the defendant."
    }
}