{
    "case_title": "Energy Resource Investment Pte Ltd vInternational Golf Resorts Pte Ltd",
    "ncitation": "[2022] SGHC 134",
    "coram": "General Division of the High Court — Companies Winding Up No 66 of 2022Aedit Abdullah J12 April 2022",
    "sections": {
        "The law": "5 A company may be wound up if it is unable to pay its debts. This is defined by s 125(1)(e) read with s 125(2)(c) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed). This requires consideration of whether: (a) debts are in fact owed, or whether they are disputed; and (b) whether the company is in fact insolvent, being unable to pay its debts. Whether the first and third loans are properly disputed 6 There are two main grounds for disputing the debts: (a) Whether these loans are governed by an arbitration agreement. (b) Whether a triable issue has been raised. If either is made out, the debts are not undisputed and cannot be the basis for winding up of the company. (1) Whether the first and third loans are governed by the arbitration agreement 7 The Defendant invokes the arbitration clause contained in a novation agreement: This Novation and any non-contractual obligations arising out of or in connection with it are governed by and shall be construed in accordance with the laws of the Republic of Singapore. Any dispute or difference arising out of or in connection with this Novation shall be referred to and finally resolved by arbitration under the rules of the Singapore International Arbitration Centre (“SIAC”) which rules are deemed to be incorporated by reference to this clause. … 8 I am doubtful that this arbitration clause applies to the dispute that is the basis of the winding-up petition. The plain words refer to “[t]his Novation” and “obligations arising out of or in connection with it”, and the immediate conclusion is that the arbitration clause is limited in its scope only to disputes about novation. The Defendant does not put forward strong support for its contention that the arbitration clause should be interpreted more widely so as to take into account the current issue between them, namely, the dispute regarding the repayment of loans. (2) Whether a triable issue has been made out in respect of the first and third loans 9 The Defendant has established that a triable issue has been made out in respect of these two loans, namely, whether an understanding existed as alleged. Several bases for the understanding were relied upon by the Defendant, including that there is an implied term binding the Plaintiff, estoppel by representation, and promissory estoppel. 10 The threshold is not a high one. While it is correct for the Plaintiff to submit that a mere allegation is not enough, the court is only concerned with whether there is an arguable case. The court should not find that such a case exists if the evidence before it clearly points to the contrary and should not be shy of making a determination on what is before it. 11 Here, though, the Defendant pointed to sufficient grounds to make out a triable issue that there was some agreement or representation binding the parties as shareholders of various companies. This was described by the Defendant as the “Understanding”, under which these persons would not seek repayment or have any repayment made unless all agreed to the repayment, and such repayment would be made on all similar loans at the same time. 12 I note that there was a previous proceeding (HC/OS 1150/2000) in which a declaration was pursued by the Defendant against a previous shareholder, one Mr Basuki, that Mr Basuki was not entitled to demand repayment of his loans. Mr Low, it was said, had supported the Defendant’s position, referring to this same Understanding. As it was, the court found in favour of that Mr Basuki, but according to the Defendant, Mr Low and the other shareholders continued to affirm that Understanding. There were also other instances relied upon by the Defendant to show that that the Plaintiff asserted or invoked the Understanding. 13 The Defendant invokes the Understanding as an implied term in the loans, or through estoppel by representation or through promissory estoppel. 14 The Plaintiff, for its part, argues that the Understanding is contrived and goes against the contemporaneous documents. Various deficiencies arise. Firstly, there is a lack of detail and specificity about how the Understanding came about. Secondly, other companies were involved, not the Defendant. Thirdly, the shareholders did not come to any agreement by way of a resolution binding all of them. Fourthly, the terms are also not clear. The proper interpretation of the resolution was also different from what the Defendant contends. Fifthly, there is also inconsistency as to why the Understanding is applicable to some loans, but not others such as the second loan. Finally, it is suspicious that the Defendant did not want to disclose the documents from HC/OS 1150/2000, showing the actual facts in that previous case. 15 In my view, while there may be weaknesses in the Defendant’s case, there remained enough material to support the existence of an arguable case that should be permitted to proceed to trial. There should be an assessment of all the evidence to determine whether the Understanding does in fact exist, and it could not be said that there was such a contradiction or inconsistency in what the Defendant has raised that a determination could be made without a trial. 16 I would note for completeness that the previous application does not appear in the circumstances to operate asres judicatanor that it gives rise to any form of issue estoppel or cause of action estoppel, even on an expanded basis. Neither would the principle against approbating and reprobating appear to be applicable here. No abuse of process would appear to be made out as well. Whether the Defendant is insolvent 17 The cash flow test is to be applied, which requires an assessment of whether the company’s current assets exceeded its current liabilities such that it was able to meet all debts as and when they fell due:Sun Electric Power Pte Ltd v RCMA Asia Pte Ltd (formerly known as Tong Teik Pte Ltd)[2021] 2 SLR 478. The ability to repay is taken measured against a timeframe allowing each debt to be paid as it came payable, and whether any liquidity issue could be cured in a reasonable time. Debts not demanded or not due should also be considered. The courts adopt a commercial rather than a technical view of insolvency. The important point is whether the liquidity problem is temporary and may be cured in the reasonably near future. Based on the evidence presented before the court, the Plaintiff has not proven that the Defendant would be unable to repay its debts as they fall due, as explained below. The second loan 18 I accept the Defendant’s arguments that it has not been shown that the second loan cannot be repaid. The first and third loans are not germane to this inquiry since the debts are disputed and triable issues have been made out. 19 The Plaintiff refers to their expert’s assessment, who concluded that even taking into account the funds of the group as a whole, there would be an inability to pay the consolidated liabilities. 20 The Defendant argues against this, pointing out that the expert’s assessment includes the first and third loans, and did not include a A$1 million provision by one of its other shareholders, one Mr Kwee, which is being held in escrow for the group’s business. 21 As noted by the Defendant, the problem with the expert’s assessment is that it takes into account the first and third loans as current liabilities, which should be excluded from the analysis as they are disputed. And I am satisfied on the evidence before me at this time that there are funds available, on a commercial assessment, that would meet the amount due on the second loan, which is, in any event, payable only in August 2022. The Defendant is therefore not insolvent.",
        "Conclusion": "22 In the circumstances, the winding-up application is not made out, and is thus dismissed. Aedit AbdullahJudge of the High Court Davinder Singh SC, Hanspreet Singh Sachdev, Jaspreet Singh Sachdev and Waverly Seong (Davinder Singh Chambers LLC) for the plaintiff; Vikram Nair, Foo Xian Fong, Glenna Liew, Mazie Tan and Ashwin Menon (Rajah & Tann Singapore LLP) for the defendant."
    }
}