{
    "case_title": "Public Prosecutor vKong Swee Eng",
    "ncitation": "[2022] SGHC 6",
    "coram": "Kannan Ramesh J",
    "sections": {
        "Introduction": "1 This was an appeal by the Prosecution against the decision of a district judge (“the Judge”) acquitting the respondent of all charges against her. I heard the parties on 30 July 2021. After considering their submissions and the evidence before me, on 13 September 2021 I delivered oral grounds allowing the Prosecution’s appeal on several charges, but upholding the Judge’s decision on two of the charges, albeit for different reasons. Thereafter, directions for the parties to file submissions on sentence were given. These are my detailed grounds of decision on conviction only.",
        "Facts": "",
        "Background": "2 Rainbow Offshore Supplies Pte Ltd (“Rainbow”) is a company in the business of supplying equipment and materials for the oil and gas industry, and was incorporated in 2001. The respondent, Ms Kong Swee Eng “Rina” (“the respondent”), was a 50% shareholder and a director of Rainbow. The remaining 50% of Rainbow’s shares were owned by a company called Conexa Pte Ltd (“Conexa”), which the respondent owned. At the material time, the only other director of Rainbow was the respondent’s husband, Huan Ming Chye “Michael” (“Huan”). Huan is also the sole registered owner of a four-room HDB flat located at Block 22 Ghim Moh Link, #40-206, Singapore (“the Flat”). 3 The respondent was also involved in the affairs of a company called DMH Marine Solutions Pte Ltd (“DMH”). DMH was incorporated in 2011, and is an engineering company in the business of supplying hydraulic remote-control systems to the oil and gas industry. This became clear over the course of the trial. Furthermore, 70% of DMH’s shares were owned by a company called Conexa Asia Pte Ltd (“Conexa Asia”), which the respondent also had an interest in. To be clear, this is a different company from Conexa. The rest of DMH’s shares were owned by Huan, who was also its managing director. 4 Both Rainbow and DMH supplied materials and products to Jurong Shipyard Pte Ltd (“JSPL”), which is a wholly owned subsidiary company of Sembcorp Marine Ltd. The relationship between Rainbow, DMH and JSPL was critical to the charges faced by the respondent. JSPL offers a range of services in ship repair, ship building, ship conversion, rig building and offshore engineering. Importantly, at the material time, it was Rainbow’s sole customer. Several personnel from JSPL were involved or referred to in the present case, including: (a) Wong Weng Sun (“Wong”), who was at the material time JSPL’s Managing Director. (b) Chee Kim Kwang (“Chee”), who was at the material time the head of JSPL’s procurement department. (c) Tan Kim Kian (“Tan”), who was at the material time the senior manager of the “Bulk Section” in JSPL’s procurement department. (d) Adam Abdullah Koay (“Koay”), who was at the material time a Deputy General Manager in JSPL’s procurement department. He and the respondent knew each other for many years, having met in Malaysia prior to either one of them working in Singapore. (e) Ng Poh Lin (“Ng”), who was at the material time employed as a procurement officer in JSPL’s procurement department. (f) Chan Chee Yong “Derek” (“Chan”), who was at the material time employed as an assistant section manager in JSPL’s procurement department. Chan and Ng are husband and wife, having married in March 2013. (g) Lau Kim Kiat “Michael” (“Lau”), who, during the events leading up to the present case, was first employed as an engineer in the Piping and Design Section of JSPL from 2006 to 30 April 2013, and later as a project manager in DMH from 7 May 2013. Over the course of trial, correspondence between the respondent and these persons were produced. The correspondence took place on work and personal emails, as well as the mobile messaging application WhatsApp (“WhatsApp”). The contents of this correspondence were crucial. 5 In 2016, after investigations by the Corrupt Practices Investigation Bureau (“the CPIB”), the respondent was charged with eleven counts of giving gratification to several persons in JSPL, under s 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed) (“the PCA”). The recipients of the gratification were all JSPL employees, and the majority of them were in its procurement department. The gratification included investment opportunities, overseas trips, alcohol, rental of the Flat, and employment. The respondent claimed trial, and ten charges were proceeded with which are reproduced below. Throughout the course of these grounds of decision, I will simply refer to them as “the 1st charge”, “the 2nd charge”, the “3rd charge”etc. The 1st Charge You … are charged that you, on or about 11 April 2008, in Singapore, did corruptly give gratification to an agent, Chee Kim Kwang, the general manager of the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), to wit, the opportunity to invest in Golden Oriental Pte Ltd’s shares, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 2nd Charge You … are charged that you, on or about 11 April 2008, in Singapore, did corruptly give gratification to an agent, Tan Kim Kian, a procurement manager of Jurong Shipyard Pte Ltd (“JSPL”), to wit, the opportunity to invest in Golden Oriental Pte Ltd’s shares, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 3rd Charge You … are charged that you, sometime in December 2011, in Singapore, did corruptly give gratification to an agent, Koay Chin Hock @ Adam Abdullah Koay (“Koay”), a deputy general manager of the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), to wit, a holiday to Japan, including return air tickets and accommodation, for Koay, his wife Huda binte Mohamed Sanusi, and his daughter Nawal Adam Koay, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 4th Charge You … are charged that you, sometime in October 2011, in Singapore, did corruptly give gratification to agents, to wit, Chan Chee Yong (“Chan”), an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), and Ng Poh Lin (“Ng”), a procurement officer in JSPL, to wit, a holiday to Korea, including a return air ticket for Ng and accommodation in Korea for both Chan and Ng, as an inducement to do acts in relation to their principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 5th Charge You … are charged that you, sometime in April 2013, in Singapore, did corruptly give gratification to agents, to wit, Chan Chee Yong, an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), and Ng Poh Lin, a procurement officer in JSPL, to wit, a holiday to Korea, including return air tickets and accommodation, as an inducement to do acts in relation to their principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 6th Charge You … are charged that you, on or about 12 May 2013, in Singapore, did corruptly give gratification to agents, to wit, Chan Chee Yong, an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), and Ng Poh Lin, a procurement officer in JSPL, to wit, two Singapore Airlines return tickets to Europe worth a total of S$3,349, as an inducement to do acts in relation to their principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 7th Charge You … are charged that you, in 2013, in Singapore, did corruptly give gratification to agents, to wit, Chan Chee Yong (“Chan”), an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), and Ng Poh Lin (“Ng”), a procurement officer in JSPL, to wit, the rental of a flat located at Block 22, Ghim Moh Link, #40-206, Singapore at S$500/- per month, which Chan and Ng rented for a total of six months, as an inducement to do acts in relation to their principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 8th Charge You … are charged that you, on or about 28 March 2013, in Singapore, did corruptly give gratification to an agent, Chan Chee Yong (“Chan”), an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), to wit, a Mercedes Benz (vehicle registration no. SJU7907J) rented for two days at a cost of S$663.40/-, for use as the bridal car at Chan’s wedding, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 10th Charge You … are charged that you, on or about 28 March 2013, in Singapore, did corruptly give gratification to an agent, Chan Chee Yong, an assistant section manager in the procurement department of Jurong Shipyard Pte Ltd (“JSPL”), to wit, a 3-litre bottle of Cordon Bleu worth S$1,180 and a bottle of Macallan liquor, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The 11th Charge You … are charged that you, on or about March 2013, in Singapore, did corruptly give gratification to an agent, Lau Kien Huat, an engineer employed by Jurong Shipyard Pte Ltd (“JSPL”), to wit, the position of project manager in DMH Marine Solutions Pte Ltd, as an inducement to do acts in relation to his principal’s affairs, to wit, to advance your business interests with JSPL, and you have thereby committed an offence punishable under Section 6(b) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed).",
        "The proceedings below": "6 The trial lasted 48 days. The respondent and Huan testified, along with many of the JSPL personnel referred to above at [4] who allegedly received gratification from the respondent. The Prosecution’s case was that the respondent had given gratification to Chee, Tan, Koay, Chan, Ng and Lau, in order to advance her business interests in Rainbow and DMH. The respondent’s case on most of the charges was that no gratification was given. Further, she argued that there was a “special relationship” with key personnel in JSPL that served as a defence to all the charges (“the special relationship defence”). 7 The special relationship was allegedly agreed sometime in 2003 or 2004 between (a) the respondent and Huan, and (b) Wong and the then CEO of JSPL, Tan Kim Kuan (referred to as “KK Tan Senior”). As a result of the special relationship, Rainbow was essentially guaranteed JSPL’s custom. As Rainbow was assured of JSPL’s custom, the respondent argued that it was unnecessary for her to have given gratification to anyone to advance the business interests of Rainbow or DMH. At this juncture it is relevant to note two points. First, despite the importance of Wong’s evidence on the special relationship defence, he was called by neither the respondent (to support the special relationship defence), nor the Prosecution (to rebut it). Second, though Wong was originally on the Prosecution’s list of witnesses, it ultimately decided against calling him. Instead, Wong was offered to the respondent as a witness and his investigative statements were made available to her as well. 8 The Judge acquitted the respondent on all the charges on the basis of the special relationship defence. This will be elaborated upon further below at [50]–[51]. Briefly, he found that (a) the special relationship would have had the effect asserted by the respondent, and (b) she had discharged her evidential burden in this regard. Accordingly, he found that the evidential burden had shifted to the Prosecution to rebut the special relationship. The Judge was of the opinion that the Prosecution did not have sufficient evidence at hand to rebut the special relationship, and thus it ought to have called Wong as a witness for this purpose. As noted above, the Prosecution did not call Wong as a witness. As the Prosecution had not failed to rebut the special relationship, the Judge found that there was reasonable doubt on themens reaforallthe charges and acquitted the respondent without considering each charge specifically: seePublic Prosecutor v Kong Swee Eng[2020] SGDC 140 (the “GD”) at [24], [30], [31], [47], [58] and [63].",
        "Issues": "9 Section 6 of the PCA reads as follows: Punishment for corrupt transactions with agents 6.  If — (a) any agent corruptly accepts or obtains, or agrees to accept or attempts to obtain, from any person, for himself or for any other person, any gratification as an inducement or reward for doing or forbearing to do, or for having done or forborne to do, any act in relation to his principal’s affairs or business, or for showing or forbearing to show favour or disfavour to any person in relation to his principal’s affairs or business; (b)any person corruptly gives or agrees to give or offers any gratification to any agent as an inducement or reward for doing or forbearing to do, or for having done or forborne to do any act in relation to his principal’s affairs or business, or for showing or forbearing to showfavour or disfavour to any person in relation to his principal’s affairs or business; or (c) any person knowingly gives to an agent, or if an agent knowingly uses with intent to deceive his principal, any receipt, account or other document in respect of which the principal is interested, and which contains any statement which is false or erroneous or defective in any material particular, and which to his knowledge is intended to mislead the principal, he shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 5 years or to both. [emphasis added] 10 The elements of an offence under s 6(a) of the PCA, foracceptinggratification as an agent, have been set out inPublic Prosecutor v Leng Kah Poh[2014] 4 SLR 1264 (“Leng Kah Poh”) at [20]. Transposed to s 6(b), for thegivingof gratification to an agent, the elements of the offence are: (a) the giving, agreeing to give or the offering of gratification; (b) as an inducement or reward for the conferment of a benefit;(c) there was an objectively corrupt element in the transaction; and(d) the giver gave the gratification with guilty knowledge. Element (a) is theactus reusof the offence, whilst elements (b)–(d) are themens rea:Leng Kah Pohat [20]. 11 On appeal, the respondent’s case remained unchanged: for most of the charges, there was no gratification given by her, and in any event, the special relationship defence served to negate themens reaof the charges. Much of the arguments on appeal centred on whether the Judge was correct in concluding that the evidential burden had shifted to the Prosecution to rebut the special relationship, which it did not as it failed to call Wong as a witness. Accordingly, my analysis will be as follows: (a) First, I shall deal with theactus reus,ie, did the respondent give gratification to the various personnel? (b) Second, I shall consider themens rea. Within this analysis, I will also deal with the relevance of the special relationship defence.",
        "Theactus reusunder s 6(b) of the PCA": "12 Theactus reusof an offence under s 6(b) of the PCA is that there must be gratification given by the accused. The definition of “gratification”, as per s 2 of the PCA, is wide and not limited to money or property. For example, it includes “any other service, favouror advantage of any description whatsoever” (emphasis added). For the 3rd charge, which related to Koay, there was no dispute as to gratification by the respondent – she did “not deny that she had paid for [a] holiday to Japan for [Koay]”. As for the 1st, 2nd, 4th, 5th, 6th and 8th charges, I found that the Prosecution established the giving of gratification beyond a reasonable doubt. However, for the 7th and 10th charges, I found that the Prosecution failed to do so.",
        "The charges involving Chee and Tan – the 1st and 2nd charges": "13 The 1st and 2nd charges related to gratification given to Chee and Tan. As stated above, Chee was the head of JSPL’s procurement department, and Tan a senior manager in one of its sections. The Prosecution’s case was that the respondent had given Chee and Tan gratification “in the form of an opportunity to invest in the shares” of Golden Oriental Pte Ltd (“Golden Oriental”), a company incorporated in Singapore which was in the cargo and shipping business in China. The respondent was a shareholder in Golden Oriental, and sometime in April 2008, both Chee and Tan decided to purchase shares in Golden Oriental, with Chee deciding to invest S$300,000, and Tan S$200,000. Chee’s evidence was that he thought that there was a good chance that Golden Oriental would list in Singapore, whilst Tan’s was that he was told by someone that Golden Oriental was intending to list in Singapore. In other words, both Chee and Tan purchased the shares with the expectation that they would make a substantial return on their investment upon the shares being listed. 14 However, Golden Oriental shares were not available in the open market and only existing (as opposed to new) shareholders could subscribe to new shares issued by Golden Oriental.  Thus, if Chee and Tan wanted to purchase Golden Oriental shares, they would have to do so from an existing shareholder. The respondent, an existing shareholder, facilitated their purchase of Golden Oriental shares. 15 First, a share subscription agreement was intended between Golden Oriental and the respondent under which new shares would be issued to her (see below at [18]). Chee and Tan would purchase a portion of these new shares from her. However, despite purchasing the shares, the respondent would remain the shareholder on record: it was agreed that the respondent would hold Chee and Tan’s shares in Golden Oriental on trust for them under trust deeds. To give effect to the trust arrangement, the respondent engaged a lawyer, Tan Siah Yong (“TSY”), to prepare the trust deeds which were thereafter executed by the respondent, Chee and Tan. Following this, Chee and Tan issued individual cheques for S$300,000 and S$200,000 respectively in the name of the respondent, which were handed to TSY. He deposited the cheques into the respondent’s bank account. It is clear from the above narrative that, but for the respondent’s intervention and assistance, Chee and Tan would not have been in a position to acquire the shares in Golden Oriental. In other words, the respondent had given Chee and Tan anopportunityto acquire shares that were not available in the open market, an opportunity that they would otherwise not have had. 16 The respondent argued that giving Chee and Tan the opportunity to purchase the shares was not gratification within the meaning of s 2 of the PCA. However, this argument has no merit. As held by the Court of Appeal inPublic Prosecutor v Teo Chu Ha[2014] 4 SLR 600 at [58]: “it is theopportunityto purchase the shares and/or theassistancerendered in purchasing the shares which, together with the shares, constitutes the gratification”. In that case, the Court of Appeal placed emphasis on the fact that the accused would have been unable to purchase the shares in the open market. 17 This was also the case here. The Golden Oriental shares were not available for purchase from the open market, but were made available by the respondent to Chee and Tan for purchase. The respondent had given them the opportunity to purchase the shares, and provided assistance in this regard. This made the gratification clear. It is important that the shares were offered to Chee and Tan on the basis that they would be listed,ie,they had seized the opportunity offered by the respondent in the expectation they would make a substantial return on their investment. Thus, it cannot be contended that the opportunity to purchase the shares is not a gratification as per s 2 of the PCA. 18 This brings me neatly to the respondent’s argument that the opportunity to invest had not materialised. As noted above, in carrying out the purchase, the respondent, Chee and Tan had entered into trust deeds. In the trust deeds, it was stated that the respondent had, “on the [sic] 7 April 2008 signed [the subscription agreement]”. On appeal, contrary to what was stated in the trust deed, the respondent asserted that the subscription agreement was never signed, and characterised the payments from Chee and Tan as “deposit[s]” that were made in the expectation that it would eventually be signed. On this basis, she argued that the opportunity to invest did not materialise, as the subscription agreement was ultimately never signed. However, as pointed out by the Prosecution, this argument was not raised in the proceedings below. That the subscription agreement was not signed was not put to Chee or Tan during their cross-examinations. Furthermore, the evidence showed that the subscription agreement had in fact been signed. The respondent’s CPIB statements clearly state that Chee and Tan had “bought” shares from her, and, at trial, during her examination-in-chief, the respondent had specifically agreed that she had signed the subscription agreement. It appeared that this argument was an afterthought and had no factual basis. However, even if it did have a factual basis, I question whether it would have a legal one: the respondent had given Chee and Tan the opportunity to purchase shares that were not available to the public, and whether the shares were actually issued ought not to matter. 19 Finally, the respondent also argued that it was the chairman of Golden Oriental (“the Chairman”) and not she who had given gratification to Chee and Tan. She asserted that it was the Chairman who had given Chee and Tan the opportunity, following a roadshow which they attended, to invest in Golden Oriental by subscribing for more shares through the respondent. This position was untenable for three reasons. First, the respondent’s argument was against the weight of the evidence. As noted above, it was accepted that Golden Oriental’s position was that only existing shareholders could subscribe to more shares. Second, if the Chairman had given Chee and Tan the opportunity to invest, surely he would have then allowed them to subscribe for new shares directly from Golden Oriental rather than purchasing them from the respondent. Third, even if Chee and Tan were influenced to invest as a result of a roadshow, the fact is that the opportunity to invest was given by the respondent as an existing shareholder. She made the offer and facilitated the purchase. The question ofwhyChee and Tan decided to invest was irrelevant. As such, I did not find that this point assisted the respondent, and was satisfied that the Prosecution had proven theactus reusfor the 1st and 2nd charges beyond a reasonable doubt.",
        "The charge involving Lau – the 11th charge": "20 The 11th charge related to Lau, who at the material time was an engineer at JSPL and later joined DMH as a project manager. The alleged gratification was an offer of employment with DMH made by the respondent. The respondent’s defence was that the gratification had not come from her as she was not a named director of DMH; instead, the offer of employment was made on 10 March 2013 by Huan, who was the managing director of DMH. On appeal, the respondent submitted that Lau was unhappy in his role at JSPL, and had approached Huan for a job with DMH. Huan had only given Lau the job because his previous project manager was leaving at the time and he needed an engineer to replace him. In support of this narrative, the respondent produced Exhibit D1, which was a letter of employment from DMH to Lau dated 10 March 2013, signed by Huan. 21 I was unable to accept the respondent’s version of events. First, it was clear to me that the respondent was involved with DMH. While the ACRA records on DMH do not show her as a shareholder or director, it was clear that she had a high level of control over DMH’s affairs, or, as the Prosecution argued, she was a “shadow director”. As noted above at [3], the respondent had an indirect interest in DMH through her shareholding in Conexa Asia, and its majority shareholding in DMH. Second, there was ample evidence showing that the respondent had control over the affairs of DMH. For example, at trial she claimed that Wong had asked her to help him break another company’s monopoly over the provision of certain ship-related components and systems. She obliged, resulting in DMH incurring losses (see below at [76(b)]). This suggested that she did have control of the business affairs of DMH – if she did not, it would make no sense for Wong to make the request, and she would not be in a position to procure DMH to cooperate and incur losses. 22 More significantly, the evidence showed that the respondent had control over the decision by DMH to hire Lau. For example, she was involved in preparing Lau’s letter of offer. She was also the point of contact for Lau when discussing his employment with DMH. In fact, she was the one who had first broached the subject of employment with Lau in February 2013, as shown by Exhibit P141, which is a series of texts between the two. This was corroborated by Lau, who testified that it was the respondent who had offered him employment with DMH. There was no reason for her to be involved in any of this unless she was in a position to represent DMH. Consequently, I found that it was the respondent, not Huan, who had made the offer of employment to Lau. Thus, theactus reusof the 11th charge was proven beyond a reasonable doubt.",
        "The charges involving Chan and Ng – the 4th, 5th, 6th, 7th, 8th and 10th charges": "23 The 4th, 5th, 6th, 7th, 8th and 10th charges related to Chan and Ng. As stated earlier, at the material time, both worked in JSPL’s procurement department, were in a relationship, and subsequently married in March 2013. The charges related to various forms of gratification from the respondent, including paying for overseas trips (the 4th, 5th and 6th charges), providing alcohol and a car for Chan and Ng’s wedding (the 8th and 10th charges respectively), and renting out the Flat to them at an undervalue (the 7th charge). I found that theactus reusof gratification was proven beyond a reasonable doubt for only the 4th, 5th, 6th and 8th charges. However, I found there to be gaps in the Prosecution’s case for the 7th and 10th charges that raised a reasonable doubt. The 4th and 5th charges 24 The 4th and 5th charges related to air tickets and accommodation for trips to Korea paid for by the respondent. (a) As regards the 4th charge, between October and November 2011, the respondent, Huan, and Chan had gone on a work related trip to Korea. Chan’s tickets had been paid for by JSPL. However, the respondent suggested to Chan that Ng join them on the trip. Accordingly, the respondent paid for Ng’s return air ticket to Korea on Singapore Airlines, priced at S$1,118.20, and also made arrangements to extend Chan’s air ticket, paying S$115.90 for this purpose. Finally, she had also paid for the entire party’s accommodation (consisting of herself, Huan, Chan and Ng), which totalled S$1,643. (b) On the 5th charge, between 27 April and 1 May 2013, the respondent, Huan, Chan and Ng went on a personal trip to Korea. It was also accepted that the air tickets and accommodation for all of them were booked and paid for by the respondent. The respondent paid S$1,963 for the air tickets of Chan and Ng, and S$3,335.85 for the entire party’s accommodation in Seoul. 25 However, Chan had repaid the respondent through Huan for both trips by way of two cheques for S$3,000 dated 1 November 2011 and 14 May 2013. The respondent argued that as she was repaid the cost of the air tickets and accommodation by Chan and Ng, no gratification was given. However, the Prosecution argued that the gratification crystallised at the point when payment was made, and it did not matter that Chan and Ng had repaid her of their own accord subsequently. 26 I agreed with the Prosecution. The act of repayment by the recipient should not absolve the giver of liability. If this was the case, in every case where a recipient returned a bribe, the offender would be able to escape prosecution. Section 6(b) of the PCA does not require that the bribe be accepted. In fact, it does not even require the gratification to have changed hands – it is enough for it to have been offered. The question in this case was not whether repayment had occurred. Rather, it was whether the payment was made by the respondent in the expectation or on the understanding that she would be repaid. I found that not to be the case. 27 I found that the respondent did not pay for the trips in the expectation that she would be repaid by Chan and Ng. There was no evidence that she discussed the issue of repayment with Chan and Ng prior to making payment for the air tickets and the accommodation. Chan and Ng testified that the respondent never asked for repayment. The respondent denied this and referred to Exhibit D61, an email she had sent to Chan and Ng, where she attached the air tickets and their price, as proof of her request for repayment. However, this email did not support the respondent’s case. To begin, Chan and Ng were not shown the email at trial. It was not put to them that it was a request for repayment. Furthermore, it was clear on the face of the email that it was not. It was the respondent simply sharing the airline booking details with Chan and Ng – the price was stated right at the end of the booking details and the email did not contain any request for payment. Importantly, the email did not includeallthe costs of the trip such as the cost of accommodation. If repayment was intended, surely the respondent would have told Chan what the cost was and requested in clear terms to be repaid. Chan’s testimony in this regard is telling. He testified that when he asked the respondent for the cost of the trip, she did not tell him the cost of the air tickets and the accommodation. He was thus forced to make an estimation which was the basis upon which he made repayment. This, in my mind, supported the conclusion that the respondent did not wish to be repaid, and had intended the trips to be gifts. 28 I also was not persuaded by the respondent’s argument that it was her practice to pay for trips and seek reimbursement later. The respondent claimed that she had the practice of sending emails with the cost break down for trips she made with her golfing club, and thus her email to Chan was for the same purpose. She produced Exhibit D62, an email to her golf club members, which showed herexpresslyasking for repayment for the costs of a trip, including the costs of air tickets and accommodation. However, Exhibit D62 is not at all similar to Exhibit D61. As noted above, Exhibit D61 did not include all the costs of the trip and there was no request for payment. Whilst there was a table breaking down the various costs (which were labelled as part of Exhibit D61) this was clarified on appeal by counsel for the respondent as being a table he had prepared for the purpose of the trial. It was thus not part of Exhibit D61 and therefore not a document sent by the respondent to Chan and Ng. Thus, the contrast between Exhibit D61 and Exhibit D62 reinforced the fact that she never asked for repayment or wanted to be repaid. This supports Chan’s testimony that the respondent had not disclosed to him the full cost of the trip when asked, forcing him to make the estimation. 29 Thus, theactus reusfor the 4th and 5th charges was proven beyond a reasonable doubt. The 6th charge 30 The 6th charge related to air tickets booked by the respondent for Chan and Ng, this time to Europe. On 12 May 2013, the respondent booked and paid for Chan and Ng two return air tickets from Singapore to Barcelona and Milan to Singapore, from 30 October 2013 to 17 November 2013. The cost of these tickets was S$3,349. 31 However, as Chan and Ng ultimately never made the trip because the tickets were subsequently invalidated and cancelled, the respondent argued there was no gratification. In response, similar to its case on the 4th and 5th charges, the Prosecution took the position that the gratification crystallised at the point of giving, and that there was no evidence that the respondent had booked these tickets for Chan and Ng in the expectation that she would be repaid. 32 I agreed with the Prosecution. The fact remained that the respondent had booked the tickets for Chan and Ng of her own volition, and there was no evidence that she intended to be repaid. Chan testified that the respondent had not consulted him and Ng about the details of this trip, had bought the tickets without asking them, and did not ask to be repaid. It is important that the trip to Europe was meant to be Chan and Ng’s honeymoon. Despite this, the respondent insisted on accompanying them. Chan testified that, naturally, he and Ng did not want her to tag along. This, along with the fact that the CPIB investigations that had started around this time, resulted in Chan and Ng deciding to cancel the trip and the air tickets. That the respondent paid for the trip and insisted on travelling with Chan and Ng despite their reluctance speaks volumes. She had essentially forced the trip on them and wanted to pay for their honeymoon to Europe in an effort to buy them over. Thus, I found that theactus reuswas proven on the 6th charge beyond a reasonable doubt. The 7th charge 33 The alleged gratification for the 7th charge was lease of the Flat at an undervalue. As noted above at [2], Huan was the owner of the Flat. The respondent’s case was that in February 2013, Chan and Ng rented aroomin the Flat, as opposed to the Flat, at a monthly rent of S$500. As the lease was for a room, it was not at an undervalue,ie,there was no gratification. The Prosecution argued that this assertion went against the weight of the evidence, and that the rent was for the entire Flat. 34 The Flat was unoccupied when Chan and Ng began staying there. In the six months that they stayed there, no one else resided in the Flat. They paid rent of S$500 a month, inclusive of utilities, and paid a total of S$3,000 over the period of their stay. 35 I found that the Prosecution failed to prove the gratification framed in the charge, which was that Chan and Ng rented the Flat at a monthly rent of S$500. Both Chan and Ng testified that they were renting aroominstead of the Flat. Further, although Chan testified that he and Ng did use other parts of the Flat, Ng’s evidence was that she had asked permission from Huan before doing so. This is not consistent with the Flat, as opposed to a room therein, being leased out. A lease requires there to be exclusive possession over the leased area: seeChua June Ching Michelle v Chai Hoi Tong and others[2011] 4 SLR 418 at [18]. Accordingly, that Ng asked for permission to use other parts of the Flat suggested that there was no such exclusive possession for the Flat, which suggested that the lease was only for one room. 36 While the Prosecution attempted to downplay the evidence of Chan and Ng, the circumstances supported the inference that the lease was only for a room. Chan and Ng’s testimony was that they needed short term accommodation whilst waiting for their own home to be finished, following their marriage. In this regard, it made sense that they would only want to rent a room as opposed to an entire flat. The evidence showed that Chan and Ng were looking for a room from the very beginning. Exhibit D64 was an email from a real estate agent which listed several “common rooms” for Chan and Ng’s consideration. 37 I did not accept the Prosecution’s attempts to rebut this using the respondent’s statements to the CPIB. When questioned about the Flat, she had said as follows: Q15 Other than the condominium that [Huan] has bought for his children and mother, does he have any other properties? A15 Yes he has a HDB flat at Blk 27 Ghim Moh. The exact address I am not too sure. Q16 Who is occupyingthe flatnow? A16 [Chan] and [Ng]. They are purchasers from M/S Jurong Shipyward [sic] Pte Ltd. Q17 Why are they occupyingthe flat? A17 [Chan] and [Ng] got married last year Dec 2012. They are waiting for their new flat to be ready and I don’t know where the new flat would be … he wanted to renta flatto stay for a year. He said [Ng] does not want to stay with his mother so he needed to look for a place to stay. I told him [Huan] hasa flatvacant at Ghim Moh so I told [Chan] to ask him. [Huan] agreed and the agreement was that [Chan] has to pay rental of $500 including PUB bills to [Huan]. [emphasis added] The Prosecution relied on the use by the respondent of the word “flat” to argue that the lease was for the Flat. In my opinion, this was equivocal, and could be explained by imprecise answering on the respondent’s part. As noted above, Chan and Ng’s understanding was that they were renting a room, not the Flat – it was unlikely that they would have had a different understanding from the respondent. Overall, there was reason to doubt that Chan and Ng rented the Flat. As the essence of the alleged gratification in the charge was that rent was at an undervalue because it was paid for a lease of the Flat and not just a room – the charge specifically stating that the rent of S$500 was for the Flat – I found that theactus reuswas not established beyond a reasonable doubt. 38 On appeal, the Prosecution submitted that the 7th charge ought to be amended to an “offer” of rental of the Flat at S$500. The logic was that the respondent had offered Chan and Ng the lease of the Flat at S$500, and they had rejected it accepting instead a lease of a room in the Flat. This would have fulfilled theactus reusunder s 6(b) of the PCA, which provides that an “offer” of gratification is sufficient. However, I declined to allow the amendment as I found that there would be prejudice to the respondent if the charge had been so amended, as she had run her defence on the basis that the charge was for renting the Flat at an undervalue. Further, critically, there was no evidence to support the allegation that there was an offer of a lease of the Flat at a monthly rent of S$500. The 8th charge 39 The 8th charge related to the hire of a car for Chan and Ng’s wedding. Around two weeks prior to the wedding, Chan asked the respondent if he could use her car as his wedding car. The respondent, however, suggested that she would help him “borrow” a car instead. The respondent then instructed her cousin, Ian Tan Eng Wah (“Ian”), to hire a car for Chan’s use at his wedding. Ian hired a silver Mercedes Benz (“the Car”) and paid the hire for two days, a total of S$663.40. Chan used the Car for his wedding, and did not reimburse the respondent for the hire. Neither did she or Ian seek reimbursement from Chan. 40 The respondent argued that the gratification came from Ian and not her. Ian testified that he had paid for the hire and did not seek reimbursement. I did not accept the argument. The respondent and Chan had discussed the use of her car for the wedding. While she declined the use of her car, she told him that she would “borrow” a car for him to use. The respondent then requested Ian to make the booking and pay the hire charges, and had told Ian that she “must” reimburse him. The respondent did not at any time notify Chan of the hire charges and ask that he reimburse Ian. This made it clear that gratification was given. The fact that the respondent eventually did not reimburse Ian was irrelevant – she had offered to “borrow” a car for Chan and procured the hire of the Car through Ian thereafter. Thus, the gratification was from her. Accordingly, I found that theactus reuson the 8th charge to be proven beyond a reasonable doubt. The 10th charge 41 The 10th charge related to the respondent giving Chan and Ng two bottles of alcohol for their wedding dinner: a 3-litre bottle of Cordon Bleu worth S$1,180, and a bottle of Macallan liquor. It is common ground that prior to the dinner, Chan and the respondent had discussed the type of alcohol that should be served at the dinner. Subsequently, the respondent gave Ian the two bottles and told him to place them in the backseat of the Car, which he did. Whilst the respondent accepted all of this, her case was that the two bottles were not gifts to Chan and Ng. Instead, they were meant for consumption by the respondent’s friends who were guests at Chan and Ng’s wedding, and seated at a specific table. Accordingly, she asserted that the Prosecution had failed to prove theactus reusof the charge. 42 I found that the Prosecution did not prove beyond a reasonable doubt that the two bottles were gifts to Chan and Ng. The evidence showed that the respondent provided the bottles for consumption by her friends in management who were attending Chan and Ng’s wedding. Chan had testified to this effect. Also, one of the guests at the wedding, Luei On Sai, testified that there was a bottle of Macallan at his table which he later found out had come from the respondent. 43 While Chan testified that he and the respondent had discussed the alcohol to be served at the wedding, I found this to be equivocal. There was no link between that conversation and the gifting of the bottles that were the subject of the charge, a fact that I had pointed out to the Prosecution. While the Prosecution had adduced evidence of the respondent’s conversation with Chan, it did not seek to establish this link. There was no evidence that showed that, during this conversation, the respondent had offered to supply the alcohol for the dinnerfor freeor that she had intended for the bottles to be gifts to Chan and Ng. This was something that should have been raised with Chan, but was not. 44 Further, I found the mode of delivery of the bottles to be inconsistent with the inference that they were meant to be gifts to Chan and Ng. Ian had been instructed by the respondent to leave the bottles in the backseat of the Car, with no specific instruction that they were to be gifted to Chan and Ng. If the bottles were gifts to Chan and Ng, one would have expected them to be given directly rather than being left on the backseat of the Car without them being told. Indeed, Chan testified that he did not know that the bottles were in the Car until later, which reinforced the fact that they were not gifts to him and Ng. 45 Finally, on appeal, the Prosecution attempted to argue that the gratification was that Chan and Ng would not have to supply alcohol to some people at the wedding,ie,they benefitted because they had been saved an expense. I did not accept the argument as that was not the charge. Further, even if it was, I did not think it was established on the facts. If it was the respondent’s intention to save Chan and Ng the expense of serving drinks at their wedding, she would not have stopped at supplying two bottles. As such, I found that theactus reuson the 10th charge was not proven beyond a reasonable doubt.",
        "Themens reaunder s 6(b) of the PCA": "46 Having found that the gratification for the 7th and 10th charges were not proven, I considered themens reaof only the 1st, 2nd, 3rd, 4th, 5th, 6th, 8th and 11th charges. In this regard, I found that the special relationship defence did not negate themens reaof corruption, as the respondent had not discharged her evidential burden of proving its existence. Before I turn to that, I first consider themens reaof an offence under s 6(b) of the PCA.",
        "“Objectively corrupt element” in s 6(b) of the PCA": "47 As noted above at [10], themensreaof an offence under s 6(b) of the PCA requires that: (a) the gratification be given as an inducement or reward for the conferment of a benefit; (b) there was an objectively corrupt element in the transaction; and (c) the gratification was given with guilty knowledge. Before going further, (b) requires some further elucidation. 48 Whether a transaction is tainted by an objectively corrupt element in an offence under s 6 of the PCA depends on the intent behind the transaction. Where the intent or motive is to cause an agent to act against the principal’s interests, or to act in favour of the giver’s interests, this would inform the presence of an objectively corrupt element:Leng Kah Pohat [24]. Thus, where the gratification is given as an inducement or reward for the conferment of a benefit (requirement (a) above), it will naturally follow that the transaction is tainted by an objectively corrupt element (requirement (b) above). This has been observed by the Court of Appeal inLeng Kah Poh, where it was stated that these two aspects would normally be part of the same factual inquiry: at [22]. 49 With this in mind, I turn to my analysis of the special relationship defence.",
        "The special relationship defence did not negate themens rea": "50 As I have noted, the respondent’s primary argument with regard to themens reawas the special relationship defence. This was premised on the existence of a special relationship that meant that she did not need to offer or give gratification to anyone in JSPL to advance the business interests of Rainbow and DMH. Although couched in general terms, the respondent’s argument seemed to be that because of the special relationship, she could not have intended the gratification in question to be an inducement, and thus the transactions were not objectively corrupt. Naturally, this would also mean that she could not have subjectively known that the transactions were objectively corrupt. Indeed, the Judge had proceeded on this basis at [17] of the GD. 51 The Judge found that the existence of the special relationship was not patently or inherently incredible and that the respondent had adduced sufficient evidence to shift the evidential burden to the Prosecution to rebut its existence: GD at [30] and [57]. He also found that the Prosecution had not adduced any evidence sufficient to impugn or contradict the existence of the special relationship: GD at [47]. Accordingly, the Judge was of the opinion that the Prosecution should have called Wong to rebut the existence of the special relationship: GD at [58]. As the Prosecution did not, he found that it had failed to discharge its evidential burden in rebutting the “special relationship”: GD at [63]. As such, the Judge acquitted the respondent on all the charges on the basis that, by reason of the “special relationship”, there was reasonable doubt on all the proceeded charges as to whether there was an objectively corrupt element, and whether the accused possessed guilty knowledge. In the Judge’s opinion, by reason of the special relationship, there was no reason for the respondent to bribe anyone in JSPL: GD at [81]–[83]. 52 On appeal, the respondent maintained her position that the special relationship defence negated themens reaof all the charges. On the other hand, the Prosecution framed their arguments on the special relationship defence as such: (a) that the special relationship defence was irrelevant to the charges; and (b) the special relationship was inherently incredible, such that the evidential burden of it had not shifted to the Prosecution. I found this bifurcation of the Prosecution’s case not necessary, nor strictly correct. In my opinion, both were arguments that the special relationship defence was inherently incredible. To explain, the first limb of the Prosecution’s argument was that the special relationship defence was not relevant as it was not clear how it affected JSPL’s procurement process. However, it was apparent from the Prosecution’s submissions that this lack of clarity was due to a paucity of evidence, and not because the special relationship defence itself could not conceptually negate the elements of the offence. The Prosecution implicitly recognised this on appeal when it submitted that “[the respondent’s] evidence does not explain how such a special arrangement would co-exist with JSPL’s procurement process”. In my opinion therefore, the singular issue was whether the respondent had discharged her evidential burden with regard to the existence of the special relationship, thereby shifting it to the Prosecution to adduce evidence in rebuttal. The special relationship must not be “inherently incredible” 53 To begin with, I agreed with the Judge that Wong was a material witness on the special relationship defence for reasons that will be explained later (see below at [60]). His testimony could have either confirmed or denied its existence, and both parties recognised this at the trial. As noted earlier, the Prosecution had initially listed him as a rebuttal witness, but ultimately chose not to call him. 54 However, the Prosecution did not have to call Wong just because he was recognised to be a material witness. The Prosecution has no general duty to call a material witness, although if they choose not to, they risk failing to discharge their own evidential burden:Muhammad Nabill bin Mohd Fuad[2020] 1 SLR 984 (“Nabill”)at [67]. The Prosecution does not need to call a material witness to rebut the defence’s case where: (a) the Prosecution is satisfied that it can rely on other evidence to discharge its evidential burden; or (b) the fact the accused is relying on has not “properly come into issue”,ie,it is “inherently incredible”:Nabillat [71]. 55 With regard to the latter, the definition of what is “inherently incredible” is fact-sensitive. Two recent cases serve as important examples: (a) InBeh Chew Boo v Public Prosecutor[2020] 2 SLR 1375 (“Beh Chew Boo”), the accused was charged with drug trafficking, after having been caught with drugs in the storage compartment of a motorcycle. He claimed that he did not know that the drugs were in the storage compartment. The Court of Appeal found that the accused’s account was not inherently incredible due to “unique features” present in that case: the motorcycle did not belong to the accused; his DNA was not found on the drugs while the DNA of the owner of the motorcycle was; some of the accused’s reasons for entering Singapore were corroborated by evidence; and his evidence in court and his statements were consistent: at [64]–[70]. Importantly, the accused had told officers to check with the owner of the motorcycle, an assertion that was corroborated by police testimony: at [69]. On this basis, the Court of Appeal found that the evidential burden had shifted to the Prosecution and thus it was “imperative” for it to call the owner of the motorcycle, who was a material witness: at [71]. (b) In the case ofNabill, the accused similarly faced a charge of drug trafficking. His version of events was that someone else had brought the drugs into his flat in a trolley bag. The Court of Appeal found his evidence to be consistent, as throughout all his statements, he maintained that he did not possess either the trolley bag or the drugs for the purposes of trafficking, and that he had sought to return them after finding them in the flat: at [97]–[102]. Thus, the court was satisfied that the accused’s defence had been “properly put in issue” and therefore, the evidential burden had shifted to the Prosecution: at [103]. In both cases, it is significant that the facts relied upon did not rest solely on the basis of the accused persons’ testimony. There were objective circumstances lending support to their version of the events. Further, the accused persons’ position had been consistent from the commencement of investigations right through to trial. Keeping these principles and examples in mind, I turn to the present case. The special relationship was “inherently incredible” in the present case 56 I found that the Prosecution did not have to call Wong, as the special relationship defence had not been properly put into issue by the respondent,ie, it was inherently incredible(situation (b) at [54] above). First, it was not clear on the evidencehowthe special relationship would affect JSPL’s procurement process. Second, there was no credible evidence supporting the existence of the special relationship. I consider each point in turn. (1) The mechanics of the special relationship were unclear 57 The respondent’s key assertion, as noted above at [7] and [50], was that there was no need for her to bribe anyone in JSPL, as Rainbow was assured of JSPL’s custom as long as she complied with the terms that were agreed under the special relationship. This would negate themens reaof the offence. The Prosecution’s case, as I have alluded to above, was that it was unclear on the respondent’s evidence why the special relationship would mean that she did not need to bribe anyone. 58 I agreed with the Prosecution. The major flaw in the special relationship defence was that the mechanics of the special relationship were phrased in overly general and ambiguous terms. It was thus unclear how the special relationship would influence the process of awarding contracts by JSPL, making it unnecessary for the respondent to bribe anyone in order to secure contracts and orders for Rainbow and DMH. If the special relationship truly did exist, the respondent should have been able to explain its mechanics and how it interacted with the Process in clearer terms. That she could not do so suggested to me that the special relationship was an afterthought conjured by the respondent,ie, it was inherently incredible in my view. 59 In understanding this, the commercial context was key. As noted above, Rainbow supplied JSPL with equipment and materials. JSPL, being a subsidiary of a large publicly listed company, had an intricate procurement process for awarding contracts to suppliers such as Rainbow (“the Process”). At trial, Koay explained the specifics of the Process as consisting of several stages: (a) First, it required the procurement officer, also known as a “buyer”, to issue a request for quotation to at least three suppliers. These suppliers were chosen based on JSPL’s approved supplier list, the product that was needed, and the supplier’s track record. (b) Second, when bids from the suppliers were received, an evaluation report was prepared and submitted by the buyer to the manager of the relevant section to select the successful bid. The report would contain a comparison table summarizing the bids received. (c) Third, after the successful bid had been selected, it would be sent to JSPL’s customer for whose benefit the contract was being awarded for approval, and following this, to JSPL’s management for final approval. Wong, as JSPL’s managing director, would be involved at this stage. (d) Fourth, after final approval was given by JSPL’s management, the buyer would create a purchase order in JSPL’s internal system. (e) Fifth, the purchase order would be submitted to the manager, the head of department and the finance department, in that sequence, for approval, before issuance to the supplier. 60 On the respondent’s case, a separate arrangement was in place with regard to Rainbow which completely bypassed the Process. As noted above at [7], according to the respondent, the arrangement was reached between Huan, Wong, and the then CEO of JSPL, KK Tan Senior in 2003 or 2004. Wong played an integral role under the arrangement which continued until 2013. The arrangement was initiated by Wong proposing that Rainbow gives up all its existing customers in return for being the exclusive supplier to JSPL. Under the arrangement, whenever an order was intended to be placed out by JSPL, Wong would ask JSPL’s staff to send an invitation to quote by email to the respondent. After the quotation was sent to JSPL, he would tell her if the price was too high and invite her to lower it to meet his expectations. If the respondent agreed, Rainbow secured the job. The respondent testified that she would negotiate with Wong over price, but would ultimately capitulate as JSPL was Rainbow’s only customer. As such, she invariably obliged and Rainbow would therefore secure the order. In short, under the special relationship, Rainbow was almost always guaranteed JSPL’s custom, and it was a win-win situation for both. 61 The difficulty with the respondent’s case was that it was not clear how the special relationship interacted and co-existed with the Process. Instead, it seemed that it had the effect of circumventing the Process completely. To test this, on appeal, the Prosecution posited three different scenarios and argued that in each case, the special relationship defence could not succeed: (a) In the first, Wong circumvented the Process in view of the special relationship. This would obviously require the various personnel in JSPL’s procurement department (who were involved in the various stages of the Process), to know about the special relationship and to be complicit in its implementation and the circumvention of the Process. However, the respondent had not put to any of the personnel who were called as witnesses that they knew of and implemented the special relationship, and that the Process had been circumvented. Significantly, this scenario would not gel with the respondent’s own evidence that only four people were party to and knew about the special relationship,ie, herself, Huan, Wong, and the former CEO of JSPL, KK Tan Senior. (b) In the second scenario, Wong actedwithinthe framework of the Process. The respondent had to ensure that her companies were positioned to reach the final stages of the Process where Wong was involved in terms of final approval being given for the order by JSPL’s management. The Prosecution pointed out, correctly in my view, that if this were the case, the respondent would “still have the incentive to grease the wheels of procurement” to get to the stage where Wong’s approval would be given,ie, themens reawould not be negated. (c) In the third scenario, Wong somehow rigged the Process such that it was “unknown to anyone in [JSPL’s procurement department]” that the respondent’s companies (Rainbow and DMH) would cruise to the final stages of the Process at which point, Wong would simply grant approval for the order. The thrust of the Prosecution’s submissions was that if this third scenario were the case, it was not clear how the Process had been rigged to favour Rainbow or DMH, as the respondent had not led any evidence to that effect. This point is more relevant to the Prosecution’s argument that there was a lack of credible evidence supporting the special relationship, a point that I agreed with (see [70]–[75] below). 62 Of course, the Prosecution’s argument would only have held water if the burden was on the respondent to explain the mechanics of the special relationship to begin with. I found that it was: the respondent had put the special relationship into issue by raising it in her testimony. She relied on its existence as a defence, and thus the burden would be on her to adduce sufficient evidence explaining how it worked, either in her own testimony, and/or by calling witnesses who could. However, on the evidence adduced, I did not think that the respondent had sufficiently explained the mechanics of the special relationship. It seemed to me that the special relationship was a vague afterthought fabricated by the respondent, and on this basis alone, the “special relationship” was not properly put into issue, that is, it was inherently incredible. (2) There was no credible evidence supporting the special relationship 63 Related to the above, I found that there was a dearth of credible evidence to support the existence of the special relationship. This, as the Prosecution submitted, suggested that the special relationship was simply an afterthought raised by the respondent. It follows that the respondent had not properly put the fact of the special relationship into issue, and had not discharged her evidential burden. (A) The respondent’s story was inconsistent and contradicted 64 To begin, it is important to note that it is not entirely accurate to say that there wasno evidencesupporting the special relationship as the respondent had testified under oath as to its existence. Thiscouldbe sufficient to discharge her evidential burden if she had been consistent in her stance (see the cases referenced above at [55]). However, there was evidence that made me question the credibility of her testimony on the special relationship. 65 Significantly, her testimony was at odds with her statements to the CPIB on 3 June 2014, where she was questioned about her “relationship and dealings with [Wong]”. She stated that she was “not close to [Wong]” and that they were “not friends and [did] not stay in contact”. Clearly, this contradicted her testimony on the special relationship defence. This stands in stark contrast toBeh Chew BooandNabill, where the accused persons’ evidence on the stand was consistent with what they had said in their investigative statements. 66 The respondent attempted to explain this discrepancy at trial. She testified that she felt she had “caused a lot of trouble for a lot of people”, and did “not want to implicate [Wong]” and “just wanted to protect him”. The Judge found this to be “cogent and compelling”, accepting the explanation offered: GD at [37]. I did not agree. For one, if troubling and implicating Wong was truly a concern to the respondent, she would not have changed her mind and raised the special relationship as a defence at trial. In deciding to do so, she must have anticipated that Wong would be implicated. Further, it is difficult to understand what “trouble” and “implication” the respondent was referring to. It is not suggested that the special relationship was illegal or at the very least improper. On the respondent’s case, this was a legitimate arrangement put in place by JSPL’s senior management to safeguard its interests. Even if, as the Judge had observed at [37] of the GD, there were “possible reputational risks that could arise out of involving Wong”, it would be difficult to accept that the respondent would have seen that as relevant when she was being investigated by the CPIB – the game was up at that point and she was facing potentially dire consequences. Notably, she had ample time to raise the special relationship with the CPIB. The investigations started in 2013, and trial only began in 2017. In that period, she could have sought Wong’s views on whether he would be uncomfortable if she disclosed the special relationship. Her silence in this context is inexplicable. 67 This brings me neatly to the next point. The very first suggestion of the special relationship defence was only made during the respondent’s examination-in-chief on 21 November 2018. If it really was indeed the case that Rainbow was guaranteed JSPL’s custom as result of the special relationship, its relevance to the charges the respondent faced would have been crystal clear to her. After all, the special relationship defence went to her state of mind in giving the gratification that was the subject matter of the proceeded charges. Yet, she had specifically contradicted its existence when she denied any relationship with Wong in her investigative statements. This, in my mind, raised serious questions as to the credibility of the respondent’s assertion that the special relationship existed. 68 In addition, there was other evidence that contradicted her testimony. First, there were the communications with personnel in JSPL’s procurement department. These communications involved the respondent informing them of problems she was facing and asking for their assistance (see for example below at [109]–[110]). It would not have been necessary for the respondent to have raised her problems with the JSPL procurement department. On her case, she would have gone straight to Wong for help. In fact, if the special relationship existed, many of these problems would not have arisen as they pertained to pricing, an issue which the special relationship was meant to address. 69 Finally, I did not agree with the respondent’s argument that Huan’s testimony supported the existence of the special relationship. (a) First, nowhere in Huan’s testimony does he define the special relationship in a manner consistent with her description. All his testimony demonstrated was that: (a) as JSPL was focused on getting lower prices, Rainbow was more likely to win contracts if its prices were lower; and (b) Rainbow agreed to supply JSPL exclusively on the condition that JSPL would try and give it more projects. First, there is nothing “special” about Rainbow trying to price competitively – this is inherent in the Process which involved bids from competing suppliers. Second, as articulated by Huan, JSPL would only try andprioritiseRainbow by giving them more projects. This is not the same as the special relationship which, if it existed, meant that Rainbow wasguaranteedJSPL’s business. (b) Second, Huan’s testimony actually contradicted the existence of the special relationship. For one, he testified that the principal consideration of JSPL was price, and that there was even an occasion where JSPL stopped buying from Rainbow because they found another supplier who quoted a cheaper price. Huan’s testimony also specifically contradicted the mechanics of the special relationship. When cross-examined on “[JSPL’s] purchasing procedure”, he testified that the “normal procedure” was that JSPL would send Rainbow a request for quotation, Rainbow personnel would reply, and JSPL would come back to them with a target price. Importantly, he testified that neither he or the respondent were directly involved in providing the quotes, and that it was mainly Rainbow’s staff that dealt with JSPL – whilst they were consulted from time to time, neither he or the respondent played a direct role in the procurement process. This is a far cry from the respondent’s articulation of the special relationship where she was heavily involved in the negotiation process. Thus, Huan’s testimony regarding Rainbow’s business with JSPL was more in line with the Process (as noted above at [59]) than it was with the special relationship. That his evidence did not align with the respondent’s is especially damning considering that the respondent’s case was that Huan was one of four people who knew about the special relationship. (B) No other evidence supported the respondent’s testimony 70 Given that the respondent’s testimony was contradicted by other evidence, the burden was on her to have adduced evidence that lent support to the existence of the special relationship. On appeal, the respondent aligned herself with the Judge and argued that therewasevidence that supported the special relationship. The Judge had relied on two exhibits, Exhibits D30 and D75 (GD at [25]–[28], [29(c)]), as well as portions of the respondent’s testimony (GD at [29(a)–(b)]). However, I found the Judge’s reliance to be misplaced. 71 Exhibit D30 was an email from Wong to the respondent in July 2003, where he wrote: Dear Rina Please see the attachment for the advance information for “Top Up Qty”. Your supply exclude all CCS, Mariloy, and CuNi piping only. Others please check ETA and fill up the missing unit weight i.e. kg/m for piping and kg/piece for fittings. Tan Kim Kian will send you the official document for Request for Qoutation [sic]. You repyl [sic] in according to that format to him. WS Wong The Judge found that there were “somewhat unusual features inherent” in Exhibit D30, calling it an example of Wong extending “advance information to [the respondent]”. He also pointed out that it had come from Wong’s private email address: GD at [26]. On this basis, he found that Exhibit D30 corroborated the existence of the special relationship. 72 The difficulty with the Judge’s reasoning is that, on the respondent’s own evidence, the email was sentpriorto the special relationship being formed pursuant to the arrangement referred to above at [60]. As such, it could not be taken to be corroborative of the same. Furthermore, even if the email had come after the formation of the special relationship, it was ambiguous on its face; as stated by the Judge, it called for an explanation by Wong: GD at [26]. However, the burden was not on the Prosecution to call Wong. Since the respondent adduced Exhibit D30 and sought to rely on it, she should have called Wong to clarify any latent ambiguity. 73 Similarly, I found that Exhibit D75 did not corroborate the existence of the special relationship. To begin with, this exhibit was not a communication with Wong. Rather, it was a series of text messages between the respondent and Ng, who was working in the procurement department of JSPL at that time. The conversation centred around her husband, Chan, who at the time was an assistant section manager in JSPL’s procurement department. In those messages, the respondent told Ng that she had informed Wong that Chan should be promoted. The Judge reasoned that Exhibit D75 was evidence that there were communications between Wong and the respondent on matters internal to JSPL which she would not ordinarily be involved in: GD at [29(c)]. 74 This reasoning, with respect, is tenuous at best. Rainbow had substantial business with JSPL. It followed that the respondent would have been in contact with JSPL’s management, including Wong and Chan. It is therefore difficult to understand how a suggestion by the respondent to Wong that Chan should be promoted supported the assertion that the special relationship existed. The respondent would have dealt with Chan and if he had impressed her, she might very well have dropped a kind word in Wong’s ear about him. There was nothing in the text messages that supported the existence of the special relationship. Thus, as was argued by the Prosecution on appeal, the Judge had made a leap of logic to arrive at the conclusion that Exhibit D75 supported the existence of the special relationship. 75 In short, I found that the Judge had erred in relying on Exhibits D30 and D75 as support for the existence of the special relationship. Without these, there was no documentary evidence that supported the existence of the special relationship. This marked lack of documentary evidence was troubling. The special relationship allegedly lasted for about ten years (from around 2003 or 2004 to 2013). Wong supposedly communicated directly with the respondent on each occasion an order was planned pursuant to the special relationship. The evidence shows that the business volume between Rainbow and JSPL was enormous; between 2007 to 2013 the total annual purchase order value between JSPL and Rainbow ranged from S$21 million to S$84 million. Thus, taken together, one would expect fairly significant evidence of communications between Wong and the respondent on the contracts that were awarded to Rainbow – that would be consistent with the existence of the special relationship. Instead, as noted above at [68], the only communication in evidence involved the respondent asking for help from personnel in JSPL’s procurement department. 76 Finally, I found that the Judge had erroneously relied on the respondent’s testimony regarding losses incurred by Rainbow and DMH as being corroborative of the existence of the special relationship. In her examination-in-chief, the respondent testified that: (a) Rainbow had been asked to supply JSPL with a product called “UNS”, and that it had then placed an order for US$500,000 worth of UNS. However, JSPL ultimately decided it wanted to be supplied a different product, and the UNS was not therefore used by JSPL. To this day, the UNS remains stored in Rainbow’s warehouse. This was because Wong had told the respondent that it might be utilised for future projects. In support, the respondent tendered Exhibit D66, a photo of the stock of UNS in Rainbow’s warehouse. (b) DMH had incurred losses of S$1m in respect of projects in 2013 because Wong had instructed her to help JSPL break a monopoly held by another company called Emerson over the provision of certain ship-related components and systems. The Judge was of the view that it would not have made sense for the respondent to have allowed Rainbow or DMH to incur such losses unless the special relationship existed,ie, he took this as corroborating the existence of the special relationship: GD at [29(b), (c)]. 77 I found the Judge’s reasoning to be flawed. Aside from the respondent’s testimony, there was no evidence to show that Rainbow and DMH had incurred these losses on Wong’s instructions. Further, even if it is accepted that Rainbow and DMH had incurred these losses at the behest of Wong, it did not immediately lead to the conclusion that the special relationship existed. As the respondent testified, JSPL was Rainbow’sonly customer. Rainbow’s actions could thus be explained by it wanting to ensure that it kept its sole customer happy in order to preserve its custom. These alleged losses must be seen against the volume of business that Rainbow received from JSPL annually,ie,between S$21 million to S$84 million as noted above at [75] – it would not be a stretch to conclude that Rainbow was willing to take a combined loss of less than S$2m to ensure its multi-million dollar business with JSPL was not compromised. Conclusion: the Prosecution did not bear the burden of calling Wong 78 From the foregoing analysis, it is clear that this was not a case at all similar to, for example,Beh Chew BooorNabill. The special relationship defence had only been raised at trial, the respondent was not consistent on its existence, and it was completely unclear as tohowthe special relationship worked. Most importantly, its existence was not supported by the documentary evidence relied upon, and in many instances, was plainly contradicted by the evidence adduced at trial. It was nothing more than a broad, unsubstantiated assertion, that was, for all intents and purposes, inherently incredible. Accordingly, I found that the Judge had erred in finding that the respondent had met her evidential burden and properly put the existence of the special relationship into issue. It follows that the Prosecution did not have to call Wong to rebut its existence, and its failure to do so was not fatal to its case.",
        "Did the respondent give the gratification with corrupt intent?": "79 Having found that the respondent had not discharged her evidential burden regarding the special relationship, I turn to analyse themens reaof the charges. As noted above at [47], in order for themens reato be made out, the respondent must have given the gratification as an inducement, the transaction must have been tainted by an objectively corrupt element, and she must have subjectively known this. 80 In the present case (and in the absence of the special relationship), if the respondent gave gratification with the motive of inducing the recipients to act in a way with regard to JSPL’s affairs that favoured the business interests of Rainbow and DMH, this would automatically taint the transactions with an objectively corrupt element (as noted above at [48]). The respondent was involved with two different companies, Rainbow and DMH. Both were interested in contracts from JSPL, the company where the targets of the various gratifications worked. Indeed, they worked in the very department – the procurement department – that decided to which suppliers contracts were to be awarded. If she had given the gratifications with the motive of inducing the recipients, this could only be for the purpose of favouring her business interests over competitors’. This would be a paradigm case of corruption:Leng Kah Pohat [23]. 81 Further, assuming that the transactions were tainted with an objectively corrupt element, it could not be seriously argued that the respondent did not subjectively know this. She is an experienced business woman who had many years in the industry. It would be difficult to imagine that she did not understand that gifts for the purpose of inducing others into favouring her business interests would be corrupt. Indeed, common sense would suggest that this is wholly inappropriate conduct. In fact, there was evidence that showed she was aware that the gratifications she had given could be perceived as corrupt by others (see [100] below). 82 What this meant was that, with regard to themens reaof the offence, the key question in the present case was the respondent’s intent. Indeed, case law has recognised that corruption is often a “question of intention”:Public Prosecutor vLow Tiong Choon[1998] 2 SLR(R) 119 at [29]. Thus, the question here was: did the respondent give the various gratifications with the intention of inducing the various personnel in JSPL’s procurement department to favour her business interests? 83 I found that the evidence showed that this was indeed her intention for the remaining charges. On a broad level, the fact that the respondent had given gratification to several personnel, most of whom were in JSPL’s procurement department, suggested that her intentions were not innocent. What is even more telling is that four of the receivers of the gratification were in a position to influence the award of contracts, being in management roles. That said, this, without more, is not conclusive of guilt. It might be the case that the respondent, through her legitimate dealings with JSPL, had become friends with the various recipients and given the gratifications out of friendship. 84 Indeed, aside from the special relationship defence, this was what the respondent argued as a general defence to the charges. However, friendship, by itself, cannot be a defence to charges of corruption, as “it must not be forgotten that such alleged relationships are also often guises for corrupt payments”:Sairi bin Sulaiman v Public Prosecutor[1995] 2 SLR(R) 794 at [40]. In the end, much will turn on the particular facts of each case, and more frequently than not, the facts speak for themselves. In the present case, I found that the facts didnotspeak to the respondent giving the various gratifications out of friendship. Rather, the facts spoke to the respondent having given gratification in relation to the 1st, 2nd, 3rd, 4th, 5th, 6th, 8th and 11th charges with the intention of inducing the receivers into favouring her business interests. The 1st and 2nd charges 85 With regard to themens reafor the 1st and 2nd charges, the respondent’s defence was that the opportunity to invest was given to Chee and Tan due to their friendship, that is, there was no ulterior motive. However, the evidence suggested to me that the intention behind the gratification was to induce Chee and Tan into favouring the business interests of Rainbow. 86 At that time, both Chee and Tan were in high positions in JSPL’s procurement department, and the respondent had an interest in winning them over for the purposes of advancing Rainbow and DMH’s business interest. Was this her intention? 87 It was clear from the respondent’s actions that this was indeed her intention. Apart from the fact that the respondent gave Chee and Tan the opportunity to purchase her shares in Golden Oriental in the expectation that they would make a significant return on their investment, it is significant that the respondent repaid Chee and Tan in January 2009 when she became worried that their investment would fail. In 2010, the Chairman, who was also Golden Oriental’s major shareholder, absconded with most of the money, causing the respondent to lose about S$13m. Of this, S$500,000 related to the shares that Chee and Tan had purchased. In other words, the respondent absorbed a loss that Chee and Tan would have otherwise had to bear themselves. If these were arms-length purchases by Chee and Tan, there would be no reason for the respondent to have repaid them and absorbed the loss. The respondent would have been as much a victim as Chee and Tan. In this regard, it is relevant that the trust deeds signed by the respondent, Chee and Tan provided that the investment risk lay with Chee and Tan. The fact that the respondent had nonetheless absorbed the loss suggested that she intended to give Chee and Tan a risk-free investment opportunity and had absorbed the loss to keep herself in their good books. 88 On appeal, the respondent attempted to reframe the reason for the repayment of the money to Chee and Tan. She submitted that Tan had wanted to be repaid because he wished to purchase a property. As such, it was Chee and Tan who asked to back out of the purchase. At trial, the respondent adduced an email that was marked Exhibit D11. This was dated 14 January 2009 and was from TSY to the respondent. Attached to it was a draft agreement where the respondent and Tan were named as the parties. The agreement stated that Tan had informed the respondent of his intention to purchase a property and wanted to forego his rights to the Golden Oriental shares in exchange for his investment sum of S$200,000. However, this was an unsigned draft, and no signed copy was produced by the respondent at trial. If there truly was an agreementperExhibit D11, surely a signed agreement would have been produced by the respondent. That no such document was produced cast doubt on the veracity of Exhibit D11. Furthermore, crucially, Exhibit D11 was never put to Tan. Indeed, Tan unequivocally denied that he had withdrawn from the investment because he wished to purchase a property; instead, he testified that he had withdrawn because the respondent told him that the investment had not worked out. As such, it remained that the respondent had helped Chee and Tan withdraw from the investment in an attempt to keep herself in Chee and Tan’s good books, speaking to her true intention. 89 Significantly, the documentary evidence indicated that Chee and Tan had shown favour to the respondent. Exhibits P82 to P96, which were 15 JSPL purchase orders for transactions with Rainbow, were pertinent in this regard. The gratification in relation to Chee and Tan was given on 11 April 2008, andmost of these purchase orders had been created or keyed-in after that date. Both Chee and Tan’s signatures were present on these purchase orders, and Tan had testified that when a purchase order was created, he and Chee would provide two levels of check. 90 Several discrepancies present in the 15 purchase orders (as explained below at [92]) suggested that Chee and Tan might have shown favour to Rainbow, and hence acted in a manner that furthered the business interests of the respondent. On appeal, my attention was drawn to the fact that the prices of certain items in the purchase orders had been “marked up”,ie, the price of certain products that Rainbow supplied to JSPL had beeninflated. The Prosecution produced a table of the 15 purchase orders and included a comparison of the regular price and the “inflated price”. It was clear from this table that there were indeed increases in the price quoted for the 15 purchase orders. For example, in Exhibit P88, a purchase order created on 13 March 2008 (before gratification was given to Chee and Tan), the unit price of three items were US$114.99, US$146.19 and US$177.19. Then, in Exhibit P87, a purchase order created on 13 September 2008 (after gratification was given to Chee and Tan), the unit price for these same items were now US$142.71, US$170.56 and US$209.41 respectively. Thus, there was a suggestion that this markup was a result of the gratification given to Chee and Tan. 91 The respondent accepted that the mark ups had occurred, but argued that there was “nothing sinister” about the purchase orders and that the discrepancies were explicable. She argued that such increases were not unusual and could be explained by commercial factors. To begin, it was clear from various witness testimony that the price variance was minimal. A former JSPL employee, Wang Zi Jian, was called by the defence and testified to this effect. He was not implicated in any of the offences and thus had no reason to downplay the mark ups. Further, the evidence at trial was that changes in price could be explained by a variety of factors such as the cost escalation of raw materials, how urgently the product was required, and whether it needed to be flown in from a different country. I therefore found the mark ups to be equivocal as to whether any favour was shown by Chee and Tan to the respondent. 92 Having said that, in my view, the difference in price was not the main point. Whatwasof importance was the fact that the Process was deviated from in issuing the purchase orders. The Process was not followed from the very beginning with regard to these 15 purchase orders. In particular, there was a lack of supporting quotations from other suppliers, and an absence of a comparison table showing the different quotes that were received. This was crucial. It showed that when creating these purchase orders, no other candidates were considered by Chee and Tan other than Rainbow,ie,the respondent’s business was prioritised, and her business interests were advanced. The respondent argued that competing quotes might not be obtained in “certain emergency” situations. However, there was no evidence to show that any of the 15 purchase orders were created in such circumstances. It thus remained the case that these purchase orders had been created without supporting quotations, violating the Process without good reason, with the consequence that only the respondent’s business was considered. 93 It must be remembered that on the respondent’s case, Chee and Tan did not know about the special relationship. Thus, they had deviated from the Process of theirown volitionand the only possible explanation for this was the gratification that had been given to them by the respondent. In response to this, the respondent drew attention to the fact that the purchase orders were signed by Wong, and that he would not have done so if there were any improprieties. However, as I pointed out, this came near the end of the Process, and it did not mean that Wong knew that some or all of the various stages in the Process had not been adhered to. 94 Read altogether, it is clear that the opportunity to invest in Golden Oriental was intended as an inducement to win favour from Chee and Tan. As noted above, given the context of the supplier-buyer relationship between Rainbow and JSPL, this would taint the transaction with an objectively corrupt element. This was recognised by Chee who testified that he should have disclosed the purchase of shares from the respondent to JSPL’s management. As noted above at [81], the respondent subjectively knew that gifts given with the motive of inducing JSPL employees into favouring her business would be tainted by an objectively corrupt element. Accordingly, I found themens reaof the 1st and 2nd charges to be established beyond a reasonable doubt. The 3rd charge 95 The subject of the 3rd charge was Koay. As noted above at [12], the gratification was not disputed by the parties. The gratification was a holiday to Japan in December 2011 for Koay and his family (“the December 2011 trip”), paid for by the respondent. Whilst the respondent admitted to paying for the holiday, she explained that she did this because she and Koay were friends and she was worried about his health. She also attempted to justify the holiday on the basis that she was grateful to Koay, as he had given her a loan in the past, and sold her his house in Malaysia at an undervalue. 96 I found none of these reasons to be convincing. Even if I accepted that the respondent and Koay were friends, this was by itself not a defence to a charge of corruption (as noted above at [84]). Treating it as such would have ignored the fact that Koay was in a position to influence the award of contracts to Rainbow and that the gratification from the respondent would have suborned his loyalties to JSPL. Furthermore, I rejected the respondent’s evidence that she had felt indebted to Koay for the loan and the sale of the house for two reasons. First, Koay and the respondent had testified that she had already repaid the loan. As such, there was nothing left for her to feel indebted over. Second, there was no evidence that Koay had sold the respondent the houseat an undervalue. In fact, Koay’s testimony was that he thought that he had sold the house at a fair price. This being the case, it was difficult to understand why the respondent would feel any debt of gratitude to Koay. Importantly, I found it relevant that these events happened years before the respondent had paid for Koay’s holiday. Thus, this made it doubtful that the holiday was given out of gratitude for these two acts, given the passage of time. Overall, I could not accept the respondent’s explanations for the gratification she had given Koay. 97 On the other hand, the Prosecution adduced evidence to show that the respondent had given gratification to induce Koay into helping her advance Rainbow’s business interests with JSPL, thus tainting the transaction with an objectively corrupt element. For example, there were emails sent by the respondent to Koay on several occasions that evidenced her asking if Rainbow could be invited to quote for contracts by JSPL. Although these emails were all sent between January to October 2010, prior to the gratification being given, they showed that the respondent had already been asking for favours from Koay. Importantly, the respondent persisted in asking for favoursafterthe December 2011 trip. For example, Exhibit P104 was an exchange between the respondent and Koay on WhatsApp that showed the respondent asking Koay for help in March 2013 regarding a supply issue that DMH had. 98 Most concerning was Exhibit P101, which was also an exchange over WhatsApp between Koay and the respondent. This exchange began with the respondent telling Koay about an issue she was having with an employee of JSPL, Jason Peh (“Peh”). In the messages, she told Koay that Peh was asking her lots of questions about a product, and she asked Koay why this was happening. When she did not receive a reply, she messaged him saying that she knew that he had read her message, before asking him when she could bring his family overseas again. She told him that she and her family were going to Japan in October. Koay eventually replied over an hour later, explaining why Peh needed to ask these questions. 99 Two points are apparent from Exhibit P101. First, to state the obvious, the respondent was asking Koay for information and advice regarding a problem she was having,ie, she was trying to advance her business interests. Second, the messages show that she had pestered Koay into giving her this information, and when she saw that Koay had seen her message and not replied, she brought up further trips overseas and reminded Koay of the previous trip as well. The upshot of this was that she was reminding him of her prior gratification and offering new trips so that he would reply and help with her problem. This suggested that the respondent’s intention in paying for the December 2011 trip was to serve as an inducement for Koay to advance her business interests. 100 This suggestion was solidified by Exhibit P161, an email that showed that the respondent wanted to keep Koay’s trip to Japan,ie,the December 2011 trip, a secret from others. This email was between the respondent and a Rainbow employee, “Saleen”. The subject of the email was, quite clearly, the December 2011 trip, as it was dated late November 2011, days before the trip, and there were multiple mentions of applying for a Japanese visa. Importantly, in the email, the respondent told Saleen that the trip was highly confidential, and that if anyone else found out, there would be a problem. This showed that the respondent had an ulterior motive in paying for the trip – if it was an innocent trip, she would not have acted in such a furtive manner. 101 It is clear from the above that the respondent had paid for the December 2011 trip for Koay with the intention of inducing him into furthering her business interests. Further, it is clear from Exhibit P161 that she was wary of the improper nature of this transaction,ie, she was subjectively aware. As such, I found that themens reafor the 3rd charge had been established by the Prosecution beyond a reasonable doubt. The 11th charge 102 On themens reafor the 11th charge, the respondent argued that the intention in offering employment to Lau was not for any corrupt purpose, as the whole reason for DMH offering Lau a job was because it (and Huan) needed a replacement project manager. This argument was premised on my accepting that the offer had come from Huan. Having rejected this above at [21], this argument would similarly fail. 103 In any case, on the evidence before me, it was clear that the respondent had offered Lau employment with the intention of obtaining information regarding projects being undertaken by JSPL that involved a company known as ProSafe (“the ProSafe Projects”). Exhibit P140 showed that, a month after the respondent offered employment to Lau, they had discussed the affairs of JSPL with regard to the ProSafe Projects. Further, Exhibit P144 showed that this continued into April 2013, effectively putting Lau in a position of conflict of interest while he was still a JSPL employee. Lau was eventually hired on 7 May 2013, and by July 2013, DMH had secured the ProSafe Projects, as evidenced by two signed contracts. 104 It is clear from the above that the respondent had offered Lau employment with DMH with the intention of obtaining information concerning the ProSafe Projects, thereby advancing DMH’s business interests. This, read with the conflict of interest that Lau had placed himself in, tainted the entire transaction with an objectively corrupt element. As I have already stated above at [81], it was clear that the respondent was subjectively aware that such transactions would be tainted by an objectively corrupt element. Accordingly, themens reaof this charge was also fulfilled. The 4th, 5th, 6th and 8th charges 105 Having found that theactus reusof gratification was not established for the 7th and 10th charges, only themens reaof the 4th, 5th, 6th and 8th charges required consideration. I found that the gratifications in relations to these charges were a series of gifts intended to induce Chan and Ng to show favour to Rainbow and/or DMH in its dealings with JSPL . 106 For a start the sheer volume of gratification indicated that the respondent had been acting with an ulterior motive. The respondent faced four charges in relation to Chan and Ng alone. In aggregate, the monetary value of the gratification was in the thousands. For example, with regard to the 4th charge alone, the respondent had spent S$2,877.10 (see above at [24(a)]). These were not insignificant sums. They suggested an intention to induce Chan and Ng. 107 It is pertinent that the showering of gratification only started after Chan was in a position to influence the award of contracts.Chan was promoted in July 2011 to Assistant Section Manager in JSPL’s procurement department. The timing of the 4th charge, only a few months later in October 2011, suggested to me that the respondent had given the gratification because of Chan’s new position. There was no evidence of gifts or friendship between them prior to Chan’s promotion. The fact that the giving of gratification only started afterwards is suggestive of her corrupt intent. 108 Next, there was questionable behaviour from the respondent, such as her suggestion that she and Huan accompany Chan and Ng on their honeymoon in relation to the 6th charge (see [32] above). This was odd behaviour, particularly as Chan and Ng testified that they did not want the respondent and Huan to join them on the trip. This does raise the question as to whether the respondent was trying to insert herself into the lives of Chan and Ng, so that she was in a position to win their favour in order to advance Rainbow’s business interests. 109 Finally, the intent behind the giving of these gratifications is evident from the numerous instances where the respondent asked Chan and Ng for favours. For example, Exhibit P130 was a text conversation between Ng and the respondent where she asked Ng for information regarding the price that a competitor had offered JSPL. This would have given her a competitive edge and evidently she had asked this with the intention of advancing her business interests. Significantly, this had taken place on 3 May 2013, only a few days after they had returned from their second trip to Korea (see above at [24(b)]). This suggested that the trip had been given as an inducement with the intention that Ng would help her advance her business interests. 110 Even more significant were the exchanges with Chan, who was in a higher position than Ng. These exchanges showed the respondent asking Chan for favours, and Chan capitulating. For example, Exhibit P122 evidenced the respondent asking Chan to take a competitor out of the bidding process in the future. The most important of these exchanges was on 23 July 2013 where Chan had given the respondent advice on how to present her prices. This was evidenced by Exhibits P124 and P100. Exhibit P124 begins with Chan telling the respondent to check her email. Importantly, he tells her that he had sent it from his “hotmail” account and asked her not to reply. This was a reference to Exhibit P100, which was an email sent from Chan’s personal account, containing two attachments which were detailed price lists from JSPL’s suppliers including Rainbow. Some of these prices were highlighted, and in the email, Chan told the respondent that these highlighted prices needed to be matched by Rainbow so that they could be given the contracts. This was confirmed by Chan in his testimony where he admitted that he had given the respondent information on the price that other competitors had quoted at. It is also significant that Koay, when showed this exhibit, testified that this should not have been shown to the respondent. Returning to Exhibit P124, Chan told the respondent that as long as Rainbow’s figures matched, it would get the contract. Thus, in short, Chan was giving the respondent advice and information on how to secure custom from JSPL. 111 It is clear that the respondent had intended to give the various gratifications to Chan and Ng for the purpose of inducing them into favouring her business interests. This tainted the transaction with an objectively corrupt element as it gave her an unfair advantage as compared to her competitors. There was no doubt in my mind that the respondent subjectively knew that such actions were improper (see [81] above). That this was the case was further evidenced by the furtive nature of her communications with Chan in Exhibits P100 and P124. Thus, I found that themens reafor the 4th, 5th, 6th and 8th charges had been proven beyond a reasonable doubt.",
        "Conclusion": "112 To conclude, I allowed the appeal on the 1st, 2nd, 3rd, 4th, 5th, 6th, 8th and 11th charges and found the respondent guilty on those charges. The appeal as regards the 7th and 10th charges were dismissed. I directed submissions on sentence. Kannan RameshJudge of the High Court  Jiang Ke-Yue, Jasmin Kaur and Cheng Yuxi (Attorney-General’s Chambers) for the appellant; Michael Khoo Kah Lip SC and Josephine Low Miew Yin (Michael Khoo & Partners LLC) (instructed), Nakoorsha Bin Abdul Kadir (Nakoorsha Law Corporation) for the respondent."
    }
}