{
    "case_title": "Mercantile & Maritime Investments Pte LtdvIceberg Energy Pte Ltd and another matter",
    "ncitation": "[2022] SGHC 64",
    "coram": "Ang Cheng Hock J",
    "sections": {
        "Background": "",
        "The parties": "2 The plaintiff, Mercantile & Maritime Investments Pte Ltd (“MMI”), is part of the Mercantile & Maritime group of companies (“the MM Group”), which does business in the physical trading of oil and gas, shipping and logistics for crude oil.1Foot Note 1×4th Affidavit of Mr Anshuman Ghai (“Mr Ghai’s 4th Affidavit”) at para 10. 3 The defendant, Iceberg Energy Pte Ltd (“IEL”), is a Singapore-incorporated holding company with business interests in Myanmar.  It owns a 35% stake in Iceberg Energy Co Ltd (“IECL”) and a 98.72% stake in AG Asset Management Co Ltd, both of which are Myanmar-incorporated companies that operate in Myanmar.2Foot Note 2×3rd Affidavit of Mr Anshuman Ghai (“Mr Ghai’s 3rd Affidavit”) at para 1The sole director and shareholder of IEL is one Mr Anshuman Ghai (“Mr Ghai”).3Foot Note 3×Mr Ghai’s 3rd Affidavit at para 1.",
        "MMI’s winding-up application in May 2021": "4 On 24 May 2021, MMI filed Companies Winding Up No 81 of 2021 (“CWU 81”) to wind up IEL.  I heard CWU 81 on 14 July 2021 (“the 14 Jul Hearing”) and ordered that IEL be wound up at the conclusion of the hearing. 5 The relevant material that had been placed before the court as at the time of the 14 Jul Hearing were as follows.  From September 2019 to January 2020, Mercantile & Maritime Trading Pte Ltd (“MMT”), an affiliate company of MMI, extended two loans to IEL.  The first of these was a convertible loan agreement entered into on 30 September 2019 under which MMT lent IEL a sum of US$250,000.  The second of these was a loan agreement entered into on 17 January 2020 (“the January Loan”) under which MMT lent IEL a further sum of US$500,000.  The January Loan also consolidated the principal under the convertible loan agreement without interest.4Foot Note 4×1st Affidavit of Mr Zaen Hamid (“Mr Hamid’s 1st Affidavit”) at p 31. 6 On 25 February 2020, MMI lent IEL a sum of US$860,000 (“the Loan Facility”).  The Loan Facility between MMI and IEL also consolidated the principal sum (of US$750,000) under the January Loan without interest.5Foot Note 5×Mr Hamid’s 1st Affidavit at p 20.The Loan Facility was therefore for a total sum of US$1.61m (“the Loan Sum”).  Clause 19 of the Loan Facility provided that it was governed by Singapore law, and “[a]ny dispute or claim arising out of or in connection with” the Loan Facility was to be referred to and resolved by arbitration in Singapore in accordance with the rules of the Singapore International Arbitration Centre.6Foot Note 6×Mr Hamid’s 1st Affidavit at p 22.Clause 6 of the Loan Facility provided that IEL should repay MMI the Loan Sum and all accrued interest within 30 business days from the date of a written notice from MMI to IEL demanding the repayment amount or on 1 August 2020, whichever is earlier.7Foot Note 7×Mr Hamid’s 1st Affidavit at para 13. 7 According to MMI, it had contemplated making an equity investment of US$7.5m in IEL (“the Proposed Investment”).  The Proposed Investment was meant to support IEL’s business of operating fuel stations in Myanmar, which the parties also described as “the Retail Project”.8Foot Note 8×Mr Hamid’s 1st Affidavit at para 15.It is not disputed that, separate from the Retail Project, the MM Group also collaborated with Mr Ghai in relation to the development of a wholesale fuel business in Myanmar, which will be referred to later in these grounds of decision (see [35] below). 8 In connection with the Proposed Investment, MMI and Mr Ghai executed a letter of intent (“the Letter of Intent”) on 13 August 2020, which set out the framework for the Proposed Investment.9Foot Note 9×Mr Hamid’s 1st Affidavit at para 15.MMI drew the court’s attention to two parts of the Letter of Intent: (a) item 4 of the Letter of Intent, which provided that, when the Proposed Investment was finalised and completed, the amount outstanding under the Loan Facility including accrued interest would be netted against the US$7.5m which MMI had to pay IEL pursuant to the Proposed Investment;10Foot Note 10×Mr Hamid’s 1st Affidavit at para 16; p 37.and (b) item 32 of the Letter of Intent, which provided that several terms in the Letter of Intent (including item 4) were not intended to be legally binding.11Foot Note 11×Mr Hamid’s 1st Affidavit at p 45. 9 According to MMI, it was envisaged that a subscription and shareholder’s agreement and/or relevant investment documentation in respect of the Proposed Investment would be entered into 180 days from the date of the Letter of Intent.12Foot Note 12×Mr Hamid’s 1st Affidavit at para 17.Item 26 of the Letter of Intent also stated it was to expire 180 days following the date of the letter.13Foot Note 13×Mr Hamid’s 1st Affidavit at p 44.On 10 February 2021, parties agreed, by way of a supplemental letter, to extend the term of the Letter of Intent to 9 May 2021 (“the Supplemental Letter”).14Foot Note 14×Mr Hamid’s 1st Affidavit at para 18.The Supplemental Letter meant that parties now had until 9 May 2021 to enter into the relevant agreements for the Proposed Investment.  However, no such agreement was eventually entered into by the parties.15Foot Note 15×Mr Hamid’s 1st Affidavit at para 19. 10 In the meantime, on 6 April 2021, MMI issued a letter of demand to IEL (“the Letter of Demand”).  In the Letter of Demand, MMI stated that it understood that IEL no longer wished to collaborate, and that the parties’ collaboration on the Retail Project would not proceed.  It demanded that IEL repay the Loan Sum and outstanding interest as of 31 March 2021, which amounted to US$2,407,626.66 by 13 April 2021.16Foot Note 16×Mr Hamid’s 1st Affidavit at para 20. 11 On 8 April 2021, IEL replied by e-mail to the Letter of Demand (“the 8 Apr E-mail”), stating:17Foot Note 17×Mr Hamid’s 1st Affidavit at para 21; 1st Affidavit of Anshuman Ghai (“Mr Ghai’s 1st Affidavit”) at pp 30-31. … [Mr Ghai] has never expressed that he does not wish to collaborate … with MM group [sic] on [the Retail Project] involving the fuel stations in Myanmar, but he has repeatedly requested that the outstanding matters under wholesale business is to be settled before any discussion on [the Retail Project] is resumed (if any). It isnotour intention to withhold the payment in terms of the loan agreement. However, … there is outstanding amount to be settled between MM Group and [IEL] for wholesale business as well. We owe you to present that number which we believe is fair to both side [sic] … we do expect that our team will be able to arrange for the breakdown to be finalized by latest 20th April 2021 and shared with [the MM Group]. As to how [the MM Group] wishes to settle the amount alongside the sums owed in relation to the loan sum can be discussed / agreed at that point in time. Please do appreciate that even though wholesale and retail arrangements are under two separate legal documents, but ultimately it involves the same principal (i.e. [Mr Ghai] and [the MM Group]) and the said nexus was duly reflected in our executed documentation. We agree that it is in our mutual interest to resolve the outstanding issues in an amicable manner. Hence, please wait until 20th April 2021 and we can get on a call to discuss the proposed amount together with settlement mechanism. [emphasis in original] 12 On 9 April 2021, MMI replied to IEL’s e-mail and reiterated that IEL make payment of the sum claimed in the Letter of Demand by 13 April 2021.18Foot Note 18×Mr Hamid’s 1st Affidavit at para 22.IEL did not make payment.  On 14 April 2021, MMI served on IEL a statutory demand (“the SD”) for US$2,451,028.76, being the Loan Sum and outstanding interest as of 14 April 2021 (“the Outstanding Sum”).19Foot Note 19×Mr Hamid’s 1st Affidavit at paras 24-28. 13 On 20 April 2021, IEL responded by way of a letter to MMI (“the 20 Apr Letter”).20Foot Note 20×Mr Ghai’s 1st Affidavit at paras 29-30.In that letter, IEL relied on the Letter of Intent and said that MMI had waived its right to recall the Loan Facility according to its terms.  IEL also stated that it had a cross-claim against MMI.  The 20 Apr Letter stated,inter alia, the following:21Foot Note 21×Mr Ghai’s 1st Affidavit at para 30; Mr Hamid’s 1st Affidavit at paras 33-34 and pp 73-74. 3. … any sums which may be outstanding under the Loan Facility are the subject of ongoing negotiations between [Mr Ghai] and [MMI] in relation to an equity investment in [IEL]. 4. The negotiations with Mr. Ghai have resulted in the execution of a Letter of Intent dated 13 August 2020, as amended by way of a Supplemental Letter dated 10 February 2021 … executed by [MMI] and Mr. Ghai. Among other things, [the Letter of Intent] provides: … b. That the sums due under the Loan Facility (including accruing interest, but not including default interest), will be netted against [the MMI’s] [i]nvestment in [IEL], and that the Loan Facility will be discharged, in return for [IEL’s] issuance of shares to [MMI]; … 5. As such, [MMI] has waived any claim for non-payment of any amount outstanding under the Loan Facility, and any claim for default interest. … … 7. Without prejudice to our position above, even assuming that [MMI] is entitled to call on the Loan Facility prior to 9 May 2021, [MMI] has, expressly and/or by conduct, waived the right to insist on the Repayment Date (as defined in the Loan Facility) being 1 August 2020. In light of the above, and pursuant to Clause 6(a) of the Loan Facility, the Repayment Date for [the Loan Sum] is 30 business days after your Letter [referring to the SD], which represents written notice demanding repayment. … 9. Further, [MMI] is well aware that there are monies due and owing from [MMI] to [IEL] which the parties have been discussing and negotiating in good faith for several months. 10 In light of the above, we have a legitimate cross-claim against [MMI]. … 14 IEL did not make any payment, or secure or compound the Outstanding Sum to MMI’s reasonable satisfaction by 5 May 2021 (which was three weeks after the date of service of the SD).22Foot Note 22×Mr Hamid’s 1st Affidavit at para 30.MMI therefore filed CWU 81 on 24 May 2021 seeking an order that IEL be wound up pursuant to s 125(1)(e) of the Insolvency, Restructuring and Dissolution Act 2018 (Act 40 of 2018) (“the IRDA”) on the ground that it was deemed to be unable to pay its debts pursuant to s 125(2)(a) of the IRDA.23Foot Note 23×Mr Hamid’s 1st Affidavit at para 32.",
        "The 14 Jul Hearing": "15 The 14 Jul Hearing was the first hearing of CWU 81.  IEL resisted CWU 81 on three grounds: (a) First, there was a dispute over the amount repayable by IEL under the Loan Facility.24Foot Note 24×Defendant’s Written Submissions dated 7 July 2021 (“DWS 7 July 2021”) at para 29; Mr Ghai’s 1st Affidavit at paras 26-32.It referred to the 8 Apr E-mail (see [11] above) where reference was made to “outstanding amount to be settled between MM Group and [IEL] for wholesale business”, and the 20 Apr Letter (see [13] above), where reference was made to the existence of a cross-claim which IEL held against MMI.  IEL argued that this dispute should be first resolved by arbitration pursuant to cl 19 of the Loan Facility and that MMI was not entitled to proceed with CWU 81.  However, IEL provided no details of the alleged outstanding amount and cross-claim.  It submitted that it sufficed to simplyassertthe existence of a dispute, which it had done so.25Foot Note 25×DWS 7 July 2021 at para 30. (b) Second, there was a dispute over the legality and enforceability of the Loan Facility as there was a triable issue of whether the interest charged under the Loan Facility was exorbitant and excessive.26Foot Note 26×DWS 7 July 2021 at para 48.IEL was referring to the amount of interest claimed in the SD (US$841,028.76), of which US$28,747.40 was accrued interest and US$812,281.36 was default interest.27Foot Note 27×Mr Hamid’s 1st Affidavit at para 27. (c) Third, there was a dispute over whether MMI was entitled to claim the entirety of the Loan Sum because part of that amount (the sum of US$750,000) had been extended by MMT.28Foot Note 28×DWS 7 July 2021 at paras 34-41; Mr Ghai’s 1st Affidavit at para 14.It was argued that MMI had not furnished any consideration in respect of that loan amount of US$750,000. 16 At the 14 Jul Hearing, counsel for IEL also advanced a further argument as to why CWU 81 should be dismissed.  He said, without further explanation or elaboration, that the parties were in “negotiations” about a possible investment by MMI at the time the SD was served and hence the Loan Sum was “not due” because there was an agreement that MMI would “hold on” from recalling the Loan Facility.29Foot Note 29×Notes of Arguments, 14 Jul, p 2 lines 14-16.However, this argument was unsubstantiated by any affidavit evidence.  In response, counsel for MMI argued that there was no legal basis for that submission because item 4 of the Letter of Intent (see [8] above), which dealt with the Proposed Investment and provided for the amounts owing by IEL to be set off against any investment sum paid, had been expressly described as not legally binding.  Further, it was Mr Ghai (rather than IEL) that had been a party to the Letter of Intent.30Foot Note 30×Notes of Arguments, 14 Jul, p 3 lines 24-27. 17 At the conclusion of the 14 Jul Hearing, I considered that IEL had not satisfied the court that there had been even aprima faciedispute over its liability for the Outstanding Sum.  In connection with the first dispute over the amount repayable, counsel for IEL accepted that IEL’s affidavit offered no particulars of the alleged cross-claim and whether it exceeded the Outstanding Sum.  As for the second dispute over the enforceability of the Loan Facility, counsel for IEL also could not articulate the legal basis for challenging the enforceability of the Loan Facility.  As for the third dispute over whether consideration had been provided by MMI in respect of US$750,000 under the Loan Facility, I did not consider that to be any dispute at all.  Clause 2 of the Loan Facility made it clear that the sum of US$750,000 was deemed repaid to MMT and reborrowed by IEL from MMI under the Loan Facility.  MMI would have provided consideration by its extension of a further sum of US$860,000 to IEL.  Thus, I considered that there were no grounds for dismissing and/or staying CWU 81 in favour of arbitration. 18 Given IEL’s failure to make any payment, or secure or compound the Outstanding Sum under the SD within three weeks of its service, it was deemed unable to pay its debts within the meaning of s 125(1)(e) of the IRDA pursuant to the presumption of insolvency in s 125(2)(a).  I was therefore of the view that the grounds for winding up IEL were made out and ordered so accordingly. 19 For completeness, I would add that, even if there were any merits in the dispute over whether consideration had been provided by MMI in respect of US$750,000 owing under the Loan Facility, or IEL’s contention that the interest charged under the Loan Facility was exorbitant and excessive, there would have been, at the very least, an undisputed sum of US$860,000 (US$1.61m less US$750,000) and interestorUS$1.61m (the Outstanding Sum less interest) that was due and outstanding.  Either sum was well in excess of the statutorily-prescribed minimum in s 125(2)(a) of the IRDA and IEL’s refusal to pay any sum at all would still trigger the operation of the presumption of insolvency in s 125(2)(a) of the IRDA (seeReSanpete Builders (S) Pte Ltd[1989] 1 SLR(R) 5at [59]).",
        "IEL’s request to make further arguments": "20 On 19 July 2021, the then-solicitors for IEL, Christopher Bridges Law Corporation (“CBLC”), wrote a letter to court (“the 19 Jul Letter”) requesting further arguments for CWU 81.31Foot Note 31×Defendant’s 1st letter to court dated 19 July 2021.In the 19 Jul Letter, CBLC explained that IEL’s subsidiaries in Myanmar had sufficient cash and assets and so IEL was able to pay the debt claimed by MMI.  The 19 Jul Letter also set out a proposed timeline for repayment of the Outstanding Sum by IEL.  In short, CBLC indicated that it wanted to make further arguments that IEL was not insolvent and could meet MMI’s demand for repayment. 21 On 22 July 2021, MMI’s solicitors, Allen & Gledhill LLP (“A&G”), wrote a letter to court in reply to the 19 Jul Letter.32Foot Note 32×Plaintiff’s 1st letter to court dated 22 July 2021.A&G submitted that IEL’s request for further arguments should be rejected and the winding-up order ought to stand because,inter alia, the arguments which IEL wanted to make in its request for further arguments could and should have been raised during the 14 Jul Hearing. 22 In the meantime, IEL changed its solicitors to Mallal & Namazie LLP (“M&N”).  On 22 July 2021, M&N wrote a letter to court, responding to A&G’s letter of that same date.33Foot Note 33×Defendant’s 2nd letter to court dated 22 July 2021.It stated that IEL faced logistical difficulties in transferring funds outside of Myanmar to effect payment to MMI and that the earliest it could do so was 27 July 2021.  It proposed that the winding-up order made at the 14 Jul Hearing be stayed for three weeks. 23 On 22 July 2021, I agreed to hear further arguments and directed IEL to file and serve an affidavit in support of its further arguments by 26 July 2021, and for MMI to file its responsive affidavit by 2 August 2021.  I also directed that MMI was not to extract the winding-up order made at the 14 Jul Hearing, until the hearing of the further arguments and any decision made thereon. 24 On 26 July 2021, IEL filed an affidavit by Mr Ghai in support of its further arguments.  The affidavit raised the following points: (a) AG Asset Management Co Ltd had about US$800,000 in cash, as well as an inventory of fuel with an estimated value of not less than US$627,806.07.34Foot Note 34×2nd Affidavit of Mr Anshuman Ghai (“Mr Ghai’s 2nd Affidavit”) at paras 12 and 15.On 26 July 2021, Mr Ghai had obtained the approval of the Central Bank of Myanmar to remit sums of up to US$3m to pay MMI.35Foot Note 35×Mr Ghai’s 2nd Affidavit at para 16. (b) The Loan Facility was part of the Proposed Investment by MMI in relation to the Retail Project.36Foot Note 36×Mr Ghai’s 2nd Affidavit at paras 19 to 23.Mr Ghai explained that MMI had been willing to offer these loans because it wanted to leverage on his knowledge and expertise to establish wholesale fuel trade operations in Myanmar, in connection with which he had provided significant assistance.37Foot Note 37×Mr Ghai’s 2nd Affidavit at paras 23 to 26. (c) It was intended that the Loan Sum and outstanding interest under the Loan Facility was to be set off against the Proposed Investment of US$7.5m,38Foot Note 38×Mr Ghai’s 2nd Affidavit at para 27.and that up until 6 April 2021, MMI had never made any demand for repayment.39Foot Note 39×Mr Ghai’s 2nd Affidavit at para 28. (d) On 25 January 2021, sometime before the signing of the Supplemental Letter, MMI’s legal counsel had sent to Mr Ghai a document titled an “Acknowledgment of Debt”, which provided that no default interest had been levied on the Loan Sum up until that point.40Foot Note 40×Mr Ghai’s 2nd Affidavit at paras 30-31.This showed that the Loan Sum was never considered to be outstanding, even after the due date for payment as stipulated in the Loan Facility,ie, 1 August 2020. 25 On 2 August 2021, MMI filed its responsive affidavit.  The affidavit emphasised that IEL had still not made repayment of any part of the Outstanding Sum despite its earlier representations in its solicitors’ letters to court.41Foot Note 41×1st Affidavit of Chua Han Hui Edwin (“Mr Chua’s 1st Affidavit”) at para 12.MMI also claimed that neither IEL nor Mr Ghai had the means to repay the Outstanding Sum.42Foot Note 42×Mr Chua’s 1st Affidavit at paras 20-32.The affidavit also raised the following points in response to those raised by Mr Ghai: (a) It had been indeed envisaged that the Loan Sum and outstanding interest under the Loan Facility would be set off against the Proposed Investment so that only the remaining amount would be invested as cash by MMI in IEL, but that was subject to the execution of formal investment documentation, which was never done.43Foot Note 43×Mr Chua’s 1st Affidavit at para 41. (b) The “Acknowledgment of Debt” which Mr Ghai had referred to had been a draft that was never executed by the parties.  It had nothing to do with the Supplemental Letter, and MMI had never represented that it would not charge default interest on the Loan Sum.44Foot Note 44×Mr Chua’s 1st Affidavit at para 42. 26 On 3 August 2021, IEL changed its solicitors to Rajah & Tann Singapore LLP (“R&T”).  On 4 August 2021, A&G wrote a letter to court asking that the court reject the further arguments which IEL wanted to make about its solvency.  A&G complained that IEL still had not made payment to MMI of any part of the Outstanding Sum.  A&G also expressed its concerns that IEL was seeking to illegitimately delay matters since it had appointed two new sets of solicitors in the three-week period after the 14 Jul Hearing. 27 Given the concerns expressed by MMI, I directed that the hearing for further arguments, which had initially been scheduled for 23 August 2021, be brought forward to 10 August 2021.",
        "The hearing on 10 August 2021": "28 On the day of the hearing, IEL filed another affidavit by Mr Ghai (“the 10 Aug Affidavit”) in which he asked for leave to make twonewfurther arguments as to why the winding-up order made at the conclusion of the 14 Jul Hearing should be recalled, namely: (a) as at 14 April 2021 when the SD was issued, no sum was yet due under the Loan Facility; and (b) IEL had a valid cross-claim quantified in the amount of US$9,452,071.68 against MMI.45Foot Note 45×Mr Ghai’s 3rd Affidavit at para 13. 29 When the parties’ counsel appeared before me on 10 August 2021, IEL’s new counsel, Mr Lee Eng Beng SC (“Mr Lee”), sought an adjournment so that he could make the new further arguments which Mr Ghai had set out in the 10 Aug Affidavit.  Mr Lee also indicated that IEL would not be pursuing the further arguments set out in the 19 Jul Letter.  Mr Jason Chan SC, who appeared for MMI, objected to IEL’s application and argued that IEL was acting in abuse of process. 30 Aspers 29B(2) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA”), IEL had 14 days from the date of the original order made on 14 July 2021 to put in a request for further arguments.  Given that IEL was out of time in making its request for these new further arguments, I directed that IEL file an application for an extension of time to request to make these new further arguments, and file a supporting affidavit by 24 August 2021 setting out those arguments in full.  MMI was directed to file any responsive affidavit by 7 September 2021.",
        "IEL’s application for an extension of time to request for new further arguments and its further arguments on why the winding-up order should be recalled": "31 Pursuant to my directions, IEL filed Summons No 3994 of 2021 (“SUM 3994”), which was its application for an extension of time to request for new further arguments.  IEL also filed a supporting affidavit by Mr Ghai setting out its further arguments in full.  That affidavit elaborated on the two grounds that Mr Ghai had raised in the 10 Aug Affidavit, which I had also granted IEL leave to file and rely on. 32 First, Mr Ghai explained that the various loans (including the Loan Facility) had been provided by MMI to IEL as part of the Proposed Investment in the Retail Project (see [7] above).  They were meant to enable IEL to start work on the Retail Project even before any formal documentation on the Proposed Investment was entered into.46Foot Note 46×Mr Ghai’s 4th Affidavit at paras 14-15.It was the parties’ understanding that the sums advanced would eventually be converted into MMI’s equity investment in IEL once the relevant documentation was executed, and that none of these loans would be repayable while IEL was working on the Retail Project pending the formalisation and completion of the Proposed Investment.47Foot Note 47×Mr Ghai’s 4th Affidavit at para 16. 33 The parties had expected the Proposed Investment to be formalised by 1 August 2020 (which was also the date on which the Loan Facility was to be repaid at the latestpercl 6: see [6] above), but they were unable to agree on the full terms by that time.48Foot Note 48×Mr Ghai’s 4th Affidavit at para 32.They therefore decided to extend the timeframe for those discussions by 180 days. It was in that context that Mr Ghai and MMI entered into the Letter of Intent on 13 August 2020.49Foot Note 49×Mr Ghai’s 4th Affidavit at paras 32-33.A first draft of the relevant investment documentation was exchanged on 11 November 2020, but the parties were still unable to agree on its terms by 10 February 2021.  Mr Ghai and MMI therefore entered into the Supplemental Letter to extend the term of the Letter of Intent until 9 May 2021.50Foot Note 50×Mr Ghai’s 4th Affidavit at para 37-42.During the term of the Letter of the Intent (which was subsequently extended by the Supplemental Letter), Mr Ghai was obliged to work exclusively with MMI towards formalising the Proposed Investment and was prohibited from discussing or soliciting any other investment offer that was similar to or in competition with the subject matter of the Proposed Investment.  This was referred to in item 20 of the Letter of Intent as the “Exclusivity Period”.51Foot Note 51×Mr Hamid’s 1st Affidavit at pp 42 and 49. 34 Mr Ghai said that it was obvious that, while the parties were working towards the formalisation and completion of the Proposed Investment pursuant to the terms of the Letter of Intent, the Loan Facility was not repayable and IEL would not be in default by not repaying the loan.52Foot Note 52×Mr Ghai’s 4th Affidavit at para 36.Accordingly, MMI was not entitled to serve the Letter of Demand (on 6 April 2021) and the SD (on 14 April 2021) because the Exclusivity Period had not yet expired, and the Loan Facility was not yet repayable, as at both of those dates.53Foot Note 53×Mr Ghai’s 4th Affidavit at paras 44-46. 35 Second, Mr Ghai gave details of how IEL had a cross-claim of US$9,452,071.68 against MMI.  As alluded to earlier (see [7] above), Mr Ghai explained that MMI had been keen to establish a business for the wholesale supply of petroleum products in Myanmar (“the Wholesale Business”).54Foot Note 54×Mr Ghai’s 3rd Affidavit at para 16(a).It had been the parties’ common understanding that the groundwork for the establishment of the Wholesale Business would be undertaken by IEL (and indeed, that had been the case), and that MMI was to reimburse IEL for its incurred costs.55Foot Note 55×Mr Ghai’s 4th Affidavit at paras 50(a) and 52-53.There was also an understanding between Mr Ghai and MMI that Mr Ghai would be entitled to 20% profits from the Wholesale Business, regardless of which entity within the MM Group was involved in the Wholesale Business.56Foot Note 56×Mr Ghai’s 4th Affidavit at para 50(b).In connection with the establishment of the Wholesale Business, Mr Ghai had incorporated a company in Singapore, Iceberg Energy Services Pte Ltd, which was later renamed Myanmar Petroleum Services Pte Ltd (“MPS”).  Mr Ghai subsequently transferred an 80% stake in MPS to MMI for a nominal sum of S$1 but remained as a director of MPS.57Foot Note 57×Mr Ghai’s 4th Affidavit at para 50(c). 36 By January 2021, Mr Ghai began to worry that MMI would renege on its promise to give him 20% of the profits from the Wholesale Business.58Foot Note 58×Mr Ghai’s 4th Affidavit at para 55.He subsequently informed MMI on 10 March 2021 that he was no longer interested in collaborating with MMI for the Wholesale Business.59Foot Note 59×Mr Ghai’s 4th Affidavit at para 58.Pursuant to that, Mr Ghai resigned as a director of MPS but he did not agree to transfer his 20% stake to MMI at S$1, as MMI had proposed.60Foot Note 60×Mr Ghai’s 4th Affidavit at para 59.Then, in two e-mails exchanged between MMI and IEL on 29 March 2021, IEL stated that it ought to be compensated for its contribution to the Wholesale Business, and this was acknowledged by MMI.61Foot Note 61×Mr Ghai’s 4th Affidavit at paras 60-62.I refer to these e-mails as the “29 Mar E-mails”, the contents of which I will return to later in these grounds (see [87] below).  For now, it suffices to note that Mr Ghai’s affidavit stated that IEL, pursuant to those e-mails, proceeded to issue an invoice on 30 April 2021 to MMI for work done for the Wholesale Business (“the 30 Apr Invoice”).62Foot Note 62×Mr Ghai’s 4th Affidavit at para 64.The sum claimed in the 30 Apr Invoice is the subject matter of the cross-claim by IEL against MMI. 37 On 7 September 2021, MMI filed its responsive affidavit, refuting the various contentions raised by MMI. 38 First, MMI disputed Mr Ghai’s contention that the Loan Facility was not repayable at the time when the SD was served on 14 April 2021.  MMI said that sums advanced under the Loan Facility were repayable strictly in accordance with its terms.63Foot Note 63×2nd Affidavit of Chua Han Hui Edwin (“Mr Chua’s 2nd Affidavit”) at para 24.MMI never represented to IEL and/or Mr Ghai that the Loan Sum would not be repayable.64Foot Note 64×Mr Chua’s 2nd Affidavit at para 28.IEL’s obligation to repay the Loan Sum was independent of the Letter of Intent and the Supplemental Letter,65Foot Note 65×Mr Chua’s 2nd Affidavit at para 44.and there was nothing in those documents which stated that the Loan Sum would not be repayable during the Exclusivity Period.66Foot Note 66×Mr Chua’s 2nd Affidavit at para 34.The parties to the Letter of Intent and the Supplemental Letter were MMI and Mr Ghai; IEL was not a party.67Foot Note 67×Mr Chua’s 2nd Affidavit at para 30.In any case, according to MMI, it had been obvious, well before the issuance of the Letter of Demand on 6 April 2021, that Mr Ghai no longer wished to collaborate with MMI on the Retail Project.68Foot Note 68×Mr Chua’s 2nd Affidavit at para 47. 39 Second, MMI disputed that IEL had any cross-claim in respect of work done for the Wholesale Business.  It said that the Wholesale Business, while related to the Retail Project, was carried out through different legal entities.69Foot Note 69×Mr Chua’s 2nd Affidavit at paras 19-20 and 50.MMI did not participate directly in the Wholesale Business, but carried it out through MPS and Myanmar-incorporated MPS subsidiaries, including Kilocal Myanmar Limited (“KML”) and Kilocal Limited (“KL”).70Foot Note 70×Mr Chua’s 2nd Affidavit at para 51.According to MMI, IEL never did any work in Myanmar in respect of the Wholesale Business.71Foot Note 71×Mr Chua’s 2nd Affidavit at paras 56 and 61.MMI also never agreed that IEL was to be compensated for work done for the Wholesale Business.  In the 29 Mar E-mails, Mr Zaen Hamid (“Mr Hamid”), MMI’s managing director, had asked Mr Ghai (rather than IEL) to quantify the compensation whichhewas entitled to in respect of work done for the Wholesale Business.72Foot Note 72×Mr Chua’s 2nd Affidavit at para 54.MMI accepted that it was true that there was a profit-sharing arrangement with Mr Ghai; the intention, however, was for his share of the profits to be received “personally through his 20% stake in MPS”.73Foot Note 73×Mr Chua’s 2nd Affidavit at para 53. 40 Both SUM 3994 and IEL’s further arguments were heard on 29 October 2021.",
        "Parties’ submissions": "",
        "IEL’s submissions": "41 IEL argued that SUM 3994 should be granted.  It said that Mr Ghai faced challenging circumstances operating out of Myanmar at the time when the SD was issued on 14 April 2021 due to COVID-19 restrictions and the military coup that had just taken place.  As such, when CWU 81 was filed and fixed for hearing on 14 July 2021, Mr Ghai could not properly discuss with IEL’s then-solicitors the full history of its business relationship with MMI.74Foot Note 74×Defendants’ Written Submissions dated 22 October 2021 (“DWS”) at paras 14-18.IEL also argued that MMI had not identified any irremediable prejudice that it would suffer if IEL were given the extension of time sought to make these new further arguments.75Foot Note 75×DWS at para 22.IEL acknowledged that it had earlier made a promise to pay the Outstanding Sum in the 19 Jul Letter issued by CBLC (see [20] above), and that it was now taking a different position.  But, IEL argued that its change of position was justifiable because it was the result of new legal advice on its ability to defend the winding-up application, and so it had never acted at any time in bad faith.76Foot Note 76×DWS at para 18; Notes of Arguments, 29 Oct, p 2 lines 23-27.Finally, IEL also argued that the fact that part of the further arguments that it now wanted to make related to points advanced at the 14 Jul Hearing, but which had not been fleshed out in full, was not a bar to it making those arguments now.77Foot Note 77×Notes of Arguments, 29 Oct, p 3 lines 9-10; DWS at paras 30-31. 42 Turning to the further arguments proper, IEL disputed its liability for the Outstanding Sum claimed in the SD on two grounds.  First, it argued that there had been an implied agreement between MMI and itself that, while the parties were working towards the formalisation and completion of the Proposed Investment during the Exclusivity Period, the Loan Facility was not repayable.78Foot Note 78×DWS at paras 33-34.Accordingly, the earliest time at which the Loan Sum would have become repayable was 9 May 2021 (which was the earliest time at which the Exclusivity Period could expire).79Foot Note 79×Notes of Arguments, 29 Oct, p 4 lines 5-9.As an alternative to its argument about the implied agreement, IEL also argued that, as a matter of business efficacy, it was an implied term of the Letter of Intent that MMI would not call on the Loan Facility during the Exclusivity Period.80Foot Note 80×DWS at para 34.As such, as at 14 April 2021 when the SD was served, no debt was yet due under the Loan Facility.81Foot Note 81×DWS at para 35. 43 Second, IEL argued that it had a valid and substantial cross-claim of US$9,452,071.68 against MMI which exceeded the Outstanding Sum.  This cross-claim arose from the compensation which MMI had agreed IEL should receive in respect of the work it had done for the Wholesale Business.82Foot Note 82×DWS at paras 61-62.In its submissions, IEL appeared to accept that the entities actually responsible for conducting the Wholesale Business were not IEL and/or MMI, but it argued that the substance and reality of the arrangement was that IEL also carried out work in relation to the Wholesale Business.  Not only that, IEL and MMI had dealt with each other as the billing and paying parties for the purposes of the Wholesale Business.83Foot Note 83×DWS at paras 64-65. 44 Finally, and in the alternative, IEL argued that given the cross-claim, there was aprima faciedispute over whether it was liable for any part of the Outstanding Sum under the Loan Facility.  Since the Loan Facility contained an arbitration agreement at cl 19, CWU 81 should be dismissed.84Foot Note 84×DWS at paras 72-73.",
        "MMI’s submissions": "45 MMI argued that SUM 3994 should be dismissed.  This was because IEL had acted in abuse of process as the new further arguments it was seeking to make contradicted those which it had said it would make in the 19 Jul Letter.85Foot Note 85×Plaintiff’s Written Submissions dated 22 October 2021 (“PWS”) at paras 13-22.Further, IEL had also not satisfied the court that it should be granted an extension of time.  In particular, MMI argued that the new further arguments which IEL sought to make simply rehashed those already raised at the 14 Jul Hearing, and there was also no good reason for IEL’s delay until 10 August 2021, when it first raised the prospect of making these new further arguments.86Foot Note 86×PWS at paras 25-27 and 33.MMI argued that, if IEL were granted an extension of time, that would allow IEL and/or Mr Ghai to use this time to dissipate IEL’s assets and wrongly sell fuel owned by KML, occasioning prejudice to MMI and IEL’s other creditors.87Foot Note 87×PWS at para 32.Finally, MMI contended that, even if the court granted IEL leave to make these new further arguments, IEL should not be permitted to adduce any fresh evidence beyond what had been placed before the court at the 14 Jul Hearing88Foot Note 88×PWS at para 35.because the court should not allow further evidence where it is adduced in support of, or to strengthen, arguments that have previously been raised.89Foot Note 89×PWS at paras 40-43. 46 Turning to IEL’s further arguments, MMI denied that there was an agreement between IEL and itself that the Loan Facility would not be repayable during the Exclusivity Period or that there was any implied term in the Letter of Intent to that effect.  It argued that there was plainly nothing in the Letter of Intent which could affect the repayment period under the Loan Facility.  The Exclusivity Period, which related only to Mr Ghai’s obligations to work exclusively with MMI on the Proposed Investment, had nothing to do with IEL’s repayment obligations under the Loan Facility.90Foot Note 90×PWS at paras 55-57.Further, IEL was also not a party to the Letter of Intent and/or the Supplemental Letter, which provided for the Exclusivity Period.91Foot Note 91×PWS at para 53.Second, MMI argued that IEL had expressed its willingness to make repayment under the Loan Facility on two occasions before 9 May 2021.  As such, it was claimed that IEL had recognised amounts due under the Loan Facility as being repayable even before the expiry of the Exclusivity Period; IEL’s argument about the implied agreement or implied term had been contrived to delay the repayment of a clear and admitted debt.92Foot Note 92×PWS at paras 58-59. 47 Third, even if there were any merit to IEL’s arguments, there would have been an undisputed debt of at least US$1.61m which had become outstanding from 9 May 2021 onwards.  This far exceeded the statutorily-prescribed minimum, and in respect of which IEL had made no repayment to date.  IEL was therefore making no more than a technical objection concerning the timing of the SD, and this did not constitute a dispute that would justify a dismissal or stay of CWU 81.93Foot Note 93×PWS at para 51; Notes of Arguments, p 8 lines 26-31.Further, even if there were any irregularity associated with the SD as at 14 April 2021, that could be cured by the court pursuant to s 264 of the IRDA. 48 Fourth, MMI submitted that IEL had no valid cross-claim against MMI in respect of the Wholesale Business because the proper parties to any such cross-claim were not MMI and/or IEL.94Foot Note 94×PWS at paras 61 and 65; Notes of Arguments, p 6 lines 19-32.Neither MMI nor IEL had been directly involved in the Wholesale Business; that business was carried on by Myanmar-incorporated entities like KML and KL, and Mr Ghai personally.95Foot Note 95×PWS at para 63. 49 Finally, even if IEL had a cross-claim against MMI, the applicable standard of review in respect of that claim was not theprima faciestandard because that dispute was not subject to any arbitration agreement.96Foot Note 96×PWS at paras 67-69.Further, since the Wholesale Business was independent of, and unrelated to, the Loan Facility, even if IEL could establish the existence of such a cross-claim against MMI, any dispute arising from this cross-claim was unrelated to the Loan Facility and was not covered by the arbitration clause in the Loan Facility.97Foot Note 97×PWS at para 70.",
        "Issues": "50 There were essentially two broad issues for my determination: (a) First, whether SUM 3994, which sought an extension of time for IEL’s request for new further arguments, should be allowed? (b) Second, whether the further arguments made by IEL disclosed any basis for the court to stay or dismiss CWU 81?",
        "Issue 1: SUM 3994": "51 I allowed SUM 3994 and granted IEL an extension of time to make its new further arguments.  In preparing these grounds, I noted that the Court of Appeal has dismissed MMI’s application in CA/OS 28/2021 for leave to appeal against my decision on SUM 3994.  As such, I will only briefly explain my reasons for allowing SUM 3994. 52 First, I did not accept MMI’s submission that IEL had acted in abuse of process by attempting to make further arguments which were not the same as those that had been set out in the 19 Jul Letter.  The concept of abuse of process is one where the court addresses proceedings which constitute an “improper use of its machinery” and if the proceedings are such, the court in the exercise of its inherent jurisdiction will disallow their continuance without hesitation (seeJTrustAsia Pte Ltd v Group Lease Holdings Pte Ltd and others[2018] 2 SLR 159 at [99]).  To make good its argument on abuse of process, MMI must show that IEL had sought the extension of time for a purpose other than to advance legitimate arguments as to why the winding-up order should not have been made,eg, if the extension of time had been sought by IEL solely for the purpose of allowing IEL to transfer away some assets to hinder the winding-up process.  However, there was no evidence that this was the reason IEL had sought the extension of time.  The fact that IEL had changed its position by seeking to make new further arguments which are not the same as those outlined in the 19 Jul Letter was notper seevidence of an abuse of process.  IEL has explained that the change in position was because of the change of solicitors and different legal advice being obtained.  This was not challenged by MMI as being untrue. 53 Second, I considered that there was nothing wrong in principle for IEL to seek to make new further arguments which were not consistent with those outlined in the 19 Jul Letter.  There is nothing in s 29B(2) of the SCJA which constrains the scope of the further arguments that can be made to those which had been outlined in the initial request for further arguments.  As a matter of principle, there should also be no limitation on the types of further arguments which an applicant may make, provided that they are relevant and may have a bearing on the court’s decision.  The process of hearing further arguments is meant to give the court an opportunity to review its decision whenever it is open to the possibility of changing its mind (seeARW v Comptroller of Income Tax and another and another appeal[2019] 1 SLR 499 (“ARW”) at [59];Aberdeen Asset ManagementAsia Ltd and another v Fraser & Neave Ltd and others[2001] 3 SLR(R) 355 at [23]).  Imposing any limitation on the further arguments which the applicant may make is inconsistent with the rationale underlying the process for further arguments.  Instead,anyargument that has a bearing on the judge’s decision should in principle be something which can be considered by the judge.  Ultimately, it is for the court to decide on the merits of those further arguments, and it should not matter that they are presented in the alternative, or even appear contradictory or inconsistent with other arguments raised.  If there are no merits to the arguments, they will be dismissed after due consideration. 54 Third, I considered that IEL should be permitted to adduce further evidence in support of its new further arguments.  InARW, the Court of Appeal held that further evidence may be allowed in support of newarguments, but should not be allowed where the evidence is sought to support or strengthen previously raised arguments (at [87]).  The court explained that the concern in the latter situation is that allowing new evidence in further arguments would permit litigants, after learning of the judge’s grounds of decision, to plug the gaps in the evidence that were identified by the judge, and that would constitute an abuse of process (at [87]). 55 I accepted that the new further arguments which IEL wanted to advance had been peripherally raised at the 14 Jul Hearing.  So, strictly speaking, they were not entirely new arguments.  In respect of the first argument about the implied agreement and/or implied term, IEL’s then-solicitors had, at the 14 Jul Hearing, merely stated that there were “negotiations” at the time the SD was served and there was an agreement that MMI would “hold on” from recalling the Loan Facility (see [16] above).  As for the second argument about the cross-claim, that had been raised by IEL as a ground for disputing the amount repayable under the Loan Facility, but without any details at all (see [15(a)] above). 56 At the 14 Jul Hearing, I found both of these arguments to be entirely unsubstantiated and amounted to nothing more than bare assertions by IEL.  As such, they were not considered at any length by the court for the purposes of the 14 Jul Hearing.  In the further arguments which IEL wanted to make, IEL and its new counsel put far more thought, substance and details into what IEL had intended to convey by those points.  In these circumstances, I did not think that allowing further evidence on both of these arguments would have the effect of allowing IEL to plug earlier gaps in evidence that were identified by the court.  This was because there had simply been noevidence put before the court about those arguments in the first place, and the court had also not given any grounds for dismissing those arguments.  I thus found that the rationale underlying the rule disallowing the admission of further evidence to support previously raised arguments was not engaged.  I therefore rejected MMI’s submission that IEL be disallowed to adduce fresh evidence in support of its new further arguments. 57 Finally, I also rejected MMI’s argument that an extension of time would operate to the prejudice of MMI and other creditors as it would allow IEL and/or Mr Ghai to use the time to dissipate IEL’s assets and sell fuel owned by KML.  This assertion was entirely unsubstantiated and there was no evidence of any attempt to dissipate assets by IEL.  Further, there was no evidence in these proceedings that IEL had any other creditors besides MMI.  An extension of time being granted to IEL to make its further arguments therefore only affected the position as between MMI and IELinter se.",
        "Issue 2: Whether the further arguments made by IEL disclosed any basis to stay or dismiss CWU 81?": "58 A debtor-company which seeks to obtain a stay or dismissal of a winding-up application need only raise triable issues (AnAnGroup (Singapore) Pte Ltd v VTB Bank (Public Joint Stock Co)[2020] 1 SLR 1158 (“AnAnGroup”)at [25];Pacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”)at [23]).  To do so, the debtor must show that there exists a substantial andbona fidedispute, whether in relation to a dispute over the debt claimed, or where the debt is undisputed, in relation to a cross-claim for an amount equal to or exceeding the undisputed debt (AnAnGroupat [25];Pacific Recreationat [25]).  A substantial andbona fidedispute is one where the debtor’s reasons for not paying the debt are honestly believed to exist and based on reasonable grounds, which are not frivolous; there must be so much doubt and question about the liability to pay the claimed debt that the court sees that there is a question to be decided (LKM Investment Holdings Pte Ltd v Cathay Theatres Pte Ltd[2000] 1 SLR(R) 135 (“LKM Investment”)at [20]). 59 On the other hand, where there is an arbitration agreement between the parties, it suffices for the debtor to show aprima faciedispute or cross-claim which falls within the scope of that agreement.  However, if the court finds that the dispute is being raised by the debtor in abuse of process, it will nevertheless refuse to stay or dismiss the winding-up application (seeAnAnGroupat [94]). 60 The key distinction between the triable issue standard and theprima faciestandard of review is whether the court looks into the genuineness or merits of the defences put forth by the debtor-company.  Where the triable issue standard applies, the court must thoroughly examine the evidence and critically consider the merits of those defences to determine if they are frivolous (seeAnAnGroupat [76]-[77]).  On the other hand, where theprima faciestandard of review applies, the debtor need only assert a defence which gives rise to a dispute falling within the scope of the parties’ arbitration agreement and the court does not inquire into the merits of that defence (seeTjongVery Sumito and others v Antig Investments Pte Ltd[2009] 4 SLR(R) 732 (“TjongVery Sumito”)at [46] and [49]).  As the Court of Appeal explained inAnAnGroup, this distinction is justified because the parties have agreed for arbitration as the means of determining their disputes, and a court which examines the merits of the debtor’s defences would in effect take the place of the arbitral tribunal and that would undercut the parties’ pre-dispute bargain (at [77] and [82]). 61 With the foregoing principles in mind, I considered each of IEL’s further arguments.",
        "Ground 1: that the Loan Facility was not repayable at the date when the SD was issued": "62 Before turning to IEL’s first argument proper, the preliminary issue which I had to consider was the standard to which IEL must establish that the Loan Facility was not repayable at the date when the SD was issued.  This was dependent on whether the dispute fell within the scope of the arbitration agreement in cl 19 of the Loan Facility.  The parties appeared to have been on common ground that it did, and this was plainly correct.  The phrase “arising out of or in connection with”, which appears in cl 19, is given a generous interpretation in the context of arbitration agreements and it extends to all manner of issues that have a relationship with the contract in which the arbitration clause is found (seeTjongVery Sumitoat [50]).  In this case, a dispute as to whether the Loan Facility had been repayable as at 14 April 2021 was one which affected MMI’s rights to strictly insist upon repayment of the Loan Sum in accordance with cl 6 of the Loan Facility, and in turn, IEL’s obligations to make repayment of that amount.  Such a dispute obviously fell within the scope of cl 19.  Therefore, IEL only needed to establish that a dispute had arisen on aprima faciestandard. 63 As mentioned earlier, there were two alternative cases advanced by IEL in support of its first further argument (see [42] above).  First, that there had been an implied agreement between the parties that MMI would not recall the Loan Facility during the Exclusivity Period.  Second, that there had been an implied term in the Letter of Intent that MMI would not call on the Loan Facility during the Exclusivity Period. 64 Leaving aside the question of the implied agreement, I was satisfied that there was aprima faciedispute over whether there was an implied term in the Letter of Intent that MMI would not call for repayment of the Loan Facility during the Exclusivity Period. 65 The basis for the implication of terms is to give effect to the presumed intentions of the contracting parties; the object is to fill gaps in the contract and give it such efficacy as the parties must have intended that the contract should have (seeSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 at [93]-[95]).  It was therefore important to begin with the context in which the Letter of Intent had been executed by MMI and Mr Ghai.  The Letter of Intent followed the three prior loan agreements which had been entered into between the parties (namely, the convertible loan agreement, the January Loan and the Loan Facility: see [5]-[6] above).  According to Mr Ghai, these loan agreements were to provide IEL with cash so it could begin work on the Retail Project while parties were still in discussions about the Proposed Investment and before its terms were finalised.  The parties had expected those discussions to conclude by 1 August 2020, which I noted was also the repayment date of the Loan Facility (see [33] above).  However, that did not happen, and so Mr Ghai and MMI entered into the Letter of Intent to extend the period in which those discussions could take place, and this was later further extended by the Supplemental Letter until 9 May 2021. 66 The period in which those discussions were to take place is represented by the term of the Letter of Intent.  That period, I noted, is also coincident with the Exclusivity Period.  Item 20 of the Letter of Intent (later amended by the Supplemental Letter) defines the Exclusivity Period as commencing on the date of the Letter of Intent and endingon the later of9 May 2021 or the date on which the Loan Facility has been repaid in full.  This certainly makes it clear that the Exclusivity Period may well endafter9 May 2021 if the Loan Facility was only repaid after that date.  However, item 26 of the Letter of Intent (as amended by the Supplemental Letter), which sets out the term of the Letter of Intent, states that the letter will terminate upon 9 May 2021.98Foot Note 98×Mr Hamid’s 1st Affidavit at p 50.It also did not specify item 20 as one of those terms that would continue to have force and effect after that date.  In other words, notwithstanding the manner in which the Exclusivity Period was defined (a point of significance which I will return to later in these grounds: see [70] below), it was for all intents and purposes coincident with the term of the Letter of Intent.  Any reference to the Exclusivity Period is therefore similarly a reference to the term of the Letter of Intent, andvice versa. 67 According to Mr Ghai, the understanding between the parties was that, while those discussions were underway and before the parties finalised the Proposed Investment, none of the loans extended by MMI would be repayable (see [32] above).  Indeed, MMI did not strictly insist on its rights under any of the loan agreements which it had made with IEL until 6 April 2021, when it issued the Letter of Demand pursuant to the Loan Facility.  The successive loan agreements between MMI and IEL consolidated only the principal from the respective prior agreement, even though interest would have already accrued in accordance with the terms of that agreement.  For instance, only the principal of the convertible loan agreement (US$250,000) was consolidated under the January Loan, even though by the time the January Loan was entered into (17 January 2020), both accrued interest and default interest (the repayment date under the convertible loan agreement was 31 December 2019) would have been payable.99Foot Note 99×Mr Hamid’s 1st Affidavit at pp 26 and 30.Likewise, only the principal amount of the January Loan was consolidated under the Loan Facility, even though interest would have already accrued on that sum well before the Loan Facility was entered into.  Mr Ghai’s understanding appeared to have been shared by MMI’s senior management.  On 22 March 2021, Mr Hamid sent an e-mail to Ms Manisa Mitpaibul (“Ms Mitpaibul”), IEL’s director for corporate finance and investment.  He complained about Mr Ghai pushing back on the discussions about the Proposed Investment, and said:100Foot Note 100×Mr Ghai’s 4th Affidavit at pp 415-416. We are now at a critical decision point as the loans totalling 1.61M haveexpired(since Aug 2020) and we cannotextendthese further without clarity. [emphasis in original omitted; emphasis added in italics] As such, at the time when the Letter of Intent was executed, IEL contended that the shared understanding of Mr Ghai and MMI was that, so long as discussions relating to the Proposed Investment remained afoot, MMI would not strictly enforce its rights under any of the loan agreements it had made with IEL. 68 The Letter of Intent related to the conduct of the discussions about the Proposed Investment within the Exclusivity Period.  Some of its terms were not legally binding.  Others, especially those concerning how those discussions should be conducted, were.  Item 3 obliged Mr Ghai and MMI to use all reasonable endeavours to negotiate, finalise and execute the relevant investment documentation within 60 days, or if not, to continue to use all reasonable endeavours towards achieving that end for the duration of the Exclusivity Period.101Foot Note 101×Mr Hamid’s 1st Affidavit at p 37.During that period, Mr Ghai was also bound to work exclusively with MMI towards finalising the Proposed Investment, and was not permitted to solicit offers from other investors that were similar to or in competition with the Proposed Investment.  The Letter of Intent was, however, silent on the shared understanding about MMI not enforcing its rights under the loan agreements which it had made with IEL.  Unlike on previous occasions, where the outstanding sum under the prior loan agreement was consolidated into a successive agreement which effectively extended the repayment period for that sum, there was no further loan agreement entered into between MMI and IEL after 1 August 2020. 69 If Mr Ghai and MMI had entered into the Letter of Intent to extend the period of time in which they could continue their discussions about the Proposed Investment, it could well have been within their contemplation that thestatus quobe preserved for the entirety of the duration in which they were obliged to carry on those discussions,ie, during the Exclusivity Period that lasted until 9 May 2021. IEL thus submitted that the presumed intentions of Mr Ghai and MMI were that MMI would similarly not strictly enforce its rights under the Loan Facility until 9 May 2021.102Foot Note 102×DWS at para 51. 70 The manner in which the Exclusivity Period is defined (as ending on 9 May 2021 even if the Loan Facility was repaid in full before that date) was also significant.  It meant that Mr Ghai remained bound to continue the discussions on the Proposed Investment until 9 May 2021, even if IEL had been able to repay the Loan Facility before that date.  This had the effect of ensuring that the parties’ discussions about the Proposed Investment would not be stymied by any extrinsic developments,eg, if IEL for some reason no longer required cash from MMI to work on the Retail Project before the Proposed Investment was finalised.  This, taken together with the terms of the Letter of Intent (eg, item 3: see [68] above), shows that its objective was to delineate a definite period of time in which both MMI and Mr Ghai were obliged to use all reasonable endeavours to negotiate and finalise the Proposed Investment.  If MMI recalled the Loan Facility before 9 May 2021, it is possible that this would have jeopardised those discussions; in that event, Mr Ghai would presumably no longer want to continue the discussions with MMI and it would have been in his interests to turn to other potential investors.  It would also have defeated the very object which the Letter of Intent sought to achieve.  As such, I accepted that there was aprima faciedispute as to whether there existed an implied term in the Letter of Intent which limited MMI’s right to call on the Loan Facility until 9 May 2021.  IEL contended that such an implied term would give effect to Mr Ghai’s and MMI’s presumed intentions that MMI would not strictly enforce its rights under the Loan Facility until that date, and that this was necessary to render business efficacy to the agreement constituted by the Letter of Intent.  I therefore found that IEL’s contentions and submissions raised aprima faciedispute as to whether the Loan Facility was indeed repayable as at 14 April 2021. 71 While MMI claimed that Mr Ghai had decided not to discuss the Proposed Investment any further, this assertion was disputed by Mr Ghai.  The 8 Apr E-mail (see [11] above), in which IEL responded to the Letter of Demand, stated that Mr Ghai was still willing to collaborate with MMI on the Retail Project.  There was thus a dispute of fact over whether MMI and Mr Ghai had brought the Letter of Intent to a premature end and terminated the Exclusivity Period early.  That in turn had an impact on whether MMI could call on the Loan Facility before the end of the Exclusivity Period (as amended by the Supplemental Letter),ie, 9 May 2021.  For reasons similar to those which I have set out earlier (see [62] above), this dispute was also one which fell within the scope of the arbitration agreement in cl 19 of the Loan Facility. 72 MMI also made several other arguments as to why IEL had not even shown on aprima faciestandard that the Exclusivity Period should alter the repayment period under the Loan Facility.  However, these arguments (see [41] above) deal with themeritsof IEL’s arguments about the implied term.  Given that the dispute in question is one which falls within the scope of an arbitration agreement (see [62] above), the court is not a proper forum to deal with such arguments and I disregarded them.  For present purposes, it suffices for me to briefly mention two points. 73 First, the fact that IEL was not a party to the Letter of Intent was immaterial.  What mattered was that MMI was a party to the Letter of Intent, and that the alleged implied term in the Letter of Intent, the dispute over which I was satisfied existed on aprima faciestandard, was intended to affect MMI’s rights under the Loan Facility as against IEL.  The latter issue, which is quite independent of whether IEL was a party to the Letter of Intent, was relevant to the question of whether the Loan Facility was repayable as at the time when the SD was served on 14 April 2021.  There was, to my mind, a real dispute as to whether IEL could rely on this alleged implied term in the Letter of Intent to contest its liability to make any repayment under the Loan Facility as at 14 April 2021.  Second, one argument made at the 14 Jul Hearing, and reiterated at the hearing before me on 29 October 2021, was that item 4 of the Letter of Intent was not expressed to be legally binding (see [8] above).  Item 4, however, only dealt with the conversion of the sums advanced under the Loan Facility into MMI’s equity in IEL upon the finalisation and completion of the Proposed Investment.  It did not appear to me to deal with the issue of whether the Exclusivity Period could have an effect on the repayment period under the Loan Facility.  Leaving aside item 4 and the other terms in the Letter of Intent which were expressed to be not legally binding, the Letter of Intent nevertheless constituted a legally binding agreement imposing obligations on both MMI and Mr Ghai as to how discussions about the Proposed Investment were to be conducted, including any limitations on rights which MMI had against IEL, such as were necessary to facilitate those discussions. 74 MMI also argued that the dispute over whether the Loan Facility was repayable as at 14 April 2021 was raised by IEL in abuse of process given that IEL had previously expressed willingness to make repayment under the Loan Facility on two occasions prior to 9 May 2021 (see [46] above).  The two occasions which MMI pointed to were: (a) first, in the 8 Apr E-mail, when IEL informed MMI that it was not its (IEL’s) intention to withhold payment in accordance with the terms of the Loan Facility (see [11] above); and (b) second, in an e-mail sent on 20 April 2021 by IEL to MMI, when IEL made mention of “the remittance of funds based on the loan agreement” and set out calculations on the accrued interest and applicable default interest from the date the SD was issued.103Foot Note 103×PWS at para 58(b) and Mr Ghai’s 4th Affidavit at p 154.According to the terms of that e-mail, it appeared to have been sentafterthe 20 Apr Letter (see [13] above), in which IEL disputed its liability for the sum claimed in the SD and alleged that it had a cross-claim against MMI. 75 InAnAnGroup([58] above), the Court of Appeal emphasised that the threshold for abusive conduct, which when met would result in the court refusing a stay or dismissal of the winding-up application even if the debtor has shown aprima faciedispute falling within the scope of an arbitration agreement, is very high (at [99]).  One example of abusive conduct is where the debt is admitted by the debtor as regardsbothliability and quantum (seeAnAnGroupat [99]).  In my view, the two instances of IEL’s communications which MMI relied on as evidence of IEL acting in abuse of process fell short of that.  They only showed IEL’s acknowledgment that the relevant sums had been borrowed under the Loan Facility, and at most, its willingness to settle the dispute with MMI in respect of sums outstanding under the Loan Facility.  A willingness to settle is not inconsistent with a non-admission of liability.  More importantly, it is significant that the e-mail of 20 April 2021 in which IEL mentioned remitting funds to MMI pursuant to the Loan Facility had followed the 20 Apr Letter in which IEL had vigorously disputed its liability for the Outstanding Sum claimed in the SD (see [13] above). In those circumstances, I was of the view that that there was at least a dispute, on aprima faciestandard, as to whether IEL’s expressions of willingness to settle the sums outstanding under the Loan Facility  gave rise to an admission of the debt on its part. That dispute, as well as the main dispute over whether the Loan Facility was repayable as at 14 April 2021, should both be referred to arbitration. As the Court of Appeal explained inTjongVery Sumito([60] above)(at [62]): … where the defendant prevaricates; first making an admission and then later purporting to deny the claim on the ground that the admission was mistaken, or fraudulently obtained, or was never made … there might well be a dispute before the court, both over the substantive claim as well as over whether the defendant can challenge the alleged earlier admission, and the matter should ordinarily be referred to arbitration. 76 For the foregoing reasons, I was satisfied that IEL had shown aprima faciedispute over whether the Loan Facility was repayable as at the date when the SD was served on 14 April 2021, which fell within the scope of the arbitration agreement in cl 19 of the Loan Facility.  The appropriate order in this case would be a dismissal of CWU 81 (seeAnAnGroupat [110]-[111]) and thus I ordered so accordingly. 77 For completeness, I should also mention that I rejected MMI’s argument that, even if the implied term as contended for by IEL existed, there would have been an undisputed debt of at least US$1.61m that would nevertheless have become duefrom 9 May 2021, which far exceeded the statutorily-prescribed minimum of S$15,000 under s 125(2)(a) of the IRDA, and so IEL’s argument on this point was nothing more than a technical objection to the timing of the SD and did not disclose any basis to resist the winding-up application.  In my judgment, this reasoning was flawed.  Given that I had been satisfied that there is aprima faciedispute over whether the Loan Facility was repayable as at 14 April 2021, IEL could not be said to be “indebted” (pers 125(2)(a) of the IRDA) to MMI for any part of the sum claimed in the SD as at that date.  As such, MMI could no longer rely on the unsatisfied SD as proof of IEL’s inability to pay its debts within s 125(1)(e) of the IRDA.  Given that MMI had not put forward any other evidence of IEL’s insolvency in its supporting affidavit for CWU 81,104Foot Note 104×Mr Hamid’s 1st Affidavit at para 8.the entire basis on which MMI was seeking the winding-up of IEL had therefore fallen away. 78 I also rejected MMI’s submission that IEL’s failure to make any repayment after 9 May 2021 as at the time of the 14 Jul Hearing would constitute ample evidence of its insolvency.  It must be borne in mind that IEL had also taken the position that it had a valid cross-claim against MMI which exceeded the amount due under the Loan Facility.  That issue of the cross-claim is dealt with later in these grounds (see [87]-[98] below).  IEL’s failure to make any repayment therefore cannot be taken as an indication of its inability to repay debts and did not give rise to any evidence of its insolvency. 79 I also rejected MMI’s argument that the defect associated with the SD - namely, the timing at which it was served - was one that could be cured by the court pursuant to s 264 of the IRDA.  While counsel for MMI did not state so expressly, it was quite apparent that the only subsection in s 264 which could be relevant in this case was s 264(2). It states that winding-up proceedings under the IRDA are not: … invalidated by reason of any procedural irregularity unless the Court is of the opinion that the irregularity has caused or may cause substantial injustice that cannot be remedied by any order of the Court and by order declares the proceeding to be invalid. 80 Section 264(1) provides a non-exhaustive list of what can constitute a “procedural irregularity”.  It states: In this section, … a reference to a procedural irregularity includes a reference to — (a) the absence of a quorum at a meeting of a corporation, at a meeting of directors or creditors of a corporation or at a joint meeting of creditors and members of a corporation; and (b)  a defect, irregularity or deficiency of notice or time. 81 The wording of s 264 of the IRDA substantially replicates that found in s 392 of the Companies Act 1967 (2020 Rev Ed) (“the Companies Act”), which similarly deals with the treatment of procedural irregularities, albeit in the context of proceedings under the Companies Act.  InThioKeng Poon v Thio Syn Pyn and others and another appeal[2010] 3 SLR 143 (“ThioKeng Poon”), which concerned s 392(2) of the Companies Act, the Court of Appeal stated that the threshold burden of showing that the irregularity in question is of a procedural nature rests on the party seeking to uphold the proceeding (at [54]).  The court also held that, to determine whether the non-compliance in question is of a procedural or substantive nature, it must assiduously examine the aim or object of the requirement which was not complied with (ThioKeng Poonat [69]).   It also cited with approval the following proposition formulated by Palmer J inCordiant Communications (Australia) Pty Ltd v The Communications Group Holdings Pty Ltd[2005] NSWSC 1005 on the distinction between procedural and substantive irregularities (seeThioKeng Poonat [66]): … what is a ‘procedural irregularity’ will be ascertained by first determining what is ‘the thing to be done’ which the procedure is to regulate; … if there is an irregularity which changes the substance of ‘the thing to be done’, the irregularity will be substantive; … if the irregularity merely departs from the prescribed manner in which the thing is to be done without changing the substance of the thing, the irregularity is procedural. The application of such a proposition in any particular case will depend upon … defining ‘the thing to be done’. … 82 As the foregoing would suggest, an irregularity arises as a result of non-compliance with procedure or the requirements which govern how something is to be done.  However, there are no requirements as towhena statutory demand must be served if it is to be relied on as the ground for a winding-up application pursuant to s 125(2)(a) of the IRDA.  Of course, the statutory demand must be made in respect of a debt which has accrued, but that is an issue affecting the validity of the statutory demand (seeLKM Investment([58] above)at [15]) rather than a matter of compliance with procedure.  A premature statutory demand made in respect of a debt that has not fallen due for payment is substantively invalid.  I was not satisfied that the defect associated with the SD could be described as anirregularityto begin with.  This was also not a case where the statutory demand had not complied with the procedural requirements in s 125(2)(a) of the IRDA as to form or wording (see,eg,ReDayang Construction and Engineering Pte Ltd[2002] 2 SLR(R) 197 at [14]-[15];BNP Paribas v Jurong Shipyard Pte Ltd[2009] 2 SLR(R) 949 at [14]).  I therefore found s 264(2) of the IRDA to be of no relevance in this case.",
        "Ground 2: that IEL had a cross-claim against MMI exceeding the Outstanding Sum in respect of work done for the Wholesale Business": "83 Just as for the first ground, the preliminary question that I had to consider was the standard to which IEL had to establish its alleged cross-claim against MMI.  Since it was common ground between the parties that the cross-claim was not the subject of any arbitration agreement,105Foot Note 105×DWS at paras 69-70; PWS at para 67.that question was dependent on whether any dispute arising from this cross-claim fell within cl 19 of the Loan Facility. 84 However widely the phrase “any dispute” in an arbitration clause is construed, it would not cover a dispute that is unrelated to the transaction covered by the contract in which the arbitration clause is found, and which arises in respect of a contract that is separate and distinct from the subject contract (seeDalianHualiang Enterprise Group Co Ltd and another v Louis Dreyfus Asia Pte Ltd[2005] 4 SLR(R) 646 (“DalianHualiang”) at [28]-[29]).  InDalianHualiang, the plaintiff made two claims against the defendant under a contract and commenced a suit against the defendant pursuant to those claims.  The contract contained an arbitration clause.  The defendant applied for a stay of the suit on the ground that there was a dispute between the parties which was to be resolved by arbitration.  One such dispute which the defendant alleged was a right of set-off which it said it enjoyed as against, not the plaintiff, but a related entity of the plaintiff, under a separate contract between itself and that entity.  One issue before the court was whether the set-off issue fell within the scope of the arbitration agreement.  Woo Bih Li J (as he then was) held that it did not, because any dispute arising under the separate contract would be distinct from disputes arising under the contract between the plaintiff and the defendant (at [30]). 85 Returning to the present case, IEL’s alleged cross-claim arose from an allegedseparateagreement between MMI and IEL under which the latter was to be compensated in respect of work done for the Wholesale Business. That agreement was distinct from and independent of the Loan Facility.  Accordingly, any cross-claim arising from that agreement did not constitute a dispute that would fall within the scope of cl 19 of the Loan Facility.  If IEL wished to take the benefit of the arbitration agreement in the Loan Facility for the purposes of the cross-claim, the onus was on it to show, either that the alleged agreement with MMI was related to the Loan Facility for the purposes of the arbitration clause, or that the agreement had incorporated cl 19 of the Loan Facility.  That, however, was not the position which IEL had taken in these proceedings. 86 Accordingly, the applicable standard in respect of IEL’s alleged cross-claim was the triable issue standard.  IEL had to establish that it enjoyed a genuine and substantial cross claim that exceeded the Outstanding Sum claimed in the SD, on account of MMI having agreed to compensate it for work done in respect of the Wholesale Business, which raised at least triable issues.  For the reasons that follow, I was satisfied that IEL had done so. 87 MMI did not make substantive submissions as to whether the quantum of the asserted cross-claim (US$9,452,071.68) was justifiable and whether there was a basis for IEL to take the position that the cross-claim exceeded the amount due under the Loan Facility.  Instead, MMI contended that there was no evidence of any alleged agreement under which MMI was to compensateIELfor work done in respect of the Wholesale Business.  It was correct that the 29 Mar E-mails (see [36] above),106Foot Note 106×Mr Ghai’s 4th Affidavit at pp 433-434.which Mr Ghai pointed to as evidence of that agreement, referred toMrGhai’scompensation forhiscontribution to the Wholesale Business.  In the first of the 29 Mar E-mails, Ms Mitpaibul wrote to Mr Hamid, saying that “[t]he contribution that Anshu [Mr Ghai] has put into getting MM [the MM Group]/MPS into Myanmar for wholesale business is much more the [sic] unpaid receivables outstanding”.  The “unpaid receivables outstanding” referred to a series of outstanding invoices due from IEL to “Kilocal” (which appeared to be a reference to KL) for fuel stock which IEL had obtained from KL for use in the Retail Project.107Foot Note 107×Mr Ghai’s 4th Affidavit at pp 407-413.In the second of those e-mails, Mr Hamid replied to Ms Mitpaibul and requested that IEL give him a figure in respect of Mr Ghai’s contribution.  Mr Hamid also suggested three parameters by which that figure could be quantified: cost of license and setup; time cost of employees prior to handover; and a percentage service fee.  Mr Hamid also described the quantification process as a “simple exercise” as Mr Ghai “has always maintained he does this as a consultant for companies”.  Similarly, the cover letter accompanying the 30 Apr Invoice,108Foot Note 108×Mr Ghai’s 3rd Affidavit at p 114.which was prepared pursuant to the 29 Mar E-mails, also referred to the agreement between the MM Group and Mr Ghai for the latter to be paid a “reasonable fee” for his “contributions and/or services rendered to MMG [the MM Group] in relation to setting up its wholesale business operations in Myanmar”.109Foot Note 109×PWS at para 62.Therefore, it appeared that what Mr Ghai identified as evidence of the alleged agreement underlying IEL’s cross-claim concerned compensation to which he waspersonallyentitled. 88 In my judgment, a slightly different picture emerged when the 29 Mar E-mails were viewed against the totality of the correspondence exchanged between Mr Hamid and Ms Mitpaibul.  The 29 Mar E-mails could be traced back to a dispute which had arisen between IEL and the MM Group in early March 2021 in respect of payments due from IEL to KL for fuel stock that IEL had obtained from KL for use in the Retail Project,110Foot Note 110×Mr Ghai’s 4th Affidavit at pp 407-413.which I had just alluded to (see [87] above)  The amounts due were described in Ms Mitpaibul’s e-mail of 10 March 2021 to Mr Hamid as the “outstanding invoices”.111Foot Note 111×Mr Ghai’s 4th Affidavit at pp 404-407.In that same e-mail, Ms Mitpaibul mentioned that the amounts in those invoices were “small and insignificant in comparison to the entire 2020 operating cost of IBE [IEL’s] resources for the wholesale business”. She also said: The fact that IBE [IEL] facilitate MM group [the MM Group] in all the groundwork, market entry, getting Kilocal set up with licenses in Myanmar, securing storage for Kilocal, setting up offices & permits, helping set up furniture, IT, and purchasing cars, with delayed cost allocation for more than a year was purely due to the relationship & handshake that happened in London on the understanding of building a strong partnership. … 89 In that same e-mail, Ms Mitpaibul also informed Mr Hamid that Mr Ghai wished to resign as a director of MPS and transfer his 20% shareholding in MPS to MMI.  Mr Hamid replied on 11 March 2021 and agreed to this proposal.112Foot Note 112×Mr Ghai’s 4th Affidavit at pp 400-404.But, in that e-mail, Mr Hamid did not disagree with Ms Mitpaibul that the abovementioned work had been undertaken byIELand even asked that Ms Mitpaibul provide a breakdown of those costs, which he suggested could be offset against the outstanding invoices: From your email you have indicated IBE [IEL] handled the setup, importing, selling etc. to customers on our behalf during the time when Kilocal was being established. Please specify and allocate this break down. We have always maintained separation between wholesale and retail … Happy to settle out and offset it against the amounts that were purchased by IBE [IEL] for local consumption prior to Kilocal’s involvement… 90 Ms Mitpaibul replied to Mr Hamid’s e-mail on 18 March 2021. She acknowledged Mr Hamid’s suggestion and prepared the following “action point” for follow-up:113Foot Note 113×Mr Ghai’s 4th Affidavit at pp 416-419. IBE [IEL] to prepare the list of service provided for MM group from the beginning to date (breakdown) & prepare an invoice for MM Group (this will take approx. 3-4 weeks to gather all the detail of task [sic] performed over the last on [sic] year) Agreed that IBE [IEL] outstanding [referring to the outstanding invoices] to MM [the MM Group] can be partially offset with the invoice [referring to the invoice which IEL was to prepare for services provided to the MM Group] 91 Mr Hamid replied to Ms Mitpaibul’s e-mail on 22 March 2021.  Again, he did not take the position that IEL had not rendered any services to the MM Group in respect of the Wholesale Business.  Instead, he said, “[o]ther than the setup Iceberg [IEL] added no cash or value to the wholesale business”.114Foot Note 114×Mr Ghai’s 4th Affidavit at pp 415-416. 92 On 19 March 2021, the MM Group’s corporate secretary e-mailed Ms Mitpaibul, attaching the relevant documents necessary to effect Mr Ghai’s resignation as a director of MPS and the share transfer form for Mr Ghai’s 20% stake in MPS.  The share transfer form stated that Mr Ghai’s MPS shares were to be transferred to MMI for S$1.115Foot Note 115×Mr Ghai’s 4th Affidavit at pp 437-439.On 29 March 2021, Ms Mitpaibul replied to that e-mail (in which Mr Hamid appeared to have been copied) disagreeing with the proposal to transfer Mr Ghai’s shares at the value of S$1 “as there are other matters that need to be addressed in term [sic] of business contribution / valuation”.116Foot Note 116×Mr Ghai’s 4th Affidavit at pp 435-436.Mr Hamid, copying Ms Mitpaibul’s reply, said:117Foot Note 117×Mr Ghai’s 4th Affidavit at pp 435-436. The value of the share transfer can be 1 dollar andyou guyscan bill [sic] is forservices renderedagainst the value of the 2019 receivable that wasn’t paid – as addressed in point 1 in the other email. [emphasis added] The “2019 receivable” appeared to be a reference to the outstanding invoices that had been the subject of discussion in the e-mails exchanged earlier.  It was in response to Mr Hamid’s e-mail that Ms Mitpaibul sent the first of the 29 Mar E-mails (see [87] above) and said that “[t]he contribution that Anshu [Mr Ghai] has put into getting MM [the MM Group]/MPS into Myanmar for wholesale business is much more the [sic] unpaid receivables outstanding”.118Foot Note 118×Mr Ghai’s 4th Affidavit at pp 433-434. 93 In my judgment, three points could be gleaned when the 29 Mar E-mails were viewed in the totality of the correspondence exchanged between Mr Hamid and Ms Mitpaibul.  First, it did appear that IEL had undertaken some work in respect of the Wholesale Business.  As is evident from the e-mails that I have set out earlier, Mr Hamid never refuted Ms Mitpaibul’s assertions that IEL had undertaken such work.  If IEL had indeed never undertakenanywork in respect of the Wholesale Business, a position which MMI maintained in these proceedings,119Foot Note 119×Mr Chua’s 2nd Affidavit at para 56.then it was surprising that Mr Hamid never disagreed with Ms Mitpaibul’s claim at the earliest opportunity possible.  Not only that, Mr Hamid even agreed that the cost of such work could be offset against the outstanding invoices due from IEL.  That would mean that he accepted that amounts were indeed owing to IEL in respect of the parties’ collaboration on the Wholesale Business.  Notably, in his e-mail of 22 March 2021 (see [91] above), Mr Hamid said: “[o]ther than the setup Iceberg [IEL] added no cash or value to the wholesale business”.  This, in my view, appeared to be an implicit acceptance that IEL had indeed performed the work and setup which Ms Mitpaibul had mentioned in the earlier e-mails, but that IEL did no more than that. 94 Second, the work which Mr Ghai is said to have performed for the Wholesale Business, and for which he was to be compensated asperthe terms of the 29 Mar E-mails, appeared to be the same work which Ms Mitpaibul said IEL had undertaken in the e-mails exchangedbeforethe 29 Mar E-mails.  Up until the 29 Mar E-mails, the reference had been to the work doneby IELand it was only in the first of the 29 Mar E-mails that Ms Mitpaibul talked about the contributions that Mr Ghai had put into the Wholesale Business (see [92] above).  Despite the specific reference to Mr Ghai’s contributions, there was nothing to suggest that Ms Mitpaibul had something else in mind other than what the parties had been discussing earlier.  Further, the parameters which Mr Hamid suggested Mr Ghai’s compensation could be quantified (which he sent to Ms Mitpaibul in the second of the 29 Mar E-mails: see [87] above), namely the cost of license and setup, time cost of employees and percentage service fee, corresponded closely with the nature of the services which Ms Mitpaibul said IEL had provided in her earlier e-mails.  It therefore appeared that the work which IEL had undertaken for the Wholesale Business was regarded as being synonymous with that undertaken by Mr Ghai. 95 Third, notwithstanding the specific references to Mr Ghai’s compensation in the 29 Mar E-mails, it appeared that IEL had been regarded as the party entitled to be paid for all such services which Mr Ghai had rendered (as already mentioned, it appeared that those services were synonymous with the work which IEL had undertaken for the Wholesale Business).  That was why Mr Hamid had suggested that the cost of those services rendered could be offset against the outstanding invoices, which were sums due from IEL (see [89] and [92] above).  Ms Mitpaibul never disagreed (which she presumably would have if any compensation for those services was to be paid to Mr Ghaipersonally) but only responded to say that the value of any such services rendered was far in excess of the amounts represented by the outstanding invoices (see [92] above). 96 All this context took on some significance when viewed against the fact that MMI never objected to the 30 Apr Invoice being issued by IEL instead of by Mr Ghai in his personal capacity.  MMI also did not raise any issue with the fact that the 30 Apr Invoice required payment to be made to IEL’s bank account, even though it purportedly concerned remuneration to which Mr Ghai himself was entitled. 97 Although MMI did not appear to have been directly involved in the Wholesale Business, which had been carried out through MPS’s Myanmar-incorporated subsidiaries such as KML and KL, it did appear to be a distinct possibility that MMI had been regarded by the parties as the entity against which any claim for compensation arising out of the conduct of the Wholesale Business, such as the cross-claim, might be maintained.  This is because MMI had been the relevant point of contact in respect of all matters relating to the Wholesale Business.  For instance, the agreement for Mr Ghai to be entitled to 20% of profits of the Wholesale Business was made withMMI.  It was also Mr Hamid, MMI’s managing director, that had been engaging in discussions with Mr Ghai about the Wholesale Business, and served as the point of contact in respect of Mr Ghai’s queries about the profit and loss status of the Wholesale Business.120Foot Note 120×PWS at para 65.. 98 Therefore, I was satisfied that IEL had shown that it enjoyed a genuine and substantial cross-claim of US$9,452,071.68 against MMI for sums due from the parties’ collaboration on the Wholesale Business.  There ought to be a trial to determine: (a) whether IEL had indeed undertaken work in respect of the Wholesale Business for which it was to be compensated; (b) whether the correct party to assert any such claim for compensation was Mr Ghai or IEL; and (c) whether MMI or some other entity within the MM Group was liable in respect of this claim.  As already explained, the evidence before the court did suggest that it might well be IEL that was entitled to assert the claim against MMI.  The triable issues in relation to the cross-claim provided a separate basis for the court to dismiss MMI’s winding-up application against IEL.",
        "Conclusion": "99 For the foregoing reasons, I dismissed CWU 81.  Given all the circumstances of the case, including the late request to make the further arguments which eventually carried the day for IEL, I was of the view that the appropriate order was that both parties were to bear their own costs for SUM 3994 and CWU 81, and thus ordered as such.  Ang Cheng HockJudge of the High Court Chan Tai-Hui Jason SC, Mak Sushan Melissa, Zeslene Mao Huijing and Low Ee Ning (Allen & Gledhill LLP) for the plaintiff; Lee Eng Beng SC, Sim Jek Sok Disa, Seow Kailynn Dawn, Jodi Siah Be Koen and Benedict Tedjopranoto (Rajah & Tann Singapore LLP) for the defendant."
    }
}