{
    "case_title": "Natixis, Singapore Branch vLim Oon Kuin and others",
    "ncitation": "[2023] SGHC 301",
    "coram": "S Mohan J",
    "sections": {
        "Facts": "",
        "The parties": "3 The plaintiff is Natixis, Singapore Branch, the Singapore branch of a French corporate and investment bank.1Foot Note 1×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 1; Defence of the 2nd defendant in HC/S 188/2021 at para 6. 4 The 1st defendant was, at all material times, the managing director of both Hin Leong Trading (Pte) Ltd (“HLT”) and Ocean Tankers (Pte) Ltd (“OTPL”). On 17 April 2020, he resigned from both positions.2Foot Note 2×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 2; Defence of the 2nd defendant in HC/S 188/2021 at para 7(a). 5 The 2nd defendant and the 3rd defendant are the 1st defendant’s son and daughter respectively.3Foot Note 3×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 4; Defence of the 2nd defendant in HC/S 188/2021 at para 9(a).As at the date of the filing of the 2nd defendant’s defence (on 30 March 2021), it was undisputed that the 2nd and 3rd defendants were directors of HLT and OTPL.4Foot Note 4×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 4; Defence of the 2nd defendant in HC/S 188/2021 at para 9(b).According to the plaintiff, the 2nd and 3rd defendants were, at all material times, directors of HLT and OTPL. 6 HLT is in the business of oil trading; and OTPL is in the business of ship chartering, operation and management.5Foot Note 5×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 3; Defence of the 2nd defendant in HC/S 188/2021 at para 8(c)–(d).The 1st, 2nd and 3rd defendants (collectively, the “Lim Family”) were, at all material times, the only shareholders of HLT; and the 2nd and 3rd defendants were, at all material times, the only shareholders of OTPL.6Foot Note 6×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 5; Defence of the 2nd defendant in HC/S 188/2021 at para 10(a). 7 The 4th defendant (“UTSS”) is in the business of specialised storage of oil and oil products and operates a storage facility (the “UT Facility”).7Foot Note 7×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 6.UTSS was, at the material time, wholly owned by Universal Terminal (S) Pte Ltd (“UTPL”), which was in turn owned by the following entities: (a) Universal Group Holdings (Pte) Ltd (“UGH”) – 41%; (b) Petrochina International (Singapore) Pte Ltd – 25%; and (c) MAIF Investments Singapore Pte Ltd – 34%.8Foot Note 8×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at paras 7–8; Defence of the 2nd defendant in HC/S 188/2021 at para 11(a)–(b). 8 UGH was, at all material times, wholly owned by the Lim Family members. They were also, at all material times, directors of UGH; the 1st defendant resigned as director of UGH on 17 April 2020.9Foot Note 9×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 10; Defence of the 2nd defendant in HC/S 188/2021 at para 11(c)–(d). 9 The 1st and 2nd defendants were also, at all material times, directors of UTPL and UTSS; the 1st defendant resigned as a director of UTPL and UTSS on 17 April 2020. The 3rd defendant was subsequently appointed as a director of UTPL and UTSS on 8 May 2020. In addition to being a director, the 2nd defendant was also the Chief Executive Officer (“CEO”) of UTPL and UTSS, until his resignation on 17 December 2020.10Foot Note 10×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at paras 6, 9; Defence of the 2nd defendant in HC/S 188/2021 at para 11(e), (h), (i) and (j).",
        "Background to the dispute": "10 It was undisputed that the plaintiff and HLT had a banking relationship.11Foot Note 11×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 50; Defence of the 2nd defendant in HC/S 188/2021 at para 33(b).The plaintiff’s case in HC/S 188/2021 (“S 188”) is that the plaintiff and HLT had a credit facility agreement, pursuant to which the plaintiff would grant a credit facility to HLT for the purpose of financing the Lim Family’s oil trading and storage business.12Foot Note 12×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 53.As part of the agreement, HLT assigned to the plaintiff all its rights, title and interest in and to the goods financed by the plaintiff13Foot Note 13×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 59.and also pledged to the plaintiff the goods in respect of which financing was provided, as security for the financing provided by the plaintiff.14Foot Note 14×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 61. 11 In sum, the plaintiff’s allegation in S 188 is that the Lim Family, HLT and OTPL had engaged in numerous wrongful acts such as: (a) unauthorised dealings with, and making false declarations in respect of, cargo that had been pledged to various security holders including the plaintiff, with the aid of the UT Facility;15Foot Note 15×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 186.(b) the buying and selling of non-existent cargo for the purposes of obtaining financing from banks including the plaintiff; and (c) fabricating various documents such as bills of lading, sale contracts and invoices for the purposes of obtaining the said financing.16Foot Note 16×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 192. 12 The plaintiff avers that the 1st defendant was directly involved in and had knowledge of the aforementioned wrongful acts;17Foot Note 17×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 196.the 2nd and 3rd defendants were directly involved in, had knowledge of and/or had acquiesced in the wrongful acts;18Foot Note 18×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 197.and that the companies directly or indirectly owned by the Lim Family (the “Lim Group Companies”) were also directly involved in, had knowledge of and/or had acquiesced in the wrongful acts.19Foot Note 19×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 198.It is also averred that the Lim Family had complete control over the Lim Group Companies and the Lim Family’s oil trading business, and that through the unlawful combination between the Lim Family and the Lim Group Companies they were able to carry out the wrongful acts as well as conceal the same.20Foot Note 20×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at para 203. 13 The pleaded claims levelled by the plaintiff against the defendants in S 188 include: (a) deceit and misrepresentation by the 1st to 3rd defendants; (b) breach of the credit facility agreement and inducement of breach by the 1st to 3rd defendants; (c) breach of the storage bills of lading contracts and the trade bills of lading contracts and inducement of breach of the same by the 1st to 3rd defendants; (d) conversion by the 1st to 4th defendants; (e) breach of bailment, inducement of breach and wrongful detention of goods by the 1st to 4th defendants; (f) unlawful means conspiracy by the 1st to 4th defendants; and (g) unjust enrichment of the 1st to 4th defendants.21Foot Note 21×Statement of Claim (Amendment No. 2) in HC/S 188/2021 at paras 213–258. 14 The crux of the 2nd defendant’s defence is that he did not carry out HLT’s, OTPL’s, UTPL’s and UTSS’ day to day operations or commercial activities, and neither did he instruct and/or supervise the employees who carried out the day to day operational and commercial activities of those entities.22Foot Note 22×Defence of the 2nd defendant in HC/S 188/2021 at paras 10 and 11.He was also not involved in HLT’s accounting matters or decisions and did not instruct and/or supervise the employees in HLT’s accounts department.23Foot Note 23×Defence of the 2nd defendant in HC/S 188/2021 at para 26(b).",
        "Background to the specific discovery application in SUM 878": "15 On 2 December 2021, the 2nd defendant filed his list of documents in S 188 (the “LOD”) providing general discovery of documents that were within his PCP. The LOD disclosed only six documents comprising some stock valuation reports and financial profit and loss statements of HLT.24Foot Note 24×12th Affidavit of Lee Jing Yi dated 29 March 2023 (“12-LJY”) at para 8; Tab 1 of 12-LJY at pp 35–120. 16 On 24 March 2022, pursuant to the court’s directions, the plaintiff’s solicitors sent a request for specific discovery to the 2nd defendant seeking the disclosure of 16 categories of documents.25Foot Note 25×12-LJY at para 10; Tab 2 of 12-LJY at pp 122–133.These categories included communications between the 2nd defendant on the one hand, and HLT, OTPL, UTSS and other members of the Lim Family on the other, relating to various transactions. On 14 April 2022, the 2nd defendant’s solicitors responded to the request, stating that the plaintiff was “fishing” and that apart from those six documents disclosed in the LOD, there were no other documents in the 2nd defendant’s PCP that were responsive to the plaintiff’s specific discovery request.26Foot Note 26×12-LJY at para 11; Tab 3 of 12-LJY at p 135. 17 On 12 September 2022, HLT and its liquidators agreed to provide limited discovery of HLT’s documents to the plaintiff in respect of S 188 pursuant to an agreed e-discovery protocol (the “HLT Discovery”).27Foot Note 27×12-LJY at para 12; Letter from plaintiff’s solicitors to the court dated 13 September 2022 at para 4.The HLT Discovery revealed to the plaintiff for the first time the existence of the “Lonestar” Hotmail Account (which was the 2nd defendant’s personal email account), and that: (a) the 2nd defendant had a practice of regularly forwarding emails from his HLT Email Account to the “Lonestar” Hotmail Account pursuant to an “auto-forwarding” system in place; and (b) the 2nd defendant was regularly “blind copied” (or “bcc”) in emails pertaining to HLT’s day to day operational and commercial matters involving HLT’s, OTPL’s and UTSS’ employees, trade customers, trade finance banks and cargo surveyors.28Foot Note 28×12-LJY at para 13.On 27 October 2022, the plaintiff filed a supplemental list of documents disclosing a total of 342 emails obtained from the HLT Discovery.29Foot Note 29×12-LJY at para 14; 5th Affidavit of Lee Jing Yi dated 27 October 2022 at pp 5–69. 18  On 18 November 2022, the plaintiff’s solicitors wrote to the 2nd defendant’s solicitors stating that the plaintiff had “good reason to believe that [the 2nd defendant] has, or at some time had, in his possession, custody or power the documents responding to the [specific discovery request]” and requested that the 2nd defendant provide discovery of the same.30Foot Note 30×12-LJY at para 15; Tab 4 of 12-LJY at pp 137–139.On 28 November 2022, the 2nd defendant reiterated through his solicitors his position that the plaintiff was “fishing” for documents. However, he went on to make the following claims:31Foot Note 31×12-LJY at para 16; Tab 4 of 12-LJY at pp 140–142. (a)HLT Email Account: The 2nd defendant did not deny that this is his personal email account but claimed to have lost access to the same “sometime after June 2020 after HLT moved from its previous office at Tuas” and, further, that the HLT Liquidators “now manage HLT’s affairs, business and property and have been doing so since on or around 27 April 2020”; (b)“Lonestar” Hotmail Account: The 2nd defendant claimed that he could no longer access that email account because he could not remember the password to that email account. He had “attempted to reset/retrieve his password to that email account, but was unable to do so, because he no longer has access to the linked authentication method(s) and/or device(s) since in or around June 2020”; (c) In addition to the “Lonestar” Hotmail Account, the 2nd defendant also admitted to having four other personal email accounts. Notably, he had a “Lonestar” Yahoo Email Account, where, similar to the “Lonestar” Hotmail Account, the 2nd defendant claimed that he could not remember the password and was unable to retrieve the same. 19 On 8 December 2022, the plaintiff’s solicitors responded by letter, rejecting the 2nd defendant’s “bare and convenient assertions which [were] bereft of particulars and, accordingly, any credibility” and requested that he state on affidavit all the assertions made in his solicitor’s letter dated 28 November 2022 together with certain particulars, including: (i) what steps were taken to retrieve the “Lonestar” Email Accounts; (ii) what are the linked authentication method(s) and/or device(s) and what steps and information are required to retrieve the “Lonestar” Email Accounts; and (iii) if a linked authentication method is the HLT Email Account, whether the 2nd defendant sought the HLT Liquidators’ assistance to retrieve the “Lonestar” Email Accounts.32Foot Note 32×12-LJY at para 18; Tab 4 of 12-JY at pp 143–145. 20 On 10 January 2023, the 2nd defendant filed an affidavit to confirm that he did not have in his PCP any document responsive to the specific discovery request.33Foot Note 33×12-LJY at para 23; 7th Affidavit of Lim Chee Meng dated 10 January 2023 (“7-LCM”) at para 16.In relation to the “Lonestar” Yahoo Email Account, the recovery options to retrieve and/or reset his password included: (a) emailing a code to his HLT Email Account, which he had lost access to and in any case was within the control of the HLT Liquidators;34Foot Note 34×7-LCM at paras 18–20.(b) sending a code to the mobile phone number 8*** **60; and (c) sending a code to the mobile phone number 8*** **91.35Foot Note 35×7-LCM at para 27(b).The two mobile numbers corresponded to the 2nd defendant’s iPhone X and Huawei Phone respectively (the “Handphones”), which had been seized by and were in the possession of the CAD. Thus, the 2nd defendant did not have access to them or any code sent to those two mobile numbers.36Foot Note 36×7-LCM at para 27(d).In relation to the “Lonestar” Hotmail Account, the only recovery method was emailing a code to the 2nd defendant’s HLT Email Account.37Foot Note 37×7-LCM at para 28(b). 21 Dissatisfied with the contents of the 2nd defendant’s affidavit dated 10 January 2023, the plaintiff’s solicitors sent a letter to the 2nd defendant on 1 February 2023, requesting that the 2nd defendant state whether he had made any request to the CAD in respect of: (a) obtaining the recovery code(s) from the Handphones that would enable the 2nd defendant to recover access to the “Lonestar” Email Accounts; or (b) obtaining a clone or backup copy of the flash/storage drives of the Handphones including the text messages therein (such as SMS, WhatsApp, and WeChat) for the purposes of disclosing phone communications in respect of matters relevant to S 188. The 2nd defendant was also asked to state whether the mobile phone numbers were still registered under his name; and if so, whether he still had the SIM cards, and if not, whether he had contacted the relevant telecommunications service providers (“telcos”) to deactivate the SIM cards and obtain new SIM cards which would allow him to continue using the mobile numbers on new devices.38Foot Note 38×12-LJY at para 25; Tab 6 of 12-LJY at pp 163–165.On 8 February 2023, the 2nd defendant’s solicitors replied, stating that the 2nd defendant would not provide the information requested.39Foot Note 39×12-LJY at para 26; Tab 6 of 12-LJY at pp 166–167. 22 As a result, on 29 March 2023, the plaintiff filed SUM 878, seeking an order for specific discovery against the 2nd defendant pursuant to O 24 r 5 of the Rules of Court 2014 (2020 Rev Ed) and/or the inherent jurisdiction of the court. 23 On 18 May 2023, the AR ordered that the 2nd defendant was to take steps to locate, obtain and disclose the “Compound Documents” (defined as the 2nd defendant’s (a) “Lonestar” Yahoo Email Account; (b) “Lonestar” Hotmail Account; (c) iPhone X; and (d) Huawei Phone) or a copy thereof, where such steps included writing to make the relevant requests to the CAD and the HLT Liquidators. 24 Dissatisfied with the orders made, the 2nd defendant filed RA 100 on 26 May 2023 appealing against the AR’s decision. On 29 May 2023, by way of HC/SUM 1600/2023 (“SUM 1600”), the 2nd defendant also applied for a stay of the execution of the AR’s order (save for the orders made on costs of SUM 878), pending the final determination of RA 100; SUM 1600 was dismissed by the AR on 23 June 2023. The 2nd defendant did not appeal the dismissal of SUM 1600.",
        "The parties’ cases": "25 At its core, the 2nd defendant’s case was that he had no power over the Compound Documents and therefore could not be ordered to give discovery of them.40Foot Note 40×2nd Defendant’s Written Submissions in RA 100 at para 17.In respect of the Email Accounts, the 2nd defendant had forgotten the passwords and his attempts to retrieve the passwords were unsuccessful. One of the password recovery methods was for an email code to be sent to his HLT Email Account, but that email account was no longer accessible to the 2nd defendant as it was within the control of the HLT Liquidators.41Foot Note 41×2nd Defendant’s Written Submissions in RA 100 at para 18(a).In respect of the Handphones, the 2nd defendant no longer had access to them because they had been seized by the CAD, and he did not have an absolute and unqualified right to request for the Handphones to be returned to him.42Foot Note 42×2nd Defendant’s Written Submissions in RA 100 at para 18(b).The 2nd defendant relied on the English case ofLonrho Ltdand another v Shell Petroleum Co Ltd and another[1980] 1 WLR 627 (“Lonrho”) to assert that a document is not within a party’s power if he has to take steps to enable him to acquire a right to obtain the documents; as such, the Compound Documents were not within his power as he required the consent of the CAD and/or HLT Liquidators to obtain them.43Foot Note 43×2nd Defendant’s Written Submissions in RA 100 at para 22.Further, any obligation to undertake reasonable searches for documents ought not to go beyond what a party does not have PCP of.44Foot Note 44×2nd Defendant’s Written Submissions in RA 100 at para 12. 26 The plaintiff’s case comprised two main contentions. First, every party has a duty to conduct a reasonable search for relevant and material documents in his PCP as part of his discovery obligations, and this is a necessary precedingstep to be carried out in order to identify the documents in one’s PCP for disclosure.45Foot Note 45×Plaintiff’s Written Submissions in RA 100 at paras 14 and 17.Therefore, the 2nd defendant’s argument that the obligation to undertake reasonable searches does not extend to what a party does not have PCP of effectively placed the cart before the horse.46Foot Note 46×Plaintiff’s Written Submissions in RA 100 at para 17.Second, the test for determining whether a party has power over certain documents is not that of “absolute power”, but the “practical ability to access or obtain” those documents; in this case, the 2nd defendant did have such practical ability.47Foot Note 47×Plaintiff’s Written Submissions in RA 100 at para 18.",
        "Analysis and decision": "",
        "Whether there was a reasonable suspicion that there were further documents to be discovered": "27 It is axiomatic that an affidavit verifying a party’s list of documents isgenerallyregarded as conclusive. However, the court may order further discovery if it has a reasonable suspicion that there are further documents to be discovered:Soh Lup Chee and others v Seow Boon Cheng and another[2002] 1 SLR(R) 604 at [9]. That suspicion may arise because the disclosed documents themselves demonstrate that there are other underlying documents that are in the party’s PCP and have not been disclosed; or it could, in an appropriate case, be inferred from the circumstances that there are or must be other documents in the party’s PCP that have not been disclosed. 28 In the present case, as I mentioned at [15] above, the 2nd defendant’s LOD in S 188 consisted of only six documents. Not a single communication between the 2nd defendant and his employees and/or fellow directors was disclosed. 29 In my view, a reasonable suspicion did exist that there were further documents relating to the matters in question in S 188 to be discovered, for example communications between the 2nd defendant and his employees and/or fellow directors, and that such communications could be found in the Compound Documents. In this regard, it was not contested that the Compound Documents comprise the 2nd defendant’spersonalmobile phones andpersonalemail accounts. I was satisfied that a reasonable suspicion did exist that other relevant documents, such as communications between the 2nd defendant and his employees and/or fellow directors in HLT, OTPL, UTPL and UTSS on matters directly or indirectly relevant to the issues to be determined in S 188, were likely to exist among the Compound Documents. 30 To be clear, before an order for further discovery may be made in such circumstances, it is not necessary, and neither is it a prerequisite, that the applicant must make out a case that the defendant has suppressed or is continuing to suppress documents. For the avoidance of doubt, I made no such findings in arriving at my decision.",
        "Whether the Compound Documents were in the possession, custody or power of the 2nd defendant": "31 Apart from demonstrating the likely existence of further documents that have not been disclosed by an opposing party, the applicant would also need to demonstrate that those documents are in the PCP of the opposing party. In this case, the question of whether the Compound Documents were in the 2nd defendant’s PCP was vigorously contested. 32 The law is clear that a party has a duty to take reasonable steps to search for relevant and material documents and to be satisfied that he has complied with his discovery obligations,beforethe affidavit verifying the list of documents can properly be treated as conclusive. This would include the usual statement in the verifying affidavit that the deponent does not have any other document in his PCP. Where the documents may lie with athird party, the duty extends to making reasonable efforts to request for the relevant documents:Saxo Bank A/S v Innopac Holdings Ltd[2022] 3 SLR 964 at [63];SK Shipping Co Ltd v IOF Pte Ltd[2012] SGHCR 14 at [38];Hai Jiao 1306 Ltd and others v Yaw Chee Siew[2020] 3 SLR 142 (“Hai Jiao”) at [47];Phones 4U (in administration) v EE Ltd and others[2021] EWCA Civ 116 at [26] and [28]. In my view, that must be the case; otherwise, the mere fact that documents (including in this case, the Compound Documents) lie with a third party would be a “convenient ruse” for not providing discovery, even if those documents could be easily requested from the third party:Hai Jiaoat [47]. A particularly wily defendant could even deliberately put documents within the possession of a third party in order to then use that as an excuse not to provide discovery. 33 The 2nd defendant’s argument was that there could be no obligation to take reasonable investigative stepsbecausehe had no PCP over the Compound Documents. I was not convinced by this argument, which was in any event not supported by any authority. 34 The submission that PCP is aprerequisitefor the obligation to take reasonable steps to search for the Compound Documents is, in my view, artificial and practically illogical. The very purpose of taking reasonable investigative steps is to determine whether the requested documents come within the party’s PCP in the first place, in order for that party to then be satisfied that he has properly complied with his discovery obligations. The 2nd defendant’s argument was therefore circuitous. The obligation to take reasonable steps to search for the relevant and material documents on the one hand, and PCP on the other, cannot be decoupled in the way the 2nd defendant envisioned. 35 Further, even taking the 2nd defendant’s case at its highest, the plaintiff had, in my view, established aprima faciecase that the 2nd defendantdidhavepowerover the Compound Documents. In this regard, where the producing party has the practical ability to access or obtain documents held in the possession of the third party, the producing party may be found to have a sufficient degree of control as to constitute power; the practical ability to obtain those documents is to be seen and assessed in context:Hai Jiaoat [46];Dirak Asia Pte Ltd and another v Chew Hua Kok and another[2013] SGHCR 1 at [35]–[36]. 36 In the present case, it was not disputed that the Compound Documents comprised the 2nd defendant’spersonalmobilephones and email accounts. It was, firstly, open to the 2nd defendant to request for new SIM cards from his telcos in order to access the recovery codes from his Handphones to retrieve his “Lonestar” Yahoo Email Account. I did not accept that the only way to access the recovery codes was for the 2nd defendant tophysicallyhave the Handphones in question or the particular SIM cards within them. The 2nd defendant could have also written to the HLT Liquidators to seek their assistance to use the HLT Email Account for the simple purpose of retrieving the recovery codes for both his “Lonestar” Email Accounts. He could have also written to the CAD to request for either the return of the Handphones or a clone copy of the Handphones (including the WhatsApp messages therein), explaining that he needed to access the recovery codes from his Handphones in order to disclose any relevant communications contained therein for the purposes of S 188. The 2nd defendant did not avail himself of any of these options. Nor did he even attempt to do so. In those circumstances, it was not open to the 2nd defendant to sit on his hands and do nothing, and then claim a practical inability to access or obtain documents. Otherwise, the court would be permitting the 2nd defendant to stand in his own way and block his own path. 37 My analysis above is sufficient to distinguish the present case fromLonrho, which the 2nd defendant sought to rely on for the proposition that “power” must mean “a presently enforceable legal right to obtain from whoever actually holds the document inspection of it without the need to obtain the consent of anyone else” (at 635). InLonrho, the House of Lords held that the defendants did not have “power” over documents in the possession of their subsidiary companies as control over those documents was vested in the subsidiary companies’ board of directors and the defendants had no legal right to inspect or take copies of them (at 634). The plaintiff inLonrhocontended that the defendants could have taken a series of steps to acquire such a legal right, such as procuring the subsidiary companies to alter their articles of association and to apply for a ministerial licence permitting the disclosure (as disclosure of those documents was otherwise prohibited under the local law of some of these subsidiaries) (at 634–635). The House of Lords found that “in the absence of a presently enforceable right”, the defendants were not compelled to take such steps to acquire such a legal right. 38 It was plain to me thatLonrhodealt with significantly different circumstances from those in the present case. Indeed, Lord Diplock expressed inLonrhothat the appeal was dismissed “on its own special facts” (at 636). In my view, the proposition inLonrhothat “power” must mean “a presently enforceable legal right” over the documents must be understood in its context. InLonrho, discovery was sought from the defendant companies of documents that belonged to and were in the possession of the defendants’ subsidiary companies, which were in turn distinct and separate legal entities governed by their own respective boards of directors, who held the keys to those documents. 39 Even if I were to accept the 2nd defendant’s arguments that applyingLornho, the court must first find that the party has a “presently enforceable legal right” to the documentsbeforethe court can consider that the party has power over those documents and thus can be ordered to disclose them, I was of the view that the 2nd defendantdidhave those rights over all of the Compound Documents. After all, they are allhispersonaldocuments – unlike the documents in question inLornho, which effectively belonged to third parties. 40 For the “Lonestar” Email Accounts, the fact that the password recovery modes mightresidewith a third party did not, in my judgment, dilute the 2nd defendant’s legal right to the “Lonestar” Email Accounts. 41 As for the Handphones, it is clear fromGoldring Timothy Nicholas and others v Public Prosecutor[2013] 3 SLR 487 that the 2nd defendant did have a common law legal right to gain access to the Handphones, whether by way of a request to the CAD for a copy or clone of the contents of the Handphones, or the right to have the Handphones returned to him. The fact that these rights may not be unqualified was beside the point and in fact, missed the forest for the trees. What was undeniable was that there still existed, in the 2nd defendant’s favour, alegally enforceable rightto the Handphones and/or their contents. Thus, even on the 2nd defendant’s case, applying the “presently enforceable legal right” testperLornhodid not support his case that he had no PCP over the Compound Documents.",
        "Whether the Compound Documents were relevant and necessary": "42  I was also satisfied that the plaintiff had established aprima faciecase that the Compound Documents were likely to be relevant (or contain documents that were relevant) to the pleaded issues in question in this case, and that the said documents were necessary for the fair disposal of the matter. Counsel for the 2nd defendant, Mr Darius Lim, did not raise any serious argument or objections at the hearing before me to contest the requirements of relevance or necessity, and submitted that he could not comment as he did not have access to the Compound Documents or the discrete documents within them.48Foot Note 48×Notes of Evidence dated 3 July 2023 at p 5 ln 29–31; p 11 ln 25–28. 43 The plaintiff’s case against the 2nd defendant in S 188 is that the 2nd defendant was involved in, had knowledge of and/or had acquiesced in numerous wrongful acts against the plaintiff. To recapitulate, these include unauthorised dealings with, and making false declarations in respect of, cargo that had been pledged to various security holders including the plaintiff, with the aid of the UT Facility; the buying and selling of non-existent cargo for the purposes of obtaining financing from banks including the plaintiff; and fabricating various documents such as bills of lading, sale contracts and invoices for the purposes of obtaining the said financing (see [11]–[12] above). The 2nd defendant’s case is that he did not carry out HLT’s, OTPL’s, UTPL’s and UTSS’ day to day operations or commercial activities, and neither did he instruct and/or supervise the employees who carried out the day to day operational and commercial activities of those companies; therefore, he was unaware of the alleged wrongful acts (see [14] above). 44 In relation to the “Lonestar” Hotmail Account, it was not disputed by the 2nd Defendant that emails from the 2nd defendant’s HLT Email Account were forwarded to his “Lonestar” Hotmail Account, and that the 2nd defendant’s “Lonestar” Hotmail Account was regularly blind copied in emails pertaining to HLT’s day to day operational and commercial matters (see [17] above). In my view, the emails in the “Lonestar” Hotmail Account would thus be relevant and necessary as they could show the information that the 2nd defendant had sight of at the material time, including whether he had given any instructions to his employees. 45 As for the “Lonestar” Yahoo Email Account, its existence was volunteered by the 2nd defendant himself in his solicitors’ letter dated 28 November 2022 (see [18] above) and his affidavit dated 10 January 2023 (see [20] above). It also shares the same email name (ie, “lonestar286”) as his “Lonestar” Hotmail Account. I was thus of the view that there was a reasonable suspicion that the “Lonestar” Yahoo Email Account could contain similarly relevant and necessary information. 46 As regards the Handphones, there was evidence showing that the 2nd defendant used the WhatsApp platform to communicate with at least one of his employees in UTSS at the material time (between October 2019 and April 2020) on work-related issues.49Foot Note 49×Tab 5 of 12-LJY at p 159.In my view, the WhatsApp messages and other communications in the 2nd defendant’s Handphones, between the 2nd defendant and his employees and/or fellow directors in HLT, OTPL, UTPL and UTSS, could show the nature and extent of the interactions between the parties and possibly reveal documents both directly and indirectly relevant to the dispute in S 188.",
        "Ancillary orders": "47 Finally, I did not agree with the 2nd defendant’s submissions against para 1(2)(ii) of the AR’s order below in SUM 878, which required the 2nd defendant to state in his affidavit the steps taken to locate and obtain the Compound Documents and why they were unsuccessful, and to provide the correspondence exchanged between the 2nd defendant, and the CAD and the HLT Liquidators respectively. The 2nd defendant contended that this was not part of the plaintiff’s original application and was only raised at the hearing before the AR. Accordingly, it was contended on behalf of the 2nd defendant that he did not have the opportunity to properly respond to this expanded relief sought by the plaintiff and the ancillary order ought not to have been made. 48 I disagreed with the 2nd defendant and found the objection to be a technical one. The order made by the AR was an ancillary order which the court clearly has the inherent power to make in order to effectively police its main discovery orders. In my view, the ancillary order was necessary and reasonable. The purpose of that order was so that the 2nd defendant would be required to demonstrate to the plaintiff and the court that he had complied with the discovery order not just in letter but also in substance, especially if his requests to the CAD and the HLT Liquidators were unsuccessful. There was no need for the ancillary order to be specifically prayed for by the plaintiff.",
        "Conclusion": "49 For the reasons set out above, I dismissed RA 100 and fixed the costs of RA 100 in the sum of S$10,000 (including disbursements) to be paid by the 2nd defendant to the plaintiff. S Mohan JJudge of the High Court Yap Yin Soon, Dorcas Seah Yi Hui (Allen & Gledhill LLP) for the plaintiff; Darius Malachi Lim Wen Hong, Lim Dao Yuan Keith (Damodara Ong LLC) for the second defendant; Shalini Rajasegar (Advocatus Law LLP) for the third defendant (watching brief); Lee Yu Lun, Darrell (Wong & Leow LLC) for the fourth defendant (watching brief)."
    }
}