{
    "case_title": "Management Corporation Strata Title Plan No 1788vLau Hui Lay William and another",
    "ncitation": "[2023] SGHC 284",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Facts": "",
        "The parties": "3 The claimant is the management corporation (“MCST”) of a condominium development known as “The Summit” (“The Summit”). 4 The defendants are the subsidiary proprietors of unit #06-03 in The Summit (the “Unit”). The first defendant, Lau Hui Lay William (“Mr Lau”), is a registered architect. Mr Lau was a member of the MCST’s management council from 2008 to at least 2017 and was also elected the chairman of said council from 2009 to 2017.1Foot Note 1×Joint Affidavit of Lau Hui Lay William and Aw Jieh Yui Midori dated 24 May 2023 (“Defendants’ Joint Affidavit”) at para 15.",
        "Background to the dispute": "5 In 1989, the defendants purchased the Unit from the developer, Tuan Huat Development Pte Ltd (“Tuan Huat”). The defendants claimed that they had received verbal confirmation from Tuan Huat’s representative, one Mr Richard Chng (“Richard”), to install mezzanine attics in the Unit. 6 According to the defendants, on 19 August 1989, they visited the show flat for The Summit. They looked at the different unit types and were interested in “Apartment Type B”. However, they did not wish to purchase a unit unless they could install mezzanine attics. According to the defendants, the size of “Apartment Type B” without mezzanine attics installed would have been too small for their needs as they were planning to have children.2Foot Note 2×Defendants’ Joint Affidavit at para 5. 7 The defendants claimed that they spoke to Richard, who was then a sales and marketing director of Tuan Huat, and asked whether it would be feasible for them to install mezzanine attics in an “Apartment Type B” unit. Richard allegedly gave verbal confirmation that the defendants would be permitted to install such mezzanine attics in the unit.3Foot Note 3×Defendants’ Joint Affidavit at para 6.Thereafter, the defendants paid the booking fee to Tuan Huat and were issued an Option to Purchase dated that same day (ie, 19 August 1989) for “Apartment Type B (6th Storey)”. 8 The defendants claimed to have completed the installation of the mezzanine attics in the Unit by around April or May 1993, before the constitution of the MCST on 18 November 1993.4Foot Note 4×Defendants’ Joint Affidavit at WML-7, p 41.The MCST disputed the date of completion but was understandably not able to offer any evidence in this regard. I deal with this issue at [30]–[56] below. In any event, the defendants admitted that they had not obtained planning permission from the Urban Redevelopment Authority (“URA”) under the statutory regime of the Planning Act (Cap 232, 1985 Rev Ed) (“Planning Act”) prior to the installation of the mezzanine attics. 9 The MCST only discovered in August 2017 that the defendants had installed unauthorised mezzanine attics in the Unit. This happened when the MCST’s managing agent received an email from the defendants stating that the wall next to their daughter’s room had been stained by bird droppings and this was affecting her health. The managing agent investigated the matter and in the course of this discovered that apparently unauthorised structures,ie,a skylight window and an air conditioner compressor, had been installed on the roof. These structures led to the discovery of the unauthorised mezzanine attics in the Unit.5Foot Note 5×Further Affidavit of Harbahjan Singh s/o Mewa Singh dated 23 June 2023 (“Claimant’s Further Affidavit) at para 7. 10 From August 2017 to August 2020, the MCST informed the defendants that they would have to take down the unauthorised mezzanine attics in the Unit, unless the defendants could (a) obtain 90% approval at a general meeting of the management corporation for ratification of the unauthorised works under s 37(2) of the BMSMA, as well as (b) take steps to obtain the requisite regulatory approval on the unauthorised works.6Foot Note 6×Claimant’s 1st Affidavit at para 7 and at pp 28–54 (exhibiting relevant correspondence between the parties). 11 Eventually, on 29 October 2021, the defendants applied to the URA for written permission to retain the unauthorised mezzanine attics in the Unit. In their application, the defendants declared that the additional gross floor area (“GFA”) involved for the proposal (ie, the mezzanine attics) was 57.03m2.7Foot Note 7×Defendants’ Joint Affidavit at WML-8, p 47.On 29 November 2021, by a letter titled “Grant of Provisional Permission”, the URA informed the defendants of the planning conditions that they would need to comply with to obtain written permission for the unauthorised works. In the letter, the URA took the position that:8Foot Note 8×Defendants’ Joint Affidavit at WML-8, pp 43–47. (a) The installation of the mezzanine attics by the defendants had been carried out in contravention of s 12 of the Planning Act (Cap 232, 1998 Rev Ed) (“1998 Planning Act”). (b) The defendants were therefore required to pay to URA a penalty of $2,400 in accordance with s 34 of the 1998 Planning Act. (c) If the defendants did not pay the penalty within 30 days, URA would proceed to refuse written permission for the retention of the unauthorised mezzanine attics, and also proceed to take enforcement action against the defendants for the contravention of s 12 of the 1998 Planning Act without further notice. (d) Another condition for URA’s grant of written planning permission was for the defendants to pay a development charge, estimated at $379,249.50 based on the defendants’ declared GFA of 57.03m2. 12 The defendants duly paid the penalty of $2,400 to the URA pursuant to s 34 of the 1998 Planning Act. 13 The URA subsequently revised the amount of the development charge to $422,807, based on verified GFA of 63.58m2.9Foot Note 9×Defendants’ Joint Affidavit at WML-10, p 54.The defendants paid this sum to the URA by 7 August 2022. 14 On 8 September 2022, URA granted written permission to the defendants under s 14(4) of the 1998 Planning Act to retain the mezzanine attics in the Unit.10Foot Note 10×Defendants’ Joint Affidavit at WML-9, pp 50–52.Additionally, the grant of written permission clarified that the additional GFA involved for the proposal (ie, the mezzanine attics), as verified by the URA, was 63.58m2.",
        "The parties’ cases": "",
        "When were the mezzanine attics installed?": "15 According to the defendants, they had carried out and completed the installation of the mezzanine attics in the Unit by around April or May 1993.11Foot Note 11×Defendants’ Joint Affidavit at para 11. 16 The MCST did not take a firm position on the date in its written submissions,12Foot Note 12×Claimant’s Written Submissions at para 23.but evidently decided to buttress its position at the oral hearing by more strenuously disputing the date. The MCST contended for the possibility that the installation of the mezzanine attics had been completedafterthe MCST was constituted on 18 November 1993, and that such possibility could not be ruled out. 17 However, it was crucial to note that the relevant reference point was not 18 November 1993, but the entry into force of the BMSMA on 1 April 2005. It was not the MCST’s case that the defendants’ installation of the unauthorised mezzanines had been a breach of the MCST’s by-laws, which only took effect after the MCST came into existence. Neither did the MCST point to any by-laws (whether derived from the First Schedule to the Land Titles (Strata) Act (Cap 158, 1988 Rev Ed) (“LTSA”) or any additional by-laws made by the MCST) which would have been relevant. It was therefore irrelevant as to whether the mezzanine attics had been installed after the MCST was constituted. In light of the manner in which the MCST chose to run its case, the relevant reference point was whether the installation of the mezzanine attics in the Unit had been completed before the BMSMA came into force on 1 April 2005.",
        "Whether the MCST could establish a course of action": "18 In seeking to establish a course of action, the MCST put forth the following contentions: (a) The defendants did not obtain Tuan Huat’s agreement or approval to install the mezzanine attics.13Foot Note 13×Claimant’s Written Submissions at paras 7–14. (b) The mezzanine attics were not installed for safety and security reasons, but for the defendants’ own enjoyment, with no regard for the safety of other subsidiary proprietors.14Foot Note 14×Claimant’s Written Submissions at para 22(c). (c) The defendants had deliberately deceived and concealed the existence of the mezzanine attics from the authorities and from other subsidiary proprietors.15Foot Note 15×Claimant’s Written Submissions at para 22(a). (d) The MCST never agreed to permit and did not permit the defendants’ mezzanine attics.16Foot Note 16×Claimant’s Written Submissions at para 22(d). (e) The defendants had breached the Planning Act and belatedly applied to the URA for planning permission. It was unclear from the MCST’s written submissions which section of the Planning Act was allegedly breached, but the originating application filed by the MCST was stated to be “In the matter of … sections 9 and 10 of the then Planning Act 1987”. The MCST further contended that the URA’s grant of written permission could not retrospectively approve the mezzanine attics but instead prospectively approved the mezzanine attics from the date of grant.17Foot Note 17×Claimant’s Written Submissions at paras 24–26. (f) In any case, it appeared that the MCST also disputed that the URA had granted permission to the defendants to retain the mezzanine attics.18Foot Note 18×Claimant’s Written Submissions at para 27. (g) Section 37 of the BMSMA came into force on 1 April 2005 and was the applicable law when the defendants applied to the URA and/or the Building and Construction Authority (“BCA”) for permission to retain the unauthorised mezzanine attics. Section 37 therefore applied, and the defendants had failed to obtain a 90% resolution from the MCST to authorise the mezzanine attics.19Foot Note 19×Claimant’s Written Submissions at para 22(e). (h) Even if URA had granted permission to the defendants to retain the mezzanine attics (which was not admitted by the MCST), separate and further approval had to be sought from the MCST pursuant to s 37 of the BMSMA.20Foot Note 20×Claimant’s Written Submissions at para 27. 19 I note at this juncture, however, that the MCST’s case was never premised on a breach of the sale and purchase agreement that the defendants had made with Tuan Huat. It was therefore unnecessary for me to decide whether Tuan Huat had indeed given its verbal confirmation at the show flat on 19 August 1989 that the defendants would be permitted to install mezzanine attics in the Unit. 20 On the basis of the matters set out at [18] above, the MCST sought for the defendants to be ordered to remove the unauthorised mezzanine attics with an additional GFA of approximately 63.58m2. In the alternative, the MCST contended thatifthe defendants were allowed to retain the mezzanine attics, they should pay additional contributions to the management fund and sinking fund for the unauthorised structure, backdated to 1989.21Foot Note 21×Claimant’s Written Submissions at para 33. 21 As to the limitation period, the MCST contended that the existence of the unauthorised mezzanine attics in the Unit had been deliberately concealed by the defendants. Accordingly, pursuant to s 29(1) of the Limitation Act 1959 (2020 Rev Ed) (“Limitation Act”), the six year limitation period under s 6 of the said Act began to run only from the time when the MCST first discovered that the mezzanine attics were unauthorised,iesometime in August 2017 when the MCST’s managing agent investigated the bird droppings on the wall next to the Unit.22Foot Note 22×Claimant’s Written Submissions at para 29. 22 In summary, the MCST applied to court for the following orders in originating application no 404 of 2023:23Foot Note 23×Originating Application dated 20 April 2023. (a) That the defendants be ordered to remove the unauthorised structure within their unit, namely the unauthorised mezzanine floor with an additional GFA of approximately 63.58 m2. (b) Alternatively, that the defendants pay additional contributions to the management fund and sinking fund for the unauthorised structure and/or damages to be assessed. In this regard, the originating application filed by the MCST was also stated to be “In the matter of  … sections 11, 30 and 42 of the [LTSA]”. (c) That the defendants pay damages (if any) to be assessed and/or indemnify the MCST against any claims whatsoever by any authority, development charges and/or losses owing to the abovementioned breaches committed by the defendants. (d) That the defendants bear all costs including legal fees on an indemnity basis, disbursements and other incidental costs incurred by the MCST for this application, pursuant to the resolutions passed at the MCST’s annual general meeting. (e) Any further directions and/or relief as the court deems fit. 23 In response, the defendants submitted that the MCST had no cause of action and that none of the statutory provisions stated by the MCST in the originating application disclosed any cause of action.24Foot Note 24×Defendants’ Written Submissions dated 4 July 2023 (“Defendants’ Written Submissions”) at para 2. 24 As to ss 11, 30 and 42 of the LTSA, these provisions provided that the share value of strata units was not to be changed except in certain stipulated circumstances (s 11), that share value shall determine voting rights and contributions (s 30) and that contributions shall be levied in respect of each lot and shall be payable by the subsidiary proprietors in shares proportional to the share value of their respective lots (s 42). None of these provisions disclosed any cause of action or even imposed an obligation on the defendants.25Foot Note 25×Defendants’ Written Submissions at para 4. 25 As to ss 9 and 10 of the Planning Act, the defendants did not dispute that the mezzanine attics may have amounted to development of land without the written permission of the competent authority (ie, the URA), which was in contravention of the Planning Act.26Foot Note 26×Defendants’ Written Submissions at para 10.However, a contravention of this specific prohibition in the Planning Act amounted to an offence under s 9(8) of the Planning Act and provided no cause of action to the MCST in civil proceedings.27Foot Note 27×Defendants’ Written Submissions at paras 5 and 13.Furthermore, the defendants were no longer in contravention of the Planning Act as they had since by 8 September 2022 paid a penalty and development charge to the URA. The defendants also obtained written planning permission from the URA under the 1998 Planning Act for the retention of the mezzanine attics.28Foot Note 28×Defendants’ Written Submissions at para 14.In consequence,pers 34(4) of the 1998 Planning Act, the earlier contravention was no longer actionable under law, even by the URA.29Foot Note 29×Defendants’ Written Submissions at para 15. 26 As to s 37 of the BMSMA, the defendants contended that the MCST had failed to identify any cause of action as arising from s 37(1) of the BMSMA. Furthermore, s 37 only came into force on 1 April 2005 and there was no equivalent provision in its predecessor legislation. Section 37 does not apply retrospectively and there was therefore no need for the defendants to “regularise” the mezzanine attics in accordance with s 37.30Foot Note 30×Defendants’ Written Submissions at para 6. 27 In addition, as to the MCST’s allegation that the defendants have “[undermined] the … Residential GFA regime that constitutes the cornerstone of URA’s regulation of the intensity of land use in Singapore”,31Foot Note 31×Affidavit of Harbahjan Singh s/o Mewa Singh dated 20 April 2023 (“Claimant’s 1st Affidavit”) at para 10.the defendants repeated their position in [25] above and further argued that the GFA ‘regime’ was unrelated to s 37(1) of the BMSMA. CitingManagement Corporation Strata Title Plan No 4123 v Pa Guo An[2020] SGHC 213 at [31]–[32] and [39], the defendants pointed out that “floor area” in s 37(1) of the BMSMA was not defined with reference to GFA and simply meant “covered floor space”.32Foot Note 32×Defendants’ Written Submissions at para 23. 28 Lastly, the defendants contended that there was no question of the breach of any by-laws because the installation of the unauthorised mezzanine attics were done before the MCST was constituted. Since by-laws are statutorily constituted contracts between the MCST and the subsidiary proprietors, they do not take effect until these persons come into existence and only operate prospectively.33Foot Note 33×Defendants’ Written Submissions at para 31.",
        "Issues to be determined": "29 In light of the aforesaid, the following issues arose for my determination: (a) Whether the defendants had completed the installation of the mezzanine attics by around April or May 1993. (b) Whether there was a breach of ss 9 and 10 of the Planning Act such as to give rise to a cause of action to the MCST in civil proceedings. (c) Whether s 37 of the BMSMA was applicable. In particular, the question arose whether the defendants’ act of applying to the URA for written permission in October 2021 to retain the unauthorised works constituted “effect[ing] any improvement” under s 37 of the BMSMA.",
        "Whether the defendants had completed the installation of the mezzanine attics by around April or May 1993": "30 At the hearing, the MCST strenuously disputed the date of the installation of the defendants’ mezzanine attics. I considered this issue on the basis of the evidence adduced by the affidavits and on the parties’ oral and written submissions before me.",
        "The defendants’ version of events": "31 The defendants’ case, as set out in their joint affidavit dated 24 May 2023, was that they had carried out and completed the installation of the mezzanine attics by around April or May 1993.34Foot Note 34×Defendants’ Joint Affidavit at para 11. 32 The defendants’ version of the events surrounding these works was as follows. As set out above, at the visit to the show flat on 19 August 1989, the defendants received verbal confirmation from Richard that they would be permitted to install mezzanine attics in the Unit. While the building was still under construction, and even before the temporary occupation permit was obtained, the defendants were in constant communication with Tuan Huat and their main contractor, Tuan Huat Construction Pte Ltd (“Tuan Huat Construction”), over the installation of the mezzanine attics.35Foot Note 35×Defendants’ Joint Affidavit at para 7.For instance, to allow for the installation of the defendants’ mezzanine attics, Tuan Huat Construction had constructed the Unit differently from others in the development, by raising the false ceiling in the Unit to a much higher level than other similar units. The defendants claimed that the false ceiling in the Unit was therefore raised almost to the underside of the roof, to allow for the installation of the mezzanine attics. The air-conditioning ducts in the Unit were also relocated for the same purpose. In support of this assertion, the defendants exhibited a cross section plan (Fig. 1 below) of the Unit that Tuan Huat Construction had faxed to the defendants on 5 November 1990. According to them, this cross-section plan showed the roof profile as well as the typical false ceiling hights that units in The Summit would be constructed with:36Foot Note 36×Defendants’ Joint Affidavit at para 7 and WML-2, at p 27.  Fig. 1: Cross-section plan from Tuan Huat Construction dated 5 November 1990 33 The defendants also exhibited the following building section drawings (Fig. 2(a) & 2(b) below) and copies of photographs (with annotated comments by the defendants) (Fig. 3 & 4 below) to demonstrate that the false ceiling and air-conditioning ducts in the Unit differed from other units in The Summit:37Foot Note 37×Defendants’ Joint Affidavit at para 9 and WML-4, pp 31–34.  Fig. 2(a): Building section drawing of a typical unit in the development  Fig. 2(b): Building section drawing of the Unit  Fig. 3: Photograph and annotations by the defendants to compare the Unit with other units in the development  Fig. 4: Photograph and annotations by the defendants to compare the Unit with other units in the development 34 The defendants also exhibited copies of photographs (Fig. 5 below) showing the installation of the mezzanine attics being carried out, dated 14 December 1992:38Foot Note 38×Defendants’ Joint Affidavit at para 11 and WML-5, at p 36.  Fig. 5: Photographs allegedly showing the installation of the mezzanine attics dated 14 December 1992 35 The defendants claimed that their installation of mezzanine attics and staircases in the Unit was “public knowledge” and even reported in the national press. To this end, the defendants relied on a Straits Times article dated 30 October 1993 (Fig. 6 below) showcasing the Unit, which also included a photograph of the aforesaid staircases:39Foot Note 39×Defendants’ Joint Affidavit at para 12 and WML-6, at p 38.  Fig. 6: Copy of the Straits Times article dated 30 October 1993 exhibited by the defendants 36 The defendants pointed out that the reporters from the Straits Times must have “attended at the [Unit] to take photos of the Mezzanine Attics and Staircases and were appraised of the exact location of the unit”.40Foot Note 40×Defendants’ Written Submissions at para 38(b)(i).",
        "The MCST’s arguments": "37 The MCST disputed the date of the installation of the defendants’ mezzanine attics.41Foot Note 41×Claimant’s Written Submissions dated 4 July 2023 (“Claimant’s Written Submissions) at para 23.The MCST claimed that there was a possibility that the installation of the mezzanine attics had been completed onlyafterthe MCST was constituted on 18 November 1993. However, as noted above at [17], the correct reference point would be whether the installation of the mezzanine attics had been completed onlyafterthe BMSMA came into force on 1 April 2005. 38 As to the alleged communications between the defendants and Tuan Huat Construction during the time period that the installation of the mezzanine attics was taking place, the MCST submitted that it was “odd”, considering the detailed and precise planning required to build such large structures and that Mr Lau was a registered architect, that nothing was recorded in writing save for the cross section plan of atypicalunit in the development dated 5 November 1990 (see Fig. 1 at [32] above).42Foot Note 42×Defendants’ Written Submissions at para 8. 39 As to the building section drawings and photographs exhibited by the defendants (see Fig. 2(a), 2(b), 3 and 4 at [33] above), the MCST contended that these did not show that Tuan Huat or Tuan Huat Construction had in fact constructed the Unit differently from other units in the development, by raising the false ceiling and relocating the air-conditioning ducts in the Unit.43Foot Note 43×Defendants’ Written Submissions at para 10. 40 As to the Straits Times article dated 30 October 1993 (see Fig. 6 at [35] above), the MCST pointed out that:44Foot Note 44×Claimant’s Further Affidavit at para 5. (a) The Straits Times article did not indicate that the mezzanine attics were installed in The Summit. (b) A reasonable person reading the article would not have suspected that the mezzanine attics were unauthorised, especially since it was reported in the national newspaper. 41 In addition, the MCST highlighted that the defendants had failed to exhibit the full article from the Straits Times dated 30 October 1993 which showcased the Unit. The MCST exhibited a copy of the full article (Fig. 7 below):45Foot Note 45×Claimant’s Further Affidavit at para 5(c) and Exhibit A, p 6.  Fig. 7: Copy of the full Straits Times article dated 30 October 1993 exhibited by the MCST 42 At the oral hearing, the MCST also highlighted that, according to the copy of the Straits Times article exhibited by the MCST (see Fig. 7 above), the defendants had told the author of the article that their renovation had “created 1,030 sq ft of additional space”,ieapproximately 95.69m2. The MCST proceeded on the basis that this referred to the additional floor area generated by the unauthorised mezzanine attics and staircases. Yet when the defendants applied to the URA in October 2021 for written permission to retain the unauthorised mezzanine attics, they declared that the additional GFA involved for the works was 57.03m2. Eventually, the URA ascertained that the additional GFA involved was 63.58m2. 43 On the basis of the defendants’ alleged omissions highlighted at [38], [39], [41] and [42] above, the MCST submitted that the court should draw an adverse inference pursuant to s 116(g) of the Evidence Act 1893 (2020 Rev Ed) (“EA”), that the installation of the mezzanine attics had not been completed by around April or May 1993 as the defendants had claimed.",
        "My decision: the defendants had completed the installation of the mezzanine attics by around April or May 1993": "44 I accepted the defendants’ version of events that they had completed the installation of the mezzanine attics by around April or May 1993, for the following reasons. First, the defendants gave evidence from personal knowledge of the installation of the aforesaid attics in their joint affidavit (see [31]–[35] above). The defendants’ evidence as such was broadly corroborated by the Straits Times article published on 30 October 1993, which had been exhibited by both parties. Second, the MCST was unable to provide any evidence to the contrary, but I must emphasise that this is not due to any fault on its part. In this regard, the MCST’s case was premised singularly on the adverse inference that it sought for the court to draw (which I declined to do so for the reasons set out below at [45] to [49]). Third, I reiterate that the relevant question before me was whether the defendants had completed the installation of the mezzanine atticsbeforethe entry into force of the BMSMA on 1 April 2005. This was the focal point of the inquiry. Even taking the MCST’s case at its highest,ie, assuming (which I did not) that the installation of the mezzanine attics had not been completed at the time the Straits Times article was published on 30 October 1993, this required the court to, in effect, believe that the construction of the mezzanine attics had been ongoing for a period of more than 11 years, from 1993 to 2005. Not only was this unlikely, it also accorded with common experience that no family would tolerate the construction of the mezzanine attics to be carried out for such a prolonged period, during which time they were living in the Unit. Whether an adverse inference should be drawn 45 I declined to draw the adverse inference sought by the MCST. The MCST relied on s 116(g) of the EA, which gave the court adiscretionto presume that “evidence which could be and is not produced would if produced be unfavourable to the person who withholds it”. InCheong Ghim Fah vMurugian s/o Rangasamy[2004] 1 SLR(R) 628 (“Cheong Ghim Fah”), V K Rajah JC (as he then was) noted, at [39], that: … Section 116(g) encapsulates a common sense rule.In the scheme of our adversarial litigation procedures, it is perfectly permissible for a party not to call witnesses or adduce evidence on any material point in issue. Section 116(g) mirrors the common law approach that a party cannot take issue with the raising of inferences about matters that the party has chosen to consciously conceal or hold back. The inference must, ithas to be emphasised, be reasonably drawn from the matrix of established facts. Satisfying the court as to the availability and materiality of the evidence is a necessary prerequisite to any application of s 116(g).For example, it has often been said if there is a reasonable explanation why a witness, who is out of the jurisdiction, cannot give evidence, the inference may not be raised. Having said that, in today’s advanced technological context, replete with video-conferencing facilities and the like, older authorities on this point may need reconsideration. [emphasis added] 46 It was reasonable, with the passage of time since the purchase of the Unit in 1989, to expect that the defendants may not have kept detailed and proper records of the installation of the mezzanine attics. In any case, the defendants had produced some evidence that was broadly corroborative of their account. Looking at the photographs exhibited by the defendants (see Fig 3 and 4 at [33] above), there was a discernible difference in the height of the false ceiling in the Unit as compared to other units in The Summit. This suggested, as the defendants claimed, that Tuan Huat Construction had raised the height of the false ceiling in the Unit to allow for the installation of the mezzanine attics. As to the building section drawings relied upon by the defendants (see Fig 2(a) and 2(b) above), I would express some reservations as the provenance of these drawings were not entirely explained by the defendants in their oral or written submissions, or in their affidavits. It was not known whether the building section drawings were contemporaneous to the installation of the mezzanine attics, or whether they had been subsequently drawn up for the purposes of the present proceedings. It was also unknown who the authors of these drawings were. However, when considered together with the aforementioned photographs, the building section drawings were useful insofar as they provided a diagrammatic representation of what the photographs purported to depict (ie, the raised false ceiling and relocated air-conditioning ducts in the Unit). 47 Furthermore, it must be borne in mind that the MCST had not taken a firm position on the date of installation of the mezzanine attics in its written submissions, and simply contested (without further elaboration) that there were two possibilities.46Foot Note 46×Claimant’s Written Submissions at para 23.Only at the oral hearing did the MCST more strenuously dispute the date. 48 In light of the aforesaid, I was not satisfied that the defendants had withheld evidence such that it would be appropriate to draw an adverse inference under s 116(g) of the EA. 49 As to the MCST’s assertion that the defendants had, in the Straits Times article dated 30 October 1993, withheld information of the floor area generated by their renovation works (see [42] above), I also declined to draw the adverse inference on this basis. It was difficult to see how the defendants’ failure to accurately state the amount of additional floor area generated by their renovation works was relevant to the date of completion of such works. It wasnotthe MCST’s case that, between 30 October 1993 when the Straits Times article was published and 29 October 2021 when the defendants applied to the URA for written permission, the defendants had altered the structure of the unauthorised mezzanine attics such as to affect the floor area of the structure. The discrepancy between this 1,030 sq ft (which is 95.7m2), or indeed the self-declared figure of 57.03m2 in the defendants’ application to URA in October 2021 for written planning permission, and the 63.58m2 that was determined by URA to be the area of the unauthorised mezzanine attics was well within the range of error in such computations, which are rather technical in nature. I therefore decline to draw the adverse inference sought by the MCST. The Straits Times article published on 30 October 1993 50 Both parties built their respective cases around what was reported in the Straits Times article published on 30 October 1993. The admissibility of this article was not challenged and neither did parties allege that it provided an inaccurate account. 51 Naturally, the defendants claimed that their installation of mezzanine attics and staircases in the Unit had been reported in the article. They also claimed that someone from the Straits Times must have attended at the Unit sometime before 30 October 1993, in order to take photographs of the Unit. The MCST’s response was to allege that the copy of the Straits Times articleexhibited by the defendantsdid not indicate that mezzanine attics had been installed in the Unit. At the same time, the MCST also exhibited what it claimed to be the full article from the Straits Times (see Fig. 6 at [41] above) and proceeded to make its submissions on the basis that the statements reported in the article, concerning the additional floor area generated by the renovations, had indeed been made by Mr Lau to someone from the Straits Times (see [42] above). 52 In light of the above, and with the two copies of the Straits Times article before me, I had no reason to doubt that the Straits Times article published on 30 October 1993 under the section header “Home Interiors” was intended to and did in fact showcase the renovation works that Mr Lau had undertaken to the Unit, which included the unauthorised mezzanine attics. The article also contained a photograph of the spiral stairway and stairwell installed in the Unit (see Fig. 5 at para [35] above). 53 From this, the court could infer that the installation of the unauthorised mezzanine attics and staircases in the Unit must have been completed before the date of publication of the article. It was extremely unlikely that the article would have referred to an overhanging floor above the living room (ie, the mezzanine attics) if this structure did not in fact exist or was in an incomplete state of construction. It was equally unlikely that Mr Lau would have spoken to someone from the Straits Times and allowed photographs to be taken of the interior design of the Unit, if this was the case. On the contrary, the photographs contained in the article as well as the manner in which the interior design to the Unit was described in the article, left no doubt that the renovation works in the Unit had been completed by this time. 54 In this manner, I considered that the Straits Times article dated 30 October 1993 broadly corroborated the defendants’ evidence that they had completed the installation of the mezzanine attics by around April or May 1993 (ie, some five to six months prior to the publication of the article). 55 Furthermore, I would bear in mind that the relevant question was whether the defendants had completed the installation of the mezzanine atticsbeforethe entry into force of the BMSMA on 1 April 2005 (see [17] above). Even assuming (which I did not) that the installation of the mezzanine attics had not yet been completed at the time the Straits Times article was published on 30 October 1993, it does not accord with common experience that any family would tolerate the construction of the mezzanine attics to be carried out for a period of more than 11 years, from 1993 to 2005, during the period in which they were living in the Unit. Conclusion 56 I therefore accepted the defendants’ version of events that they had completed the installation of the mezzanine attics by around April or May 1993, long before the entry into force of the BMSMA on 1 April 2005.",
        "Whether there was a breach of s 9 and s 10 of the Planning Act such as to give rise to a cause of action to the MCST in civil proceedings": "57 I briefly considered this issue as the originating application filed by the MCST was stated to be “[i]n the matter of … sections 9 and 10 of the then Planning Act 1987”. 58 I found that the URA had granted permission to the defendants on 8 September 2022 to retain the mezzanine attics. The grant of written permission pursuant to s 14(4) of the 1998 Planning Act was exhibited by the defendants as exhibit “WML-9” to the defendants’ joint affidavit dated 24 May 2023.47Foot Note 47×Defendants’ Joint Affidavit at WML-9, pp 50–52.Furthermore, the grant of written permission stated that the additional GFA for the proposal (ie, the mezzanine attics) was 63.58m2.",
        "The position before 8 September 2022": "59 For the period between (a) when the mezzanine attics were installed to (b) 8 September 2022, the defendants did not dispute that the unauthorised mezzanine attics may have amounted to development of land, without the written permission of the competent authority, which was in contravention of s 9 and s 10 of the Planning Act. 60 Section 9(1) of the Planning Act provides: 9.—(1)  No person shall, without the written permission of the competent authority, develop any land. Section 10 of the Planning Act in turn provides for the meaning of “develop” for the purposes of s 9. 61 I agreed with the defendants’ submissions that their contravention of s 9 of the Planning Act during this period, while it amounted to an offence under s 9(8) of the same Act, provided no cause of action to the MCST in civil proceedings. Section 9(8) provides as follows: (8)  Any person who contravenes subsection (1) … shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000 and in the case of a continuing offence to a fine not exceeding $100 for every day after the first day during which the offence continues. Furthermore, where the competent authority appointed under s 3 of the Planning Act is of the opinion that any development of land has been carried out in contravention of s 9, it may, by an “enforcement notice” pursuant to s 11(1) and 11(2) of the Planning Act require certain measures to be taken by the owner or occupier of the land, or “any other person … responsible for the contravention of section 9 or 10A or any condition imposed thereunder”. A failure to comply with the enforcement notice is an offence (s 11(8) of the Planning Act), and the competent authority “may enter upon the land and take any measures directed by the enforcement notice” (s 11(9) of the Planning Act). 62 As there is nothing in the Planning Act providing for any recourse by any other party, the MCST could not rely on a breach of s 9 of the Planning Act to found a cause of action against the defendants in civil proceedings.",
        "The position after the URA granted written permission to the defendants on 8 September 2022": "63 For completeness, it was also clear that the URA had granted written planning permission to the defendants on 8 September 2022 to retain the mezzanine attics. There was therefore no continuing contravention of s 12 of the 1998 Planning Act. 64 The defendants applied to the URA for written permission to retain the unauthorised mezzanine attics in the Unit on 29 October 2021. By this time, the applicable version in force was the 1998 Planning Act. In the letter titled “Grant of Provisional Permission” issued to the defendants on 29 November 2021, the URA took the position that the installation of the mezzanine attics had been carried out in contravention of s 12 of the 1998 Planning Act.48Foot Note 48×Defendants’ Joint Affidavit at WML-8, pp 43–47.Section 12(1) had been introduced by the Planning (Amendment) Act 2017 (Act 7 of 2017) and provided that “[a] person must not, without planning permission, carry out or permit the carrying out of any development of any land outside a conservation area.” Section 12(4) in turn stated that a contravention of s 12(1) is an offence. These provisions can be read together with s 34, which provides for the power of the competent authority to require a person to pay “a penalty for the grant of any written permission” (ie, a civil penalty) for any development of land, in respect of which “there appears to the competent authority that an offence has been committed, whether or not proceedings have been instituted against any person for an offence under section 12.” In accordance with these provisions, the URA also took the position in its letter dated 29 November 2021 that the defendants would be required to pay a penalty of $2,400 under s 34 of the 1998 Planning Act. After the defendants had paid this penalty amount as well as a development charge of $422,807 to the URA, the latter on 8 September 2022 granted written permission to the defendants under s 14(4) of the 1998 Planning Act to retain the mezzanine attics in the Unit. 65 As written planning permission from the URA had since been obtained, it could not be said that there was any continuing breach of s 12 of the 1998 Planning Act. In addition, s 34(4) clearly provided that “[n]o further proceedings shall be instituted or taken against any person for an offence under section12 once the penalty has been paid.” I therefore agreed with the defendants that the earlier contravention would no longer be actionable under law, even by the URA.",
        "Whether s 37 of the BMSMA is applicable": "",
        "No equivalent provision to s 37 of the BMSMA prior to 1 April 2005": "66 At the outset, it was undisputed that s 37 of the BMSMA only came into force on 1 April 2005 and there was no equivalent provision in its predecessor legislation. Prior to the BMSMA, the law concerning the maintenance and management of strata property was contained in the LTSA and the Buildings and Common Property (Maintenance and Management) Act (Cap 30, 1985 Rev Ed) (“BCPMMA”) (being the version in force at the time the defendants’ mezzanine attics were constructed). Thereafter, the relevant parts pertaining to maintenance and management in the LTSA and the entire BCPMMA were consolidated into a single piece of legislation,iethe BMSMA (see Tang Hang Wu and Kelvin FK Low,Tan Sook Yee’s Principles of Singapore Land Law(LexisNexis, 4th Ed, 2019) at para 22.6). There was no equivalent provision to s 37 of the BMSMA in the LTSA or BCPMMA. 67 InChoo KokLin and another v The Management Corp Strata Title Plan No 2405[2005] 4 SLR(R) 175 (“Kentish Lodge”) the subsidiary proprietors had in 1999 carried out works which included the erection of roofs over the originally uncovered terrace and air well areas of the units. This was prior to the constitution of the management corporation in April 2000 and prior to the BMSMA coming into force. The works caused the 1.63m2 of approved GFA left over on completion of the condominium (referred to as “unconsumed GFA”) to be completely consumed, and an additional GFA of 52.53m2 was also generated. 68 As explained inKentish Lodgeat [37], every developer building a development in Singapore has to conform with the overall GFA for that development as specified by the URA. The GFA of each development is determined by the approved Gross Plot Ratio (“GPR”) for the land on which it is constructed. The GPR is approved by the chief planner in accordance with the master plan and it determines the land premium or the development charge payable by the developer. Based on that fee, the URA will permit the developer to develop the site up to a limit known as the GFA. The area of the constructed development cannot exceed the GFA. 69 Where a development was not built to the full extent of the GFA, the balance that would be available for future development would constitute what might be described as “unconsumed” GFA. One of the issues inKentish Lodgewas whether this unconsumed GFA constituted the common property of the development. If it did, a subsidiary proprietor who had undertaken works that increased the floor area in his unit would, in effect, have exclusive use of such common property. If so, this would engage s 41(8) of the Land Titles (Strata) Act (Cap 158, 1999 Rev Ed) (“1999 LTSA”) and the subsidiary proprietor would be required to obtain the passage of a unanimous resolution of all subsidiary proprietors to make a by-law conferring on that subsidiary proprietor the exclusive use and enjoyment of the common property in question. 70 The High Court held that, as the definition of common property required that it be land, unconsumed GFA was not common property because it was incapable of constituting land (Kentish Lodgeat [45]–[46]). The court held that GFA was simply an administrative tool and a concept that had been invented by the planning authorities in order to control and administer the usage of land in accordance with the currently prevailing policy applied by such authorities. As such, GFA did not belong to anyone and was not a right of such a nature that was capable of being owned by anyone (Kentish Lodgeat [47]; affirming the reasoning inMCST Plan No 1375 v Han Soon Juan[2004] SGDC 102). Since GFA cannot be common property, s 41(8) of the 1999 LTSA would not be applicable (Kentish Lodgeat [48]). 71 By the time the decision of the High Court was released, the BMSMA had been enacted. Judith Prakash J (as she then was), referring to s 37 of the BMSMA, observed in passing at [49] that “due to the passing of the Building Maintenance and Strata Management Act 2004 (No 47 of 2004),the situation has now changed… under the present regime, the subsidiary proprietors who wish to cover their [private enclosed space] areas would require the authorisation of the MCST supported by a resolution of 90% of the subsidiary proprietors in order to do so” [emphasis added]. 72 The MCST does not dispute that there was no equivalent provision to s 37 of the BMSMA in its predecessor legislation.",
        "Whether the defendants’ act of applying to the URA for written permission to retain the unauthorised works constituted “effect[ing] any improvement” under s 37 of the BMSMA": "73 The MCST submitted, at the hearing on 10 July 2023, that the word “effect” in s 37(1) of the BMSMA referred not only to the physical installation of the works but alsoincludeda subsidiary proprietor’s action of obtaining approval from the relevant regulatory authority (the “broad interpretation”). On this interpretation, the defendants’ act of applying to the URA for written permission to retain the unauthorised works on 29 October 2021 (with such written permission eventually being granted on 8 September 2022) would therefore fall within the scope of operation of ss 37(1) and 37(2) of the BMSMA, having been undertakenafterthe entry into force of the BMSMA on 1 April 2005. 74 In my judgment, however, the broad interpretation advanced by the MCST was not one that the ordinary meaning of the text could bear, for the following two reasons. First, the ordinary meaning of the word “effect” read in its statutory context is clear and unambiguous. TheNew Shorter Oxford English Dictionaryvol I (OUP, 6th Ed, 1993) at p 799 defines “effect” as to “bring about (an event or result); accomplish (an intention or desire). Produce (a state or condition). Make, construct, build”. The ordinary meaning of “effect” therefore contemplates the performance of specific actions to bring about an intended result, the nature of which would depend on the context in which the word “effect” is being used and understood. It is helpful to set out the relevant statutory context to the word “effect” in s 37(1) of the BMSMA as follows: Improvements and additions to lots 37.—(1)  Except pursuant to an authority granted under subsection (2), no subsidiary proprietor of a lot that is comprised in a strata title plan shalleffect any improvement in or upon his lotfor his benefit which increases or is likely to increase the floor area of the land and building comprised in the strata title plan. (2)  A management corporation may, at the request of a subsidiary proprietor of any lot comprised in its strata title plan and upon such terms as it considers appropriate, by 90% resolution, authorise the subsidiary proprietor to effect any improvement in or upon his lot referred to in subsection (1). … (5) In this section, in relation to any land and building comprised in a strata title plan, “floor area” has the same meaning as in the Planning (Development Charges) Rules (Cap. 232, R 5). [emphasis added] The definition of “floor area” in s 2 of the Planning (Development Charges) Rules (2000 Rev Ed) in turn states: 2.In these Rules, unless the context otherwise requires — … “floor area” means — (a) the gross area of all covered floor space (whether within or outside a building and whether or not enclosed) measured between party walls including the thickness of external walls where there are such walls; and (b) the gross area of floor space in an open area used as a beer garden, drive-in, eating area or for other similar commercial purposes, but excludes any covered area as specified by the Minister; … 75 The statutory context to s 37(1) of the BMSMA and the particular word “effect” therein, therefore indicates that “effect” in s 37(1) refers solely to the effecting ofphysicalworks in or upon a subsidiary proprietor’s lot. Take, for example, the installation of the mezzanine attics in the present case. When one begins the construction of the mezzanine attics, that action starts at one moment in time and ends at another moment in time. The installation of the mezzanine attics is then physically completed at a definite moment in time. If the installation of the mezzanine attics was startedandcompleted at a time when the BMSMA had not yet entered into force, then the effecting of this improvement in or upon the lot would not be in breach of s 37(1) of the BMSMA. 76 Second, even on the broad interpretation advanced by the MCST, this was riddled by inconsistencies. Consider the following two hypotheticals in which a subsidiary proprietor has, prior to the entry into force of the BMSMA, carried out works which increases the floor area of his lot. In the first hypothetical, if the subsidiary proprietor never applies to the URA for written permission to retain the unauthorised works, then, on the broad interpretation, he would not be in breach of s 37(1) of the BMSMA. If, however, in the second hypothetical he takes the step of applying to the URA for written permission, and such application takes place subsequent to the entry into force of the BMSMA, then, on the broad interpretation, he would be in breach of s 37(1) of the BMSMA. I would bear in mind the rule of construction that Parliament is presumed not to have intended an unworkable or impracticable result, so an interpretation that leads to such a result would not be regarded as a possible one (Tan Cheng Bock v Attorney-General[2017] 2 SLR 850at [38]; affirmingHong Leong BankBhd v Soh Seow Poh[2009] 4 SLR(R) 525 at [40]). 77 In light of the aforesaid, I held that the “effecting” of the improvement upon the defendants’ lot wascompletedwhen the installation of the mezzanine attics was completed in 1993. In other words, the defendants’ act of applying to the URA for written permission in October 2021 to retain the unauthorised mezzanine attics could not constitute “effect[ing] any improvement” under s 37 of the BMSMA. Section 37 of the BMSMA therefore did not apply.",
        "My observations on limitation": "78 For completeness, I note that the MCST had made certain pre-emptive submissions on the limitation defence (see [21] above). Case authority has interpreted fraudulent concealment under s 29(1)(b) of the Limitation Act to be wider than fraud or deceit at common law. Instead, it includes “unconscionability in the form of adeliberate act of concealment of a right of actionby the wrongdoer” [emphasis added] (Chua Teck Chew v Goh Eng Wah[2009] 4 SLR(R) 716 at [27]). InBank of America National Trust and Savings Association v Herman Iskandarand another[1998] 1 SLR(R) 848 at [73], the Court of Appeal further referred to the decision of Lord Denning MR inKing v Victor Parsons & Co (A Firm)[1973] 1 WLR 29at 33: … In order to show that [the defendant] “concealed” the right of action “by fraud”, it is not necessary to show that he took active steps to conceal his wrongdoing or breach of contract. It is sufficient that heknowinglycommitted it and did not tell the owner anything about it. He did the wrong or committed the breach secretly. By saying nothing he keeps it secret. He conceals the right of action. He conceals it by “fraud” as those words have been interpreted in the cases. [Emphasis in original] 79Prima facie, I would have been inclined to agree with the MCST that the defendants had deliberately concealed the existence of the unauthorised mezzanine attics in the Unit. It was plain to me that Mr Lau ought to have known, as a registered architect, that the statutory regime of the Planning Act required him to obtain planning permission from the URA for the mezzanine attics. This was regardless of whether he had obtained Tuan Huat’s approval to install the mezzanine attics. On affidavit, the defendants claimed to have often hosted neighbours in the Unit, who took notice of the mezzanine attics and staircases.49Foot Note 49×Defendants’ Joint Affidavit at para 14.However, it remained a question of fact whether the MCST was otherwise aware of these structures in the Unit. It was undisputed that the defendants did not, at any time before the MCST’s discovery of the structures in 2017, inform the MCST of the unauthorised mezzanine attics in the Unit. In my view, there was therefore fraudulent concealment within the meaning of s 29(1)(b) of the Limitation Act in this sense. 80 However, I make no finding on the matter since the defendants had not specifically raised the limitation defence in relation to the MCST’s claims set out at [18] above (see s 4 of the Limitation Act). In any event, even if the defendants’ conduct amounted to fraudulent concealment, it was not necessary for me to make a determination on limitation given my findings at [62], [65] and [77] above that the MCST had no cause of action.",
        "Conclusion": "81 In the result, I found that the MCST had no cause of action such that the question of whether it would be appropriate to grant the mandatory injunction sought by the MCST did not arise. Accordingly, I dismissed the application. 82 Given the circumstances of this case, I awarded nominal costs fixed at $1 to the defendants. For much the same reasons as set out above at [79], Mr Lau ought to have known, as a registered architect and, much later, as the chairman of the MCST’s management council from 2009 to 2017, that he was required to obtain planning permission from the URA. Yet the defendants knowingly stayed silent and did not seek to obtain the requisite permission. They belatedly applied to the URA for written planning permission in 2021, prompted by the MCST’s discovery of the unauthorised mezzanine attics in the Unit. The defendants had benefitted from the lacuna in the law which was plugged by the enactment of s 37 of the BMSMA. In the circumstances, I considered that it was appropriate to order nominal costs to be paid by the MCST. Lee Seiu KinJudge of the High Court Leo Cheng Suan and Lee Shu Xian (Infinitus Law Corporation) for the claimant; Daniel Chen Chongguang and Tan Hong Xun Enzel (Lee & Lee) for the first and second defendants."
    }
}