{
    "case_title": "Don King Martin (trading as King Excursion & Transport Provider)vLenny Arjan Singh",
    "ncitation": "[2023] SGHC 334",
    "coram": "Kristy Tan JC",
    "sections": {
        "Introduction": "1 HC/DCA 24/2023 (“DCA 24”) is an appeal by the plaintiff in DC/DC 2230/2021 (“DC 2230”), Don King Martin t/a King Excursion & Transport Provider, against the award of damages made by the learned District Judge (“DJ”) inDon King Martin t/a King Excursion & Transport Provider v Lenny Arjan Singh[2023] SGDC 165 (“Judgment”) in respect of his claim for conversion of his van by the defendant, Lenny Arjan Singh, on 1 February 2021. I allow the appeal and set aside the award of damages made by the DJ at [128(a)] of the Judgment. However, the award of damages I make differs from what the plaintiff sought in this appeal.",
        "Background": "",
        "The parties": "2 The plaintiff below and appellant herein (“Appellant”) is the sole proprietor of King Excursion & Transport Provider (“KETP”).1Foot Note 1×Judgment at [1].The defendant below and respondent herein (“Respondent”) was the Appellant’s friend. At all material times, the Respondent resided in Johor Bahru, Malaysia.2Foot Note 2×Record of Appeal Vol 2 (“2RA”) p 1206; Record of Appeal Vol 1 (“1RA”) p 626 (Appellant’s Affidavit of Evidence-in-Chief (“AEIC”) at para 14).",
        "Relevant facts": "3 On 20 June 2016, the Appellant purchased a second-hand Toyota Hiace Commuter GL 2.7A (“Van”) under a Hire Purchase Agreement for the sum of $68,880.3Foot Note 3×1RA p 692.Based on the Land Transport Authority’s (“LTA”) vehicle registration details, the Van was manufactured in 2008 and its registration date was 4 February 2009.4Foot Note 4×1RA pp 690–691.Its Certificate of Entitlement (“COE”) expiry date at that time was 3 February 2019.5Foot Note 5×2RA p 805 (Respondent’s AEIC at para 7). 4 On 2 February 2019, the COE for the Van was renewed6Foot Note 6×Judgment at [12].for $31,933. The parties agree that the value of this COE amortised over 10 years is approximately $266 per month.7Foot Note 7×Appellant’s Case dated 30 September 2023 (“AC”) at para 89; Respondent’s Case dated 30 October 2023 (“RC”) at para 19. 5 On 30 September 2019, KETP was registered as the owner of the Van with LTA.8Foot Note 8×1RA p 690. 6 On 13 December 2020, after parking his Van at Danga Bay in Johor Bahru, the Appellant returned to find the Van missing.9Foot Note 9×Judgment at [14].That same day, he made a police report in Johor Bahru on the loss of the Van (“13 Dec 2020 JB Police Report”).10Foot Note 10×1RA p 698.Through the Respondent’s involvement, the Appellant retrieved the Van on 31 December 2020.11Foot Note 11×Judgment at [17].In the proceedings below, the Appellant brought a claim against the Respondent for conversion of the Van from 13 to 31 December 2020. This claim was dismissed by the DJ12Foot Note 12×Judgment at [26] and [32].and is not the subject of the present appeal. 7 On 1 February 2021, the Respondent drove the Van to a property known as 57-J Jalan Serai in Johor Bahru (“57-J Jalan Serai”) and secured the Van within those locked premises.13Foot Note 13×2RA p 846 (Respondent’s AEIC at para 85).According to the Respondent, 57-J Jalan Serai was owned by a parishioner from his church who had asked him to assist in looking out for the property during the COVID-19 lockdown.14Foot Note 14×1RA p 406 (Notes of Evidence (“NE”) 11 April 2023 p 80 lines 17–23).The Respondent purported to be entitled to possession of the Van on account of outstanding sums owed by the Appellant to the Respondent under a loan agreement.15Foot Note 15×Judgment at [19]–[20].The DJ found, however, that the Respondent had converted the Van on 1 February 2021.16Foot Note 16×Judgment at [53].This finding is not challenged by either party in this appeal. 8 On 2 February 2021, the Appellant made a police report in Johor Bahru stating that the Van was with the Respondent and had not been returned (“2 Feb 2021 JB Police Report”).17Foot Note 17×1RA pp 714–715. 9 Following a mutual friend’s intervention, the Appellant made another police report in Johor Bahru on 26 February 2021 stating that he wanted to withdraw his 2 Feb 2021 JB Police Report (“26 Feb 2021 JB Police Report”).18Foot Note 18×1RA p 717; 1RA p 643 (Appellant’s AEIC at para 39).However, the Van remained in the Respondent’s possession at 57-J Jalan Serai and was not returned to the Appellant. 10 On 21 April 2021, the Appellant left Malaysia for Singapore. His stamped passport shows that he did not return to Malaysia until 24 March 2022.19Foot Note 19×1RA p 758. 11 On 8 May 2021, the Appellant made a police report in Singapore (“8 May 2021 SG Police Report”).20Foot Note 20×1RA pp 739–741.In this report, the Appellant stated that the Van had gone missing in Johor Bahru on 13 December 2020 and provided the 13 Dec 2020 JB Police Report number. However, he omitted to state that, after that incident, the Van had been retrieved on 31 December 2020. The Appellant also stated that the Respondent had not returned the Van on 1 February 2021 and still did not want to return the Van. 12 Sometime in or around June and July 2021, the Appellant applied to LTA to deregister the Van so as to obtain a refund of the COE premium.21Foot Note 21×1RA p 89 (NE 13 March 2023 p 37 lines 9–14). 13 On 25 August 2021, LTA issued a letter to the Appellant stating that the Van had been deregistered on 13 December 2020 and that a COE rebate of $25,995 was granted.22Foot Note 22×1RA pp 751–752. 14 On 19 October 2021, the Appellant commenced DC 2230 against the Respondent. In respect of the Respondent’s conversion of the Van on 1 February 2021, the Appellant claimed as damages “[t]he cost of the Van valued at $75,000.00” and “loss of use” of the Van at $100 per day from 1 February 2021 to the date of judgment.23Foot Note 23×2RA p 1081 (Statement of Claim (Amendment No 1) dated 30 August 2022 at paras 24(a), 24(c) and 24(d)). 15 On 21 January 2022, Malaysian Customs carried out a raid at 57-J Jalan Serai, found liquor with unpaid duty in the Van, and towed the Van to their compound.24Foot Note 24×1RA pp 660–661 (Appellant’s AEIC at para 104); Judgment at [23] and [56]–[57].The Appellant was not in Malaysia at the time (see [10] above). 16 On 5 July 2022, LTA sent an email to the Appellant stating that the Van had been deregistered on 25 August 2021 due to loss through theft and that the Van’s “deregistration date and its applicable rebate granted [was] based on the police report date of 13 December 2020” (ie, the 13 Dec 2020 JB Police Report).25Foot Note 25×1RA p 753. 17 On 19 October 2022, Malaysian Customs sent an Offer to Compound Offences to the Appellant.26Foot Note 26×1RA pp 764–765.The Offer stated that the Appellant was found to have committed an offence under s 135(1)(d) of the Customs Act 1967 (M’sia) of possession of uncustomed or prohibited goods on 21 January 2022 at 57-J Jalan Serai. Pursuant to s 131(1) of the Customs Act 1967 (M’sia), an offer was made for the Appellant to compound the offence for the sum of RM10,000. The offer was stated to be valid until 2 November 2022. It was further stated that, if no payment was received, prosecution for the offence could be instituted against the Appellant without further notice. The Appellant disputes that he committed any customs offence and refused to accept the offer to compound the offence.27Foot Note 27×1RA p 662 (Appellant’s AEIC at para 110). 18 On 6 December 2022, Malaysian Customs sent a Notice of Seizure to the Appellant.28Foot Note 28×1RA pp 772–773.The Notice stated that the Van and various items of liquor (which had presumably been found in the Van) were seized on 6 December 2022. It was also stated that the Van was seized on reasonable suspicion that an offence was committed, and that all seized items could (in the absence of prosecution) be forfeited if no written claim was made within one calendar month from the date of seizure. It is undisputed that the Appellant instructed his Malaysian solicitors to respond to Malaysian Customs, asking to be heard, and to date has not received any response.29Foot Note 29×1RA p 663 (Appellant’s AEIC at para 113); 1RA p 318 (NE 10 April 2023 p 133 lines 1–25); RC at para 61; Judgment at [66].At the hearing of this appeal, the Appellant’s counsel confirmed that this remains the position. 19 It is undisputed that the Appellant has not regained possession of the Van.30Foot Note 30×Judgment at [24].This remained the position as of the hearing of this appeal.",
        "The decision below": "20 The DJ found that the Respondent had converted the Van on 1 February 2021 but that such conversion had ceased by 21 January 2022 when Malaysian Customs seized the Van.31Foot Note 31×Judgment at [32], [47], [53] and [58]. 21 The DJ accepted that the Van had been seized by Malaysian Customs because it had been found to contain uncustomed or prohibited goods.32Foot Note 32×Judgment at [56].However, the DJ considered that there was no evidence before her that the Respondent was responsible for placing the uncustomed goods in the Van.33Foot Note 33×Judgment at [60]. 22 CitingAries Telecoms (M)Bhd v ViewQwest Pte Ltd (Fiberail Sdn Bhd, third party)[2020] 3 SLR 750 (“Aries”) at [79] for the proposition that a conversion period ends where the party converting the chattel could be said to have ceased to act inconsistently with the owner’s rights, the DJ reasoned that as the Respondent had ceased to have possession of the Van from 21 January 2022, his conversion of the Van had therefore also ceased on that date.34Foot Note 34×Judgment at [61]. 23 Turning to the Appellant’s claim for loss of value of the Van, the DJ held that it would not be appropriate to award the Appellant the market value of the Van as she was “not persuaded that it was the [Respondent] that was responsible for placing uncustomed goods in the Van leading to its seizure by Malaysian Customs”.35Foot Note 35×Judgment at [65].In any case, it was “not clear if there has been a total loss of the Van” as the Appellant “may well be able to recover the Van from Malaysian Customs”.36Foot Note 36×Judgment at [66].The Appellant had also recovered the COE rebate from deregistering the Van so it was “not a case of complete loss of value”.37Foot Note 37×Judgment at [66]. 24 The DJ then noted that “the [Appellant’s] pleaded relief [was] for damages for loss of use”.38Foot Note 38×Judgment at [68].The DJ noted that both parties were content to adopt the approach of using a fair rental rate to determine the amount of compensation payable to the Appellant for loss of use of the Van.39Foot Note 39×Judgment at [68] and [69].The DJ held that: (a) the Appellant’s use of a daily rental rate of $100 was not unreasonable;40Foot Note 40×Judgment at [74].and (b) the period for which the Appellant was entitled to claim loss of use was from 1 February 2021 “to the date of the Van’s deregistration i.e. 25 August 2021 (206 days)”.41Foot Note 41×Judgment at [72].The DJ reasoned that even though she had found that the Respondent’s conversion of the Van lasted until 21 January 2022, the Appellant’s actions in deregistering the Van on 25 August 2021 meant that the Van could in any event no longer be used after 25 August 2021, unless the Appellant relicensed the Van. The Appellant therefore could not look to the Respondent for damages for loss of use after 25 August 2021.42Foot Note 42×Judgment at [72]. The DJ thus concluded that the Appellant was entitled to damages of $20,600, computed on the basis of $100 x 206 days.43Foot Note 43×Judgment at [76] and [128(a)].",
        "The parties’ cases on appeal": "",
        "The Appellant’s case": "25 In essence, the Appellant challenges the DJ’s holdings (a) that the Respondent’s conversion of the Van on 1 February 2021 ceased on 21 January 2022 when Malaysian Customs seized the Van; (b) disallowing the Appellant’s claim for loss of value of the Van; and (c) limiting the Appellant’s claim for loss of use of the Van from 1 February 2021 to 25 August 2021 on the basis that the Van was deregistered on the latter date.44Foot Note 44×Notice of Appeal filed on 16 August 2023 at points 1–5. 26 First, the Appellant submits that the period of conversion should be from 1 February 2021 to 3 August 2023,viz, the date of the DJ’s Judgment.45Foot Note 45×AC at para 8(a).The Appellant argues that, following the Respondent’s conversion of the Van on 1 February 2022, the Respondent never evinced any intention of ceasing, nor did he cease, to act inconsistently with the Appellant’s rights as the owner of the Van. Thus, “the intervening seizure of the Van by the Malaysian Customs on [21] January 2022 cannot affect and it did not in any way affect the Respondent’s liability for the conversion of the Appellant’s Van until the judgment date”.46Foot Note 46×AC at paras 27–31.Further, “[a]lthough immaterial to the determination of the issue of continued conversion”, it is the Respondent who should be “[held] liable for the seizure of the Van by the Malaysian Customs on the grounds that it was found with… uncustomed or prohibited goods”.47Foot Note 47×AC at paras 34–37.In any case, “even without regard to whether the Respondent is liable for the seizure”, on the application of the “but for” test, the Respondent’s conversion of the Van on 1 February 2021 was the cause of the subsequent harm and damage suffered by the Appellant – but for the Respondent’s unlawful conversion on 1 February 2021, “the subsequent seizure by Malaysian Customs would not have occurred and the Appellant would not have suffered the harm/loss”.48Foot Note 48×AC at paras 45–51.The Appellant’s claims were also not too remote as the Appellant’s losses were foreseeable.49Foot Note 49×AC at para 56. 27 Second, the Appellant submits that he is therefore entitled to “the market value of the Van as at [1] February 2021” of $75,000 (based on evidence adduced in the proceedings below of “the valuation of a similar van” at $79,900),50Foot Note 50×AC at para 73.less the COE rebate of $25,995 he had received, plus $1,862 being “[l]oss of COE at $266 a month for 7 months from [1] February 2021 to deregistration on [25] August 2021”.51Foot Note 51×AC at para 78.On this calculation, the Appellant arrives at the sum of $50,867 to be awarded.52Foot Note 52×AC at para 78. 28 Third, the Appellant submits that he is “additionally entitled to the loss of use of the Van” as “consequential damage flowing from the conversion”.53Foot Note 53×AC at para 79.The DJ was wrong to limit the period for loss of use damages from 1 February 2021 to 25 August 2021 because “regardless of the deregistration on [25] August 2021, it was the Respondent’s act in taking unlawful possession of the Van on [1] February 2021 and continuing with the unlawful possession thereafter that constituted the act of conversion”.54Foot Note 54×AC at para 87.The Appellant is thus entitled to $94,200 for the loss of use, calculated at $100 per day from 1 February 2021 to 3 August 2023,viz, the date of the DJ’s Judgment (942 days).55Foot Note 55×AC at para 93.",
        "The Respondent’s case": "29 The Respondent did not file any Notice of Appeal against the DJ’s Judgment. 30 The Respondent confirms that he does not appeal against “the date at which the act of conversion had commenced, being [1] February 2021”.56Foot Note 56×RC at paras 9, 26 and 58. 31 The Respondent submits that the DJ was correct to find that the period of the Respondent’s conversion of the Van was from 1 February 2021 to 22 January 2022, when the Van was seized by Malaysian Customs.57Foot Note 57×RC at paras 11(a)(i) and 23(iii). 32 However, the Respondent seeks “variation of the Judgment regarding the period of loss of use of the Van”, in that the period of loss of use did not cease on 25 August 2021 as found by the DJ but (a) on 13 December 2020, “being the operative date that the Van was deregistered, as stated in the letter of [25] August 2021 from LTA to the Appellant”; or (b) on 26 February 2021 when the Appellant filed the 26 Feb 2021 JB Police Report to withdraw his 2 Feb 2021 JB Police Report (see [9] above).58Foot Note 58×RC at para 9. 33 The Respondent concedes that his position at [32(a)] above is a new point not raised in the Court below but purports that “[t]he Respondent only realised post Judgment that the operative date of deregistration is 13 December 2020”.59Foot Note 59×RC at para 9(a).The Respondent argues that “[a]s the Appellant had deregistered the Van, with an effective date of [13] December 2020… the Van is no longer usable”.60Foot Note 60×RC at para 75. 34 As for his position at [32(b)] above, the Respondent says that the 26 Feb 2021 JB Police Report signified that “the Appellant had unconditionally withdrawn his claim for conversion” and “consented to the continued possession of the Van by the Respondent after [26] February 2021”.61Foot Note 61×RC at paras 23 and 27.",
        "Issues to be determined": "35 The issues to be determined in this appeal are: (a) whether, in respect of the Respondent’s conversion of the Van on 1 February 2021, the Appellant may claim as damages the value of the Van; and if so, what the quantification of that claim would be; and (b) whether, in respect of the Respondent’s conversion of the Van on 1 February 2021, the Appellant may claim damages for “loss of use” of the Van; and if so, what the period of that “loss of use” and the quantification of that claim would be.",
        "My decision": "36 In respect of the first issue at [35(a)] above, I hold that the Appellant may claim as damages for the Respondent’s conversion of the Van on 1 February 2021 the value of the Van at the date of conversion, which I assess at $68,000, less the COE rebate of $25,995 obtained by the Appellant in mitigation of his loss. Thus calculated, the damages awarded to the Appellant are in the amount of $42,005. 37 In respect of the second issue at [35(b)] above, I hold that the Appellant is not entitled to damages for “loss of use” of the Van. Consequently, the further questions under the second issue do not arise. 38 I explain my decision in further detail.",
        "The Appellant’s claim for the value of the Van": "39 The starting point of my analysis is the undisputed finding by the DJ that the Respondent converted the Van on 1 February 2021. On 21 January 2022, Malaysian Customs took the Van away from 57-J Jalan Serai and into their custody. As the parties and the DJ have done, I will refer to this event as Malaysian Customs having “seized” the Van, although I use the terms “seize” and “seizure” with reference to this timeframe loosely, since I note that the Notice of Seizure subsequently sent by Malaysian Customs to the Appellant stated that the Van was seized on 6 December 2022 (see [18] above). 40 I respectfully diverge from the DJ’s finding that the Respondent’s conversion of the Van ended when it was seized by Malaysian Customs on 21 January 2022. The High Court held inAriesat [79] that: the conversion period only ended when [the defendant] could be said to haveceasedto actinconsistently with [the plaintiff’s] rights as owner, and when [the defendant]beganto take stepsto allow [the plaintiff] to reclaim the [converted] equipment. [emphasis added in italics and bold italics] In my view, this calls for conduct on the part of the tortfeasor which indicates that he has ceased to act inconsistently with the chattel owner’s ownership rights. The occurrence of a discrete event that led to the tortfeasor passively losing possession of the converted chattel would not mean that the tortfeasorceased to actinconsistently with the chattel owner’s ownership rights. 41 In the present case, the Respondent had done nothing, as at 21 January 2022, to return the Van to the Appellant, evince an intention to return the Van to the Appellant, or otherwise cease acting inconsistently with the Appellant’s rights as owner of the Van. While the action taken by Malaysian Customs on 21 January 2022 removed the Van from the Respondent’s possession, that did not involve any step taken of the Respondent’s own volition to cease acting inconsistently with the Appellant’s ownership rights over the Van. In my view, this was thus not a situation of the period of conversion by the Respondent having ended with Malaysian Customs’ seizure of the Van. 42 Rather, the germane inquiry is whether Malaysian Customs’ seizure of the Van broke the chain of causation between the Respondent’s wrongful act of conversion and the loss of the Van suffered by the Appellant. Conversion is “a single wrongful act and the cause of action accrues at the date of the conversion”:General and Finance Facilities Ltd v Cooks Cars (Romford) Ltd[1963] 1 WLR 644 at 648. It is undisputed that the Appellant has not regained possession of the Van to date. The questions which thus arise are whether the Respondent’s conversion caused, and to what extent the Respondent should be held liable for, the Appellant’s loss of the Van. 43 Before turning to these matters, I briefly address the DJ’s comment that the Appellant “may well be able to recover the Van from Malaysian Customs”.62Foot Note 62×Judgment at [66].This engages two considerations: (a) an anterior point of whether it can even be said that the Appellant suffered a loss of the Van; and (b) a latter issue of whether the Appellant has mitigated his loss (which I deal with at [59]–[63] below). On the anterior point, I am constrained to adjudicate the matter based on the evidence presently before me. There is no evidence indicating a probable prospect that the Van will be recovered. I therefore take the view that the Appellanthassuffered loss of the Van, notwithstanding a possibility (which can only be speculated on) that the Van might be recovered.",
        "Causation": "44 I further find that the Respondent’s conversion of the Van on 1 February 2021 was the “but for” and legal cause of the Appellant’s loss of the Van. 45 Causation is made up of causation in fact and causation in law:Sunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 (“Sunny Metal”)at [52]. Causation in fact is concerned with the question of whether the relation between the defendant’s breach and the plaintiff’s damage is one of cause and effect in accordance with scientific or objective notions of physical sequence. It is concerned with establishing thephysical connectionbetween the defendant’s wrong and the plaintiff’s damage. The universally accepted test in this regard is the “but for” test:Sunny Metalat [52]. The “but for” principle poses the question of whether the plaintiff would have suffered the loss without (“but for”) the defendant’s wrongdoing. If he would not, the wrongful conduct wasacause of the loss:Kuwait AirwaysCorpn v Iraqi Airways Co (Nos 4 and 5)[2002] 2 AC 883 (“Kuwait Airways”) at [72]. The question is whether the wrongful conduct was anecessaryconditionof the occurrence of the harm or loss:Kuwait Airwaysat [73]. 46 Causation in law concerns the question of which event will be treated asthe causefor the purpose of attributing legal responsibility. The court has to decide whether the defendant’s wrongful conduct constituted the “legal cause” of the damage. This recognises that causes assume significance to the extent that they assist the court in deciding how best toattribute responsibilityfor the plaintiff’s damage:Sunny Metalat [54]. 47 The Respondent argues that his conversion of the Van on 1 February 2021 was “not connected” to Malaysian Customs’ seizure of the Van.63Foot Note 63×RC at para 50.I do not agree. But for the Respondent’s conversion and storage of the Van at 57-J Jalan Serai, uncustomed liquor would not have ended up stored in the Van while it was at 57-J Jalan Serai and Malaysian Customs would not have seized the Van on 21 January 2022 due to the uncustomed liquor found in the Van. 48 The Respondent suggests that the Appellant should be regarded as responsible for the uncustomed liquor found in the Van because (a) the Appellant was in Malaysia between 3 February and 21 April 2021 and it was possible that he placed the uncustomed liquor in the Van then; and (b) Malaysian Customs sent the Offer to Compound Offences dated 19 October 2022 to the Appellant stating “you are found to have committed the offence under the Customs Act 1967” after an interview with the Appellant on 30June 2022.64Foot Note 64×RC at paras 36–37, 42 and 52.I do not accept this suggestion as it is founded on conjecture and not evidence. There is no evidence ofhowthe Appellant could have placed uncustomed liquor in the Van when the Respondent kept the Van in the locked premises of 57-J Jalan Serai. In contrast, the objective evidence shows that the Appellant was away from Malaysia from 21 April 2021 to 24 March 2022 (see [10] above),ie, for majority of the period that the Van was kept by the Respondent at 57-J Jalan Serai. There is also no evidence as towhyMalaysian Customs chose to send the Offer to Compound Offences to the Appellant – that could simply have been because the Appellant is the owner of the Van. At the hearing of this appeal, the Respondent’s counsel candidly accepted that, although the Respondent had canvassed a similar suggestion in the proceedings below, the DJ had not made any finding that the Appellant was responsible for uncustomed liquor being found in the Van by Malaysian Customs on 21 January 2022. 49 The Respondent also argues that the seizure was not caused by him.65Foot Note 65×RC at para 49.However, it is immaterial that the Respondent may not have been responsible for storing the uncustomed liquor in the Van. The point remains that, but for his conversion of the Van and keeping it at 57-J Jalan Serai, uncustomed liquor could not and would not have been stored in the Van while it was at 57-J Jalan Serai and Malaysian Customs would not have seized the Van on 21 January 2022 upon discovering the uncustomed liquor in it. 50 I also regard the Respondent’s conversion of the Van as the legal cause of the Appellant’s loss of the Van. Responsibility for the Appellant’s loss should fall on the Respondent, notwithstanding the development of Malaysian Customs seizing the Van. In this regard, the case ofKuwait Airways,in which Lord Nicholls and Lord Hoffman elucidated the causal requirements in the context of the tort of conversion, is instructive. 51 InKuwait Airways, the defendant Iraqi Airways Co (“IAC”) was found to have converted ten of the claimant Kuwait Airways Corpn’s (“KAC”) aircraft against the backdrop of the 1990 Iraq war. Six aircraft were subsequently evacuated to Iran, impounded in Iran and returned only after more than a year, on KAC’s payment of a sum to Iran (the “Iran Six”). By a majority decision, the House of Lords allowed KAC to recover the cost of regaining the aircraft from Iran, the reasonable cost of repairing and overhauling the aircraft on their return, the cost of chartering substitute aircraft and any loss of profit. 52 Analysing the application of the “but for” test in the tort of conversion to the Iran Six, Lord Nicholls (in the majority) stated at [78]: Consistently with its purpose of providing a remedy for the misappropriation of goods, liability is strict…Whether the defendant still has thegoods or their proceeds matters not. … Baron Cleasby’s aphorism, uttered in 1872 inFowler v HollinsLR 7 QB 616, 639, still represents the law: “persons deal with the property in chattels or exercise acts of ownership over them at their peril.” This, he observed, was regarded as a salutary rule for the protection of property. [emphasis added in italics and bold italics] 53 In holding that the intervening acts of the Government of Iran did not excuse IAC from liability for the adverse financial consequences of the detention of the aircraft in Iran, Lord Nicholls stated at [91]–[92]: 91 The Iran Six were sent to Iran on the orders of the Government of Iraq. They were impounded there by the Government of Iran until their eventual return. 92 These facts do not excuse IAC from liability for the adverse financial consequences of the detention of the aircraft in Iran.A person who misappropriates another’s goods does so at his own risk.That is the nature of the wrong.He takes upon himself the risk of being unable to return the goods to their rightful owner. It matters not that he may be prevented from returning the goods due to unforeseen circumstances beyond his control.The reason for his non-return of the goods, or his delay in returning the goods, is neither here nor there so far as his liability to the owner is concerned.If the goods are eventually returned, thereby diminishing the financial loss suffered by the owner, this must be taken into account. But the wrongdoer’s liability ought fairly to extend to compensating the owner for the loss he sustains by virtue of his temporary loss of his goods, regardless of the impact any unforeseen circumstances may have had on the wrongdoer.The loss flowing from the unforeseen circumstances should be borne by the wrongdoer, not the innocent owner of the goods.Additionally, provided the amount is not out of proportion to the value of the goods, the wrongdoer ought to reimburse the owner for any money spent on recovering the goods or carrying out necessary repairs. [emphasis added in italics and bold italics] 54 Lord Hoffman (in the majority) similarly explained at [129]: In the case of conversion, the causal requirements follow from the nature of the tort. The tort exists to protect proprietary or possessory rights in property, it is committed by an act inconsistent with those rights and it is a tort of strict liability.So conversion is “a taking with the intent of exercising over the chattel an ownership inconsistent with the real owner’s right of possession”: per Rolfe B inFouldesv Willoughby(1841) 8 M & W 540, 550.And the person who takes is treated as being under a continuing strict duty to restore the chattel to its owner.It follows, first, that it is irrelevant that if IAC had not taken possession of the aircraft, someone else would have done so. Secondly,it is irrelevant that, having taken possession, IAC would have been prevented from restoring the aircraft (even if it had wished to do so) by circumstances beyond its control: the orders of the Iraqi Government and their detention in Iran.The liability isstrict, thus the causal questions are answered by reference to the nature of the liability. [emphasis added in italics and bold italics] 55 In the present case, the Respondent took the risk of not being able to return the Van once he converted it on 1 February 2021. Moreover, it bears repeating that the evidence does not show that the Respondent was prepared to return the Van at any time prior to 21 January 2022 (when Malaysian Customs seized the Van). In these circumstances, liability for loss of the Van should fall on the Respondent notwithstanding the actions of Malaysian Customs and notwithstanding that the Respondent no longer has possession of the Van.",
        "Remoteness of damage": "56 I also find that the damage suffered by the Appellant as a result of the Respondent’s conversion,viz, the Appellant’s loss of the Van, is not too remote to be recovered.Causation and remoteness of damage are two distinct inquiries:Sunny Metalat [51]. The inquiry into remoteness of damage follows after causation is established. It involves examining whether, and to what extent, the defendant should have to answer for the consequences which his breach hascaused. By this stage of the inquiry, causation would already have been established and remoteness merely sets the limits of actionability for damage admittedlycausedby the defendant’s wrong:Sunny Metalat [56]. The approach to restrict such liability is the test of reasonable foreseeability:Sunny Metalat [56]. In my view, the Appellant’s loss of the Van is a reasonably foreseeable consequence of the Respondent’s conversion of the Van and there is no reason to limit the Respondent’s liability for such loss (which I have found that he caused at [44]–[55] above).",
        "Mitigation": "57 I do not think there is basis to conclude that the Appellant failed to mitigate his loss of the Van. 58It is trite that a plaintiff has a duty to takereasonablesteps to mitigate the loss resulting from the defendant’s tort and cannot recover damages for loss which he couldreasonablyhave avoided:The “Asia Star”[2010] 2 SLR 1154 (“The‘Asia Star’”) at [24].To minimise any potential unfairness to the aggrieved plaintiff, the courts have sought to ensure that the standard of reasonableness required of him is not too difficult to meet. For instance, he is not required to act in a way which exposes him to financial or moral hazard. The standard of reasonableness falls short of being purely objective as it takes into account subjective circumstances of the plaintiff:The “Asia Star”at [31]. Pertinently, an assertion that the plaintiff failed to mitigate his loss must bepleaded and proved by the defendantrelying on it:Jia Min Building Construction Pte Ltd v Ann Lee Pte Ltd[2004]3 SLR(R) 288 at [71]. 59 In the present case, the Respondent pleaded that “the onus and/or burden is on the [Appellant] to recover the vehicle from Malaysian Customs and/or other relevant Authority”.66Foot Note 66×2RA p 1096 (Defence and Counterclaim (Amendment No 2) dated 19 September 2022 at para 25(f)(x)).However, the Respondent did not plead whatspecificstepsthe Appellant should have taken to recover the Van from Malaysian Customs. This matters because the reasonableness of any alleged inaction on the Appellant’s part cannot be assessedin vacuo. 60 On the Appellant’s part, he strenuously (and understandably) disputes liability for the customs offence and objects to paying a fine to compound the offence (see [17] above). To the extent that compounding the offence is necessary for Malaysian Customs to release the Van, I do not consider the Appellant’s refusal to do so an unreasonable failure to mitigate:he is not required to act in a way which exposes him to financial or moral hazard(see [58] above). What is less clear, however, is the nexus (if any) between compounding the customs offence and the release of the Van. The Offer to Compound Offences dated 19 October 2022 (see [17] above) made no mention, on its face, of seizing, making a claim for or forfeiting the Van. It was the Notice of Seizure dated 6 December 2022 (see [18] above) that referred to making a claim for or forfeiting the Van, but there was no mention, on its face, of having to compound the customs offence before making a claim for the seized Van. At the hearing of this appeal, the Appellant’s counsel submitted that both letters from Malaysian Customs had to be read together, and that, when read together, the inference was that Malaysian Customs would not release the Van without the Appellant first compounding the offence. In my view, this was a point concerning Malaysian law, of which there was no evidence. However, the Respondent’s counsel did not contest the Appellant’s understanding of Malaysian Customs’ correspondence. Instead, the Respondent’s argument was that the Appellant could choose not to compound the offence and “could have refuted the charge proving his innocence of the offence”.67Foot Note 67×RC at para 61.It is unclear what exactly the Respondent means by “refuted the charge” since the Appellant has not beenprosecutedfor any customs offence; of significance, however, is the implicit concession – that it is reasonable for the Appellant to choose not to compound the offence and to maintain his innocence – underlying the Respondent’s point. 61 Next, while it is not disputed that the Appellant’s Malaysian solicitors had written to Malaysian Customs and to date have not received a response (see [18] above), it is unclear whether the Appellant had instructed his Malaysian solicitors to write to Malaysian Customs within the one-month deadline stipulated in the 6 December 2022 Notice of Seizure. The Appellant’s counsel was unable to shed light on this point at the hearing of this appeal. 62 Ultimately, however, the above matters were for the Respondent to press at the trial below (including by adducing evidence of Malaysian law, if necessary) if he wished to contend that there were specific reasonable steps the Appellant could, but failed to, have taken to recover the Van from Malaysian Customs. The burden of proving any assertion that the Appellant failed to take all reasonable steps to mitigate his loss lies on the Respondent and has not been discharged. 63 The Respondent argues that “[i]t is unjust if the Appellant simply gets damages for the value of the Van, and then simply compounds the uncustomed goods offence, take[s] delivery of the Van and be double compensated”.68Foot Note 68×RC at para 63.However, it is mere speculation that the Appellant would act in such a manner, particularly after taking the position in these proceedings that it is objectionable and unreasonable to expect him to compound an offence which he did not commit. There would repercussions if it emerges that the Appellant deliberately misled the Court. 64 For completeness, the Appellant did mitigate his loss by seeking and obtaining a COE rebate, which is elaborated on at [74] below, as part of my assessment of damages, to which I now turn.",
        "Measure of damages": "65 The object of an award of damages for conversion is to compensate the plaintiff for the damage he has suffered:Ariesat [92]. The normal measure of damages in conversion is the value of the goods converted at the time of conversion:Chartered Electronics Industries Pte Ltd v Comtech IT Pte Ltd[1998] 2 SLR(R) 1010 (“Chartered Electronics”) at [17];Marco Polo Shipping Co Pte Ltd v Fairmacs Shipping & Transport Services Pte Ltd[2015] 5 SLR 541 (“Fairmacs (CA)”) at [29];Fairmacs Shipping & Transport Services Pte Ltd vHarikutai Engineering Pte Ltd and another[2015] 1 SLR 904 (“Fairmacs (HC)”) at [24]. 66 One way of putting a monetary figure on the value of the goods converted is to use the “market value” of the goods because the “market value” is the best approximate of the loss suffered by the plaintiff who has been deprived of his goods:Fairmacs (CA)at [30];Fairmacs (HC)at [24];Chartered Electronicsat [18]. Where the market price cannot be determined, the value of the goods can be determined, instead, by the cost of replacement, which is typically the price at which the goods were bought:Fairmacs(CA)at [33];Chartered Electronicsat [18]. 67 Where precise evidence of the value of goods converted is not obtainable, the court must do the best it can. By doing the best it can, the court may have regard to a variety of evidence. In this regard, courts have taken into account original cost less depreciation:Fairmacs (HC)at [60]. In practical terms, a court would have to carry out the assessment of damages in a flexible manner as regards what would be adequate proof of damage so as to achieve the purpose of compensatory damages:Fairmacs (HC)at [61];Robertson Quay Investment Pte Ltd v Steen Consultants Pte Ltd and another[2008] 2 SLR(R) 623 at [27]–[28] and [30]. Value of the Van 68 Accordingly, the measure of the Appellant’s damages for loss of the Van should be the value of the Van as at 1 February 2021, and I approach the assessment of the value of the Van with the above legal principles in mind. 69 The Appellant submits that the market value of the Van as at 1 February 2021 should be taken to be $75,000. He bases this figure on an advertisement posted on 6 April 2022 on sgCarMart.com for the sale of a Toyota Hiace 2.7A (which is the same model as the Van) at $79,900 (“advertised van”).69Foot Note 69×1RA p 755.The registration date of the advertised van was stated as 14 May 2009 (close to the Van’s registration in February 2009) and it was stated as having “COE till 01/2029” (similar to the Van’s COE expiry in February 2029). The advertised van was described, among others, as “Fully Loaded With Accessories For VIPs”, “Great For Upcoming Influx of Tourist Next Year” and “Well Maintained”. 70 I do not consider this advertisement to be reliable evidence that the market value of the Van as at 1 February 2021 was $75,000. I doubt the advertisement would even be evidence of the market valueof the advertised van. A “market” exists where there is a willing seller and willing buyer after negotiations:Fairmacs(CA)at [31]. The advertised sale price of the advertised van does not mean that it would have fetched that price.A fortiori,the advertisement (posted, I would add, on 6 April 2022) does not shed meaningful light on the market valueof the Vanandasat 1 February 2021. Further, notwithstanding the facial similarities in vehicle model, registration date and COE expiry between the Van and the advertised van, it is uncertain that both vehicles were in such similar condition (contrast the advertised van’s description (even allowing for puff) at [69] above with the problems experienced with the Van set out at [72(c)] below) as to be considered of comparable value. 71 I also do not think that it would be appropriate, in this case, to determine the value of the Van by the cost of its replacement, taking such cost as the price at which the Van was bought. The Van is a second-hand vehicle that is by now in a particular condition (see [72(c)] below) and it is thus, in a manner of speaking, asui generisarticle. It would be artificial to apply its purchase price in June 2016 as its value in February 2021 without giving the matter any further consideration. 72 The Court is thus left to “do the best it can” and flexibly assess the value of the Van as at 1 February 2021 (see [67] above). In this regard, I consider the following factors to be relevant: (a) The Van was manufactured in 2008. An assessment of value in 2021 would be of a 13-year-old Van. (b) The Appellant purchased the Van second-hand for $68,880 in June 2016, with almost three years of the original ten-year COE term remaining. (c) The DJ accepted that repairs and maintenance works had to be conducted on the Van in August and September 2019.70Foot Note 70×Judgment at [13] and [82]–[83].Based on the WhatsApp text messages exchanged between the Appellant and the Respondent during that period, the Appellant had variously reported that he “could not start the van”, acknowledged that the Van had suspension problems from “[t]oo much damage from all that off-road driving”, acknowledged that there was “a lot of work needed on the aircon”, and reported sounds “when braking”.71Foot Note 71×Judgment at [82].The Appellant also agreed in cross-examination at the trial below that he had “taken the van cross-country to get to the Ulu Tiram animal shelter”72Foot Note 72×1RA p 308 (NE 10 April 2023 pp 123 line 31 – p 124 line 1).and that “[t]he air-condition, steering, many things were found in need of repairs in 2019”.73Foot Note 73×1RA p 309 (NE 10 April 2023 p 124 lines 2–4). (d) By 1 February 2021, almost five years after the Appellant had purchased the Van, there would have been some depreciation since the time of its purchase, albeit there was a longer remaining COE term (eight years) after the COE had been renewed on 2 February 2019. 73 Considering all these factors in the round, and on a broad-brush basis, I find it reasonable to (a) use as the starting point of my assessment the Van’s purchase price of $68,880 in June 2016; (b) adjust that figure slightly downwards to $68,000 to account for (i) depreciation and the Van’s condition five years later (ii) offset against the longer remaining COE term at that time; and (c) thereby take $68,000 as the value of the Van as at 1 February 2021. COE rebate 74 As the DJ rightly alluded, any compensation for loss of value of the Van must take into account the COE rebate the Appellant received. The Appellant also acknowledges that credit must be given for the COE rebate of $25,995 he received. However, he seeks to add back the sum of $1,862 being “[l]oss of COE at $266 a month for 7 months from [1] February 2021 to deregistration on [25] August 2021”.74Foot Note 74×AC at para 78.There is no basis for this. LTA’s email dated 5 July 2022 (see [16] above) indicates that the COE rebate of $25,995 was calculated for the period of 13 December 2020 to 3 February 2029.75Foot Note 75×RC at para 80.This appears to have been because LTA proceeded on the basis that the Van had been stolen on 13 December 2020, as the Appellant’s 8 May 2021 SG Police Report seemed to suggest (see [11] above). Whatever the propriety of the Appellant having received a COE rebate from 13 December 2020 may be, the point is that, having received that rebate, which more than covers the period from the time the DJ found the Van was converted, the Appellant has to give full credit for that rebate. Award of damages for loss of the Van 75 I therefore award the Appellant damages for loss of the Van in the net amount of $42,005, being the assessed value as at 1 February 2021 of $68,000 less the COE rebate of $25,995.",
        "The Appellant’s claim for “loss of use” of the Van": "76 The basis of the Appellant’s claim for “loss of use” of the Van is not entirely clear, as elaborated at [82] below. 77 In the proceedings below, the DJ allowed the Appellant’s claim for damages for “loss of use” of the Van, computed on the basis of a fair daily rental rate for the Van multiplied by 206 days in the period from 1 February 2021 to 25 August 2021 (which she took as the date of deregistration of the Van). She explained that “[c]onceptually, [she] accept[ed] that one way of measuring damages for a conversion claim is the amount a defendant would reasonably have to pay for a license by the plaintiff to act: seeAriesat [93]”.76Foot Note 76×Judgment at [68].Ariesat [93] referred to damages based on the “user principle”. 78 Damages falling under what has been termed the “user principle” are assessed by reference to the fee that the defendant would reasonably have had to pay for a licence by the plaintiff to act. They have been awarded in a variety of contexts including in the torts of conversion and wrongful detention:Turf Club Auto Emporium Pte Ltd and others v YeoBoong Hua and others and another appeal[2018] 2 SLR 655 (“Turf Club”) at [135] and [210]. 79 In my judgment, this is not an applicable case for the award of damages based on the “user principle”. In Gary Chan and Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2nd Ed, 2016) at para 11.061, the learned authors explain when damages may be awarded on the “user principle” in the tort of conversion, as follows: In cases involvingtemporary deprivation of property, aclaimant who has not suffered actual financial lossmay sometimes seek damages on the “user” principle,ie, a notional charge representing the rent or price for the claimant’s agreement to allow the defendant the use of the asset. [emphasis added in italics] 80 Similarly, inAriesat [93], the High Court explained that: [The plaintiff] did not claim for any loss or damage arising from the unavailability of the [converted] equipment for its own use during the [conversion period]. Instead, it claimed damages based on [the defendant’s] use of the [converted] equipmentduring the [conversion period]. The parties agreed that the proper measure of ordinary damages, based on the user principle, is the rental rate of the [converted] equipment over the conversion period at a rate of US$2,700 per month… [emphasis added in italics] 81 As is evident from the above extracts, in the context of the tort of conversion, damages may be awarded on the “user principle” for a specific period of conversion of the plaintiff’s goods in respect of which the plaintiff is unable to identify pecuniary loss. This measure of damages compensates the plaintiff for the interference with or loss of his dominium over his goods:Turf Clubat [213];Yenty Lily (trading as Access International Services) v ACES System Development Pte Ltd[2013] 1 SLR 577 (“Yenty Lily”) at [43]. In the present case, the Van has not been returned to the Appellant at all. The Appellant has also sought (and I have awarded) compensation for loss of the Van, and it would result in double recovery if damages on the “user principle” were also awarded. An award of damages based on the “user principle” would thus be inapposite in this case. 82 In this appeal, the Appellant says that he seeks damages for “loss of use” of the Van asconsequential loss(see [28] above). It is unclear if he made this argument in the proceedings below. Damages for consequential loss are conceptually different from damages based on the “user principle”. At the same time, the Appellant relies in this appeal onThe Owners of the Steamship “Mediana” v The Owners, Master and Crew of the Lightship “Comet”[1900] AC 113 (“The‘Mediana’”) at 117 for the proposition that his “loss of use” claim did not depend on him showing any particular use he was going to make of the Van .77Foot Note 77×AC at paras 84–86.That point might be relevant in the context of damages based on the “user principle” (seeYenty Lilyat [43]) (which I have declined to award at [79]–[81] above), but it does not apply to claiming for and proving consequential loss. Indeed, in the passage inThe“Mediana”at 117 relied on by the Appellant, the Earl of Halsbury LC went on to state that “when you are endeavouring to establish the specific loss of profit… you must shew it, and by precise evidence”. 83 In any event, I find that there is no legal basis for the Appellant to be awarded damages for “loss of use” of the Van as consequential loss. It is an established principle that besides the value of the converted goods, a plaintiff may also be entitled to damages for consequential losses as a result of the act of conversion, provided the consequential losses are not too remote:Chartered Electronicsat [19]. Examples of consequential losses include loss incurred through or by being deprived of the use of the goods:Chartered Electronicsat [19];Fairmacs (CA)at [29]. Loss through or by being deprived of the use of converted goods may be incurred in situations where the plaintiff has to hire substitute capacity until the converted goods are replaced, or where the plaintiff suffers losses of business or profits until the converted goods are replaced or substitute capacity is obtained (seeKuwait Airwaysat [95]). The Appellant has adduced no evidence of any such losses. Indeed, the conception of “loss of use” that the Appellant has in mind is different from that of consequential loss, and appears to effectively amount to loss of the Van itself. Loss of the Van is measured according to the value of the Van. Awarding the Appellant damages for loss of the Vanandfor “loss of use” of the Van, as he has claimed, would result in double recovery. 84 In short, there is no basis for the Appellant’s “loss of use” claim for damages and I do not allow it. It follows that there is no need to address either party’s arguments on the period for which “loss of use” should be compensated. 85 However, I make the following observations on the Respondent’s attempt to seek “variation” of the DJ’s award of damages based on “loss of use”. 86 The Respondent’s first argument is that the period of loss of use under the Judgment should be “varied” to 13 December 2020, “being the operative date that the Van was deregistered, as stated in the letter of [25] August 2021 from LTA to the Appellant”.78Foot Note 78×RC at para 9(a).The Respondent concedes that this is a new point not raised in the Court below but purports that “[t]he Respondent only realised post Judgment that the operative date of deregistration is 13 December 2020”.79Foot Note 79×RC at para 9(a).I am unable to see how this could be the case when LTA’s letter of 25 August 2021, on which the Respondent relies for this new argument, was already in evidence in the proceedings below. There was no basis for the Respondent to make this new argument belatedly in this appeal. 87 The Respondent’s second argument is that the period of loss of use under the Judgment should be “varied” to 26 February 2021 when the Appellant filed the 26 Feb 2021 JB Police Report to withdraw his 2 Feb 2021 JB Police Report (see [9] above).80Foot Note 80×RC at para 9(b).The Respondent says that the 26 Feb 2021 JB Police Report signified that “the Appellant had unconditionally withdrawn his claim for conversion” and “consented to the continued possession of the Van by the Respondent after [26] February 2021”.81Foot Note 81×RC at paras 23 and 27.This argument essentially challenges the DJ’s decision that the conversion continued past 26 February 2021. The DJ expressly rejected the Respondent’s submission in the proceedings below that the Appellant’s withdrawal of his 2 Feb 2021 JB Police Report should be taken as the Appellant withdrawing his demand for the Van’s return or the end of the Respondent’s conversion.82Foot Note 82×Judgment at [71].On a proper characterisation, the Respondent’s argument does not seek to “vary” the DJ’s decision on the period of loss of use, but seeks, in substance, to overturn the DJ’s holding regarding the Respondent’s conversion of the Van. It is not permissible for the Respondent to mount this challenge without having filed a Notice of Appeal. 88 Order 55D of the Rules of Court (2014 Rev Ed) (“ROC”) governs this appeal. The Respondent is presumably relying on O 55D r 7(5) of the ROC, which states that: A respondent who, not having appealed from the decision of the Court below, desires to contend on the appeal that the decision of the Court should be varied in the event of an appeal being allowed in whole or in part, or that the decision of that Court should be affirmed on grounds other than those relied upon by that Court, must state so in his Case, specifying the grounds of that contention. 89 This rule mirrors O 57 r 9A(5) of the ROC which pertains to appeals to the Court of Appeal. While O 57 r 9A(5) (and, correspondingly, O 55D r 7(5)) of the ROC allows successful respondents to mount a case to affirm the judge’s ultimate decision by raising other arguments which did not find favour with the court below without needing to file a cross-appeal (L Capital Jones Ltd and another vManiach Pte Ltd[2017] 1 SLR 312 at [65] and [67]), it does not givecarte blancheto a respondent to circumvent the need to file a cross-appeal in a situation where he is challenging a holding by the court that had gone against him (Rals International Pte Ltd v Cassa diRisparmio di Parma e Piacenza SpA[2016] 5 SLR 455 at [23]). 90 In any event, the “variations” sought by the Respondent have no substantive relevance to the issues in this appeal, given my decision that the Appellant is not entitled to claim damages for “loss of use” of the Van.",
        "Conclusion": "91 In conclusion, I allow the Appellant’s appeal to the extent of setting aside the award of damages, made by the DJ at [128(a)] of the Judgment, in respect of the Respondent’s conversion of the Van on 1 February 2021. I make a substitute award of damages in the amount of $42,005. 92 If parties are unable to agree on the costs of this appeal and the proceedings below, they are to file their written submissions on the costs to be awarded in DCA 24 and DC 2230, limited to five pages, within one week from the date of this judgment. Kristy TanJudicial Commissioner of the High Court Gopal Perumal (Gopal Perumal & Co) for the appellant; S Thulasidas s/o Rengasamy Suppramaniam (Ling Das & Partners) for the respondent."
    }
}