{
    "case_title": "K Shanker Kumar vNedumaran Muthukrishnan(Official Assignee, non-party)",
    "ncitation": "[2023] SGHC 214",
    "coram": "Goh Yihan JC",
    "sections": {
        "The background facts": "3 On 20 October 2021, the respondent commenced B 2519 against the appellant to recover a sum of $16,315.27. The appellant incurred this sum because the parties had been involved in litigation in the State Courts and judgment had been entered against the appellant. 4 On 10 February 2023, the appellant received an email from the Ministry of Law’s Insolvency & Public Trustee’s Office (the “Insolvency Office”). The email stated that he was suitable for DRS and that he would have to pay: (a) a review fee of $250 by 24 February 2023; and (b) the first monthly instalment of $1,000, as well as a first-year administrative fee of $300, by 12 March 2023. 5 On 13 February 2023, before the appellant could make payment, he received three emails from the Insolvency Office stating that his case was under preliminary evaluation. The emails also stated, among others, that the “case administrator will be contacting you via post to notify you of the outcome of our assessment of your suitability for the DRS”.1Foot Note 1×Affidavit of Nedumaran Muthukrishnan dated 4 May 2023 at p 7.The appellant therefore withheld payment. 6 On 20 April 2023, B 2519 was heard by the AR, who made the following orders: (a) that a bankruptcy order be made against the defendant; (b) that the Official Assignee be appointed as trustee of the bankruptcy estate; and (c) that there be costs in favour of the plaintiff in line with r 149 of the Insolvency, Restructuring and Dissolution (Personal Insolvency) Rules 2020 read with the Second Schedule of the said Rules. 7 The appellant did not attend the hearing and claims he did not receive any notice of the hearing. However, the respondent claims that his solicitors had notified the appellant of the hearing on 20 April 2023 on four occasions, via the “Hotmail” email address that the appellant had been using in their correspondence since December 2021: (a) in an email dated 7 February 2023, when the respondent’s solicitors wrote to the appellant’s email address enclosing a copy of the Registrar’s Notice dated 7 February 2023, which stated that the hearing had been rescheduled to 20 April 2023 at 2.30pm; (b) in an email dated 10 April 2023, when the respondent’s solicitors wrote to the appellant’s email address enclosing a copy of the letter of Court dated 9 April 2023, which stated that the hearing remain fixed for 20 April 2023 at 2.30pm; (c) in an email dated 12 April 2023, when the respondent’s solicitors wrote to the appellant’s email address enclosing a copy of the Registrar’s Notice dated 12 April 2023, which contained the relevant Zoom details for the hearing on 20 April 2023 at 2.30pm; and (d) in an email dated 19 April 2023, when the respondent’s solicitors wrote to the appellant’s email address enclosing a copy of the respondent’s affidavit of non-satisfaction and the respondent’s written submissions for B 2519. 8 On 25 April 2023, the Insolvency Office informed the appellant that the AR made a bankruptcy order against him in B 2519 on 20 April 2023.",
        "The applicable law": "9 Section 316(3) of the IRDA provides that a court may dismiss a creditor’s bankruptcy application based on the following grounds: (3)  The Court may dismiss the application if — (a) it is not satisfied with the proof of the applicant creditor’s debt or debts; (b) it is not satisfied with the proof of the service of the application on the debtor; (c) it is satisfied that the debtor is able to pay all of the debtor’s debts; (d) it is satisfied that the debtor has made an offer to secure or compound for the applicant creditor’s debt the acceptance of which offer would have required the dismissal of the application and the offer has been unreasonably refused by the applicant creditor; or (e) it is satisfied that for other sufficient cause no order ought to be made on the application. The provision does not distinguish between the application of those grounds at first instance or on appeal. 10 It should also be mentioned that s 316(3) of the IRDA is identical to its predecessor provision, s 65(2) of the Bankruptcy Act (2009 Rev Ed) (the “BA”), which provides as follows: (2)  The court may dismiss the application if — (a) it is not satisfied with the proof of the applicant creditor’s debt or debts; (b) it is not satisfied with the proof of the service of the application on the debtor; (c) it is satisfied that the debtor is able to pay all his debts; (d) it is satisfied that the debtor has made an offer to secure or compound for the applicant creditor’s debt the acceptance of which offer would have required the dismissal of the application and the offer has been unreasonably refused by the applicant creditor; or (e) it is satisfied that for other sufficient cause no order ought to be made thereon. 11 As the Court of Appeal set out inMohd Zain bin Abdullah vChimbusco International Petroleum (Singapore) Pte Ltd and another appeal[2014] 2 SLR 446 (at [16]–[17]), the applicable standard for obtaining a dismissal of bankruptcy proceedings is “no more than that for resisting a summary judgment application,ie, a debtor need only raise triable issues”. This is because it would be a waste of court resources for an insolvency court not to summarily determine clear-cut issues that were not factually controversial (at [17]). However, s 65(2)(e) of the BA (and accordingly, s 316(3)(e) of the IRDA) represents the court’s residual discretion to dismiss bankruptcy proceedingseven ifit is satisfied that there are no triable issues (see the High Court decision ofChimbuscoInternational Petroleum (Singapore) Pte Ltd v Jallaludin bin Abdullah and other matters[2013] 2 SLR 801 at [46], whose holding in this regard was not disturbed on appeal). 12 As to the situations where the court’s residual discretion to dismiss bankruptcy proceedings can be invoked, the High Court decision ofTang YongKiat Rickie v Sinesinga Sdn Bhd (transferee to part of the assets of United Merchant Finance Bhd) and others[2014] SGHCR 6 is instructive. The court (at [12]) summarised foreign cases in which a bankruptcy petition was dismissed based on a similar “sufficient cause” provision or pursuant to the court’s general power to dismiss a bankruptcy application: (a)  the debtor has a reasonable prospect of being able to repay the debt: seeReLatifah Bte Hussainsa, ex p Perbadanan Pembangunan Pulau Pinang[2005] 2 MLJ 290 andReMS Ward[1933] MLJ 69; (b)  the date of the act of bankruptcy was wrongly stated: seeStephen Wong LeongKiong v HSBC Bank Malaysia Bhd (formerly known as Hongkong Bank (M) Bhd)[2011] 4 MLJ 207); (c)  there is a subsisting bankruptcy order made against the debtorin the same jurisdictionand the creditor did not act in good faith in bringing a subsequent bankruptcy petition: seeSama Credit& Leasing Sdn Bhd v Pegawai Pemegang Harta, Malaysia[1995] 1 MLJ 274; (d)  the judgment on which the debt is founded is unsound, unfair or in some manner defective: seeRe Victoria[1894] 2 Q.B. 387 andReDavenport[1963] 1 W.L.R. 817; (e)  the creditor is estopped from petitioning for bankruptcy: seeRe Stray(1867) 22 Ch. App. 374 andReA Debtor (No. 11 of 1935)[1936] Ch. 165; (f)  it is certain, as opposed to probable, that the debtor has no assets nor is there any hope of assets to accrue in future: seeRe Robinson(1883) 22 Ch.D. 816; (g)  the effect of the bankruptcy order is to stifle a claim, with a real prospect of success, which the bankrupt might otherwise have been able to pursue against the petitioning and only creditor to which the debtor was indebted: seeReRoss (a bankrupt)(No 2) [2000] BPIR 636; and (h)  there is or has been an abuse of the bankruptcy process by the creditor: see, for instance,Bank of Scotland v Bennett[2004] EWCA Civ 988. [emphasis in original] 13 These examples are non-exhaustive. Indeed, in the High Court decision ofLembagaTabung Angkatan Tentera (Malaysia) v Ling Lee Soon[2017] 3 SLR 414 (at [72]), the court held that “in deciding whether to exercise the court’s power to dismiss a bankruptcy application for cause under s 65(2)(e) [of the BA], a court is entitled to take into accountany factorand this includes the factors stated in ss 123(1)(c) and 123(1)(d)” [emphasis added]. For completeness, ss 123(1)(c) and 123(1)(d) of the BA state that the court may annul a bankruptcy order if it appears to the court that “proceedings are pending in Malaysia for the distribution of the bankrupt’s estate and effects amongst the creditors under the bankruptcy law of Malaysia and that the distribution ought to take place there”, or “a majority of the creditors in number and value are resident in Malaysia, and that from the situation of the property of the bankrupt or for other causes his estate and effects ought to be distributed among the creditors under the bankruptcy law of Malaysia”. 14 In summary, the residual discretion by which a court can dismiss a bankruptcy application is wide but must, of course, be exercised in a principled manner. In this regard, I note that the respondent and the OA have both referred to the High Court decision ofHSBC Bank (Singapore) Ltd v ShiYuzhi[2017] 5 SLR 859 (“ShiYuzhi”) to illustrate how this residual discretion should be exercised. In that case, the outstanding debt at the time of the bankruptcy hearing was $3,519.99. While the debt was relatively small and well below the statutory threshold of $15,000 (see s 61(1)(a) of the BA and s 311(1)(a) of the IRDA), Woo Bih Li J (as he then was) still considered it appropriate for the Assistant Registrar below to have made the bankruptcy order against the debtor. The learned judge explained (at [45] and [60]) that numerous adjournments had been granted for the debtor to satisfy his debt but he had not done so, and also that there may be other creditors who may be prejudiced if the appeal was allowed. In my view, all thatShiYuzhistands for is that the exercise of a court’s residual discretion to dismiss a bankruptcy application must be exercised with the particular facts of a case in mind. I do not see how it would otherwise affect the outcome in the present case. 15 For completeness, I note also that the courtmustdismiss a creditor’s bankruptcy application under r 99 of the Insolvency, Restructuring and Dissolution (Personal Insolvency) Rules 2020, but this is not relevant in the present appeal.",
        "My decision: the bankruptcy order is set aside": "16 With the above principles in mind, I set aside the bankruptcy order under s 316(3)(e) of the IRDA because I am satisfied that no order ought to be made on B 2519 based on facts that have been clarified since the learned AR’s decision below. However, I give liberty to the respondent to reapply pending the OA’s reconsideration of the appellant’s suitability for DRS. I decide this for the following reasons, all of which are underpinned by the importance of procedural justice (see the High Court decision ofUnited Overseas Bank Ltd v NgHuat Foundations Pte Ltd[2005] 2 SLR(R) 425 at [4]–[9]). 17 First, it was through no apparent fault of the appellant that he had been deemed unsuitable for DRS. The appellant hadunknowinglyfailed to pay: (a) the review fee by 24 February 2023; and (b) the first monthly instalment of $1,000 and the first-year administrative fee of $300 by 12 March 2023. As mentioned above, the appellant received several emails (at his “Gmail” email address) on 10 February 2023 and 13 February 2023. The OA has confirmed that these emails were sent in error due to a fault in its “Electronic Case Management System”. While the OA has clarified that it did not receive any clarifications from the appellant about the emails sent on 13 February 2023, I find that it is reasonable for the appellant not to have done so. It is reasonable for the appellant to think that the 13 February 2023 emails superseded the earlier 10 February 2023 email, and that his suitability for DRS was still being reviewed. Thus, it is reasonable for the appellant to then think he did not have to follow up with the actions required of him in the 10 February 2023 email. This led to him beingdeemedunsuitable for DRS, through no apparent fault of his. 18 Second, it was also through no apparent fault of the appellant that he did not receive the Notice of Unsuitability (“Notice”) from the Insolvency Office dated 6 April 2023 that he had been deemed unsuitable for DRS. As the OA has explained, the Notice was sent to the appellant at his Balestier address as opposed to his Woodlands address, where he had moved. The OA explained that although the respondent had informed the Insolvency Office on 15 February 2023 that the Balestier address had been transferred away from the appellant, the appellant did not update his address with the Immigration and Checkpoints Authority (“ICA”) until 28 June 2023. Because the Insolvency Office relied on the ICA database for the appellant’s address, the Notice was inadvertently sent to an address that the appellant no longer resided in. While the appellant had the responsibility to update his address with the ICA, it has not been suggested that his failure to do so was to evade notice from the Insolvency Office or the respondent. Indeed, he had no reason to do so as, according to the respondent at the hearing before the AR, the appellant had attended all previous hearings. Thus, the appellant reasonably did not receive the Notice, and continued to believe that his suitability for DRS continued to be assessed by the Insolvency Office. 19 Third, I do not think that the appellant’s absence at the hearing on 20 April 2023 due to his alleged non-receipt of the email correspondence is determinative. This is because, even if the appellant had attended the said hearing, he would have raised the very same two reasons above in relation to the apparent miscommunication with the Insolvency Office. This might have led the learned AR to adjourn matters and not make the bankruptcy order. However, in the appellant’s absence, the AR made the bankruptcy order against the appellant, without the appellant being able to clarify the circumstances about his deemed unsuitability for DRS. 20 In this connection, the respondent’s solicitors maintain that they had communicated the details of the hearing to the appellant at the Hotmail email address that they had been using all this while. The respondent’s solicitors have also stated on affidavit that their later emails to the appellant after 20 April 2023 were met with automatic replies stating that the mailbox of the Hotmail email address was full. This shows that the appellant was likely not clearing the mailbox of his Hotmail email address prior to 20 April 2023 and had not seen the details of the hearing before the AR below. In this regard, I do note the respondent’s solicitors’ position that they were simply not informed of the appellant’s decision to change to a new email address (being the Gmail email address I referred to at [17] above) when they had been communicating with him at the Hotmail email address previously. On his part, the appellant’s position is that he had communicated with the respondent’s solicitors using his Gmail email address, and hence they should know to communicate with him at that email address thereafter. While the appellant bears the onus of keeping himself informed of the hearing, I think it is factually plausible that there was a miscommunication between him and the respondent’s solicitors, through no fault of either party, that resulted in each side thinking that the wrong email address was operative. Broadly, I do not think that the appellant was trying to evade anything, as he could and did receive the emails from the Insolvency Office at the Gmail email address. 21 Fourth, while the respondent has stated that the appellant has not raised any cogent reasons as to the merits of the case, in that the appellant continues to be indebted in an amount over $15,000, the point remains that the bankruptcy order was made on, among others, the basis that the appellant was found unsuitable for DRS. However, it is now clear that the appellant was actually found suitable for DRS but had beendeemedunsuitable because of the miscommunication with the Insolvency Office. As such, had the appellant been placed on DRS, the AR would likely not have made the bankruptcy order against the appellant.",
        "Conclusion": "22 For all of these reasons, I allow the appeal, set aside the bankruptcy order against the appellant, and direct the OA to reassess the appellant’s suitability for DRS, bearing in mind that the OA had actually, in the 10 February 2023 email, indicated that the appellant is suitable for DRS. I do not see why the OA should deviate from this conclusion, but I direct it to reassess the appellant’s suitability for DRS in any case. However, I give liberty to the respondent to reapply pending the OA’s reconsideration of the appellant’s suitability for DRS. 23 Finally, I make no order as to costs. I should stress that my decision should not be read as attributing blame on any party, least of all, the respondent. Indeed, the respondent has every right to proceed with B 2519 and this appeal. However, it seems clear on the facts that the appellant had been assessed suitable for DRS but was deemed unsuitable because of a genuine miscommunication and an unfortunate confluence of events, all through no fault of any party here. Goh YihanJudicial Commissioner Yeow Tin Tin Margaret, Lim Wen Yang Bryan and Foo Chuan Ri (Hoh Law Corporation) for the plaintiff;The defendant in person; Christopher Eng for the official assignee."
    }
}