{
    "case_title": "Public Prosecutor vYeo Liang Hou and another",
    "ncitation": "[2023] SGHC 157",
    "coram": "Pang Khang Chau J",
    "sections": {
        "Introduction": "1 The two accused persons, Yeo Liang Hou (“Yeo”) and Nagaiah Rao a/l Alumanar (“Nagaiah”), each stood trial for a capital charge of trafficking in three packets containing not less than 991.2g of crystalline substance which was analysed and found to contain not less than 669.3 grams of methamphetamine (the “Drugs”). I convicted both Yeo and Nagaiah of the charges and they have appealed against my decision.",
        "The charges": "2 The charge against Yeo was that on 6 March 2018 at about 2.35am in the vicinity of Block 635C Punggol Drive (“Blk 635C”), he had trafficked in a controlled drug byhaving the Drugs in his possession for the purpose of trafficking, thereby committing an offence under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “MDA”). 3 The charge against Nagaiah was that on 6 March 2018 at about 2.18am at bus stop 65311 located at Oasis LRT Station (the “Bus Stop”), he had trafficked in a controlled drug bydeliveringthe Drugs to Yeo, thereby committing an offence under s 5(1)(a) of the MDA.",
        "The facts": "4 On 5 March 2018, at about 7.21pm, Nagaiah entered Singapore from Malaysia via Woodlands Checkpoint driving a white van bearing Malaysian registration number JPD 9290 (the “Van”).1Foot Note 1×Agreed Bundle (“AB”) at 658. 5 On 6 March 2018, at about 2.12am, a white van similar in appearance to the Van was seen turning into the driveway of Block 617C Punggol Drive and stopping behind the Bus Stop. About a minute later, the driver exited the van and walked towards the dustbin at the Bus Stop (the “Dustbin”). He loitered around the Dustbin for a minute or so before returning to the van. At about 2.18am, the driver of the van was seen carrying a plastic bag from the van to the Bus Stop and placing the plastic bag in the Dustbin before returning to the van empty handed. The van drove off about two minutes later.2Foot Note 2×Prosecution’s Closing Submissions (“PCS”) at para 15.One key area of dispute in this case concerned whether this white van was the Van and whether the person seen placing the plastic bag in the Dustbin was Nagaiah. 6 At about 2.35am, Yeo drove his white Honda Civic (the “Honda Civic”) to the Bus Stop. He alighted at the Bus Stop, removed the cover of the Dustbin, and retrieved a plastic bag (the “Plastic Bag”) from the Dustbin before replacing the cover of the Dustbin. Yeo returned to the Honda Civic and drove off. 7 Subsequently, Yeo arrived at Blk 635C, parked in front of the rubbish chute, and opened the Plastic Bag to find two bundles wrapped in blue tape. Central Narcotics Bureau (“CNB”) officers followed the Honda Civic to Blk 635C. After the CNB officers drove past the location where the Honda Civic was parked, Yeo drove off in the Honda Civic. In the process, Yeo first threw one bundle out of the passenger’s side window of the Honda Civic and then threw the other out of the driver’s side window of the Honda Civic. At about 3.15am, Yeo was arrested under the TPE flyover near to Tebing Lane.3Foot Note 3×Statement of Agreed Facts dated 16 March 2021 (“SOAF”) at para 8. 8 Nagaiah left Singapore via Woodlands Checkpoint in the Van at about 3.41am on 6 March 2018. He then returned to Singapore in the Van in the evening of 6 March 2018, left Singapore slightly after midnight in the morning of 7 March 2018, and then returned to Singapore in the Van again in the evening of 7 March 2018. He was arrested at about 9.40pm on 7 March 2018 along Pasir Ris Drive 12. 9 In the meantime, the two bundles which Yeo threw out of the Honda Civic were recovered and seized by CNB officers at about 4am on 6 March 2018. Specifically, Inspector Eugene Eng retrieved one torn white plastic bag containing one blue-taped bundle on a grass patch behind the staircase landing near the rubbish chute area of Blk 635C and one blue-taped bundle by the wheel of a recycling bin at the rubbish chute area of Blk 635C (the “Two Bundles”).4Foot Note 4×SOAF at para 10.The Two Bundles together contained three packets of crystalline substances (the “Three Packets”). 10 The table below summarises the Drugs retrieved from their respective locations and their associated exhibit markings. Location seizedExhibit descriptionCNB markingCourt markingOn a grass patch behind the staircase landing near the rubbish chute area of Blk 635COne torn white plastic bag containing:A1P263One blue-taped bundle, later found to contain:A1AP264One packet of crystalline substanceA1A1P266One packet of crystalline substanceA1A2P268By the wheel of a recycling bin at the rubbish chute area of Blk 635COne blue taped bundle later found to contain:B1P270One packet of crystalline substanceB1AP272 In these grounds, I adopt the CNB markings when references are made to the exhibits. 11 There was no dispute that the Three Packets were forensically analysed by the Health Sciences Authority and found to contain in aggregate not less than 669.3g of methamphetamine (also known as “ice”).5Foot Note 5×SOAF at paras 50–51.",
        "The parties’ cases": "",
        "The Prosecution’s case": "12 The Prosecution’s case against Nagaiah was that he had delivered the Drugs to Yeo, in that Nagaiah was the person who placed the Plastic Bag (containing the Drugs) in the Dustbin. DNA profile matching Nagaiah’s was recovered from the Plastic Bag and from one of the Two Bundles. Photographs of the Dustbin were found in Nagaiah’s phone. The metadata of these photographs showed that they were taken in the vicinity of the Bus Stop, at around the time the events described at [5] above occurred. The Prosecution relied on the presumption in s 18(1)(a) of the MDA that Nagaiah had possession of the Drugs in that, since Nagaiah had the Plastic Bag (containing the Drugs) in his possession, he was presumed to have had the Drugs in his possession. The Prosecution also relied on the presumption in s 18(2) of the MDA that Nagaiah had knowledge of the nature of the Drugs.6Foot Note 6×PCS at para 76. 13 As against Yeo, the Prosecution’s case was that Yeo possessed the Drugs for the purpose of trafficking in that he retrieved the Plastic Bag (containing the Drugs) from the Dustbin and only decided to throw the Drugs away after discovering that he was about to be approached by CNB officers. The Prosecution argued that they had proven that Yeo had actual possession of the Drugs and that he had actual knowledge of the nature of the drugs. The Prosecution relied on the presumption under s 17(h) of the MDA that Yeo possessed the Drugs for the purpose of trafficking.",
        "Yeo’s case": "14 Yeo claimed that the delivery of the Two Bundles to himviathe Dustbin was a wrong delivery.7Foot Note 7×Yeo’s Submissions after Trial (“Sub1 Yeo”) at para 30.Yeo admitted to having ordered 500g of methamphetamine from one “Danny” of which 150g had already been delivered previously, and he was therefore expecting to receiveonebundle containing 350g of methamphetamine when he retrieved the Plastic Bag from the Dustbin.8Foot Note 8×Sub1 Yeo at paras 31 and 32; Transcript (6 July 2021) 4:15–18.He was surprised to see two bundles instead of one when he opened the Plastic Bag. He initially thought one of the bundles could have been meant for him while the other bundle was delivered wrongly. He therefore threw the bigger bundle out of his car window. On thinking further, he realised that both bundles were not his and decided to throw the other bundle away as well. (At this point, it will be useful to note that Yeo had referred to the blue-taped bundles as “packets” in his submissions. For consistency and to avoid confusion, I will continue to refer to them as “bundles” in these grounds. One of the blue-taped bundles contained two clear plastic packets of drugs while the other blue-taped bundle contained one clear plastic packet of drugs. In these grounds, I will reserve the term “packets” for referring to these three clear plastic bags.) 15 Yeo did not dispute being in possession of the Drugs.9Foot Note 9×Sub1 Yeo at paras 92–93; Sub2 Yeo – Answers to JQs at Table 1, answer 1(b).Instead, Yeo submitted that, since the Plastic Bag (containing the Drugs) came into Yeo’s possession as a result of wrong delivery, Yeo did not and could not have knowledge of the nature of Plastic Bag’s contents. As for the intention to traffic, Yeo admitted that, when he collected the Plastic Bag from the Dustbin believing that it contained the drugs he ordered from “Danny”, he had intended to sell the drugs. However, Yeo submitted that, due to the wrong delivery, the Drugs which he actually collected from the Dustbin were not the drugs he ordered from “Danny”. He therefore did not have any trafficking intent in relation to the Drugs which were wrongly delivered to him.10Foot Note 10×Sub1 Yeo at para 197. 16 Because Yeo was recorded in one of the statements he gave to CNB officers as saying that he believed the bundle marked “B1A” was his, Yeo also ran an alternative defence that, if bundle “B1A” was proved to belong to Yeo, then he would only be liable for trafficking in 244.1g of methamphetamine, which is below the threshold of 250g for capital punishment.11Foot Note 11×Defence Case of Yeo Liang Hou (“Yeo’s Defence”) at para 3.",
        "Nagaiah’s case": "17 Nagaiah denied possession or knowledge of the Drugs. While Nagaiah did not deny that he had previously acted as a courier for drugs, he denied that he was the courier onthisoccasion.12Foot Note 12×Closing Submissions of Nagaiah Rao a/l Alumanar (“Nagaiah CS”) at para 37.According to Nagaiah, he never went to the vicinity of Punggol on the night of 5 March 2018 and in the early morning of 6 March 2018. (In the interest of brevity, I shall hereafter refer to the time period from the evening of 5 March 2018 to the early morning of 6 March 2018 collectively as “the night in question”.) He submitted that the Prosecution failed to prove beyond reasonable doubt that: (i) the van seen stopping behind the Bus Stop from about 2.12am to 2.18am on 6 March 2018 was the Van; and (ii) it was Nagaiah who placed the Drugs in the Dustbin.13Foot Note 13×Nagaiah CS at para 17.It was Nagaiah’s case that even taking the Prosecution’s case at its highest, the officers’ identification of a white van did not necessarily amount to an identification of the Van.14Foot Note 14×Nagaiah CS at paras 21 and 31.Further, there was no evidence that the officers could positively identify the person who exited the van at the Bus Stop, nor what the person had done at the Bus Stop.15Foot Note 15×Nagaiah CS at para 31. 18  It was not contested that DNA profile matching Nagaiah’s had been recovered from both the exterior and interior surface of the Plastic Bag and from the bundle “A1A”.16Foot Note 16×Nagaiah CS at para 34.However, Nagaiah argued that the presence of his DNA on the Plastic Bag and “A1A” could be entirely innocent, for his DNA was completely absent from “B1”.17Foot Note 17×Nagaiah CS at para 35.For example, if he had only touched the Plastic Bag but not “A1A”, his DNA could still have been transferred from the Plastic Bag to “A1A”, since “A1A” would have been touching the interior of the Plastic Bag.18Foot Note 18×Nagaiah CS at para 35. 19 Nagaiah made the further submission that the presence of his DNA on the Plastic Bag and “A1A” did not inexorably lead to the conclusion that he had deposited the Drugs in the Dustbin because he would sometimes assist with the purchase of sticky tapes for one “AA”.19Foot Note 19×Nagaiah CS at paras 37–39.He surmised that the presence of his DNA merely indicated that the Drugs could have originated from “AA” and were bound with the tapes Nagaiah purchased, but not necessarily that Nagaiah had handled the bundles containing the Drugs.20Foot Note 20×Nagaiah CS at para 39. 20 Turning to the photographs of a dustbin found on Nagaiah’s phone, Nagaiah made two submissions: (i) there was reasonable doubt as to the accuracy of the location information and timestamps of the photographs;21Foot Note 21×Nagaiah CS at para 40.and (ii) there was no way for the Prosecution to prove that the image in the photographs was that of the Dustbin at the Bus Stop.22Foot Note 22×Nagaiah CS at para 41.It was his contention that the Prosecution did not identify Nagaiah as the person placing the Plastic Bag containing the Drugs in the Dustbin, and therefore did not prove the trafficking charge against him beyond reasonable doubt.",
        "Applicable law": "21 Section 5 of the MDA provides: Trafficking in controlled drugs 5.—(1) Except as authorised by this Act, it shall be an offence for a person, on his own behalf or on behalf of any other person, whether or not that other person is in Singapore — (a) to traffic in a controlled drug; … (2) For the purposes of this Act, a person commits the offence of trafficking in a controlled drug if he has in his possession that drug for the purpose of trafficking. The term “traffic” is defined in s 2 of the MDA to include “give, administer, transport, send, deliver or distribute”. 22 As noted above, the charge against Nagaiah alleged that he had trafficked in a controlled drug bydeliveringthe Drugs contrary to s 5(1)(a) of the MDA, while the charge against Yeo alleged that he had trafficked in a controlled drug byhaving the Drugs in his possession for the purposes of traffickingcontrary to s 5(1)(a) read with s 5(2) of the MDA. 23 The required elements to establish a charge of trafficking under s 5(1)(a) of the MDA are (seeRaj Kumar s/oAiyachami v Public Prosecutor and another appeal[2022] 2 SLR 676 at [54]): (a) the act of trafficking, without authorisation, in a controlled drug; and (b) knowledge of the nature of the controlled drug, which can be proved or presumed pursuant to s 18(2) of the MDA. 24 The elements to be established for a charge of possession for the purpose of trafficking under s 5(1)(a) read with s 5(2) of the MDA are (seeMuhammadRidzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59]): (a) possession of a controlled drug (which may be proved or presumed under s 18(1) of the MDA, or deemed under s 18(4) of the MDA);(b) knowledge of the nature of the drug (which may be proved or presumed under s 18(2) of the MDA); and(c) proof that possession of the controlled drug was for the purpose of trafficking which was not authorised. 25 This distinction between the elements required to establish a charge brought under s 5(1)(a) of the MDA and the elements required to establish a charge brought under s 5(1)(a) read with s 5(2) of the MDA had also been recognised in cases such asPublic Prosecutor v Ranjit Singh GillMenjeet Singh and another[2017] 3 SLR 66 (at [34]),Public Prosecutor v Ramesh a/l Perumal and another[2017] SGHC 290 (at [25]) andPublic Prosecutor vRamdhan bin Lajis and another[2018] SGHC 104 (“Ramdhan\")(at [30]–[31]). 26 In relation to the element of possession, apart from proving actual possession, the Prosecution may also rely on the presumption of possession as set out in s 18(1) of the MDA, which read as follows: 18.—(1)  Any person who is proved to have had in his possession or custody or under his control — (a)  anything containing a controlled drug; (b)  the keys of anything containing a controlled drug; (c)  the keys of any place or premises or any part thereof in which a controlled drug is found; or (d)  a document of title relating to a controlled drug or any other document intended for the delivery of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug in his possession. 27 In relation to the element of knowledge of the nature of the controlled drug, apart from proving actual knowledge, the Prosecution may rely on the presumption of knowledge as set out in s 18(2) of the MDA, which read as follows: (2)  Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. 28 The Court of Appeal inObeng Comfort v Public Prosecutor[2017] 1 SLR 633 (“Obeng”) at [34]–[36] explained the presumptions under s 18 of the MDA as follows: 34 … For the purposes of s 18(1), what we are concerned with iswhether the thing in issue exists and whether the accused in fact has possession, control or custody of the thing in issue. The thing in issue is the container, the key or the document of title. In this sense, this provision deals with secondary possession of the drug in that the accused possesses, controls or has custody of something which has the drug or which relates to the title in, or delivery of, the drug. … Once the Prosecution proves that the thing in issue exists and that the accused has possession, control or custody of the thing in issue, the effect of s 18(1) is to raise a presumption of fact, which is that the accused, by virtue of his possession, control or custody of the thing in issue, is presumed to possess the drugs which are contained in or are related to the thing in issue. 35To rebut the presumption in s 18(1), the accused has to prove, on a balance of probabilities, that he did not have the drug in his possession. In this context, the most obvious way in which the presumption can be rebutted is by establishing that the accused did not know that the thing in issue contained that which is shown to be the drug in question. Thus, for instance, the presumption could be rebutted successfully if the accused is able to persuade the court that the drug was slipped into his bag or was placed in his vehicle or his house without his knowledge. … 36 Where the presumption in s 18(1) of the MDA is invoked by the Prosecution and is then rebutted successfully by the accused, the Prosecution would have failed to prove that the accused was in possession of the drug. There would be no need to consider the next issue of whether the accused had knowledge of the nature of the drug. However,if an accused is either (a) proved to have had the controlled drug in his possession; or (b) presumed under s 18(1) of the MDA to have had the controlled drug in his possession and the contrary is not proved, the presumption under s 18(2) that he has knowledge of the nature of the drug would be invoked. This follows because an accused person, who, it has been established, was in possession of the controlled drug should be taken to know the nature of that drug unless he can demonstrate otherwise.To rebut the presumption in s 18(2), the accused must prove, on a balance of probabilities, that he did not have knowledge of the nature of the controlled drug(in effect, that he did not have themensreaof the offence). InDinesh Pillai a/l K RajaRetnam v PP[2012] 2 SLR 903 (“Dinesh Pillai”), this court observed (at [18]) that the accused can do so by showing that “he did not know or could not reasonably be expected to have known the nature of the controlled drug”. [emphasis added] 29 Where the Prosecution does not rely on the presumption of possession under s 18(1) of the MDA, then in order to establish the first element of possession of a controlled drug, the Prosecution is required to prove not only that the accused was in possession of the package, but also that the accused knew that it contained something, which may later be established to be the shipment of controlled drugs (seeZainal bin Hamad v Public Prosecutor and another appeal[2018] 2 SLR 1119 (“Zainal”) at [12]). 30 Where the Prosecution does not rely on the presumption of knowledge under s 18(2) of the MDA, the Prosecution would have to prove that the accused had actual knowledge of the nature of the drug. A person has actual knowledge of a fact if he is aware that it exists or is almost certain that it exists or will exist or occur. Because of its subjective nature, knowledge is a fact that has to be inferred from the circumstances (seePublic Prosecutor v KooPui Fong[1996] 1 SLR(R) 734 at [14]). 31 Where the Prosecution has proved actual possession and knowledge instead of relying on the presumptions in s 18 of the MDA, the Prosecution may rely on the presumption of possession for the purpose of trafficking laid out in s 17 of the MDA as follows: 17.Any person who is proved to have had in his possession more than — … (h)  25 grammes of methamphetamine; …  whether or not contained in any substance, extract, preparation or mixture, shall be presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his possession of that drug was not for that purpose. 32 Where the Prosecution has relied on the presumption of trafficking under s 17 of the MDA, it cannot simultaneously rely on the presumptions of possession and knowledge under ss 18(1) and 18(2) of the MDA respectively (seeZainalat [38] and [42]–[45]).",
        "Issues for determination": "33 Given the contour of the parties’ cases as described above, the central issue in relation to Yeo’s case was the veracity of his “wrong delivery” defence while the central issue in relation to Nagaiah’s case was whether the Prosecution had proven beyond reasonable doubt that Nagaiah was the person who was seen coming out of a white van behind the Bus Stop to place the Plastic Bag in the Dustbin at around 2.18am on 6 March 2018. I will deal with these central issues in the course of going through the elements of the respective offences they have been charged with.",
        "The case against Yeo": "34 As noted above, Yeo was charged with possession for the purpose of trafficking. The elements to be established for this charge are: (a) whether Yeo was in possession of the Drugs (“first element”); (b) whether Yeo knew the nature of the Drugs (“second element”); and (c) whether Yeo had the Drugs in his possession for the purpose of trafficking (“third element”).",
        "Whether Yeo was in possession of the Drugs": "35 The first element concerned whether Yeo was in possession of the Drugs. As noted above, establishing possession of controlled drugs requires not only establishing that the accused was in possession of the package in which the drugs were found, but also that he knew that it contained something, which may later be established to be the shipment of controlled drugs. For this reason, I considered the physical component of the first element and the knowledge component of the first element separately. The physical component of the possession element 36 Although Yeo initially put the chain of custody of the Drugs in issue, Yeo ultimately did not dispute that he was in possession of the Drugs. In Yeo’s case for the defence filed before the trial, Yeo took the position that he could “neither be sure nor recall” if the plastic bag and the two bundles he collected from the Dustbin were the same plastic bag and two bundles which were seized by the CNB officers and eventually put into evidence, due to the quick sequence of events.23Foot Note 23×Yeo’s Defence at para 70.In particular, Yeo alleged that the Two Bundles were not seized by the CNB officers in his presence. Instead, the Two Bundles had already been seized by the time he was brought back to the scene after his arrest.24Foot Note 24×Yeo’s Defence at paras 21–22, read with Transcript (17 March 2021) 16:4–6 and 16:27–17:5.Yeo therefore required the Prosecution to prove the chain of custody.25Foot Note 25×Yeo’s Defence at para 72.By the time it came to closing submissions, Yeo no longer disputed the chain of custody and in fact accepted that possession had been proved.26Foot Note 26×Sub1 Yeo at paras 92–93.Although Yeo’s closing submissions still canvassed the question whether the search and seizure of the Two Bundles took place in his presence,27Foot Note 27×Sub1 Yeo at para 240.this was done not for the purposes of challenging the chain of custody or disputing possession, but only for the purpose of demonstrating that Yeo was a candid and credible witness because he readily conceded that he might have been mistaken on this issue when asked during cross-examination.28Foot Note 28×Sub1 Yeo at paras 261–263. 37 For completeness, I should record that, independently of Yeo’s concessions in his closing submissions, I was satisfied from the testimony of the CNB officers that the chain of custody of the Drugs had been proved. The knowledge component of the possession element 38 As establishing the chain of custody only establishes the physical component of possession, I turned to consider the knowledge component of possession. (1) Whether Yeo’s wrong delivery defence should be analysed in relation to the knowledge component of the first element or in relation to the second element 39 Since Yeo’s defence was one of wrong delivery,ie, that he did not know that the Plastic Bag contained a shipment of controlled drugs which were not ordered by him, a preliminary question arose as to whether the veracity of this wrong delivery defence should properly be analysed in relation to the knowledge component of the first element (possession of a controlled drug) or in relation to the second element (knowledge of the nature of the drug). In his closing submission, Yeo chose to concede the first element and analyse the wrong delivery defence in relation to the second element. The Prosecution, on the other hand, chose to analyse the wrong delivery defence in relation to the knowledge component of the first element. I appreciated that, in the final analysis, it made no practical difference either way. This was because, if the wrong delivery defence was made out, Yeo must be acquitted of the charge irrespective of whether one chooses to analyse the defence in relation to the first or second element. Conversely, if the wrong delivery defence was rejected, then (for reasons explained in the rest of these grounds) the only rational conclusion is that Yeo had the knowledge which satisfied both the second element of the offence and the knowledge component of the first element. Having said that, as a matter of logic, the Prosecution’s approach was more correct. This was especially since one of Yeo’s assertions was that he opened the Plastic Bag soon after collecting it to inspect its contents and, upon seeing two bundles instead of one, began to suspect that the bundles were not the drugs which he purchased. If this assertion of Yeo’s was accepted by the court, it could have the effect of disproving the knowledge component of the first element. (2) Consideration of Yeo’s wrong delivery defence 40 I therefore turned to consider Yeo’s wrong delivery defence. 41 As noted inZainalat [16], once the Prosecution had proven that Yeo was in possession of the Plastic Bag containing the Two Bundles and that its contents turned out to be the drugs in question, it would be incumbent on Yeo to discharge his evidential burden by raising a reasonable doubt that this was not the case. For the reasons given below, Yeo failed to do so. 42 The main planks of Yeo’s wrong delivery defence were as follows: (a) After Yeo collected the Drugs from the Dustbin, the PolCam captured two persons loitering near the Dustbin, and these two persons were probably the intended recipients of the Drugs. (b) When Yeo opened the Plastic Bag and saw that there were two bundles instead of one, he realised that at least one and probably both of the bundles were not the drugs he ordered from his supplier. (c) Yeo’s suspicions of a wrong delivery were fortified by certain “hiccups” throughout the night in making arrangements for delivery, giving rise to the possibility that Yeo might have collected the drugs from the wrong bus stop. (d) Yeo threw the Drugs out of his car because he realised that the Drugs were not meant for him. 43 I considered each of these planks in turn. (A) Whether the two persons who appeared in the PolCam footage could have been the intended recipients of the drugs 44 About two to three minutes after Yeo had collected the Drugs from the Dustbin, a person could be seen in the PolCam footage walking to the Bus Stop and stopping next to the Dustbin. He was then joined by a second person. They stood next to the Dustbin for less than 15 seconds before walking away.29Foot Note 29×Transcript (8 July 2021) at 14:31 and 15:32. 45 Yeo submitted that they were probably interested in the contents of the Dustbin as they had loitered next to the Dustbin for some time. Further, as there were no buses running at that time in the morning, the only reason they could be at the Bus Stop was that they were interested in the contents of the Dustbin. 46 I agreed with Yeo that it might be curious that these two persons would go to the Bus Stop at a time when no buses were running. However, that alone was not sufficient to raise a reasonable doubt in Yeo’s favour. Whatever reasons these two persons might have for going to the Bus Stop, I did not agree that they appeared to be interested in the contents of the Dustbin. First, it was clear from the PolCam footage that they did not remove the cover of the Dustbin. Yeo agreed during cross-examination that, in order to see clearly what was inside the Dustbin, one would have to remove the cover.30Foot Note 30×Transcript (7 July 2021) at 27:10–16.If the two persons were indeed the intended recipients of the Drugs, it would be most incredible for them to walk away nonchalantly from the Dustbin when they did not see the Drugs in the Dustbin, without at least first removing the cover of the Dustbin to search the Dustbin more thoroughly. Secondly, even though the upper torsos of the two persons were not visible in the PolCam footage during the period they were standing next to the Dustbin, it would appear from what could be seen of their legs during this time that they were standing straight throughout the entire time that they were next to the Dustbin. At no time was either of them bending down as one would expect them to do if they were indeed trying to retrieve something from the Dustbin. 47 In the light of the foregoing, I found Yeo’s submission concerning the two persons to be entirely speculative and without merit. (B) Whether Yeo could have realised that the Drugs were not his from the fact that there were two bundles instead of one 48 It was Yeo’s evidence that: (a) each time he placed an order for methamphetamine, he would always order two consignments of 250g each; (b) each 250g consignment would come in a single bundle; (c) unusually, he was expecting to collect 350g on this occasion; and (d) prior to this occasion, he had never received more than 250g per delivery. 49 In my view, once the foregoing four aspects of Yeo’s evidence were considered together, it was immediately apparent that Yeo’s submission was inherently illogical. Since all previous deliveries were received by Yeo in single bundles of 250g each, and Yeo had never received a delivery of more than 250g before, there was simply no way Yeo could have known whether the 350g he was expecting on this occasion would be packed in one bundle or two. In fact, Yeo himself conceded during cross-examination that he would not have known whether his supplier, “Danny”, would pack 350g of methamphetamine in one bundle or two bundles.31Foot Note 31×Transcript (7 July 2021) at 31:1–4.There was therefore no basis for Yeo to infer, from the fact that there were two bundles instead of one in the Plastic Bag, that the Drugs were not the drugs he ordered. (C) Whether there was more than one bus stop involved and Yeo had gone to the wrong bus stop 50 A second reason given by Yeo for suspecting that he had collected drugs which were not meant for him were the “many hiccups” throughout the night in relation to the arrangement for delivery of the drugs.32Foot Note 32×Transcript (6 July 2021) at 12:1–5; Transcript (7 July 2021) at 31:7-9; Transcript (8 July 2021) at 23:5. 51 Yeo testified that he had earlier in the evening arranged with “Danny” over the phone to collect his 350g of methamphetamine at Block 612 Punggol Drive (“Blk 612”). After waiting at Blk 612 for a while without seeing the delivery driver, Yeo decided to drive around the area.33Foot Note 33×Transcript (6 July 2021) at 4:4–10.Yeo spotted a white van which he recognised and called “Danny” to ask the latter to instruct the driver to head to Blk 612. However, Yeo saw that the white van did not head to Blk 612 but stopped at “Block 617” instead.34Foot Note 34×Transcript (6 July 2021) at 6:5–7. 52 I should pause to note that there was actually no building known as “Block 617” at Punggol Drive. There were only Blocks 617A, 617B, 617C and 617D. These four blocks of flats were separate buildings, not joined together as part of a larger building called “Block 617”. Although “Block 617” did not exist, it was perfectly understandable that Yeo would have found it convenient to use the generic term “Block 617” to refer to all four blocks of flats collectively in his testimony and investigative statements. It would not have been easy to recall which of the four blocks was the Bus Stop located in front of without the aid of photographs or maps. Based on the map found in Annex 2 of Yeo’s case for the defence, which was used as a source of reference at various junctures during the trial, the Oasis LRT Station was located directly in front of Block 617C while the Bus Stop was located directly in front of Block 617D (“Blk 617D”).35Foot Note 35×Yeo’s Defence at p 26.In the light of this, I found it convenient to also adopt, in these grounds, Yeo’s use of the term “Block 617” to refer to the four blocks of flats collectively. 53 To continue with the narrative, upon seeing the white van making a stop at “Block 617”, Yeo called “Danny” and asked the latter to instruct the driver to put Yeo’s drugs in the blue recycling bin there. The driver did not do so. Instead, “Danny” called Yeo and asked for him to proceed to “Block 617”. However, by the time Yeo arrived, the white van was no longer there. Yeo then called “Danny” to ask why the white van left before Yeo arrived. “Danny” explained that the driver was afraid and would make other deliveries first before circling back.36Foot Note 36×Transcript (6 July 2021) at 5:4–15. 54 Yeo then went to get some food and spent some time in a friend’s place. “Danny” then called Yeo to inform that the driver had arrived at Blk 612. Yeo then drove towards Blk 612. While passing “Block 617” on his way to Blk 612, Yeo noticed the white van stopping at “Block 617”.37Foot Note 37×Transcript (6 July 2021) at 6:1–7.Yeo drove past the white van and stopped at Block 619B Punggol Drive, got out of his car and looked towards the white van.38Foot Note 38×Transcript (6 July 2021) at 6:14–20.Yeo could see a man walking to the Bus Stop, returning to the white van and driving off.39Foot Note 39×Transcript (6 July 2021) at 7:11–12.Yeo then called “Danny” and asked the latter to instruct the driver to stop “at the bus stop after the traffic light”, which would have been the bus stop in the vicinity of Block 615 Punggol Drive (“Blk 615”). Yeo also informed “Danny” that he would pay the driver his $1,400 delivery fee at that bus stop.40Foot Note 40×Transcript (6 July 2021) at 7:14–19.Yeo then drove to Blk 615, parked near the void deck and walked to the bus stop near Blk 615 to wait for the white van, but the white van did not appear.41Foot Note 41×Transcript (6 July 2021) at 7:26–28.Yeo then called “Danny” again. “Danny” said “never mind”, asked Yeo to “do [his] own things first” and told Yeo that “Danny” would make arrangements to collect the money from Yeo later.42Foot Note 42×Transcript (6 July 2021) at 8:1–4.Yeo then decided to drive back to “Block 617” and stopped at the Bus Stop. He removed the cover of the Dustbin, found the Plastic Bag inside, and took the Plastic Bag with him.43Foot Note 43×Transcript (6 July 2021) at 8:17–22. 55 My first observation was that the foregoing account consisted solely of Yeo’s bare assertion, not backed up by any other evidence besides his own words. Given that, by Yeo’s account, there were no fewer than eight phone calls between Yeo and “Danny” throughout the night, the veracity of Yeo’s account should be easy to corroborate by reference to Yeo’s phone records. Unfortunately for Yeo, no such support was forthcoming. 56 Yeo was carrying three mobile phones. These were marked as “YLH-HP1”, “F1A” and “F2A”. According to Yeo, he used only “F1A” and “F2A” for his drug dealings. The M1 and SingTel (“telcos”) call records for the SIM cards found in “F1A” and “F2A” were subpoenaed. They disclosed onlyonecall being made to “Danny” and no calls received from “Danny” on the night in question.44Foot Note 44×AB at 160.In other words, the telcos’ records disclosedno evidenceof multiple phone calls to and/or from “Danny” on the night in question. However, given the prevalence of mobile applications, such as Whatsapp Messenger, which allow calls to be made without routing them through the telcos, the telcos’ call records could not be treated as exhaustive. It would be relevant to also examine the call records stored on the phones. Yeo initially told the investigation officer, ASP Neo Zhan Wei (“IO Neo”), on 13 March 2018 that the passcode for both phones was “111111”. When this passcode did not work on the two phones, Yeo told IO Neo on 10 May 2018 that the passcode to both phones was “120495”. This new passcode managed to unlock “F2A”, and the forensic examinations of “F2A” disclosed no records of calls made to or received from “Danny” on the night in question. However, the new passcode still could not unlock “F1A”. 57 The Prosecution submitted that Yeo had deliberately refused to disclose the passcode for “F1A” and invited me to draw an adverse inference against Yeo. I agreed. Pursuant to illustration (g) of s 116 of the Evidence Act 1893 (2020 Rev Ed), I presumed that the contents of “F1A” would disclose evidence unfavourable to Yeo. 58 Since Yeo’s narrative of “hiccups” remained a bare assertion that was not substantiated by any call records, and having regard to my overall assessment of Yeo’s credibility as a witness (see [66]–[68] below), I did not find Yeo’s account believable and did not accept that his retrieval of the Drugs from the Bus Stop had been a case of retrieval from the wrong bus stop. (D) What prompted Yeo to throw the Drugs out of his car 59 After collecting the Drugs from the Bus Stop, Yeo drove to Blk 635C and parked his car in front of the rubbish chute. 60 According to Yeo, he went to Blk 635C to meet one “Kelvin” to deliver methamphetamine to him as well as to purchase some methamphetamine from him.45Foot Note 45×Transcript (6 July 2021) at 11:16–19.After completing the transaction with “Kelvin”, Yeo picked up the Plastic Bag and thought it strange that there were two bundles instead of one inside. He first thought that one of the bundles was probably not his, and decided to throw one bundle out of his car.46Foot Note 46×Transcript (7 July 2021) at 30:1–9.Then, recalling the “hiccups” earlier in the evening over arrangements for delivery of the drugs he ordered, Yeo thought that perhaps the remaining bundle was not his either, and threw the remaining bundle out of the car as well.47Foot Note 47×Transcript (6 July 2021) at 12:1–5.After throwing both bundles out of the car, Yeo planned to call “Danny” to confirm which bundle was his.48Foot Note 48×Transcript (6 July 2021) at 12:7.But before Yeo could make the call to “Danny”, he saw many cars, as well as motorcycles, turn into the driveway of Blk 635C and drive past him.49Foot Note 49×Transcript (6 July 2021) at 12:8–9.Yeo then decided to drive off to get away from them.50Foot Note 50×Transcript (6 July 2021) at 12:10–13.These cars and motorcycles turned out to be CNB vehicles. They gave chase and Yeo was eventually arrested before he could make any calls to “Danny”. 61 Yeo explained in court that if “Danny” were to confirm that the Drugs were not Yeo’s, Yeo would tell “Danny” where he had thrown the Drugs so that “Danny” could arrange to retrieve them.51Foot Note 51×Transcript (7 July 2021) at 32:4–20.Conversely, if “Danny” were to confirm that the Drugs were Yeo’s, Yeo would go and retrieve the Drugs from where he had thrown them.52Foot Note 52×Transcript (7 July 2021) at 34:28–31. 62 There were several problems with Yeo’s version of events. First, Yeo admitted that the 350g of methamphetamine he was expecting to receive was worth $5,950 which he had already paid for.53Foot Note 53×Transcript (7 July 2021) at 10:12–17.Therefore, irrespective of whether there was a wrong delivery or not, the drugs in the Plastic Bag would have been worth several thousand dollars.54Foot Note 54×Transcript (7 July 2021) at 31:28–30.In my view, if Yeo had genuinely suspected a wrong delivery, the natural thing for him to do would be to call “Danny” for clarification first, rather than opt for the precipitous act of throwing the Drugs out of his car. It was simply illogical for Yeo to have thrown several thousand dollars’ worth of drugs out of his car without first clarifying the situation with “Danny”. In fact, Yeo admitted that he had no difficulty getting in touch with “Danny” when arranging the delivery throughout the night.55Foot Note 55×Transcript (7 July 2021) at 35:1–3. 63 Second, if it were true that Yeo intended to retrieve the Drugs at a later time (if “Danny” were to confirm that the Drugs were Yeo’s) or give the location of the Drugs to “Danny” for him to arrange retrieval of the Drugs (if “Danny” were to confirm that the Drugs were wrongly delivered), Yeo would have taken time to carefully conceal the Drugs instead of throwing them out of his car in a haphazard manner that would not be conducive to subsequent retrieval. 64 Third, although the bundle “A1A” was found near the rubbish chute where Yeo had parked his car, bundle “B1” was found some distance away from where Yeo had parked his car.56Foot Note 56×Photographs P9 and P10.This meant that bundle “B1” could only have been thrown out of the car after Yeo had started driving off and not while the car was still parked in front of the rubbish chute. That was inconsistent with Yeo’s account that he had already thrown both bundles out before noticing the CNB vehicles. 65 In the light of the foregoing, I found this part of Yeo’s account to be unbelievable. I therefore rejected Yeo’s submission that he threw the Drugs out of his car because he suspected a wrong delivery, and accepted the Prosecution’s submission that Yeo threw the Drugs out of his car in order to dissociate himself from the Drugs because he had realised that the CNB was onto him and he was about to be arrested. (E) Yeo’s credibility as a witness 66 My first observation about Yeo’s credibility was grounded in the internal inconsistency of his evidence. He had provided at least three different accounts across his statements and at the trial. The first account was presented in his statement recorded by Staff Sergeant (“SSgt”) Au Yong Hong Mian on 6 March 2018 at 4.50am (the “First Contemporaneous Statement”), where Yeo denied recognising the drug exhibits altogether,viz, “I do not know what the 02 bundles are and I do not know who they belongs [sic] to”.57Foot Note 57×AB at 729.Yeo claimed that while at Blk 635C, “Kelvin”, his supplier, sold him one set of methamphetamine, which he tore open and discarded near the construction site while running away. However, no drugs were recovered in the vicinity of the construction site. The second account provided by Yeo had him admit to recognising the Drugs which he had picked up from a bin, and subsequently discarded after driving to Blk 635C. In his statement recorded by IO Neo on 20 March 2018 at 2.30pm, Yeo confessed that he knew that “A1A1”, “A1A2” and “B1A” contained methamphetamine.58Foot Note 58×58 AB at 930.Yeo also recanted the account in his First Contemporaneous Statement that he had thrown methamphetamine away at the construction site and identified “Danny” as his supplier. The third account was provided in Yeo’s testimony at the trial, where he alleged that both “Danny” and “Kelvin” were his drug suppliers. He also claimed that he did not know the Two Bundles contained methamphetamine. As noted at [49] above, there was no basis for Yeo to infer from the fact that there were two bundles instead of one in the Plastic Bag that the contents of the Two Bundles were not the drugs he ordered. Yeo had previously received only deliveries in single bundles of 250g each. It therefore beggared belief that Yeo would have been able to infer any purported misdelivery with the Two Bundles on this occasion when he had expected 350g of methamphetamine to be delivered. 67 As for external inconsistency, one needed to look no further than the inconsistency between the phone records and Yeo’s claim to have had no fewer than eight telephone conversations with Danny on the night in question. In addition, Yeo’s account that he had already thrown out the Two Bundles before he noticed the CNB vehicles was inconsistent with the fact that “B1A” was found some distance away from where Yeo had parked his car at Blk 635C (see [64] above). 68 In the light of the foregoing, I found that Yeo was not a credible witness and therefore treated his evidence with caution. (3) Conclusion on actual possession 69 Having regard to the analysis at [44] to [65] above, I found that Yeo had failed to raise a reasonable doubt in the Prosecution’s case that Yeo intended to possess the Drugs and knew that the Plastic Bag contained the Drugs. 70 It bears repeating that not all doubts about the Prosecution’s case are reasonable doubts. As noted inJagatheesans/o Krishnasamy v Public Prosecutor[2006] 4 SLR(R) 45 (“Jagatheesan”), at [51], “[o]ne must distinguish between a ‘real and reasonable’ doubt and a ‘merely fanciful’ doubt”.Jagatheesanwent on, at [53], to cite with approval thedictumof Wood JA inR v Brydon(1995) 2 BCLR (3d) 243 that a reasonable doubt is “a doubt for which one can give a reason, so long as the reason given is logically connected to the evidence”. 71 Yeo’s wrong delivery defence did not rise above raising merely fanciful doubts. It was inherently illogical and unsupported by the evidence. I therefore found that the Prosecution established the first element of possession beyond reasonable doubt.",
        "Whether Yeo knew the nature of the Drugs": "72 Yeo admitted that he ordered methamphetamine from Danny and was expecting to receive the methamphetamine from Danny when he retrieved the Plastic Bag from the Dustbin. Therefore, in the light of my rejection of Yeo’s wrong delivery defence, it followed as a matter of logic that Yeo knew that the Plastic Bag contained methamphetamine and, consequently, held actual knowledge of the nature of the Drugs.",
        "Whether Yeo was in possession of the Drugs for the purpose of trafficking": "73 The Prosecution relied on the presumption of trafficking under s 17(h) of the MDA (as set out at [31] above) to establish the third element. As I found that the Prosecution had proved actual possession and actual knowledge beyond reasonable doubt, it successfully invoked the presumption of trafficking under s 17(h) of the MDA. Yeo made no attempt to rebut this presumption. Yeo admitted that he went to the Bus Stop to collect what he believed to be the drugs he ordered from Danny, which drugs he intended to sell. In other words, Yeo intended to possess the drugs which he was collecting from the Bus Stop for the purpose of trafficking. Yeo’s only defence was that, due to a wrong delivery, the drugs which he actually collected were not the drugs which he intended to collect. Given my rejection of Yeo’s wrong delivery defence (see [71] above), it followed as a matter of logic that the Drugs were in Yeo’s possession for the purpose of trafficking.",
        "Conclusion on the case against Yeo": "74 For the reasons given above, I found Yeo guilty and convicted him accordingly.",
        "The case against Nagaiah": "75 As noted above, Nagaiah was charged for trafficking in the Drugs by delivering the Drugs to Yeo. The elements to be established for this charge are: (a) whether Nagaiah delivered the Drugs (“first element”); and (b) whether Nagaiah knew the nature of the Drugs (“second element”).",
        "Whether Nagaiah delivered the Drugs": "76 It was the Prosecution’s case that Nagaiah delivered the Drugs to Yeo by placing the Plastic Bag (containing the Drugs) in the Dustbin for Yeo to collect. There is objective evidence from the PolCam footage showing the driver of a white van placing a plastic bag in the Dustbin and Yeo subsequently collecting a plastic bag from the Dustbin. There is no doubt that the plastic bag collected by Yeo was the plastic bag which the driver of the white van placed in the Dustbin. First, the Dustbin was just emptied by two workers from a rubbish truck roughly one minute before the white van approached the Bus Stop.59Foot Note 59×PCS at para 15.This meant that there could have been no other plastic bags in the Dustbin when the driver of the white van placed his plastic bag in the Dustbin. Second, no other persons had approached the Dustbin between the departure of the white van from the Bus Stop and the arrival of Yeo at the Bus Stop. There is therefore no doubt that the plastic bag which the driver of the white van placed in the Dustbin was the Plastic Bag. 77 The difficulty with the Prosecution’s case was that there was no witness who could positively identify the driver of the white van. The quality of the PolCam footage did not allow the identity of the person or the registration number of the white van to be definitively identified. The CNB officer who witnessed the driver of the white van placing a plastic bag in the Dustbin also did not have a good enough look to either identify that person or note down the white van’s registration number. While Yeo was able to identify Nagaiah as someone who hadpreviouslydelivered drugs to him, Yeo was not able to identify Nagaiah as the person who delivered the Drugs to himviathe Dustbin on this occasion. 78 In the circumstances, the Prosecution’s case against Nagaiah rested wholly on circumstantial evidence. Circumstantial evidence works “by cumulatively, in geometrical progression, eliminating other possibilities” (DPP v Kilbourne[1973] AC 729, per Lord Simon at p 758, cited with approval inPublic Prosecutor v Chee Cheong Hin Constance[2006] 2 SLR(R) 24 (“ConstanceChee”) at [78]), and has been likened to “a rope consisting of several strands each strengthening the other” (OhLaye Koh v Public Prosecutor[1994] SGCA 102 at [16]). In the final analysis, the question before the court is whether the totality of the circumstantial evidence on which the Prosecution relied “inevitably and inexorably” led to a single conclusion of the accused’s guilt (Ang Sunny v Public Prosecutor[1965-1967] SLR(R) 123 (“Sunny Ang”) at [14]). 79 I also found instructive the following observations of V K Rajah J (as he then was) inConstanceChee(at [85]): Grave suspicion is no substitute for proof beyond reasonable doubt. In the same vein, moral certainty cannot replace the requirement for explicit and certain evidence.The various links in the interlocking chain of evidence must establish a complete chain that rules out any reasonable likelihood of an accused’s innocence.Guilt must be the only rational inference and conclusion to be drawn from the complete chain of evidence. In assessing the circumstances, the court should discount fanciful or speculative possibilities.However, if more than one reasonable inference can be elicited from the factual matrix, the inference most sympathetic to the accused ought to be accepted. [emphasis added] 80 However, this did not mean that the test inSunnyAngis a separate and unique test distinct from the principle of proof beyond reasonable doubt. The latter applies equally to cases where the Prosecution’s evidence is wholly circumstantial as it does to those where direct evidence is adduced (Public Prosecutor v OhLaye Koh[1994] 2 SLR(R) 120 at [17]). 81 With these principles in mind, I proceeded to consider the various strands of evidence which pointed to Nagaiah being the person who placed the Plastic Bag in the Dustbin. Presence of Nagaiah’s DNA on the plastic bag “A1” and one of the taped bundles “A1A” 82 It was undisputed that DNA profile matching Nagaiah’s was found on: (a) the exterior and interior surface of the Plastic Bag; and (b) the non-adhesive side of the blue adhesive tape wrapping the bundle marked “A1A”.60Foot Note 60×Nagaiah CS at para 34.The Prosecution submitted that this clearly showed that Nagaiah physically handled the Plastic Bag (containing the Drugs). Nagaiah raised three submissions in response: (a) The presence of Nagaiah’s DNA on the Plastic Bag and “A1A” could be entirely innocent, particularly when his DNA was completely absent from “B1”. If, for example, Nagaiah had only touched the Plastic Bag, his DNA could have been innocently transferred to “A1A”. (This is known as secondary transfer of DNA material.)61Foot Note 61×Nagaiah CS at para 35. (b) Whether Nagaiah’s DNA was on “A1A” was unclear, as the DNA analysis report in relation to “A1A” merely stated that Nagaiah “can be included as a contributor of the major component” (as opposed to “can be included as a major contributor” in the case of the report in relation to the Plastic Bag).62Foot Note 62×Nagaiah CS at para 36. (c) As Nagaiah had previously bought adhesive tape for “AA” (the person whom Nagaiah was delivering drugs for), the presence of DNA material could merely mean that “A1A” was wrapped by “AA” or someone working for “AA” using tape bought by Nagaiah, and did not necessarily mean that Nagaiah had handled the bundle.63Foot Note 63×Nagaiah CS at para 37. 83 It is important to recall that the issue to be resolved at this stage of the analysis was whether Nagaiah was the person seentakinga plastic bag from the white van and placing it in the Dustbin. In this regard, the fact which the Prosecution needed to prove was that Nagaiah had handled the Plastic Bag, The Prosecution did not need to prove that Nagaiah had handled the Two Bundles before they were placed in the Plastic Bag. Therefore, the submission that Nagaiah’s DNA was absent from “B1” and the submission that it was unclear whether his DNA was on “A1A” were both beside the point. It was sufficient to focus only on the DNA profile found on the Plastic Bag itself. Nagaiah simply had no explanation for how his DNA got onto the outside surface of the Plastic Bag. 84 On 3 October 2018, IO Neo asked Nagaiah to explain the presence of his DNA on the Plastic Bag and “A1A”. Nagaiah gave the following explanation:64Foot Note 64×AB at 995. I do not know why my DNA was present in the items that were shown to me. I used to eat food inside my van after which I will throw away the food packet into a dustbin. My DNA could have been present in the food packet that I had thrown away. I am not referring to the dustbin shown in the 4 CCTV pictures but I am referring to any dustbin. It is difficult to make sense of this explanation. Nagaiah appeared to be saying that the food packet that he had thrown away could be the source of his DNA appearing on the Plastic Bag and “A1A” by way of secondary transfer of DNA. (Direct transfer of DNA occurs when a person touches an object and leaves some of his DNA on the object. Secondary transfer occurs when the first object touches a second object in such a way as to transfer over to the second object some of the DNA left by the person on first object.) However, Nagaiah did not explain how the food packet he threw away could have come into contact with the Plastic Bag and with “A1A” for such secondary transfer to occur. At trial, Nagaiah confirmed that he had not thrown any food packet into the Dustbin at the Bus Stop.65Foot Note 65×Trancript (9 July 2021) at 11:11–13.This would appear to have precluded any possibility of secondary transfer between the food packet and the Plastic Bag, unless the Plastic Bag was actually in Nagaiah’s possession in the Van together with the food packet before he threw the latter away. 85 At trial, Nagaiah came up with a new and different explanation. He suggested that his DNA could have come to be on “A1A” because it was wrapped by adhesive tape that he had bought for “AA”. Even if Nagaiah’s explanation were accepted, this could only explain how Nagaiah’s DNA was found on the inside of the Plastic Bag (since “A1A” was within the Plastic Bag and this created the opportunity for secondary transfer from “A1A” to the inside surface of the Plastic Bag). It could not explain how Nagaiah’s DNA got onto theoutsidesurface of the Plastic Bag. The only reasonable explanation for the presence of Nagaiah’s DNA on theoutsideof the Plastic Bag was therefore that Nagaiah had been in possession of the Plastic Bag. 86 For completeness, I should clarify that the analysis at [83] and [85] above does not imply that I accepted Nagaiah’s submissions set out at [82(b)] and [82(c)] above. The Prosecution presented cogent counterarguments with which I agreed.66Foot Note 66×PCS at paras 55–58.However, it was not necessary for me to address them for the purpose of determining whether Nagaiah had possession ofthe Plastic Bag. Photographs of the Dustbin recovered from Nagaiah’s phone 87 Two photographs of a green dustbin resembling the Dustbin were recovered from Nagaiah’s phone “NAG-HP” (the “Photographs”). According to the forensic analysis report on “NAG-HP”, the Photographs were taken at 2.14am on 6 March 2018.67Foot Note 67×P383A, Annex A6 at pp 3 and 4.This coincided, down to the minute, with when the driver of the white van was seen on the PolCam footage loitering near the Dustbin before he returned to the white van to retrieve a plastic bag to be placed in the Dustbin (see [5] above). The metadata of the Photographs indicated that they were taken at a location with the coordinates 1.40181 degrees latitude, 103.9128 degrees longitude.68Foot Note 68×P383B and P383C.These coordinates represented the location of Blk 617D. As noted at [52] above, the Bus Stop was located directly in front of Blk 617D. The metadata of the Photographs therefore indicated that they were taken in the vicinity of the Bus Stop. 88 At trial, Nagaiah confirmed that he had possession of his phone “NAG-HP” on the night in question.69Foot Note 69×Transcript (9 July 2021) at 8:12–14.He also admitted that he did not normally take photographs of dustbins, and that if he had done so it would have been for a specific purpose.70Foot Note 70×Transcript (9 July 2021) at 8:27–32.In his own evidence-in-chief (“EIC”), Nagaiah stated also that he had no explanation for how the Photographs ended up in his phone.71Foot Note 71×Transcript (8 July 2021) at 50:15–17.In the light of the foregoing, the inescapable conclusion was that Nagaiah took the Photographs for the specific purpose of documenting the location at which he would be placing the Drugs. 89 Nagaiah sought to discredit the evidence of the Photographs in two ways. First, Nagaiah attempted to throw doubt on the accuracy of the information extracted by Forensic Specialist Lee Jia Ying Cheryl of the Forensic Response Team of CNB (“Forensic Specialist Lee”) concerning the time and location at which the Photographs were taken. In relation to time, Nagaiah pointed to Forensic Specialist Lee saying at trial that she could not “confirm the date and time taken from the image previously mentioned was accurate”.72Foot Note 72×Transcript (23 March 2021) at 47:1–3.In relation to location, Nagaiah’s complaint was that “there was no attempt by the Prosecution to prove the accuracy of the location information in the mobile phone”.73Foot Note 73×Nagaiah CS at para 40. 90 In my view, Nagaiah’s counsel had quoted Forensic Specialist Lee’s evidence out of context. Nagaiah’s phone was seized on 7 March 2018.74Foot Note 74×AB at 681.Forensic Specialist Lee commenced her forensic examination of the phone on 4 December 2019 (more than one and a half years later).75Foot Note 75×AB at 50.When she turned on the phone on 4 December 2019, the date and time shown on the phone was 1 January 2015 at 8.03am. This is a phenomenon arising from the depletion of the battery powering the phone’s internal clock due to the phone having been stored for a long period without being recharged. As a result, the date and time of the phone defaulted back to the phone’s factory setting. Once the date and time of the phone have returned to factory setting, it was no longer possible for Forensic Specialist Lee to determine whether the phone was set by its owner/user to the correct date and time on the night in question. It was in this context that Forensic Specialist Lee said she could not “confirm the date and time taken from the image previously mentioned was accurate”. This was not a statement that the phone was malfunctioning in relation to the keeping of date and time. 91 As the owner of the phone, Nagaiah was best placed to know whether the phone was set to the correct date and time on the night in question. Tellingly, Nagaiah did not give evidence that the date and time of the phone was set inaccurately at any time. More importantly, the results of Forensic Specialist Lee’s forensic examination of Nagaiah’s phone was shared with the Defence in a CD-ROM marked “FORT/MF/2018/0041” (“the CD-ROM”).76Foot Note 76×P383.When the contents of the CD-ROM were printed out, it took up more 800 pages containing records of phone calls, Whatsapp messages and Whatsapp calls, not only from the night in question but also from the months before and days after.77Foot Note 77×P383A.If indeed, the phone had been set to an inaccurate date and time on or around the night in question, it would not have been difficult for Nagaiah to point out how some of the messages were out of sync in terms of timing with actual events. The fact that Nagaiah did not attempt to do so showed that he did not believe that his phone was set to the wrong date and/or time on the night in question. On the contrary, one can easily pick up evidence from the CD-ROM that the phone was set to the correct date and time at the material time. For example, Nagaiah received his first incoming Valentine’s Day greetings by Whatsapp on 14 February 2018 at 12.03am.78Foot Note 78×P383A, Annex A4 at p 401.As another example, on 6 March 2018 at 9.50pm, Nagaiah sent by Whatsapp a photograph of a Maybank transaction record showing the deposit of RM3,000 on 6 March 2018 at 9.46pm.79Foot Note 79×P383A, Annex A4 at p 5.In the circumstances, there was no reasonable doubt that Nagaiah’s phone was set to the correct date and time on the night in question. If there was any doubt at all, it certainly did not rise above the level of “merely fanciful doubt” (see [70] above). 92 As for the submission that there was no attempt by the Prosecution to prove the accuracy of the location information in the mobile phone, it was not clear what Nagaiah was driving at. The contents of the CD-ROM demonstrated that the phone was functioning on the night in question, making outgoing calls, receiving incoming calls, sending and receiving messages and taking photographs. Forensic Specialist Lee explained that when the phone was used to take a photograph, it was expected that the phone may record the coordinates of the location where the photograph was taken.80Foot Note 80×Transcript (23 March 2021) 41:9–14.If Nagaiah’s point was that the phone may not have been receiving accurate coordinates from the Global Positioning System (“GPS”), it is pertinent to note that it was Nagaiah’s own evidence that he had been using GPS navigation to help him get around Singapore on the night in question.81Foot Note 81×Transcript (8 July 2021) 43:22–30.There was no indication from Nagaiah that he was experiencing any inaccuracy with GPS. I therefore saw no merit in this submission. 93 The second way Nagaiah sought to discredit the evidence of the Photographs was to argue that there was “no way for the Prosecution to confirm the position of the rubbish bin at the Bus Stop on the morning of 6th March 2018”. Nagaiah did not explain why the Prosecution would have been required to confirm the position of the Dustbin in order to prove its case against Nagaiah. Nevertheless, it would appear, from a detailed reading of paragraphs 41 to 43 of Nagaiah’s closing submissions, that Nagaiah’s argument proceeded along the following lines: (a) The Bus Stop has concrete flooring. (b) There is a grass verge beside the Bus Stop, and there is an electrical box on this grass verge. (c) The Photographs show a green dustbin sitting on concrete flooring, very close to the edge of a grass verge. (d) IO Neo agreed during cross-examination that, from the PolCam footage, the Dustbin appeared to be next to the electrical box.82Foot Note 82×Transcript (26 March 2021) 60:12–17; P384. (e) Therefore, the Dustbin must have been on the grass verge together with the electrical box.83Foot Note 83×Transcript (26 March 2021) 60:29–30, 61:25–26. (f) Since the Dustbin was on the grass verge while the dustbin in the Photographs was not on the grass verge, it followed that the dustbin in the Photographs is not the Dustbin. 94 However, the truth is that IO Neo never conceded that the Dustbin was “next” to the electrical box in the sense that they must both have been on the grass verge together. When Nagaiah’s counsel first asked IO Neo what was next to the Dustbin, IO Neo’s answer was “I can’t see from the photograph [referring toP384, a screenshot from the PolCam footage] what it was next to”.84Foot Note 84×Transcript (26 March 2021) 60:12–13.When Nagaiah’s counsel asked IO Neo whether he was saying that the electrical box was on the concrete flooring, IO Neo replied “itappearson the concrete base” [emphasis added].85Foot Note 85×Transcript (26 March 2021) 60:24–26.When Nagaiah’s counsel asked “if the concrete box in on the grass patch … it must mean the bin is on the grass patch beside it, right?” IO Neo replied “I am not sure if [it is] because of the angle of the PolCam”.86Foot Note 86×Transcript (26 March 2021) 60:29–32.IO Neo then went on to explain:87Foot Note 87×Transcript (26 March 2021) 61:8–11. so this is a flat image, a photograph. So I am not sure if it’s------it is because of the angle of the PolCam that if---even if the dustbin and the electrical box were not side by side, they could be pictured as such. Nagaiah’s counsel tried one more time by asking “if the electrical box is on the grass, the bin is also on the grass, isn’t it?”. IO Neo replied: “as I explain[ed], it could be that the bin is also on---is on the concrete floor but because of the angle of the PolCam, this photograph is taken as such.88Foot Note 88×Transcript (26 March 2021) 61:25–28. 95 Taken as a whole, IO Neo’s answers did not assist Nagaiah in making the argument outlined at [93] above. IO Neo made clear that, from the angle and nature of the PolCam footage, the Dustbin and the electrical box could appear side-by-side on the PolCam footage even if they were actually not. This was a complete answer to Nagaiah’s argument. Since Nagaiah could not say for sure that the Dustbin was on the grass verge and not on the concrete flooring on the night in question, there was no basis for Nagaiah to argue that the dustbin in the Photographs could not have been the Dustbin. 96 For completeness, I should add that, even if IO Neo had conceded what Nagaiah’s counsel thought he had conceded, I was not bound to accept what IO Neo said on this matter. In the exchange referred to at [94] above, IO Neo was not being asked to give evidence of something he had witnessed or otherwise had personal knowledge of. IO Neo was not present on the scene on the night in question and therefore did not witness, or otherwise have personal knowledge of, the matters depicted in the PolCam footage. Instead, IO Neo was being asked to give hisinterpretation ofor opinion onthe PolCam footage. The PolCam footage is real evidence which the court was well capable of examining for itself to discern what it showed and, indeed, the court was duty bound to do so. The court need not be told by a witness what the footage showed. If the PolCam footage showed a white van and IO Neo had said it was a red van, it could not be the case that the court was to accept that it was a red van. 97 From my own observation of the PolCam footage during the period when the two workers from the rubbish truck were emptying the Dustbin, the Dustbin could be seen swaying in such a way that parts of it would disappear behind the electrical box89Foot Note 89×P387A–P378D.. This meant that (a) the Dustbin and the electrical box were not side-by-side, and (b) the Dustbin was further away from the PolCam compared to the electrical box. This made it very likely that the Dustbin was on the concrete flooring and not the grass verge. As a result, it rendered untenable Nagaiah’s argument that the dustbin in the Photographs could not be the Dustbin because the Dustbin was definitely on the grass verge. 98 Having disposed of Nagaiah’s arguments against the Photographs, I concluded that the evidence of the Photographs, including the metadata showing the time and location at which the Photographs were taken, indisputably placed Nagaiah at the Bus Stop at the very moment the driver of the white van in the PolCam footage was seen loitering around the Dustbin, and conclusively identified Nagaiah as the person who placed the Plastic Bag in the Dustbin. Evidence that Nagaiah and the Van were in Singapore at the material time 99 The immigration records showed that Nagaiah and the Van were in Singapore from 7.21pm on 5 March 2018 to 3.41am on 6 March 2018. In other words, Nagaiah was in Singapore at the material time and had the opportunity to be at the Bus Stop from 2.12am to 2.20am. Evidence that the Van was in the vicinity of the Bus Stop 100 The Prosecution led evidence that CNB officers spotted the Van around the Punggol area at the time: (a) On 5 March 2018, at about 11.05pm, Station Inspector (“SI”) Sunny Tay and SSgt Au Yong spotted the Van driving along Punggol Walk.90Foot Note 90×Conditioned statement of SI Sunny Tay at para 4: AB at p 696.SI Sunny Tay testified that he observed a white van with the number plate JPD9290 and he was able to see the number plate of the Van as it was “just in front of [him]”.91Foot Note 91×Transcript (19 March 2021) at 2:19–31.SSgt Au Yong saw the number plate of the Van by looking back shortly after overtaking the Van.92Foot Note 92×Transcript (23 March 2021) at 70:24 to 72:7.Sometime thereafter, Inspector Kua and SSgt James Phang sighted the Van driving around Edgedale Plains and Punggol Drive.93Foot Note 93×Conditioned statement of Inspector Kua at para 4: AB at p 668; Conditioned statement of SSgt James Phang at para 4: AB at p 745.Inspector Kua observed the number plate of the Van as well.94Foot Note 94×Transcript (23 March 2021) at 3:4–11.SSgt James Phang clarified in court that he did not know the exact registration number, but he observed that it was a Malaysian number plate from afar.95Foot Note 95×Transcript (19 March 2021) at 33:1–9. (b) At about 2.12am, SSgt Au Yong noticed a van driving along Punggol Drive and turning into the driveway of Block 617C Punggol Drive before stopping behind the Bus Stop.96Foot Note 96×Conditioned statement of SSgt Au Yong at para 5: AB at p 716.He did not see the van’s number plate at that time, but his evidence was that it looked the same as the Van which he had seen at about 11.05pm.97Foot Note 97×Transcript (23 March 2021) at 59:1–15.Correspondingly, the PolCam Footage at the timestamp 02:12:46, depicted a white van stopping along the driveway behind the Bus Stop. 101 Nagaiah submitted that the evidence of the three officers who claimed to have seen the number plate of the Van was not reliable. Inspector Kua could not remember whether the van was travelling towards him or away from him. SI Tay could not remember along which part of Punggol Walk he saw the van nor could he remember which direction the van was travelling in. SSgt Au Yong failed to mention spotting the van in his conditioned statement. I agreed that the factors just mentioned gave rise to justifiable concerns about the accuracy and veracity of these three officers’ evidence. I therefore accepted Nagaiah’s submission to place no weight on the evidence of these three officers concerning them seeing the number plate of the Van in the vicinity of the Bus Stop on the night in question. Conclusion on the first element (delivery of the Drugs) 102 When the various strands of evidence discussed above were considered cumulatively, they led inevitably and inexorably to the conclusion that Nagaiah was the person who was seen placing the Plastic Bag in the Dustbin at 2.18am on 6 March 2018. I therefore found that the Prosecution had proven beyond reasonable doubt that Nagaiah had delivered the Plastic Bag (containing the Drugs) to Yeo by placing the Plastic Bag in the Dustbin.",
        "Whether Nagaiah knew the nature of the Drugs": "103 On the establishment of knowledge of the nature of the drugs in relation to a charge under s 5(1)(a) of the MDA, it was observed inRamdhan([25] above), at [33], that: … knowledge of the nature of the controlled drug is an element under a s 5(1)(a) trafficking charge. In this connection, although possession is not an element of a s 5(1)(a) trafficking charge (cf possession for the purposes of trafficking under s 5(1)(a) read with s 5(2) of the MDA), the Prosecution is not precluded from relying on the presumption of knowledge under s 18(2) of the MDA to satisfy the knowledge element for a s 5(1)(a) trafficking charge. The Prosecution may invoke s 18(2) of the MDA so long as they can either prove that the accused was in possession of the drugs or trigger the presumption in s 18(1) of the MDA to that effect. Often, as is the case in the present proceedings, proof that the act of trafficking had taken place would also prove that the accused was in possession of the drugs and hence trigger the presumption in s 18(2) of the MDA. 104 As was the case inRamdhan, the fact that the Prosecution had proven that Nagaiah was delivering the Plastic Bag also constitutes proof that Nagaiah was in possession of the Plastic Bag, thereby triggering the presumption under s 18(1)(a) that Nagaiah was in possession of the Drugs. The onus thus shifted to Nagaiah to rebut the presumption on a balance of probabilities. Given that Nagaiah’s defence consisted entirely of a denial that he was in possession of the Plastic Bag (as opposed,eg,to a defence that he was holding the Plastic Bag in the belief that its contents were something other than controlled drugs, or that the Drugs came into his custody inadvertently), Nagaiah was not able to rebut the presumption. 105 Given that Nagaiah was presumed under s 18(1)(a) of the MDA to have had the Drugs in his possession and he failed to prove the contrary, the presumption under s 18(2) of the MDA that Nagaiah had knowledge of the nature of the Drugs was triggered. In order to rebut the presumption under s 18(2) of the MDA, Nagaiah had to prove, on a balance of probabilities, that he did not have knowledge of the nature of the Drugs. If Nagaiah denied knowing that the Drugs were methamphetamine, he should have been able to say what he thought or believed he was carrying, for a claim that he simply did not know what he was carrying would not usually be sufficient to rebut the presumption:AdiliChibuike Ejike v Public Prosecutor[2019] 2 SLR 254at [32];Zainalat [23];Obengat [39]–[40];Harvena/l Segar v Public Prosecutor[2017] 1 SLR 771 at [2]. 106 Nagaiah was unable to rebut the presumption under s 18(2) of the MDA for the same reasons he was unable to rebut the presumption under s 18(1)(a) of the MDA. Nagaiah’s defence consisted entirely of denying he was in possession of the Drugs. He has adduced no evidence to rebut the presumption of knowledge of the nature of the Drugs. I was therefore satisfied that Nagaiah had not rebutted the presumption that he knew the nature of the Drugs. I therefore found that the Prosecution had established that Nagaiah had knowledge of the nature of the Drugs.",
        "Conclusion on the case against Nagaiah": "107 Having regard to the matters discussed above, I was satisfied beyond reasonable doubt that Nagaiah had delivered the Drugs to Yeo by placing them in the Dustbin, and that he had knowledge of the nature of the Drugs. I therefore found Nagaiah guilty and convicted him accordingly.",
        "Sentence": "108 Pursuant to s 33(1) read with the Second Schedule of the MDA, the sentence for the charges against both Yeo and Nagaiah was death, as the weight of methamphetamine involved exceeded 250g. 109 In convicting Nagaiah, I found that his involvement in the offence was limited to the acts described in s 33B(2)(a) of the MDA. The Public Prosecutor had also issued a certificate of substantive assistance pursuant to s 33B(2)(b) in favour of Nagaiah. I therefore exercised my discretion pursuant to s 33B(1)(a) and sentenced Nagaiah to life imprisonment and 15 strokes of the cane. Pursuant to s 318 of the Criminal Procedure Code 2010 (2020 Rev Ed), I directed that Nagaiah's sentence of imprisonment take effect from 7 March 2018, the date of his arrest. 110 As for Yeo, I found that he did not meet the requirements of s 33B(2)(a), as there was clear evidence that he intended to sell the Drugs. The Prosecution had also informed the court that the Public Prosecutor had decided that no certificate of substantive assistance would be issued in respect of Yeo. There was no dispute that Yeo did not suffer from any abnormality of the mind. Yeo was therefore not eligible to be considered for the alternative sentencing regime under s 33B of the MDA. Consequently, I imposed the death sentence on Yeo. Pang Khang ChauJudge of the High Court Adrian Loo, Chin Jincheng and Jotham Tay (Attorney-General’s Chambers) for the Prosecution; Wong Seow Pin (S P Wong & Co), Krishna Ramakrishna Sharma (Fleet Street Law LLP) and Eoon Zizhen Benedict (Covenant Chambers LLC) for the first accused; Andre Jumabhoy (Peter Low & Choo LLC) and Sankar Saminathan (Sterling Law) for the second accused."
    }
}