{
    "case_title": "Millennium Pharmaceuticals, Inc and anothervZyfas Medical Co (sued as a firm)",
    "ncitation": "[2023] SGHC 360",
    "coram": "Dedar Singh Gill J",
    "sections": {
        "Introduction": "1 This suit involves two patents which claim processes for the manufacture of bortezomib, a drug used for the treatment of multiple myeloma and mantle cell lymphoma. The plaintiffs allege that the defendant infringed their patents by,inter alia, supplying bortezomib to hospitals in Singapore.1Foot Note 1×Statement of Claim (Amendment no. 2) dated 26 August 2020 (“SOC”) at paras 14A–14C.The defendant denies infringing the plaintiffs’ patents and further contends that the patents are invalid for lack of novelty, lack of inventive step and insufficiency of particulars. The defendants also counterclaim for the partial and/or full revocation of the patents.2Foot Note 2×Defence and Counterclaim (Amendment no. 4) dated 7 July 2021 (“DCC”) at paras 21(2) and 21(4).For the reasons I set out hereunder, I find one of the patents to be valid but not infringed and the other patent invalid for lack of inventive step. 2 The two patents in question are Singapore Publication No. SG 151322 (“SG 322”) and Singapore Application No. SG 10201600029P (“SG 29P”, (collectively with SG 322, the “Patents”)). SG 322 purports to teach the use of an ether solvent with low miscibility in water during the synthesis of bortezomib. More specifically, it claims to improve the Matteson Homologation process by performing the first step of the reaction process in a coordinating ether solvent of low miscibility with water. SG 29P purports to teach the use of convergent synthesis for the large-scale manufacture of bortezomib.",
        "Parties to the proceedings": "3 The first plaintiff is a company incorporated in the State of Delaware, United States of America.3Foot Note 3×Statement of Claim (Amendment no. 2) dated 26 August 2020 (“SOC”) at para 1: Plaintiff’s Set Down Bundle (“SDB”) at p 5.It is the registered proprietor of the Patents.4Foot Note 4×SOC at para 4: SDB at p 6.The second plaintiff is a Singapore-incorporated company, which is alleged to be an exclusive licensee of the first plaintiff in respect of the Patents and the distributor of the “brand-name” bortezomib drug, Velcade, in Singapore (the “Product”).5Foot Note 5×SOC at paras 1A and 5A: SDB at p 5. 4 The defendant is a Singapore-registered partnership.6Foot Note 6×SOC at para 2: SDB at p 5; DCC at para 4: SDB at p 37.It carries on business in,inter alia, the wholesale and distribution of pharmaceutical products, controlled drugs, medical devices and health supplements.7Foot Note 7×SOC at para 2: SDB at p 6; DCC at para 4: SDB at p 37; DCS at para 10.The defendant represents and distributes pharmaceutical products made by several pharmaceutical manufacturers globally, including Dr Reddy’s Laboratories Limited (“DRL”).8Foot Note 8×DCS at para 11.In February 2018, the defendant applied to the Health Sciences Authority (“HSA”) for approval to import, market and distribute a generic version of bortezomib, “MYBORTE POWDER FOR SOLUTION FOR INJECTION 3.5MG/VIAL”, which is manufactured by DRL (see [12] below).9Foot Note 9×DCS at paras 20–22.On 5 July 2019, the HSA approved its registration under Registration No. SIN15736P.10Foot Note 10×1AB at p 184. 5 I will go into greater technical detail in my judgment. However, at this juncture, it suffices to provide a simple description of the Patents and the context in which the claimed processes are employed. The claimed processes relate to the manufacture of bortezomib, which is an international, non-proprietary name for a cancer drug used in the treatment of multiple myeloma and mantle cell lymphoma.11Foot Note 11×SOC at para 5: SDB at p 6; DCC at para 7(a): SDB at p 38.Parties do not dispute that the chemical compound itself, bortezomib, is not protected by patent in Singapore.12Foot Note 12×DCS at para 19; Dr Johannes’ Expert Report at para 45: DBAEIC at p 173.It is therefore agreed that drugs using bortezomib as an active pharmaceutical ingredient may be sold without infringing any product patent in Singapore. In other words, the matters of contention between parties are in relation to process patents pertaining to the manufacture of bortezomib. Bortezomib is a type of boronic acid (ie, a compound related to boric acid in which one of the three hydroxyl groups is replaced by an alkyl or aryl group).13Foot Note 13×Dr Johannes’ Expert Report at para 26: DBAEIC at p 168.It was developed in the mid-1990s and was approved for medical use in the United States in 2003 and in Europe in 2004.14Foot Note 14×Dr Johannes’ Expert Report at paras 31–32, 39: DBAEIC at p 169–170, 171.The general process to synthesise bortezomib is to synthesise a number of organic chemical molecules, which are called intermediates.15Foot Note 15×Dr Johannes’ Expert Report at paras 42–43: DBAEIC at p 171.Being a known organic compound, there are a number of ways to synthesise bortezomib and its intermediates. 6 SG 322 relates to the method of making a boronic ester compound by employing an improved asymmetric Matteson homologation protocol.16Foot Note 16×Dr Shunsuke Chiba’s Expert Report at para 32: PBAEIC at p 24; Dr Johannes’ Expert Report at para 66: DBAEIC at p 177.The Matteson homologation protocol is a chemical process that synthesises a boronic ester compound by using zinc chloride as a catalyst.17Foot Note 17×Dr Shunsuke Chiba’s Expert Report at para 34: PBAEIC at p 24.Zinc chloride is also a Lewis Acid (see [36] below). Broadly, in simplified terms, the reaction sequence includes two steps: the first step is the synthesis of the boron “ate” complex 2 which is an intermediate product; and the second step involves contacting the boron “ate” complex 2 with a Lewis acid to generate the boronic ester. SG 322 consists of 56 claims, of which 39 have been put in issue in the present case. In other words, only 39 claims are relied on by the plaintiffs. The table annexed at Annex 1 sets out the 39 asserted claims in full, according to the patent specification filed with the Intellectual Property Office of Singapore on 24 March 2005.18Foot Note 18×Agreed Bundle of Documents (“ABOD”) Vol 1 at pp 8 and 70.SG 322 was granted on 31 July 2012. 7 Out of the asserted claims for SG 322, it is undisputed that only claims 1, 20, 31, 32, 33, 38, 48 and 52 are independent claims.19Foot Note 19×PCS at para 75; DCS at para 29.The rest of the asserted claims in SG 322 are dependent claims.20Foot Note 20×Ibid. 8 SG 29P consists of 10 claims, of which 5 have been asserted by the plaintiffs in the present case. The table annexed at Annex 1 sets out the 5 claims in full, according to the patent specification filed with the Intellectual Property Office of Singapore on 24 March 2005.21Foot Note 21×ABOD Vol I at pp 100, 162–165.SG29P was granted on 19 February 2018. 9 For SG 29P, there is no serious contention that the sole independent claim is claim 1.22Foot Note 22×PCS at para 133; DCS at para 32.The rest of the asserted claims are claims 2–4, and 6, which are dependent claims.23Foot Note 23×Ibid. 10 I will discuss the Patents in greater detail below.",
        "Procedural history": "11 Before I proceed to set out parties’ respective cases on the Patents, I provide the background and context to these proceedings.",
        "Genesis of the present proceedings": "12 On or around July 2019, the first plaintiff discovered that the defendant had obtained registration under the Health Products Act (Cap 122D) (“HPA”) for the following therapeutic product (the “Alleged Infringing Product”):24Foot Note 24×SOC at para 6: SDB at p 7; PCS at para 4. DETAILSREMARKSProduct nameMyborte Powder for Solution for Injection 3.5mg/vialRegistrantZyfas Medical CoRegistration No.SIN 15736PActive Ingredient and StrengthBortezomib (3.5mg/vial)Approval Date5 July 2019 The Alleged Infringing Product’s registration shows that it contains bortezomib as its active ingredient.25Foot Note 25×SOC at para 7: SDB at p 7.The Patents claim processes for the manufacture of bortezomib.26Foot Note 26×SOC at para 8: SDB at p 7. 13 On 11 July 2019, the first plaintiff issued a letter of demand to the defendant through its solicitors, Mirandah Law LLP (“Mirandah”).27Foot Note 27×ABOD Vol I at pp 186–187.Upon receipt of the letter dated 11 July 2019, the defendant referred the matter to DRL. DRL engaged Eldan Law LLP (“Eldan”) to respond to the letter. Subsequently, Eldan sent a letter dated 15 July 2019 to inform Mirandah that it was acting for DRL.28Foot Note 28×ABOD Vol I at p 189.It followed up with a letter dated 24 July 2019 to state that DRL did not use water immiscible ether solvents such as methyl tert-butyl ether (“MTBE”) (which is subject of the plaintiffs’ SG 322) to manufacture the Alleged Infringing Product and further that DRL’s manufacturing process for the Alleged Infringing Product was not a large-scale process as required by SG 29P.29Foot Note 29×ABOD Vol I at pp 195–196.Mirandah responded on 30 July 2019 to inform that they had been instructed to commence legal proceedings and asked if Eldan had been instructed to accept service.30Foot Note 30×ABOD Vol I at p 198.Eldan responded with,inter alia, an offer to disclose details of DRL’s manufacturing process.31Foot Note 31×ABOD Vol I at p 200.On 2 August 2019, Mirandah wrote to seek clarification on whether Eldan had instructions to accept service on behalf of the defendant. On the same day, Ravindran Associates LLP wrote to Mirandah on behalf of the defendant to deny the relevance of,inter alia, the Patents in respect of the Alleged Infringing Product. It appears that the letters had crossed. There was other correspondence between parties in the lead up to the commencement of the suit, but it is not necessary to set it out in full here. It suffices to mention that Eldan had been re-appointed to act for the defendant by 27 August 2019.32Foot Note 32×ABOD Vol I at p 218. 14 The first plaintiff commenced the present suit on 19 August 2019. The second plaintiff was later joined as party to the suit on 12 November 2019. By parties’ consent, the claim in HC/S 817/2019 proceeded on a bifurcated basis.33Foot Note 33×HC/ORC 3967/2021 dated 6 July 2021.This judgment therefore deals only with the determination of liability issues covered at the trial.",
        "Other related proceedings": "HC/OS 1034/2019 – application for a declaration that the defendant’s declaration(s) made under regulation 23(2) of the Health Products (Therapeutic Products) Regulations 2016 contained false or misleading statements or omitted material particulars 15 The originating summons HC/OS 1034/2019 was commenced on 19 August 2019 by the first plaintiff against the defendant. The first plaintiff sought,inter alia, “a declaration that [the defendant’s] declaration(s) made under regulation 23(2) of the Health Products (Therapeutic Products) Regulations 2016 contains a statement that is false or misleading in a material particular or omits to disclose any matter that is material to its application(s) for registration of its therapeutic product”.34Foot Note 34×Originating Summons 1034 of 2019 at prayer 1; AEIC of Mohamed Tahir at para 40: DBAEIC at p 25.The defendant took the position that only product patents in respect of bortezomib needed to be declared and there was no need to declare the existence of the Patents which are process patents relating to the manufacture of bortezomib. On 23 October 2019, I held that there was a material omission of the Patents in the defendant’s declarations in respect of the Alleged Infringing Product. I granted the prayer sought. 16 On 21 November 2019, the defendant filed a notice of appeal (CA/CA 221/2019) against the decision on the basis that process patents need not be declared to the HSA. My full reasons for my decision to grant the declaration sought by the first plaintiff are set out inMillennium Pharmaceuticals, Inc v Zyfas Medical Co (sued as a firm)[2020] SGHC 28. The declaration was confined to the defendant’s omission to disclose a matter that was material to its application in its declaration(s) made under regulation 23(2) of the Health Products (Therapeutic Products) Regulations 2016 (“HPTPR”) (at [10]), being the failure to mention the existing process patents (ie, the Patents) in respect of the Alleged Infringing Product in its application (at [26]). On 27 August 2020, the Court of Appeal upheld the decision below and dismissed the defendant’s appeal. It held inZyfas Medical Co (sued as a firm) v Millennium Pharmaceuticals, Inc[2020] 2 SLR 1044 at [42] that the proper procedure was for the defendant to have declared the existence of the Patents under regulation 23(2)(a) of the HPTPR, and thereafter declare that the Patents would not be infringed by the doing of the acts for which the registration of the Alleged Infringing Product was sought pursuant to regulation 23(3)(b)(ii) of the HPTPR. HC/OS 264/2021 – application for judicial review of the HSA’s decision to maintain the registration of the Alleged Infringing Product 17 Following my decision in HC/OS 1034/2019, the plaintiffs applied to the HSA to suspend the registration of the Alleged Infringing Product on 29 November 2019. The HSA did not accede to the application to suspend the registration of the Alleged Infringing Product. After the decision was upheld in CA/CA 221/2019, the plaintiffs applied to the HSA to cancel the registration of the Alleged Infringing Product. The HSA did not exercise its discretion pursuant to regulation 24(1)(a)(ii) of the HPTPR to cancel the registration of the Alleged Infringing Product. 18 On 19 March 2021, the plaintiffs filed HC/OS 264/2021 for leave to be granted to them to apply for,inter alia, a quashing order to quash the decision of the HSA dated 21 December 2020, in which the HSA refused to suspend or cancel the registration of the Alleged Infringing Product under s 37(1) of the HPA and/or regulation 24(1)(a)(ii) of the HPTPR. Alternatively, the plaintiffs sought a mandatory order enjoining the HSA to exercise its powers under s 37(1) of the HPA to suspend the registration of the Alleged Infringing Product until the final determination of the present suit. At the hearing on 16 August 2021, the parties made their respective submissions before me. I reserved judgment. Prior to the delivery of my judgment, the HSA cancelled the registration of the Alleged Infringing Product on 27 August 2021. Applications for an interim injunction against the defendant 19 On 29 January 2020, the plaintiffs filed HC/SUM 430/2020 (“SUM 430”) to seek an interlocutory injunction to prevent the defendant from performing any of the acts for which it obtained the registration of the Alleged Infringing Product, including its distribution, until the conclusion of the present suit.35Foot Note 35×HC/SUM 430/2020, prayer 1.In addition, the first plaintiff filed HC/SUM 437/2020 on the same day, which sought in substance the same relief as in SUM 430, except “until the conclusion of CA/CA 211/2019”.36Foot Note 36×HC/SUM 437/2020, prayer 1.I heard parties on these applications on 16 March 2020. On 2 April 2020, I ordered that,inter alia, the defendant be restrained from performing any of the acts for which registration of the Alleged Infringing Product had been obtained under Therapeutic Product Registration No. SIN15736P until the conclusion of the present suit, save that the defendant was not restrained from supplying 2,183 vials of the Alleged Infringing Product pursuant to GPOR 17519.37Foot Note 37×Order of Court HC/ORC 2358/2020 dated 2 April 2020.GPOR 17519 was the tender awarded by the group procurement arm of the National Healthcare Group, National University Health System and Singapore Health Services (“ALPS”) to the defendant in early November 2019 for the supply of bortezomib to public hospitals in Singapore from March 2020 to November 2020. 20 Being dissatisfied with my decision, the plaintiffs sought leave to appeal against my decision on SUM 430 (see [19] above) in HC/SUM 1716/2020 on 9 April 2020. The plaintiffs later filed HC/SUM 2121/2020 on 29 May 2020 to seek an interlocutory injunction restraining the defendant from performing any of the acts for which registration of the Alleged Infringing Product was obtained under Therapeutic Product Registration No. SIN15736P pending the conclusion of the plaintiffs’ appeal against the decision in SUM 430, or in the event that their application for leave to appeal in HC/SUM 1716/2020 is dismissed, the conclusion of any application to the Court of Appeal for leave to appeal the decision in SUM 430.38Foot Note 38×HC/SUM 2121/2020, prayer 1.At the hearing on 9 June 2020, parties presented their arguments for HC/SUM 1716/2020 (ie, the application for leave to appeal against SUM 430) and HC/SUM 2121/2020 (ie, the application for an interim injunction pending the conclusion of HC/SUM 1716/2020 or the conclusion of any application to the Court of Appeal for leave to appeal against SUM 430). I dismissed the plaintiffs’ leave application and their summons for an interim injunction. The plaintiffs then applied to the Court of Appeal in CA/OS 18/2020 for leave to appeal against SUM 430 on 22 June 2020. The Court of Appeal dismissed the application for leave to appeal on 21 July 2020. 21 At the close of the trial on 27 October 2021, parties consented to discharge the interim injunction which was granted in SUM 430 on 2 April 2020.39Foot Note 39×HC/ORC 6069/2021. HC/SUM 2368/2020 – striking out proceedings taken by the defendant 22 On 12 June 2020, the defendant applied in HC/SUM 2368/2020 to strike out the present action pursuant to O 18 rr 19(1)(a) and (d) of the Rules of Court 2014 (the “ROC”). The defendant cited as its basis the plaintiffs’ failure to provide the Particulars of Infringement pursuant to O 87A r 2(2) of the ROC. Just prior to the hearing fixed on 15 July 2020, the plaintiffs filed an application for leave to amend their Statement of Claim in HC/SUM 2850/2020. In the circumstances, I made no order on the prayer seeking to strike out the action but ordered costs against the plaintiffs in favour of the defendant.40Foot Note 40×HC/ORC 3904/2020 dated 15 July 2020. 23 I turn now to the present suit before me.",
        "Technical background": "24 The Patents disclose the large-scale synthesis of boronic acid and ester compounds for the production of bortezomib, a cancer drug for treating multiple myeloma and mantle cell lymphoma. The difference between the two Patents resides in the part of the synthetic process that each claims.41Foot Note 41×Prof Chiba’s First Expert Report at para 31; Primer at p 3.SG 322 mainly teaches the reaction sequence to generate the boronic ester compound bearing Formula (I) (see [58(a)]) by involving the use of water-immiscible ether solvent in the Matteson homologation reaction for use in the manufacture of bortezomib.42Foot Note 42×Primer at p 3.SG 29P, on the other hand, purports to teach the use of the “convergent synthesis” process for the large-scale manufacture of bortezomib.43Foot Note 43×Primer at p 3. 25 Given the highly technical nature of the subject-matter in the Patents, I directed that the parties provide a primer containing their respective positions on the key concepts such as the person skilled in the art, common general knowledge and the state of the art, and a glossary of the relevant technical terms (the “Primer”) (see [110] below).44Foot Note 44×Primer and Glossary of Technical Terms (“Primer”) at p 1.In this section, I distil the pertinent technical background to the Patents based on the Primer and the expert reports proved by the parties’ experts (see [106(a)] and [107(a)] below). 26 The Patents concern the field of pharmaceutical process chemistry.45Foot Note 45×Prof Chiba’s First Expert Report at para 26; Takayuki Shioiri, Kunisuke Izawa, Toshiro Konoike, Pharmaceutical Process Chemistry (Wiley-VCH, 2011).Pharmaceutical process chemistry is a field bridging medicinal chemistry and the industrial and commercial production of medicines. The main purpose of pharmaceutical process chemistry is the scaling up of the process for the production of specific drugs and active pharmaceutical ingredients (“APIs”).46Foot Note 46×US Department of Health and Human Services, Food and Drug Administration, Center for Drug Evaluation and Research and Center for Biologics Evaluation and Research,Q7 Good Manufacturing Practice Guidance for Active Pharmaceutical Ingredients Guidance for Industry(September 2016).It therefore has the following features: (a) selection of inexpensive and easily available starting materials; (b) utilisation of inexpensive catalysts and/or reagents and solvents; (c) establishment of robust and speedy procedures for producing drug candidates and APIs with high quality; (d) development of methods to produce drug candidates and APIs in an economical, convenient, and efficient manner; (e) avoidance of dangerous procedures and hazardous reagents; (f) selection of safer and environmentally friendly processes; and (g) reduction of wastes.47Foot Note 47×Prof Chiba’s First Expert Report at Appendix N, p 2227.Generally, pharmaceutical process chemistry involves the employment of known, but conscientiously chosen and optimised synthetic methods and reagents to produce specific drugs and APIs – it may not involve the discovery of new chemical reactions.48Foot Note 48×Prof Chiba’s First Expert Report at para 27.",
        "Compounds, intermediates, reagents, catalysts and coordinating solvents": "27 To recapitulate, the Patents claim chemical processes which produce bortezomib. For a better grasp of the Patents, it would be useful to first define the various terms used to describe the components involved in a chemical reaction. 28 A chemical compound is any substance composed of identical molecules consisting of atoms of two or more chemical elements held together by chemical bonds. An organic compound consists of a relatively unreactive backbone, and one or several functional groups.49Foot Note 49×Primer at p 67.A functional group is a substituent or moiety in a molecule that causes the molecule’s characteristic chemical reactions.50Foot Note 50×Primer at p 67. 29 A reactant is a substance that is consumed in the course of a chemical reaction, and it is also known as a reagent.51Foot Note 51×Primer at p 27; Prof Chiba’s First Expert Report at para 45 and Appendix P2 (IUPAC. Compendium of Chemical Terminology, 2nd ed. (the \"Gold Book\"); setting out the definition of “reactant”; available athttps://goldbook.iupac.org/terms/view/R05163).A reaction intermediate or an intermediate is a molecular entity that is formed from the reactants but is consumed in further reactions. In the hypothetical example below, A and B are reactants, ‘X’ is a reaction intermediate and ‘Y’ is a final product:52Foot Note 52×Primer at p 70.  30 A catalyst is a substance that speeds up a chemical reaction, or lowers the temperature or pressure needed to start one,without itself being consumedduring the reaction. An example of a catalyst is a Lewis acid (see [36] below). A coordinating ether solvent is a solvent that is capable of coordinating the Lewis acid and solvating the ionic components of the reaction.53Foot Note 53×Prof Chiba’s First Expert Report at para 45. Boronic acid 31 Bortezomib is a type of boronic acid. To understand the context in which the Patents teach processes to synthesise bortezomib, it is important to understand the basic structure of boronic acid. In the Primer, the plaintiffs define boronic acid as a compound related to boric acid in which one of the three hydroxyl groups is replaced by an alkyl or aryl group.54Foot Note 54×Primer at p 58.A hydroxyl group is a functional group denoted by the chemical formula −OH and composed of one oxygen atom covalently bonded to one hydrogen atom.55Foot Note 55×Primer at p 69.An alkyl group is derived from an alkane by the removal of one hydrogen atom from a carbon atom.56Foot Note 56×Primer at p 53.In organic chemistry, an alkane is a hydrocarbon, which in other words consists of hydrogen and carbon atoms only, arranged in a tree structure.57Foot Note 57×Primer at p 52.For instance, the alkyl group of methane (denoted by the chemical formula CH4) is methyl (denoted by the chemical formula CH3).58Foot Note 58×Primer at p 52.An aryl group is a functional group derived from a simple aromatic ring compound where one hydrogen atom is removed from the ring.59Foot Note 59×Primer at p 54.For example, a simple aryl group is phenyl (denoted by the chemical formula C6H5), a group derived from benzene (denoted by the chemical formula C6H6). The defendant has defined boronic acid as “compounds having the structure RB(OH)2”.60Foot Note 60×Primer at p 58.While the parties have defined boronic acid slightly differently in the Primer, the definitions are common in respect of the chemical structure of boronic acid:61Foot Note 61×Primer at p 58.  Figure 1: Chemical structure of boronic acid 32 Boronic acids also act as Lewis acids, with the unique capability of forming reversible covalent complexes with substances such as sugars, amino acids, hydroxamic acids. Given their unique characteristics, boronic acids are used extensively in organic chemistry as chemical building blocks and intermediates in various organic reactions. 33 The annotated diagram below depicts the components of bortezomib: the two hydroxyl groups circled by the dotted lines and the replacement group with the dashed line. The boron atom is denoted by “B”.  Figure 2: Diagrammatic representation of bortezomib produced with the first plaintiff’s process (on the left) and with DRL's process (on the right) Boron “ate” complex 34 In the context of bortezomib, the “ate” complex refers to a specific type of complex formed during the synthesis of the active ingredient, bortezomib. Specifically, it refers to the complex formed between boronic acid and an organometallic reagent, typically a lithium or magnesium compound, which is used to create the boronate ester intermediate in the synthesis of bortezomib.62Foot Note 62×Primer at p 55.It is a complex which is formed by the rearrangement of boron compounds in the presence of Lewis acid.63Foot Note 63×SG 322 at paras [001], [007], [025], [028], and [030].These boron compounds can be represented in the form of Formula (II),64Foot Note 64×SG 322 at paras [027], [035], [036], [038], [041], [048], [053], [055], [057], [058] and [068] and claims 1, 8, 10, 13, 3, 32, 33 and 38.as (IIa) or (IIb),65Foot Note 65×SG 322 at para [073] and claim 48.and as the compound of Formula (XV).66Foot Note 66×SG 322 at paras [085], [086] and [093] and claims 49, 50, 52 and 53.This complex allows for the transfer of the boronic acid moiety to the organometallic reagent, which is necessary to form the boronate ester intermediate. Without this complex, the reaction may not proceed effectively, leading to lower yields or incomplete reaction. The “ate” complex is therefore a critical component of the synthesis of bortezomib, allowing for the efficient formation of the boronate ester intermediate. 35 Furthermore, the formation and stability of the “ate” complex is dependent on several factors, such as the nature of the boronic acid and the organometallic reagent, as well as the reaction conditions. As a result, optimizing the conditions for the formation of this complex is important for the efficient synthesis of bortezomib.67Foot Note 67×Primer at p 56. Lewis acid and base 36 A Lewis acid is a molecular entity and chemical species that contains an empty orbital which is capable of accepting an electron pair from a Lewis base to form a Lewis adduct.68Foot Note 68×Primer at p 72.A Lewis base is any species that has a filled orbital containing an electron pair which is not involved in bonding but may form a dative bond with a Lewis acid to form a Lewis adduct because it can donate its lone pair of electrons.69Foot Note 69×Primer at p 72.In a Lewis adduct, the Lewis acid and base share an electron pair furnished by the Lewis base, forming a dative bond.70Foot Note 70×Primer at p 72.This is depicted in the diagram below.  Figure 3: Formation of a Lewis adduct A dative bond is also known as a coordinate, coordination or dipolar bond, and it is a bond formed upon interaction between molecular species where one serves as a donor and the other an acceptor of the electron pair to be shared.71Foot Note 71×Primer at p 63.Its analogy as a “type” of covalent bond stems from it sharing a common electron pair between two atoms; although dative bonds have significant polarity, lesser strength and greater length.72Foot Note 72×Primer at p 63.A covalent bond is a region of relatively high electron density between nuclei of atoms which arises frominter aliathe sharing of electrons.73Foot Note 73×Primer at p 62. 37 For the purposes of the present suit, it would be useful to note that zinc chloride (ZnCl2) is a Lewis acid.74Foot Note 74×Dr Johannes’ First Expert Report at para 30. Nucleofugic group 38 A nucleofuge group, otherwise known as a nucleofugic group, is a functional group that is capable of leaving a molecule during a chemical reaction by accepting a pair of electrons. It departs from a substrate with a pair of electrons, forming a new species, while the substrate undergoes a transformation.75Foot Note 75×Primer at pp 75–76.In the synthesis of bortezomib, a nucleofuge is used in the formation of the boronic acid or boronate ester moiety. For instance, a suitable nucleofugic group is attached to a boron-containing intermediate, and upon reaction with the desired nucleophile, the nucleofugic group leaves the molecule, enabling the formation of the boronic acid or boronate ester functional group.76Foot Note 76×Primer at p 76. Proteasome 39 The proteasome is a multisubunit enzyme complex that plays a central role in the regulation of proteins that control cell-cycle progression and apoptosis (cell death), and has therefore become an important target for anticancer therapy.77Foot Note 77×Primer at p 82. Coordinating solvent and coordinating ether solvent 40 A coordinating solvent or a coordinating co-solvent refers to a solvent that is capable of coordinating the Lewis acid and solvating the ionic components of the reaction.78Foot Note 78×Primer at p 62.A co-solvent is a solvent added to another primary solvent to modify the solubility of the reaction components.79Foot Note 79×Primer at p 62. 41 A coordinating ether solvent is an organic solvent that contains one or more ether functional groups, such as dimethyl ether, diethyl ether, or tetrahydrofuran (“THF”).80Foot Note 80×Primer at p 62.These solvents are commonly used in coordination chemistry and organometallic chemistry, as they have the ability to coordinate with metal ions and facilitate their solubility in organic solvents.81Foot Note 81×Primer at p 62.",
        "Relevant chemical processes (or reactions) in the synthesis of bortezomib": "Matteson homologation process 42 Homologation is the chemical process through which some boronic acid esters compounds (ie, the class of intermediates in the synthesis of bortezomib (see [58] below)) are synthesised. In organic chemistry, a homologation reaction is any chemical reaction that converts the reactant into the next member of the homologous series, which is a group of compounds that differ by a constant unit, generally a methylene (–CH2–) group.82Foot Note 82×Primer at p 68. 43 The Matteson homologation protocol is an organic chemistry reaction used to extend a carbon chain by one carbon atom, while also introducing a functional group, typically an alkene or alkyne.83Foot Note 83×Primer at p 74.The reaction involves the use of a homologating agent, which contains a halogen atom, and a nucleophile, typically an organometallic reagent such as an alkyl lithium or magnesium compound.84Foot Note 84×Primer at p 74.In the manufacture of bortezomib, the Matteson homologation protocol introduces an additional carbon atom to the boronate ester intermediate, which is a key step in the synthesis of bortezomib. Specifically, the protocol involves the use of a Lewis acid catalyst, which facilitates the reaction between the boronate ester intermediate and the homologating agent. The Lewis acid catalyst may be a metal halide such as zinc chloride, which coordinates with the boronate ester intermediate and activates it towards reaction with the homologating agent. The resulting product is an extended carbon chain with a new functional group, which can be further manipulated to obtain the desired final product, bortezomib.85Foot Note 85×Primer at p 74. 44 In 1983, Professor Donald S. Matteson (“Prof Matteson”) reported his studies on the synthesis of (+)-pinanediol (αS)-α-chloro-α-phenylmethane boronate by using zinc chloride as a Lewis acid catalyst in an academic article titled “Epimerization of α-Chloro Boronic Esters by Lithium and Zinc Chlorides” (“Matteson and Erdik”).86Foot Note 86×Prof Chiba’s First Expert Report at Appendix O, p 2235.Prof Matteson recorded his findings that the epimerisation of (+)-pinanediol (αS)-α-chloro-α-phenylmethane boronate was catalysed by lithium chloride (denoted by chemical formula LiCl) in the solvent THF. THF is an organic compound with the formula (CH2)4O, and in the case of moisture-sensitive reactions, anhydrous THF may be used.87Foot Note 87×Primer at p 81.Epimerisation creates an undesirable compound that reduces product purity (see [52] below).88Foot Note 88×Prof Chiba’s First Expert Report at para 34.Prof Matteson observed that the rate of epimerisation is greatly increased by reagents which promote the ionisation of lithium chloride, including water and dimethyl sulfoxide.89Foot Note 89×Prof Chiba’s First Expert Report at Appendix O, p 2235.The active catalyst is thus the free chloride ion (Cl-). Prof Matteson further explained that zinc chloride (being a direct substitute for lithium chloride) also catalysed the epimerisation.90Foot Note 90×Prof Chiba’s First Expert Report at Appendix O, p 2235.In summary, the Matteson homologation reaction may be split into two stages, and the synthetic reaction sequence is shown below.  Figure 4: Diagrammatic representation of the Matteson homologation process 45 Step 1 involves the synthesis of the boron “ate” complex (ie, an intermediate in the synthesis of bortezomib), while step 2 involves contacting the resultant boron “ate” complexwith a Lewis acid (contacting step) to generate the desired product. The yield of the desired product was accompanied with a 6% rate of the unwanted epimerised product (see [249] below). In the subsequent studies, Matteson and Erdik identified excess lithium chloride (LiCl) to be the reason for the rate of epimerisation observed, and further noted that the presence of a small amount of water led to the higher ionisation of lithium chloride (in other words, an increased formation of Li+ ions and Cl- ions). As a consequence, the rate of epimerisation increased significantly. The diagram below illustrates the epimerisation process.  Figure 5: Diagram showing the epimerised by-product from the Matteson homologation process 46 The known problem (or limitation) of the Matteson homologation process is therefore epimerisation, which introduces an undesired by-product. The coordinating solvent, THF, with even small amounts of water, promotes the ionisation of LiCl, and the Cl- ions. This in turn causes the epimerisation of the desired product to form the undesired by-product that is the impurity (or the epimer). Moisture in the THF is likely introduced by the Lewis acid catalyst, zinc chloride (ZnCl2), itself. Zinc chloride is a highly hygroscopic compound (ie, it absorbs moisture from its surroundings) and drying it is difficult and resource-intensive, especially when a large amount of the Lewis acid is to be dried.To illustrate the magnitude of the known problem of epimerisation, Matteson and Erdik recorded that 11mg of water in 10ml of THF doubled the rate of epimerisation.91Foot Note 91×Prof Chiba’s First Expert Report at Appendix O, p 1085.Resultantly, the yield of the desired product falls. Deprotection 47 Deprotection is a chemical process in which a protecting group is removed from a functional group in a molecule, restoring the original reactivity of that functional group. Protecting groups are temporary modifications made to a molecule to prevent undesirable side reactions during a multi-step synthesis.92Foot Note 92×Primer at p 64.In the synthesis of bortezomib, deprotection is a critical step. Bortezomib contains an N-terminal pyrazinoic acid moiety and a C-terminal boronic acid group.93Foot Note 93×Primer at p 64.During synthesis, the boronic acid group is often protected as a boronate ester to prevent unwanted side reactions. Deprotection of the boronate ester is necessary to obtain the active boronic acid form of bortezomib.94Foot Note 94×Primer at p 64. Ionisation 48 Ionisation is the process by which an atom or molecule acquires a net electric charge by gaining or losing one or more electrons, thus forming an ion. In the context of the manufacture of bortezomib, ionisation may be utilised during the analytical stages to monitor the quality and purity of the intermediates and the final product. Ionisation is employed in various analytical techniques such as mass spectrometry, to identify and characterise molecules by altering their charge states and subsequently detecting their masses. Linear synthesis 49 Linear synthesis is a chemical synthesis process in which a series of linear transformation reactions are used to convert a reactant or some reactants into a product or multiple products.95Foot Note 95×Primer at p 72.This synthesis process includes the longest route for the production of the target product.96Foot Note 96×Primer at p 72. Convergent synthesis 50 Convergent synthesis is a chemical synthesis process in which pieces of the desired product are made by a set of reactions, and the pieces are combined with each other via another set of reactions.97Foot Note 97×Primer at p 61.This type of synthesis process is different from linear synthesis because this process involves parallel reactions rather than linear transformations.98Foot Note 98×Primer at p 61.This process features in SG 29P.",
        "Concepts measuring the efficacy of the synthesis of bortezomib": "Diastereomeric ratio 51 Diastereomeric ratio is a term used in chemistry to describe the relative amounts of different diastereomers in a mixture.99Foot Note 99×Primer at p 65.Diastereomers are stereoisomers that are not mirror images of each other (or non-superimposable stereoisomers) and have different physical and chemical properties.100Foot Note 100×Primer at p 65.Such physical and chemical properties include melting point, boiling point and solubility. The diastereomeric ratio is usually expressed as the ratio of the concentration of one diastereomer to the concentration of the other diastereomer in a mixture.101Foot Note 101×Primer at p 65.For example, if a mixture contains 60% of diastereomer A and 40% of diastereomer B, the diastereomeric ratio of A:B is 3:2.102Foot Note 102×Primer at p 65.By measuring the diastereomeric ratio, pharmaceutical chemists can determine the purity and quality of drug compounds, optimise the production processes for chiral drugs and monitor the stability and degradation of chiral drug compounds during storage or in biological systems.103Foot Note 103×Primer at p 65. Epimerisation 52 Epimerisation is a process in which there is an interconversion of one epimer to another epimer (ie, the configuration of a stereocenter is changed from one enantiomer to another).104Foot Note 104×Primer at p 66.An epimer is one of a pair of diastereomers, each of which have opposite configuration at only one stereogenic centre out of at least two. In the context of the Matteson homologation protocol, epimerisation can occur during the reaction of the chiral starting material with reagents such as THF in the presence of a Lewis acid catalyst (eg, zinc chloride).105Foot Note 105×Primer at p 66.During the Matteson homologation reaction, the chiral starting material is converted to a new chiral intermediate, which is then used to synthesise the boronic ester intermediate for bortezomib. If the reaction conditions are not carefully controlled, however, the chiral intermediate can undergo epimerisation, leading to the formation of undesired stereoisomers and reducing the yield and purity of the desired product.106Foot Note 106×Primer at p 66. Hygroscopic 53 Hygroscopic refers to a substance’s tendency to absorb moisture from the environment.107Foot Note 107×Primer at p 69.Hygroscopy is the phenomenon of attracting and holding water molecules via either absorption or adsorption from the surrounding environment, which is usually at normal or room temperature.108Foot Note 108×Primer at p 69.In the context of the manufacture of bortezomib, hygroscopic materials may be used to control moisture levels in the reaction environment to ensure the stability and effectiveness of the final product.109Foot Note 109×Primer at p 69. Miscibility 54 Miscibility is the ability of two or more substances to mix together and form a homogeneous solution without phase separation.110Foot Note 110×Primer at p 75.If two substances are miscible, they are also completely soluble in one another irrespective of the order of introduction. For example, THF and water are miscible.111Foot Note 111×Primer at p 74. Scalability 55 Scalability is the ability of a process or system to handle a growing amount of work or accommodate larger production volumes without compromising efficiency, performance or quality.112Foot Note 112×Primer at p 80. Stereochemical erosion 56 Stereochemical erosion is the loss of stereochemical information, such as chirality or geometry, during a chemical reaction or process, leading to a mixture of stereoisomers. Stereochemical erosion is an important consideration in the synthesis of chiral compounds, particularly in pharmaceuticals, where stereoisomers can have different biological activities. Stereochemical erosion must be minimised during bortezomib synthesis to maintain the desired stereochemistry of the final product, which directly affects its therapeutic efficacy.113Foot Note 113×Primer at pp 82–83.",
        "Synthesis of bortezomib": "57 It is common ground that there are a number of ways to synthesise bortezomib. 58 Bortezomib is made by synthesising a series of intermediates. The following intermediates are relevant to the present suit:114Foot Note 114×Dr Johannes’ First Expert Report at para 44. (a) The first intermediate is (3aS,4S,6S,7aR)-2-((S)-1-chloro-3-methylbutyl)-3a,5,5-trimethyl-hexahyfro-4,6-methanobenzo[d][1,3,2]dioxaborole. This compound is referred to as Formula (I) in the Patents and “BZM-2” in DRL’s process. (b) The second intermediate is 4-lsobutyl-2,9,9-trimethyl-3,5-dioxa-4-bora-trioyclo[6.1,1.02.6],decane. This is referred to as Formula (III) in the Patents and “BZM-1” in DRL’s process. (c) The third intermediate is 1,1,1-trimethyl-N-((R)-3-methyl-l-((3aS,4S,6S,7aR)-3a,5,5-trimethylhexahydro-4,6-methanobenzo [d][1,3,2]dioxaborol-2-yl)butyl)-N-(trlmethylsilyl), silanamine. This compound is referred to as Formula (VIII) in the Patents and “BZM-3” in DRL’s process. (d) The fourth intermediate is 3-Methyl-l-(2,9,9-trimethyl-3,5-dioxa-4-bora-tricyclo [6.1.1.02.6] dec-4-yl, butyl amine trifluoroacetate. This compound is an acid addition salt referred to as Formula (VII) or (XVIII) in the Patents and “BZM-4” in DRL’s process. (e) The fifth intermediate is (S)-3-Phenyl-2-[(pyrazine-2-carbonyl)-amino], propionic acid. This compound is called Formula (XIXa) in the Patents and “BZM-8” in DRL’s process. (f) The sixth intermediate is Pyrazine-2-carboxylic acid {1-[3-methyl-1(2,9,9-trimethyl-3,5-dioxa-4-boratricyclo [6.1.1.02.6]dec-4-yl), butyl carbamoyl]-2-phenyl-ethyl)-amide. This compound is referred to as Formula (XXIII) in the Patents and “BZM-9” in DRL’s process.",
        "Relevant legal principles": "",
        "Standing to commence proceedings for patent infringement": "59 The general proposition is that the right of action for patent infringement is reserved for the proprietor of the patent, with certain statutory exceptions for persons other than the proprietor. In this case, the relevant provision is s 74 of the Patents Act (Cap 221) (the “Patents Act”), which provides that an exclusive licensee of a patent may commence proceedings for its infringement. I reproduce the material parts of s 74 of the Patents Act: Proceedings for infringement by exclusive licensee 74.—(1)The holder of an exclusive licence under a patent shall have the same right as the proprietor of the patent to bring proceedings in respect of any infringement of the patent committed after the date of the licence; and references to the proprietor of the patent in this Act relating to infringement shall be construed accordingly. (2) In awarding damages or granting any other relief in any such proceedings, the court or the Registrar shall take into consideration any loss suffered or likely to be suffered by the exclusive licensee as such as a result of the infringement, or, as the case may be, the profits derived from the infringement, so far as it constitutes an infringement of the rights of the exclusive licensee as such. … [emphasis added] 60 Correspondingly, the definition of an exclusive licensee is set out in s 2(1) of the Patents Act, which I reproduce in full: 2.—(1)  In this Act, unless the context otherwise requires — … “exclusive licence” means a licence from the proprietor of or applicant for a patent conferring on the licensee, or on him and persons authorised by him, to the exclusion of all other persons (including the proprietor or applicant), any right in respect of the invention to which the patent or application relates, and “exclusive licensee” and “non-exclusive licence” shall be construed accordingly; … 61 To determine whether a party is an exclusive licensee, the Court must assess all the evidence put before it. Generally, the decision will depend on the contract that governs the party’s status as an exclusive licensee. In the case ofOxford Nanopore Technologies Ltd v. Pacific Biosciences of California Inc[2017] EWHC 3190 (Pat) (“Oxford Nanopore”), the English High Court has summarised some relevant principles to aid in the determination of whether a licence is exclusive (at [44]). The relevant portion of the decision inOxford Nanoporeis reproduced below: In my judgment, the following propositions can be drawn from the authorities and texts to which I have referred above: i) Whether or not a licence is an exclusive licence for the purposes of section 67(1) of the Patents Act is a matter for English law:Dendron, paragraph 9; ii) A licence which purports to be an exclusive licence may not necessarily be so. Identifying an exclusive licence depends on a proper construction of the document or documents:Dendron, paragraph 9. An exclusive licence will be expressly so: circumstances in which an exclusive licence will be implied will be rare, if they exist at all; iii) It is for the party asserting that it is an exclusive licensee to demonstrate that it is:Dendron, paragraph 9; iv) The assessment of whether or not a licence is exclusive is not a “once and for all assessment”:Dendron, paragraph 11. An exclusive licence may confer upon the patentee a power to convert the licence into a non-exclusive licence:Dendron, paragraph 11; v) The “essential element” of an exclusive licence is that is it (sic) a licence to the exclusion of all other persons, including the patentee or applicant:Dendron, paragraph 11; vi) It is possible to have a plurality of exclusive licences in respect of any one patent:Courtauld's, page 210;Illumina, paragraph 475; vii) But each exclusive licence may only be granted to one person – a licence will not be exclusive if granted to a number of entities, even if they are under the same control:Illumina, paragraph 254; viii) An exclusive licensee may grant sub-licences to “persons authorised by him”:Dendron, paragraph 11;Illumina, paragraph 254; … 62 The cases referred to in the extract above at [61] areDendron GmbH v University of California (No 3)[2004] EWHC 1163 (Ch),Courtauld's Application[1956] RPC 208 andIllumina Inc and others v Premaitha Health PLC and another[2017] EWHC 2930 (Pat). 63 Later in this judgment (see [115]–[122] below), I analyse the issue of the second plaintiff’s standing as an exclusive licensee with these propositions (at [61] above) in mind.",
        "The law on patent validity": "64 Section 80(1) of the Patents Act sets out the grounds on which the validity of a patent can be undermined. Of particular relevance to the present case is the following ground: the invention is not a patentable invention (s 80(1)(a)). The applicable legal principles are elaborated on below. How to construe the claims in a patent? 65 Before moving to the substantive question proper, the claims asserted in a patent should first be properly interpreted. Claim construction is an integral exercise to dealing with issues relating to the validity and infringement of a patent. It involves determining the substance of the claim, which in turn clarifies the scope of protection of the invention:IIa Technologies Pte Ltd v Element Six Technologies Ltd[2023] 1 SLR 987 (“Element Six”) at [62];Sunseap Group Pte Ltd and others v Sun Electric Pte Ltd[2019] 1 SLR 645 (“Sunseap”) at [68];First Currency Choice Pte Ltd v Main-Line Corporate Holdings Ltd and another appeal[2008] 1 SLR(R) 335(“First Currency”) at [23]. In other words, claim construction seeks to answer the question: what does the patentee claim monopoly rights over? Section 113(1) of the Patents Act states as follows: Extent of invention 113.—(1) For the purposes of this Act, an invention for a patent for which an application has been made or for which a patent has been granted shall, unless the context otherwise requires, be taken to be that specified in a claim of the specification of the application or patent, as the case may be, as interpreted by the description and any drawings contained in that specification, and the extent of the protection conferred by a patent or application for a patent shall be determined accordingly. InFirst Currency, the Court of Appeal held that the claims themselves are the principal determinant in ascertaining the true construction of a patent specification (at [23]). It explained that the description and other parts of the specification play an assisting role in the construction of the claims (ibid). The claims and the description are to be read together and construed contextually (ibid). As the background of the words used in the claims may be affected or defined by what is said in the body of the patent specification, the claims should not be viewed independently, but construed as part of the whole specification (First Currencyat [24], citingRosedale Associated Manufactures Ld v Carlton Tyre Saving Coy Ld[1960] RPC 59 at 69). That said, it is impermissible to “put a gloss on or expand the claims” by relying on a statement in the specification (ibid). If the claims have an ordinary and plain meaning, then reliance ought not to be placed on the language used in the body of the specification so as to make them mean something different (First Currencyat [24], relying onElectric & Musical Industries v Lissen Ld(1938) 56 RPC 23 at 57). The Court of Appeal therefore endorsed the “purposive construction” approach to the claims to determine the essential features of an invention, which are protected by the patent (First Currencyat [25]). 66 Another facet of claim construction pertains to the relationship between independent and dependent claims. The Court of Appeal inSunseapheld that “oncethe defendant succeeds in establishing that all theindependent claimsin a patentare invalid,the dependent claims must necessarily fall awayand thepatent as a whole must be regarded as invalid” [emphasis added] (Sunseapat [70]). TheSunseapapproach contends that the invalidity of the underlying independent claim necessarily undermines the foundation of the dependent claims. InElement Six, the Court of Appeal deemed it unnecessary to rule on the correctness of the observation inSunseapand left this to be considered at a later juncture (at [240]). The approach inElement Sixinvolved an assessment of the sole independent claim asserted and the resolution of the remaining dependent claims asserted was on the basis that they all “refer back to [claim 1]” (ie, the independent claim) (Element Sixat [29] and [239]). As the Court of Appeal has left open the question inElement Six, I would have ordinarily also considered the issue of validity on a claim-by-claim basis (Element Sixat [236]) in addition to applying the general rule inSunseapthat a patent should be revoked if all the independent claims in the patent have been found to be invalid (seeSunseapat [70]). However, as the parties have run their respective cases on the premise that all other asserted claims are contingent on the validity of the first independent claim in SG 322 and SG 29P respectively (see [148], [162] and [184] below), I will engage only with the arguments specific to claim 1 of SG 322 and claim 1 of SG 29P. 67 Having set out the approach taken for claim construction, the next aspect to consider is the theoretical perspective through which the construction is conducted. It is envisaged that the notional person through whose eyes the claim must be construed is one who is a reasonable person skilled in the art. The Court inElement Sixaffirmed that the person skilled in the art is concerned with the subject-matter of the patent, which should be determined with reference to the words in the patent specification (at [69] and [72]). The distinction is that the person skilled in the art is imbued with certain knowledge and assumptions that one attributes to that particular audience. Courts have considered the purposive interpretation of the claims to be able to adequately balance the rights of the patentee and those of third parties:Element Sixat [79];Lee Tat Cheng v Maka GPS Technologies Pte Ltd[2018] 1 SLR 856 (“Lee Tat Cheng (CA)”) at [41];First Currencyat [26];FE Global Electronics Pte Ltd v Trek Technology (Singapore) Pte Ltd[2006] 1 SLR(R) 874 (“Trek Technology (CA)”) at [14]. Who the person skilled in the art is depends on the technology and patented invention. He should be taken to be the workman or technician who is aware of everything encompassed in the state of the art and who has the skill to make routine workshop developments, but not to exercise inventive ingenuity or think laterally (Element Sixat [67];First Currencyat [28], citing with approvalPfizer Ltd’s Patent[2001] FSR 16 at [62]–[63]). Despite the lack of ingenuity, the person skilled in the art is equipped with a reasonable degree of intelligence and with a wish to make the directions in the patent work (Element Sixat [69], citingZipher Ltd v Markem Systems Ltd and another[2008] EWHC 1379 (Pat) at [366] with approval; see alsoNg Kok Cheng v Chua Say Tiong[2001] 2 SLR(R) 326 (“Ng Kok Cheng”) at [21], which cited with approvalMcGhan Medical UK v NagorCaseNo 1999 1720 (28 February 2001) at [23]–[24]). Further, the person skilled in the art would possess common general knowledge of the subject matter in question:Element Sixat [67] and [69];First Currencyat [28]. 68 Common general knowledge is information which, at the relevant date, is common knowledge in the art to which the alleged invention relates, so as to be known to duly qualified persons engaged in that art:Element Sixat [63]. It features in the analysis of the validity of the patent in various ways. When determining whether the patented invention is novel or contains an inventive step, the person skilled in the art employs his common general knowledge to interpret prior art, amongst other purposes:Element Sixat [64]. Interpreting the prior art is crucial to determining what information is conveyed to the person skilled in the art at the priority date of the patent in suit or the date on which the piece of prior art (such as a book or journal) was published and whether that information renders the invention obvious and/or anticipates the invention. However, the disclosure does not form part of the common general knowledge merely because it is widely read or circulated – rather, it must be shown that it is generally known and regarded as a good basis for further action by the bulk of those who are engaged in the particular art to which the disclosure relates:Element Sixat [74]. In the contexts of claim construction and sufficiency, however, the person skilled in the art mainly directs his common general knowledge towards the interpretation of the patent claims and the working of the invention disclosed therein:Element Sixat [64]. 69 Section 80(1) of the Patents Act sets out the grounds on which a patent may be revoked for lack of validity. Of particular relevance to the present case are the following grounds: the invention is not a patentable invention (s 80(1)(a)); and the specification of the patent does not disclose the invention clearly and completely for it to be performed by a person skilled in the art (s 80(1)(c)). Is the invention patentable? 70 Whether the invention is patentable rests on the statutorily-defined requirements in s 13(1) of the Patents Act. The requirements for an invention to be patentable are listed below: (a) The invention must be new (s 13(1)(a)) (the “novelty requirement”). (b) The invention must involve an inventive step (s 13(1)(b)) (the “inventive step requirement”). (c) The invention must be capable of industrial application (s 13(1)(c)). 71 In the present case, only the requirements of novelty and inventive step are put in issue. (1) Novelty requirement (A) The state of the art 72 Parties agree on the applicable law on the novelty requirement. The law on novelty is set out in s 14 of the Patents Act. Section 14(1) provides that “[a]n invention shall be taken to be new if it does not form part of the state of the art”. Section 14(2) sets out the definition of the “state of the art”: The state of the art in the case of an invention shall be taken to comprise all matter (whether a product, a process, information about either, or anything else) which has at any time before the priority date of that invention been made available to the public (whether in Singapore or elsewhere) by written or oral description, by use or in any other way. 73 The principles that govern the inquiry on what constitutes the state of the art for the purposes of assessing patentability are well established. Section 14(2) makes it clear that the state of the art is assessed on a worldwide basis with no geographical or territorial limits:Rohm and Haas Electronic Materials CMP Holdings, Inc (formerly known as Rodel Holdings, Inc) v NexPlanar Corp and another[2018] 5 SLR 180 (“Rohm”) at [46]. It comprises “all matter” made available to the publicbeforethe priority date:ibid. The modality of “[being] made available” may be through “written or oral” disclosure, “use”, or “in any other way”. The priority date is the date of the filing of the application (s 17(1) Patents Act), but the patentee may depart from the default position by claiming that the priority date of the invention takes reference from the date of filing of an earlier patent application or applications (s 17(2) Patents Act). This has the effect of limiting the state of the art to what it was at that earlier date:Element Sixat [59]. Section 14(3) provides that the “state of the art” may also includematter contained in a patent applicationthat was publishedon or afterthepriority date of the invention, provided that: (a) that matter was contained in that patent application at the time when it was filed, as well as when it was published; and (b) the priority date of that patent application is earlier than that of the patented invention. While the scope of the state of the art is broad, there must be “clear and satisfactory evidence” that the prior disclosure and/or use did in fact take place:Main-Line Corporate Holdings Ltd v United Overseas Bank Ltd and another (First Currency Choice Pte Ltd, third party)[2007] 1 SLR(R) 1021 (“Main-Line”) at [55]. (B) Anticipation by prior state of the art 74 Once the prior disclosure or prior art is identified, the next step is to determine whether the claimed invention was anticipated by the prior disclosure or prior art:Lee Tat Chengv Maka GPS Technologies Pte Ltd[2018] 3 SLR 1334 (“Lee Tat Cheng (HC)”) at [76]–[77];Rohmat [58]. 75 Whether the claimed invention was anticipated turns on more than merely the prior publication identifying the subject matter of the claim in the later patent. Anticipation requires “enabling disclosure”: seeMerck & Co Inc v Pharmaforte Singapore Pte Ltd[2000] 2 SLR(R) 708 (“Merck”) at [38]. To meet the threshold of “enabling disclosure” means that an invention would be anticipated by the prior art if the teachings disclosed in it are sufficiently clear and complete to allow the person skilled in the art to make the claimed invention. The information or teachings disclosed in the prior art may be explicit or implicit:Research in Motion v Inpro[2006] RPC 517 at [128] (see generallyTerrellon the Law of Patents(Colin Birss gen ed) (Sweet & Maxwell, 19th Ed, 2022) (“Terrell”) at paras 11.68–11.71). The disclosure should be “so clear” that a person skilled in the art following those directions “must inevitably produce something [ie, a product or a process] that would, if the patentee’s patent were valid, infringe the patentee’s claim”:ASM Technology Singapore Pte Ltd v Towa Corp[2018] 1 SLR 211 at [59];Mühlbauer AG v Manufacturing Integration Technology Ltd[2010] 2 SLR 724 (“Mühlbauer”) at [17]. This inquiry in relation to disclosure has been framed as the “reverse infringement” test inDien Ghin Electronic (S) Pte Ltd v Khek Tai Ting(trading as Soon Heng Digitax)[2011] 3 SLR 227 (per Chan Seng Onn J (as he then was) at [30]) and the “would it infringe” test inLee Tat Cheng (HC)(per George Wei J at [81]). It would not suffice if the disclosure in the prior art is a “near miss” (seeMain-Lineat [63]) or merely reveals “something close or similar” to the claimed invention (seeLee Tat Cheng (HC)at [80]). Put another way, a disclosure which does not enable the person skilled in the art to perform the claimed invention is not anticipatory (seeRohmat [61]). In construing whether a piece of art has anticipated the claimed invention, where the prior art is a patent application, this prior art must be construed as at the date of its publication and not on the date that it was filed:Mühlbauerat [18]. 76 The burden is on the party challenging the novelty of a granted patent to adduce evidence of a prior disclosure that led to the claimed invention forming part of the state of the art:Rohmat [49];Martek Biosciences Corp v Cargill International Trading Pte Ltd[2012] 2 SLR 482 at [44]. 77 Finally, there exists a rule against “mosaicking” the pieces of the prior art in the assessment of the novelty requirement. This is to say that it is impermissible to assemble all the pieces of prior art together into a “mosaic” and then to compare the claimed invention against this “mosaic”. The claimed invention should only be compared againsteach individual pieceof prior art to determine whether it was anticipated by each piece of prior art, unless the prior art expressly directs the reader to another piece of prior art:Trek Technology (CA)at [38];Rohmat [62],Mühlbauerat [18]. 78 In summary, the novelty requirement is dealt with in the following manner (Rohmat [63]): (a) Determine the relevant state of the art. (b) Interpret the prior art material from the perspective of the person skilled in the art at the date the material entered the prior art and without use of hindsight or mosaicking, and consider what each piece of prior art disclosed. (c) Interpret the scope of the claimed invention from the perspective of the person skilled in the art and by reference to the patent specification. (d) Compare the prior art against the claimed invention and determine whether the prior art anticipated the claimed invention. (2) Inventive step requirement 79 The applicable law on inventive step is well-established. Section 15 defines an inventive step as one that “is not obvious to a person skilled in the art”, having regard to the relevant state of the art. This is termed an inquiry for obviousness. An invention shall be taken to involve an inventive step if it is not obvious to a person skilled in the art, having regard to any matter which forms part of the state of the art as at the priority date of the invention:Element Sixat [60]. When considering the issue of obviousness, it is assumed that the invention is novel and differs in some identifiable respect from the prior art. The key question then is whether these differences constitute steps that would have been obvious:Element Sixat [60]. 80 The state of the art in the obviousness inquiry is a subset of the state of the art in the novelty inquiry. Although both inquiries concern themselves with the construction of the relevant state of the art, the relevant state of the art for the inventive step requirement is the same state of the art for the novelty requirement, except that unpublished patent applications which have a priority date earlier than that of the invention in question are disregarded (see s 15 read with ss 14(2) and 14(3) of the Patents Act;Terrellat para 12.41;Ng-Loyat para 30.2.49). Quite apart from thecontentof the relevant state of art in the assessments of novelty and inventive step, the manner in which the relevant state of the art is treated in the inquiries differs as well. Unlike in the assessment of novelty, “mosaicking” is permissible in the assessment of obviousness as long as the “mosaic” can be put together by an unimaginative man with no inventive capacity:Mühlbauerat [93], citingTechnograph Printed Circuits Ltd v Mills & Rockley (Electronics) Ltd[1972] RPC 346 (“Technograph”) at 355). The notional skilled person assesses the obviousness of an invention by reference to the whole of the state of the art relevant to the invention, using his common general knowledge. 81 The Court of Appeal inFirst Currencyset out the four-step test to determine whether an alleged invention involves an inventive step (at [41]–[42]). The four steps, which were derived fromWindsurfing International Inc v Tabur Marine(Great Britain) Ltd[1985] RPC 59 at 73–74 (“Windsurfing”), are as follows: (a) Identify the inventive concept embodied in the claim, or construe it:Mühlbauerat [22]. A purposive approach is taken to claim construction:Mühlbauerat [22]–[24]. The purposive approach asks: what would the hypothetical person skilled in the art have understood the patentee to mean by choosing to use the word/phrase (the cause of the dispute) in the claim at the time of the patent application? (Lee Tat Cheng (CA)at [41(c)]). (b) Identify (i) the notional person skilled in the art (ie, skilled but unimaginative addressee in the art at the priority date) and (ii) impute to him what was, at that date, common general knowledge in the art in question. The skilled but unimaginative addressee is only a “diligent researcher” and may be entitled to disregard a piece of prior art that he did not know of and was not likely to know of or pay attention to:First Currencyat [38]–[41]. (c) Identify what, if any, differences exist between the matter cited as forming part of the “state of the art” and the inventive concept of the claim or the claim as construed. (d) Whether, viewed without any knowledge of the alleged invention in the claim, those differences constitute steps which would have been obvious to the skilled man or whether they require any degree of invention. This involves comparing the invention against the whole of the state of the art comprising all relevant pieces of prior art, and may involve “mosaicking”. 82 The inquiry in [81(d)] above is grounded in a holistic, multi-factorial assessment of factors relevant to obviousness. The English courts have acknowledged that the question of obviousness is necessarily fact-dependent:Conor Medsystems Inc v Angiotech Pharmaceuticals Inc[2008] UKHL 49; [2008] 4 All ER 621 (“Conor”) at [42] andActavis Group PTC EHF and others v ICOS Corporation and another[2019] UKSC 15 (“Actavis”) at [63]. Lord Hoffmann expressed his view on the holistic approach to the obviousness inquiry inConor: As Kitchin J said inGenerics(UK)Ltd v H Lundbeck A/S[2007] EWHC 1040 (Pat) at [72], [2007] RPC 729 at [72]: ‘… Thequestion of obviousness must be considered on the facts of each case.The court must consider the weight to be attached to any particular factor in the light of all the relevant circumstances. These may include such matters as the motive to find a solution to the problem the patent addresses, the number and extent of the possible avenues of research, the effort involved in pursuing them and the expectation of success.’ 83 The list of factors above (see [82]) was illustrative and not exhaustive:Actavisat [63]. The English Supreme Court set out a non-exhaustive list of considerations as follows: (i) whether at the priority date something had been ‘obvious to try’; (ii) the routine nature of the research and any established practice of following such research through to a particular point; (iii) the burden and cost of the research programme; (iv) the necessity for and the nature of the value judgments which the team of persons skilled in the art would have in the course of a testing programme; (v) the existence of alternative or multiple paths of research; (vi) the motive of the person skilled in the art; (vii) the fact that the results of research which the inventor actually carried out were unexpected or surprising; (viii) hindsight, which included knowledge of the invention, must not be used; (ix) whether a feature of a claimed invention was an added benefit in a context in which the claimed innovation was obvious for another purpose; and (x) the nature of the invention (Actavisat [65]–[74]). 84 I set out the law on the relevant consideration which arises in the present case: whether the inventive step is “obvious to try” to a person skilled in the art who is in possession of the cited prior art. 85 InLee Tat Cheng (HC)at [133] andRohmat [121(d)], our courts have endorsed the formulation of the “obvious to try” factor as outlined by Lord Hoffmann inConorat [42], approving Diplock LJ inJohns Manville Corp’s Patent[1967] RPC 479 (“Johns Manville Corp’s Patent”) at 493. InJohns Manville Corp’s Patent, Diplock LJ stated that “the notion of something being obvious to try was useful only in a case in which there was a fair expectation of success” (at 493). In other words, if the prior art teaches many paths one of which might lead to the solution, the obvious thing to do will be to try all those paths:Lee Tat Cheng (HC)at [133]. A decision to try a particular path, with no fair expectation of success, is inventive:Lee Tat Cheng (HC)at [133]. Although not relevant in our case, more recently, Lord Hodge inActavisconsidered that the general approach to the “obvious to try” consideration did not preclude a finding of obviousness in a case where there is no particular expectation as to the result of a routine test or experiment (at [65]). The relevant extract fromActavisis reproduced below (at [65]): … it is relevant to consider whether at the priority date something was ‘obvious to try’, in other wordswhether it was obvious to undertake a specific piece of research which had a reasonable or fair prospect of success:Conor v Angiotech(above) para [42] per Lord Hoffmann;MedImmune Ltd vNovartis Pharmaceuticals UK Ltd[2012] EWCA Civ 1234, [2013] RPC 27 paras [90] and [91]per Kitchin LJ. In many cases the consideration that there is a likelihood of success which is sufficient to warrant an actual trial is an important pointer to obviousness. But as Kitchin LJ said inGenerics (UK) Ltd (t/a Mylan) v Novartis AG[2012] EWCA Civ 1623,para 55,there is no requirement that it is manifest that a test ought to work; that would impose a straightjacket which would preclude a finding of obviousness in a case where the results of an entirely routine test are unpredictable. As Birss J observed in this case (para 276), some experiments which are undertaken without any particular expectation as to result are obvious … [emphasis added] 86 Inventiveness may be present even if the gap between the invention and what existed in the prior art is small; a Lilliputian step is no less significant:First Currencyat [54]. However, a step which is in substance a “mere workshop improvement” or “workshop variation of existing prior art” is not an inventive step:ASM Assembly Automation Ltd v Aurigin Technology Pte Ltd and others[2010] 1 SLR 1 at [55]. Whilst the court is often assisted in the assessment of obviousness by experts, the ultimate decision on non-obviousness is one of fact, impression and judgment, and one which only the court can make:Lee Tat Cheng (HC)at [126]. 87 I illustrate next the law on technical prejudice as it has developed in the UK as the plaintiffs have relied on this factor. 88 The obviousness inquiry may feature a prejudice in overcoming the preconceptions of the skilled person in a particular field:Terrellat para 12-97. In one of the seminal cases on the concept, Jacob J inUnion Carbide Corp v BP Chemicals[1998] RPC 1 at [25] explained that “[i]nvention can lie in finding out that that which those in the art thought ought not be done, ought to be done”. The learned authors in Terrell considered that the prejudice may be a general one, and the invention a more specific answer to it:Terrellat para 12-99. InDyson Appliances Ltd v Hoover Ltd[2001] RPC 26; [2001] IP & T 1 (“Dyson”), the claimant and the defendant were companies in the business of manufacturing and distributing domestic vacuum appliances. The claimant was the patent proprietor of a patent that enabled it to manufacture vacuum cleaning appliances that did not require the user either to empty or replace dust-collecting bags. Its vacuum cleaning appliances depended upon use being made of cyclonic separation to deposit dirt from laden air that had been sucked through the apparatus from a location that required cleaning. The defendant later manufactured a vacuum cleaning appliance, which operated without bags and made use of three cyclone separation units to separate dust from the ambient air sucked in by the machine. The claimant alleged that certain claims of the patent had been infringed by the defendant, while the defendant claimed that the patent was invalid on the grounds of lack of novelty, obviousness and insufficiency. In considering that the patent was non-obvious, Michael Fysh QC sitting in the Chancery Division (Patents Court) of England and Wales held that there had been a prejudice in favour of bags within the industry, and no evidence of technical problems with the use of those bags (at [156]). Furthermore, the court considered that there was no motive or reason for stepping away from the prior art in the direction of the claims (at [159]). In the discussion of technical prejudice that the person skilled in the art would have to overcome, the court considered that the “negative aspects of knowledge” – in this case the mindset within the vacuum cleaner industry that no notional person skilled in the art would consider the viability of purifying dirt-laden air from a vacuum cleaning operation (other than through using a bag or a bag and a final filter) – “would at least have caused the addressee to regard modification toanyof these prior art proposals with considerable reserve if not overt skepticism” (at [156]). The claim inDysonwas narrower than a machine that was bag-free, but it was a specific combination of an invention which overcame a relevant defect:Terrellat para 12-99. The decision was upheld by the English Court of Appeal inDyson Appliances Ltd v Hoover Ltd[2001] EWCA Civ 1440. 89 It is also necessary to note the distinction between technical prejudice and commercial prejudice. InCipla Ltd v Glaxo Group[2004] EWHC 477 (Pat) at [30], Pumfrey J held: Such a prejudice may be a merely commercial one ('this device won't sell') or it may be a technical one ('this won't work and it is not worth bothering with'). A twenty-year monopoly is conferred for overcoming a prejudice of the second kind, but not for overcoming a commercial prejudice (seeHallen v Brabantia[1989] RPC 307, [1990] FSR 134 (Aldous J)). A technical prejudice must be general: it is not enough that some persons actually engaged in the art at the material time labour under a particular prejudice if a substantial number of others do not. A prejudice which is insufficiently widespread for it properly to be regarded as commonly shared will not, in my view, be attributed to the notional skilled person. As Jacob J put it inUnion Carbide v BP(above at page 16): 'It is not good enough to show that a matter was known to some but not to others and in particular it is not good enough to show that knowledge (or a prejudice) was confined to one or a limited class of suggested exemplars of the skilled man.' It is clear from the holding above that the prejudice alleged by the patent proprietor must be one that is technical in nature, rather than merely commercial. The technical prejudice must also be sufficiently widespread to be regarded as commonly shared. However, it is not necessary for the patent to explain why the prejudice is wrong or provide a scientific explanation of how the invention works to overcome it. Indeed, inSynthonBV v Teva Pharmaceutical Industries Ltd[2015] EWHC 1395 (Pat), Birss J did not accept that “much [could] be made of the fact that the patent did not expressly assert that this or that element in the disclosure was surprising or difficult” (at [115]), because it was ultimately an assertion that either bears out in the assessment of the prior art, or it does not. It suffices that the patent specification sets out properly the invention (at [115]). Having set out the law on technical prejudice, I will consider the issue as it arises in the present case below (see [213]–[219]). Is the invention sufficiently disclosed? 90 Section 25(4) of the Patents Act requires, in the making of a patent application, that the specification of the application “disclose the invention in a manner which is clear and complete for the invention to be performed by a person skilled in the art”. As I stated at [69], insufficiency of disclosure is a ground for the revocation of a patent. 91 Following the decision inElement Six, insufficiency arising from uncertainty is recognised as a ground of insufficiency in addition to classical insufficiency. Classical insufficiency is where the patent specification was not clear and complete enough to enable the person skilled in the art to perform the invention across the whole breadth of the claim(s) without an undue burden. Insufficiency resulting from uncertainty is concerned with whether the person skilled in the art knew how to determine whether a particular product or process was within the scope of the claimed invention even after employing his common general knowledge and the normal claim construction process. The assessment of sufficiency proceeded in two steps: the first involved identifying the invention and deciding what it claimed to enable the person skilled in the art to do; and the second step asked whether the specification enabled him to do it:Element Sixat [105]. Regardless of whether the invention pertained to a product or a process, the patent specification had to enable the invention to be performed by the person skilled in the art over the full breadth of the monopoly claimed for the purposes of the sufficiency requirement in ss 25(4) and 80(1)(c) of the Patents Act:Element Sixat [108].",
        "The law on patent infringement": "92 The concept of infringement is defined in s 66(1) of the Patents Act, which reads: Meaning of infringement 66.—(1) Subject to the provisions of this Act, a person infringes a patent for an invention if, but only if, while the patent is in force, he does any of the following things in Singapore in relation to the invention without the consent of the proprietor of the patent: … (c)where the invention is a process, he disposes of, offers to dispose of, uses or imports any product obtained directly by means of that process or keeps any such product whether for disposal or otherwise. [emphasis added] 93 Given that the defendant is the distributor of DRL’s Alleged Infringing Product (rather than its manufacturer per se), s 66(1)(c) of the Patents Act contains the relevant limb of patent infringement for the present case.",
        "Shift in the burden of proof to the defendant": "94 The prevailing law on s 68(1) of the Patents Act is trite. Generally, the burden of proof is on the plaintiff to show that the defendant has done one or more of the prohibited acts referred to in s 66(1) of the Patents Act. However, there may be a reversal of this burden of proof if s 68(1) of the Patents Act is engaged. 95 Section 68 of the Patents Act reads as follows: Reversal of burden of proof 68.—(1) In any proceedings for the infringement of a patent, where the subject-matter of the patent is a process for obtaining a new product, the burden of proving that a product is not made by the process shall be on the alleged infringer if the product is new ora substantial likelihood exists that the product is made by the process and the proprietor of the patent has been unable through reasonable efforts to determine the process actually used. (2) In considering whether a party has discharged the burden imposed upon him by this section, the court shall not require him to disclose any manufacturing or commercial secret if it appears to the court that it would be unreasonable to do so. [emphasis added] 96 The test is therefore summarised as follows: (a) If the patent concerns a new product, then the burden of proving that the product is not made by the process shall be on the alleged infringer. (b) If the patent does not concern a new product, the following must be shown: (i) a substantial likelihood exists that the product is made by the process; and (ii) the proprietor of the patent has been unable through reasonable efforts to determine the process actually used. 97  According to the High Court inMerck & Co Inc v Pharmaforte Singapore Pte Ltd[1999] 3 SLR(R) 1072 (“Merck”) (at [55]–[57]), “new product” includes anything not known in the state of the art, including improvements. Bortezomib is known in the state of the art. The plaintiffs in the present case therefore rely on the second limb of the test in s 68 of the Patents Act (see [96(b)]).",
        "The parties’ cases": "98 I move to the parties’ cases in these proceedings. 99 It bears mention that there are several factual and legal areas which parties are broadly aligned on. There is no contention that the first plaintiff is the proprietor on record for the Patents and thus has standing to bring this action.115Foot Note 115×DCS at para 79.It is not in dispute that the defendant had indeed imported the Alleged Infringing Product into Singapore and supplied the Alleged Infringing Product to public hospitals pursuant to the tender awarded (ie, GPOR 17519).116Foot Note 116×DCS at para 121 (para 110). The defendant appears to have misnumbered the paragraphs in their submissions. I therefore refer to the paragraph number that it ought to be at as well as the paragraph number as printed in the DCS for completeness.",
        "The plaintiffs’ case": "100 The plaintiffs allege that DRL’s manufacturing process for the Alleged Infringing Product (ie, a generic version of bortezomib) has infringed the asserted claims of the Patents, which set out the manufacturing process for bortezomib. The defendant tendered a bid for GPOR 17519 with the Alleged Infringing Product and fulfilled the bid it was awarded by supplying the Alleged Infringing Product to the relevant public hospitals. Thus, the defendant has infringed the Patents, pursuant to s 66(1)(c) of the Patents Act, byinter alia, disposing of, offering to dispose of and importing the Alleged Infringing Product that was obtained directly by means of the process protected by the Patents.117Foot Note 117×SOC at paras 14A–14B: pp 9–10. 101 The key arguments underpinning the plaintiffs’ position are as follows: (a) The second plaintiff has standing in the present action for patent infringement. It is the exclusive distributor of the Product in Singapore. By virtue of s 2 of the Patents Act, which “allows an exclusive right to be given ‘in respect of any right in respect of the invention’”,118Foot Note 118×PCS at para 60.the plaintiffs argue that such right should also include an exclusive distribution right, and therefore, as an exclusive distributor, the second plaintiff haslocus standiin the present proceedings. (b) The manufacturing process adopted by DRL infringes the asserted claims in the Patents. Pursuant to s 66(1)(c) of the Patents Act, the defendant has infringed the Patents. (i) For SG 322, the plaintiffs allege that they have shown that there has been a reversal of the burden of proof such that the defendant now bears the burden of showing that DRL’s process is not using the taught process. The plaintiffs contend that there is a substantial likelihood that the intermediate boronic ester compound within the manufacturing process undertaken by DRL is made by the patented process in SG 322 and they have undertaken reasonable efforts to determine DRL’s process. Thus, the burden of proof shifts from the plaintiffs to the defendant under s 68(1) of the Patents Act. The defendant has not discharged its evidentiary burden in showing that the intermediate compound was not made by the process taught in SG 322.119Foot Note 119×PCS at para 76. (ii) For SG 29P, the plaintiffs contend that the process taught in the asserted claims of SG 29P “falls on all fours” with the corresponding part of DRL’s process.120Foot Note 120×PCS at para 134.Further, the plaintiffs argue that claim 1 of SG 29P is not restricted to large-scale processes (contrary to what the defendant asserts) because there is no wording in the claim itself to suggest that the process taught is subject to such a restriction.121Foot Note 121×PCS at para 141(a). (A) The specification of the patent does not support the defendant’s position that the ambit of SG 29P is limited to large-scale processes only.122Foot Note 122×PCS at para 141(b). (B) In any case, the plaintiffs’ expert, Prof Chiba Shunsuke (“Prof Chiba”), has shown that a process which can be performed on a large-scale can be applied to synthesise lower amounts of the same end-product. However, the inverse – translating a small-scale process to a large-scale one – does not hold with the same level of ease.123Foot Note 123×PCS at para 141(c). (C) In particular, the last part of the schematic representation of DRL’s manufacturing process, where the compounds referred to as “BZM-4” and “BZM-8” are coupled to synthesise the compound referred to as “BZM-9” and the final product (ie, bortezomib) is exactly the same as the process disclosed in the asserted claims of SG 29P.124Foot Note 124×PCS at para 135. (c) The Patents are valid and subsisting at all material times. (i) In SG 322, the core inventive concept is “the use of an ether solvent of low miscibility with water in the contacting step at particular proportions”.125Foot Note 125×PCS at para 111.This is novel and inventive. (A) The defendant’s submission that the use of Lewis acid to promote the rearrangement of the boron “ate” complex,ie, the Matteson homologation reaction is known in International Publication No. WO 96/13266 (“WO 266”), US Patent No. 5,780,454 (“US 454”) and US Patent No. 4,525,309 (“US 309”) is misconceived. The teaching of SG 322 seeks toimprovethe Matteson homologation process “for the large-scale production of boronic ester and acid compounds”.126Foot Note 126×1AB at p 13. (B) Furthermore, an application of the test inWindsurfingshows that “the differences between the inventive concept of SG 322 and US 309 as well as the common general knowledge of the material time would not be obvious to the person skilled in the art”.127Foot Note 127×PCS at paras 119. (ii) In SG 29P, the core inventive concept is “the convergent coupling of [two compounds] to produce [another compound], which is deprotected to form [bortezomib]”.128Foot Note 128×PCS at para 165. (A) In response to the defendant’s argument that the removal of “large-scale” from claim 1 of SG 29P results in added subject matter, the plaintiffs contend that the patent description for SG 29P contains several statements and examples which show that the process taught in SG 29P can be carried out regardless of scale.129Foot Note 129×PCS at paras 142–143. (B) The defendant also challenged the validity of SG 29P regarding added subject matter – the patent description discloses a six-step process, but claim 1 of SG 29P discloses a process with only the last two steps of the six-step process. The plaintiffs’ response is that SG 29P, whether as originally filed or later after grant, has always only referred to those two steps. Even the parent of SG 29P, the 763 Patent, had only contained the two steps. The parent is typically the first non-provisional patent application submitted for a new invention. Thus, it is wrong of the defendant to allege that the steps had been removed in SG 29P. Additionally, Mr Lim Teck Yeow (“Mr Lim”) testified that there was sufficient support in the patent description filed for claim 1 of SG 29P which shows the two steps being disclosed independent of any preceding steps.130Foot Note 130×PCS at paras 144–158. 102 Therefore, the following remedies are sought in the present suit:131Foot Note 131×SOC at para 15: SDB at p 11; PCS at para 4(5). (a) For the first plaintiff: (i) A declaration that the act(s) authorised by the registration of the Alleged Infringing Product infringes the Patents. (ii) An injunction to restrain the defendant from infringing the Patents. (b) For the plaintiffs: (i) An order for the delivery up or destruction upon oath of all infringing articles or any article in which that Alleged Infringing Product is inextricably comprised, in the defendant’s possession, power, custody or control. (ii) An inquiry as to damages or alternatively, at the plaintiffs’ option, an account of profits and an order for payment of all sums due, with interest.",
        "The defendant’s case": "103 The defendant denies all allegations of its infringement of the Patents. It raises the following arguments against the plaintiffs’ case: (a) The second plaintiff does not have standing in the present proceedings.132Foot Note 132×DCS at para 117 (or 106).Section 74 of the Patents Act enables the holder of an exclusive licence under a patent to have the same rights as a proprietor of a patent to bring proceedings in respect of an infringement. Section 75 of the Patents Act sets out certain limitations to the exclusive licensee’s right to recover damages and other financial relief if the exclusive licence is not registered.133Foot Note 133×DCS at paras 88–89.The defendant submits that the second plaintiff was not an exclusive licensee, and did not register any document establishing that relationship.134Foot Note 134×DCS at paras 110–115.It relies on the concessions made by the second plaintiff’s Ms Ho King Siew (“Ms Ho”) and emphasises the absence of any documentation evidencing its status as an exclusive licensee.135Foot Note 135×Ibid.Given that the second plaintiff was not an exclusive licensee, its claims must be dismissed with costs.136Foot Note 136×DCS at para 117 (para 106). (b) The Patents are not valid and/or are not infringed by DRL’s manufacturing process of the generic version of bortezomib,ie, the Alleged Infringing Product. (i) For SG 332, there is no infringement because it teaches the use of an ether solvent having low miscibility with water. The defendant argues that it has shown that DRL’s manufacturing process utilises THF, which is a water-miscible ether solvent.137Foot Note 137×DCS at paras 31 and 35.The defendant points to its willingness to have the plaintiffs visit the manufacturing facilities used by DRL to verify its position, and emphasises that the plaintiffs declined to take up this offer.138Foot Note 138×DCS at para 36.Further, the defendant counter-claims for the revocation of claims 1, 9–14, 20, 25, 26, 28, 30–35, 38, 41–44, 48 and 52 because their basis is neither novel nor inventive.139Foot Note 139×DCS at para 37.Claims 12–20 of SG 322 should be revoked because of a manifest and evident error in these claims.140Foot Note 140×DCS at para 38. (ii) For SG 29P, there is no infringement because DRL’s manufacturing process is not a large-scale process. It is therefore not covered by the claims in SG 29P.141Foot Note 141×DCS at para 39.The defendant counter-claims for the revocation of SG 29P in its entirety because the convergent synthesis process in the context of manufacturing bortezomib (ie, the main process which is the subject of SG 29P) is neither new nor inventive.142Foot Note 142×DCC at paras 10–14: SDB at pp 84–86.Another basis for the revocation of SG 29P is that the claims as granted in SG 29P contain added subject matter over the claims as filed.143Foot Note 143×DCC at para 14A: SDB at p 86.The final ground relied on for the revocation of SG 29P is that claim 1 is unsupported by the description of the invention.144Foot Note 144×DCS at para 40(c). 104 In the Primer, the defendant states its reliance on the following 15 documents as prior art in challenging the validity of the Patents: (a) Donald S. Matteson and Debesh Majumdar, “a-Chloro Boronic Esters from Homologation of Boronic Esters”, Journal of the American Chemical Society (1980) Vol 102, pp 7588-7590 (“Matteson and Majumdar”); (b) Donald S. Matteson and Rabul Ray, “Directed Chiral Synthesis with Pinanediol Boronic Esters”, Journal of the American Chemical Society (1980) Vol 102, pp 7590-7591 (“Matteson and Ray”); (c) Donald S. Matterson et. al., “Boronic Ester Homologation with 99% Chiral Selectivity and Its Use in Syntheses of the Insect Pheromones (3S,4S)-4-Methyl-3-heptanol and exo-Brevicomin”, Journal of the American Chemical Society (1983) 105, pp 2077-2078 (“Matteson 1983”); (d) US Patent No. 4,537,773 dated 27 August 1985 (“US 773”); (e) US Patent No. 4,845,079 dated 4 July 1989 (“US 079”); (f) WO 266, filed with application number PCT/US95/14117, dated 9 May 1996; (g) US 454 dated 14 July 1998 (see [5] above); (h) Laurence Carmes et. al., “Homologation of Boronic Esters with (Dialkoxymethyl)lithiums. Asymmetric Synthesis of a-Alkoxy Boronic Esters”, Journal of Organic Chemistry (2000), Vol 65, pp 5403-5408 (“Carmes”); (i)  US 309 dated 25 June 1985 (see [101(c)(i)(A)] above); (j) Sara Wu et. al., “Degradation Pathways of a Peptide Boronic Acid Derivative, 2-Pyz-(CO)-Phe-Leu-B(OH)2”, Journal of Pharmaceutical Science (2000), Vol. 89, Issue 6, pp 758-765 (“Wu”); (k) WO 03/033506, filed as PCT/JP02/10450, dated 24 April 2003 (“WO 506”); (l) WO 03/033507, filed as PCT/JP02/10451, dated 24 April 2003 (“WO 507”); (m) US Package Insert for Velcade, Bortezomib for Injection; (n) Announcement of commercialisation and development between Millenium Pharmaceuticals and Ortho Biotech; and (o) Center for Drug Evaluation & Research, US Chemistry Review Application No. 21-602. 105 As the defendant does not ultimately employ all of the materials listed at [104] above in its arguments against the validity of the Patents, I will address only the materials on which the defendant has structured its objections for the validity of the Patents.",
        "Evidence at the trial": "106 At the trial, the plaintiffs led evidence from the following witnesses: (a) Prof Chiba is the expert witness appointed by the plaintiffs for this suit for his expertise in pharmaceutical chemistry. He is a tenured Professor of Chemistry in the Division of Chemistry and Biological Chemistry, School of Physical and Mathematical Sciences, of the Nanyang Technological University and obtained a PhD from the Department of Chemistry in the University of Tokyo in 2006.145Foot Note 145×Dr Chiba’s First Expert Report at Appendix A.Dr Chiba has expertise in synthetic organic chemistry and catalysis, and has published over 100 peer-reviewed papers.146Foot Note 146×Dr Chiba’s First Expert Report at paras 9 – 10.He provided the following affidavits of evidence-in-chief (“AEIC”): (i) AEIC of Prof Chiba dated 13 August 2021 (“Prof Chiba’s 1st AEIC”) containing his expert witness report dated 13 August 2021 (“Prof Chiba’s Expert Report”);(ii) AEIC of Prof Chiba dated 13 September 2021 (“Prof Chiba’s 2nd AEIC”) containing his expert witness report dated 13 September 2021 (“Prof Chiba’s Second Expert Report”) which addresses Dr Johannes’ Response (see [107(a)(ii)] below);(iii) AEIC of Prof Chiba dated 7 October 2021 (“Prof Chiba’s 3rd AEIC”) containing his supplementary expert report dated 7 October 2021 (“Prof Chiba’s Supplementary Expert Report”); and(iv) AEIC of Prof Chiba dated 19 October 2021 (“Prof Chiba’s 4th AEIC”) containing his second supplementary expert report dated 19 October 2021 (“Prof Chiba’s Second Supplementary Expert Report”). (b) Ms Ho King Siew is the legal director of the second plaintiff. Her AEIC is dated 9 September 2021 (“Ms Ho’s AEIC”). (c) Mr Lim Teck Yeow is the plaintiffs’ expert witness on issues of intellectual property law, with an established practice in patent prosecution specifically. He filed an AEIC dated 11 October 2021 (“Mr Lim’s AEIC”). 107 The defendant led evidence from the following witnesses: (a) Dr Charles William Johannes (“Dr Johannes”) is the defendant’s expert witness on pharmaceutical chemistry. He is the Vice President of the Exploratory Chemistry department at FOG Pharmaceuticals, Inc and holds a PhD in Organic Chemistry from Boston College in 1998.147Foot Note 147×Dr Johannes’ First Expert Report at para 17.Prior to his present appointment, Dr Johannes was Head of Organic Chemistry at the Institute of Chemical and Engineering Sciences in A*STAR.148Foot Note 148×Dr Johannes’ First Expert Report at para 19.Dr Johannes is familiar with product compounds related to bortezomib such as epoxocin and eponemycin and was named an inventor in a patent teaching their preparation.149Foot Note 149×Dr Johannes’ First Expert Report at para 20.The following AEICs were filed: (i) AEIC of Dr Johannes dated 9 September 2021 (“Dr Johannes’ 1st AEIC”) containing his expert opinion dated 15 August 2021 (“Dr Johannes’ Expert Report”); and (ii) AEIC of Dr Johannes dated 14 September 2021 (“Dr Johannes’ 2nd AEIC”) containing his reply to Prof Chiba’s Expert Report (“Dr Johannes’ Second Expert Report”). (b) Ms Julia binte Johari (“Ms Johari”) is a partner of the defendant. She is in charge of the defendant’s regulatory matters in Singapore and Malaysia, including filling and obtaining approval for registrations of the pharmaceutical and health products that the defendant distributes. Ms Johari’s AEIC dated 16 August 2021 (“Ms Johari’s AEIC”) contains her averments that she had checked for the HSA registrations of bortezomib in Singapore. (c) Mr Mohamed Tahir (“Mr Tahir”) is the managing partner of the defendant. He is in charge of business development, sales, tenders, liaison with suppliers, principals and customers. Mr Tahir’s AEIC dated 16 August 2021 (“Mr Tahir’s AEIC”) details,inter alia, the process through which the Alleged Infringing Product came to be registered in Singapore and the checks conducted by the defendant prior to its registration. (d) Mr Manda Amarendhar (“Mr Amarendhar”) is the lead “QbD” (or “Quality by Design”) in DRL. He is a chemist by training and was part of the research and development team in DRL that developed the process for manufacturing the Alleged Infringing Product. Mr Amarendhar’s AEIC dated 16 August 2021 contains his evidence on how the Alleged Infringing Product is produced and manufactured by DRL. (e) Mr Sunil Kumar Mishra (“Mr Mishra”) is an intellectual property management specialist in DRL. He is a chemist by training and is a registered patent agent in India. Mr Mishra is in charge of patent related activities in DRL, such as patent filing and prosecution. 108 The parties agreed to the appointment of a court assessor, Professor Paul Sharratt (“Prof Sharatt”), to assist the court in its review of the technical evidence. This is provided for under s 10A(1) of the Supreme Court Judicature Act (Cap 322) and O 33 r 4 of the ROC, where the court may appoint one or more assessor to assist the court in dealing with a matter in which the assessor has skill and experience within a trial. Prof Sharratt is a Professor at the Singapore Institute of Technology and holds a PhD in Reaction Engineering from the University of Manchester Institute of Science and Technology. He has worked in areas related to chemical and pharmaceutical process development. 109 In our jurisprudence, there has not been any pronouncement on the role of the court assessor in cases featuring intellectual property disputes. I found Heerey J’s statements on the role of a court assessor inGenetic Institute Inc v Kirin-Amgen Inc (No 2)(1997) 149 ALR 247 at 250 useful: There is no question of an assessor giving any judgment or making any order (even by consent) or otherwise exercising any judicial functions. An assessor is to assist the judge, both in hearing and trial and/or in determination of any proceeding. The judgment in the case, the exercise of the judicial power, remains that of the judge. In exercising judicial power, a judge is routinely assisted by persons who are not judges: counsel, solicitors, witnesses, the judge's associate and secretary and other court staff. As parties have not put this in issue, I will not say anything further on this save that the role of the court assessor in the present suit is limited to assisting the court in understanding and analysing the technical aspects of the parties’ cases. Ultimately, the court bears the responsibility of arriving at a reasoned outcome on the application of the law as it stands to the facts of the case.",
        "Further submissions after the trial": "110 Following the decision of the Court of Appeal inElement Six, I asked parties to provide their further submissions on the issue of sufficiency, the requisite technical background to the present matter in a technical primer (ie, the Primer) and a summary of their positions on the asserted claims in the Patentsvis-à-visvalidity and infringement. These further submissions and materials, which were confined to evidence already led in the trial, were placed before the court on 5 May 2023.",
        "Issues to be determined": "111 I distil the issues for determination as follows: (a) Whether the second plaintiff has standing to commence the present proceedings against the defendant. (b) Whether the Patents (ie, SG 322 and SG 29P) are valid patents. (c) Whether the Patents (ie, SG 322 and SG 29P) have been infringed by the defendant’s registered use of the Alleged Infringing Product pursuant to reg 24(1) of the HPTPR. Alternatively, whether the defendant’s participation in the tender for the supply of bortezomib to public hospitals in Singapore from March to November 2020 (ie, GPOR 17519) and the defendant’s award of the tender to supply 2,183 vials of bortezomib under GPOR 17519 constitute acts infringing the asserted claims in the Patents. 112 The issue in [111(c)] is assessed in respect of whether the Patents have been infringed by DRL’s manufacturing process of the Alleged Infringing Product. 113 For the issue of patent validity, the following sub-issues will be addressed: (a) Whether the invention is patentable. In the present case, the following two requirements are pertinent: (i) The invention must be new. (ii) The invention must involve an inventive step. (b) In respect of SG 322, whether the patent specification discloses the invention in a manner which is clear and complete for the invention to be performed by a person skilled in the art. 114 For the issue of patent infringement, I will also consider whether the plaintiff has successfully invoked s 68 of the Patents Act to reverse the burden of proof.",
        "My decision": "",
        "Whether the second plaintiff has standing in the present suit": "115 I first address the preliminary question of whether the second plaintiff has standing in the present suit (see [59]–[61] above). I answer this question in the negative. 116 The second plaintiff claims to have standing on the basis that it is an exclusive licensee (pursuant to s 74(1) of the Patents Act). The crux of the second plaintiff’s case is that it is an exclusive distributor of the Product in Singapore and that an exclusive distributor falls within the statutory definition of an “exclusive licensee” in s 2(1) of the Patents Act. In particular, s 2(1) of the Patents Act states that an exclusive licence means “a licence from the proprietor of … a patent conferring on the licensee …any right in respect of the invention to which the patent … relates…” [emphasis added]. The second plaintiff submits that such a right also encompasses the right of distribution of a product protected by a process patent.150Foot Note 150×PCS at paras 13–16.In short, the second plaintiff seeks a broad interpretation of the statutory term “exclusive licensee” and contends that the issue turns on a question of law rather than fact. 117 Conversely, the defendant argues that the plaintiffs have not adduced evidence to show that the second plaintiff is the exclusive licence holder of the Patents. In particular, the plaintiffs’ Ms Ho testified unambiguously under cross-examination that the second plaintiff is not the exclusive licensee of the Patents.151Foot Note 151×Transcript (20 October 2021) at pp 89–93.The defendant also points to s 41(4) of the Patents Act, which provides that a licence may be granted under a patent “forworkingthe invention which is the subject of the patent or the application”. 118 In my judgment, the second plaintiff does not have standing in the present suit. In coming to this decision, it is not necessary for me to decide on the issue of whether an exclusive distributor of a patent falls within the meaning of a statutory exclusive licensee in s 2(1) of the Patents Act. Rather, the plaintiff’s case on standing fails on the facts. 119 There is simply no evidence before me to show me the scope of the second plaintiff’s rights in Singapore. The second plaintiff alleges that it holds an exclusive right to distribute the product produced by the first plaintiff’s patented process under an exclusive licence conferred upon Janssen Products LP (“Janssen”) by the first plaintiff. It is alleged that Janssen is the second plaintiff’s affiliate company.152Foot Note 152×PCS at para 3.Early on in the proceedings, in the second plaintiff’s Statement of Claim dated 26 August 2020, the second plaintiff had pleaded that it “is and was at all the material times the exclusive licensee of the [first plaintiff] in respect of the [P]atents and the distribution of bortezomib in Singapore.153Foot Note 153×SOC at para 5A.Similarly, in Ms Ho’s Affidavit of Evidence-in-Chief, she states that the “[second plaintiff] is … the distributor / supplier of the brand-name bortezomib, Velcade, and is presently the only distributor of bortezomib in Singapore”.154Foot Note 154×Ms Ho’s AEIC at para 11.In the Defence dated 7 July 2021, the defendant put the plaintiffs to strict proof that the second plaintiff was, indeed, an exclusive licensee. However, the plaintiffs have not even produced the agreement between Janssen and the first plaintiff governing the alleged exclusive license (with the alleged right to sub-license), much less the second plaintiff’s distributorship agreement(s) with Janssen to discharge their burden of proving the assertion. This is so, notwithstanding the clear relevance of the distributorship agreement(s) in the Court’s assessment of whether the second plaintiff was an exclusive licensee. Therefore, even if I accept the plaintiffs’ interpretation of s 2(1) of the Patents Act,ie, that an exclusive distributor constitutes a statutory exclusive licensee, there is no evidence to prove the nature and content of the rights that Janssen allegedly holds in respect of the Patents (and therefore the rights it is capable of granting in relation to the Patent). This in itself is fatal. Moreover, the plaintiffs have not produced any documentary evidence that the second plaintiff dealtexclusivelywith the inventions to which the Patents relate. 120 Grasping at straws, the second plaintiff’s Ms Ho could only refer to a result from the HSA Information Search of the product “VELCADE 3.5mg FOR INJECTION”.155Foot Note 155×Ms Ho’s AEIC at p 128.However, the information provided by the search result is sparse. It merely states that the second plaintiff is a “Registrant” of this product, with an “Approval Date” on 15 March 2005 and that its status remains “Active”. In effect, it only shows that the second plaintiff is a distributor of the product. However, it does not reveal what rights of distributorship are attributed to the second plaintiff, and much less whether these rights would confer the second plaintiff legal standing as an exclusive licensee. This does not advance the second plaintiff’s case on its standing. 121 Further, it is significant that Ms Ho agreed that the omission to produce any documentary evidence meant that the second plaintiff was not an exclusive licensee of the first plaintiff. Although it is ultimately a question of fact whether the entity is an exclusive licensee, the answers given by Ms Ho in cross-examination buttress my conclusion. At the trial, Ms Ho responded in the following manner:156Foot Note 156×Transcript (20 October 2021) at p 91 ln 8–17. Q: On that basis, I will restate my proposition. There is no documentary evidence to show that Johnson & Johnson Pte Ltd is the exclusive licensee. A: Correct. Q: In the absence of such evidence, I would suggest to you that Johnson & Johnson Pte Ltd is, in fact, not the exclusive licensee as asserted? A: You are right. Q: It is not the exclusive licensee, yes? A: You are right. Following that line of questioning, I queried about the reason for which the second plaintiff was joined in the present suit; Ms Ho answered that “it was purely on the basis that [their] business was impacted”.157Foot Note 157×Transcript (20 October 2021) at p 131 ln 4–9.This is plainly insufficient to show that the second plaintiff was an exclusive licensee. 122 More significantly, the court is not to award damages to an exclusive licensee or order that it be given an account of profits if the licence is not registered within the period of six months beginning with its date unless the court is satisfied that it was not practicable to register the transaction, instrument or event before the end of that period and that it was registered as soon as practicable thereafter: s 75 of the Patents Act. The plaintiffs therefore face yet another hurdle in their position as the second plaintiff has not been registered as an exclusive licensee. Here, the issue of damages accruing to the second plaintiff does not arise because their claims are dismissed for the reasons I set out below (see [204]–[219] and [288]). Even if the plaintiffs were successful in their claims, the second plaintiff cannot be awarded damages or granted an order for an account of profits for the alleged infringement of the Patents as the exclusive licence they assert was not registered.",
        "Whether SG 322 is valid": "Preliminary findings (1) Person skilled in the art 123 I begin by identifying the reasonable person skilled in the art (“person skilled in the art”) to whom the Patents are addressed (ie, the notional person through whose eyes the claims in the Patents should be construed). The relevant legal principles have been set out above (see [67]–[68]). 124 The plaintiffs submit that the person skilled in the art is one who would be aware of the state of the art in process chemistry and, in particular, the synthesis of organic compounds. The skilled person would hold a graduate degree in chemistry (either a Masters of Science or a Doctor of Philosophy (“PhD”)) and at least five years of experience in organic synthesis in an academic laboratory.158Foot Note 158×Prof Chiba’s First Expert Report at para 23; Primer at p 6.The defendant posits that the person skilled in the art would be a person who is theoretically and technically competent in the design and development of synthetic procedures for the synthesis and production of drug compounds with a PhD degree in synthetic organic chemistry and having at least five years of laboratory experience in synthesis of organic compounds or a person who has a Bachelor’s or Master’s degree in synthetic organic chemistry with at least 10 years of laboratory experience in synthesis of organic compounds. Although there are some differences between the identity of the notional person skilled in the art put forth by the parties, the core qualities of the person skilled in the art include knowledge of process chemistry (in particular, in the synthesis of organic compounds) and at least five years of laboratory experience and a graduate degree in the field.159Foot Note 159×Parties’ List of Issues at p 1.It suffices to proceed on this basis. 125 In this connection, I observe that parties have not made any challenge as to the lack of qualifications or partiality against the other party’s expert and the court assessor, Prof Sharratt. The more crucial point is that the parties diverge on the common general knowledge purportedly held by the person skilled in the art. I address this in the next section. (2) Common general knowledge 126 I have set out the definition of common general knowledge (see [68] above). There is some consensus between the parties as to what constitutes the common general knowledge purportedly held by the person skilled in the art. According to the parties, the common general knowledge would include first-hand experience in the performance of literature search, the planning and execution of multistep synthetic reaction sequences, the purification and characterisation of products in a laboratory setting, as well as knowledge of the issues involved in the synthesis of products at a medium-to-large scale.160Foot Note 160×Primer at p 6.The notional person skilled in the art (see [67] above) would also be aware of the literature in standard textbooks relating to organic chemistry.161Foot Note 161×Primer at p 6.Parties’ experts agree that the person skilled in the art would have the necessary common general knowledge of synthesising bortezomib and related organic compounds.162Foot Note 162×AEIC of Dr Johannes’ First Expert Report at para 23 and Prof Chiba’s Reply Report at para 4. 127 Where the parties are not in agreement on whether the material forms part of the common general knowledge, the following summarises the parties’ positions on what it considers form part of common general knowledge: (a) The defendant claims the following to form part of the common general knowledge: (i) The use of zinc chloride as a Lewis acid, often under anhydrous conditions.163Foot Note 163×AEIC of Dr Johannes’ First Expert Report at paras 88 and 94. (ii) The conduct of experiments relating to organometallic compounds (which are highly reactive) at cold temperature (-100 to -78C) and to then warm the reaction up to various warmer temperature ranges to ensure selectivity (enantiomeric or diastereoselective) and/or control exothermic reactions.164Foot Note 164×AEIC of Dr Johannes’ First Expert Report at para 112. (b) The plaintiffs claim the following forms part of the common general knowledge: (i) The issues relating to scalability.165Foot Note 165×Prof Chiba’s Reply Expert Report at para 4. (ii) The particular issues involved in the synthesis of products at a medium-to-large scale.166Foot Note 166×Prof Chiba’s First Expert Report at paras 23–24; Prof Chiba’s Reply Expert Report at para 4. (iii) Epimerisation is caused by even trace quantities of water as well as excess zinc chloride.167Foot Note 167×PCS at para 119(b). 128 At this juncture, I pause to make the observation that parties’ cases on common general knowledge appear to be inconsistent. The common general knowledge outlined by Prof Chiba in his reports has been broadly stated with only a few specific areas falling within its specified scope. However, the plaintiffs’ position on common general knowledge in the Primer includes all the literature and prior filed patents relied on by the defendant to dispute the validity of the Patents.168Foot Note 168×Primer at pp 6 to 9.Yet in the Primer the plaintiffs also take the view that the literature and prior patents relied on by the defendant to dispute validity do not form part of the state of the art in the novelty inquiry and the obviousness inquiry. 129 In my judgment, the position taken by the plaintiffs is untenable. The plaintiffs acknowledge that the materials form part of the common general knowledge, but contend that they do not form part of the state of the art in the novelty inquiry and the obviousness inquiry. Their position sits uncomfortably because the state of the art has a broad reach, extending to any information that has been publicly disclosed (see [73] above). The defendant has similarly adopted a broad position in its expert reports by Dr Johannes, and only takes a more granular approach to the matters forming part of common general knowledge in the Primer. 130 For the present purposes of setting out the relevant common general knowledge, I default to the broad definitions of common general knowledge provided by the parties’ experts at [126] above. This includes also the specific literature and prior patents listed in the Primer at [24]–[58] and [104] above. On this basis, it is not meaningful for the plaintiffs’ expert to contend that the literature and prior patents listed in the Primer form part of common general knowledge but do not fall within the state of the art for the novelty inquiry and the obviousness inquiry. Salient features of SG 322 131 SG 322 relates to the method of making a boronic acid ester of compound Formula (I) and its use in the preparation of bortezomib. It seeks to overcome and solve the known problem of epimerisation (see [45]–[46] above). SG 322 teaches the use of an ether solvent that has low miscibility with water, such as methyl tert-butyl ether (ie, MTBE). Miscibility is the property of two substances to mix in all proportions (that is, to fully dissolve in each other at any concentration), forming a homogeneous mixture (a solution). The plaintiffs are asserting claims 1–7, 9–17, 20–26, 28, 30–35, 38, 41–46, 48 and 52 of SG 322 as being infringed.169Foot Note 169×Dr Johannes’ First Expert Report at paras 66–69. 132 The diagram below depicts the improved Matteson homologation process taught under SG 322 (see [133]).170Foot Note 170×Prof Chiba’s First Expert Report at para 37.Based on the teaching of SG 322, the first plaintiff performs the first step of the reaction (formation of “ate” complex I) in a coordinating ether solvent that has low miscibility with water (ie, MTBE). This solvent, when compared by volume, is the major constituent of the reaction mixture (at least 70% volume per volume (“v/v”)); and the water miscible ether solvent is either completely eliminated or used in a low volume (less than 20% v/v). This ensures that the first intermediate (ie, the boron “ate” complex) remained in the organic layer that had a majority of an ether solvent with low miscibility with water.171Foot Note 171×Prof Chiba’s First Expert Report at para 37. 133 Subsequently, at the second step involving the addition of the Lewis acid catalyst (ie, zinc chloride), the molecular re-arrangement occurs in the MTBE layer and the by-product lithium chloride is unable to significantly ionise (owing to the absence of water). Although THF is used as a solvent for zinc chloride to transfer it to the reaction mixture during the second step (also the contacting step), the use of MTBE in the first step as constituting the majority of the reaction mixture renders the amount of THF introduced in the second step incapable of effecting significant epimerisation. This reduces, or eliminates entirely, the epimerisation.172Foot Note 172×Prof Chiba’s First Expert Report at paras 37–38.  Figure 6: Diagrammatic representation of the improved Matteson homologation process Patent specification of SG 322 134 Paragraph [001] of SG 322’s specification states that the “invention relates to the synthesis of boronic ester and acid compounds”.173Foot Note 173×ABOD Vol 1 at p 12.In particular, it states that the invention relates to “large-scale synthetic processes for the preparation of boronic ester and acid compounds by Lewis acid promoted rearrangement of boron “ate” complexes”. 135 As part of the “Background of the Invention”, paragraph [007] states that US 309 describes an improved procedure for the homologation of boronic esters by rearrangement of the intermediate boron “ate” complex in the presence of a Lewis acid catalyst. Paragraph [007] describes US 309 as reporting the use of the Lewis acid to promote the rearrangement reaction and to minimise epimerisation at the alpha-carbon atom. It is also noted that US 309 recorded that “[r]igorous exclusion of water and careful control of Lewis acid stoichiometry are required for optimum results”. However, SG 322 claims that “[t]hese features [in US 309] render the reaction difficult to perform successfully on a production scale”, and limit the availability of pharmaceutically important boronic ester and acid compounds, such as bortezomib. There was consequently “a need in the art for improved methods for the large-scale production of boronic ester and acid compounds”. 136 Paragraph [008] states that the invention provides “improved synthetic processes for the large-scale production of boronic ester and acid compounds”, which “offer increased yield and purity, increased throughput, and greater ease of handling as compared to prior art methods”. Specifically, regardless of the scale of production, the products (such as chiral boronic ester and acid compounds including alpha-aminoboronic ester and acid compounds) are produced with “very high chemical and stereochemical purity”. 137 Paragraph [025] describes the core inventive concept of SG 322 – that “the requirement for scrupulously dry equipment, solvents, and reagents that characterized previously described procedures for the Lewis acid promoted rearrangement of boron “ate” complexes can be obviated by use of anether solvent that has low miscibility with water”. [emphasis added] By contrast, as paragraph [028] states, previously reported processes for Lewis acid-promoted rearrangement of boron “ate” complexes employed THF, which is an ether solvent that is fully miscible with water – the limitation was therefore that a “failure to employ rigorously dried equipment, solvents and reagents … results in a dramatic reduction in the diastereomeric ratio” and rendered it costly and difficult to scale. Thus, as paragraph [029] outlines, SG 322 seeks to resolve the epimerisation at the alpha-carbon centre from the exposure of alpha-haloboronic ester products to free halide ion (as reported in Matteson and Erdik). As epimerisation is thought to occur during concentration of the reaction mixture, SG 322 “remove[s] the [THF] and exchange[s] it for a water-immiscible solvent” per paragraph [029]. 138 The specific requirements of the ether solvent (see [137] above) are as follows: (a) Preferably, the solubility of water in the ether solvent is less than about 5% w/w, and more preferably less than about 2% w/w. In various embodiments, ether solvent that has low miscibility with water constitutes at least about 70%, 80%, 85%, 90%, or 95% v/v of the reaction mixture (paragraph [030]). (b) The ether solvent preferably is one that is suitable for routine use in large-scale production. The term “large-scale” refers to a reaction that utilises at least about five moles of at least one starting material. Preferably, a large-scale process utilises at least about 10, 20, 50, or 100 moles of at least one starting material (paragraph [031]). (c) For purposes of the invention, the term “ether” refers to any of a class of chemical compounds characterised in having an oxygen atom attached to two carbon atoms. An “ether solvent” is an ether compound that exists in liquid form at the desired reaction temperature and is capable of dissolving the starting material(s) and/ or product(s) of the reaction. Non-limiting examples of ether solvents suitable for use in the process of the invention include MTBE (paragraph [032]). (d) In one embodiment, the reaction mixture further comprises a coordinating co-solvent or a coordinating solvent, which refers to “a solvent that is capable of coordinating the Lewis acid and solvating the ionic components of the reaction” (paragraph [033]). (e) In some embodiments, the reaction mixture comprises at least about 5% or 10% v/v of a coordinating co-solvent (paragraph [034]). Claim construction of claim 1 in SG 322 139 Claim 1 claims a process for preparing a boronic ester compound of Formula (I) comprising: (a) the provision of at least five moles of a boron “ate” complex of Formula (II); and (b) “contacting the boron “ate” complex of Formula (II) with a Lewis acid under conditions that afford the boronic ester compound of Formula (I)” (the “Contacting Step”). The crux of claim 1 is that it teaches the composition of the reaction mixture in which the Contacting Step is carried out. Claim 1(b) states that such a reaction mixture comprises: (i) a coordinating ether solvent that has low miscibility with water; or (ii) an ether solvent that has low miscibility with water and a coordinating co-solvent provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture; Wherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; and wherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture. 140 The general definition of “ether solvent” within SG 322 is set out at [138(c)] above.174Foot Note 174×Paragraph [032] of SG 322; ABOD Vol 1 at p 20.In claim 1(b)(i), the ether solvent that has low miscibility with water is sufficiently coordinating that a coordinating co-solvent is not necessary. In claim 1(b)(ii), the reaction mixture further comprises a coordinating co-solvent. A “coordinating co-solvent” or “coordinating solvent” are interchangeable terms referring to a solvent that is capable of coordinating the Lewis acid and solvating the ionic components of the reaction.175Foot Note 175×Paragraph [033] of SG 322; ABOD Vol 1 at p 20.On either one of the taught compositions of the reaction mixture, the solubility of water of the ether solvent with low miscibility with water is less than 5% w/w and the ether solvent constitutes at least 70% v/v of the reaction mixture. Novelty requirement: whether claim 1 in SG 322 is novel 141 As the defendant’s case on novelty rests on claim 1 of SG 322 (with the other asserted claims contingent on claim 1),176Foot Note 176×DCS at para 240.I deal only with the arguments and evidence raised in respect of claim 1. (1) State of the art 142 I begin first by identifying the state of the art relevant to the novelty requirement on the priority date of SG 322. 143 Parties are sharply divided on what constitutes the relevant state of the art for SG 322. The plaintiffs deny the relevance of the following materials listed below and take the position that they do not form the state of the art in relation to the large-scale manufacture of bortezomib: (a) US 309 discloses the use of a suitable solvent medium for the Matteson homologation protocol, such as THF, diethyl ether, petroleum ether “or the like”, for the preparation of the compound of Formula (I).177Foot Note 177×Dr Johannes’ Second Expert Report at para 22.US 309 was first filed on 25 June 1985, and it was available to the public before the priority date of SG 322 on 24 March 2005. The plaintiffs claim that US 309 is not relevant as the disclosure of borate complexes in US 309 does not anticipate the use of an ether solvent of low miscibility with water.178Foot Note 178×Prof Chiba’s Expert Reply Report dated 13 September 2021 at para 31.The defendant contends that US 309 forms part of the state of the art and notes that the patent itself states that it teaches an improved form of Matteson homologation.179Foot Note 179×DRS at para 54.The defendant argues that the teachings disclosed in US 309 would enable the person skilled in the art to deduce that other water-immiscible ether solvents, such as MTBE, may be used as alternative solvents in the process.180Foot Note 180×Primer at p 13.Therefore, according to the defendant, claim 1 of SG 322 would not satisfy the novelty requirement.181Foot Note 181×DRS at para 54.Conversely, the plaintiffs aver that US 309 only teaches the Matteson homologation reaction, whereas the teaching in claim 1 of SG 322 seeks toimprovethe Matteson homologation process.182Foot Note 182×1AB at p 13. (b) WO 266 dated 9 May 1996 is the international patent disclosing bortezomib (see [5] above).183Foot Note 183×Primer at p 2.The defendant uses WO 266 as evidence that all the elements in claim 1 for the synthesis of bortezomib are known. The reagents/reactants employed to make bortezomib, the reaction process (the Matteson homologation process) and the end product (ie, bortezomib) are disclosed.184Foot Note 184×DCS at para 226; Dr Johannes’ First Expert Report at parasThe plaintiffs have not addressed whether WO 266 anticipates the inventive concept of claim 1 of SG 322 in their written submissions. For completeness, I consider also the evidence led by the plaintiffs on this. In Prof Chiba’s First Expert Report, whether WO 266 anticipates claim 1 of SG 322 is also not addressed. (c) US 454 dated 14 July 1998 is the US patent disclosing bortezomib (see [5] above). It belongs to the same patent family as WO 266.185Foot Note 185×Primer at pp 2 and 34.The arguments made by the defendant in respect of US 454 are the same as WO 266 (see [(b)] above).186Foot Note 186×DCS at paras 226 and 227. 144 I disagree with the plaintiffs that the materials referred to by the defendant (see [143] above) in challenging the validity of SG 322 do not form part of the state of the art for the novelty requirement. In this connection, as I considered above at [128], the plaintiffs take an unworkable position in respect of common general knowledge and the state of the art. If it were the case that the plaintiffs have conceded that the literature and prior patents stated in the Primer formed part of the common general knowledge, it cannot be that the literature and prior patents do not form part of the prior art relevant to novelty. Given the broader parameters of what the state of the art constitutes (ie, all uses or disclosures that were made available to the public at the priority date are to be treated as relevant prior art), the materials which form part of the common general knowledge must necessarily form part of the state of the art. 145 The only argument, in substance, raised by the plaintiffs in refutation of the materials forming part of the state of the art is that they lacked relevance to the “large-scale production of bortezomib”. This is misguided. In my view, the plaintiffs’ submission is contrivedly narrow – the materials are relevant and form part of the state of the art at the priority date of SG 322 because they pertain to the manufacture of bortezomib and its analogous compounds, and the reported limitations based on the experimental processes described. This should also be seen in light of the plaintiffs’ position in the Primer that the pieces of literature form part of the common general knowledge for the novelty requirement for claims in SG 322. More crucially, SG 322’s specification itself contains reference to,inter alia, WO 266, US 454 and US 309.187Foot Note 187×ABOD Vol 1 at pp 13 and 19.Thus, the materials relied on by the defendant as forming part of the state of the art for the assessment of novelty of SG 322 (at [143] above) must be included as prior art relevant to the inquiry. 146 In any event, flowing from my analysis below at [147]–[159], while the relevant literature and prior patents form part of the state of the art relevant to the novelty inquiry for SG 322, they do not anticipate the claimed invention in the asserted claims of SG 322. (2) Whether claim 1 is anticipated by the state of the art 147 Before I proceed with my assessment of whether the prior art anticipates claim 1 of SG 322, I summarise briefly the parties’ positions on this. The plaintiffs assert that there is no prior art that discloses all of the inventive concept of SG 322.188Foot Note 188×PCS at para 112.Further, the plaintiffs submit that the novelty of SG 322 ought to be assessed with reference to the “core inventive concept” which is the use of an ether solvent of low miscibility with water, and in which water’s solubility is less than 5% w/w, at a proportion of at least 70% of the reaction mixture.189Foot Note 189×PCS at para 113.The defendant on the other hand argues that US 309, WO 266 and US 454 anticipate claim 1 of SG 322.190Foot Note 190×DCS at paras 225 and 228; Primer. 148 I proceed to examine whether any of the individual matter in the state of the art anticipated the claimed invention in claim 1 of SG 322 for the novelty requirement, before turning to the inventive step requirement. If claim 1 is found to be valid, then the rest of the asserted claims in SG 322 are valid as well. This is on the basis that the parties’ cases on the validity of SG 322 (in respect of novelty and inventive step) is that the remaining claims in SG 322 are premised on the claimed invention in claim 1, which is “the use of an ether solvent of low miscibility with water”.191Foot Note 191×PCS at paras 113–114; DCS at paras 231 and 240. (A) Claim 1 (I)WO 266 and US 454 149 The defendant submits that WO 266 discloses all the elements in claim 1 for the synthesis of bortezomib. These elements include the reagents utilised in the manufacture of bortezomib and the Matteson homologation process.192Foot Note 192×DCS at para 226.It acknowledges, however, that the use of an ether solvent with low miscibility with water in the Matteson homologation process is not taught in WO 266.193Foot Note 193×DCS at para 227.The defendant makes the same argument for US 454.194Foot Note 194×DCS at paras 226–227.The plaintiffs have not responded to this argument in their submissions. 150 In my view, however, WO 266 and US 454, which are product patents for bortezomib, did not disclose any information which would enable the person skilled in the art to derive from them individually the use of an ether solvent of low miscibility with water, or the use of an ether solvent of low miscibility with water and a coordinating solvent in the proportions taught in claim 1. Indeed, the defendant concedes that the use of an ether solvent which has low miscibility with water isnot taughtby either WO 266 or US 454. Anticipation by WO 266 and US 454 of claim 1 of SG 322 requires enabling disclosure, in that the person skilled in the art may arrive at the claimed invention in claim 1 from the information disclosed in WO 266 and US 454 individually. I therefore conclude that WO 266 and US 454 do not anticipate claim 1 of SG 322. (II)US 309 151 The defendant also relies on US 309 to show that it concerns an improved form of Matteson homologation and that it teaches that “among the solvents that have been found to be useful are included … [THF] … and the like”, which anticipates claim 1 of SG 322.195Foot Note 195×DCS at paras 228–229. 152 US 309, first filed on 25 June 1985, describes an improved procedure for the homologation of boronic esters by the rearrangement of the intermediate boron “ate” complex in the presence of a Lewis acid catalyst.196Foot Note 196×DBOD at Tab 9, p 84.US 309 discloses the use of both water miscible ether solvents such as THF and water immiscible ether solvents such as diethyl ether or petroleum ether “and the like” for the Matteson reaction.197Foot Note 197×DBOD at p 92.As part of the “Description of the Invention”, US 309 states:198Foot Note 198×DBOD at p 92. The process for preparing boronic esters, especially the α-halo boronic esters, in accordance with the present invention involves theuse of a Lewis acid catalyst in the conversion of boronate complexes of the general structure (I) toboronic esters of the general structure (II)in accordance with the following equation:  where each of the R1, R4 and R5, independently, is a substituted or unsubstituted aliphatic or aromatic group, including but not limited to, primary, secondary, tertiary alkyl groups, vinylic groups, allylic groups, benzylic groups and the like. The functional substituents, if present, may comprise any substituent that will allow the formation of (II), for example alkoxide, ether, ketal, or ester group, so long as the functional substituent does not react faster than the boronic ester group with CHX2-; in the above formula, X is a nucleofugic group (a group subject to nucleophilic displacement, such as a halide ion, and particularly chloride or bromide); R2 is H, a lower alkyl or X; R3 is X or R1 as defined above; and R4 and R5 may be the same or different and may be directly linked so that the boronic ester is cyclic. The groups R4 and R5, or the linked group R4-R5 preferably comprise a chiral group. The conversion of [compound of formula] (I) to [compound of formula] (II) may be carried out at about room temperature (about 20̊ – 30̊C in a suitable solvent medium.Among the solvents that have been found to be useful are included diethyl ether, tetrahydrofuran, petroleum ether, and the like. … [emphasis added] US 309 records a substantial improvement over the process, which is shown by the data on yields and diastereoselectivities as follows:199Foot Note 199×DBOD at p 83: US 309 at 8. TABLE 1Yields and Diastereoselectivities in Homologation of (+)-pinaediol boronic estersR1 of (IX) and (XII)Catalyst% Yield of (XII)% DiasteroselectivityAnalysis……………(CH3)2CHCH2ZnCl28999.5B……………CbH5CH2ZnCl29999.5B 153 The defendant submits that the phrase “and the like” in US 309 teaches that similar kinds of ether solvents can be used.200Foot Note 200×Primer at p 13.It contends that there is no doubt that THF and MTBE are substitutable solvents and Dr Johannes avers that the person skilled in the art would consider other solvents that are suitable candidates that can be used in the synthesis of bortezomib.201Foot Note 201×DCS at para 233.Further, there was enabling disclosure of diethyl ether, which is a water immiscible ether solvent, which in the defendant’s submission leaves no doubt that other water immiscible ether solvents like MTBE may be used as an alternate solvent. Dr Johannes opines that the use of the ether solvent that has low miscibility with water (or the mixture of the ether solvent that has low miscibility with water and an ether solvent that “has miscibility with water” [ie, with higher miscibility with water]) was “well known”.202Foot Note 202×Dr Johannes’ Second Expert Report at para 23.In this regard, he avers that the prior art achieved desired yield and purity by using the Matteson homologation protocol. US 309 discloses the use of a suitable solvent medium for the Matteson homologation protocol including THF, diethyl ether, petroleum ether, “or the like”.203Foot Note 203×Dr Johannes’ Second Expert Report at para 22. 154 According to Prof Chiba, however, claim 1 is the process for preparing a boronic ester compound of Formula (I) by employing the “improved” Matteson homologation protocol for the large-scale synthesis of bortezomib. The use of an ether solvent that has low miscibility with water (ie, MTBE) as a major component of the reaction mixture during formation of the “ate” complex II (ie, the first intermediate) fulfils the novelty requirement as this is an improvement to the Matteson homologation protocol. This allows the use of moist zinc chloride as a Lewis acid during the Contacting Step without significant epimerisation, which reduces the creation of undesirable compounds that reduce product purity. Prof Chiba therefore concludes that the claimed invention provides an effective process for synthesising the compound of Formula (I). On this claimed invention, Prof Chiba avers that the process ultimately generates products of desired chemical and stereochemical purity, even on a large-scale production – claim 1 is therefore novel. 155 In my view, the prior disclosure of the use of diethyl ether or petroleum ether (which are ether solvents that have low miscibility in water) does not fully anticipate claim 1 of SG 322. The teachings disclosed in US 309 in respect of the use of specific ether solvents with low miscibility with water, namely, diethyl ether and petroleum ether, do not enable the person skilled in the art to distil from it the use of amixtureof an ether solvent with low miscibility with water and a coordinating co-solvent in the proportions taught in claim 1 that would maintain the reaction yield even with the presence of high levels of moisture. However, the teaching in US 309 of the use of ether solvents with low miscibility with water as a coordinating solvent serves as enabling disclosure for the person skilled in the art to arrive at the claimed invention in claim 1(b)(i). Indeed, Prof Chiba acknowledged under cross-examination that the phrase “and the like” in US 309 refers to “other ether solvent(s)”. The pertinent portion of his evidence is reproduced below:204Foot Note 204×Transcript (19 October 2021) at p 128 ln 14 to p 129 ln 16. Q: All right. So what does the phrase \"and the like\" at line 49 mean? What would it include? … You have: \"... diethyl ether, tetrahydrofuran, petroleum ether, and the like.\" What does \"and the like\" mean? A: I assume other ether solvent. Q: Other ether solvents, right. And MTBE is an ether solvent, right? A: Yes. Q: So it would include MTBE, right, although MTBE is not named here? A: Yes, can be considered as one of the ether solvents. Q: Let me pause there. Based upon the 309 patent, based upon the disclosure and the teaching in column 5, line 45 to line 50, I would put to you that the skilled person would consider that MTBE would be amongst the class of solvents that could be used, suitable solvents? A: Yes, in conditional, you know, in the some condition [sic], starting condition, that is, you know, if the reaction is conducted under anhydrous reaction conditions. Prof Chiba agrees that the reference to “and the like” in US 309 included ether solvents with low miscibility in water, such as MTBE. This is the teaching in claim 1(b)(i) of SG 322. US 309 has therefore clearly anticipated the use of an ether solvent with low miscibility in water in the reaction taught. In this regard, it is apparent that US 309 anticipates claim 1(b)(i) of SG 322. 156 The plaintiffs’ objection against Dr Johannes’ argument that the patent is invalid through the use of MTBE not being novel is that it does not appreciate the actual mechanism behind the invention of SG 322.205Foot Note 205×PRS at para 26.SG 322 teaches the use of solvents in certain proportions in the reaction mixture that maintains reaction yield even if there are high levels of moisture in the system. I observe that Dr Johannes characterises claim 1 of SG 322 as teaching achoice ofa solventthat works for the reaction rather than teaching amethodof utilising a solventin specific proportions (at least 70% v/v of the reaction mixture) to cope with high moisture levels in the system.206Foot Note 206×Questions to Court Assessor at p 14.The latter formulation more accurately depicts the teaching in claim 1(b) of SG 322. Dr Johannes’ criticism on the lack of novelty of claim 1 of SG 322 is therefore limited to claim 1(b)(i). US 309 teaches the use of ether solvents with low water miscibility and the person skilled in the art may extrapolate that an ether solvent with low water miscibility would be suitable as a coordinating solvent with reasonable yield. 157 That being said, however, claim 1(b)(ii) teaches the use of amixtureof (a) an ether solvent that has low miscibility with water and (b) a coordinating co-solvent provided that the ether solvent that has low miscibility with water constitutes at least 70% v/v of the reaction mixture. I agree with the plaintiffs’ argument on novelty with respect to claim 1(b)(ii) vis-à-vis US 309. Based on the patent description at paragraph [033], SG 322 highlights that the performance of MTBE leaves room for improvement and that “[h]indered ether solvents, such as [MTBE], are poorly co-ordinating and preferably are used with a coordinating co-solvent”.207Foot Note 207×ABOD Vol 1 at p 20.Claim 1(b)(ii) introduced the use of a “coordinating co-solvent” to the reaction mixture in order to resolve the poorly coordinating nature of MTBE on its own. 158 In my view, US 309 itself does not teach the use of the mixture identified in claim 1(b)(ii), much less explain the rationale for the introduction of such a mixture. That much is clear on the face of the patent specification and the claims of US 309. It does not suffice that US 309 is “merely close or similar” to the teachings of SG 322 – there is still a gap in that the use of a mix of an ether solvent with low miscibility with water and a coordinating co-solvent would not result from the person skilled in the art following the directions of the teachings of US 309 as it does not teach the use of an ether solvent of low miscibility with waterwithanother coordinating co-solventin the proportions taught in claim 1. Thus, US 309 does not anticipate claim 1(b)(ii). 159 Claim 1(b)(ii) is therefore not anticipated by prior art. As I have analysed above at [155], however, claim 1(b)(i) is anticipated by US 309. Inventiveness requirement: whether claim 1 meets the obviousness requirement 160 Turning to the inventiveness of SG 322, the defendant submits that THF and MTBE are substitutable Lewis basic solvents which may be used in the synthesis of bortezomib. It contends that the difference in US 309 and SG 322 is that MTBE is not directly mentioned in US 309, but the use of water-immiscible MTBE in place of water-miscible THF is obvious.208Foot Note 208×DCS at paras 233–239. (1) State of the art 161 For the obviousness inquiry, the defendant relies mainly on US 309.209Foot Note 209×DCS at paras 233–234.It also refers to WO 266 and US 454.210Foot Note 210×DCS at para 239.I have accepted above at [143] and [144] that these patents form part of the state of the art for novelty. As US 309 was published earlier than the priority date of the invention in SG 322, it also forms part of the state of the art for obviousness (see [79] above). (2) Whether the state of the art renders claim 1 obvious 162 As the defendant’s case on obviousness rests on claim 1 of SG 322 (with the other asserted claims contingent on claim 1),211Foot Note 211×DCS at para 240.I deal only with the arguments and evidence raised in respect of claim 1. I will consider whether the prior art the defendant relies on at [161] above renders claim 1 of SG 322 obvious. (A) Claim 1 163 The plaintiffs contend that claim 1 of SG 322 frames the epimerisation problem differently from US 309. US 309 frames the problem in terms of the amount of zinc chloride utilised in the reaction. They therefore argue that the inventive concept in claim 1 of SG 322 is not obvious.212Foot Note 212×PCS at para 127.The plaintiffs also allege that although US 309 reveals the use of an ether solvent of low miscibility with water, it does not describe any particular conditions for the reaction.213Foot Note 213×Scott Schedule at p 4.For SG 322, however, the plaintiffs state that the step at which the boron “ate” complex contacts the Lewis acid in the “improved” Matteson homologation protocol has to occur under very specific conditions to avoid affecting the purity of the product due to epimerisation.214Foot Note 214×Ibid. 164 In my view, claim 1 of SG 322 is non-obvious in so far as it pertains to claim 1(b)(ii). As I alluded to above, Claim 1(b)(i) teaches the use of a coordinating ether solvent that has low miscibility with water (foreg, MTBE) while claim 1(b)(ii) teaches the use ofan ether solvent that has low miscibility with water and a coordinating co-solvent, whereinthe ether solvent constitutes at least 70% v/v of the reaction mixture (see Annex 1). 165 I agree with Prof Chiba that US 309 does not disclose the core inventive concept taught by claim 1 of SG 322. 166 On the one hand, the use of a single water-immiscible ether solvent (ie, MTBE) instead of THF is an obvious thing to try given that THF belongs to the same family of solvents (ie, it is an ether solvent). The person skilled in the art would have a fair expectation of success with the use of an ether solvent with low miscibility with water as a solvent in the synthesis of bortezomib. He would also have been aware of the need to reduce moisture-levels in the reaction based on prior literature indicating the higher levels of epimerisation with the presence of moisture and thus the choice of a solvent with low water-miscibility would have been a sensible option. Taken together with the prior art of US 309 that identifies a range of both water-miscible and water-immiscible solvents which serve their purpose in other Matteson homologation reactions, and the mention of “diethyl ether, petroleum ether, or the like”, the person skilled in the art was more than likely to consider MTBE as a possible solvent. This would amount to a substantial inroad to the inventiveness of claim 1(b)(i), which describes only the use of an ether solvent with low miscibility with water. 167 That being said, there is nothing in US 309 that would allow the diligent person skilled in the art with the common general knowledge of the time to consider the mixture of an ether solvent with low miscibility with water and a coordinating solvent, in the proportions as outlined in claim 1(b)(ii). 168 Finally, I deal with the defendant’s submission that if claim 1(b)(i) lacks novelty and/or inventive step then the entire of claim 1 is invalid because the core inventive concept is the use of a water-immiscible ether solvent.215Foot Note 215×DRS at paras 56 and 60.This is a question of claim construction. Given that the use of an ether solvent of low miscibility with water is linked by the conjunction “or” to the mixture of an ether solvent with low miscibility with water and a coordinating solvent, the plain meaning of the words conveys that the two aredisjunctiveand teach a method that may be utilised independent of the other. It is incorrect to say that claim 1 only teaches the use of an ether solvent with low miscibility with water as it is apparent on the face of the text of claim 1 that the mixture of an ether solvent with low miscibility with water and a coordinating solvent in the proportions of claim 1 is presented as a distinct reaction mixture in which the promoted Lewis acid rearrangement may occur. 169 I therefore find claim 1 of SG 322 valid. Having found claim 1(b)(ii) to be novel and non-obvious, the other asserted claims contingent on claim 1(b)(ii) are found to be novel and non-obvious as well. Based on my discussion above at [155] and [166], I find that claim 1(b)(i) lacks novelty and inventive step. Sufficiency requirement: whether claim 12 sufficiently discloses the invention 170 I begin by summarising the parties’ respective cases on the alleged insufficiency in claim 12 of SG 322. 171 The defendant argues that there is a clear and obvious error in Claim 12 of SG 322 which renders it ambiguous, and the first plaintiff ought to have rectified it as soon as it became aware of the error and “in any event, before [the] trial”.216Foot Note 216×DCS at paras 241–246.The defendant contends that there is a manifest error in claim 12 that gives rise to insufficiency in two ways:217Foot Note 217×Defendant’s Closing Submissions dated 5 May 2023 at para 23. (a) The manifest error in claim 12ipso factorenders claim 12 invalid because it refers to a non–existent claim 7(d). The language of claim 12 is clear and unambiguous, and the patentee could have applied to correct that error but did not do so. (b) The uncorrected error gives rise to uncertainty and consequently, claim 12 (and its dependent claims 13 to 19) are liable to be invalidated for insufficiency. 172 The plaintiffs instead submit that it is an obvious error that could be readily corrected by the person skilled in the art when in the process of making the invention. They rely on the High Court’s holding inNg Kok Chengthat an error in the specification would not render the patent invalid provided it is an error that a person skilled in the art can at once observe and correct (at [87] and [91]). The reference to “claim 7(d)” in claim 12 is an obvious typographical error for which the person skilled in the art would not have difficulty identifying the correction.218Foot Note 218×Plaintiffs’ Closing Submissions dated 5 May 2023 at para 29.The plaintiffs argue that there can be no confusion that the reference to claim 7(d) was instead meant to be to claim 11(d) for the following reasons: (a) there is no claim 7(d) in SG 322; (b) in the claims preceding claim 12 in SG 322, reference to groups R4 and R5 is only made in claims 1 and 11; and (c) in the claims preceding claim 12 in SG 322, only claim 11 has a sub-paragraph (d).219Foot Note 219×Prof Chiba’s Second Supplementary Report dated 19 Oct 2021 at p 14. 173 As a preliminary issue as to the scope of the sufficiency argument, I agree with the plaintiffs’ objection that the dependent claims 15 to 19 ought to be excluded from the assessment as they were not put in issue in the defendant’s Particulars of Objection. Although the defendant has indicated in its further submissions dated 5 May 2023 that it would be applying to amend the Particulars of Objection to include claims 15 to 19 in the challenges on insufficiency,220Foot Note 220×Defendant’s Closing Submissions dated 5 May 2023 at paras 24 and 25.it has not done so till date. This suffices to remove claims 15 to 19 from the assessment of sufficiency. 174 I turn to the substance of the sufficiency argument. Claim 12 is reproduced below: The process of claim 7(d), wherein R4 and R5 together are a chiral moiety. 175 InNg Kok Cheng, the court held that for there to be enabling disclosure, it was sufficient that a person skilled in the art would find the wording of the specification sufficient to enable him to make the invention, even if the specification did not state every single step that had to be followed in order to make the invention (at [49]). This did not require absolute clarity and completeness (Ng Kok Chengat [49]). The court also accepted that the error could be readily corrected by the person skilled in the art when in the process of making the invention (Ng Kok Chengat [91]). 176 In the present case, it is apparent on the face of SG 322 that the reference to “claim 7(d)” in claim 12 is an error that may be corrected by the person skilled in the art with reference to SG 322 as a whole, enabling him to perform the invention without an undue burden with reference to “claim 11(d)”. Claim 11 is reproduced below for discussion: The process of claim 1, wherein (a) Y is a halogen (for example chloro); and/ or (b) R1 is C1-8 aliphatic, C6-10 aryl, or (C6-10 aryl)(C1-6 aliphatic); and/or (c) M+ is selected from the group consisting of Li+, Na+, and K+; and/ or (d) R4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- membered ring. This is because only claim 11 contains reference to groups R4 and R5 and includes a sub-paragraph (d) in the claims preceding claim 12. Although the defendant makes much of its characterisation that the person skilled in the art would need to engage in guesswork and speculation to arrive at the reference to claim 11(d) from the error in claim 12,221Foot Note 221×Defendant’s closing submissions dated 5 May 2023 at para 20.I disagree with the defendant’s argument on this. I note also that no evidence was provided by Dr Johannes on this point. As the Court of Appeal held inElement Six, the test for whether there was sufficient clarity is whether the person skilled in the art is left unclear as to how to determine whether a particular process remains within the scope of the claim even after drawing upon his common general knowledge orapplying thetypical claim construction process(at [131]). With the present claim 12, the application of the typical claim construction process (see [65] above) which involves reference to the rest of SG 322, assists the person skilled in the art to arrive at the conclusion that claim 12 must have referred to claim 11(d). There is otherwise no claim 7(d), and the reference to the chiral moiety of both R4 and R5 is to be found in claim 11(d). It would have been clear to a person skilled in the art to arrive at this conclusion by situating claim 12 in relation to claim 11(d) of SG 322 in his exercise of the purposive interpretation of the claim. 177 I therefore find that claim 12 (and the dependent claims 13 to 14) is not invalid for lack of sufficiency.",
        "Whether SG 29P is valid": "178  To recapitulate, the asserted claims in SG 29P are claims 1, 2–4 and 6 where claim 1 is the sole independent claim. 179 The plaintiffs take the position that the core inventive concept of SG 29P is the convergent coupling of the compounds of Formulas (XVIII) and (XIXa) (corresponding to the compounds referred to as BZM-4 and BZM-8 respectively in DRL’s process) to produce a compound of Formula (XXIII), which is deprotected to form a compound of Formula (XIV) (bortezomib).222Foot Note 222×PCS at para 165.This process is termed convergent synthesis.223Foot Note 223×PCS at para 169. 180 The defendant does not dispute that claim 1 of SG 29P claims a two-step convergent process for the synthesis of bortezomib.224Foot Note 224×DCS at para 248.Rather, it disputes the validity of claim 1 of SG 29P (and indeed SG 29P as a whole) on the basis that the invention claimed is neither novel nor inventive.225Foot Note 225×DCS at paras 257 and 265. Patent specification of SG 29P 181 The background of the invention in SG 29P, and thus the patent specification of SG 29P, substantially mirrors that of SG 322. I have outlined the salient aspects above at [134]–[138]. Claim construction of the independent claim in SG 29P 182 Claim 1 relates to synthesis of a compound of Formula (XIV) (ie, bortezomib) by coupling a compound of Formula (XVIII) or an acid addition salt thereof with a compound of Formula (XIXa), wherein X is a leaving group, to form a compound of Formula (XXIII), and deprotecting the boronic acid moiety to form a compound of Formula (XIV) (ie, bortezomib) or a boronic acid anhydride thereof.226Foot Note 226×Scott Schedule at p 65. (A) Novelty of claim 1 (I)State of the art 183 The defendant relies on the following materials as part of the state of the art for the novelty inquiry for SG 29P:227Foot Note 227×DCS at para 264. (a) International Publication No. WO 03/033506, filed as PCT/JP02/10450, dated 24 April 2003 (“WO 506”) is a Japanese patent relating to aminoboronic acid derivatives. It discloses the convergent synthesis of compounds having the phenylalanine amino group.228Foot Note 228×DCS at para 261; Primer at p 46.I analyse this below at [186]–[195]. (b) International Publication No. WO 03/033507, filed as PCT/JP02/10451, dated 24 April 2003 (“WO 507”) is a patent with a priority date of 12 October 2001. I analyse whether WO 507 anticipates claim 1 of SG 29P below at [196]–[201]. (c) US 079 teaches the use of convergent synthesis process for the synthesis of peptides.229Foot Note 229×Primer at p 35.I analyse whether US 079 anticipates claim 1 of SG 29P below at [203]. (II)Whether claim 1 is anticipated by the state of the art 184 The plaintiffs argue that claim 1 of SG 29P is novel and teaches an inventive step. The core inventive concept of SG 29P is the convergent coupling of the compounds of Formula (XXIII), which is deprotected to form a compound of Formula (XIV) (ie, bortezomib) (ie, convergent synthesis).230Foot Note 230×Scott Schedule at p 65. 185 It is relevant at this juncture to explain how convergent synthesis features in SG 29P. This develops the general definition of convergent synthesis which was set out earlier in this judgment (see [50] above). The plaintiffs rely on the side-by-side comparison between the process at claims 45 to 51 of SG 322 and DRL’s process, prepared by the defendant’s Mr Amarendhar, to illustrate the difference between linear synthesis (process taught in claims 45 to 51 of SG 322) and convergent synthesis (DRL’s process).231Foot Note 231×PCS at paras 167–168.  Figure 7: Difference between linear synthesis and convergent synthesis (a) WO 506 186 The defendant submits that WO 506 teaches the use of convergent synthesis to manufacture a boronic acid.232Foot Note 232×DCS at para 260.Dr Johannes averred that WO 506 anticipates the use of convergent synthesis in the manufacture of bortezomib through the series of chemical reactions involving the known compounds of Formula (XVIII) and Formula (XIXa).233Foot Note 233×Dr Johannes’ Expert Report at paras 135–136. 187 The plaintiffs, on the other hand, contend that even if WO 506 teaches convergent synthesis (in the formation of an amide bond), the teaching of WO 506 is of a “different ‘flavour’” from that of SG 29P.234Foot Note 234×PCS at para 203.Prof Chiba submits that the compounds synthesised in WO 506 are structurally different compared with bortezomib. For WO 506, Prof Chiba points to dissimilarities such as the absence of examples where the carbonyl moiety is directly attached to the ring of an aromatic moiety, which makes the synthesised compounds in WO 506 distinct from bortezomib in SG 29P. 188 Before I analyse the parties’ submissions on the anticipation of claim 1 of SG 29P by WO 506, I begin first by setting out the relevant portions of WO 506. 189 To recapitulate, WO 506 is a Japanese patent relating to aminoboronic acid derivatives (see [183(a)] above). WO 506 discloses the process titled “General Scheme 1” for the synthesis of a compound referred to as “Formula 1”.235Foot Note 235×Dr Johannes’ Expert Report at para 141 and PBOD at p 268.  Figure 8: Compound referred to as \"Formula 1\" in WO 506 190 Another relevant compound in “General Scheme 1” is the compound referred to as “Formula 7”. “Formula 7” is a compound of the form of the general compound referred to as “Formula 1” with “Y” substituted for a boron-hydroxide group.  Figure 9 Process referred to as \"General Scheme 1\" in WO 506  191 The parties disagree on whether the compound referred to as “Formula 7” in WO 506 is analogous to bortezomib. While Dr Johannes takes this position in his expert reports as well as his testimony at the trial,236Foot Note 236×Dr Johannes’ First Expert Report at paras 140–142; Transcript (27 October 2021) at p 137 ln 22 to 25 and p 138 ln 1.the plaintiffs contend that the compounds referred to as “Formula 1” and “Formula 7” are distinct from those involved in SG 29P.237Foot Note 237×PCS at paras 177 and 185.This is significant, in the plaintiffs’ view, because the defendant relies on the similarity in the compounds in WO 506 and SG 29P to make the assertion that the process of forming the chemical bond (ie, the amide bond formation) is therefore the same.238Foot Note 238×PCS at paras 178–179.Conversely, the defendant places emphasis instead on the fact that convergent synthesis was utilised to synthesise a boronic acid in WO 506.239Foot Note 239×DCS at para 260.Dr Johannes produced the chart below to illustrate and compare the processes across WO 506, WO 507 and SG 29P:240Foot Note 240×Dr Johannes’ First Expert Report at para 150.  Figure 10: Diagrammatic comparison of processes across WO 506, WO 507 and SG 29P  192 I disagree with the plaintiffs’ characterisation of the differences between the compounds referred to as “Formula 1” and “Formula 7” in WO 506 and bortezomib in SG 29P. My reasons are as follows. 193 While it is true, as the plaintiffs point out, that the pyrazine moiety (present in bortezomib) is absent in the compound referred to as “Formula 7” in WO 506, it is an exaggeration to conclude on that basis that the comparison of molecules in the compound referred to as “Formula 7” in WO 506 and bortezomib in SG 29P is akin to comparing “apples and oranges”.241Foot Note 241×PCS at para 187.The active part of the molecules for the chemical reaction remains analogous. Indeed, the plaintiffs themselves refer to other common aspects of the molecules in the compound referred to as “Formula 7” in WO 506 and bortezomib in SG 29P.242Foot Note 242×PCS at para 181(c)–(d).These include the presence of the carbonyl moiety and the two amide moieties in both the compound referred to as “Formula 7” in WO 506 and bortezomib in SG 29P.243Foot Note 243×PCS at para 181(c)–(d). 194 The plaintiffs have also relied on the fact that the pyrazine moiety in bortezomib belongs to a broad group termed “aromatic moieties”, and that WO 506 does not disclose any example where the carbonyl moiety is directly attached to the ring of an aromatic moiety.244Foot Note 244×PCS at para 186.In their submission, this renders the compounds disclosed in WO 506 so different from the bortezomib in SG 29P, such that WO 506 does not disclose the synthesis of analogous compounds and therefore does not disclose the same chemical process.245Foot Note 245×PCS at para 187.Dr Johannes accepts that pyrazine does not fall within the definition of “X” in the compound referred to as “Formula 7” in “General Scheme 1” of WO 506 (see also [190] above).246Foot Note 246×Transcript (27 October 2021) at p 144 ln 21 to 25.  Figure 11: Definition of \"X\" in compound referred to as \"Formula 7\" in the process described in \"General Scheme 1\" of WO 506. Dr Johannes claims instead that the chemical process reaction in WO 506 would be performed successfully even if “X” in the compound referred to as “Formula 7” in “General Scheme 1” is a pyrazine moiety.247Foot Note 247×Dr Johannes’ Second Expert Report at para 186.In his view, this is true notwithstanding that “X” is defined narrowly in “General Scheme 1” of WO 506.248Foot Note 248×Dr Johannes’ Second Expert Report at para 186.The plaintiffs do not make any substantive submissions in response to this claim pertaining to WO 506, save that the assertion is “myopic” and a “red herring” as it reduces the synthesis process described in WO 506 and SG 29P to the formation of an amide bond.249Foot Note 249×PCS at para 191.Despite the plaintiffs’ best efforts to draw large the dissimilarities between the compound referred to as “Formula 7” in WO 506 and bortezomib in SG 29P, the defendant’s submission is that the compounds in WO 506 and bortezomib areanalogous,notthat they areidentical.250Foot Note 250×Dr Johannes’ Second Expert Report at para 185.That the plaintiffs make much of the fact that the pyrazine moiety is not present in the compounds in WO 506 is neither here nor there. However, WO 506 does not independently constitute sufficient prior art whichanticipatesthe invention in SG 29P because of the differences in the structures of the compounds involved in the process of synthesis. Indeed, the argument that the defendant pursues with more force is that the convergent synthesis taught in WO 506 for analogous compounds with the phenylalanine amino group renders the teaching in claim 1 of SG 29P obvious.251Foot Note 251×Dr Johannes’ Second Expert Report at para 189. 195 In my view, the combination of WO 506 and WO 507 as prior art in the obviousness inquiry is far more probative in the assessment of validity of claim 1 of SG 29P. This is considered below as part of the inventiveness requirement (see [204]–[212] below). (b) WO 507 196 The defendant submits that WO 507, which is a product patent for another boronic acid in the same class of organochemicals as bortezomib, also anticipates the use of convergent synthesis in the manufacture of bortezomib.252Foot Note 252×DCS at paras 261–262; Dr Johannes’ Expert Report at paras 135–136.In its submissions on novelty, the defendant relies also on WO 266 and US 454, which are referred to in WO 507.253Foot Note 253×DCS at para 261; Dr Johannes’ Second Expert Report at paras 121–122, 125 and 129.Dr Johannes averred that US 454 disclosed the compound referred to as BZM-4 in DRL’s process. As for WO 266, he described the process which involves the coupling of “a phenylalanine amino acid moiety” and “a pyrazine moiety” in linear manner, that is, through stepwise or linear synthesis.254Foot Note 254×Dr Johannes’ Second Expert Report at paras 182 and 183.Dr Johannes presented the view that while WO 507 does not itself involve the synthesis of bortezomib, it refers to WO 266 which describes the linear synthesis of bortezomib.255Foot Note 255×Dr Johannes’ Second Expert Report at para 183. 197 Conversely, the plaintiffs submit that WO 266 and US 454 are irrelevant to the convergent synthesis process taught in SG 29P as they relate to linear synthesis.256Foot Note 256×PCS at paras 171–172.For WO 507, Prof Chiba emphasises that it only discloses compounds where amide bonds are directly attached to the aromatic ring, as compared to a carbonyl bond being directly linked to the aromatic ring as disclosed in SG 29P.257Foot Note 257×PCS at paras 207–208. 198 In respect of the defendant’s reliance on WO 266 and US 454, I agree with the plaintiffs that they are irrelevant to the determination of whether SG 29P is novel. To recapitulate, the parties are in agreement that the core claimed inventive concept in SG 29P is the convergent synthesis of bortezomib. Dr Johannes agreed that WO 266 and US 454 were irrelevant in terms of convergent synthesis:258Foot Note 258×Transcript (27 October 2021) at p 67 ln 19 to 23. Q: Yes, because 454 and 266 do not teach convergent synthesis, so in that regard 454 and 266 are therefore irrelevant. Do you agree? A: Not everything in there is irrelevant but in terms of convergency, yes. From his evidence, the position taken by Dr Johannes appears to be that WO 266 and US 454 remain relevant prior art in the determination of the novelty of SG 29P in respect of matters aside from convergent synthesis. However, apart from stating that the compound and eventual product involved in US 454 and WO 266 pertain to the compound referred to as Formulas (VII) or (XVIII) in SG 29P and BZM-4 in DRL’s process, and bortezomib respectively, the defendant has not shown how else the respective prior art, US 454 and WO 266, are individually relevant. This, in my view, is an unsustainable position to take. Having taken the position that the core claimed invention in SG 29P is the teaching of the convergent synthesis of bortezomib, the defendant cannot continue to assert the relevance of WO 266 and US 454 as individual pieces of prior art despite accepting that they are irrelevant to the discussion on convergent synthesis. WO 266 and US 454 therefore do not respectively anticipate claim 1 of SG 29P (and indeed the novelty of the other asserted claims of SG 29P, which are also premised on the inventive concept in claim 1). 199 I turn now to the issue of whether WO 507 anticipates claim 1 of SG 29P. 200 In my view, the plaintiffs are correct in saying that the compounds in WO 507 are even less analogous to bortezomib in SG 29P. The parties do not dispute that no carbonyl bond is directly linked to the aromatic ring in the compounds described in WO 507,259Foot Note 259×PCS at paras 208–209.and the aromatic moiety in the compounds described in WO 507 is pyrazine-N-oxide, not pyrazine (as is present in bortezomib).260Foot Note 260×PCS at para 210.These differences have the sum effect of rendering the compound referred to as “(I)” in WO 507 more analogous to a class of compounds known as benzyl malonate derivatives, rather than to the class of compounds that bortezomib belongs to.261Foot Note 261×Prof Chiba’s Second Expert Report at para 64(d).However, it remains that the reaction to form the amide bond on the boronate side of the molecule in the compound referred to as “(I)” in WO 507 is successful in a manner that is analogous to SG 29P.262Foot Note 262×Comments on Case 817-2019 at p 13.Indeed, as Dr Johannes explains in his Second Expert Report at paragraphs 193 to 194, the fact that the compound referred to as “(I)” in WO 507 has a terminal oxidised pyrazine group as opposed to a terminal pyrazine group in the case of bortezomib in SG 29P may not impact the convergent coupling of compounds referred to as “(V)” and “(IV)” taught in WO 507:  Figure 12: Patent specification of WO 507 at p 8 201 Dr Johannes, however, approaches the relevance of WO 507 in respect of inventiveness with greater force. He averred that WO 507 is relevant when it is taken together with WO 266 and WO 506, and that renders the claimed convergent synthesis in claim 1 of SG 29P obvious to a person skilled in the art.263Foot Note 263×Dr Johannes’ Second Expert Report at para 196.This is similarly the approach taken in the defendant’s submissions. Given that WO 507 involves compounds which are even less analogous to those in SG 29P as compared to WO 506, there is an even greater hurdle for the person skilled in the art to draw on WO 507 to make the claimed invention in claim 1 of SG 29P. Bearing in mind my discussion at [194] above, WO 507 therefore does not anticipate claim 1 of SG 29P. 202 I will consider the relevant prior art by mosaicking in the inventive step inquiry below (see [204]–[212]). (c) US 079 203 Although the defendant claims to rely on US 079 in its case on novelty of claim 1 of SG 29P, there is no elaboration on this point. The defendant’s expert only relies on US 079 to show that the compound referred to as BZM-8 in DRL’s process is a known compound.264Foot Note 264×Dr Johannes’ Second Expert Report at para 125.The defendant has therefore not shown how US 079 anticipates claim 1 of SG 29P. (B) Inventiveness of claim 1 of SG 29P (I)Whether the prior art renders claim 1 of SG 29P obvious 204 I turn now to the obviousness inquiry pertaining to claim 1 of SG 29P, and apply theWindsurfingtest as I set out above (see [81]). Parties do not dispute that the state of the art relevant in the novelty inquiry is equally relevant to the inquiry pertaining to inventive step for SG 29P. 205 Before I consider if claim 1 of SG 29P lacks inventive step, I set out the parties’ cases on obviousness briefly. As I set out above at [179], the plaintiffs consider the core inventive concept of SG 29P to be the convergent coupling of the compounds of Formulas (XVIII) and (XIXa) to produce a compound of Formula (XXIII). The compound of Formula (XXIII) is deprotected to form a compound of Formula (XIV) which is bortezomib. The plaintiffs contend that WO 266 and US 454 relate to linear synthesis and are therefore “not relevant” to the convergent synthesis of bortezomib as taught in SG 29P.265Foot Note 265×PCS at paras 171 and 172.The plaintiffs also deny that WO 506 and WO 507 disclose the synthesis of analogous compounds and therefore the same chemical process.266Foot Note 266×PCS at paras 187 and 204.The defendant alleges that convergent synthesis is well known in the art of organic chemistry and has been taught in the field of synthesising organochemical compounds,267Foot Note 267×DCS at para 265.and claim 1 of SG 29P is obvious in view of US 079, WO 266, US 454, WO 506 and WO 507.268Foot Note 268×DCS at para 266; DRS at paras 69 and 88. 206 For the person skilled in the art, claim 1 of SG 29P is obvious given the prior art. There is no dispute that the methods of linear synthesis and convergent synthesis form part of the common general knowledge held by the person skilled in the art.269Foot Note 269×DCS at para 257; Transcript (20 October 2021) at p 20 ln 5 to 15.As Dr Johannes points out, bortezomib and the compounds of WO 506 and WO 507 are analogous and the “convergent” synthesis process is used in these cases. More importantly, WO 506 and WO 507 make reference to WO 266, which is a product patent of bortezomib. WO 506 and WO 507 disclose the convergent synthesis process for sufficiently similar compounds, and having considered them in the context of the synthesis of bortezomib (ie, WO 266), the inventive concept of SG 29P is rendered obvious. In summary, Dr Johannes outlined the following aspects of claim 1 of SG 29P that would be obvious to the person skilled in the art: (a) The existence of the compound denoted by “BZM-4” (in the defendant’s process) or Formula (XVIII) (in the plaintiffs’ process) was known in US 454, WO 506 and WO 507.270Foot Note 270×DRS at para 88(b); Dr Johannes’ First Expert Report at paras 58–60 and Dr Johannes’ Second Expert Report at paras 121–124. (b) The compound denoted by “BZM-8” (in the defendant’s process) or Formula (XIXa) (in the plaintiffs’ process) was known in US 079.271Foot Note 271×DRS at para 88(b); Dr Johannes’ First Expert Report at paras 61–62 and Dr Johannes’ Second Expert Report at paras 125–127. (c) Linear synthesis for the preparation of bortezomib is disclosed in WO 266 and US 454 with priority dates in 1996 and 1998 respectively.272Foot Note 272×DRS at para 88(c). (d) Convergent synthesis is a well-known alternative process to linear synthesis.273Foot Note 273×DRS at para 88(d). (e) WO 506 and WO 507 demonstrated an analogous application of the convergent synthesis process to that in SG 29P.274Foot Note 274×Dr Johannes’ First Expert Report at paras 140–150. 207 The main contention between the parties (see [205] above) is whether the processes and compounds in WO 506 and WO 507 are analogous to SG 29P. The defendant submits that bortezomib is a known compound and pyrazine ring attachment with the carbonyl is already known in the art in WO 266 and US 454.275Foot Note 275×DRS at para 84.According to the defendant, the person skilled in the art would consider reagents according to the structure of bortezomib, and not necessarily the compounds described in WO 506 and WO 507.276Foot Note 276×DRS at para 85.The compounds in WO 506 and WO 507 share sufficiently similar structural characteristics with the intermediates used in the synthesis of bortezomib in SG 29P. The diagram below illustrates the similarities between WO 506, WO 507 and SG 29Pvis-à-visthe convergent synthesis process for the formation of the amide bond in boronic acid compounds:277Foot Note 277×DRS at para 87.  Figure 13 Comparison of WO 506, WO 507 and SG 29P 208 In my view, given that convergent synthesis is a known alternative to linear synthesis, and the use of the linear synthesis process for the preparation of bortezomib in WO 266 and US 454, the person skilled in the art would likely consider the use of the convergent synthesis process for the manufacture of bortezomib. In cross-examination, Prof Chiba was asked if the two methods of synthesis would be available to the person skilled in the art who was engaged in chemistry research to produce a type of boronic acid. The pertinent section of his responses is reproduced below:278Foot Note 278×Transcript (20 October 2021) at p 26 ln 17 to p 28 ln 4. Q: I'm a researcher? A: Yes. Q: I want to make a new class, a new type of boronic acid? A: Okay. Q: I've got my reactants in the test tube. A: Yes. Q: How to combine the reactants? A: Okay. Q: I start my research. Let me read up on the basic theories. A: Yes. Q: I go to an advanced chemistry process, chemical process or chemical engineering textbook or chemistry textbook? A: Yes. Q: I will be able to find in the textbooks two types of process? A: Okay. Q: Linear synthesis, secondly, convergent synthesis? A: Okay. Q: Correct? A: I understand your questions. Can I ask you before I say yes or no? Your textbook mentions linear synthesis and also convergent synthesis of your target compounds, is it? Q: No, general question, two general types of process. Step one which is linear, and convergence? A: Before that you should understand the difficulty of convergent process. Q: No. Prof Chiba, I would put it to you, this is a general question, would linear synthesis be disclosed in the textbooks? A: Yes. Q: Yes. Would convergence synthesis be disclosed in the textbooks? A: Yes, but depending on the molecules -- Q: Your answer is \"yes\". 209 Prof Chiba also agreed that convergent synthesis was illustrated and taught in WO 506.279Foot Note 279×Transcript (20 October 2021) at p 29 ln 3 to 9.That being said, Prof Chiba took the position that convergent synthesis was known, but the convergent synthesis of bortezomib was not.280Foot Note 280×Transcript (20 October 2021) at p 29 ln 17 to 19.Eventually, Prof Chiba agreed that WO 506 taught the use of convergent synthesis in connection with a boronic acid and further that the compound in WO 506 is analogous to bortezomib.281Foot Note 281×Transcript (20 October 2021) at p 36 ln 2 to 19. 210 It is clear from the relevant portion of the cross-examination reproduced below that Prof Chiba agrees that the person skilled in the art would try the convergent synthesis process in WO 506 and WO 507, which used the convergent synthesis process for the synthesis of analogous compounds: Q: Would you be able -- if I show you the 506 patent, if I show you the Bortezomib patent and I ask you would you be able to develop convergent synthesis for Bortezomib, what would your answer be? … We have a time machine. We are now in 2003? A: Yes. Q: I come to you and say, \"Mr Chiba, I show you this patent, 1994 Patent\", right? A: Yes. Q: For this compound called Bortezomib? A: Yes. Q: I show you these two patents 506, 507? A: Yes. Q: And if I say, \"Can you, using these two documents, make Bortezomib for me using 506 and 507, the methods shown in 506 and 507\", would you be able to do that? A: Would I be able to do that? If you ask me to implement practice 506 Patent, 507 Patent protocol to make Bortezomib? Q: Yes. A: If you ask me, yes, we can try. Q: Okay. Following on your question, if I approached you to synthesis Bortezomib in line with the 506 and 507 Patent. A: Yes. Q: Right? You can try, you said, to use the convergent synthesis to make Bortezomib? A: Yes. 211 In my view, bortezomib and the compounds in WO 506 and WO 507 are sufficiently analogous. Apart from belonging to the class of boronic acids, they are also expected to engage in similar chemistry. During cross-examination, Dr Johannes explains how this is so in the context of the analogous nature of the compounds of WO 507 and bortezomib in SG 29P:282Foot Note 282×Transcript (27 October 2021) at p 169 ln 1 to 22. Q: So I put it to you that patent 507 does not teach the synthesis of Bortezomib. Agree or disagree? A: I disagree. And can I make a clarification on the, I guessthe biological activity of these compounds is all predicated on the first two amino acids. The majority of its activity.And in these cases, the derivatives that are suggested and listed are meant to expand on the chemical space to take advantage of that chromophore. The chromophore are, in this case, the active component of the drug, in this case, that prevents or inhibits the proteasome, is the boronic acid warhead itself with the phenylalanine amino acid adjacent to it.And these other compounds are analogous in the sense that they are similar and all of those compounds are that way. The synthesis to them uses very known chemistry to people, experts in this area such as myself.So the process and the chemistry used to do those are very straightforward. There's no imaginative chemistry or conditions here that weren't already known in the art. [emphasis added] As I explain above at [39], the proteasome is an enzyme complex that is an important target for pharmaceutical drugs in anti-cancer therapy. Dr Johannes’ testimony therefore explains that the active component of the boronic acid compounds influence their biological activity, and the compounds in WO 506 and WO 507 are therefore similar to bortezomib in that way. In my view, on Prof Chiba’s evidence that a person skilled in the art in possession of WO 506 and WO 507 would be able to try the method of convergent synthesis of bortezomib (see [210] above), and that the method of convergent synthesis in WO 506 and WO 507 pertains to the chemically similar boronic acid compounds, I find that convergent synthesis would be seen by the person skilled in the art as obvious to try for the synthesis of bortezomib with a fair expectation of success. 212 Given the analogous processes in WO 506 and WO 507 and the existence of the relevant compounds in the state of the art in US 079, WO 266 and US 454 prior to the filing of SG 29P, the person skilled in the art would have been able to resolve the differences in the compounds involved in the convergent synthesis process in WO 506 and WO 507 without any degree of invention. WO 506 and WO 507 have priority dates in 2003, which are before the priority date of SG 29P on 24 March 2005. Indeed, it appears that claim 1 of SG 29P (and indeed the inventive concept of SG 29P), which claims the convergent synthesis of bortezomib, is no more than a workshop variation to the use of convergent synthesis to synthesise the analogous boronic acids in WO 506 and WO 507. This is buttressed by the fact that linear synthesis and convergent synthesis were known alternative processes in the common general knowledge, and WO 266 and US 454 recorded the use of the former in the synthesis of bortezomib. Taken together with the common general knowledge, it would have been obvious for the person skilled in the art with possession of WO 506 and WO 507 to try the method of convergent synthesis in the synthesis of bortezomib with a reasonable expectation of success of arriving at the core inventive concept in SG 29P. (II)Whether there was technical prejudice 213 I address also Prof Chiba’s argument that there existed industry opinionagainstthe utility of the processes advanced in WO 506 and WO 507 at the time. In G C Barrett & D T Elmore,Amino acids and Peptides(Cambridge University Press, 1998) (“Barrett”), the authors highlight the issue of enatiomerisation (which lowers the efficacy and yield of the reaction) during the coupling step in reaction processes using the intermediate compound with the Formula (XIXa). This stems from the observation in Barrett that the use of convergent synthesis for the compounds containing the terminal acyl group on a α-amino group may lead to increased rates of enantiomerisation. Prof Chiba suggests that this would cause the skilled process chemist to find it counter-intuitive to embark on the process claimed in claim 1 of 29P.283Foot Note 283×Prof Chiba’s First Expert Report at para 258.The defendant submits, however, that the structure of the group attached to α-amino group is but one factor in determining enantiomerisation.284Foot Note 284×DRS at para 117. 214 I do not accept that Barrett would be construed in the manner that Prof Chiba contemplates. Given the common general knowledge at the time and the existence of the other materials pertaining to convergent synthesis, the person skilled in the art is not likely to interpret Barrett as forming a significant hurdle to the convergent synthesis process in claim 1 of SG 29P. I explain this below with reference to the earlier statement of the law (see [87]–[89] above). 215 I agree with the defendant that Barrett describes the structure of the group attached to α-amino group as one factor for determining enantiomerisation.285Foot Note 285×DCS at paras 276–277.The relevant portion of Barrett is reproduced below:286Foot Note 286×Prof Chiba’s First Expert Report at Appendix Q, p 2254. The factors that determine the extent of enantiomerisation (Kemp, 1979) include (a) the structure of the group attached to the α-amino group of the next residue to be coupled, (b) the structure of the next residue to be coupled, (c) the coupling procedure, (d) the choice of solvent and (e) control of the temperature. The plaintiffs rely on Barrett for the proposition that the use of the convergent synthesis process employed in claim 1 of SG 29P was discouraged at the time because it cautioned the use of convergent synthesis where there is an acyl group on the α-amino group. However, as is apparent from the extract, Barrett only summarised the relevant factors going toward epimerisation. The findings in Barrett onlysuggestthat some level of enantiomerisationcanoccur and the enantiomerisation is ultimately case-dependent in nature. 216 Furthermore, even if it is assumed that a person skilled in the art reading Barrett would understand that there would be problems with having terminal acyl group on the α-amino group for the convergent synthesis, WO 506 would have been available at the priority date of SG 29P. Barrett was published in 1998, while WO 506 has the priority date of 24 April 2003. WO 506 disclosed the use of convergent synthesis for the compounds containing the acyl group on α-amino group and taught the use of convergent synthesis without real or potential epimerisation due to the phenylalanine moiety.287Foot Note 287×DCS at paras 277–278; DRS at paras 117–118.In spite of the proposition relied on by the plaintiffs in Barrett, the person skilled in the art is likely (with the materials available at the time) to try adjusting factors so as to manage the level of enantiomerisation. Enantiomers were an expected impurity (see [52] above), and the notional person skilled in the art would at the very least try the convergent synthesis method and take steps to deal with such impurity as it arises. In cross-examination, Dr Johannes responded to the relevance of Barrett as follows:288Foot Note 288×Transcript (27 October 2021) at p 164 ln 20 to p 165 ln 22. Q: -- trying to ascertain what was the common general knowledge then. In Barrett, which is a basic textbook for peptide bonds, okay – A: Yes. Q: -- it teaches that there is the use of the urethane group because the acyl group would cause enantiomerisation, do you agree with me or not? A: I agree that the textbook states it is a concern, that doesn't definitively state that it will always happen. Q: Okay. So you agree that that's the common general knowledge. So if I were to approach you in 2003, 2004 and telling you please do the convergent synthesis of Bortezomib, as a person skilled in the art, something that would concern you would be aha, there is this teaching that it's going to cause this epimerization. Now, can you confirm as well at the material time there is not a single prior art that teaches the convergent synthesis of Bortezomib at that material time? Agree or disagree? A. The specifics in Bortezomib convergently I believe that is correct.The general knowledge of a convergent synthesis to try is obvious. And given the improvements to the yields that can be made in a convergent synthesis, despite the general common knowledge that a urethane group would provide an epimerization, one would still try that reaction and identify if that is the case. [emphasis added] I find therefore that there is no technical prejudice occasioned by Barrett in the structure of the group attached to the α-amino group. 217 Taking the evidence as a whole, I am satisfied that the relevant prior art rendered the claimed invention in claim 1 of SG 29P obvious. 218 As the dependent claims 2–4 and 6 are contingent on the validity of claim 1, on theSunseapapproach, I find that they are invalid for lack of inventive step for the same reasons set out above. Following the reasoning of the Court of Appeal inSunseap, SG 29P is therefore invalid. In any case, the parties’ positions are that the other asserted dependent claims are contingent on the same inventive concept in claim 1 of SG 29P (ie, convergent synthesis). Thus, even on a claim-by-claim basis, the other asserted dependent claims are invalid for lack of inventive step on the basis that claim 1 is invalid for lack of inventive step. 219 Having found SG 29P to be invalid for lack of inventive step, I do not venture into the arguments presented by the defendant on the added subject matter in claim 1 of SG 29P.",
        "Whether SG 322 is infringed": "220 I turn now to consider if the Patents are infringed. As I have concluded that SG 322 is partially valid (in so far as the claims relate to the inventive concept in claim 1(b)(ii)), I deal with the next question of whether the asserted claims in SG 322 have been infringed by DRL’s manufacturing process. There is no need to consider if SG 29P is infringed as I have found above that it is invalid for lack of inventive step. Whether the burden of proof has shifted to the defendant 221 Before I proceed with the issue of infringement, I first consider whether the burden of proof has shifted to the defendant. The relevant law on the invocation of s 68(1) of the Patents Act is set out above (see [94]–[97]). 222 It is well-established that the party alleging patent infringement bears the burden of proving the claim. In bringing the present proceedings, the plaintiffs seek to persuade this Court that there is a reversal of burden of proof under s 68(1) of the Patents Act such that the defendant now bears the onus to prove that the Alleged Infringing Product (ie, bortezomib) is not made by the patented process in SG 322. 223 Section 68(1) is successfully invoked if the plaintiff shows that the patented process is to obtain a new productorthat a substantial likelihood exists that the product is made by the patented processandthe proprietor of the patent is unable through reasonable efforts to determine the process actually used. The plaintiffs rely on the second limb, which is to show that a substantial likelihood exists that the Alleged Infringing Product (ie, bortezomib) is made by the patented process in SG 322 and the plaintiffs are unable through reasonable efforts to determine the actual process used. The case advanced by the plaintiffs is that the yields of bortezomib achieved by DRL’s manufacturing process must indicate that MTBE (or an ether solvent of low miscibility with water) was used in their process. 224 To place this discussion in context, I set out the key features of DRL’s manufacturing process of the Alleged Infringing Product (ie, bortezomib). According to Mr Amarendhar, the manufacturing process consists of the following:289Foot Note 289×Mr Amarendhar’s AEIC at para 18. (a) Isobutyl boronic acid is reacted with (+)– Pinanediol to make the compound referred to as BZM-1, which is homologated using the Matteson reaction conditions in nitrogen atmosphere in the presence of THF as a solvent to synthesise BZM-2. Before using THF as a solvent, the water content is kept at not more than 0.1%. THF is a water-miscible solvent. It does not involve the use of an ether solvent with low miscibility with water, such as MTBE. (b) The compound referred to as BZM-2 is converted to N-silyl protected amine,ie, BZM-3, using lithium bis(trimethylsilyl)amide) in the presence of THF under nitrogen atmosphere at 25 to 30 degrees Celsius. The silyl group of the compound referred to as BZM-3 is deprotected by using trifluoroacetic acid (“TFA”) to give the compound referred to as BZM-4. (c) The (+)– Pinanediol was selected as the chiral auxiliary for generating the S-isomer of carbon bearing chlorine in the “BZM-2 stage”. (d) During the development of this process, the reaction at each stage was monitored by thin layer chromatography (“TLC”) / gas chromatography (“GC”). (e) The compounds referred to as BZM-1, BZM-2 and BZM-3 are non-isolatedin situintermediates. They are liquid in nature and were monitored by GC to ascertain the reaction progress at each stage. (f) Given that the compound referred to as BZM-2 is a non-isolatedin situintermediate – the diastereomeric ratio content of BZM-2 was not measured during the manufacturing process of the Alleged Infringing Product. (g) The BZM-4 (about 1.3 moles) is reacted with the compound referred to as BZM-8 (about 1.18 moles) to obtain the compound referred to as BZM-9, which was then subjected to trans-esterification with isobutyl boronic acid to obtain the compound referred to as BMB-1 (bortezomib crude). (h) The compound referred to as BMB-1 (bortezomib crude) consists of two chiral centres, one of the chiral centres comes from the fragment BZM-4 and the other from the compound referred to as BZM-8. The compound referred to as BMB-1 is purified to obtain the compound referred to as BMB-2, which is pure bortezomib. (1) Whether the plaintiffs have shown that a substantial likelihood exists that the Alleged Infringing Product is made by the process taught in the Patents 225 The plaintiffs argue that a substantial likelihood exists that the Alleged Infringing Product is made by the patented process in the Patents. They mount this challenge by undermining the steps presented in the DRL’s manufacturing process in respect of: (i) moisture control; and (ii) the use of excess zinc chloride in relation to the synthesis of the compound referred to as BZM-2 in DRL’s manufacturing process.290Foot Note 290×PCS at para 76.I observe that the plaintiffs’ case in respect of substantial likelihood (and more broadly, infringement) is that DRL’s manufacturing processcould not haveachieved the reported levels of purity in the production of bortezomib (ie, the Alleged Infringing Product). They make this submission on the theoretical basis of existing literature and materials placed before the court. 226 The defendant, conversely, submits that the inventive concept of SG 322 is the use of an ether solvent with low miscibility with water (ie, MTBE).291Foot Note 291×DCS at para 116.This argument is made in respect of the entirety of claim 1(b). In its submission, all the asserted claims in SG 322 are premised on the same substitution of an ether solvent miscible in water (ie, THF) for an ether solvent with low miscibility with water (ie, MTBE).292Foot Note 292×DCS at para 118.The question therefore turns on whether DRL’s process uses MTBE (or any other water-immiscible solvent).293Foot Note 293×DCS at paras 119–120.The defendant argues that the plaintiffs have adduced no objective evidence that DRL’s process utilises MTBE to manufacture the Alleged Infringing Product and therefore it has not infringed SG 322.294Foot Note 294×DCS at para 122.Rather, the defendant contends that all the available evidence on DRL’s process shows that the plaintiffs have not discharged their burden of proving infringement of SG 322.295Foot Note 295×DCS at para 122.The defendant emphasises that the plaintiffs had known that DRL’s position was that it did not use water-immiscible ether solvents such as MTBE to manufacture the Alleged Infringing Product as early as 24 July 2019 when it had set out DRL’s position in a letter to the plaintiffs’ lawyers,296Foot Note 296×ABOD Vol 1 at p 195.but the plaintiffs did not investigate further even on invitation by the defendant through their lawyers.297Foot Note 297×DCS at paras 124–127.Additionally, the defendant submits that the plaintiffs’ submission that there is no other way to manufacture bortezomib is misconceived as there are other recorded ways outside of the process described in the Patents to manufacture it.298Foot Note 298×DRS at para 27. (A) Presence of moisture in DRL’s process 227 To make their submission on this point, the plaintiffs rely on the moisture-sensitive nature of the Matteson homologation process. It is not disputed that the presence of moisture promotes the epimerisation of boronic esters in the process, and causes an undesired epimer to form in the reaction mixture.299Foot Note 299×PCS at paras 77–78.The plaintiffs argue that there is a presence of moisture in various steps of DRL’s manufacturing process. I address these in turn below. (I)The presence of moisture in DRL’s reagents in the synthesis of BZM-1 228 The plaintiffs emphasise that it is necessary to look to the synthesis of BZM-1 and BZM-2 to assess how moisture accumulates from the beginning of the process up until the synthesis of BZM-2. BZM-2 is in turn a key intermediate in the synthesis of a major intermediate, BZM-4 (and in the overall synthesis).300Foot Note 300×PCS at para 79.The intermediates and the final product synthesised in DRL’s manufacturing process is summarised at [224] above. 229 There is no dispute that the intermediate compound referred to as BZM-1 (ie, compound referred to as Formula (III)) is the key starting material for the synthesis of BZM-2 (ie, compound referred to as Formula (I)), which is in turn a starting material for the synthesis of BZM-4.301Foot Note 301×PCS at paras 80–82.The plaintiffs point out that in the synthesis of BZM-1 as described in DRL’s manufacturing documents, ten litres of demineralised water are used. This is in reliance on the process descriptions for BZM-4 and BZM-8 appended to the defendant’s letter to the plaintiffs dated 8 April 2020.302Foot Note 302×PBAEIC Vol 1 at p 1713. 230 I reproduce the relevant portions of the process description of BZM-4, which contain a table of raw materials utilised in the process and an outline of the manufacturing procedure:303Foot Note 303×PBAEIC Vol 1 at p 1715.  Figure 14: Portion of the process description of BZM-4 pertaining to BZM-1 (redacted) 231 As may be seen from the table above, a total of ten litres of demineralised water is used (see sum of “DM Water Lot-1” and “DM Water Lot-2”) in the synthesis of BZM-1. Mr Amarendhar confirmed this interpretation of the table at the trial.304Foot Note 304×Transcript (27 October 2021) at p 95 ln 15 to 18.At the end of DRL’s process to synthesise BZM-1, the organic layer is distilled off “completely” and a check is conducted on the water content (see “Manufacturing Procedure” at [230] above). By the process description, the moisture content in BZM-1 should be not more than 0.5%.305Foot Note 305×PBAEIC Vol 1 at p 1716.BZM-1 is thereafter utilised in the synthesis of BZM-2 on a “100% yield basis”, which in other words means that the output of BZM-1 is used entirely in the synthesis of BZM-2. The plaintiffs contend that this means that there is “already moisture inherent in the starting materials” used in the synthesis of BZM-2, which involves the Matteson homologation process.306Foot Note 306×PCS at para 82. 232 In my view, the plaintiffs’ argument is unsustainable. The plaintiffs seek to convince the court that the presence of moisture will affect the Matteson homologation process used in the subsequent synthesis of BZM-2, as the process has previously been shown to respond to moisture with epimerisation (ie, the production of an unwanted isomer known as the epimer) (see [52] above). It must be noted that according to Mr Amarendhar, the organic layer over the compound referred to as BZM-1 is distilled off entirely under vacuum until the water content reaches no more than 0.5%, and its purity is checked by gas chromatography to ensure not less than 98% purity. I note that the documentation states “not more than 98% purity”. However, I accept Mr Amarendhar’s evidence that this is a typographical error. The relevant portion of his evidence in cross-examination is as follows:307Foot Note 307×Transcript (22 October 2021) at p 96 ln 2 to 23. Q: Thank you.So the result that you have for BZM-1 will contain moisture? A:Yes, and then 5,000ppm [ie, 0.5%]. Q: Correct. Now, and the fact that you distil, you put it aside, and then it’s: [Reads] “After completion of”---the---“water content unload the material into HDPE container...” So you unload it into another container, and then you say: [Reads] “...check Purity”---right---“by...” GC is gas chromatography, isn’t it? A: Yes. Q: So you are asking to check purity, and you say: [Reads] “...(Limit: Not more than 98.0%).” So you do not want it to be so pure, is it? So it’s okay that it is not pure? Because you said the limit not more than 98%. A: I think it is typo.It is not less than 98%. Q: Huh? A: It’s not--- Q: I’m trying to understand what you mean by the limit not more than 98%. So are you saying that that’s not more than 98% purity? A: No, I--- Q: Because it’s a purity by GC, and then you have a limitation there, not more than 98%. A: No, I---I---I think it is a typo error. It is not less than 98, if I remember. 233 That the compound referred to as BZM-1 containssomelevel of moisture does not assist the plaintiffs. It is clear that DRL’s process does not claim to be entirely moisture-free. Instead, it includes processes to keep moisture levels low in order to reduce the rate of epimerisation and maintain the level of yield of bortezomib. 234 In this connection, the plaintiffs suggest that even small amounts of water will result in epimerisation that will hinder the purity of the eventual yield.308Foot Note 308×PCS at para 69.However, this submission is tenuous at best. There is no clarification from the plaintiffs on the quantity of “small amounts of water” in the context of DRL’s process. Prof Chiba only states that the small amounts of water referred to is 11mg of water in 10ml of THF in the context of Matteson 1983.309Foot Note 309×Prof Chiba’s First Expert Report at para 34.In reply, Dr Johannes appears to accept that to see epimerisation the amount of water needs to be at least 11mg of water in 10ml of THF.310Foot Note 310×Dr Johannes’ Second Expert Report at para 15.However, Dr Johannes avers that anhydrous THF and dry zinc chloride were used in DRL’s reported process. He argues therefore that the plaintiffs’ assertion that there must have been small amounts of water in DRL’s process that would cause epimerisation is misconceived. Furthermore, to my mind, the finding in Matteson 1983 is premised on the experimental conditions different from the manufacturing conditions in DRL’s process. It is unworkable to base the threshold level of moisture that would cause epimerisation in DRL’s process on a separate reaction reported in Matteson 1983. In this regard, the plaintiffs have not produced any evidence directly pertaining to DRL’s process, despite the opportunity to inspect DRL’s manufacturing process being available to the plaintiffs. Aside from the lack of information from the plaintiffs on what would constitute “small amounts of water” in the context of DRL’s process, it is known in the prior art that the level of moisture sensitivity differs for different instances of the Matteson homologation reaction (see [248] below). There is no clarification from the plaintiffs as to the level of moisture sensitivity for this particular reaction and, in my view, this in turn impedes their submission. (II)The presence of moisture in DRL’s reagents in the synthesis of BZM-2 235 The plaintiffs argue that the “already moist BZM-1” is then used with other reagents for which “dryness remains equally suspect” in the synthesis of BZM-2.311Foot Note 311×PCS at para 83.The implication is that the levels of moisture in the synthesis of BZM-2 will result in epimerisation, and impact the eventual purity of bortezomib. 236 The following section of the process description for the synthesis of BZM-2 is relevant:312Foot Note 312×PBAEIC Vol 1 at pp 1717–1718.   Figure15: Process description for synthesis of BZM-2 (redacted) 237 As discerned from the table above (see “Raw material” at [236] above), the total quantity of THF utilised in the synthesis of BZM-2 is 16 litres. There are also specifications on the levels of moisture in the reagents. This includes the specification of the limit of 0.1% water content for dichloromethane, one of the reagents for the synthesis of BZM-2. 238 Where the plaintiffs take objection is whether the same limitation on moisture is applied to the different lots of THF (ie, THF-1, THF-2 and THF-3) used in the process.313Foot Note 313×PCS at para 84.In cross-examination, Mr Amarendhar testified that the specification on water content applies equally to all lots of THF:314Foot Note 314×Transcript (22 October 2021) at p 98 ln 12 to 26 and p 99 ln 5 to 19. Q: Thank you. Now, so you say that this control of the moisture in THF is only for lot 1 of THF. Isn’t that correct? A: That lot 1 we are using in the reaction. Q: Okay, yes. So---but you also use lot 2 of THF and lot 3 of THF and--- A: We are using from the same lot--- Q: Correct? A: ---when supervising, we are checking and---we are checking, butthe same result will be applicable for the lot 1 lot. Q: Well, I don’t know because there isn’t any instructions from your manufacturing process here that the lot 2 and lot 3 of THF also has moisture control. There isn’t any instruction on that. Do you see any instruction about lot 2 and lot 3 of THF being---also having moisture control of 0.1%? Do you see it? … Do you see it or you don’t? A:In the document it’s not, but we are practising. … Q: Sorry, Mr Maha---Amarendhar, do you agree or do you not agree that there is no limitation of moisture for lot 2 and lot 3 of THF? Do you agree or you don’t---you can disagree with me. A: I disagree. Q: Thank you. COURT: Can you explain why you disagree? Witness: THF---so we are checking the TH---water content in the THF after a---on the (indistinct)but THF lot 2 and lot 3 has a specification limits.So every raw metal will have the specification limit, but we are not checking over here. So we willuse the same lot, THF.Once we are checking one---water content, it will be, like, applicable to the remaining lots also. We don’twant to burden the---the QC by testing the same repeated analysis again and again. 239 Dr Johannes also testified in cross-examination that the person skilled in the art would consider THF-2 and THF-3 to be subject to same limitation:315Foot Note 315×Transcript (27 October 2021) at p 96 ln 4 to 20. Q: You see that THF, there's lot 1, lot 2, lot 3? A: Yes. Q: You see that note there, \"Check water content for THF and DCM should not be more than 0.1 per cent\". So – A: Yes, I see that. Q: -- that moisture control is only for DCM and THF lot 1. There is no description for moisture control for lot 2 and lot 3. So as a person skilled in the art, I'm asking you, can you therefore assume that there is no moisture control for lot 2 and lot 3 of THF, \"yes\" or \"no\"? A: No, I would assume the opposite actually, sorry,Iwould assume that the same applies to lot 2 and lot 3. Q: It is also 0.1 per cent? A: Yes. 240 The plaintiffs suggest that there is a lack of moisture control in respect of the other two lots of THF. The suggestion is two-fold: first, DRL’s process description provides no such limitation for the water content in the other two lots (ie, THF-2 and THF-3) and second, THF-2 and THF-3 are not tested for water content.316Foot Note 316×PCS at para 85.Moreover, the plaintiffs contend that even if Mr Amarendhar’s evidence that THF-2 and THF-3 are subject to the same limitation on moisture at 0.1% is accepted, that would still mean that THF-2 and THF-3 contained moisture.317Foot Note 317×PCS at para 85.The defendant takes the view that the objection rests on shaky foundations as the problem of epimerisation was previously resolved in US 309, and the issue of moisture control relates to process control in the actual manufacturing process.318Foot Note 318×DRS at para 29. 241 I do not think that the plaintiffs’ submission in respect of THF-2 and THF-3 bears any merit. The explanations provided by Mr Amarendhar (see [238] above) and Dr Johannes (see [239] above) that THF-2 and THF-3 are subject to the same specification limits for moisture as THF-1 and further that it suffices to test THF-1 to calibrate the efficiency of the quality control process are reasonable. In any case, before the BZM-2 is introduced as a starting material for the synthesis of BZM-4 (and the rest of the process for the synthesis of bortezomib), the process description provides that the organic layer is distilled off until “the water content reaches not more than 1.0%” (see [236] above). This provides an overall control on the moisture levels in the synthesised BZM-2 at the final step of the process, prior to its introduction as a starting material in the synthesis of BZM-4. It therefore renders the plaintiffs’ objection on the levels of moisture present in the reagents for the preparation of BZM-2 moot. Furthermore, it is telling that the plaintiffs have fixated on this point, without addressing the processing activities carried out by DRL that would reduce the water content. This is notwithstanding the acknowledgment by Prof Chiba that there were reported methods to control moisture levels in US 309, for example, the use of argon (an inert gas which is chemically non-reactive), in order to ensure that anhydrous zinc chloride was contained under moisture-controlled conditions.319Foot Note 319×Transcript (19 October 2021) at p 130 ln 7 to p 132 ln 16.There are other safeguards for excess moisture outlined in the process description (see “Manufacturing Procedure” at [236] above), such as the reaction with “n-Hexyl Lithium under nitrogen atmosphere”. The plaintiffs have not addressed these other aspects of moisture control in the synthesis of BZM-2 in their submissions. (III)The use of anhydrous THF, zinc chloride and nitrogen atmosphere 242 I address the plaintiffs’ next submission pertaining to DRL’s claimed use of anhydrous THF and anhydrous zinc chloride, and the nitrogen reaction atmosphere. 243 The plaintiffs contend that DRL’s process description does not use the term “anhydrous” to describe THF or zinc chloride and it was only used in the evidence of Dr Johannes and Mr Amarendhar. In their submission, there is therefore nothing in the evidence to show that anhydrous THF or anhydrous zinc chloride is utilised.320Foot Note 320×PCS at para 89.The defendant submits that the limitation on the level of moisture at 0.1% for THF amounts to anhydrous THF. The plaintiff argues, however, that the question of whether a 0.1% limitation on moisture is anhydrous cannot be looked at in isolation.321Foot Note 321×PCS at para 90.The plaintiffs rely on Matteson and Erdik to make the submission that the Matteson homologation process is “very sensitive to the presence of water in THF”. That Matteson and Erdik discloses that the rate of epimerisation doubles at “a mere 0.11% water content in THF” must “surely [be] … that the very slightly lower figure of 0.10% would still accelerate the rate of epimerisation”.322Foot Note 322×PCS at para 91. 244 To begin, I do not accept the plaintiffs’ submission that there is no evidence as to the use of anhydrous THF and anhydrous zinc chloride in DRL’s process. 245 For anhydrous THF, it is clear on the face of the process description provided by the defendant that the moisture levels of THF are kept at under 0.1% during the reaction (see [236] above). During cross-examination, Mr Amarendhar explained that the environment and reagents are controlled for moisture in their manufacturing process, with the use ofanhydrousTHF (where the water content in THF should not exceed 0.1%) and laboratory reagent grade zinc chloride which isnot contaminated with water.323Foot Note 323×Transcript (22 October 2021) at p 100 ln 10 to 17 and p 105 ln 17.Although the plaintiffs have made the argument that there is “no prescription for moisture control of zinc chloride in [the] manufacturing process description”, this argument does not take them far. The use of “commercial reagent grade crystallineanhydrouszinc chloride” is taught expressly in US 309.324Foot Note 324×DCS at para 180; DBOD at p 89.The patent specification of SG 322 itself refers to US 309, and describes the prior patent as follows:325Foot Note 325×ABOD Vol 1 at p 13. Matteson and Sadhu, U.S. Patent No. 4,525,309 (1985), describes an improved procedure for the homologation of boronic esters by rearrangement of the intermediate boron \"ate\" complex in the presence of a Lewis acid catalyst. The Lewis acid is reported to promote the rearrangement reaction and to minimize epimerization at the alpha-carbon atom.Rigorous exclusion of water and careful control of Lewis acid stoichiometry are required for optimum results, however. … It is therefore known thatanhydrouszinc chloride is used to achieve the rearrangement reaction. In cross-examination, Prof Chiba agreed that US 309 mitigated the issue of epimerisation by the introduction of anhydrous zinc chloride as a Lewis acid:326Foot Note 326×Transcript (19 October 2021) at p 122 ln 11 to p 123 to 2. Q: Basically, we agree this patent teaches how to control the homologation process, right? A: Yes. Q: Prof Matteson says at line 55, column 2: \"Particularly, suitable Lewis acid catalysts have been known to include anhydrous zinc chloride and ferric chloride. Mixture of these and other Lewis acids may also be used.\" Line 55 to line 60, basically, says, epimerization, all these problems that we have identified in our earlier writings from 1980 to 1983, problems can be controlled by Lewis acids, particularly suitable Lewis acids catalysts have been found to include anhydrous zinc chloride? A: Yes. Q: So it teaches how to use anhydrous zinc chloride? A: Yes. Consequently, there is no basis for the plaintiffs’ assertion that the hygroscopic nature of THF and zinc chloridenecessarilyindicates elevated moisture levels in DRL’s process that would result in high levels of epimerisation. Taking this (ie, that the problem and the solution are known in prior art) together with Mr Amarendhar’s evidence at [238] above, I accept that DRL’s process utilised anhydrous THF and anhydrous zinc chloride. 246 Another submission made by the plaintiffs is that drying zinc chloride is “resource-intensive”. This is similarly stated in Prof Chiba’s expert report. However, Prof Chiba accepted in cross-examination that anhydrous zinc chloride may be procured commercially and its anhydrous state maintained under specific conditions (such as working with the material in an atmosphere of nitrogen gas):327Foot Note 327×Transcript (19 October 2021) at p 103 ln 3 to p 104 ln 9. Q: When we talked about zinc chloride earlier, right, you agreed with me, it is available commercially? A: Yes. Q: And when ordering I can specify, I want it to be anhydrous, it must be dry? A: Yes. Q: So drying it would not be an issue for the manufacturer, for Zyfas and Dr Reddy's, the manufacturer for the product, they can obtain from their supplier anhydrous zinc chloride, correct? A:Yes, that's possible. Q: Yes. And they would have in their process, because they are a pharmaceutical factory, moisture control protocols, right, because they manufacture many pharmaceutical products; moisture control would be a routine problem? A: Yes. Q: So they would have moisture control protocols. They can buy anhydrous zinc chloride. They would know how to manage the moisture problem in the factory. It can be done under nitrogen. When opening, it can be opened under nitrogen. It can be opened under some insert gas, like argon, all right. And so moisture control or moisture would not be a problem, it can be managed, correct, on the factory floor? A: Yes. Q: And so once moisture is managed as a practical problem, epimerization goes away, it is not a problem, would you agree? A:Yes, if moisture could be controlled in THF, epimerization won't be an issue, but this is practically very difficult and challenging. [emphasis added] 247   On the issue of moisture in the reagents, the plaintiffs argue (see [243] above) on the basis of Matteson and Erdik that very little moisture suffices to cause epimerisation and adversely affect the resultant purity in the DRL’s process. The extrapolation from Matteson and Erdik that 0.11% of water content will accelerate the epimerisation in DRL’s process sufficiently to generate an unacceptably impure product is not viable. There is nothing to show that the observation made by Matteson and Erdik (see [46] above) that 11mg of water in 10ml of THF doubled the rate of epimerisation in the reaction, which pertains to different reagents such as lithium chloride and dimethyl sulfoxide,328Foot Note 328×Prof Chiba’s First Expert Report at Appendix O.is equally relevant to showing the extent of epimerisation in DRL’s process. I reproduce the relevant part of Matteson and Erdik below:329Foot Note 329×Prof Chiba’s First Expert Report at Appendix O. These data are only of qualitative or semiquantitative significance in most instances but are reliable enough to illustrate significant features of the reaction. Thus,the rate [of epimerisation] is greatly accelerated by a small amount of water (doubled by 11mg in 10mL of THF)or dimethyl sulfoxide (Me2SO) and is depressed by mercuric chloride. [emphasis added] 248 As stated before (see [234] above), it is most relevant to measure the level of epimerisation under the specific experimental conditions in DRL’s manufacturing process. Matteson and Erdik establishes the epimerisation behaviour of different boronates under different conditions. It demonstrates variation in rates of epimerisation that depend not only on water content but also the choice of the organic substrate, chloride concentration, exposure time, temperature and other factors.330Foot Note 330×Prof Chiba’s First Expert Report at Appendix O.The doubling of rate in the presence of 0.11% water was observed for a different boronate (ie, (+)-pinanediol benzeneboronate) and under different conditions. As a result, the plaintiffs’ submission, relying on Matteson and Erdik, is an oversimplification and inaccurately conceptualises the significance of the level of moisture on the rate of epimerisation in DRL’s process with reference to conditions which are not equivalent to DRL’s process. Contrary to Prof Chiba’s evidence that it is “practically very difficult” to control moisture in the reaction process, this is squarely refuted by his own acknowledgment that it is possible to procure anhydrous zinc chloride and THF. 249 Another point raised by the plaintiffs is that even if the laboratory grade zinc chloride used by DRL is in fact anhydrous, Matteson and Erdik makes it clear that the use of anhydrous zinc chloride will not prevent epimerisation.331Foot Note 331×PCS at para 94.They argue that Matteson and Erdik records that the use of THF with anhydrous zinc chloride as a Lewis acid in the synthesis of alpha-chloro-boronic esters generated the boronate (ie, the end product of the Matteson homologation) which contained a 6% epimer with a 1% deviation.332Foot Note 332×PCS at para 95; Prof Chiba’s First Expert Report at para 56; Prof Chiba’s First Expert Report at Appendix O; PBOD at p 337.In their submission, Matteson and Erdik shows that the use of anhydrous zinc chloride by itself does not prevent epimerisation.333Foot Note 333×PCS at para 95.Prof Chiba therefore considers it surprising that DRL’s process is capable of obtaining a product purity of not less than 99%. Indeed, Prof Chiba states that the 1% impurity claimed by the defendant includes the epimerised product in addition to other impurities occurring in the course of the subsequent reaction steps and that lies in stark contrast to the expected 6%. The defendant reports that the total impurities present in its BMB-1 (ie, its crude bortezomib) is “NMT [not more than] 1.0%”.334Foot Note 334×Prof Chiba’s First Expert Report at para 57 and Appendix F5 (see Prof Chiba’s First Expert Report at p 1128).The  plaintiffs’ Prof Chiba extrapolates that it is likely that DRL in fact used an ether solvent with low miscibility with water in the contacting step of its synthesis of BZM-2 because the level of product purity claimed by DRL’s large-scale process “despite not having any step to dry the reagents, reactors and apparatuses” is almost identical to that reported by the plaintiffs following the process taught in the Patents.335Foot Note 335×Prof Chiba’s First Expert Report at paras 59–60. 250 The defendant takes the position that the use of anhydrous zinc chloride as the Lewis acid solved the problem of epimerisation, and this was recorded in US 309.336Foot Note 336×DCS at para 177.More importantly, in response to the submission that there ought to be an epimer of 6%, Dr Johannes stated that US 309 had already disclosed that pure product with diastereoselectivities of about 99.5% is achievable using the Matteson homologation protocol. Dr Johannes avers that the process description of DRL’s manufacturing process demonstrates that pure bortezomib is obtained in DRL’s process.337Foot Note 337×Dr Johannes’ Second Expert Report at para 45; ABOD Vol 2 (Part 1) at p 31. 251 In my view, the proposition made by the plaintiffs that DRL’s process ought to have resulted in an impurity level closer to 6% is incorrect. This is because the plaintiffs have over-generalised the statement in Matteson and Erdik without accounting for the differences between the processing conditions and the eventual product reported in Matteson and Erdik and DRL’s process. The 6% epimerisation referred to in Matteson and Erdik was for a different product unrelated to bortezomib production processed under different conditions. These conditions were “[c]hromatography on 80 g of silica gel with petroleum ether yielded 19.1 g (83.6%) of crystalline (+)-pinanediol (αS)-α-chloro-α- phenylmethaneboronate (3), which contained 6% (±l%) of the (αR)-epimer 4 by 200-MHz proton NMR analysis.”338Foot Note 338×Prof Chiba’s First Expert Report at Appendix O.Matteson and Erdik did not disclose the information required to determine the moisture content in that particular case either. The plaintiffs have therefore not shown how the recorded instance of 6% epimerisation in Matteson and Erdik is a valid predictor of the likely epimerisation for DRL. It is also incorrect for the plaintiffs to infer from the fact that the reported impurity levels experienced using the process taught in the Patents and DRL’s process are the same, to make the submission that defendant must have used their process taught in the Patents. This is logically flawed, especially since there is more than one method to synthesis bortezomib effectively. 252 At the next step, the reaction is then conducted in inert gas (ie, nitrogen) to ensure low moisture levels in the reaction environment. From the plaintiffs’ submissions, I understand there to be no challenge on the part of the plaintiffs against the proposition that the use of nitrogen atmosphere mitigates against moisture in the environment.339Foot Note 339×PCS at para 96.The plaintiffs’ submission is only that where there exists moisture in the reagents, then the introduction of the nitrogen atmosphere would not alleviate moisture in the reagents themselves.340Foot Note 340×PCS at paras 97–98.As I have found that the reagents utilised are anhydrous in nature, there is no issue of the level of moisture causing epimerisation as contemplated by the plaintiffs. 253 Crucially, DRL has produced a laboratory analysis report measuring the presence of diastereomers (ie,the impurities) in the coupling reaction to produce the intermediate for subsequent reactions to generate bortezomib (and for that sample the diastereomers were measured at a level of about 0.05% of the desired product).341Foot Note 341×ABOD Vol 2 (Part 1) at 193–196.In other words, the low-moisture conditions employed by DRL in its manufacturing process were sufficient to keep the epimerisation at an acceptably low level. This evidence was effectively uncontroverted. The plaintiffs’ response to this is simply that it is not practically possible to maintain low moisture levels. They have furnished no evidence from direct experimentation. 254 Given the techniques that were available and part of the prior art, I do not accept that a “substantial likelihood” exists that the Alleged Infringing Product could only have been made from the first plaintiff’s process in SG 322.  Aside from US 309, WO 266 and US 454 were patents which taught the use of THF (a solvent of high water miscibility) in the manufacture of bortezomib. Indeed, Prof Chiba agreed in cross-examination that the approach taught in these other patents could be used to manufacture bortezomib:342Foot Note 342×Transcript (19 October 2021) at p 116 ln 4 to 16. Q: Okay. So it can be done. The prior art, the 266 and 454 patents, how to synthesise, it can be done on an industrial scale and is possible so long as moisture control is implemented properly? A: Yes, possible, if you don't care about the process efficiency. Q: Sorry? A: If you don't care about the process efficiency, so, you know, use of 266 or use of 454 patents could be used to manufacture. Q: It could be used, yes. In fact, epimerization is not an issue if you keep it scrupulously dry? A: Yes. 255 The plaintiffs have therefore not shown how DRL’s process suffers from poor moisture control, or that the reported results of purity cannot have been achieved under DRL’s process. (B) Use of excess zinc chloride 256 Apart from the allegations regarding the levels of moisture in DRL’s manufacturing process, the plaintiffs rely on the purported use of excess zinc chloride in DRL’s process to show that it would not have been possible for DRL to achieve such yields of bortezomib with the process it described.343Foot Note 343×PCS at paras 100–105.Prof Chiba states in his Second Supplementary Expert Report that the molar ratio of zinc chloride with respect of BZM-1 in the Matteson homologation step of DRL’s process (ie, the synthesis of BZM-2) is much higher than what has been taught as optimal in Matteson and Erdik.344Foot Note 344×PCS at para 100.Prof Chiba derives the molar ratio from the following calculation based on reported quantities of the reagents in DRL’s process:345Foot Note 345×Prof Chiba’s Second Supplementary Report dated 19 Oct 2021 at paras 3–4. 3. In the Defendant’s documents regarding the process description for the synthesis of BZM-4, when describing the synthesis of BZM-2 from BZM-1, the Defendant uses the substrate, BZM-1 and the Lewis acid, Zinc Chloride as follows: (a) The Defendant’s process uses 1.00 kg of BZM-1, which, given the molecular weight of BZM-1 i.e. 236.16, translates into 4.23 moles; and (b) The Defendant’s process uses 1.00 kg of Zinc Chloride, which, given the molecular weight of Zinc Chloride i.e. 136.3, translates into 7.33 moles. 4.The ratio of the number of moles of zinc chloride and that of BZM-1 gives 1.73. In fact, the Defendant’s manufacturing process itself confirms that this ratio of ZnCl2 to BZM-1 as 1.76, when describing the various process parameters for the synthesis of BZM-2. [emphasis added] 257 There is no dispute from the defendant as to the molar ratio of 1.73 for the zinc chloride employed in DRL’s process. In response to the plaintiffs’ submission, the defendant contends that this is a “red herring” and that if the plaintiffs doubted the levels of purity reported by DRL’s manufacturing process, they ought to have visited DRL’s factory in India.346Foot Note 346×DRS at para 30. 258 The plaintiffs rely on the similarity of the molar ratio of zinc chloride in DRL’s process (1.73 mol) and the process taught in SG 322 (1.75 mol) to allege that DRL must have used the process claimed.347Foot Note 347×PCS at para 102(c).In my view, the plaintiffs’ reliance on the molar ratio of zinc chloride in DRL’s process does not assist their case. That DRL has used a similar quantity of one reagent, zinc chloride, does not advance the plaintiffs’ case that DRL must have used the process taught in SG 322. Indeed, Prof Chiba acknowledged that the molar ratio of the reagents is not specified by SG 322:348Foot Note 348×Transcript (20 October 2021) at p 13 ln 1 to 3. A: Okay, so I will admit that 322 Patent does not mention about the ratio of the reagents -- I mean zinc chloride. The plaintiffs have not shown how the similarity in the quantity of a reagent (ie, the molar ratio of zinc chloride) used in DRL’s process and in the process taught by SG 322 translates to an inference that the same method is utilised by both processes. The calculated molar ratio of zinc chloride in DRL’s process therefore does not translate to any inference as to the purported similarity of DRL’s process to SG 322. 259 The plaintiffs’ further argument is that the molar ratio of zinc chloride with respect to BZM-1 in the Matteson homologation step of DRL’s process (ie, the synthesis of BZM-2) is much higher than what has been taught as optimal in prior art.349Foot Note 349×PCS at para 100.US 309 discloses an optimum range of 0.5 to 1.0 mol of zinc chloride per mol of a certain compound (I), which corresponds to BZM-1.350Foot Note 350×PCS at para 102.In US 309, it is reported that an excess of zinc chloride accelerates epimerisation and the presence of zinc chloride in substantial concentration at the end of the reaction results in the darkening of the reaction mixture. As DRL’s molar ratio of 1.73 far exceeds the modest range recommended in prior art, the plaintiffs contend that it is highly likely that DRL might be employing a certain modification in the synthesis of BZM-2 in order to deliver the reported results.351Foot Note 351×PCS at para 102.To this end, Prof Chiba points out that the process taught in SG 322 would allow a person skilled in the art to use such a large quantity of zinc chloride while overcoming the epimerisation previously reported in the prior art.352Foot Note 352×PCS at para 102.While there is no dispute between the parties’ experts that a higher proportion of zinc chloride present in agenericMatteson homologation reaction may promote epimerisation, the plaintiffs’ submission that Matteson’s observation in US 309 is evidence of the extent of epimerisation in DRL’s process is a false comparison. Indeed, the precise effect of the molar ratio of zinc chloride in DRL’s process is not known and cannot be extrapolated from US 309. In any case, that the process adopted by DRL and the process under SG 322 achieve acceptable impurity levels with similar zinc chloride to substrate ratios (ie, 1.73 and 1.76 respectively) does not show that DRLmusthave used MTBE (or another low water miscibility ether solvent) in its process. It is clear from Matteson and Erdik that the behaviour of the reaction system is complex and significantly dependent on the structure of the boronate, and further that the rate and extent of epimerisation can vary by a factor of at least 20.353Foot Note 353×Prof Chiba’s First Expert Report at Appendix O.It is therefore unsurprising and inconclusive that DRL’s process has similar rates of epimerisation as the first plaintiff’s process in SG 322. 260 To sum, the plaintiffs have not shown how there is a substantial likelihood that DRL used the process taught in SG 322 to manufacture the Alleged Infringing Product (ie, bortezomib). They have not succeeded in showing that the moisture levels in DRL’s process were not subject to sufficient controls or that the molar ratio of the zinc chloride utilised in DRL’s process amounted to an “excess” use of zinc chloride in this particular context, such as to result in a level of epimerisation incompatible with the defendant’s reported levels of purity. (2) Whether the first plaintiff is unable to determine the process actually used to manufacture the Alleged Infringing Product through reasonable efforts 261 There were no witnesses from the first plaintiff. It therefore could not show what efforts it had put in to ascertain if DRL’s process utilised the teaching in SG 322. That in itself creates considerable difficulties as it would be unable to show if any reasonable efforts were made to determine if the taught process in SG 322 was used by DRL to manufacture the Alleged Infringing Product. 262 Nonetheless, I will consider if the documentary evidence and evidence led from the second plaintiff fulfils the requirement of reasonable efforts. My view is that the plaintiffs ought to have investigated and conducted site visits at DRL’s manufacturing facility. This would have given the plaintiffs access to DRL’s facilities and production personnel and would have allowed them to observe the production process. A site visit would have been an expedient and sensible means to verify whether DRL used MTBE as a solvent to manufacture the Alleged Infringing Product. 263 By as early as July 2019, the defendant had voluntarily offered to disclose the details of DRL’s process. In response to the first plaintiff’s letter of 30 July 2019 stating that it wished to commence legal proceedings,354Foot Note 354×ABOD Vol 1 at p 200.the defendant offered to disclose DRL’s manufacturing process. The letter of 31 July 2019 from the defendant to the first plaintiff reads: 2 Our clients deny infringement of your client’s process patent and the threat to commence proceedings is not only deeply regretted but also groundless, for which our clients reserve all their rights. … 4 In the meantime, on a without prejudice basis and in the interests of saving time and costs,our clients are prepared to disclose details of their own proprietary process, subject to appropriate safeguards. Please let us have a copy of the proposed confidentiality agreement. [emphasis added] At this stage, it was open to the first plaintiff to request to visit DRL’s factory in India. Between July 2019 and early 2020 (the period prior to the COVID-19 pandemic), however, the first plaintiff made no arrangements to conduct a site visit to ascertain for themselves DRL’s process of manufacturing bortezomib. Indeed, the first plaintiff did not present any witnesses at the trial. 264 The second plaintiff’s Ms Ho testified in cross-examination that she was not clear whether the first plaintiff had a presence in India,355Foot Note 355×Transcript (20 October 2021) at p 110 ln 2 to 3.and although Janssen had a presence in India, there was “no justification” in expecting its Indian employees to travel during a pandemic to inspect DRL’s factory.356Foot Note 356×Transcript (20 October 2021) at p 110 ln 8 to p 111 ln 1.It is unacceptable that the first plaintiff has put forth none of its own employees as representatives of the first plaintiff at the trial. The difficulty is two-fold: the second plaintiff’s Ms Ho cannot testify as to the first plaintiff’s efforts to ascertain if DRL’s process utilised what was taught in the Patents as she does not have the personal knowledge a representative from the first plaintiff would have, and Ms Ho isin factnot in the know about the first plaintiff’s operations in India. 265 In April 2021, the plaintiffs were invited to visit DRL’s manufacturing facility in Hyderabad, India to inspect DRL’s manufacturing processes and ascertain whether the Patents had been infringed.357Foot Note 357×PCS at para 8; DCS at para 51; Transcript (20 October 2021) at p 104 ln 10 to 14.Subsequently, on 10 May 2021, the plaintiffs declined the invitation, citing the COVID-19 situation in India. The plaintiffs’ solicitors stated that the plaintiffs were “not able to risk the health and safety of their representatives by dispatching them to the manufacturer’s facilities in India”.358Foot Note 358×PCS at para 8; DCS at para 51; Mr Tahir’s AEIC at p 37.In their submissions, the plaintiffs have maintained this as the reason for not conducting any site visit. 266 In my judgment, the reason provided by the plaintiffs,ie, the COVID-19 situation in India, was merely a pretext for refusing to visit DRL’s manufacturing facility. I address the various explanations put forward by the plaintiffs. 267 First, during the cross-examination of Mr Amarendhar, the plaintiffs’ counsel exhibited two documents for the first time, showing a Google search of the number of COVID-19 cases and deaths in Telangana (the State in which Hyderabad is located) in May 2021.359Foot Note 359×Exhibits P1 and P2.These exhibits were used by the plaintiff to illustrate the severity of the COVID-19 situation in India at the material time. However, when cross-examined, the second plaintiff’s Ms Ho admitted that she did not find out anything about the COVID-19 situation in Hyderabad in May 2021.360Foot Note 360×Transcript (20 October 2021) at p 111 ln 22 to p 112 ln 8. 268 Second, Ms Ho alleged that at the time, there had been a company policy prohibiting the second plaintiff’s employees from travelling.361Foot Note 361×Transcript (20 October 2021) at p 112 ln 11 to 13.However, no documents setting out this alleged policy have been produced in Court.362Foot Note 362×Transcript (20 October 2021) at p 112 ln 19 to p 113 ln 7. 269 Third, even though Janssen had an office and technical staff in India,363Foot Note 363×Transcript (20 October 2021) at p 110 ln 8 to 13.Ms Ho claimed that there would be “no justification in expecting that the Indian employees be expected to travel during a pandemic”.364Foot Note 364×Transcript (20 October 2021) at p 110 ln 14 to p 111 ln 1.The answer provided by Ms Ho was roundabout in nature, and it left room for interpretation. I understand her answer to mean that the policy prohibiting international travel to India extended to domestic travel within India as well.  However, again, no evidence was provided of an alleged policy by the second plaintiff or Janssen banning domestic travel in India. 270 Fourth, the plaintiffs argue that Telangana was under lockdown from 12 May 2021 to 19 June 2021. Movement was only allowed for essential purposes.365Foot Note 365×PCS at para 10.Therefore, this would have prevented the site visit from taking place during that period. The plaintiffs have exhibited three documents dated 11 May 2021, 30 May 2021, 8 June 2021 which set out the abstracts of the lockdown orders of the Government of Telangana.366Foot Note 366×Exhibits P3, P4 and P5.However, I highlight that these documents were only adduced in Court for the first time at the trial. Therefore, it is unclear whether the alleged lockdown was a material consideration to the plaintiffs in May 2021. Further, Ms Ho accepted that even if India were under a COVID-19 lockdown at that time, there could have been external third-party experts from India who would have been available to conduct the site visit.367Foot Note 367×Transcript (20 October 2021) at p 111 ln 2 to 8.The option, however, was never explored by the plaintiffs. 271 I note that there was disagreement between parties as to whether a site visit constituted an “essential service” during the lockdown and, therefore, whether the site visit could have been executed during the lockdown.368Foot Note 368×DCS at paras 159–160; DRS at para 36; PCS at para 10; PRS at para 15(e).In any event, even if there had indeed been a lockdown between 12 May and 19 June 2021 and the plaintiffs were not permitted to conduct a site visit, the plaintiffs could very well have conducted a site visit after the lockdown had ended. There was a significant amount of time prior to the commencement of trial in October 2021 for the plaintiffs to have conducted their own investigation on the process adopted by DRL in their manufacture of the generic bortezomib, or the Alleged Infringing Product. The plaintiffs could have either sent their employees in India to undertake the site visit or hired external third-party experts to do so. 272 As a result, I find that the plaintiffs have not fulfilled the requirement that “reasonable efforts” were expended to determine the process actually used by DRL (see s 68(1) of the Patents Act). Having found that the plaintiffs have not successfully reversed the burden of proof, I consider whether they have nonetheless shown that the asserted claims in SG 322 have been infringed by DRL’s process. Whether the plaintiffs have proven the defendant’s alleged infringement of SG 322 273 The law on infringement is set out above at [92]–[93]. It bears reiterating that the burden of proof remains on the plaintiffs to establish that DRL’s manufacturing process of the Alleged Infringing Product has infringed the asserted claims in SG 322. 274 The plaintiffs’ case on infringement rests primarily on whether an ether solvent of low miscibility with water is used in DRL’s manufacturing process.369Foot Note 369×PCS at para 76.In fact, the plaintiffs allege the infringement of SG 322noton the basis that DRL’s process as claimed by the defendants has infringed the claims therein, but that DRL’s process must have utilised the teachings in the claims of SG 322 because SG 322 is the “only solution that [the plaintiffs] are currently aware of” that would allow the person skilled in the art to perform the Matteson homologation “with zinc chloride in a high molar ratio” and yet still obtain an impressive purity result.370Foot Note 370×PCS at para 108(a).Flowing from this submission, the plaintiffs contend that DRL’s manufacturing processmust haveemployed the process taught in SG 322,371Foot Note 371×PCS at para 108(b).and the defendant is unlikely to have achieved their claimed purity of 99% if they had carried out DRL’s manufacturing process.372Foot Note 372×PCS at para 108(e). 275 The defendant submits that the main question on infringement is whether the Alleged Infringing Product has been obtained by means of the process in SG 322.373Foot Note 373×DCS at para 116.It emphasises that the use of an ether solvent that has low miscibility with water (ie, MTBE) is the inventive concept of SG 322.374Foot Note 374×DCS at para 117.Further, all the asserted claims in SG 322 are premised on the substitution of MTBE for THF.375Foot Note 375×DCS at para 118.The defendant claims that the factual question is whether DRL uses an ether solvent with low miscibility with water (ie, MTBE) in its manufacture of the Alleged Infringing Product,376Foot Note 376×DCS at para 120.and if it is established that DRL does not use MTBE then there is no basis for the infringement of SG 322.377Foot Note 377×DCS at para 121.However, the plaintiffs have not adduced any objective evidence that DRL uses MTBE to manufacture the Alleged Infringing Product and therefore infringe the asserted claims of SG 322.378Foot Note 378×DCS at para 122.The burden of proof remains with the plaintiffs to show that DRL’s process infringed SG 322.379Foot Note 379×DRS at para 46. 276 In reply, the plaintiffs contend that the defendant has set out an incomplete and inaccurate inventive concept of SG 322 because (i) the inventive concept of SG 322 includes the use of an ether solvent of low miscibility with water andalso where it constitutes at least 70% v/v of the reaction mixture; and (ii) it is misleading that the substitution of MTBE for THF is the inventive concept of SG 322.380Foot Note 380×PRS at para 8. 277 As I observe above at [225], the plaintiffs’ case on infringement is premised on the claim that DRL’s manufacturing process as explained by the defendant is unable to achieve the claimed results of purity. In their submission, the only way to achieve the claimed results of purity is through the process taught in SG 322. Consequently, the plaintiffs conclude that DRL’s process must have utilised the process taught in SG 322. The core of the inventive concept in claim 1(b)(ii) of SG 322 is the use of an ether solvent of low miscibility with water that constitutes at least 70% v/v of the reaction mixture. The rest of the asserted claims in SG 322 are premised on the inventive concept as outlined in claim 1. 278 Indeed, Ms Ho accepted that if DRL’s process did not utilise MTBE, then there would be no basis for the infringement claims:381Foot Note 381×Transcript (20 October 2021) at p 116 ln 19 to 25. COURT: Ms Ho, can I understand from you, if in fact they don't use it (MTBE), do you agree that then there is no basis for the infringement claim, if -- and listen to my question carefully. If they indeed don't use it (MTBE) then there is no basis for this infringement claim. A: Yes. 279 Counsel for the plaintiffs, Mr Suhaimi, also acknowledged that if there was no use of MTBE in DRL’s process, there would be no infringement of SG 322. The relevant clarification was made in the trial:382Foot Note 382×Transcript (27 October) at p 83 ln 11 to 19. COURT: Yes. Mr Suhaimi, if you begin with there is no use of MTBE, the question of the proportions doesn’t come into play at all. Mr Suhaimi: Sure, yes, I agree. COURT: Because some of your questions are on the basis that whether you use it or you don’t use it, there is still the question of the proportions. Mr Suhaimi: Yes, I agree if there is no use of MTBE then there is no infringement of 322. 280 In finding that the plaintiffs have not shown that a substantial likelihood exists that the Alleged Infringing Product is manufactured by the process taught by SG 322, I did not accept the plaintiffs’ submission that DRL’s manufacturing process relied on the use of an ether solvent of low miscibility with water (ie, MTBE) or an ether solvent of low miscibility with water which constitutes at least 70% v/v of the reaction mixture (ie, MTBE and a co-solvent). They have not demonstrated the epimerisation alleged to have occurred in DRL’s process, either on the alleged bases of (a) the lack of moisture control; or (b) the use of excess zinc chloride. Instead, as I have addressed above, it is clear that DRL’s process that uses THF (a water-miscible ether) is able to achieve the claimed results. 281 Furthermore, the plaintiffs’ submission that SG 322 teaches theonlyway that would allow the person skilled in the art to perform the Matteson homologation with a high molar ratio of zinc chloride to achieve an impressive purity result is misconceived. While SG 322 teaches the use of an ether solvent of low water miscibility which can be used to reduce the production of unwanted stereoisomers (ie, impurities) during the synthesis of bortezomib, it does not in any way prove that bortezomib cannot be synthesised satisfactorily in other ways that do not use an ether solvent with low water miscibility (whether on its own or together with a coordinating co-solvent). It is thus incorrect for the plaintiffs to assert that DRL must have utilised the process in SG 322 in order to manufacture the Alleged Infringing Product. 282 The plaintiffs’ primary case on infringement rests on the invocation of s 68 of the Patents Act. Their secondary case on infringement which pertains to proof of how DRL’s process infringes SG 322 employs similar arguments that undermine DRL’s process as described in its process description (ie, that it must have employed the use of MTBE) (see [225] and [277] above). I have already found that there is no basis for the plaintiffs’ submission that DRL’s process employed the use of the process taught in claim 1(b)(ii) of SG 322 (ie, the use of an ether solvent with low miscibility in water and another coordinating solvent with the former in 70% v/v concentration) (see [260] above). It suffices to dismiss the plaintiffs’ case on infringement entirely at this juncture because of the manner in which they have presented their case. 283 For completeness, however, I assess whether claim 1 (excluding claim 1(b)(i)) is infringed by DRL’s process based on the evidence before me. As the parties rest their case on infringement on the basis that the other asserted claims are based on the same inventive concept in claim 1, I will only deal with the infringement of claim 1 of SG 322. (1) Claim 1 284 Prof Chiba avers that DRL uses a process for preparing a boronic ester compound of Formula (I) as defined in claim 1 (corresponding to the defendant’s BZM-2 compound) that is equivalent to the process which the plaintiffs use to obtain their boronic ester compound. In support of his assertion, he relies on several similarities in the compounds in the plaintiffs’ reaction process and DRL’s process. The plaintiffs’ compound of Formula (I) in claim 1 corresponds to the defendant’s compound BZM-2. They assert that the diagrammatic representation of the two compounds below shows that they are similar in that the chloro group in the compound BZM-2 is equivalent to “R3” in Formula (I), which is the nucleofuge.383Foot Note 383×Prof Chiba’s First Expert Report at paras 62–63: 1PBAEIC at 34.  Figure 16: Plaintiffs’ compound of Formula (I) and the defendant’s compound BZM-2 285 Furthermore, Prof Chiba highlights that the plaintiffs’ Formula (II) in claim 1(a) and the intermediate compound obtained during the synthesis of BZM-2 from BZM-1 in the defendant’s process share similar features. In particular, the positive lithium ion in the defendant’s compound corresponds with the M+ ion in the plaintiffs’ Formula (II) in claim 1(a) and the two chloro groups in the defendant’s intermediate compound fall within the definitions of Y and R3 as a nucleofugic group.  Figure 17: Plaintiffs’ compound of Formula (II) and the defendant’s intermediate compound In Prof Chiba’s view, this is significant because the contacting step in claim 1(b) is accomplished in DRL’s process. The contacting step in claim 1(b) involves the contacting of the boron “ate” complex with a Lewis acid and in DRL’s process, the contacting step occurs where zinc chloride is added to the boron “ate” complex obtained by the defendant’s process from BZM-1, in order to synthesise the compound BZM-2. Notwithstanding the defendant’s claim that DRL’s manufacturing process does not employ an ether solvent of low miscibility with water or any co-solvent, Prof Chiba opines that it is likely that DRL uses at least an ether solvent with low miscibility with water (whether coordinating in itself or in combination with a coordinating co-solvent) in the synthesis of the compound BZM-2.384Foot Note 384×Prof Chiba’s First Expert Report at paras 65–67. 286 Dr Johannes argues that claim 1 of SG 322 is not infringed as DRL’s process employed the use of THF alone as a solvent in the reaction and therefore there is no breach of claim 1. He explains that THF is water-miscible and has been shown to work for this chemical reaction in the prior art. 287 That the compounds share similarities in chemical structure and composition, and that the chemistry (or the set of chemical reactions) that is carried out by claim 1 of SG 322 to make the compound referred to as Formula (I) is equivalent to the chemistry utilised by DRL’s manufacturing process to make the compound referred to as BZM-2 does little to assist the plaintiffs. I remain unpersuaded by Prof Chiba’s assertion that the yields brought by DRL’s manufacturing process must lead to the inference that the claimed invention in claim 1 of SG 322 is being employed by DRL in its manufacturing process, not least because SG 322 and DRL’s process are methods concerned with synthesisingthe same end product, bortezomib. It is therefore unsurprising that the intermediate compounds at the same step in the process taught in SG 322 and DRL’s process bear similarities to each other. Moreover, it does not show that DRL hadonly achieved this by utilising the plaintiffs’ method in claim 1. It is telling that Prof Chiba provides nothing further in this regard save for the same assertion relied on by the plaintiffs on the reversal of the burden of proof under s 68(1): that DRL must have utilised their process in SG 322 to achieve the reported yields of bortezomib. As Dr Johannes alludes to in response, it is scientifically possible to attain yields without the use of the claimed process by controlling the moisture conditions of the reaction environment using other methods (see [252]–[253] above). 288 The plaintiffs therefore fail to prove that DRL’s process infringed claim 1 of SG 322. Given that the plaintiffs’ take the position that the core inventive concept of claim 1(b)(ii) is the teaching of the use of an ether solvent with low miscibility with water and a coordinating solvent in certain proportions, and there is no dispute that the asserted claims are contingent on claim 1 (ie, the use ofan ether solvent with low miscibility with waterand a coordinating solvent in certain proportions), I find that the rest of the asserted claims in SG 322 have not been infringed.",
        "Conclusion": "289  For the reasons above, I find that SG 29P is invalid for lack of inventive step. Although SG 322 is valid, in my view, the plaintiffs have not shown how any of the asserted claims have been infringed by DRL’s manufacturing process as presented. I award costs to the defendant. Costs are to be agreed, or otherwise taxed. 290 In closing, I record my gratitude to Prof Sharratt for the assistance that he has rendered. Dedar Singh GillJudge of the High Court Suhaimi Bin Lazim, S Siddharth Sriram and Shahera Safrin (Mirandah Law LLP) for the plaintiffs; Wong Siew Hong and Poonaam Bai (Eldan Law LLP) for the defendant.",
        "Annex1: Asserted claims in SG 322": "The table below summarises the 39 claims asserted by the plaintiffs: Claim NoDescription1A process for preparing a boronic ester compound of formula (I):wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group;R2 is hydrogen, a nucleofugic group, or an optionally substituted aliphatic, aromatic, or heteroaromatic group;R3 is a nucleofugic group or an optionally substituted aliphatic, aromatic, or heteroaromatic group; and each of R4 and R5, independently, is an optionally substituted aliphatic, aromatic, or heteroaromatic group, orR4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- to 10-membered ring having 0-2 additional ring heteroatoms selected from N, O, or S;said process comprising:(a) providing at least 5 moles of a boron \"ate\" complex of formula(II):whereY is a nucleofugic group;M+ is a cation; andeach of R1 to R5 is as defined above; and(b) contacting the boron “ate” complex of formula(II)with a Lewis acid under conditions that afford the boronic ester compound of formula(I),said contacting step being conducted in a reaction mixture comprising:(i) a coordinating ether solvent that has low miscibility with water; or(ii) an ether solvent that has low miscibility with water and a coordinating cosolvent provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; and wherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture.2The process of claim 1, wherein the reaction mixture comprises a coordinating co-solvent.3The process of claim 2, wherein the coordinating co-solvent is selected from the group consisting of tetrahydrofuran, dioxane, water, and mixtures thereof.4The process of claim 3, wherein the coordinating co-solvent constitutes no more than 15% v/v of the reaction mixture.5The process of claim 1, wherein the solubility of water in the ether solvent that has low miscibility with water is less than 2% w/w.6The process of claim 5, wherein the ether solvent that has low miscibility with water is selected from the group consisting of tert-butyl methyl ether, tert-butyl ethyl ether,tert-amylmethyl ether, isopropyl ether, and mixtures thereof.7The process of claim 6, wherein the ether solvent that has low miscibility with water constitutes at least 80% v/v of the reaction mixture.9The process of claim 1, wherein the Lewis acid is selected from the group consisting of zinc chloride, zinc bromide, ferric chloride, and ferric bromide.10The process of claim 9, where(a) the Lewis acid is moist;(b) in step (a) the boron “ate” complex of formula(II)is provided in a solution comprising an ether solvent that has low miscibility with water, and the contacting step (b) comprises the steps:(i) providing a solution comprising a Lewis acid and tetrahydrofuran; and(ii) adding the Lewis acid solution to the solution of the boron “ate” complex of formula(II)from step (a);wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w; or (c) in step (a) the boron “ate” complex of formula(II)is provided in a solution comprising an ether solvent that has low miscibility with water, and the contacting step (b) comprises the steps:(i) providing a solution comprising a Lewis acid and water; and(ii) adding the Lewis acid solution to the solution of the boron “ate” complex of formula(II)from step (a);wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w.11The process of claim 1, wherein(a) Y is a halogen (for example chloro); and/ or(b) R1 is C1-8 aliphatic, C6-10 aryl, or (C6-10 aryl)(C1-6 aliphatic); and/or(c) M+ is selected from the group consisting of Li+, Na+, and K+; and/ or(d) R4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- membered ring.12The process of claim 7(d), wherein R4 and R5 together are a chiral moiety.13The process of claim 12, wherein the boron “ate” complex of formula(II)is:14The process of claim 12, wherein step (b) provides the boronic ester compound of formula(I)wherein the carbon atom bearing R1, R2 and R3 is a chiral center having a diastereomeric ratio of at least 96:4 or at least 97:3 relative to a chiral center in the R4-R5 chiral moiety.15The process of claim 12,characterized byat least one of the following features:(a) the contacting step (b) is conducted in a reaction mixture comprisingtert-butylmethyl ether;(b) the Lewis acid is zinc chloride;(c) the contacting step (b) is performed at a reaction temperature in the range of -60°C to -30°C;(d) the Lewis acid is moist;(e) Y is chloro;(f) R3 is chloro;(g) R2 is chloro;(h) R1 is C1-4aliphatic.16The process of claim 15,characterized byat least two of the features (a)-(g), by at least three of the features (a)-(g) or by all of the features (a)-(g).17The process of claim 12, further comprising:(c) washing the reaction mixture with an aqueous solution; and(d) concentrating the washed reaction mixture by removal of solvents to afford a residue comprising the boronic ester compound of formula(I).20A composition comprising an ether solvent that has low miscibility with water and at least ten moles of a boronic ester compound of formula (I):wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group;R2 is hydrogen, a nucleofugic group, or an optionally substituted aliphatic, aromatic, or heteroaromatic group;R3 is a nucleofugic group or an optionally substituted aliphatic, aromatic, or heteroaromatic group; andeach of R4 and R5, independently, is an optionally substituted aliphatic or aromatic group, or R4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- to 10-membered ring having 0-2 additional ring heteroatoms selected from N, O, or S;wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w.21The composition of claim 20, wherein the carbon atom to which R1, R2, and R3 are attached is a chiral center, having a diastereomeric ratio of at least 96:4, relative to a chiral center in the R4-R5 chiral moiety.22The composition of claim 20, wherein the carbon atom to which R1, R2, and R3 are attached is a chiral center, having an epimeric ratio of at least 96:4.23The composition of any one of claims 20-22, wherein the solubility of water in the ether solvent is less than 2% w/w.24The composition of any one of claims 20-22, wherein the ether solvent is selected from the group consisting oftert-butylmethyl ether,tert-butylethyl ether,tert-amylmethyl ether,isopropyl ether, and mixtures thereof.25The composition of any one of claims 20-22,(a) wherein R1 is C1-5 aliphatic, C6-10 aryl, or (C6-10 aryl)(C1-6 aliphatic); or(b)characterized byat least one of the following features:(a) R3 is chloro;(b) R2 is hydrogen; and(c) R1 is C1-4 aliphatic; or(c) wherein R4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5-membered ring; or(d) wherein the compound of formula(I)is26The composition of claim 20, wherein the boronic ester compound of formula(I)constitutes at least 70% w/w of the composition.28The composition of claim 22, wherein the carbon atom to which R1, R2, and R3 are attached has a diastereomeric ratio of at least 97:3, relative to a chiral center in the R4-R5 chiral moiety.30The composition of claim 22, wherein at least one of the following features is present:(a) R3 is chloro;(b) the boronic ester compound of formula(I)is:(c) R2 is hydrogen; and(d) R1 is C1-4 aliphatic.31A process utilizing at least five moles of at least one starting material for preparing a boronic ester compound of formula(I):wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group;R2 is hydrogen, a nucleofugic group, or an optionally substituted aliphatic, aromatic, or heteroaromatic group;R3 is a nucleofugic group or an optionally substituted aliphatic, aromatic, or heteroaromatic group; andeach of R4 and R5, independently, is an optionally substituted aliphatic, aromatic, or heteroaromatic group, orR4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- to 10-membered ring having 0-2 additional ring heteroatoms selected from N, O, or S;said process comprising:(a)providing a solution comprising(i) a boronic ester of formula(III):wherein R1, R4, and R5 are as defined above; and(ii) an ether solvent that has low miscibility with water, wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w;(b) treating the solution with a reagent of formula(IV):To form a boron “ate” complex of formula(II):whereY is a nucleofugic group;M+ is a cation; andeach of R1 to R5 are as defined above; and(c) contacting the boron “ate” complex of formula(II)with a Lewis acid under conditions that afford the boronic ester compound of formula(I),said contacting step being conducted in a reaction mixture comprising:(i) a coordinating ether solvent that has low miscibility with water; or(ii) an ether solvent that has low miscibility with water and a coordinating cosolvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture.32A process utilizing at least five moles of at least one starting material for preparing a boronic ester compound of formula (I):wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group;R2 is hydrogen, a nucleofugic group, or an optionally substituted aliphatic, aromatic, or heteroaromatic group;R3 is a nucleofugic group or an optionally substituted aliphatic, aromatic, or heteroaromatic group; andeach of R4 and R5, independently, is an optionally substituted aliphatic, aromatic, or heteroaromatic group, orR4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- to 10-membered ring having 0-2 additional ring heteroatoms selected from N, O, or S; said process comprising:(a) providing a solution comprising(i) a boronic ester of formula(III)wherein R1, R4, and R5 are as defined above;(ii) a compound of formula(V)where Y is a nucleofugic group, and R2 and R3 are as defined above; and(iii) a solvent comprising:(aa) a coordinating ether solvent that has low miscibility with water; or(bb) an ether solvent that has low miscibility with water and a coordinating cosolvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (aa) or (bb) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (aa) or (bb) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture;(b) treating the solution of step (a) with a strong, sterically hindered base to form a boron “ate” complex of formula(II):where M+ is a cation derived from the base, and each of Y and R1 to R5 are as defined above; and(c) contacting the boron “ate” complex of formula(II)with a Lewis acid in a solution comprising an ether solvent that has low miscibility with water to form the boronic ester compound of formula(I),wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w.33A process utilizing at least five moles of at least one starting material for preparing a boronic ester compound of formula(I):wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group;R2 is hydrogen, a nucleofugic group, or an optionally substituted aliphatic, aromatic, or heteroaromatic group;R3 is a nucleofugic group or an optionally substituted aliphatic, aromatic, or heteroaromatic group; andR4 and R5, taken together, form an optionally substituted linking chain comprising 2-5 carbon atoms and 0-2 heteroatoms selected from the group consisting of O, N, and S; said process comprising:(a) providing a solution comprising:(i) a boronic acid compound of formula(VI):wherein R1 is as defined above;(ii) a compound of formula HO-R4-R5-OH, wherein R4 and R5 are as defined above; and(iii) an organic solvent that forms an azeotrope with water;(b) heating the solution of step (a) at reflux, with azeotropic removal of water, to form a boronic ester of formula(III):wherein R1, R4, and R5 are as defined above;(c) providing a solution comprising:(i) the boronic ester of formula(III):(ii) a compound of formula(V):wherein Y is a nucleofugic group, and R2 and R3 are as defined above; and(iii) a solvent comprising:(aa) coordinating ether solvent that has low miscibility with water; or(bb) an ether solvent that has low miscibility with water and a coordinating co-solvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (aa) or (bb) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (aa) or (bb) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture;(d) treating the solution from step (c) with a strong, sterically hindered base to form a boron “ate” complex of formula(II):where M+ is a cation derived from the base, and each of Y and R1 to R5are as defined above; and(e) contacting the boron “ate” complex of formula(II)with a Lewis acid in a solution comprising an ether solvent that has low miscibility with water to form the boronic ester compound of formula(I),wherein the low miscibility with water to form the boronic ester compound of formula(I),wherein the solubilty [sic] of water in the ether solvent that has low miscibility with water is less that 5% w/w.34The process of claim 32 or 33, wherein the sterically hindered base is an alkali metal dialkylamide base of formula M2N(R#)2, wherein M2 is selected from the group consisting of Li, Na, and K, and each R#, independently, is a branched or cyclic C3-6 aliphatic.35The process of claim 33, wherein the organic solvent in step (a) is selected from the group consisting of acetonitrile, toluene, hexane, heptane, and mixtures thereof, or an ether solvent that has low miscibility with water wherein the solubility of water in the ether solvent that has low miscibility with water is less than 5% w/w.38A process utilizing at least five moles of at least one starting material for preparing an aminoboronic ester compound of formula(VII):or an acid addition salt thereof, wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group; andeach of R4 and R5, independently, is an optionally substituted aliphatic, aromatic, or heteroaromatic group, orR4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted 5- to 10-membered ring having 0-2 additional ring heteroatoms selected from N, O, or S;said process comprising:(a) providing a boron “ate” complex of formula(II):whereY is a nucleofugic group;M+ is a cation;R2 is hydrogen;R3 is a nucleofugic group; and each of R1, R4, and R5 are as defined above;(b) contacting the boron “ate” complex of formula (II) with a Lewis acid under conditions that afford the boronic ester compound of formula (I):where each of R1 to R5 is as defined above, said contacting step being conducted in a reaction mixture comprising:(i) a coordinating ether solvent that has low miscibility with water; or(ii) an ether solvent that has low miscibility with water and a coordinating cosolvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture;(c) treating the boronic ester compound of formula(I)with a reagent of formula M1-N(Si(R6)3)2, where M1 is an alkali metal and each R6 independently is selected from the group consisting of alkyl, aralkyl, and aryl, where the aryl or aryl portion of the aralkyl is optionally substituted, to form a byproduct of formula M1-R3 and a compound of formula(VIII):wherein each G is -Si(R6)3 and R1 to R5 are as defined above; and(d) removing the G groups to form a compound of formula(VII):or an acid addition salt thereof.41The process of claim 38, wherein the reaction in step (c) is conducted at a reaction temperature in the range of -100°C to 50°C, -50°C to 25°C or -30°C to 0°C.42The process of claim 38, wherein step (d) comprises treating the compound of formula(VIII)with an acid (for example trifluoroacetic acid) and isolating the compound of formula(VII)as the acid addition salt.43The process of claim 38, wherein step (c) further comprises filtering the reaction mixture to provide a filtrate comprising the compound of formula(VIII).44The process of claim 43, wherein in step (c), the reagent of formula M1-N(Si(R6)3)2 is added to the reaction mixture as a solution comprising tetrahydrofuran, and step (c) further comprises removing the tetrahydrofuran before filtering the reaction mixture or wherein the filtrate is useddirectly in step (d).45The process of claim 38, further comprising the step:(e) coupling the compound of formula(VII)with a compound of formula(IX):wherein:P1 is an amino group blocking moiety;R7 is selected from the group consisting of hydrogen, C1-10 aliphatic, optionally substituted C6-10aryl, or C1-6aliPhatic-R8; andR8 is selected from the group consisting of alkoxy, alkylthio, optionally substituted aryl, heteroaryl, and heterocyclyl groups, and optionally protected amino, hydroxy, and guanidino groups; and X is OH or a leaving group;to form a compound of formula(X):wherein each of P1, R1, R4, R5, and R7 is as defined above.46The process of claim 45, wherein P1 is a cleavable protecting group.48A process utilizing at least five moles of at least one starting material for preparing an aminoboronic ester compound of formula(VIIa)or(VIIb):or an acid addition salt thereof, wherein:R1 is an optionally substituted aliphatic, aromatic, or heteroaromatic group; andR4 and R5, taken together with the intervening oxygen and boron atoms, form an optionally substituted chiral cyclic boronic ester;said process comprising:(a) providing a boron “ate” complex of formula(IIa)or(IIb):whereY is a nucleofugic group;M+ is a cation;R2 is hydrogen;R3 is a nucleofugic group; andR4 and R5 are as defined above;(b) contacting the boron “ate” complex of formula(IIa)or(IIb)with a Lewis acid under conditions that afford a boronic ester compound of formula(Ia)or(Ib):where each of R1 to R5 is as defined above, said contacting step being conducted in a reaction mixture comprising:(i) a coordinating ether solvent that has low miscibility with water; or(ii) an ether solvent that has low miscibility with water and a coordinating cosolvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixturewherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture;(c) treating the boronic ester compound of formula (Ia) or (lb) with a reagent of formula M1-N(G)2, where M1 is an alkali metal and each G is an amino group protecting moiety, to form a compound of formula(VIIIa)or(VIIIb):wherein each G and R1 to R5 are as defined above; and(d) removing the G groups to form a compound of formula(VIIa)or(VIIb)or an acid addition salt thereof.52A process utilizing at least five moles of at least one starting material for forming a compound of formula(XIV):or a boronic acid anhydride thereof, comprising the steps:(a) providing a boron “ate” complex of formula(XV):wherein:R3 is a nucleofugic group;Y is a nucleofugic group; andM+ is an alkali metal;(b) contacting the boron \"ate\" complex of formula(XV)with a Lewis acid under conditions that afford a boronic ester compound of formula(XVI):said contacting step being conducted in a reaction mixture comprising:(i) a coordinating ether solvent that has low miscibility with water; or(ii) an ether solvent that has low miscibility with water and a coordinating cosolvent, provided that the coordinating co-solvent constitutes no more than 20% v/v of the reaction mixture;wherein the solubility of water in the ether solvent of (i) or (ii) that has low miscibility with water is less than 5% w/w; andwherein the ether solvent of (i) or (ii) that has low miscibility with water constitutes at least 70% v/v of the reaction mixture;(c) treating the boronic ester compound of formula(XVI)with a reagent of formula M1-N(Si(R6)3)2, where M1 is an alkali metal and each R6 independently is selected from the group consisting of alkyl, aralkyl, and aryl, where the aryl or aryl portion of the aralkyl is optionally substituted, to form a compound of formula(XVII):(d) removing the (R6) 3Si groups to form a compound of formula(XVIII):or an acid addition salt thereof;(e') coupling the compound of formula(XVIII)with a compound of formula(XIXa):wherein X is OH or a leaving group, to form a compound of formula(XXIII):and(f) deprotecting the boronic acid moiety to form the compound of formula(XIV)or a boronic acid anhydride thereof.53The process of claim 52,characterized byat least one of the following features (1)-(3):(1) In the boron “ate” complex of formula(XV),R3 and Y both are chloro.(2) The coupling step (e’) comprises the steps:(i) coupling the compound of formula(XVIII)with a compound of formula(XIXa)wherein X is OH in the presence of 2-(lH-benzotriazol-1-yl)-1,1,3,3-tetramethyluronium tetrafluoroborate (TBTU) and a tertiary amine in dichloromethane;(ii) performing a solvent exchange to replace dichloromethane with ethyl acetate; and(iii) performing an aqueous wash of the ethyl acetate solution.(3) The boronic acid deprotecting step (f’) comprises the steps:(i) providing a biphasic mixture comprising the compound of formula(XXIII),an organic boronic acid acceptor, a lower alkanol, a C5-8 hydrocarbon solvent, and aqueous mineral acid;(ii) stirring the biphasic mixture to afford the compound of formula(XIV);(iii) separating the solvent layers; and(iv) extracting the compound of formula(XIV),or a boronic acid anhydride thereof, into an organic solvent.54The process of claim 50 or 53 wherein step (h)(iii) or (f’)(iii) comprises the steps:(1) separating the solvent layers;(2) adjusting the aqueous layer to basic pH;(3) washing the aqueous layer with an organic solvent; and(4) adjusting the aqueous layer to a pH less than 8.55The process of claim 54 wherein in step (h)(iii)(3) or (f’)(iii)(3), the aqueous layer is washed with dichloromethane and/orwherein in step (h)(iv) or (f’)(iv), the compound of formula(XIV),or a boronic acid anhydride thereof, is extracted into dichloromethane, the solvent is exchanged to ethyl acetate, and the compound of formula(XIV),or a boronic acid anhydride thereof, is crystallized by addition of hexane or heptane.56The process of claim 55,wherein addition of hexane or heptane results in crystallization of a cyclic trimeric boronic acid anhydride of formula(XXIV):",
        "Annex 2: Asserted claims in SG 29P": "The table below summarises the asserted claims in SG 29P: Claim NoDescription1A process for forming a compound of formula (XIV):or a boronic acid anhydride thereof, comprising the steps:(e’) coupling of a compound of formula (XVIII), or an acid addition salt thereof:with compound of formula (XIXa):wherein the moiety –C(O)X is an activated ester generatedin situby contacting N-(2-pyrazinecarbonyl)-L-phenylalanine with a peptide coupling reagent, to form a compound of formula (XXIII):(f') deprotecting the boronic acid moiety to form the compound of formula (XIV) or a boronic acid anhydride thereof.2The process of claim 1, wherein in the compound of formula (XIXa) the moiety C(O)-X is an O-(N-hydroxysuccinimide) ester.3The process of claim 2, wherein the compound of formula (XIXa) is generatedin situby contacting N-(2-pyrazinecarbonyl)-L-phenylalanine with a carbodiimide peptide coupling reagent and N-hydroxysuccinimide.4The process of claim 3, wherein the carbodiimide peptide coupling reagent is dicyclohexylcarbodiimide.6The process of any preceding claim, wherein the boronic acid deprotecting step (f') comprises the steps:(i) providing a biphasic mixture comprising the compound of formula (XXIII), an organic boronic acid acceptor, a lower alkanol, a C5-8 hydrocarbon solvent, and aqueous mineral acid;(ii) stirring the biphasic mixture to afford the compound of formula (XIV);(iii) separating the solvent layers; and(iv) extracting the compound of formula (XIV), or a boronic acid anhydride thereof, into an organic solvent."
    }
}