{
    "case_title": "Ng Lai Kuen Priscilla Elizabeth and others vNg Choong Keong Steven",
    "ncitation": "[2023] SGHC 343",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 This action is brought by three older sisters against their younger brother.1Foot Note 1×Defendant’s Closing Submissions (“DCS”) para 2.Their dispute is over the ownership of a commercial property in Veerasamy Road (“the Property”).2Foot Note 2×Plaintiffs’ Closing Submissions (“PCS”) para 1.The Property was conveyed to the siblings’ father (“the Father”) and the defendant as joint tenants in November 1995. It is not in dispute that the Father paid the entirety of the purchase price for the Property.3Foot Note 3×DCS at para 51.The Father died in December 2016.4Foot Note 4×PCS para 3.The siblings’ mother (“the Mother”) died in August 2017.5Foot Note 5×PCS para 3. 2 The plaintiffs’ primary case is that the defendant holds his interest in the Property on a presumed resulting trust for the Father. The plaintiffs’ alternative case is that the defendant holds his interest in the Property on a constructive trust for the Father or for the four siblings in equal shares. 3 The defendant’s case in response is that the Father intended to benefit the defendant when the Property was purchased. As a result, no presumed resulting trust arose in favour of the Father. The defendant claims that he is now the sole and absolute owner of the Property as the sole surviving joint tenant. Further, the defendant submits that no constructive trust ever arose over the Property, whether in favour of the Father or the four siblings, and whether on the facts or on the law.6Foot Note 6×DCS at para 11. 4 I have accepted the plaintiffs’ primary case. I have found that the defendant holds his interest in the Property on resulting trust for the Father. The result is that each of the four siblings has acquired a 25% share of the beneficial interest in the Property through the combined effect of the Father’s intestacy7Foot Note 7×DAEIC at p 124.and the Mother’s will (see [25] below).8Foot Note 8×SOC at para 12; DAEIC at p 134. 5 The defendant has appealed against my decision. I now set out the grounds for my decision.",
        "The parties": "6 The first, second and third plaintiffs are the three older sisters of the defendant, named in birth order. The fourth plaintiff is the Father’s estate, represented by the first plaintiff as his sole administrator.9Foot Note 9×DAEIC at p 124.The fifth plaintiff is the Mother’s estate, represented by the first plaintiff as her sole executrix.10Foot Note 10×DCS para 4.For convenience, I shall use the term “the plaintiffs” to refer only to the first, second and third plaintiffs,ieto the three sisters as individuals, excluding their parents’ estates. 7 The defendant is the youngest of the four siblings. He is the only son in the family.11Foot Note 11×DAEIC at para 9.",
        "Background facts": "",
        "The Property": "8 From 1985 until he died in 2016, the Father was the sole proprietor of a hardware business (“the Business”) operating at the Property.12Foot Note 12×SOC at para 5; PCS at para 11; DAEIC at para 17.The Father managed the operational side of the Business, with the Mother handling the takings.13Foot Note 13×PCS at para 11; Hui King Kit’s Affidavit of Evidence in Chief at paras 9, 11 and 13; Certified Transcript, Day 5 (10 Sep 2021), p 6 lines 10–28. 9 From 1985 to 1995, the Business operated from the Property under a succession of one-year leases from the Housing and Development Board (“HDB”).14Foot Note 14×PCS para 140; Certified Transcript, Day 5 (10 Sep 2021), p 7 lines 25–28.In 1995, the HDB offered to sell an 89-year lease of the Property to the Father at a discounted price of $403,40015Foot Note 15×DAEIC at p 94; Hui King Kit’s Affidavit of Evidence in Chief at para 8.under its Sale of Tenanted Shops Scheme (“the Scheme”).16Foot Note 16×PCS at paras 140, 142; Certified Transcript, Day 4 (9 Sep 2021) at 12:15–24.The Father accepted the offer. He secured the necessary financing to purchase the Property from the Development Bank of Singapore Ltd (“DBS”).17Foot Note 17×DCS at para 62; DAEIC at para 20.In September 1995, the Father and the defendant executed the loan, security and conveyancing documents for the purchase.18Foot Note 18×DAEIC at para 20.In November 1995, the HDB conveyed the Property into the names of the Father and the defendant as joint tenants.19Foot Note 19×SOC at para 7; PCS at para 12; DAEIC at p 104–105.Upon the conveyance, as is usual, DBS took possession of the original certificate of title for the Property. 10 As I have mentioned, it is not in dispute that the Father paid the entirety of the purchase price for the Property.20Foot Note 20×DCS at para 51.It is true that the Father and the defendant were joint borrowers in respect of the loan from DBS. But the defendant accepts that the Father, from the outset, undertook and discharged sole responsibility for repaying the loan.21Foot Note 21×Certified Transcript, Day 5 (10 Sep 2021), p 5 lines 5–10.The defendant accordingly accepts that the Father repaid the entirety of the principal and all of the interest due under the loan from DBS.22Foot Note 22×SOC at para 8; Defence and Counterclaim (Amendment No. 2) (“Defence”) at para 9A; PCS at para 13; DCS at para 51.Even though the defendant suggests that he was the source of some money that may have been used to repay the mortgage, it is not his case that he contributed to the purchase of the Property in any way, directly or indirectly.23Foot Note 23×DAEIC at para 25. 11 It is equally not in dispute that the Father was the sole beneficial owner of the Property during his lifetime.24Foot Note 24×PCS at 44; DCS at para 72–73.As a result, the Father paid entirely for the upkeep and maintenance of the Property, including all of its outgoings such as the utilities and conservancy charges.25Foot Note 25×PCS at paras 13 and 44; DCS at para 231; Certified Transcript, Day 5 (10 Sep 2021) at 5:11–30; 45:29–32; 46:1–8.Further, the Father paid no rent to the defendant for occupying the Property. The Father did not even account to the defendant in any notional sense for apro ratarent for occupying the Property.26Foot Note 26×Certified Transcript, Day 5 (10 Sep 2021) at 54:24–55:8.Likewise, the defendant did not ask the Father to do so and had no expectation that he should do so.27Foot Note 27×DAEIC at paras 22–23; Certified Transcript, Day 5 (10 Sep 2021) at 40:17–26. 12 The Father completed repaying the DBS loan in May 2016.28Foot Note 28×DAEIC at para 28.He was therefore in a position, at any time from May 2016 onwards, to procure a formal and total discharge of DBS’s security interest in the Property. Despite this, the Father took no steps to secure the discharge of DBS’s security interest. He did not even take any steps to recover the original certificate of title from DBS.29Foot Note 29×DCS at para 20. 13 Upon the Father’s death in December 2016, the Mother took over the Business as its sole proprietor. She continued to operate it from the Property30Foot Note 30×DRS at para 120; PCS at para 15; DAEIC at para 29.with the assistance of the first and third plaintiffs.31Foot Note 31×DAEIC at para 30; Hui King Kit’s Affidavit of Evidence in Chief at para 7.The Mother continued to pay for the entire upkeep and maintenance of the Property, including all of its outgoings such as utilities and conservancy charges.32Foot Note 32×PCS at paras 15.The Mother did not pay or account to the defendant for rent in any way. The defendant did not ask the Mother to do so and had no expectation that she should do so.33Foot Note 33×DAEIC at para 36; Certified Transcript, Day 5 (10 Sep 2021) at 48:31–49:7. 14 The Mother died on 1 August 2017.34Foot Note 34×PCS para 3.She left a will dividing the residue of her estate equally between the four siblings.35Foot Note 35×DAEC at p 136. 15 After the Mother’s death, the second plaintiff joined the first and third plaintiffs in helping the Mother run the Business.36Foot Note 36×Hui King Kit’s Affidavit of Evidence in Chief at para 7.The plaintiffs paid for the upkeep and maintenance of the Property, including all of its outgoings, out of the takings of the Business.37Foot Note 37×Certified Transcript, Day 5 (10 Sep 2021) at 49:22–29.The plaintiffs did not pay or account for rent to the defendant. The defendant did not ask them to do so and had no expectation that they should so do.38Foot Note 38×Certified Transcript, Day 5 (10 Sep 2021) at 54:5–22. 16 The four siblings held two family meetings on 13 August 2017 and 15 August 2017.39Foot Note 39×PCS at para 16.The scope of the discussions at these meetings is disputed. In particular, the plaintiffs allege that the discussions encompassed both the Business and the Property, whereas the defendant alleges that the discussions encompassed only the Business. But it is not disputed that the discussions at these meetings formed, at the very least, the basis on which the plaintiffs continued to operate the Business from the Property after the Mother’s death.40Foot Note 40×PCS at para 17; DCS at para 38. 17 In January 2018, the defendant received a letter from the HDB telling him that it had updated its administrative records upon the Father’s death to reflect that the defendant was now the sole owner of the Property.41Foot Note 41×DAEIC at para 34 and p 128.The HDB also told the defendant that he may wish to consult a solicitor for advice on any legal steps to be taken at the registry of titles arising from the Father’s death. 18 In March 2018, the defendant secured the formal and total discharge of DBS’s security interest in the Property. He then recovered the original certificate of title from DBS.42Foot Note 42×DAEIC at para 35; Certified Transcript, Day 5 (10 Sep 2021) at 65:10–16.It appears, however, that the defendant has not taken any legal steps to reflect himself as the sole owner of the Property on the register of titles. As a result, the Father and the defendant continue to be reflected on the register of titles as the joint tenants of the Property.43Foot Note 43×1 AB 529; Certified Transcript, Day 5 (10 Sep 2021) at 64:4–6. 19 In January 2018,44Foot Note 44×DAEIC at paras 56 to 60.the plaintiffs approached the defendant seeking confirmation that he would share the net proceeds of sale of the Property equally among the four siblings. The defendant responded by taking the position for the first time that, as the sole surviving joint tenant, he was now the sole and absolute owner of the Property. The plaintiffs sought the same confirmation in September 2019.45Foot Note 45×DAEIC at paras 69 to 71.The defendant again took the position that he was now the sole and absolute owner of the Property. 20 In October 2019, the defendant procured a valuation of the Property. That valuation shows that the Property was then worth just over $500,000.46Foot Note 46×DAEIC at p 158. 21 In November 2019, the defendant told the plaintiffs that he intended to sell the Property.47Foot Note 47×SOC at para 16; PCS at para 18.The plaintiffs responded by lodging a caveat against the Property. The grounds for the caveat were that the defendant was holding the property on trust for the Father.48Foot Note 48×DAEIC at p 148. 22 In January 2020, the defendant filed an application to have the caveat cancelled as a vexatious caveat.49Foot Note 49×DAEIC at p 153. 23 In February 2020, the plaintiffs commenced this action, claiming that each of the four siblings had a 25% interest in the Property.",
        "The parties’ cases": "24 As I have mentioned, three critical points are undisputed. First, the Father paid the entire purchase price for the Property.50Foot Note 50×PCS at para 13; DCS at para 35.Second, this fact gives rise to a presumption that the defendant holds the Property on resulting trust for the Father.51Foot Note 51×PCS at para 6; DCS at paras 53 and 137(a).Third, the Father was the sole beneficial owner of the Property during his lifetime.52Foot Note 52×PCS at para 44; DCS at para 72–73.",
        "The plaintiffs’ case": "37 The plaintiffs submit that the presumption of resulting trust has not been rebutted either by evidence or by the presumption of advancement for the following reasons. There is simply no evidence that the Father had any intention to benefit the defendant at the time of the Property was purchased.65Foot Note 65×PCS at paras 110–171.Further, in the circumstances of this case, the presumption of advancement arises only weakly.66Foot Note 66×PCS at paras 178–180.Given the weakness with which it arises, the evidence available suffices to rebut the presumption of advancement.67Foot Note 67×PCS at paras 172–214.",
        "The defendant’s case": "33 The defendant submits that he has adduced sufficient evidence to rebut the presumption of resulting trust for the following reasons. 34 The evidence shows that the Father intendedat the timethe Property was purchasedin 1995: (a) to be the sole beneficial owner of the Property during the Father’s lifetime; and (b) to benefit the defendant with the right of survivorship upon the Father’s death.62Foot Note 62×DCS at paras 9, 34 and 59.That explains why the Father treated the Property during his lifetime as though he were its sole beneficial owner.63Foot Note 63×DCS at para 73.That also explains why the defendant permitted him to do so. This evidence rebuts the presumption of resulting trust with respect to the right of survivorship in the Property while leaving it unrebutted with regard to the Property itself. 35 In the alternative, the presumption of advancement rebuts the presumption of resulting trust in respect of the right of survivorship.64Foot Note 64×DCS at paras 10 and 36.The plaintiffs have adduced no evidence to show that the Father intended to retain his sole beneficial interest in the Property after his own death. The plaintiffs have therefore failed to rebut the presumption of advancement with respect to the right of survivorship. 36 The defendant’s case assumes that the right of survivorship arising from a joint tenancy is a right of property and is therefore capable of being the subject matter of a resulting trust. I do not accept that assumption as being correct. However, for reasons that will become apparent, it is more convenient to deal with this point later, together with the presumption of advancement (see [91]–[93] below). I will, for the time being, proceed on the basis that the defendant’s assumption is correct.",
        "Resulting trust": "31 I begin by analysing the plaintiffs’ case that the defendant held the Property on a resulting trust for a Father when the Property was purchased in their names as joint tenants in 1995. 32  The three critical points that are undisputed (see [24] above) mean that the issue I must determine is whether the defendant has rebutted the presumption of resulting trust either by evidence or by the operation of the presumption of advancement. As this casts the evidential burden on the defendant, I begin my analysis with the defendant’s case rather than the plaintiffs’ case.",
        "The law": "38 A resulting trust arises when (a) property is transferred to a person (“the transferee”) by or at the direction of another (“the transferor”) (b) in circumstances in which the transferor lacks the intention to benefit the transferee. A resulting trust is presumed to arise if the transferee does not provide the whole of the consideration for the transfer to the transferor. What is being presumed is that the transferor lacked the intention to benefit the transferee. It is that lack of intention that gives rise to a resulting trust (Lau Siew Kim v Yeo Guan Chye Terence and another[2008] 2 SLR(R) 108 (“Lau Siew Kim”)at [35], citing Robert Chambers,Resulting Trusts(Clarendon Press, Oxford, 1997) at p 32.) 39 The presumption of advancement operates when a transferor and a transferee are in one of a limited number of relationships. When the presumption of advancement operates, the transferor is presumed to intend to benefit the transferee unless there is evidence to the contrary. This presumed intention makes it is no longer possible to find that the transferor lacked the intention to benefit the transferee. That suffices, in itself, to prevent a resulting trust from arising. 40 Relying on these two presumptions should be the last resort in ascertaining disputing parties’ proprietary rights. The presumptions operate only where there is no direct evidence that may reveal the intention of the transferor (Lau Siew Kimat [59]). This is because both the presumption of resulting trust and the presumption of advancement amount to imputing an intention to a transferor. There is an important conceptual difference between an imputed intention on the one hand and an express or inferred intention on the other. An imputed intention involves attributing to a person an intention even though that intention cannot be deduced from his actions and statements and regardless of whether he actually had any such intention (Stack v Dowden[2007] 2 AC 432 (“Stack”) at [125]–[127] per Lord Neuberger). It is for this reason that reliance on these two presumptions should be a last resort. 41 I consider it appropriate in this case to rely on these two presumptions in ascertaining the parties’ proprietary rights. The central issue is whether the Father lacked the intention to benefit the defendant at the time the Property was purchased. Like the father inLau Siew Kim, the Father in the present case is no longer alive. He cannot give direct evidence of his actual intention within the meaning of s 62(1) of the Evidence Act 1893 (2020 Ed). Nor is there any objective evidence before me capable of proving, either directly or by inference, what his actual intention was with regard to the right of survivorship (subject to my assumption (see [36] above)). It is therefore appropriate to rely on the presumptions and on circumstantial evidence to determine his intention with regard to the right of survivorship:Chan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 (“Chan Yuen Lan”) at [50]–[51], citingLau Siew Kimat [59]. The defendant’s concession68Foot Note 68×DCS at paras 51, 53 and 137(a).that the presumption of resulting trust arises amounts to accepting that the correct approach to ascertaining the parties’ proprietary rights is to commence the analysis with the presumption of resulting trust. 42 Turning to the law, the Court of Appeal inChan Yuen Lanset out the framework to be applied when ascertaining the beneficial interests in a property where its joint owners make unequal contributions towards its purchase and have not declared an express trust over it (Chan Yuen Lanat [160]): (a) Is there sufficient evidence of the parties’ respective financial contributions to the purchase price of the property? If the answer is “yes”, it will be presumed that the parties hold the beneficial interest in the property in proportion to their respective contributions to the purchase price (ie, the presumption of resulting trust arises). If the answer is “no”, it will be presumed that the parties hold the beneficial interest in the same manner as that in which the legal interest is held. (b) Regardless of whether the answer to (a) is “yes” or “no”, is there sufficient evidence of an express or an inferred common intention that the parties should hold the beneficial interest in the property in a proportion which is different from that set out in (a)? If the answer is “yes”, the parties will hold the beneficial interest in accordance with that common intention instead, and not in the manner set out in (a). In this regard, the court may not impute a common intention to the parties where one did not in fact exist. (c) If the answer to both (a) and (b) is “no”, the parties will hold the beneficial interest in the property in the same manner as the manner in which they hold the legal interest. (d) If the answer to (a) is “yes” but the answer to (b) is “no”, is there nevertheless sufficient evidence that the party who paid a larger part of the purchase price of the property (“X”) intended to benefit that other party (“Y”) with the entire amount which he or she paid? If the answer is “yes”, then X would be considered to have made a gift to Y of that larger sum and Y will be entitled to the entire beneficial interest in the property. (e)  If the answer to (d) is “no”, does the presumption of advancement nevertheless operate to rebut the presumption of resulting trust in (a)? If the answer is “yes”, then: (i) there will be no resulting trust on the facts where the property is registered in Y’s sole name (ie, Y will be entitled to the property absolutely); and (ii) the parties will hold the beneficial interest in the property jointly where the property is registered in their joint names. If the answer is “no”, the parties will hold the beneficial interest in the property in proportion to their respective contributions to the purchase price. (f)  Notwithstanding the situation at the time the property was acquired, is there sufficient and compelling evidence of a subsequent express or inferred common intention that the parties should hold the beneficial interest in a proportion which is different from that in which the beneficial interest was held at the time of acquisition of the property? If the answer is “yes”, the parties will hold the beneficial interest in accordance with the subsequent altered proportion. If the answer is “no”, the parties will hold the beneficial interest in one of the modes set out at (b)–(e) above, depending on which is applicable. 43 I now apply theChan Yuen Lanframework to determine the Father’s and the defendant’s proprietary rights in the Property.",
        "Presumption of resulting trust": "44 At step (a) of theChan Yuen Lanframework, the Father is presumed, at the time the Property was purchased in 1995, to have lacked any intention whatsoever to benefit the defendant. That is because the defendant contributed nothing whatsoever to the purchase of the Property. The defendant is therefore presumed to hold his legal interest in the Property on a resulting trust for the Father from the date the Property was purchased: seeTan Chin Hoonand others v Tan Choo Suan (in her personal capacity and as executrix of the estate of Tan Kiam Toen, deceased) and others and other matters[2015] SGHC 306 (“Tan Chin Hoon”) at [216]. 45 The question then is whether the Father intended to benefit the defendant with the right of survivorship (subject to the assumption I have made at [36] above). The defendant submits that the Father’s intention to do so is established either: (a) by the evidence; or (b) by the presumption of advancement. 46 The only legally relevant time at which to ascertain the Father’s intention or lack of intention is at the time the Property was purchased in 1995. His intention at any other time, whether earlier or later, is legally irrelevant. That is because a presumed resulting trust comes into existence and binds the property and the resulting trustee only at the time the subject matter of the trust is purchased:Lau Siew Kimat [112], citingCurley v Parkes[2004] EWCA Civ 1515 andCalverlyv Green(1984) 155 CLR 242 at 252. Unless the context requires otherwise, therefore, all further references to the Father’s intention are references to his intention at the time the Property was purchased in 1995. 47 I do not accept the defendant’s case that the Father intended to benefit the defendant with the right of survivorship. I say that for two reasons. First, the available evidence is insufficient to prove on the balance of probabilities that the Father intended to benefit the defendant with the right of survivorship. Second, in my view, the presumption of advancement arises only weakly in this case and is rebutted by circumstances warranting the inference that the father had no intention to benefit the defendant with the right of survivorship. No evidence of the Father’s intention to benefit the defendant 48 The defendant relies on five critical facts to argue that the Father intended to benefit the defendant with the right of survivorship.69Foot Note 69×DCS at paras 59 and 71.The five critical facts are as follows. First, the Father announced his intention to benefit the defendant with the right of survivorship at a meeting in August 1995.70Foot Note 70×DCS at para 58.Second, the Father understood that the legal consequence of purchasing the Property with the defendant as a joint tenant was that the defendant would become the absolute owner of the property when the Father died.71Foot Note 71×DCS at paras 64–69.Third, the defendant was a joint borrower under the loan from DBS, and therefore would not have taken on that risk without some benefit,iethe benefit of the right of survivorship.72Foot Note 72×DCS at para 70.Fourth, even after the Father had repaid the DBS loan in full in May 2016, he took no steps to remove the defendant as a joint owner of the Property and thereby to extinguish the defendant’s right of survivorship.73Foot Note 73×DCS at para 90.Finally, even after the Father had repaid the DBS loan in full in May 2016, he did not secure the formal and total discharge of DBS’s security interest in the Property and instead paid DBS an annual fee for continuing to safekeep the original certificate of title.74Foot Note 74×DCS at paras 95–107. 49 For the following reasons, I do not accept these five critical facts suffice to rebut the presumption of advancement. (1) Meeting with the Father in August 1995 50 The first critical fact that the defendant relies on is the Father’s announcement of an intention to benefit the defendant with the right of survivorship at a meeting that the defendant had with the Father in the presence of the Mother in August 1995, shortly before the defendant’s wedding.75Foot Note 75×DCS at para 58.The defendant submits that the Father evinced at this meeting a deliberate choice to purchase the Property with a joint tenant and to name the defendant as that joint tenant, to the exclusion of the Mother and any of the plaintiffs.76Foot Note 76×DCS at para 59. 51 The defendant’s account of this meeting is that the Father told the defendant in Cantonese that the Father would be purchasing the Property and that he and the defendant would “join name”:77Foot Note 77×DCS at para 57; DAEIC at para 19; Certified Transcript, Day 5 (10 Sep 2021) at 40:29–41:8. 19. Sometime in August 1995, I met up with my father and mother at the family home…. After we finalized the wedding arrangements, my father said that he was purchasing the Property and both of us will “join name” (“联名” in Cantonese). It was his intention that I would inherit the Property because I was his only son. I was also getting married and he would have intended to provide for me and my new family as well. As far as I know, my father had similarly inherited everything my grandfather owned. 52 Even if I take the defendant’s account of this meeting at its highest, it does not warrant the inference that the defendant invites me to draw from it as to the Father’s intention. I say that for three reasons. 53 First, according to the defendant, all that the Father said at this meeting was that the Father was purchasing the Property and that he and the defendant would “join name”. The phrase “join name” says nothing expressly or impliedly about the Father’s intention to benefit the defendant with the right of survivorship or with any other interest in the Property. The defendant relies solely on the Father’s use of this phrase to advance two submissions about the Father’s intention: (a) that the Father intended that the defendant “would inherit” the Property just as the Father had inherited the Business from his own father (the defendant’s grandfather) because the defendant was the Father’s only son; and (b) the Father “would have” intended to provide for the defendant and his new family in view of the defendant’s impending marriage.78Foot Note 78×DAEIC at para 19.But even on the defendant’s account of the meeting, the Father said none of this to the defendant, expressly or even impliedly. 54 When the defendant was cross-examined at trial on his account of this meeting, he accepted that his evidence of the Father’s intention was only his “understanding”79Foot Note 79×Certified Transcript, Day 5 (10 Sep 2021) at 40:29–43:4 at 41:2 and 41:13.and the “sense”80Foot Note 80×Certified Transcript, Day 5 (10 Sep 2021) at 37: 8–12.that he got from the Father’s use of the phrase “join name”. When pressed on this point, the defendant suggested faintly that the Father had in fact used some additional words to convey his alleged intention to benefit the defendant,iesome words additional to the phrase “join name”. But when asked for specifics, the defendant said that he could not remember the Father’s exact additional words.81Foot Note 81×Certified Transcript, Day 5 (10 Sep 2021) at 109:29–110:3.I consider the defendant’s evidence that the Father used some unspecified additional words to be clearly an afterthought on the defendant’s part. I reject that evidence. 55 Second, the understanding or sense that a lay person speaking without the benefit of legal advice would be most likely to convey by using the phrase “join name” in connection with the purchase of property is that the two jointly named owners are to be immediate and absolute co-owners of the property. Such a person would not intend to convey anything about the legal distinction between a tenancy in common creating proprietary interests that endure beyond death of a joint owner or a joint tenancy creating a proprietary interest that terminates upon the death of a joint owner. A lay person would be even less likely to think of the infinitely more subtle and technical legal distinction between ownership at common law and ownership in equity. The inherent probabilities are therefore that the Father would have meant by the words “join name” simply that he and the defendant were to be immediate joint owners of the Property, with an equal and immediate right to enjoy the Property, either by using it or by deriving an income from it, without giving any thought to what was to happen to the Property after one of them died. 56 But that is not the defendant’s case as to the Father’s intention. The defendant’s case is that the Father intended to be the sole beneficial owner of the Property during his lifetime, to the exclusion of the defendant and that the Father intended by the words “join name” only that the defendant would “inherit” the Property upon the Father’s death. I consider it inherently and highly improbable that the Father intended to convey this intention by the phrase “join name”. The defendant’s case requires me to accept that the Father formedoneintention that the Father was to be the sole beneficial owner of the Property during his lifetime even though the defendant was a “join name” and formed an entirelyseparateintention that the defendant was to become the sole and absolute owner of the Property when the Father died. Lay persons, particularly family members, do not generally think about the manner in which they are to hold interests in property at all, let alone at such depth and in such sophisticated terms. 57 Third, the defendant uses the word “inherit” to describe the Father’s intention at this meeting (see [51] above).82Foot Note 82×DAEIC paras 8 and 19.This is not the only occasion the defendant uses the word in this way. He uses the same word in his cross-examination,83Foot Note 83×Certified Transcript, Day 5 (10 Sep 2021) at 43:16–17.in his written submissions84Foot Note 84×DCS at para 69.and even in his defence, as originally pleaded.85Foot Note 85×Defence at para 10.On other occasions, he refers to the Father’s intention as an intention to “leave” the Property to the defendant.86Foot Note 86×DAEIC paras 24 and 28. 58 Bearing in mind that the defendant is a lay person, I am prepared to give him the benefit of the doubt by taking his use of the words “inherit” and “leave” not be legal terms of art but simply to mean that the Father intended the defendant to become the sole and absolute owner of the Property upon the Father’s death. But even if the Father intended this, there are many routes by which he could have achieved that intention. The most obvious route, and the one that an unsophisticated lay person such as the Father would most likely intend, would be to make a gift of the Property to the defendant by will. I consider it inherently improbable that the Father would have intended a purchase in “join name” to mean a purchase as joint tenants and would have intended the resulting right of survivorship to be the route by which to achieve his intention. Indeed, even on the defendant’s case, the earliest that the Father was legally advised that the right of survivorship was an incident of a joint tenancy was September 1995, well after this meeting. (2) Meeting with the conveyancing solicitors in September 1995 59 The second critical fact that the defendant relies on is that the Father understood the legal nature of a joint tenancy and that the consequence of purchasing the Property with the defendant as a joint tenant was that the defendant would become the sole and absolute owner of the Property when the Father died by the right of survivorship.87Foot Note 87×DCS at paras 63, 68–69.The defendant says that the Father acquired this understanding at a meeting with his conveyancing solicitors in September 1995 at which the solicitors explained to the Father in Mandarin the consequence of holding the property with the defendant as joint tenants before the Father and the defendant signed the purchase and security documents in preparation for completion. 60 The plaintiffs do not accept that the conveyancing solicitors explained the legal nature and consequences of purchasing the Property on a joint tenancy to the Father at this meeting.88Foot Note 88×PCS at para 126.Further, they point out that the conveyancing documents were entirely in English and that the solicitors interpreted the contents of these documents to the Father only in Mandarin.89Foot Note 89×PCS at para 126.It is the plaintiffs’ case that the Father spoke and understood only Cantonese, and not English or Mandarin.90Foot Note 90×PCS at para 128.As such, the plaintiffs submit, he could not have understood the solicitors’ explanation. In response, defendant says that, even though the Father spoke only Cantonese, he understood Mandarin and therefore understood the solicitors’ explanation.91Foot Note 91×Certified Transcript, Day 5 (10 Sep 2021) at 33:7–33:22. 61 It is not disputed that this meeting took place. Having regard to the legal and ethical duties of conveyancing solicitors acting for a purchaser of real property, I consider the inherent probabilities to be that the solicitors did explain to the Father the legal nature and consequences of purchasing the Property as a joint tenant, and that they did so in a language and in a manner that he could and did understand. Moreover, where a party is legally represented at the time of purchasing property as a joint tenant, theprima facieinference to be drawn is that that party gave informed consent to hold the property as joint tenants at law: seeLau Siew Kimat [137]. 62 But I do not accept the defendant’s submission that the Father’s understanding of the explanation is evidence of the Father’s intention to benefit the defendant with the right of survivorship. To my mind, there are many equally plausible reasons for the Father to agree to purchase the Property as a joint tenant with knowledge of the nature and consequences of a joint tenancy. The Father could simply have been indifferent to the legal consequence of holding the Property with the defendant as a joint tenant because the Father intended to be the sole beneficial owner of the Property during his lifetime. The defendant himself concedes that, as the Property’s sole beneficial owner, it was within the Father’s power during his lifetime to destroy the defendant’s right of survivorship without the defendant’s consent simply by removing the defendant as a joint tenant.92Foot Note 92×DCS at para 90.Given that concession, the Father could equally have destroyed the defendant’s right of survivorship by selling the Property. He could even have diluted the defendant’s right of survivorship by adding more joint tenants, whether other family members or even strangers. He could also have hollowed out the defendant’s right of survivorship by raising further loans on the security of the Property. Given all of this, I consider it more likely that the Father accepted the solicitors’ explanation of the nature and consequences of a joint tenancy because he intended to be the Property’s sole and absolute beneficial owner during his lifetime and was therefore indifferent to what was to happen to the Property after his death. 63 Further, even if the Father was not indifferent to what was to happen to the Property after his death and formed an intention in that regard, I consider it unlikely that that intention was to benefit the defendant with the right of survivorship in the Property. I say that for two reasons. 64 First, if the Father formed any intention at all as to what was to happen to the Property after his death, I consider it far more likely that he intended the Property to continue to be a permanent and stable location from which the Business could continue to operate. The rent for the Property had doubled from 1985 to 1995.93Foot Note 93×Certified Transcript, Day 5 (10 Sep 2021) at 8:4–8:7.In 1995, the HDB offered the Father the opportunity to purchase the Property under the Scheme at a discount.94Foot Note 94×PCS at paras 140, 142; Certified Transcript, Day 4 (9 Sep 2021) at 12:15–24.By accepting the HDB’s offer, the Father secured for the Business three considerable advantages. First, he freed the Business from the obligation to pay rent and replaced it with an obligation to repay the DBS loan. That allowed him to divert the money that would have gone towards paying an expense into building equity in an asset, with the possibility of that asset enjoying capital appreciation over the tenor of the loan. The Father would also have anticipated that, by the time of his death, he would have repaid the DBS loan in full, thereby allowing the Business to occupy the Property free even of interest costs. Second, he acquired premises from which the Business could operate permanently. The business would not have to move again as it had been forced to in 1985. Third, he freed the Business from the risk of the rent escalating yearly, as it had from 1985 to 1995. The defendant accepts all of this.95Foot Note 95×Certified Transcript, Day 5 (10 Sep 2021) at 7:12 to 8:22; 12:5–12.I therefore consider it far more likely that – if the Father formed any intention at all about what was to happen to the Property after his death – his intention would have been that the Property should continue to be a permanent location from which the Business could operate cost-free. I consider it unlikely that the Father would have intended, upon his death, to make the defendant the new landlord of the Business and to expose the Business to a potential obligation to pay rent for the first time since 1995. 65 Second, it appears to me unlikely that the Father intended that the Property should pass solely and absolutely to the defendant immediately upon the Father’s death. I bear in mind the Father’s and the family’s straitened financial circumstances in 1995. That suggests that the Father would want the Business and the Property to continue as a single commercial and economic unit under common ownership to provide financially for the Mother after his death. I consider it highly unlikely that the Father would intend the Property to go to the defendant while the Business went to the Mother. The Father would have expected that the defendant would, by the time of the Father’s death, be financially independent and be under a duty to provide financially for his own family. The Father would have been aware that the defendant may well, quite naturally and understandably, prioritise that duty over a filial duty to provide financially for the widowed Mother. It therefore appears to me likely that, if the Father formed any intention at all about what was to happen to the Property after his death, that intention was for the Property and the Business to support the Mother in her widowhood rather than to benefit the defendant. 66 The question remains why the Father went ahead and named the defendant as a joint tenant knowing the legal consequence of doing so if he had no intention to benefit the defendant with the right of survivorship. On this point, I accept the plaintiffs’ submission that doing so allowed the Father to get better terms for the loan from DBS. The defendant was the youngest child of the family. He was also then in a stable job with a sufficiently high salary. The Father named the defendant not only as a joint tenant for the Property but also as a joint borrower for the loan from DBS. Having the defendant as a joint borrower allowed the Father to secure a loan from DBS at a lower interest rate and on a longer tenor. This reduced the monthly repayments significantly.96Foot Note 96×PCS at para 35–36.This, in turn, eased the burden on the limited cashflow generated by the Business. 67 For all these reasons, I do not accept that the Father’s knowledge of the nature and consequence of a joint tenancy is evidence that he intended to benefit the defendant with the right of survivorship. (3)  The defendant was a joint borrower under the DBS loan 68 The third critical fact that the defendant relies on is that the defendant was a joint borrower under the DBS loan. The defendant submits that he would not have taken on that risk without some benefit,iethe anticipated benefit of the right of survivorship.97Foot Note 97×DCS at para 70. 69 I reject this submission out of hand. It goes only to the defendant’s intention, not to the Father’s intention. The defendant’s intention is quite immaterial in the resulting trust analysis. (4) The Father took no steps to remove the defendant as a joint tenant 70 The fourth critical fact that the defendant relies on is that, even after the Father had repaid the DBS loan in full in May 2016, he took no steps to remove the defendant as a joint tenant of the Property. The defendant submits that this is circumstantial evidence of the Father’s intention to benefit the defendant with the right of survivorship. According to the defendant, the Father did not remove the defendant as a joint tenant because he intended to preserve thestatus quoand did not want to open up a “can of worms” by encouraging the plaintiffs or the Mother to ask for a share of the Property.98Foot Note 98×DCS at para 107. 71 I reject this submission for two reasons. 72 First, inaction in itself is equivocal. A person’s inaction is therefore incapable of forming a basis for drawing any inference about his intention. I have already found that the Father was indifferent in 1995 as to what was to happen to the Property after his death; alternatively, that to the extent that he formed any intention at all in this regard, it is more likely than not that he intended the Business to continue to use the Property as permanent premises from which to operate after his death cost free for the benefit of the Mother in her widowhood. The Father’s inaction in 2016 is quite clearly equivocal in that it is equally capable of supporting three different inferences about his intention in 1995: (a) that his intention in 2016 had not changed from his intention in 1995; (b) that he was indifferent as to what would happen to the Property after his death, or (c) that he intended to benefit the defendant. There is simply no basis in the Father’s inaction after repaying the loan from DBS to draw any inference that his intention in 2016 was any different from his intention in 1995. 73 The defendant citesKoh Lian Chye v Koh Ah Leng[2021] SGCA 69 (“Koh Lian Chye”) at [41] as authority for the proposition that a person’s inaction with regard to a property can be a basis from which to draw an inference about his intention to benefit another with an interest in that property. ButKoh Lian Chyewas not a case of an inference drawn from inaction alone. The inference in that case was drawn from a combination of positive action that carried a probative connection to the relevant intention which was then followed by inaction. 74 InKoh Lian Chye, a father took the positive step of seeking legal advice on how to remove all of his sons as joint owners of a property with him. He was advised that doing so would incur stamp duty. He then took no further action. He died about a decade later. The father’s positive action in seeking legal advice on extinguishing his sons’ right of survivorship followed by legal advice on the disadvantages of doing so and his inaction for over a decade was quite clearly a sufficient basis from which to infer that he accepted all of his sons as joint owners of the property and intended to benefit them by naming them as joint owners of the property at the time of purchase (Koh Lian Chyeat [41]). 75 In the present case, the Father’s inaction in failing to remove the defendant as a joint owner of the Property was not preceded by any positive action or a context (such as the legal advice inKoh Lian Chye) that can resolve the equivocal nature of his inaction and give it a positive dimension. I therefore do not consider thatKoh Lian Chyeassists the defendant at all. 76 My second reason for rejecting this submission is that the defendant’s own case is that the Father was the sole beneficial owner of the Property during his lifetime,99Foot Note 99×Certified Transcript, Day 5 (10 Sep 2021) at 39:28–39:29.free to remove the defendant as a joint tenant without the defendant’s consent100Foot Note 100×DCS at para 90.or even to add the plaintiffs or the Mother as additional joint tenants.101Foot Note 101×DCS at para 107.The defendant even accepted that the Father would have been free, a day after the conveyance, to sell the Property without the defendant’s consent. All that the defendant could do in that hypothetical situation was to ask the Father why he had changed his mind:102Foot Note 102×Certified Transcript, Day 5 (10 Sep 2021) at 40:9–40:14. Court:  Okay, so if your father said to you on the day after the conveyance, “I want to sell the property. Sign these documents”, what would you have said? Witness: Your Honour, I do---as I said, I understand as at he intends to pass it to me, so I would definitely ask him as at, “So, Father, why did you change your mind?” 77 Likewise, the defendant considered the Father at liberty unilaterally to charge the Property to raise funds for an investment property that the third plaintiff wanted to purchase, thereby hollowing out what the defendant claims he was to receive upon the Father’s death:103Foot Note 103×Certified Transcript, Day 5 (10 Sep 2021) at 78:5–78:15. A I only remember vaguely that [the third plaintiff] asked me whether I’m open to the idea of mortgaging the property or something like that. And I said, “I’m not sure. Ask Dad”, kind of thing. Yah, if I remember correctly, Dad say no. Q Sorry, you asked who again? A I asked her to ask Father as at, you know, “I’m not sure. Why don’t you ask Father whether want to mortgage to---to any kind of investment?” And if I remember correctly, my father said no or something. Q Why would she have to ask your father? A Because I---if I have no opinion, right, this is my dad’s---my---my and my dad’s property, right? So if I have no opinion, I’m neutral, right? So if Dad say fine, then I’m neutral, you see. I can go along with it. 78 All of this suggests to me that the Father’s failure to remove the defendant as a joint tenant was because the Father was content with thestatus quoin which the Father was the sole and absolute beneficial owner of the Property, free to deal with it as he wished without seeking the defendant’s consent. (5) Allowing DBS to continue to safekeep the certificate of title 79 The fifth critical fact that the defendant relies on is that the Father chose to pay DBS an annual fee of $300 a year to continue to safekeep the certificate of title for the Property even after he had repaid the DBS loan in May 2016. The defendant submits that this is circumstantial evidence of the Father’s intention to benefit the defendant with the right of survivorship. 80 The defendant submits that this shows the Father’s desire to preserve thestatus quoand to avoid opening up a “can of worms” that would result if either the Mother or the plaintiffs took the release of the certificate of title as an opportunity to ask for a share of the Property, contrary to the Father’s intention to benefit the defendant with the right of survivorship.104Foot Note 104×DCS at para 107. 81 There is no evidence to support this submission. I reject it. The probative connection that the defendant posits between DBS continuing to safekeep the original certificate of title in 2016 and the Father’s intention in 1995 to benefit the defendant with the right of survivorship is tenuous at best. The Father purchased the Property to be premises from which the Business could operate permanently and cost free. He therefore had no intention to sell the Property or even to remortgage it. In those circumstances, who he permitted to safekeep the original certificate of title in 2016 can have no probative connection to his intention to benefit the defendant with the right of survivorship. 82 In my view, the Father continued to pay DBS to safekeep the original certificate of title either because it was a matter of convenience for him or a matter of indifference to him who held the original certificate of title. Conclusion 83 For all of the foregoing reasons, I find that the evidence the defendant relies on does not show that the Father had an intention to benefit the defendant with the right of survivorship. 84 Step (d) of theChan Yuen Lanframework is accordingly not made out. The next step in the inquiry is to consider whether the presumption of resulting trust is rebutted by the presumption of advancement.",
        "Presumption of advancement": "85 The presumption of advancement arises only when a gratuitous transfer of property takes place between persons in certain recognised relationships such as a parent-child relationship, a relationship involving a person inloco parentisto a child or a spousal relationship:Tan Chin Hoonat [218]. When the presumption arises, the law presumes a donative intent on the part of the transferor. 86 The relationship between the Father and the defendant gives rise to the presumption of advancement. I nevertheless do not accept the defendant’s alternative submission that the presumption of advancement operates to rebut the presumption of resulting trust in relation to the right of survivorship.105Foot Note 105×DCS at para 123. 87 Fundamental to the defendant’s alternative submission is his concession that the Father did not intend to benefit the defendant with any beneficial interest in the Property in the Father’s lifetime and his counter submission that the Father instead intended only to confer on the defendant a “nuanced” benefit being “the right of survivorship and the surviving joint interest of the Property”.106Foot Note 106×DCS at paras 9, 10, 59, 73 and 136; and pp 47–48. 88 The defendant is forced to advance this “nuanced” alternative submission because the orthodox presumption of advancement is quite clearly rebutted on the defendant’s own case. He accepts that the father did not intend to benefit the defendant with any interest in the Property during the Father’s lifetime. He also accepts that the Father was free to remove the defendant as a joint tenant, to add other joint tenants or to raise further loans on the security of the Property without seeking the defendant’s consent. Thus, the defendant accepts that the Father intended to be and was the sole beneficial owner of the Property during his lifetime. That would ordinarily suffice to defeat any possibility of the presumption of advancement operating in the defendant’s favour. 89 The defendant advances the “nuanced alternative” to escape that result. The defendant is therefore forced to separate the Father’s intention with respect to: (a) the beneficial interest in the Property during the Father’s lifetime; and (b) the right of survivorship arising upon the Father’s death. As authority for separating the father’s donative intent in this way, the defendant relies on the extension to the presumption of advancement recognised inLau Siew Kim. 90 I reject the defendant’s alternative submission for three reasons. First, a right of survivorship is not a right of property capable of being in itself the subject matter of a gift or a trust. Second, the defendant’s reliance on the extension of the presumption of advancement inLau Siew Kimis not well-founded. Finally, and in any event, I consider that the presumption of advancement has been rebutted on the facts of this case. Right of survivorship is not property 91 It is not possible to make a gift of a right of survivorship arising from a joint tenancy of property. The right of survivorship is not property, whether tangible or intangible and whether a chose in possession or a chose in action. The right of survivorship is simply the legal consequence of holding property as joint tenants. It is inseparable as a proprietary right from the joint tenancy itself. 92 Since the right of survivorship is not property, it cannot be the subject of a gift or a trust. The only way for the Father to split his interest in the Property temporally into a life interest vested in him and a right to the Property upon his death accruing to the defendant would have been by declaring an express trust to that effect. But the Father did not do that. On this basis alone, the defendant’s alternative submission fails, without even considering the scope or operation of the presumption of advancement. 93 Even if I were to assume that a right of survivorship is property and is capable of forming the subject matter of a gift or a trust, I consider that the defendant’s reliance on the extension to the presumption of advancement inLau Siew Kimis not well founded. The extension of the presumption of advancement in Lau Siew Kim 94 As the legal basis of his alternative submission, the defendant relies onobiter dictaof the Court of Appeal inLau Siew Kim. In that case, at [105]–[106], the Court of Appeal suggested that the presumption of a resulting trust need not relate to the entire beneficial interest in the trust property such that, for example, it is possible for one joint owner: (a) to hold a life interest in the property free of any trust while holding the remainder on a presumed resulting trust for the joint owner who has made a larger contribution; or (b) to hold a life interest in the property on a presumed resulting trust for the joint owner who has made a larger contribution while holding the remainder free of any trust: 105 … The displacement of the presumption of advancement … is based on the traditional understanding and application of the presumption as one which operates to give the entire beneficial interest of the property to the wife immediately. On our extension of the presumption, the intention that is presumed is not an intention to give absolutely with immediate effect, but, rather, for the rule of survivorship to operate to pass the absolute interest of the property to the survivor of the two spouses. This interpretation is supported by the fact that a resulting trust need not necessarily relate to the entire interest in the property.The presumption of resulting trust may be rebutted as to a lifeinterest, but may still operate in respect of the interest in remainder: see, for example,Napier v Public Trustee(1980) 32 ALR 153.Conversely, the intention may be that the contributing party should receive the income from the purchased property during his life – to this extent the resulting trust prevails, but the property should belong to the benefiting party after his death,ie, the resulting trust is rebutted as to the remainder: see, for example,Youngv Sealey[1949] Ch 278. We are of the view that the presumption of advancement could similarly operate with respect to only part of the interest in the property in question; it may be rebutted as to the life interest of a property but prevail as to the remainder – one such case would be where a property is held on joint tenancy and it is inferred that there is an intention for the rule of survivorship to operate. [emphasis added] 95 The defendant’s reliance on this passage inLau Siew Kimis misplaced for two reasons. 96 First, it is not the defendant’s case that the Father had a mere life interest in the Property. The defendant concedes that the Father was the sole beneficial owner of the Property during his lifetime. But he also accepts that the Father was free to remove the defendant as a joint tenant, to add other joint tenants or to raise further loans on the security of the Property without seeking the defendant’s consent. That is quite different from the Father having a life interest under a trust. A person holding a life interest does not have the right or power to destroy, dilute or hollow out the remainderman’s interests. Whatever the scope of the extension to the presumption of advancement in Lau Siew Kim, it does not extend to the interest that the Father had in the Property on the defendant’s own case. 97 Second, theobiter dictafromLau Siew Kimon which the defendant relies must be read in context. The context makes it clear that the Court of Appeal here was extending the presumption of advancement only as it arises between spouses.  That context is clear from [101]–[102] ofLau Siew Kim: 101 The weight of the authorities seem to favour a pragmatic approach to the presumption of resulting trust in cases involving married spouses. The strength of the presumption appears to be much weaker in cases where married spouses who contribute jointly (whether in equal proportions or otherwise) to the purchase of a property (in particular, their matrimonial homes) hold that property as legal joint tenants. In such instances, there is a presumptive inference that the parties intended to hold the property as joint tenants in equity as well. In our judgment, this position usually accords with reality; indeed,the operation of the rule of survivorship is consistent with the practical workings of an ordinary, caring matrimonial relationship. However, instead of considering this inference at the stage of the presumption of resulting trust,we are of the view that it is more appropriately accommodated within the framework of the presumption of advancement which should, in any event, be raised and applied in cases concerning spouses. 102 In fact, Mason and Brennan JJ had also proposed that Lord Upjohn’s inference might be able to qualify the presumption of advancement in favour of a wife. This was raised at 260 where they remarked: [I]t can be said that the antiquity of the presumption of advancement does not preclude the elevation of such an inference to the level of a presumption to be applied where the absence of the spouses’ common intention leaves room for its operation. The doctrines of equity are not ossified in history … We agree with this approach.The presumption of advancement that already arises between husband and wife may be developed and extended to additionally apply in the situation where married spouses purchase property as legal joint tenants; an intention may be inferred on the part of the contributing spouse(s) for the operation of the rule of survivorship. In a typical caring and amiable matrimonial relationship, it will be more probable than not that the parties intended the absolute beneficial ownership of the property to be conferred on the survivor.As is the case for the other applications of the presumption of advancement, a fact-sensitive approach must be taken as well. The nature and state of the relationship are similarly essential when considering the application of the presumption of advancement where spouses hold property as legal joint tenants. In addition, other factors such as the nature of the purchase of the property itself may affect the strength of the presumption; where the property was purchased as a matrimonial home for the parties and did indeed so serve, the stronger the presumption that both spouses intended for the rule of survivorship to operate and for the beneficial ownership of the property to devolve to the surviving spouse absolutely. [emphasis added] 98 The extension to the presumption of advancement inLau Siew Kimrecognises the very real truth that most spouses who hold property as joint tenants at law with each other but who have made unequal contributions to its purchase intend to hold the property as joint tenants in equity as well, rather than as tenants in common in equity. That is to ensure that, upon the death of one spouse, the entire beneficial interest in the property passes automatically in equity to the surviving spouse. 99 There is a strong basis for presuming the intention of one spouse that, upon his death, the other spouse should enjoy the entire beneficial interest in the property for the remainder of his or her life rather than for it to pass, typically to the next generation, under the deceased’s will or intestacy. Where spouses purchase property as an investment,ieto generate an income or capital gains, it is very likely that the deceased spouse intended that the surviving spouse should continue to enjoy the income from the property for the rest of her life or to realise the appreciation in its capital value during her life. There is a particularly strong basis for presuming this intention where spouses purchase the property, not as an investment, but to be their matrimonial home. Each spouse is very likely to intend that, upon the other spouses’ death, the surviving spouse should become the sole and absolute owner of the property and have a place to reside for the rest of her life before the property can pass to the next generation. 100 One approach to recognising this reality is to deny that the presumption of resulting trust operates where spouses make unequal contributions to the purchase of property as joint tenants. The Court of Appeal inLau Siew Kimconsidered and rejected this approach. Instead, the Court of Appeal favoured the alternative approach of accepting that the presumption of resulting trust operates, but to extend the presumption of advancement to presume a joint tenancy in equity where the joint tenants are spouses. This extension ensures that legal and beneficial ownership of the property is unified in the surviving spouse upon the other spouse’s death. 101 Where the operation of the presumption of advancement is considered between joint tenants who are parent and child rather than spouses, there is no basis for extending the presumption as the Court of Appeal did inLau Siew Kim. There is no equivalent reason to presume that a parent who purchases property with a child and who makes an unequally large contribution to the purchase of the property intends a joint tenancy in equity, rather than a tenancy in common in equity. 102Lau Siew Kimat [105] is not authority that the presumption of advancement is capable in all contexts of applying to the right of survivorship separately from its application to a life interest. For the reasons I have given, it is my view that the extension to the presumption of advancement inLau Siew Kimdoes not apply outside the spousal context. It therefore does not assist the defendant in this case. 103 Even if the extension to the presumption of advancement does operate in the defendant’s favour, I consider that any presumption of advancement that has arisen in respect of the right of survivorship arises only weakly and has been rebutted on the facts of this case. Presumption of advancement is rebutted 104 The strength with which the presumption of advancement arises in any given case will vary with the circumstances of the case, particularly the nature and state of the relationship between the parties. Where the presumption of advancement is weak, less weighty evidence will be required to rebut it. 105 In the context of a parent-child relationship, the number of children the parent has is a factor that weakens the strength with which the presumption arises. The more children a parent has, the less basis there will be to presume that the parent’s transfer of property of substantial value to a single child was intended to be a gift to that child:Lau Siew Kimat [68]. Another factor is the plausibility of the parent’s intention to make a gift having regard to the financial status of the parties at the relevant time:Low Yin Ni and another v Tay Yuan Wei Jaycie (formerly known as Tay Yeng Choo Jessy) and another[2020] SGCA 58 at [5]. 106 The presumption of advancement arises in this case only weakly. The Father had four children. This attenuates any basis for presuming that the Father intended to benefit only one of the four children. Moreover, at the time the Property was purchased, the defendant was financially independent and his income was on an upward trajectory while the Father was in straitened financial circumstances and his income had almost certainly plateaued. This attenuates any basis for presuming that the Father intended to benefit the defendant in particular out of his four children. 107 Given the weakness with which the presumption of advancement arises, the evidence in this case suffices to rebut it. I accept the plaintiffs’ case that the Father and the Mother treated all four of their children equally, regardless of their sex. I find that both parents did not favour the defendant, as their only son, over their daughters as may have been typical for parents of their generation and culture. 108 The Mother’s conduct is an indication of how the parents treated their children. The Mother left her assets (excluding the family home and sums in joint bank accounts with each child) to the four children in equal shares.107Foot Note 107×PCS at para 181(c)(vi).If anything, the Mother’s conduct showed an intention to favour the daughters over sons in that the Mother left the family home to a daughter. Furthermore, the Mother appointed one of her daughters, the first plaintiff, to be her executrix of her will rather than her only son. 109 The Mother’s intention is, in a sense, one step removed from the Father’s. Her treatment of their four children cannot be conclusive as to the Father’s intention to treat his four children equally regardless of sex. But the Mother’s conduct is a basis from which to draw an inference about the Father’s intention and, in particular, whether the Father could have intended to benefit the defendant alone with an interest in the Property. I find that he could not have intended to do so. 110 I also consider it important that the Business operated from the Property. The Father managed the business, initially jointly with his own father and from 1985 as sole proprietor. The defendant was not involved in running the Business. The Father knew this. After the Father’s death in December 2016, it was the Mother and not the defendant who took over the Business as its sole proprietor. This adds important colour to the Father’s likely intentions. 111 The defendant’s case is that he – as the only son of the family – was the Father’s favoured child. He submits that the Father purchased an insurance policy and nominated the defendant as the beneficiary but not any of the plaintiffs.108Foot Note 108×DCS at para 128.He also points to the fact that the Father did not purchase any property in which he was a joint owner with any daughter.109Foot Note 109×DRS at para 231.Apart from the Property, the only real property that the Father purchased was the family home. He purchased the family home with the Mother as joint tenants. 112 I do not accept that the defendant was the Father’s favoured child. I rely on the evidence of Ms Caesiapeah Lim, the defendant’s ex-wife. During cross-examination, Ms Lim accepted that her description of the relationship between the defendant and the Mother was intended “to give the impression” that her and the defendant were the ones who were there to look after the Mother and she “didn’t even want to mention about [her] sister-in-laws”.110Foot Note 110×Certified Transcript, Day 4 (9 Sep 2021) at 57:31–58:2. 113 I therefore find that the extension to the presumption of advancement inLau Siew Kim, even if it arises as between a parent and child and not just as between spouses, has been rebutted. The presumption of resulting trust accordingly remains unrebutted. The defendant therefore held the Property on trust for the Father from the time it was purchased in 1995. For the reasons set out above, it follows that the defendant now holds the Property on trust for the four siblings in equal shares.",
        "Constructive trust": "114 Given that I have found in favour of the plaintiffs on their primary case relying on a resulting trust, I do not need to analyse their alternative case relying on a constructive trust.  It suffices for me to find that there is no evidence that the Father and the defendant formed the common intention necessary for a constructive trust in favour of the Father at the time the Property was purchased in 1995. Further, there is no evidence that the defendant and the plaintiffs formed the common intention necessary for a constructive trust in favour of the plaintiffs at the family meetings in August 2017. In any event, the plaintiffs have not established any detrimental reliance on their part on any common intention that the parties may have formed.",
        "Counterclaim": "115 I have accepted the plaintiffs’ claim that the defendant holds the Property on a resulting trust for the four siblings in equal shares. In doing so, I have rejected the defendant’s defence. The defendant’s counterclaim is simply a mirror of the plaintiffs’ claim and falls with his defence. The counterclaim is accordingly dismissed.",
        "Costs": "116 I now deal with the issue of costs. 117 The general rule is that costs follow the event: O 59 r 3(2) of the Rules of Court (2014 Rev Ed). The event in this action is favour of the plaintiffs. The plaintiffs are thereforeprima facieentitled to recover the costs of this action from the defendant. The defendant accepts this. 118 The plaintiffs claim $149,000 as a reasonable amount for the costs they have reasonably incurred in this action. The defendant submits that the costs payable to the plaintiffs should be reduced by 30% because the plaintiffs’ claims in constructive trust did not succeed. 119 Notwithstanding the defendant’s submission, I have allowed the plaintiff’s party and party costs at $149,000. I make two observations. First, the court’s discretion to depart from the general rule of awarding costs to the successful party should be exercised judicially:Comfort Management Pte Ltd v OGSP Engineering Pte Ltd and another[2022] 5 SLR 525 (“Comfort Management”) at [42]. The general rule does not cease to operate simply because a successful party has raised issues or made allegations that have failed. Something more, such as a significant increase in the length of proceedings or raising issues unreasonably, is required in order to warrant depriving a successful party of part of its costs:Comfort Managementat [45]–[47];Tullio Planeta vMaoro Andrea G[1994] 2 SLR(R) 501 at [24], citingReElgindata Ltd (No 2)[1993] 1 WLR 1207 at 1214. Second, the touchstone for the recoverability of costs is reasonableness:EFG Bank AG, Singapore Branch vSurewin Worldwide Ltd and others[2022] SGHC 26 at [13]. 120 In my view, there should be no deduction from the plaintiffs’ costs of this action because the plaintiffs failed to establish a constructive trust. Those claims were not raised unreasonably and did not result in a significant lengthening of the proceedings. 121 Thus, I award $149,000 to the plaintiffs as the costs (excluding disbursements) of and incidental to this action.",
        "Conclusion": "122 In summary, I have entered judgment in favour of the plaintiffs in this action to the following effect:111Foot Note 111×Judgment, HC/JUD 87/2023 filed on 8 Mar 2023. (a) I have declared that the defendant holds the beneficial interest in the Property today on trust in equal shares for the first plaintiff, the second plaintiff, the third plaintiff and the defendant; (b) I have made orders to cater for the event that the plaintiffs wish to buy the defendant’s 25% beneficial interest in the Property; (c) I have dismissed the defendant’s counterclaim; and (d) I have ordered the defendant is to pay to the plaintiffs their costs of and incidental to this action, such costs fixed at $149,000 (excluding disbursements).      Vinodh Coomaraswamy Judge of the High Court   Edwin Chia and Rachel Boey (CNPLaw LLP) for the plaintiffs; Christine Chuah (D’Bi An LLC) (instructed) and Gong Chin Nam (Hin Tat Augustine & Partners) for the defendant.",
        "": ""
    }
}