{
    "case_title": "Toh Tun Li AdelinevCentral Provident Fund Board and another",
    "ncitation": "[2023] SGHC 55",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 In the present case, the applicant’s father had attempted to nominate the applicant as the beneficiary of his Central Provident Fund (“CPF”) monies. However, his nomination had not been successfully attested to prior to his passing. 2 The issue before me was whether the purported CPF nomination made in the circumstances of this case is a valid nomination under the Central Provident Fund Act 1953 (2020 Rev Ed) (the “CPF Act”). This case raised questions with respect to the legislative purpose behind the formality requirements for CPF nominations and how nominations not made in accordance with the required formalities are viewed by the court.",
        "Background": "3 The case concerns a CPF nomination by the late Mr Toh Kim Hiang (“the Deceased”) on 30 November 2021. The applicant, Ms Adeline Toh (“Ms Toh”), is Mr Toh’s only child. 4 The first respondent is the CPF Board. The second respondent, Ms Yee Swee Yong (“Ms Yee”), is the Deceased’s ex-wife and Ms Toh’s estranged mother. The Deceased and Ms Yee were divorced on 26 February 1985, following which both Ms Toh and the Deceased ceased contact with Ms Yee.1Foot Note 1×Adeline Toh Tun Li’s 1st affidavit at paras 5–6 and ATTL-1 Tab A p 17.According to Ms Toh, since the divorce, she had only made contact with Ms Yee once, in 2009.2Foot Note 2×Adeline Toh Tun Li’s 1st affidavit at para 6. 5 On 7 November 2021, when celebrating his eightieth birthday with Ms Toh and her husband, Mr Ng Chye Aik (“Mr Ng”), the Deceased stated that he believed that his prior CPF nomination in favour of Ms Yee had been voided after his divorce, such that his CPF monies would be inherited by Ms Toh. Mr Ng informed him that he would, in fact, have to make a fresh CPF nomination.3Foot Note 3×Ng Chye Aik’s 1st affidavit at paras 5–7. 6 Subsequently, on 22 November 2021, the Deceased made a submission via the online CPF portal to nominate Ms Toh as his CPF nominee (the “First Submission”). Mr Ng, the first witness, completed his online attestation to the Deceased’s signature. However, Mr Ng’s sister, Ms Ng Bee Kien (“Ms Ng”), who was requested to be the second witness to the First Submission, did not manage to complete her attestation to the Deceased’s signature.4Foot Note 4×Ng Chye Aik’s 1st affidavit at paras 8–10; Adeline Toh Tun Li’s 1st affidavit at paras 10–12; Liang Weirong’s affidavit at para 5.The Deceased’s First Submission expired on 29 November 2021. The CPF Board informed the Deceased via mobile text that his nomination had been unsuccessful.5Foot Note 5×Liang Weirong’s affidavit at para 5; Ng Chye Aik’s 1st affidavit at NCA-1 Tab A p 11. 7 On 30 November 2021, the Deceased made another submission via the online CPF portal to update his CPF Nomination (the “Second Submission”). Once again, Mr Ng completed his attestation to the Deceased’s signature, but Ms Ng did not.6Foot Note 6×Ng Chye Aik’s 1st affidavit at paras 11–13; Adeline Toh Tun Li’s 1st affidavit at para 14; Liang Weirong’s affidavit at para 7. 8 Ms Ng’s evidence was that she had agreed to be a witness for both the Deceased’s First Submission and Second Submission. She had received mobile text messages from the CPF Board asking her to log onto the CPF portal to complete her attestation to the Deceased’s signature. However, when she logged onto the CPF portal, she was not able to see any message or notification from the CPF Board asking her to take further action. According to Ms Ng, in both instances, she assumed that it was sufficient for her to have logged onto the CPF portal.7Foot Note 7×Ng Chye Aik’s 1st affidavit at para 14; Ng Bee Kien’s affidavit at paras 5–6. 9 The Deceased fell ill shortly after and passed away on 4 January 2022.8Foot Note 8×Ng Chye Aik’s 1st affidavit at para 16 and NCA-1 Tab C p 33; Adeline Toh Tun Li’s 1st affidavit at paras 17–18 and ATTL-1 Tab D p 40.Following requests by Ms Toh and Mr Ng to disburse the Deceased’s CPF savings to Ms Toh instead of Ms Yee, the CPF Board explained that the Deceased had not successfully made a new nomination before his passing.9Foot Note 9×Liang Weirong’s affidavit at para 9. 10 Subsequently, it was discovered that the Deceased had keyed in Mr Ng’s mother’s NRIC number instead of Ms Ng’s NRIC number under the details of his second witness, which was likely why Ms Ng could not complete her attestation.10Foot Note 10×Ng Chye Aik’s 1st affidavit at para 17. 11 On 2 March 2022, Ms Ng wrote to the CPF Board claiming that it was Mr Ng who had asked her to be the Deceased’s nominee and that she did not agree with the contents of certain lawyer’s letters which she had signed as a witness (the “2 March 2022 communication”). The CPF Board advised her to seek her own legal advice regarding her discomfort in having signed these lawyer’s letters.11Foot Note 11×Liang Weirong’s affidavit at LWR-4 pp 18–19.It is unclear what letters Ms Ng was referring to or the contents of these letters, but her affidavit evidence was that she had agreed to be witness to both the First Submission and Second Submission and that she had indeed witnessed the Deceased’s signature. She had also signed a statutory declaration previously to confirm that she did witness his signature in respect of the First Submission and Second Submission.12Foot Note 12×Ng Bee Kien’s affidavit at paras 5–7 and 9 and NBK-1 pp 7–9.",
        "Present Application": "12 In originating summons no 197 of 2022 (“OS 197”), Ms Toh sought for the nomination pursuant to the Second Submission to be declared a valid CPF nomination under the CPF Act, which would supersede any previous CPF nominations previously made by the Deceased (“Prayer 1”). She also sought for the CPF Board to transfer to her all monies standing in credit to the Deceased in his CPF account, as the Deceased’s CPF nominee (“Prayer 2”). Ms Toh also sought for the costs of OS 197 to be provided for.13Foot Note 13×See HC/OS 197/2022 filed 2 March 2022. 13 In the lead-up to the hearing of OS 197, Ms Toh applied successfully for the CPF Board to be restrained from distributing the Deceased’s CPF monies until the hearing of OS 197 or until further orders were granted.14Foot Note 14×See HC/SUM 792/2022 filed 2 March 2022; HC/ORC 1157/2022 granted 4 March 2022. 14 Following two failed attempts to serve the papers for OS 197 on Ms Yee at her last known address in Perak, Malaysia,15Foot Note 15×Adeline Toh Tun Li’s 3rd affidavit at paras 4–12; Lau Chee Foon’s 1st affidavit at paras 4–6.Ms Toh was permitted to serve the documents for OS 197 via substituted service on Ms Yee via publication of a notice of advertisement in local newspapers in Perak.16Foot Note 16×See HC/ORC 3529/2022 filed 14 July 2022.",
        "Parties’ submissions": "15 Counsel for Ms Toh submits that the underlying mischief behind r 2(2) of the current Central Provident Fund (Nominations) Rules (Cap 36, 1998 Rev Ed) (“CPF (Nominations) Rules”), which is to prevent fraud, is not engaged in the present case.17Foot Note 17×Applicant’s Written Submissions dated 16 November 2022 (“AWS”) at para 3.Counsel submitted that the Deceased had intended for Ms Toh to be the sole beneficiary of his CPF monies and had taken steps to effect this, and relies on the Court of Appeal (“SGCA”)’s decision inChai Choon Yong v Central Provident Fund Board and others[2005] 2 SLR(R) 594 (“Chai”) to submit that the Deceased’s technical breach of r 2(2) of the CPF (Nominations) Rules was not fundamental enough an act of non-compliance to invalidate his CPF nominations.18Foot Note 18×AWS at paras 24–35. 16 Counsel for the CPF Board takes the position that the Deceased’s attempts to change his nomination in November 2021 were invalid for two reasons. First, the Deceased did not make the nomination himself, and Mr Ng had done so on the Deceased’s behalf. Second, the Deceased did not directly communicate his intention to make this nomination with one of his witnesses, Ms Ng. It was not appropriate for Mr Ng to have been the one to communicate the Deceased’s intention to Ms Ng, given that Mr Ng was the other witness and the spouse of the sole intended beneficiary, and given that there was no reason why Mr Toh could not communicate directly with Ms Ng.19Foot Note 19×1st Respondent’s Written Submissions dated 16 November 2022 (“DWS”) at paras 13–20.",
        "My findings": "",
        "The Deceased intended for Ms Toh to be the beneficiary of his CPF monies": "17 The starting point is to determine whether there is sufficient evidence as to the Deceased’s intention. Firstly, it is clear from the evidence that the Deceased could not have intended for his CPF monies to pass to Ms Yee. They had lived their lives essentially as strangers since their divorce. At the time of the Deceased’s passing, Ms Yee and the Deceased had been divorced for over 36 years. Further, Ms Yee had not remained in contact with either the Deceased or Ms Toh for many years. The completeness of her estrangement from the family can be seen from the difficulties that Ms Toh encountered in locating Ms Yee to serve the documents for the present case. Given the lack of any functional relationship between the Deceased and Ms Yee and the long duration of their estrangement, it would be highly unusual for the Deceased to have intended for his CPF monies to pass to Ms Yee upon his death rather than to his only daughter. 18 Indeed, the evidence is strong that the Deceased intended for his CPF monies to pass to Ms Toh upon his death. Firstly, the circumstances outlined above indicate that the Deceased would have intended for his CPF monies to pass to Ms Toh. Secondly, the evidence showed that the Deceased had made active efforts to change his nominee from Ms Yee to Ms Toh, not once, but twice, after he learnt that the first attempt had failed. 19 This intention to nominate Ms Toh to receive his CPF monies was corroborated by his Last Will and Testament, which showed his testamentary intent to bequeath his property absolutely to her as well.20Foot Note 20×Adeline Toh Tun Li’s 1st affidavit at ATTL-1 Tab H p 92.For the avoidance of doubt, I am not saying that the Deceased’s testamentary intent supersedes the operation of the CPF Act, but merely that when all the evidence is taken together, the Deceased’s testamentary intent is part of the evidence in support of the finding that he intended his CPF monies to go to Ms Toh rather than to Ms Yee. I therefore find that the Deceased had intended for his CPF monies to pass to Ms Toh and had intended to make a new nomination in her favour. He had, in fact, taken steps to give effect to that intention on the two occasions that he attempted to make the online nominations.",
        "The nomination was not invalid": "The statutory regime of CPF and CPF nominations 20 Under s 25(1) of the CPF Act, any CPF member who is at least 16 years of age may nominate person(s) to receive CPF monies payable on the member’s death “by a memorandum executed in such manner as the Board may prescribe”. Rule 2(1)(d) of the CPF (Nominations) Rules in turn provides that: 2.—(1)  Subject to these Rules, a member may — … (d) by executing a memorandum in electronic form by using the electronic system designated by the Board for that purpose, nominate any person to receive — (i) any portion of the amount payable on the member’s death out of the Fund in accordance with section 25(1)(a)(i) of the Act; or (ii) any portion of any designated shares. 21 Further, r 2(2) of the CPF (Nominations) Rules requires that the same nomination be “witnessed or attested to in the manner set out in the relevant form by 2 persons who satisfy the qualifications set out in rule 9”.Perr 9, a person may be a witness or make an attestation in respect of a nomination if the person is an employee of the CPF Board and takes no benefit under the nomination, or if the person does not take any benefit under the nomination, does not lack capacity and has attained 21 years of age. 22 It is undisputed that the Deceased had attempted to make an electronic nomination in favour of Ms Toh and that Ms Ng would have been a witness who satisfied the qualifications set out in r 9 of the CPF (Nominations) Rules. It is also undisputed that because the Deceased had keyed in the wrong NRIC number under his second witness’s details, he had, therefore, not managed to fulfil the requirement under r 2(2) of the CPF (Nominations) Rulesfor his Second Submission to be attested to. The next question, then, is whether the Deceased’s Second Submission should be consideredinvalidgiven his non-compliance with r 2(2) of the CPF (Nominations) Rules. 23 It seems to me that there are two possible interpretations of the purpose of r 2(2) of the CPF (Nominations) Rules. On the one hand, it could be a condition precedent to a valid nomination such that, unless all the requirements are met, the nomination would not be valid. On the other hand, compliance with the r 2(2) requirement amounts to evidence that the CPF Board would accept as proving the fact of nomination, such that unless the CPF Board has any grounds to believe otherwise, a nomination that complies fully with the rules would be accepted at face value and the CPF Board would be empowered to pay the deceased’s CPF funds in accordance with that nomination. The issue is which of these two possibilities governs r 2(2). 24 The CPF is a statutory creation established pursuant to the CPF Act. The CPF Act is a piece of social legislation, which was first enacted in 1955 to (amongst other social functions) “provide employees in Singapore with a compulsory savings scheme so that they will have some savings when they retire from active work” (Singapore Parliamentary Debates, Official Report(25 July 1973) vol 32at col 1175 (accessed 16 January 2023) (Ong Pang Boon, Minister for Labour)). 25 The CPF Act also governs the status and movement of the monies in a member’s CPF accounts (BTB and another v BTD[2019] 4 SLR 1289at [40]–[41]). During a member’s lifetime, the CPF Act provides for members (and their employers) to make contributions to the CPF and places restrictions on the withdrawal of monies from members’ CPF accounts. 26 Upon a member’s death, s 24(3A) of the CPF Act deems that monies from a deceased member’s CPF fund do not form part of his or her estate and are not subject to his or her debts: (3A) Subject to subsection (3B), sections 16A, 25A(3), 27N and 57C and any regulations made under section 27Q or 57F, all moneys paid out of the Fund on the death of any member of the Fund are deemed to be impressed with a trust in favour of — (a) the person or persons nominated under section 25(1) by the deceased member, if any; or (b) the person or persons who are entitled to the whole or a share of the moneys payable to the Public Trustee under section 25A(1), but, without affecting the operation of the Estate Duty Act 1929, are deemed not to form part of the deceased member’s estate or to be subject to his or her debts. 27 Section 24(3A) of the CPF Act also delineates a deceased member’s CPF monies as being held on a statutory trust in favour for a nominated beneficiary (or the eligible beneficiaries under s 25A(1) of the CPF Act should no nomination have been made). It is trite law that what falls within the ambit of a statutory trust and the obligations of a statutory trustee are matters of statutory interpretation, and the scope and nature of a statutory trust must be ascertained from the context and the public function for the exercise of which the statutory trust is created (Halsbury’s Laws of Singaporevol 9(3) (LexisNexis Singapore, 2018) at para 110.445;MF Global Singapore Pte Ltd (in creditors’ voluntary liquidation) andothersv Vintage Bullion DMCC (in its own capacity and as representative of the customers of the first plaintiff) and anothermatter[2015] 4 SLR 831 at [71]). 28 InSaniahbte Ali and others v Abdullah bin Ali[1990] 1 SLR(R) 555 (“Saniah”), the High Court found that the imposition of a statutory trust over a member’s CPF monies on his or her death is to protect a member’s rights or interest in the fund specifically, by ensuring “that the moneys payable on the death of a member are paid, and ought to be paid, to the person or persons nominated under s 24(1)” and “expressly [keeping] the moneys out of the estate of the member or from being subject to payment of any debt” (at [10]–[11]). 29 Against this backdrop, the statutory regime for making CPF nominations (see above at [20]–[21]) serves the complementary purpose of giving effect to a member’s intentions as to where his CPF monies are to go after his death. It provides an instrument through which a member may provide “effective direction” to the CPF Board to pay to his nominee(s) monies out of the Fund on his death while simultaneously “[protecting] the CPF Board from … being embroiled in any dispute with anyone as to who is entitled to receive the member’s moneys in the Fund” (Saniahat [11]–[12]). 30 Indeed,  Parliament has expressed that CPF nominations would serve to expedite the distribution of CPF monies to beneficiaries in accordance with the wishes of members (Singapore Parliamentary Debates, Official Report(1 February 2021) vol 95(accessed 16 January 2023) (Josephine Teo, Minister for Manpower);Singapore Parliamentary Debates, Official Report(4 July 2022) vol 95(accessed 16 January 2023) (Tan See Leng, Minister for Manpower)). 31 Viewed against this backdrop, the purpose of the requirement for attestation under r 2(2) of the CPF (Nominations) Rules must be aligned with this purpose of protecting members’ monies such that effect can be given to members’ intentions of how their monies should be distributed after death. 32 Interestingly, both the CPF Act and the CPF (Nominations) Rules do not make any provision for the consequences of non-compliance with the requirement for attestation under r 2(2) of the CPF (Nominations) Rules. In contrast, the Wills Act 1838 (2020 Rev Ed) (“Wills Act”), which lays out in s 6(2) a requirement for the signature of the testator (or some other person in his presence and by his direction) to be witnessed, expressly states at s 6(1) that: No will shall be valid unless it is in writing and executed in the manner mentioned in subsection (2). 33 The point I wish to make is this. While the Wills Act expressly states that non-compliance with the required formalities would render a will invalid, s 24(3A) of the CPF Act and the CPF (Nominations) Rules are conspicuously silent on the consequences of non-compliance with the formalities of a CPF nomination. This is not to say that the requirement for attestation of a member’s nomination under s 2(2) of the CPF (Nominations) Rules is unimportant. In fact, the SGCA has noted that the main purpose underpinning the rule for attestation of a CPF nomination is, similar to the purpose behind the formalities of wills, to prevent fraud. The act of signing must be seen by others at the same time to ensure confirmation of the authenticity of the member’s signature (Chaiat [47]). 34 Where r 2(2) of the CPF (Nominations) Rules differs from s 6(2) of the Wills Act is hence not in the importance of ensuring that a member or testator’s signature is authentic, but in whether the failure to comply with the formalities of the attestation renders the nomination or will invalid. Some laxity has been affordedvis-à-visthe attestation of CPF nominations in cases where the breach is minor, and no fraud has been perpetrated (Chaiat [49]–[50]). 35 InChai, the deceased had nominated the second respondent, whom she described in her nomination form as her “friend”, to receive all the monies in her CPF account (at [2]). Upon receiving her nomination form, the board sent the deceased a letter asking if she wished to include her next of kin as nominees. The deceased confirmed that she wished to nominate the second respondent, following which the officer handling her file contacted her to explain the implications of this nomination (at [3]). The deceased’s mother applied to have the deceased’s CPF nomination declared null and void on the basis that the deceased’s signature was not witnessed in the presence of two witnesses (at [4]). Her application was dismissed by the High Court, and she appealed the decision. 36 The SGCA found that the evidence was too weak to establish that the deceased had not signed the form in her witnesses’ presence (at [37]–[40]). In any event, as the CPF Board had verified the deceased’s signature and intention in that case, the alleged breach of procedure in this case did not warrant a declaration that the nomination was void, as the CPF Board had “discharged its responsibility in ascertaining and confirming the intentions of [the Deceased], and no fraud had been perpetuated” (at [50]–[51]). 37 In summary, theprincipalaim of ss 24(3A) and 25 of the CPF Act and r 2(2) of the CPF (Nominations) Rules is to protect a deceased member’s CPF monies from creditors and beneficiaries of his or her estate in favour of giving effect to the same member’sintervivosintention (where expressed) as to whom the beneficiary of these monies should be. This aim comes hand in hand with theadministrativefunction of the same provisions in providing an effective methodology through which these intentions can be communicated by members to the CPF Board, thereby safeguarding both the CPF Board and the members from disputes over the monies after the death of members. The administrative function of ss 24(3A) and 25 of the CPF Act and r  (2) of the CPF (Nominations) Rules is hence geared towards the just distribution of a member’s CPF monies and should not be used to cause injustice. The Deceased’s Second Submission was an effective and authentic communication of his directions to the CPF Board 38 I have found (at [17]–[19]) that the Deceased had intended for his monies to be passed to Ms Toh upon his death. This would be the intention that the statutory regime of CPF nominations would have sought to give effect in the present case. 39 The next question is whether the procedural irregularity of the Second Submission would have compromised the administrative aim of safeguarding the CPF Board and members from disputes after the passing of members. I do not think this to be the case. The evidence did not suggest any fraud and/or inauthenticity behind the Second Submission. 40 The CPF Board had submitted that it was not appropriate for Mr Ng to perform the nomination on the Deceased’s behalf or to communicate the Deceased’s request for Ms Ng to be a witness to her. The CPF Board relied on evidence of the 2 March 2022 communication to establish that the Deceased had not communicated his intention to make his nomination directly with Ms Ng but that Mr Ng had communicated it to Ms Ng instead.21Foot Note 21×DWS at paras 13–20. 41 However, I am of the view that there was nothing wrong in principle with Mr Ng assisting his father-in-law, the Deceased, with the First Submission and Second Submission. I see no basis on which the communications between the Deceased and his chosen witnesses had to be direct or unassisted as long as the Deceased had intended to make the nomination and had appointed his witnesses of his own volition. I find that this was the case here. The Deceased had, in fact, signed a Letter of Authority for Mr Ng to attend to his CPF Nomination.22Foot Note 22×Liang Weirong’s affidavit at LWR-2 p 12.Further, on 21 February 2022, Ms Ng signed a statutory declaration to confirm that she had witnessed the Deceased’s signature appended by way of his Singpass.23Foot Note 23×Ng Bee Kien’s affidavit at para 9 and NBK-1 pp 7–9.This was consistent with her affidavit evidence that she had agreed to act as the Deceased’s witness and had witnessed his signatures for both submissions. On the evidence available, there is nothing to suggest that Mr Ng’s assistance had compromised the authenticity of the Second Submission or of the Deceased’s intention for his CPF monies to be given to Ms Toh. 42 I therefore find that the Deceased had nominated Ms Toh as the beneficiary of his CPF monies and that such nomination was witnessed by Mr Ng and Ms Ng. On the evidence before me, I hold that the nomination is valid under the CPF Act. However, in the absence of a nomination that complies with the rules, the CPF Board is not obliged to recognise the claims of an alleged beneficiary. Payment made by the CPF Board under a nomination that fully complies with the rules would absolve the CPF Board of any liability in the event of a claim by another person to be the rightful nominee (save where the CPF Board has reason to suspect that the nomination is not valid). But any payment made on a nomination that does not fully comply with the rules will expose the CPF Board to liabilities in the event that such nomination is not valid. The CPF Board is therefore justified to refuse to pay Ms Toh without a court order. Conclusion 43 Ms Toh applied to this court to make a finding that the Deceased had nominated her as the sole beneficiary to his CPF monies. I have examined the evidence and find that the Deceased had the intention of nominating Ms Toh and had made that nomination which was witnessed by Mr Ng and Ms Ng,  even though it was not compliant with the CPF rules. I therefore declare that the Deceased had nominated Ms Toh as the sole beneficiary of his CPF monies when he made the second attempt at making the online nomination on 30 November 2021 and order the CPF Board to release the CPF monies of the Deceased to her. 44 By way of a final observation, it is puzzling to me that while a pre-existing nomination would be automatically revoked by marriage under s 25(5)(a) of the CPF Act and r 7(a) of the CPF (Nominations) Rules, a divorce would not have the same consequences. This could be a matter for the CPF Board to consider. 45 With respect to costs, I do not think that the CPF Board should be liable for costs as this application was warranted by the Deceased’s own non-compliance with the nomination process, such that the nominee had to come to court to give effect to the nomination. As formalities were not complied with, the CPF Board was entitled to refuse to recognise the nomination until the court orders otherwise. I also note that the CPF Board’s caution in applying to this court was especially warranted in light of Ms Ng’s 2 March 2022 communication to the CPF Board. I hence make no order as to costs. Lee Seiu KinJudge of the High Court Goh Hui Hua and Tan Jia Jun James (Covenant Chambers LLC) for the applicant; Teh Ee-von (Infinitus Law Corporation) for the first respondent; The second respondent absent and unrepresented."
    }
}