{
    "case_title": "SW Trustees Pte Ltd (in compulsory liquidation) and anothervTeodros Ashenafi Tesemma and others(Teodros Ashenafi Tesemma, third party)",
    "ncitation": "[2023] SGHC 160",
    "coram": "Goh Yihan JC",
    "sections": {
        "Background facts": "3 The background facts can be briefly stated. The first plaintiff was put into insolvent liquidation on 21 June 2019. The second plaintiff, Mr Farooq Ahmad Mann, was appointed as the liquidator. The underlying debt had arisen from an arbitration award obtained on 21 July 2017 by SGI SWE Limited and Schulze Global Investments Holdings LLC (“the SGI Creditors”). The SGI Creditors are the first plaintiff’s only creditors. 4 In March 2021, the plaintiffs commenced Suit 229 against the defendants. This was done with the court’s permission, which was granted under s 144(1) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed) in HC/SUM 62/2021 (“SUM 62”). Importantly for present purposes, in SUM 62, the second plaintiff was also granted authorisation to enter into a funding agreement with the SGI Creditors (“the Funding Agreement”). Under the Funding Agreement, the SGI Creditors are to indemnify the second plaintiff in respect of all legal fees, costs, and expenses in pursuing Suit 229. 5 Focusing on the first defendant for the purposes of this present appeal, the plaintiffs’ case against him in Suit 229 is that he had conspired with one or more of the other defendants to wrongfully cause the first plaintiff’s assets to be sold at an undervalue to the fifth and sixth defendants, which are Sino Africa Trading Limited and Coca-Cola Sabco (East Africa) Limited, respectively. This allegedly caused the first plaintiff to become unable to pay its debts, resulting in its consequent winding up. In this regard, the first defendant was a director of the first plaintiff from 1 September 2004 until he resigned on 1 August 2017. He was also the sole shareholder of the first plaintiff from 30 May 2016 to 27 February 2018. 6 In terms of the timeline for Suit 229, general discovery was completed in October 2021. By August 2022, the parties were in the stage of specific discovery and had put together their list of witnesses and estimated the number of trial days required. The parties would have exchanged their respective affidavits of evidence-in-chief (“AEICs”) in April 2023 and trial would have taken place from late June 2023. 7 Against this timeline, the first defendant’s application for SFC was filed only on 28 February 2023. The learned AR heard the parties over a number of days in early April 2023 and issued his decision on 12 April 2023. However, on 12 April 2023, the plaintiffs informed the Registry that they intended to amend their Statement of Claim. As a result, the Registry indefinitely deferred the April dates for the parties to exchange their AEICs, and also vacated the June trial dates. The first defendant filed his Notice of Appeal against the learned AR’s decision on 24 April 2023. Accordingly, the circumstances in which I heard HC/RA 80/2023 (“RA 80”) were quite different from those that confronted the learned AR below.",
        "The parties’ positions": "8 The parties largely maintain their positions taken before the learned AR for the present appeal. 9 In the first place, the parties do not dispute that the courts adopt a two-stage test in assessing an application for SFC. In relation to the first stage, there is no dispute that the court’s discretion to award SFC against the plaintiffs has been enlivened. The main contention in the present appeal lies in the second stage of the test, which concerns the court’s exercise of discretion to order a party to provide SFC. In this regard, the first defendant makes two broad submissions for why the court should order SFC in this present case. First, he argues that SFC should be ordered despite the lateness of his application as the delay does not cause prejudice to the plaintiffs. Among others, the first defendant asserts that there is no evidence that the SGI Creditors (who are the litigation funders) do not have the means to pay, such that the plaintiffs’ claims will be stifled. Second, the first defendant contends that the legislative policy behind s 388(1) of the Companies Act 1967 (2020 Rev Ed) (“s 388(1)”) means that the court will generally decide to grant SFC whenever a defendant is faced with a claim by an impecunious company, even if the defendant is guilty of significant delay in his application for SFC. 10 In response, the plaintiffs submit that it would not be just for the court to order SFC in the present case for four broad reasons. First, the plaintiffs argue that prejudice is caused to them by the first defendant’s delay in only bringing SUM 519 727 days after Suit 229 was commenced. Second, the plaintiffs contend that their claim in Suit 229 is madebona fideand has a reasonable prospect of success. Third, the plaintiffs say that the first defendant is using his application for SFC to oppress the first plaintiff’s pursuit of its claim in Suit 229. Fourth, the plaintiffs submit that while public policy limits rather than encourages uninhibited access to the courts in respect of impecunious companies bringing proceedings, this only protects the first defendant in so far as he timeously avails himself of the right to SFC and takes steps to protect his position. In this regard, the plaintiffs say that the first defendant has, with no good explanation, taken out SUM 519 at a significantly late stage of the proceedings. 11 Having set out the relevant background facts and the parties’ positions, I turn to the applicable law.",
        "The applicable law": "",
        "The analytical framework": "12 The applicable law is not in dispute. The first defendant’s application for SFC is made pursuant to O 23 r 1(1) of the Rules of Court (2014 Rev Ed) (“O 23 r 1(1)”) and/or s 388(1). O 23 r 1(1) provides as follows: Security for costs of action, etc.(O.23, r. 1) 1.—(1) Where, on the applicable of a defendant to an action or other proceeding in the Court, it appears to the Court— (a) that the plaintiff is ordinarily resident out of the jurisdiction; (b) that the plaintiff (not being a plaintiff who is suing in a representative capacity) is a nominal plaintiff who is suing for the benefit of some other person and that there is a reason to believe that he will be unable to pay the costs of the defendant if ordered to do so; (c) subject to paragraph (2), that the plaintiff’s address is not stated in the writ or other originating process or is incorrectly stated therein; or (d) that the plaintiff has changed his address during the course of the proceedings with a view to evading the consequences of the litigation, then, if, having regard to all the circumstances of the case, the Court thinks it just to do so, it may order the plaintiff to give such security for the defendant’s costs of the action or other proceeding as it thinks fit. 13 In turn, s 388(1) provides as follows: Security for costs 388.—(1) Where a corporation is claimant in any action or other legal proceeding the court having jurisdiction in the matter may, if it appears by credible testimony that there is reason to believe that the corporation will be unable to pay the costs of the defendant if successful in the defendant’s defence, require sufficient security to be given for those costs and stay all proceedings until the security is given. 14 With these provisions in mind, I accept that a two-stage test should be applied in considering whether SFC should be ordered. This two-stage test is like the one applied in the High Court decision ofSiva Industries and Holdings Ltd vForeguard Shipping I Singapore Pte Ltd[2017] SGHCR 5 (at [4]): (a) first, whether the court’s discretion to order SFC under O 23 r 1(1) and/or s 388(1) has been invoked; and(b) second, whether it is just to order SFC having regard to all the relevant circumstances.",
        "The relevant circumstances in deciding whether it is just to order security for costs": "15 I turn now to consider the relevant circumstances that a court should consider in deciding whether it is just to order SFC. As the Court of Appeal stated inCreative Elegance(M) Sdn Bhd v Puay Kim Seng and another[1999] 1 SLR(R) 112 (“Creative Elegance”), the applicable principles guiding the exercise of the court’s discretion under O 23 r 1(1)(a) and under s 388(1) are thesame: the court will consider all the circumstances and decide whether it is just to order the plaintiff to provide SFC and, if so, the extent of the security (at [13]). While the Court of Appeal inCreative Elegancemade this statement of principle in the context of O 23 r 1(1)(a), I am of the view that it similarly applies to an application under O 23 r (1)(b), which is what this present appeal is concerned with. Indeed, the parties do not contend otherwise. 16 In this regard, the cases applying O 23 r 1(1) or s 388(1) have accepted a non-exhaustive list of circumstances that a court can consider, which are by and large the same regardless of which provision applies. For example, the Court of Appeal inCreative Eleganceset out some factors that would typically be considered relevant (at [18]–[25]): (a) whether the plaintiff has abona fideclaim;(b) the plaintiff’s financial standing;(c) the ease of enforcing any judgment for costs against the plaintiff;(d) the relative strengths of parties’ cases; and(e) whether the application for SFC has been taken out oppressively to stifle the plaintiff’s action. 17 Similarly, in the context of s 388(1), the Court of Appeal inSIC Collegeof Business and Technology Pte Ltd v Yeo Poh Siah and others[2016] 2 SLR 118 (“SIC College”)accepted (at [76]) the list of circumstances which Judith Prakash J (as she then was) listed out in the High Court decision ofL& M Concrete Specialists Pte Ltd v United Eng Contractors Pte Ltd[2001] 3 SLR(R) 208 (at [10]), as follows: (a)  whether the company’s claim isbona fideand not a sham; (b)  whether the company has a reasonably good prospect of success; (c)  whether there is an admission by the defendants on the pleadings or elsewhere that money is due; (d)  whether the application for security was being used oppressively; (e)  whether the company’s want of means has been brought about by the defendants, such as delay in payments; and (f)  lateness in taking out the application. In addition to these circumstances, the Court of Appeal inSIC Collegealso pointed to the fact that it is often inappropriate to award SFC where the claim and counterclaim are co-extensive, which is a weighty factor (at [77]). 18 While there is much benefit in providing a non-exhaustive list of relevant circumstances, it is important that such a list does not obscure the connection between the listed circumstances and the rationale behind the provision of SFC. In this regard, there are at least three dangers of a non-exhaustive list of circumstances that is not properly rationalised. First, the list of circumstances may grow so long that it becomes unclear how each circumstance links back to the rationale behind the provision of SFC. Second, it may deprive the court of a common basis of comparison if parties pick a number of circumstances which are in their favour but ignore those which are not in their favour. This is exactly what has happened in the present case in so far as the parties only allude to factors that are in their favour. Third, without any indication as to the proper weight to be given to each circumstance, it may be difficult for a court to assess the relative importance of the circumstances against each other. 19 It is therefore important to rationalise the non-exhaustive list of relevant circumstances through the purposes behind the provision of SFC. In this regard, the provision of SFC can be resolved into at least three key purposes, namely: (a) to protect the defendant, who cannot avoid being sued, by enabling him to recover costs from the plaintiff out of a fund within the jurisdiction in the event that the claim against him by the plaintiff proves to be unsuccessful; (b) to ensure, within the limits of protecting the defendant, that the plaintiff’s ability to pursue his claim is not stifled; and (c) to maintain a sense of fair play between the parties even amidst the cut-and-thrust of civil litigation. In my respectful view, rationalising the apparently open-ended list of circumstances through these purposes will avoid the inherent dangers of simply relying on a non-exhaustive list of circumstances. 20 I turn now to the three purposes set out above. First, it is well established that the primary purpose behind the provision of SFC is to protect the defendant by enabling him to recover costs from the plaintiff out of a fund within the jurisdiction in the event that the claim against him proves to be unsuccessful. In this regard, the Court of Appeal inSIC Collegeaccepted (at [75]) that SFC is meant to protect the defendant “who is forced into litigation at the election of someone else against adverse costs consequences of that litigation” (citing the English Court of Appeal decision ofAutoweldSystems Ltd v Kito Enterprises LLC[2010] EWCA Civ 1469 at [59]). Thus, while a plaintiff has a choice whether to commence proceedings against another party, and therefore run the risk of suing a party who may not be good for costs, the same cannot be said of a defendant, who cannot choose not to be sued. As such, the law treats the defendant in this regard slightly more favourably (seeSingapore Civil Procedure 2021vol 1 (Cavinder Bull gen ed) (Sweet & Maxwell, 2021) (“White Book”) at para 23/0/2). The circumstances relevant to assessing whether this first purpose is met would include: (a) the prospects of the defendant succeeding in the proceedings, subject to the practical circumstance that the court will not investigate in considerable detail the likelihood of success in the action (see the Federal Court of Australia decision ofGartner v Ernst& Young (No 3)[2003] FCA 1437 (“Gartner”)at [10]); (b) the ease with which a defendant may enforce a judgment for costs against a plaintiff in a jurisdiction (see the English Court of Appeal decision ofThuneand another v London Properties Ltd and others[1990] 1 WLR 562 at 570); and (c) whether, in the event of an adverse cost order being made against the plaintiff, there is reason to believe that the plaintiff’s litigation funders will not respond so as to enable the defendant’s costs to be paid (see the English High Court decision ofGeophysical Service Centre Co v Dowell Schlumberger(ME) Inc(2013) 147 ConLR 240 at [41]–[42]). 21 Second, it is also clear that the law on the provision of SFC does not only consider the interests of the defendant. The law also has to consider whether the provision of SFC would be too oppressive to the plaintiff (seeWhite Bookat para 23/3/5). Thus, in the High Court decision ofPandianMarimuthu v Guan Leong Construction Pte Ltd[2001] 2 SLR(R) 18, G P Selvam J explained (at [12]) that there must be appreciable degree of certainty that there will be a judgment for costs in favour of the defendant. Were it otherwise, “the order for security will be purposeless and will defeat the ends of essential justice when the plaintiff is disabled or unable to secure the security”. The learned judge went on to explain that “[t]he court should be circumspect to ensure that the defendant’s purpose of seeking security for costs is not to quell the plaintiff’s quest for justice”. In this regard, the circumstances relevant to assessing whether this second purpose is met would include: (a) the prospects of the plaintiff succeeding in the proceedings, subject again to the caveat that the court will not generally enter into a detailed examination of the merits (see the High Court decision ofSembawang Engineering Pte Ltd vPriser Asia Engineering Pte Ltd[1992] 2 SLR(R) 358 at [25]); (b) whether an order for SFC would preclude the plaintiff from pursuing its claim (seeGartnerat [10]); and (c) whether any impecuniosity of the plaintiff arises out of the defendant’s alleged breaches (see againGartnerat [10]). 22 Third, another purpose behind the provision of SFC is to ensure a sense of fair play between the parties. This explains why the courts have taken into account considerations such as: (a) whether the application for SFC is made to embarrass the plaintiff (seeRamanChettiar v Palaniappa Chettiar and another[1939] MLJ 165); (b) whether the defendant brought the application for security for costs promptly (seeGartnerat [10]) or if he used the application as a chip to be played at a most advantageous time to stifle abona fideclaim (seeSIC Collegeat [79], citing the Court of Appeal of the Supreme Court of Western Australia decision ofChristou v Stanton Partners Australasia Pty Ltd[2011] WASCA 176 (“Christou”) at [20]); (c) whether there is a significant extent of overlap between the defence or claim and any counterclaim, such that the plaintiff’s claim might be prejudiced while the defendant might be indirectly aided in pursuing its counterclaim (seeSIC Collegeat [78]–[84]); (d) whether the conduct of either the plaintiff or the defendant was reproachable (see the Federal Court of Australia decision ofHopeshorePty Ltd v Melroad Equipment Pty Ltd(2004) 51 ACSR 259 at [39]); and (e) whether the order for security for costs will affect any innocent third parties (see the High Court decision ofGateway Land Pte Ltd v Turner (East Asia) Pte Ltd[1987] SLR(R) 746 at [11]). 23 Parenthetically, a specific consideration may, in certain instances, simultaneously engage more than one of the three key purposes stated. For example, in the present case, at least according to the plaintiffs, the consideration of whether the first defendant’s application was taken out too late not only affects the sense of fair play between the parties, but it also directly impacts the plaintiffs’ ability to pursue their claim in Suit 229 because the first plaintiff is an insolvent company. In sum, while the relevant circumstances remain non-exhaustive, considering them under the main purposes behind the provision of SFC will hopefully provide clarity that recourse to an otherwise open-ended list cannot give. 24  With this general analytical framework in mind, I turn to the facts at hand.",
        "The first defendant satisfies the first stage of the applicable test": "25 For reasons that I will explain, I allow the first defendant’s appeal in part. To begin with, and this is not disputed, I find that the first defendant satisfies the first stage of the applicable test. As will be recalled, the first stage asks whether the court’s discretion to order security for costs under O 23 r 1(1) and/or s 388(1) has been invoked. In this regard, there is no doubt that the plaintiffs come within the relevant provisions so that the court’s discretion to order SFC is invoked. 26 First, in relation to the first plaintiff, the relevant provision is s 388(1). This section requires the first defendant to show “by credible testimony that there is reason to believe that the corporation will be unable to pay the costs of the defendant”. In this regard, the first plaintiff is an insolvent company in liquidation, which isprima facieevidence that it is impecunious in the sense that it will be unable to pay the first defendant’s costs, unless the contrary is proven (seeWhite Bookat para 23/3/19). Indeed, there is nothing displacing thisstarting point given that the first plaintiff’s statement of account maintained with the Official Receiver shows its account balance to be $8,333.03 as at 29 March 2023. 27 Second, in relation to the second plaintiff, the relevant provision is O 23 r 1(1)(b), which provides: Security for costs of action, etc. (O. 23, r. 1) 1.—(1) Where, on the application of a defendant to an action or other proceeding in the Court, it appears to the Court — … (b) that the plaintiff (not being a plaintiff who is suing in a representative capacity) is a nominal plaintiff who is suing for the benefit of some other person and that there is reason to believe that he will be unable to pay the costs of the defendant if ordered to do so; … then, if, having regard to all the circumstances of the case, the Court thinks it just to do so, it may order the plaintiff to give such security for the defendant’s costs of the action or other proceeding as it thinks just. It is clear that the second plaintiff, being the liquidator of the first plaintiff, is such a “nominal plaintiff”. Further, it is also clear, pursuant to the indemnity that the SGI Creditors have undertaken to provide, that the second plaintiff himself will not pay any of the first defendant’s costs. 28 Accordingly, I find that the first defendant satisfies the first stage of the applicable test in ascertaining whether SFC should be ordered. I turn therefore to the second stage of the applicable test.",
        "The first defendant also satisfies the second stage of the applicable test": "29 In line with the foregoing discussion about the second stage of the applicable test, I will structure my analysis of the relevant considerations according to the various purposes behind the provision of SFC. In sum, for reasons that I will develop, I conclude that the first defendant also satisfies this stage of the test because, on a balanced consideration of all the relevant circumstances, it is just to order SFC in the present case.",
        "The circumstances that pertain to protecting the first defendant from adverse costs consequences": "The prospects of the first defendant succeeding in Suit 229 (1) The applicable principles 30 I begin with the first defendant’s prospects of succeeding in Suit 229, which in turn requires a consideration of the merits of the plaintiffs’ claim against him. In this respect, the plaintiffs rely on the High Court decision ofFrantoniosMarine Services Pte Ltd and another v Kay Swee Tuan[2008] 4 SLR(R) 224 (“FrantoniosMarine”) (at [46]), where Chan Seng Onn J quoted the English Court of Appeal decision ofKufaanPublishing Limited v Al-Warrak Publishing Limited(Unreported, 1 March 2000): It is equally clear that, in the course of the balancing exercise, the court will not have regard to the merits of the action in the sense of the claimant company’s prospects of success unless there appears to be a high degree of probability in one direction or the other. … 31 The plaintiffs also rely on another related passage inFrantoniosMarine(at [49]): … Unless the evidence was so plainly, clearly and overwhelmingly in favour of the plaintiffs, and unless I could readily discern from the available evidence before me that the plaintiffs would have a high degree of probability of succeeding in their claim against the defendant, then that factor could properly be weighed in the balance. … As such, the plaintiffs argue that while the strength or weaknesses of a plaintiff’s case is a relevant circumstance that a court should consider in deciding to order SFC, the court should not be required to perform a detailed investigation of the evidence and should generally refrain from going into the merits of a case in detail,unless the case merits otherwise. Put differently, the plaintiffs appear to suggest that the merits of the parties’ cases can only be considered in deciding whether SFC should be orderedifthe case was so clearly in favour of one party. 32 In as much as this is the plaintiffs’ submission on the law, I disagree. In my view, it is necessary to separate two distinct questions in so far as the relevance of the merits of the parties’ cases is concerned: first, when this factor can be taken into account in considering whether to order SFC, and second, if this factor can be taken into account, the level of assessment that a court should undertake. 33 In relation to the question ofwhenthe merits of the parties’ cases can be considered, I do not think that Chan J inFrantoniosMarineintended to say that a court can only consider this factor if the merits of the case were so clearly in favour of one party. Rather, the learned judge said that if the merits of the case were so clearly in favour of one party, this could be aweightyconsiderationin the overall assessment of whether to order SFC. However, in order to even arrive at this conclusion, a court necessarily needs to assess the merits of the parties’ respective cases. As such, it is logical that a court can always take into account the merits of the parties’ cases, but this is a separate question from how the court is to assess the merits and the weight that is to be attributed to this consideration. 34 This conclusion is entirely in line with the Court of Appeal’s analysis inCreative Elegance. In that case, the court discussed a line of cases on O 23 r 1(1)(a) and s 388(1), observing that in all those cases, the strength or weaknesses of the plaintiff’s case is one of the relevant circumstances to be taken into account (at [25]). Indeed, it is telling from the Court of Appeal’s statements that the strength of the plaintiff’s case goes towards theweightto be given to this consideration, as opposed to whether this consideration can be taken into account in the first place. In this regard, I refer to the following passage inCreative Elegance(at [25]): … it is not the law that once the plaintiff has shown that he has abona fideclaim with a reasonable prospect of success or that he is likely to succeed in the sense that he has a high probability of success, it follows as a matter of course that the court will not make an order for security for costs. Such a fact, if establishedprima facie, is only one of the circumstances that the court will take into consideration in determining whether in exercise of its discretion an order for security for costs should be made or should be refused. The court has to examine all the other circumstances and come to the conclusion whether it is just that an order for security for costs should or should not be granted. I would also add that while the Court of Appeal had made its analysis in the context of a plaintiff’s case, the analysis must be equally applicable in considering the merits of a defendant’s case. Accordingly, as the learned AR explained in his grounds below, it is not necessary that a plaintiff must first satisfy a court that he has an overwhelming case before the court can have regard to the merits of the case. In other words, the merits of the parties’ case isalwaysa relevant circumstance in deciding whether to order SFC. 35 With this in mind, I now turn to the separate question ofhowa court should assess the merits of the parties’ case. In this regard, I do not think it makes sense to say that a court will not enter into a detailed assessment of the merits unless the evidence is so clearly in favour of one party. This is because a court can only conclude that the evidence is so clearly in favour of one party if it performs an assessment of the merits. Accordingly, in so far as the High Court Registry inStreetSine Singapore Pte Ltd v Singapore Institute of Surveyors and Valuers and others[2019] SGHCR 1 suggested this proposition (at [18]), I respectfully disagree. Rather, what the cases say is that in the assessment of the merits, the court should not be required to perform an elaborate or detailed investigation of the evidence. As such, as the learned AR in the present case again clearly put it, “any contention about reasonable prospects or high probability of success should be one that is apparent on the face of the evidence or the pleadings”.1Foot Note 1×Certified Transcript of 12 April 2023 at p 21.There ought not to be a distinction between a “detailed” and “non-detailed” assessment depending on the state of the evidence. It is after this summary assessment of the evidence that the court should decide on the weight to be placed on the merits of the parties’ cases. (2) My decision: the first defendant’s prospects of success in Suit 229 is a neutral factor 36 Returning to the present case, I am of the view that the first defendant’s success in Suit 229 (and correspondingly the plaintiffs’ case against him) is at best a neutral factor in deciding whether to grant SFC. 37 As for the assessment of the merits of the first defendant’s case, it is useful to start by setting out the plaintiffs’ case. In sum, the plaintiffs’ case in Suit 229 is that the first defendant had, in a conspiracy with one or more of the defendants, caused the first plaintiff to transfer its shares in two companies, AMBO Holdings International Ltd (“the AMBO Shares”) and Southwest Energy (BVI) Limited (“the SWE Shares”), to the fifth and sixth defendants for no consideration. The plaintiffs’ case is premised on the first plaintiff’s financial statements recording these shares as assets between Financial Year 2010 and Financial Year 2016. There were also other contemporaneous documents that the plaintiffs say confirmed the first plaintiff’s beneficial ownership of the AMBO Shares and the SWE Shares. However, in the unaudited financial statements for Financial Year 2017, the shares were written down and no longer reflected as the first plaintiff’s assets. As the learned AR put it below, the plaintiffs’ case appears to be that there was a wrongful disposal of these shares which was intended to frustrate the enforcement of the arbitration award that the SGI Creditors had obtained against the first plaintiff. 38 As against the plaintiffs’ case, the first defendant’s defence is that the AMBO Shares and the SWE Shares had always been held on trust by the first plaintiff for the benefit of an entity known as SW Development Trust. The first plaintiff had then been authorised by SW Development Trust to dispose of the shares. In support of his case, the first defendant points to several documents, including certain share certificates, said to support his assertions. The first defendant also alludes to the fact that he had, in negotiations with the sixth defendant, represented to them that the first plaintiff was a trustee. However, the plaintiffs dispute the authenticity of those documents. In essence, the first defendant does not dispute that the AMBO Shares and the SWE Shares had been disposed of. However, the first defendant argues that these shares had been disposed of rightfully because the first plaintiff was never the owner of these shares. 39 In the light of the affidavit evidence before me, while I do not think that the first defendant’s case is implausible, I also do not think that the case is overwhelmingly in favour of the first defendant. First, in so far as the share certificates say that the SWE Shares are held on trust, that is only true at the time the certificates were issued. This does not necessarily mean that the shares continued to be held on trust when they were allegedly wrongfully disposed of. This is a question to be considered at trial. Second, in relation to what the first defendant says that he represented to the sixth defendant, that is evidence that has to be tested at trial. Accordingly, while I think that the first defendant has a plausible defence, this is at best a neutral factor in deciding whether to order SFC since it cannot be said that the first defendant will more likely than not succeed in his case. The public policy in favour of awarding security for costs in relation to impecunious companies 40 More broadly and beyond the merits of the parties’ cases, the first defendant relies on the Court of Appeal decision inHo WingOn Christopher and others v ECRC Land Pte Ltd (in liquidation)[2006] 4 SLR(R) 817 (“ECRC Land”)to argue that public policy militates against allowing an impecunious company, such as the first plaintiff, to commence legal proceedings against a defendant without giving the latter the protection of SFC. In this regard, the Court of Appeal had said this (at [72]): In our view, the law on security for costs is express recognition that impecunious companies do not have an unfettered freedom to commence legal actions against defendants who cannot be compensated in costs if they win. When one is dealing with a company rather than a natural person, public policy is in favour oflimiting, rather than encouraging, uninhibited access to the courts. This isa fortioriwhere the company in question is already in insolvent liquidation. In such cases, the high likelihood that a successful defendant’s costs will be unrecoverable requires the law to give greater protection to the defendant rather than the claimant company. [emphasis in original] 41 The Court of Appeal’s statement inECRC Land,that the balance is in favour of ordering SFC for a defendant who faces litigation by an impecunious company, is in line with Chan J’s concern inFrantoniosMarineabout the defendant being “saddled with unpaid costs that the plaintiff corporation will not be able to pay”. Indeed, as Chan J elaborated, the rationale behind this proposition is commonsensical: since it is clear from the impecuniosity of the plaintiff company that it will be unlikely to pay the defendant’s costs, it must follow that the defendant ought to be protected against litigation that it cannot avoid. As such, in the words of the learned judge, “[i]nterested parties not prepared to provide the funds to meet the security for costs orders, generally ought not to be allowed to finance and launch litigation using the impecunious plaintiff corporation as a shield” (seeFrantoniosMarineat [53]). 42 It is, however, telling that neitherECRC LandnorFrantoniosMarinemandated that a court must always order SFC in favour of a defendant when the defendant is faced with litigation by an impecunious company. In this regard, I respectfully agree with the learned AR that the shifting of the balance in favour of ordering SFC for the defendant in this situation “is not an immutable one”.2Foot Note 2×Certified Transcript dated 12 April 2023 at p 36.It is important, following the learned AR’s views, to recognise that it is not ineverycase where a defendant is faced with litigation by an impecunious company, that an order for SFC will be made. This is because the circumstances of each case may vary. For example, a defendant who is sued by an impecunious company may have a completely unsustainable defence. In such a case, the court will rightly favour the company’s interest in pursuing its claim over the defendant’s interest to be able to recover its costs. 43 Another countervailing interest, which the plaintiffs raise in this present appeal, is that of the plaintiff’s interest in knowing the defendant’s position in relation to SFC “before it embarks further on the litigation and before it decides to commit further and more substantial sums of money in litigating its claim”,3Foot Note 3×Certified Transcript dated 12 April 2023 at p 36.in the words of the learned AR. This was why the learned AR concluded that “[p]olicy therefore protects the defendant in so far as he avails himself at an opportune time of the right to security and takes steps to protect his position”.4Foot Note 4×Certified Transcript dated 12 April 2023 at p 36.I will address this point in a subsequent part of this judgment, but for now, it suffices to say that I agree with the learned AR’s view that a defendant’s delay in bringing a SFC application can point against the granting of SFC. Whether the first defendant will recover his costs in any event if SFC were not granted? 44 I turn next to consider whether the first defendant will recover the costs of the litigation in any event if the SFC were not granted. In this regard, the plaintiffs argue that granting SFC would not be needed as the first defendant’s costs are indemnified under the estate costs rule. This rule was explained by the Court of Appeal inECRC Land(at [9]): The estate costs rule is a recognised common law rule of priority in the liquidation of companies. It was established in the 19th century by cases such asInre Home Investment Society(1880) 14 Ch D 167 (‘Home Investment’), and has since been followed by courts in Singapore and other common law jurisdictions. The estate costs rule supplements s 328(1)(a) of the Companies Act (Cap 50, 1994 Rev Ed) (‘CA’), which provides that ‘the costs and expenses of the winding up’ including the remuneration of the liquidator shall be paid in priority to all other unsecured debts. Whilst legislation has provided that liquidation expenses take first priority overother categoriesof unsecured claims, the estate costs rule clarifies therelativepriority between the various types of liquidation expensesinter se.In particular, the rule states that a successful litigant against a company in liquidation is entitled to be paid his costs in priority to the other general expenses of the liquidation, including the costs and remuneration of the liquidator… [emphasis in italics in original; emphasis added in bold italics] 45 In addition to the rule that a successful litigant against a company in liquidation is entitled to be paid his costs in priority to the other general expenses of the liquidation and all other unsecured debts, the estate costs rule also provides that a liquidator who breaches that rule is personally liable for any shortfall in the opponent’s costs recovery which is caused by the breach of the rule (seeECRC Landat [20]–[21]). In this case, the plaintiffs argue that since the second plaintiff has an indemnity from the SGI Creditors that was endorsed by an order of court, the estate costs rule in substance gives all the defendants, including the first defendant, the benefit of the indemnity without them having to ask from it. As I understand it, this is presumably because the second plaintiff would be personally liable for the first defendant’s costs if such costs are not paid out in accordance with the estate costs rule, and in such a situation, the second plaintiff can likely discharge that liability by relying on the indemnity from the SGI Creditors. 46 With respect, I do not agree with the plaintiffs’ contentions. To begin with, it presupposes that the first plaintiff would have enough assets at the end of the liquidation to make any meaningful payment towards the defendant’s costs. But even if it could be assumed that the first defendant’s costs could be meaningfully paid under the estate costs rule, he would still have to wait for the entire liquidation process to be completed before a dividend can be paid. This might be a long and drawn-out process, and the plaintiffs do not provide any indication as to how long it might take. This is unsatisfactory, especially when viewed in light of one of the key purposes of ordering SFC, which is to ensure that a defendant can readily and easily recover his costs if the plaintiff’s claim against him proves to be unsuccessful. Finally, I do not think that the indemnity from the SGI Creditors gives, in effect, an indemnity to the first defendant. This is because the indemnity would only be effective if the second plaintiff is personally liable for the first defendant’s costs. For this to happen, the second plaintiff must have contravened the estate costs rule by making, for instance, dividends that do not observe the proper priority of the first defendant over the other unsecured creditors. There is no reason for the second plaintiff to do so and make himself personally liable (albeit apparently having the protection of the indemnity). As such, I do not think that the indemnity from the SGI Creditors would benefit the first defendant. Summary 47 In summary, in so far as the circumstances that pertain to protecting the first defendant from adverse costs consequences are concerned, I find them to be neutral as to whether SFC should be ordered in favour of the first defendant. First, I do not find that the first defendant has an overwhelmingly strong defence in his favour. Second, while the cases do say that a defendant being sued by an impecunious company should usually be entitled to SFC, this is not an immutable rule. This will ultimately depend on the circumstances of the case. Third, while I acknowledge that the first defendant may be able to recover his costs under the estate costs rule, it is unsatisfactory that he can only be paid a dividend near the end of the liquidation process. In other words, I do not find any compelling reason viewed from the first defendant’s perspective to order SFC in his favour.",
        "The circumstances that pertain to avoiding stifling the plaintiffs’ ability to pursue their claim": "48 Having assessed the present case from the first defendant’s perspective, I turn now to consider the matter from the plaintiffs’ perspective. The primary consideration here is whether the plaintiffs’ ability to pursue their claim is stifled by an order of SFC. The prospects of the plaintiffs succeeding in Suit 229 49 I first consider the prospects of the plaintiffs succeeding in Suit 229. The analysis here mirrors that above concerning the prospects of the first defendant succeeding in Suit 229. In this regard, I agree with the learned AR that the plaintiffs have demonstrated a reasonable prospect that their claims in Suit 229 will succeed. However, I would not characterise the prospects of the plaintiff succeeding as going beyond this. Indeed, as I have explained above, I find that the first defendant has raised certain plausible defences. Accordingly, whether the plaintiff may succeed in Suit 229 is a neutral factor in the overall assessment of whether SFC should be ordered in favour of the first defendant. The first defendant’s delay in bringing the application for security for costs (1) The applicable principles 50 I come now to the question of delay, which I alluded to earlier at [43] as a potential consideration that operates against the general policy of granting SFC in favour of defendants in proceedings commenced by an impecunious company. This was a point that the parties pressed most strongly before me. The plaintiffs assert that the first defendant’s delay in applying for SFC amounted to 727 days from the date Suit 229 was commenced. On the other hand, the first defendant says that it was only in August 2022 when it became viable for him to estimate his costs exposure in Suit 229. This is because, so the first defendant argues, August 2022 was when the parties were able to put together their lists of witnesses and estimate the number of trial dates required. 51 To begin with, it is important to be clear as to how any alleged delay is to be analysed. The preliminary issue is to consider the length of the alleged delay. To do so, the court must determine the point in time from which such delay is to be measured. After the court assesses the length of the delay, it must decide how much weight to give to the delay. In this weighing exercise, the rule of thumb is that SFC “is not a card that a defendant can keep up its sleeve and play at its convenience” [emphasis in original], as the Court of Appeal inSIC Collegeput it (at [79]). Therefore, to ensure that SFC applications are not used as such, it is important to examine whether the defendant can provide a good reason for the delay (see the Court of Appeal decision ofTjong VerySumito and others v Chan Sing En and others[2011] 4 SLR 580 (“Tjong VerySumito”) at [61]). 52 Additionally, in determining the weight to be given to such delay, the court must consider whether there is any prejudice to the plaintiff and, if so, the extent of that prejudice. Significantly, as the Court of Appeal inTjong VerySumitoopined, “the significance of the delay is reduced by the absence of relevant prejudice”, although it will remain “one factor to be taken into account in the balancing exercise of determining the justice or injustice of making an order for security” (at [61]; citing the Supreme Court of New South Wales decision ofCorbettv Nguyen[2008] NSWSC 1265 at [45]). The first defendant points out that other jurisdictions have adopted this approach as well. For instance, inNwagwuv Elahi and another[2002] EWHC 2412 (Ch), the English High Court granted SFC notwithstanding that the defendants had made the application less than a month before the commencement of trial, something for which there was little explanation provided by the defendants (at [13]). Ferris J reasoned that although the plaintiff had alleged that his claim would be stifled if SFC were ordered against him as he would be unable to give security, he had not provided any evidence as to his means or as to the possibility that he might be able to obtain funds from a third party (at [14]). In the result, the learned judge was not deterred from making an order for SFC which he otherwise would have regarded the defendants as entitled to (at [16]). 53 Similarly, as the first defendant submits, the Hong Kong courts have placed the same emphasis on prejudice in assessing the weight to be given to the defendant’s delay in applying for SFC. InHung Fung Enterprises Holdings Limited& Anor v The Agricultural Bank of China[2011] HKCA 229, the Hong Kong Court of Appeal had to consider whether to order SFC on appeal even though the defendant only made the application six months after the Notice of Appeal was filed. In that regard, the court observed that the defendant had provided no explanation for delay but nevertheless held that, in the absence of any prejudice suffered by the plaintiffs, it was not a sufficient countervailing factor to not grant SFC (at [37]). 54 In summary, there are three separate questions that a court may have to examine when delay is alleged in the context of an application for SFC. (a) First, was there a delay and how long was it?(b) Second, if there was a delay, can the defendant provide a good explanation for the delay?(c) Third, if the defendant cannot provide a good explanation, was the delay prejudicial to the plaintiff? I will consider each of these questions below. (2) The first defendant provided a satisfactory explanation for the delay in applying for security for the costs of trial and post-trial work 55 First, I find that the first defendant provided a satisfactory explanation for the delay in applying for SFC, at least in respect of trial and post-trial work. In this regard, it is not helpful for parties to measure delay in purely quantitative terms, so that the longer the delay, the less likely that a court would award SFC. Rather, I agree with the learned AR that the crux of the matter “is the point in which a defendant can properly ascertain his likely costs exposure”,5Foot Note 5×Certified Transcript dated 12 April 2023 at p 15.which marks the point at which the first SFC application should be taken out. This is consistent with the authorities, such as the English Court of Appeal decision ofCroft Leisure Ltd (inliq) v Gravestock & Owen[1993] BCLC 1273 (“Croft”)and the Ontario Superior Court of Justice decision ofUnimac-United Management Corp v Canadian National Railway Co[2015] OJ No 1927 (“Unimac”). These cases all provide that a defendant should only be required to apply for SFC after it is able to make a considered assessment of its likely costs in defending the suit that has been brought against it (seeCroftat 1279; andUnimacat [52]). 56 In particular, the Ontario Superior Court of Justice held inUnimacthat a defendant should apply for SFC promptly after it learns that it has a “reasonable basis” for bringing such an application (at [52]). The court further observed (at [55]) that applications for SFC are not usually brought in Canada until at least the pleadings and productions of documentary evidence are done. This is because it would be difficult for the defendant to estimate the issues and costs of the action prior to that point. On the facts of that case, the defendant had applied for SFC more than two years after the commencement of the action. Yet, the court found that there was no delay in the filing of the application. Similarly, in the High Court decision ofElbow Holdings Pte Ltd v Marina Bay Sands Pte Ltd[2014] SGHC 219, the court held that the fact that the defendant waited 18 months from the commencement of the action to seek SFC did not amount to a significant delay because “the parties ha[d] just completed discovery” (at [15]). 57 In the proceedings below, the plaintiffs asserted that despite numerous previous steps in the proceedings, the first defendant only chose to file his application for SFC late in the day,ie, 727 days since the commencement of Suit 229. The learned AR agreed with the plaintiffs for the primary reason that SFC is in practice often sought in stages, so that parties can return to court after an initial SFC application had been granted to ask for more security as the matter progresses and costs estimates change. As such, the learned AR held that the first defendant ought to have made an initial application for SFC by the time general discovery was completed in October 2021. At that stage, enough work would have been done by that time for the first defendant to ascertain his likely costs exposure. Therefore, the learned AR found that the first defendant was guilty of delay in taking out the application for SFC only on 28 February 2023, which was at that time about three months before the trial was slated to begin (see above at [6]). Ultimately, in the learned AR’s view, the first defendant knew from the beginning that the first plaintiff is an impecunious company. He should therefore have taken out an application for SFC at the earliest instance, which would have been October 2021. Importantly, the learned AR’s finding that the first defendant was guilty of delay was made in relation to theentiresum of security that the first defendant sought. In reaching his finding, the learned AR did not specifically consider whether the delay pertaining to the part of the costs which could not have been assessed until later in the proceedings, was different from the delay in respect of the costs which could have been assessed early on in the proceedings. 58 It is for this reason that I respectfully disagree with the learned AR’s finding of delay. In my view, in ascertaining whether there is delay in bringing an application for SFC, the court should conduct a separate assessment of whether there was delay in relation to the different types of costs that can only be assessed at different stages of the proceedings. By way of example, if a defendant applies for security for the costs incurred during thepre-trialstage and duringtrialseparately, it cannot be assumed that just because a defendant is guilty of delay in seeking security for pre-trial costs, that it must necessarily mean that he is also guilty of delay in respect of the costs of trial. In this example, the defendant might have only been able to make a considered assessment of the costs of trial at a much later point in time. Indeed, as the Ontario Superior Court of Justice inUnimacsuggested (at [55]), a defendant might only have a better picture of the expected costs of the later stages of the proceedings after the case has progressed to a more advanced stage. As such, if the said defendant were to make an application for SFC only in respect of the costs of trial later in the proceedings (and not for the costs of pre-trial work), he may not be in delay. Therefore, in assessing the question of delay, it is inappropriate to make a global finding that there has been delay in respect ofeverycategory of costs for which security is sought, unless this is truly borne out by the facts. 59 Turning to the facts of this present appeal, I can accept that the first defendant, being legally advised and obviously knowing that the first plaintiff is an impecunious company from the beginning, is guilty of delay for not making earlier applications for SFC. More specifically, I agree with the learned AR that the first defendant would at least be in a position to estimatesomecosts exposure in October 2021, which was when general discovery was completed. However, his failure to take out an application for SFCat that timecannot mean that he should be faulted for applying for SFCnowin respect of the costs that he might only have been able to estimate as the case progressed, as new information emerged so as to change his estimate of his costs exposure. Indeed, this is the very reason why applications for SFC are taken out in stages. 60 However, and with respect to the learned AR, I do not think that October 2021 is the point from which to assess whether the first defendant is guilty of delay in bringing his SFC application,ie, SUM 519. This is because SUM 519 is not a homogenous application but is in fact broken up into costs for pre-trial, trial, and post-trial work. In this regard, I accept that the first defendant is not entitled to security for the costs of most of the pre-trial work because there has been a significant delay in seeking security when most of the pre-trial work hasalreadybeen done, with no good explanation given for the delay. That said, had there been a good explanation for the delay, I might have found that the first defendant is entitled to security for the costs of its pre-trial work. In the end, each case must turn on its own facts. However, while I can accept that October 2021 may be the point from which to measure whether there was delay in the first defendant’s application for security in respect of the costs of pre-trial work, the same cannot be said about his application for security in respect of the costs of trial and post-trial work. Instead, in my view, the reasonable date from which to measure whether the first defendant’s application for security for the costs of trial and post-trial work is August 2022, when the parties were still in the stage of specific discovery. 61 Looked at in another way, even if the first defendant was wrong not to have made earlier applications for SFC for pre-trial work, he is not precluded from making an application for SFC in respect of costs for trial and post-trial work once he obtains sufficient information to enable him to do this. I do not think that the plaintiffs, being legally advised, can claim to be surprised by this, especially with the knowledge that the first plaintiff is an impecunious company which is not able to pay to the first defendant any costs orders made in the latter’s favour. Indeed, if the plaintiffs claim to be surprised by the first defendant’s application for SFC once he had information to enable him to estimate his costs exposure for trial and post-trial work, then the plaintiffs (or more accurately, the interested parties), would be guilty of what Chan J had said inFrantoniosMarineof using an impecunious plaintiff corporation as a shield to launch a litigation but walking away with no costs consequences should the litigation fail (at [53]). 62 As such, measured from August 2022, the most that can be said is that the first defendant had delayed his application for SFC, in respect of costs for trial and post-trial work, by about four to five months until he put in his formal application in February 2023. While this period of delay is not ideal and can potentially still be significant, I find that the first defendant has provided a good explanation for this delay. This is because the first defendant’s then solicitors had discharged themselves on 17 October 2022. In their place, the first defendant’s present solicitors were appointed only on 11 November 2022. The present solicitors then dealt with an outstanding application in HC/SUM 3727/2022, which concluded on 19 January 2023. It was after that that the present solicitors wrote to the plaintiffs on 30 January 2023 requesting for SFC to be provided before making the formal application for the same on 28 February 2023. This, to my mind, is an adequate explanation for the relatively short delay of about five months between August 2022 and February 2023. (3) There would been no prejudice to the plaintiffs in any event 63 Furthermore, even if there had been an unsubstantiated delay in the present case, I do not think that there is prejudice to the plaintiffs. In this regard, the learned AR held that a defendant’s right to be protected against litigation by an impecunious company is balanced against the plaintiff’s entitlement to know its position in relation to security before it embarks on the litigation (seeChristouat [20]). The learned AR further explained that since the first defendant did not seek SFC at an earlier stage despite knowing that the first plaintiff is an insolvent company, which is unlikely to have any assets or means to satisfy costs ordered against it, the SGI Creditors “would have fairly and reasonably assumed that no further expense in the form of SFC was required”.6Foot Note 6×Certified Transcript dated 12 April 2023 at p 19.The learned AR then reasoned that from October 2021 (which is the point at which the learned AR regarded that the first defendant ought to have taken out an application for SFC) to until late February 2023 (which is when the application for SFC was filed), the SGI Creditors “would have operated their budget on the basis that the defendants were not asking for SFC and in consequence incurred costs of S$1.1m, a rather significant amount by any measure”.7Foot Note 7×Certified Transcript of 12 April 2023 at p 19.As such, the learned AR held that the first defendant’s application for SFC would have surprised the SGI Creditors and “[put] them in a bind in that they are forced to go beyond whatever budget they initially had in mind or else risk all the hitherto incurred costs being wasted”.8Foot Note 8×Certified Transcript of 12 April 2023 at p 20.This was the prejudice which the learned AR thought that the first defendant’s belated application for SFC could have caused to the plaintiffs. 64 With respect, I disagree with the learned AR. First, in a system where the practice is for SFC applications to be taken out in stages, I do not think that the first defendant’s failure to apply for SFC around October 2021, based on the information on his costs exposure that he had at the time, should operate as some kind of estoppel against all future SFC applications. More specifically, it cannot be that the first defendant’s failure to apply for SFC at a time when he could do so in respect ofsomework can amount to a representation that he would not apply for SFC in respect ofall futurework when he comes to possess the relevant information on his costs exposure in the future. To conclude otherwise would have a significant impact on applications for SFC. It would mean that, whether the plaintiff is impecunious or not, a defendant would be put under pressure to apply for SFC in respect ofsomework at the soonest possible instance or run the risk of having its entitlement to SFC for theentireaction forfeited. This cannot and should not be how the SFC regime is to operate as it is ultimately aimed at protecting the defendant from litigation costs that it cannot avoid, not to put the defendant on edge to take constant action to protect itself. 65 Parenthetically, while I observe that applications for SFC under the new Rules of Court 2021 (“ROC 2021”) are to be made early on in the proceedings under a single application pending trial (“SAPT”) (see O 9 r 9(2) and O 9 r 9(4)(d) of the ROC 2021), I do not think that this detracts from my conclusion above. Although the SAPT should now include requests for SFC, this does not mean that it is impermissible to make an application for SFCafterthe SAPT. Indeed, O 9 r 9(7) of the ROC 2021 contains a qualification that “[n]o application may be taken out by any party at any time [outside of the SAPT]other than as directed at the case conference or with the Court’s approval” [emphasis added]. This therefore gives the court the power to allow a defendant to apply for SFC even after the SAPT if new information emerges so as to enable the defendant to better quantify the SFC that it needs with respect to later stages of the proceedings. 66 More broadly, the present case also turns on the policy enunciated inECRC LandandFrantoniosMarinethat a defendant facing litigation from an impecunious company should generally be protected by an order for SFC. While I have said above that these cases do notmandatethat a defendant be so protected inallcases, I think that a defendant should be protected where there are no other strong contrary factors against awarding such protection. In the present case, taking the plaintiffs’ case at their highest, even if the first defendant had unduly delayed his application for SFC in respect of trial and post-trial work, any uncrystallised prejudice occasioned to the plaintiffs cannot overturn thedefiniteprejudice that the first defendant will suffer in the event that he succeeds at trial. The first defendant’s prejudice is definite because there is a very real risk that the first plaintiff, being an insolvent company, is not able to pay costs ordered against it, nor would the second plaintiff, who is a nominal plaintiff, be willing to do so. On balance, therefore, I find that there is no prejudice caused to the plaintiffs even if the first defendant had unduly delayed its application for SFC in respect of trial and post-trial work. Whether an order for security for costs would prevent the plaintiffs from pursuing their claim in Suit 229? 67 Finally, I turn to the related question of whether an order for SFC might preclude the plaintiffs from pursuing their claim in Suit 229. In this regard, it is sufficient for the plaintiffs to show that “there is aprobabilitythat [they] will be unable to pursue the action if the order is granted; [they] need not show with certainty that [they] will be unable to do so” [emphasis added] (see the High Court decision ofPeng Ann Realty Pte Ltd v Liu Cho Chitand others[1992] 3 SLR(R) 178 at [15]). To this, I would add the qualification that there must be a significant probability that a plaintiff’s claim would be stifled. This higher threshold is consistent with the finding of the English High Court inAbsolute LivingDevelopments Limited (In Liquidation) v DS7 Limited and Others[2018] EWHC 1432 (Ch), where the court concluded that there was a “clear risk” that the plaintiff’s claim would be stifled if SFC were granted (at [34]). 68 In an attempt to make good their point that their claim would be stifled, the plaintiffs filed a further affidavit to state that the SGI Creditors would not be willing to furnish SFC and that they would cease further funding of Suit 229 if SFC is ordered. However, the plaintiffs also insist that, in answering the question whether they can continue with their claim in Suit 229, the court is restricted to assessing the means of the first plaintiff, and not the means of a third party such as the SGI Creditors. 69 As a preliminary point, I agree with the learned AR that in assessing a plaintiff’s ability to furnish SFC, the court is not restricted to the plaintiff alone but can also look to the availability of creditor funding. Indeed, like the learned AR, I find it inconsistent that the plaintiffs have filed an affidavit attesting to the SGI Creditors’ position on creditor funding but have yet insisted that the court cannot rely on creditor funding to ascertain the first plaintiff’s ability to furnish SFC. More substantively, I also agree with the learned AR that the SGI Creditors have only stated their “unwillingness” to provide further funding and not that they “will not” provide further funding if SFC is ordered. Accordingly, like the learned AR, I do not find that there is a significant probability that the plaintiffs’ claim would stop in its tracks if SFC were granted. Summary 70 In summary, as for whether the plaintiffs’ ability to pursue their claim in Suit 229 will be stifled if SFC were granted, I find the overall assessment on the facts of the case to be neutral. First, I do not think that the plaintiffs have an overwhelmingly strong case in their favour. Second, I do not find that the first defendant has brought his application for SFC, at least in respect of the costs of trial and post-trial work, after an unsubstantiated delay. Third, I do not assess the first defendant’s application for SFC to be oppressive.",
        "Summary of the analysis under the second stage of the applicable test": "71 While I have concluded that the considerations as viewed from the first defendant’s and the plaintiffs’ perspective are neutral, I decide that the first defendant is nevertheless entitled to SFC. This is to give effect to the key consideration of affording protection to defendants facing litigation from an impecunious company. In connection with this, I do not think that the plaintiffs can claim to be surprised by the first defendant’s application for SFC, at least for some aspects, when they have been legally advised such that they know that applications for SFC often take place in stages.",
        "Conclusion and the appropriate quantum of SFC": "72 For all these reasons, I therefore allow the first defendant’s appeal in part to the extent that I respectfully disagree with the learned AR that the first defendant is notentitled, based on the circumstances of RA 80, to SFC in respect of the costs of trial and post-trial work. I qualify my decision in this way because the first defendant cannot yet put a figure to the quantum of SFC he requires in respect of trial and post-trial work. This is in turn because the plaintiffs’ amendment of its Statement of Claim has now rendered unclear the length of trial and the extent of the corresponding work. The first defendant is therefore at liberty to bring an application for SFC in respect of trial and post-trial work at the appropriate time. That said, my decision should not be read as binding the assistant registrar hearing any subsequent SFC application; as with any application for SFC, the prevailing facts must be taken into account in deciding whether or not to order SFC. 73 However, I accept that the first defendant has taken out the SFC too late in respect of pre-trial work, most of which has already been done or is in the process of being done. As such, I find that it will not be just to order SFC in respect of pre-trial work because, adapting the learned AR’s reasoning, the plaintiffs would have conducted themselves in accordance with the first defendant’s apparent conduct in not seeking SFC for such work. It will be unfair now, when a lot of the work has already been done, to order SFC in respect of such work. 74 In closing, I thank the counsel for the parties, Mr Salem Ibrahim, as well as Mr Darren Low, for their helpful submissions. Finally, unless they are able to agree, the parties are to write in with their submissions on costs for the present appeal within 14 days of this decision. Goh YihanJudicial Commissioner Salem bin Mohamed Ibrahim, Yap Zhan Ming, Kimberly Ng Qi Yuet and Kong Hui Xin Annette (Salem Ibrahim LLC) for the plaintiffs;Mohammed Reza s/o Mohammed Riaz, Nigel Desmond Pereira, Darren Low Jun Jie and Ariane Kea Tong (JWS Asia Law Corporation) for the first defendant;Tong Siu Hong Joshua and Tan Yan Ru (Kalco Law LLC) for the third defendant (watching brief)."
    }
}