{
    "case_title": "VWMvVWN",
    "ncitation": "[2023] SGHC(A) 4",
    "coram": "Woo Bih Li JAD (delivering the judgment of the courtex tempore)",
    "sections": {
        "Introduction": "1 The only matter before the Appellate Division of the High Court (“the AD”) is the issue of a flat at Tampines Street 61 developed by the Housing and Development Board (“the HDB”). On 13 July 2017, parties had applied to purchase the flat from the HDB at a price of $467,130 before divorce proceedings were commenced in March 2019. They were eventually allocated the flat. However, they had not taken possession of the flat or made full payment pending the outcome of the divorce proceedings and hence their purchase of the flat was not completed. 2 In the division of matrimonial assets before a District Judge (“the DJ”), the wife had asked for the husband to transfer his interest in the flat to her. On 31 May 2021, the DJ made various ancillary orders in which he declined to accede to the wife’s request as he was of the view that the value of the flat had increased and it would be wrong for the wife to benefit from that increase without a corresponding benefit to the husband. The DJ hence ordered that parties were to return the flat to the HDB. The DJ also made orders on other issues. 3 On 7 June 2021, the wife appealed against the orders of the DJ made on 31 May 2021 including his order in respect of the HDB flat. 4 The appeal was heard by a judge of the General Division of the High Court (“the Judge”) on 9 March 2022. She dismissed the wife’s appeal on various issues including the flat. The grounds of decision were issued on 16 January 2023 (“the GD”), shortly before the hearing of this appeal. The Judge’s decision to dismiss the appeal was mainly premised on the fact that the husband would not receive a refund of his deposit to his Central Provident Fund (“CPF”) savings while the wife would gain a windfall should the price of the flat increase (GD at [27], [30] and [31]). In this regard, the Judge observed that it would be unjust for the wife to retain the HDB flat without giving “a refund of [the husband’s] CPF moneys used for the deposit to the HDB” (GD at [27]). The Judge also observed that the husband needed a roof over his head (GD at [27]) and that the wife’s position was unreasonable given that she had more money in her CPF account than the husband (GD at [28]–[29]). We will return to address the Judge’s observations in greater detail below. We also add that since the GD was released after the parties’ respective cases were filed, we directed that they be allowed to tender written submissions in response to the GD by 27 January 2023. The wife elected not to tender any written submissions while the husband filed brief submissions of around one page that echoed the findings of the DJ and the Judge. 5 On 30 March 2022, the wife had applied to the AD for leave to appeal against the decision of the Judge made on 9 March 2022. On 20 July 2022, the AD granted the wife leave to appeal only in respect of the flat. On 22 July 2022, the wife filed her Notice of Appeal. In the wife’s Appellant’s Case, she argued that the flat is not a matrimonial asset because the purchase had not been completed by 31 May 2021 and no loan had been drawn. Neither party had acquired the flat during the marriage as defined in s 112(10)(b) Women’s Charter. We disagree. If the flat was not a matrimonial asset, then the wife should not have sought relief in respect of the flat in the divorce proceedings. In any event, both parties had acquired a right to acquire the flat during the marriage and that is a matrimonial asset even though the purchase had not been completed yet. 6 Before the DJ and the Judge, the wife did not initially offer to pay the husband: (a) whatever he had paid towards the deposit for the flat; (b) his share of stamp fee already paid; and (c) his share of conveyancing fee already paid. 7 However, before the hearing of the present appeal, the wife offered to pay these sums with accrued interest in exchange for the transfer by the husband of his interest in the HDB flat to her. This is a material difference that was not mentioned to the DJ and Judge initially. While the husband has not accepted the wife’s offer, we note that this offer directly addresses the Judge’s concern that the wife’s stance of not agreeing to refund the husband his CPF moneys was unreasonable, especially since she had more money in her CPF account compared to him (GD at [27]–[28]). Insofar as the Judge’s comments were made in the context of the wife making no offer to refund the amounts in [6(a), 6(b) and 6(c)] above, the present situation is markedly different and there is no longer any concern of this nature. 8 Returning to the wife’s offer, she has clarified that the husband paid his share of the deposit, stamp fee and conveyancing fee from his CPF account. For easy reference, we set out below the sums paid by the parties: S/NDescriptionWifeHusband(a)Deposit$11,678.50$11,678.00(b)Stamp fee$4,306.00$4,307.00(c)Conveyancing fee$157.00$156.50Total:$16,141.50$16,141.50 9 Hence, the wife’s offer will mean payment of the sums paid by the husband and accrued interest to the husband’s CPF account. 10 In addition, the wife has obtained a valuation from one Koh Heng Ann of AUG Valuers LLP (“AUG”) dated 28 October 2022 stating that the value of the flat as at 31 May 2021 is $467,130 which is the same as the sale price of the flat to the parties. This was because the flat is subject to a minimum occupation period (“MOP”). The date of 31 May 2021 for the purpose of the valuation was fixed by the AD at a case management conference on 17 October 2022 (“the CMC”) after discussion with the parties as the wife had offered to obtain a desktop valuation report. The AD had used 31 May 2021 being the date of the ancillary order made by the DJ. The AD then allowed each of the parties to obtain such a valuation report which was to be submitted by 31 October 2022. 11 We add that it was the wife who suggested that parties obtain a valuation report at the CMC. Notwithstanding that there might be a question whether the wife was gaining a windfall if the husband transferred his interest in the flat to her, the husband did not make that suggestion. Indeed, when a valuation report was suggested, he did not appear enthusiastic about it and it was unclear whether he would obtain one. 12 The wife met the deadline of 31 October 2022 but the husband did not. Although he submitted a valuation report late, the court allowed this late submission. This was a report dated 18 November 2022 by Savills Valuation and Professional Services (S) Pte Ltd (“Savills”). It valued the flat at $660,000 which was higher than the sale price to the parties. However, there was one important qualification,ie, that the valuer had been instructed to assume that the flat was eligible for resale in the open market and is not subject to any MOP imposed by the HDB. This was not correct as there was an MOP. In the circumstances, the report was made on an incorrect premise. 13 Accordingly, we cannot rely on the Savills valuation report and can rely only on the AUG valuation report obtained by the wife. Since that report states that the value of the flat is the same as the sale price to the parties, there is no basis for the AD to order the wife to pay more than the matters stated in [6(a), 6(b) and 6(c)] above for the transfer of the husband’s interest in the flat to her except to consider payment of some interest to the husband. 14 We pause here to address the point made by the Judge (and also the husband) that the wife would potentially gain a windfall if the flat was transferred to her (GD at [31]). With respect, we are of the view that such a concern is not relevant as the windfall is not based on the relevant date of 31 May 2021 but the future. It takes into account a potential future increase in the price of the flat when it is soldafterthe MOP has elapsed. However, it must be remembered that the flat is not yet an asset that could be sold in the open market as the MOP would still apply on 31 May 2021 – the date that is to be used for the purpose of valuing the flat. There is therefore no windfall to speak of as of 31 May 2021 and it is not open to this court to speculate what the potential price of the flat would be if it is sold in the future. 15 In addition, there is no real prejudice to the husband because he had previously been willing and is still willing for the flat to be returned to the HDB. If this is done, he will receive no more than his share of the money stated in [6(a), 6(b) and 6(c)] above in any event. Indeed, there was no assurance that he would receive the refund of any of these payments. 16 It seemed to us that even if it could be said that the wife was deriving a windfall as the flat was likely to increase in value after the MOP, this windfall was not at the expense of the husband. The husband did not express any interest in buying over the flat and currently lives in another HDB flat. As such, and contrary to the Judge’s observation at paragraph 27 of the GD, the concern that the husband would be left without a roof over his head if the flat is transferred to the wife is not relevant. Indeed, we note that the husband’s proposed course of action was simply to return the flat to the HDB. That would not have yielded him higher returns compared to the wife’s proposal to buy over his interest in exchange for a refund of the amounts stated in [6(a), 6(b) and 6(c)] above. 17 It was for that reason that the AD granted leave to appeal. It did not make sense for the flat to be returned to the HDB just because the wife would, in the DJ’s words, “obtain a large and valuable asset without any further consideration or ‘compensation’ to the [husband]”. In the DJ’s view, this would be unfair. The Judge concurred with the DJ (GD at [31]). However, we do not agree because the overall circumstances should have been considered. Even if the wife gained a windfall, that should not matter if there was no prejudice to the husband. Nevertheless, to be fair to the DJ and the Judge, the wife did not initially offer any payment to the husband at the material time. That said, the DJ and the Judge should have explored with the wife if she was prepared to make any payment to the husband especially since, later in the arguments before the Judge, such an offer was made by the wife (although rather late). It was always open to the DJ and the Judge to make an order that the husband transfer his interest in the flat on terms which would include some payment by the wife to the husband to ensure that, at the minimum, he was not worse off than if the flat were returned to the HDB. 18 We add that the detriment to the wife occasioned by the DJ and Judge’s decision is not just any increase in value between the present sale price and the new sale price she would have to pay if she were to have to return the flat and apply for a new one (assuming that the new sale price is higher). She would also have to go through the entire process of applying for an HDB flat afresh and waiting to be allocated one at a location which may be different from the present one. There was no good reason to make her go through all this. The needs of the children of the marriage is a factor that the court takes into consideration when dividing the parties’ matrimonial assets. The wife has care and control of two children of the marriage and it would be in their interest to have a permanent roof over their heads even though it was fortunate that all three of them could stay with her parents in the meantime. 19 In the circumstances, we allow the wife’s appeal. We make the following orders: (a) The husband is to transfer his interest in the flat to the wife. (b) The wife is to reimburse the husband’s CPF account: (i) the sum he used to pay the deposit,ie, $11,678.00; (ii) his share of the stamp fee,ie, $4,307; and (iii) his share of the conveyancing fee,ie, $156.50. (c) The wife is also to pay accrued interest on the above sums to the husband’s CPF account. (d) The husband is to sign all necessary papers to effect the transfer of his interest to the wife.  If he does not do so within 8 days of written notice from the wife or her solicitors, the Registrar of the Supreme Court may do so on the husband’s behalf. (e) Each party is to bear his/her own costs of the application for leave to appeal and the appeal itself. As mentioned, the wife did not initially offer to make any payment to the husband. In addition, her Appellant’s Case mentioned an invalid argument,ie, that the flat is not a part of the matrimonial assets. In the circumstances, we decline to order the husband to pay such costs. (f) Liberty to apply (although parties may mutually agree to some other arrangement in respect of the flat without seeking a variation of our orders). (g) There will be the usual consequential orders. Woo Bih LiJudge of the Appellate DivisionKannan RameshJudge of the Appellate DivisionDebbie Ong Siew LingJudge of the Appellate Division Patrick Fernandez and Mohamed Arshad Mohamed Tahir (Fernandez LLC) for the appellant; The respondent in person."
    }
}