{
    "case_title": "Public Prosecutor vCheng Chang Tong",
    "ncitation": "[2023] SGHC 119",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 InPublic Prosecutor v Cheng Chang Tong[2022] SGDC 178 (“GD”), Mr Cheng Chang Tong (the “respondent”), was convicted of two charges following his plea of guilt and sentenced by a District Judge (the “DJ”) as follows:1Foot Note 1×Public Prosecutor v Cheng Chang Tong[2022] SGDC 178 (“GD”) at [3]. (a) DAC 910427-2022: a fine of $4,000 and 30-months’ disqualification for a charge of careless driving under s 65(1)(a) of the Road Traffic Act 1961 (2020 Rev Ed) (“RTA”) and punishable under s 65(5)(b) read with s 65(5)(c), s 65(6)(i) and s 67A(1)(a) of the RTA (the “Careless Driving Offence”); and (b) DAC 910426-2022: a fine of $7,000 and three years’ disqualification for drink driving under s 67(1)(b) of the RTA and punishable under s 67(1) read with s 67(2)(a) of the RTA (the “Drink Driving Offence”). 2 An additional charge was taken into consideration in sentencing. This involved the respondent’s failure to take reasonable steps to inform the Victim, Neo Wei Siang, Gerald, of the damage to his vehicle and provide the Victim with his particulars, an offence under s 84(1)(b) read with s 84(7) of the RTA and punishable under s 131(2)(a) of the RTA (the “TIC Charge”). 3 This was the Prosecution’s appeal against the sentence of a fine of $4,000 for the Careless Driving Offence. The Prosecution did not appeal against the sentence for the Drink Driving Offence or the disqualification period for the Careless Driving Offence. 4 Specifically, this appeal raised the question of the appropriate sentencing framework for offences punishable under s 65(5)(b) read with s 65(5)(c) of the RTA and the application of this framework to the present case. 5 At the conclusion of the hearing on 24 February 2023, I allowed the appeal. In brief, my reasons are two-fold. First, the sentencing framework laid down inWuZhi Yong v Public Prosecutor[2022] 4 SLR 587 (“WuZhi Yong”) provides useful guidance for the offence here concerning s 65(5)(b) read with s 65(5)(c) of the RTA. Second, the DJ erred in the application of theWuZhi Yongframework to the present case as the present case fell within Band 2 rather than Band 1. After considering the relevant sentencing factors, I took the view that a custodial sentence of two weeks’ imprisonment was warranted and the sentence of a fine of $4,000 was manifestly inadequate. I set out my reasons below for allowing the appeal.",
        "The charge": "6 The following charge in DAC 910427-2022 in relation to the Careless Driving Offence is the subject of this appeal: You, [respondent] are charged that you, 5 February 2022, at about 10.16 p.m, along Blk 220 Petir Road Open space carpark, Lot 286, Singapore, did drive motorcar, SDG 8466C, on the road without due care and attention to wit, by failing to keep a proper lookout when reversing into a parallel parking lot and collided onto the right side of one motorcar, SLV 9002C which was parked ahead of your vehicle, at parking lot number 286 and you have thereby committed an offence under Section 65(1) (a) of the Road Traffic Act 1961. And further, that you, before the commission of the said offence, have been convicted on the following earlier occasion(s): (i) On 02 September 1998 in Subordinate Court No. 21 for an offence of Speeding (41-50KMPH) under Section 63(4) Road Traffic Act Chapter 276 vide R98079246LD; and (ii) On 25 August 2004 in Subordinate Court No. 21 for an offence of Speeding (41-50KMPH road) under Section 63(4) Road Traffic Act Chapter 276 vide R04028048ND. which conviction have not been set aside, and you shall thereby be liable for punishable under Section 65(5)(c) read with Section 65(5)(b) and Section 65(6)(i) and Section 67A(1)(a) of the Road Traffic Act 1961.",
        "Facts": "7 The respondent admitted without qualification to the material facts of this case as set out in the Statement of Facts. On the night of 5 February 2022, the respondent drank four small glasses of “Chivas” at his shop located at Upper Bukit Timah Road. After the drinking session at his shop, the respondent decided to drive himself and his wife back to their home located at Block 220 Petir Road. 8 At the carpark near their home, the respondent failed to keep a proper lookout as he was reversing into a parallel parking lot. His car collided into the right side of a car belonging to the Victim, which was parked ahead. Both cars were damaged, with scratches and dents on the rear right side of the Victim’s car. The cost of repairs to the Victim’s car was $2,400. The respondent had made full restitution to the Victim. 9 At the time of the accident, the weather was clear, the road surface was dry, and the traffic volume was light. 10 After the collision, the respondent and his wife left for home. About two hours later, on 6 February 2022 at about 12.11am, the Victim discovered the damage to both his car and the respondent’s car and called the police. The police tracked down the respondent at his home. The respondent failed a breathalyser test and was arrested. He was escorted to the Traffic Police Headquarters. At about 3.27am, a Breath Analysing Device test conducted on the respondent revealed that there was 85μg of alcohol in every 100ml of the respondent’s breath. This exceeded the prescribed limit of 35μg of alcohol per 100ml of breath.",
        "The proceedings below": "",
        "Prosecution’s submissions below": "11 At the plead guilty mention, the Prosecution sought a sentence of three weeks’ imprisonment and three years’ disqualification for the Careless Driving Offence on the basis that the case fell within Band 2 of the framework laid down by Sundaresh Menon CJ inWuZhi Yong. The Prosecution submitted that this was warranted as the respondent’s alcohol level was at the high end of Band 3 of the framework inRafael VoltaireAlzate v Public Prosecutor[2022] 3 SLR 993 (“Rafael”) at [31]. The respondent was to be punished as a repeat offender and was also irresponsible in failing to notify the Victim of the damage caused to his car.",
        "Defence’s submissions below": "12 The respondent, who was unrepresented below, pleaded in mitigation that he was advanced in age and had since sold his car and stopped driving.2Foot Note 2×Record of Appeal (“ROA”) at p 30, lines 12–13.He highlighted that he understood that drink-driving is wrong and sought the court’s forgiveness.3Foot Note 3×ROA at p 30, lines 13–14.He also claimed to have “many things to attend to outside”4Foot Note 4×ROA at p 30, line 20.and to have recently been diagnosed with nerve issues in his right hand.5Foot Note 5×ROA at p 30, lines 21–22.",
        "The DJ’s decision": "13 The DJ sentenced the respondent to a fine of $7,000 and three years’ disqualification for the Drink Driving Offence. In relation to the Careless Driving Offence, which lies at the heart of the present appeal, the DJ sentenced the respondent to a fine of $4,000 and 30 months’ disqualification. 14 In determining the sentence for the Careless Driving Offence, the DJ drew guidance from the two-step sentencing approach inWuZhi Yong. 15 At the first step, the DJ considered the offence-specific factors. In this regard, the DJ considered the circumstances in which the offence was committed and the harm caused (GD at [48]–[52]). In particular, she noted the respondent’s status as a repeat offender “by virtue of his 1998 and 2004 speeding convictions and his level of alcohol [which] was at the second highest band ofRafael”. She opined that this would only affect the seriousness of his offence to a limited extent,6Foot Note 6×GD at [51].as the extent of his irresponsible driving within the carpark was swiping the rear right portion of the Victim’s motorcar while trying to parallel park his car. The DJ further noted that the respondent’s previous convictions were relevant but dated. The DJ found that the present case involved a lower level of seriousness falling within Band 1 of theWuZhi Yongframework, with a starting point of a fine of $6,000. 16 At the second step, the DJ calibrated the sentence based on the offender-specific factors. The DJ considered that there was potential harm, albeit not of a significant degree, in view of the time of the offence, the light volume of traffic, the respondent’s manner of driving and his low speed as he parallel-parked his car. Further, the extent of property damage consisted of scratches and dents and thus fell within the higher level of the low harm category. 17 Overall, the DJ found the following factors aggravating.7Foot Note 7×GD at [55]–[64].The respondent’s alcohol level was high. In addition, after consuming alcohol, the respondent drove home from Upper Bukit Timah Road to Petir Road with his wife as a passenger. She also considered the TIC charge as an aggravating factor. The DJ observed that the respondent, having failed to provide his particulars after the accident, would have escaped responsibility for his charges if the Victim had not discovered the damage early. 18 In terms of the mitigating factors, the DJ considered that the respondent’s plea of guilt at the first court mention was a sign of his genuine remorse and, therefore, a mitigating factor. Furthermore, the DJ considered that the respondent had provided restitution to the Victim for the cost of repairs amounting to $2,400 before the first court mention. 19 Considering these factors and the totality principle, the DJ calibrated the sentence downwards to a fine of $4,000. The DJ also imposed a disqualification period of 30 months, which was in line with the range of two to three years’ disqualification for a Band 1 offence delineated inWuZhi Yong.",
        "The grounds of appeal": "20 The Prosecution submitted that the fine of $4,000 for the Careless Driving Offence was manifestly inadequate. It was submitted that theWuZhi Yongframework provides guidance to sentencing the offence here concerning s 65(5)(b) read with s 65(5)(c) of the RTA. This is notwithstanding that theWuZhi Yongframework was promulgated for offences punishable under s 64(2C) RTA.8Foot Note 8×Written Submissions of the Prosecution filed on 14 February 2023 (“WSP”) at paras 22–29.Applying theWuZhi Yongframework, the present case would fall within Band 2 and not Band 1, as the DJ found. A custodial sentence was hence called for.9Foot Note 9×WSP at paras 30–52. 21 In response, the respondent sought to affirm the DJ’s decision.",
        "Issues to be determined": "22 Based on the foregoing, the issue that arose for this court’s determination was whether theWuZhi Yongsentencing framework provides useful guidance for the offence here concerning s 65(5)(b) read with s 65(5)(c) of the RTA. For convenience, I will refer to this as “Issue 1”. If so, did the DJ err in the application of theWuZhi Yongframework to the present case in imposing a fine of $4,000? This will be referred to as “Issue 2’.",
        "The relevant statutory provisions under the RTA": "23 Given the multiple RTA provisions at play, it would be helpful to set out the relevant provisions which are the subject of this appeal. In relation to the Careless Driving Offence on appeal, the respondent was charged with careless driving under s 65(1)(a) of the RTA, which is punishable under s 65(5)(b) read with s 65(5)(c), s 65(6)(i) and s 67A(1)(a) of the RTA. For ease of reference, the applicable provisions are italicised. 24 Section 64(8) of the RTA provides: Reckless or dangerous driving 64.—(8)  In this section and section 65 — “serious offender” means an offender who is convicted of an offence under section 67 or 70(4) in relation to the offender’s driving which is an offence under subsection (1); ... [emphasis added] 25 The relevant provisions of s 65 of the RTA are as follows: Driving without due care or reasonable consideration 65.—(1) If any person drives a motor vehicle on a road — (a) without due care and attention; or (b) without reasonable consideration for other persons using the road, the person (called the offender) shall be guilty of an offence. ... (5) In any other case involving the driving of a motor vehicle by the offender, the offender shall on conviction of an offence under subsection (1) — (a) be liable to a fine not exceeding $1,500 or to imprisonment for a term not exceeding 6 months or to both; (b) where the person is a repeat offender, be liable to a fine not exceeding $3,000 or to imprisonment for a term not exceeding 12 months or to both; (c) where the person is a serious offender in relation to such driving, be liable to a fine of not less than $2,000 and not more than $10,000 or to imprisonment for a term not exceeding 12 months or to both, in addition to any punishment under paragraph (a) or (b); or (d) where the offender is a serious repeat offender in relation to such driving, be punished with a fine of not less than $5,000 and not more than $20,000 and with imprisonment for a term not exceeding 2 years, in addition to any punishment under paragraph (a) or (b). (6) A court convicting a person of an offence under subsection (1) in the following cases is to, unless the court for special reasons thinks fit to not order or to order otherwise, order that the person be disqualified from holding or obtaining a driving licence for a disqualification period of not less than the specified period corresponding to that case: ... (i) for a serious offender in subsection (5)(c) — 2 years; (8)  A person is a repeat offender in relation to an offence punishable under subsections (2)(b), (3)(b), (4)(b) and (5)(b), respectively, if the person in the respective subsection has been convicted (whether before, on or after 1 November 2019) on at least one other earlier occasion of any of the following offences: ... (b)an offence under section 63, 64 or 116; ... [emphases added] 26 Section 67A(1)(a) of the RTA provides: Enhanced penalties for offenders with previous convictions under certain sections 67A.—(1)  Where a person having been convicted of 2 or more specified offences is again convicted of any one of the specified offences (whether or not the same specified offence), the court has the power to impose a punishment in excess of that prescribed for the conviction as follows: (a)where the court is satisfied, by reason of the person’s previous convictions or the person’s antecedents, that it is expedient for the protection of the public or with the view to the prevention of further commission of any such offence that a punishment in excess of that prescribed for such a conviction should be awarded, then the court may punish the offender with punishment not exceeding 3 times the amount of punishment to which he or she would otherwise have been liable for the conviction except that where imprisonment is imposed it shall not exceed 10 years; ... [emphasis added] 27 In the present case, the respondent would be considered both a serious offender under s 65(5)(c) and a repeat offender under s 65(5)(b) of the RTA. Under s 64(8) of the RTA, the respondent was considered a serious offender as he was also convictedvideDAC 910426-2022 for the Drink Driving Offence under s 67(1) of the RTA in relation to his driving. 28 The respondent was considered a repeat offender pursuant to s 65(8)(b) of the RTA as he had two prior convictions for the offence of speeding, which had not been set aside: (a) On 2 September 1998, for an offence of speeding under s 63(4) Road Traffic Act (Cap 276, 1997 Rev Ed)videR98079246LD; and (b) On 25 August 2004, for an offence of speeding under s 63(4) Road Traffic Act (Cap 276, 1997 Rev Ed)videR04028048ND. 29 Given the respondent’s status as a serious offender and repeat offender, the respondent would be liable to the sentence set out in s 65(5)(b) of RTA to a “fine not exceeding $3,000 or to imprisonment for a term not exceeding 12 months or to both”. He wasadditionallyliable under s 65(5)(c) of the RTA to a “fine of not less than $2,000 and not more than $10,000 or to imprisonment for a term not exceeding 12 months or to both”.",
        "Issue 1: Does theWuZhi Yongsentencing framework provide useful guidance foran offence concerning s 65(5)(b) read withs 65(5)(c) of the RTA?": "30 The DJ noted in her GD that there is no existing sentencing framework enunciated by the High Court for an offence punishable under s 65(5)(b) read with s 65(5)(c) of the RTA.10Foot Note 10×GD at [40].Nonetheless, the DJ held that theWuZhi Yong“sentencing band” framework dealing with an offence under s 64(2C) RTA provides useful guidance on the sentencing of offences for two reasons.11Foot Note 11×GD at [40].First, the similarity in the structure of the statutory provisions for both forms of irresponsible driving under ss 64(2C) and 65(5) of the RTA. Second, both ss 64(2C) and 65(5) of the RTA concern offences in the residual category of cases not involving death, grievous hurt or other hurt. 31 The respondent submitted that theWuZhi Yongframework should not be applied to the Careless Driving Offence as the framework there was promulgated specifically for dangerous or reckless driving (which I will refer to as “dangerous driving” for convenience) under s 64(2C)(a) read with s 64(2C)(c) of the RTA.12Foot Note 12×Written Submissions of the Respondent filed on 10 February 2023 (“WSR”) at paras 23–27.The following statement of Menon CJ inWuZhi Yongat [20] was cited in support:13Foot Note 13×WSR at para 27. For reasons that are explained below,my approach to developing a sentencing framework is confined to the punishment prescribed under s 64(2C),which is a residual category of cases not involving death, grievous or other hurt.…. Hence, although I make some observations on sentencing in relation to s 64 generally, it is more particularly the question of sentencing under s 64(2C) and, even more specifically, under s 64(2C)(a) read with s 64(2C)(c) that I am concerned with andmy judgment should be understood in this light. [emphasis added by the respondent] 32 I did not agree with the respondent’s argument that theWuZhi Yongframework cannot be applied to the Careless Driving Offence. I accepted the Prosecution’s submission both in its written submissions and at the hearing that the offence here and inWuZhi Yongare similar in seriousness in terms of the prescribed sentencing range. While the respondent submitted in both its written and oral submissions that there were “significant differences” between the maximum punishment provisions between the offence in the present case and that inWuZhi Yong,14Foot Note 14×WSR at para 31.this argument falls away when one examines the applicable punishment provisions for the present case (involving a serious and repeat offender under s 65(5)(b) read with s 65(5)(c) of the RTA) andWuZhi Yong(involving a serious offender under s 64(2C)(a) read with s 64(2C)(c) of the RTA). The applicable punishment provision in the present case is set out in ss 65(5)(b) and 65(5)(c) of the RTA which provides: 65.—(5) In any other case involving the driving of a motor vehicle by the offender, the offender shall on conviction of an offence under subsection (1) — … (b) where the person is a repeat offender, beliable to a fine not exceeding $3,000 or to imprisonment for a term not exceeding 12 months or toboth; (c) where the person is a serious offender in relation to such driving,be liable to a fine of not less than $2,000 and not more than $10,000 or to imprisonment for a term not exceeding 12 months or to both, in addition to any punishment under paragraph (a) or (b)… [emphasis added] From the above, the maximum sentence would be a fine of $13,000 and an imprisonment term of 24 months. 33 In contrast, the punishment provision inWuZhi Yongunder s 64(2C) of the RTA is as follows: 64.—(2C) In any other case involving the driving of a motor vehicle by the offender, the offender shall on conviction of an offence under subsection (1) — (a)be liable to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or toboth; … (c) where the offender is a serious offender in relation to such driving,be liable to a fine of not less than $2,000 and not more than $10,000 or to imprisonment for a term not exceeding 12 months or to both, in addition to any punishment under paragraph (a) or (b)… [emphasis added] The maximum sentence would be a fine of $15,000 and an imprisonment term of 24 months. 34 As can be seen from the above, the same maximum imprisonment term of 24 months’ imprisonment applies to both punishment provisions. Furthermore, the mandatory minimum disqualification period of two years under s 65(6)(i), which is applicable in the present case, is identical to that under s 64(2D)(i), which was applicable inWuZhi Yong. 35 I would observe here that while the Prosecution was right in stating in its written submissions that the range of the respectiveimprisonment termsis identical,15Foot Note 15×WSP at para 24.the range for thefinesis not identical. This point was acknowledged by the Prosecution in its oral submissions. Apart from this minor difference, I agreed that the punishment provisions between the two offences are largely similar. 36 Furthermore, as the Prosecution pointed out in its oral reply at the hearing, the respondent’s attempt to emphasise the differences in seriousness of the offences between the present case andWuZhi Yongcannot stand. WhileWuZhi Yongdoes technically concern the offence of dangerous driving and the present case concerns the offence of careless driving, as the respondent had sought to emphasise in both its written and oral submissions, it must be borne in mind thatWuZhi Yongconcerned a first-time offender. Here, the respondent was a repeat offender and was thus liable to enhanced punishment. 37 The respondent relied on the speech of then-Second Minister for Home Affairs, Mrs Josephine Teo, in the Second Reading of the Road Traffic (Amendment) Bill for the point that Parliament intended to distinguish between the sentencing regimes for dangerous and careless driving. In particular, it was noted that Parliament considered dangerous driving to be more serious than careless driving (Singapore Parliamentary Debates, Official Report(8 July 2019) vol 94 (Mrs Josephine Teo, Second Minister for Home Affairs)): For better clarity and consistency, we propose to consolidate irresponsible driving offences under the RTA. We will also streamline the offences into two classes. The first category is Reckless or Dangerous Driving, which I will refer to as Dangerous Driving in the rest of the speech. … The definitions of Dangerous Driving and Careless Driving are currently in the RTA. We will maintain the current definitions. Dangerous Driving ismore seriousthan Careless Driving.… [emphasis added by the respondent] 38 On this basis, the respondent submitted that the framework inWuZhi Yong, which deals with the offence of dangerous driving, is inapplicable to the offence of careless driving in the present case. With respect, this argument was without merit. The Prosecution did not go so far as to submit that theWuZhi Yongframework applies directly to the present offence. Indeed, it readily acknowledged the truism that the offences are, by their nature, different; one deals with dangerous driving, and the other, careless driving. What the Prosecution submitted instead was that given the similar levels of seriousness between the offence of dangerous driving inWuZhi Yongand that of careless drivingby a repeat and serious offenderin the present case, the same sentencing approach adopted inWuZhi Yongought to apply here. As stated above, the sentencing range applicable here would be very similar to that which was applicable inWuZhi Yongdespite the difference in the precise nature of the driving offence. Given this similarity, I was of the view that Menon CJ’s observations on the relevant sentencing factors inWuZhi Yongcan apply equally to the present offence. 39 Additionally, as the Prosecution rightly pointed out, both careless driving cases and dangerous driving cases had been cited inWuZhi Yongto illustrate the different levels of seriousness of offending.16Foot Note 16×WSP at para 23.This provides further support for the point that the assessment of the relevant sentencing factors and the appropriate band that a case would fall within should be similar, if not identical, for both careless driving and dangerous driving offences. 40 For completeness, I address the Prosecution’s written submission where it was further argued that the sentencing range inWuZhi Yongrepresents theminimumsentencing range applicable to the Careless Driving Offence in this case once we consider that s 67A(1)(a) of the RTA also applies here.17Foot Note 17×WSP at para 26.This provision applies because the respondent had been convicted twice for the specified offences of speeding in 1998 and 2004. Thus, the respondent is liable for up to three times the amount of punishment for which he would otherwise have been liable under s 67A(1)(a). 41 For the purposes of this appeal, I did not find it necessary to invoke s 67A(1)(a) of the RTA, as it is contingent on the requirement that such a higher sentence be found to be “expedient for the protection of the public or with the view to the prevention of further commission of any such offence”. The Prosecution did not explain why this would be the case here in its written or oral submissions. As the respondent highlighted at the hearing, there is the further requirement (vizin committing the prior offence, he must have driven a motor vehicle on a road at a speed which exceeded the speed limit by 40km/h) to be fulfilled under s 67A(2) as the respondent is a “person who has been convicted of an offence under section 63(4)” given his past speeding convictions. While the Prosecution highlighted in reply that this requirement was in fact met as the Record of Proceedings showed that the appellant had driven at over 40km/h past the speed limit in relation to these past convictions, it nonetheless clarified its position that it was not seeking for any uplift in sentence on the basis of s 67A(1)(a). It had only relied on this provision for the more limited proposition that the existence of these provisions reflects the significance Parliament places on an offender’s previous convictions (and reoffending). Parliament’s concern similarly applies to the punishment provision in the present case under s 65(5)(b), which prescribes enhanced penalties for repeat offenders. In my view, to the extent that the Prosecution relied on s 67A(1)(a) purely for the limited point that the Careless Driving Offence in the present case cannot be less serious than that inWuZhi Yong,18Foot Note 18×WSP at para 27.this was unarguably correct. 42 Accordingly, for the reasons stated above, I was of the view that theWuZhi Yongframework can provide useful guidance in sentencing for the Careless Driving Offence, notwithstanding the fact that the framework was promulgated for offences under s 64(2C) RTA. 43 The sentencing bands, as set out inWuZhi Yongat [39], are as follows: (a)Band 1:A fine of between $2,000 and $15,000 and/or up to one month’s imprisonment and a disqualification period of two to three years. (b)Band 2:Between one month’s and one year’s imprisonment and a disqualification period of three to four years. (c)Band 3:Between one year’s and two years’ imprisonment and a disqualification period of four to five years. 44 In any event, the point remains that theWuZhi Yongframework (particularly the indicative sentencing bands) provides a useful starting point for this court in considering the Careless Driving Offence.",
        "Issue 2: Did the DJ err in the application of the Wu Zhi Yong framework to the present case?": "45 Having accepted that theWuZhi Yong“sentencing bands” approach applies, I turn to consider the next issue, which was whether the DJ had correctly applied the framework at each of its two steps. 46 I pause to make a preliminary observation at the outset. While the DJ had stated (GD at [44]) that she was guided in the sentencing approach as set out inWuZhi Yong, her analysis was not in line with theWuZhi Yongframework. For instance, it was not clear why her assessment of potential harm and damage had featured inboththe first and second steps of her analysis (GD at [48], [49], [55]–[57]). It was also not clear why the DJ took into account the respondent’s status as a serious offender and repeat offender at the first step of her analysis (GD at [46]) rather than at the second step when this would be a quintessentially offender-specific aggravating factor.",
        "Step 1: Identifying the appropriate sentencing band with reference to offence-specific factors": "47 Both parties disagreed on the applicable sentencing band. On the one hand, the Prosecution submitted that the present case fell within Band 2, which warranted an imprisonment term of between one month and one year.19Foot Note 19×WSP at para 37.On the other hand, the respondent submitted that the DJ was right to find that this case fell within Band 1 and that the custodial threshold was not crossed.20Foot Note 20×WSR at paras 66–67. 48 In determining the correct band in the present case, I found it instructive to consider the non-exhaustive list of offence-specific factors laid out by Menon CJ inWuZhi Yongat [36]: (a) Serious potential harm:Apart from actual harm, it has long been accepted that regard should also be had to the potential harm that can result from the act of dangerous or reckless driving (seeStansilas([26] supra) at [47];Public Prosecutor v Koh ThiamHuat[2017] 4 SLR 1099 (“Koh ThiamHuat”) at [41]). The level of potential harm would be (NeoChuan Sheng v Public Prosecutor[2020] 5 SLR 410 at [22]): … assessed against facts which would include … the condition of the road, the volume of traffic or number of pedestrians actually on or which might reasonably be expected to be on the road at the relevant time, the speed and manner of driving, visibility at the relevant time, the type of vehicle, and any particular vulnerabilities (eg, a truck or car colliding into a motorcycle or pedestrian). As is evident, these relate to the circumstances of driving that could increase the danger posed to road users (seeEdwinSuse([25]supra) at [28]). Where an assessment of these facts reveal that the potential harm occasioned to road users would have been serious, this would be an aggravating factor. (b) Serious property damage:The extent of property damage caused is a relevant sentencing factor. As a general rule, the amount of any loss or damage may serve as a proxy indicator of harm. (c) High alcohol level found in the accused person’s blood or breath:A high level of alcohol that substantially exceeds the prescribed limit would be an aggravating factor. As noted by the court inStansilasat [37], an offender’s alcohol level is an indicator of his inability or unfitness to drive due to his alcohol intake, and heavier punishment should therefore be imposed on drivers with higher alcohol levels. This determination of whether an offender’s alcohol level is high can be made with reference to the sentencing framework for an offence under s 67, recently set out inRafael VoltaireAlzate v Public Prosecutor[2022] 3 SLR 993 (“Rafael VoltaireAlzate”) at [31], which is calibrated in accordance with the alcohol levels found in an offender’s blood or breath. In the context of sentencing under s 64(2C)(c), this will be a factor of particular importance: see [33]–[34] above and [37] below. (d) An offender’s reason or motivation for driving:The court inEdwinSuseheld that an offender’s reason or motivation for driving could be an aggravating (or conceivably, in some circumstances, even a mitigating) factor in respect of an offence of drink driving. The court further considered that the gravity of an offender’s conduct would be increased if he had, at that time, been driving a passenger for hire or reward (at [33]). (e) Increased culpability:InKoh ThiamHuatat [41], the court considered that factorsincreasingan accused person’s culpability for an offence of dangerous driving would include aparticularly dangerous mannerof driving. Examples of such aggravating factors include excessive speeding or deliberate dangerous driving, such as in “hell riding” cases (seeKoh ThiamHuatat [41]). The offender’s conduct following the offence or attempt to evade arrest: Conduct that is “belligerent or violent” upon arrest would constitute an aggravating factor:EdwinSuseat [32]. Likewise, the failure to stop in an attempt to evade arrest or to avoid apprehension should also weigh against an offender:Public Prosecutor v Lee Meng Soon[2007] 4 SLR(R) 240 at [33]. [emphasis in original] 49 In applying these factors, Menon CJ emphasised inWuZhi Yongat [37] that the level of alcohol found in an offender’s blood or breath will be a critical factor in determining the appropriate sentencing band: It bears reiterating that the fact of drink driving has been legislatively highlighted as a significant factor in sentencing (as explained at [33]–[34] above).This is reflected in the extent of the increase in the potential sentence that an offender may face due to the application of the serious offender provision under s 64(2C)(c) of the RTA. As such, the level of alcohol found in an offender’s blood or breath would be a key factor in determining the sentencing band in which a case is situated. [emphasis added] 50 I agreed with the Prosecution’s submission that the high level of alcohol found in the respondent’s breath is critical in determining the sentencing band for the offence here. There has been a similar “increase in the potential sentence that an offender may face due to the application of the serious offender provision” which Menon CJ pointed out inWuZhi Yongat [37], this provision being s 65(5)(c) of the RTA. This is supported by Menon CJ’s finding (WuZhi Yongat [32]) that “Parliament’s intention in introducing theserious offenderprovisions (includings 64(2C)(c)) was to punish offenders for the aggravated conduct of driving recklessly or dangerouslywhilst under the influence of drink” [emphasis added]. There is no reason why this proposition does not also apply to the Careless Driving Offence here which also engages the serious offender provision under s 65(5)(c) of the RTA for the aggravated conduct of driving carelesslywhilst under the influence of drinkin the present case. Indeed, this was implicit in Menon CJ’s use of the word “including” and, in any event, nothing in Menon CJ’s decision inWuZhi Yongprecludes this finding. 51 Based on the foregoing, the present case would fall within Band 2 of theWuZhi Yongframework once it is considered that the respondent had a high alcohol level of 85µg of alcohol per 100ml of breath. As the DJ found, this alcohol level fell within the higher end of Band 3, which is the second-highest band of theRafaelframework. Given the legislative emphasis on the factor of drink driving, where an offender’s blood or breath alcohol level is in the highest or second-highest band of the framework inRafael, the present case was likely to fall at least within Band 2:WuZhi Yongat [42]. 52 In attempting to downplay the centrality of the offender’s high alcohol level, the respondent pointed to the following statement of Menon CJ inWuZhi Yongat [42]:21Foot Note 21×WSR at para 55. Band 2 consists of cases reflecting a higher level of seriousness and would usually containtwo or moreoffence-specific aggravating factors. In these cases,the level of culpability and the blood alcohol level will typically both be on the higher side. [emphasis in original] 53 With respect, this ignores Menon CJ’s elaboration following immediately after the above statements in the same paragraph, which reads as follows: Given the legislative emphasis on the factor of drink driving, where an offender’s blood alcohol level is in the highest or second highest band of the framework in Rafael Voltaire Alzate, the case is likely to fall at least within Band 2.Examples of cases that might fall in Band 2 are as follows: ... [emphasis added] 54 Apart from the respondent’s high alcohol level, there were clearly two other aggravating factors in the present case which brought the total number of aggravating factors up to at least three. 55 First, there was serious potential harm. In this regard, the DJ considered that the potential harm would not have been serious. She took account of the fact that, at the time of the offence, the accused was not travelling on an expressway or highway where the vehicular speed would be higher or on a road where the presence of other road users was significant.22Foot Note 22×GD at [52].She further considered that at the material time at night, the traffic within the vicinity of the carpark was light.23Foot Note 23×GD at [48].While the DJ further considered the respondent’s manner of driving, low speed as he parallel parked, the absence of other vehicles travelling in the vicinity, and the presence of only two other persons walking some distance away, I noted that this consideration was done at the second step in her application of theWuZhi Yongframework as part of the offender-specific factors.24Foot Note 24×GD at [55].These ought to have been considered at the first step as offence-specific factors instead. 56 Notwithstanding the consideration of all the factors above as offender-specific factors, there could have been serious potential harm nonetheless arising from the respondent driving whilst under the influence of alcohol. The respondent drove a distance of at least 1.6km (from Upper Bukit Timah Road to Petir Road), by the Prosecution’s estimate.25Foot Note 25×WSP at para 35.This journey was made through a residential area near other vehicles and pedestrians.26Foot Note 26×WSP at para 35; Other vehicles and pedestrians can be seen in the in-car camera footage, which was viewed in the court below: ROA at p 28, lines 21 and 28.It was fortuitous that no harm to any persons was caused during this journey. I note also that the respondent’s wife was in the car, placing her in a position where potential harm to her could have been caused. These were not adequately considered by the DJ. 57 Second, there was actual property damage or harm caused. The risk of harm to property had materialised, resulting in property damage to the Victim to the tune of $2,400. I was cognisant that theWuZhi Yongframework lays out the consideration ofpotentialharm andactualharm as distinct considerations. In this regard, I raised a concern to the Prosecution at the hearing that it appeared that there may be some overlap between the two considerations in the present case.As the Prosecution rightly submitted, any such overlap would be restricted. This is because on one hand, consideration of actual harm focuses on the moment of a collision. On the other hand, potential harm looks at the wider circumstances before and after a collision. Regarding the potential harm, this would entail consideration of the circumstances arising in the duration leading up to the accident, as the respondent had driven for some distance from Upper Bukit Timah to Petir Road before the accident occurred. Pertinent considerations on the potential harm included the fact that he was carrying a passenger, and that he was driving in a residential zone (with pedestrians and vehicles nearby) near the end of his journey before the accident occurred. 58 Accordingly, the present case would fall within Band 2 of theWuZhi Yongframework. I found that a starting point of one month’s imprisonment would be appropriate.",
        "Step 2: The applicable offender-specific factors": "59 The primary offender-specific aggravating factor in the present case was the respondent’s twin status as a repeat offender and a serious offender. With respect, the DJ erred in glossing over this, and in finding that “[a]lthough the accused is considered arepeat offenderby virtue of his 1998 and 2004 speeding convictions and his level of alcohol was at the second highest band ofRafael... these factors affect the seriousness of his offenceto a limited extent” [emphasis added]. First, this undoubtedly could not be right once we appreciate the centrality of the respondent’s high alcohol level in theWuZhi Yongframework as highlighted above. Second, the DJ’s consideration of the respondent’s status as a “repeat offender” (GD at [59]) was somewhat cursory and inadequate. An additional and more crucial consideration was that of the respondent being a “serious offender” as it was this aggravated conduct of driving carelesslywhilstunder the influence of drinkthat Parliament intended to address specifically with more severe punishments (see above at [50]). 60 Putting aside the respondent’s speeding convictions in 1998 and 2004 which relate to his status under s 65(5)(b) as a “repeat offender”, the DJ did not appear to have considered the full gamut of the relevant antecedents. The respondent was traced with several compounded offences for speeding (in 1990, 1995, 1998 and 2007), inconsiderate driving (in 2012), and crossing double white lines (in 2020). As the respondent rightly accepted at the hearing, these can be considered in sentencing. However, the respondent submitted that compounded offences should be given less weight. Be that as it may, the DJ appeared to have not consideredanyof the compounded offences in calibrating the sentence. Even accepting that dated offences can be given less weight,27Foot Note 27×GD at [51].the latter two offences of inconsiderate driving and crossing double white lines are of recent origin. I was of the view that the respondent’s compounded offences ought to have been considered and given due weight. These offences reveal the respondent’s history of recalcitrance and propensity to flout traffic rules and reinforce the need for a deterrent sentence, both on the basis of individual and general deterrence. 61 In relation to the respondent’s attempt to downplay the aggravating factor under the TIC Charge of failing to take reasonable steps to inform the Victim of the damage and provide the Victim with his particulars,28Foot Note 28×WSR at paras 19–21.this must be rejected. The respondent cannot now explain away the purportedreasonablenessof his conduct (eg, that he allegedly “waited a while” for the Victim, he was “not able to write any note as being illiterate he simply did not know how or what to write” and he “left his car in the lot just behind the victim’s car in a manner which left no doubt that it was [his] car which caused the damage”). He had already consented to the TIC charge of failing to takereasonablesteps to inform the Victim of the damage and provide his particulars. In any event, none of these facts are indicated in the Statement of Facts and as such are unproven. 62 The respondent’s plea of guilt and voluntary restitution were valid mitigating factors, but they did not bring the present case below the custodial threshold. As the Prosecution highlighted, in bothPublic Prosecutor v Shin Seung Ho[2023] SLR(StC) 78andPublic Prosecutor v Ashwin Kumar KumaraswamySanketh[2023] SLR(StC) 104, the offenders pleaded guilty and made full restitution. Nonetheless, custodial sentences were meted out as these mitigating factors merited only a downward adjustment from the starting point of a higher custodial sentence. 63 The respondent raised a further objection based on the rule against double counting.29Foot Note 29×WSR at para 72.The respondent submitted that the imposition of a custodial sentence on the Careless Driving Offence and the imposition of a fine under the Drink Driving Charge would be akin to giving him aconsecutive(as opposed to concurrent) sentence on the two charges and punishing him twice on the same set of acts. I did not find this convincing. The respondent had after all accepted that a court is not prevented “from imposing a condign sentence for the offence under s 64 and, separately, a fine for the offence under s 67, where that is considered appropriate.” (WuZhi Yongat [65]). The application of the totality principle addresses the respondent’s objection. As Menon CJ explained inWuZhi Yongat [65], “the totality principle, which allows for the adjustment of individual fines so that the cumulative fine is sufficient and proportionate to the offender’s overall criminality” is such that it “enable[s] the court to deal with any concern of unfairness arising from double or excessive punishment.” The totality principle, being of general application, is not, as the respondent alleged, merely confined to “the context of s 64, where an offender had driven recklessly or dangerously whilst under the influence of drink.”30Foot Note 30×WSR at para 73. 64 I found that a custodial sentence was warranted and a sentence of one month’s imprisonment, being the minimum within Band 2, would be an appropriate starting point. Bearing in mind the respondent’s expeditious plea of guilt at the very first court mention, co-operation in the investigations and his voluntary restitution, the indicative starting point sentence should be adjusted downwards to two weeks’ imprisonment.",
        "Conclusion": "65 For the reasons above, the DJ’s sentence of $4,000 for the Careless Driving Offence was manifestly inadequate. Accordingly, I allowed the appeal and sentenced the respondent to two weeks’ imprisonment, in addition to the disqualification term of 30 months.   See Kee Oon Judge of the High Court    Lim Siew Mei Regina (Attorney-General’s Chambers) for the appellant; Ng Yong Ern Raymond (M/s Tan Lay Keng & Co) for the respondent.",
        "": ""
    }
}