{
    "case_title": "Chang Chee Kheo  vFatfish Investment Partners Pte Ltd and others",
    "ncitation": "[2023] SGHCR 12",
    "coram": "AR Perry Peh",
    "sections": {
        "Introduction": "1 HC/SUM 1517/2023 (“SUM 1517”) and HC/SUM 1518/2023 (“SUM 1518”) are applications by the defendants in HC/OC 163/2023 (“OC 163”) to stay OC 163 on the ground offorum nonconveniens. The defendants contend that Malaysia is the more appropriate forum for the dispute in OC 163 to be tried. The applications raise, among other things, two questions for consideration. First, in ascertaining whether personal connections exist between the dispute and a competing forum, is the court limited to the facts contained in the affidavits filed for the stay application? Secondly, can an arbitration agreement give rise to a connecting factorvis-à-visthe jurisdiction identified as the seat of the arbitration for the purposes of a court proceeding that is the subject of a stay application onforum nonconveniensgrounds, where that court proceeding pertains to a dispute coming within the scope of the arbitration agreement and where it had been commenced in circumstances which did not constitute a repudiatory breach of the arbitration agreement?",
        "Background": "2 The claimant, Chang Chee Kheo (“Chang”), is a Malaysian citizen residing in Johor Bahru. The first defendant, Fatfish Investment Partners Pte Ltd (“FIPL”), is a Singapore-incorporated company. FIPL is a subsidiary of the second defendant, Fatfish Group Limited (“FGL”), which is a listed company registered in Melbourne, Australia. The third defendant, Fatfish Capital Limited (“FCL”), is a company incorporated in the British Virgin Islands and is also a subsidiary of FGL. Where appropriate, I refer to FIPL, FGL and FCL collectively as “theDefendants”. 3 OC 163 is Chang’s claim to recover monies loaned to FIPL pursuant to three sets of “Promissory Loan Note[s]”, each of which I will refer to as a “PN”. The PNs were entered into on three separate occasions, and they were each for a term of 12 months. Upon the maturity of each PN, Chang was entitled to a return of the principal with interest. The PNs were extended upon maturity – in the case of the first two of the three PNs (which I refer to respectively as “PN1” and “PN2”), they were extended twice, while the remaining PN (which I refer to as “PN3”) was extended once. The details of these PNs, and their extended versions, are as follows: (a) PN11Foot Note 1×Affidavit of Chang Chee Kheo (“Chang’s Affidavit”) at p 32.was entered into on 13 January 2017, the principal under which was RM 1m. PN1 expired on 12 January 2018, and it was extended on 13 January 2018 for a further 12 months at a slightly lower interest rate (“PN1A”).2Foot Note 2×Chang’s Affidavit at p 37.PN1A was later extended for a further 12 months from 13 January 2019, also at a slightly lower interest rate (“PN1B”).3Foot Note 3×Chang’s Affidavit at pp 43 and 48.The outstanding amount under PN1B is RM 1.494m, which comprises a principal of RM 1.38m and interest of RM 110,400.4Foot Note 4×Statement of Claim (“SOC”) at para 11. (b) PN25Foot Note 5×Chang’s Affidavit at p 51.was entered into on 24 February 2017, the principal under which was RM 500,000. Like PN2, it was also extended for two further terms of twelve months each, with each extension providing for a slightly lower interest rate.6Foot Note 6×Chang’s Affidavit at pp 65 and 71.I refer to each of these extended versions as “PN2A”7Foot Note 7×Chang’s Affidavit at p 56.and “PN2B” respectively. The outstanding amount under PN2B is RM 745,200, which comprises a principal of RM 690,000 and interest of RM 55,200.8Foot Note 8×SOC at para 18. (c) PN39Foot Note 9×Chang’s Affidavit at p 70.was entered into on 12 December 2017, the principal under which was RM 1.5m. PN3 was however only extended once with effect from 11 December 2018 (“PN3A”).10Foot Note 10×Chang’s Affidavit at pp 74 and 79.The outstanding amount under PN3A is RM 1.814m, which comprises a principal of RM 1.68m and interest of RM 134,400.11Foot Note 11×SOC at para 24. 4 It appears undisputed that, although the PNs provided for Chang to invest in FIPL (a Singapore-incorporated entity),  the funds for each of the PNs were remitted by Chang in Malaysian Ringgit from his bank account in Malaysia to another Malaysian company known as Fatfish Ventures Sdn Bhd (“FV”).12Foot Note 12×Affidavit of Lau Kin Wai (“Lau’s Affidavit”) at para 26(5).The Defendants do not appear to dispute that FV, while a separate entity from each of the Defendants, belongs to the same group of companies as the Defendants. 5 Each of the PNs are governed by terms in writing (“the Terms”). The extended versions of each PN also adopt the Terms with no material distinctions, save that in respect of PN1B, PN2B and PN3A, they areadditionallygoverned by a “Term Sheet”.13Foot Note 13×Chang’s Affidavit at pp 48, 61 and 79.For present purposes, it suffices to note the following: (a) In respect of PN1, PN1A, PN2, PN2A and PN3,FGLprovided a guarantee to Chang in respect of FIPL’s repayment obligations.14Foot Note 14×Chang’s Affidavit at paras 11(b), 15(b), 24(b), 28(b) and 37(b).In respect of PN1B, PN2B and PN3A,FCLprovided a guarantee to Chang in respect of FIPL’s repayment obligations.15Foot Note 15×Chang’s Affidavit at paras 19(b), 32(b) and 41(b). (b) The Term Sheet, which additionally applies in respect of PN1B, PN2B and PN3A, provides that “the terms set forth in [the Term Sheet] will supersede any previous arrangement arised [sic] from [the PN]”. (c) The Terms provide that the PN as well as “all acts and transactions pursuant hereto and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the laws of Singapore”. The Term Sheet states in simpler and shorter terms that it is “governed by the laws of Singapore”. (d) The Terms provide that “[a]ny disputes arising out of or in connection with [the PN], including any question regarding its existence, validity or termination, shall be referred to and finally resolved by arbitration in Singapore in accordance with the Arbitration Rules of the Singapore International Arbitration Centre …” (“the Arbitration Clause”). 6 In Chang’s SOC, the amounts which he plead as remaining outstanding from FIPL under the PNs and their extended versions is the amount outstanding under the latest extended version of each PN, in other words, PN1B, PN2B and PN3A.16Foot Note 16×SOC at para 27.Although it was FCL which had provided the guarantee in respect of PN1B, PN2B and PN3A (see [5(a)] above), Chang’s position is thatbothFGL and FCL are liable to Chang for these amounts as corporate guarantors.17Foot Note 17×SOC at para 28.It appears that Chang adopts this position because he views each PN and their extended versions as a composite contract.18Foot Note 18×Chang’s Affidavit at paras 21, 34 and 43; SOC at para 27. 7 It is not in dispute that Chang had been introduced to invest in FIPL by his broker, one Raymond Tay (“Tay”), who worked with another colleague, Michelle Chai (“Chai”), at the material time.19Foot Note 19×Chang’s Affidavit at paras 102–103; Lau’s Affidavit at paras 24(2)–24(3); Affidavit of Eugene Khoo Sheng Chuan (“Khoo’s Affidavit”) at paras 23(3)–23(4).Chang also states that Tay and Chai had brokered other persons like him to invest in FIPL.20Foot Note 20×Chang’s Affidavit at paras 102–103.According to Chang, after the expiry of the maturity period of the final extended versions of each PN, he had, whether himself or through Tay, sought repayment of the sums due from FIPL. Under the terms of each of the PNs, the principal and interest was payable and due upon maturity, and FIPL was obliged to make repayment within seven days upon request.21Foot Note 21×Chang’s Affidavit at para 47.Chang says that, despite the promise by FIPL’s director, Lau Kin Wai that payment would be forthcoming, he never received any repayment, and he has since discovered that FIPL is also indebted to many others who like himself had entered into the similar transactions like the PNs.22Foot Note 22×Chang’s Affidavit at paras 49–50. 8 With no repayment forthcoming, on 21 June 2022, Chang instructed his solicitors to send a letter of demand to the Defendants for the claim amount.23Foot Note 23×Chang’s Affidavit at para 52.However, Chang received no reply from the Defendants to his demand letter. He then, pursuant to the Arbitration Clause, commenced arbitration proceedings against the Defendants in the Singapore International Arbitration Centre (“SIAC”).24Foot Note 24×Chang’s Affidavit at para 59.Chang says that his solicitors subsequently served the Notices of Arbitration on the Defendants at their respective business addresses.25Foot Note 25×Chang’s Affidavit at paras 62-64.Notwithstanding that, the Defendants remained unresponsive and failed to file any Response to the Notice of Arbitration within 14 days as required under the SIAC Rules.26Foot Note 26×Chang’s Affidavit at para 67.Given the Defendants’ apparent refusal to participate in the arbitration, Chang was reluctant to prosecute the arbitration further.27Foot Note 27×Chang’s Affidavit at para 68.Chang therefore did not pay the deposit required under the SIAC Rules, with the result that the arbitration was deemed withdrawn without prejudice to him reintroducing the same claim or counterclaims in another proceeding.28Foot Note 28×Chang’s Affidavit at para 70. 9 On 14 March 2023, Chang instructed his solicitors to commence OC 163.29Foot Note 29×Chang’s Affidavit at para 72.Although FGL and FCL were entities located out of jurisdiction, service in respect of those entities appeared to be uneventful, and on 4 April 2023, the Defendants’ solicitors filed the Defendants’ Notice to Contest.30Foot Note 30×Chang’s Affidavit at para 77.On 19 April 2023, the Defendants filed a defence challenging the jurisdiction of the Singapore courts in respect of OC 163 pursuant to O 6 r 7(4) of the Rules of Court 2021 (“the ROC 2021”). Shortly after, FIPL and FCL filed SUM 1518, and FGL filed SUM 1517. In this judgment, I refer to both summonses as “the Stay Applications”.",
        "The Stay Applications": "10 The Defendants’ position in the Stay Applications is that Malaysia is the more appropriate forum for the determination of the claims in OC 163, for two main reasons. First, the transactions underlying the PNs had nothing to do with Singapore, and everything to do with Malaysia – the deal was struck in Malaysia, Chang transferred the monies in Malaysian Ringgit from his bank account in Malaysia to FV, a Malaysian-incorporated company, and the relevant contractual documents were all prepared and signed in Malaysia. Secondly, there are materialfactual disputes in OC 163 in connection with which the evidence of Tay and Chai, both of whom are located within and compellable only in Malaysia, will be critical. These factual disputes includewhythe transactions in each of the PNs have been structured in the way they had, which in turn bears on the contractual intention of the parties to the PNs and whether the Defendants ought to be liable for the transactions in the manner claimed by Chang in OC 163. The connections of Tay and Chai, which are a weighty factor, point to Malaysia as the more appropriate forum. 11 On the other hand, Chang’s position is that Singapore is the forum with which the dispute in OC 163 has closest connection, because of two weighty connections that render Singapore the more appropriate forum: the Arbitration Clause, which shows that the parties had agreed to Singapore as the more appropriate forum; and the governing law clause, which provides that Singapore law is to be applied to disputes arising from or in connection with the PNs. 12 Chang also has two points in response to the Defendants’ submissions. First, he disagrees that the location of Tay and Chai is a material consideration.  He argues that the two affidavits filed in the Stay Applications by the defendants do not raise any material disputes of fact on which the evidence of Tay and Chai will be required or will be essential. Instead, based on what the Defendants have identified as their likely defences in the affidavits, the key issues in OC 163 are legal in nature, and in any case, even if these issues raise questions of fact, the evidence of Tay and Chai would not be material. Chang also argues that there is also no evidence that Tay and Chai are unwilling to testify at a trial of OC 163 in Singapore, and to the contrary, it is likely that they would be willing to testify in Singapore against the Defendants. Secondly, the fact that the transactions took place in Malaysia is not in and of itself a significant consideration, unless the Defendants can show that having Chang’s claims tried in Malaysia will occasion the least expense and inconvenience. In any case, the locations of the transactions are immaterial to the key issues in dispute.",
        "The applicable principles": "13 The principles inSpiliadaMaritime Corporation v Cansulex Ltd[1987] AC 460, which were approved by the Court of Appeal inRickshaw Investments Ltd and another v Nicolai Baron vonUexkull[2007] 1 SLR(R) 377 (“Rickshaw”) (at [12]), govern an application for a stay of proceedings on grounds offorum nonconveniens. There are two stages in theSpiliadaanalysis. At the first stage, the court will determine, by reference to connecting factors that link the dispute with the competing jurisdiction(s), whether there is some other available forum which is more appropriate for the case to be tried. These connecting factors include: (a) the personal connections of the parties and the witnesses; (b) the connections to relevant events and transactions; (c) the applicable law to the dispute; (d) the existence of proceedings elsewhere orlisalibi pendens; and (e) the shape of the litigation (seeRappo, Tania v Accent Delight International Ltd and another and another appeal[2017] 2 SLR 265 (“Rappo”) at [71]). 14 If the court concludes at the end of the first stage that there is a “more appropriate” forum, a stay will ordinarily be granted, unless the court finds, at the second stage of theSpiliadaanalysis that there are circumstances by reason of which justice requires that a stay be refused, such as if the claimant establishes with cogent evidence that it will be denied substantial justice if the case is not heard in the forum (seeRappoat [68]). 15 At the first stage of theSpilliadaanalysis, the legal burden is on the applicant for a stay to show that there is another available forum which is clearly or distinctly more appropriate than Singapore (JIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 (“JIO Minerals”) at [53]). To this end, what the stay applicant must show is that there are connecting factors pointingawayfrom Singapore andtowardsa foreign jurisdiction as the more appropriate forum (Siemens AG vHoldrich Investment Ltd[2010] 3 SLR 1007 (“Siemens AG”) at [7]). It is not enough for the stay applicant to just show that Singapore is notforumconveniens(seeCIMB BankBhd v Dresdner Kleinwort Ltd[2008] 4 SLR(R) 543 (“CIMB BankBhd”) at [26]). Hence, even if there might be few, or even no, substantive connecting factors pointing to Singapore, that does not necessarily mean an applicant would have discharged the burden that is placed upon it under the first stage of theSpiliadaanalysis (seeJIO Mineralsat [53]).",
        "The issues": "16 At the first stage of theSpiliadaanalysis, the search is for those connections that have the most relevant and substantial association with the dispute (seeRappoat [70]). Thus, greater weight may be ascribed to those connections that are material to the fair determination of the dispute, and those which have little or no bearing on the adjudication of the issues in dispute will generally carry little weight (seeRappoat [71];JIO Mineralsat [41]). Accordingly, I will focus on those connecting factors which are in contention given the parties’ submissions, namely, the personal connections of the parties and the witnesses, the connections to relevant events and transactions, and the applicable law to the dispute. I do not propose to elaborate on the remaining factors, namely,lisalibi pendensand the shape of the litigation which, based on the parties’ submissions, do not appear to be in issue, save for the following brief observations that I make for completeness: (a) In this case, there is nolisalibi pendens, or the existence of an action or suit pending in another jurisdiction between the same parties and involving the same or similar issues (seeVirsagiManagement (S) Pte Ltd v Welltech Construction Pte Ltd and another appeal[2013] 4 SLR 1097 at [26]). This is because OC 163 is undisputedly theonlyaction that so far has been commenced in connection with the disputes involving the PNs. (b) As for the shape of the litigation, which is a question of how the claim and defence have been pleaded and whether that points to Singapore or elsewhere as a more appropriate forum (seeTrisuyoGaruda Nusa Pte Ltd v SKP Pradiksi (North) Sdn Bhd and another and another appeal[2017] 2 SLR 814 at [39]), it is generally of more significance in complex litigation involving multiple issues and multiple parties, and the court has regard to this factor with the aim of avoiding the fragmentation of the litigation and ensuring that the dispute is adjudicated in the jurisdiction in which it may be more appropriately determined (seeHalsbury’s Laws of Singaporevol 6(2) (LexisNexis, 2016 Resissue) (“Halsbury’s”) at para 75.095). I do not find this factor engaged in this case, as Chang’s claim in OC 163 is unlikely to give rise to complex litigation since it involves a single cause of action premised upon the PNs, where FIPL is sued in its capacity as a borrower, while FCL and FGL are sued in their capacities as guarantors. 17 Accordingly, the Stay Applications raise the following issues for determination: (a) First, whether the connecting factors identified by the Defendants – namely, the personal connections of the parties and the witnesses, and the location of the events and transactions – point to Malaysia as the more appropriate forum? (b) Secondly, whether the connecting factors identified by Chang – namely, the governing law clause in the PNs and the Arbitration Clause – point to Singapore as the more appropriate forum? (c) Finally, in the light of my views on each of the connecting factors discussed under the first and second issues, whether the Defendants have discharged their legal burden under the first stage of theSpiliadaanalysis in demonstrating that Malaysia is the more appropriate forum, and if so, whether there are any reasons by which a stay ought to be refused? 18 In terms of analysis, if the first issue is determinedagainstthe Defendants, then it follows that the Defendants would have failed to discharge their legal burden under the first stage of theSpilliadaanalysis, and the Stay Applications would necessarily have to be dismissed, irrespective of whether the connecting factors identified by Chang have the effect of pointing towards Singapore as the more appropriate forum. It is only if the connecting factors identified by the Defendants point to Malaysia as the more appropriate forum will I have to consider the strength of the connections pointing to Singapore, in determining the normative weight to be given to each connecting factor in the circumstances of the case and the jurisdiction which these connections identify as the more appropriate forum.",
        "Whether the connecting factors identified by the Defendants point to Malaysia as the more appropriate forum?": "19 I start by considering the personal connections of the parties and the witnesses, before turning to the connections arising from the location of the events and transactions relating to OC 163 as identified by the Defendants.",
        "Personal connections of the parties": "20 The Defendants submit that the personal connections of the parties point towards Malaysia as the more appropriate forum. Although FIPL is a Singapore-incorporated company, FIPL’s place of business is in fact in Malaysia, and not Singapore.31Foot Note 31×Lau’s Affidavit at para 29; Defendants’ Written Submissions at para 31.On the other hand, Chang argues that this is not a factor which assists the Defendants because none of the Defendants are in fact Malaysian entities, and in fact, FGL – despite being an Australian company – has headquarters in Singapore (a point that is not in dispute).32Foot Note 32×Khoo’s Affidavit at para 6.Thus, in so far as the residency of the Defendants are concerned, Singapore is in fact the forum with most connections to the parties.33Foot Note 33×Claimant’s Written Submissions at para 26. 21 In my view, the personal connections of the parties donotpoint towards Malaysia as the more appropriate forum. First and foremost, in the circumstances of this case, I do not think it was sufficient for the Defendants, in support of their contention that FIPL has connections to Malaysia, to barely assert that FIPL has business operations in Malaysia without any further substantiation. This is because FIPL is a Singapore-incorporated company, and its operations and affairs are also subject to the Companies Act 1967 (2020 Rev Ed) and its relevant subsidiary legislation. The natural inference arising from FIPL’s status as a Singapore-incorporated company is that it has a place of business in Singapore. For the Defendants to satisfy the court that FIPL’s place of business is in Malaysia andnotSingapore, despite it being a Singapore-incorporated company, surely the Defendants must do more by way of adducing of evidence as to what those business operations in Malaysia entailed and precisely where in Malaysia they were located, other than a bare assertion to that effect. Accordingly, I am not persuaded, on the basis of the material in the Defendants’ affidavits, that FIPL’s place of business is in Malaysia and not Singapore. The Defendants’ case on this connecting factor therefore fails on the facts. 22 Secondly, even if I were to accept that FIPL has business operations in Malaysia, this still does not point to Malaysia as a more appropriate forum. Bearing in mind that FGL and FCL are respectively Australian and BVI entities, it remains the case that the personal connections of the parties are dispersed across various jurisdictions, namely Malaysia, Australia and the BVI,other than Singapore. This means that the personal connections of the parties are incapable of pointing to any particular jurisdiction as a more appropriate forum than Singapore. 23 In any case, I do not find the personal connections of the parties to be a factor of significant weight in this case. Parties in modern commercial litigation are often well connected, with relational and business ties to many different jurisdictions (seeRappo([13] above)at [70]). The mere fact that an entity is resident or has business operations in a particular jurisdiction, does not in and of itselfrender that jurisdiction a more appropriate forum, unless the stay applicant can show that any connections thereby arising aresubstantial in the light of the likely issues in the dispute. In this case, other than merely asserting that FIPL’s place of business is in Malaysia, the Defendants have not demonstrated to me the significance of that connection, for example, that FIPL’s alleged place of business in Malaysia had something to do with the transactions under the PNs and which in turn render any dispute arising from those transactions more appropriately determined in Malaysia. Therefore, even if the personal connections of the parties did point to Malaysia, it would be accorded little to no weight in the first stage of theSpiliadaanalysis.",
        "Personal connections of the witnesses": "24 The personal connections of witnesses encompass two distinct factors: (a) first, the physical location of the witnesses and the convenience in having the case decided in the forum where they are ordinarily resident; and (b) second, the jurisdiction in which a witness is compellable to give evidence (seeJIO Minerals([15] above)at [63]). Generally, the physical locations of witnesses are of less significance today given the ease of travel and the possibility of that witness giving evidence by video-link (seeJIO Mineralsat [63];Lakshmi AnilSalgaocar v Jhaveri Darsan Jitendra[2019] 2 SLR 372 (“Lakshmi”) at [72]). On the other hand, because a Singapore court cannot compel a foreign witness to testify in court proceedings in Singapore (see, for example, O 15 r 4(3) of the ROC 2021, which requires that an order for a witness to attend court or to produce documents be served on the witness by personal servicein Singapore), that a witness is compellable to testify in a particular jurisdiction points to that jurisdiction as the more appropriate forum (seeJIO Mineralsat [71]). 25 There are two further points of principle to note in connection with the issue of compellability. First, it generally assumes significance where the main disputes in the action revolve around questions of fact, so that there would be savings of time and resources if the trial is held in the forum in which the witnesses reside and where they are clearly compellable to testify (seeRickshawat [19]). Secondly, it generally focuses on third-party witnesses not in the employ or control of the parties to the dispute, because these are the witnesses who the parties may not be able to persuade to give evidence voluntarily in the absence of their compellability (seeIvanishvili,Bidzina and others v Credit Suisse Trust Ltd[2020] 2 SLR 638 (“Ivanishvili”)at [84]). 26 With these principles in mind, I turn to the submissions. The Defendants argue that there are material disputes of fact arising in OC 163, in connection with which Tay and Chai are material witnesses. This is because Tay and Chai, who are the brokers of Chang’s investment in FIPL, were instrumental in structuring the transactions and their evidence is needed on why the transactions under the PNs have been structured in the way they had. According to the Defendants, Tay and Chai would be able to give evidence on matters like how Chang came to know of the Defendants, what they (Tay and Chai) had told Chang, what Chang understood of the transactions, and how the transactions under each of the PNs had been carried out.34Foot Note 34×Defendants’ Written Submissions at paras 33–37.In arguments, the Defendants’ counsel emphasised that the transactions relating to the PNs could not be as simple as what Chang’s pleaded claims in OC 163 suggest, because if it did simply involve a claim to recover investment monies and interest as Chang’s pleaded case suggests, then Chang could have simply entered into an agreement with the entity that he had paid (ie, FV), instead of entering into such an elaborate arrangement under the PNs which provided for FIPL (which is not the entity that received payment) to make repayment and for FGL/FCL to act as guarantors. The main point which the Defendants’ counsel appears to make is that the agreement between Chang and the Defendants is contained in something other than the PNs, and because of their role as brokers, Tay and Chai would know and hence be able to give evidence on what the terms of that agreement are, and why those terms had been put in place. The material disputes of fact which the Defendants allude to in their submissions therefore appear to be those relating to the terms of the transactions pursuant to which the claims in OC 163 have been made. 27 However, the level of detail in the Defendants’ submissions is absent from the two affidavits they have put forward in the Stay Applications – one filed jointly by FIPL and FCL, and the other filed by FGL (“the Affidavits”). The material in the Affidavits relating to the issue of personal connections of witnesses cover two main areas: (a) First, the defences that each of the Defendants would likely mount. For FIPL, it is stated that it would be “(a) challenging the purported issuance and validity of [the PNs]; and (b) disputing the alleged terms in relation to payment”. For FCL, it is stated that, because FCL had not been a signatory or party to PN1B, PN2B and PN3A, it would be “challenging the allegation that it is a corporate guarantor of [FIPL’s] liabilities”.35Foot Note 35×Lau’s Affidavit at paras 20 and 24.For FGL, it is stated that FGL had only been a guarantor of FIPL’s liabilities under PN1A, PN2A and PN3, and by virtue of the entire agreement clause found in the Term Sheet (see [5(b)] above), its obligations as a guarantor would have been discharged following the entry into of PN1B, PN2B and PN3A between Chang and FCL.36Foot Note 36×Khoo’s Affidavit at para 22. (b) Second, the evidence that Tay and Chai could give, which includes how Chang came to learn about FIPL, the materials and documents that Chang had received from the brokers, what the brokers had said to Chang, what Chang understood of the PNs, where the transactions were carried out, and the purpose of the transactions. This largely mirrors what the Defendants have said was the evidence that Tay and Chai could give in their submissions (see [26] above). 28 It is therefore not apparent from the Affidavits that the Defendants are asserting that material disputes of fact exist, and further,that the evidence of Tay and Chai would be critical to these disputes of fact. The question arising is whether I am limited to the Affidavits alone or can additionally take into account what was said by the Defendants’ counsel in submissions in assessing the personal connections of Tay and Chai and their due weight in the first stage of theSpiliadaanalysis. Whether the court is limited to the affidavit evidence in determining if a material dispute of fact exists and/or if the evidence of a witness is critical 29 Whether a material dispute of factexistsas a state of affairs is afactthat the stay applicant must make good in discharging its legal burden under the first stage of theSpiliadaanalysis. That a material dispute of factexists, which in turn renders the personal connections of particular witnesses relevant,is a fact on which the stay applicant relies to persuade the court that the identified jurisdiction is a more appropriate forum. As the Court of Appeal held inSiemens AG([15] above) (at [6]), “the existence of a fact which shows that a jurisdiction isforumconveniensorvice versais a question of fact, and the party who alleges the fact bears the burden of proving it”. The burden is therefore on the stay applicant toprovethat a material dispute of factexists. This could be done, for instance, by a reference to the factual circumstances which it intends to rely on, which on its face contradicts the factual position taken by the claimant. Since the issue of whether a material dispute of factexistsis a matter to be proven, the factual circumstances on which the stay applicant relies in support of the position that such a state of affairs exists must necessarily be deposed to in an affidavit. It would be inappropriate, as a matter of principle, for the court to have regard to matters that have not been stated on oath, in determining if a material dispute of fact exists. 30 Also, as the Court of Appeal explained inIvanishvili([25] above)(at [86] and [94]), whether the evidence of a particular witness is critical to a defendant’s defence requires a consideration of the following: (a)whatis the evidence that the defendant will require to establish its defence; and (b)whatis the evidence from that particular witness located within a foreign jurisdiction that the defendant will require for that purpose, which the defendant would be deprived of and hence suffer prejudice if it were required to run its defence in Singapore, where that witness will not be compellable to give evidence. These are similarly questions of fact that the stay applicant must make good, in order to persuade the court that the identified jurisdiction in which that witness resides is a more appropriate forum. The facts on which the stay applicant relies in support of its position on these matters must therefore also be deposed to in an affidavit. It similarly would be inappropriate, as a matter of principle, for the court to have regard to matters that had not been stated on oath, in concluding that the evidence of a particular witness is indeed critical. 31 I should emphasise, however, that none of what I have said above requires the stay applicant to commit itself to a particular position in respect of its defences to the claim, which I accept would be impractical at a stage when it is not yet required to file a defence on the merits in the action (see O 6 r 7(4) of the ROC 2021). Rather, the point here is simply that thematterson which a stay applicant relies in support of its contention that a jurisdiction isforumconveniens– for example, that material disputes of fact exist or that the evidence of particular witnesses are critical to its defence – must be stated on oath, since these are facts going towards the discharge of its legal burden under the first stage of theSpiliadaanalysis. This approach is also consonant with the Court of Appeal’s caution inJIO Minerals([15] above)(at [67])that a defendant applying for a stay should not be permitted to assert, without substantiation, that it requires foreign witnesses, because that would make it easy for defendants to manufacture a connecting factor. Whether the Defendants have shown that a material dispute of fact exists and/or that the evidence of Tay and Chai are critical to their defence 32 Accordingly, the issues of whether the Defendants have shown that a material dispute of fact exists, and/or that the evidence of Tay and Chai are critical to their defence, are to be determined by reference to the Affidavits alone. I therefore proceed on this basis in considering these issues. 33 For FGL, I agree with Chang’s submission that the issues arising from FGL’s defence are largely legal in nature and there are minimal factual disputes. This is because, in so far as FGL is concerned, the Affidavits donotallude to any version of events or facts which contradict that put forward by Chang in his pleaded case, and theonlypoint made by FGL in the Affidavits is that its obligations as a guarantor of FIPL’s liabilities, which existed under PN1A, PN2A and PN3, would have been discharged by the entire agreement clause contained in the Term Sheet.37Foot Note 37×Khoo’s Affidavit at para 22.Thus, on the basis of the Affidavits, the only issue raised in respect of FGL is whether the Term Sheet had the effect of superseding any guarantee arrangements made in the previous PNs, thereby discharging FGL’s obligations as a guarantor. 34 For FCL, the only point made in the Affidavits is that it had not been a signatory or party to PN1B, PN2B and PN3A,ie, the latest extended versions of each of the PNs.38Foot Note 38×Lau’s Affidavit at para 24.However, as the Defendants’ counsel clarified at the hearing before me, this position would have been superseded by the fact that, based on the copies of the PNs exhibited in Chang’s reply affidavit in the Stay Applications, an authorised representative of FCL did sign on PN2B and PN3A.39Foot Note 39×Chang’s Affidavit at pp 69 and 78.The Defendants then clarified that FCL’s position is that no consideration had been provided by Chang in respect of its obligations as a guarantor under PN1B, PN2B and PN3A. That, however, is not stated anywhere in the Affidavits. That being the case, there is no basis for me to conclude that a material dispute of fact exists, in so far as FCL is concerned. In any case, since it is not in dispute that Chang did remit the investment monies under each of the PNs to FV (see [4] above), any contention about consideration would appear to raise a legal issue as to whether payment to FV constituted good consideration for FCL’s promise to guarantee FIPL’s repayment obligations. 35 For FIPL, I accept that the defences which it has stated it likely will raise to Chang’s claims in OC 163 – namely, a challenge to the purported issuance and validity of the PNs and a dispute over the terms in the PNs relating to payment40Foot Note 40×Chang’s Affidavit at para 20.– would likely raise disputes of fact. However, because FIPL has not provided any details as to the factual circumstances which it intends to rely on in support of these defences, such as how and/or why it seeks to challenge the issuance and validity of the PNs and dispute the payment terms under the PNs, there is nothing before me suggestive of the evidence that FIPL will require in running its defence. That being the case, there is no basis for the court to conclude that the evidence that FIPL will require in running its defence canonlybe obtained from a foreign jurisdiction, for example, from a witness compellable in that jurisdiction. In other words, even if a dispute of fact exists in connection with FIPL, it is not of much signficance for the purposes of the first stage of theSpiliadaanalysis. 36 I now turn to the issue of whether the Defendants have shown that the evidence from Tay and Chai are critical to their defence. There is no dispute that Tay and Chai are residents in Malaysia,41Foot Note 41×Chang’s Affidavit at paras 102–103.and in the absence of evidence to the contrary, I accept that they are not compellable to testify in Singapore (see [40] below). The Defendants do set out in the Affidavits the matters which Tay and Chai are able to testify to (see [27(b)] above).42Foot Note 42×Lau’s Affidavit at para 25; Khoo’s Affidavit at para 23.However, that Tay and Chai can give evidence of some relevance to the issues in dispute is not conclusive. What is needed, in order to establish that they are critical witnesses, is that the evidence they can give is that which the Defendants will require to establish their defence to the claims in OC 163 (seeIvanishvili([25] above)at [94]). Because the Defendants have not provided any indication on the factual circumstances which FIPL intends to rely on in support of its intended defences to the claims in OC 163 (see [35] above), there is no basis on which I can conclude that the matters which Tay and Chai can testify to corresponds to the evidence that FIPL will require in establishing its defence. Given my view that there appears to be no material disputes of fact in so far as FGL and FCL are concerned (see [33]–[34] above), there is similarly no basis on which I can conclude that the matters which Tay and Chai can testify to corresponds to the evidence that FGL and FCL would require in establishing their respective defences which, as I have noted earlier, appear to raise legal rather than factual issues. In other words, the Defendants have not satisfied me that they would be prejudiced by the unavailability of evidence from Tay and Chai if OC 163 were tried in Singapore. In these circumstances, I am unable to conclude that Tay and Chai are witnesses critical to the Defendants’ defences, and the fact that they are compellable only in Malaysia does not give rise to a connecting factor for the purposes of the first stage of theSpiliadaanalysis. 37 For completeness, however, let me also consider this issue on the basis of what the Defendants have relied on in their submissions, which is that the agreement between Chang and the Defendants is contained in something other than the PNs, the terms of which Tay and Chai would be privy to given their role in brokering the transactions (see [26] above). Obviously, if the Defendants take the position that theactual termsgoverning their relationship with Chang is found elsewhere other than in the Terms of the PNs relied on by Chang, a material dispute of fact exists. However, it is not obvious to me why the Defendants would require the evidence from Tay and Chai in establishing this position, which is the critical element that must be made out for the Defendants to satisfy me that Tay and Chai are critical witnesses. I accept that Tay and Chai, by virtue of their role as brokers, would be aware of the allegedactual termsof the transactions, but would Chang and the Defendants’ representatives involved in the transactions not be similarly privy to these allegedactual terms, given that there is no dispute that Chang and the Defendants were parties to the transactions? Since the Defendants would be able to rely on evidence, other than that from Tay and Chai, to prove the alleged actual terms of the transactions, I am not satisfied that the Defendants willrequireevidence from Tay and Chai in establishing what they say is their intended defences, and any prejudice caused to them in the absence of such evidence is minimal to none. Therefore, even if the matters relied on by the Defendants in their submissions were considered, I would have come to the view that they donotshow that Tay and Chai are witnesses critical to the Defendants’ defences, and I would stillnothave considered the personal connections of Tay and Chai as relevant for the purposes of the first stage of theSpiliadaanalysis. 38 For completeness, I note that, while there are other actors in the dispute not resident in Singapore, such as FIPL’s Chief Executive Officer/Director Lau Kin Wai, there has been no issue raised about the compellability or location of these other witnesses. In any case, these witnesses, who are in the employ of the parties to OC 163, would likely be willing to testify voluntarily (seeIvanishvili([25] above)at [84]). The parties have not regarded the connections of these other witnesses as relevant for the purposes of the first stage of theSpiliadaanalysis, and consistent with that, I also do not consider those connections. Tay and Chai’s purported willingness to testify in Singapore against the Defendants 39 Finally, I deal with Chang’s submission that there can be no issue of compellability in connection with Tay and Chai, since they are bothwillingto testify against the Defendants. In the light of my views above, this issue is moot, but I address it for completeness given the submissions that have been made. 40 As a starting point, the court proceeds on the basisthat the compellability of a witness is in issue, unless shown otherwise by evidence of the willingness of the foreign witness to testify in Singapore (seeSinopec International (Singapore) Pte Ltd v Bank of Communications Co Ltd[2021] SGHC 245 (“Sinopec”) at [90]). Thus, in order for Chang to satisfy me that the compellability of Tay and Chai pose no issue, Chang must adduce evidence that Tay and Chai are willing to testify at a trial of OC 163 in Singapore. What Chang has provided in his reply affidavit for the Stay Applications falls short of the requisite evidential threshold. In respect of Tay, there is only Chang’s assertion that he remains in regular contact with Tay, and that Tay had assured him over the phone that he (Tay) is willing to testify in Singapore, if need be.43Foot Note 43×Chang’s Affidavit at para 102.In respect of Chai, it is even more tenuous, and Chang has no evidence of her position whatsoever, and only states his belief that Chai is similarly indignant with the Defendants as a result of Chang’s predicament of being unable to recover his investment monies, and is therefore also prepared to testify in Singapore.44Foot Note 44×Chang’s Affidavit at para 103.Thus, if the issue had arisen for decision, I would have disagreed with Chang’s submission that Tay and Chai are both willing to testify in Singapore against the Defendants.",
        "Location of the relevant events and transactions": "41 I now move on to the second connecting factor relied on by the Defendants. In order for the stay applicant to show that the location of the events and transactions constitutes a connecting factor in favour of that jurisdiction, it must show that that jurisdiction is where the trial could be held at least expense and inconvenience (seeBest Soar Ltdv Praxis Energy Agents Pte Ltd[2018] 3 SLR 423 at [19]). One relevant consideration is whether the witnesses and evidence that are relevant to the issues likely to be in dispute will be located in that jurisdiction (seeHalsbury’s([16(a)] above)at para 75.092). 42 The Defendants emphasise that the relevant transactions giving rise to Chang’s claim in OC 163 all occurred in Malaysia: Tay and Chai had introduced Chang to the Defendants’ representatives in Malaysia; the communications of Tay and Chai with Chang also took place in Malaysia; Tay and Chai procured for Chang to sign the relevant documents in Malaysia; and the investment monies were also remitted by Chang from a Malaysian bank account to FV, a Malaysian entity.45Foot Note 45×Lau’s Affidavit at para 27; Khoo’s Affidavit at para 25.In submissions, the Defendants’ counsel clarified that the location of the transactions is significant in that Malaysia is where the relevant witnesses and the relevant documentary evidence are located. However, the Defendants did not identify with precision in the Affidavits what the alleged documentary evidence entailed. For instance, it is unclear if those documents would simply be the documents relating to the PNs, most of which would have been exhibited in Chang’s reply affidavit for the Stay Applications. At the hearing, the Defendants’ counsel added that these documents consist of written communications, taking the form of either WhatsApp messages or e-mails, exchanged between: (a) the brokers themselves; (b) the brokers and Chang; and (c) the brokers and FV, which received the investment monies remitted by Chang. The Defendants’ counsel also said that there wouldpresumablybe a “Term Sheet” governing the relationship between the brokers and the Defendants in connection with the fund-raising exercise to which the PNs relate. 43 I have several difficulties with the position taken by the Defendants. First and foremost, it suffers from the same fundamental defect as that afflicting the Defendants’ position on the personal connections of Tay and Chai, because no part of the Affidavits identifies or specifies what exactly is the documentary evidence that the Defendants say is located within Malaysia. None of what the Defendants’ counsel informed me at the hearing, relating to the WhatsApp messages or e-mails as well as the alleged “Term Sheet” between the brokers and the Defendants is identified or raised in the Affidavits. The only reference in the Affidavits to “documents” is “certain documents” which Tay and Chai had “procured for [Chang] to sign and execute … in Malaysia”.46Foot Note 46×Lau’s Affidavit at para 27(4); Khoo’s Affidavit at para 25.There is no elaboration as to what these documents are and why they are located within Malaysia. That relevant documentary evidenceexists, and that they are exclusively locatedwithin Malaysia, are facts which the Defendants must prove in discharge of their legal burden under the first stage of theSpiliadaanalysis that Malaysia is a more appropriate forum (see [29] above). The Affidavits are therefore plainly inadequate in so far as these facts are concerned. There is simply no material by which I can conclude that there is relevant documentary evidence located within Malaysia. That being the case, the location of the events and transactions do not give rise to a connecting factor for the purposes of the first stage of theSpiliadaanalysis. 44 Secondly, even if I were to accept that the alleged documentary evidence exists and that they are located within Malaysia, the Defendants have not explained to me why these documents are critical to their defences. In order for the stay applicant to satisfy the court that the location of certain documents gives rise to a relevant connecting factor, it must also explain how those documents contain evidence that it would require in establishing its defence, of which it would be deprived and hence prejudiced if a stay was refused and the dispute was tried in Singapore. It cannot suffice for the stay applicant to point to these documents in the abstract and make bare assertions as to their relevance. In this case, since the Defendants have not explained or stated in the Affidavits the evidence that they would likely require in establishing their intended defences, it follows that no explanation had been given in the Affidavits as to why the alleged documentary evidence contains evidence required for their defences. 45 Finally, even if the location of the documentary evidence were a relevant connecting factor, I do not think much weight can be given to it in the circumstances of this case. The location of documents becomes a relevant connecting factor if the disclosure of documents canonlybe obtained in the jurisdiction in which it is located; beyond those situations, documentary evidence is generally transportable between jurisdictions (seeIvanishvili([25] above)at [98]). In this case, it is not suggested by the Defendants that the documentary evidence they have identified cannot be transported from Malaysia to Singapore. Importantly, most of the documents identified by the Defendants in their submissions would presumably be in electronic format, such as the WhatsApp chat records and e-mail correspondence. The location of where these communications took place is therefore nothing but a red herring. It is also important to note that these documents, even if unavailable in electronic format, would generally be within the possession, custody or control of the parties to OC 163, and this would also apply to the alleged “Term Sheet” governing the relationship between the Defendants and brokers. It therefore stands to reason that, even if these documents were presently located within Malaysia, the parties would arrange for them to be transported to Singapore, in support of their respective case or defence at a trial of OC 163 in Singapore.",
        "Whether the connecting factors identified by Chang point to Singapore as the more appropriate forum?": "46 For the applicant to succeed in obtaining a stay on grounds offorum nonconveniens, it must show that there are connectingfactors pointingawayfrom Singapore towards a foreign jurisdiction as the more appropriate forum; the strength of the connections between the dispute and Singapore does not in and of itself have a bearing on whether the competing jurisdiction identified by the stay applicant is the more appropriate forum (see, for example,Sinopec([40] above)at [180]). Given my conclusion above that the connecting factors identified by the Defendants donotpoint to Malaysia as the more appropriate forum, the Defendants have failed to discharge their legal burden under the first stage of theSpilliadaanalysis, and it follows from that alone that the Stay Applications are to be dismissed, irrespective of the effect of the connecting factors identified by Chang. The second and third issues therefore do not arise for consideration. 47 However, given the arguments that have been made by the parties on these connecting factors – governing law and the effect of the Arbitration Clause – I set out my views on them in this section.",
        "The Arbitration Clause": "48 To the best of my knowledge, there appears to be no direct authority on whether an arbitration agreement can give rise to a connecting factorvis-à-visthe jurisdiction identified as the seat of the arbitration in theforum nonconveniensanalysis. This is unsurprising because, if there is an arbitration agreement, parties are obliged to resolve disputes combining within that agreement by arbitration, and in the event that court proceedings are commenced in respect of such disputes, the other party to the arbitration agreement would apply for a stay of those proceedings. It is only in the specific circumstances of this case (see [56] below) that the effect of an arbitration agreement in theforum nonconveniensanalysis arose for consideration. What effect should an arbitration agreement have (if at all) in theforum non conveniensanalysis? 49 Where a non-exclusive jurisdiction agreement identifies a foreign jurisdiction as the chosen forum, the defendant seeking to stay proceedings commenced in Singapore may rely on the non-exclusive jurisdiction clause as indicative that the foreign jurisdiction is a more appropriate forum than Singapore in the first stage of theSpiliadaanalysis (seeShanghai Turbo Enterprises Ltd v Liu Ming[2019] 1 SLR 779 (“Shanghai Turbo”) at [88(b)]). In this context, the non-exclusive jurisdiction agreement provides a basis for the court to infer that the parties had agreed that the foreign jurisdiction identified therein isanappropriate forum (seeShanghai Turboat [87];UBS AG vTelesto Investments Ltd and others and another matter[2011] 4 SLR 503 at [118];PT Jaya PutraKundur Indah v Guthrie Overseas Investments Pte Ltd[1996] SGHC 284 at [64], cited in Yeo Tiong Min, “The Contractual Basis of the Enforcement of Exclusive and Non-Exclusive Choice of Court Agreements” (2005) 17 SAcLJ 306 (“Enforcement of Choice of Court Agreements”)at para 81; see also Richard Fentiman,International Commercial Litigation(Oxford University Press, 2nd Ed, 2015) at para 2.242). 50 On the other hand, where proceedings are commenced in Singapore in breach of an exclusive jurisdiction agreement identifying a foreign jurisdiction as the chosen forum, the proceedings in Singapore are to be stayed, unless “strong cause” for refusing a stay is shown by the party commencing those proceedings (seeVinmarOverseas (Singapore) Pte Ltd v PTT International Trading Pte Ltd[2018] 2 SLR 1271 (“Vinmar”) at [71] and [112]). Where exclusive jurisdiction agreements are concerned, the court is concerned with the need to give effect to party autonomy by upholding the parties’ bargain on the forum in which they have agreed for their disputes to be resolved (seeVinmarat [72] and [115]). The appropriateness of the chosen forum would therefore not have been a consideration where the case concerns an exclusive jurisdiction agreement. Nonetheless, in my view, it would be fair to say that the exclusive jurisdiction agreement also provides a basis for the court to infer that the parties had agreed that the chosen jurisdiction isthemore appropriate forum, to the exclusion of all other competing fora. This is because the exclusive jurisdiction agreement, as Professor Yeo explained inEnforcement of Choice of Court Agreements(at paras 15–16 and 20), has a derogation function, namely, it specifies that the chosen court is theonlycourt that should hear the case, and that all other courts shouldnothear the case. That is not to say that the exclusive jurisdiction agreement necessarily results in the chosen forum being designated asthemore appropriate forum, because the question of appropriateness ultimately turns on an analysis of all relevant factors under the first stage of theSpiliadaanalysis. All I say is that, if an exclusive jurisdiction agreement ever featured in the first stage of theSpiliadaanalysis as a connecting factor, its weight must be significant because the agreement therein is not only that the chosen forum isanappropriate forum, but further, that it istheappropriate forum. 51 Two broad points of principle that are relevant for present purposes may be summarised from the above. First, the basis on which a jurisdiction agreement comes to have effect in theforum nonconveniensanalysis is contractual. In other words, a particular jurisdiction comes to be regarded as an appropriate forum by virtue of a jurisdiction agreement, only because the parties intended it be so. In other words, if the jurisdiction agreement is to have any such effect, it must not have been brought to an end at the time when the court proceedings in question were commenced. Secondly, the weight that is to be accorded to the jurisdiction agreement in theforum nonconveniensanalysis would in principle depend on whether it is indicative of the parties’ contractual intention in relation toanappropriate forum orthemore appropriate forum. 52 With the above in mind, I now turn to consider what effect, if at all, an arbitration agreement should have in theforum nonconveniensanalysis. First, in my view, an arbitration agreementcangive rise to a connecting factorvis-à-visthe jurisdiction identified as the seat of the arbitration in theforum nonconveniensanalysis. This is because, an arbitration agreement not only specifies themodeby which the parties’ disputes are to be resolved, it also, by reference to the jurisdiction designated as the seat of the arbitration, identifieswherethe parties intended for their dispute to be resolved. In other words, it identifies a jurisdiction that, by virtue of the parties’ agreement, had a relevant and substantial association with disputes coming within the scope of the arbitration agreement. That the arbitration agreement provides for the dispute between the parties to be resolved other than by way of court proceedings is immaterial for present purposes, provided there are sufficient safeguards to ensure that a claimant would not be allowed to justify court proceedings in a particular jurisdiction by relying on an arbitration agreement and thereby circumvent the arbitration agreement (see [54] below) 53 Secondly, any such connecting factor that an arbitration agreement gives rise to would ordinarily have significant weight in the first stage of theSpiliadaanalysis. This is because an arbitration agreement, like an exclusive jurisdiction agreement, has a derogation function, by “deselecting” all the other venues of dispute resolution save for that which is specified in the arbitration agreement (seeEnforcement of Choice of Court Agreementsat para 27). The arbitration agreement therefore reflects, not only the parties’ intention on theexclusivemode by which disputes coming within the scope of that agreement are to be resolved, but also their intention that such disputes shouldnotbe resolved in any other jurisdiction, save in the jurisdiction that has been designated as the seat of the arbitration. In other words, an arbitration agreement is indicative of the parties’ contractual intention in relation tothemore appropriate forum for the resolution of their disputes. That, however, does not mean that the identified jurisdiction is necessarilyforumconveniensbecause the question of appropriateness ultimately turns on an analysis of the other relevant factors under the first stage of theSpiliadaanalysis (see also [50] above). 54 Finally, like a jurisdiction agreement, an arbitration agreement’s effect in theforum nonconveniensanalysis is founded upon its contractual nature, meaning that it identifies a jurisdiction as an appropriate forum in the first stage of theSpiliadaanalysis only because the parties intended it be so. This has two consequences. First, the dispute that is the subject of the court proceeding for which a stay is sought onforum nonconveniensgrounds must come within the scope of the arbitration agreement. Second, at the time when that court proceeding was commenced, the arbitration agreement must not have been brought to an end and must remain in force and continue to be binding on the parties. Put simply, the claimant’s commencement of court proceedings must not have given rise to a repudiation of the arbitration agreement that was subsequently accepted by the defendant so that the arbitration agreement is brought to an end (seeMarty Ltd v Hualon Corp (Malaysia)Sdn Bhd (receiver and manager appointed)[2018] 2 SLR 1207 (“Marty Ltd”) at [51]). On this note, it is relevant to note the Court of Appeal’s observations inMarty Ltd(at [54]) that: … parties who enter into a contract containing an arbitration clause can reasonably expect that disputes arising out of the underlying contract would be resolved by arbitration and indeed have a contractual obligation to do so. Thus, where court proceedings are commenced without any accompanying explanation or qualification and the relief sought will resolve the dispute on the merits, the defending party in the court proceedings is entitled to take the view that the party who commenced those proceedings (‘the claimant’) no longer intends to abide by the arbitration clause.It would, however, still be open to the claimant to displace thisprima facieconclusion by furnishing an explanation for commencement of the court proceedings, either on the face of the proceedings themselves or by reference to events and correspondence occurring before the proceedings started which showed objectively that it had no repudiatory intent in doing so. But in the absence of any explanation or qualification, the commencement of court proceedings in the face of an arbitration clause is, in our view, sufficient to constitute aprima facierepudiation of the arbitration agreement. [emphasis added] The effect of the Arbitration Clause 55 In this case, whether the Arbitration Clause has any effect in theforum nonconveniensanalysis turns on whether the arbitration agreement therein had been repudiated as a result of Chang’s commencement of OC 163. I should also add that there is no dispute that the subject matter relating to the claims in OC 163 come within the scope of the Arbitration Clause. 56 In my view, the events occurring before the commencement of OC 163 show that Chang had no repudiatory intent in commencing OC 163, and so the arbitration agreement in the Arbitration Clause had not been repudiated by the commencement of OC 163. First, it is important to note that this is not a case where a claimant had commenced court proceedingsinsteadof arbitration; Changhadin fact commenced arbitration first, and it was only when the Defendants’ participation in the arbitration was not forthcoming that Chang refused to pay further deposits requested by the SIAC which eventually led to the arbitration being withdrawn.47Foot Note 47×Chang’s Affidavit at paras 60, 68–70. 57 Secondly, I do not find it persuasive the submission by the Defendants’ counsel that Chang had made a considered decision tonotproceed with arbitration and then breached the arbitration agreement by commencing OC 163. The Defendants stress that it was Changhimselfwho discontinued the arbitration by ceasing to pay the deposits required by SIAC. That much is undisputable, but the fact is the Defendants didnotparticipate in the arbitration, and in those circumstances, it was not unreasonable for Chang to decide to cease prosecution of the arbitration and commence OC 163 instead. The Defendants sought to explain their non-participation in the arbitration by saying that they never received the Notices of Arbitration and letters from SIAC.48Foot Note 48×Lau’s Affidavit at para 14; Khoo’s Affidavit at para 17.However, I do not find that persuasive. As stated in Chang’s affidavit, the relevant Notices of Arbitration were sent to the registered addresses of the Defendants by courier.49Foot Note 49×Chang’s Affidavit at paras 63–66.The Defendants did not in these proceedings dispute that those were indeed their addresses, and indeed, the Affidavits also identify those same addresses as the registered addresses of FIPL and FGL respectively (and on this note, FCL is a subsidiary of FGL).50Foot Note 50×Lau’s Affidavit at paras 4–5; Khoo’s Affidavit at para 6.In these circumstances, I am of the view that Chang had a good explanation for commencing OC 163, and his commencement of OC 163 did not constitute a repudiation of the arbitration agreement contained in the Arbitration Clause. I need only add that,afterOC 163 had been commenced, Chang’s solicitors had informed the Court at a Registrar’s Case Conference that Chang was prepared, on certain conditions, to stay the proceedings in OC 163 pending arbitration.51Foot Note 51×Chang’s Affidavit at para 80.Although conduct post-commencement of court proceedings is not immediately relevant for present purposes (seeMarty Ltd([54] above)at [54]), it reinforces my conclusion that Chang hadnotacted with repudiatory intent in commencing OC 163. 58 Accordingly, I agree with Chang that the Arbitration Clause has the effect of identifying Singapore as a more appropriate forum in the first stage of theSpiliadaanalysis, and by virtue of what I have said above (at [52]–[53]), it is to be given significant weight as a connecting factor.",
        "The governing law of the PNs": "59 I now come to the last connecting factor raised in the Stay Applications – the governing law clause of the PNs, which provide that “all acts and transactions of the parties hereto shall be governed, construed, and interpreted in accordance with the laws of Singapore”. 60 The governing law of the dispute is a connecting factor that points to the courts of the jurisdiction from which that system of law originates as the more appropriate forum because there will clearly be savings in time and resources if a court applies the laws of its own jurisdiction to the substantive dispute (seeCIMB BankBhd([15] above)at [63];Sinopec([40] above)at [42]). This starting point, however, is subject to two qualifications. First, in the absence of any evidence to the contrary, the court proceeds on the basis that the law in the foreign jurisdiction is no different from Singapore law (seeSinopecat [78]). This is because if foreign law is not proved, the content of foreign law will be presumed to be the same as the law of the forum (seeThe“Chem Orchid”[2015] 2 SLR 1020 at [159]). Second, if the legal issues raised in the dispute are straightforward, or if the competing forum has domestic laws which are substantially similar to those of the forum, little weight is given to the governing law as a connecting factor (seeCIMBBank Bhdat [61];Sinopecat [79]). Taken together, both these qualifications mean that, if a party seeks to persuade the court that a particular forum is more appropriate by virtue of it being a court in the system of law identified as the governing law, it must show that the content of those laws are of such nature that only courts of that system of law will be adept in applying them, thereby producing cost savings if trial takes place there. 61 With these principles in mind, I turn to the facts of the present case. The claimant submits that the governing law clause is the most significant connecting factor that points to Singapore as the more appropriate forum because Chang’s claim in OC 163 is relatively straightforward with no substantial disputes of fact, and that the likely issues in OC 163 are mostly legal in nature, given the defences which the Defendants have identified in the Affidavits.52Foot Note 52×Claimant’s Written Submissions at paras 19, 22 and 23.I have two difficulties with this submission. 62 First, the fact that the claims are straightforward and raise mostly legal issues does notper serender the governing law a weighty connecting factor for the purposes of the first stage of theSpiliadaanalysis. The governing law of the dispute assumes significance because the familiarityof the courts in a jurisdiction with that system of law means the dispute can be tried with least expense and inconvenience in that jurisdiction. The fact that the dispute raises mostly legal issues or involves straightforward claims do not have a bearing on that consideration. If the legal issues raised are straightforward, and if the laws of the competing foreign jurisdiction are no different from those of the forum, then all other things being equal, the action may be tried in either jurisdiction with no appreciable distinction in expense or inconvenience. 63 Secondly, I do not think there is enough material for the court to conclude at this stage that Chang’s claims would raise mostly legal issues. Whether Chang’s claims are indeed straightforward would depend on the defences that the Defendants ultimately put forward, if those claims proceed in the Singapore courts. As the Defendants have not provided much detail about precisely what defences they intend to run (see [36] above), there is no basis for the court to draw conclusions at this stage about the likely issues in OC 163, and whether they would be largely legal in nature. In any case, the fact that these issues are largely legal in nature do notper semake Singapore a more appropriate forum, for the reasons that I have explained earlier. 64 In this case, the burden is on Chang, who seeks to argue that Singapore is a more appropriate forum than Malaysia by virtue of the governing law clause, to show that the part of Singapore law applicable to the PNs is unique to Singapore and hence distinct from that under Malaysian law. In the absence of proof that Singapore law differs from Malaysian law in this aspect, the court would proceed on the assumption that both Singapore and Malaysian law is identical on this count. Therefore, Chang has not shown, by virtue of the governing law clause, that having the dispute tried in Singapore will produce savings in time and resources. 65 However, in the circumstances of this case, I am of the view that the governing law clause constitutes a connecting factor pointing towards Singapore for the first stage of theSpiliadaanalysis, when it is seen together with the Arbitration Clause. This is because the parties have, by their choice of governing law and also by the Arbitration Clause, regarded Singapore as the jurisdiction with the most substantial and relevant connections with the dispute in OC 163. Therefore, while the governing law clause does not have much weight as a connecting factor if seen in isolation, when taken together with the Arbitration Clause, it has the effect of identifying Singapore as the more appropriate forum.",
        "Conclusion": "66 As mentioned earlier, it follows from my conclusion on the first issue that the Defendants have failed to discharge their legal burden under the first stage of theSpilliadaanalysis, and for that reason alone, the Stay Applications are to be dismissed. In these circumstances, there is also no need for me to consider the third issue, namely, the second stage of theSpiliadaanalysis, a point which was not dealt with in much length in arguments anyway. I should also emphasise that my reasons and conclusion on the second issue areobiterbecause, once I conclude that the Defendants have failed to discharge their legal burden under the first stage of theSpiliadaanalysis, the Stay Applications are to be dismissed, and the strength or otherwise of the connections between OC 163 and Singapore do not have a bearing on that result. 67 I will separately deal with the costs of the Stay Applications at a hearing to be fixed by the Registry. Perry PehAssistant Registrar Patrick Ong Kok Seng and Kimberly Lim (Patrick Ong Law LLC) for the claimant; Chu Hua Yi and Goh Jia Jie (FC Legal Asia LLC) for the defendants.",
        "": ""
    }
}