{
    "case_title": "Europ Assistance Holding SA vONB Technologies Pte Ltd(ONB Holdings Pte Ltd, non-party)",
    "ncitation": "[2023] SGHC 226",
    "coram": "Goh Yihan JC",
    "sections": {
        "Background facts": "3 I begin with the background facts. The defendant is a company incorporated in Singapore on 5 January 2018. The defendant’s principal business activity is to manage the operations of its subsidiaries in India, Indonesia, Malaysia, and Singapore. These subsidiaries are in the business of providing technology-driven automobile assistance. The defendant also owns and maintains certain intellectual property, that are in turn licensed to these subsidiaries. 4 The defendant has two shareholders. The first shareholder is the claimant, which holds approximately 45.24% of the issued and paid-up capital. The claimant is a public stock company incorporated in France. The other shareholder is the non-party in the present application, ONBH, which holds the remaining 54.76%. ONBH is the holding vehicle for the defendant’s founders, who are Mr Praveen Surendiran (“Praveen”) and Mr Sreekumar Sundaramoorthy. The shareholders’ agreement between the claimant and ONBH dated 9 April 2018 (the “SHA”) sets out their rights and obligations in relation to their shareholding in the defendant. 5 The SHA and the defendant’s constitution provide that ONBH is entitled to nominate and maintain two directors to the defendant’s board of directors (the “Board”). In turn, the claimant is entitled to nominate and maintain one director to the Board as long as it maintains at least 15% of its shareholding in the defendant. Pursuant to these arrangements, Praveen has been the managing director of the defendant since 16 May 2018. In that capacity, he is responsible for managing the business and day-to-day operations of the defendant and its subsidiaries (the “Group”). 6 Between 2019 and 2021, the claimant increased its investment in the defendant. It made a series of cash injections in the form of equity and loans. In particular, the claimant extended a loan of $4,800,000 to the defendant (the “Loan Principal”) pursuant to the terms of an optionally convertible loan agreement dated 27 July 2021 (the “OCLA”). Under the OCLA, the claimant may exercise an option to convert the Loan Principal into ordinary shares of the defendant. Clauses 2.2 and 2.5 of the OCLA provide that the Loan Principal plus interest (the “Debt”) shall be repaid in a single tranche on 30 January 2023. On 2 February 2023, after the Debt had been due, the claimant gave formal notice to the defendant, requesting the immediate repayment of the Debt. The defendant had not repaid the Debt as of the date I heard the parties. However, the claimant had not served a statutory demand on the defendant to recover the Debt. Instead, the claimant relied on s 125(2)(c) of the IRDA for its application to wind up the defendant.",
        "ONBH had standing to oppose the claimant’s application": "7 A preliminary issue that arose was whether ONBH had standing to oppose the claimant’s application in its capacity as a contributory of the defendant. As the High Court held inAtlasEquifin Pte Ltd v Electronic Cash and Payment Solutions (S) Pte Ltd (Andy Lim and others, non-parties)[2023] 3 SLR 900 (“AtlasEquifin”) (at [18]), a contributory has the standing to oppose a winding up application. However, so as to prevent frivolous oppositions, a court could consider a list of non-exhaustive factors in deciding whether the contributory should be allowed to challenge the application (seeAtlasEquifinat [33]). 8 In the present application, this issue of standing was not live before me, because the High Court on 21 April 2023 had already granted permission for ONBH to file an affidavit to oppose the claimant’s application. Implicit in that holding must be that the court had decided that ONBH had standing to oppose the said application. It was therefore not open for me to revisit this issue and I proceeded on the basis that ONBH had the requisite standing. In any event, except for a brief mention of this issue in its supporting affidavit,1Foot Note 1×2nd Affidavit of Tarik Ajami dated 6 June 2023 at para 3.the claimant did not seriously dispute ONBH’s standing to oppose the application.",
        "My decision: the claimant’s application was dismissed": "9 Having dealt with the issue of standing, I dismissed the claimant’s application because the claimant had not proved to my satisfaction that the defendant was unable or deemed unable to pay its debts.",
        "The claimant’s application to wind up the defendant": "10 The claimant applied to wind up the defendant under s 125(1)(e) of the IRDA, which provides that the court may order the winding up of a company if the company is unable to pay its debts. This should be read with s 125(2) of the IRDA, which provides as follows: (2)  A company is deemed to be unable to pay its debts if — (a) a creditor (by assignment or otherwise) to whom the company is indebted in a sum exceeding $15,000 then due has served on the company, by leaving at the registered office of the company, a written demand by the creditor or the creditor’s lawfully authorised agent requiring the company to pay the sum so due, and the company has for 3 weeks after the service of the demand neglected to pay the sum, or to secure or compound for it to the reasonable satisfaction of the creditor; (b) an enforcement order or other process issued to enforce a judgment, decree or order of any court in favour of a creditor of the company is returned unsatisfied in whole or in part; or (c) it is proved to the satisfaction of the Court that the company is unable to pay its debts; and in determining whether a company is unable to pay its debts the Court must take into account the contingent and prospective liabilities of the company. 11 The claimant relied on s 125(2)(c) of the IRDA to argue that the defendant was clearly unable or deemed unable to pay its debts for the following reasons: (a) Praveen, the defendant’s managing director, has stated on many occasions that the defendant will be cash flow insolvent starting from December 2022.2Foot Note 2×Claimant’s Written Submissions dated 7 June 2023 (“CWS”) at para 25(a). (b) The defendant stated in a letter dated 11 January 2023 (the “Letter”) that “ONB Technologies & its subsidiaries [sic] cash position at the end of December 2022 amounts to €98,053, which is insufficient to meet the January 2022 payments including pending client settlements and other dues, which sums up to €404,351”. This was, in the claimant’s view, supported by certain cash flow documents.3Foot Note 3×CWS at para 25(b). (c) The above-mentioned cash flow documents detailed that the projected cash flow position of the defendant would be negative for the whole of 2023. This was, in the claimant’s view, also substantiated by other documents.4Foot Note 4×CWS at para 25(c). (d) A board meeting was convened on 17 January 2023 to discuss the insolvency of the defendant, and a liquidation framework had been discussed and agreed upon during the meeting.5Foot Note 5×CWS at para 25(d). (e) It is therefore highly unlikely that the defendant would be able to repay the Debt to the claimant under the OCLA.6Foot Note 6×CWS at para 25(e). (f) Furthermore, although ONBH asserted that it was working with its bankers to secure new investors for the defendant, it has not provided any supporting documents to support this assertion.7Foot Note 7×CWS at para 25(f). 12 The claimant recognised that it did not possess any of the defendant’s recent financial documents that showed the current assets and current liabilities of the defendant. This was because, according to the claimant, such information had been withheld from it. However, the claimant argued that the present application should be allowed on the totality of thecircumstantialevidence referred to above.8Foot Note 8×CWS at para 25(g).",
        "The claimant had not proved that the defendant was unable to pay its debts": "13 I disagreed with the claimant that it satisfied s 125(2)(c) of the IRDA based on the circumstantial evidence it led so as to deem the defendant to be unable to pay its debts under s 125(1)(e) of the IRDA. The claimant bore the burden of proof 14 The starting point is that the burden lay on the claimant to establish a ground for winding up, and not the other way around (see the High Court decision ofKon Yin Tong and another vLeow Boon Cher and others[2011] SGHC 228 at [35]). Thus, if the claimant did not possess any of the defendant’s recent financial documents to prove that the defendant was unable to pay its debts under s 125(2)(c) of the IRDA, it could have relied on other grounds in the IRDA to prove that the defendant was unable to pay its debts, such as the failure of the defendant to comply with a statutory demand under s 125(2)(a) of the IRDA. Before me, counsel for the claimant, Mr Chu Hua Yi, explained that the claimant was concerned that the statutory demand process would take too long, which was why the claimant proceeded on the ground in s 125(2)(c). Be that as it may, I was not convinced that the duration of the process was a material concern given that the present application was filed several months ago on 30 March 2023 and fixed for hearing for the first time on 21 April 2023. Indeed, given that the claimant has chosen to proceed under s 125(2)(c), it was incumbent on it to make out its case based on that provision. 15 More broadly, it is important that the burden lay on the claimant to prove the grounds for a winding up application. As the Court of Appeal explained inMetalformAsia Pte Ltd v Holland Leedon Pte Ltd[2007] 2 SLR(R) 268 (at [82]), this is because of the drastic consequences that a winding up application has on a company: … Such a petition may adversely affect the reputation and the business of the company and may also set in motion a process that may create cross-defaults or cut the company off from further sources of financing, thereby exacerbating its financial condition. So long as the court is satisfied that on the evidence there is a distinct possibility that the cross-claim may exceed the undisputed debt, it should give the company the opportunity to prove its claim rather than to allow a winding-up petition to be filed, with all the normal consequences attendant upon the filing of such a petition. Businesses that have a chance of recovery should not be pushed into a state that makes it difficult for them to recover. The applicable test under s 125(2)(c) ofthe IRDA 16 For the claimant to discharge its burden of proving that the defendant was unable to pay its debts under s 125(2)(c) of the IRDA, it must satisfy the cash flow test. As held by the Court of Appeal inSun Electric Power Pte Ltd vRCMA Asia Pte Ltd (formerly known as Tong Teik Pte Ltd)[2021] 2 SLR 478 (“Sun Electric”) (at [65]), the cash flow test is the sole test of solvency, that is, whether the company’s current assets exceed its current liabilities such that it can meet all its debts as and when they fall due. In this regard, “current assets” and “current liabilities” refer to assets which will be realisable and debts which will fall due within a 12-month timeframe (seeSun Electricat [65]). 17 The court also prescribed a non-exhaustive list of factors that should be considered for the purposes of the cash flow test (seeSun Electricat [69]): (a) the quantum of all debts which are due or will be due in the reasonably near future; (b) whether payment is being demanded or is likely to be demanded for those debts; (c) whether the company has failed to pay any of its debts, the quantum of such debt, and for how long the company has failed to pay it; (d) the length of time which has passed since the commencement of the winding-up proceedings; (e) the value of the company’s current assets and assets which will be realisable in the reasonably near future; (f) the state of the company’s business, in order to determine its expected net cash flow from the business by deducting from projected future sales the cash expenses which would be necessary to generate those sales; (g) any other income or payment which the company may receive in the reasonably near future; and (h) arrangements between the company and prospective lenders, such as its bankers and shareholders, in order to determine whether any shortfall in liquid and realisable assets and cash flow could be made up by borrowings which would be repayable at a time later than the debts. 18 With this applicable test in mind, I considered the claimant’s arguments and determined that they did not satisfy this test. The claimant did not satisfy the cash flow test (1) Praveen’s supposed confirmations of insolvency were unreliable 19 In so far as the claimant relied on Praveen’s supposed confirmation that the defendant is cash flow insolvent, I did not think that the bare statements by Praveen should be taken as being conclusive in the context and manner in which they were made. It is important to bear in mind Warren L H Khoo J’s observations in the High Court decision ofReBoey Hong Khim and another, ex parte Medical Equipment Credit Pte Ltd[1998] 1 SLR(R) 956 (at [15] and [19]): 15  What is clear beyond doubt is that the petitioning creditor cannot short-circuit the requirement of proof of inability to pay debts by a bare allegation. This is precisely what the petitioning creditors have done in this case. Indeed, they do not appear to have relied on inability to pay the debt. Rather, as I understand it, they rely on the allegation that the debtor has breached his obligations under the voluntary arrangement. They also rely on the admissions said to have been made by the debtor in the course of the voluntary arrangement proceedings. … 19  As for the admissions in the course of the voluntary arrangement proceedings, I need only say that these are not enough to found a petition. An admission of debt, or the mere failure or even refusal to pay it, cannot be equated with or displace proof of inability to pay the debt. In my respectful view, although Khoo J’s observations were made regarding an allegation of inability to pay a debt, and while the present application involved an alleged admission of insolvency, I find that the principles apply with equal force. This is because the proof of inability to pay a debt will lead to the outcome of insolvency. In my view, it was not safe to rely on these emails as being conclusive of the defendant’s solvency. This is because the emails contained no financial documents to substantiate Praveen’s assertions. Moreover, as Mr Keith Lim (“Mr Lim”), who appeared for ONBH, suggested, it could well be that Praveen was taking a position in his negotiations with the claimant. 20 Further, in the context of a winding up application, an admission, such as in the context of a debt, requires “clear words of admission” (see the Court of Appeal decision ofGreenline-Onyx Envirotech Phils, Inc v Otto Systems Singapore Pte Ltd[2007] 3 SLR(R) 40at [16]). One such example is a consistent acknowledgment in audited accounts or through audit confirmation statements (see the Court of Appeal decision ofFustarChemicals Ltd (Hong Kong) v Liquidator of Fustar Chemicals Pte Ltd[2009] 4 SLR(R) 458 at [21]). Therefore, it is not sufficient for the claimant to rely solely on Praveen’s bare admissions of insolvency without more. Indeed, as mentioned above, if the claimant did not have sufficient evidence to make out its case under s 125(2)(c) of the IRDA, it was entirely open to it to issue a statutory demand and make use of the presumption of insolvency that would have arisen under s 125(2)(a) of the IRDA had the defendant not satisfied the demand. 21 Further, in the present application, the claimant cited three emails from Praveen in December 2022 in which Praveen alluded to the defendant’s imminent insolvency. In support of its application, the claimant also raised the Letter, which went beyond a mere assertion and contained cash flow documents as well, to which I now turn. (2) The cash flow documents were not conclusive of the defendant’s solvency 22 In so far as the claimant relied on the Letter and the accompanying cash flow documents, I recognised that the Letter, on its face and as substantiated by the said documents, did allude to the defendant’s insolvency. However, the weight to be accorded to the Letter ultimately turned on the reliability of the cash flow documents, which I found not to be conclusive of the defendant’s solvency for the following reasons. 23 First, the cash flow documents relied on by the claimant did not reflect the Group’s actual performance because they were circulated some six months ago. When compared with the actual cash flow as depicted in the “monthly P&Ls”, it was clear that the Group has performed better than projected. For example, it was projected in the cash flow documents that the Group would make a loss of€318,946, €420,476, and €512,379 in January, February, and March 2023, respectively. However, contrary to those projections, the monthly P&Ls provided that the consolidated financials of the Group up to March 2023 was a total loss of €261,467. As such,the defendant has actually performed better than projected. I will go on to explain why the fact that the Group was making a loss is not determinative of its solvency. But the point for now is that the cash flow documents therefore cannot be satisfactorily relied on as being conclusive of the defendant’s solvency. 24 Second, as I mentioned, although the Group’s consolidated financials were still at a net loss as of March 2023, the cash flow from financing (which was indicated in the cash flow documents as€0)may have improved as the defendant is in talks with potential investors to provide financing. While the claimant complained that this was merely a bare assertion, it must be remembered that the burden is on the claimant, not the other way around. 25 Third, the cash flow documents related to the finances of the Group as a whole. Thus, it was possible that the cash flow documents may depict an overall negative figure as a result of the cash flow of the defendant’s subsidiaries, even if the defendant was solvent and able to pay its debts. While the claimant may complain that this is unrealistic, it remains that the claimant bore the burden of proof in this application. Therefore, any reasonable uncertainty about the defendant’s solvency in the cash flow documents should be resolved in the defendant’s favour. Moreover, save for the Debt that was premised on the OCLA, the claimant has not produced any evidence of the quantum of any other debts that are allegedly due from the defendant in the reasonably near future, or that the defendant has failed to pay its debts. 26 In the end, based on a holistic evaluation of all the circumstantial evidence, and bearing in mind that the claimant bore the overall burden of proof of satisfying the ground in s 125(2)(c) of the IRDA, I did not think that the claimant has shown, on a balance of probabilities, that the defendant was unable to pay its debts. (3) The applicability of the arbitration clause 27 More pertinently, the claimant argued that any dispute as to the Debt must be referred to arbitration because the OCLA is governed by an arbitration clause. While the claimant argued that the defendant has not shown that there is a genuine dispute as to the consequences of the Debt, I found that the whole point of the arbitration clause is to redirect such disputes from the court to the arbitral tribunal, as per the parties’ agreement. 28 As such, pursuant to the Court of Appeal decision ofAnAn Group (Singapore) Pte Ltd v VTB Bank (Public Joint Stock Co)[2020] 1 SLR 1158 (“AnAn”)(at [56]), the following test must be satisfied: … when a court is faced with either a disputed debtora cross-claim that is subject to an arbitration agreement, theprima faciestandard should apply, such that the winding-up proceedings will be stayed or dismissed as long as (a) there is a valid arbitration agreement between the parties; and (b) the dispute falls within the scope of the arbitration agreement, provided that the dispute is not being raised by the debtor in abuse of the court’s process. [emphasis in original] In essence, once the court was satisfied that there was aprima faciedispute governed by an arbitration agreement and the dispute was not raised by the debtor in an abuse of the court’s process, the court will ordinarily dismiss the winding up application (seeAnAnat [103] and [110]). However, the court will stay the winding up application instead if: (a) there are legitimate concerns as to the solvency of the debtor; and (b) the creditor is able to show that the debtor has raised no triable issues (seeAnAnat [111]). I was of the view that both limbs of the test inAnAnas to when a court should dismiss a winding up application are satisfied and that I should dismiss the claimant’s present application. 29 First, the arbitration clause in the OCLA isprima facievalid. The claimant also did not dispute the validity of the arbitration clause. Second, given the “generous approach towards the construction of the scope of arbitration clauses” (see the Court of Appeal decision ofLarsen Oil and Gas Pte Ltd vPetroprod Ltd (in official liquidation in the Cayman Islands and in compulsory liquidation in Singapore)[2011] 3 SLR 414 at [18]), the disputeprima faciefell within the scope of the arbitration clause in the OCLA. In this regard, the arbitration clause provides as follows:9Foot Note 9×1st Affidavit of Praveen Surendiran dated 9 May 2023 at para 43. The Parties agree to negotiate to resolve all disputes (including any question as to the existence, validity, or termination of this Agreement and the differences arising out of or in connection with any of the matters set out in this Agreement. However, if such dispute or difference is not resolved by amicable settlement within 30 (thirty) days from such dispute (“Dispute”), such Dispute shall be referred to and finally resolved by arbitration pursuant to the rules of the Singapore International Arbitration Centre (“SIAC Rules”) for the time being in force. The SIAC Rules are deemed to be incorporated by reference in this Clause 10.2. The seat of arbitration shall be Singapore and the arbitration shall be conducted in the English language. The arbitral tribunal shall consist of three arbitrators, Parties initiating arbitration and the counterparties shall each appoint one arbitrator and the two arbitrators so appointed shall appoint a third arbitrator acceptable to both Parties, failing which the third arbitrator shall be appointed in accordance with the SIAC Rules. Without expressing a view on whether the parties have complied with their obligation to resolve their dispute by amicable settlement before turning to arbitration, I found that the dispute in relation to the claimant’s rights and entitlements under the OCLA fell within the scope of the arbitration clause. 30 In this regard, while the claimant alleged that ONBH was guilty of an abuse of process because the defendant has not commenced arbitration proceedings, I could not see how the defendant’s inaction renders ONBH’s opposition as being an abuse of process. Instead, I agreed with Mr Lim that the arbitration clause applied in the present case because Praveen had raised a dispute about the underlying debt that was backed up by a reason. This therefore went beyond it being a bare assertion and did not amount to an abuse of process. Further, even if a party fails to refer the dispute it raises to arbitration, it would not be an abuse of process for that party to rely on the arbitration clause subsequently (see the High Court decision ofFounder Group (Hong Kong) Ltd (in liquidation) v SingaporeJHC Co Pte Ltd[2023] SGHC 159 at [70]). 31 For completeness, I note that the grounds for the claimant’s winding up application was premised not only on the Debt but also on the defendant’s inability to pay its debts generally. It may therefore be argued that the arbitration clause only concerned the parties’ dispute about the Debt but not the defendant’s other debts. I did not deal with this point in my brief grounds of decision because the claimant had not taken up this point. In any event, the claimant has not shown the presence of other debts apart from the Debt. 32 Accordingly, I dismissed the winding up application.",
        "Conclusion": "33 In summary, I decided that the claimant failed to discharge its burden of proving that the defendant was unable to pay its debts under s 125(1)(e) and s 125(2)(c) of the IRDA because: (a) the claimant cannot rely on Praveen’s assertions that the defendant would be cash flow insolvent; and (b) the Letter and the accompanying cash flow documents were not conclusive of the defendant’s solvency. Further, the parties’ dispute over the Debt was subject to an arbitration clause, and the claimant had not shown why I should stay the winding up application instead of dismissing it. 34 Finally, as to the appropriate costs order, the parties have agreed for the costs of the application to be fixed at $7,000, payable by the claimant to ONBH. Goh YihanJudicial Commissioner Foo Maw Shen, Chu Hua Yi and Lee Yibin Leonard (FC Legal Asia LLC) for the claimant;The defendant absent and unrepresented; Lim Wei Ming Keith (Quahe Woo & Palmer LLC) for the non-party; Beverly Wee for the Official Receiver (Ministry of Law (IPTO))."
    }
}