{
    "case_title": "Re AAX Asia Pte Ltd (under judicial management) and another",
    "ncitation": "[2023] SGHC 324",
    "coram": "Goh Yihan J",
    "sections": {
        "Background facts": "3 I begin with the background facts. AAX Singapore and AAX Asia are part of a corporate group (the “AAX Group”) which operates a cryptocurrency business across multiple jurisdictions, including Singapore, Hong Kong, Malta, the Seychelles, and the Cayman Islands.1Foot Note 1×Affidavit of Luke Anthony Furler dated 14 September 2023 (“LAF-1”) at paras 8–10.AAX Singapore is wholly owned by AAX Asia,2Foot Note 2×LAF-1 at para 7.which is itself wholly owned by the parent entity of the AAX Group, Atom Holdings, an entity registered in the Cayman Islands.3Foot Note 3×LAF-1 at para 6. 4 The AAX Group operated an exchange called the Atom Asset Exchange (also known as “AAX”), which operated a savings platform and facilitated spot and futures trading in cryptocurrencies.4Foot Note 4×LAF-1 at para 10.As recently as September 2022, the AAX Group purportedly processed US$72bn in spot trades each day.5Foot Note 5×LAF-1 at para 10. 5 However, the AAX Group’s stability deteriorated significantly after FTX, a cryptocurrency exchange platform, filed for bankruptcy on 11 November 2022.6Foot Note 6×LAF-1 at para 11.Despite statements from the AAX Group that it had no exposure to FTX7Foot Note 7×LAF-1 at para 11.and assurances that the AAX Group would resume operations if it was able to inject additional capital,8Foot Note 8×LAF-1 at para 13.by mid-November 2022, the AAX Group companies had erased their entire online presence and did not engage further with users of the AAX platform.9Foot Note 9×LAF-1 at para 14.The former management of Atom Holdings also allegedly absconded with the keys to the digital assets of the AAX Group.10Foot Note 10×LAF-1 at para 17. 6 As of 11 July 2023, Atom Holdings has been placed under compulsory liquidation in the Cayman Islands.11Foot Note 11×Claimant’s Written Submissions (“CWS”) at para 7.The liquidators of Atom Holdings (“AH Liquidators”) are from Quantuma (Cayman) Ltd.12Foot Note 12×CWS at para 7.The AH Liquidators passed shareholder resolutions on 10 March 2023 to remove the previous directors of the Companies and replace them with Quantuma appointees (“Quantuma directors”).13Foot Note 13×LAF-1 at paras 23–25, Tab 9 and Tab 11. CWS at para 8. 7 The Quantuma directors passed board resolutions to place the Companies under interim judicial management on 22 March 2023,14Foot Note 14×LAF-1 at pp 145–146 and Tab 13.pursuant to s 94(3) of the IRDA. The Quantuma directors then appointed Mr Luke Anthony Furler (“Mr Furler”) of Quantuma (Singapore) Pte Ltd to serve as the interim judicial manager of the Companies.15Foot Note 15×LAF-1 at p 145–146 and Tab 13.The Official Receiver extended the period of the interim judicial management three times,16Foot Note 16×LAF-1 at paras 41–46 and Tab 17 at pp 317–319; CWS at Annex at p 25.with the last day of the term of appointment of Mr Furler as the interim judicial manager being 16 October 2023.17Foot Note 17×CWS at Annex at p 25. 8 From March to October 2023, Mr Furler carried out investigations to identify the creditors18Foot Note 18×LAF-1 at paras 32–34.and trace the assets19Foot Note 19×LAF-1 at paras 35–39.of the Companies. He concluded that none of the purposes of judicial management under s 89 of the IRDA could be achieved.20Foot Note 20×CWS at para 10; LAF-1 at paras 48–50.His reasons for this conclusion were twofold. (a) First, it would be virtually impossible to rehabilitate the Companies and achieve their survival as a going concern. Mr Furler had been unable to locate any cash or assets belonging to the Companies.21Foot Note 21×CWS at para 11; LAF-1 at para 61.Where digital assets had been identified as potentially belonging to the Companies, Mr Furler had been unable to secure the assets without a court order,22Foot Note 22×LAF-1 at para 36–37 and Tab 16.especially because some of the digital wallets allegedly containing the Companies’ assets were mixed funds. Further, the Companies had no ability to generate income or raise funds because they had ceased operations.23Foot Note 23×LAF-1 at para 61. (b) Second, it was not possible to enter into a compromise or arrangement with the creditors of the Companies as Mr Furler had not been able to identify which of the creditors of the AAX Group were creditors of the Companies.24Foot Note 24×CWS at para 12.As the financial accounts and customer records of the Companies had not been found,25Foot Note 25×LAF-1 at para 56.Mr Furler had been unable to admit a proof of debt for the purposes of facilitating voting at a pre-appointment creditors’ meeting, as he was unable to satisfy himself that each individual creditor had aprima faciecase against the Companies.26Foot Note 26×CWS at para 12. 9 As Mr Furler was of the view that none of the purposes of judicial management could be achieved, he applied to wind up the Companies in his capacity either as an agent for the Companies and/or as the interim judicial manager. Two grounds were relied on to wind up the Companies, namely, that the Companies were unable to pay their debts under s 125(1)(e) of the IRDA, and that it was just and equitable that the Companies be wound up under s 125(1)(i) of the IRDA.",
        "The standing to bring these applications": "",
        "The relevant law": "10 With the above background in mind, a preliminary issue was whether the claimants making these applications were the Companies or the interim judicial manager, and whether they had standing to bring the applications to wind up the Companies. 11 In this regard, s 124(1) of the IRDA sets out a list of the entities with standingto apply for the winding up of a company. Under s 124(1)(a) and s 124(1)(h) of the IRDA, both the company itself and a judicial manager appointed under the IRDA may apply for an order of the Court to wind up a company. For completeness, I set out the relevant provisions of s 124(1) below: Application for winding up 124.—(1) A company, whether or not it is being wound up voluntarily, may be wound up under an order of the Court on the application of one or more of the following: (a) the company; … (h) the judicial manager appointed under this Act for the company[.]",
        "The Companies had standing to bring these applications": "12 Applied to the present case, a company itself has standing under s 124(1)(a) of the IRDAto apply for a winding up order by the court. In this regard, the joint official liquidator of Atom Holdings, the sole member of the Companies, had passed written shareholder resolutions on 12 September 2023, empowering and authorising Mr Furler, as the interim judicial manager of the Companies, to apply for the Companies to be wound up.27Foot Note 27×LAF-1 at pp 32–36; CWS at para 18.The Companies also relied on the English High Court decision ofReEmmadart Ltd[1979] 1 All ER 599 at 604 for the proposition that a board of directors may petition for the winding up of a company where such action was authorised or ratified by the company by an ordinary resolution of the shareholders. 13 With the above in mind, I was satisfied that the sole member of each of the two Companies, Atom Holdings, could authorise the interim judicial manager to make a winding up application through an ordinary resolution. As Lord Reid held in the House of Lords decision ofTesco Supermarkets Ltd vNattrass[1972] AC 153 at 199–200, natural persons are to be treated in law as being the company for the purpose of acts which are done in exercise of powers of the company entrusted to such natural persons pursuant to the memorandum and articles of association, due to actions taken by the directors, or by the members in a general meeting. Accordingly, the Companies, acting through the interim judicial manager whom they had entrusted authority to act with under an ordinary resolution, therefore had standing to make the winding up application. Thus, I was satisfied that the Companies were the appropriate claimants in these applications.",
        "The interim judicial manager had standing to bring these applications": "14 For completeness, I also considered the alternative submission that Mr Furler, in his capacity as the interim judicial manager of the Companies, had the standing to present a winding up application under s 124(1)(h) of the IRDA, which confers standing on a “judicial manager”.28Foot Note 28×CWS at para 20.This raised a question of statutory interpretation as to whether “judicial manager” extended to “interim judicial manager” in the relevant provisions for this purpose. The IRDA suggests that an interim judicial manager appointed under s 94 of the IRDA has and may exercise all the powers of a judicial manager 15 To begin with, s 88(1) of the IRDA provides that a judicial manager is presumed not to include an interim judicial manager unless a contrary intention appears. Such a contrary intention may take the form of an express inclusion of an interim judicial manager in the definition of a judicial manager (see, for example, s 114(2) of the IRDA). However, this definition in s 88(1) of the IRDA is only applicable to Part 7 of the IRDA. Since s 124(1)(h) falls under Part 8 of the IRDA, s 88(1) is not directly applicable. There is therefore an apparent ambiguity as to whether “judicial manager” in s 124(1)(h) is meant to include an interim judicial manager. 16 In my view, the reference to “judicial manager” in s 124(1)(h) of the IRDA should include an interim judicial manager.In the present case, Mr Furler was appointed as the interim judicial manager by a resolution of the Companies’ boards of directors pursuant to s 94(3) of the IRDA, which provides the conditions for such an appointment.Section 94(4)(b) of the IRDA provides that an interim judicial manager appointed under s 94(3) of the IRDA “has, and may exercise, all the functions and powers of a judicial manager appointed by a Court under section 91, subject to such limitations and restrictions as may be prescribed by regulations”. However, there are no limitations or restrictions prescribed in the Insolvency, Restructuring and Dissolution (Judicial Management) Regulations 2020. 17 With the above in mind, so as to give effect to s 94(4)(b) of the IRDA, an interim judicial manager appointed under s 94(3) should have the same powers of a judicial manager appointed under s 91(2) to apply for the winding up of a company. This interpretation is supported by the legislative purpose behind s 94 of the IRDA 18 This interpretation is also supported by the legislative purpose for introducing the framework under s 94 of the IRDA. Section 94 permits companies to enter into judicial management through a resolution of the creditors so as to minimise the formality, expense, and delay associated with the judicial management process (seeSingapore Parliamentary Debates, Official Report(1 October 2018) vol 94 (Mr Edwin Tong Chun Fai SC, Senior Minister of State for Law)). More specifically, the purpose behind the appointment of aninterimjudicial manager under s 94 was to prevent a company’s directors from abusing the judicial management process (see the Insolvency Law Review Committee, Ministry of Law,Report of the Insolvency Law Review Committee(2013) (Chairperson: Lee Eng Beng SC) (“2013 Insolvency Report”) at pp 104–105). Indeed, due to concerns that a company might dissipate assets in the interim before an application for judicial management was heard before the courts, the Committee recommended that a creditor of the company should be entitled to apply for the appointment of an interim judicial manager (see the 2013 Insolvency Report at pp 104–105). 19 Accordingly, an interpretation that a “judicial manager” under s 124(1)(h) of the IRDA extended to an interim judicial manager appointed under s 94(3) furthered this legislative purpose in two ways. First, allowing an interim judicial manager to bring an application to wind up a company where none of the purposes of judicial management are capable of achievement is more effective in minimising formality, expense, and delay. I therefore agreed with the claimants that there was little benefit in requiring that the Quantuma directors, rather than the interim judicial manager, be the parties to initiate separate proceedings to wind up the Companies.29Foot Note 29×LAF-1 at para 13.Second, the power to apply to wind up the company does not interfere with the purposes behind appointing an interim judicial manager, namely, to adjudicate proofs of debt, facilitate the meeting of creditors for a resolution that the company enter into judicial management, and to prevent the dissipation of assets in the interim period. 20 I was therefore satisfied that the proper interpretation of s 124(1)(h) of the IRDA extends “judicial manager” to include an interim judicial manager appointed under s 94(3) of the IRDA. Mr Furler therefore had the standing to bring these applications as the interim judicial manager. For clarity, as I found earlier that Mr Furler was acting as the Companies when he brought these applications, this finding of the interim judicial manager’s standing isobiter. 21 With the preliminary issue of standing determined, I now turn to consider the grounds on which the Companies may be wound up.",
        "My decision: the applications were allowed": "",
        "The Companies were unable to pay their debts": "22 Having considered the submissions, I was satisfied that the Companies were unable to pay their debts, taking into account the contingent and prospective liabilities of the Companies, under s 125(2)(c) of the IRDA. The relevant law 23 InSun Electric Power Pte Ltd v RCMA Asia Pte Ltd (formerly known as TongTeik Pte Ltd)[2021] 2 SLR 478 (“Sun ElectricCA”), the Court of Appeal held that the “the cash flow test should be the sole and determinative test” for determining an inability to pay debts (at [56]). The cash flow test “assesses whether the company’s current assets exceed its current liabilities such that it is able to meet all debts as and when they fall due” (at [65]). The court also agreed that “current assets” and “current liabilities” refer to assets which will be realisable and debts which will fall due within a 12‑month timeframe (at [65]). The court adopts a flexible timeframe in mind when assessing the current assets and liabilities of a company, and may consider debts which may not have been demanded, and which may not even be due (at [66]–[67]). 24 The Court of Appeal prescribed a non-exhaustive list of factors which should be considered to determine if the cash flow test has been satisfied (at [69] ofSun ElectricCA): (a) the quantum of all debts which are due or will be due in the reasonably near future; (b) whether payment is being demanded or is likely to be demanded for those debts; (c) whether the company has failed to pay any of its debts, the quantum of such debt, and for how long the company has failed to pay it; (d) the length of time which has passed since the commencement of the winding-up proceedings; (e) the value of the company’s current assets and assets which will be realisable in the reasonably near future; (f) the state of the company’s business, in order to determine its expected net cash flow from the business by deducting from projected future sales the cash expenses which would be necessary to generate those sales; (g) any other income or payment which the company may receive in the reasonably near future; and (h) arrangements between the company and prospective lenders, such as its bankers and shareholders, in order to determine whether any shortfall in liquid and realisable assets and cash flow could be made up by borrowings which would be repayable at a time later than the debts. My decision: the Companies are unable to pay their debts 25 With the cash flow test and factors in mind, I considered the evidence as to the current assets and liabilities of the Companies. I was satisfied that the Companies’ current assets do not exceed their current liabilities, for the following reasons: (a) A set of draft April 2022 Financial Statements for AAX Singapore30Foot Note 30×CWS at para 31; LAF-1 at para 62 and Tab 18.(the “draft AAX Singapore financial statements”) suggested that AAX Singapore was incapable of paying current liabilities using current assets. The draft AAX Singapore financial statements provided that AAX Singapore had current assets of $359,478 and current liabilities of $582,703 as of 30 April 2022,31Foot Note 31×LAF-1 at p 327.such that there was a shortfall of $223,225. (b) The AAX Group was no longer operating by mid-December 2022.32Foot Note 32×CWS at para 33; LAF-1 at para 14.The Companies’ business was defunct and there was no expectation of any net cash flow or income. (c) As of the time of these applications, the value of the Companies’ current assets was unknown, and there were no available assets to pay the liabilities of the Companies as they fell due.33Foot Note 33×CWS at para 32.The interim judicial manager was unable to locate any cash or assets to pay the liabilities of the Companies.34Foot Note 34×LAF-1 at para 61. (d) The former management of the Companies’ holding company, Atom Holdings, had allegedly absconded with the keys to the digital assets, purportedly valued at US$30m in cryptocurrency, of the AAX Group, and remained on the run from the Hong Kong authorities.35Foot Note 35×CWS at para 33; LAF-1 at para 17 and Tab 6 at p 101. (e) The Companies owed an unknown quantum of future debt to the creditors that the interim judicial manager had been unable to precisely locate, and were also liable for the fees of the interim judicial manager and his legal counsel.36Foot Note 36×LAF-1 at para 64. 26 I was thus satisfied that the Companies did not have any available assets to meet their current liabilities, and were unable to pay their debts.",
        "It was just and equitable to wind up the Companies": "27 Although I was already satisfied that I could order the winding up of the Companies for their inability to pay their debts, I also considered the alternative ground that the Companies had satisfied s 125(1)(i) of the IRDA that it was just and equitable that the Companies be wound up. I agreed that this ground was satisfied. The relevant law 28 The applicable principles, as discussed in the recent High Court decision ofTan YewHuat v Sin Joo Huat Hardware Pte Ltd and another matter[2023] SGHC 276 (“Tan YewHuat”) (at [18]) and in the Court of Appeal decision ofPerennial (Capitol) Pte Ltd and another v Capitol Investment Holdings Pte Ltd and other appeals[2018] 1 SLR 763 (“Perennial”) (at [82]), are that in determining whether to make a winding up order under s 125(1)(i) of the IRDA, the court applies the following two-stage test: (a) First, is it “just and equitable that the company be wound up”? The establishment of this statutory ground would invoke the court’s power to make a winding up order. (b) Second, at the relief stage, applying the court’s residual discretion, in light of all the relevant factors, including the utility and effect of a winding up order and the overall fairness and justice of the case, should the company be wound up? 29 The notion of unfairness is the foundation of the court’s jurisdiction to wind up a company under s 125(1)(i) of the IRDA (previously under s 254(1)(i) of the Companies Act (Cap 50, 2006 Rev Ed) (the “Companies Act”)) (seePerennialat [40]). While the words “just and equitable” are “words of the widest significance, and do not limit the jurisdiction of the Court to any case” (see the Court of Appeal decision ofChow KwokChuen v Chow Kwok Chi and another[2008] 4 SLR(R) 362 at [14], citing the English High Court decision ofInre Blériot Manufacturing Aircraft Company (Limited)(1996) 32 TLR 253 at 255), the “broad phraseology, however, does not give the courtcarte blanche”. Rather, it is “a jurisdiction that has to be exercised with caution, particularly where the making of such an order would have the effect of releasing the [claimant] from any obligation to comply with the scheme of things provided under the memorandum and articles of association” (seePerennialat [40]). The court must therefore “pay heed to the specific kind of unfairness that the just and equitable ground is meant to address” (seeTan YewHuatat [19]). 30 Accordingly, in the High Court decision ofGrimmett, Andrew and others v HTL International Holdings Pte Ltd (under judicial management) (Phua Yong Tat and others, non-parties)[2022] 5 SLR 991, Aedit Abdullah J set out a non-exhaustive list of the illustrative broad categories of cases which fall under the “just and equitable” jurisdiction to wind up a company (at [58]). They were broken down as follows: (a) [W]here the substratum of the company has been lost as the main objects for which the company was set up can no longer be achieved:GoodwealthTrading (CA)[[1990] 2 SLR(R) 691]; (b) where there is a deadlock in the management of a company:SeahChee Wan and another v Connectus Group Pte Ltd[2019] SGHC 228; (c) where the company is in truth a quasi-partnership, and there has been a breakdown of trust and confidence between the two groups of shareholders:Chong Kok Ming and another vRichinn Technology Pte Ltd and others[2020] SGHC 224; (d) where the company’s business had been carried on in a fraudulent manner: [Ma Wai Fong Kathryn v Trillion Investment Pte Ltd and others and another appeal[2019] 1 SLR 1046]; (e) where there is a loss of confidence in the directors on account of their lack of probity in the conduct and management of the company affairs:FooPeow Yong Douglas v ERC Prime II Pte Ltd[2017] SGHC 299; and (f) where a shareholder has been excluded from management in breach of an understanding by the other shareholders:ReIniaga Building Supplies (S) Pte Ltd[1994] 2 SLR(R) 416. My decision: it was just and equitable to wind up the Companies (1) The Companies had lost their substratum as their main objects could no longer be achieved 31 With the above principles in mind, I was of the view that it was just and equitable that the Companies be wound up as the main objects for which the Companies were set up could no longer be achieved. In this regard, a company’s substratum is the main object it was formed to achieve. Where a company is no longer able to carry on its main object, a member may apply for the company to be wound up as it would be unfair to hold the parties to the association when the main object of such association could no longer be achieved (see the Court of Appeal decision ofMa Wai Fong Kathryn v Trillion Investment Pte Ltd and others and another appeal[2019] 1 SLR 1046 (“Kathryn Ma”) at [63]). Another situation where a company has lost its substratum is “where the company is effectively dormant at the time of the application (contrary to what it was set up to do) and its finances are poor such that the company is no longer viable … [such that] it can be said that the company had stopped conducting the business it was set up to do and, given its poor financial state, there is no longer any reasonable prospect that the company will achieve its substratum” (seeKathryn Maat [64]). 32 In summary, the guiding principle in assessing whether a company should be wound up on the basis of the loss of its substratum is to determine whether there is unfairness in keeping an aggrieved, often minority, shareholder locked into a company which is no longer, or can no longer, carry out the objects and business it was set up to do (seeKathryn Maat [65]). 33 Applying the above tests to the facts before me, the main object of the Companies was the operation and management of the Atom Asset Exchange platform in Singapore as a means of trading in cryptocurrency. However, given that the AAX Group had ceased operations by mid-December 2022,37Foot Note 37×CWS at para 33; LAF-1 at paras 14 and 61.the Companies are effectively dormant. The finances of the Companies were also poor, as the assets of the Companies could not be located.38Foot Note 38×CWS at para 11.Therefore, there was no reasonable prospect that the Companies would be able to return to operating the AAX cryptocurrency trading platform. The main objects of the Companies therefore were incapable of achievement, and it would be just and equitable to wind up the Companies to free shareholders from the Companies. Therefore, an order winding up the Companies would be just and equitable on the basis of the loss of the Companies’ substratum. (2) The possibility of enhanced investigations may be a possible ground for the just and equitable winding up of a company 34 In arguing that the Companies should be wound up on just and equitable grounds, the Companies put forth a novel argument. They submitted that the court should focus on the interests of theunsecured creditors.39Foot Note 39×CWS at para 42.As such, winding up the Companies would promote the interests of the unsecured creditors in the following three ways:40Foot Note 40×CWS at para 42. (a) First, it would facilitate Mr Furler conducting, as the court-appointed liquidator instead of the interim judicial manager, large-scale, long-term multi-jurisdictional investigations into the affairs of the AAX Group. (b) Second, it would promote the recovery of assets from counterparty cryptocurrency platforms, such as Binance, as Binance has declined to freeze and turn over assets purportedly owned by the Companies without a court order,41Foot Note 41×LAF-1 at paras 36–37 and Tab 16.and a court-appointed liquidator would garner more cooperation from these companies. (c) Third, it would assist Mr Furler in ascertaining and identifying the creditors of the Companies42Foot Note 42×CWS at para 43.through investigations as the liquidator, as the customer records of the Companies are missing, and the customers are unaware of which entities they contracted with.43Foot Note 43×LAF-1 at para 51. 35 The Companies therefore submitted that it was in the interest of the unsecured creditors for the Companies to be wound up, such that Mr Furler could conduct investigations into the Companies’ affairs, recover assets to be distributed, and identify the creditors (the “enhanced investigations rationale”). 36 In advancing the enhanced investigations rationale, the Companies relied on the English High Court decision ofBell Group Finance (Pty) Ltd (inliq) v Bell Group (UK) Holdings Ltd[1996] BCC 505 (“Bell Group Finance”) as authority for the proposition that a company may be wound up where it is in the interests of the unsecured creditors to conduct investigations into the affairs of a company. In that case, the petitioner, Bell Group Finance (Pty) Ltd (“Bell Australia”), was an Australian company in liquidation and a creditor of Bell Group (UK) Holdings Ltd (“Bell UK”) (at 506). Prior to the insolvency of Bell UK, Bell UK had granted comprehensive securities over their properties and undertakings in favour of various syndicates of English and Australian banks (at 506–507). Bell Australia alleged that the directors of Bell UK had granted charges over the assets of the company in breach of their duty to act in the best interests of the company, and the banks’ knowledge of the directors’ breach allowed the charges to be avoided (at 507). One of the banks holding charges over Bell UK’s assets, Westpac Banking Corporation, had appointed administrative receivers over Bell UK, and these receivers were asserting legal professional privilege in relation to the documents of Bell UK (at 508). The petitioners therefore sought to wind up Bell UK, to enable a court-ordered liquidator to be appointed to investigate the grant of securities in favour of the banks. The court-appointed liquidator could then make their own determination of whether to assert privilege over the transaction documents and cooperate with the liquidator of Bell Australia (at 508–510 and 514). 37 Chadwick J ordered a winding up of Bell UK to enable a liquidator of Bell UK to investigate the grants of security. He held that (seeBell Group Financeat 512 and 514): In my view there is no doubt that the court has jurisdiction to make a winding-up order in circumstances in which the company has no assets and where the only purpose of the order would be to enable an investigation to take place into the company’s affairs. … In my view the question which the court has to ask in each case in which there are no assets is whether it is indeed just and equitable to make a winding-up order? It may well be just and equitable to make such an order in order to enable an investigation to take place. In circumstances in which I find that assets having a book value of some £353m are estimated to have nil realisable value, it seems to me that an investigation is undoubtedly called for. In those circumstances I am satisfied that it is just and equitable to make a winding-up order in this case so that a liquidator of BG (UK) can consider whether there is any advantage to the creditors in his or her liquidation in co-operation with the Australian liquidators. … 38 Notwithstanding the Companies’ reliance onBell Group Finance,the enhanced investigations rationale does not fall within any of the currently recognised categories of cases where the “just and equitable” limb is relied upon to wind up a company in Singapore insolvency law. Indeed, no Singapore court has accepted a need to conduct investigations as a ground for invoking the just and equitable jurisdiction of the court to wind up a company. 39 That said, the enhanced investigations rationale has been canvassed before the Singapore courts in other contexts. For example, in the High Court decision ofRCMAAsia Pte Ltd v Sun Electric Power Pte Ltd (Energy Market Authority of Singapore, non-party)[2020] SGHC 205, Tan Siong Thye J ordered the winding up of a company on the basis that the company was unable to pay its debts under s 254(1)(e) of the Companies Act (at [58]), and that the lack of probity in the conduct and management of the company’s affairs made it just and equitable that the company be wound up under s 254(1)(i) of the Companies Act (at [73]). On the subject of investigations, Tan J found that the fact that a liquidator could conduct investigations into disputed dealings, and take further action, if necessary, in the interests of the creditors, was a factor to consider in exercising his discretion to wind up a company (at [91]). These observations were not disturbed on appeal inSun ElectricCA. Similarly, in the High Court decision ofDB International Trust (Singapore) Ltd v Medora Xerxes Jamshid and another[2023] SGHC 83, the court held at [17] that one of the purposes of an insolvent liquidation is to “[allow] for an investigation into the company’s affairs by an independent and appropriately qualified person, especially in relation to the circumstances that led to the winding up”. This was said in the context of an application to remove a liquidator for failing to carry out his duties with sufficient vigour, failing to comply with his statutory obligations and therefore causing the creditors to lose confidence (at [79]). 40 It can therefore be seen that the enhanced investigations rationale has been found to be relevant to whether a company should be wound up, and how such liquidations should take effect. In my judgment, the need to empower a liquidator to conduct enhanced investigations for the benefit of unsecured creditors constitutes a sufficient ground to wind up a company on just and equitable grounds.",
        "The Companies should be wound up in light of the overall fairness and justice of the case": "41 Applying the relief stage of the two-stage test set out inTan YewHuatat [18] (as discussed above at [28]), I was of the view that, in light of all the relevant factors and the overall fairness and justice of the case, the Companies should be wound up. 42 First, the Companies had lost their substratum, were no longer operating, and were not expected to have a viable future stream of income. Second, the Companies’ debts and liabilities, although not clearly ascertained, were likely to be substantial, and liquidation would better enable the identification of an asset pool out of which to pay creditors. Third, no party had appeared before this court to allege that they would suffer prejudice by the winding up of the Companies, or to oppose the applications.44Foot Note 44×CWS at para 45.Fourth, Mr Furler appeared to be an appropriate person to be the liquidator, given his familiarity and working experience with the Companies, and his relationship with Quantuma, the liquidators of other companies within the AAX Group.45Foot Note 45×CWS at para 46. 43 I was therefore satisfied that the overall fairness and justice of the case justified the winding up of the Companies.",
        "Applicable statutory moratorium period": "44 As the Companies were in interim judicial management, an automatic moratorium period was triggered. Under s 95(1)(a) and s 95(1)(c) of the IRDA, no order may be made for the winding up of the Companies and no other proceedings may be commenced or continued against the Companies, except with the leave of the court, during the automatic moratorium period that arose after the lodging of a written notice of appointment of an interim judicial manager under s 94(5)(a) of the IRDA. 45 In the present case, under s 95(4) of the IRDA, this automatic moratorium period began from the date the Companies lodged written notices of appointment of Mr Furler as the interim judicial manager under s 94(5)(a). The period would end upon the appointment of a judicial manager, the rejection of the creditors’ resolution to place the company under judicial management, or the date on which the term of the interim judicial manager ended under s 94(6) of the IRDA. The last category was the relevant date for this application. 46 Under s 94(6) of the IRDA, the term of the appointment of the interim judicial manager ends on the earlier of the occurrence of either the expiry of 30 days after the appointment of the interim judicial manager, or such extension of that period as the Official Receiver may allow (s 94(6)(a) of the IRDA), or the appointment of a judicial manager, or the rejection of the creditors’ resolution to place the company under judicial management (s 94(6)(b) of the IRDA). In the present case, the Official Receiver granted three extensions to the period of interim judicial management for the Companies, for the following periods, with the final extension being from 20 September 2023 to 16 October 2023.46Foot Note 46×CWS at para 9 and p 25.As such, the automatic moratorium period that arose under s 95(4) of the IRDA would have ended on 16 October 2023. The question that arose at the hearing on 12 October 2023 was whether the court has the power to override the end date of 16 October 2023. 47 In this regard, I agreed with the Companies that the IRDA was silent as to whether the court has the power to end the statutory moratoria discussed above. For clarity, s 115(3)(d) of the IRDA, read with s 115(1)(e), would have permitted a creditor or member of the Companies to apply to the court to discharge the company from interim judicial management. However, the discharge of a company from interim judicial management is not expressly one of the conditions for ending the term of appointment of an interim judicial manager under s 94(6) of the IRDA. It was therefore arguable that the automatic moratoria periods only terminated upon the end of the period that the Official Receiver had extended the term of the interim judicial management to, namely, 16 October 2023. Consequently, out of caution, I granted leave for the claimants to amend their prayers such that the winding up orders would only take effect from 12.00am on 17 October 2023.",
        "Conclusion": "48 For all the reasons given above, I decided that the Companies themselves had the standing to, through the interim judicial manager, make these applications to wind themselves up under s 124(1)(a) of the IRDA. For completeness, I also found that the interim judicial manager would have had the standing to bring these applications in his own right under s 124(1)(h) of the IRDA. I was satisfied that I could order the winding up of the Companies based on s 125(1)(e) and s 125(1)(i) of the IRDA, on the alternate grounds that the Companies were unable to pay their debts or that it was just and equitable for the Companies to be wound up. For the reasons above, I exercised my residual discretion to order the winding up of the Companies with the consequential orders sought by the claimants. Goh YihanJudge of the High Court Chua Sui Tong and Gan Jhia Huei (Rev Law LLC) (instructed), Troy Doyle and Peter Madden (Gibson Dunn & Crutcher LLP) for the claimants; Janica Tan for the Official Receiver (Ministry of Law (IPTO))."
    }
}