{
    "case_title": "Mustaq Ahmad (alias Mushtaq Ahmad s/o Mustafa)vProvidentia Wealth Management Ltd and others",
    "ncitation": "[2023] SGHCF 53",
    "coram": "Mavis Chionh Sze Chyi J",
    "sections": {
        "Background facts": "3 The present dispute is the continuation of a long-running dispute between parties. Much of the background to their relationship is outlined inAyaz Ahmed and others vMustaq Ahmad (alias Mushtaq Ahmad s/o Mustafa) and others and other suits[2022] SGHC 161 (“Ayaz Ahmed vMustaq Ahmad”) at [7]–[40]. The facts that are material to the present case are as follows. 4 The Applicant is the son of Mr Mustafa s/o Majid Khan (“Mr Mustafa”) and his wife, Mdm Momina.2Foot Note 2×1st Affidavit of Mustaq Ahmad @ Mushtaq Ahmad s/o Mustafa dated 17 February 2023 (“MA1”) at para 5.Following Mdm Momina’s death sometime in 1956 or 1957,3Foot Note 3×MA1 at para 5; 1st Affidavit of Ayaz Ahmed dated 12 April 2023 (“AA1”) at para 12.Mr Mustafa married Mdm Asia (the 7th Respondent). The 2nd to 6th Respondents are children of Mr Mustafa and Mdm Asia.4Foot Note 4×MA1 at para 6. 5 The 2nd to 7th Respondents are all beneficiaries of the Estate alongside the Applicant.5Foot Note 5×MA1 at para 8. 6 Mr Mustafa passed away intestate on 17 July 2001.6Foot Note 6×MA1 at para 7.At the time of his passing, he was a shareholder of MMSCPL.7Foot Note 7×MA1 at para 7.Among other assets owned by Mr Mustafa are shares in Mustafa Air Travel Pte Ltd (“MAT”) (Ayaz Ahmed vMustaq Ahmadat [670]). 7 On 16 August 2021, the Syariah Court issued an inheritance certificate for the Estate, which was to be divided into 80 shares and split between parties according to the following proportions:8Foot Note 8×MA1 at para 9. (a) The Applicant: 14 out of 80 shares; (b) Ayaz Ahmed (the 2nd Respondent): 14 out of 80 shares; (c) Ishtiaq Ahmad (the 4th Respondent): 14 out of 80 shares; (d) Maaz Ahmad (the 5th Respondent): 14 out of 80 shares; (e) Asia (the 7th Respondent): 10 out of 80 shares; (f) Khalida Bano (the 3rd Respondent): 7 out of 80 shares; (g) Wasela Tasneem (the 6th Respondent): 7 out of 80 shares. 8 The Applicant’s application for the grant of letters of administration in relation to the Estate was granted on 24 November 2003.9Foot Note 9×MA1 at para 12.He extracted the grant of letters of administration on 28 January 2004.10Foot Note 10×MA1 at para 13. 9 On 8 December 2017, the 2nd to 7th Respondents commenced HC/S 1158/2017 (“Suit 1158”) against the Applicant and other parties.11Foot Note 11×MA1 at para 12.Suit 1158 was a minority oppression action alleging that the Applicant and his co-defendants in that suit had conducted the affairs of MMSCPL in a manner that was oppressive and unfairly prejudicial to the interests of the Estate as a minority shareholder of MMSCPL.12Foot Note 12×MA1 at para 13.At the same time, the 2nd to 7th Respondents also commenced HCF/S 9/2017 (“Suit 9”) against the Applicant. Suit 9 was a probate action alleging that the Applicant had breached his duties as administrator of the Estate. 10 Suit 1158 and Suit 9 were heard before me in the same trial, together with another related suit (HC/S 780/2018). At the conclusion of the trial, I gave judgment for the 2nd to 7th Respondents on the bulk of their claims in Suit 1158 (HC/JUD 590/2021). I foundinter aliathat the Estate was the legal and beneficial owner of 25.4% of the shares in MMSCPL. The Applicant and his wife (one of his co-defendants) were ordered to buy out the Estate 25.4% shareholding in MMSCPL at a price to be determined by an independent valuer.13Foot Note 13×MA1 at para 17; MA 1 at pp 32-40.I also gave judgment for the 2nd to 7th Respondents on their claims against the Applicant in Suit 9 (HCF/JUD 3/2021).Inter alia,I ordered that: (a) The letters of administration granted to the Applicant in relation to the Estate were to be revoked; (b) The letters of administration in relation to the Estate were to be granted to a professional third-party administrator; and (c) The Applicant shall give an account of his administration of the Estate on a wilful default basis.14Foot Note 14×MA1 para 15. 11 In respect of Suit 9, as parties were unable to agree on the professional third-party administrator to be appointed for the Estate, I made an order on 14 January 2022 appointing the 1st Respondent Providentia Wealth Management Ltd (“Providentia”) as the professional third-party administrator.15Foot Note 15×MA1 at para 20.Providentia issued its finalised letter of engagement on 26 May 2022 and by 31 May 2022 the letter had been signed by both the Applicant and the 2nd to 7th Respondents.16Foot Note 16×MA1 at para 22.Providentia was issued the letters of administration for the Estate on 26 December 2022.17Foot Note 17×MA1 at para 23. 12 The Applicant appealed against my decisions in Suit 9 and Suit 1158. The appeal has since been heard by the Appellate Division of the High Court, which has reserved judgement.",
        "Parties’ cases": "",
        "The Applicant": "13 The Applicant argues that the administrator of an estate should make an interim distribution of an estate’s assets as soon as practicable and that this should be done in the present case because the assets of the Estate exceed its liabilities.18Foot Note 18×Applicant’s Submissions dated 11 October 2023 (“AS”) at para 21.The Applicant makes the following claims: (a) There is no evidence and no basis for the Respondents’ assertions that the Applicant under-declared the value of the MMSCPL shares held by the Estate;19Foot Note 19×AS at paras 27 and 29. (b) There is no basis for the Respondents’ assertions that there will be difficulties with selling MAT’s shares in an open market;20Foot Note 20×AS at para 30. (c) There is no reason to oppose interim distribution just because the number of MMSCPL shares is in dispute,21Foot Note 21×AS at paras 31-33.or because there are alleged outstanding dividends.22Foot Note 22×AS at paras 34-38. (d) The Applicant’s account of the administration of the Estate has not been woefully inadequate.23Foot Note 23×AS at paras 39-41. 14 Second, the Applicant says he will be prejudiced if there is no interim distribution of the MMSCPL shares by virtue of all beneficiaries being deprived of these shares and the rights and privileges being associated with them.24Foot Note 24×AS at para 43.The Applicant claims that the 2nd to 7th Respondents will also be able to use their controlling share of the Estate to affect how the Applicant votes on behalf of the Estate as a shareholder of MMSCPL.25Foot Note 25×AS at para 46.Additionally, if the MMSCPL shares were to be distributed, the Applicant and his wife will collectively hold a majority stake in MMSCPL – which benefit he is currently being deprived of at grave personal cost.26Foot Note 26×AS at para 48. 15 Third, the Applicant claims that his application for interim distribution of the MMSCPL shares does not contravene the orders in Suit 9 because according to him, nothing in those orders precludes a distribution of the MMSCPL shares held by the Estate,27Foot Note 27×AS at para 53.and the beneficiaries of the Estate will still collectively be registered shareholders of 25.4% of the shares in MMSCPL.28Foot Note 28×AS at para 55.The Applicant maintains that his application is not filed in bad faith or for an improper purpose, because he has a legitimate interest in wanting to hold a majority stake.29Foot Note 29×AS at para 59.He further alleges that it is the 2nd to 7th Respondents who are instead improperly putting pressure on him.30Foot Note 30×AS at paras 61-72. 16 The Applicant seeks distribution of the Estate’s shares in MMSCPL in the following proportions: (a) The Applicant – 347,579 out of 1,986,170 shares; (b) Ayaz Ahmed – 347,580 out of 1,986,170 shares; (c) Ishtiaq Ahmad – 347,580 out of 1,986,170 shares; (d) Maaz Ahmad Khan – 347,580 out of 1,986,170 shares; (e) Asia – 248,271 out of 1,986,170 shares; (f) Khalida Bano – 173, 790 out of 1,986,170 shares; (g) Wasela Tasneem – 173,790 out of 1,986,170 shares.",
        "Providentia": "17 Providentia opposes the present application on the basis that distribution of the MMSCPL shares is premature at this juncture. 18 First, distribution is premature because there is no certainty that the Estate’s assets post-distribution will exceed its liabilities.31Foot Note 31×1st Respondent’s Written Submissions dated 11 October 2023 (“R1S”)This lack of certainty arises from: (a) additional estate duties that may be potentially payable;32Foot Note 32×R1S at para 16.and (b) uncertainty over the value and liquidity of the Estate’s shares in MAT, and possible additional legal expenses that may be incurred in recovering shares due to the estate.33Foot Note 33×R1S at paras 18-21. 19 Second, distribution is premature because the Applicant has yet to provide a complete account of his administration of the Estate. The current shareholding of MMSCPL has not yet been resolved and is in the midst of change.34Foot Note 34×R1S at para 27. 20 Third, there are outstanding dividends from the MMSCPL shares which ought to be payable to the Estate. It will be beneficial to the Estate and all beneficiaries for the issue of these outstanding dividends to be settled before the MMSCPL shares are distributed.35Foot Note 35×R1S at para 32. 21 Fourth, the distribution of MMSCPL’s shares – as prayed for by the Applicant – will be inconsistent with the Suit 1158 Order, which stated that the Applicant and his wife were to buy out the Estate’s shareholding in MMSCPL at a price to be determined by an independent valuer. The status of this order in in abeyance pending appeal.36Foot Note 36×R1S at para 34.Further, Providentia submits that the scope of its appointment under the court order encompasses it having oversight over MMSCPL. Removing its oversight from MMSCPL may facilitate further oppressive action by the Applicant.37Foot Note 37×R1S at para 35.To the extent that the Applicant argues that he has a right to be registered himself as the holder of his shares, this will only arise after the discharge of all liabilities of the Estate.38Foot Note 38×R1S at para 37. 22 Fifth, there is no urgency to have the MMSCPL shares distributed at this juncture. Providentia points out that it was only granted the letters of administration for the Estate less than a year ago. Prior to Providentia’s appointment as the professional third-party administrator, the Applicant was the administrator of the Estate for 17 years between 2004 and 2021, during which time he clearly saw no need to distribute the MMSCPL shares to the beneficiaries of the Estate. The Applicant’s own conduct over the 17-year period of his term as administrator thus contradicts his present argument that he is being subject to grave prejudice as a result of non-distribution of the MMSCPL shares.39Foot Note 39×R1S at para 41. 23 Finally, Providentia objects to having been named as a party in OSP 2 in its personal capacity, rather than in the capacity of administrator of the Estate.40Foot Note 40×R1S at para 42.",
        "The 2nd to 7th Respondents": "24 The 2nd to 7th Respondents point out that the Applicant’s position in the present application is inconsistent with his position on appeal from my decision in Suit 1158. In his appeal, the Applicant has asserted that he is the sole and beneficial owner ofallthe MMSCPL shares held by the Estate.41Foot Note 41×2nd to 7th Respondents’ Submissions dated 11 October 2023 (“R2S”) at paras 39-41. 25 More fundamentally, the 2nd to 7th Respondents argue that distribution of the MMSCPL shares will constitute a breach of the Suit 1158 Order.42Foot Note 42×R2S at para 20.This order unambiguously provided43Foot Note 43×R2S at para 24.that the Estate shall continue to be a registered shareholder of 25.4% of the shares in MMSCPL until the date that Mustaq and his wife buy out the Estate’s shareholding.44Foot Note 44×R2S at para 22.The 2nd to 7th Respondents also note that the majority stake which the Applicant and his wife will collectively acquire as a result of the proposed distribution will undermine the very purpose of the Suit 1158 Order, which was to prevent the Applicant from re-acquiring a majority stake pending the completion of the buyout.45Foot Note 45×R2S at paras 27-38. 26 Further, the 2nd to 7th Respondents argue that the application should be dismissedinliminebecause the Applicant does not even argue – much less, demonstrate – that there has been an improper exercise of discretion by Providentia, which is the only basis for intervention in an administrator’s decision.46Foot Note 46×R2S at paras 46-48.In any event, the Applicant is wrong to claim that the assets of the Estate will exceed its liabilities post-distribution, because this is based on his own disputed account of the Estate’s assets.47Foot Note 47×R2S at para 54. 27 Finally, the 2nd to 7th Respondents argue that the present application has been filed in bad faith, for the collateral purpose of enabling the Applicant and his wife to obtain a majority shareholding in MMSCPL, and thereby to obstruct Providentia’s administration of the Estate.48Foot Note 48×R2S at para 58.According to the 2nd to 7th Respondents, the filing of the application was timed so as to enable Mustaq to block the appointment of new auditors for MMSCPL and the holding of any Annual General Meeting or Extraordinary General Meeting.49Foot Note 49×R2S at para 59.",
        "My decision": "28 In considering OSP 2, it is pertinent first to have regard to the context in which this application has been made. As I alluded to earlier, the Applicant was the previous administrator of the Estate between 2004 and 2021. During this 17-year period, the Applicant did not effect interim distribution of any of the Estate’s shares in MMSCPL, or indeed, of any of the assets of the Estate. The Applicant has not put forward any evidence that he ever attempted to make such a distribution. In bringing OSP 2, the Applicant now argues that Providentia, having been granted the letters of administration in December 2022, is in breach of its duties as administrator for not making an interim distribution within less than a year. 29 I turn to consider the application proper.",
        "The applicable legal principles": "30 A trustee’s power to make interim distributions (that is, before the administration of the estate is complete) stems from the law of assent. An assent is an acknowledgement by a trustee that an asset of the deceased is no longer required for the payment of debts of the estate, funeral expenses or general pecuniary legacies:SeahTeong Kiang v Seah Yong Chwan[2015] 5 SLR 792 at [25]. Assent may be given notwithstanding that there are debts or other liabilities still outstanding:GDR and another v GDLand others[2022] SGHC 30 (“GDR”)at [30]–[36]. 31 InGDR, Philip Jeyaretnam J was concerned with the question of whether the annual maintenance which a testator had provided for his daughters was to be drawn from gifts identified in the will or constituted separate and additional pecuniary legacies. The executrices in that case denied that they had assented to the payment of a sum of $115,000 claimed by the daughters.Inter alia,the executrices contended that there could be no assent in respect of any part of the residuary estate prior to ascertainment of the entire residue, apparently because they took the view that ascertainment required “first meeting all expenses or at least determining in advance every last dollar of potential expenses”. Jeyaretnam J rejected this contention, noting that an executor “may assent to part of a residuary gift without assenting to the whole”. As he explained: 39   There are several reasons why the law promotes the early distribution of parts of the residuary estate. These reasons include meeting the needs and interests of the residuary beneficiaries and the efficiency of putting assets or funds back to use and circulation in the economy. …… 45   When executors assent in respect of a legacy or of a part of the residue they should be satisfied that the transferee is entitled to it and that a valid receipt can be obtained, as well as that the estate has sufficient funds to meet any remaining liabilities after that conveyance or distribution. An assent may be given notwithstanding that there are debts or other liabilities still outstanding: seeCommissioner of InlandRevenue v Smith[1930] 1 KB 713, at 737perLawrence LJ. Those outstanding debts or liabilities need not be fully determined, so long as the executors make a reasonable reserve for them. 46There is an element of discretion for executors in assessing whether and when to assent in respect of any assets prior to completion of administration. However, delaying distribution of an estate where there is sufficient value and liquidity to meet liabilities is a breach of duty that has consequences.The traditional consequences lie in removing the executor at the suit of the beneficiaries or an action for an account. The court has also implied assent from acts or communications of executors in relation to specific assets and in other circumstances presumed assent, on the principle that what ought to be done is presumed to have been done, in order that the beneficiary then have the right against the executor turned trustee to require vesting or transfer of the legal title in or to himself. Taking this to a logical conclusion, the court in the Canadian case ofReznick v Matty[2013] BCSC 1346 compelled the delinquent executor to give an assent in relation to part of the residue and, in the same order, directed a further interim distribution of the residue.The corollary of the obligation to complete the administration of the estate without delay is that an executor should not withhold assent in respect of any asset except for good reason. [emphasis added] 32 InGDR, Jeyaretnam J found that on the evidence before him, there had plainly been an assent by the executrices in respect of the sum claimed. As such, it was not necessary for him to consider whether the executrices had shown “good reason” for withholding assent. 33 InReznik v Matty[2013] BCSC 1346 (“Reznik”), the Canadian case cited by Jeyaretnam J at [46] ofGDR, an application was brought by three out of four residuary beneficiaries for an order directing the distribution of $15,000 to each of them. The executor was the fourth residuary beneficiary. The British Columbia Supreme Court foundinter aliathat the executor had, by the time of the application, already been administering the estate for over a decade; that there was significant value and liquidity in the estate; and that there were no significant outstanding or anticipated costs. On the evidence adduced, the court held that the executor had not shown just cause to refuse to make the distribution sought and that his assent to the distribution should be compelled. 34 InParson v McGovern[2014] O. J. No. 1811 (“McGovern”), another Canadian case, the court was concerned with an application by a one-half beneficiary of an estate for an order that the trustees of the estate make a further interim distribution. In that case, the estate trustees had decided not to make any further interim disbursement until they had passed their accounts, as the applicant beneficiary had objected to the accounts presented by the trustees and had made allegations of negligence against them. In holding that the trustees should not be compelled to make a further interim distribution, the Ontario Supreme Court held (at [41]) that the following factors should be considered by the court when deciding whether to order estate trustees to make an interim distribution to the beneficiaries: (a) Whether there was deadlock between the estate trustees (deadlock being a “strong factor justifying a court to exercise its discretion as to what interim distribution was fair and appropriate in the circumstances”); (b) Whether the estate trustees had acted withmalafides; (c) Whether the estate trustees had failed to exercise their discretion to make an interim distribution; (d) Whether the estate trustees had behaved unreasonably or breached their fiduciary duty of good faith and fairness to the beneficiaries; and (e) Whether a beneficiary would suffer undue prejudice if an interim distribution was not made. 35 InMcGovern, deadlock among the estate trustees was not an issue. On the facts, the court found (at [41]) that the estate trustees were not guilty ofmala fidesand that they had not refused to exercise their discretion but rather, had exercised their discretion and decided not to make a further distribution until the court had reviewed their conduct and accounting. The court was further satisfied that the trustees’ decision not to make a further distribution until they had passed their accounts was reasonable in light of the allegations of negligence and potential legal action they were facing from the applicant beneficiary and the objections being raised to their accounts. The court also found that there was no evidence of any undue prejudice to the applicant beneficiary other than that he had chosen to purchase a house and had thereby taken on a mortgage loan. 36 The factors articulated by the court inMcGovernwere applied by Hon Lok J in the Hong Kong case ofLi Kin Yanand another v Li Lim Chi Dorothy, The Sole Administratrix of the Estate of Li Wan Lung, Deceased[2017] HKCU 403 (“Li Kin Yan”). InLi Kin Yan, the applicant beneficiaries sought interim distribution of HK$8m to each of the three beneficiaries, out of an available fund of around HK$40m belonging to the estate. The respondent administrator thought it inappropriate to make such an interim distribution as the estate had outstanding claims against the applicant beneficiaries involving substantial sums of money. Applying the factors set out inMcGovern, Hon Lok J agreed with the respondent administrator that it was inappropriate to make an interim distribution. He noted (at [56]) that the outstanding claims which the estate had against the applicant beneficiaries were “serious claims”; and that if the estate succeeded in those claims, there was a real possibility that the applicants might have to pay back the respective sums of HK$11.1 million and US$12 million to the estate – which would mean that the size of the estate would amount to about HK$145 million (including the existing fund of HK$40 million). In the circumstances, it was prudent of the respondent administrator not to make interim distribution out of the existing fund of HK$40 million at that juncture. The applicant beneficiaries’ argument that the estate’s claims against them were “hotly in dispute” - and that they had evidence to support their position – was rejected as it was “common ground that the court should not conduct a microscopic examination of the merits of [those] claims” (at [59]).",
        "There are good reasons for Providentia to refuse interim distribution": "37 In the following case, the Applicant has not allegedmala fideson Providentia’s part; nor, in any event, has he produced any evidence ofmala fides.Further, the Applicant is not alleging that Providentia has failed to exercise its discretion to make an interim distribution: rather, he disagrees with the decision taken by Providentia not to make an interim distribution at this stage. 38 Having reviewed the evidence, I am satisfied that there are good reasons for Providentia to withhold assent (GDRat [46]),evenassuming that the Estate has sufficient value and liquidity to meet its liabilities. 39 First, and most importantly, any interim distribution of the MMSCPL shares at this stage will result in a breach of the Suit 1158 Order. The Suit 1158 Order clearly stipulates that until the Applicant and his wife buy out the Estate’s shareholding in MMSCPL, the Estate shall continue to be a registered shareholder holding 25.4% of the shares in MMSCPL. 40 On the plain wording of the Suit 1158 Order, interim distribution of the MMSCPL shares will contravene the Suit 1158 Order because it will no longer be the Estate which is the registered shareholder of its shares in MMSCPL, but rather, the individual beneficiaries. The Applicant’s argument that the Suit 1158 Order is not contravened because the beneficiaries of the Estate will still be “collectively be registered shareholders” of those shares is specious50Foot Note 50×AS at para 55.: the Estate and its beneficiaries are legally distinct entities, and the terms of the Suit 1158 Order clearly contemplate only the former. 41 Equally important is thepurposeof the Suit 1158 Order. It is not disputed that interim distribution of the Estate’s shares in MMSCPL will lead to the Applicant and his wife collectively obtaining a majority stake in the company where they otherwise would not have one.51Foot Note 51×AS at para 48, R2S at para 59.InAyaz Ahmed vMustaq Ahmad, I found that the Applicant and his wife had engaged in multiple forms of oppressive conduct in disregard of the interests of minority shareholders, who included the 2nd to the 7th Respondents herein (seeeg[429]). The order for the Applicant and his wife to buy out the Estate’s shares in MMSCPL was precisely to prevent such oppression from recurring; and the order for the Estate to continue to be a registered shareholder holding 25.4% of the shares pending the buyout was to prevent the Applicant and his wife from re-acquiring a majority position in MMSCPL pending the buyout. Interim distribution at this stage will put the Applicant back in a position whereby he and the parties aligned with him will be able to resume oppressive acts towards the 2nd to 7th Respondents prior to the buyout of the latter’s shares in MMSCPL. This will defeat the purpose of the Suit 1158 Order. 42 The fact that the interim distribution which the Applicant seeks will result in breach of the Suit 1158 Order is reason enoughper seto dismiss OSP 2. Nevertheless, in the interests of completeness, I should make it clear that the other reasons cited by the Respondents for opposing any interim distribution are also valid. The second reason relates to the Applicant’s case in Suits 9 and 1158 below and on appeal. In the trial of the two suits before me, the Applicant asserted that he was the legal and beneficial owner ofallthe shares of MMSCPL. This continues to be his position in the Appellants’ Case he filed on 10 April 2023 to the Appellate Division of the High Court: he has sought, on appeal, a declaration that he is the legal and beneficial owner of all the MMSCPL shares registered to the Estate.52Foot Note 52×1st Affidavit of Ayaz Ahmad dated 12 April 2023 at p 670; R2S at para 39.This position is evidently inconsistent with the stance he adopts in the present application, which is that the MMSCPL shares held by the Estate should be distributed to the various beneficiaries. Given that the outcome of the appeal is not yet known, I agree with the Respondents that it will be premature for Providentia to make the interim distribution demanded by the Applicant. 43 Third, the Applicant cannot be said to suffer any prejudice as a result of no interim distribution being made. His argument that he is being “deprived” of a “rightful majority stake in MMSCPL”53Foot Note 53×AS at para 48.is misconceived, given that the Suit 1158 Order explicitly prevents him from exercising this notional majority stake pending the buyout of the Estate’s shares. His other argument that beneficiaries of the Estate at large are prejudiced by being “forced” to act as a “bloc” under the Estate54Foot Note 54×AS at para 46.is not only devoid of substance, but is in any event plainly contradicted by his own conduct in failing to effect any interim distribution during his 17-year tenure as administrator. Having for all intents and purposes been content to have the Estate vote as a bloc for the last 17 years, he has no basis for now claiming that this state of affairs has suddenly become intolerably prejudicial to all beneficiaries. 44 For completeness, I also reject the Applicant’s argument that Providentia has – in exercising its discretion – taken into account irrelevant considerations. 45 The Applicant has identified two areas in which Providentia has purportedly taken into account irrelevant considerations: first, in considering potential difficulties in selling MAT’s shares in an open market, and second, in considering that the Estate may be owed dividends arising from its shareholding in MMSCPL.55Foot Note 55×AS at paras 30 and 34.I reject the Applicant’s arguments on both counts. The first consideration is in my view clearly relevant, given that MAT is a private company, and Providentia must be satisfied that sufficient liquid funds will be available from the sale of their shares to meet potential liabilities. Although the Applicant has put forward various suggestions as to why the MAT shares should not be difficult to sell,56Foot Note 56×AS at para 30.thepotentialdifficulty of selling the MAT shares remains a relevant consideration for Providentia. I also agree with Providentia that the second consideration is relevant. Given that Providentia’s duty as an administrator is to “call in” all the assets of the Estate, it is reasonable for Providentia to settle the issue of the outstanding dividends instead of having each individual beneficiary raise a claim on their own behalf.57Foot Note 57×R1S at para 32. 46 I add that I do not find it necessary to come to any firm conclusion as to whether the Estate’s assets are sufficient to pay off its outstanding liabilities. Even if this were the case, as I have pointed out, interim distribution of the Estate’s MMSCPL shares will result in a breach of the Suit 1158 Order and is not therefore permissible. 47 Given the findings I set out above, I also do not find it necessary to come to any firm conclusion on the 2nd to 7th Respondents’ contention that OSP 2 was filed in bad faith and for a collateral purpose.",
        "Conclusion": "48 OSP 2 is dismissed. Having dismissed OSP 2, it is also not necessary for me to consider whether the application was rightly brought against Providentia in its personal capacity instead of in its capacity as the administrator of the Estate. 49 I will hear parties on costs.   Mavis Chionh Sze ChyiJudge of the High Court Tiong Teck Wee, Jayakumar Suryanarayanan and Shawn Ang De Xian (WongPartnership LLP) for the applicant; Koh Li Qun, Kelvin (Xu Liqun) and Uday Duggal (TSMP Law Corporation) for the first respondent; Jaikanth Shankar, Tan Ruo Yu, Wong Zi Qiang, Brian and Golovkovskaya Irina (Davinder Singh Chambers LLC) (instructed), Darshan Singh Purain, Avtar Ranee Kaur Purain and Vanisha Ishwar Chandiramani (Darshan & Teo LLP) for the second to seventh respondents."
    }
}