{
    "case_title": "Public Prosecutor vKong Swee Eng",
    "ncitation": "[2023] SGHC 232",
    "coram": "Kannan Ramesh JAD",
    "sections": {
        "Introduction": "1 This was an appeal by the Prosecution against the decision of a District Judge (“the Judge”) to acquit the respondent of all charges proceeded against her. Previously, inPublic Prosecutor v Kong Swee Eng[2022] SGHC 6 (“Kong Swee Eng (Conviction)”), I allowed the appeal with respect to all but two of the charges. I subsequently sentenced the respondent to 41 months’ imprisonment delivering brief oral grounds then. These are my detailed grounds of decision on sentence. 2 The respondent, Ms Kong Swee Eng, was a director of Rainbow Offshore Supplies Pte Ltd (“Rainbow”). She was charged with 11 charges of giving gratification to several personnel in Jurong Shipyard Pte Ltd (“JSPL”), of which ten were proceeded with at trial. In my grounds of decision on conviction inKong Swee Eng (Conviction), I found her guilty on the 1st, 2nd, 3rd, 4th, 5th, 6th, 8th and 11th charges. I dismissed the appeal as regards the 7th and 10th charges. The 1st and 2nd charges (“the Golden Oriental Charges”) involved the respondent giving two relatively senior members of JSPL’s procurement department at the material time, Mr Tan Kim Kian (“Mr Tan”) and Mr Chee Kim Kwang (“Mr Chee”), the opportunity to purchase shares in Golden Oriental Pte Ltd (“Golden Oriental”), a company incorporated in Singapore, in anticipation of a listing of Golden Oriental shares: see [42] below andKong Swee Eng (Conviction)at [13]. Mr Chee and Mr Tan invested S$300,000 and S$200,000 respectively in Golden Oriental shares. 3 The 11th charge (“the Lau Charge”) involved the respondent giving Mr Lau Kien Huat (“Mr Lau”), a JSPL engineer at the material time, a job as a project manager in a company, DMH Marine Solutions Pte Ltd (“DMH”), which she was affiliated with. The 4th, 5th, 6th and 8th charges (“the Chan and Ng Charges”) involved the respondent giving various gifts, including holiday trips, to Mr Chan Chee Yong (“Mr Chan”) and Ms Ng Poh Lin (“Ms Ng”), who were husband and wife working in JSPL’s procurement department at the material time. The 3rd charge (“the Koay Charge”), involved the respondent paying for a holiday trip made by Mr Koay Chin Hock @ Adam Abdullah Koay (“Mr Koay”) and his wife and daughter. Mr Koay was a deputy general manager in JSPL’s procurement department at the material time.",
        "The procedural background": "4 The respondent contended at trial that there was a “special relationship” between her and key personnel in JSPL that served as a defence to all the charges. As a result of the “special relationship”, Rainbow was essentially guaranteed JSPL’s custom. Hence, the respondent argued that it was unnecessary for her to have given gratification to anyone to advance the business interests of Rainbow. 5 The Judge below acquitted the respondent on all the charges on the basis of the “special relationship” defence. He found that the respondent had discharged her evidential burden in respect of the “special relationship” defence and thus the evidential burden had shifted to the Prosecution to rebut it:Public Prosecutorv Kong Swee Eng[2020] SGDC 140 (“Kong Swee Eng (DC)”) at [31]. The Judge found that the Prosecution had failed to rebut the “special relationship” defence, and thus there was reasonable doubt on themens reafor all the charges:Kong Swee Eng (DC)at [83] and [85]. 6 On appeal, I found that the “special relationship” was inherently incredible. Several factors supported this conclusion: (a) it had only been raised at trial; (b) the respondent was not consistent on its existence; (c) it was completely unclear as to how the “special relationship” worked in practice; and (d) the existence of the “special relationship” was not supported by the documentary evidence relied upon and was plainly contradicted by some of the evidence adduced at trial. Hence, applyingMuhammad Nabill bin Mohd Fuad v Public Prosecutor[2020] 1 SLR 984 (at [71]), I held that the respondent did not discharge her evidential burden and properly put into issue the existence of the “special relationship”:Kong Swee Eng (Conviction)at [54], [56] and [78]. 7 As the respondent did not discharge her evidential burden on the existence of the “special relationship”, I further held that it was not the Prosecution’s burden to call Mr Wong Weng Sun (“Mr Wong”), JSPL’s Managing Director at the material time, to rebut the existence of the “special relationship”:Kong Swee Eng (Conviction)at [78]. Despite Mr Wong and his investigative statements being offered to the respondent by the Prosecution, and the relevance of his evidence to the existence of the “special relationship” being apparent, the respondent declined to call him. I subsequently described this as a considered decision on her part: see [9] below. 8 As a result of the respondent’s failure to discharge her evidential burden on the existence of the “special relationship”, it was not relevant in assessingmens reaand was not taken into account. I allowed the Prosecution’s appeal in part in respect of the 1st, 2nd, 3rd, 4th, 5th, 6th, 8th and 11th charges and convicted the respondent accordingly. 9 Subsequently, post-conviction, the respondent filed an application in Criminal Motion No 105 of 2021 (“the 394H application”) under s 394H of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (the “CPC”) for leave to make an application to review the conviction. Central to the 394H application were two statements allegedly recorded from Mr Wong in October 2021 and November 2021 (individually as described and collectively as “the 2021 Statements”). It was apparent that the 394H application was a response to my conclusion that the respondent had failed to discharge her evidential burden on the existence of the “special relationship”. The October 2021 statement sought to establish and explain the existence of the “special relationship”. The November 2021 statement described JSPL’s procurement decision to award a bid to DMH and detailed instances where Mr Wong had asked the respondent to help train personnel in JSPL’s procurement department. I summarily dismissed the 394H application inKong Swee Eng v Public Prosecutor[2022] 5 SLR 310 (“Kong Swee Eng (CM 105)”). I held that although the evidence in the 2021 Statements was available to the respondent at the material time and its importance clear to her, she made a considered decision not to adduce it at trial:Kong Swee Eng (CM 105)at [18], [19] and [31]. 10 Following the dismissal of the 394H application, the respondent filed an application, Criminal Motion No 28 of 2021 (“CM 28”) under s 397(1) of the CPC, seeking leave to refer questions of law of public interest to the Court of Appeal. The question in relation to which leave was sought (“the Question”) was as follows (Kong Swee Eng v Public Prosecutor[2022] 2 SLR 1374 (“Kong Swee Eng (CM 28)”) at [13]): In the event where a defence has been raised by an accused person but the Prosecution elects not to call a material witness central to disproving that defence, whether an appellate Court should reverse an acquittal without exercising its powers under section 392 of the Criminal Procedure Code 2010 to hear the evidence of that material witness. 11 The Court of Appeal observed that the answer to the Question depended on whether the defence raised by the respondent was credible and capable of raising reasonable doubt as to the Prosecution’s case:Kong Swee Eng (CM 28)at [22]. In line with the decision inKong Swee Eng (Conviction),the Court of Appeal held that the respondent’s defence was not such a defence. 12 The Court of Appeal noted that the respondent’s true complaint in CM 28 was that the conclusion that the “special relationship” was inherently incredible was incorrect, or at least should have been arrived at only after hearing Mr Wong’s evidence:Kong Swee Eng (CM 28)at [24]. However, to call into question this conclusion would have required an appeal against my decision allowing the Prosecution’s appeal. As no appeal lay to the Court of Appeal from a decision of the General Division of the High Court exercising appellate criminal jurisdiction in an appeal from the State Courts, CM 28 was a backdoor appeal and an abuse of process:Kong Swee Eng (CM 28)at [28]–[30]. Accordingly, CM 28 was dismissed by the Court of Appeal.",
        "Wong’s Dec 2022 Statement": "13 The procedural backdrop above is relevant to an important issue that arose at the sentencing stage. In her submissions on sentence, the respondent sought to adduce and rely upon a further signed statement from Mr Wong dated 15 December 2022 (“the Dec 2022 Statement”). The essence of the Dec 2022 Statement was to explain an alleged Strategic Supplier Arrangement (“the SSA”) between JSPL and Rainbow under which Rainbow was supposedly designated a favoured supplier and given preferential treatment in JSPL’s procurement process. The respondent relied on the Dec 2022 Statement to demonstrate that the gratification she gave did not lead to material contravention of JSPL’s procurement process. This was because Rainbow already enjoyed preferential treatment by reason of the SSA. Accordingly,noharmwas caused to JSPL, andno benefitwas enjoyed by the respondent as a result of the gratification. These were relevant considerations in determining sentence under the sentencing framework inGoh Ngak Eng v Public Prosecutor[2022] SGHC 254 (“GohNgak Eng”), which parties accepted was the relevant sentencing framework. 14 The Dec 2022 Statement was key to the respondent’s overarching submission in mitigation that by reason of the absence of harm to JSPL and benefit enjoyed by her, a custodial sentence was not warranted and a fine would suffice. I had significant concerns over the respondent’s reliance on the Dec 2022 Statement. These principally related to whether allowing the respondent to adduce evidence on the SSA by relying on the Dec 2022 Statement would (a) re-open issues that were relevant to the respondent’s conviction, and (b) introduce evidence that was shut out pursuant to the dismissal of the 394H application. 15 As to the first, it was apparent that the respondent’s overarching argument in mitigation that there was no harm to JSPL and no benefit to the respondentby reason of the SSArested on the court accepting that there was in fact a SSA as alleged. As set out in the procedural background above, this was an issue, framed as the “special relationship”, that was before the Judge at trial and indeed before me on appeal. The “special relationship” was for all intents and purposes the same as the SSA described in the Dec 2022 Statement. The respondent relied, at trial and on appeal, on the “special relationship” between JSPL and Rainbow to assert that she did not have the relevantmens rea. However, the respondent failed to discharge the evidential burden on the existence of the “special relationship” which she might have attempted to do by adducing evidence from Mr Wong. As noted above, she did not do this despite being offered Mr Wong and his investigative statements by the Prosecution. Having failed to discharge her evidential burden, the “special relationship” was not taken into consideration in assessing the respondent’smensrea. This being the case, allowing the respondent to adduce evidence through the Dec 2022 Statement at the sentencing stage on the SSA would permit the respondent to re-open an issue that was relevant if not critical to her conviction. This seemed an abuse of process as it offered the opportunity to challenge the respondent’s conviction. 16 As to the second, the dismissal of the 394H application meant that the 2021 Statements were not admitted in evidence. In other words, Mr Wong’s evidence on the “special relationship” was not admitted. As noted above at [9], the 394H application was dismissed on the basis that Mr Wong’s evidence on the “special relationship” was available to the respondent at the material time and she had every opportunity to adduce it. Yet, she made a considered decision not to call Mr Wong. Accordingly, allowing essentially the same evidence to be adduced at the sentencing stage seemed an abuse of process as it circumvented the dismissal of the 394H application. 17 I posed these concerns to counsel for the respondent during his oral submissions on sentence. Counsel for the respondent accepted that the respondent was trying to “sail close to the wind” in seeking to rely on the Dec 2022 Statement. I understood this as a candid acknowledgment of the concerns I have described above. Nonetheless, counsel for the respondent invited me to exercise the power under s 228(5)(a) of the CPC to call for a hearing to determine the truth of the evidence set out in the Dec 2022 Statement. In essence, I was being invited to determine whether the SSA existed between JSPL and Rainbow on the basis of the Dec 2022 Statement and thereby to re-open the settled question of whether a “special relationship” existed. Counsel for the respondent’s response was clearly unsatisfactory as it underscored the very concerns that I had posed to him and invited him to address. I was therefore not persuaded by the respondent’s arguments and declined to exercise the power under s 228(5)(a) of the CPC. The Dec 2022 Statement was therefore not taken into account in determining sentence. I shall expound upon my reasons later in these grounds. 18 But before I do that, for completeness, I set out the Prosecution’s position on the Dec 2022 Statement. First, the Prosecution objected to the respondent’s reliance on the Dec 2022 Statement as it was not adduced at trial or on appeal and therefore had not been properly admitted as evidence. Second, the Prosecution pointed out that the respondent had already attempted to adduce the 2021 Statements in the 394H application which had been dismissed. The Dec 2022 Statement was a similar effort to introduce untested evidence from Mr Wong which should be rejected. However, the Prosecution accepted that I had the discretion under s 228(5)(a) of the CPC to call for a hearing.",
        "The applicable law on s 228(5)(a)of the CPC": "19 Generally, there is no rule which precludes adducing new evidence that is relevant to sentencing considerations at the sentencing stage:Public Prosecutor v Chum Tat Suan and another[2015] 1 SLR 834 (“Chum Tat Suan”) at [41]. Section 228(5)(a) of the CPC encapsulates in statutory form the concept of a Newton hearing:Chum Tat Suanat [47]. 20 Section 228(5) provides: Address on sentence, mitigation and sentence 228.— … (5)  After the court has heard the plea in mitigation, it may — (a) at its discretion or on the application of the prosecution or the accused hear any evidence to determine the truth or otherwise of the matters raised before the court which may materially affect the sentence; and (b) attach such weight to the matter raised as it considers appropriate after hearing the evidence. 21 This provision enables the court to hear and consider new evidence that may materially affect sentence. Further, it applies to a case where the accused pleads guilty and a case where the accused is convicted after claiming trial. Hence, counsel for the respondent relied on s 228(5)(a) to request the court to call for a post-conviction hearing to determine the truth of the evidence set out in the Dec 2022 Statement,ie,whether there was a SSA between JSPL and Rainbow. 22 However, a Newton hearing is already an exception rather than the norm for cases where the accused has pleaded guilty. This point assumes greater force where the accused has claimed trial and given evidence:Chum Tat Suanat [50]. The sole purpose of a Newton hearing is to resolve difficult and disputed questions of fact that are material to the determination of sentence and which the accused had no or insufficient opportunity to address earlier: seeNg Chun Hian v Public Prosecutor[2014] 2 SLR 783 at [24] andChum Tat Suanat [82]. It is not a further opportunity for the accused, or more accurately the convicted person, to adduce evidence to contradict or cast doubts on the conviction:Chum Tat Suanat [50]. Thus, the relevant question is in what circumstances is it permissible to consider new evidence at the sentencing stage in a post-conviction hearing ordered pursuant to s 228(5) of the CPC (“a post-conviction Newton hearing”)? 23 In the context of s 33B(2)(a) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”), Chao Hick Tin JA (as he then was) described at [53] ofChum Tat Suan, four situations in which a post-conviction Newton hearing would be unnecessary and should not be called. The four situations are as follows: (a) where the accused’s position on the disputed fact is “absurd or obviously untenable”;(b) where the disputed fact bears no relation to sentencing;(c) where the new evidence sought to be adduced relates directly to conviction; and(d) where the specific issue of the accused’s role in transporting, delivering or otherwise moving the drugs was in issue at trial, and consequently, evidence was already adduced on the issue. 24 I note that inChum Tat Suan,Woo Bih Li J and Tay Yong Kwang J (as they then were) issued a concurring judgment in which they largely agreed with Chao JA’s judgment, but expressed their reservations on Chao JA’s view that even where an accused’s primary defence at trial was inconsistent with being a courier, the accused might in certain circumstances give evidence at the sentencing stage on whether he was a courier:Chum Tat Suanat [77] and [79]. However, it is pertinent that they did not disagree with the four situations described by Chao JA. 25 Situation (c) at [53] ofChum Tat Suanapplies in the present case. Situation (d), though expressed in relation to the MDA, might arguably be said to apply. The essence of situation (d) is that the issue raised at the sentencing stage was before the court at trial and evidence was adduced on it. Before addressing the reasons why these situations are relevant to the present case, I observe that the rationale for refusing to call a post-conviction Newton hearing in situation (c), and indeed situation (d), is clear. Post-conviction Newton hearings take place after evidence has been given and considered at trial and the accused has been convicted. As noted earlier at [22], they are called to resolve difficult and disputed issues of fact that are material to sentencing, and should not be used as an opportunity for the accused to re-open issues settled by and relevant to the conviction by introducing evidence on those issues. Not only is this offering an accused personwho has been convicteda second bite of the cherry on issues that have been traversed and settled at trial, it is also an abuse of process as it is in substance a collateral attack on the conviction. As stated above, the sole purpose of a Newton hearing is to afford an accused person a chance to adduce evidence on a material factfor the purposes of sentencingwhich he or she did not have the opportunity to address in evidence at trial – it is not an opportunity for the accused to adduce further evidence at the sentencing stage on a material factthat goes towardconviction.",
        "Application to the facts": "A post-conviction Newton hearing should not be held 26 As observed above at [13] and [15], the Dec 2022 Statement explained the existence of the SSA, which was for all intents and purposes similar to the “special relationship”. In my view, situation (c) inChum Tat Suanis made out as the SSA relates directly to conviction. Hence, a post-conviction Newton hearing should not be held to determine the truth of evidence set out in the Dec 2022 Statement. 27 The essence of the respondent’s request for a post-conviction Newton hearing to be held on the SSA (as set out in the Dec 2022 Statement) was a second attempt at re-opening the issue of the “special relationship” post-conviction by introducing the evidence of Mr Wong on the “special relationship”. The first was the 394H application. If this attempt was allowed, it would have offered the respondent the opportunity to lead evidence on an issue relevant tomens reawhich she failed to establish at trial and failed to secure leave to adduce evidence on as a result of the dismissal of the 394H application. Allowing the respondent’s request would contravene the finality of the court process and facilitate a collateral attack against the decision on conviction inKong Swee Eng (Conviction)and the decision inKong Swee Eng (CM105). Despite counsel for the respondent’s efforts to characterise its import differently, allowing an investigation into the existence of the SSA would be to allow an investigation into whether the “special relationship” existed. This was precisely the issue that the respondent failed to establish at trial and failed to obtain leave to adduce new evidence on post-trial, with a view to reviewing the conviction on appeal. 28 It was evident therefore that situation (c) inChum Tat Suanis engaged. Situation (d) is also engaged in that the respondent adduced evidence at trial on the “special relationship”. It was just that the evidence she adduced was inherently incredible and no attempt was made to address this shortcoming by at the very least, adducing evidence from Mr Wong at that stage. In view of the importance of the “special relationship” tomens reaand the availability of Mr Wong’s evidence to the respondent at all material times, the respondent ought to have adduced all relevant evidence on the “special relationship” at trial, rather than make the strategic decision not to do so. As such, it would not be appropriate to permit the respondent to adduce further evidence on that issueat the sentencing stage. 29 I illustrate why situation (c) is engaged with reference to the Golden Oriental Charges and the Chan and Ng Charges which the respondent was convicted on. 30 I start with the Golden Oriental Charges. Mr Chee and Mr Tan had signed off on 15 purchase orders for transactions with Rainbow, with most of these purchase orders having been created or keyed-in after Mr Chee and Mr Tan had received gratification from the respondent: seeKong Swee Eng (Conviction)at [89]. In issuing these purchase orders, the usual JSPL procurement process, which involved the selection of the most competitive bid out of quotations from at least three different suppliers, was ignored. There was a lack of supporting quotations from other suppliers, and an absence of a comparison table showing the different quotes that were received. Thus, only Rainbow was considered. No other candidate was considered by Mr Chee and Mr Tan besides Rainbow: seeKong Swee Eng (Conviction)at [92]. 31 Relying on the SSA, the respondent argued in mitigation that she did not receive any benefit from Mr Chee and Mr Tan’s actions in not adhering to the JSPL procurement process. The purport of her argument was that the manner in which these purchase orders were issued –ie, without competing quotations from other suppliers – was legitimate because as a Strategic Supplier under the SSA, such an arrangement was acceptable as regards orders to Rainbow. In essence, any circumvention of the JSPL procurement process was attributable to the SSA, rather than to Mr Chee and Mr Tan’s actions. 32 In mitigation, the argument was framed as there being no harm to JSPL and no benefit to the respondent. However, the crux of the argument was that by reason of the SSA, it was not necessary for the respondent to have given any gratification to secure the orders. In view of the SSA, there was (a) no circumvention of the JSPL procurement process, and (b) no reason for the respondent to offer any gratification. This was the argument which the respondent ran at trial and on appeal. Framing the argument in terms of harm and benefit does not change this. If no benefit was secured by Rainbow as a result of giving the gratification, there is doubt as to whether the gratification had been given as an inducement for the conferment of a benefit on Rainbow. This is an argument that goes directly to the respondent’smens rea. The Dec 2022 Statement therefore related directly to conviction in respect of the Golden Oriental Charges. 33 The same may be said of the Chan and Ng Charges. Following the gratification given by the respondent, Mr Chan gave her insider information relating to one of JSPL’s projects in the form of detailed price lists from JSPL’s suppliers and advised her on how to present her prices. 34 The respondent argued that this did not result in any substantial benefit for her as under the SSA, Rainbow would in any case have been entitled to receive direct instructions on pricing, as long as it was invited to bid. Hence, even without Mr Chan’s actions, Rainbow as a Strategic Supplier would have been able to reach the target price set by JSPL and would have been awarded the project. 35 The purport of the respondent’s argument was that because of the SSA, it was not necessary to give gratification to Mr Chan in order for the respondent to receive information on how Rainbow was to price its bid. Again, this raises doubt as to whether the respondent needed to give gratification at all in the first place, which in turn questions the key finding on conviction that the respondent gave gratification with corrupt intent. Again, framing the argument in terms of harm and benefit does not change this. 36 Thus, the respondent’s attempt to re-introduce the “special relationship” issue at the mitigation stage, disguised as the SSA, related directly to conviction. It was telling that even counsel for the respondent acknowledged the strong likelihood of this being the case, admitting that if this court chose to hear evidence from Mr Wong regarding the Dec 2022 Statement, “there may be a situation where [this court] comes to the conclusion [that] actually Wong’s evidence does throw some doubt as to guilt”. It is not proper to introduce such evidence at the mitigation stage, after the issues and evidence relating to conviction had been canvassed at trial and on appeal and determinations had been made on them. 37 Thus, in line with situations (c) and (d) set out inChum Tat Suan, I declined to hold a hearing under s 228(5)(a) of the CPC in respect of the new evidence and attached no weight to the Dec 2022 Statement in assessing the appropriate sentence. 38 For completeness, I note that the issue of the SSA did not arise with respect to the Koay Charge and the Lau Charge. The respondent did not rely on the SSA in her arguments that she did not receive any substantial benefit from Mr Koay and Mr Lau. Rather, in relation to Mr Koay, she argued that she did not receive any substantial benefit from him as he neither acceded to her counterproposals on price nor provided her with any confidential information. In relation to Mr Lau, she argued that she did not receive any substantial benefit from him as the information provided by him was insufficient to provide her with any substantial advantage in the bidding process.",
        "The sentencing analysis": "39 It was agreed that the applicable sentencing framework (“the Sentencing Framework”) was set out by a three-judge coram of this court inGoh Ngak Eng. This was a two-stage, five-step framework based on the framework stated inLogachev Vladislav v Public Prosecutor[2018] 4 SLR 609. Under the first stage, which includes steps one to three, the court is to arrive at an indicative starting point sentence for the offender which reflects the seriousness of the offending act. At step one, the court is to identify and assess the relevant offence-specific factors in the case. At step two, the court is to identify the applicable sentencing range with reference to the level of harm caused and the offender’s culpability. At step three, the court is to identify the appropriate starting point within this indicative sentencing range based on a granular assessment of the offence-specific factors. Steps four and five fall under the second stage. Step four involves the court adjusting the identified starting point based on the relevant offender-specific factors, and step five requires the court to consider if further adjustments should be made on account of the totality principle.",
        "Steps one to three – the indicative starting point sentences": "40 With respect to step one, the following harm-related offence-specific factors were relevant in this case: (a) First, actual loss to the principal. This occurred mainly in the form of the suborning of the principal-agent relationship between JSPL and its employees. Mr Chee and Mr Tan did not follow the JSPL procurement process when signing off on the 15 JSPL purchase orders in favour of Rainbow – there was a lack of supporting quotations from other suppliers, such that only Rainbow was considered. Mr Lau and Mr Chan gave the respondent insider information on bidding, with Mr Chan also advising her on how to present her prices in her proposals. (b) Second, benefit to the giver of gratification. The respondent enjoyed material circumvention of the JSPL procurement process which helped her to secure various high-value contracts and purchase orders. (c) Third, the type and extent of loss to third parties. The respondents’ competitors would have been forced to compete on a playing field that was not level due to the information and assistance given to Rainbow. In the case of the 15 purchase orders signed off by Mr Chee and Mr Tan, no other candidates were even considered. (d) Fourth, the involvement of a strategic industry. JSPL was involved in the maritime industry, which was recognised inGoh Ngak Eng(at [106(e)]) as a strategic industry. 41 The following culpability-related offence-specific factors were relevant. First, the degree of planning and premeditation. There seemed to have been a consistent plan on the respondent’s part to target JSPL employees who were able to influence the procurement process: seeKong Swee Eng (Conviction)at [83]. Second, the duration of offending. There was a pattern of sustained similar conduct over a long period of time as evidenced by the total of eight charges on which the respondent was convicted and one charge taken into consideration (“TIC”) over a period of five years from 2008 to 2013. Third, the respondent’s motive in committing the offending acts, which was for financial gain. 42 Finally, and most importantly, the amount of gratification given or received. The amounts varied across the different charges. For the Golden Oriental Charges,ie, the 1st and 2nd charges, Mr Chee and Mr Tan purchased S$300,000 and S$200,000 worth of shares respectively. They anticipated significant profits from these shares as there was a strong expectation at the time that Golden Oriental would list in Singapore. At trial, Mr Chee admitted that there was a “good chance” that Golden Oriental would list locally. If it did, he agreed that it “was the general trend” that shareholders in an initial public offering (“IPO”) would make a lot of money. This was not directly challenged by the respondent in cross-examination. As for Mr Tan, he stated that he believed “in [the respondent] that there [was] great opportunity for this investment to be a success”. He further elaborated that “when the company [ie, Golden Oriental] goes for IPO, it could be at 20 cents, but after it went listed then it could be 30 cents or 40 cents, and that would be the time to sell it”. This too was not challenged by the respondent in cross-examination. Thus, I found that Mr Chee and Mr Tan expected to realise significant profits from their initial investments by selling the shares upon listing. Given the high value of the initial investments, this placed the amount of gratification at a high level. 43 With respect to the Lau Charge,ie, the 11th charge, the Prosecution argued that the amount of gratification was the total remuneration Mr Lau received while working at DMH. In contrast, the respondent argued that the amount should be assessed with reference to the increase in salary which Mr Lau enjoyed by moving to DMH. I disagreed with the position taken by both parties. In my view, the amount of gratification in relation to this charge should be assessed with reference to the overall value of the new job to Mr Lau. Mr Lau explained at trial that he was looking for a new job at the time because JSPL had deemed him as someone who did not perform well. This was because he was unable to work overtime due to his familial commitments. Thus, the true value of the new job at DMH was that it allowed Mr Lau to leave an unfavourable working environment for what he perceived to be a better position. While I accepted that it was not possible to place an empirical value on what was intangible, given the considerable importance placed by Mr Lau on a better working environment, I found this value to be significant. 44 Hence, with respect to the Golden Oriental Charges and the Lau Charge, I found that under step two of the Sentencing Framework the harm caused was moderate and there was medium culpability on the respondent’s part. This gave rise to an indicative sentencing range of one to two years’ imprisonment per charge: seeGoh Ngak Engat [103]. Having parsed the relevant factors, I found that under step three of the Sentencing Framework, the respondent’s sentences for these charges should fall within the low to middle level of the indicative sentencing range. With respect to the 1st charge, which involved Mr Chee, the opportunity to earn a significant profit on his initial investment of S$300,000 accorded a substantial value to the amount of gratification. This was sufficient to place the appropriate starting point sentence at 16 months’ imprisonment, just below the middle of the indicative sentencing range. With respect to the 2nd charge, which involved Mr Tan, a downward adjustment of the starting point sentence for Mr Chee to 14 months’ imprisonment was appropriate to reflect the smaller investment amount of S$200,000 and the correspondingly smaller amount of expected profits. With respect to the 11th charge, which involved Mr Lau, the value of a better working environment in one’s full-time job should not be understated and was sufficient to place the appropriate starting point sentence at a point slightly above the lowest end of the indicative sentencing range for moderate harm-medium culpability offences. Hence, a starting point sentence of 14 months’ imprisonment was also appropriate for this charge. 45 Thus, the appropriate starting point sentences were 16 months’ imprisonment for the 1st charge, which involved Mr Chee; 14 months’ imprisonment for the 2nd charge, which involved Mr Tan; and 14 months’ imprisonment for the 11th charge, which involved Mr Lau. 46 With respect to the 4th, 5th and 6th charges involving Mr Chan and Ms Ng, the amounts of gratification ranged from approximately S$2,900 to S$5,300. Thus, the amounts of gratification were relatively small for these charges. However, as noted earlier at [40(a)], Mr Chan had given the respondent insider information and advice relating to bidding. Thus, while the respondent’s culpability was low in view of the relatively small amounts of gratification, the harm caused to JSPL was, as in the 1st, 2nd and 11th charges, moderate. The 4th, 5th and 6th charges therefore fell within the moderate harm and low culpability category of the sentencing matrix. This gave rise to an indicative sentencing range of six to 12 months’ imprisonment. In light of the relatively small amounts of gratification, the appropriate starting point was at the lowest end of this sentencing range. Thus, I found the appropriate starting point sentence to be six months’ imprisonment for each charge. 47 The 8th charge involved a far smaller amount of approximately S$660 for the rental of Mr Chan’s wedding car. As the amount of gratification was much lower, I found that the harm caused was slight. Hence, the applicable category was that of slight harm and low culpability. Within the applicable sentencing range of a fine to six months’ imprisonment, the appropriate starting point for the 8th charge was one week imprisonment. 48 This left the 3rd charge which involved Mr Koay. I noted that no harm was occasioned to JSPL, and no benefit was received by the respondent under this charge, since Mr Koay did not accede to the respondent’s various requests to show favour to Rainbow or DMH. Nevertheless, the amount of gratification given, approximately S$4,600, was not insignificant. As such, within the indicative sentencing range for the slight harm and low culpability category, the appropriate starting point sentence for this charge was one month imprisonment.",
        "Step four – adjusting the indicative starting point sentences based on the offender-specific factors": "49 As to step four of the Sentencing Framework, I found that there were no mitigating factors present in this case. In contrast, two aggravating factors were present – first, the TIC charge involving an instance where the respondent gave a red packet containing at least S$1,000 in cash to Mr Chan and Ms Ng; and second, the respondent’s relevant antecedent. In 2002, the respondent was convicted on a charge of abetting the giving of false information to the Corrupt Practices Investigation Bureau. She consented then to four charges of corruptly offering gratification to be taken into consideration for the purposes of sentencing. These charges involved various sums given to employees in Sembawang Shipyard as inducements to show favour to her company. She was eventually sentenced to two months’ imprisonment. While accused persons are not convicted on TIC charges, they admit to those offences: seePublic Prosecutor v UI[2008] 4 SLR(R) 500 at [38]. Thus, previous TIC charges may count as part of an offender’s relevant antecedents: seeSim Yeow Kee v Public Prosecutor and another appeal[2016] 5 SLR 936 at [11] and [116];Public Prosecutor v Low Ji Qing[2019] 5 SLR 769 at [15] and [67]. In the instant case, the similar nature of the charges in the respondent’s antecedent and the present charges was sufficient to evince a pattern of similar criminal conduct which justified an uplift in sentence for the purpose of specific deterrence: seeTeo Seng Tiong v Public Prosecutor[2021] 2 SLR 642 at [97]. 50 Thus, I found it appropriate to order an upward adjustment of the starting point sentences. Specifically, there was to be an increase from 16 to 18 months’ imprisonment for the 1st charge; from 14 to 16 months’ imprisonment for the 2nd and 11th charges; from six to seven months’ imprisonment for the 4th, 5th and 6th charges; from one month to one month and one week imprisonment for the 3rd charge; and from one week to ten days’ imprisonment for the 8th charge.",
        "Step five – further adjustments on account of the totality principle": "51 Step five of the Sentencing Framework required the court to consider whether the sentences ought to be adjusted on account of the totality principle. Considering the respondent’s multiple offences, I found it appropriate to order one sentence from the Golden Oriental Charges, the sentence for the Lau Charge, and one sentence from the Chan and Ng Charges to run consecutively. This appropriately reflected the overall criminality of the respondent’s conduct and fairly represented the different groups of persons whom she offered gratification to. Thus, I ordered the following sentences to run consecutively: (a) 18 months’ imprisonment for the 1st charge, involving Mr Chee;(b) 16 months’ imprisonment for the 11th charge, involving Mr Lau; and(c) seven months’ imprisonment for the 5th charge, involving Mr Chan and Ms Ng. This led to an aggregate sentence of 41 months’ imprisonment. Considering all the facts and circumstances, this aggregate sentence was not crushing and was in accordance with the respondent’s past record and future prospects.",
        "Conclusion": "52 For these reasons, I sentenced the respondent to a total of 41 months’ imprisonment.   Kannan RameshJudge of the Appellate Division  Jiang Ke-Yue, Ong Xin Jie and Dhiraj G Chainani (Attorney-General’s Chambers) for the appellant; Sunil Sudheesan, Khoo Hui-Hui Joyce and Chow Ee Ning (Quahe Woo & Palmer LLC) for the respondent."
    }
}