{
    "case_title": "The “Ambassador”",
    "ncitation": "[2023] SGHC 2",
    "coram": "Chua Lee Ming J",
    "sections": {
        "Introduction": "1 Two interveners in these proceedings have appealed against my determination of priorities of claims against the vessel “Ambassador” (the “Vessel”) and my consequential order for payment out of the proceeds of sale of the Vessel and the bunkers remaining onboard the Vessel in HC/SUM 3316/2022 (“SUM 3316”). These two interveners did not file any affidavit in response to SUM 3316 and did not attend the hearing of SUM 3316. Subsequently, they requested further arguments, which I rejected.",
        "Facts": "2 The plaintiffs, comprising the master, officers and crew of the Vessel, commenced this action for wages and all other dues due to them under their respective employment contracts. The defendant, Nautical Challenge Ltd, was the owner of the Vessel. 3 The defendant did not enter an appearance or participate in these proceedings. On 19 January 2017, the plaintiffs arrested the Vessel. On 6 March 2017, the plaintiffs entered judgment in default of appearance against the defendant and the Vessel and bunkers were ordered to be sold. 4 On 27 April 2017, the Vessel and bunkers were sold for a total sum of S$10,297,300 (the “Sale Proceeds”). On 12 May 2017, the Sale Proceeds were paid into court. Between December 2017 and August 2018, payments were ordered to be made from the Sale Proceeds to various parties including the plaintiffs. As of 3 November 2022, the balance amount including interest was S$8,600,459.01 (the “Balance Sale Proceeds”).1Foot Note 1×DDW’s Skeletal Submissions in SUM 3316 dated 7 November 2022, at para 6. 5 Ten other parties intervened in these proceedings. The first intervener, Newton Shipping Ltd, withdrew its claim on 24 November 2017. Of the remaining nine interveners, for present purposes, only five were relevant: (a) The fourth intervener, Evergreen Marine (UK) Ltd (“Evergreen”). The defendant had granted Evergreen a first priority mortgage over the Vessel on 14 December 2015 (the “First Priority Mortgage”). Evergreen’s role is further explained below at [7] and [9].(b) The fifth intervener, Drydocks World – Dubai LLC (“DDW”). DDW was the applicant in SUM 3316.(c) The sixth intervener, Shipoil Ltd (“Shipoil”), and the seventh intervener, Island Oil Ltd (“Island Oil”). Shipoil and Island Oil are the parties who have appealed against my decision in SUM 3316. Their claims arose out of supplies of bunkers to the Vessel at the defendant’s request.2Foot Note 2×1st Affidavit of Prakaash s/o Paniar Silvam filed on 3 September 2022, at para 20.(d) The tenth intervener, Clyde & Co LLP (“Clyde”). Clyde’s role, which was minimal, is explained below at [18] and [21]. 6 DDW was, at all material times, the mortgagee of the Vessel under a second priority mortgage dated 24 March 2016 and registered in the St Kitts & Nevis International Ship Registry on 24 March 2016 (the “Mortgage”). The Mortgage secured the defendant’s obligations under a deferred payment agreement dated 24 March 2016 (“DPA”), as amended, and a deed of covenants dated 24 March 2016.3Foot Note 3×1st Affidavit of Toh Ka-Chun, Gregory (Tu Jiajun) filed on 22 May 2017, at para 8. 7 In addition to the Mortgage, cl 10.1.2 of the DPA4Foot Note 4×1st Affidavit of Toh Ka-Chun, Gregory (Tu Jiajun) filed on 22 May 2017, at p 27.also required the defendant to assign to DDW the benefit of a letter of undertaking issued by Gard AS dated 18 June 2015 as agents for Gard P&I (Bermuda) Ltd (the “Gard LOU”). The Gard LOU had been issued on behalf of Evergreen to the defendant as security in respect of a collision on 11 February 2015 between the Vessel and another vessel owned by Evergreen (the “Collision”).5Foot Note 5×1st Affidavit of Prakaash s/o Paniar Silvam filed on 3 September 2022, at paras 25(a)–(b) and 29.Separately, in consideration of Evergreen agreeing to cease all actions that would interfere with the Vessel, the defendant had granted Evergreen the First Priority Mortgage to secure any obligation that the defendant may owe pursuant to any final judgment relating to the Collision. 8 By way of an assignment dated 24 March 2016 (the “Assignment”), the defendant assigned to DDW the benefit of the Gard LOU and any other amounts of money received by the defendant in relation to the Collision.6Foot Note 6×Letter dated 2 December 2022 from Oon & Bazul LLP, at Annex C, paras 2.1 read with 1.2. 9 The defendant and Evergreen commencedinpersonamactions against each other in England in respect of the Collision. On 6 June 2022, the defendant obtained judgment pursuant to which Evergreen was liable to the defendant for a net amount of US$6,754,309.24 plus interest (the “Nautical Judgment Debt”).7Foot Note 7×1st Affidavit of Prakaash s/o Paniar Silvam filed on 3 September 2022, at para 25(j).Pursuant to the Assignment, the benefit of the Nautical Judgment Debt was also assigned to DDW (see [8] above). 10 Separately, on 23 March 2017, DDW commenced action against the defendant as owner of the Vessel in HC/ADM 51/2017 claiming, among other things, a declaration of the validity of the Mortgage and payment of sums owing to it under the DPA. On 3 July 2017, DDW obtained judgment in default of appearance against the defendant (the “ADM 51 Judgment”). 11 DDW’s claim against the Vessel arose out of the Mortgage and it was of the view that its claim as mortgagee ranked higher than all the other interveners’ claims. In particular, although Evergreen’s claim under the First Priority Mortgageprima facieranked higher in priority, Evergreen could not enforce its claim under the First Priority Mortgage since it was given as security for any obligations the defendant may owe pursuant to any final judgment relating to the Collision (see [7] above) and it was Evergreen that owed moneys to the defendant under the final judgment that was obtained (see [9] above). 12 On 3 September 2022, DDW filed SUM 3316 for determination of priorities of claims against the Vessel and for payment out of the Balance Sale Proceeds to satisfy its claim. As of 9 November 2022, DDW’s claim under the ADM 51 Judgment (and, consequently, under the Mortgage) amounted to US$8,466,675.47, £85,298.34, €16,060.16 and S$23,141.33. 13 On 9 November 2022, I heard SUM 3316. Shipoil and Island Oil did not file any affidavit in response to DDW’s application in SUM 3316. They also did not attend the hearing of SUM 3316. None of the other interveners challenged DDW’s claim to priority. I decided that DDW’s claim to the Balance Sale Proceeds had priority over the other interveners and ordered the Balance Sale Proceeds to be paid out to DDW’s solicitors. 14 On 23 November 2022, Shipoil and Island Oil requested further arguments in respect of my decision in SUM 3316. After considering the submissions made by Shipoil, Island Oil, DDW and Clyde, I concluded that further arguments were not necessary. I therefore rejected the request for further arguments. 15 On 22 December 2022, Shipoil and Island Oil filed a notice of appeal against my decision in SUM 3316.",
        "The grounds in the request for further arguments": "16 In their request for further arguments,8Foot Note 8×Letter dated 23 November 2022 from JLex LLC.Shipoil and Island Oil did not explain why they did not attend the hearing of SUM 3316. Neither did they challenge the fact that DDW’s claim had priority over their respective claims. Instead, they made the following arguments: (a) If DDW enforced the Nautical Judgment Debt first and obtained full payment under the Gard LOU and/or from the defendant, the shortfall on DDW’s claim under the ADM 51 Judgment would be US$500,000. If this shortfall was then satisfied from the Balance Sale Proceeds, there would remain approximately US$5.3m from the Balance Sale Proceeds that would be available for distribution to other creditors. (b) On the contrary, if the whole of the Balance Sale Proceeds were paid to DDW: (i) the other creditors would receive nothing; and (ii) if DDW then enforced the Nautical Judgment Debt and recovered the full amount of the Nautical Judgment Debt, DDW would be overpaid by US$5.3m, which the creditors would not benefit from because DDW would have to return the excess amount to the defendant. 17 On the basis of the above arguments, Shipoil and Island Oil sought: (a) to set aside my order made on 9 November 2022 and to adjourn SUM 3316sine diepending the outcome of enforcement proceedings by DDW against the Nautical Judgment Debt and/or the Gard LOU; or (b) alternatively, to vary my order made on 9 November 2022 to fix the amount to be paid out to DDW at US$500,000 with liberty to DDW to apply in relation to the balance of DDW’s claim after DDW had exhausted its enforcement proceedings against the Nautical Judgment Debt and/or the Gard LOU. 18 DDW submitted that the request for further arguments should not be allowed because there was no dispute that DDW’s mortgage claim ranked in priority, and it could elect whether to enforce its claim against the Balance Sale Proceeds or the Gard LOU or the Nautical Judgment Debt.9Foot Note 9×Letter dated 2 December 2022 from Oon & Bazul LLP, at paras 6 and 8.Clyde supported DDW’s position.10Foot Note 10×Letter dated 13 December 2022 from Clasis LLC, at paras 7 and 10. 19 I agreed with DDW and rejected the request for further arguments by Shipoil and Island Oil. Their case was tantamount to compelling DDW to attempt to satisfy the ADM 51 Judgment (at least in part) by enforcing the Nautical Judgment Debt and/or the Gard LOU first instead of satisfying the ADM 51 Judgment by way of its mortgagee claim against the Balance Sale Proceeds. Shipoil and Island Oil did not produce any authorities that showed that they were entitled to do so. 20 The ADM 51 Judgment was for sums owing to DDW under the DPA. As stated earlier, the defendant’s obligations to DDW under the DPA were secured by the Mortgage and the assignments of the Gard LOU and the Nautical Judgment Debt. I agreed with DDW that as a matter of law, it was entitled to elect to enforce its remedies as far as applicable, subject to there being no double recovery:The “Myrto”[1977] 2 Lloyd’s Rep 243 at 258. DDW was entitled to look to any security that had been provided by the defendant, including the Mortgage, to satisfy the ADM 51 Judgment. The Vessel had been sold and the Balance Sale Proceeds represented the value of the Vessel. DDW chose, as it was entitled to, to enforce its mortgagee claim against the Balance Sale Proceeds. Shipoil and Island Oil had no basis in law to object to DDW doing so, or to require DDW to first enforce its remedies under the assignment of the Gard LOU or the assignment of the Nautical Judgment Debt. 21 There were also practical reasons for DDW to seek payment from the Balance Sale Proceeds. DDW’s claim to the Nautical Judgment Debt was subject to interpleader proceedings in England. Clyde had challenged DDW’s entitlement to priority over the Nautical Judgment Debt. 22 It appeared that on 22 November 2022, a consent order was entered staying the interpleader proceedings in England. DDW did not explain the reason for the stay. Shipoil and Island Oil submitted that a reasonable inference was that the interpleader proceedings were stayed pending the outcome of DDW’s application for payment out of the Balance Sale Proceeds. In my view, whether or not this was so, was irrelevant. DDW was fully entitled to seek payment from the Balance Sale Proceeds first. 23 I also agreed with DDW that there was no risk of double recovery. As DDW expressly stated on affidavit, it would first seek payment from the Balance Sale Proceeds and thereafter look towards the Nautical Judgment Debt for recovery of its remaining debt under the ADM 51 Judgment.11Foot Note 11×1st Affidavit of Prakaash s/o Paniar Silvam filed on 3 September 2022, at para 29.In any event, the assignments of the Gard LOU and the Nautical Judgment Debt were as security for the defendant’s obligations under the DPA. Any payment received by DDW from the Balance Sale Proceeds would reduce the defendant’s obligations under the ADM 51 Judgment. Consequently, DDW’s right to payment under the assignments of the Gard LOU and the Nautical Judgment Debt would be reduced accordingly. 24 Payment of the Balance Sale Proceeds to DDW meant that Shipoil and Island Oil were left to pursue their respective claims against the defendant. Obviously, Shipoil and Island Oil wanted DDW to first satisfy the ADM 51 Judgment by enforcing the Nautical Judgment Debt and/or the Gard LOU as it would be more convenient for them to enforce their claims against the Balance Sale Proceeds. However, DDW was free to satisfy the ADM 51 Judgment from the Balance Sale Proceeds first and DDW had no obligation to choose a course of action that better suited Shipoil and Island Oil.",
        "Conclusion": "25 For the above reasons, I rejected the request for further arguments and affirmed my decision in SUM 3316 given on 9 November 2022. Chua Lee MingJudge of the High Court Bazul Ashhab Bin Abdul Kader, Prakaash s/o Paniar Silvam and Ng Guang Yi (Oon & Bazul LLP) for the fifth intervener; Tan Wee Kong and Poh Ying Ying Joanna (JLex LLC) for the sixth and seventh interveners; Lim Zhi Ming Max (Rajah & Tann Singapore LLP) for the second and eighth interveners; Ng Yuhui (Incisive Law LLC) for the fourth intervener; Subashini d/o Narayanasamy (Haridass Ho & Partners) for the ninth intervener; Sylvia Lem Jia Li (Clasis LLC) for the tenth intervener; The plaintiffs, the first and third intervener absent; The defendant absent and unrepresented."
    }
}