{
    "case_title": "Tan Chwee LianvNg Peh Wah",
    "ncitation": "[2023] SGHC 121",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 The claimant in this case (“the Mother”), sought the return of money held jointly in two accounts with her daughter (“the Daughter”). 2 These joint accounts were opened on 14 December 2022 on the basis that both the Mother’s and Daughter’s signatures would be required to withdraw any money under a “both to sign” arrangement. The Mother, who is 92 and not literate in English, later stated that she did not fully understand that the accounts would be under this “both to sign” arrangement. She preferred, she said, an “either to sign” arrangement, where she could withdraw the money whenever she wished.1Foot Note 1×Affidavit of Tan Chwee Lian dated 12 January 2023 at paras 3–4, 8(5).She also expressed surprise that the money in the joint accounts would devolve to her Daughter on her demise. She requested the Daughter to accompany her to return to the bank to change the arrangement or to withdraw the money, but the Daughter did not do so.2Foot Note 2×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 14. 3 The Mother therefore applied for the following at prayer 2 of HC/OA 25/2023 (“the OA”): 1. It be declared that the Defendant holds all monies in the UOB fixed deposit account (no. [xxx]) and UOB savings account (no. [xxx]) on a resulting or constructive trust or a bare trust for the Claimant; 2. That the UOB fixed deposit account (no. [xxx]) and UOB savings account (no. [xxx]), both held in the joint names of the Claimant and the Defendant, are effectively severed in law and/or by an Order of Court to be made herein; 3. That the Defendant take steps to terminate the aforesaid 2 UOB accounts and pay over all monies cum interests therein to the Claimant in her sole name; 4. In the event of the Defendant’s failure to comply with the aforesaid within three (3) days of such Orders to be made herein, the Registrar of the High Court be empowered to execute all documents required by the UOB Bank in the Defendant’s name and on her behalf to terminate the aforesaid 2 UOB accounts and to transfer all monies therein to the Claimant, and that such execution be deemed effectual for all intents and purposes as if the Defendant had executed them herself; 5. That interests at 5.33% per annum on the principal sums in the aforesaid 2 UOB accounts from the date of this Originating Application be paid to the Claimant by the Defendant; 6. Such other reliefs or orders as the Court think fits and just; and 7. That the costs of the Originating Application till judgment be paid to the Claimant by the Defendant. 4 In response, the Daughter filed a summons to cross-examine the Mother in HC/SUM 617/2023, contending that the OA was filed without authority, and asked that the application to cross-examine the Mother be heard before the OA. On the OA, her defences centred on the presumption of advancement, constructive trust and gift. 5 On 17 March 2023, I dismissed HC/SUM 617/2023 and thereafter granted amended reliefs under the OA. The Daughter has appealed. I furnish my grounds of decision.",
        "Background": "6 It is undisputed that the source of the money was the Mother.3Foot Note 3×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 5; Affidavit of Ng Peh Wah dated 21 February 2023 at paras 6(9), 7(2).On 14 December 2022, she went with the Daughter to the bank and transferred money from various accounts she held jointly with her son, Ng Yeow Hua (“Mr Ng”), to two new accounts with her Daughter.4Foot Note 4×Affidavit of Tan Chwee Lian dated 12 January 2023 at paras 3(3)–3(5); Affidavit of Ng Peh Wah dated 21 February 2023 at para 7.Her reason for doing so, which the Daughter disputes, was to separate her money for medical use and share investments. She had suggested that the component for share trading could be put into a joint account with the Daughter to enable the Daughter to assist her with share investment transactions, as her son was too busy with the family business to be able to do so. The Daughter suggested that the accounts be in their joint names, and the Mother agreed.5Foot Note 5×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 8. 7 Mr Ng was overseas at the time these arrangements were effected.6Foot Note 6×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 8; Affidavit of Ng Peh Wah dated 21 February 2023 at para 7(1).Subsequently, on his return, the Mother discovered that the accounts required two signatures and that joint tenancies carried the right of survivorship.7Foot Note 7×Affidavit of Tan Chwee Lian dated 12 January 2023 at paras 10–12.She asked the Daughter to change the accounts from the arrangement that required two signatures under a “both to sign” arrangement, to an “either to sign” arrangement, similar to other accounts that she held with other family members. This was to give her flexibility to deal with her funds by herself.8Foot Note 8×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 13.Nevertheless, the Daughter did not do so.9Foot Note 9×Affidavit of Tan Chwee Lian dated 12 January 2023 at para 14.The Mother therefore sought relief on the basis that she supplied the funds and that a resulting trust arose in her favour. At the same time, she asked to sever the joint tenancy because her intention was not for the Daughter to have the right of survivorship.10Foot Note 10×Affidavit of Tan Chwee Lian dated 12 January 2023 at paras 10–12; Claimant’s Skeletal Arguments dated 9 March 2023 at paras 19–23. 8 In response, the Daughter contended that the Mother’s counsel lacked authority to act for the Mother in the OA.11Foot Note 11×Defendant’s Written Submissions dated 10 March 2023 at paras 8–16.To that end, HC/SUM 617/2023 prayed for the Mother to be cross-examined. On the substantive merits of the OA, she contended that the objective of starting the accounts was to secure her inheritance, and advanced arguments on the presumption of advancement, constructive trust and gift.12Foot Note 12×Notes of Argument 17 March 2023 at p 5 ln 17 to p 7 ln 9; Defendant’s Written Submissions dated 10 March 2023 at paras 20–21.In my judgment, these contentions were unmeritorious for the reasons that follow.",
        "Voluntariness of the OA": "9 The Daughter’s stance was that the OA had not been filed voluntarily, initially contending that Mr Ng and the Mother’s counsel were colluding.13Foot Note 13×Affidavit of Ng Peh Wah dated 21 February 2023 at paras 5, 11.The Mother filed an affidavit in reply to confirm her instructions and enclosed a duly signed warrant to act.14Foot Note 14×Affidavit of Tan Chwee Lian dated 3 March 2023 at paras 2–3.By the time of the hearing, the Daughter’s prior allegation that the Mother lacked mental capacity had been dropped, and allegations made in her affidavit that Mr Ng’s family instigated the OA had been withdrawn. The allegation that counsel for the Mother had no authority to act for the Mother thus formed the sole basis of the request to cross-examine the Mother.15Foot Note 15×Notes of Argument dated 17 March 2023 at p 1 ln 32 to 33, p 2 ln 24 to 25. 10 HC/SUM 617/2023 was made without any basis, and the contention that the Mother’s counsel had no authority lacked premise. In this context, the Law Society of Singapore’s Practice Direction 7.4.3 at para c (dated 31 January 2019), formerly the Practice Directions and Rulings 2013 para 65, states that a law practice must accept another law practice’s written representation that it is authorised save where there is good reason to suspect that the representation is falsely made. The Daughter, instead of providing good reason, relied first, on her own bare assertion that the Mother had not mentioned this suit in a series of visits she made to the Mother.16Foot Note 16×Affidavit of Ng Peh Wah dated 21 February 2023 at para 6(12).Second, she relied on the transcript of a video recorded by Mr Ng’s son and addressed to her on 20 December 2022.17Foot Note 17×Affidavit of Ng Peh Wah dated 21 February 2023 at para 6(4); Affidavit of Ng Tze Chong dated 3 March 2023 at para 3.On review, the transcript did not contain any evidence whatsoever that the Mother’s counsel were colluding with Mr Ng or his son. The logical nexus between the solicitor’s authority to act and the request to cross-examine the Mother was also wholly absent, particularly after the contention that Mr Ng and his family were instigating the lawsuit had been withdrawn. As the Court of Appeal noted inSyed Suhail bin Syed Zin v Public Prosecutor[2021] 2 SLR 377 at [35], it is entirely inappropriate for counsel, as an attempt to get around inconvenient facts, to advance allegations against other counsel without any evidence or factual basis.",
        "Beneficial entitlement to the money in the bank accounts": "11 The Mother’s case rested on the fact that she was the source of the funds. She submitted that the Daughter held her share on a resulting trust.18Foot Note 18×Claimant’s Skeletal Arguments dated 9 March 2023 at para 63. 12 The Mother’s legal case was a simple one. Joint tenancies are generally abhorred by equity, and unless there is an express declaration or any other intention shown to the contrary, or unless the parties have contributed to the purchase money in equal shares, legal joint tenants are presumed to hold that property as beneficial tenants in common of shares proportionate to their contribution to the acquisition of that property in a resulting trust. This presumption of resulting trust is based on a common-sense presumption that an owner of property never intends to make a gift outside of certain relationships, and a person who provides the money required to purchase a property intends to obtain an equivalent equitable interest in the property acquired:LauSiew Kim v Yeo GuanChye Terence and another[2008] 2 SLR(R) 108 (“Lau Siew Kim”) at [36], [83]. The present case involved one of two common scenarios in which resulting trusts are presumed to arise, where A makes a voluntary payment to B or pays (in whole or in part) for the purchase of property vested either in B’s name or in their joint names. In such cases, there is a presumption that A did not intend to make a gift to B and the money or property is held on trust for A proportionate to his contribution:LauSiew Kimat [34]. This presumption also applies to monies held in a joint account to which several account holders had made unequal contributions:Bhavika ManoharGodhwani v Manohar Hargun Godhwani and others[2020] SGHC 147 at [63]–[64];Estate of Yang Chun (Mrs) née Sun Hui Min, deceased v Yang Chia-Yin[2019] 5 SLR 593 at [70]. 13 The Daughter raised three arguments in response. The first was that the money in the bank accounts was intended to be a gift.19Foot Note 19×Notes of Argument dated 17 March 2023 at p 6 ln 4.This was raised for the first time in oral argument and when queried, counsel conceded there was no assertion made or any evidential basis in the Daughter’s affidavit regarding a gift.20Foot Note 20×Notes of Argument dated 17 March 2023 at p 6 ln 11.His submission was that the mere fact of both names on the account implied the gift.21Foot Note 21×Notes of Argument dated 17 March 2023 at p 6 ln 17 to 20.There was no legal authority tendered.22Foot Note 22×Notes of Argument dated 17 March 2023 at p 6 ln 24.I found no merit in this argument. 14 The Daughter’s second argument was that a constructive trust had arisen in her favour, when the bank accounts were opened in the joint names of the Mother and Daughter.23Foot Note 23×Notes of Argument dated 17 March 2023 at p 5 ln 26–27.This too I rejected. The Daughter’s affidavit contended that the two accounts were “part of my inheritance” and she was “to distribute the rest to my two sisters”.24Foot Note 24×Affidavit of Ng Peh Wah dated 21 February 2023 at para 7(1).At its highest, this was an assertion of a common intention constructive trust. Beyond her bare assertion, however, there was no evidence of such common intention in her affidavit. The gravamen of her complaint appeared to be that the Mother made a will dated 31 May 2017 in which she had bequeathed a property in Craig Road to her three daughters, of whom the Daughter is one. After this will was made, however, the property was sold en bloc for around $3.48m.25Foot Note 25×Affidavit of Ng Peh Wah dated 21 February 2023 at para 6(9).The proceeds had dwindled to a sum of $1.71m, and this sum was the source of the funds in the two bank accounts in question.26Foot Note 26×Affidavit of Ng Peh Wah dated 21 February 2023 at paras 7(2), 8–9.The Daughter was also unhappy about the control she said Mr Ng had over various of her Mother’s accounts.27Foot Note 27×Affidavit of Ng Peh Wah dated 21 February 2023 at paras 7(4), 9–10. 15 In my view, these contentions could not form an adequate basis for a common intention as to how the beneficial interest in the money in the joint accounts were be held, which is necessary in order to establish a common intention constructive trust. A will only takes effect on the death of the testator, and a testator may change her mind at any time before death. After the will was made on 31 May 2017, the Daughter possessed merely a bare expectancy; any beneficial interest would only arise upon the testator’s demise (seeShearesBetty Hang Kiu v Chow Kwok Chi and others[2006] 2 SLR(R) 285 at [34]). And as the property had been sold en bloc, no beneficial interest could arise. The Mother could deal with the proceeds from the en bloc sale as she pleased. 16 In any event, other parts of the Daughter’s affidavit contradicted her narrative that the money in the bank accounts was to be preserved for her inheritance. First, her assertion that she agreed with the Mother that she would be there to sign as a second signatory whenever there was a legitimate purpose belied the argument for its preservation. Further, she did not explain what such a legitimate purpose would be. The money came from the Mother: if the Mother, being of sound mind, desired its return, one would have thought that would be a legitimate request. A second contradiction arose from her reliance on a recording, the same recording mentioned at [9], in which the Mother had described her desired arrangement in the following words: “if she wants to use, she can sign, if I want to use, I can sign”.28Foot Note 28×Affidavit of Ng Peh Wah dated 21 February 2023 at Tab A.The Daughter submitted that this showed she was a beneficial owner, but such a submission ignored the Mother’s expressed wish to equally be able to withdraw funds, which would again detract from preserving the sum for inheritance purposes.29Foot Note 29×Defendant’s Written Submissions dated 10 March 2023 at para 12.A part of the Daughter’s transcript which related to the right of joint survivorship was disputed by the Mother, who adduced a translation of her own. Notwithstanding, whether the Mother’s translation or the Daughter’s translation was used, other parts of the transcript made clear that the Mother had been confused about the first two-signature arrangement, and plainly wanted to be able to withdraw the money on her own. One signature – her own – was sufficient, in the Mother’s view, in the event she wanted to withdraw money for any medical contingencies. The relevant part of the Daughter’s version of the transcript was as follows: The Mother:  … if I need to go see the doctor, need to get money, and Third Aunt did not sign then I won’t be able to take/draw (money) lah Mr Ng Tze Chong:  Okay, so- so you want … what do you want Third Aunt to do? The Mother:  Third Aunt, ask her to go sign, us two … don’t- don’t need for 2 persons to sign lah … Don’t need to have 2 persons’ signature, 1 will be enough … Therefore the contention of constructive trust was without merit. 17 Conversely, I found that the Daughter held the funds on a resulting trust in favour of the Mother. A resulting trust arises in response to a transferor’s lack of intention to benefit the transferee by way of the transfer in question:Chan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 (“Chan Yuen Lan”) at [38]–[48]. As already discussed, rather than suggesting that funds were meant to be the Daughter’s inheritance, the affidavit evidence provided by both parties made clear that the Mother intended to be able to independently access and use them as she saw fit. Moreover, the Daughter’s affidavit and submissions did not raise any cogent argument to query the veracity of the Mother’s account. Having accepted the Mother’s evidence regarding her intention at the time she opened the two accounts, and given that it was not intended to benefit the Daughter, this was sufficient for a resulting trust to arise. 18 In view of the above finding, while the Mother’s reliance on the presumption of resulting trust was understandable owing to the nature of the application, it was not necessary for me to address it. The presumption of resulting trust, as well as the presumption of advancement, are not applicable where there is direct evidence revealing the intention of the transferor:Chan Yuen Lanat [49]–[52]. It is only where the evidence is inconclusive that the presumption of resulting trust or advancement operates:KuaSwee Lin v Ho Kim Yan and another[2023] SGHC 108 at [54]. Having found that the evidence was sufficient to establish that the Mother did not intend to benefit the Daughter, there was no need to rely on either presumption. I therefore do not deal with the Daughter’s arguments on the presumption of advancement.",
        "Conclusion": "19 I granted a declaration that the Daughter held the money in the bank accounts on resulting trust for the Mother. The joint tenancy was severed, and the Daughter was ordered to take steps to terminate the accounts and return the money. Seven days were requested by the Daughter for compliance. The Mother had no objection and this was granted. The Registrar was empowered to execute the relevant documents if the Daughter did not do so. Interest at 5.33% was ordered on the sums in the bank accounts from the date of writ until the date of payment. 20 Costs followed the event and were awarded in favour of the Mother for both HC/SUM 617/2023 and the OA. Counsel for the Mother explained that these costs were high because the Mother was elderly and did not speak or write English. Much time was taken with her in the preparation of the OA, the summons, her affidavits and the hearing. Research was also done for issues raised earlier by the Daughter but not pursued in submissions. He suggested $19,500 excluding disbursements. Opposing counsel suggested $19,000 including disbursements. I awarded the Mother $1,500 for the summons, inclusive of disbursements, and $17,500 for the OA, also inclusive of disbursements. Valerie TheanJudge of the High Court Lei Chee Kong Thomas (Lawrence Chua Practice LLC) for the claimant; Yap Bock Heng Christopher (Alpha Law LLC) the defendant.",
        "": ""
    }
}