{
    "case_title": "Rio ChristoflevTan Chun Chuen Malcolm",
    "ncitation": "[2023] SGHC 66",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 Within the confines of the traditional financial system, intermediaries, such as banks or stockbrokers, play an important role. In exchange for a fee, they assist with,inter alia, verifying the identities of parties to the transaction, as well as keeping accurate records of such transactions. Blockchain technology poses a challenge to traditional financial structures because it cuts out the middleman, allowing parties to deal directly with each other whilst preserving their anonymity: see Philipp Paech, “The Governance of Blockchain Financial Networks” (2017) 80(6) Modern Law Review 1073 at p 1078–1079. As will be apparent from the paragraphs that follow, it is this characteristic of blockchain technology which has given rise to the present dispute.",
        "The background": "2 Sometime in 2019, the plaintiff, Mr Rio Christofle, set up GCXpress Commerce Pte Ltd (“GCX”) for the business of “over-the-counter” (“OTC”) trading of cryptocurrencies. He was the sole director and shareholder of GCX. To acquire operating capital for GCX, the plaintiff obtained loans from his brother, Rio Christian (“RC”) and other individuals.1Foot Note 1×Rio Christofle AEIC dated 15 March 2022 at para 3.GCX had, up to 28 July 2020, an exemption from holding a licence under the Payment Services Act 2019 (“PSA”) for the provision of a digital payment token service.2Foot Note 2×Rio Christofle AEIC dated 15 March 2022 at para 6. 3 The defendant was, at all material times, the managing director of Qrypt Technologies Pte Ltd (“Qrypt”), a company that was engaged in the business of “digital assets, blockchain, cryptocurrency and/or management consultancy services”.3Foot Note 3×Malcolm Tan AEIC dated 15 March 2022 at para 5. 4 The defendant was introduced to the plaintiff and GCX by RC. It appears that between July 2019 and May 2020, the defendant concluded a number of transactions with GCX for the sale of cryptocurrencies.4Foot Note 4×Rio Christofle AEIC dated 15 March 2022 at para 5.According to the plaintiff, after 28 July 2020, GCX ceased business, and the plaintiff began to liquidate the leftover cryptocurrencies in his personal capacity and returned the outstanding loans.5Foot Note 5×Rio Christofle AEIC dated 15 March 2022 at para 7. 5 On 1 December 2020, the defendant contacted the plaintiff to ask if the plaintiff had some S$320,000.00 worth of Bitcoin to sell. The plaintiff confirmed that he had, and they made arrangements to conduct the transaction at the defendant’s office that afternoon where they confirmed the price of the Bitcoin (12.14 Bitcoin in exchange for S$320,000.00). The plaintiff was accompanied by Mr Phoon Chee Kong (“Nik”). The plaintiff transferred the 12.14 Bitcoin to the cryptocurrency wallet specified by the defendant.6Foot Note 6×Rio Christofle AEIC dated 15 March 2022 at paras 8 – 10. 6 The problem arose after the transfer. The plaintiff wanted to take the S$320,000.00 in cash, which had been placed at the table, and leave. However, he was stopped by three other male individuals in the defendant’s office. One of the three men told the plaintiff and Nik that the cash belonged to him and that they could not leave the premises until he had received his United States Dollars Tether (“USDT”) (ie,a cryptocurrency).7Foot Note 7×Rio Christofle AEIC dated 15 March 2022 at para 11.According to the plaintiff, he agreed to wait for the transaction to be completed.8Foot Note 8×Rio Christofle AEIC dated 15 March 2022 at para 12. 7 After almost an hour, the defendant said that the person to whom he had transferred the Bitcoin to had deleted their Telegram chat. Chaos erupted. A quarrel broke out as to who was entitled to the S$320,000.00 in cash. The plaintiff called the police, who arrived shortly thereafter.9Foot Note 9×Rio Christofle AEIC dated 15 March 2022 at para 12–13.The plaintiff eventually left the defendant’s office without the S$320,000.00 and bereft of 12.14 Bitcoin. 8 The above narrative contains the undisputed facts. The rest of the facts are hotly disputed by the parties. It was clear, however, that this was a transaction for cryptocurrency gone awry. Putting aside the various distractions, specifically, the allegations that there was a scam, it is clear that the heart of this dispute is essentially a claim in contract, and in the alternative, unjust enrichment. 9 I turn now to set out parties’ respective cases.",
        "The plaintiff’s case": "10 The plaintiff alleges that on 1 December 2020, he had agreed to sell to the defendant, 12.14 Bitcoin at the agreed price of S$320,000.00. This agreement (“the Agreement”) was evidenced in writing via Whatsapp messages exchanged between the plaintiff and the defendant on 1 December 2020.10Foot Note 10×Statement of Claim (“SOC”) at para 3. 11 Pursuant to the Agreement, on the same day, the plaintiff transferred 12.14 Bitcoin to the wallet address specified by the defendant: 1CujfQcB8AxborFyqLnDZec6xVpD9dTqTi.11Foot Note 11×SOC at para 4. 12 The plaintiff submits that the defendant was in breach of the Agreement, having failed to pay the agreed price of S$320,000.00. Instead, the defendant only returned 0.157557 Bitcoin to the plaintiff. This leaves a balance of 11.982443 Bitcoin. In monetary terms, the plaintiff is owed S$315,846.93. The defendant has, to date, not paid this sum to the plaintiff.12Foot Note 12×SOC at paras 5–6 and 8. 13 The plaintiff therefore commenced the present action. His claim against the defendant is for the sum of S$315,846.93, or in the alternative, the return of the 11.982443 Bitcoin.13Foot Note 13×SOC at para 9.",
        "The defendant’s case": "14 The defendant claims that at around 11.00am on 1 December 2020, he received a message via Telegram Messenger (“Telegram”) from someone who identified himself as Kenneth (“TK”). TK asked the defendant if he could purchase Bitcoin worth in excess of S$300,000.00.14Foot Note 14×Defence (Amendment No. 2) (“Defence”) at para 4(a). 15 The defendant informed TK that the PSA required one to have a licence or exemption to operate as a payment service provider for digital payment tokens (“DPT”). Such DPTs included Bitcoin. This meant that the defendant could not sell TK any Bitcoin in his personal capacity. However, he could do so through his company, Qrypt, which was listed as an exempt entity in relation to DPTs by the Monetary Authority of Singapore (“MAS”) at the material time.15Foot Note 15×Defence at para 4(a)(i). 16 To complete this transaction, Know Your Client (“KYC”) as well as Anti-Money Laundering/Countering the Financing of Terrorism (“AML/CFT”) checks (collectively referred to as “the Checks”) had to be carried out. TK had to provide his national registration identification card (“NRIC”) for Qrypt’s compliance manager to complete the Checks in compliance with MAS regulations. TK responded that he was agreeable to providing Qrypt his NRIC details.16Foot Note 16×Defence at para 4(a)(ii).The defendant notified TK that Qrypt had insufficient Bitcoin to fill his order, but he would check to see if Qrypt could procure Bitcoin from another party.17Foot Note 17×Defence at para 4(a)(iii). 17 The defendant,quaQrypt’s authorised representative, then contacted the plaintiff (who was acting asGCX’s authorised representative) to inform him of the intended transaction with TK and to enquire whether GCX had sufficient Bitcoin to sell to Qrypt, in order to facilitate the proposed transaction with TK. The plaintiff confirmed that GCX had sufficient Bitcoin and that the deal could be concluded that afternoon.18Foot Note 18×Defence at para 4(b). 18 The defendant informed the plaintiff that the proposed transaction with the buyers of the Bitcoin would take place at 18 Spottiswoode Park Road, #33-05, Singapore 088642 (“the Premises”). The defendant told the plaintiff that he would let the plaintiff know when the buyers of the Bitcoin would arrive with the cash. This was evidenced in writing via Whatsapp messages exchanged between the plaintiff and defendant on 1 December 2020.19Foot Note 19×Defence at para 4(c). 19 The plaintiff and the defendant agreed to meet at the Premises at 4.30pm on 1 December 2020. Thereafter, the defendant contacted TKviathe Telegram. He informed TK that Qrypt was able to procure sufficient Bitcoin from GCX in order to resell the same to him. Further, he also informed TK that GCX’s representatives would be arriving at the Premises at 4.30pm that day – TK could therefore come at that time, or earlier, with the purchase price of the Bitcoin in cash. Finally, he informed TK that only an indicative rate for the Bitcoin could be given. The final rate for the Bitcoin would be confirmed once GCX had arrived at the Premises and counted the purchase price of the Bitcoin with their counting machine.20Foot Note 20×Defence at para 4(d). 20 TK responded and informed the defendant that he would be present at the Premises with his staff. He emphasised to the defendant that all communications between Qrypt, the defendant and/or himself (ie, TK), would be via the Telegram. There should be no verbal communication between the parties at that time. Further, TK and his staff would only be there to deliver the purchase price of the Bitcoin in cash to GCX, and to ensure that the Bitcoin that he had ordered was received.21Foot Note 21×Defence at para 4(e). 21 This did not raise red flags with the defendant. Having been involved in a number of similar previous transactions, he knew that middlemen and brokers often tried to protect their commissions by keeping the details of the transaction confidential.22Foot Note 22×Defence at para 4(f). 22 At about 3.40pm on 1 December 2020, TK once again contacted the defendantviathe Telegram to confirm the timing of the proposed transaction. The defendant confirmed the time and once again asked TK for his NRIC, in order for Qrypt’s compliance manager to run the Checks. TK said he would provide those details when he arrived at the Premises later that day. He further informed the defendant that he would arrive at 4.10pm with two other members of his staff.23Foot Note 23×Defence at para 4(g). 23 At 4.10pm on 1 December 2020, three individuals, who identified themselves as Kenneth, Eric Foo (“Eric”) and Chua Hong You (“Ah You”), (collectively referred to as “the Buyers”) arrived at the Premises. They informed the defendant that they were there to purchase the Bitcoin from GCX. The defendant assumed that the Kenneth in this group was TK. However, the defendant discovered from subsequent events that Kenneth may not have been the same person as TK.24Foot Note 24×Defence at para 4(h). 24 Eric had brought a bag with him. He took cash out of the bag and placed it on a table in the room. The defendant, who did not touch the cash at any point in time, told the Buyers that GCX would be arriving shortly with counting machines to count the cash.25Foot Note 25×Defence at para 4(i). 25 Upon the Buyers’ arrival at the Premises, the defendant informed the plaintiffviaWhatsapp that they could come over to the Premises. The plaintiff notified the defendant that they would arrive at 4.30pm.26Foot Note 26×Defence at para 4(j). 26 The defendant asked Kenneth for his NRIC in order to allow Qrypt’s compliance manager to complete the Checks. Kenneth declined and asked Ah You to provide his NRIC to Qrypt instead. Ah You complied and handed over his NRIC. Qrypt’s compliance manager conducted the Checks and Ah You was cleared to proceed with the transaction with the GCX.27Foot Note 27×Defence at para 4(k). 27 Just before the plaintiff arrived at the Premises, a man (the “2nd Buyer”) suddenly showed up. Like Eric, this man was also carrying a bag containing S$320,000.00 in cash. This caused some confusion – the defendant did not know who the man was or what he was doing at the Premises. Ah You, however, informed the defendant that the 2nd Buyer was another potential buyer of Bitcoin from GCX, and that he and/or Kenneth had arranged for the 2nd Buyer to be present as well. Additionally, the 2nd Buyer had been told to wait downstairs at the carpark of the Premises until the Buyers had completed the purchase of Bitcoin from GCX, but he came up earlier without warning.28Foot Note 28×Defence at para 4(l). 28 The defendant also claimed that TK had previously told him that if the transaction between the Buyers and GCX went smoothly, there might be further transactions that day – though TK did not furnish further details. The defendant had passed this information on to the plaintiff, who informed him of the maximum amount of Bitcoin that GCX could transact that day.29Foot Note 29×Defence at para 4(m). 29 The 2nd Buyer was told to leave the Premises and only to return once the transaction between the Buyers and GCX had been concluded.30Foot Note 30×Defence at para 4(n). 30 At or around 4.30pm, the plaintiff and Nik arrived at the Premises with their cash counting machines. They proceeded to count the cash the Buyers had brought along. The plaintiff and Nik confirmed that there was indeed S$320,000.00 in cash.31Foot Note 31×Defence at para 4(o).Nik then checked to spot rate for Bitcoin and sent the defendant the rate of S$26,356.00 for one Bitcoin. Upon receiving this, the defendant messaged TK via the Telegram and notified him that the previous indicative rate remained unchanged and queried if he accepted the same. TK responded in the affirmative.32Foot Note 32×Defence at para 4(p). 31 Pursuant to the above, the defendant alleges that the following agreements were entered into by the parties:33Foot Note 33×Defence at para 4(q). The 1st Agreement (i) Qrypt and GCX entered into an Agreement dated 1 December 2020, wherein GCX agreed to sell to Qrypt and Qrypt agreed to buy from GCX, 12.14 [Bitcoin] at the agreed price of S$320,000.00 (the “1st Agreement”), as evidenced in writing via WhatsApp messages exchanged between the Plaintiff and the Defendant on 1 December 2020 (i.e. where the Defendant clearly identified himself as acting on behalf of Qrypt with regard to the subject matter of the Agreement). The 2nd Agreement (ii) Qrypt and the Buyers entered into an Agreement dated 1 December 2020, wherein Qrypt agreed to sell to the Buyers and the Buyers agreed to buy from Qyrpt, 11.982443 [Bitcoin] at the agreed price of S$320,000.00 (i.e. with 0.157557 [Bitcoin] being the 1% administration fee (the “AdminFee”) paid by the Buyers to Qrypt for facilitating the transaction between the Buyers and the Sellers for the 12.14 [Bitcoin], as previously agreed between Qyrpt and TK (the “2nd Agreement”), as evidenced in writing via the Telegram [application] messages exchanged between the Defendant and TK on 1 December 2020 (i.e. where the Defendant clearly identified himself as acting on behalf of Qrypt with regard to the subject matter of the 2nd Agreement). [emphasis in original] 32 Given the two agreements, the defendant alleged that it was clear to the parties of the 1st Agreement,viz, the plaintiff, that it was not a final transaction and that Qrypt (acting through the defendant) was acting as the middleman to facilitate the sale of the 12.14 Bitcoin from GCX to the Buyers.34Foot Note 34×Defence at para 4(r).The defendant further argued that it was necessary for the 1st Agreement to be between Qrypt and GCX (as opposed to transacting in their personal capacities), given the requirements of the PSA (where one needed a licence to carry out such transactions). In that regard, Qrypt was the only entity which had the sanction of MAS to carry out such transactions at the material time.35Foot Note 35×Defence at para 4(s). 33 The defendant said that GCX proceeded to verify Qrypt’s wallet addressviaWhatsapp and sent the 12.14 Bitcoin to Qrypt’s wallet. Once Qrypt had received this 12.14 Bitcoin, Qrypt, through the defendant, sent the agreed upon 11.982443 Bitcoin to the Buyers at the wallet address which TK had previously provided to the defendant (“the Buyers’ Wallet”) to facilitate the transaction.36Foot Note 36×Defence at para 4(t). 34 Upon hearing that Qrypt had sent the 11.982443 Bitcoin to the Buyers’ Wallet, Eric asked Kenneth for verification of the same and/or a transaction hash to be sent to him immediately. The defendant observed Kenneth sending Eric the transaction hash. However, the verification process took over an hour, possibly because the Bitcoin network was very slow that day. The defendant understood TK to be holding out on transferring a certain quantity of USDT to Eric until TK received confirmation that the 11.982443 Bitcoin had been successfully transferred to the Buyers’ Wallet. In relation to this, TK had earlier informed the defendantviathe Telegram that his staff were getting their salaries and commissions in USDT.37Foot Note 37×Defence at para 4(u). 35 During this time, the GCX representatives (ie, the plaintiff and Nik) asked if they could leave the Premises with the cash in hand. The Buyers disagreed. They said that everyone could only leave after the transaction ID showed that the 11.982443 Bitcoin had been successfully transferred to the Buyers’ Wallet. The defendant then: a) showed the Buyers that the transaction was sent by Qrypt to the Buyers’ Wallet; and b) told Ah You and Eric that TK had already received the 11.982443 Bitcoin, and that they should check with him on the same. However, Kenneth kept denying that the 11.982443 had been transferred to the Buyers’ Wallet, and told Eric to wait for confirmation of the same. During this time, Eric repeatedly asked for the confirmation and transaction ID from Kenneth.38Foot Note 38×Defence at para 4(v). 36 The defendant points to the fact that although the plaintiff and Nik knew and heard the multiple confirmations from the defendant that the 12.14 Bitcoins were well received by Qrypt from GCX, they did not leave with the cash. He claims that this demonstrates that GCX knew that the transaction was multi-staged and that the ultimate recipient of the Bitcoin was not Qrypt, nor the defendant, but the Buyers. That the plaintiff and Nik waited throughout the transaction for about two hours and did not take the cash despite the defendant informing them that the Bitcoin had already been sent to Qrypt’s wallet, was telling. If the transaction was merely for GCX to receive the cash in exchange for the Bitcoins they had transferred, then the plaintiff and Nik would have taken the cash in return for the Bitcoin transferred and left once Qrypt had confirmed that the Bitcoin had been sent to Qrypt’s wallet.39Foot Note 39×Defence at para 4(w). 37 Once confirmation had been received from the Bitcoin network that the 11.982443 Bitcoin had been successfully transferred from Qrypt to the Buyers’ Wallet, the defendant informed TK of the sameviathe Telegram. At this juncture, things fell apart. The defendant saw that TK suddenly deleted his entire Telegram message history with him. Kenneth began to panic and claimed that the 11.982443 Bitcoin had not been transferred to his wallet and that the Buyers should take their cash and leave the Premises.40Foot Note 40×Defence at para 4(x). 38 A quarrel ensued, and the police were called. All parties present at the Premises had their statements taken. The police informed everyone present that GCX had been scammed out of the 11.982443 Bitcoin and that it should file a police report and wait for the outcome. The Buyers could retrieve the cash because, pending further investigations into the matter, they appeared to be the victims of a failed trade and/or transaction which did not take place.41Foot Note 41×Defence at para 4(y). 39 The defendant assisted the police with printing out the relevant Bitcoin transactions after everyone’s statements had been recorded. In addition, Qrypt (viathe defendant) voluntarily transferred the Admin Fee to GCX’s designated wallet address.42Foot Note 42×Defence at para 4(z). 40 The defendant made a further police report on 2 December 2020.43Foot Note 43×Defence at para 4(aa).In the aftermath, GCX and/or the plaintiff as well as the Buyers, made no substantial attempt or effort to get the defendant and/or Qrypt to reimburse the lost Bitcoins, as all parties were aware that a scam had taken place.44Foot Note 44×Defence at para 4(bb). 41 In a nutshell, the defendant’s case is that Qrypt was merely a middleman broker who acted to facilitate the sale of the 12.14 Bitcoin from GCX to the Buyers. Both GCX and Qrypt were victims of a scam perpetrated by TK and/or the Buyers – in that vein, the defendant was also a victim of the same scam and thus could not be liable to GCX and/or the plaintiff. Finally, and most importantly, that the correct parties to this matter should be GCX and Qrypt, and not the plaintiff and the defendant.45Foot Note 45×Defence at para 4(cc).",
        "Issues": "42 The defendant’s case made much of the fact that he was a victim of a scam. However, this was not relevant because the plaintiff’s main claim against the defendant was for breach of contract. His alternative claim was for restitution, on the basis that there was a total failure of consideration.46Foot Note 46×SOC at paras 5 and 9.Neither claim requires the plaintiff to disprove that the defendant was indeed a victim of a scam. Therefore, the fact that the defendant had been scammed is irrelevant to his defence. The more fundamental question, according to the defendant’s pleaded case, is who the proper parties to the contract are. 43  This point came up during the course of the trial when counsel for the plaintiff, Mr Maiyaz, sought to produce documents which were “supposed to show that part of the---part of the defendant’s case is that there was a scam that was perpetrated potentially by the actual buyers of the [Bitcoin]”.47Foot Note 47×Transcript dated 25 May 2022 at p 110 ln 1–4.I queried parties on the relevance of whether the defendant had indeed been scammed to the present dispute.48Foot Note 48×Transcript dated 25 May 2022 at p 110 ln 1 to p 127 ln 26. 44 After some toing and froing, both parties agreed to proceed on the assumption that the defendant had been scammed.49Foot Note 49×Transcript dated 25 May 2022 at p 115 ln 18 – p 118 ln 29.I therefore make no finding, based on the evidence before me, as to whether the defendant had indeed been scammed. 45 Having clarified this point, I set out the issues in this dispute: (a) Was the Agreement illegal, and thus unenforceable? (b) Are both the plaintiff and the defendant the proper parties to the Agreement, as they were dealing in their personal capacities? (c) Can the plaintiff succeed in its unjust enrichment claim? 46 I turn now to address these issues,seriatim.",
        "Was the Agreement illegal, and thus unenforceable?": "47 This argument only arose in the defendant’s closing submissions.50Foot Note 50×Defendant’s Closing Submissions (“DCS”) at paras 28 and 30.It was not pleaded in his defence. CitingANC Holdings Pte Ltd v Bina Puri HoldingsBhd[2013] 3 SLR 666 (“ANC Holdings”) at [102], the defendant argues that the court can “take cognisance of evidence of illegality” even if it is not pleaded. The defendant’s position is that regardless of whether the plaintiff or GCX was the proper party to the Agreement, the Agreement would be illegal and thus unenforceable. This was because, at the material time, neither the plaintiff nor GCX had a licence or an exemption to operate as a Payment Service Provider under the PSA. In short, the defendant is trying to invoke the doctrine ofexturpi causa non oritur actio,which applies to contract, as it does to tort:Koon Seng Construction Pte Ltd v Chenab Contractor Pte Ltd andanother[2008] 1 SLR(R) 375 (“Koon SengConstruction”) at [28]–[30]. 48 The plaintiff’s response is that the Agreement was not an illegal one, because the transaction in question was a peer-to-peer (“PTP”) transaction, for which a licence or an exemption under the PSA was not required.51Foot Note 51×Plaintiff’s Reply Submissions at paras 5.1–5.8. 49 While the defendant did not plead illegality in the present case, it is clear that the court can invoke illegality of its own motion:North Star (S) Capital Pte Ltd v Yip FookMeng[2021] 1 SLR 677 (“North Star”) at [11];Siraj Ansari bin Mohamed Shariff v Julianabte Bahadin and another[2022] SGHC 186 at [17];Fan Ren Rayand others v Toh Fong Peng and others[2020] SGCA 117 at [13];Koon Seng Constructionat [31]. The court is, after all, duty-bound to uphold Singapore’s laws and public policy. The mere fact that illegality was not pleaded does not, and cannot, mean that the court must remain blind to the illegality:ANC Holdingsat [84]. 50 The court, however, can only invoke illegality where one or more of the following propositions set out inEdlerv Auerbach[1950] 1 KB 359 at 371 (“Edler”) are satisfied:North Starat [11] citingTing Siew May v Boon Lay Choo andanother[2014] 3 SLR 609 (“Ting SiewMay”) at [29]: … [F]irst, that, where a contract is ex facie illegal, the court will not enforce it, whether the illegality is pleaded or not [the “FirstEdler Proposition”]; secondly, that, where … the contract is not ex facie illegal, evidence of extraneous circumstances tending to show that it has an illegal object should not be admitted unless the circumstances relied on are pleaded [the “SecondEdler Proposition”]; thirdly, that, where unpleaded facts, which taken by themselves show an illegal object, have been revealed in evidence (because, perhaps, no objection was raised or because they were adduced for some other purpose), the court should not act on them unless it is satisfied that the whole of the relevant circumstances are before it [the “ThirdEdler Proposition”]; but, fourthly, that, where the court is satisfied that all the relevant facts are before it and it can see clearly from them that the contract had an illegal object, it may not enforce the contract, whether the facts were pleaded or not [the “FourthEdler Proposition”]. [emphasis in original] 51 In the present case, theFirstandFourthEdler Propositionsare relevant. Therefore, to invoke illegality, I have to be satisfied that the Agreement was eitherex-facieillegal under Singapore law, or whether all the relevant facts are before me, and I can see clearly from these facts that the contract had an illegal object.",
        "Whether the Agreement was ex facie illegal": "52 As to whether the Agreement wasex-facieillegal, one must examine the relevant statutory provisions. In the present case, that provision is s 5 of the PSA, which states: Licensing of payment service providers 5.—(1)A person must not carry on a business of providing any type of payment service in Singapore, unless the person — (a) has in force a licence that entitles the person to carry on a business of providing that type of payment service; or (b) is an exempt payment service provider in respect of that type of payment service. (2)  For the purposes of subsection (1), where a person provides any type of payment service while the person carries on any business (called in this subsection the primary business) — (a) the person is presumed to carry on a secondary business of providing that type of payment service, regardless whether the provision of that type of payment service is related or incidental to the primary business; and (b) the presumption in paragraph (a) is not rebutted by proof that the provision of that type of payment service is related or incidental, or is both related and incidental, to the primary business. (3)  A person that contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction — (a) in the case of an individual, to a fine not exceeding $125,000 or to imprisonment for a term not exceeding 3 years or to both and, in the case of a continuing offence, to a further fine not exceeding $12,500 for every day or part of a day during which the offence continues after conviction; or (b) in any other case, to a fine not exceeding $250,000 and, in the case of a continuing offence, to a further fine not exceeding $25,000 for every day or part of a day during which the offence continues after conviction. [emphasis added] 53 It is clear from the statutory wording of s 5 that it does not expressly declare that contracts for the sale and purchase of Bitcoin or cryptocurrency are illegal: seeThe Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2nd Ed, 2022) (“The Law of Contract in Singapore”) at para 13.019;Ting Siew Mayat [107]–[109]. This is unlike, for example, s 5 of the Civil Law Act 1909, the language of which makes clear that gambling contracts are illegal and unenforceable: Agreement by way of gaming or wagering to be null and void 5.—(1)  All contracts or agreements, whether by parol or in writing, by way of gaming or wagering shall be null and void. (2)  No action shall be brought or maintained in the court for recovering any sum of money or valuable thing alleged to be won upon any wager or which has been deposited in the hands of any person to abide the event on which any wager has been made. 54 The next question I have to consider is whether the statute did impliedly prohibit such contracts (ie, for the sale and purchase of cryptocurrencies). In this regard, the key question is whether the object of the statute (or the statutory provision in question) is only to prohibit the conduct that is the subject of the statutory penalty, or whether that object also extends to a prohibition of the contract itself:The Law of Contract in Singaporeat [13.031];Ting Siew Mayat [116];Ochroid Trading Ltdand another v Chua Siok Lui (trading as VIE Import & Export) and another[2018] 1 SLR 363 (“Ochroid”) at [27]–[28]. The court, however, will be slow to imply the statutory prohibition of contracts – it will therefore not be held that any contract, or class of contracts, is impliedly prohibited by statute unless there is a “clear implication” or “necessary inference” that this was what the statute intended:Ochroidat [28] citingTing Siew Mayat [110]. 55 The PSA is meant to provide a “forward looking and flexible framework for the regulation of payment systems and payment service providers in Singapore”. Additionally, it is meant to provide “regulatory certainty and consumer safeguards, while encouraging innovation and growth of payment services and Fintech.” Amongst other things, the PSA provides a regulatory framework for cryptocurrency dealing or exchange services. The purpose of this regulatory framework is to tackle the “significant money laundering and terrorism financing risks” arising from “the anonymous and borderless nature of the transactions” which are enabled by cryptocurrency dealing or exchange services: Singapore Parliamentary Debates,Official Report(14 January 2019) vol 94 (Ong Ye Kung, Minister for Education). 56 With this in mind, it is clear that s 5 of the PSA does not impliedly prohibit contracts relating to the sale and purchase of cryptocurrency. Parliament’s intent was to establish a regulatory regime for cryptocurrency dealing or exchange services. To that end, persons or entities can only provide cryptocurrency exchange services if they are licensed under the PSA or have obtained the requisite exemptions. The point of s 5, therefore, is to penalise those caught providing such services without the requisite licence or exemption. 57 Such an interpretation is also supported by the wording of s 5 itself. The starting point is the definition of a digital payment token which can be found in s 2(1) of the PSA: “digital payment token” means any digital representation of value (other than an excluded digital representation of value) that — (a) is expressed as a unit; (b) is not denominated in any currency, and is not pegged by its issuer to any currency; (c) is, or is intended to be, a medium of exchange accepted by the public, or a section of the public, as payment for goods or services or for the discharge of a debt; (d) can be transferred, stored or traded electronically; and (e) satisfies such other characteristics as the Authority may prescribe; … 58 Bitcoin, and other similar cryptocurrencies, fall within the definition of a digital payment token under s 2 of the PSA. Further, under the First Schedule of the PSA, “digital payment token service” includes the buying or selling of that digital payment token in exchange for any money or any other digital payment token. Read together with s 5 of the PSA, this means that persons who carry on a business of providing any type of payment service in relation to Bitcoin without the requisite licence or exemption, would contravene that provision. 59 Therefore, the object of s 5 of the PSA is limited in scope. It does not include an implied prohibition on such contracts or contracts formed in cases where the person has run afoul of s 5 of the PSA. Its object is to enforce the regulatory framework established by the PSA by penalising those caught operating a payment service without the requisite licences or exemptions. There is no clear implication, nor is it a necessary inference that s 5 of the PSA is also intended to prohibit such a class of contracts. 60 The Agreement was, therefore, notex facieillegal.",
        "Whether the relevant facts before me support a finding that the Agreement had an illegal object": "61 I now consider whether the relevant facts before me allow me to conclude that the Agreement had an illegal object,viz, to contravene s 5 of the PSA. In this regard, the facts ofPublic Prosecutor v LangeVivian[2021] SGMC 11 (“Lange Vivian”) are useful. The accused in that case had been charged,inter alia, with an offence under s 5 of the PSA. She had come across a job offer by one “Addie” on Facebook. The job was to receive monies in her bank account, make bank transfers and use the monies to purchase Bitcoin as instructed by Addie. She would receive 10% of the transaction amount as commission. She took on the job, and from 27 to 28 February 2020, she carried on the business of providing a payment service in Singapore (Lange Vivianat [5]). 62 During this period, she received a total of 13 inward transfers, amounting to S$3,350.00. She withdrew a total of S$2,780.00 from the monies she received as cash, with which she used to purchase Bitcoin. This Bitcoin was then transferred to specific Bitcoin wallets on Addie’s instructions. For carrying out these transactions, the accused made a profit of S$278.00 (Lange Vivianat [5]). 63 Because the accused did not have a licence which entitled her to carry on a business of providing a digital payment token service, nor was she an exempt payment service provider of digital payment token services, she was charged with an offence under s 5(1) of the PSA, which was punishable under s 5(3)(a) of the PSA (Lange Vivianat [4]). She elected to plead guilty and was sentenced to four weeks’ imprisonment (Lange Vivianat [23]). 64 In the present case, I do not think that the Agreement had an illegal object. There is no contravention of s 5 of the PSA. As that provision clearly states: “A personmust not carry on a businessof providing any type ofpayment servicein Singapore” [emphasis added]. As can be gleaned from the facts ofLange Vivian, there appear to be three indicia which suggest that a person is carrying on a business of providing a type of payment service in Singapore. First, that a profit had been made. InLange Vivian, the accused had pocketed a 10% commission. Second, the number of transactions in question. Again, inLange Vivian, the accused had received 13 inward transfers and used that money to make an unspecified number of Bitcoin transfers to various unknown parties. Third, the role which the accused inLange Vivianplayed in the transactions. It was evident that she was acting as an intermediary. Party A would pass the accused fiat currency through her bank account. The accused would then take the fiat currency and purchase cryptocurrency and facilitate the transfer of that cryptocurrency to Party B. 65 This requirement of “[carrying] on a business” was, in my view, a key element in establishing liability under s 5 of the PSA. After all, the PSA is meant to establish a regulatory framework to govern service providers, especially those who provided digital payment token services. It would be a step too far to hold that the mere buying and selling of cryptocurrency could expose one to liability under s 5 of the PSA. The third indicia which I have highlighted above is therefore, in my view, an important factor that distinguishesbona fidetrading in cryptocurrencies from providing an unlicensed digital payment token service which would expose one to criminal liability under s 5 of the PSA. 66 In the present case, the plaintiff was selling Bitcoin in his possession to the defendant (who was either acting in his own personal capacity, or on behalf of Qrypt). It was clear to me that the plaintiff was not providing any type of payment service and certainly was not carrying on a business of providing a payment service. Therefore, the Agreement did not have an illegal object and did not contravene s 5 of the PSA. 67 The defendant specifically pleaded in paragraph 4(q) of the Defence that there were two separate contracts in this transaction. The 1st Agreement was between the seller, GCX, and Qrypt and the 2nd Agreement was between Qrypt and the Buyers. The plaintiff’s case (aside from the issue of the identity of the parties) is exactly the same, that it was a simple sale agreement between the plaintiff and the defendant, and it was not contingent on any other agreement. Certainly, the manner in which the transaction was conducted is consistent with the nature of the contractual relationship, which both parties had pleaded. The plaintiff turns up at the defendant’s office, the money is on the table on the understanding that once the transfer of the Bitcoin is confirmed, the plaintiff is entitled to walk away with the cash. Furthermore, the fact that the defendant did not disclose to the plaintiff the identity of the ultimate buyer is consistent with the position that the defendant is not a mere middleman and that the 1st and 2nd Agreements are independent of each other. It was thus clear to me that the third indicia which I have highlighted above was absent from the present transaction. The plaintiff did not act in the same manner which the accused inLange Vivianhad. 68 There is no dispute that the 12.14 Bitcoin were received in the wallet of the defendant (or Qrypt). However, the plaintiff did not receive the S$320,000.00 cash in accordance with the terms of the Agreement between them. The defendant is therefore in breach of the contract, and to the extent that payment for the balance of Bitcoins after the return of 0.157557 Bitcoin has not been made, the defendant will be liable for this, subject to my finding on the proper parties to the Agreement.",
        "Whether the plaintiff and the defendant are the proper parties": "69 It goes without saying that only parties to a contract have the standing to sue and enforce those contractual obligations (The “Dolphina”[2012] 1 SLR 992 at [185]; see alsoMust Rich Construction Ltd v Chan KaLok[2022] HKEC 35). This is a trite principle of law. It has been observed that this principle is especially pertinent where parties are dealing through intermediaries:B High House International Pte Ltd v MCDP Phoenix Services PteLtd and another[2023] SGHC 12 citing Paul S Davies and Tan Cheng-Han,Intermediaries in Commercial Law(Hart Publishing, 2022). 70 The defendant’s position is that he cannot be liable in contract, nor does the plaintiff have standing to sue, simply because neither of them were parties to the Agreement. This essentially boils down to whether both the plaintiff and defendant were acting in their personal capacities, or if they were acting on behalf of GCX and Qrypt, respectively.",
        "Approach to identifying the proper parties to a contract": "71 The approach taken to identifying the proper parties to a contract is an objective one:iVentureCard Ltd and others v Big Bus Singapore City Sightseeing Pte Ltd and others[2022] 1 SLR 302 (“iVenture”) at [26]. In cases where the contract is contained in a document, the inquiry centres on whether the document sufficiently and unequivocally identifies the parties to the contract:Americas Bulk Transport Limited(Liberia) v Cosco Bulk Carrier Limited (China) m.v. Grand Fortune[2020] EWHC 147 (Comm) (“Americas BulkTransport”) at [19(i)] citingHector vLyons(1988) 58 P & CR 156 andShogun Finance Limited vHudson[2004] 1 AC 919perLord Hobhouse at [49]. In such cases, the rule which stipulates that “where a person signs a contract with no qualification as to the capacity in which he signs, he will be a party to the contract unless the document makes it clear that he contracted as an agent” will be relevant:Bhoomatidevid/o Kishinchand Chugani Mrs Kavita Gope Mirwani v Nantakumar s/o v Ramachandra and another[2023] SGHC 37 at [20] citingGregor Fisken Limited v Bernard Carl[2021] EWCA Civ 792. 72 However, the approach is slightly different in cases where the contract is contained in, or evidenced in writing, but the document(s) containing or evidencing the agreement does not enable the parties to be ascertained. In such cases, recourse is “permitted of what the parties said to each other and what they did down to the point at which a contract was concluded for the purpose of determining who the parties to the agreement were intended to be”:Americas BulkTransportat [19(ii)] citingEstorLimited v Multifit (UK) Limited[2009] EWHC 2565 (TCC) at [26]. In such cases, the objective approach still applies, and the pertinent question is what “a reasonable person furnished with the relevant information … would conclude”:Americas BulkTransportat [19(iii)] citingHamid v Francis Bradshaw Partnership[2013] EWCA Civ 470 at [57(ii)]. The application of this principle is usefully illustrated by the following cases. 73 IniVenture, the SGCA agreed with the trial judge’s findings that it was iVenture Card and not iVenture Travel which was the proper party to the Reseller Agreement (at [42]). First, the Reseller Agreement was concluded around the same time as the Licence and Service Level Agreements which was formed between iVenture Card and Big Bus. Based on the number of transactions and modest sums involved, it would make commercial sense if these sales were aggregated to one entity within the iVenture Group. That entity was likely iVenture Card. Strengthening this inference was the fact that the business transacted under the Reseller Agreement was accessory or incidental to the Licence Agreement formed between iVenture Card and Big Bus (iVentureat [31]). Further, there was no evidence that Big Bus was even aware of iVenture Travel’s existence prior to the Reseller Agreement (iVentureat [32]). In any case, the SGCA had also noted that the appellants themselves had originally pleaded that iVenture Card and not iVenture Travel was the contracting party to the Reseller Agreement (iVentureat [35]); and that the contractual clause in the Licence Agreement which iVenture Card relied on actually created no legally binding contract in itself (iVentureat [34]). 74 Then, there was the decision of Jason Coppel QC (sitting as a Deputy High Court Judge) inDiane Lumley v Foster & Co Group Ltd& Ors[2022] EWHC 54 (TCC) (“Lumley”). The suit inLumleyarose out of a building and construction dispute. The claimant sued the six defendants for breach of a contract. She alleged that one or more of the defendants had agreed to carry out construction works on her home in East Barnet, London. The works were performed in an allegedly sub-standard manner. The result: the property was scarcely habitable, which diminished its value and necessitated substantial remedial works (Lumleyat [1]–[2]). 75 InLumley, parties agreed that a contract had been concluded at a meeting at the property itself on 21 June 2016. This meeting was attended by the claimant and the second defendant, Mr Foster (Lumleyat [5]). The claimant pleaded that the contract had been concluded by the second defendant on behalf of all the defendants. Mr Foster’s pleaded defence was that the contract had been concluded between the claimant and the fifth defendant (Foster and Co Construction). If this was indeed the case, then the claim would be worthless as the fifth defendant had ceased trading and was being wound up. In the claimant’s reply, she alleged that the contract was between her and Mr Foster, or alternatively both Mr Foster and Mrs Foster (the third defendant) who together traded as Foster and Co (or the Foster and Co Group) (Lumleyat [2]). Directions were given that there be a trial of the preliminary issue as to which of the defendants were parties to the contract formed with the claimant (Lumleyat [3]). 76 Coppel QC found that the contract was between the claimant and the second defendant. In arriving at this conclusion, he applied an objective approach to ascertaining the identities of the parties to the contract, citingEstorLtd v Multifit (UK) Ltd[2009] EWHC 2565 (TCC) at [26]. The central question, according to Coppel QC, was whether the objective facts surrounding the meeting on 21 June 2016 indicated that the second defendant had entered into the contract in a personal capacity, or whether he was doing so on behalf of a company (Lumleyat [24]). The second defendant was “concerned to give every impression that the [c]laimant was reaching agreement with him, that she could trust him and that he would be personally responsible for the project” (Lumleyat [27]). In particular, the second defendant had made multiple representations to the claimant at the meeting on 21 June 2016, in order to induce her to enter into the contract, without any indication that the contract would in fact be with the fifth defendant, or any other corporate entity. Crucially, the second defendant did not take reasonable steps to document and formalise the contract, nor did he make clear that the contract was with the fifth defendant or some other corporate entity (Lumleyat [27]). In addition, Coppel QC also found that it was not entirely clear that the second defendant was attending the meeting as an agent for the fifth defendant or some other corporate entity. It appeared that the second defendant’smodus operandiwas to represent himself as the face of his brand, whilst leaving opaque the network of entities which did the work he brought in; and this opacity appeared to be deliberate given that there was a pattern of group companies belonging to the second defendant which ceased to trade or became insolvent, upon which other entities would take their place (Lumleyat [28]). It was on the basis of these facts that Coppel QC also arrived at the conclusion that the second defendant had not been contracting on behalf of an undisclosed principal (Lumleyat [33]).",
        "The plaintiff is not the proper party to the Agreement": "77 I find that the plaintiff is not the proper party to the Agreement. There are, to my mind, a number of factors pointing to this conclusion. 78 For one, the defendant had communicated with the plaintiffviathe GCX chat (“the GCX Chat”). As the defendant points out, this was a chat group operated by GCX to facilitate transactions for cryptocurrencies.52Foot Note 52×DCS at para 31.In support of this point, the defendant relies on the following message sent by one “Stacy Gcx”:53Foot Note 53×Rio Christofle AEIC dated 15 March 2022 at p 8. Welcome toGCX Capital!This is a dedicated chat group with our team of highly qualified professionals readily available to assist you. Do feel free to ask for any indicative rates, and input the word “lock” to lock in the rates. We will always provide you with the best rates at all times. Thank you for placing your trust and confidence in our team and we look forward to trading with you! [emphasis added] 79 GCX Capital, however, was a different company from GCX.54Foot Note 54×Transcript dated 23 May 2022 at p 82 ln 5–8.In any event, this is immaterial because the plaintiff was cross-examined on this specific point and he admitted that the GCX Chat was run by GCX,55Foot Note 55×Transcript dated 25 May 2022 at p 62 ln 14–20.although his story was that it was operated by GCX up till 28 July 2020 (which was when GCX allegedly ceased operations).56Foot Note 56×Transcript dated 25 May 2022 at p 62 ln 14–20.The plaintiff also alleged that the defendant had been informed by his brother, RC, that GCX had ceased operations and should therefore have known that GCX was no longer operating the GCX Chat.57Foot Note 57×Transcript dated 25 May 2022 at p 69 ln 3–7. 80 I do not find that the evidence supported the plaintiff’s version of events. There was no documentary evidence showing that RC had told the defendant that GCX had ceased operations. The plaintiff was forced to concede as much under cross-examination.58Foot Note 58×Transcript dated 25 May 2022 at p 69 ln 4 to p 73 ln 3.However, leaving that aside, there was other evidence which showed that the GCX Chat had continued to be operated by GCX after 28 July 2020, contrary to the plaintiff’s assertions. 81 This was evident from the various messages exchanged on the GCX Chat. For example, in a transaction for the sale and purchase of 3500 USDT on 8 September 2020, one Lim Kah Yeow (“Kaya”) replied with the following:59Foot Note 59×Rio Christofle AEIC dated 15 March 2022 at p 73.  Kaya’s role, according to the plaintiff in his examination-in-chief, was that of a customer service manager – at least prior to 28 July 2020 (which was the date when GCX had allegedly ceased trading in cryptocurrencies).60Foot Note 60×Transcript dated 25 May 2022 at p 39 ln 14. 82 The plaintiff was then cross-examined on what Kaya had said. He explained that Kaya had said “thanks for trading with GCX” because he was a “creature of habit” and had “made a mistake”.61Foot Note 61×Transcript dated 25 May 2022 at p 74 ln 8.While Kaya was cross-examined, he was not specifically questioned as to why he had sent this message on 8 September 2020. 83 In my view, I did not think that what Kaya had said could be chalked up to a simple error. Perusing the records of the GCX Chat, it was clear that Kaya, for one, had been given specific instructions by the plaintiff on how to address clients,62Foot Note 62×Transcript dated 25 May 2022 at p 74 ln 11 – 21.and that it was evident that he had followed those instructions to a tee. For instance, when communicating with the defendant, he was polite and deferential, as can be seen from the following extracts:63Foot Note 63×Rio Christofle AEIC dated 15 March 2022 at p 71.    According to the plaintiff, prior to GCX ceasing business on 28 July 2020, his staff used to have a certain way of saying things – and this was why Kaya had said what he said on 8 September 2020.64Foot Note 64×Transcript dated 25 May 2022 at p 74 ln 6–21.Despite knowing this, however, there is no evidence that the plaintiff took steps to instruct his staff on what they should say after GCX had allegedly ceased operating, to avoid giving the false impression that GCX was still in business. This, in my view, spoke volumes – it was unlikely that what Kaya had said was a mistake. I would add that evenifKaya had made a mistake, the plaintiff was present in the GCX Chat and could have very easily clarified matters. However, this was never done. 84 There was also nothing which could be gleaned from the messages exchanged on the GCX Chat on 1 December 2020 which suggested that the plaintiff was dealing in his personal capacity. While the plaintiff had gone to great pains to repeatedly emphasise that GCX had ceased operations after 28 July 2020, the absence of any such indication on the GCX Chat was not only puzzling, but also telling. If it were truly the case that GCX had ceased operations, then the plaintiff would have, and should have taken steps to make it clear on the GCX Chat. Taken in the round, a reasonable person would conclude that it was GCX who was the proper party to the Agreement, and not the plaintiff acting in his personal capacity. There was no evidence the plaintiff could point to which indicated otherwise. While the plaintiff pointed to a police report filed by the defendant in the wee hours of 2 December 2020 as proof that the Agreement had been concluded with the plaintiff and not GCX,65Foot Note 65×Plaintiff’s Closing Submissions at para 4.3.12.I am not inclined to place much weight on that report, as it was madeafterthe Agreement had been concluded. 85 My finding that the plaintiff is not the proper party to the Agreement also means that the plaintiff has no standing to maintain the action in contract.",
        "The defendant is not the proper party to the Agreement": "86 I also find that the defendant is not the proper party to the Agreement. 87 The most important factor for my finding is the fact that it was Qrypt that held the exemption from holding a licence under the PSA for the provision of a digital payment token service. It was not the defendant. Therefore, the defendant could not have intended to enter into the Agreement in his personal capacity. Furthermore, the defendant had provided Qrypt’s bank details for the transaction. And finally, although this is not the most important factor, the plaintiff, being a person familiar with the trading of cryptocurrency, would be in a position to know the PSA requirements. The plaintiff, through GCX, certainly had previous dealings with Qrypt.",
        "Conclusion": "88 In the circumstances, I dismiss the plaintiff’s claim. It appears to me that the plaintiff ought to have included GCX as a second plaintiff, and Qrypt as second defendant in pursuing this claim. 89 As the defendant has succeeded in defending this action, costs should be ordered in his favour. Both parties had tendered costs schedules. The plaintiff submits that S$115,000.00 (including disbursements) is appropriate. The defendant submits that S$181,113.28 is an appropriate sum. 90 Having regard parties’ submissions, as well as all the relevant factors, including the nature of the issues in contention, the level of complexity and the work that appears to have been done, I award the defendants S$90,000.00 in legal costs (inclusive of disbursements) plus GST. The plaintiff shall pay these costs to the defendant, with interest from the date of judgment at 5.33%. Payment is to be made within four weeks. 91 I wish to make one final observation regarding the KYC process practised by the defendant in this case. It is worthwhile reproducing at [26] above which sets out what happened: 26  The defendant asked Kenneth for his NRIC in order to allow Qrypt’s compliance manager to complete the Checks. Kenneth declined and asked Ah You to provide his NRIC to Qrypt instead. Ah You complied and handed over his NRIC. Qrypt’s compliance manager conducted the Checks and Ah You was cleared to proceed with the transaction with the GCX. 92 It must be borne in mind that the defendant, at that time, was under the impression that Kenneth was TK, the ultimate buyer of the Bitcoins. The KYC process is for the purpose of guarding against money laundering and other criminal activities within the financial system. Even though he believed that Kenneth was the ultimate buyer, the defendant was prepared to forgo compliance checks on Kenneth and agreed to make the checks in respect of Ah You. It seems to me that a responsible exempt person ought to be suspicious if the transacting party refuses to undergo compliance checks and pulls in another person to provide that person’s particulars for a transaction that the transacting party makes. It would certainly make a mockery of the KYC process. But I emphasise that I make no judicial finding on this point as it is not relevant to the issues in this action. It is an observation I make from the Bench, on the evidence before me, and perhaps the relevant authority may look into whether this practice is a satisfactory one. Lee Seiu KinJudge of the High Court Allister Lim Wee Sing and Liew Hui Min (ALP Law Corporation) for the plaintiff. Mohammad Maiyaz Al Islam (Magna Law LLC) for the defendant."
    }
}