{
    "case_title": "Tham Saik Mun SimonvPublic Prosecutor",
    "ncitation": "[2023] SGHC 179",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 This was a drink-driving case where the Appellant’s main defence at trial was that his breath alcohol levels would not have exceeded the prescribed limit under s 71A(2)(b)(ii) of the Road Traffic Act but for his post-driving application of Bonjela gel. Having failed to convince the trial court with this argument, he resurrected the same defence on appeal – in my view, to no greater degree of success. 2 The Appellant, Mr Tham Saik Mun Simon, was charged before the District Court with an offence of drink-driving punishable under s 67(1)(b) of the Road Traffic Act (Cap 276, 2004 Rev Ed) (“RTA”), for driving a motor van at an open-air carpark near Block 146 Yishun Street 11 (“the open-air carpark”) on 14 June 2019, at or around 2.00am, with a body alcohol content of 75 microgrammes (g) of alcohol per 100 millilitres (ml) of breath in excess of the prescribed limit of 35g / 100ml (the “Drink-Driving Charge”).1Foot Note 1×Record of Appeal (“RoA”) at p 6 (Proceeded Charge DAC-919501-2019). 3 The Appellant claimed trial to the Drink-Driving Charge. His main defence at trial was that his elevated Breath Alcohol Concentration (“BrAC”), as measured in his breath evidential analyser (“BEA”) test result, was attributable to his oral application of Bonjela gel after he had ceased to drive the motor van. This defence was rejected by the District Judge (“DJ”), who convicted the Appellant and sentenced him to three weeks’ imprisonment and a $6,000 fine (in default 12 days’ imprisonment). In addition, the Appellant was disqualified from holding or obtaining all classes of driving licences for four years (to take effect from the date of his release).2Foot Note 2×RoA at p 4 (Statement of Case). 4 The Appellant appealed against his conviction and sentence. On appeal, he revived his contention that his BEA test result had been attributable to his post-driving oral application of Bonjela gel.3Foot Note 3×RoA at pp 10–11 (Petition of Appeal at para 3). 5 Having considered parties’ submissions and the evidence on the record, I dismissed the Appellant’s appeal against his conviction and sentence on the Drink-Driving Charge. 6 I now provide the full grounds of my decision.",
        "Factual background": "7 The following facts were undisputed between the parties, as reflected in the Statement of Agreed Facts (“SOAF”) pursuant to s 267(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed).4Foot Note 4×RoA at p 501 (Statement of Agreed Facts (“SOAF”) at p 1). 8 The Appellant drove a motor van on 14 June 2019, at or about 2.00am, at the open-air carpark in Singapore.5Foot Note 5×RoA at p 501 (SOAF at paras 1 and 3–4).Mr Khoh Chee Xuan Russell (the “Complainant”) called the police at or around that time, reporting that a “Drunk Driver” wanted to hit him at the open-air carpark.6Foot Note 6×RoA at p 501 (SOAF at paras 2–3). 9 Police Sergeant Bernard Lau Meng Wai (the “Arresting Officer”) and his partner were dispatched to the open-air carpark, and subjected the Appellant to a breathalyser test, which he failed. The Arresting Officer arrested the Appellant for driving under the influence of alcohol and escorted him to Woodlands Police Division Headquarters (HQ) for further investigations.7Foot Note 7×RoA at p 501 (SOAF at para 4). 10 At Woodlands Police Division HQ, at or around 4.04am that day, Police Sergeant Mohamed Hafiz bin Mohamed Sidek (the “Administering Officer”) conducted a breathalyser test on the Appellant. The test result showed that the proportion of alcohol in the Appellant’s breath at that time was 75g / 100ml.8Foot Note 8×RoA at p 501 (SOAF at para 5).",
        "The proceedings below": "11 The Appellant claimed trial to the Drink-Driving Charge. The Prosecution called several witnesses to prove its case. They were as follows: (a) the Arresting Officer (see [9] above), who gave evidence that he had been dispatched to the incident location in the Drink-Driving Charge, performed a breathalyser test on the Appellant thereat, which he failed, then arrested the Appellant for drink-driving and escorted him to Woodlands Police Division HQ for further investigations;9Foot Note 9×RoA at pp 23–25 (12 October 2020 Transcript at pp 8–10). (b) the Administering Officer (see [10] above), who gave evidence that he administered a breathalyser test on the Appellant at Woodlands Police Division HQ, which generated a breath evidential analyser (“BEA”) results slip on the second attempt.10Foot Note 10×RoA at pp 42–44 (12 October 2020 Transcript at pp 27–29).This showed a result of 75g / 100ml of breath alcohol content within the Appellant’s breath specimen;11Foot Note 11×RoA at p 506 (SOAF at p 6). (c) Police Station Inspector Vilton Hia (the “Investigation Officer”), who gave evidence that, on 17 June 2019, he recorded one statement from the Appellant (the “Appellant’s Statement”);12Foot Note 12×RoA at pp 81–82 (12 October 2020 Transcript at pp 66–67). (d) the Complainant (see [8] above), who gave evidence that he lodged a First Information Report after he had seen the Appellant driving at the incident location stated in the Drink-Driving Charge;13Foot Note 13×RoA at pp 105–108 (13 October 2020 Transcript at pp 3–6). (e) Dr Yao Yi Ju of the Health Sciences Authority (the “HSA Expert”), who gave evidence on the contents of a report prepared by herself (the “HSA Report”)14Foot Note 14×RoA at pp 522–525 (Health Sciences Authority Report dated 23 October 2020).on the effects of the oral application of Bonjela gel on a subject’s breath alcohol levels;15Foot Note 15×RoA at pp 151–162 (23 June 2021 Transcript at pp 5–16). (f) Ms Christine Westphal of Dräger Safety AG (the “Dräger Expert”), who gave evidence on the functionality of the Dräger Alcotest 9510 SG machine,16Foot Note 16×RoA at pp 213–225 (14 February 2022 Transcript at pp 7–19).and on the contents of two statements from Dräger Safety AG that had been made with her involvement (the “Dräger Statements”), which addressed how the machine detected BrAC results from a subject’s breath specimens and the impact (if any) of Bonjela gel upon said BrAC readings;17Foot Note 17×RoA at pp 526–528 (Statement by Dräger Safety AG & Co dated 1 March 2019 and Statement by Dräger Safety AG & Co dated 17 December 2020).and (g) Mr Ong Wee Khoon Melvin of Draeger Singapore (the “Draeger Experimenter”), who gave evidence on an experiment that he conducted on the effects of a subject’s application of Bonjela gel upon the results obtained by the Dräger Alcotest 9510 SG machine from that subject’s breath specimens,18Foot Note 18×RoA at pp 273–285 (15 February 2022 Transcript at pp 4–16).and on the contents of the emails between himself and Dräger Safety AG (the parent company of Draeger Singapore) in which he had conveyed the results of the aforesaid experiment (the “Draeger Experiment Results”).19Foot Note 19×RoA at pp 529–532 (Email correspondence between Draeger Singapore Pte Ltd and Dräger Safety AG & Co dated 10 December 2020). 12 At trial, the Appellant's defence was that after he had parked the motor van, he had applied Bonjela gel to his mouth to alleviate the pain from his ulcers and a toothache. He maintained that he had consumed less than one jug of beer prior to his driving his motor van that day.20Foot Note 20×RoA at pp 322–331 (15 February 2022 Transcript at pp 53–62). 13 The Appellant also called Mr Ben Chan Keng Phang (the “Defence Expert”), who gave evidence on an experiment that he conducted on the effects of the oral application of Bonjela gel on a subject’s BEA test results,21Foot Note 21×RoA at pp 373–374 (16 February 2022 Transcript at pp 5–6).and on the contents of the study he prepared based on the findings of that experiment (the “Defence Experiment Results”).22Foot Note 22×RoA at pp 854–856 (Alcotech Ingested Bonjela BrAC Study).",
        "The decision below": "14 The DJ convicted the Appellant on the Drink-Driving Charge. The  reasons for her decision are set out inPublic Prosecutor v Tham Saik Mun Simon[2023] SGDC 15. 15 The DJ held that the assumption in s 71A(1) of the RTA was engaged, as it was not disputed that the Appellant had been driving the motor van at the time of the alleged offence in the Drink-Driving Charge.23Foot Note 23×RoA at pp 470–471 (Grounds of Decision (“GD”) at [42]–[44]).The effect of s 71A(1) is that the court assumes that the Appellant’s alcohol level at the time of the offence was the same as that contained in his breath sample (ie, 75g / 100ml). This assumption is only rebuttable by way of the exception under s 71A(2) of the RTA, with the burden being on the Appellant to make out that exception.24Foot Note 24×RoA at pp 471–472 (GD at [45]–[46]). 16 There were two elements for the exception under s 71A(2) to be made out, being that (a) the Appellant had consumed alcohol after he had ceased to drive, and (b) that had he not done so the proportion of alcohol in his breath or blood would not have exceeded the prescribed limit. At trial, the Prosecution accepted that the Appellant had applied Bonjela gel after he had stopped driving.25Foot Note 25×RoA at p 473 (GD at [50]).There was thus no dispute that s 71A(2)(a) of the RTA was satisfied, and the live issue of fact was whether the Appellant had shown, on a balance of probabilities, that if not for his post-driving application of the Bonjela gel, his breath alcohol levels would not have exceeded the prescribed limit of 35g / 100ml (per s 71A(2)(b)(ii) of the RTA).26Foot Note 26×RoA at pp 472–474 (GD at [47]–[53]). 17 The DJ found that the Appellant had failed to show this on a balance of probabilities. Hence, the Appellant failed to rebut the assumption in s 71A(1) of the RTA that his breath alcohol level at the time of his driving of the motor van had been 75g / 100ml. 18 In support of that conclusion, the DJ made the following findings of fact,viz: (a) that the Appellant’s last post-driving application of the Bonjela gel was around 1.40am on 14 June 2019, more than two hours prior to the administration of the breathalyser tests from 4.04am to 4.10am of that day;27Foot Note 27×RoA at pp 475–477 (GD at [57]–[62]). (b) that “mouth alcohol” from the oral application of Bonjela gel by the Appellant would no longer be present in the Appellant’s mouth under normal circumstances within 20 minutes of the last such application;28Foot Note 28×RoA at pp 477–479 (GD at [63]–[65]). (c) that, irrespective of whether Bonjela gel ended up being trapped in the crack-line of the Appellant’s upper molar after his application thereof, there was no evidence showing that there was still Bonjela gel trapped in that crack-line at the time of the administration of the breathalyser test;29Foot Note 29×RoA at pp 479–482 (GD at [68]–[77]). (d) that, even if Bonjela gel was trapped in the Appellant’s tooth’s crack-line, the Dräger Alcotest 9510 SG machine would have detected it as ‘mouth alcohol’, hence no valid BEA reading would have been obtained;30Foot Note 30×RoA at pp 482–486 (GD at [78]–[89]). (e) that the error message “ALC. CONC. NOT STABLE” obtained on the first attempt to administer a breathalyser test on the Appellant did not impugn the accuracy of the BEA reading obtained on the second attempt;31Foot Note 31×RoA at pp 486–487 (GD at [91]–[95]). (f) that, even if the Appellant had burped or belched during the administration of the breathalyser test, there was no evidence that there was any unabsorbed alcohol left in his stomach during the administration of the breathalyser test, more than two hours after the last application of the Bonjela gel;32Foot Note 32×RoA at pp 489–490 (GD at [101]–[105]). (g) that, even if there had been unabsorbed stomach alcohol left in the Appellant, and he had burped or belched during the administration of the breathalyser test, the Dräger Alcotest 9510 SG machine would have detected it as ‘mouth alcohol’, and no valid BEA reading would have been obtained;33Foot Note 33×RoA at pp 490-–491 (GD at [106]).and (h) that, in any event, there was no evidence from the Appellant to show that he had, in fact, burped or belched during the administration of the breathalyser test upon him.34Foot Note 34×RoA at pp 491-–492 (GD at [107]–[110]).",
        "Parties’ submissions": "",
        "The Appellant’s case": "19 On appeal, the Appellant argued that the DJ had erred in making the following findings: (a) inferring from the Appellant’s omission to make mention of burping or belching during his breathalyser test that such burping or belching was a mere afterthought, as there was sufficient evidence adduced at the trial below of such burping or belching affecting the BEA test results being a real possibility, as stated in the Defence Experiment Results;35Foot Note 35×Appellant’s Written Submissions in HC/MA 9163/2022/01 dated 8 May 2023 (“AS”) at paras 3–12 and 58–63. (b) giving undue weight to the evidence of the Dräger Expert and Draeger Experimenter, and characterising their expert evidence as being unrefuted as it had been rebutted by the evidence of the Defence Expert;36Foot Note 36×AS at paras 13–28. (c) finding that the Dräger Alcotest 9510 SG would have detected any alcohol in the Appellant’s mouth as a result of Bonjela gel being trapped in the crack-line of his tooth as ‘mouth alcohol’, based on the evidence of the Dräger Expert and the Draeger Experimenter, as the HSA Expert had acknowledged this as a real possibility in her evidence;37Foot Note 37×AS at paras 29-–38. (d) finding that the Appellant’s latest application of the Bonjela gel was before he was placed under arrest by the Arresting Officer and in excluding the possibility that he had applied the Bonjela gel post-arrest;38Foot Note 38×AS at paras 41–47.and (e) finding that the BEA test result of 75g / 100ml as obtained by the Administering Officer in this case was accurate and reliable, notwithstanding that he had failed to consult the operating manual after seeing the unfamiliar error message of “ALC. CONC. NOT STABLE” and failed to observe a waiting period before he administered the breathalyser test for a second time.39Foot Note 39×AS at paras 48–57. 20 The Appellant confirmed during oral submissions that notwithstanding his indication of dissatisfaction with his sentence in his Notice of Appeal, he was not seeking to appeal against his sentence.40Foot Note 40×RoA at p 8 (Appellant’s Notice of Appeal dated 1 September 2022).",
        "The Prosecution’s case": "21 The Prosecution’s case rested on the following arguments: (a) that the Appellant adduced no credible evidence on the amount of alcohol he consumed before driving so as to prove that the BEA result being above the prescribed limit was attributable to his post-driving oral application of the Bonjela gel;41Foot Note 41×Respondent’s Written Submissions in HC/MA 9163/2022/01 dated 28 April 2023 (“RS”) at para 24. (b) that the Appellant adduced no credible evidence on the amount of Bonjela gel he had used or credible evidence that he applied Bonjela gel within two hours prior to the breathalyser tests, after which the ingestion of any Bonjela gel would have had no further effect on his BEA readings;42Foot Note 42×RS at paras 25–28. (c) that the Appellant adduced no evidence of him burping or belching during the administration of the breathalyser test, or that Bonjela gel had been trapped in the crack-line of his tooth at that time;43Foot Note 43×RS at paras 9–30. (d) that, based on the evidence of the HSA Expert, the DJ correctly found that the Appellant’s last application of Bonjela gel more than two hours prior to the administration of the breathalyser tests upon him would have had no effect on the BEA test results obtained;44Foot Note 44×RS at para 32(a). (e) that, based on the evidence of the Dräger Expert and the Draeger Experimenter, the DJ correctly found that the Dräger Alcotest 9510 SG would have detected any alcohol from the use of the Bonjela gel as ‘mouth alcohol’ instead of giving a valid BEA test result;45Foot Note 45×RS at paras 32(b) and 33.and (f) that, based on the evidence of the Dräger Expert and the Draeger Experimenter, the DJ correctly found that the BEA test result obtained by the Administering Officer was accurate and reliable, as the Dräger Alcotest 9510 SG is designed to provide an accurate test result based on a single breath specimen and no waiting time was required after the first failed attempt to obtain a valid BEA test result.46Foot Note 46×RS at paras 35–39.",
        "The relevant law": "22 The Appellant was convicted on a charge of driving a motor vehicle with a body alcohol content in excess of the prescribed limit, based on the offence-creating provision in s 67(1)(b) of the RTA,47Foot Note 47×RoA at p 6 (Proceeded Charge DAC-919501-2019).which as of the date of the Drink-Driving Charge read as follows: Driving while under influence of drink or drugs 67.—(1) Any person who, when driving or attempting to drive a motor vehicle on a road or other public place — … (b) has so much alcohol in his body that the proportion of it in his breath or blood exceeds the prescribed limit, shall be guilty of an offence and shall be liable on conviction to a fine of not less than $1,000 and not more than $5,000 or to imprisonment for a term not exceeding 6 months and, in the case of a second or subsequent conviction, to a fine of not less than $3,000 and not more than $10,000 and to imprisonment for a term not exceeding 12 months. 23 The “prescribed limit” referred to in s 67(1)(b) of the RTA is 35g / 100ml, as defined in s 72(1)(a) of the RTA. 24 At the trial below, the Prosecution invoked the presumption in s 71A(1) of the RTA,48Foot Note 48×RoA at p 539 (Prosecution’s Closing Submissions dated 13 April 2022 at para 3).which as of the date of the Drink-Driving Charge read as follows: Evidence in proceedings for offences under sections 67 and 68 71A.—(1) In proceedings for an offence under section 67 or 68, evidence of the proportion of alcohol or of any drug or intoxicating substance in a specimen of breath or blood (as the case may be) provided by the accused shall be taken into account and, subject to subsection (2), it shall be assumed that the proportion of alcohol in the accused’s breath or blood at the time of the alleged offence was not less than in the specimen. 25 The defence invoked by the Appellant was based on s 71A(2) of the RTA,49Foot Note 49×RoA at p 1024 (Defence’s Further Closing Submissions dated 30 June 2022 at para 5).which as of the date of the Drink-Driving Charge read as follows – (2) Where the proceedings are for an offence under section 67(1)(a) or 68(1)(a) and it is alleged that, at the time of the offence, the accused was unfit to drive in that he was under the influence of drink, or for an offence under section 67(1)(b) or 68(1)(b), the assumption referred to in subsection (1) shall not be made if the accused proves — (a) that he consumed alcohol after he had ceased to drive, attempt to drive or be in charge of a motor vehicle on a road or any other public place and before he provided the specimen; and (b) that had he not done so the proportion of alcohol in his breath or blood — [s 71A(2)(b)(i) omitted] (ii) would not have exceeded the prescribed limit in the case of proceedings for an offence under section 67(1)(b) or 68(1)(b). 26 It is trite law that, in a criminal proceeding, the Prosecution bears the legal burden of proving each and every element of the offence charged beyond a reasonable doubt (Public Prosecutor v GCKand another matter[2020] 1 SLR 486 at [130]–[131];Punithan a/l Genasan v Public Prosecutor[2023] 1 SLR 199 at [49]). If the Prosecution invokes a statutory presumption, as an evidentiary aid, it first bears the burden of proving, beyond a reasonable doubt, the factual pre-requisite(s) for triggering the presumption in question. If successfully proven, the presumption is engaged, and the burden of proof shifts onto the accused to rebut the presumed fact on a balance of probabilities (Public Prosecutor v Wan Yue Kong and others[1995] 1 SLR(R) 83 at [16] and [18]). 27 In seeking to prove beyond a reasonable doubt that s 67(1)(b) of the RTA was made out, the Prosecution invoked the assumption in s 71A(1) of the RTA. For this assumption to apply, the Prosecution had to prove beyond a reasonable doubt that the Accused had in fact driven a motor vehicle at the time of the offence (Public Prosecutor v Rangasamy Subramaniam[2011] 1 SLR 767 (“Rangasamy (CA)”) at [61]–[62]). 28 It was clear that the Prosecution had discharged its burden of proof at the trial below. The SOAF, tendered by the Prosecution on the first day of trial on 12 October 2020,50Foot Note 50×RoA at pp 20-–21 (12 October 2020 Transcript at p 5 lines 30–32 and p 6 lines 1–2).stated that the Appellant drove a motor van at the material date and time of the Drink-Driving Charge.51Foot Note 51×RoA at p 501 (SOAF at paras 1 and 3); RoA at p 6 (Proceeded Charge DAC 919501-2019).The Appellant also admitted as much in his statement to the Investigation Officer on 17 June 2019,52Foot Note 52×RoA at pp 507–508 (Statement of Accused dated 17 June 2019 at pp 1–2).and testified to the same at the trial below.53Foot Note 53×RoA at p 328 (15 February 2022 Transcript at p 59 lines 8–32).Consequently, there was no reasonable doubt that the Appellant drove a motor van at the time of the alleged offence, and it follows that the Prosecution had satisfied its burden of proof for the assumption in s 71A(1) to be triggered. 29 The effect of the s 71A(1) assumption was that the DJ had to assume that the Appellant’s breath alcohol level at the time of the alleged offence was not less than that in his breath specimen, as reflected in the breathalyser test administered to him by the Administering Officer, which had shown a BEA test result of 75g / 100ml (seeRangasamy (CA)at [61]).54Foot Note 54×RoA at p 506 (SOAF at p 6). 30 The burden of proof then shifted to the Appellant to prove, on a balance of probabilities, the ingredients of the exception under s 71A(2) of the RTA. As held by the High Court inRangasamy Subramaniam v Public Prosecutor[2010] 1 SLR 719 (“Rangasamy (HC)”) at [11], the s 71A(1) statutory assumption is not rebuttable except by way of the exception in s 71A(2). This holding was undisturbed on appeal. 31 Hence, the Appellant must prove two ingredients in order to satisfy the exception in s 71A(2): (a) first, that he consumed alcohol after he had ceased to drive the motor van at the time of the alleged offence (s 71A(2)(a)); and (b) second, that, but for such a post-driving consumption of alcohol, his breath alcohol level would not have exceeded the prescribed limit of 35g / 100ml (s 71A(2)(b)(ii)). 32 The DJ held that the Appellant had managed to prove the first ingredient of the s 71A(2) exception on a balance of probabilities, as he had orally applied Bonjela gel after he had ceased driving his motor van.55Foot Note 55×RoA at p 473 (GD at [50]–[51]).Although s 71A(2)(a) referred to a scenario of alcohol consumption, it was common ground between both parties that s 71A(2)(a) had been satisfied.56Foot Note 56×RoA at p 473 (GD at [50]).The Prosecution did not challenge this finding on appeal.57Foot Note 57×RS at para 20. 33 The only remaining issue to be considered on appeal was thus whether, on a balance of probabilities, the breath alcohol level indicated in the Appellant’s breath specimen in the breathalyser test on 14 June 2019 would not have exceeded the prescribed limit but for the Appellant’s post-driving oral application of Bonjela gel.",
        "Issues to be determined": "34 In order to address the issue identified at [33] above, it was necessary to consider whether, on a balance of probabilities, any of four possibilities could have been a reason for the Appellant’s breath alcohol level exceeding the prescribed limit when it would not otherwise have. The four possibilities are as follows: (a) the Appellant’s burping or belching during the administration of the breathalyser test affected the BEA test result; (b) the presence of Bonjela gel trapped in the crack-line of the Appellant’s upper right molar during the administration of the breathalyser test affected the BEA test result; (c) the Appellant’s post-driving application of the Bonjela gel, even in the absence of him burping or belching or having Bonjela gel trapped in his tooth’s crack-line at the time of the administration of the breathalyser test, affected the BEA test result; and (d) the presence of improprieties in the administration of the Appellant’s breathalyser test caused the BEA test result to inaccurately register the presence of alcohol in the Appellant’s mouth arising from his post-driving application of the Bonjela gel. 35 The DJ made a finding of fact that the Appellant’s BEA test result being over the prescribed limit wasnotthe result of his post-driving oral application of the Bonjela gel.58Foot Note 58×RoA at pp 492–494 (GD at [111]–[116]).Therefore, in deciding whether to disturb that factual finding on appeal, I was cognisant of the appellate standard of review applicable to findings of fact in the first-instance,viz, that an appellate court may not overturn a DJ’s findings of fact unless they are plainly wrong or against the weight of the evidence (Jagatheesan s/o Krishnasamy v Public Prosecutor[2006] 4 SLR(R) 45 at [34]).",
        "Issue 1: The Appellant burping or belching during the administration of the breathalyser test": "36 The Appellant submitted that due to his post-driving oral application of the Bonjela gel, he had ingested ethanol into his stomach. This “stomach alcohol” could have entered his mouth when he burped or belched during the administration of the breathalyser test upon him on 14 June 2019; otherwise, his BEA test result would not have exceeded the prescribed limit. 37 Having considered the Appellant’s arguments in this respect, I rejected the submission that the Appellant succeeded in making out this ingredient of the s 71A(2) exception, for the following reasons: (a)  Given the length of time between the Appellant’s latest use of the Bonjela gel and the administration of the breathalyser test approximately two hours later, any burping or belching on his part would not have resulted in any elevation of his BEA test result, as any alcohol in his stomach would have been fully absorbed by that point; (b) Even if there had been any “stomach alcohol” still remaining in the Appellant’s stomach at the time of the breathalyser test, the Dräger Alcotest 9510 SG machine would have detected it as “Mouth Alcohol” and delivered an error message to that effect, as opposed to a valid BEA test result; and (c) In any event, the Appellant failed to adduce any evidence that he had in fact burped or belched during the administration of the breathalyser test upon him by the Administering Officer. 38 I elaborate on each of these reasons in turn.",
        "The length of time between the breathalyser test and the last application of the Bonjela gel": "39 On the Appellant’s own evidence, the latest point in time when he could have orally applied the Bonjela gel would have been sometime before 2.10am to 2.15am on 14 June 2019. The Appellant had given evidence that: (a) after applying the Bonjela gel at the carpark, and after he had been confronted by the Complainant, police officers arrived at the incident location at or around 1.35am on 14 June 2019;59Foot Note 59×RoA at p 355 (15 February 2022 Transcript at p 86 lines 14–32 and p 87 line 1).this was supported by the evidence of the Arresting Officer that he arrived at the incident location with his partner at or around 1.40am of that day;60Foot Note 60×RoA at p 31 (12 October 2020 Transcript at p 16 lines 7–20). (b) he could not recall if he had applied the Bonjela gel after the police officers arrived or on the way to the police station, but he claimed that he might have applied the Bonjela gel in the patrol car when they wereen route;61Foot Note 61×RoA at p 357 (15 February 2022 Transcript at p 88 lines 1–12). (c) he could remember that the Bonjela gel was taken away from him by police officers when he arrived at Woodlands Police Division HQ;62Foot Note 62×RoA at p 356 (15 February 2022 Transcript at p 87 lines 26–32).and (d) he testified, in cross-examination, that he arrived at Woodlands Police Division HQ at or around 2.10am to 2.15am,63Foot Note 63×RoA at p 356 (15 February 2022 Transcript at p 87 lines 16–25).although in his examination-in-chief (“EIC”) he said that he was at the HQ by 1.40am.64Foot Note 64×RoA at p 336 (15 February 2022 Transcript at p 67 lines 14–24). 40 I also observed that in the Appellant’s statement to the Investigation Officer on 17 June 2019, he mentioned that he had applied the Bonjela gel after he had parked the vehicle, but he made no mention of any further application of the Bonjela gel after that point.65Foot Note 65×RoA at p 508 (Statement of Accused dated 17 June 2019 at p 2).It was only at trial, and even then only during his cross-examination, that the Appellant claimed for the first time that he may have applied the Bonjela gel in the patrol car, whilst he wasen routeto the Police station, andonly in responseto the Prosecution asking him for the “last time” he had applied the Bonjela gel.66Foot Note 66×RoA at p 357 (15 February 2022 Transcript at p 88 lines 1–12).This stood in stark contrast to the Appellant’s EIC, where he stated he applied the Bonjela gel before he was placed under arrest, when his motor van was stationary in the open-air carpark,67Foot Note 67×RoA at pp 330–331 (15 February 2022 Transcript at p 61 lines 4–9 and p 62 lines 7–12).but not at any point after his arrest.68Foot Note 68×RoA at p 335 (15 February 2022 Transcript at p 66 lines 12–31). 41 Consequently, I found that the possibility that the Appellant applied the Bonjela gel in the patrol car was a mere afterthought raised by him. I gave no weight to his evidence in this regard. As such, I saw no error in the DJ’s finding that the last application of the Bonjela gel by the Appellant was around 1.40am on 14 June 2019, when the Arresting Officer and his partner arrived at the incident location.69Foot Note 69×RoA at p 477 (GD at [62]). 42 However, even taking the Appellant’s case at its highest and even assuming that the Appellant had applied the Bonjela gel after he was arrested anden routeto Woodlands Police HQ, he would have orally applied the Bonjela gel, at the very latest, sometimebeforehe had arrived at Woodlands Police HQ, at or around 2.10am to 2.15am on 14 June 2019.70Foot Note 70×RoA at p 356 (15 February 2022 Transcript at p 87 lines 16–25). 43 The BEA test slip showed that the test began at around 4.04am and ended at around 4.11am on 14 June 2019.71Foot Note 71×RoA at p 506 (SOAF at p 6).Even if I had accepted the Appellant’s evidence on this point, that still left approximately two hours between the latest possible time the Appellant could have applied the Bonjela gel until the administration of the breathalyser test upon the Appellant by the Administering Officer. This passage of time is significant because the HSA Expert gave evidence that, after one or two hours from the last application of the Bonjela gel, any burping or belching would not cause any elevation in the BEA test result:72Foot Note 72×ROP at p 156 (23 June 2021 Transcript at p 10 lines 3–25). Q Okay. And now, I direct your attention to paragraph 5 which refers to your opinions, okay. So, Doctor, you have stated at 5A that, “BrAC elevation during belching occurs when the amount of unabsorbed alcohol is present at high concentration in the stomach.And based ona large number of drinking studies, the absorption of alcohol usually completes within 60 minutes after the end of the alcohol intake. Although in some individuals, this time may extend to 120 minutes.”Okay. So, the question is, what happens--- or what is the effect on the BrAC reading when the absorption of alcohol is completed? A When the absorption of alcohol is completed, there is minimum or close to zero alcohol in the stomach. So,when you belch, there’s no alcohol vapour that will come out. So, it should not affect the BrAC. Court:     Sorry. So, “When you belch”? Witness: If you still have alcohol in your stomach, when you belch, the alcohol will come out. So, you have alcohol vapours and that may affect the breathalyser reading, may be giving you a [sic] elevated reading. Butif all the alcohol in the stomach has been absorbed, when you belch, there is no alcohol va---vapours to come out. So, it should not affect the BrAC reading. [emphasis added] 44 Thus, the clear evidence given by the HSA Expert and her HSA Report,73Foot Note 73×RoA at p 523 (Health Sciences Authority Report dated 23 October 2020 at para 5).which fell squarely within the scope of her expertise concerning the analysis of biological specimens for drugs and alcohol,74Foot Note 74×RoA at p 149 (23 June 2021 Transcript at p 3 lines 4–28).was that in the 60 minutes following the ingestion of alcohol (or 120 minutes for some individuals), all of the “stomach alcohol” would have been absorbed, and hence, there would be no elevation of the BrAC reading owing to the subject’s burping or belching. This evidence was undisturbed in cross-examination. 45 This evidence was also not contradicted by any contrary expert evidence. The Defence Experiment Results, tendered by the Defence Expert, only examined the effects of the application of Bonjela gel on a subject’s BEA test results within a timeframe of around 1.5 hours.75Foot Note 75×RoA at pp 855–856 (Alcotech Ingested Bonjela BrAC Study at pp 2–3).BEA readings above the prescribed limit were obtained 40 minutes after Bonjela gel was applied,76Foot Note 76×RoA at p 855 (Alcotech Ingested Bonjela BrAC Study at p 2).but only negative BEA readings were obtained thereafter.77Foot Note 77×RoA at p 856 (Alcotech Ingested Bonjela BrAC Study at p 3).The Defence Expert, when asked on this point during cross-examination, acknowledged that his experiment did not cover the effects of any burping or belching after the passing of approximately 90 minutes, when his study ended.78Foot Note 78×RoA at pp 383–384 (16 February 2022 Transcript at p 15 lines 17–32 and p 16 lines 1–10).It was also significant that when asked by the DJ to comment on the findings of the HSA Report, the Defence Expert testified “[i]n the HSA report, it says that alcohol is fully absorbed within 60 to 120 minutes. I think I agree with that”.79Foot Note 79×RoA at p 388 (16 February 2022 Transcript at p 20 lines 1–2). 46 In other words, there was no contrary expert evidence that contradicted the evidence of the HSA Expert and the findings of the HSA Report. Hence, the DJ did not err in giving full weight to that evidence. It followed that the Appellant burping or belching during the administration of the BEA test would not have elevated the BEA test results regardless of whether he had last applied Bonjela gel before the arrival of the police or in the patrol caren routeto Woodlands Police Division HQ, as the Appellant’s stomach alcohol would have been fully absorbed by that point.",
        "The ability of the Dräger Alcotest 9510 SG machine to distinguish “mouth alcohol” from “breath alcohol”": "86 In any event, given that I had earlier accepted the evidence of the Dräger Expert, the Draeger Experimenter, and the Draeger Experiment Results, to the effect that the Dräger Alcotest 9510 SG machine was capable of distinguishing “mouth alcohol” from “breath alcohol”, it logically followed that the machine would have registered a ‘mouth alcohol’ error message in the event of any Bonjela gel remaining in the Appellant’s mouth. It would not have registered a valid BEA test result, as had been the case for the Appellant.",
        "The failure to adduce evidence of burping or belching during the breathalyser test": "59 Finally, I was also satisfied that, as the Appellant had not adduced any evidence that he hadin factburped or belched during the administration of the breathalyser test upon him on 14 June 2019, there was no basis for the DJ to have inferred that such burping or belching had even occurred in the first place. 60 The Appellant never gave any evidence that he had burped or belched during the breathalyser test, even as he testified about the administration of the breathalyser test on him, and described in detail his interactions with the Administering Officer and his expression of surprise at the time at how high his BEA test result was.93Foot Note 93×RoA at pp 337–338 (15 February 2022 Transcript at p 68 lines 18–32 and p 69 lines 1–30).In my view, this omission was striking. The word “belch”, for example, is defined in theOxford Advanced Learner’s Dictionary(Diana Lea and Jennifer Bradbery ed) (Oxford University Press, 10th ed, 2023) as “to let air come up noisily from your stomach and out through your mouth”. Such an action would not be a bodily function that would have gone unnoticed (or unheard) by the Appellant. I was thus inclined to find the Appellant’s omission to mention that he burped or belched, in either his statements or his testimony in court, as strongly indicative of the fact that no such actions had in fact occurred. 61 The Appellant, however, attempted to downplay the significance of that omission in his submissions on appeal. He argued, in particular, that “[i]t would have been unnecessary for him to [give evidence of such burping or belching in his EIC] since his entire stated defence turned on whether burping [or] belching affected the breathalyser reading”. His omission to give such evidence ought not to be “held against” him, because the Prosecution likewise failed to challenge the Appellant’s case of burping or belching in cross-examination. In light of the testimony of multiple witnesses at the trial below, this “issue of belching [or] burping caused by Bonjela was such a prominent feature of the trial that it would be unjust to deny the Appellant’s defence of belching [or] burping affecting the breathalyser readings”.94Foot Note 94×AS at paras 6–12. 62 I was of the view that these submissions of the Appellant were misplaced as they conflated two entirely distinct issues of fact. In order to satisfactorily make out the statutory exception in s 71A(2), based on a claim of burping or belching after the ingestion of Bonjela gel, the burden of proof was on the Appellant to establish, on a balance of probabilities, two separate points of fact –first, that a test subject burping or belching following the use of Bonjela gel, during the administration of a breathalyser test upon them, could give rise to an elevated BrAC reading on the Dräger Alcotest 9510 SG machine; andsecond, that the Appellant hadin factburped or belched during the course ofhisbreathalyser test on 14 June 2019, following his post-driving application of the Bonjela gel that day. Evidence ofbothof these facts had to be adduced. Proof of the former could not logically act as a substitute for proof of the latter. Showing that application of Bonjela gel could have affected a breathalyser test by burping or belching was a distinct question from whether the Appellant had in fact burped or belched. 63 Hence, that the Appellant never once testified that he had burped or belched during his breathalyser test on 14 June 2019 meant that there was no evidence adduced at trial to infer that he had, in fact, burped or belched in his breathalyser test. I also observed, for completeness, that the Administering Officer’s evidence was that he could not remember if the Appellant had burped during his BEA test.95Foot Note 95×RoA at p 72 (12 October 2020 Transcript at p 57 lines 9–11).He stated in cross-examination that it might have been “[p]ossible” that the Appellant had burped during the BEA test.96Foot Note 96×RoA at p 72 (12 October 2020 Transcript at p 57 line 14).I did not treat this as an affirmation that the Appellant had,in fact, burped during the BEA test. Seen in its proper context, his evidence was clear that he could not actually recall if the Appellant had burped or not at the material time.97Foot Note 97×RoA at p 72 (12 October 2020 Transcript at p 57 lines 5–14). 64 Besides the Administering Officer, the Appellant was the only other witness who would be in any position to give evidence on whether the Appellant had in fact burped or belched during his breathalyser test. Consequently, it was irrelevant in my view that the possibility of such burping or belching had been assumed to be part of the Appellant’s case at the trial below, or that that possibility had been put to theotherwitnesses. For the Appellant to suggest that the issue of the Appellant’s burping or belching “was the proverbial elephant in the room” was a mischaracterisation that conflated the question ofwhetherthe Appellant had ever burped or belched at the time of the breathalyser test with the entirely separate question of the potential impact of such burping or belching (if any) upon the BEA test result obtained.98Foot Note 98×AS at para 46. 65 I should add that I was not persuaded by the Appellant’s argument that the fact that Prosecution witnesses gave evidence on the issue of burping or belching meant that it was a prominent feature of the trial that went towards showing that the Appellant had burped or belched.99Foot Note 99×AS at para 12.Insofar as the Prosecution witnesses may have given evidence on such burping or belching, this pertained to the possible impact of such burping or belching on a BEA test result if those actions had occurred, and not whether the Appellant hadin factburped or belched during the course ofhisBEA test. 66 I was similarly not persuaded by the Appellant’s submission that “the fact that he did not mention this [burping or belching during the BEA test] during cross-examination is indicative that the [P]rosecution did not challenge the Appellant’s claim of belching [or] burping during cross-examination”.100Foot Note 100×AS at para 8.It was irrelevant that the Prosecution did not ask the Appellant if he burped or belched during his breathalyser test, in cross-examination. As no evidence had been adduced in the Appellant’s EIC that he had burped or belched during his breathalyser test, there was nothing for the Prosecution to ask him in cross-examination to challenge the weight or the reliability of that non-existent evidence. 67 As set out at [30] above, the burden of proof was on theAppellantto prove, on a balance of probabilities, that the ingredients of the exception under s 71A(2) of the RTA had been established. Even if I regarded the absence of testimony on this issue by the Appellant as neutral at best, it was clear that the Appellant failed to adduceanyevidence that he had in fact burped or belched during the breathalyser test. Consequently, I was of the view that the DJ did not err in finding that there was no evidence to show, on a balance of probabilities, that the Appellant had indeed burped or belched during his breathalyser test.",
        "Issue 2: The Appellant having Bonjela gel trapped in the crack-line of his upper right molar during the administration of the breathalyser test": "68 The Appellant also submitted that his BEA test result being above the prescribed limit was attributable to the breathalyser test detecting alcohol from Bonjela gel trapped within the crack-line of his upper right molar when the Appellant applied the gel after driving. 69 At the trial below, the DJ found that while the Appellant’s Unity Denticare memo showed that he had a crack-line in his upper right molar, there was no evidence that had been adduced by the Appellant as to whether there had been any Bonjela gel trapped in his tooth’s crack-line specifically at the time of the breathalyser test.101Foot Note 101×RoA at pp 479–480 and p 482 (GD at [68]–[69] and [77]). 70 It was, however, unnecessary for me to address the Appellant’s arguments on this finding of the DJ,102Foot Note 102×AS at paras 38–40.because even if one assumed, in the Appellant’s favour, that there was indeed Bonjela gel that was trapped in his tooth crack-lineduringthe breathalyser test, the evidence in the record was clear that the Dräger Alcotest 9510 SG machine would have been able to distinguish “mouth alcohol” (which the trapped Bonjela gel would constitute) from “breath alcohol”. It would have given an error message to that effect rather than a valid BEA test result. As I had observed earlier at [47]–[58] above, the clear and uncontradicted expert evidence showed that the machine functioned by plotting an alcohol concentration curve, detecting the air in a subject’s mouth, then their upper airways, then their lungs, and alcohol arising from a subject’s mouth (eg, from trapped Bonjela gel in a subject’s tooth crack-line) rather than pulmonary air from their lungs would not produce the “plateau” in the alcohol concentration curve necessary for a valid BEA test result to be obtained.",
        "The HSA Expert’s evidence did not contradict the evidence showing that the Dräger Alcotest 9510 SG machine was able to distinguish “mouth alcohol” from “breath alcohol”": "71 The Appellant sought to cast doubt on the Dräger Alcotest 9510 SG machine’s ability to distinguish “mouth alcohol” from “breath alcohol” by relying upon the evidence of the HSA Expert, submitting that “even the [P]rosecution’s own witness acknowledged the possible effects of Bonjela in the crack lines of the Appellant’s tooth, and she did not rule out the possibility of it having an impact on the amount of alcohol in the Appellant’s mouth even after 2 hours”.103Foot Note 103×AS at para 33. 72 In my view, this reliance upon the HSA Expert’s evidence was misplaced. Although the HSA Expert was qualified to testify on the estimated time it would take for Bonjela gel to evaporate from a subject’s mouth in the event of Bonjela gel being trapped in their tooth’s crack-line, she was not in any position to comment on the functionality of the Dräger Alcotest 9510 SG machine, and whether it was able to distinguish “mouth alcohol” from “breath alcohol”. That issue was beyond the scope of her expertise, and as I outline below, caveated by the HSA Expert herself when she gave her evidence. 73 The HSA Expert had testified that, if the Bonjela gel were to be trapped in the crack-line of the Appellant’s tooth, it “means that it is not expose [sic]and that will slow down the evaporation of the alcohol vapour. Such that, the alcohol might still be detected after more than 20 minutes”.104Foot Note 104×RoA at p 159 (23 June 2021 Transcript at p 13 lines 24–29).When she was asked in her cross-examination whether there was a “possibility” of Bonjela gel trapped in the crack-line of a tooth “affecting the … breath alcohol reading”, she replied in the affirmative.105Foot Note 105×RoA at p 186 (23 June 2021 Transcript at p 40 lines 10–17). 74 However, the HSA Expert clarified that she was not in any position to comment on the effect of Bonjela gel being trapped in a subject’s tooth’s crack-line on the BEA readings obtained from the Dräger Alcotest 9510 SG machinespecifically.106Foot Note 106×RoA at p 162 (23 June 2021 Transcript at p 16 lines 18–28).Her evidence on this point was hence confined to showing that Bonjela gel trapped in a person’s tooth’s crack-line would notevaporate within 20 minutes of the application thereof, andnotwhether that machine specifically would have been able to distinguish “mouth alcohol” from the trapped Bonjela gel from “breath alcohol” from a subject’s lungs. 75 I note that the evidence of the Defence Expert was subject to the same limitation. Although he had also given evidence that Bonjela gel being trapped in a subject’s tooth’s crack-line would slow its evaporation,107Foot Note 107×RoA at p 390 (16 February 2022 Transcript at p 22 lines 2–12 and lines 18–24).he also confirmed during his cross-examination that he was not in any position to comment on the functionality of the Dräger Alcotest 9510 SG and whether that machine would have mistaken “mouth alcohol” for “breath alcohol”, testifying that, on that issue, “it is close to impossible to comment”.108Foot Note 108×RoA at p 386 (16 February 2022 Transcript at p 18 lines 5–24). 76 In contrast, the Dräger Expert was able to give evidence falling within the scope of her expertise on the functionality of the Dräger Alcotest 9510 SG, as to whether that machine would have detected any Bonjela gel trapped within a subject’s tooth’s crack-line as “mouth alcohol” or not. She gave evidence on this specific issue at the trial below:109Foot Note 109×RoA at pp 232–233 (14 February 2022 Transcript at p 26 lines 31–32 and p 27 lines 1–20). Q Yes. Okay. So, the question is this, based on your expertise with the Alcotest 9510 SG machine, if there were some Bonjela gel trapped in the upper right molar of the test subject, would that contribute to the reading of 75 micrograms per 100 mi---millilitres of breath? A If there would be Bonjela gel present in the mouth of the tested person, in the moment of the breath sample, the Alcotest 9510 SG would detect this as mouth alcohol. The Alcotest 9510 SG would give the message “mouth alcohol” or “mouth alcohol detected” and would not report a breath test result. Q Okay. So, would that be the case if the gel is stuck in the crack line of the test subject’s upper right molar? A If the gel would be trapped in the crack line? Q Mmm. A And would for an unknown reason be released exactly at that moment?It would be recognised as mouth alcohol by the Alcotest 9510 SG. Q Okay. A As the test result on the result slipdoes not give the message “mouth alcohol”, this indicates that this scenario did not happen. [emphasis added] 77 As I had observed earlier at [52]–[56], I accepted the DJ’s finding that the Dräger Expert’s evidence on the functionality of the Dräger Alcotest 9510 SG was credible and reliable, and saw no error in the DJ finding as such. Accordingly, I was satisfied that even if Bonjela gel had indeed been trapped in the crack-line of the Appellant’s upper right molar, and even if it had remained trapped until the moment of the breathalyser test, any alcohol originating therefrom would have been registered as “mouth alcohol” by the Dräger Alcotest 9510 SG. 78 Consequently, in my view the DJ did not err in finding that, on a balance of probabilities, the BEA result of 75g / 100ml was not attributable to any Bonjela gel having been trapped in the Appellant’s tooth’s crack-line at that time.",
        "Issue 3: The Appellant’s post-driving application of the Bonjela gel, in the absence of him burping or belching or having Bonjela gel trapped in his tooth’s crack-line at the time of the administration of the breathalyser test": "79 Given the Appellant’s position,viz, that his post-driving application of the Bonjela gel was responsible for his BEA test result being over the prescribed limit, for the purposes of the exception under s 71A(2) of the RTA,110Foot Note 110×AS at paras 41–47.I considered, for completeness, whether,in arguendo, the Appellant's BEA test result could be shown to be attributable to his post-driving application of the Bonjela gel, even in the absence of him burping or belching during the breathalyser test, or if the BEA test could be shown to be attributable to Bonjela gel having been trapped in his tooth’s crack-line at the material time. 80 The DJ found that in such a scenario, it would have been even less likely for the Appellant’s use of the Bonjela gel to have contributed to his BEA result, because the Bonjela gel would have been eliminated from his mouth within 20 minutes of the latest application of the Bonjela gel,111Foot Note 111×RoA at pp 477–479 (GD at [63]–[65]).and in any event, any Bonjela gel left in the Appellant’s mouth would have been detected as “mouth alcohol” by the Dräger Alcotest 9510 SG machine.112Foot Note 112×RoA at pp 483–485 (GD at [79]–[88]).I agreed with both of these conclusions of the DJ for the reasons that follow.",
        "The elimination of Bonjela gel from the Appellant’s mouth within 20 minutes of the latest application": "81 The evidence of the HSA Expert was clear that any alcohol in the mouth from the oral application of Bonjela gel would have been eliminated within 20 minutes from the latest application of the Bonjela gel, as the prevailing body of scientific literature showed that the level of mouth alcohol, if present, typically dropped to zero after about 20 minutes”.113Foot Note 113×RoA at p 153 (23 June 2021 Transcript at p 7 lines 20–21); RoA at p 157 (23 June 2021 Transcript at p 11 lines 2–5).This was reiterated in the HSA Report, which stated that “[n]umerous published studies on mouth alcohol effect showed that the breath alcohol concentration (BrAC) typically dropped to zero reading after20 minutes” [emphasis in bold in original].114Foot Note 114×RoA at p 522 (Health Sciences Authority Report dated 23 October 2020 at para 3(a)). 82 As I had observed earlier at [54] and [55], the case law is clear that, where expert evidence is uncontradicted, falls within that witness’s expertise, is based on sound grounds, is not contradicted by extrinsic evidence, and is not otherwise lacking in its defensibility, the court should not venture to substitute its own views on a matter of expert opinion for that of the expert witness (Sakthivelat [74] and [76];Saeng-Unat [26]–[27]). The HSA Expert’s uncontradicted evidence that Bonjela gel would be eliminated from the mouth of the Appellant within 20 minutes of his latest application thereof was thus correctly accepted by the DJ. 83 The HSA Expert’s evidence was also corroborated by the results shown in the Draeger Experiment Results and the Defence Experiment Results. The former study, conducted by the Draeger Experimenter,115Foot Note 115×RoA at p 274 (15 February 2022 Transcript at p 5 lines 17–28).showed that only negative BEA readings (as opposed to ‘mouth alcohol’ readings) were obtained by the BEA machine after 20 minutes of the oral application of the Bonjela gel. Regardless of whether 1 cm or 2 cm of Bonjela gel was applied, the BEA machine registered consistent negative readings from the 18 to 20-minute mark onwards.116Foot Note 116×ROA at p 529 (Email correspondence between Draeger Singapore Pte Ltd and Dräger Safety AG & Co dated 10 December 2020 at p 1). 84 Likewise, the Defence Expert gave similar evidence that his study, the Defence Experiment Results, showed that within just 10 minutes of the oral application of Bonjela gel, the amount of breath alcohol detected by the BEA machine dropped to zero.117Foot Note 117×RoA at p 381 (16 February 2022 Transcript at p 13 lines 13–25).Those BEA readings remained negative thereafter, save for when the subject belched.118Foot Note 118×RoA at pp 855–856 (Alcotech Ingested Bonjela BrAC Study at pp 2–3).Indeed, his own results included an explanatory note observing, “[t]he subject breath is cleared of alcohol 10 minutes after the ingestion of Bonjela”. 85 As I had observed at [43] above, the breathalyser test had been administered on the Appellant around two hours after his last post-driving oral application of the Bonjela gel. Consequently, the DJ was correct in holding that, in the absence of the Appellant burping or belching during his breathalyser test, or the Bonjela gel being trapped in his tooth’s crack-line at that time, the Bonjela gel would have been eliminated from his mouth 20 minutes following his last application of the Bonjela gel, and hence, could not have contributed to an elevation of his BEA reading by that point in time.",
        "Issue 4: Improprieties in the administration of the breathalyser test upon the Appellant by the Administering Officer": "87 Finally, the Appellant submitted that due to improprieties in the manner in which the Administering Officer had performed the breathalyser test upon him, the BEA test result could have mistakenly failed to register the presence of any “mouth alcohol” caused by the Appellant’s post-driving application of Bonjela gel, leading to an artificially elevated reading. 88 Having considered the Appellant’s submissions on this point, I was not persuaded that there had been any impropriety in the administration of the Appellant’s breathalyser test, for the following reasons: (a) the evidence at the trial below showed that no waiting period had to be observed by the Administering Officer after the display of the error message of “ALC. CONC. NOT STABLE” before performing the second BEA test on him; and (b) the evidence at the trial below showed that the Administering Officer was only required to obtain one, not two, valid BEA test results from the Appellant.",
        "The failure of the Administering Officer to observe a waiting period before performing a second breathalyser test upon obtaining an error message for the first breathalyser test": "89 In his submissions, the Appellant argued that the error message of “ALC. CONC. NOT STABLE” was unusual. He relied on the fact that the Administering Officer could not explain what caused the error message and admitted that he had not observed any waiting period before performing a second BEA test on the Appellant.119Foot Note 119×AS at paras 48–51.The Appellant also characterised this failure to observe a waiting period as a breach of operating protocols that undermined the reliability of the BEA reading that was obtained.120Foot Note 120×AS at para 53. 90 However, the Administering Officer was not an expert on the functions and operations of the Dräger Alcotest 9510 SG and was not in a position to give expert evidence on whether heoughtto have waited a specified period of time before proceeding to test a second breath specimen from the Appellant or shed light on the meaning of the error message of “ALC. CONC. NOT STABLE”. Conversely, as the Dräger Expert explained in her uncontradicted expert evidence, on a matter falling squarely within the scope of her expertise about the functionality of the Dräger Alcotest 9510 SG,121Foot Note 121×RoA at pp 212–213 (14 February 2022 Transcript at p 6 lines 24–32 and p 7 lines 1–8).the error message meant that the machine had not detected a “plateau” in the alcohol concentration levels of the subject’s breath specimen and the BEA test needed to be repeated.122Foot Note 122×RoA at p 527 (Statement by Dräger Safety AG & Co dated 1 March 2019 at p 2). 91 The Dräger Expert expounded on the cause of the error message in her evidence at the trial below:123Foot Note 123×RoA at pp 219–220 (14 February 2022 Transcript at p 13 lines 12–20, lines 24–27 and lines 31–32 and p 14 lines 1–13). Witness: I’m referring to if you plot the alcohol concentration over the course of the time of the provided breath sample, this will give you a curve of the alcohol concentration over the time of the breath sample. For a valid breath testing result, the alcohol concertation [sic] will be slowly rising and will then reach a plateau. And this plateau is the alcohol concentration in the breath, which relates to the alcohol concentration in the blood, which is the impairment of the tested person. And our device--- … Witness: When---when the plateau is reached, this is an indication that this is the breath from the deep lung, and this deep lung air correlates with the blood alcohol concentration, which is causing impairment. … Witness: And the blood alcohol concentration is causing the impairment of the tested person. So,the device is checking to make sure that it is a correct and reliable result, and among others for the minimum low [sic]in volume that must be reached, and it’s making sure that you have a minimum blow in time that must be reached,and alsothat a plateau in the alcohol curve is reached. If this plateau is not detected on the device, this message is given, “alcohol concentration not stable”. This indicates that the device cannot give a correct and reliable reading for this attempt of blowing. The test must be repeated, the tested person must provide another breath sample. And you see on the result slip that the 2nd blow, the---the criteria for a reliable and correct measurement result have been met, which is why a final test result is reported. [emphasis added] 92 Hence, the Dräger Expert’s evidence, which was consistent with her explanation as to how the Dräger Alcotest 9510 SG machine functionally distinguishes between “mouth alcohol” and “breath alcohol” –ie, by plotting the alcohol concentration curve across the entire span of time of the subject’s breath and detecting a “plateau” in the alcohol concentration levels recorded – made it clear that the error message meant that no “plateau” was detected in the breath specimen and a second breath specimen was required. The BEA reading would be given only if a breath specimen met the machine’s criteria for an accurate or reliable reading, including the detection of a “plateau” in the alcohol concentration curve of the subject’s breath. There was hence no evidential support for the Appellant’s assertion that the Dräger Alcotest 9510 SG machine required a waiting period to be observed after the error message of “ALC. CONC. NOT STABLE” was obtained and before another breathalyser test was performed. The Dräger Expert expressly confirmed, in her cross-examination, that no waiting period had to be observed after the receipt of that particular error message.124Foot Note 124×RoA at pp 259–260 (14 February 2022 Transcript at p 53 lines 30–32 and p 54 lines 1–8). 93 The Appellant placed great significance on the Administering Officer’s omission to refer to the machine’s operating manual after he first saw the error message, to determine the appropriate course of action. At the trial below, the Appellant cross-examined the Administering Officer with reference to that manual and referred him to the error messages listed on page 13 of the manual, which stated that a waiting period had to be observed after certain error messages were registered and before a second test was performed.125Foot Note 125×RoA at pp 67–68 (12 October 2020 Transcript at p 52 lines 17–32 and p 53 lines 1–9). 94 However, the error message of “ALC. CONC. NOT STABLE” did not appear at page 13 of the operating manual, and the manual stated that the observation of a waiting period was only required for certain error messages but not others.126Foot Note 126×RoA at p 849 (Dräger Alcotest 9510 SG – Instructions for Use at p 13).In other words, there was no general rule that all error messages necessitated the observation of a waiting period. Further, the manual was silent on whether a waiting period was needed for thespecificerror message of “ALC. CONC. NOT STABLE”. 95 Given the operating manual’s silence as to whether a waiting period had to be observed and the Dräger Expert’s uncontroverted expert evidence as to the meaning of that error message, I accepted that the breathalyser test could be administered again without the need for any waiting period. Hence, I was satisfied that the failure of the Administering Officer to observe a waiting period after the first breathalyser test was not procedurally improper or a breach of any operating protocol, so as to undermine the reliability of the BEA reading obtained.",
        "The failure of the Administering Officer to obtain two valid BEA test results instead of only one": "96 The Appellant also argued on appeal that “it would be unsafe and unjust for the Appellant to be convicted basis [sic] on a single reading”, and that the DJ’s finding that the Dräger Alcotest 9510 SG machine was capable of giving a single valid and reliable BEA reading without a second test needing to be performed “is not borne out by the evidence”.127Foot Note 127×AS at para 57. 97 In arriving at my decision, I was cognisant that the HSA Report had stated that “the possibility of the Bonjela contributing to the BrAC cannot be totally ruled out based on a single BEA reading”,128Foot Note 128×RoA at p 523 (Health Sciences Authority Report dated 23 October 2020 at para 5(d)).and also that “[t]o safeguard against such mouth alcohol defense, most studies emphasise the importance of taking duplicate breath reading within 2 minutes apart”.129Foot Note 129×RoA at p 524 (Health Sciences Authority Report dated 23 October 2020 at para 5(e)).The HSA Expert had clarified the contents of the HSA Report by explaining that the need to obtain two different BEA readings, with a waiting period of 2-- to 10 minutes between the two, was to ensure that the one BEA reading was not the product of “mouth alcohol” being detected instead. She explained that “most countries practise doing 2 readings, 2 to 10 minutes apart,to verify that there is no mouth alcohol effect”, and this may be necessary “[b]ecause mouth alcohol, if present, israndom. So, every time you breathe out, it will change quite a bit” [emphasis added].130Foot Note 130×RoA at p 158 (23 June 2021 Transcript at p 12 lines 21–23 and lines 26–27).Thus, if the positive BEA result was attributable to “mouth alcohol”, as opposed to “breath alcohol” (which is in equilibrium with a subject’s ‘blood alcohol’), the two results would differ from each other, as a “mouth alcohol” reading would fluctuate between breaths.131Foot Note 131×RoA at p 158 (23 June 2021 Transcript at p 12 lines 19–23 and lines 26–32). 98 However, these comments by the HSA Expert must be understood in light of her clarification that any matters pertaining to the functionality and operations of the Dräger Alcotest 9510 SG machine fell outside of the scope of her expertise.132Foot Note 132×RoA at p 162 (23 June 2021 Transcript at p 16 lines 18–28).I thus considered that she was not in a position to comment on whether that machine could distinguish between “mouth alcohol” and “breath alcohol” in a single valid BEA test result, or if the taking of two readings, 2 to 10 minutes apart, was needed to guard against such a “mouth alcohol effect” contaminating the one BEA result obtained. 99 On this issue, the Dräger Expert had testified that “one breath sample is sufficient for the device to measure the alcohol---breath alcohol concentration”,133Foot Note 133×RoA at p 239 (14 February 2022 Transcript at p 33 lines 1–3).that “[t]he machine can give a reliable test result with one sample”,134Foot Note 134×RoA at p 239 (14 February 2022 Transcript at p 33 line 6).and that there was no need to take two BEA test results to obtain an accurate BEA reading.135Foot Note 135×RoA at pp 238–239 (14 February 2022 Transcript at p 32 lines 30–32 and p 33 lines 1–7).This cohered with her explanation of how the Dräger Alcotest 9510 SG was able to distinguish between “mouth alcohol” and “breath alcohol”, which logically implied that a “mouth alcohol effect” would result in an error message rather than a valid first result. Given that I had already found that the DJ rightly accepted the evidence of the Dräger Expert on this point, and that it fell within her area of expertise, I was of the view that this should be accorded greater weight than the evidence given by the HSA Expert. I was thus of the view that there was insufficient evidence to support the Appellant’s assertion that a single BEA test result from the Dräger Alcotest 9510 SG machine was unreliable.",
        "Conclusion": "100 In summary, I was not convinced that there had been any error, let alone one justifying appellate intervention, in the DJ’s finding that the Appellant had failed to prove, on a balance of probabilities, that his BEA test result of 75g / 100ml being over the prescribed limit was attributable to his post-driving oral application of Bonjela gel. The Appellant thus failed to make out the exception under s 71A(2) of the RTA. 101 First, the Appellant had failed to show that his BEA test result being above the prescribed limit was attributable to him burping or belching during the breathalyser test, owing to his post-driving oral application of the Bonjela gel. There was no evidence that alcohol would have been left unabsorbed in his stomach after the passing of two hours, or that he had even burped or belched in the first place. Further, even if the Appellant had burped or belched, and there had happened to be unabsorbed alcohol in his stomach, this would have been indicated as a “mouth alcohol” error message on the Dräger Alcotest 9510 SG machine. 102 Second, the Appellant had failed to show that his BEA test result being above the prescribed limit was attributable to him having Bonjela gel trapped within the crack-line of his upper right molar during the administration of the breathalyser test, owing to his post-driving oral application of the Bonjela gel. Even if Bonjela gel had remained trapped in his tooth’s crack-line at the time of the breathalyser test, this would have been indicated as a “mouth alcohol” error message on the Dräger Alcotest 9510 SG machine. 103 Third, the Appellant had failed to show that his BEA test result being above the prescribed limit was otherwise attributable to his post-driving oral application of the Bonjela gel, in the absence of any burping or belching during the course of the breathalyser test or any Bonjela gel having been trapped in his tooth’s crack-line at that time. There was no evidence that the alcohol would have remained in his mouth for more than 20 minutes after his last application of Bonjela gel. Even if there had been alcohol in his mouth, this would have been indicated as a “mouth alcohol” error message on the Dräger Alcotest 9510 SG machine. 104 Fourth, the Appellant had failed to show that there had been improprieties in the administration of his breathalyser test by the Administering Officer. There was no requirement for the Administering Officer to observe a waiting period after the appearance of the error message “ALC. CONC. NOT STABLE”, and there was insufficient evidence that the omission to obtain two distinct BEA test results would have had any impact on the accuracy of such a test. 105 Accordingly, I found that the DJ did not err in giving effect to the assumption under s 71A(1) of the RTA that the breath alcohol level within the Appellant’s body, at the time of the alleged offence, was as indicated in the BEA reading that was obtained in this case –viz, 75g / 100ml. 106 For the above reasons and given the Appellant’s discontinuance of his appeal against sentence mentioned at [20] above, I dismissed the Appellant’s appeal against conviction and sentence. Vincent HoongJudge of the High Court Tan Wen Cheng Adrian (August Law Corporation) for the appellant; Gregory Gan (Attorney-General’s Chambers) for the respondent.",
        "": ""
    }
}