{
    "case_title": "Ma Zhen Hu MichaelvPublic Prosecutor",
    "ncitation": "[2023] SGHC 251",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 Mr Ma Zhen Hu Michael (“the Appellant”) pleaded guilty to and was convicted on a charge under s 64(1) and punishable under s 64(2C)(a) of the Road Traffic Act (Cap 276, 2004 Rev Ed) (“RTA”) for an offence of dangerous driving. 2 He was sentenced by the District Judge (“DJ”) to a fine of $3,500 for his offence. He was also disqualified from holding or obtaining all classes of driving licences for a period of 15 months with effect from 23 February 2023. The Appellant paid the fine of $3,500. He is, however, dissatisfied with the length of disqualification order imposed by the DJ and appeals against it.",
        "The facts": "3 Briefly, the Appellant was driving a motorcar on 16 April 2021. As he drove to Clemenceau Avenue, he stopped the car behind a line of vehicles which were queuing up before a roadblock which had been set up by the Traffic Police (“TP”). The Appellant could see the blinking blue and red lights from where his car was at which had been placed by the TP to indicate that there was a roadblock ahead. The Appellant then turned on the car’s hazard lights and reversed the car against the flow of traffic for a distance of about 50 metres. While the Appellant was reversing the car, two TP officers gave chase. The Appellant could see that there was at least one TP officer running towards his direction while he was reversing. The Appellant continued reversing. He then made a U-turn at the U-turn point at the opening of the centre divider and drove off. His conduct resulted in the driver of at least one vehicle having to take evasive action by swerving to the left to avoid a collision with the Appellant’s car.",
        "My decision": "4 The Appellant accepts that the sentencing parameters laid down inKwanWeiguang v Public Prosecutor[2022] 5 SLR 766 (“Kwan”) for determining the appropriate disqualification order for an offence punishable under s 64(2C)(a) of the RTA is relevant to the present case. InKwan, Aedit Abdullah J set down the following sentencing parameters (at [56]–[57]): (a) For a first-time traffic offenderwith a clean driving record(particularly where the offender has no history of compoundable offences or speeding tickets), the disqualification period should be set at 12 months or below. This would, however, only apply where the degree of potential harm posed to other road users is relatively low. (b) Where there is very dangerous behaviour demonstrated by the offender, or conduct showing a disregard for traffic rules, etiquette and the interests of other road users, the disqualification period should exceed 12 months and can go up to 24 months and beyond. 5 The Appellant makes various submissions in support of his position that a disqualification order of six months ought to have been imposed by the DJ. I consider each of these below: (a) First, the Appellant takes issue with the DJ’s assessment that the potential harm arising from the Appellant’s manner of driving was significant and that the level of danger posed by his driving was considerable. The Appellant argues that he had come to a complete stop and only proceeded to reverse the car against the flow of traffic when he had observed that there were no vehicles behind the car. Further, he had turned on the hazard lights to alert other road users and reversed at a slow speed of about 30 km/h. The fact that the Appellant stopped his vehicle, reversed only when he saw no vehicles behind the car and turned on his hazard lights and reversed at a slow speed does not, however, detract from the inherently dangerous manner of driving which the Appellant engaged in. While he may have proceeded to do the above as precautionary steps, the fact remains that he reversedagainst the flow of trafficon a four-lane road for a considerable distance. Regardless of the precautionary steps taken, the conduct which the Appellant engaged in while on the road was behaviour which other road users would not typically expect. This, therefore, meant that the potential harm was, as the DJ found, more than notional. Further, the Appellant drove the car in the manner which he did at a time when the traffic flow wasmoderate. This would have been amply clear to the Appellant given that there were a line of vehicles queuing up ahead of the Appellant’s car because of the roadblock. (b) Second, the Appellant submits that the DJ erred in placing weight on the fact that the driver of a vehicle had to swerve to the left to avoid a collision with the Appellant’s car as a result of the Appellant reversing the car against the flow of traffic. The Appellant states that he did not see a vehicle behind his car and that the implication of this was that the vehicle could not have been in close proximity to the Appellant’s car. This, however, is a self-serving argument. The Statement of Facts makes clear that the driver of the vehicle had toswerveto the left to avoid a collision with the Appellant’s car. The Appellant admitted to the Statement of Facts without qualification. While the Appellant may not have noticed the vehicle, this does not necessarily mean that the vehicle was not in close proximity to the Appellant’s car. (c) Third, the Appellant submits that the DJ erred in placing excessive weight on the Appellant’s antecedents to find that there was a pattern of persistent offending over a span of 22 years. Under s 139AA of the RTA, compounded offences can be considered for the purposes of sentencing. As is clear from the Appellant’s driving record, the Appellant has paid compounded fines for various traffic violations from as early as 1999. While these mainly related to regulatory offences, the Appellant paid a compounded fine in 2012 for failing to conform to a red-light signal. In 2012, the Appellant was also sentenced in court for an offence of drink driving for which he was fined $3,000 and a two-year disqualification order was imposed. More recently, following the Appellant’s commission of the present offence in April 2021, the Appellant paid a compounded fine on 11 November 2021 for failing to conform to a red-light signal. This offence occurredafterhe had already been charged for the present offence. I agree with the DJ that the Appellant’s driving record was poor and highlighted the need for deterrence by way of a sufficiently lengthy disqualification order. 6 Given my views on the Appellant’s arguments above, it is clear that the disqualification period in the present case fell within the latter category identified inKwan. The Appellant’s conduct showed a disregard for traffic rules, etiquette and the interests of other road users. Further, he did not have a clean driving record. His driving record demonstrated a continued disregard for traffic rules, such as by failing to conform to a red-light signal in 2012, drink driving in 2012, the present offence which took place on 16 April 2021, and a subsequent compounded offence of failing to conform to a red-light signal on 11 November 2021. In view of this, there was a need for a sufficiently deterrent disqualification order above 12 months, based on the sentencing parameters inKwan. 7 Finally, I consider the Appellant’s submission that the length of disqualification imposed is inconsistent with the disqualification orders imposed inNeo Chuan Shengv Public Prosecutor[2020] 5 SLR 410 (“Neo”) andKwanbelow. 8 InNeo, the Appellant pleaded guilty to a charge of dangerous driving under s 64(1) of the RTA for reversing his car against the flow of traffic for a distance of about 203 metres to avoid a police roadblock. The offender was sentenced to a fine of $4,500 and a ten-month disqualification order was imposed. The offender’s appeal against the length of his disqualification order was dismissed by the High Court. The Appellant contends that the DJ failed to sufficiently recognise that the potential harm inNeowas greater, given that the offender had reversed against the flow of traffic for a longer distance of about 203 metres. Further, there were numerous compounded traffic offences inNeofor speeding, failing to stop after an accident, failing to report an accident within 24 hours, inconsiderate driving and causing a vehicle to remain at rest in a position likely to cause danger to other road users. The offender also had convictions for driving whilst underage and driving without insurance coverage. I make two points in relation toNeowhich show that the DJ did not err in finding that a longer disqualification order was warranted in the present case: (a) It is clear that the distance of 203 metres driven by the offender inNeowas significantly longer than the distance of 50 metres driven by the Appellant here. However, it is equally important to recognise that the traffic conditions inNeowere quite different from the present case. InNeo, the offence took place at about 2.10am and there were no other vehicles or pedestrians along the road. This was quite unlike the present case, where there were vehicles queuing ahead of the Appellant’s car and the traffic flow was moderate along Clemenceau Avenue. Further, the fact that the driver of a vehicle did, in fact, have to swerve to avoid colliding with the Appellant’s car shows that the traffic flow was moderate in the present case. The potential harm was, therefore, higher in the present case than inNeo. (b) Further, as observed by the respondent, I note that the High Court had placed no weight on the offender’s compounded offences inNeoin determining if the ten-month disqualification order was manifestly excessive, given that the offence inNeohad occurred before the enactment of s 139AA of the RTA and the High Court’s position inNeowas that compounded offences were not relevant in sentencing. In the present case, it is clear from s 139AA of the RTA that the Appellant’s compounded offences can be considered for the purposes of sentencing. 9 InKwan, the offender pleaded guilty to a charge of dangerous driving under s 64(1) and punishable under s 64(2C)(a) of the RTA for repeatedly changing lanes ahead of a motorcar driven by another driver before abruptly applying his brakes. Further, there was an element of road rage inKwan, given that the offender was upset with the other driver over his conduct on the road. The offender there was also involved in a physical confrontation with the other driver. The offender was sentenced to a fine of $1,600, and a 15-month disqualification order was imposed at first instance. On appeal, the High Court reduced the length of the disqualification order to 12 months. While the Appellant argues that the DJ erred in failing to considerKwan, it is clear from the facts ofKwanthat the offender was a first-time offender and had an otherwise clean driving record. Because of the offender’s clean driving record and the lack of compounded offences, the High Court inKwanobserved (at [95]) that the offender’s conduct appeared to be a one-off incident. Balancing the element of road rage present inKwanwith the clean driving record of the offender which showed that the offence was likely to be a one-off incident, the court found that a 12-month disqualification order was appropriate. In contrast, the Appellant here has demonstrated a continued disregard for traffic rules, even committing a further compounded traffic offenceafterhe had been charged for the present offence. Therefore, the principle of deterrence was squarely engaged in the present case.",
        "Conclusion": "10 For the reasons above, I do not find that the 15-month disqualification order imposed by the DJ was manifestly excessive. Therefore, I dismiss the Appellant’s appeal against the disqualification order imposed.  Vincent HoongJudge of the High Court    Kanthosamy Rajendran and Jeyabal Athavan (RLC Law Corporation) for the appellant; Claire Poh and Edwin Ho(Attorney-General’s Chambers) for the respondent."
    }
}