{
    "case_title": "Lakshmi Anil Salgaocar (suing as the administratrix of the estate of Anil Vassudeva Salgaocar, deceased)vPurnima Anil Salgaocar",
    "ncitation": "[2023] SGHC 290",
    "coram": "Philip Jeyaretnam J",
    "sections": {
        "Introduction": "1 This case arises from a long-running dispute between a widow and mother, Mrs Lakshmi Anil Salgaocar (“Mdm Lakshmi”), and her daughter, Ms Purnima Anil Salgaocar (“Ms Purnima”), in respect of the estate of the late patriarch of the family, Mr Anil Vassudeva Salgaocar (“Mr Salgaocar”) (“the Estate”). The dispute principally relates to accounting for the Estate’s assets and Ms Purnima’s relative degree of involvement in (and remuneration from) the underlying family businesses, as compared with certain of her siblings. 2 This case in particular concerns whether, under the terms of a settlement agreement, Ms Purnima is precluded from pursuing an administration action for an account of the estate. This in turn depends on whether Mdm Lakshmi provided accounts of certain assets in accordance with that settlement agreement.",
        "Facts": "",
        "Background to the dispute": "3 Prior to his passing, Mr Salgaocar had filed a suit, HC/S 821/2015 (“S 821”), against one Mr Darsan Jitendra Jhaveri (“Mr Jhaveri”), claiming that a trust over substantial and valuable assets was created with Mr Jhaveri as trustee. Mr Salgaocar passed away intestate on 1 January 2016 and Mdm Lakshmi has continued the action as sole administratrix of the Estate. The assets that are the subject of S 821 fall within a larger group of the Estate’s assets referred to as “the Non-India Assets”.1Foot Note 1×Lakshmi Anil Salgaocar’s Affidavit dated 31 May 2022 at p 42. 4 The beneficiaries of the Estate are Mdm Lakshmi, Mr Salgaocar’s widow, and four children, including Ms Purnima. Disputes arose between Ms Purnima and Mdm Lakshmi, including about the amount of information the former was given about the Estate’s assets. On 13 April 2020, Mdm Lakshmi, in her capacity as administratrix of the Estate, and Ms Purnima entered into a settlement agreement.",
        "Procedural history": "5 Ms Purnima subsequently alleged that Mdm Lakshmi had breached their settlement agreement and filed HC/OS 928/2020 (“OS 928”) on 22 September 2020. On 27 May 2021, Mdm Lakshmi and Ms Purnima entered into a second settlement agreement (“2SA”) to settle OS 928.2Foot Note 2×Lakshmi Anil Salgaocar’s Affidavit dated 31 May 2022 at para 41 and pp 41–44.2SA is the agreement relevant to this matter. 6 Broadly, the bargain struck in 2SA was that, in return for Mdm Lakshmi providing certain accounts in relation to certain assets and making certain payments, Ms Purnima would not commence further litigation against the Estate until the final determination of S 821 (and any appeal arising therefrom). 7 I start by elaborating on the obligation concerning the provision of accounts. Under cl 7 of 2SA, Mdm Lakshmi was obliged to provide an account of the Non-India Assets for the period from 1 January 2016 to 31 December 2020 (the “Accounts”). These Accounts were to be drawn up by an independent and qualified accountant, and placed at the office of one Mr Gurbachan Singh of GSM Law LLP (“Mr Singh”) by 1 December 2021. Ms Purnima was entitled to inspect the Accounts with advance notice given but was not to take photos, video, or audio recordings of any material and/or information during the inspection. 8 Ms Purnima alleges that Mdm Lakshmi breached cl 7. First, the Accounts were not provided on 1 December 2021, even though cl 7 specifies this deadline and cl 20 of 2SA stipulates that “[t]ime shall be of the essence in the performance of this Agreement”.3Foot Note 3×Lakshmi Anil Salgaocar’s Affidavit dated 31 May 2022 at p 43. 9 Second, even when a document was eventually provided late for inspection on 28 January 2022, it was not an account of the Non-India Assets. Instead, it was a thin report by an accountant which purported to set out valuations of the Non-India Assets, excluding the assets which are the subject of S 821, on two dates,ie, 31 December 2015 and 31 December 2020. Ms Purnima’s grievance was not that the report should have included the assets which are the subject of S 821. Rather, even for the other Non-India Assets, the report did not contain any information on Mdm Lakshmi’s dealings with them between 31 December 2015 and 31 December 2020. I will say more about this contention later. 10 Accordingly, on 27 April 2022, Ms Purnima filed HCF/OSP 6/2022 (“OSP 6”) in the Family Justice Courts under r 786 of the Family Justice Rules 2014 principally seeking the Accounts but also other ancillary orders. 11 Instead of filing an affidavit in reply to OSP 6, Mdm Lakshmi filed this action on 18 May 2022, alleging that by filing OSP 6, Ms Purnima herself was in breach of 2SA. Mdm Lakshmi contends that, by operation of cll 11 and 18 of 2SA, Ms Purnima was precluded from commencing any action, other than an action for breach or enforcement of 2SA, until S 821 was finally determined.4Foot Note 4×Statement of Claim filed on 18 May 2022 at paras 18–19.Under 2SA, the final determination of S 821 included the trial and any appeal thereafter. 12  At this juncture, I set out cll 11 and 18 in full:5Foot Note 5×Lakshmi Anil Salgaocar’s Affidavit dated 31 May 2022 at pp 42–43. 11. Provided that the terms of this Agreement are fully complied with by [Mdm Lakshmi], [Ms Purnima] also agrees not to commence any further litigation against the Estate or any of the other beneficiaries of the Estate, in relation to the Non-India Assets and/or matters connected with [S 821] and/or by using any information, correspondence and/or documents arising in relation to and pursuant to this Agreement, until after the trial in [S 821] has been concluded and any appeal(s) thereafter has been finally determined and/or when [S 821] is withdrawn and/or settled. … 18. In the event of any breach of this Agreement, the Parties shall only be entitled to sue on this Agreement and shall not be entitled to revive or pursue OS 928. 13 Mdm Lakshmi claims, among other things, damages for Ms Purnima’s alleged breach, including repayment of certain moneys which she had paid Ms Purnima under cl 4 of 2SA. Mdm Lakshmi also seeks a permanent injunction to restrain Ms Purnima from commencing or maintaining any action other than for breach of 2SA until the final disposal of S 821. 14 On 31 May 2022, Mdm Lakshmi filed HC/SUM 2031/2022 (“SUM 2031”) in OC 49 to seek an injunction to restrain Ms Purnima along the lines of the main relief sought in OC 49. 15 On 10 June 2022, Ms Purnima filed a Defence and Counterclaim in OC 49. In her Counterclaim, Ms Purnima sought payment of moneys which Mdm Lakshmi was obliged to make under cl 4(b) of 2SA (see below at [18]), and which had been stopped. 16 On 28 June 2022, SUM 2031 was heard and decided by Lai Siu Chiu SJ who granted an injunction as sought in SUM 2031. Her grounds of decision issued on 28 February 2023 may be found atLakshmi AnilSalgaocar (suing as the administratrix of the estate of Anil Vassudeva Salgaocar, deceased) v Purnima Anil Salgaocar[2023] SGHC 49. Ms Purnima sought permission to appeal from the Appellate Division (“the AD”) and, having obtained it, filed an appeal against Lai SJ’s decision. 17 On 13 October 2022, Ms Purnima filed HC/SUM 3781/2022 (“SUM 3781”) in OC 49 for, among other things: (a) a declaration that 2SA remained binding on Mdm Lakshmi;6Foot Note 6×Single Application Pending Trial for HC/SUM 3781/2022 dated 13 October 2022 at para 6(a).and (b) an order that Mdm Lakshmi pay damages being equivalent to the amounts payable by Mdm Lakshmi under cl 4(b) of 2SA that had not been paid, and an order that she continue to make such payments until the final distribution of the Non-India Assets.7Foot Note 7×Single Application Pending Trial for HC/SUM 3781/2022 dated 13 October 2022 at para 6(b)–(c). 18 On 25 November 2022, I heard these aspects of SUM 3781. Under cl 4(a) of 2SA, Mdm Lakshmi was to pay Ms Purnima $135,000 in two instalments. Under cl 4(b), Mdm Lakshmi was also to pay Ms Purnima $15,000 on the fifteenth day of each calendar month from 15 June 2021 until the final distribution of the Non-India Assets. Mdm Lakshmi had paid the $135,000. She had also paid the $15,000 monthly payments until Ms Purnima’s allegation that Mdm Lakshmi had breached her obligation to provide the Accounts whereupon Mdm Lakshmi stopped making the $15,000 monthly payments from June 2022. In fact, Mdm Lakshmi went further to claim the return of the money which she had already paid to Ms Purnima: see [13] above. I noted that Mdm Lakshmi’s position was that 2SA remains in force.8Foot Note 8×Claimants Written Submissions for HC/SUM 3781/2022 dated 11 November 2022 at para 49.Accordingly, I ordered, among other things, Mdm Lakshmi to make payment of the $15,000 per month to Ms Purnima as damages, in so far as this pertained to overdue payments, and to continue to pay that sum monthly in accordance with 2SA. There was no appeal from my decision. 19 The next development was the first instance decision in S 821. On 28 February 2023, Kannan Ramesh JAD gave judgment inLakshmi AnilSalgaocar (suing as the administratrix of the estate of Anil Vassudeva Salgaocar) and another v Darsan Jitendra Jhaveri and others (Kwan Ka Yu Terence, third party)[2023] SGHC 47. Mdm Lakshmi described this decision as being largely in favour of the Estate. However, as Mr Jhaveri has filed an appeal, S 821 has not yet been finally determined for the purpose of cl 11 of 2SA. 20 On 4 May 2023, the trial of OC 49 took place before me despite the pending appeal against Lai SJ’s decision on the interim injunction at that time (see [16] above). Counsel took the view that the appeal would not affect the question of how the 2SA should be interpreted as the appeal only concerned the interim injunction, and so the trial proceeded. 21 A month later, on 5 June 2023, the AD delivered its judgment in the appeal against Lai SJ’s decision. The AD allowed the appeal and discharged the injunction. The AD’s judgment appears asPurnima AnilSalgaocar v Lakshmi Anil Salgaocar (suing as the administratrix of the estate of Anil Vassudeva Salgaocar, deceased)[2023] SGHC(A) 21 (\"Purnima AnilSalgaocar (AD)”). In its decision, the AD also made a final, and not merely interim, ruling on the interpretation of 2SA: “[Ms Purnima] is not restricted to suing for a breach of 2SA and may commence OSP 6”: at [51]. The AD’s ruling interpreting cll 11 and 18 of 2SA is expressed as a final decision that binds the parties in OC 49 as well as in OSP 6, including SUM 145. 22 The AD, first of all, expressed “the view that OSP 6 may be considered an action for breach of 2SA and may come within cl 18”:Purnima AnilSalgaocar (AD)at [35]. The AD considered cll 11 and 18 to be poorly drafted and inconsistent. The AD resolved this inconsistency by holding that cl 11 prevails over cl 18 such that Ms Purnima could commence OSP 6 even if it does not come within cl 18. 23 The AD then expressed “the view that, if [Mdm Lakshmi] has breached cl 7, [Ms Purnima] is not precluded from commencing OSP 6”:Purnima AnilSalgaocar (AD)at [44]. The AD reasoned that OSP 6 relates to matters in cl 11, which prevails over cl 18, and Ms Purnima is, accordingly, not precluded from commencing OSP 6 if Mdm Lakshmi had breached cl 7. No appeal was filed against the AD’s decision.",
        "Issues": "24 In light of the AD’s decision, I am left with the question whether Mdm Lakshmi had complied with the terms of 2SA. Ms Purnima complains that the Accounts had not been provided, a complaint that raises two issues: the first concerning the Accounts not being provided on time, and the second concerning whether what was eventually provided for inspection fulfilled the obligation to provide an account.",
        "Issue 1: Delay": "25 2SA was entered into on 27 May 2021, a clear six months before the date stipulated in cl 7,ie, 1 December 2021. It is worth recalling that cl 20 provided that time would be of the essence: see [8] above. 26 Mdm Lakshmi did not provide any account by 1 December 2021. Thereafter, up to her inspection of what was later provided, Ms Purnima repeatedly noted that Mdm Lakshmi was in breach of cl 7 and expressly reserved her position in writing.9Foot Note 9×Purnima Anil Salgaocar’s Affidavit of Evidence-in-Chief dated 16 September 2022 at paras 112–115 and pp 304–305.Indeed, Mdm Lakshmi admitted during cross-examination that Ms Purnima’s position was conveyed to her.10Foot Note 10×Transcript for the hearing on 4 May 2023 (“Transcript”) at p 85, lines 12–16.There was thus no waiver of the delay. 27 Notwithstanding, if Mdm Lakshmi had provided a compliant account late, then it would be difficult for Ms Purnima to contend that the proviso to cl 11,ie, full compliance with the terms of 2SA, had not been met (albeit late). If so, Ms Purnima would remain bound by the obligations in cl 11, including the obligation not to commence further litigation in relation to the Non-India Assets. It is significant that the proviso adopts the language ofcompliancerather than theabsence of breach, which suggests that the parties’ concern was with substantive compliance, even if late. In my view, once a compliant account is provided, the terms of 2SA would properly be said to have been “fully complied with” by Mdm Lakshmi notwithstanding that there had been a breach of the temporal requirements for performance. This does not mean that the breach would be cured, as potentially there might be loss suffered by Ms Purnima arising from the delay, only that the proviso would have been fulfilled by the later provision of the account. In this context, it is worth recalling that both parties have affirmed 2SA, and neither sought to terminate 2SA for the other’s alleged breach. 28 Thus, I now turn to the issue whether what was provided late was indeed the account required by cl 7.",
        "Issue 2: Nature and quality of the Accounts": "29 Clause 7 required Mdm Lakshmi to, among other things, “procure and provide an account of the Estate’s Non-India Assets for the period from 1 January 2016 to 31 December 2020 to be drawn up by an independent and qualified accountant”. 30 In my view, such an account must include an account of the movements in the covered assets during that period. It should include debits and credits in respect of funds held by the Estate. It is accepted that this was not provided and that instead what was provided were values against the assets at the beginning and end of the period. Such a limited exercise does not fit with the reference in the clause to an independent and qualified accountant, a professional whose expertise would be needed for the drawing up of accounts showing debits and credits and the movements of assets. Valuing two static lists of assets would not necessarily require an accountant’s assistance. 31 Much of the argument concerned whether cl 7 substituted by agreement a more limited form of account than what is required of the administrator of an estate. It has been aptly stated inHalsbury’sLaws of Singapore – Probate, Administration and SuccessionVol 15at para 190.102 that such accounts should show “the monies and assets received by the personal representative and how he had dealt with these monies and assets”. It is of course true that where an estate owns shares in a company, the account to be given is of those shares and not the underlying accounts of the companyper se. However, as an aside, a personal representative may have, by virtue of the estate’s shareholding in the company, possession of such documents including financial statements that the company provides to shareholders and such documents would potentially be trust documents that a beneficiary would be entitled to inspect or otherwise would be amenable to discovery. 32 In my view, cl 7 has to be interpreted in its own terms. That is what I did at [30] above. Clause 7 adopted the general language of “an account” and did not impose any limitation on this, whether to balance sheets as of specific dates or otherwise. 33 To any submission that there would be no benefit for Mdm Lakshmi to remain obligated to provide an account that in substance was the same as what she had to provide as an administratrix while making payments to Ms Purnima, the short answer is that cl 11, subject to its proviso, precludes, pending final determination of S 821, much more than just administration actions for accounts. It precludes any further litigation against the Estate,eg, for distribution, for breaches by the administratrix, or indeed litigation against other beneficiaries, a category which included Mdm Lakshmi, herself. Thus, on the face of 2SA, there are other contemplated benefits for Mdm Lakshmi and accordingly, this argument is not a good reason to read cl 7 of 2SA restrictively. 34 Moreover, when questioned at trial about this exercise of providing an account, Mdm Lakshmi confirmed that her understanding of cl 7 was that it required an account such as an estate’s administratrix should keep and provide to beneficiaries.11Foot Note 11×Transcript at p 59, lines 8–12.Her oral evidence undercuts her written submission that there is confusion arising from Ms Purnima’s behaviour which suggested that provision of the value of the Non-India Assets would sufficiently satisfy cl 7.12Foot Note 12×Claimant’s Closing Submissions dated 5 July 2023 (“Claimant’s Closing Submissions”) at paras 132–137.Mdm Lakshmi did not suggest that there was any difficulty in providing such an account, and instead claimed that she in fact had accounts showing what the Estate had received and spent.13Foot Note 13×Transcript at p 65, lines 20–23.Mdm Lakshmi did not seem to have personally considered the sufficiency of what was provided but instead left it to Mr Singh and the independent qualified accountant, one Mr Assan Masood (“Mr Masood”), to do what they believed was needed under cl 7 of 2SA.14Foot Note 14×Transcript at p 73, lines 19–25.The significance of this evidence is that this is not a case where the ability of an administratrix to provide a full account is in question such that allowances should be made in assessing the sufficiency of an account that is given. Mdm Lakshmi, by her own evidence, had accounts of receipts and expenditures, yet these were not provided to Ms Purnima. 35 Thus, I find that Mdm Lakshmi did not comply with cl 7 of 2SA. 36 Mdm Lakshmi’s counsel contended that this second breach was not properly pleaded because it did not appear in Ms Purnima’s Defence, but at best only in her Rejoinder.15Foot Note 15×Claimant’s Closing Submissions at pp 28–53.The Rejoinder to para 16(c)(vi) of the Reply expressly averred at sub-paras (14), (17), and (18) that what was provided late did not comply with cl 7 of 2SA. However, this objection is misconceived. 37 Ms Purnima pleaded in her Defence at para 16(c)(ii) that “[i]n breach of Clause 7 of [2SA], [Mdm Lakshmi] failed to provide an account of the Non-India Assets of the Estate on 1 December 2021”. Thus, Ms Purnima had put in issue the failure to provide the Accounts by the stipulated date. 38 Logically, it was then for Mdm Lakshmi to plead that she complied with cl 7 of 2SA after the stipulated date, such that cl 7 was subsequently “fully complied with”. Mdm Lakshmi duly did so by pleading that inspection of the Accounts was arranged for and took place on two subsequent dates, allegedly without complaint on Ms Purnima’s part until 28 March 2022. Ms Purnima’s Rejoinder then responded to the Reply’s assertion of late compliance by asserting that what came late was not sufficient. 39 I am accordingly satisfied that the sufficiency of the Accounts was in issue and Ms Purnima is entitled to raise it as part of her contention that the proviso to cl 11 of 2SA was not fulfilled. 40 I should deal specifically with two contentions of Mdm Lakshmi’s counsel directly. The first is that I had previously dismissed Ms Purnima’s appeal from my refusal of her application for discovery of what she had inspected but had not (in accordance with 2SA) taken a copy of.16Foot Note 16×Claimant’s Closing Submissions at para 100.I had in fact dismissed it because I considered that sufficiency of the Accounts could be adequately addressed without a copy of those documents, and indeed that has proved to be the case. I said:17Foot Note 17×Minute Sheet for the hearing of HC/RA 345/2022 on 27 January 2023 at p 4. I dismiss the appeal. The question of the sufficiency of the account may be dealt with by the witnesses recalling what its nature is and in broad terms the nature does not even seem to be in dispute. I do not consider the other categories to be material to the issues in dispute. In my view, the proper and proportionate approach to this dispute is to consider Clauses 7 and 11 in the context of the factual matrix as known to both parties and then consider whether providing lists of assets at the start and end of the period stated in Clause 7 was broadly sufficient at this stage of the estate’s administration in the light of the ongoing Suit 821. I have read the pleadings and the issues are very limited. Indeed, permitted scope and time for cross-examination of the witnesses is likely to be short. I keep front and centre the Ideals of ROC 2021. … 41 Following the trial of this matter, I have answered the question I posed at the time of the discovery appeal, namely whether providing lists of assets at the start and end of the period stated in cl 7 was broadly sufficient at this stage of the estate’s administration in the light of the ongoing S 821, in the negative. It was not sufficient. 42 The second contention is that Ms Purnima had not called Mr Masood or any expert evidence on the nature of the accounts required under 2SA.18Foot Note 18×Claimant’s Closing Submissions at para 66(j).I do not think that such evidence was necessary, nor would it have necessarily even been helpful. What is required by cl 7 of 2SA is a matter for contractual interpretation and the law, rather than raising any question of accounting standards or practice. 43 Accordingly, I accept and hold that the proviso to cl 11 was not fulfilled, as Mdm Lakshmi did not provide a compliant or sufficient account of the Non-India Assets, prior to the institution of OSP 6 (nor for that matter since).",
        "Conclusion": "44  For the foregoing reasons, I dismiss OC 49. Costs are to follow the event. Parties are to seek to agree to the quantum of costs, failing which they may write in to court with their respective positions and I will assess and fix the quantum. For avoidance of doubt, the time for appeal if any runs from the date hereof. Philip JeyaretnamJudge of the High Court Kanapathi Pillai Nirumalan, Liew Teck Huat, and Phang Cunkuang (Niru & Co LLC) for the claimant; Lim Gerui and Estad Amber Joy (Drew & Napier LLC) for the defendant.",
        "": ""
    }
}