{
    "case_title": "Asian Eco Technology Pte Ltd v Deng Yiming",
    "ncitation": "[2023] SGHC 227",
    "coram": "Hri Kumar Nair J",
    "sections": {
        "Introduction": "1 The claimant (“AET”) brought this action to recover, or claim damages in respect of, various diamond seeds and loose diamonds which it said belonged to it and which the defendant (“Deng”) was wrongfully in possession of. I allowed AET’s application for summary judgment. These are my grounds of decision.",
        "Background": "2 AET is a company incorporated in Singapore and is in the business of manufacturing and distributing lab-grown diamonds.1Foot Note 1×2nd Affidavit of Hua Lei dated 29 May 2023 (“HL-2”) at para 6.Deng was a director of AET, until he was removed by a members’ resolution passed on 17 January 2023.2Foot Note 2×HL-2 at para 7.At all material times, Deng was also the majority shareholder and director of X Diamond Capital Pte Ltd (“XDC”).3Foot Note 3×HL-2 at para 7. 3 AET’s claim against Deng was in respect of two different lots of diamonds (collectively, “the Diamonds”) – one lot of 627 diamond seeds (“the 627 Diamond Seeds”) and another lot of 7 loose diamonds (“the 7 Loose Diamonds”).4Foot Note 4×Statement of Claim (“SOC”) at paras 8–9 and 16–17. 4 AET claimed that it owned the Diamonds, and that Deng took possession of the Diamonds when he was a director of AET and wrongfully refused to account for or return them. AET therefore claimed against Deng for: (a) breach of fiduciary duties owed by Deng to AET;5Foot Note 5×SOC at para 23a.(b) further or alternatively, conversion of the Diamonds;6Foot Note 6×SOC at para 23b.(c) the tort of detinue in relation to the Diamonds;7Foot Note 7×SOC at para 23c.(d) further or alternatively, that Deng holds the Diamonds as a constructive trustee for AET and is liable to account for and/or deliver up the Diamonds to AET, and/or their traceable proceeds;8Foot Note 8×SOC at para 23d.(e) further or alternatively, that Deng is liable to make restitution to AET of the Diamonds.9Foot Note 9×SOC at para 23e. 5 AET sought,inter alia, an order that Deng deliver up the Diamonds and/or their traceable proceeds, further and/or alternatively, damages to be assessed.10Foot Note 10×SOC at p 9.",
        "The applicable law": "6 The legal principles governing summary judgments are uncontroversial. While the specific wording of O 9 r 17 of the Rules of Court 2021 (“ROC 2021”) is not the same as that in O 14 of the Rules of Court (2014 Rev Ed) (“ROC 2014”), earlier decisions in respect of O 14 of the ROC 2014 continue to apply under the ROC 2021:Horizon Capital Fund v Ollech David[2023] SGHC 164 at [58]. 7 The purpose of the summary judgment procedure is to enable a claimant to obtain a quick judgment where there is plainly no defence to the claim:Samsonite IP Holdings Sarl v An Sheng Trading Pte Ltd[2017] 4 SLR 99 at [152]. Where there is an issue or question in dispute which ought to be tried or there ought to be a trial for some other reason, leave to defend should be granted:Akfel Commodities Turkey Holding Anonim Sirketi v Townsend, Adam[2019] 2 SLR 412 at [30]. 8 To obtain summary judgment, a claimant must first show that he or she has aprima faciecase for judgment:Ritzland Investment Pte Ltd v Grace Management & Consultancy Services Pte Ltd[2014] 2 SLR 1342 (“RitzlandInvestment”) at [43]. If he or she succeeds in crossing this threshold, the burden shifts to the defendant who, in order to obtain leave to defend, must establish that there is a fair or reasonable probability that he or she has a real orbona fidedefence:Ritzland Investmentat [44]. 9 The defendant need only show that there is a triable issue or question:M2B World Asia Pacific Pte Ltd v Matsumura Akihiko[2015] 1 SLR 325 (“M2B”) at [19]. However, the court will not grant leave to defend if the defendant only provides a mere assertion of a given situation which forms the basis of his or her defence, or if the assertions are equivocal, lacking in precision, inconsistent or inherently improbable: seeM2Bat [19] (citingProsperous Credit Pte Ltd v Gen Hwa Franchise International Pte Ltd[1998] 1 SLR(R) 53 at [14]) andEngineering Centre of Industrial Constructions and Concrete v EFE (SEA) Pte Ltd and another[2021] SGHC 1 at [24]. It is not enough for the defendant to simply deny the claimant’s allegations or make unsupported assertions – the defendant must be able to provide some evidence which raises a triable issue, although the strength of his or her position is not relevant at this stage as the court is merely concerned with the question of whether there should be a trial: Jeffrey Pinsler,Singapore Court Practice(LexisNexis, 2023) at para 9.17.7. 10 Alternatively, the defendant may attempt to show that there ought to be a trial for some other reason, even though there is no reasonable probability of a real orbona fidedefence:M2Bat [19]. A defendant who relies on this argument bears both the legal burden of proof and the evidential burden on it:Wee Cheng Swee Henry v Jo Baby Kartika Polim[2015] 4 SLR 250 at [37].",
        "The issues": "11 The main issues in dispute were: (a) whether AET owned the Diamonds – this was the key issue;(b) whether Deng took possession of the Diamonds, either directly or through an agent; and(c) if the answer to (a) and (b) was yes, whether Deng was entitled to retain possession of the Diamonds (or their proceeds, if sold), or to refuse to account to AET for the same. 12 As the facts and circumstances relating to the two lots of diamonds were different, I shall deal with them separately.",
        "The 627 Diamond Seeds": "13 It was AET’s case that it had, through its affiliate, Nolash Tech Pte Ltd (“Nolash”), paid XDC a sum of $380,000 in October 2021, and of that sum, $314,817 was for the 627 Diamond Seeds.11Foot Note 11×HL-2 at para 19.AET said it procured Nolash to make the payment to XDC on its behalf as it did not yet have a bank account, and that it had since repaid Nolash.12Foot Note 12×HL-2 at para 18.Deng did not challenge the assertion that AET had paid Nolash the sum of $380,000, which in any event, was supported by an email confirmation from CIMB bank dated 18 November 2021.13Foot Note 13×Exhibit HL-7 (HL-2 at p 19). 14 Significantly, the following was not disputed or challenged by Deng: (a) XDC issued an invoice dated 25 October 2021 (“the Invoice”) to AET for “Diamond Seeds”;14Foot Note 14×HL-2 at para 15; 1st Affidavit of Deng Yiming (exhibited as “SLJQ-1” in the 1st Affidavit of Shermaine Lim Jia Qi dated 31 May 2023) (“DY-1”) at para 50. (b) XDC received a sum of $380,000 on 28 October 2021 from Nolash;15Foot Note 15×HL-2 at para 16. (c) on 30 June 2022, XDC (acting through Deng) delivered the 627 Diamond Seeds to AET’s parent company, Metech International Ltd (“Metech”);16Foot Note 16×SOC at para 8; Defence at para 3(8); HL-2 at para 19; DY-1 at para 56. (d) on or after 14 July 2022, Deng took possession of the 627 Diamond Seeds – he admitted this in his Defence;17Foot Note 17×Defence at para 3(11); DY-1 at para 57. (e) in September 2022, Mr Ling Ee Dee (“Ling”), a director of AET, sent Deng an excel sheet (“the Excel Sheet”) which reflected,inter alia, a deduction of $314,187 against the sum of $380,000 that AET paid to XDC earlier for “offsetting diamond seeds received” on 30 June 2022. This date corresponded with the day XDC delivered the 627 Diamond Seeds to Metech (see [14(c)] above).18Foot Note 18×HL-2 at para 19; Exhibit HL-10 (HL-2 at p 49).Deng, on behalf of XDC, acknowledged and confirmed the contents of the Excel Sheet;19Foot Note 19×HL-2 at para 20; Exhibit HL-11 (HL-2 at pp 50–56). (f) by a letter dated 15 December 2022, AET wrote to Deng, demanding,inter alia, the delivery of the 627 Diamond Seeds, which Deng did not respond to;20Foot Note 20×SOC at para 15; HL-2 at para 21; DY-1 at para 62.and (g) Deng has to date not handed over the 627 Diamond Seeds to AET, nor explained what he has done with them.21Foot Note 21×SOC at para 15. 15 Deng’s case was that the 627 Diamond Seeds were obtained by him from his “contacts” and loaned by XDC to AET.22Foot Note 22×DY-1 at para 55. 16 As stated above, the crucial factual question was whether AET owned the 627 Diamond Seeds. That turned on whether the 627 Diamond Seeds were purchased by AET from XDC and paid for out of the $380,000 it had arranged to be remitted to XDC. In this regard, AET relied on the Invoice and evidence of payment, as well as the undisputed or unchallenged facts in [14] above.23Foot Note 23×Exhibits HL-6 and HL-7 (HL-2 at pp 16–19). 17 I found that AET had purchased the 627 Diamond Seeds from XDC and rejected Deng’s claim of a loan. Deng’s assertion was not supported, and instead contradicted, by the objective evidence: (a) all the unchallenged evidence at [14] above supported AET’s case that it had purchased the 627 Diamond Seeds from XDC; (b) Deng did not produce any documents or other evidence, including internal XDC documents, to support his assertion that the 627 Diamond Seeds were obtained from his “contacts” or more importantly, were loaned by XDC to AET; (c) more fundamentally, Deng offered no evidence or alternative explanation as to what the payment of $380,000 received by XDC was for. The only inference from this glaring omission was that it must have been for the sale of the 627 Diamond Seeds as alleged by AET; and (d) Deng’s only response was that the Invoice reflected the quantity of diamond seeds as “1” and not 627.24Foot Note 24×Defendant’s Written Submissions dated 27 June 2023 (“DWS”) at para 44(b).AET explained that this was because the $380,000 was an advance payment, and the price for the 627 Diamond Seeds was then subsequently deducted from this sum.25Foot Note 25×Claimant’s Written Submissions dated 27 June 2023 (“CWS”) at para 28.Tellingly, Deng did not offer any alternative account of the Invoice although it was issued by XDC, his own company. 18 Deng pointed out that the handwritten number “BCS22076” at the top of the Invoice did not correspond to the number “BCS22021” found in the Excel Sheet in respect of the payment of $380,000.26Foot Note 26×DWS at para 44(a).AET explained that the former number was in respect of Nolash’s payment to XDC, while the latter referred to AET’s repayment to Nolash.27Foot Note 27×3rd Affidavit of Hua Lei dated 14 June 2023 (‘HL-3”) at para 15(a).Nothing turned on this. As stated above, what was critical was that Deng did not offer an alternative explanation for the $380,000 received by XDC as well as the details set out in the Excel Sheet, which he confirmed. These omissions were all the more glaring given that as the sole director and majority owner of XDC, Deng would have been in a position to explain these matters. Thus, Deng’s refusal to engage the material facts led to the irresistible inference that he had no alternative explanation and could not rebut AET’s case. 19 During oral submissions, counsel for Deng conceded that Deng had provided no alternative explanation for the Invoice and the Excel Sheet, and asked for leave to file an affidavit to address and explain the transaction. I summarily dismissed the application. Deng had filed three affidavits to oppose summary judgment, including a round of affidavits after AET’s response affidavits.28Foot Note 28×DY-1, Reply Affidavit of Deng Yiming dated 11 July 2023; 2nd Affidavit of Deng Yiming dated 8 August 2023.The importance of offering such explanation was obvious and could not have occurred to counsel for Deng only at the hearing. The application to file further affidavits was an abuse of process. 20 In the circumstances, there was no triable issue with respect to AET’s ownership of the 627 Diamond Seeds. Deng’s bare assertion of a loan, without dealing with the material facts and documentary evidence, was plainly insufficient. 21 There was also no dispute that Deng had taken possession of the 627 Diamond Seeds. Deng appeared to cast doubt on this in his affidavit, when he pointed out that AET’s internal records showing that he had withdrawn the 627 Diamond Seeds were unclear and inconsistent.29Foot Note 29×DY-1 at para 51.But nothing material turned on these records as Deng admitted, both in his Defence and affidavit, that he had taken possession of the 627 Diamond Seeds on 14 July 2022.30Foot Note 30×Defence at para 3(11); DY-1 at para 57. 22 Further, the receipt signed by Deng on 14 July 2022 reflected him receiving the 627 Diamond Seeds for delivery to AET’s factory in Kallang.31Foot Note 31×HL-2 at p 61. 23 I further note that in his WeChat messages to AET’s officer, Ms “Samantha” Hua Lei (“Ms Samantha”), Deng stated that “production work” had commenced at AET’s factory on the 627 Diamond Seeds that he collected on 14 July 2022.32Foot Note 32×HL-3 at p 46.This was not consistent with him taking back the 627 Diamond Seeds at the end of a loan. 24 Deng’s failure to respond to AET’s demand letter of 15 December 2022 was further evidence that his defence of a loan was an afterthought. 25 In the circumstances, Deng failed to raise any reasonable defence or triable issue with respect to AET’s claim in respect of the 627 Diamond Seeds.",
        "The 7 Loose Diamonds": "26 It was AET’s case that it had purchased the 7 Loose Diamonds from XDC and paid for them from the sum of $770,000 sent by AET to XDC on 7 January 2022.33Foot Note 33×HL-2 at paras 27–29.Of this, a sum of $169,208.30 was for the 7 Loose Diamonds.34Foot Note 34×HL-2 at para 30. 27 Deng did not dispute or challenge that AET had paid XDC the sum of $770,000. I also note that: (a) AET produced a purchase contract signed by AET and XDC dated 1 May 2022, whereby AET agreed to purchase $770,000 worth of “rough diamond and polished diamond” from XDC;35Foot Note 35×Exhibit HL-13 (HL-2 at p 66).and (b) on 6 June 2022, XDC issued an invoice and delivery order confirming the sale and delivery of $770,000 worth of 24 pieces of “rough and polished diamonds” to AET. The 7 Loose Diamonds were listed at items 6, 9 and 14–18 of the delivery order with an aggregate stated price of $169,208.30.36Foot Note 36×Exhibit HL-16 (HL-2 at pp 72–73); CWS at para 42. 28 Deng’s case was that the 7 Loose Diamonds were also loaned by XDC to AET. However, this defence was not credible. As with the 627 Diamond Seeds: (a) this was a bare allegation and no documentary evidence was produced to support the alleged loan;(b) Deng offered no alternative explanation as to what the payment of $770,000 by AET to XDC was for; and(c) Deng did not deal with the purchase contract, invoice and delivery documents referred to above. 29 In the circumstances, there was no triable issue as to the ownership of the 7 Loose Diamonds by AET. 30 However, Deng denied taking possession of the 7 Loose Diamonds.37Foot Note 37×Defence at para 3(19).To prove otherwise, AET relied on the following: (a) on 28 July 2022, Deng sent a WeChat message to Ling, informing him that the 7 Loose Diamonds needed to be delivered to a buyer;38Foot Note 38×HL-2 at para 31(a); Exhibit HL-17 (HL-2 at pp 75–83). (b) on 1 August 2022, Deng sent a WeChat message making arrangements for Ms Xu Kang (“Ms Xu”), a (then) director and shareholder of XDC,39Foot Note 39×1st Affidavit of Xu Kang dated 19 July 2023 (“XK-1”) at para 1.to collect the 7 Loose Diamonds from AET as he was unable to do so himself;40Foot Note 40×HL-2 at para 31(a); Exhibit HL-17 (HL-2 at pp 75–83). (c) on 1 August 2022, Ms Xu collected the 7 Loose Diamonds from AET and acknowledged their receipt in writing;41Foot Note 41×HL-2 at para 31(b). (d) on 1 August 2022, Ling sent a WeChat message to Deng, asking for the total price of the 7 Loose Diamonds and who the invoice would be issued to, to which Deng replied that he would provide the relevant information once he had it;42Foot Note 42×HY-2 at para 31(c); Exhibit HL-17 (HY-2 at p 82).and (e) on 15 August 2022, Ling sent Deng a WeChat message enclosing a document which asked for the details of the buyer of the 7 Loose Diamonds and the price, and Deng acknowledged this message without denying receipt of the 7 Loose Diamonds.43Foot Note 43×HL-2 at para 31(c); Exhibit HL-19 (HY-2 at p 89). 31 Unlike the 627 Diamond Seeds, there was no direct evidence that Deng had personally taken possession of the 7 Loose Diamonds. It was AET’s pleaded case that Ms Xu “would in turn have” handed over the 7 Loose Diamonds to Deng.44Foot Note 44×SOC at para 19.There was no direct evidence that Ms Xu did so. 32 However, I did not consider this to have raised a triable issue in Deng’s favour. In the face of the clear WeChat messages and the undisputed fact that Ms Xu collected the 7 Loose Diamonds after Deng had arranged for her to do so, it behoved Deng to explain his case. However, as I will explain, he failed to do so. 33 In his affidavit, Deng attempted to rely on a WeChat exchange on 12 July 2022 in which he allegedly asked Ms Samantha if it would be convenient for her to bring him “the diamonds to be returned”.45Foot Note 45×DY-1 at para 57; DY-1 at pp 88–95.Deng alleged that Ms Samantha replied that she would require more time before she could hand the “diamonds” over to him,46Foot Note 46×DY-1 at para 57; DY-1 at pp 88-95.with Deng accordingly picking up the “diamonds” from Metech’s premises on 14 July 2022. 34 In so far as Deng appeared to be relying on these messages to assert that Ms Samantha had agreed to hand over specifically the 7 Loose Diamonds to him, such reliance was misplaced. From the documentary evidence, the “diamonds” discussed in these messages could only refer to the 627 Diamond Seeds. Deng himself expressly referred to the “Seed” in this exchange with Ms Samantha.47Foot Note 47×DY-1 at p 93.Further, the “diamonds” collected by Deng on 14 July 2022 could not have included the 7 Loose Diamonds because these were only taken by Ms Xu on Deng’s behalf much later on 1 August 2022.48Foot Note 48×HL-2 at para 31, pp 41–42; DWS at para 48(c).In his affidavit, Deng did not mention the 7 Loose Diamonds Ms Xu collected on 14 August 2022, nor did he deal with his WeChat exchanges with Ling. Deng cannot create triable issues by simply making bare denials and failing to engage the material evidence: seeM2Bat [19] andSingapore Court Practiceat para 9.17.7. 35 Further, Deng procured Ms Xu to file an affidavit on 19 July 2023 in respect of the summary judgment application,49Foot Note 49×XK-1.but that affidavit avoided dealing with the 7 Loose Diamonds completely. The clear inference was that Deng was unable to rebut AET’s assertion that Ms Xu had collected the 7 Loose Diamonds on his behalf. 36 In any event, based on his own affidavit, Deng appeared to imply that he was entitled to take back the 7 Loose Diamonds as they were on loan to AET,50Foot Note 50×DY-1 at para 56.and as noted above at [33]–[34], he seemed to assert that Ms Samantha had agreed to return him the “diamonds”, which included the 7 Loose Diamonds.51Foot Note 51×DY-1 at para 57; DY-1 at pp 88-95.Viewed together with his instructions on WeChat for Ms Xu to collect the 7 Loose Diamonds and her collection of them (which she acknowledged in writing), the only conclusion is that Deng had taken possession of the 7 Loose Diamonds. His WeChat message to Ling on 1 August 2022 saying that he would furnish the price and details of the buyer of the 7 Loose Diamonds supported this,52Foot Note 52×Exhibit HL-17 (HL-2 at p 82).and further contradicted Deng’s case that the 7 Loose Diamonds were loaned to AET. 37 Further, Deng failed to respond to AET’s letter of 29 December 2022 which demanded that he account for the 7 Loose Diamonds.53Foot Note 53×Exhibit HL-20 (HL-2 at p 91).This further supported the conclusion that Deng had taken possession of the 7 Loose Diamonds and they were not loaned to AET previously, since if either fact were untrue, a simple response from Deng to that effect would have been expected. 38 In the circumstances, Deng failed to raise any reasonable defence or triable issue with respect to AET’s claim in respect of the 7 Loose Diamonds. 39 Deng pointed out that AET issued its demands for the 627 Diamond Seeds and the 7 Loose Diamonds several months after Deng had (allegedly) taken possession of them.54Foot Note 54×DWS at paras 41–42.AET explained that the demands were issued only after the Diamonds were discovered missing after an audit.55Foot Note 55×CWS at para 38; HL-3 at para 14.In any event, given the overwhelming evidence referred to above, I did not consider that the delay in issuing the demand, if any, afforded Deng a defence or gave rise to a reason for the claims to go to trial. Further, as noted above at [24] and [37], Deng did not respond to the demands with a claim that the Diamonds were furnished to AET as a loan – in fact, he did not respond at all. 40 Deng argued that there was a triable issue as to whether the claim should be commenced against XDC and not Deng personally.56Foot Note 56×DWS at para 54(a).That is misconceived. As stated above at [4], the pleaded causes of action were all personal against Deng based on his wrongful possession of the Diamonds. Further, the fact that AET may also have a claim against XDC did not preclude it from suing Deng, and certainly did not raise a triable issue. Indeed, counsel for Deng conceded that if the Diamonds were owned by AET, it would have a cause of action against Deng personally.",
        "Unrelated allegations": "41 Deng made several allegations against AET and persons he alleged are in control of it, namely one Mr Wu Yongqiang (“Wu”), and highlighted other disputes involving Wu and himself.57Foot Note 57×DY-1 at paras 6 and 21–39.Deng asserted that that the claims in this action were “fabricated” to prevent XDC from pursuing its claim in HC/OC 9/2023 against Wu.58Foot Note 58×DY-1 at paras 6, 16 and 19. 42 According to the Defendant’s Written Submissions, “the reason why [Deng] had chosen to explain the other related suits … was because they set the background leading up to the commencement of [this action].”59Foot Note 59×DWS at para 19.But that background did not advance Deng’s position. The allegation that AET was acting at the direction of Wu and this action was part of a broader dispute between Deng and/or XDC against AET, Wu or other parties did not, by itself, give a reason for this action to go to trial. 43 Deng had to show some basis that these other disputes suggested that AET had no cause of action, or that he had a viable defence, or was somehow being prevented from investigating or pursuing possible defences. Nothing of the sort was demonstrated. Nor was it Deng’s case that there were material facts or documents currently unknown or unavailable to him which would have assisted in defending this action or that the matter needed to proceed to trial so that his defences could be properly ventilated. The evidence that the diamonds were owned by XDC or loaned to AET was within his knowledge and possession – as shown above at [18] and [34], he completely avoided dealing with the material facts and failed to identify any evidence which might have assisted him. 44 In other words, whether AET was acting under the direction of Wu in bringing this action was irrelevant. Deng resorted to making irrelevant allegations against AET, Wu and others in the hope of creating sufficient smoke to obscure the fact that he had no viable defence. I also note that Deng did not even identify or explain what aspect of AET’s claim herein was “fabricated”. 45 Further, Deng’s broad allegations against Wu did not satisfy the criterion, as elaborated on inM2B(at [19]), of there being “some other reason” for a trial even though there is no reasonable probability of a real orbona fidedefence. There would be “some other reason” for a trial if Deng is able to satisfy the court that there are circumstances that ought to be investigated, especially where the plaintiff has been shown to be “devious and crafty” and where “most or all of the relevant facts are under the control of the plaintiff”:KLW Holdings Ltd v Straitsworld Advisory Ltd and another[2017] 5 SLR 184 at [56], citingConcentrate Engineering Pte Ltd v United Malayan Banking Corp Bhd[1990] 1 SLR(R) 465 at [12]. However, there should be some connection between the “other reason” and the substantive merits of the claim:Ling YewKong v Teo Vin Li Richard[2014] 2 SLR 123 (“Ling Yew Kong”) at [33]. The court will not grant leave to defend simply because of the claimant’s bad behaviour, unless the claimant’s unconscionable conduct opens the door to a possible defence:Ling Yew Kongat [33]. Here, as noted above, the allegations against Wu were irrelevant to the merits of AET’s claim against Deng. In the circumstances, there was no “other reason” for a trial. 46 In any event, I note that XDC was not hindered in pursuing its claim against Wu, and obtained summary judgment against him in HC/OC 9/2023 on 4 July 2023. 47 For completeness, I find that this application for summary judgment was not out of time. Even if it was, I make an order regularising the same. On Deng’s best case, AET was only just over an hour out of time in making this application.60Foot Note 60×DWS at paras 26–27.Deng suffered no prejudice and it would be consistent with the Ideals of the Rules of Court 2021 embodied in O 3 r 1(2), namely, promoting fair and expeditious proceedings and the efficient use of court resources, for this matter to be disposed of summarily.",
        "Remedies": "48 Counsel for AET elected at the hearing to waive its right for delivery up of the Diamonds and asked for damages to be assessed. 49 For the reasons above, I granted a declaration that Deng holds the 627 Diamond Seeds and the 7 Loose Diamonds as a constructive trustee for AET, and for damages to be assessed and paid by Deng to AET. I also ordered Deng to pay AET the costs and disbursements of this application and the action, which I fixed at $14,000 and $20,000 respectively, both figures exclusive of disbursements.",
        "Summons 1991": "50 AET also applied, in HC/SUM 1991/2023 (“Summons 1991”), to expunge certain paragraphs and/or exhibits in various affidavits, the Defence and the Defendant’s Written Submissions in the application for summary judgment.61Foot Note 61×Prayers 1–3 in HC/SUM 1991/2023; Claimant’s Written Submissions in HC/SUM 1991/2023 dated 3 August 2023 at para 5. 51 Deng argued that the above material was relevant as it showed how Wu is the ultimate controller of Metech, and therefore AET.62Foot Note 62×Defendant’s Written Submissions dated 3 August 2023 at para 10.This went towards demonstrating Wu’s ulterior motive, which was to utilise his companies (including Metech and AET) against XDC and Deng, in order to stifle XDC from pursuing its claim against Wu in HC/OC 9/2023. 52 I will deal with Summons 1991 separately. 53 For the avoidance of doubt, the above materials did not affect my decision to grant summary judgment as they, whether by themselves or together with the other evidence, did not raise any triable issue, or give some other reason for trial. Hri Kumar Nair JJudge of the High Court Yam Wern Jhien, Bethel Chan Ruiyi and Tan Li Jie Stanley (Setia Law LLC) for the plaintiff; Zhulkarnain bin Abdul Rahim, Sean Chen Siang En, Shermaine Lim Jia Qi and Cheong Wei Wen John (Dentons Rodyk & Davidson LLP) for the defendant."
    }
}