{
    "case_title": "Arif Rahim ValibhoyvMajlis Ugama Islam Singapura (Mohamed Shariff Valibhoy and others, non-parties)",
    "ncitation": "[2023] SGHC 341",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 The four trustees of the Valibhoy Charitable Trust (“VCT”), a trust administered by the respondent, Majlis Ugama Islam Singapura (“MUIS”), were unable to work together. On 12 June and 12 August 2021, MUIS made orders which resulted in the removal of the four trustees. One of these former trustees, Mr Arif Rahim Valibhoy (“the Applicant”), sought and obtained leave to commence judicial review of the orders made. He then filed his summons without serving any of the papers on the other three ex-trustees, Mr Mohamed Shariff Valibhoy, Mr Imran Amin Valibhoy and Mr Vali Mohamed Shariff Valibhoy (collectively, “the OETs”). The OETs subsequently filed HC/SUM 1671/2023 (“SUM 1671”) for the papers to be served on them, and to be joined as parties or allowed to participate as non-parties. 2 These grounds of decision engage the questions of whether, when leave has been granted to one of the former trustees to commence judicial review in respect of a particular decision involving multiple trustees, the other former trustees who were also party to the orders made would be parties to be served with the papers relevant to judicial review proceedings under O 53 r 2(3) of the Rules of Court (2014 Rev Ed) (“ROC”); and further, whether the court may join such parties under O 15 r 6 of the ROC, and if so, the capacity in which they ought to be joined and the directions relevant.",
        "Background": "3 The VCT is a Muslim charitable law trust (also known as awakaf) set up by the last will and testament of Mr Haji Vali Mohamed Bin Jooma (who was also known as Valibhoy Jumabhoy) dated 12 April 1948.1Foot Note 1×Affidavit of Arif Rahim Valibhoy dated 11 November 2021 (“Arif’s Affidavit”) at paras 3–4; Affidavit of Mohamed Shariff Valibhoy dated 5 June 2023 (“Shariff’s Affidavit) at para 9; Affidavit of Kadir Maideen bin Mohamed dated 3 January 2023 (“Kadir’s Affidavit”) at para 13.Under the Administration of Muslim Law Act (Cap 3, 2009 Rev Ed), allwakafsare administered by MUIS, a statutory body.2Foot Note 2×Kadir’s Affidavit at para 12. 4 The Applicant and the OETs, acting as the VCT’s four trustees managing its affairs, had been increasingly unable to cooperate with each other since 2013.3Foot Note 3×Arif’s Affidavit at paras 8–9.In January 2015, the OETs engaged solicitors and wrote to the Applicant to invite him to retire. He did not do so. The OETs proceeded to file HC/OS 355/2015 (“OS 355”) seeking the removal of the Applicant as a trustee of the VCT.4Foot Note 4×Arif’s Affidavit at para 12; Shariff’s Affidavit at paras 36–37; Kadir’s Affidavit at para 14.OS 355 was struck out on the ground that the administration ofwakafs, including the appointment, management and removal of trustees, fell within the exclusive domain of MUIS. The High Court held that it had no jurisdiction to hear and determine OS 355 (seeMohamed ShariffValibhoy and others v Arif Valibhoy[2016] 2 SLR 301 at [97]–[98]). 5 In May 2016, the OETs filed a complaint to MUIS to seek the Applicant’s removal as a trustee of the VCT, alleging unreasonable conduct on the part of the Applicant in managing the trust.5Foot Note 5×Shariff’s Affidavit at para 39; Kadir’s Affidavit at para 15.In October 2016, the Applicant filed a cross-complaint against the OETs seeking their removal as trustees of the VCT, alleging “serious breaches” of duties and “numerous instances of mismanagement of the VCT” by the OETs.6Foot Note 6×Arif’s Affidavit at paras 25–26; Shariff’s Affidavit at para 40; Kadir’s Affidavit at para 16.In accordance with MUIS’wakafdispute resolution framework, MUIS referred the Applicant and the OETs to mediation which the parties attended in January 2018. When the mediation proved unsuccessful, both complaints were referred to an Inquiry Committee constituted by MUIS.7Foot Note 7×Arif’s Affidavit at paras 32–35; Shariff’s Affidavit at paras 41–42; Kadir’s Affidavit at para 17.Both sides were represented by counsel and filed affidavits and submissions for the inquiry, and counsel made oral arguments during the hearing on 12 December 2018. There was no cross-examination of witnesses.8Foot Note 8×Arif’s Affidavit at paras 37 and 41; Shariff’s Affidavit at para 42; Kadir’s Affidavit at para 20. 6 Following the hearing, the Inquiry Committee provided its findings and recommendations to the Council of MUIS (“the Council”).9Foot Note 9×Kadir’s Affidavit at para 24.On 12 June 2019, MUIS informed the Applicant and the OETs that the Council had deliberated on the matter and directed that (a) the parties were to “collectively submit to [MUIS] an agreed operating protocol on the responsibilities, decision-making processes, and communication protocols between them for the management of the [VCT]” (“Agreed Operating Protocol”) and (b) “neither side [was] to claim any of their legal or other costs” for thewakafdispute resolution proceedings from the assets of the VCT (“the Costs Decision”).10Foot Note 10×Arif’s Affidavit at para 42; Shariff’s Affidavit at para 43; Kadir’s Affidavit at para 25. 7 The Applicant and the OETs could not agree on an Agreed Operating Protocol despite extensions of time being granted. Eventually, by a letter dated 12 August 2021, MUIS directed the removal of the Applicant and the OETs as trustees of the VCT with effect from 1 December 2021 (“the Removal Decision”).11Foot Note 11×Arif’s Affidavit at para 50; Shariff’s Affidavit at para 45; Kadir’s Affidavit at para 33.The reason stated was their failure to tender an Agreed Operating Protocol pursuant to MUIS’ earlier direction on 12 June 2019. 8 In HC/OS 1168/2021 (“OS 1168”), the Applicant applied for leave to commence judicial review proceedings against MUIS in respect of the Removal Decision and Costs Decision (collectively, “the MUIS Decisions”). He argued that MUIS ought to have decided on the complaint or invited the Applicant to show cause, rather than to circumvent the need to do so by asking parties for an Agreed Operating Protocol; such a request was irrational in the light of the relationship between the trustees. At the hearing for leave on 20 March 2023, the OETs were on a watching brief but had not similarly applied for leave because they were willing to abide by the MUIS Decisions in the event that leave was not granted. 9 A point argued at the leave hearing, because the OETs were not party to the leave application, was whether, without the OETs being joined, orders specific to the Applicant could be granted to him. Citing various precedents, the Applicant’s argument was that the MUIS Decisions were severable in respect of the individual trustees. In these grounds of decision, the term “severability” is used in the same meaning employed by the Applicant, to refer to a decision being applicable to an individual trustee in contrast to the four trustees as a whole. The Applicant’s argument was that the MUIS Decisions could be quashed in a manner specific to him; in the event that they could not, the proceedings would then be dismissed. The issue as to whether the MUIS Decisions are severable is a proper one for the substantive stage of these proceedings. Regarding the leave threshold of reasonable suspicion, I agreed the threshold was met. An extension of time and leave was granted for judicial review of the Costs Decision because that decision was related to the dispute, for which the Removal Decision marked the end of a process of negotiation between MUIS and the four trustees in the context of their ongoing litigation. The Removal Decision would be before the court in any event and the Costs Decision was an integral aspect of that Decision. 10 The Applicant accordingly filed HC/SUM 1155/2023 (“SUM 1155”) on 20 April 2023 for the following: (a) A quashing order against MUIS’ decision to remove the Applicant as a trustee of the VCT. (b) A quashing order against MUIS’ decision not to allow the Applicant to claim legal or other costs incurred in the dispute resolution proceedings before MUIS from the assets of the VCT. (c) A declaration that the Applicant’s legal costs and disbursements on an indemnity basis in respect of the dispute resolution proceedings be reimbursed from the VCT. He did not serve any papers on the OETs despite their request that he do so.12Foot Note 12×Shariff’s Affidavit at paras 80–82 and Tabs 28 and 29. 11 On 5 June 2023, the OETs filed SUM 1671 seeking,inter alia, (a) an order for the papers to be served on them (“the service issue”); and (b) an order that they were to be made parties to the proceedings or were alternatively allowed to participate as non-parties (“the joinder issue”). 12 When SUM 1671 first came on for hearing on 31 August 2023, the OETs explained that they were unable to submit on the manner in which they were to be joined as they had not yet been served, although they were clear that they wished to be joined as parties. I ordered service of the papers with a view to the joinder of the OETs, and directed parties to submit on the manner in which the OETs were to be joined. After hearing the parties on 16 October 2023, I joined the OETs as respondents, and gave directions for them to file a summons and relevant affidavit evidence to articulate their position with respect to the orders the court should grant. I also reserved costs of SUM 1671 to the substantive hearing of OS 1168. I deal with the service and joinder issues in turn.",
        "The service issue": "13 The service and joinder issues are related. Because I was of the view, in any event, that the OETs were proper parties to be joined, an order for service of the papers would have followed as a matter of logic. Notwithstanding this, as arguments were separately made on O 53 r 2 of the ROC, and the Applicant’s point was that the OETs ought not to have been served the papers, much less joined as parties, I deal briefly with the service issue.",
        "O 53 r 2(3) of the ROC": "14 The OETs’ request for service rested on O 53 r 2(3) of the ROC, which reads: Mode of applying for Mandatory Order, etc. (O. 53, r. 2) 2. … (3) The ex parte originating summons, the statement, the supporting affidavit, the order granting leave and the summons filed under paragraph (1) must be served on all personsdirectly affected, and where it relates to any proceedings in or before a Court, and the object is either to compel the Court or an officer thereof to do any act in relation to the proceedings or to quash them or any order made therein, the said documents must be served on the Registrar, the other parties to the proceedings and, where any objection to the conduct of the Judge is to be made, on the Judge. … [emphasis added]",
        "Arguments": "15 The OETs argued that they were entitled to service of the papers of OS 1168 under O 53 r 2(3) of the ROC as parties “directly affected”. It was their complaint that led to the Applicant’s removal as a trustee of the VCT and, like the Applicant, the OETs were parties to the same Removal Decision.13Foot Note 13×OETs’ Written Submissions dated 23 August 2023 (“OETWS”) at paras 18 and 33.The Removal Decision was reached on the basis that there was no agreement amongst the trustees on the Agreed Operating Protocol that MUIS required. There was no determination by MUIS on the complaints made by either the Applicant or the OETs.14Foot Note 14×OETWS at para 32.Similarly, the Costs Decision also applied equally to the Applicant and the OETs in that MUIS restricted both sides from claiming costs from the VCT in respect of the proceedings before MUIS.15Foot Note 15×OETWS at para 36.MUIS had no objections to the papers being served on the OETs and agreed that the OETs were parties “directly affected”. 16 In contrast, the Applicant argued that, for parties to be “directly affected”, their position must beworsenedby a successful outcome in the judicial review proceedings. Accordingly, if the Removal Decision was quashed for the Applicant only, the OETs would remain removed as trustees, which was no worse a position than before.16Foot Note 16×Arif’s Written Submissions dated 23 August 2023 (“AWS”) at paras 30–33.In fact, their rights and liabilities would remain the same.17Foot Note 17×AWS at para 54.Neither would the quashing of the Costs Decision affect the OETs directly or otherwise as the costs were to be drawn from the VCT.18Foot Note 18×AWS at para 34.Further, as the Applicant only sought to quash MUIS’ decisions in relation to himself, it could not be said that the Applicant’s judicial review application would impose any liability on or affect the rights of the OETs.19Foot Note 19×AWS at para 44.",
        "Decision": "17 Pertinently, the words of the provision expressly state “directly affected”, and not “adversely affected”. In insisting that adverse impact was necessary, the Applicant rested ondictain the Malaysian High Court case ofOttavio Quattrocchi v Menteri Dalam Megeri, Malaysia & Ors[2001] 6 MLJ 561 (“Ottavio”). There, while referring to a Hong Kong case,Tomlin v Preliminary Investigation Committee of the Dental Council of Hong Kong[1995] 1 HKC 533, Abdul Azziz J stated at [15]: “In other words, the defeat of the investigation committee in the judicial review would have had adverse consequences on the dentist”; and again at [16], “the adverse consequences on him of the successful outcome of the judicial review made him a person directly affected by the application for judicial review”. 18 Nevertheless, it is clear fromOttaviothat Azziz J regarded “adverse consequences” simplyas an exampleof being “directly affected”. While on the facts inOttavio, the dentist would experience adverse consequences and Azziz J therefore held that he was directly affected, it does not follow that “adverse consequences” and being “directly affected” become, in this analysis, the same concept. Indeed, a reading ofOttaviomakes clear that Azziz J referred to and appliedRegina v Rent Officer Service and another, exparte Muldoon[1996] 1 WLR 1103 (“Muldoon”), a case authority cited by the OETs and MUIS, where the phrase “directly affected” was explained. There, at 1105, Lord Keith elaborated, in interpreting the meaning of “directly affected” under O 53 r 5(3) of the English Rules of the Supreme Court 1965 (which isinpari materiawith O 53 r 2(3) of the ROC), “[t]hat a person is directly affected by something connotes that he is affected without the intervention of any intermediate agency”. 19 The Applicant’s alternate argument was that an intermediate agency did not refer to a person or entity, but any other means through which the OETs may be impacted. In this vein, the Removal Decision was an intermediate agency.20Foot Note 20×AWS at para 54.This argument is not supported byMuldoonand is but a variation of the argument that the OETs would suffer no adverse consequences if the Applicant is successful in obtaining a quashing order specific only to himself. 20 Both of these arguments are not consistent with the Singapore Court of Appeal decision inGolden Hill Capital Pte Ltdand others v Yihua Lifestyle Technology Co, Ltd and another[2021] 2 SLR 1113 (“Golden Hill”),whereMuldoonwas referred to with approval and explained, albeit in the context of O 57 r 3(6) regarding service of a notice of appeal to parties “directly affected” by the appeal. The Court of Appeal stated at [46] that “the word ‘affected’ entails some kind of impact on thestatus and legal rightsof the party in question” [emphasis in original]. The Applicant relied onGolden Hillbut did not explain how it was, in his view, “clear” that the search for adverse consequences replaced the test for “directly affected”.21Foot Note 21×AWS at para 29. 21 The threshold, as expressed inGolden Hill, does not reflect the need for adverse consequences on a party requesting to be served. Impact on status and legal rights is sufficient to satisfy the “directly affected” test. In the present case, the legality of the MUIS Decisions affected the OETs’ legal rights. It was incorrect for the Applicant to assert that “the OETs are not affected at all by a successful outcome of the OS”.22Foot Note 22×AWS at para 45.It was the OETs’ application to MUIS that culminated in the MUIS Decisions, which affected all four ex-trustees equally. These orders were not directed at any particular ex-trustee. If the removal on the basis that the trustees had not agreed to an operating protocol wasultra vires, their legal right to pursue the issue of their own status would become relevant. Therefore, the proceedings were of direct relevance to them.",
        "The joinder issue": "22 The question as to whether it was appropriate for the OETs to be joined required consideration of the following queries: (a) whether O 15 applies to proceedings under O 53; (b) if so, whether the requirements of O 15 were met; (c) if so, in what capacity the OETs should be joined; and (d) the best method for them to advance their case in an orderly manner.",
        "Is O 15 applicable in proceedings under O 53?": "23 The OETs relied upon O 15 r 6(2)(b) of the ROC, which provides: Misjoinder and nonjoinder of parties (O. 15, r. 6) 6.—(1) … (2)    Subject to the provisions of this Rule, at any stage of the proceedings in any cause or matter, the Court may, on such terms as it thinks just and either of its own motion or on application — (a)    … (b)    order any of the following persons to be added as a party, namely: (i)    any person who ought to have been joined as a party or whose presence before the Court is necessary to ensure that all matters in the cause or matter may be effectually and completely determined and adjudicated upon; (ii)   any person between whom and any party to the cause or matter there may exist a question or issue arising out of or relating to or connected with any relief or remedy claimed in the cause or matter which in the opinion of the Court it would be just and convenient to determine as between him and that party as well as between the parties to the cause or matter. 24 MUIS agreed with the OETs that O 15 r 6 applies to O 53 proceedings. 25 The Applicant, on the other hand, was of the view that O 15 is not applicable to judicial review proceedings because there is a specific provision in O 53 for the OETs to seek entry into these proceedings. Order 53 r 4, he argued, is “the only rule that permits [the OETs] a right of audience as a non-party”.23Foot Note 23×AWS at paras 60 and 70.Order 53 r 4 of the ROC reads: Right to be heard in opposition (O. 53, r. 4) 4. On the hearing of any summons filed under Rule 2, any person who desires to be heard in opposition to the summons and appears to the Court to be a proper person to be heard shall be heard notwithstanding that he has not been served with any documents. 26 The Applicant’s argument appeared to be that since O 53 r 4 confers the right of an opposing non-party to be heard, it excludes by implication the court’s general discretion to join parties under O 15 r 6 of the ROC. He relied on the Malaysian Federal Court decision ofMajlis Agama Islam Selangor v Bong Boon Chuen &Ors[2009] 6 MLJ 307 (“Bong Boon Chuen(FC)”) and a line of Malaysian authorities followingBong Boon Chuen(FC). 27 InBong Boon Chuen(FC), dissatisfied property owners applied for leave to commence judicial review proceedings against the local authority’s decision to allocate land (which was near the owners’ residential units) for the purpose of setting up a Muslim burial ground. The Islamic authority of Selangor, Majlis Agama Islam Selangor (“MAIS”), applied for leave to be joined as a party to the proceedings pursuant to O 15 r 6(2)(b) of the Malaysian Rules of the High Court 1980 (“RHC”), which isinpari materiawith O 15 r 6(2)(b) of the ROC. At first instance, MAIS’ joinder application was dismissed as it was found that MAIS did not satisfy the requirements of O 15 r 6(2), though the court agreed that O 15 r 6(2) of the RHC applied to judicial review proceedings. A majority of the Malaysian Court of Appeal upheld the decision refusing MAIS leave to be joined as a party. However, it also held that O 15 r 6(2) of the RHC was not applicable to judicial review proceedings (Majlis Agama Islam Selangor v Bong Boon Chuen &Ors[2008] 6 MLJ 488 (“Bong Boon Chuen (CA)”) at [7]). The court reasoned that in view of the existence of a specific provision, namely O 53 r 8(1) of the RHC (inpari materiawith O 53 r 4 of the ROC), which catered to parties wanting to be heard on matters in issue in judicial review proceedings, there was “no necessity for MAIS to be made a party in order to be heard and support the impugned decision of [the local authority]”:Bong Boon Chuen (CA)at [8]. Interestingly, while the Malaysian Court of Appeal recognised that MAIS sought to joinin support ofthe decision of the local authority, it still decided that the Malaysian equivalent to our O 53 r 4, which pertained to being heard inopposition, was applicable. On further appeal to the Federal Court, the court endorsed the majority’s view that since a specific rule (ie, O 53 r 8(1)) had been put in place for judicial review proceedings, the more general basis for intervention under O 15 r 6(2)(b) of the RHC could not be invoked:Bong Boon Chuen (FC)at [17]. 28 In interpreting O 53 r 4, I start with its plain words. The rule provides that a person who has not been served any papers may still be heard at the judicial review proceedings if he wishes to oppose the proceedings. It facilitates the hearing of a person who has not been served with papers, its only condition being that the person is a proper person to be heard. This rule comes after and is additional to r 2, which I have considered above, which provides for any party directly affected to be served. Rule 4 doesnotdeal with these parties. It doesnotprovide for the situation where a party, duly served with papers, wishes to proceed thereafter to oppose the application. Theassumptionreflected in the order and flow of O 53 r 2 and O 53 r 4 is that such a partywouldbe heard. Thus, r 4 is on its face not an exhaustive avenue of opposing the judicial review. At the 16 October 2023 hearing, the Applicant modified his position to say that r 4 was “but one example” that showed that the Court should confine itself to O 53.24Foot Note 24×Transcript 16 October 2023, p 9 lines 5–9.There is no indication within O 53, however, to show that other Rules of Court do not apply to O 53. 29 My interpretation of O 53 r 4 is consistent with the High Court decision ofManjit Singh s/o Kirpal Singh and another v Attorney-General[2013] 2 SLR 1108 (“Manjit Singh”). InManjit Singh, the applicants, who were advocates and solicitors, sought leave, pursuant to O 53 r 1 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) to commence judicial proceedings to quash the Chief Justice’s refusal to revoke his appointment of a Disciplinary Tribunal to hear and investigate a complaint against them. The non-party, the Law Society of Singapore, requested to hold a watching brief. The applicants objected to this by drawing the court’s attention to O 53 r 4 of the ROC. The applicants argued that, since r 4 conferred a right to be heard to a proper person who wished to oppose an application under O 53 r 2(1), but there was no equivalent rule giving a non-party a right to be heard on an application under O 53 r 1, the court had no discretion to permit the Law Society to attend the hearing. Vinodh Coomaraswamy JC (as he then was) rejected this argument.Inter alia, Coomaraswamy JC observed at [16] that “the purpose of O 53 r 4 is togivea right to a non-party on an application under O 53 r 2 rather than totake away a rightfrom a non-party on other applications.” [emphasis added] 30 In other words, O 53 r 4 allows a person who has not been served papers a right to be heard in opposition if he is a proper party to be heard. It doesnottake away rights from parties who have been served papers, and it doesnotabrogate the court’s powers under O 15 r 6. 31 It is in this context that I return to the Malaysian cases relied upon by the Applicant.Bong Boon Chuen (FC),and the other cases that appliedBong Boon Chuen (FC),are, in my view, of little assistance. The Singapore and Malaysian provisions are entirely different. The Malaysian O 53 refers expressly to other provisions within the Rules, incorporating them. This is consistent with its introduction in Rule 1(1), stating that “[t]his Order shall govern all applications seeking the relief specified in paragraph 1 of the Schedule to the Courts of Judicature Act 1964…”. The body of the Order also expressly incorporates other specific Orders. This was explained at [22] by the Malaysian High Court inMalayanAssociation of Private Colleges and Universities & Ors v Registrar General of Private Education Institutions & Ors[2017] 8 MLJ 813,when referring toBong Boon Chuen (FC)and the “well-entrenched principle that O 53 of the ROC had laid down a specific framework for purposes of all judicial review applications” (at [19]) as follows: … For instance, O 53 r 6 specifically refers to O 24 for discovery and inspection of documents, O 26 for interrogatories, O 38 for cross-examination of the deponent of any affidavit, O 53 r 7 allows for amendment to the statement or further affidavit to be used and O 53 r 8 allows any desirable party to file application to intervene in the judicial review proceedings. These provisions were specifically provided within the framework of O 53 despite similar provision having been provided elsewhere in the ROC. In the case of O 14A, the same was not incorporated in O53 and/or reference is made either in O 53 or O 14A for the applicability of O 14A procedure. Therefore, it is clear that the intention of Rules Committee is not to allow any other applications apart from those specifically provided in O 53, to be used. 32 Order 53 of the Singapore ROC is structured differently. Crucially, unlike the Malaysian equivalent, O 53 of the Singapore ROC does not specifically refer to other parts of the ROC, such as those relating to interrogatories and the cross-examination of the deponent of any affidavit. The Malaysian cases are therefore distinguishable. 33 The Applicant further argued that O 15 r 6 of the ROC could not be used to bypass the requirement for leave under O 53 r 1(1)(b).25Foot Note 25×Arif’s further written submissions dated 5 October 2023 (“AFWS”) at para 14.He relied onAmarjeet Singh v Public Prosecutor[2021] 4 SLR 841 (“Amarjeet Singh”).Amarjeet Singhwas first raised by MUIS in the context of arguing why the OETs should not be allowed to file a counterclaim or third-party notice (a point I deal with later).26Foot Note 26×MUIS’ Written Submissions dated 5 October 2023 (“MWS”) at para 17(b). 34 There, the applicant had been arrested and charged for using criminal force on a police officer. His case was that he had initially pleaded guilty because the Prosecution had allegedly promised during oral discussions that it would not seek a custodial sentence. He alleged that the Prosecution then changed its position, amended the charge and informed him that it would be seeking a custodial sentence. The applicant said in the circumstances, he would not plead guilty. He then made an application to the District Judge to enforce the alleged oral promise given by the Prosecution. When this was dismissed, he filed a criminal motion to the High Court seeking a declaration that the oral promise be enforced. The High Court dismissed the application. It found that the substance of the application was to stop the Prosecution from proceeding with its intended prosecution of the applicant for his offence of using criminal force. In the court’s view, this was effectively an attempt to secure public law remedies which were rightfully pursued under O 53 of the ROC. To allow the applicant to proceed by way of criminal motion would effectively allow him to bypass the need to secure leave to commence actions for judicial review (Amarjeet Singhat [41]–[43]). 35Amarjeet Singhholds that a criminal motion to the High Court ought not to be used to circumvent what ought to be the proper public law remedy,ie, judicial review,which carries a leave requirement. It doesnotstand for the wider proposition that the court is not entitled to join a non-party to a judicial review proceeding where leave has already been granted to another party. 36 The factual scenario at hand was crucial in this analysis. The OETs were not, prior to leave being given for these judicial review proceedings, opposed to the original MUIS order being effected.Their interests were only engaged upon the judicial review being filed. There wasnointention to bypass the leave requirement. Rather,leave having been givento the Applicant for a review the legality of the MUIS Decisions, their interests were then engaged as they were parties to the very same decisions. In the event that they had applied for leave, the same reasons for which the Applicant was granted leave would apply to them, and thereafter, it would have been efficient for the court to consolidate the two proceedings. Counsel for the Applicant conceded as much at the hearing, arguing that in those circumstances OS 1168 should proceed first because the Applicant had filed his application first. I rejected his assertion that his matter should be heard first. The related matters should be heard together.Joinder in this situation was the more efficacious manner ofmanaging proceedings. The court’s underlying discretion (see [38], below) in O 15 r 6(2)(b) to disallow joinder even where the specific statutory criterion was satisfied is an adequate safeguard against the potential misuse of O 15 r 6 by non-parties to bypass the leave requirement in O 53. The purpose of O 15 r 6 is “… to ensure that the right parties are before the court so as to minimise the delay, inconvenience and expense of multiple actions”:Tan Yow Kon v Tan Swat Ping and others[2006] 3 SLR(R) 881 (“Tan Yow Kon”)at [36]. Accordingly, “[t]he court is vested with a wide discretion in order to secure these objectives”:Tan Yow Konat [37]. 37 In the premises, I held that O 15 r 6(2)(b) of the ROC is applicable for a party seeking to be joined in a judicial review proceeding.",
        "Whether the OETs met the requirements of O 15 r 6(2)(b)": "38 The principles pertaining to a joinder under O 15 r 6(2)(b) of the ROC were not disputed. Joinder of a party is allowed when the party seeking to join meets either one of the two criteria outlined in O 15 r 6(2)(b). To assess the applicability of either criterion, a two-stage examination is conducted. The initial stage determines if the specific criterion is met, and this stage is entirely non-discretionary. If so, the court proceeds to the next stage, where it evaluates whether to exercise its discretionary power to permit the joinder of the applicant:Lim OonKuin and others v Rajah & Tann Singapore LLP and another appeal[2022] 2 SLR 280 (“Lim OonKuin”) at [25] andARW v Comptroller of Income Tax and another and another appeal[2019] 1 SLR 499 (“ARW”) at [40]. 39 When evaluating the “necessity” limb in O 15 r 6(2)(b)(i) of the ROC, the main question is whether the action, as originally framed, can be “effectually and completely determined” without adding the party in question (ARWat [41]). It is insufficient if, for example, a plaintiff merely desires to include a third party for the purpose of presenting a connected claim against it. If this criterion is met, the court then weighs “all the factors which are relevant to the balance of justice in a particular case” in exercising its discretionary power (ARWat [41]). 40 When invoking the “just and convenient” limb in O 15 r 6(2)(b)(ii), the court must first ensure that there is a question or issue concerning the party seeking to be joined that is relevant to an existing question or issue between the existing parties. Subsequently, in the exercise of its discretionary power, the court determines whether joinder for the purpose of deciding that question or issue would be just and convenient:Ernest Ferdinand Perez De La Sala vCompañia De Navegación Palomar, SA and others and other appeals(“De La Sala”) [2018] 1 SLR 894 at [204];Lim OonKuinat [27]. Arguments 41 The OETs submitted that they should be joined as both the “necessity” and “just and convenient” limbs in O 15 r 6(2)(b) of the ROC were satisfied. The “necessity” limb was satisfied as it was necessary to include the OETs in these proceedings to provide the court with the benefit of having all parties before it rather than just the Applicant. Given that the current proceedings involved the Applicant only, even though it was a challenge against MUIS’ Removal Decision, the Applicant’s judicial review proceedings could not be “effectually and completely determined” without the joinder of the OETs. Like the Applicant, the OETs were also removed by the same Removal Decision.27Foot Note 27×OETWS at para 46.The “just and convenient” limb was also satisfied as it was evident that the OETs were sufficiently connected to the judicial review proceedings. The Applicant’s removal as a trustee stemmed from the complaint lodged by the OETs against him. When reviewing the decision resulting in the Applicant’s removal, the inclusion of the OETs would be essential since they were the initial complainants. Thus, it was just and convenient for the OETs to be before the court as parties interested in the outcome of the proceedings.28Foot Note 28×OETWS at para 47.Finally, the balance of justice pointed in favour of joining the OETs and the court should accordingly exercise its discretion as such, considering the above reasons.29Foot Note 29×OETWS at para 48. 42 MUIS had no objection to the joinder of the OETs. Its views related to the capacity in which the OETs were to be joined, which is dealt with below. 43 In contrast, the Applicant argued that the “necessity” limb was not satisfied as OS 1168 concerned him only and did not refer to the OETs. The court was not asked to determine the legal rights of the OETs in respect of both the Removal Decision and Costs Decision.30Foot Note 30×AWS at para 64.Moreover, it was not unnecessary for the OETs to be present before the court in these proceedings as the OETs had “consistently taken the position at [pre-trial conferences] that they [did] not need to be heard”. The OETs’ main point was that MUIS’ Removal Decision was a single decision that applied to all the ex-trustees. However, as MUIS had also taken the same position, and would likely make this point during the judicial review proceedings (in resisting the Applicant’s application), the OETs’ presence before the court was unnecessary.31Foot Note 31×AWS at para 65.To buttress the preceding point, the Applicant argued that the court’s jurisdiction to make any order was restricted to the prayer in OS 1168. The court could not go beyond the Applicant’s prayer by quashing MUIS’ removal decision with respect to the OETs as well.32Foot Note 32×AWS at para 68.The Applicant did not make any argument on the “just and convenient” limb. Decision 44Lim Oon Kuinis instructive on the difference between the “necessity” and “just and convenient” limbs in O 15 r 6(2)(b) of the ROC. In that case, members of the Lim family (the “Lims”) applied to join themselves to two injunction applications taken out by Hin Leong Trading (“HLT”) and Ocean Tankers Pte Ltd (“OTPL”), respectively, against Rajah & Tann Singapore LLP (“R&T”), to restrain R&T from advising/acting as solicitors for HLT/OTPL and its judicial managers. According to the Lims, R&T had advised and acted for the Lims and their companies, including OTPL and HLT, since the 1990s, during which R&T was provided confidential information about the parties. The information was potentially relevant to the interim judicial managers and judicial managers of OTPL and HLT in any investigations they might undertake into the Lim Family’s management of OTPL and HLT. Hence, the injunctions were necessary to protect confidential information disclosed to R&T. 45 The Court of Appeal found at [28] that it was not “necessary” to join the Lims to the applications as the Lims did not assert an interest on behalf of the HTL and OTPL that was necessary to the determination of the injunction applications, nor was their presence necessary to the issue of whether the companies were entitled to the reliefs sought. Rather, their interest, as asserted, was in preserving the confidence of information belonging to themselves and their other companies. Accordingly, they did not meet the requirements of the first limb of O 15 r 6(2)(b). 46 Despite having found that the “necessity” limb was not made out, the Court of Appeal went on to hold (at [29]) that it was just and convenient to add the Lims under O 15 r 6(2)(b)(ii) of the ROC. This was because the Lims’ claims substantially arose from the same facts, being disclosure of information to R&T by the Lims and the companies, which the Lims claimed would not have taken place had they known R&T could subsequently act for the JMs of the companies in a manner adverse to their interests. As such, the questions of confidential information raised by the Lims were linked to the injunctive relief sought by the companies. The causes of action were linked by the same set of facts. 47 Coming to the facts of this case, I first address the “necessity” limb. The Applicant argued that the OETs were not necessary parties to his judicial review proceedings, because he sought only to quash the MUIS Decisions as they related to himself, and not the OETs. 48 In the present case, the OETs’ case stood on their argument that the Removal Decision was not severable as it equally applied to all the trustees.33Foot Note 33×OETWS at para 46.This was an issue that MUIS raised at the leave stage and formed an issue to be adjudicated at the substantive stage of these proceedings. A possible conclusion from the substantive stage would be that the MUIS Decisions may beultra viresand not severable. In this particular factual scenario, the issue could not be “effectually and completely determined” (seeDe La Salaat [203]) without the OETs’ participation. At the same time, the success of the Applicant’s summons rested on his contention that the decision was severable. The leave threshold is “very low”:ChanHiang Leng Colin and others v Minister for Information and the Arts[1996] 1 SLR(R) 294 at [22]. All that was required was aprima faciecase of reasonable suspicion in favour of granting the remedies sought: seeGobi a/l Avedian and another v Attorney General and another appeal[2020] 2 SLR 883. Arising from the low threshold for leave, it was not yet clear whether the OETs were necessary to the resolution of the case. 49 It is in this context that I turn to the “just and convenient” limb. This was satisfied because the OETs shared a substantial connection with the judicial review proceedings. Their removal was based on their repeated failure to agree on an Agreed Operating Protocol in the management of the VCT with the Applicant. In like vein toLim OonKuin, the various reliefs prayed for are linked by the same set of facts. The OETs and the Applicant were equally bound by the Removal and Costs Decisions. If, as argued by the OETs and as highlighted at [48] above, if the MUIS Decisions are not severable, it could become necessary for the OETs to be joined. And even if the subsequent decision on judicial review is that the MUIS Decisions are severable in respect of individual trustees, the OETs could then decide to initiate separate judicial review proceedings against MUIS concerning the same Removal Decision. The purpose of O 15 r 6 is to “minimise the delay, inconvenience and expense of multiple actions”:Tan Yow Konat [36]. 50 I therefore decided that it was just and convenient to join the OETs.",
        "Capacity in which the OETs were to be joined": "51 At the hearing on 16 October 2023, the OETs sought to be joined as respondents to the proceedings, for the following reasons.34Foot Note 34×OETs’ Further Written Submissions dated 28 September 2023 (“OETWS 2”) at para 6.First, it was a general principle that joint plaintiffs must be represented by the same counsel, which would not be the case at hand.35Foot Note 35×OETWS 2 at para 7.Second, the OETs and the Applicant differed fundamentally in their respective positions, and so they could not be co-applicants. The Applicant was of the view that the Removal Decision was severable but the OETs took the opposite position that the Removal Decision was not severable).36Foot Note 36×OETWS 2 at paras 11–13.In respect of the Costs Decision, the OETs objected to the Applicant’s prayer for a declaration that the Applicant’s legal costs and disbursements should be paid on an indemnity basis out of the assets of the VCT, as this would entail a significant depreciation of the VCT assets and prejudice the intended beneficiaries of the VCT.37Foot Note 37×OETWS 2 at paras 14–15. 52 In analysing their arguments, I deal first with the capacity in which the OETs were to be joined. In respect of their being joined as respondents, MUIS was in agreement.38Foot Note 38×MWS at para 11.The Applicant objected to their being joined altogether, but did not specifically object to their being joined as respondents. 53 In the present case, it became clear from the OETs’ further submissions that the OETs stood in opposition to the Applicant in two important aspects. In both of these aspects, they stood with MUIS. First, regarding the resolution of the dispute before MUIS, they were willing to abide by the MUIS Decisions, and they were equally willing to accept MUIS’s offer to reconsider the MUIS Decisions. Second, they were of the view that the MUIS Decisions were not severable. In my judgment, therefore, they were to be joined as respondents. The manner in which they would make clear the relief they sought was an ancillary issue, which I address below.",
        "Directions for further conduct of case": "54 The OETs initially proposed that they be allowed to file a counterclaim or third-party notice seeking a quashing order following their joinder as respondents under O 15 r 6(2) of the ROC. 55 The Applicant contended that a counterclaim or third-party procedure is not allowed in a judicial review proceeding. As regards a counterclaim, the procedure in O 53 of the ROC does not contemplate a situation where the respondent decision maker would make a counterclaim against the applicant who sought to challenge its decision.39Foot Note 39×AFWS at para 35.For the same reason, neither is a third-party procedure envisaged under O 53.40Foot Note 40×AFWS at para 39. 56 MUIS similarly objected to the OETs’ approach, citingAmarjeet Singh, and raising a concern that by so doing, the OETs were bypassing the leave requirement, which was an “indispensable part of the two-stage judicial review process prescribed under the Rules of Court 2014”. Instead, MUIS submitted that the OETs’ involvement in OS 1168 in relation to the Removal Decision ought to be limited to the issue in which they were interested,ie, if the Removal Decision was quashed, whether the effect of the quashing order applied to only the Applicant or extended to the OETs.41Foot Note 41×MWS at para 26.In response, three days before the 16 October 2023 hearing, the OETs clarified that the OETs did not “intend to seek a quashing order against MUIS’s decision”. Instead, they sought to seek “relief against [the Applicant] and MUIS in the form of a declaration that MUIS’s Removal Decision was a single inseverable decision”. The basis of this relief was O 15 r 16 of the ROC.42Foot Note 42×OET’s letter to court dated 13 October 2023 at para 3(a).This approach was also rejected by MUIS. At the hearing, counsel for MUIS, citingVellamad/o Marie Muthu v Attorney-General[2013] 4 SLR 1 (“Vellama”), was of the view that allowing the declaration to be sought in addition to the quashing orders sought by the Applicant would still circumvent the leave requirement of O 53. MUIS proposed that the OETs be granted leave, as respondents, to give evidence and make submissions on the severability of the Removal Decision as well as the Costs Decision, including but not limited to contesting the Applicant’s position that the quashing of the Removal Decision and Costs Decision could and should only be limited to him to the exclusion of the OETs.43Foot Note 43×MWS at para 30(c). 57 The OETs and MUIS had differing views onVellama. I did not consider it necessary to deal with these arguments. It is settled law that a declaration is a discretionary remedy and must be justified by the circumstances of the case. Relief in the form of a declaration of right would generally be superfluous for a plaintiff who has a subsisting cause of action:Karaha Bodas Co LLC vPertamina Energy Trading Ltd and another appeal[2006] 1 SLR(R) 112 at [13] and [14]. Examining the facts of the present case, a declaration was not sufficient or adequate relief for the OETs. The OETs and MUIS agreed that what the OETs require is, in the event that the MUIS Decisions are quashed, for those orders to apply to them. In effect, in the event that the MUIS Decisions are found to beultra vires, the OETs require that the quashing order apply to all four trustees. 58 O 32 of the ROC was sufficiently wide to allow the OETs to file a summons for the relief they sought. Rule 1 reads: Mode of making application (O. 32, r. 1) 1.Except as provided by Order 25, Rule 7, every application in Chambers must be made by summons in Form 60. There was nothing in the Rules disallowing a summons through which the OETs could make clear the relief they seek. Such a summons would be useful for the proper conduct of these proceedings. The affidavit to be filed in support would thus be aligned. O 15 r 6(2) is expressed broadly and empowers the court to add a person as a party, subject to the satisfaction of requirements specified in O 15 r 6(2)(b)(i) or (ii), “on such terms as it thinks just”. MUIS and the OETs had no objections to this approach. I therefore so ordered.",
        "Conclusion": "59 I therefore joined the OETs as respondents and directed that they should file a summons supported by an affidavit within four weeks to make clear their position that in the event the MUIS Decisions were quashed, such a quashing order is not severable and must extend to them. The Applicant and MUIS were given liberty to file affidavits in reply, if any were needed, within two weeks thereafter. Costs were reserved to the hearing of the OS. Valerie TheanJudge of the High Court Anil Narain Balchandani (Red Lion Circle) for the applicant; Kam Su Cheun Aurill (Legal Clinic LLC) (instructed), Poon Guokun Nicholas, Chan Xiaohui Darius (Chen Xiaohui) and Benjamin Tan Zhi Xiong (Breakpoint LLC) for the respondent; Vikram Nair, Foo Xian Fong and Liew Min Yi Glenna (Rajah & Tann Singapore LLP) for the non-parties.",
        "": ""
    }
}