{
    "case_title": "RB Investments Pte Ltd vKardachi, Jason Aleksander and others",
    "ncitation": "[2023] SGHC 274",
    "coram": "Philip Jeyaretnam J",
    "sections": {
        "Introduction": "1 The private trustees of a bankrupt came into possession of documents from the bankrupt’s erstwhile friend and business associate that, in their view, bore on the question of the bankrupt’s dealings prior to his bankruptcy, which they were duty-bound to investigate. That gentleman had received the documents by email from the bankrupt via an email address associated with the claimant. Some of the documents that the private trustees were interested in had also been sent, by emails preceding those to the gentleman in question, to lawyers engaged by the claimant, perhaps for mixed purposes of client due diligence and eventual legal advice on the restructuring or reorganisation of assets. 2 The application before me is to expunge the documents from an affidavit filed in examination proceedings brought by the private trustees within the main bankruptcy proceeding and to prohibit their further use or disclosure. 3 The principal questions on which this application turns are first whether the communications are subject to legal advice privilege held by the claimant and secondly if there was such privilege in initial communications that was lost upon forwarding then whether nonetheless the circumstances under which the documents were forwarded to the third party were such that equity should restrain their further use or disclosure. If not, they are admissible in evidence.",
        "Facts": "",
        "The parties": "4 The claimant, RB Investments Pte Ltd (“RBI”), is a company incorporated in Singapore. RBI’s sole director is Mrs Rashmi Bothra (“Mrs Bothra”),1Foot Note 1×Rashmi Bothra’s Affidavit dated 5 May 2023 (“Rashmi’s Affidavit”) at para 1.a Singapore citizen who is married to one Mr Rajesh Bothra (“Mr Bothra”).2Foot Note 2×Rashmi’s Affidavit at para 6.Mr Bothra, a Singapore citizen, was a director of RBI from 2015 to 2016.3Foot Note 3×Rashmi’s Affidavit at p 15. 5 RBI’s corporate secretary is the third respondent, Ms Wong Shaw Mooi (“Ms Wong”).4Foot Note 4×Rashmi’s Affidavit at p 12.Ms Wong also served as Mr Bothra’s personal assistant for several years, and was a registered shareholder, director, and/or secretary of over ten local and foreign companies which were owned, founded, and/or managed by Mr Bothra.5Foot Note 5×Affidavit of Jason Aleksander Kardachi dated 21 March 2023 filed in HC/B 2640/2020 for HC/SUM 794/2023 (“JAK’s Affidavit”) at paras 9 and 10(1).These companies include, among others, RB Family Trust Pte Ltd (“RB Family Trust”), for which Ms Wong has been appointed as company secretary since 13 December 2017.6Foot Note 6×JAK’s Affidavit at para 12(3). 6 The first respondent, Mr Jason Aleksander Kardachi (“Mr Kardachi”), and the second respondent, Mr Patrick Bance (“Mr Bance”), are joint and several private trustees of Mr Bothra’s bankrupt estate. I shall refer to the respondents collectively as the “Private Trustees”.",
        "Background to the dispute": "7 From 13 December 2017 to 27 February 2020, Mr Bothra was the registered shareholder of RB Family Trust. On or around 27 February 2020, Mr Bothra transferred ownership of the RB Family Trust to Mrs Bothra.7Foot Note 7×JAK’s Affidavit at para 12(3)(i).On or around 28 February 2020, Mrs Bothra transferred her ownership of the RB Family Trust to RB Investment Trust, a trust entity registered in the Cook Islands set up by Mrs Bothra. In March 2020, Mrs Bothra also transferred her shares in RBI to RB Investment Trust.8Foot Note 8×JAK’s Affidavit at paras 12(2)(ii) and 25. 8 In July 2020, Mrs Bothra, in her capacity as director of RBI, executed a letter of engagement and engaged one Mr Ray Shankar (“Mr Shankar”), a solicitor from Oon & Bazul LLP (“O&B”).9Foot Note 9×Rashmi’s Affidavit at para 8.The purpose of this engagement was for possible legacy planning and structuring of RBI.10Foot Note 10×JAK’s Affidavit at p 76; Rashmi’s Affidavit at para 12. 9 In 2021, Maersk Trade Finance A/S, a company incorporated in Denmark, commenced bankruptcy proceedings in HC/B 2640/2020 against Mr Bothra (“the Bankruptcy Proceedings”). On 25 February 2021, a bankruptcy order was made against Mr Bothra.11Foot Note 11×Order of Court (HC/ORC 1130/2021) dated 25 February 2021 (“Bankruptcy Order”).Pursuant to this order, the Private Trustees were appointed.12Foot Note 12×Bankruptcy Order at paras 1 and 2. 10 Prior to the making of the bankruptcy order, several fund transfers to RBI from Mr Bothra and entities associated with him were executed during the period from 2017 to March 2020.13Foot Note 13×JAK’s Affidavit at para 23.These entities included, among others, Kobian Pte Ltd (“Kobian”).14Foot Note 14×JAK’s Affidavit at para 23(3).Mr Bothra was a director and shareholder of Kobian15Foot Note 15×JAK’s Affidavit at para 12(12).and Mrs Bothra has referred to Kobian as “[Mr Bothra’s] business”.16Foot Note 16×Rashmi’s Affidavit at para 6.Ms Wong was not a shareholder, director, or company secretary of Kobian, however, she stated in an email that she “worked with Mr Rajesh Bothra in Kobian … as his junior secretary”.17Foot Note 17×JAK’s Affidavit at p 311. 11 As part of the carrying out of their statutory duties to administer and realise the assets of Mr Bothra’s bankrupt estate, the Private Trustees have investigated the circumstances leading up to the bankruptcy.18Foot Note 18×JAK’s Affidavit at para 6.However, these investigations have, in their view, been hampered:19Foot Note 19×JAK’s Affidavit at para 7. … by the fact that the Bankrupt has not been present in Singapore, having left Singapore even before the Trustees were appointed on 25 February 2021. The Bankrupt has also not been forthcoming in disclosing his residential (overseas) address to the Trustees, despite requests. Even though the Bankrupt is overseas, the Trustees nonetheless have made several efforts to request for the Bankrupt’s input and assistance in reconstructing the affairs and transactions of the Bankrupt. However, the Bankrupt has been slow to and/or has failed to satisfactorily assist the Trustees with their investigations. 12 In light of the “substantial lack of information” (in Mr Kardachi’s words), the Private Trustees decided to “reach out to third parties who appear to be in a position to give information concerning [Mr Bothra] or [Mr Bothra’s] affairs”.20Foot Note 20×JAK’s Affidavit at para 8.One such third party identified by the Private Trustees is Ms Wong, who, to Mr Kardachi’s knowledge, “is one of [Mr Bothra’s] long time personal assistants and has been assisting [him] withinter aliathe administrative matters for his companies” (see [5] above).21Foot Note 21×JAK’s Affidavit at para 9.In particular, Ms Wong has been the company secretary for RBI, a company that was owned, founded, or managed by Mr Bothra leading up to his bankruptcy, and the recipient of the various fund transfers, since 2012. Moreover, the legal ownership in RBI was transferred by Mrs Bothra to RB Investment Trust just months before Mr Bothra’s bankruptcy (see [7] above). 13 The Private Trustees hence applied in HC/SUM 794/2023 (“SUM 794”) for an order for the examination of Ms Wong under s 335(1) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed) (“IRDA”).22Foot Note 22×Application for an Order for an Examination under Section 335(1) of the Insolvency, Restructuring and Dissolution Act 2018 filed on 21 March 2023.I will refer to this application as the “examination proceedings”. 14 Mr Kardachi filed an affidavit in support of this application (“JAK’s Affidavit”). JAK’s Affidavit exhibits, among other things, two email chains with attachments. I shall refer to the email chains and their attachments as the “First Email Chain” and “Second Email Chain”, and collectively as the “Email Chains”. An email chain is in fact a succession of emails each of which pulls along with it the emails that had previously been sent. It is helpful to keep in mind that when an email is sent incorporating an earlier email it is in fact a fresh and separate communication, and must be considered in its own terms for the purpose of privilege and confidentiality. 15 The First Email Chain begins with emails exchanged between employees of O&B and Mrs Bothra or Mr Bothra from what might have been a shared email address. For privacy reasons I do not reproduce the email addresses in this judgment but instead describe them. The email address used in connection with the First Email Chain is stated to be the email address for communication to RBI in O&B’s engagement letter, although the domain is “rbworld” and not specifically that of RBI. As far as communicating with O&B is concerned, I assume it to be associated with RBI given its mention in the engagement letter. I will refer to it as the RB World Email Address. Some of the emails from the RB World Email Address to representatives of O&B attached various documents. These emails, and their attachments, related to the RB Family Trust (the “Email Exchange”). Along with six additional attachments, the Email Exchange was forwarded from the RB World Email Address to Mr and Mrs Bothra’s son, Mr Harsh Bothra (“Mr Harsh”),23Foot Note 23×Rashmi’s Affidavit at para 14.and one Mr Deepak Mishra (“Mr Mishra”).24Foot Note 24×JAK’s Affidavit at pp 72–91; 1st and 2nd Respondent’s Written Submissions dated 28 June 2023 (“1st and 2nd Respondent’s Written Submissions”) at para 4.Mr Mishra was described by counsel as a friend of Mr Bothra. There was no text included in this final forwarding email. Together, the Email Exchange and the final forwarding email to Mr Harsh and Mr Mishra constitute the First Email Chain. 16 The Second Email Chain comprises two emails. First, an email from Mr Bothra to two members of O&B containing an attachment, the words “[f]or your information”, and the letters “P&C”, the commonly used abbreviation for “Private and Confidential”. Second, the email in which Mr Bothra forwarded the preceding email, with a copy of its attachment, to Mr Mishra.25Foot Note 25×JAK’s Affidavit at pp 211–213.In this forwarding email, Mr Bothra’s name was included by way of sign off, without any additional text. Mr Bothra used an email associated with Kobian (the “Kobian Email Address”) to send both emails constituting the Second Email Chain. 17 Given the sequence in which the emails forming the content of the Email Chains appear in JAK’s Affidavit, with the final forwarding email being at the top of each Email Chain, I refer to these final forwarding emails as the “top emails”. 18 RBI objects to the admissibility of the Email Chains (including the attachments) exhibited to JAK’s Affidavit. Consequently, RBI filed the present application (HC/OA 473/2023) (“OA 473”) seeking, amongst other things:26Foot Note 26×Originating Application for HC/OA 473/2023 at para 2. (a) a declaration that certain documents exhibited therein are legally privileged communications and are inadmissible as evidence;(b) the aforementioned documents and several paragraphs be expunged and/or struck out;(c) the restraining of the Private Trustees and Ms Wong from disclosing the aforementioned documents in SUM 794 and/or any other proceedings and/or at all; and(d) a stay of the hearing of SUM 794 pending the resolution of OA 473. Ms Wong does not object to RBI’s prayers.27Foot Note 27×Applicant’s Written Submissions dated 28 June 2023 (“Applicant’s Written Submissions”) at para 6.",
        "The parties’ cases": "19 RBI submits that the Email Chains, including attachments, are subject to legal privilege and are inadmissible as evidence as they were communications between representatives of RBI and O&B that were exchanged for the purpose of obtaining legal advice for RBI. Further, there was no waiver of the confidentiality or legal privilege in the Email Chains. Accordingly, the Private Trustees are prohibited from relying on and referring to the Email Chains in the examination proceedings.28Foot Note 28×Applicant’s Written Submissions at para 5. 20 On the other hand, the Private Trustees submit that no legal privilege belonging to RBI protects the Email Chains. First, it is argued that the Email Chains were not prepared for the dominant purpose of obtaining legal advice.29Foot Note 29×1st and 2nd Respondent’s Written Submissions at paras 4–10 and 46–48.In relation to the First Email Chain, the Private Trustees also submit that Mr Bothra is a third partyvis-à-visRBI and O&B, and hence the emails from him to O&B do not attract legal advice privilege.30Foot Note 30×1st and 2nd Respondent’s Written Submissions at paras 25–29.Moreover, as regards the Second Email Chain, the Private Trustees contend that RBI has not established how or why these emails and their attachments concern RBI.31Foot Note 31×1st and 2nd Respondent’s Written Submissions at paras 43–45.Further, even if legal advice privilege may be asserted over the Email Chains, such privilege was waived or lost as the Email Chains were forwarded to third parties (ie, Mr Harsh and Mr Mishra).32Foot Note 32×1st and 2nd Respondent’s Written Submissions at paras 30–39 and 49–50.",
        "Issues to be determined": "21 I will deal with the issues in the following order: (a) whether legal advice privilege can be asserted over the Email Chains; and(b) if not, whether the Email Chains are nonetheless impressed with an obligation of confidence such that the court’s equitable jurisdiction should be exercised notwithstanding the lack of privilege.",
        "Whether legal advice privilege can be asserted over the Email Chains": "",
        "Applicable law": "42 Where the privileged document has come into the hands of third parties, the leading case is the Court of Appeal decision ofWee Shuo Woon v HTSRL[2017] 2 SLR 94 (“Wee Shuo Woon”). In that case, the defendant to an action accessed emails that had been published on the Internet as part of a large trove of material hacked from the computer systems of, among others, a law firm. These emails were undoubtedly communications between the plaintiff and its lawyers and were originally subject to legal advice and/or litigation privilege. The defendant sought to use them in an attempt to strike out parts of the action. The Court of Appeal noted that as the emails had already come into the possession of the opponent, the issue was not one of privilege but of admissibility of evidence. The court considered the circumstances in which the emails were obtained in order to answer the question of whether equity should restrain their use and admission into evidence owing to a breach of confidence. 43 Indeed, while privilege presupposes confidentiality, obligations of confidentiality are not dependent on the existence of privilege: see the decision at first instance inHTSRL v Wee Shuo Woon[2016] 2 SLR 442 (“HTSRL”) at [21]. Privilege is founded on the law of evidence while the law of confidence exists outside the law of evidence: seeHT SRLat [18]. 44 The position in Singapore is that where a third party has come into possession of confidential information in circumstances where the confidential nature of such information is clear to him, he owes an obligation of confidentiality: seeVestwinTrading Pte Ltd and another v Obegi Melissa and others[2006] SGHC 107 at [46] andX Pte Ltd v CDE[1992] 2 SLR 996 at [35]. InAdinopCo Ltd v Rovithai Ltd and another[2019] 2 SLR 808 (“Adinop”), the Court of Appeal explained at [41] that “[e]quity may impose a duty of confidence whenever a person receives information in circumstances importing an obligation of confidentiality”, subject to the satisfaction of three elements (set out inCoco vAN Clark (Engineers) Ltd[1969] RPC 41 at 47and followed inPH Hydraulics & Engineering Pte Ltd v Intrepid Offshore Constructions Pte Ltd[2012] 4 SLR 36 at [55]): (a) the information must possess the necessary quality of confidence;(b) the information must have been imparted or received in circumstances such as to give rise to an obligation of confidentiality; and(c) there must have been unauthorised use and detriment on the party who disclosed the information to the recipient who misused it. 45 The burden is on the party asserting a duty of confidence in equity to establish it: see generally,Adinopat [88]. 46 Thus, I must on the affidavit evidence reach a conclusion on the facts and make a finding concerning the circumstances of receipt by Mr Mishra and whether they import an obligation of confidentiality. This affects the question of whether equity should restrain the use and admission of the Email Chains as a breach of confidence. There is an overlap with the inquiry concerning whether the top emails were privileged but it must still be considered separately and this I now do.",
        "My decision": "47 In relation to the First Email Chain, it is accepted that Mr Bothra had used the RB World Email Address on occasion, including on this one. Mr Mishra’s evidence is that he considered that both of the top emails came from Mr Bothra personally. He asserts that Mr Bothra never informed him that the emails should be kept privileged and/or confidential.40Foot Note 40×Deepak Mishra’s Affidavit dated 19 June 2023 (“Mishra’s Affidavit”) paras 18 and 22.He further asserts that he “was never involved in [RBI]’s affairs and dealings, and was not an authorised representative of the [RBI] at any point of time [sic]”.41Foot Note 41×Mishra’s Affidavit at para 19.I accept his evidence: see [38] above. 48 Further, I do not accept Mrs Bothra’s assertion that she involved, among others, Mr Mishra for the purpose of taking legal advice for RBI.42Foot Note 42×Rashmi’s Affidavit at para 14.This was a bare assertion, and she provided no details of how she in fact involved him if that was what she truly did. 49 My view that Mrs Bothra’s assertion should be rejected is fortified by the picture that emerged during the oral hearing. Quoting RBI’s counsel, Mrs Bothra was “a housewife”. This explained her reliance on her husband. There was also evidence sufficient to conclude, at least provisionally at this stage of the matter, that RBI had been Mr Bothra’s investment vehicle and that any exercise of restructuring or reorganisation of assets was in fact being driven by Mr Bothra and not Mrs Bothra. Therefore, it was unlikely that she took the initiative to involve Mr Mishra for the purpose of taking legal advice for RBI, and accordingly I reject any argument that Mr Mishra received the top emails in confidencevis-à-visRBI. 50 Further, in relation to the First Email Chain, I accept that nothing was said expressly about keeping the emails privileged or confidential. While continued confidentiality may be implied from the circumstances without any express intimation of it, the circumstances in this case do not support it. Unlike the situation where the forwarded document is, for example, obviously legal advice on a specific and confidential matter, nothing in what was sent to Mr Mishra would have clearly suggested to him that privilege of RBI was in play. Most importantly, I accept that Mr Mishra was not involved in RBI’s affairs or dealings. Nor was Mr Mishra RBI’s authorised representative. Rather, the Email Chains were sent to and received by Mr Mishra in his personal capacity, in connection with Mr Bothra’s affairs generally, as opposed to RBI’s affairs. Even if Mr Bothra’s affairs included what he should do (in view of the claims made against him) with RBI or RBI’s assets, this should not be conflated with RBI’s affairs. In other words, the top email, and the other contents of the Email Chain, were not imparted to or received by Mr Mishra in circumstances that give rise to an obligation of confidentiality owed by him to RBI. 51 In relation to the Second Email Chain, this finding is further supported by the fact that the top email, including the attachment thereto, was sent from Mr Bothra’s Kobian Email Address, an email address unrelated to RBI. Accordingly, the obligation of confidence owed to Mr Bothra cannot be relied on by RBI, nor indeed would it be a shield available to Mr Bothravis-à-visthe Private Trustees’ investigation of his affairs. 52 I stress that my views do not depend on any identification of RBI with Mr Bothra nor on any lifting of the corporate veil. Those would be questions for another day, if at all. 53 Accordingly, I do not accept that Mr Mishra received the top emails in confidencevis-à-visRBI. Any duty of confidence owed by Mr Mishra in relation to the top emails, if it arose at all, would be owed to Mr Bothra, as opposed to RBI. 54 This application does not concern any duty of confidence owed to Mr Bothra, and as far as I am aware Mr Bothra has thus far not sought to object to the use of the documents by the Private Trustees in their investigations of his estate. At leastprimafacie, he would be unlikely to be able to do so successfully, given that they now stand in his shoes, where the matters said to be confidential to him precisely concern the Private Trustees’ investigations of his affairs, as opposed to some other collateral matter. This proposition is in fact consistent with the decision of the English Court of Appeal inShlosbergv Avonwick Holdings Ltd[2017] 2 WLR 1075 to the effect that a trustee in bankruptcy may take possession of records to which privilege attaches for the discharge of his duties in getting in, realising and distributing the bankrupt’s estate, except that he may not waive the bankrupt’s privilege in taking steps against third parties for the benefit of the bankrupt’s estate. Here, there is no issue of the Private Trustees taking steps against third parties, and indeed the general rule that the Private Trustees may take possession of privileged records for the discharge of their duties applies. 55 There are two further points that were not fully argued before me. The first point is that the present use of the Email Chains is in a proceeding that does not involve RBI, and so RBI is not in a position to restrain the admission of the Email Chains into evidence. In my view, examining persons with knowledge of a bankrupt’s affairs is a proceeding that belongs in both form and substance within the bankruptcy proceeding. It is not a proceeding against RBI. Thus, at this point no question of admissibility in relation to RBI arises, and it could be said that this application was in any event premature. The second is whether RBI’s bringing this application might indicate that RBI is being used to stymie investigations into Mr Bothra’s affairs, investigations that the Private Trustees are duty-bound to make. This raises the question of “clean hands” in seeking equitable injunctive relief. However, as neither point was fully argued, I have not relied on them in dismissing the application.",
        "Whether the Email Chains are impressed with a duty of confidence": "41 As I have found above, no legal advice privilege attaches to the top emails and hence to the Email Chains in the hands of Mr Mishra. Notwithstanding, the absence of privilege does not preclude a finding that Mr Mishra received the top email in circumstances where equity should intervene to restrain the use of the preceding emails under the law of confidence. In other words, the question remains as to whether Mr Mishra received the top emails with the understanding that they had forwarded to him documents that had been subject to privilege belonging to RBI and hence that he ought not to use or disclose them further without RBI’s consent.",
        "Conclusion": "56 To recap, I have assumed for this application that the emails as sent to O&B and the attachments to those emails could be subject to legal advice privilege in favour of RBI. However, when Mr Bothra forwarded them to Mr Mishra that communication was not privileged, nor did Mr Mishra receive such communication under any duty of confidentiality to RBI. These twin conclusions were broadly based on my view of the circumstances under which Mr Bothra communicated with Mr Mishra. In my view neither Mr Bothra nor Mr Mishra were authorised representatives of RBI in connection with the sending and receipt respectively of the top emails. Further, those top emails and their attachments concerned Mr Bothra’s affairs for which he desired Mr Mishra’s assistance. 57 For these reasons, I dismiss RBI’s application in its entirety. Parties are to seek to agree costs within 14 days of the date of this judgment, failing which they are to file costs submissions limited to three pages each within seven days after that. I will then proceed to determine and fix costs. Philip JeyaretnamJudge of the High Court Vikram Nair, Foo Xian Fong, Liew Min Yi, Glenna and Ashwin Kumar Menon (Rajah & Tann Singapore LLP) for the claimant; Yeo Alexander Lawrence, Han Tiong, Ee Jia Min, and Tan Yen Jee (Allen & Gledhill LLP) for the first and second respondents; Chua Sui Tong and Abigail Tang En-Ping (Rev Law LLC) for the third respondent.",
        "": ""
    }
}