{
    "case_title": "Public ProsecutorvTan Yew Kuan and another",
    "ncitation": "[2023] SGHC 235",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 This is a joint trial involving two accused persons, Mr Tan Yew Kuan (“Mr Tan”) and Mr Dineshkumar Sambusivam (“Mr Dineshkumar”). 2 The first accused, Mr Tan, faces a charge of having in his possession not less than 37.95g of diamorphine (“the Drugs”) for the purpose of trafficking on 25 February 2020. This is an offence under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”). 3 The second accused, Mr Dineshkumar, faces a charge for the trafficking of the Drugs to Mr Tan on 25 February 2020, an offence under s 5(1)(a) of the MDA.",
        "The Prosecution’s case": "4 On 25 February 2020, Mr Tan was arrested shortly after he collected the Drugs from Mr Dineshkumar. As against Mr Tan, the Prosecution’s case is that the presumption of possession under s 18(1) of the MDA applies, and Mr Tan was in possession of theentirequantity of the Drugs.  Further, the presumption of knowledge under s 18(2) of the MDA (ie, Mr Tan knew the nature of the drugs) applies. Mr Tan is unable to rebut the presumptions. Further, Mr Tan was in possession of the Drugs for the purpose of trafficking. Notably, in the course of investigations, he admitted in his statements that he intended to deliver the Drugs on the instructions of one “Pal”.1Foot Note 1×Prosecution’s Closing Submissions (“PCS”) at para 13. 5 As regards Mr Dineshkumar, the Prosecution’s case is that Mr Dineshkumar had actual possession of the Drugs before he delivered them to Mr Tan. He was arrested shortly after the delivery. Mr Dineshkumar knew the nature of the Drugs (as he, too, is unable to rebut the presumption of knowledge under s 18(2) of the MDA). By delivering them to Mr Tan, Mr Dineshkumar had trafficked the Drugs.2Foot Note 2×PCS at para 74. 6 I now set out the evidence, which is largely undisputed.",
        "Arrest of the accused persons and seizure of the exhibits": "7 On 25 February 2020, between 5.30pm and 7.45pm, a team of Central Narcotics Bureau (“CNB”) officers arrived at the vicinity of Block 23 Toa Payoh East (“Block 23”) to keep a lookout for Mr Tan.3Foot Note 3×PCS at para 5. 8 At about 10.25pm, Station Inspector Tay Keng Chye (“SI Sunny”) saw a Malaysian-registered car bearing the registration number JGE8363 (“the Car”) stop along Lorong 7 Toa Payoh (“Lorong 7”) near the entrance to the car park of Block 23. The Car was driven by Mr Dineshkumar. Shortly after, SI Sunny saw Mr Tan walking towards the Car and boarding the Car with a black recycle bag (“the Recycle Bag” – later marked as “E1”). 9 When Mr Tan was in the Car, Mr Dineshkumar drove along Lorong 7 and Lorong 6 Toa Payoh (“Lorong 6”).4Foot Note 4×PCS at para 6.While Mr Tan was in the Car, a white tied-up plastic bag (marked “E1A”) and a black tied-up plastic bag (marked “E1B”) were placed into the Recycle Bag.5Foot Note 5×PCS at para 7. 10 At about 10.27pm, Station Inspector Wong Kah Hung Alwin (“SI Alwin”) saw Mr Tan alight from the Car when it stopped at the junction of Lorong 6 and Toa Payoh East. Mr Tan was seen to be carrying the Recycle Bag when he got off from the Car. The Car moved off thereafter.6Foot Note 6×PCS at para 8. 11 Subsequently, the CNB officers moved in to arrest both Mr Tan and Mr Dineshkumar. At about 10.28pm, Mr Tan was arrested at the sheltered walkway beside Block 23. As for Mr Dineshkumar, at about 10.30pm, he was apprehended after the Car was intercepted along Lorong 6 towards Lorong 2 Toa Payoh.7Foot Note 7×PCS at para 9; AB 117, 163. 12 Upon Mr Tan’s arrest, the Recycle Bag was seized by SI Alwin. SI Alwin saw that the Recycle Bag contained, among other things, two tied-up plastic bags, E1A and E1B. SI Alwin then placed the Recycle Bag, along with all its contents, into a tamper-proof bag and duly sealed that bag. Afterwards, Mr Tan was escorted back to his residence at Block 23 (“the Unit”).8Foot Note 8×PCS at para 10. 13 In the Unit, and in the presence of Mr Tan, a search was conducted on, among other things, the Recycle Bag. The two plastic bags, E1A and E1B, were taken out of the Recycle Bag and opened. Two black-taped bundles (marked “E1A1” and “E1A2” respectively) were recovered from E1A, while another two black-taped bundles (marked “E1B1” and “E1B2” respectively) were recovered from E1B. I shall refer to these as “the Four Bundles”. Out of these, E1A1, E1A2 and E1B1 (“the Three Bundles”) contained the Drugs in question, while the remaining bundle, E1B2, contained not less than 163.75g of methamphetamine and some glass utensils.9Foot Note 9×PCS at para 10. 14 Separately, after Mr Dineshkumar was arrested, he was brought to a multi-storey car park located at Block 171A Lorong 1 Toa Payoh (“the Multi-storey Car Park”). At the Multi-storey Car Park, the Car was searched, and an envelope containing $11,200 of cash (“the Cash”) was recovered from the centre compartment of the Car, just behind its handbrake. Mr Dineshkumar had received the Cash from Mr Tan.10Foot Note 10×PCS at para 11.",
        "Analysis of exhibits by the Health Sciences Authority": "15 The Three Bundles containing the Drugs were subsequently sent to the Health Sciences Authority (“HSA”) for analysis. HSA’s analysis revealed that the Drugs contained a total of no less than 37.95g of diamorphine,11Foot Note 11×PCS at para 12.which form the subject matter of this trial. I set out the results below (which are not disputed): S/NDescriptionMarkingHSA CertificateResults of analysis1One packet containing granular/powdery substanceE1A1A1Lab No ID-2032-00388-006(Exh P10)461.3g of substance found to contain not less than 12.99g of diamorphine2One packet containing granular/powdery substanceE1A2A1Lab No ID-2032-00388-007(Exh P11)460.7g of substance found to contain not less than 13.75g of diamorphine3One packet containing granular/powdery substanceE1B1A1Lab No ID-2032-00388-008(Exh P12)460.4g of substance found to contain not less than 11.21g of diamorphine",
        "Statements made during investigations": "16 As part of its case, the Prosecution tendered a number of statements recorded from both Mr Tan and Mr Dineshkumar in the course of investigations, pursuant to s 258(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”). Neither Mr Tan nor Mr Dineshkumar objected to the admissibility of any of these statements, and they were accordingly admitted into evidence. However, Mr Tan and Mr Dineshkumar contested the accuracy of certain aspects of the statements. Statements made by Mr Tan 17 Nine statements recorded from Mr Tan were admitted into evidence as follows: (a) a contemporaneous statement recorded by Inspector Eng Chien Loong Eugene (“Insp Eugene”) under s 22 of the CPC on 25 February 2020 at about 10.45pm in the living room of the Unit;12Foot Note 12×AB 112–113 (Exhibit P35) (b) a contemporaneous statement recorded by Insp Eugene under s 22 of the CPC on 25 February 2020 at about 11.08pm in the living room of the Unit;13Foot Note 13×AB 114 (Exhibit P36). (c) a contemporaneous statement recorded by Staff Sergeant Goh Jun Xian (“SSgt Eric”) under s 22 of the CPC on 26 February 2020 from 12.15am to 1.45am in the living room of the Unit;14Foot Note 14×AB 148–153 (Exhibit P38). (d) the cautioned statement recorded by Assistant Superintendent Fernandez Anthony Leo (“ASP Fernandez”) under s 23 of the CPC on 26 February 2020 from 1.58pm to 2.08pm at Police Cantonment Complex (“PCC”);15Foot Note 15×AB 333–335 (Exhibit P52). (e) a long statement recorded by ASP Fernandez under s 22 of the CPC on 3 March 2020 from 11.21am to 3.02pm at PCC;16Foot Note 16×AB 336–342 (Exhibit P53). (f) a long statement recorded by ASP Fernandez under s 22 of the CPC on 3 March 2020 from 6.00pm to 10.46pm at PCC;17Foot Note 17×AB 343–373 (Exhibit P54). (g) a long statement recorded by ASP Fernandez under s 22 of the CPC on 4 March 2020 from 11.30am to 12.05pm at PCC;18Foot Note 18×AB 374–375 (Exhibit P55). (h) a long statement recorded by ASP Fernandez under s 22 of the CPC on 18 August 2020 from 11.05am to 12.15pm at Changi Prison Complex;19Foot Note 19×AB 376–378 (Exhibit P56). (i) a long statement recorded by ASP Fernandez under s 22 of the CPC on 25 August 2020 from 2.10pm to 4.15pm at Changi Prison Complex;20Foot Note 20×AB 379–393 (Exhibit P57).and (j) a long statement recorded by ASP Fernandez under s 22 of the CPC on 24 November 2020 from 10.09am to 10.16am at Changi Prison Complex.21Foot Note 21×AB 394 (Exhibit P58). 18 Given the importance of the contents of these statements to the case, I shall set out substantial portions of them. In the first contemporaneous statement recorded on 25 February 2020, Mr Tan said that E1A and E1B contained “HeroinandIce” [emphasis added] and that they belonged to one Malaysian man. Mr Tan “wassupposedto drop [E1A and E1B] off as instructed” [emphasis added] by the Malaysian man.22Foot Note 22×AB 112–113.In the third contemporaneous statement, Mr Tan identified the Malaysian man as “Sal Poulez”. Once again, he stated that the Four Bundles, E1A1, E1A2, E1B1 and E1B2, contained “HeroinandIce, but he do [sic] not know which is Heroin, which is Ice” [emphasis added]. The items belonged to Sal Poulez. When asked what he was “supposedto do with the Heroin and Ice” [emphasis added], he said he was to wait for Sal Poulez’s call with instructions “to drop the Heroin and Ice at specified location”. In return for his help, Sal Poulez would “pay [him] SGD$500 for 02 batu heroin, SGD$300 for 01 batu heroin and 125g of Ice for SGD$200”.23Foot Note 23×AB 149.During his ride in the Car, Mr Dineshkumar put E1A and E1B into the Recycle Bag that Mr Tan had brought. Mr Tan also gave Mr Dineshkumar the Cash which he had collected from “previous drops instructed by Sal Poulez”. He had been working for Sal Poulez for a couple of weeks. When asked, “[D]o you know how much you supposed to collect today?” Mr Tan answered, “No. I do not know”.24Foot Note 24×AB 152 (Q/A 26). 19 In the cautioned statement, Mr Tan merely stated, “I did what I did. I am guilty”.25Foot Note 25×AB 335. 20 In the first long statement recorded on 3 March 2020, the following material details are set out: (a) In the afternoon of 25 February 2020, Mr Tan received a phone call from Pal. Pal told Mr Tan that he had a package to deliver to Mr Tan at night. While on the way home from work, there was another call between them. Pal told him there was a slight delay in the delivery. According to Mr Tan, Pal did not inform him of the amount of drugs he would be collecting that night. This was the norm. Normally, Mr Tan would collect the drugs, and he would know the amount of drugs he had collected once he reached home. Mr Tan would then confirm with Pal the amount of drugs he had collected was correct. Up to then, there had been no mistakes or discrepancies in the amount of drugs that Mr Tan had collected with the amount he was supposed to collect. For one “batu” of heroin, Mr Tan would receive $300. For 125g of “ice”, he would receive $200. To Mr Tan, one “batu” amounts to about 450g of heroin.26Foot Note 26×AB 337–338 at para 5. (b) After Mr Tan boarded the Car, he placed the Recycle Bag on the floorboard at his feet area at the front passenger side of the Car.27Foot Note 27×AB 338 at para 7.While the Car was moving, Mr Tan felt that Mr Dineshkumar was reaching for the Recycle Bag. Mr Tan believed that, at that point, Mr Dineshkumar took the sealed envelope containing the Cash from the Recycle Bag,28Foot Note 28×AB 339 at para 8.although he did not physically see Mr Dineshkumar take it.29Foot Note 29×AB 343 at para 17.When the Car stopped at the traffic light junction of Lorong 7 and Lorong 6, Mr Tan saw Mr Dineshkumar “bent down and started throwing some things into the [Recycle Bag]”.30Foot Note 30×AB 339 at para 8. (c) As per his usual practice, Mr Tan did not check the contents of the Recycle Bag while he was inside the Car or after he had alighted from the Car.31Foot Note 31×AB 339–340 at para 9.After Mr Tan alighted from the Car, he felt that the Recycle Bag was heavy. It was more than double the weight he would normally collect. He would normally collect only “01 pound of ‘heroin’ and sometimes 01 or 02 packets of ‘ice’ together.” Despite this, Mr Tan did not check the contents of the Recycle Bag as his “only desire was to quickly get home”. He did not intend to do any “drop offs” that night.32Foot Note 32×AB 340 at para 10. (d) Immediately after Mr Tan was arrested, the Recycle Bag was opened in his presence. Upon seeing its contents, Mr Tan told the CNB officers that “it was ‘heroin’and‘ice’” [emphasis added].33Foot Note 33×AB 340 at para 11.Mr Tan cursed and said, “[B]astard, why so much”. He felt that it was a “dirty deed done to [him] and it was not gentleman of ‘Pal’”. Mr Tan thought that Pal should at least have given him the option to “choose whether [he] had wanted to do the collection of this amount of drugs”.34Foot Note 34×AB 340 at para 11.He was then escorted up to the Unit. (e) At the Unit, Mr Tan’s handphone kept ringing, and the CNB officers asked Mr Tan whether he would cooperate with the CNB and answer the phone. Mr Tan agreed. However, as he was feeling very agitated and angry with Pal at that point in time, Mr Tan told the officers that he would “fuck” Pal first before saying what the CNB officers had wanted him to say. However, the officers did not let Mr Tan answer the phone when it rang. When the officers tried calling Pal afterwards, the calls went through, but Pal did not answer.35Foot Note 35×AB 340 at para 12. 21 In the second long statement, also recorded on 3 March 2020, Mr Tan said the following: (a) Although the Recycle Bag felt heavier than usual, Mr Tan did not intend to check it in public. He wanted to check it only at home. Even if he had checked the Recycle Bag after leaving the Car, “the contents were already in [his] hands and so [he] cannot drop it or do anything to it”.36Foot Note 36×AB 343 at para 18. (b) Mr Tan told the CNB officers that the Recycle Bag contained heroinandice, as he assumed it to be so. Mr Tan held this assumption because he had previously collected drugs from Pal about six to seven times. On those occasions, he would receive “either ‘heroin’and‘ice’ or a mixture of both”. Mr Tan knew there must have been ice in the Recycle Bag because Pal told him after lunch on 25 February 2020 that he had packed instruments for Mr Tan to smoke ice together with some ice for that night’s collection. He had told Pal that he needed a new “popeye”,ie,an instrument for consuming “ice”, and had asked Pal for a new one. This is how he knew there would be “ice” in the Recycle Bag. Mr Tan had assumed that heroin would also be involved based on his previous experiences.37Foot Note 37×AB 343–344 at para 19. (c) Normally, Mr Tan would collect only “01 pound of ‘heroin’ or 125 grams of ‘ice’, or a mixture of both”.38Foot Note 38×AB 344 at para 20.From the fourth collection onwards, there were occasions where he would collect a combination of “01 batu of heroin and 125 grams of ‘ice’”.39Foot Note 39×AB 346 at para 26. (d) As regards the receipt of extra drugs on the night when he was arrested, Mr Tan said that he would have told Pal off. If Pal had tried to brush Mr Tan off, Mr Tan would have warned Pal not to “put this amount of drugs without letting [him] know next time”. However, Mr Tan would “still have continued to drop off the drugs from this collection on ‘Pal’s’ instructions”. That said, whether Mr Tan “would continue to do this [was] not confirmed as [he] felt unhappy that ‘Pal’ had passed [him] drugs more than the usual amount collected without informing [him] beforehand”.40Foot Note 40×AB 344 at para 20. (e) Mr Tan clarified the answers in his contemporaneous statement (at [18] above). First, the sums of “SGD$500 for 02 batu heroin, SGD$300 for 01 batu heroin and 125g of Ice for SGD$200” had been agreed between Sal Poulez and Mr Tan since Mr Tan started helping Sal Poulez. Second, Mr Tan had never taken two “batu” of heroin from Sal Poulez. Third, “Pal” refers to “Sal Poulez”.41Foot Note 41×AB 345 at para 24. (f) Initially, Mr Tan started collecting and delivering drugs for Pal to feed his own addiction. Subsequently, Mr Tan realised that, by delivering drugs for Pal, he could afford to smoke heroin and “ice” without tapping into his family’s expenses. That is why Mr Tan continued to collect and deliver drugs for Pal. Mr Tan said that he never repacked Pal’s drugs; he had merely removed the black tapes and wrapped the drugs in newspaper before delivering them.42Foot Note 42×AB 347 at para 30. 22 In his third long statement recorded on 4 March 2020, Mr Tan confirmed that he had read back the first and second long statements recorded a day earlier and that he did not wish to make any amendments to them.43Foot Note 43×AB 374 at para 48.Mr Tan then went on to say that he did not touch the Four Bundles (marked “E1A1”, “E1A2”, “E1B1” and “E1B2”) that were found in the Recycle Bag at all. He had brought the Recycle Bag into the Car, and it was Mr Dineshkumar who placed the Four Bundles into the Recycle Bag.44Foot Note 44×AB 374 at para 50. 23 Finally, Mr Tan reiterated the following in the fourth long statement, recorded some months later on 18 August 2020: (a) The Drugs were placed into the Recycle Bag by Mr Dineshkumar. While doing so, Mr Dineshkumar did not say anything. Moreover, at no point in time did Mr Tan handle the Drugs. The only conversation Mr Tan had with Mr Dineshkumar was when he asked Mr Dineshkumar where Mr Dineshkumar was heading, to which the latter replied that he was going back to the causeway.45Foot Note 45×AB 376 at para 57. (b) Mr Tan also explained that when he said he would “still have continued to drop off the [D]rugs from this collection despite the larger amount on ‘Pal’s’ instructions” (at [21(d)] above), this was hypothetical. Mr Tan thought that since the Drugs were already in his hands, there was nothing else he could have done with them. However, while it was probable for Mr Tan to have continued to drop the Drugs off for Pal, Mr Tan was not certain if he would have continued to help Pal as he was really upset at Pal at that point in time for giving him more drugs than what he would typically receive without informing him beforehand.46Foot Note 46×AB 377 at para 58. Statements made by Mr Dineshkumar 24 Eight statements recorded from Mr Dineshkumar were admitted into evidence. These were: (a) a contemporaneous statement recorded by Sergeant Mohammad Nasrulhaq bin Mohd Zainuddin (“Sgt Nasrulhaq”) under s 22 of the CPC from 11.36pm on 25 February 2020 to 1.04am on 26 February 2020 at the Multi-storey Car Park;47Foot Note 47×AB 189–193 (Exhibit P41); Translated version at AB 251–253 (Exhibit P47). (b) a contemporaneous statement recorded by Sgt Nasrulhaq under s 22 of the CPC on 26 February 2020 from 1.05am to 1.08am at the Multi-storey Car Park;48Foot Note 48×AB 194 (Exhibit P42); Translated version at AB 251–253 (Exhibit P47). (c) a cautioned statement recorded by Station Inspector Lee Swee Leng (“SI Lee”) under s 23 of the CPC on 26 February 2020 from 2.00pm to 2.10pm at PCC;49Foot Note 49×AB 268–270 (Exhibit P49). (d) a long statement recorded by SI Lee under s 22 of the CPC on 3 March 2020 from 9.24am to 12.16pm at Central Police Division;50Foot Note 50×AB 271–275 (Exhibit P50). (e) a long statement recorded by SI Lee under s 22 of the CPC on 3 March 2020 from 2.24pm to 6.25pm at Central Police Division;51Foot Note 51×AB 276–301 (Exhibit P51). (f) a long statement recorded by ASP Fernandez under s 22 of the CPC on 4 March 2020 from 7.10pm to 10.00pm at PCC;52Foot Note 52×AB 395–399 (Exhibit P59). (g) a long statement recorded by ASP Fernandez under s 22 of the CPC on 18 August 2020 from 2.10pm to 4.21pm at Changi Prison Complex;53Foot Note 53×AB 400–411 (Exhibit P60).and (h) a long statement recorded by ASP Fernandez under s 22 of the CPC on 23 October 2020 from 2.48pm to 4.10pm at Changi Prison Complex.54Foot Note 54×AB 412–414 (Exhibit P61). 25 While Sgt Nasrulhaq recorded the contemporaneous statements in the Malay language by conversing with Mr Dineshkumar in Malay, SI Lee and ASP Fernandez recorded the other statements in the English language. To do so, they were assisted by a Tamil interpreter, Mdm Vijaya Thavamary Abraham (“Mdm Vijaya”). Mdm Vijaya interpreted what the recording officers said in English to Mr Dineshkumar in Tamil and then interpreted what Mr Dineshkumar said in Tamil to the recording officers in English. 26 Before I set out the contents of these statements, I should state that it is in his third long statement recorded by ASP Fernandez on 4 March 2020 that Mr Dineshkumar admitted that he was delivering drugs at the material time (and that he knew that the Four Bundles contained drugs). He did so as he hoped to receive a lighter sentence for telling the truth.55Foot Note 55×AB 399 at paras 67–68.Prior to that, essentially, Mr Dineshkumar denied any involvement with the Drugs. 27 With that in mind, I go to the first contemporaneous statement. In it, Mr Dineshkumar said that Mr Tan had passed the envelope containing the Cash to him. His friend, one “Kelvin”, had told him to collect the money from Mr Tan and bring it back to Kelvin in Malaysia. After entering the Car, Mr Tan told him to drive. After that, Mr Tan took out the envelope containing the Cash and handed it to Mr Dineshkumar. Mr Dineshkumar denied giving anything to Mr Tan; nor had Kelvin paid him to take money from Mr Tan.56Foot Note 56×AB 251–252.Mr Dineshkumar’s account in the cautioned statement dated 26 February 2020 is similar to the account set out above. 28 The first long statement made by Mr Dineshkumar on 3 March 2020 contains,inter alia, the following: (a) On the evening of 25 February 2020, Mr Dineshkumar received a phone call from Kelvin, who asked Mr Dineshkumar to go to Singapore to collect some money for him. Although Kelvin was his friend, Mr Dineshkumar did not know Kelvin’s real name. He was an Indian who was about 25 years old. Mr Dineshkumar got to know Kelvin from a mutual friend. By 25 February 2020, Mr Dineshkumar had known Kelvin for about three months.57Foot Note 57×AB 271–272 at paras 6–7. (b) When Kelvin asked Mr Dineshkumar to help him collect money in Singapore, Kelvin told Mr Dineshkumar that his passport was about to expire. However, Kelvin did not tell Mr Dineshkumar how much money he was supposed to collect or what the money was meant for. Mr Dineshkumar thought that the money would amount to S$1,000 to S$2,000. Mr Dineshkumar agreed to help Kelvin collect the money because he wanted to return a favour to Kelvin, as the latter had been sending Mr Dineshkumar to various locations for job interviews.58Foot Note 58×AB 272–273 at para 11. (c) After Mr Dineshkumar agreed to assist Kelvin, Kelvin arrived at Mr Dineshkumar’s residence with his car (ie, the Car), and left immediately.59Foot Note 59×AB 273 at paras 12 and 14.Thereafter, Mr Dineshkumar left his residence for Singapore at around 6.05pm. Upon his arrival at the Tuas Checkpoint, Mr Dineshkumar was stopped by immigration officers as they wanted to inspect the Car. The inspection took about an hour. According to Mr Dineshkumar, the entire car was checked, “starting from the bonnet to the boot”. Nothing was recovered by the immigration officers from the Car.60Foot Note 60×AB 273 at paras 14–15. (d) Kelvin provided Mr Dineshkumar with three locations consecutively. When Mr Dineshkumar checked with Kelvin, Kelvin told him to proceed to the last location to collect the money. At that location, Mr Tan boarded the Car and asked Mr Dineshkumar to “drive one round”. While Mr Dineshkumar was driving, he saw Mr Tan taking the white envelope out of the Recycle Bag and placing it beside the handbrake. Thereafter, Mr Tan alighted at a traffic junction where the Car had stopped. Mr Dineshkumar further added that: (i) he did not pass anything to Mr Tan; (ii) Mr Dineshkumar only received the white envelope from Mr Tan and did not open it; and (iii) Mr Tan did not take anything from the Car.61Foot Note 61×AB 274 at paras 16–20. (e) This was the second occasion that he helped Kelvin to collect monies in Singapore. The first was just a day before, on 24 February 2020.62Foot Note 62×AB 274–275 at paras 22–25; and AB 277 at para 35. 29 Mr Dineshkumar gave the second long statement about two hours after his first long statement was recorded. Similar to the contents of earlier statements, the gist of this statement is as follows: (a) On the two occasions (ie, on 24 February 2020 and 25 February 2020) that Kelvin handed the Car over to Mr Dineshkumar, Mr Dineshkumar did not check the Car. At all material times, no one else apart from Mr Dineshkumar had access to the Car.63Foot Note 63×AB 276 at para 27. (b) On 25 February 2020, when Mr Dineshkumar put the envelope containing the Cash into the armrest compartment of the Car, he felt that it was heavier than the envelope that he had handled the day before.64Foot Note 64×AB 278 at para 46. (c) When shown a photograph depicting the Recycle Bag and the plastic bags E1A and E1B, Mr Dineshkumar identified the Recycle Bag as the one carried by Mr Tan. However, Mr Dineshkumar had never seen nor touched E1A and E1B prior and did not know who they belonged to.65Foot Note 65×AB 281 and 293 (Photograph 15).Mr Dineshkumar also disavowed any knowledge of, or connection with, E1A1, E1A2, E1B1 and E1B2.66Foot Note 66×AB 281 and 294–296 (Photographs 16, 17, 19 and 20). 30 In the third long statement recorded from Mr Dineshkumar on 4 March 2020, he admitted for the first time to delivering drugs for Kelvin and stated the following: (a) When Mr Dineshkumar first entered Singapore to deliver drugs for Kelvin on 24 February 2020, Kelvin had not told him the type or amount of drugs involved. Neither had Mr Dineshkumar asked Kelvin about these because Mr Dineshkumar knew he had to do the job for money, as he had just lost his job at Permal Logistic and was about RM20,000 in debt.67Foot Note 67×AB 395 at para 57. (b) On 24 February 2020, when Mr Dineshkumar took over the Car from Kelvin, he did not know where the drugs were located in the Car. It was only after Mr Dineshkumar entered Singapore that he called Kelvin and was told by the latter that the drugs were kept in the Car’s boot. The 24 February 2020 delivery involved one bundle of drugs. Once Mr Dineshkumar reached the location provided by Kelvin and stopped his car, an Indian man boarded the Car. The Indian man passed Mr Dineshkumar S$2000 in cash (which Mr Dineshkumar did not expect to collect), and Mr Dineshkumar handed him the bundle of drugs. Upon Mr Dineshkumar’s return to Malaysia, Kelvin paid him RM5,000 for the delivery.68Foot Note 68×AB 395–396 at paras 58–59. (c) The next day, on 25 February 2020, Kelvin called Mr Dineshkumar in the evening to inform him of another delivery task. Mr Dineshkumar took over the Car without inspecting it. Mr Dineshkumar did not bother to check the car boot as he felt that it was a good place to hide drugs. If Kelvin had really hidden the drugs again in the car boot, Mr Dineshkumar was confident that he could “clear [the] checkpoint without the drugs being detected”.69Foot Note 69×AB 396 at para 60. (d) After clearing the checkpoint, Mr Dineshkumar proceeded to “Jurong Hospital”. While waiting there, Kelvin sent him the address of a location to go to (subsequently established and undisputed at trial to be at Jalan Besar). Mr Dineshkumar realised it would take 30 minutes to get there. Having been subjected to heavy checks at the Tuas checkpoint, he was scared. Reluctant to proceed, he expressed his concerns to Kelvin. Then, Kelvin sent another address which was a location about 15 minutes away (later established and undisputed at trial to be at Fishery Port Road). However, when Mr Dineshkumar reached the location, Kelvin told him that the recipient had already left. As such, Kelvin sent him the address of another location which was about 20 minutes away (established and undisputed at trial to be at Lorong 7 near the entrance to the car park of Block 23). Before leaving Fishery Port Road, Mr Dineshkumar located a black plastic bag containing one bundle of drugs wrapped in black tape in the Car’s boot. He also found three more bundles of drugs hidden in the boot.70Foot Note 70×AB 397 at para 61. (e) Mr Dineshkumar decided to place all the drugs on the right rear passenger seat. From within the Car, he then took one of the three bundles and put it inside the black plastic bag (that was already containing a bundle of drugs). Mr Dineshkumar then put the remaining two bundles into a white-coloured plastic bag which was in the Car. Accordingly, the black and white plastic bags each contained two bundles of drugs. Mr Dineshkumar then placed both plastic bags under the driver’s seat.71Foot Note 71×AB 397–398 at para 62. (f) After proceeding to the last location (ie, Lorong 7), Mr Dineshkumar waited by the side of the road and called Kelvin to inform him that he had arrived. Kelvin informed Mr Dineshkumar to pass the drugs to the recipient and to collect money from him as well. Then, Mr Tan boarded the Car. While Mr Dineshkumar was driving the Car, Mr Dineshkumar “used one hand to take the black and white plastic bag under [his] seat, each containing 02 bundles wrapped in black tape and passed it to [Mr Tan]”. Mr Dineshkumar “passed him one plastic bag after the other”. Mr Tan “took the black and white plastic bag each containing 02 bundles wrapped in black tape and put them inside his black bag …”. Mr Tan then alighted from the Car at a traffic junction with his black bag.72Foot Note 72×AB 398 at para 63. (g) Mr Dineshkumar did not touch the Recycle Bag but had touched the two plastic bags, E1A and E1B, as these were “where the 04 bundles … were kept in”.73Foot Note 73×AB 398 at para 66.Mr Dineshkumar identified E1A1, E1A2, E1B1 and E1B2 as the Four Bundles of drugs which he had passed to Mr Tan on 25 February 2020. Mr Dineshkumar knew that the bundles were drugs as “Kelvin had told [him] that the bundles contained drugs”.74Foot Note 74×AB 399 at para 67. (h) Mr Dineshkumar said that he did not tell the truth in his earlier statements as he was afraid of the fact that he was facing a death sentence. Mr Dineshkumar hoped that by being honest, he would receive a lighter sentence. Mr Dineshkumar wished to cooperate with the CNB but did not have any other information to give.75Foot Note 75×AB 399 at para 68. 31 Finally, the fourth and fifth long statements recorded on 18 August 2020 and 23 October 2020, respectively, provide,inter alia, the following: (a) Kelvin told Mr Dineshkumar that the Four Bundles of drugs (ie, E1A1, E1A2, E1B1 and E1B2) contained “ice”. Mr Dineshkumar initially told CNB that he did not know what drugs were in the bundles because he had just been arrested and could not think properly. Mr Dineshkumar did not know the quantity of “ice” in the bundles.76Foot Note 76×AB 402 at para 76. (b)  Mr Dineshkumar’s prior delivery on 24 February 2020 involved just one bundle of drugs wrapped in white tape. As the Four Bundles of drugs on 25 February 2020 were instead wrapped in black tape, Mr Dineshkumar asked Kelvin what the bundles contained, and Kelvin told him they contained “ice”.77Foot Note 77×AB 412 at paras 81–82.",
        "Close of the Prosecution’s case": "32 At the close of the Prosecution’s case, I found that there was sufficient evidence against each of the accused persons to call for their defence. Mr Tan and Mr Dineshkumar each gave evidence. They did not call any witnesses.",
        "Mr Tan’s defence": "33 Mr Tan, a 65-year-old Singaporean, has a Bachelor of Arts degree from an Australian university. At the material time, he was working as a technical support officer, earning $1,600 per month. He lived with his wife in the Unit. Mr Tan began abusing drugs in his teens. Since then, he has not been able to overcome his drug addiction.78Foot Note 78×Closing Submissions of Mr Tan Yew Kuan (“Tan CS”) at paras 4–5.Apart from drug addiction, he had also been previously diagnosed with depression and anxiety.79Foot Note 79×NE, 22 March 2023, p 41 ln 16 to ln 19. 34 Given the rather nuanced defence Mr Tan raises, I shall now set out his evidence concerning drug deliveries in some detail. According to Mr Tan, a Malaysian called “Boy Tanjong” used to supply him with drugs for his consumption. Then, Boy Tanjong gave Mr Tan’s contact to another Malaysian, one “Segar”.80Foot Note 80×NE, 22 March 2023, p 45 ln 5 to ln 7; ln 19 to ln 23, p 46 ln 20 to ln 21.Around end-December 2019, he began delivering drugs for Segar to support his drug consumption.81Foot Note 81×NE, 22 March 2023, p 46 ln 17 to ln 18, p 47 ln 21 to 23, p 51 ln 24 to ln 25.Segar told Mr Tan that at times, he would want Mr Tan to collect heroin, and at other times, he would want Mr Tan to collect “ice”. He told Mr Tan that he would “give [Mr Tan] $300 for each pound of heroin [he] collected. And then [$]200 for each 125 gram of Ice that [he] collected.” Mr Tan said, “Okay, … but [he] wouldn’t want to be taking anything more than that.”82Foot Note 82×NE, 22 March 2023, p 47 ln 27 to ln 32.This was because as a drug addict, he knew the “threshold for … capital offence”.83Foot Note 83×NE, 22 March 2023, p 48 ln 3 to ln 5. 35 The arrangement was that Segar would call him the night before to inform him of an intended delivery of drugs which would be left at one of two agreed drop-off points – either at the recycling bin or the ATM machine near Block 23. Mr Tan would collect the drugs, bring them home, clean the packaging, take off the black duct tape, and re-wrap them in some newspaper. Then, he would wait for Segar’s call again, which he would usually receive on the same day. Thereafter, Mr Tan would be instructed to drop the drugs off at one of two specified locations – again either at the recycling bin or the ATM machine near Block 23.84Foot Note 84×NE, 22 March 2023, p 48 ln 7 to p 49 ln 31.Later, Mr Tan started collecting cash left by those who picked up the drugs, with the cash to be passed to Segar thereafter.85Foot Note 85×NE, 22 March 2023, p 51 ln 31 to ln 32. 36 However, on one occasion around 9 January 2020, Mr Tan discovered that Segar delivered more than one pound of heroin to him.86Foot Note 86×NE, 22 March 2023, p 53 ln 5 to ln 15.Unlike the previous occasions where he would pick up and drop off without meeting anyone directly, he met an Indian couple for this pick up.87Foot Note 87×NE, 22 March 2023, p 52 ln 7 to ln 8.When Mr Tan called Segar to confront the latter about the large amount of drugs, saying that “[they] never agreed that [he] would … take more than one---one pound. This was [their] prior agreement”, Segar repeatedly dismissed Mr Tan’s concerns and told Mr Tan that he would be remunerated accordingly. As such, Mr Tan was “quite fed up” with Segar and said that “the Ice and heroin and all, [he would] reject it.”  He also said that he did not “want to have anything to do with this one and they should come pick it up”.88Foot Note 88×NE, 22 March 2023, p 54 ln 12 to ln 30. 37 During a subsequent call, when Mr Tan argued with Segar regarding the amount of heroin to be delivered, Segar told Mr Tan that he would call Mr Tan back. It was Pal, another Malaysian, who returned the call and told Mr Tan that Mr Tan would deal with Pal from then on and “won’t be dealing with Segar anymore”.89Foot Note 89×NE, 22 March 2023, p 54 ln 6 to p 55 ln 10.Pal made contact with Mr Tan through the same Malaysian number used by Segar, which Mr Tan saved on his handphone under the contact “Sal Poulez”.90Foot Note 90×NE, 22 March 2023, p 55 ln 29 to p 56 ln 2.Pal arranged to “take it back”, and assured him that he would personally deal with Mr Tan, and that “he will make sure that [Mr Tan] don’t get anything more than one and one”.91Foot Note 91×NE, 22 March 2023, p 55 ln 7 to ln 17.After Pal arranged to “take the thing back”, Mr Tan dealt with him for five to seven times before his arrest.92Foot Note 92×NE, 22 March 2023, p 56 ln 4 to ln 6.The same arrangement reached with Segar carried on in relation to the pick-up and drop-off of the drugs, as well as the collection and delivery of cash.93Foot Note 93×NE, 22 March 2023, p 56 ln 21 to ln 22.These collections and deliveries usually took place in the morning.94Foot Note 94×NE, 22 March 2023, p 48 ln 32 to p 49 ln 1. 38 On 23 February 2020, Pal said that he wanted cash that Mr Tan had collected previously. Mr Tan told him that he needed some “ice” for consumption, as well as three “popeyes” for consuming “ice”. Pal was meant to arrange for a drop-off and pick-up on 24 February 2020.95Foot Note 95×NE, 22 March 2023, p 58 ln 25 to p 59 ln 2; p 61 ln 4 to ln 10.Mr Tan testified that he did not need to pay for the small sachet of “ice” (about three to five grams) for his consumption.96Foot Note 96×NE, 22 March 2023, p 61 ln 15 to ln 18.After Pal failed to make the arrangements for 24 February 2020, there was a series of calls between them on 25 February 2020, beginning from 11.38am, to arrange for a drop-off and pick-up on the night of 25 February 2020.97Foot Note 97×NE, 22 March 2023, p 59 ln 17 to ln 21.In particular, between 7.19pm and 10.17pm, there were nine calls of varying durations between the parties.98Foot Note 98×Exhibit P44A, Annex G, Sal Poulez Call Logs, Items 9 to 17.Mr Tan explained that he had to work late that night, and kept Pal updated as to what time he could be expected to be back home, and when he would be available for the transaction. In the meantime, Pal told him that the “conveyor” had also been delayed.99Foot Note 99×NE, 22 March 2023, p 61 ln 19 to p 62 ln 18. 39 When Mr Tan entered the Car, Mr Dineshkumar was talking on his handphone and rummaging under his seat. Mr Tan put the Recycle Bag on the floorboard of the front passenger seat.100Foot Note 100×NE, 22 March 2023, p 65 ln 23 to ln 25.Mr Tan does not remember if he told Mr Dineshkumar the Cash was in the Recycle Bag and Mr Dineshkumar took it out or if he handed the Cash to Mr Dineshkumar.101Foot Note 101×NE, 22 March 2023, p 66 ln 3 to ln 5.The car ride from Lorong 7 back to Lorong 6 lasted about one minute. When Mr Tan carried the Recycle Bag to get out of the Car, he felt that it was quite heavy.102Foot Note 102×NE, 22 March 2023, p 66 ln 26 to ln 29.Mr Tan was vaguely aware of hearing a “thudding sound” on the floorboard while he was in the Car although he did not exactly see Mr Dineshkumar putting anything into the Recycle Bag.103Foot Note 103×NE, 22 March 2023, p 78 ln 18 to ln 24. 40 After Mr Tan’s arrest, he was brought back to the Unit. When Mr Tan saw that there were four black bundles in the Recycle Bag, he knew he had been played out by Pal.104Foot Note 104×NE, 22 March 2023, p 68 ln 20 to ln 22.When Insp Eugene was recording his first contemporaneous statement, there was a call from Pal. Insp Eugene asked if Mr Tan wanted to answer the call, and Mr Tan said he wanted to and that he was going to “fuck him … [he] was going to scold [Pal] actually.” He said, “[B]astard, you know, why so much drugs, you know, why all the drugs.” Mr Tan said this was because he “never agreed to take more than one pound of heroin at the time or 125 gram of Ice or a combination of both [he] agreed to that.” He did not want to “take more than a pound of heroin and more than that amount of Ice because [he] thought that would be the gallows for [him]”.105Foot Note 105×NE, 22 March 2023, p 69 ln 7 to ln 29. 41 To sum up, in relation to the night of 25 February 2020, Mr Tan’s defence is that he did not know about the Drugs, much less their nature, until after he was arrested by the CNB.106Foot Note 106×Tan CS at para 17.Mr Tan was expecting to deliver money to Pal’s “conveyor” (who turned out to be Mr Dineshkumar). He was not expecting to collect the Drugs at all. Instead, as arranged with Pal, he was to collect some “ice” and three “popeyes” for himself.107Foot Note 107×Tan CS paras 7 and 17.I shall refer to this as “the Nature of Transaction Defence”. Connected to the above, since Mr Tan did not know that he was to receive the Drugs that night, he could not have formed an intention as to what he would do with the Drugs. For this reason, Mr Tan was not in possession of the Drugs for the purposes of trafficking.108Foot Note 108×Tan CS paras 17 and 19. 42 Further, as argued by his counsel, Mr Andre Jumabhoy (“Mr Jumabhoy”), Mr Tan is “well-versed in the drug laws to know that a certain amount would carry a death sentence and therefore agreed with the supplier that he would only collect one pound of heroin (around 450g) and/or 125g of ice”. There was never any agreement for him to traffic more than one pound of heroin (“the Alleged Agreement”).109Foot Note 109×Tan CS at paras 17, 18, 19 and 79.Intertwined with all the above is the contention that on that night, Mr Tan was not the intended recipient of the Drugs. The Drugs were meant to be delivered to persons other than Mr Tan.110Foot Note 110×Tan CS paras 21–31.Such surrounding circumstances bolster Mr Tan’s claim that he had no knowledge of the nature of the Drugs and fortify his denial of an intention to traffic the Drugs. 43 To explain the contents of the statements made during investigations, including certain admissions, Mr Tan claims,inter alia,that he was depressed, despondent and suicidal, and his intention was to end it all. There are also other allegations concerning the accuracy of some aspects of the statements (which I shall set out in due course).",
        "Mr Dineshkumar’s defence": "44 Turning to Mr Dineshkumar, he is a 31-year-old Malaysian living in Johor Bahru. At the material time, he was unemployed. Before that, he worked as a lorry driver, transferring goods for his company between Malaysia and Singapore. Mr Dineshkumar was a drug addict, and Kelvin used to sell him “ice” for his consumption. Another drug supplier introduced Kelvin to him. Prior to his arrest, he had known Kelvin for about three months.111Foot Note 111×NE, 27 March 2023, p 11 ln 1 to p 13 ln 3. 45 Mr Dineshkumar’s fairly straightforward defence is that he did not have any knowledge that he was delivering diamorphine at the material time. Instead, Mr Dineshkumar was under the impression that he was only delivering “ice”. Mr Dineshkumar was made to believe that he would be (and was) carrying only “ice” by the words and assurances of Kelvin,112Foot Note 112×Closing Submissions of Mr Dineshkumar Sambusivam (“DK CS”) at paras 12–14.who directed Mr Dineshkumar to bring drugs into Singapore. Separately, Mr Dineshkumar also agreed to collect cash for Kelvin. 46 Turning to the statements made during investigations, Mr Dineshkumar seeks to undermine the accuracy of those recorded with the assistance of Mdm Vijaya by alleging that Mdm Vijaya fell short in carrying out her role as interpreter.113Foot Note 113×DK CS at paras 55–60.",
        "The law": "47 I now turn to the law. The relevant provisions within the MDA read: Trafficking in controlled drugs 5.—(1)  Except as authorised by this Act, it shall be an offence for a person, on his own behalf or on behalf of any other person, whether or not that other person is in Singapore — (a) to traffic in a controlled drug; … (2)  For the purposes of this Act, a person commits the offence of trafficking in a controlled drug if he has in his possession that drug for the purpose of trafficking. By s 2 of the MDA, “traffic” is defined to include “give”, “transport”, “send” and “deliver”. 48 In respect of a charge of trafficking under s 5(1) read with s 5(2) of the MDA (as faced by Mr Tan), the elements to be established are: (a) possession of the drugs; (b) knowledge of the nature of the drugs; and (c) proof that possession of the drugs was for the purpose of trafficking which was not authorised (MuhammadRidzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59]). For a charge of trafficking under s 5(1) of the MDA (as faced by Mr Dineshkumar), the elements which need to be established are: (a) the act of trafficking in the controlled drug which was not authorised; and (b) knowledge of the nature of the drugs. 49 In relation to possession and knowledge, s 18 of the MDA contains these rebuttable presumptions: Presumption of possession and knowledge of controlled drugs 18.—(1) Any person who is proved to have had in his possession or custody or under his control — (a) anything containing a controlled drug; … shall, until the contrary is proved, be presumed to have had that drug in his possession. (2) Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. 50 When dealing with the element of possession, the Prosecution may rely on the presumption in s 18(1) of the MDA or seek to prove that the accused person had actual knowledge that the thing which turns out to be a controlled drug was within his possession, custody or control. If the Prosecution relies on the s 18(1) presumption, the accused person may rebut this presumption by either establishing, on a balance of probabilities, that (i) he was never in possession of or never had custody of or control over the container, keys or document referred to in s 18(1), or (ii) that he was never aware that the thing which was later found to be a drug was in his custody:AdiliChibuike Ejike v Public Prosecutor[2019] 2 SLR 254 (“Adili”) at [40]. 51 As regards s 18(2) of the MDA, the presumption will be rebutted where an accused person establishes, on a balance of probabilities, that he did not know the nature of the drugs in his possession. This would be the case where the accused person was able to prove that he believed he was carrying something innocuous (even if he is unable to specify exactly what that was) or where the accused person was able to prove that he believed he was carrying some other illegal item or drug other than the specific drug in his possession:Gobi a/lAvedian v Public Prosecutor(“Gobi”) [2021] 1 SLR 180 at [57] and [59]. That said, an accused person who was merely indifferent to or ignorant of what he was carrying would not be able to rebut the presumption in s 18(2):Gobiat [64].",
        "Decision: Mr Tan": "52 I turn to consider the case against Mr Tan.",
        "Knowing possession": "53 As set out above at [48], the first element to be established is the possession of the Drugs. However, for the purposes of the MDA, possession has been interpreted to mean not just the fact of physical possession or custody but also to incorporate an element of knowledge. As regards the sort of knowledge required, all that is needed is that the accused person must know of the existence, within his possession, control or custody, of the thing which is later found to be a controlled drug. To be clear, it is not necessary that the accused person also knows that the thing was, in fact, a prohibited drug, much less its specific nature:Adiliat [31]. Whether the Prosecution ran a different case at trial 54 Mr Tan does not dispute that he was in physical possession of the Recycle Bag, which contained,inter alia, the Drugs when he alighted from the Car. Accordingly, the Prosecution invokes s 18(1)(a) of the MDA for the presumption that Mr Tan had the Drugs in his knowing possession. However, in his closing submissions, Mr Jumabhoy argues that a line of questioning taken by the Prosecution in the cross-examination of Mr Tan shows that the Prosecution’s case against Mr Tan is one of wilful blindness. Accordingly, it is impermissible for the Prosecution to rely on s 18(1) of the MDA to presume that Mr Tan was wilfully blind to the presence of the Drugs in his possession. In fact, Mr Jumabhoy proceeded on the basis that the Prosecution was running its case based on wilful blindness and focused on how the Prosecution had failed to establish the elements of wilful blindness.114Foot Note 114×Tan CS at paras 44–49. 55 In my view, the questions posed to Mr Tan during cross-examination by the Prosecution must be considered in totality and in their context. This requires an examination of the Prosecution’s opening statement, its cross-examination of Mr Tan, and closing submissions. So viewed, it is clear to me that the Prosecution’s case against Mr Tan is not one of wilful blindness, despite that particular line of questioning by the Prosecution, as relied on by Mr Jumabhoy.115Foot Note 115×NE, 24 March 2023, p 36 ln 15 to p 37 ln 17.Nowhere in the Prosecution’s opening statement and closing submissions did it refer to the doctrine of wilful blindness. In fact, the opening statement clearly states:116Foot Note 116×Prosecution’s Opening Statement at para 21(a). The Prosecution will rely on the presumptions under ss 18(1)(a) and (2) of the MDA. The Prosecution will show that Tan is unable to rebut, on a balance of probabilities, the presumptions under s 18(1)(a) and (2) of the MDA that he was in possession of the Drugs (at the stated quantity) and that he knew that the Drugs contained diamorphine, in view of, among other things, his admission that he had collected several bundles, including the Three Bundles, from Dineshkumar and that the bundles contained ‘heroin’ and ‘ice’. 56 As such, when Mr Tan gave his evidence-in-chief, he was well aware of the Prosecution’s case against him, which relies on the ss 18(1)(a) and (2) presumptions of the MDA. On that premise, he provided his defence to address the allegations against him, setting out his account of the facts and circumstances of the relevant events. Moreover, it is clear that, when read in context, the Prosecution’s questions (as shown in the notes of evidence extracted by Mr Jumabhoy)117Foot Note 117×Tan CS at para 43.were targeted at showing that Mr Tan was indifferent to the nature of the drugs he was collecting from Pal through Mr Dineshkumar. To elaborate, these questions concerned whether Mr Tan took any steps to open the plastic bags so as to “verify” their contents. In my view, this line of questioning was primarily aimed at demonstrating that Mr Tan is unable to rebut the presumption of knowledge under s 18(2) of the MDA. For the avoidance of doubt, the element of knowledge is distinct from that of knowing possession. This coheres with established law that an accused person who was merely indifferent to or ignorant of what he was carrying would not be able to rebut the presumption in s 18(2):Gobiat [64]. 57 In any event, the Prosecution is only precluded from invoking the presumption under s 18(1) of the MDA if its case proceedssolelyon the basis that the accused person had been wilfully blind:Adiliat [100]. This is certainly not the case here. Insofar as Mr Jumabhoy has chosen to focus on the issue of wilful blindness in the closing submissions, Mr Tan is in no way prejudiced. The closing submissions deal fully with the evidence at the trial and thesubstanceof Mr Tan’s defence (as outlined above from [33] onwards). Further, Mr Tan filed reply closing submissions and had the opportunity to respond to the Prosecution’s closing submissions which clearly also relied on the presumption under s 18(1) of the MDA. Whether Mr Tan has rebutted the presumption 58 Returning to the s 18(1)(a) presumption, as mentioned (at [54] above), Mr Tan accepts that, when he alighted from the Car, he was in physical possession of the plastic bags, E1A and E1B, which contained the Drugs.118Foot Note 118×NE, 23 March 2023, p 88 ln 1 to ln 5.The issue for my determination is whether Mr Tan has successfully rebutted the presumption under s 18(1)(a) of the MDA by proving, on a balance of probabilities, that he was never aware that the Drugs were in his custody. 59 In my judgment, Mr Tan has failed to establish that he was not aware that the Drugs were in his custody. During cross-examination, Mr Tan admitted that he knew that certain things were placed in the Recycle Bag by Mr Dineshkumar while Mr Tan was in the Car.119Foot Note 119×NE, 23 March 2023, p 76 ln 7 to ln 22; p 77 ln 13 to ln 20; and p 79 ln 28 to ln 31.When he exited the Car, Mr Tan felt that the bag was heavy.120Foot Note 120×NE, 22 March 2023, p 66 ln 24 to p 67 ln 6; and NE, 24 March 2023, p 38 ln 28 to ln 30 and p 39 ln 13 to ln 16.In his contemporaneous statements, Mr Tan said that E1A and E1B contained “heroinand‘ice’” [emphasis added] belonging to Sal Poulez (ie, Pal) and that Mr Tan was supposed to drop them off at a specified location as instructed by Sal Poulez. I note that Mr Tan alleges that he did not use the conjunctive “and” (but that he used the conjunctive “or”). As explained later at [92]–[96], I reject this allegation. 60 For present purposes, what is important is that Mr Tan does not dispute that he knew he was carrying drugs at the material time. In fact, this was Mr Tan’s consistent position during investigations and at trial. By the Nature of Transaction Defence, raised only at trial, Mr Tan claims that he was expecting small quantities of “ice” and three “popeyes” to be delivered to him (albeit for his personal use). I shall deal with the Nature of Transaction Defence from [67] below. In any event, by the time Mr Tan exited the Car with the Recycle Bag, however, he knew it was heavy and must have contained things other than some “ice” and three “popeyes”. Therefore, I am not satisfied that Mr Tan has established that he was not aware that the Drugs were in his possession so as to rebut the s 18(1)(a) presumption. Whether Mr Tan or Mr Dineshkumar placed the Drugs into the Recycle Bag 61 For completeness, in relation to this issue, I should mention that Mr Tan takes objection to the fact that the contradictory positions taken by Mr Tan and Mr Dineshkumar during investigations as to who placed the Drugs into the Recycle Bag were never clarified by the investigation officers.121Foot Note 121×Tan CS at para 41.As such, a factual ambiguity has arisen and, so says Mr Tan, the court must resolve the ambiguity in his favour. 62 In his long statement recorded on 18 August 2020, Mr Tan said that he did not handle the Drugs at all; they were placed into the Recycle Bag by Mr Dineshkumar. In contrast, in Mr Dineshkumar’s long statement recorded on 4 March 2020, he stated that he passed the two plastic bags, E1A and E1B, to Mr Tan during the car ride. It was Mr Tan who then placed the plastic bags into the Recycle Bag. Notwithstanding this, during cross-examination, Mr Dineshkumar disavowed his earlier narrative and admitted that Mr Tan had no role in placing E1A and E1B into the Recycle Bag.122Foot Note 122×Tan CS at paras 38–39; NE, 27 March 2023, p 61 ln 4 to ln 7; and NE, 27 March 2023, p 60 ln 12 to ln 18. 63  According to Mr Tan, as Mr Dineshkumar would gain nothing by lying about this, he must have been telling the truth while he was on the stand. In any event, if there is any doubt as to who is telling the truth, the benefit must be given to Mr Tan. Moreover, this apparent contradiction in the statements was never clarified by the CNB officers during investigations, despite it being a material aspect in the Prosecution’s case (the Prosecution had put to Mr Tan during cross-examination that he was the one who placed E1A and E1B into the Recycle Bag).123Foot Note 123×Tan CS at para 42; see NE, 23 March 2023, p 78 ln 21 to ln 23. 64 In finding that Mr Tan has failed to rebut the presumption under s 18(1)(a) of the MDA, I have proceeded on the basis that Mr Tan knew that Mr Dineshkumar placed certain things into the Recycle Bag (see [59] above). Effectively, I have resolved any ambiguity or discrepancy in favour of Mr Tan. For clarity, I state that I accept that Mr Dineshkumar placed the plastic bags, E1A and E1B, into the Recycle Bag.",
        "Knowledge": "141 With that, I turn to the element of knowledge. Here, it must be proved that Mr Dineshkumar knew the nature of the Drugsie, that they were diamorphine. 142 Like its case against Mr Tan, the Prosecution is relying on the presumption of knowledge under s 18(2) of the MDA.201Foot Note 201×PCS at para 76.I have already set out the applicable law as to how an accused person may rebut the s 18(2) presumption (at [51] above) and need not repeat it here. 143 The Prosecution argues that Mr Dineshkumar has failed to discharge his burden of rebutting the presumption on the basis that: (i) Mr Dineshkumar is not a credible witness; (ii) Mr Dineshkumar’s claim that he lacks the requisite knowledge is unbelievable; and (iii) Mr Dineshkumar was, in any event, indifferent to the contents of the Three Bundles. 144 Conversely, as stated (at [45] above), Mr Dineshkumar’s defence is that he was always under the impression that he was delivering “ice”. This is mainly because Mr Dineshkumar was made to believe that he was to deliver only one bundle of “ice” by Kelvin. Even when Mr Dineshkumar discovered that the Car contained four bundles of drugs, he was made to believe, and believed, that they all contained “ice”.202Foot Note 202×DK CS at para 62; and Mr Dineshkumar’s Reply Submissions (“DK RCS”) at para 6.I shall abbreviate this as “the Knowledge Defence”. Accuracy of Mr Dineshkumar’s statements 145 At trial, Mr Dineshkumar sought to cast doubt on the accuracy of the statements (including the third long statement, Exh P59), which were recorded with the assistance of the Tamil interpreter, Mdm Vijaya. Mr Dineshkumar stated that he had difficulties understanding some of the Tamil words used by Mdm Vijaya.203Foot Note 203×NE, 27 March 2023, p 50 ln 14 to p 51 ln 8.Also, he saw Mdm Vijaya closing her eyes during the interpretation process.204Foot Note 204×NE, 27 March 2023, p 51 ln 16 to ln 19.In the closing submissions, counsel for Mr Dineshkumar, Mr Mahadevan Lukshumayeh (“Mr Lukshumayeh”), further submits that it is obvious that Mdm Vijaya had severe difficulty reading the documents presented to her while on the witness stand despite the fact that she was using a large magnifying glass.205Foot Note 205×DK CS at para 59.Mr Lukshumayeh also pointed out that Mdm Vijaya would carry out her translation orally only, without viewing the relevant documents.206Foot Note 206×DK CS at para 60. 146 It is clear that Mdm Vijaya has poor eyesight. In court, she had difficulty reading the documents, and when being questioned, for expediency, portions of Mr Dineshkumar’s statements were read out to her.207Foot Note 207×Seeeg, NE, 22 February 2023, p 64 ln 11 to ln 12; p 67 ln 13; p 70 ln 15; and p 73 ln 14.However, in my view, even if I were to assume in Mr Dineshkumar’s favour that there were deficiencies in the interpretation process, it is not Mr Dineshkumar’s case (and there is no evidence) that Mdm Vijaya failed to translate the Knowledge Defence to the recording officer of the third long statement, ASP Fernandez, thereby leading to the omission of material details in it. I accept that Mdm Vijaya had conducted the translation by way of hearing only, without viewing the documents.208Foot Note 208×NE, 22 March 2023, p 17 ln 30 to ln 32.I also accept that Mdm Vijaya probably did not bring any pen and paper with her during the recording sessions.209Foot Note 209×NE, 22 March 2023, p 18 ln 14 to ln 15.ASP Fernandez candidly testified to these during cross-examination. However, what ASP Fernandez also said is that because of Mdm Vijaya’s poor eyesight,210Foot Note 210×NE, 22 March 2023, p 18 ln 9 to ln 10.ASP Fernandez proceeded line by line (and not paragraph by paragraph) when reading back Mr Dineshkumar’s statement (which ASP Fernandez had typed into his computer).211Foot Note 211×NE, 22 March 2023, p 17 ln 22 to ln 32. 147 Accordingly, I am unable to see how an entire part of Mr Dineshkumar’s alleged statement could be omitted. Indeed, Mr Dineshkumar has failed to point out exactly which parts of his statements were inaccurately recorded because of Mdm Vijaya’s alleged deficiencies. 148 As regards the allegation that Mdm Viyaja had closed her eyes at various moments during the interview sessions, I appreciate that the recording of one of the long statements extended to almost three hours.212Foot Note 212×AB 395–399 (Exhibit P59).However, as Mr Lukshumayeh conceded, it is not Mr Dineshkumar’s case that Mdm Viyaja was “sleeping throughout” but there were moments when Mdm Vijaya “closed her eyes that gave the impression that she was either sleeping or … not paying attention”.213Foot Note 213×NE, 22 March 2023, p 20 ln 7 to ln 13.In my view, if Mdm Vijaya had lost her focus at all, it was only momentarily, as the translation was done line by line (in light of Mdm Vijaya’s poor eyesight). If Mdm Vijaya was severely fatigued such that she had trouble keeping awake, it would have been impossible for the recording process to have been completed. Further, if this was indeed the case, I find it surprising that Mr Dineshkumar did not raise any complaints at all during the investigation process. Instead, he was content to have Mdm Vijaya act as the interpreter for several statements made over the course of about half a year to the CNB. 149 In the result, I do not accept that the statements were inaccurately recorded in any material way on the ground of Mdm Vijaya’s alleged deficiencies. Whether the Knowledge Defence is proved 150 With the above in mind, I shall return to the central question of whether Mr Dineshkumar has successfully rebutted the presumption of knowledge on a balance of probabilities. In my judgment, Mr Dineshkumar has failed to do so. (1) Mr Dineshkumar’s credibility 151 To begin, Mr Dineshkumar initially disputed the entire charge against him by stating in his investigation statements that he had only collected cash from Mr Tan and that he did not give Mr Tan anything on the night of 25 February 2020.214Foot Note 214×AB 252–253 (Q/A 24, Q/A 27); AB 270; and AB 274 at para 18.It is in his third long statement, Exh P59, recorded about a week after his arrest, that Mr Dineshkumar first admitted that he was delivering drugs at the material time (and knew the Four Bundles contained drugs) as he hoped to receive a lighter sentence for telling the truth.215Foot Note 215×AB 399 at paras 67–68.However, even then, Mr Dineshkumar did not raise his defence that he thought he was delivering “ice”. Instead, he stated that he did not know the type nor quantity of drugs involved.216Foot Note 216×AB 396 at para 60.Mr Dineshkumar only raised his defence (ie, that he believed the Four Bundles specifically contained “ice”) in his fourth long statement recorded five months after.217Foot Note 217×AB 402 at para 76. 152 In my view, Mr Dineshkumar’s credibility is questionable. Despite the Knowledge Defence being a key aspect of Mr Dineshkumar’s defence, he failed to raise it in his third long statement even after he had decided to be “honest and tell the truth”, and professed to cooperate with the CNB. It was only five months later that the Knowledge Defence was raised. When asked by the recording officer why he failed to raise the Knowledge Defence earlier, Mr Dineshkumar explained that he “couldn’t remember [at the time as he] was just arrested and … was thinking about a lot of things. Now that [he has] the time, [he is] able to think properly and recall this.”218Foot Note 218×AB 402 at para 76. 153 I am not convinced by this explanation. One would expect Mr Dineshkumar to ensure that all the relevant facts concerning his defence be recorded in the third long statement, as that was when Mr Dineshkumar decided to come clean to obtain a lighter sentence. Moreover, it is also peculiar that Mr Dineshkumar managed to provide many details about the transaction on 25 February 2020 in the third long statement but failed to raise the Knowledge Defence. By the above, I have doubts as to Mr Dineshkumar’s credibility as regards the Knowledge Defence. (2) The Knowledge Defence is inherently unbelievable 154 Essentially, the Knowledge Defence is based on Mr Dineshkumar’s claim that Kelvin told him that the Four Bundles all contained only “ice”, and he believed Kelvin. In my view, the Knowledge Defence is inherently unbelievable in light of the surrounding facts and circumstances. 155 First, there is no real basis for Mr Dineshkumar to have trusted Kelvin without question and to have believed Kelvin’s claim that the bundles contained only “ice”. By Mr Dineshkumar’s evidence, at the material time, he had only known Kelvin for about three months and he did not even know Kelvin’s real name (see [28(a)] above). Moreover, Kelvin was essentially a drug dealer and nothing else, as far as Mr Dineshkumar was concerned.219Foot Note 219×NE, 27 March 2023, p 67 ln 27 to ln 29.Mr Dineshkumar’s purported trust in Kelvin is contradicted by his consistent testimony that he felt angry when he saw the Four Bundles in the boot of the Car at Fishery Port Road.220Foot Note 220×NE, 27 March 2023, p 16 ln 26 to ln 30; NE, 29 March 2023, p 4 ln 1 to ln 7 and p 19 ln 23 to ln 24; and DK RCS at para 17.Mr Dineshkumar even called Kelvin and scolded him with profanities, and threatened to leave the drugs at a nearby tree.221Foot Note 221×NE, 27 March 2023, p 16 ln 26 to ln 30; NE, 29 March 2023, p 19 ln 23 to ln 29.Accordingly, it is unbelievable that Mr Dineshkumar would still trust Kelvin’s assurance, over the phone when Mr Dineshkumar was at Fishery Port Road,222Foot Note 222×NE, 29 March 2023, p 11 ln 29 to p 12 ln 2.that the Four Bundles only contained “ice”. 156 Second, I am unable to accept Mr Dineshkumar’s bare assertion that he had brought only one bundle of “ice” into Singapore the day prior to his present offence (ie, on 24 February 2020).223Foot Note 223×NE, 27 March 2023, p 45 ln 3 to ln 5.Presumably, by stating this, Mr Dineshkumar sought to give credence to the Knowledge Defence. However, this claim is not made in any of Mr Dineshkumar’s statements. Crucially, Mr Dineshkumar stated in his third long statement that he did not know the type or quantity of drugs he was delivering on 24 February 2020 and did not ask Kelvin about it. There was no mention of the delivery of “ice” in the statement.224Foot Note 224×AB 395 at para 57.Mr Dineshkumar maintained this position in his fifth long statement and even added that Kelvin did not inform him that the bundle had contained “ice”.225Foot Note 225×AB 412 at para 81.Mr Dineshkumar’s explanation for the preceding inconsistency is that he had told informed recording officer of his third long statement, through Mdm Vijaya, that Kelvin had in fact told Mr Dineshkumar that he would be delivering one bundle of “ice” on 24 February 2020, but Mdm Vijaya, “may not have heard him right”.226Foot Note 226×NE, 27 March 2023, p 77 ln 29 to p 78 ln 8.As I have stated (at [145]–[149] above), even if Mdm Vijaya’s performance as an interpreter had fallen short, that in itself is insufficient to cast a doubt on the overall accuracy of the statements, especially when the position that Mr Dineshkumar now advances is contradicted by more than one of his recorded statements. Accordingly, I reject Mr Dineshkumar’s assertion to have brought only one bundle of “ice” into Singapore the day prior to his present offence. 157 Third, I am unable to accept Mr Dineshkumar’s contention at trial that when Kelvin passed the Car to Mr Dineshkumar on 25 February 2020, Kelvin told Mr Dineshkumar, “It is like yesterday”, which Mr Dineshkumar understood to mean that he would have to deliver one bundle of “ice”.227Foot Note 227×NE, 29 March 2023, p 12 ln 3 to ln 12.Apart from the fact that this assumption was not recorded in any of the investigation statements, it is also at odds with by Mr Dineshkumar’s voice message to Kelvin which he sent on the night of 25 February 2020, asking Kelvin “what is the thing [he] need to send”.228Foot Note 228×AB 258 at row 8.If Mr Dineshkumar formed the impression from what Kelvin had said that he would be delivering one bundle of “ice”, he would not have needed to ask Kelvin the question. When confronted with this during cross-examination, Mr Dineshkumar conceded that he “did not know at that point what drugs he was supposed to be carrying”.229Foot Note 229×NE, 29 March 2023, p 18 ln 5 to ln 8. 158 Finally, I am of the view that Mr Dineshkumar was indifferent to the contents of the Three Bundles. As mentioned, an accused person who was merely indifferent to or ignorant of what he was carrying would not be able to rebut the presumption in s 18(2):Gobiat [64]. It was Mr Dineshkumar’s own admission at trial that he had the opportunity to unwrap the bundles to check their contents but he did not do so. Mr Dineshkumar also accepted that it would have been reasonable for him to do so as he was bringing in more bundles than expected and the bundles were wrapped differently from those he had delivered a day prior (ie, on 24 February 2020).230Foot Note 230×NE, 29 March 2023, p 26 ln 27 to p 27 ln 13.While Mr Dineshkumar went on to say that he would have had to answer to Kelvin if he opened the bundles without Kelvin’s permission,231Foot Note 231×NE, 29 March 2023, p 27 ln 11 to ln 13.it is not as if Mr Dineshkumar was under some form of duress to not open the bundles. Indeed, to reiterate, it is Mr Dineshkumar’s evidence that he was angry when he first learned that there was more than one bundle in the Car at Fishery Port Road232Foot Note 232×NE, 27 March 2023, p 16 ln 26 to ln 30; NE, 29 March 2023, p 4 ln 1 to ln 7 and p 19 ln 23 to ln 24; and DK RCS at para 17., and that he even scolded Kelvin with profanities and threatened to leave the drugs at a nearby tree.233Foot Note 233×NE, 27 March 2023, p 16 ln 26 to ln 30; NE, 29 March 2023, p 19 ln 23 to ln 29. 159 Despite the above, Mr Dineshkumar was totally indifferent as to the nature of the contents of the Three Bundles and was content to trust Kelvin’s assurance that the bundles only contained “ice”. In this connection, the following observation by the Court of Appeal inMohamedShalleh bin Abdul Latiff v Public Prosecutor[2022] 2 SLR 79 at [32] is instructive: It would rarely, if ever, be sufficient for an accused person to rebut the s 18(2) presumption by stating simply that he believed what he was told in relation to what was in his possession. Where such a claim is made, the court will, of course, have to consider whether it believes that bare claim and in that regard, it will be necessary to consider the entire factual matrix and context, including the relationship between the parties and all surrounding circumstances. Having considered the facts and circumstances, I reject the Knowledge Defence as unbelievable. Whether Mr Dineshkumar has rebutted the presumption of knowledge 160 For the foregoing reasons, I am unable to accept that Mr Dineshkumar has established the Knowledge Defence on a balance of probabilities. As the Knowledge Defence is rejected, it follows that Mr Dineshkumar has failed to prove that he believed he was carrying some other drug other than the specific drug (ie, diamorphine) in his possession:Gobiat [59]. Accordingly, I find that Mr Dineshkumar has failed to rebut the presumption of knowledge under s 18(2) of the MDA.",
        "Intention to traffic": "115 I now proceed to address the final element of the offence, which pertains to the intention to traffic the Drugs. The Prosecution bears the burden of proving, beyond a reasonable doubt, that Mr Tan intended to deliver the Drugs to a third party as per Pal’s instructions. On this score, the Prosecution relies on Mr Tan’s admissions in his investigation statements. The Prosecution asserts that Mr Tan’s attempt to discredit these admissions during the trial should be dismissed.184Foot Note 184×PCS at paras 66–73. 116 On the other hand, Mr Jumabhoy presents two main lines of arguments to support Mr Tan’s claim that he did not have the intention to traffic the Drugs.  First, Mr Jumabhoy relies on the following key aspects of the defence. Specifically, there was never an agreement for Mr Tan to traffic more than one pound of heroin. Effectively, this concerns the Alleged Agreement and Mr Tan’s evidence regarding the previous transactions with Pal (which did not involve more than one pound of heroin). Further, Mr Tan was not the intended recipient of the Drugs.185Foot Note 185×Tan CS at para 79.These aspects raise doubts about his intention to deliver them according to Pal’s instructions. Second, Mr Jumabhoy argues that the investigation statements relied upon by the Prosecution do not provide conclusive evidence that Mr Tan intended to deliver the Drugs. In the statements themselves, Mr Tan expressed the possibility that he would not have continued with the delivery of the Drugs.186Foot Note 186×Tan CS at paras 63 and 85.I deal with each in turn. Key aspects of the defence 117 I return to the Alleged Agreement,ie, that Mr Tan agreed with Pal that he would only collect one pound of heroin and/or 125g of ice, and there was never an agreement to traffic more than one pound/bundle of heroin (see [42] above). If the Alleged Agreement exists, then it may well cast doubt as to Mr Tan’s intention to traffic all the Drugs. However, as set out above (at [109]), I reject the existence of the Alleged Agreement. I should add that I have also rejected the Nature of the Transaction Defence. That said, when I consider the contents of the investigation statements in a moment, I shall refer to these matters, as well as Mr Tan’s claim that, in any event, he had not dealt with more than one pound of heroin in any of his previous dealings (see [109] above). 118 Mr Tan also says that the fact that he was not the intended recipient of the Drugs is indicative of the lack of intention to traffic the Drugs on his part.187Foot Note 187×Tan CS at para 21.However, as I stated at [110]–[113] above, although Mr Tanmightnot have been the original intended recipient of the Drugs, there is nothing to suggest that he was not meant to receive the Drugs. Indeed, he was the eventual recipient, and I have rejected his explanation that only expected to receive “ice” and “popeyes” that night. The fact that Mr Tan was not the original intended recipient of the Drugs is not altogether helpful in ascertaining his intention in relation to the Drugs. That said, in considering the contents of the investigation statements, I shall discuss Mr Tan’s contention that he was not expecting such large quantities of drugs. Contents of the investigation statements 119 Turning to the contents of the investigation statements, the relevant portion of the first contemporaneous statement is as follows:188Foot Note 188×AB 112–113. Q1:  What is this? (Accused shown 01 white plastic bag containing 02 Black bundles and 01 black plastic by containing 02 black bundles) A1:  Heroin and Ice Q2: Whose [sic] does it belongs to? A2:  It belongs to a Malaysian guy.I am supposed to drop it off as instructed. I do not know yet. The Malaysian guy will tell me. Not so soon. [emphasis added] 120 Similarly, in the third contemporaneous statement, when asked what he wassupposedto do with the bundles, Mr Tan answered that he would “[w]ait for Sal Poulez [sic] instruction to drop the Heroin and Ice at specified location”. Mr Tan also added that he did not know when Sal Poulez (ie, Pal) would call him and would have just waited for the call.189Foot Note 189×AB 149 (Q/A 7 and Q/A 8). 121 In the cautioned statement, Mr Tan admitted that he was guilty of the offence. According to the Prosecution, the contents of such statements clearly show that Mr Tan’s intention was to deliver the Drugs. 122 To reiterate, Mr Tan attempted to cast doubt on the accuracy of these statements by stating that he was suicidal and wanted to implicate himself. In respect of the third contemporaneous statement, he said that SSgt Eric had conducted the interview improperly. However, I have rejected Mr Tan’s claim of his intention to commit suicide (at [87] above) and allegations of improper conduct on the part of SSgt Eric (at [96] above). In other words, I accepted the accuracy of these statements. However, as stated at [87] above, I am prepared to accord little to no weight to the cautioned statement. 123 I should also reiterate that Mr Tan claims that he reacted strongly after the Drugs were revealed to him after his arrest (see [68]–[71] above). The purported reactions, argues Mr Tan, show that his first reaction was to scold Pal for giving him such large quantities of drugs, and his first reaction was not to deliver the Drugs for Pal. Therefore, this points against him having the intention to traffic the Drugs.190Foot Note 190×Tan CS at para 83.However, as I explained above, I do not believe Mr Tan’s account of the purported reactions (which were not recorded in the first and second contemporaneous statements) (see [74]–[76] above). 124 Next, Mr Jumabhoy argues that the fact that Mr Tan wassupposedto do something is not the same as what heintendedto do.191Foot Note 191×Tan CS at para 63.This was an ambiguity in the first and third contemporaneous statements, which should be resolved in favour of Mr Tan. Further, the ambiguity carried on to paragraph 20 of Mr Tan’s second long statement recorded on 3 March 2020. The material portion of that paragraph reads:192Foot Note 192×AB 344 at para 20. I wish to say that I would had [sic] still continued to drop off the drugs from this collection on ‘Pal’s’ instruction. However, whether I would continue to do this is not confirmed as I felt unhappy that ‘Pal’ had passed me drugs more than the usual collected without informing me beforehand. 125 Mr Tan’s position is that the above admissions, taken at their highest, do not prove an intention to traffic the Drugs because continuing to drop off the Drugs as directed by Pal is just one possibility. He could have refused to do so and returned them to Pal.193Foot Note 193×Tan CS at para 85.In this connection, Mr Jumabhoy relies on the proposition inRamesh a/l Perumal v Public Prosecutor and another appeal[2019] 1 SLR 1003 (“Ramesh Perumal”) at [110] that a person who returns drugs to the person who originally deposited those drugs with him would not ordinarily come within the definition of “trafficking”. 126 I have carefully considered Mr Jumabhoy’s arguments. But based on the evidence before me, I am unable to accept them. By the time the first and third contemporaneous statements were recorded, Mr Tan was well aware that there were Four Bundles in the Recycle Bag. He does not dispute this. In the first contemporaneous statement, Mr Tan said he was “supposedto drop it off as instructed” [emphasis added]. He reiterated this in the third contemporaneous statement. I can accept that “supposedto” (what he was required to do) is not the same as “intendedto” (what Mr Tan would do). However, intention is a subjective state of mind to be objectively inferred from the surrounding facts and circumstances:Public Prosecutor v MuhammadSalihin bin Ismail[2023] SGHC 155 at [72]. From the statements, it is evident that Mr Tan knew what he was required to do, as per his arrangement with Pal. There was no indication that Mr Tan would depart from his arrangement with Palie,to drop off the Drugs as instructed by Pal. From these clear and unequivocal admissions, the only inference to be drawn is that it was his intention to deliver the Drugs. Indeed, even in paragraph 20 of Mr Tan’s second long statement, recorded a week after his arrest, he said that he “would had [sic] still continued to drop off the drugs from this collection on ‘Pal’s’ instruction”. This confirms the inference to be drawn with regard to his intention. Accordingly, the difference between what Mr Tan wassupposedto do and what heintendedto do is more apparent than real. 127 In my view, although there was apparently a shift in position reflected in paragraph 20, whereby Mr Tan expressed that “whether [he] would continue to [deliver the Drugs] is not confirmed as [he] felt unhappy that ‘Pal’ had passed [him] drugs more than the usual collected”, this shift came belatedly. Theactus reusandmensreaof the offence had already coincided on 25 February 2020 – when Mr Tan took possession of the Drugs. Moreover, Mr Tan’s position merely became equivocal. Mr Tan only expressed apossibilitythat he would not have delivered the Drugs, and this shift does not seriously undermine Mr Tan’s original intention to deliver the Drugs. I should add that even in the fourth long statement, recorded some months later on 18 August 2020, this equivocal stance remained (see [23(b)] above). 128 Weighed against Mr Tan’s evidence of the Alleged Agreement, or even of his prior experience of not delivering more than one pound of drugs for Pal, I find Mr Tan’s equivocal stance puzzling. By way of reminder, according to Mr Tan, when Segar delivered more than one pound of heroin on or around 9 January 2020, Mr Tan felt betrayed. He had no qualms about confronting Segar about it over the phone, going as far as to say that he did not “want to have anything to do with this one and they should come pick it up” (see [36] above). Indeed, eventually, Pal picked up the drugs in question. That is why there was the Alleged Agreement with Pal. In any event, he had never dealt with more than one pound of heroin. In contrast, the statements do not show Mr Tan exhibiting such a strong reaction in relation to the present collection. If Mr Tan indeed had no intention to deliver more than one pound of heroin, and especially given his alleged prior dealing with Segar and Pal on or around 9 January 2020, I would expect him to have rejected outright any further involvement with the Four Bundles and to require Pal to collect the Drugs. But nothing is said along these lines. 129 In fact, in paragraph 20 of the second long statement, Mr Tan merely said, “[Pal] should not have assumed that [Mr Tan] would be ok to collect this amount of drugs. If ‘Pal’ try to brush [Mr Tan] off, [Mr Tan] would have warned him not to put this amount of drugs without letting [Mr Tan] know next time….” (see [20(d)] and [107] above). Following this portion of paragraph 20, Mr Tan then expressed uncertainty about whether he would proceed to deliver the Drugs. His equivocal stance continued in the fourth long statement. 130 At the highest, the tenor of the second and fourth statements suggests that Mr Tan had second thoughts about what to do with the Drugs and that he developed some doubts about whether he should proceed with the intended plan. This was completely contradictory to his professed firm and uncompromising stance with Segar and Pal concerning the January 2020 transaction. I agree with the Prosecution that by this shift to an equivocal position, Mr Tan was merely seeking to disassociate himself from the prior consistent admissions. 131 Lastly, in my judgment,Ramesh Perumaldoes not greatly assist Mr Tan. InRamesh Perumal, two accused persons, Ramesh and Chander, drove into Singapore together from Malaysia. At some point during the journey, Ramesh received a bag containing four bundles of diamorphine from Chander. Ramesh argued that he did not know about the contents of the bag. He claimed that Chander had told him that the bag contained some documents and had passed them to him for safekeeping. Chander also told Ramesh that he would take the bag back from Ramesh later that day and bring the items in that bag back to Malaysia. However, Chander gave evidence that Ramesh was supposed to deliver the four bundles to a recipient in Singapore. On the facts, the court found that there was a reasonable possibility that Ramesh was safekeeping the drugs with the intention of returning them to Chander. Accordingly, the trafficking charge against Ramesh was amended to a charge of possession simpliciter under s 8(a) of the MDA, as an accused who was in possession of drugs with no intention of parting with them other than to return them to the person who originally deposited those drugs with him does not come within the definition of possession of those drugs “for the purpose of trafficking”. 132 The present case is readily distinguishable fromRamesh Perumal.Mr Tan was not entrusted to safe keep the Drugs and return them to Pal. As is clearly stated in the statements, the arrangement was for Mr Tan to deliver the Drugs to others in Singapore. While Mr Tan expressed the possibility that he would not proceed to deliver the Drugs, this was belated. To my mind, this was an attempt to distance himself from the earlier admissions. By the above, I am of the view that the contents of the statements reveal that Mr Tan accepted that he was required to drop off all Four Bundles within the Recycle Bag and that the inference to be drawn is that it was his intention to do so. Mr Tan’s conduct 133 I wish to discuss Mr Tan’s behaviour during the collection (including his failure to check the contents of the Recycle Bag). To recapitulate, while he was in the Car, Mr Tan claimed that he did not know that Mr Dineshkumar was placing things into the Recycle Bag, as Mr Tan’s attention was on the road.194Foot Note 194×NE, 23 March 2023, p 76 ln 13 to ln 17.He “presumed” some things were thrown into the Recycle Bag upon hearing thudding on the floorboard of the Car.195Foot Note 195×NE, 23 March 2023, p 76 ln 19 to ln 22.That said, he denied that he knew what the thudding sounds were about, and assumed that Mr Dineshkumar had put things into the Recycle Bag after he had lifted the Recycle Bag up and alighted from the Car.196Foot Note 196×NE, 23 March 2023, p 77 ln 18 to ln 20. 134 While I appreciate that it was a car ride of only about one minute, in my view, it is still troubling that Mr Tan did not care to even look into the Recycle Bag while in the Car, even after hearing the thudding sounds. It would not have taken more than a moment for him to roughly ascertain what had been placed into the Recycle Bag (which was on the floorboard in front of him). By the time he exited the Car, Mr Tan had sensed that the weight of the Recycle Bag was heavier than usual upon lifting the Recycle Bag from the floorboard.197Foot Note 197×NE, 23 March 2023, p 82 ln 12 to ln 14.I appreciate that the Unit was nearby, but again, I am of the view that if Mr Tan truly did not expect to receive the Drugs, then he ought reasonably to have at least looked into the Recycle Bag to have a quick glance at its contents. 135 If the Nature of Transaction Defence were to be believed, and if the Alleged Agreement were in place, I would have considered Mr Tan’s behaviour incomprehensible. Setting aside these defences, which I have rejected, as I said at [109] above, there remains Mr Tan’s claim that he had never dealt with more than one pound of heroin in the previous transactions. Mr Tan said that he would not traffic in more than one bundle of heroin as it would carry a death sentence.  Given these circumstances relied on by Mr Tan, it is unbelievable that Mr Tan did not bother to check on the contents of the Recycle Bag while in the Car or exhibit any reaction or concern at all after he felt that the Recycle Bag was heavier than usual as he left the Car. Mr Tan’s nonchalance buttresses the inference that he intended to deliver the amount of drugs which he collected. Whether Mr Tan had the intention to traffic 136 In conclusion, I am satisfied that the Prosecution has proved Mr Tan’s intention to traffic the Drugs beyond a reasonable doubt. In the final analysis, the investigation statements and surrounding circumstances strongly evince Mr Tan’s intention that he would have gone on to deliver the Drugs. Contrary to Mr Tan’s contention in the closing submissions, his purported reactions of shock and surprise when the Drugs were first revealed to him are not supported by CNB officers who observed him, and neither were those reactions reflected in the contemporaneous statements. Moreover, Mr Tan’s shift in position as regards his intention came too late, and even then, it suffered from ambiguity. The irresistible inference to be drawn is that he intended to traffic the Drugs which he collected. For completeness, I should state that in arriving at this conclusion, I have considered Mr Tan’s background and experience, as set out in [114] above.",
        "Decision: Mr Dineshkumar": "137 I now turn to consider the case against Mr Dineshkumar.",
        "Act of trafficking": "138 The first element to be established for a charge of trafficking under s 5(1) of the MDA, as faced by Mr Dineshkumar, is the act of trafficking in the Drugs. Mr Dineshkumar does not seriously dispute that he delivered the Drugs to Mr Tan. 139 Nevertheless, Mr Dineshkumar has provided two different accounts as to how he had delivered them to Mr Tan. These were either: (a) that while the parties were in the Car, Mr Dineshkumar handed the plastic bags, E1A and E1B, to Mr Tan, who then placed them into the Recycle Bag; or (b) that Mr Dineshkumar dropped E1A and E1B directly into the Recycle Bag. Mr Dineshkumar gave the former account in his third long statement,198Foot Note 198×AB 398 at para 63.while the latter account was given at trial. At trial, Mr Dineshkumar also testified that the former account was inaccurately recorded in his third long statement.199Foot Note 199×NE, 27 March 2023, p 32 ln 26 to ln 27; and NE, 29 March 2023, p 29 ln 4 to ln 11, p 30 ln 1 to ln 18. 140 In my view, it is immaterial whether Mr Dineshkumar had passed E1A and E1B to Mr Tan or placed them directly into the Recycle Bag. On either account, it is clear that Mr Dineshkumar delivered the Drugs to Mr Tan. That said, as I stated above at [64], I accept that it was Mr Dineshkumar who placed E1A and E1B into the Recycle Bag. For completeness, I should add that Mr Dineshkumar’s claim (which was only raised at trial) that he had intended to leave the bundles at a nearby tree at Fishery Port Road,200Foot Note 200×NE, 27 March 2023, p 20 ln 29 to ln 30.even if true, is irrelevant as that did not materialise.",
        "Conclusion": "161 In conclusion, the Prosecution has proved the charge against Mr Tan beyond a reasonable doubt. Therefore, I convict Mr Tan of the charge against him of having in his possession the Drugs for the purpose of trafficking. 162 In relation to Mr Dineshkumar, I also find that the Prosecution has proved the charge of trafficking the Drugs beyond a reasonable doubt. I find Mr Dineshkumar guilty and convict him of the charge. 163 I will now hear the parties on the sentences to be imposed on Mr Tan and Mr Dineshkumar. Hoo Sheau Peng-Judge of the High Court Ng Yiwen, Lim Woon Yee, Joelle Loy and Ronnie Ang (Attorney-General’s Chambers) for the Prosecution;Andre Darius Jumabhoy (Andre Jumabhoy LLC) and Sankar s/o Kailasa Thevar Saminathan (Sterling Law Corporation) for the first accused;Mahadevan Lukshumayeh (Lukshumayeh Law Corporation) and Elengovan s/o V Krishnan (Elengovan Chambers) for the second accused."
    }
}