{
    "case_title": "Teo Chu Ha (alias Henry Teo) vPublic Prosecutor and other appeals",
    "ncitation": "[2023] SGHC 130",
    "coram": "General Division of the High Court — Magistrate’s Appeals Nos 9011 and 9012 of 2021/01, Magistrate’s Appeals Nos 9011 and 9012 of 2021/02, and Criminal Motion No 3 of 2023Vincent Hoong J27–29 July 2022, 24 February 2023",
    "sections": {
        "Introduction": "1 Complex corruption cases often involve transnational elements, necessitating the co-operation of governments and investigative agencies. This case, involving gratification of more than S$2 million, is no exception. Moneys paid to secure contracts for Chinese companies to service a Singaporean company operating in China were funnelled into Singapore, eventually being used to purchase Singaporean property. This is an opportunity to consider some of the salient features arising from such offences, such as the scope of jurisdiction of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed) (“PCA”), evidentiary issues under the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) and Mutual Assistance in Criminal Matters Act (Cap 190A, 2001 Rev Ed) (“MACMA”), the scope of s 44(1) of the Corruption, Drug Trafficking and other Serious Crimes (Confiscation of Benefits) Act (Cap 65A, 2000 Rev Ed) (“CDSA”) , as well as the applicability of the decision inGohNgak Eng v Public Prosecutor[2022] SGHC 254 (“GohNgak Eng”) to offences under s 5 of the PCA. 2 Mr Teo Chu Ha @ Henry Teo (“Henry”) and Ms Judy Teo Suya Bik (“Judy”) were each convicted, after trial, of 50 charges under s 5(a)(i) read with s 29(a) of the PCA (“PCA Charges”) and one charge under s 44(1)(a), punishable under s 44(5)(a) of the CDSA, read with s 109 of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”) (“CDSA Charge”) (collectively, “Charges”). 3 The District Judge (“DJ”) sentenced Henry and Judy to aggregate imprisonment sentences of 50 months and 41 months respectively. He further ordered Judy to pay a penalty in the sum of S$2,320,864.10 under s 13 of the PCA, in default of which Judy is to serve an additional 18 months of imprisonment (“Penalty”).1Foot Note 1×Public Prosecutor v Teo Chu Ha @ Henry Teo and another[2021] SGDC 196 (“GD”) at [7]–[8] (ROP at pp 5054–5057). 4  Henry and Judy contend that their respective convictions are unsafe and the custodial sentences, manifestly excessive. Conversely, the Prosecution submits that the DJ imposed manifestly inadequate imprisonment terms on the offenders and erred in refusing to enforce the Penalty by way of an attachment order.2Foot Note 2×Henry and Judy’s Submissions dated 18 April 2022 (“AS”) at paras 433–441; Prosecution’s Submissions dated 18 April 2022 (“PS”) at paras 7, 184 and 238.The Prosecution also seeks to adduce further evidence on appeal relating the enforcement of the Penalty and filed Criminal Motion No 3 of 2023 (“CM 3”) for leave to do so. In this judgment, when dealing with the appeals against conviction and sentence, I shall refer to Henry and Judy collectively as the appellants.",
        "Background facts": "",
        "Undisputed facts": "5 Henry and Judy are siblings. They were 69 and 66 years of age respectively when the Charges were proffered against them and 72 and 68 years old when they were sentenced by the DJ.3Foot Note 3×GD at [214] (ROP at p 5144); ROP at pp 33–134. 6 Judy was based in Shanghai between 2002 and 2012. During this time, she was employed by Twin Palms Sdn Bhd (“Twin Palms”), a company owned by her ex-boyfriend Mr Ong Eng Kiow (“Joseph”). In this capacity, Judy purportedly provided consultation and interpretation services to various Chinese companies.4Foot Note 4×GD at [38] (ROP at p 5064); ROP at p 6159, para 5; AS at paras 3–4. 7 Henry joined Seagate Technology International (“Seagate”) in 2000 and held the role of Senior Director of Logistics. He was additionally a member of the Seagate committee which oversaw two tenders for the provision of transportation services to ferry Seagate’s goods in China in 2006 and 2009 (“the 2006 Tender” and “the 2009 Tender” respectively).5Foot Note 5×GD at [30]–[31], [34] (ROP at pp 5062–5063). 8 Three trucking routes were the subject of the 2006 Tender. Broadly, the first route (“Group 1 Route”) was awarded to Shanghai Long-Distance Transportation Co (“SLT”) and China Shipping Air Cargo Co Ltd. The second route (“Group 2 Route”) was awarded to SLT and the third (“Group 3 Route”), to Feili International Transport Co Ltd (“Feili”).6Foot Note 6×GD at [32] (ROP at p 5063). 9 The award of these three routes was effectedviathree contracts dated 1 December 2006,viz, the Seagate Technology/Shanghai Long-Distance Transportation Co Logistics Services Provider Agreement, the Maxtor Technology (Suzhou) Co Ltd/Shanghai Long-Distance Transportation Co Logistics Services Provider Agreement and the Seagate Technology/Feili International Transport Co Ltd Logistics Services Provider Agreement (“the 2006 Tender Contracts”). The 2006 Tender Contracts spanned 24 months with the option of a one-year extension. They were extended for one year on 1 December 2008 and an additional two months on 1 December 2009.7Foot Note 7×GD at [33] (ROP at p 5063). 10 Next, in September 2009, Seagate held the 2009 Tender. This similarly involved the provision of transportation services for three trucking routes. One route was awarded to SLT (“Group B Route”) while the remaining two were awarded to Feili (“Group A and C Routes”). Again, Seagate entered into individual contracts with SLT and Feili to give effect to the results of the 2009 Tender (“the 2009 Tender Contracts”). The 2009 Tender Contracts were effective between 1 February 2010 and 31 January 2013 but were terminated sometime in 2012 when Henry was investigated for offences under the PCA.8Foot Note 8×GD at [34]–[36] (ROP at pp 5063–5064); ROP at pp 710–711. 11 Between April 2007 and November 2010, SLT and Feili paid moneys into a Bank of China (“BOC”) bank account that belonged to Joseph (“Joseph’s BOC Account”). One Gu Meihua made 25 payments aggregating RMB1,877,135 to Joseph’s BOC Account between 6 April 2007 and 20 October 2009 on behalf of SLT while one Gu Honghua made 25 payments aggregating RMB9,491,890.44 to Joseph’s BOC Account between 21 November 2008 and 19 November 2010 on behalf of Feili. A breakdown of these 50 payments is set out in Annex A. 12 SLT and Feili paid these moneys into Joseph’s BOC Account pursuant to agreements they individually signed with Twin Palms in October 2006 (“the Agreements”). The Agreements broadly stipulated that in consideration of Joseph assisting SLT and Feili to secure contracts for the provision of trucking services with Seagate, SLT and Feili would pay Twin Palms 10% of the invoice value of these trucking services.9Foot Note 9×ROP at pp 8620, 8682–8683.Henry drafted the Agreements10Foot Note 10×ROP at pp 4012, 6283–6285.while Judy helped to secure the signatures of SLT and Feili’s representatives.11Foot Note 11×ROP at pp 4012–4015, 4021–4022.",
        "The Prosecution’s case": "13 The Prosecution’s case was that Henry and Judy conspired to corruptly enrich themselvesviathe 2006 and 2009 Tender Contracts. Pursuant to this conspiracy, Henry provided Judy with Seagate’s confidential information that he acquired by virtue of his positions as Senior Director of Logistics and member of the 2006 and 2009 Tender committees. Judy in turn utilised this information to assist SLT and Feili to successfully secure the 2006 and 2009 Tender Contracts.12Foot Note 12×GD at [37] (ROP at p 5064); PS at para 15. 14 Following from the above, the Agreements were shams and concealed the true state of affairs between Henry and Judy on one hand and SLT and Feili on the other. The moneys SLT and Feili transferred to Joseph’s BOC Account were not payments for Joseph helping SLT and Feili secure the 2006 and 2009 Tender Contracts but bribes for the confidential information Judy provided to SLT and Feili.13Foot Note 13×GD at [38] (ROP at p 5064); PS at para 15. 15 Henry and Judy used Joseph as a conduit for Judy to receive bribes from SLT and Feili. At all material times, Judy had control of Joseph’s BOC Account. She was able to withdraw moneys from Joseph’s BOC Account using the corresponding ATM card and Joseph’s passbook. In this manner, Judy transferred moneys from Joseph’s BOC Account into her own BOC account (“Judy’s BOC Account”).14Foot Note 14×GD at [39] (ROP at p 5065); PS at paras 14, 16. 16 Separately, sometime on or before July 2009, Henry conspired with Judy to withdraw S$703,480 (which constituted bribe moneys) from Judy’s BOC Account to fund the purchase of a condominium unit in Singapore (“the Property”). Henry utilised Judy’s ATM card to withdraw the said sum from Judy’s BOC Account and deposited these moneys into his personal accounts between July 2009 and September 2010. The Property was purchased in Judy’s name in 2012.15Foot Note 15×GD at [39] (ROP at p 5065); PS at para 16.This formed the subject matter of the CDSA Charge. 17 The Prosecution’s case largely rested on the following: (a) Four investigative statements recorded from Henry under s 22 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“1985 CPC”) on 1 December 2010 at about 4.20pm (“P38”), 2 December 2010 at about 11.54am (“P39”), 6 December 2010 at about 7.04pm (“P44”) and 9 December 2010 at about 3.00pm (“P45”).16Foot Note 16×ROP at P38, P39, P44 and P45. (b) Three investigative statements recorded from Henry under s 22 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“2012 CPC”) on 27 April 2015 at about 2.15pm (“P43”), 17 April 2015 at about 2.40pm (“P42”) and 2 November 2016 at about 10.15am (“P102”).17Foot Note 17×ROP at P42, P43 and P102. (c) Four investigative statements recorded from Judy under s 22 of the 2012 CPC on 5 January 2011 at about 3.10pm (“P47”), 12 January 2011 at about 3.18pm (“P48”), 24 August 2016 at about 10.00am (“P100”) and 24 August 2016 at about 3.45pm (“P101”).18Foot Note 18×ROP at P47, P48, P100 and P101. (d) Emails Henry and Judy exchanged between 29 August 2005 and 17 September 2006 (“the Emails”).19Foot Note 19×GD at [42] (ROP at p 5066); P105–P108. (e) Bank statements from the BOC, Shanghai Branch (“BOC Statements”).20Foot Note 20×GD at [43(a)] (ROP at p 5066); ROP at P90–P94. (f) Statements recorded from Hu Zhiquan (“Hu”) and Jiang Hong (“Jiang”), representatives of SLT, by Shanghai Zhabei District People’s Procuratorate (“SLT Statements”).21Foot Note 21×GD at [43(b)] (ROP at p 5066); ROP at P95–P98.",
        "The Defence": "18 The Defence contended that the DJ had no jurisdiction to try the PCA Charges in so far as Henry’s acts of abetment as well as Judy’s receipt of the moneys subject of the PCA Charges occurred outside Singapore. It followed that the sum subject of the CDSA Charge was not “benefits of criminal conduct” within the meaning of s 44(1)(a) of the CDSA and the CDSA Charge was similarly not made out.22Foot Note 22×Defendant’s Closing Submissions for Trial (“DCST”) dated 26 May 2020 at para 140 (ROP at p 8884). 19 Additionally, the Defence submitted that: (a) P38 was involuntarily provided and recorded under oppressive circumstances; (b) the affidavits of Joseph and Feili’s employee, Chen Ming-Chieh Simon (“Simon”) – two persons who did not testify at the trial – ought to be admitted under s 32(1)(j) of the EA; and (c) the documents the Prosecution obtained pursuant to a request made under the MACMA, namely the BOC Statements and the SLT Statements, were inadmissible as they had not been authenticated under ss 8(3) and 42(3) of the MACMA or alternatively, should be excluded under s 32(3) of the EA.23Foot Note 23×GD at [44], [50], [64] (ROP at pp 5066–5067, 5072–5073, 5077–5079). 20  Once the evidential matrix was properly ascertained, the Defence submitted that the information Henry conveyed to Judy could not be said to be confidential. Likewise, there was no conspiracy between Henry and Judy to corruptly receive gratification from SLT and Feili; any moneys SLT and Feili paid to Joseph’s BOC Account constituted remuneration for Twin Palms referring businesses to SLT and Feili. Thus, the sum subject of the CDSA Charge was not bribe moneys nor Judy’s benefits from her criminal conduct. Rather, they stemmed from the monthly salary Judy received from Twin Palms and her own savings. 21 In support of the aforesaid, the Defence,inter alia, pointed to the fact that Henry and Judy discussed their plans to set up a company providing trucking services in China in the Emails before the 2006 Tender was first mooted in August 2006, Henry did not have the authority to unilaterally determine the award of the 2006 and 2009 Tenders, and the moneys paid into Joseph’s BOC Account did not correspond to 10% of the value of services SLT and Feili provided Seagate.24Foot Note 24×GD at [106], [130] (ROP at pp 5098–5099, 5112–5113). 22 The Defence further sought to rely on Henry and Judy’s cautioned statements recorded under s 23 of the 2012 CPC. Two cautioned statements were recorded from Henry on 27 June 2017 at 10.30am (“D12”) and 12.10pm (“D13”) respectively. Similarly, Judy provided two cautioned statements on 27 June 2017 at 10.53am (“D18”) and 12.07pm (“D19”).25Foot Note 25×GD at [74] (ROP at pp 5082–5083).",
        "The DJ’s decision": "23 The DJ’s full grounds of decision are set out inPublic Prosecutorv Teo Chu Ha @ Henry Teo and another[2021] SGDC 196. Conviction 24 Preliminarily, the DJ held that the District Court had jurisdiction to try the PCA and CDSA Charges. Henry sent confidential information belonging to Seagate to Judy and withdrew the moneys subject of the CDSA Charge while he was in Singapore. Even if Henry had performed these acts outside Singapore, s 37(1) of the PCA provided that the provisions of the PCA had extra-territorial application over Singaporean citizens.26Foot Note 26×GD at [14]–[17] (ROP at pp 5058–5059).In this vein, there was no basis to interpret s 37(1) of the PCA as a provision conditioned by s 108B of the Penal Code, such that any conduct abetted must be committed in Singapore. There is nothing in the PCA that suggested s 37(1) of the PCA should be so interpreted and the Defence’s proposed interpretation would neuter the legislative intent animating s 37(1) of the PCA.27Foot Note 27×GD at [18] (ROP at p 5059). 25 The DJ next found that Henry provided P38 voluntarily without any threat, inducement or promise and in the absence of oppressive circumstances. In so far as neither Henry nor Judy challenged this finding on appeal, it suffices to note that the DJ placed emphasis on the fact that Henry did not raise any complaints during the recording of the statement, made a significant number of amendments that were inconsistent with his claim to have been unable to concentrate while providing the statement, lied in asserting that Sathiabalan s/o M Veerapillai (“Sathia”) acted aggressively towards him during the recording of P38 given that Sathia was not even present during this time, and chose not to make any amendments to the statement when he was accorded the opportunity to do so the following day.28Foot Note 28×GD at [45] (ROP at pp 5067–5070). 26 In relation to the BOC Statements, the DJ held that they were admissible under s 8(3) of the MACMA read with s 32(1)(b)(iv) of the EA. These documents were obtainedviaa formal inter-State request made under the MACMA, were duly authenticated and formed part of the records of a business that was kept by the BOC. Whilst the BOC Statements disclosed both missing and illegible pages, this did not justify exclusion under s 32(3) of the EA. At best, the missing and unreadable pages affected the evidential weight to be placed on the documents.29Foot Note 29×GD at [52]–[59] (ROP at pp 5073–5076). 27 The DJ likewise found that the SLT Statements were admissible under s 8(3) of the MLA read with s 32(1)(j)(iii) of the EA. He accepted that Hu and Jiang were outside Singapore and officers from the Corrupt Practices Investigation Bureau (“CPIB”) had taken all reasonable steps to procure their attendance at trial. Pertinently, CPIB officers had sought the assistance of the Chinese authorities to contact Hu and Jiang and also attempted to directly contact Hu and Jiangviaphone and email to no avail.30Foot Note 30×GD at [60]–[67] (ROP at pp 5076–5080). 28 Relatedly, the DJ held that Joseph’s affidavit was admissible under s 32(1)(j)(iii), but not ss 32(1)(j)(i) or 32(1)(j)(iv) of the EA. He found that Joseph was outside Singapore and the Defence had shown it had taken all reasonable steps to persuade Joseph to attend the trial. These included Judy and the Defence counsel’s attempts to contact Josephviaphone and email respectively. In the latter regard, Ong had replied to these emails and indicated that he was unable to testify at the trial.31Foot Note 31×GD at [76]–[82] (ROP at pp 5083–5086).Nothing in this appeal turns on the DJ’s finding that Joseph’s affidavit was inadmissible under ss 32(1)(j)(i) or 32(1)(j)(iv) of the EA. 29 Contrastingly, the DJ declined to admit Simon’s affidavit into evidence under ss 32(1)(j)(iii) and 32(1)(j)(iv) of the EA. Whilst Simon was outside Singapore, the Defence had failed to demonstrate that it was not practicable to secure his attendance at the trial. Judy had never informed Simon of the trial dates nor served him a subpoena. The Defence had also failed to prove that Simon was a competent but non-compellable witness within the meaning of s 32(1)(j)(iv) of the EA. In any event, the DJ considered that Simon deliberately avoided coming to Singapore and would have excluded his affidavit under s 32(3) of the EA.32Foot Note 32×GD at [83]–[85] (ROP at pp 5086–5088). 30 Turning to the PCA Charges, the DJ identified the following factual and legal issues for his determination:33Foot Note 33×GD at [86] (ROP at pp 5088–5089). (a) Whether there was a conspiracy between Henry and Judy for Judy to corruptly receive gratification from SLT and Feili. (b) Whether the information Henry sent to Judy constituted confidential information. (c) Whether Judy provided SLT and Feili with confidential information. (d) Whether the moneys SLT and Feili paid to Joseph’s BOC Account were for legitimate business services rendered by Twin Palms. (e) Whether Judy received gratification as a reward for assisting SLT and Feili secure the 2006 and 2009 Tender Contracts through the provision of confidential information. (f) Whether the elements of the PCA Charges, including whether there was an objectively corrupt element and guilty knowledge, were established. 31 He found that the Prosecution had proved all the elements of the PCA Charges beyond a reasonable doubt and convicted Henry and Judy on the PCA Charges: (a) To begin, the conspiracy between Henry and Judy for Judy to corruptly receive gratification from SLT and Feili was supported by the Emails, P38, P47 and P48. The Emails evinced that Henry and Judy initially planned to set up a company to obtain business from Seagate (and for Judy to represent and conceal Henry’s interest in the company) but later discussed using an existing company and a General Sales Agent to obtain commissions for any business deals between Seagate and third parties they successfully facilitated. As for P38, P47 and P48, these illustrated,inter alia, that Henry suggested to Judy that they should enter a General Sales Agreement (“GSA”) with SLT and Feili to ensure that Henry and Judy would receive 10% of the value of contracts SLT and Feili successfully entered into with Seagate.34Foot Note 34×GD at [99]–[106] (ROP at pp 5093–5099). (b) The information Henry sent to Judy, which included the prices Seagate paid its suppliers for various trucking routes, constituted confidential information. This was supported by the testimony of Seagate’s employees and the Emails in which Henry informed Judy that it was imperative for her to keep said information confidential.35Foot Note 35×GD at [107]–[114] (ROP at pp 5099–5104). (c) That Judy in turn conveyed the confidential information to SLT and Feili was evinced by emails Judy sent to Simon and Joseph, her admissions in P101 and the fact that the information SLT and Feili eventually submitted to Seagate in connection with the 2006 and 2009 Tenders mirrored the information Henry provided to Judy.36Foot Note 36×GD at [115]–[116] (ROP at pp 5104–5107). (d)  Whilst Henry and Judy contended that the moneys subject of the Charges were for legitimate business services rendered by Twin Palms, this flew in the face of emails illustrating that Henry and Judy intended for Twin Palms to be a mere conduit in their corrupt scheme, Henry’s admission in P38 that he had to use proxies to prevent SLT, Feili and Seagate from discovering that he was helping SLT and Feili clinch trucking contracts with Seagate behind the scenes, and that the Defence provided no explanation for why Henry drafted the GSA between Twin Palms and Feili or why the moneys were paid into Joseph’s BOC Account.37Foot Note 37×GD at [118]–[128] (ROP at pp 5107–5112).The DJ thus found that SLT and Feili paid the moneys subject of the Charges in consideration of the confidential information Judy provided them. (e) Going one step further, the DJ was satisfied that the moneys SLT and Feili paid into Joseph’s BOC Account were in substance paid to Judy (in contradistinction to Joseph and Twin Palms). Notably, Hu and Jiang both stated that the commissions were paid to Judy and Judy herself admitted that she had control over Joseph’s BOC Account and could withdraw the moneys within as she desired.38Foot Note 38×GD at [129] (ROP at p 5112). (f) It followed that the moneys paid to JudyviaJoseph’s BOC Account was Judy’s reward for assisting SLT and Feili successfully secure the 2006 and 2009 Tender Contracts. Judy herself acknowledged thequid pro quonature of the arrangement in P100.39Foot Note 39×GD at [132]–[134] (ROP at pp 5113–5114). (g) Considering Henry and Judy’s intentions underlying their receipt of the moneys from SLT and Feili, the transactions were tainted with an objectively corrupt element.40Foot Note 40×GD at [135]–[147] (ROP at pp 5114–5118).Indeed, given that both individuals knew that it was wrong for Henry to disclose Seagate’s confidential information to Judy to assist SLT and Feili secure the 2006 and 2009 Tender Contracts and thus went to great lengths to conceal Henry’s involvement in Judy’s dealings with SLT and Feili, Henry and Judy knew that what they did was corrupt by ordinary and objective standards.41Foot Note 41×GD at [148]–[150] (ROP at pp 5118–5119). 32 With regard to the CDSA Charge, this necessitated consideration of the following issues:42Foot Note 42×GD at [87] (ROP at pp 5089–5090). (a) Whether the scope of ss 44(1)(a) and 44(5)(a) of the CDSA is limited to secondary offenders and whether Henry and Judy constitute primary or secondary offenders. (b) Whether Henry and Judy conspired for Judy to corruptly receive gratification for herself. (c) Whether the moneys Henry withdrew from Judy’s BOC Account represented benefits of criminal conduct. (d) Whether Henry and Judy knew that Judy was a person who engaged in criminal conduct and that their arrangement would facilitate the control of Judy’s benefits of criminal conduct. 33 The DJ was similarly satisfied that the Prosecution had proved all the elements of the CDSA Charge beyond a reasonable doubt: (a) He rejected the Defence’s contention that the logic ofYap Chen Hsiang Osborn v Public Prosecutor[2019] 2 SLR 319 (“Osborn Yap”) – namely that s 47(1) of the CDSA did not cover a secondary offender who does not himself commit the offence from which the proceeds were originally derived but launders the proceeds of another person’s crime – applied with equal force to s 44 of the CDSA such that the latter provision only governed secondary offenders. In the DJ’s view, s 44(1)(a) of the CDSA “contemplates an arrangement between a primary offender and a secondary offender”. Given that the gratifications were received by Judy, Judy was a primary offender and Henry was a secondary offender in respect of the CDSA Charge.43Foot Note 43×GD at [153]–[154] (ROP at pp 5119–5120). (b) Henry and Judy conspired to be in an arrangement which facilitated the control of Judy’s benefits of criminal conduct on behalf of Judy. Notably, the PCA Charges against Judy had been proven beyond a reasonable doubt.44Foot Note 44×GD at [155] (ROP at pp 5120–5121). (c) The moneys Henry withdrew from Judy’s BOC Account represented benefits of criminal conduct. In P100, Judy admitted that she would transfer the moneys SLT and Feili deposited into Joseph’s BOC Account to Judy’s BOC Account. Whilst she claimed that some of the moneys which Henry withdrew from Judy’s BOC Account did not stem from SLT or Feili, she conceded that this sum of moneys “should not be very huge”.45Foot Note 45×GD at [156]–[158] (ROP at pp 5121–5122). (d) Finally, Henry and Judy knew that Judy was a person who engaged in criminal conduct and their arrangement would facilitate the control of Judy’s benefits of criminal conduct. Henry and Judy conspired for Judy to corruptly receive gratification from SLT and Feili and did not dispute that the purpose of Henry withdrawing the moneys from Judy’s BOC Account was to purchase the Property.46Foot Note 46×GD at [159]–[161] (ROP at pp 5122–5123). Sentence 34 Beginning with the PCA Charges, the DJ found that six aggravating factors common to both Henry and Judy were disclosed on the facts, namely, that parties: (a) received a significant amount of gratification (see [11] above); (b) engaged in a long period of offending; (c) exhibited a high degree of planning and premeditation; (d) committed transnational offences; (e) seriously undermined Seagate’s procurement process; and (f) committed the offences for personal gain.47Foot Note 47×GD at [202]–[211] (ROP at pp 5140–5143). 35 He considered that there were two additional aggravating factors unique to Henry. Henry had recent antecedents for offences under s 6(a) of the PCA and abused his position as Senior Director of Logistics and member of the 2006 and 2009 Tender Committees to obtain and disclose confidential information belonging to Seagate.48Foot Note 48×GD at [165], [212] (ROP at pp 5124, 5143).Thus, he found that Henry ought to receive a higher sentence.49Foot Note 49×GD at [215] (ROP at p 5144). 36 While the Defence submitted that the delay in prosecuting Henry and Judy and the advanced ages of the accused persons militated in favour of a non-custodial or a short custodial sentence, the DJ held that this was, at best, a mitigating factor. The Prosecution had demonstrated how investigations against Henry and Judy, which involved the Mutual Legal Assistance process, were ongoing since 2010.50Foot Note 50×GD at [213]–[214], [218] (ROP at pp 5143–5144, 5147). 37 That said, the DJ declined to follow the Prosecution’s proposed sentencing bands,viz, imprisonment terms of one to four months, five to seven months, ten to 12 months and upwards of 12 months for gratification amounts of less than S$10,000, between S$10,000 and S$30,000, between S$50,000 and S$80,000 and above S$90,000 respectively.51Foot Note 51×GD at [179] (ROP at p 5131).The Prosecution did not account for the gaps (for bribes between S$30,000 and S$50,000 and between S$80,000 and S$90,000) in its proposed sentencing bands and did not provide reasons for departing from these sentencing bands in calibrating the appropriate sentence to be imposed on Henry and Judy.52Foot Note 52×GD at [217] (ROP at p 5146). 38 Having regard to the amount of gratification received, the DJ considered that the sentencing ranges for the PCA Charges should be as follows:53Foot Note 53×GD at [220] (ROP at pp 5148–5149). Amount of gratification (S$)Indicative sentence (imprisonment terms in months)Up to and including $5,0001$5,001 to $15,0002$15,001 to $25,0003$25,001 to $38,0004$38,001 to $52,0005$52,001 to $66,0006$66,001 to $80,0007$80,001 to $95,0008$95,001 to $110,0009$110,001 to $125,00010 39 Further accounting for the aforesaid aggravating and mitigating factors, and the sentencing precedents, the DJ imposed sentences of between one and ten months’ imprisonment on Henry and Judy in respect of the PCA Charges. A breakdown of these sentences is set out at Annex B. 40 With regard to the CDSA Charge, the DJ considered that the sentencing framework for offences under s 44(1)(a) of the CDSA involving the laundering of cash proceeds of offences committed in Singapore set out inHuang Ying-Chun v Public Prosecutor[2019] 3 SLR 606 (“Huang Ying-Chun”) was equally applicable to the present case.54Foot Note 54×GD at [222] (ROP at pp 5149–5150).As the present case involved a significant sum of S$703,480, a transnational element, a serious predicate offence of corruption, accused persons who had actual knowledge of the predicate offences and the CDSA offence was committed over a year, the DJ considered that the CDSA offence involved moderate harm and low to medium culpability, with an indicative sentence of between ten and 60 months’ imprisonment and a starting point of 25 months’ imprisonment. Again, accounting for the delay in prosecution and the advanced ages of the accused persons, he imposed a sentence of 18 months’ imprisonment in respect of the CDSA Charge on Henry and Judy.55Foot Note 55×GD at [223]–[225] (ROP at pp 5150–5151). 41 The DJ ordered the sentences for five PCA Charges and the CDSA Charge to run consecutively in respect of Henry and the sentences for four PCA Charges and the CDSA Charge to run consecutively in respect of Judy, resulting in aggregate imprisonment terms of 50 and 41 months respectively.56Foot Note 56×GD at [226]–[232] (ROP at pp 5151–5153). 42 Finally, he ordered Judy to pay the Penalty of $2,320,864.10 under s 13(1) of the PCA, in default of which Judy was to serve an imprisonment term of 18 months.57Foot Note 57×GD at [234], [237] (ROP at p 5154–5155).That said, in his written grounds of decision, the DJ stated that that this amount should be RMB11,369,025.44 or S$2,324,954.45.58Foot Note 58×GD at [240] (ROP at p 5155).The DJ declined to impose an attachment order to enforce the Penalty. He took the view that the default imprisonment term sufficiently ensured that Judy did not benefit from her corrupt behaviour and the imposition of an attachment order risked unduly protracting proceedings.59Foot Note 59×GD at [236] (ROP at p 5154).",
        "Issues to be determined on appeal": "43 Parties raise a litany of issues on appeal. These can be distilled into the following: (a) Whether the DJ had jurisdiction to try the PCA and CDSA Charges. (b) Whether the Charges were legally defective. Subsumed within this inquiry is whether the Prosecution provided sufficient particulars to the appellants in the PCA Charges and whether the appellants fell within the legal ambit of the CDSA Charge. (c) Whether the DJ’s decision to convict Henry and Judy on the PCA Charges is against the weight of the evidence. This necessitates consideration of,inter alia, whether the DJ erred in admitting the BOC Statements into evidence. (d) Whether the DJ’s decision to convict Henry and Judy on the CDSA Charge is against the weight of the evidence. (e) Whether the sentences imposed by the DJ in respect of the CDSA and PCA Charges are manifestly inadequate or manifestly excessive. (f) Whether the DJ erred in refusing to enforce the Penalty by way of an attachment order, and whether the default sentence imposed by the DJ in respect of the Penalty is manifestly inadequate. (g) Whether the Prosecution should be allowed to adduce additional evidence of Judy’s assets on appeal for the purpose of justifying the imposition of an attachment order. 44 I set out the parties’ submissions where appropriate and deal with each issue in turn, bearing in mind that the appellate court is not to reassess the evidence as the trial judge would, but is, in an appeal against conviction, restricted to considering whether: (a) the judge’s assessment of witness credibility is plainly wrong or against the weight of evidence; (b) the judge’s verdict is wrong in law and therefore unreasonable; and (c) the judge’s decision is inconsistent with the material objective evidence on record (Pram Nair v Public Prosecutor[2017] 2 SLR 1015 at [55]). 45 Similarly, in an appeal against sentence, an appellate court will be slow to disturb a sentence imposed except where it is satisfied that: (a) the trial judge erred with respect to the proper factual basis for sentencing; (b) the trial judge failed to appreciate the material before him; (c) the sentence was wrong in principle; or (d) the sentence was manifestly excessive or manifestly inadequate (Public Prosecutor v UI[2008] 4 SLR(R) 500 at [12]).",
        "Whether the DJ had jurisdiction to try the PCA and CDSA Charges": "46 I begin with the question of whether the DJ had jurisdiction to try Henry and Judy, who are both Singaporean citizens, on the PCA and CDSA Charges. 47 The thrust of the appellants’ submission is that s 37(1) of the PCA has to be read in conjunction with, and subject to, ss 108A and 108B of the Penal Code such that the court has no jurisdiction over an individual who abets “from outside Singapore, principal conduct that also took place outside Singapore”.60Foot Note 60×AS at para 431.4.For ease of reference, I set out the relevant provisions below: Liability of citizens of Singapore for offences committed outside Singapore 37.—(1) The provisions of this Act have effect, in relation to citizens of Singapore, outside as well as within Singapore; and where an offence under this Act is committed by a citizen of Singapore in any place outside Singapore, he may be dealt with in respect of that offence as if it had been committed within Singapore. Abetment in Singapore of an offence outside Singapore 108A.A person abets an offence within the meaning of this Code who, in Singapore, abets the commission of any act without and beyond Singapore which would constitute an offence if committed in Singapore. Abetment outside Singapore of an offence in Singapore 108B.A person abets an offence within the meaning of this Code who abets an offence committed in Singapore notwithstanding that any of all of the acts constituting the abetment were done outside Singapore. 48 I am unable to accept this submission. First of all, there is no evidence that Henry and Judy conceived the conspiracy subject of the PCA Charges entirely outside Singapore. This is essentially the end of the matter as, even on the appellants’ case, the court has jurisdiction over an individual who abets in Singapore, an offence under the PCA committed outside Singapore. Nevertheless, I briefly explain why I consider there to be no basis to interpret s 37(1) of the PCA as a provision constrained by ss 108A and 108B of the Penal Code. 49 It is not disputed that s 29 of the PCA deems a person who abets, within the meaning of the Penal Code, the commission of an offence under the PCA, to have committed the offence. Section 107 of the Penal Code in turn defines the acts (or omissions) that constitute an abetment and should be read with ss 108A and 108B of the Penal Code which provide that a person abets an offence within the meaning of the Penal Code where he abets, in Singapore, an offence outside Singapore or, outside Singapore, an offence in Singapore. The justification for ss 108A and 108B of the Penal Code – which carve out specific exceptions to Singapore’s strict territorial approach for the exercise of criminal jurisdiction – is clear. These provisions seek to address the internationalisation of crime and the enforcement lacuna that arises when one excludes jurisdiction on the basis that criminal acts occurred partly outside Singapore (seeWong Yuh Lan v Public Prosecutor and other matters[2012] 4 SLR 845 at [24]–[25];Singapore Parliamentary Debates,Official Report(22 October 2007) vol 83 at col 2184). 50 But the above did not therefore mean that Parliament could not or did not go further in providing for extra-territorial jurisdiction under the PCA where acts of abetment and the predicate offence both occur outside Singapore. On the contrary, the plain language of s 37(1) of the PCA, when read in context of the legislative purpose of the statute, points to Parliament intending to do soviathe provision. As explained by the Court of Appeal inPublic Prosecutor v Taw Cheng Kong[1998] 2 SLR(R) 489 (“Taw Cheng Kong”), “the language of s 37(1) of the PCA is very wide, and the section is capable of capturing all corrupt acts by Singapore citizens outside Singapore, irrespective of whether such corrupt acts have consequences within the borders of Singapore or not” (at [64]). This “all-encompassing ambit” of s 37(1) of the PCA furthers the legislative object of the PCA, namely, the control and suppression of corruption, including extra-territorial corruption (seeTaw Cheng Kongat [63] and [75];Tan Seng Kee v Attorney-General and other appeals[2022] 1 SLR 1347 at [323]). 51 In relation to the CDSA Charge, Henry depositing the moneys into his bank accounts in Singapore pursuant to the appellants’ conspiracy that are the subject of the charges provides sufficient basis for the court to exercise jurisdiction over the appellants. Though the following issue is academic in light of this finding, I state, for completeness, that I do not accept the appellants’ contention that the court’s jurisdiction to try them on the CDSA Charge stands and falls with its jurisdiction to try the PCA Charges.61Foot Note 61×AS at para 432.Even assuming that the court lacked jurisdiction to try the PCA Charges, it enjoyed jurisdiction over the appellants in respect of the CDSA Charge. Criminal conduct for the purpose of s 44(1)(a) of the CDSA extends to doing or being concerned in any act constituting a foreign serious offence.",
        "Whether the Charges were legally defective": "52 The appellants next contend that the PCA Charges and the CDSA Charge are legally defective, albeit for different reasons.",
        "Whether the PCA Charges disclosed sufficient particulars": "53 The PCA Charges are purportedly defective because it is unclear which of Seagate’s corporate entities employed Henry and whether the information Henry obtained originated from Seagate Singapore International Pte Ltd or Seagate’s entities in Suzhou (“Seagate Suzhou”) or Wuxi (“Seagate Wuxi”).62Foot Note 62×AS at paras 8–23.Further, the PCA Charges erroneously state that SLT and Feili entered the 2006 and 2009 Contracts with Seagate when the counterparties to the contracts were Seagate Suzhou and Seagate Wuxi.63Foot Note 63×AS at para 40. 54 It is a fundamental principle of criminal law that an accused person must know what he is charged with (Viswanathan Ramachandran v Public Prosecutor[2003] 3 SLR(R) 435 at [24]). The charge must contain details of the time and place of the alleged offence and the person, if any, against whom or the thing, if any, in respect of which it was committed, as are reasonably sufficient to give the accused notice of what he is charged with (see s 159(1) of the 1985 CPC; s 124(1) of the 2012 CPC;Public Prosecutor v BZT[2022] SGHC 91 at [229]). 55 I reproduce one of the PCA Charges for illustrative purposes:64Foot Note 64×ROP at p 33. 1st CHARGE (AMENDED) You, TEO CHU HA @ HENRY TEO … are charged that you, sometime in 2006, in Singapore or elsewhere, did abet the commission of an offence under section 5(a)(i) of the Prevention of Corruption Act, Chapter 241 by engaging in a conspiracy with one Judy Teo Suya Bik (“Judy”), for Judy to corruptly receive for herself gratification from Shanghai Long-Distance Transportation Co. (“SLT”), as a reward for assisting SLT in securing Logistics Provider contracts with Maxtor Technology (Suzhou) Co Ltd (“Maxtor”) and Seagate Technology International (“Seagate”), namely, the Maxtor/SLT Logistics Services Provider Agreement dated 1 December 2006 and the Seagate/SLT Logistics Services Provider Agreement dated 1 December 2006 (“contracts”), and in pursuance of such conspiracy, and in order to the doing of that thing, an act took place,to wit, you provided Judy confidential information obtained by virtue of your position as Senior Director of Logistics at Seagate, and the act abetted was committed,to wit, Judy corruptly received gratification of CNY 17,128.00 on about 6 April 2007 in Bank of China Account No. … from SLT as a reward for assisting SLT in securing the contracts by providing such confidential information to SLT, and you have thereby committed an offence under section 5(a)(i) read with section 29(a) of the Prevention of Corruption Act Chapter 241. 56 Read carefully, I do not consider the PCA Charges to be legally defective. The PCA Charges clearly aver that Henry provided Judy confidential information he obtained by virtue of his position as a Senior Director of Logistics of Seagate, in contradistinction to Seagate Suzhou or Seagate Wuxi. There is, in fact, no mention of the latter two entities in any of the PCA Charges. 57 Next, whether the information Henry conveyed to Judy was the property of or originated from Seagate, Seagate Suzhou or Seagate Wuxi is immaterial and need not have been specified in the PCA Charges. Bearing in mind the elements of an offence under s 5(a)(i) read with s 29(a) of the PCA (see [93]–[95] below), and that a charge should apprise an accused person of the case he has to meet, what is important, and intimated by the PCA Charges, is that Henry provided confidential information in Seagate’s possession to Judy, Judy then conveyed this information to SLT or Feili, and the information assisted SLT or Feili in securing the 2006 or 2009 Tender Contracts. This is also given Seagate’s position that confidential information encompasses information provided by third parties, so long as it was given to Seagate in confidence.65Foot Note 65×ROP at p 1853.As I go on to explain, Henry and Judy themselves regarded such information to be confidential (see [106] and [115] below). 58 Finally, I disagree with the appellants that the PCA Charges incorrectly stated that the counterparty to the 2006 and 2009 Contracts was Seagate, when the contracting parties are, in fact, Seagate Suzhou or Seagate Wuxi. The documentary evidence shows that Seagate is the contractual party to the 2006 and 2009 Tender Contracts.66Foot Note 66×P14 (ROP at p 5272); P16 (ROP at p 5312); P18 (ROP at p 5342); P20 (ROP at p 5344); P23 (ROP at p 5378); P24 (ROP at p 5393).",
        "Whether the appellants fall within the legal ambit of the CDSA Charge": "59 As for the CDSA Charge, the appellants submit that the CDSA Charge is not made out as a matter of law because s 44(1)(a) of the CDSA can only meaningfully apply to secondary offenders (ie, persons who do not commit the offence from which the proceeds were originally derived but launder the proceeds of another person’s crime). However, Henry and Judy were both primary offenders or persons who laundered the benefits of their own criminal conduct. This is purportedly supported by the decision inOsborn Yapand the fact that s 44(1)(a) of the CDSA discloses the samemensrea– knowing or having reasonable grounds to believe – as s 47(1) of the CDSA.67Foot Note 67×AS at paras 407–420. 60 On the other hand, the Prosecution submits that there “should be no restrictions as to whether s 44 [of the] CDSA applies only to primary or secondary offenders”. It points to the structure and language of s 44 of the CDSA. Section 44 of the CDSA does not set out “separate provisions for offenders who launder their own benefits of criminal conduct and those who launder another person’s benefits” and is “worded very differently from s 47” of the CDSA.68Foot Note 68×PS at paras 158–165. 61 The purposive interpretation of a legislative provision involves three steps (Tan Cheng Bock v Attorney-General[2017] 2 SLR 850 (“Tan ChengBock”) at [37]–[53]): (a) First, the court should ascertain possible interpretations of the provision, having regard to the text of the provision as well as the context of the provision within the written law as a whole. This is done by determining the ordinary meaning of the words and could be aided by rules and canons of statutory construction. (b) Second, the court should ascertain the legislative purpose of the statute. Legislative purpose should ordinarily be gleaned from the text itself. Extraneous material may be considered in the situations set out under s 9A(2) of the Interpretation Act 1965 (2020 Rev Ed). (c) Third, the court should compare the possible interpretations of the text against the purpose of the statute. An interpretation which furthered the purpose of the written text was to be preferred to one which did not. 62 Applying these principles, I hold that where individual B’s benefits of criminal conduct are at issue, and individuals A and B enter into an arrangement that goes towards the purpose(s) set out in either s 44(1)(a) or s 44(1)(b) of the CDSA, s 44(1) of the CDSA can only apply to individual A (and not individual B). That said, in so far as the CDSA Charges proffered against Henry and Judy are read with s 109 of the Penal Code,ie, they aver that Henry and Judy conspired for Henry to assist Judy to retain her benefits from criminal conduct, they are legally unobjectionable. 63 I reproduce s 44(1) of the CDSA below: Assisting another to retain benefits from criminal conduct 44.––(1) Subject to subsection (3), a person who enters into or is otherwise concerned in an arrangement, knowing or having reasonable grounds to believe that, by the arrangement –– (a) the retention or control by or on behalf of another (referred to in this section as that other person) of that other person’s benefits of criminal conduct is facilitated (whether by concealment, removal from jurisdiction, transfer to nominees or otherwise); or (b) that other person’s benefits from criminal conduct –– (i) are used to secure funds that are placed at that other person’s disposal, directly or indirectly; or (ii) are used for that other person’s benefits to acquire property by way of investment or otherwise, and knowing or having reasonable grounds to believe that that other person is a person who engages in or has engaged in criminal conduct or has benefited from criminal conduct shall be guilty of an offence. 64 The text of the provision is significant. To begin, the header of s 44(1) of the CDSA,viz, “[a]ssisting another to retain benefits from criminal conduct” intimates that the provision proscribes conduct on the part of individual A which is facilitative of individual B retaining benefits from criminal conduct attributable to individual B. In particular, the word “retain” implies that the benefits from criminal conduct subject of the charge are ascribable to individual B at the point individual A enters into or is otherwise concerned in the arrangement. Consistent with this, ss 44(1)(a) and 44(1)(b) both explicitly link the benefits of criminal conduct to individual B by referring to these benefits as “that other person’s”. In the scenario posited at [62] above, it would do violence to the language of the statute if individual B were charged under s 44(1) of the CDSA; the “benefits of criminal conduct” cannot be meaningfully said to be individual A’s since individual A is wholly uninvolved in the genesis of and may never obtain any portion of these benefits. 65 I also consider it significant that themensreaof an offence under s 44(1) of the CDSA is not limited to actual knowledge but extends to having reasonable grounds to believe. In other words, it suffices, in respect of an offence under s 44 of the CDSA, for the Prosecution to prove that individual A has reasonable grounds to believe that the moneys he was dealing with were the benefits of criminal conduct, that the arrangement would facilitate the retention and control of such benefits of criminal conduct and that individual B had engaged in criminal conduct or benefited from it (seeAng Jeanette v Public Prosecutor[2011] 4 SLR 1 (“Ang Jeanette”) at [72]). Thismensrearequirement makes sense only if a charge under s 44(1) of the CDSA is brought against someone other than individual B. This is given that individual B, who engaged in the relevant criminal conduct, would invariably know that the moneys were the benefits of criminal conduct and that he had engaged in or benefited from criminal conduct. 66 It could be argued that the gradation ofmensreaallows for charges under s 44(1) of the CDSA to be brought against both individuals A and B, but, where individual B is concerned, a charge would invariably rely on the knowledge limb. However, this interpretation is rendered untenable by the plain language of the provision, as discussed at [64] above. Such an interpretation also sits uncomfortably with the language of the provision which suggests that the person who enters into or is otherwise concerned in the relevant arrangement would either knoworhave reasonable grounds to believe that the matters mentioned in the provision are satisfied. 67 The interpretation of s 44(1) of the CDSA I have set out at [62] above is consistent with and furthers the purposes of the CDSA, namely, “to deprive criminals of the ability to enjoy the fruit of their criminal conduct and to protect the good names of Singapore’s financial institutions and its status as a financial hub” (Osborn Yapat [40]). In so far as the net of criminal liability captures individual A, s 44(1)(a) of the CDSA promotes the statute’s purpose of “prevent[ing] ill-gotten gains from being laundered into other property so as to avoid detection” (seeWBL Corp Ltd v Lew Chee Fai Kevin and another appeal[2012] 2 SLR 978 at [31]). While it might be argued that construing s 44(1) of the CDSA in a manner which encompasses individual B might more effectively deprive criminals of the fruit of their criminal conduct, such an interpretation is not one the words of the provision can bear. Purposive interpretation is not a basis for rewriting a statute. Judicial interpretation must be done with a view toward determining the provision’s purpose and object as reflected by and in harmony with the express wording of the legislation (Tan Cheng Bockat [50]). Further, it must be remembered that s 44 of the CDSA is simply one provision under Part VI of the CDSA. There are other provisions, such as ss 46(1) and 47(1) of the CDSA, that the Prosecution can wield to effectively prosecute individual B. 68 The legislative history to the CDSA was comprehensively set out by V K Rajah JA inAng Jeanette.For present purposes, it suffices to note the following. The CDSA amalgamated the Drug Trafficking (Confiscation of Benefits) Act (Cap 84A, 1993 Rev Ed) (“1993 DTA”) and the Corruption (Confiscation of Benefits) Act (Cap 65A, 1990 Rev Ed). Section 44 of the CDSA can be traced to s 41(1)(a) of the 1993 DTA. Notably, whereas s 41(1)(a) of the 1993 DTA required an accused to know that he was facilitating another person’s retention or control of that person’s benefits of drug trafficking, s 44(1) of the CDSA allowed an accused to be convicted on the strength of evidence showing that he had “reasonable grounds to believe” that the proceeds were derived from drug trafficking or serious crimes. 69 Parliament specifically expanded themensreaunder s 44(1) of the CDSA to facilitate the prosecution of money laundering offences. As then Minister for Home Affairs, Mr Wong Kan Seng, observed during the Second Reading of the Drug Trafficking (Confiscation of Benefits) (Amendment) Bill (which was the precursor to the Act that introduced the CDSA), the introduction of the standard of reasonable grounds of belief “would facilitate enforcement because in practice, proof of actual knowledge is difficult to produce” (seeAng Jeanetteat [27]–[35];Singapore Parliamentary Debates, Official Reports(6 July 1999) vol 70 at col 1734). These remarks dovetail with my observations at [65] and confirm that s 44(1)(a) of the CDSA bears the meaning I have set out at [62] above. In my view, the introduction of “reasonable grounds to believe” as amensreain s 44(1)(a) of the CDSA to ameliorate enforcement difficulties made the most sense if the provision applies only to individual A. If the Prosecution is able to prove that the moneys subject of a charge under s 44(1)(a) of the CDSA stemmed from criminal conduct on individual B’s part, it would have no difficulty proving that individual B knew that the moneys were his benefits of criminal conduct and that he had engaged in criminal conduct or benefited from it. An offender who launders the benefits of his own criminal conduct must,exhypothesi, have actual knowledge of the nature of the property he or she is dealing with. 70 For completeness, I deal with the Prosecution’s contention that s 44(1) of the CDSA can meaningfully apply to individual B since this provision, unlike s 47 of the CDSA, does not distinguish between a primary and secondary offender. I am unable to accept this submission. The fact that s 44(1) of the CDSA does not explicitly distinguish between a primary and secondary offender (as defined inOsborn Yap) is, in and of itself, neutral. The Prosecution reads too much into what s 44(1) of the CDSA does not say when what the provision does say renders its proposed interpretation untenable. 71 I do not consider the English authorities cited by the Prosecution to be persuasive. The Prosecution relies onR vAnwoir[2009] 1 WLR 980 (“Anwoir”)andR v W(N)[2009] 1 WLR 965 (“R v W(N)”) – which both concerned s 328(1) of the Proceeds of Crime Act 2002 (c 29) (“UK POCA”) – to support its position that an individual who enters an arrangement to launder his own benefits of criminal conduct can be prosecuted under s 44(1) of the CDSA. 72 InAnwoir, Anwoir, McIntosh, Meghrabi and Elmoghrabi were tried on five counts of being a party to an arrangement regarding the acquisition, retention, use or control of criminal property by or on behalf of another person, contrary to s 328 of the UK POCA. The first count charged Anwoir, Meghrabi and McIntosh with an offence relating to the sum of £740,000 in cash paid into Meghrabi’s accounts for the benefit of McIntosh and his associates which were used for various property transactions. The Prosecution contends that in so far as “there is evidence that these mon[eys] came from drug dealings and VAT fraud and that McIntosh himself was convicted of drug offences”, and the English Court of Appeal upheld the convictions of the offenders on the first count, it implicitly recognised that both primary offenders (ie, McIntosh) and secondary offenders (ie, Anwoir and Meghrabi) may be prosecuted under s 328 of the UK POCA.69Foot Note 69×PS at paras 169–170.In a similar vein, whilst the English Court of Appeal acquitted the defendants on charges under s 328 of the UK POCA on the basis that the Prosecution failed to prove that the moneys stemmed from criminal conduct inR v W(N), the fact that one of the defendants (who was involved in the criminal conduct from which the proceeds stemmed) was charged with an offence under s 328 of the UK POCA showed that both primary and secondary offenders may be prosecuted under this provision.70Foot Note 70×PS at para 171. 73 NeitherAnwoirnorR v W(N)supports the Prosecution’s position. First, the weight ofR v W(N)is diminished by the fact that the defendants were eventually acquitted of the charges under s 328 of the UK POCA. I would be cautious of concluding that a primary offender may fall within the scope of s 328 of the UK POCA by virtue of the fact that he was charged with this offence. 74 More significantly, even if I assume in favour of the Prosecution that a primary offender may be prosecuted under s 328 of the UK POCA, the scope of this provision significantly differs from, and hence sheds limited light on the ambit of s 44(1) of the CDSA. 75 I set out s 328 of the UK POCA for context: 328 Arrangements (1) A person commits an offence if he enters into or becomes concerned in an arrangement which he knows or suspects facilitates (by whatever means) the acquisition, retention, use or control of criminal property by or on behalf of another person. 76 “[C]riminal property” for the purpose of s 328 of the UK POCA is not linked to a particular individual. Even if individual B had obtained the criminal property, there is nothing in the language of s 328 of the UK POCA which renders the prosecution of individual B inapt. To elaborate, under s 328 of the UK POCA, where individuals A and B enter an arrangement for individual A to use individual B’s criminal property to purchase property, individual B can still be said to have entered into an arrangement which facilitates individual A’s use of criminal property. Section 44(1)(a) of the CDSA, however, goes further than s 328 of the UK POCA in specifying that the arrangement facilitates the retention or control by or on behalfof another, of that other person’sbenefits of criminal conduct. The difference in the wording of s 328 of the UK POCA and s 44(1)(a) of the CDSA distinguishes the cases ofAnwoirandR v W(N). 77 Notwithstanding the above, I accept the Prosecution’s submission that where individuals A and B conspire for individual A to be concerned in an arrangement pursuant to which individual A would facilitate individual B’s control of his or her benefits of criminal conduct, both individuals may be charged with an offence under s 44(1)(a) of the CDSA read with s 109 of the Penal Code. 78 The appellants contend that this is legally impermissible since Parliament did not specifically criminalise the actions of individual Bvias 44(1) of the CDSA. They suggest that to read s 44(1) of the CDSA with an abetment provision would extend the provision “by circular means”.71Foot Note 71×AS at paras 417–420.I am unpersuaded by this submission. Section 109 of the Penal Code can be read with s 44(1) of the CDSA because s 40(2) of the Penal Code provides that the “offence” in s 109 (and other sections) “denotes a thing punishable under the [Penal Code] or under any other law for the time being in force” (seePublic Prosecutor v Choi Guo Hong Edward[2007] 1 SLR(R) 712 at [17]). Even though individual B may not be prosecuted under s 44(1) of the CDSA, there is no impediment to him or her being prosecuted under s 44(1) of the CDSA read with s 109 of the Penal Code because the nub of the charge is now different. Assuming that, as in the present case, the latter charge concerns an abetment by conspiracy, this charge now proscribes the agreement between individuals A and B for individual A to enter into or be otherwise concerned in an arrangement under which individual A would facilitate the retention or control of individual B’s benefits of criminal conduct. It hence stands apart from individual B’s role (if any) in the arrangement. To put it another way, that individual B may have some involvement in the arrangement does not detract from the distinct wrong he or she commits by way of the conspiracy. 79 Drawing the threads together, in so far as the CDSA Charge avers that Henry and Judy conspired for Henry to be concerned in an arrangement which facilitated the control of Judy’s benefits of criminal conduct amounting to S$703,480 and Henry withdrew moneys from Judy’s BOC Account in Singapore pursuant to the conspiracy, I find it to be legally unobjectionable.",
        "Whether the DJ’s decision to convict Henry and Judy on the PCA Charges was against the weight of the evidence": "80 I now deal with the propriety of the DJ’s decision to convict the appellants on the PCA Charges. This involves the determination of an evidentiary sub-issue, namely whether the DJ erred in admitting the BOC Statements into evidence.",
        "Whether the DJ erred in admitting the BOC Statements into evidence": "81 The appellants submit that the BOC Statements were impermissibly admitted into evidence for the following reasons. First, the BOC Statements are purportedly bankers’ books that fall within Part IV of the EA. The requirements set out in ss 172 and 173 of the EA which have to be met before bankers’ books may be admitted into evidence were, however, unsatisfied.72Foot Note 72×AS at paras 251–289.Second, the BOC Statements did not comply with ss 8(3) and 42(3) of the MACMA. Third, the BOC Statements were inadmissible under s 32(1)(b) of the EA because the Prosecution failed to call the persons who made the statement of relevant fact or the person who supplied the information forming the basis of the statement of relevant fact within the meaning of s 32(1)(b) of the EA as witnesses.73Foot Note 73×AS at paras 290–294, 304–318.Fourth, the BOC Statements ought to have been excluded under s 32(3) of the EA. They contained missing and illegible pages, were not properly authenticated and were unaccompanied by an explanation of how they were retrieved.74Foot Note 74×AS at paras 360–370, 390–393.Fifth, the Prosecution failed to comply with s 32(4) of the EA.75Foot Note 75×AS at paras 380–389. 82 I do not accept these contentions and deal with them in turn. To begin, the BOC Statements do not fall within the scope of Part IV of the EA for two reasons. One, not all the documents forming the BOC Statements constitute “ledgers, day books, cash books, account books and all other books used in the ordinary business” of a bank. “Bankers’ books” has a specific meaning. It is limited to transactional records concerning a customer. Documents that a bank may generate or obtain whether for its own purposes (such as checking on the creditworthiness of a customer) or for regulatory compliance (such as identification documents for an individual customer) do not, without more, form part of their transactional records (seeLa Dolce Vita Fine Dining Company Ltd v Zhang Lan and others[2022] SGHC 89 at [37]). Exhibit P90, which is a table of contents generated by the BOC to contextualise exhibits P91 to P94, is not a transactional record.76Foot Note 76×ROP at pp 5929–5930. 83 Two, under s 170 of the EA, “bank” means any company carrying on the business of bankersin Singaporeunder a licence granted under any law relating to banking. It is not disputed that the BOC Statements were produced by the Shanghai branch of the BOC.77Foot Note 77×ROP at p 5930.Indeed, before the DJ, counsel for the appellants, Mr Too Xing Ji, “fully concede[d]” that the BOC Statements were produced by a “foreign bank”. His position was that the court should introduce evidential safeguards akin to those set out in Part IV of the EA where a party sought to adduce documents from a foreign bank.78Foot Note 78×ROP at pp 2272–2273.On appeal, the appellants seek to show that the BOC carries on the business of bankers in Singapore. I do not accept this. None of the appellants’ claims pertaining to the corporate structure of the BOC are supported by evidence in the record of proceedings. The appellants seek in substance to adduce fresh evidence on appeal but have not taken out the necessary application to do so. 84 Next, the appellants submit that any evidence received by the Attorney-General pursuant to a request under ss 8(1) or 8(2) of the MACMA must be duly authenticated under s 42 of the MACMA. As this was not done, the BOC Statements ought to have been excluded from evidence.79Foot Note 79×AS at paras 336–359.On the other hand, the Prosecution contends that s 8(3) of the MACMA is not constrained by the authentication requirement set out in s 42(2). Rather, s 8(3) of the MACMA is a specific, standalone provision on the admissibility of evidence received pursuant to requests made under ss 8(1) or 8(2) of the MACMA.80Foot Note 80×PS at paras 62–65. 85 It is unnecessary for me to decide if ss 8 and 42 of the MACMA bear the relationship the Prosecution advances. Even assuming, in favour of the appellants, that evidence received pursuant to ss 8(1) or 8(2) of the MACMA is subject to the authentication requirement set out in s 42, exhibits P90 to P94 were duly authenticated. These documents were provided under cover of exhibit P50, which contains a seal and certification from the Ministry of Foreign Affairs of the People’s Republic of China (“PRC”), and a reference that the documents were obtained by the PRC authorities in response to Singapore’s request.81Foot Note 81×ROP at pp 5772–5773 (P50 and P50-T).In this connection, I also see no reason to doubt CPIB investigation officer Mr Bay Chun How’s testimony that he had received exhibit P50 from the PRC authoritiesviathe Attorney-General’s Chambers and pursuant to a request for mutual legal assistance made by the CPIB.82Foot Note 82×ROP at pp 1690–1692. 86 I do not accept the appellants’ further contention that the BOC Statements were not properly authenticated as the PRC authorities only affixed a seal on exhibit P50 and not on each of the BOC Statements.83Foot Note 83×AS at paras 339–359.There is nothing in the MACMA which suggests that a foreign official may not collectively authenticate a number of documents. This is also bearing in mind that the purpose of the MACMA is to facilitate the provision and obtaining of international assistance in criminal matters, and to enhance the legal arsenal available to fight transnational crime (seeBSD v Attorney-General and othermatters[2019] SGHC 118 at [4];Singapore Parliamentary Debates, Official Reports(22 February 2000) vol 71 at col 981). 87 The appellants then argue that the Prosecution’s failure to call the persons who produced the BOC Statements as witnesses demands its exclusion.84Foot Note 84×AS at paras 290–294, 304–318.With respect, this is misguided. It is not necessary to identify the particular individual(s) who made the statements in the BOC Statements for the purpose of s 32(1)(b) of the EA provided that the court is satisfied that the statement was made by “a” person “in the ordinary course of a trade, business, profession or other occupation” (EsbenFinance Ltd and others v Wong Hou-Lianq Neil[2021] 3 SLR 82 at [87]). Indeed, s 32(1)(b) of the EA was specifically amended to ameliorate the difficulties that accompanied the exclusion, from evidence, of business records compiled by a third-party record keeper using information supplied by a transactor (seeGimpexLtd v Unity Holdings Business Ltd and others and another appeal[2015] 2 SLR 686 (“Gimpex”) at [90]–[95]). 88 I deal with the appellants’ final two contentions in tandem. I do not find that the Prosecution failed to comply with s 32(4) of the EA, which provides that evidence may not be given under s 32(1) of the EA unless a party complies with the notice requirements prescribed under s 428 of the 2012 CPC. The relevant notice requirements are set out in the Criminal Procedure Code (Notice Requirements to Admit Hearsay Evidence) Regulations 2012 (“Regulations”). 89 It is not disputed that the Prosecution served the requisite notice on the Defence on 27 March 2019.85Foot Note 85×ROP at pp 6529–6531.Whilst the appellants contend that notice was only served on the same day the Prosecution sought to admit the BOC Statements,86Foot Note 86×AS at paras 380–389; ROP at pp 2296–2298.I do not consider this to be fatal. Section 32(4) of the EA and the Regulations do not prescribe a minimum period of notice, but merely that notice be provided before evidence is given, contain certain information and be presented in a certain form. Furthermore, ifnon-compliancewith the notice requirement in s 32(4) of the EA may be cured by the court (seeGimpexat [135]–[139]), then compliance (albeit at the last minute) with s 32(4) of the EA cannot,ipso facto, constitute grounds for excluding the BOC Statements. In my view, any allegation that notice was served shortly before evidence given should be assessed under the court’s discretionary jurisdiction to exclude hearsay evidence under s 32(3) of the EA. 90 In this regard, I see no reason to interfere with the DJ refusing to exercise his discretion to exclude the BOC Statements under s 32(3) of the EA. The appellants say that this was erroneous since the BOC Statements contained missing and illegible pages and the Prosecution did not explain how they were retrieved.87Foot Note 87×AS at paras 360–370, 390–393.I disagree. That the BOC Statements were incomplete did not therefore mean that its contents were inaccurate. On the contrary, the appellants do not dispute the accuracy of the BOC Statements. Judy relied on the BOC Statements to compile a separate document she claims shows that the moneys in Joseph’s BOC Account stemmed from legitimate sources.88Foot Note 88×ROP at pp 8749–8750.I note also that the information contained in the BOC Statements is internally and externally consistent. For instance, the entries in exhibits P93 (bank deposit slips), P94 (phone banking records) and P33 (email from Jeffrey Toh) match the information in exhibit P92.89Foot Note 89×ROP at pp 2391–2419, 5477–5481.In these circumstances, to exclude the BOC Statements because they are incomplete would be throwing the baby out with the bathwater. Additionally, the weight of the evidence shows that the BOC Statements were properly obtained. These statements were provided by the PRC authorities pursuant to a MACMA request (see [85] above). 91 Any prejudicial effect occasioned to the appellants by the admission of the BOC Statements was therefore limited. It did not outweigh the significant probative value of the BOC Statements. These statements established the quantum of moneys SLT and Feili paid to Joseph’s BOC Account. 92 In sum, I uphold the DJ’s decision to admit the BOC Statements into evidence.",
        "Whether the DJ’s finding that there was a conspiracy between Henry and Judy for Judy to corruptly receive gratification from SLT and Feili as a reward for Judy advancing the business interests of SLT and Feili vis-à-vis Seagate is against the weight of the evidence": "93 The four elements of an offence under s 5 of the PCA are: (a) the giving or receipt of gratification; (b) as an inducement (or reward) for any person doing (or forbearing to do) anything in respect of any matter; (c) there was an objective corrupt element in the transaction; and (d) the gratification was given or received with guilty knowledge (Abdul Aziz bin MohamedHanib v Public Prosecutor and other appeals[2022] SGHC 101 at [107]). 94 The first element,viz, the giving or receipt of the gratification is concerned with theactus reusof the offence and is complete even if the recipient has not yet had any opportunity to show favour to the giver in relation to the recipient’s affairs. The second element relates to the causal or consequential link between the gratification and the act the gratification was intended to procure (or reward) while the third pertains to whether that act was objectively dishonest in the entire transaction. These two elements are conceptually different but part of the same factual inquiry. The question is whether the recipient received the gratification believing that it was given to him as aquid pro quofor conferring a dishonest gain or advantage on the giver in relation to his principal’s affairs. The fourth and final element relates to knowledge and, in particular, whether the accused knew or realised what he did was corrupt by the ordinary and objective standard (TeyTsun Hang v Public Prosecutor[2014] 2 SLR 1189 at [13], [16]–[17], [26]). 95  It should be recalled that the PCA Charges were read with s 29(a) of the PCA, which in turn draws upon the Penal Code definition of abetment. The essential elements of abetment by conspiracy are: (a) the person abetting must engage with one or more persons in a conspiracy; (b) the conspiracy must be for the doing of the thing abetted; and (c) an act or an illegal omission must take place “in pursuance of the conspiracy in order to the doing of that thing” (Chai Chien Wei Kelvin v Public Prosecutor[1998] 3 SLR(R) 619 at [76]). 96 The appellants do not dispute that the moneys subject of the PCA Charges were paid into Joseph’s BOC Account. They, however, submit that the DJ’s finding that Henry and Judy conspired for Judy to corruptly receive gratification from SLT and Feili as a reward for assisting these parties secure the 2006 and 2009 Tender Contracts is against the weight of the evidence. 97 The appellants first claim that the DJ erred in according weight to the Emails. They say that the Emails were sent months before Seagate decided to hold the 2006 Tender, and thus at a time when Henry and Judy did not and could not have known that Seagate was going to hold a tender for the provision of trucking services in the PRC.90Foot Note 90×AS at paras 65–67.Consistent with this, the contents of the Emails are purportedly unrelated to the 2006 Tender. For example, the business structure envisaged by Henry and Judy in the Emails, namely, to set up companies in the PRC to benefit from Seagate’s business, was fundamentally different from that which eventually materialised.91Foot Note 91×AS at paras 68–75. 98 I find insufficient basis to intervene with the DJ’s finding in this regard. The elephant in the room which the appellants have conveniently ignored is their investigative statements. Indeed, the many arid objections raised by the appellants in relation to the court’s jurisdiction, the legal propriety of the PCA and CDSA Charges, and the admissibility of the BOC Statements may, to a certain extent, be said to be borne of an awareness that they had essentially admitted to the PCA Charges in their investigative statements. In these statements, the appellants admit to conspiring to corruptly assist SLT and Feili secure the 2006 and 2009 Tender Contracts by leveraging on Henry’s position as Senior Director of Logistics and member of the 2006 and 2009 Tender committees in exchange for bribes paid to Judy. I will refer extensively to the investigative statements recorded from Henry and Judy and hence set out what I consider to be the salient aspects momentarily. 99 Before doing so, I pause to note that, on appeal, Henry no longer disputes that he provided P38 voluntarily. To recap, he claimed to have provided P38 involuntarily and under oppressive circumstances in the proceedings below. These claims, which spanned allegations that he was harassed and deprived of sleep and rest when he provided P38 and that Sathia became aggressive when he expressed his desire to amend P38, were rejected by the DJ (see [25] above). I mention this for two reasons. 100 First, for completeness, I see no reason to interfere with the DJ’s finding that Henry provided P38 voluntarily and in the absence of oppressive circumstances.92Foot Note 92×GD at [45] (ROP at pp 5067–5070).Henry’s claims to have been completely unable to concentrate during the recording of P38 are betrayed by the numerous, significant amendments he made to the statement. These showed him to possess a clarity of mind fundamentally inconsistent with his claim to have been in a “zombie”-like state.93Foot Note 93×GD at [45(b)] (ROP at pp 5067–5068); ROP at p 1355.Similarly, Henry’s claim that Sathia “became aggressive” when he wished to amend aspects of P38 was showed up by the fact that Sathia was not even present at the recording of the statement.94Foot Note 94×ROP at pp 1231, 1374.Henry also had no answer to the fact that he chose not to make any amendments to P38, but made amendments to a different statement, when he was accorded the opportunity to amend both statements one day after P38 was recorded. Second, Henry’s claims in the above regard showed him to be a witness of poor credibility. 101 Returning to Henry and Judy’s investigative statements, these revealed the following: (a) In 2006, Seagate decided to hold an open tender for the provision of trucking services in the PRC. Seagate had hitherto relied on two companies for trucking services in the PRC, but this arrangement left much to be desired in terms in terms of price and the quality of service rendered.95Foot Note 95×ROP at p 5487 (P38 at para 13). (b) The committee tasked to oversee the 2006 Tender comprised representatives of various Seagate departments, including Henry, who represented the Logistics Department. Each department could nominate vendors to participate in the tender.96Foot Note 96×ROP at p 5487 (P38 at para 14). (c) Henry informed Judy of the 2006 Tender and that she might want to “look for good transport companies in [the PRC,] introduce them [to] Seagate and earn[] a commission from this”. Henry admitted that he “also wanted to gain some benefits from this”. Thereafter, Judy acquainted herself with representatives from SLT and Feili and sent their contact details to Henry.97Foot Note 97×ROP at pp 5487–5488 (P38 at paras 15–17), 5584 (P47 at para 6). (d) Seagate subsequently invited SLT and Feili to make a formal presentation of their services, with a view to shortlisting companies to participate in the 2006 Tender. In this connection, Henry vetted SLT and Feili’s presentation slides because he “want[ed] them to have a better chance of winning the contract”. Both companies were invited to participate in the 2006 Tender.98Foot Note 98×ROP at pp 5488–5489 (P38 at paras 17–19), 5586 (P47 at para 20). (e) Following discussions with Judy, SLT and Feili agreed to pay Judy 10% of revenue they earned from Seagate. At this point, Henry suggested that he and Judy should enter into a GSA with SLT and Feili to ensure that the companies could not “refuse to pay [them] the commission … if they got the contracts from Seagate”. Judy thus approached Joseph who agreed to facilitate the siblings’ plan; Joseph would receive moneys from SLT and Feili in Joseph’s BOC Account and hand his “saving passbook” to Judy to allow her “to withdraw the money[s] as and when she wants”. Joseph never asked for a share of the moneys. He was roped in as a “proxy” by Henry and Judy “because [the siblings] did not want it to be so apparent that [Henry] was doing an official business with [his] own sister” and Seagate would not have condoned Henry’s “conflict of interest”. Henry drafted the GSA because he was more educated than Judy and instructed Judy not to reveal his involvement in the scheme to SLT and Feili.99Foot Note 99×ROP at pp 5488–5490, 5492–5493 (P38 at paras 19–22, 30 (Q3/A3)), 5565 (P44 at para 36), 5585–5586 (P47 at paras 13–14), 5644 (P48 at paras 67–70), 6161 (P100 at para 10). (f) After the 2006 Tender closed and Seagate conducted site visits of the tenderers, Henry informed Judy of common questions that Seagate asked of its tenderers for Judy to pass on to SLT and Feili. This allowed SLT and Feili to prepare responses to Seagate in advance. Henry and Judy also advised SLT and Feili on “what they should do to win the tender” and separately emailed them the “existing rates … Seagate was paying for the trucking services”.100Foot Note 100×ROP at pp 5490 (P38 at para 23), 6167 (P100 at para 28).For instance, Judy informed SLT and Feili that Seagate was “particularly concerned with … security issues” and that they should emphasise that “their drivers [could not] stop along the way as and when they want[ed], that there must always be a second driver [present] in the truck, and that every truck must come with a GPS and a high-quality lock”.101Foot Note 101×ROP at pp 5490 (P38 at para 23), 6167 (P100 at para 28). (g) When the 2006 Tender Contracts lapsed, Seagate called for the 2009 Tender. Again, Henry and Judy wanted “Feili and SLT to win the [2009 Tender Contracts] so that [Judy] could continue to earn consultancy commission from them”. By this time, Judy was “very confident of [Feili and SLT’s] chances [of] winning the [2009 Tender Contracts]”.102Foot Note 102×ROP at p 5586 (P47 at para 16). (h) SLT and Feili “would credit the 10% commission” into Joseph’s BOC Account. This was, however, done on an irregular basis.103Foot Note 103×ROP at p 6161 (P100 at para 10). 102 I am cognisant that the appellants subsequently sung a different tune in their cautioned statements, D12 and D18. There, Henry disavowed any conspiracy between him and Judy to corruptly profit from the 2006 and 2009 Tenders104Foot Note 104×ROP at pp 8673–8676 (D12).and Judy stressed that any moneys paid by SLT and Feili were paid to Twin Palms and not her.105Foot Note 105×ROP at pp 8686–8689 (D18).That said, the DJ’s decision to place weight on the initial, incriminating investigative statements cannot be faulted. The appellants chose not to make any amendments to the inculpatory portions of their earlier statements, and instead, affirmed their accuracy on numerous occasions. They have also not provided a cogent explanation of why their belated accounts in D12 and D18 should be preferred to the narrative they consistently espoused in their initial statements. 103 The appellants’ investigative statements provide the necessary context to the Emails and show their proposed interpretation of the Emails to be disingenuous. Their contention that they exchanged the Emails when they did not and could not have known that Seagate was going to hold the 2006 Tender is contradicted by their direct admissions of conspiring to corruptly benefit from the 2006 Tender. Besides, Henry admitted that he harboured the intention to corruptly benefit from Seagate’s business since August 2005 and expressed this intention in his email dated 29 August 2005.106Foot Note 106×ROP at pp 5494, 5500 (P39 at para 32A, Annex A). 104 There is also nothing to support the point that the business structure contemplated by Henry and Judy in the Emails differed from that which took shape. As the appellants themselves explained, the initial plan to set up a company in the PRC did not materialise because “it was too much trouble to set up a company in [the PRC] with a mainland partner”.107Foot Note 107×ROP at p 5583 (P47 at para 5), 5633 (P48 at para 5).In the end, Henry and Judy decided to exploit Twin Palms as a conduit “because it was already registered in Malaysia and [Judy] need not bother with registering a new company in China just to enter into contract[s] with the … truckers”.108Foot Note 108×ROP at p 5584 (P47 at para 8).Any change in the corporate structure of the vehicle meant to represent Henry and Judy’s interests was thus entirely consistent with the conspiracy. 105 Far from supporting the appellants’ case, the Emails evidence the conspiracy. For example, in the Emails, Henry impressed upon Judy that no one should know of his role in Seagate and to keep the information he conveyed to her “confidential as this is sensitive in [his] current position”.109Foot Note 109×ROP at pp 6275 (P105), 6278 (P107).Similarly, Judy advised Henry not to discuss his plans “in the office [as] it is too risky”.110Foot Note 110×ROP at p 6276 (P106).These exchanges illustrate that the appellants were fully aware of the illicit nature of their plan, which point I will return to shortly. 106 The Emails likewise corroborate a number of the appellants’ admissions in their investigative statements. These include Henry’s admission that the GSA was intertwined with the corrupt scheme he devised with Judy (see [101(e)] above). In his email to Judy dated 9 September 2005, Henry proposes “negotiat[ing] as a [GSA] to get commission for the business we bring in”.111Foot Note 111×ROP at p 6278 (P107).It also extends to the appellants’ admissions that Henry vetted Feili’s presentation slides to place them in a better stead to secure the 2006 Tender Contracts (see [101(d)] above),112Foot Note 112×ROP at pp 5495–5496 (P39 at para 32F), 6281–6282 (P109–P110).drafted the GSA (see [101(e)] above),113Foot Note 113×ROP at p 6283 (P111).advised Feili on how they should address Seagate’s queries (and in particular, to stress the high level of security that accompanied Feili’s services) (see [101(f)] above),114Foot Note 114×ROP at pp 5496 (P39 at para 32G), 5508.and disclosed the existing rates Seagate was paying for trucking services in the PRC to Judy to pass on to Feili and SLT (see [101(f)] above).115Foot Note 115×ROP at pp 5498 (P39 at paras 32M, 32N), 5518–5519, 5849–5856, 5858 (P57–P60, P62). 107 Indeed, in advising Judy of how Feili should respond to Seagate’s queries, for example, Henry went so far as to state that Feili should: (a) “[e]xplain the GPS system in their truck fleet”, mention “that [their] control station is manned 24 [hours]” and would alert their management the moment a “truck deviate[s] from the established route, [stops] at unauthorised stops, or [there is] no response from [the driver]”; (b) mention that all of their drivers are hired in Shanghai or Suzhou and that every truck has two drivers to assuage Seagate’s concerns; (c) state that Feili deploys an unmarked car to follow the truck to deal with the “high crime rate for trucking into [Hong Kong]”; (d) prepare answers on Feili’s record of hijacked or stolen goods, insurance coverage, experience working in Suzhou; and (e) mention that Feili transports high value electronic goods across Suzhou.116Foot Note 116×ROP at p 5508.The aforesaid collectively puts paid to the appellants’ claim that the Emails did not concern the conspiracy subject of the PCA Charges. 108 Finally, I also consider the SLT Statements to evidence the conspiracy the appellants hatched. Hu and Jiang both stated that in 2006, Judy contacted SLT and informed the company that she could help it secure the 2006 Tender Contracts and that Judy asked SLT to pay her 10% of the invoice value of the 2006 Tender Contracts before SLT had secured the contracts.117Foot Note 117×ROP at pp 6132–6134 (P96-T), 6152–6154 (P98-T).Jiang also mentioned that SLT gave a Powerpoint presentation to Seagate and Seagate conducted a site visit of SLT before SLT was invited to participate in the 2006 Tender.118Foot Note 118×ROP at p 6142 (P97-T).Hu’s and Jiang’s accounts of how SLT became involved with Seagate are consistent with the appellants’ admissions in their investigative statements, and support the DJ’s finding of conspiracy between Henry and Judy. 109 In short, the conspiracy between Henry and Judy to corruptly receive gratification from SLT and Feili as a reward for Judy advancing the business interests of SLT and Feili vis-à-vis Seagate is amply supported by the appellants’ investigative statements, the Emails and the SLT Statements.",
        "Whether the information Henry divulged was confidential": "110 The appellants next submit that the Prosecution failed to show that the information Henry divulged to Judy (which Judy in turn conveyed to SLT and Feili’s representatives) was confidential and could not be disclosed to SLT and Feili.119Foot Note 119×AS at paras 28–32. 111 I find this to be an unmeritorious submission. There is overwhelming evidence to the contrary. That the information conveyed by Henry to Judy was confidential can first be discerned from the nature of the information disclosed and the timing of disclosure. I had earlier highlighted how Henry provided Judy with detailed instructions on how Feili should respond to Seagate’s queries and the existing rates Seagate was paying for trucking services in the PRC (for Judy to pass on to SLT and Feili) in advance of the 2006 Tender (see [106] above). This is indisputably confidential information in so far as it distorted the competitive process the 2006 Tender was intended to engender. I see no reason to doubt the testimony of Mr S Rajdave Singh Dhaliwal (Senior Corporate Counsel of Seagate’s Intellectual Property Legal Team) (“Mr Dhaliwal”)120Foot Note 120×ROP at pp 1795–1797.that Seagate considered any information that could detrimentally affect Seagate’s interests if unrestricted to be confidential.121Foot Note 121×ROP at pp 1814, 5792. 112 Some other examples of information disclosed by Henry to Judy prior to the conclusion of the 2006 Tender include the 2006 Tender Committee’s internal timetable of the tender process,122Foot Note 122×ROP at p 5859 (P63).the formal invitation to tender (this was disclosed to SLT and Feili before they were invited to participate in the 2006 Tender),123Foot Note 123×ROP at pp 5860–5876 (P64).and Seagate’s tender scoring system.124Foot Note 124×ROP at pp 5890–5891 (P71). 113 Likewise, Henry sent Judy the tentative schedule and timeline of the 2009 Tender before the tender was formalised,125Foot Note 125×ROP at pp 5896, 5898, 5903 (P73, P75, P77).as well as information spanning changes in the tender timeline, details of how Seagate’s tender committee functioned, the groupings in respect of the 2009 Tender, and requirements that companies needed to satisfy before Seagate would invite them to participate in its tender before SLT and Feili were invited to participate in the 2009 Tender.126Foot Note 126×ROP at pp 5897, 5899–5902, 5904–5905 (P74, P76, P78, P79). 114 Again, the sensitive nature of the information conveyed by Henry to Judy set out at [112] and [113] speaks for itself. It is further buttressed by Mr Dhaliwal’s testimony that Henry came to possess the information by virtue of his position in Seagate and that disclosure of this information affected Seagate’s competitive advantage and created an unequal playing field in the 2006 and 2009 Tenders. 115 It is also telling that Henry and Judy regarded the information set out above to be confidential (see [105] above). In addition to the evidence canvassed at [105] above, Henry had informed Judy: (a) that SLT and Feili “should pretend not to know [about the 2009 Tender] until someone notif[ies] them of the extension” as well as “lie low and know nothing about Seagate tender”, although “[t]hey can start preparing” on 9 September 2009;127Foot Note 127×ROP at p 5897 (P74).and (b) that she should keep the list of criteria to be selected for the 2009 Tender “confidential” on 30 September 2009.128Foot Note 128×ROP at p 5905 (P79). 116 Set against this backdrop, the appellants’ claim that the information Henry conveyed to Judy was known to all tender participants and hence, not confidential, beggared belief.",
        "Whether SLT and Feili paid the moneys into Joseph’s BOC Account for legitimate services rendered by Twin Palms": "117 The upshot of the above is that the Agreements (as well as the advisory services Twin Palms purportedly provided SLT and Feili thereunder) were clearly shams or, as Diplock LJ (as he then was) put it inSnook v London and West Riding Investments Ltd[1967] 2 QB 786 at 802C, a document executed by parties “intended by them to give to third parties or to the court the appearance of creating between the parties legal rights and obligations different from the actual legal rights and obligations (if any) which the parties intend to create”. 118 Here, I find the appellants’ claim that the DJ’s determination that the Agreements were shams contravened the parol evidence rule set out in ss 93 and 94 of the EA to be a non-starter.129Foot Note 129×AS at paras 79–102.The issue of whether there is a sham is prior to and will necessarily not engage s 93 and, accordingly, s 94 of the EA. An allegation of a sham goes to the very existence of the contract and, therefore, ss 93 and 94 of the EA do not apply and a wider range of evidence can be considered by the courts in determining what the status of the Agreements was between the parties (TohEng Tiah v Jiang Angelina and another appeal[2021] 1 SLR 1176 at [77], [79]). 119 The appellants’ remaining contentions as to the legitimacy of the services provided by Twin Palms do not take them very far and I deal with them briefly. First, they submit that weight should be accorded to: (a) Joseph’s affidavit wherein he attests that the commissions were payable to Twin Palms for referring trucking companies to Seagate; and (b) Judy’s testimony that Joseph accompanied her to the meeting with Hu and Jiang.130Foot Note 130×AS at paras 95–102; ROP at pp 8621–8669 (D9). 120 Joseph’s claim that Twin Palms provided legitimate referral services to Feili and SLT was not tested under cross-examination (see [28] above) and is rendered unreliable by Judy’s testimony that Joseph was unable to remember the details of events and relied on Judy’s account of “roughly what happened”.131Foot Note 131×ROP at pp 4635–4638.It is also undermined by the appellants’ admissions in their statements as well as the Emails which illustrate that Twin Palms was a conduit for the appellants’ corrupt scheme. Similarly, Judy’s claim that Joseph accompanied her to meet Hu and Jiang flew in the face of Hu and Jiang’s disavowal of the same132Foot Note 132×ROP at pp 6132 (P96T), 6152 (P98-T).and Henry’s admission that Joseph was a mere “prox[y]” (see [101(d)] above). 121 Second, the appellants urge this court to accord weight to the fact that Henry did not draft the agreement between Feili and Twin Palms but merely handed a precedent to Judy.133Foot Note 133×AS at para 119.But Henry himself admitted to drafting the agreement because he was more highly educated than Judy (see [101(e)] above).134Foot Note 134×ROP at p 5489 (P38 at para 22).He also sent an email to Judy dated 17 September 2006 stating “pl[ease] take a[] look [at] the contract I have d[ra]fted” and to which a copy of a draft GSA was attached.135Foot Note 135×ROP at pp 6283–6285 (P111). 122 Third, the appellants point to three sums (of RMB84,411, RMB92,475 and RMB 115,842) paid by Feili into Joseph’s Bank of Shanghai account (in contradistinction to Joseph’s BOC Account) and claim that this throws a spanner in the Prosecution’s case that the moneys subject of the PCA Charges were bribes.136Foot Note 136×AS at paras 108–115, 132, 172–186.I disagree. Even if Feili’s motivations in making the payments to Joseph’s Bank of Shanghai account (rather than Joseph’s BOC Account) are not revealed by the evidence, it does not undermine the strength of the evidence against the appellants in respect of the PCA Charges. 123 Finally, the appellants place weight on the fact that the sums SLT and Feili paid to Joseph’s BOC Account did not tally with the quantum of moneys they ought to have paid under the Agreements. They claim that Seagate paid SLT and Feili RMB280,563,835.62 pursuant to the 2006 and 2009 Tender Contracts, and Henry and Judy thus ought to have received RMB28,056,383 in commission. However, only RMB11,349,817.44 was paid to Joseph’s BOC Account with no explanation for the shortfall.137Foot Note 137×AS at paras 43.13–43.14, 197–216. 124 I do not accept this submission for several reasons. Preliminarily, the appellants did not put their contention that Seagate paid SLT and Feili RMB280,563,835.62 in accordance with the 2006 and 2009 Tender Contracts to any of the witnesses. Even if I assume in the appellants’ favour that this sum was indeed paid to SLT and Feili, their contention did not hold much water for the following reasons. 125 One, the Defence conceded that the payments reflected in Exhibits P51 and P52, which it relies upon to establish the figure of RMB280,563,835.62, included Seagate’s expenses and it does not know “the profit cost element in each of those payments by Seagate to the truckers”.138Foot Note 138×ROP at p 2928. 126 Two, Henry and Judy both admitted that SLT and Feili made payments on an irregular basis. Henry claimed that he and Judy did not fix a date by which SLT and Feili had to pay the commission because the companies billed Seagate on an irregular basis and did not receive payments until some time after doing so.139Foot Note 139×ROP at pp 5490–5491 (P38 at para 25).In a similar vein, Judy stated that SLT was “always late” in making payment,140Foot Note 140×ROP at p 5585 (P47 at para 13).SLT and Feili “may forget to make payments on time”,141Foot Note 141×ROP at p 6161 (P100 at para 10).and she did not keep records of payment made to Twin Palms “very well”.142Foot Note 142×ROP at p 5640 (P48 at para 34).This dovetailed with the evidence of Mr Thong Yong Sen, an investigation officer from the CPIB,143Foot Note 143×ROP at p 2167.that the payments from SLT and Feili “did not come on a fixed date or in a fixed regular manner”.144Foot Note 144×ROP at p 2458. 127 Three, the appellants admitted that the moneys SLT and Feili paid to Joseph’s BOC Account constituted bribes for advancing their interests with Seagate.145Foot Note 145×ROP at pp 5488–5493; ROP at pp 6193–6194 (P101 at paras 11–13). 128 Lastly, for completeness, I agree with the Prosecution that Judy’s claim that the RMB25,000 she drew each month was salary for the work she performed for Twin Palms could not be believed. The appellants failed to adduce any evidence of actual interpretation and translation services Judy purportedly provided SLT and Feili. Judy’s claim was also directly contradicted by Henry’s account that he had told Judy to withdraw RMB25,000 from Henry’s BOC Account every month for her personal expenses in P38146Foot Note 146×ROP at p 5491 (P38 at para 25).as well as her own admission in P100 that the sums were paid to her for “[her] role in securing the 10% commission from Feili and SLT”.147Foot Note 147×ROP at p 6161 (P100 at para 10).",
        "Whether the moneys SLT and Feili paid to Joseph’s BOC Account were meant for Judy": "129 I now deal with the appellants’ final broad contention,viz, that the moneys SLT and Feili paid to Joseph’s BOC Account were meant for Twin Palms and not Judy. That the Agreements were shams necessarily meant that moneys paid to Joseph’s BOC Account were not intended for Twin Palms. Nevertheless, for completeness, I address the appellants’ arguments in this regard. 130 The appellants submit that there is nothing unusual about the fact that the moneys were paid into Joseph’s BOC Account rather than Twin Palms’ bank account; Twin Palms could not open a bank account in the PRC.148Foot Note 148×AS at para 120.They also claim it significant that: (a) Joseph opened his BOC Account before the 2006 Tender (on 18 November 2005); (b) Joseph’s BOC Account disclosed inflows and outflows of moneys unrelated to the sums SLT and Feili deposited into the account; (c) Judy only asked Henry to withdraw S$703,480 from Judy’s BOC Account even though approximately S$3.5m was paid into Joseph’s BOC Account between April 2007 and April 2011 and Judy had control over the latter; and (d) Judy did not withdraw more than RMB25,000 for her salary and RMB49,000 for other expenses from Joseph’s BOC Account.149Foot Note 149×AS at paras 148–156, 161, 167–171. 131 The weight of the evidence does not support the appellants’ position. Their submissions on appeal are, again, undone by their investigative statements. Henry admitted that the entire purpose of the corrupt scheme “was to help [Judy] earn an income”, though he “also wanted to gain some benefits from [it]”, and further that “[Joseph] never requested for a share [of the] commission[s]”.150Foot Note 150×ROP at pp 5488–5489 (P38 at para 16, 20), 5567 (P45 at para 52).This is also bearing in mind that in or about 2006, Judy lost her job and faced difficulties finding employment in Shanghai.151Foot Note 151×ROP at p 5583 (P47 at para 4).Henry further admitted to planning to interpose a GSA between him and Judy, on one hand, and SLT and Feili, on the other, to ensure that the companies “[could not] refuse to pay the commission tous[ie, Henry and Judy] if they got the contracts from Seagate” [emphasis added]. Twin Palms was then brought into the fray because “we[ie, Henry and Judy] need[ed] a company to get into this GSA” [emphasis added].152Foot Note 152×ROP at p 5489 (P38 at para 20).These admissions are consistent with Henry’s email to Judy dated 9 September 2005 where he contemplated “negotiat[ing] as a [GSA] to get commission for the business we bring in” (see [106] above), and show the appellants’ assertion that the moneys were meant for Twin Palms to be unbelievable. 132 The thread that runs through the Emails and the appellants’ investigative statements extends to the SLT Statements. In these statements, Hu and Jiang both claimed that Judy requested SLT to pay her 10% of the invoice value as commission fees and “the money we paid her was the commission fees she requested”.153Foot Note 153×ROP at pp 6132, 6134, 6152–6153 (P96-T, P98-T).This similarly evinced that Henry and Judy utilised Twin Palms and Joseph’s BOC Account as a conduit to receive bribes from SLT and Feili. 133 Indeed, the appellants’ submissions fall away when set against their investigative statements, the Emails and the SLT Statements. Even if I accept that the moneys were paid into Joseph’s BOC Account (rather than Twin Palms’ bank account) for administrative reasons, this did not advance the appellants’ case that the moneys were intended for Twin Palms in any way. Similarly, Joseph opening his BOC Account before the 2006 Tender and that Joseph’s BOC Account showed inflows and outflows of moneys not ostensibly linked to the bribes were, at best, neutral and, in fact, entirely consistent with the corrupt scheme fashioned by Henry and Judy. 134 Whilst the appellants rely on Judy only asking Henry to withdraw S$703,480 (of approximately S$3.5m paid into Joseph’s BOC Account between April 2007 and April 2011) from Judy’s BOC Account to show that Judy had no control over Joseph’s BOC Account, this elides consideration of the appellants’ own evidence that it was difficult to transfer moneys from the PRC to Singapore “because of the [PRC’s] country currency restriction”. Indeed, Henry stated that he tried to withdraw moneys from Judy’s BOC Account in Singapore and had withdrawn the daily limit of S$2,000 each day for two to three months, but stopped “after finding out that this method was troublesome, and the exchange rate was bad”.154Foot Note 154×ROP at pp 5491 (P38 at para 26), 5499 (P39 at para 33), 5586 (P47 at para 15).In line with this, a “major portion of the commissions is still parked in the bank accounts in [the PRC and] maintained by Judy”.155Foot Note 155×ROP at p 5499 (P39 at para 33).Judy also admitted that Henry stopped making “daily withdrawals using [her] ATM card in Singapore” in around August or September 2010 because he was frustrated with her indecision over the purchase of property.156Foot Note 156×ROP at p 5586 (P47 at para 15), 5636 (P48 at para 15). 135 In any event, the link between the sums Henry withdrew from Judy’s BOC Account and Judy’s control over Joseph’s BOC Account is tenuous. Even if a subset of the moneys in Joseph’s BOC Account was transferred to Judy’s BOC Account, this did not mean that Judy did not have control over the former account. Moreover, by Judy’s own admission, she “knew that if [she] needed more [money], [she could] always ask [Joseph] for more and he [would] not refuse”, which could account for why she did not bother transferring all the sums subject of the PCA Charges into her own account.157Foot Note 157×ROP at p 5585 (P47 at para 14).Judy’s admission that she had access to money whenever necessary also disposes of the appellants’ final argument that Judy lacked control over Joseph’s BOC Account because she withdrew only RMB25,000 for her salary and RMB49,000 for other expenses from Joseph’s BOC Account. 136 In summary, I uphold the DJ’s decision to convict Henry and Judy on the PCA Charges. The BOC Statements prove that SLT and Feili paid the sums subject of the PCA Charges to Joseph’s BOC Account. The remaining elements of the PCA Charges are robustly supported by the appellants’ admissions of the corrupt scheme in their investigative statements, the Emails and the SLT Statements.",
        "Whether the DJ’s decision to convict Henry and Judy on the CDSA Charge was against the weight of the evidence": "137 Turning to the CDSA Charge, the elements of an offence under s 44(1)(a), punishable under s 44(5)(a) of the CDSA were set out inAng Jeanette. To make out an offence under s 44(1)(a) of the CDSA, the Prosecution must prove as part of theactus reusthat: (a) the accused has entered or is otherwise concerned in an arrangement; (b) which facilitates the retention or control by or on behalf of another of that other person’s benefits of criminal conduct; and (c) that other person is a person who engages in or has engaged in criminal conduct or has benefited from criminal conduct (Ang Jeanetteat [49]). 138 Where, as in the CDSA Charge, the charge under s 44(1)(a) of the CDSA is predicated on an accused’s actual knowledge (rather than him having reasonable grounds to believe), the Prosecution must prove that the accused knew that the moneys he was dealing with were the benefits of criminal conduct, that the arrangement would facilitate the retention and control of such benefits of criminal conduct and that the other person had engaged in criminal conduct or benefited from it (seeAngJeanetteat [72]–[73]). 139 It should also be recalled that the CDSA Charge was read with s 109 of the Penal Code and avers that Henry and Judy engaged in a conspiracy for Henry to be concerned in an arrangement under which Henry facilitated Judy’s benefits of criminal conduct (see [78] above). The law on abetment on conspiracy, set out at [95] above, applies with equal force here. 140 The appellants’ principal submission in respect of their convictions on the CDSA Charge is that the Prosecution failed to sufficiently link the bribes SLT and Feili paid into Joseph’s BOC Account to the moneys Henry withdrew from Judy’s BOC Account. They emphasise that Judy had attested to having three BOC accounts.158Foot Note 158×AS at paras 421–427. 141 It is not disputed that the Prosecution was unable to particularise the account number corresponding to Judy’s BOC Account. Nor did the Prosecution adduce bank statements pertaining to Judy’s BOC Account.159Foot Note 159×PS at para 174.But this did not raise a reasonable doubt. 142 Pertinently, in P101, Judy detailed the link between the bribes paid by SLT and Feili to Joseph’s BOC Account and the moneys subject of the CDSA Charge. She explained that SLT and Feili would first deposit moneys into Joseph’s BOC Account. Thereafter, she would transfer moneys from Joseph’s BOC Account to Judy’s BOC Account using the relevant ATM card. The next and final step was for Henry “to withdraw S$2,000 on a daily basis from Bank of China’s ATM in Singapore using [Judy’s] ATM card”, which she handed to Henry when he was in Shanghai.160Foot Note 160×ROP at pp 6194–6195 (P101 at paras 12–14). 143 This account is consistent with Judy linking the moneys she “earned from the 10% commission”,ie, the bribes, to the purchase of the Property in P47.161Foot Note 161×ROP at p 5586 (P47 at para 15).Indeed, in P100, she goes so far as to admit that the purpose of “entering into the arrangement with Feili and SLT [is] to earn enough money for us [ie, Judy and Joseph] to purchase a property of our own in Singapore” and that the Property “was purchased using all the commission [she] obtained from Feili and SLT”.162Foot Note 162×P100 at para 9 (ROP at pp 6160–6161).For completeness, I also accept the Prosecution’s submission that the link between the bribes paid by SLT and Feili to Joseph’s BOC Account and the moneys subject of the CDSA Charge is supported by the Emails which illustrates that the appellants had, from an early stage, canvassed the idea of receiving bribes in the PRC and remitting them to Singapore.163Foot Note 163×ROP at p 5539. 144 At this juncture, I deal with Judy’s claim that some of the moneys in Judy’s BOC Account stemmed from legitimate sources.164Foot Note 164×P100 at para 15 (ROP at p 6163).I find insufficient basis to interfere with the DJ’s decision to disregard this claim. Judy’s assertion in this regard was a bare one. She did not produce any bank statements pertaining to Judy’s BOC Account to substantiate her assertion. There is also a wealth of evidence demonstrating Judy’s poor credibility as a witness (see,eg, [128] above). 145 In the final analysis, the DJ’s decision to convict Henry and Judy on the CDSA Charge is not against the weight of the evidence. The conspiracy between Henry and Judy for Henry to be concerned in an arrangement under which Henry facilitated Judy’s benefits of criminal conduct is revealed by the appellants’ admissions in their investigative statements. By virtue of her offences in respect of the PCA Charges, Judy was a person who had engaged in criminal conduct. The arrangement transmuted bribes into the Property and hence facilitated Judy’s control of her benefits of criminal conduct. The appellants possessed the requisitemensreaby virtue of their admissions in the investigative statements and intricate involvement in the predicate offences under the PCA Charges. 146 For these reasons, I uphold the DJ’s decision to convict Henry and Judy on the CDSA Charge.",
        "Whether the individual sentences imposed by the DJ were manifestly inadequate or manifestly excessive": "147 In reaching a view on the sentences imposed by the DJ, I first determine the appropriate sentencing framework, if any, that should apply to offences under s 5 of the PCA.",
        "Whether the sentencing framework in Goh Ngak Eng should apply": "148 The Prosecution submits that the applicable sentencing framework ought to be that outlined inGohNgak Engfor offences under s 6 of the PCA.165Foot Note 165×Prosecution’s Further Submissions dated 16 February 2023 (“PFS”) at para 5.The appellant makes no submission as to the applicable framework. 149 InGohNgak Eng, the court declined to extend its sentencing framework to offences under s 5 of the PCA. It explained its reasoning for doing so at [50]–[51]: 50 In our judgment, the revised sentencing framework for offences under ss 6(a) and (b) of the PCA should not be extended to offences under s 5 of the PCA because both provisions are directed at distinct mischiefs and so will engage different considerations in the sentencing exercise. While s 5 of the PCA targets corrupt transactions more generally, s 6 is specifically directed at a situation where the corrupt procurement of influence involves the agent subordinating his loyalty to his principal in furtherance of his own interests. … 51 The different mischiefs at which each provision is directed give rise to the possibility that different sentencing considerations may be relevant for offences under s 5, as compared to offences under ss 6(a) and (b) of the PCA. ... Further, the absence of a common mischief at which both provisions are directed means that the salient features attaching to offending conduct under each provision will likely differ. As such, they may not share a common pool of potentially relevant offence-specific factors for the purposes of step one of the revised sentencing framework. This means that particular offence-specific factors might come to be excluded simply because of the offence in question (whether it is one under s 5, or one under ss 6(a) or (b) of the PCA) and not because the attributes of the offending conduct justify such exclusion. For instance, offence-specific factors like actual loss caused to the principal and the extent of the offender’s abuse of position and breach of trust, which areprima facierelevant to an offence under ss 6(a) or (b),do not readily feature in an offence under s 5. In these circumstances, the absence of such factors in an instance of offending conduct under s 5 as compared to another instance of offending conduct under ss 6(a) or (b) where such factors were engaged says nothing about the relative severity of the two instances of offending conduct. Accommodating both s 5 and ss 6(a) and (b) offences within the same sentencing framework is therefore unworkable because the court has no intelligible means of classifying the severity of offending conduct underbothprovisions, using a common yardstick. [Emphasis in original] 150 The Prosecution urges this Court to apply theGohNgak Engsentencing framework, as the present case is exactly the situation envisioned in the framework where “the corrupt procurement of influence involves the agent subordinating his loyalty to his principal in furtherance of his own interests” (GohNgak Engat [50]). Moreover, the Prosecution contends that the High Court did not preclude extending the framework to offences under s 5 of the PCA; it merely declined to do so in the absence of such charges before it.166Foot Note 166×PFS at para 5. 151 In my judgment, it would be inappropriate to extend theGohNgak Engframework wholesale to offences under s 5 of the PCA. With respect, I disagree with the Prosecution that the only reason the High Court declined to extend theGohNgak Engframework to s 5 offences was because there was no such charge before it. To the contrary, the court went on to set out conceptual reasons why the framework should not be so extended, which I have reproduced at [149] above. 152 I also disagree with the Prosecution that the coincidence of the facts of the present case to cases commonly prosecuted under s 6 should be a reason for extending theGohNgak Engframework to s 5 offences. I accept that this case is one that, but for the recipient of the gratification being Judy, would have also fallen under the scope of s 6. That is not unexpected. As noted inGohNgak Engat [50] and inSong Meng Choon Andrew v Public Prosecutor[2015] 4 SLR 1090 (“Andrew Song”) at [30], s 5 is a more general provision and would be capable of capturing offending that would normally fall within the more specific s 6 – as illustrated by this case. However, that is not where the enquiry ends. The High Court’s concern inGohNgak Eng, more accurately framed, is that s 5 alsoencompassed a wide range ofothercases for which a framework for s 6 would not be adequate. Put another way, it is not sufficient to illustrate that a sentencing framework for s 6 would be appropriate forthisparticular case; the question is whether the sentencing framework for s 6 would be appropriate forallcases potentially falling within s 5: see for examplePublic Prosecutor v Tan Kok Ming Michael and other appeals[2019] 5 SLR 926 (“Michael Tan”) at [104]. I would be chary to endorse the latter. As was rightly noted inGohNgak Engat [51], classification of the severity of offending conduct for s 5 cases is “unworkable” under a framework shared with s 6 because there will be many offence-specific factors that do not apply to s 5 cases. 153 At the same time, I am guided by the observations of the High Court inAndrew Songat [32]–[37] that considering both provisions prescribe the same punishment range, and the historical circumstances in which both sections were introduced, a court “should not be overly concerned with whether a charge is brought under s 5 or s 6”. Similarly, Hoo Sheau Peng J inMichael Tanat [55] noted that if two cases consisting of the same facts are brought under ss 5 and 6 of the PCA respectively, they should be viewed with equal severity, and the correct approach in sentencing would be to focus on the specific facts giving rise to the corrupt act. 154 In my view, the above observations do not support the broad proposition that a sentencing framework for s 6 offences would be appropriate for all offences under s 5. Instead, the remarks inAndrew SongandMichael Tanapply to a specific situation where a case brought under s 5 could have been brought under s 6 as well. This is such a case. It involves Henry, an agent, subordinating his loyalty to his principal in furtherance of his (and Judy’s) interests, and would have otherwise been a typical case under s 6 but for the recipient of the payment being Judy rather than Henry. I do not consider the different identity of the recipient to be particularly material due to the close familial ties between Judy and Henry, and the way that they acted in close concert. 155 BothAndrew SongandMichael Taninvolved similar situations to the present case. In both cases, the court’s consideration of sentence encompassed relevant precedents under s 5 and s 6. InAndrew Song, the appellant had pleaded guilty to two charges under s 5(b)(i) of the PCA, for corruptly giving gratification to one Philibert as a reward for Philibert making arrangements to illicitly extend the validity of Filipino hostesses’ stay in Singapore. Philibert did this through a contact officer in the Immigration and Checkpoints Authority of Singapore (“ICA”). In calibrating the appellant’s sentence of six weeks per charge, Chan Seng Onn J (as he then was) had regard to cases under ss 5 and 6 of the PCA involving corrupt gratification given to ICA officers through agents. He also drew onPublic Prosecutor vMarzuki bin Ahmad[2014] 4 SLR 623, which concerned sentencing for offences under s 6(a) of the PCA, for factors relevant to sentencing the appellant. 156 InMichael Tan, the first appellant, Tan Kok Ming, Michael, had corruptly given gratification to one Owyong in exchange for Owyong facilitating the detention of a competitor’s vessel by officers of the Malaysian Maritime Enforcement Agency. He pleaded guilty to a charge under s 5(b)(i) of the PCA. In calibrating the length of his imprisonment sentence, Hoo J surveyed two District Court cases where bribery of foreign public servants had been prosecuted under s 6(b) of the PCA. Having considered these cases she found that no adjustment to the sentence of four months’ imprisonment was necessary. 157 In view of the above, I set out my approach to the calibration of the sentence in the present case, bearing in mind that it falls within the category of s 5 cases that overlap with s 6: (a) First, I consider the relevant aggravating and mitigating factors that are present on the facts of the case, including both offence-specific and offender-specific factors. (b) Second, I consider the relevant sentencing precedents, having regard to the nature and factual circumstances of the offence. Pre-GohNgak Eng, this would have involved surveying sentencing precedents under both s 5 and s 6, as was done inMichael TanandAndrew Song. Post-GohNgak Eng, this would involve applying theGohNgak Engframework to the facts of the case, in addition to looking at relevant s 5 and post-GohNgak Engs 6 cases. (c) Third, in calibrating the eventual sentence, I consider the relative weight to be given to the relevant precedents and the notional sentence under theGohNgak Engframework. In this assessment, I take into account both the helpfulness of the available precedents and the limitations of theGohNgak Engframework, such as whether there are offence-specific factors that are not captured within the framework. 158 I stress that the application ofGohNgak Engas part of reaching a decision on sentence is not an endorsement of the general applicability of theGohNgak Engframework for s 5 cases at large. Rather, the basis for applying such a framework is that for the specific category of s 5 offences that overlap with the scope of s 6, it is relevant to consider the sentences imposed for similar cases under s 6. Whether it is necessary to do so in each s 5 case would very much depend on the specific facts of the offence and the extent to which they resemble applicable fact patterns for cases under s 6.",
        "The relevant sentencing considerations for the charges under s 5 of the PCA": "159 It thus remains for me to articulate the factors for consideration in sentencing based on the factual matrix, drawing from the list set out inMichael Tanat [99]. Total value of gratification 160 The total amount of gratification of approximately S$2,320,864.10 was far in excess of cases which register a lower level of culpability (Public Prosecutor v SyedMostofaRomel[2015] 3 SLR 1166 (“Romel”) at [20]). I agree with the DJ that this was significant.167Foot Note 167×GD at [206] (ROP at p 5141).This would presumptively indicate a greater subversion of the public interest (Public Prosecutor vAng Seng Thor[2011] 4 SLR 217 at [46]). Consequences of the corruption 161 This is a case where the corruption directly implicates the interest of the principal, Seagate. Whether the scheme caused actual loss to Seagate is thus relevant (Michael Tanat [99(b)(ii)];Romelat [20]). 162 I agree with the Prosecution that Seagate suffered from the disclosure of its confidential information on pricing, security, and details of the tender assessment. This led to a reduction of its competitive advantage in the marketplace as vendors could calibrate their bids accordingly by fixing the prices they submitted.168Foot Note 168×PFS at para 8; ROP at pp 1814 to 1818. 163 The Defence argues that there was no actual loss because it was Henry’s suggestion in the first place to consider trucking as an alternative to air freight, a decision which saved Seagate “millions of dollars”.169Foot Note 169×Defence’s Further Submissions dated 16 February 2023 (“DFS”) at para 80; ROP at p 739.I do not agree with this submission that Henry’s suggestion to consider trucking should mitigate the calibration of the actual loss. Measuring the loss caused by the offenceshould not involve loss or gain occasioned by unrelated conduct by Henry in the course of his job. It does not make sense that the gravity of an agent’s harm to a principal should be any less just because an agent chose to misappropriate from a source of profit that he contributed to. The appropriate comparison for measuring loss is thus not with a situation where there was no tender process at all, but with the outcome of a fair and transparent tender process. Seen in this light, there is good reason to suppose that the disclosure of confidential information would have prejudiced the value of the bids that Seagate would have received compared to where no disclosure had taken place. 164 Here, I add to the DJ’s reasoning for rejecting the same argument from the Defence below. It is not just that tender rigging is objectionable even if there is no direct monetary harm (Public Prosecutor vWong Chee Meng and another appeal[2020] 5 SLR 807 (“Wong Chee Meng”) at [64]). It is also that interference with the tender likely occasioned monetary harm because if SLT and Feili did not have the information provided to them by Henry, their bids could not have been calibrated as low, for fear that they would not have been selected. Indeed, Henry’s need to intervene to exclude competitors from the tender process shows that there were potential competitors, who may have offered cheaper or better services, or at the least placed competitive pressure on SLT and Feili to offer more favourable terms in their proposals.170Foot Note 170×ROP at p 6303; ROP at p 5897.Moreover, because the eventual contracts were awarded not based on the quality of work of the vendors, but because of Henry’s influence, this could be said to be actual harm (see,eg,GohNgak Engat [106(a)]. Motivation of Henry and Judy 165 It is evident that both Henry and Judy acted for personal gain, specifically the enrichment of Judy. The Defence does not dispute this on appeal, only pointing out that Henry did not personally benefit financially.171Foot Note 171×DFS at para 82.I note the familial relationship between Henry and Judy, and the evidence indicating that as early as 2005, Henry had been planning to “create a position for [Judy] represent my interest of my share of this co” through the attempted establishment of a local Chinese company.172Foot Note 172×ROP at p 6276.Further, he did this so that “no one should know I am behind the scence [sic].”173Foot Note 173×ROP at p 6276.Clearly, Henry’s motive behind Judy’s involvement was also his own personal gain. Such selfish motives are relevant to the assessment of culpability in sentencing and will rarely be treated with much sympathy (ZhaoZhipeng v Public Prosecutor[2008] 4 SLR(R) 879 at [37]). Premeditation and sophistication 166 The degree of premeditation and sophistication is a relevant factor in sentencing as it evinces a considered commitment towards law-breaking and therefore reflects greater criminality (LogachevVladislav v Public Prosecutor[2018] 4 SLR 609 (“Logachev”) at [56]). There were several aspects of Henry and Judy’s offending that pointed towards a high level of these factors being present. 167 First, from August 2005 onwards, Henry and Judy were already considering how they could profit from Seagate’s prospective business in China through corrupt schemes.174Foot Note 174×ROP at p 6275.Second, Henry exercised active interference in the tender process to ensure that only companies with agreements for commission with Judy were shortlisted for the tender process.175Foot Note 175×ROP at p 6286.Third, Henry provided confidential information to SLT and Feili in step with the schedule for the tender process so that they could prepare their bids accordingly.176Foot Note 176×ROP at p 5903.Fourth, Henry deliberately sought for representatives from SLT to make misrepresentations to Seagate to conceal his and Judy’s involvement in the scheme.177Foot Note 177×ROP at pp 5849–5850.This was accompanied by the use of Joseph as a proxy to further obscure any such link.178Foot Note 178×ROP at p 6345.Fifth, Henry and Judy created a system of code names when communicating to hide their references to Feili and SLT.179Foot Note 179×ROP at pp 3595–3597; ROP at pp 4401–4405; ROP at p 6295. 168 The cumulative inference from these actions is that both Judy and Henry exercised a high level of scheming in tandem with one another to avoid detection of their offences. This is an aggravating factor (Wong Chee Mengat [75]). Duration of offending 169 The duration of offending reflects an offender’s determination and is tied to the recalcitrance of the offender and the need for specific deterrence (Michael Tanat [123]). Henry and Judy received at least 50 bribe payments between 2007 and 2012, showing the longevity of their criminal enterprise. Role of Henry 170 Specific to Henry, it is also relevant to consider his seniority and position within Seagate, and the duty he owed as a Senior Director and member of the tender committees for both the 2006 Tender and 2009 Tender (Michael Tanat [99(g)(ii)];Public Prosecutor vMarzuki bin Ahmad and another appeal[2014] 4 SLR 623 at [28(d)]). Henry abused his position by disclosing confidential information to SLT and Feili, excluded other contenders from the tender process, and rigged the 2009 Tender. This was a serious compromise of the duty that he owed to Seagate. 171 Henry’s role in the scheme was also pivotal, as he initiated the idea to use Joseph as a middleman, engineered the agreements for 10% commission with the trucking companies, utilised his position on the tender committees to obtain confidential information, and influenced the tender process from the inside. By his own admission, he was acting “behind the scence [sic]” from the beginning.180Foot Note 180×ROP at p 6275.This is again, an aggravating factor (Michael Tanat [99(g)(iv)]). Transnational nature of the offence 172 There is no doubt that the scheme involved a transnational element. Henry, based in Singapore, sent confidential information to Judy, based in China. This allowed Chinese companies (SLT and Feili) to win contracts with Seagate. Subsequent payments made by these Chinese companies to Joseph’s Bank of China account ended up being transferred to Judy, who deposited a sum into her Singaporean bank account and used it to purchase Singaporean property. In this regard, I reject the Defence’s argument that the offences had no nexus to Singapore, and that they were “unintended prosecutions” caught by s 37 of the PCA.181Foot Note 181×DFS at para 67.There are multiple factors showing such a nexus: Henry and Judy are Singaporean, Seagate was operating in Singapore and the gratification received was transferred into Singapore’s financial system and subsequently used to purchase Singaporean property. Conversely, it was far clearer to me that the transnational element of the case increased the difficulty of investigating and prosecuting Henry and Judy. As the Prosecution noted, witness statements and bank documents had to be obtained through the Mutual Legal Assistance which required seeking the co-operation of foreign authorities. There was substantial delay to investigations as a result.182Foot Note 182×PFS at para 16.This is precisely the reason why offences with a transnational character are considered more serious (Logachevat [55]). Delay in prosecution 173 The Defence contends that several mitigating factors should be considered. In particular, it highlights that there had been a prejudicial delay in prosecution, and that mitigating weight should be placed on the advanced ages of both Henry and Judy. In relation to the delay, the Defence notes that the first requests to the Chinese authorities for mutual assistance were made more than three years after statements had been recorded from Henry and argues that the Investigation Officer had not been able to satisfactorily explain this delay.183Foot Note 183×DFS at paras 9 and 10; ROP at pp 1704–1705.FollowingChan Kum Hong Randy v Public Prosecutor[2008] 2 SLR(R) 1019 (“Randy Chan”), a reduction of sentence was necessary to account for the prejudice caused to Henry and Judy. 174 I agree that this was of some mitigating value. As the DJ acknowledged, a significant period of time had elapsed from the commencement of investigations until prosecution was initiated.184Foot Note 184×GD at [213] (ROP at pp 5143–5144).Indeed, the Prosecution conceded the same in its submissions below.185Foot Note 185×Prosecution’s Sentencing Submissions dated 21 September 2020 at para 28 (ROP at p 7390).However, there were significant differences between the present case andRandy Chan. The reason for the delay was not incomprehensible or entirely inexcusable (cfRandy Chanat [43]). One reason for this was that proceedings involving the Mutual Legal Assistance process would naturally be expected to be more protracted. Another reason is the sophistication of the scheme by the appellants as noted above at [167], which would have required time and effort for investigations to uncover. I thus view the DJ as having accurately accorded somemitigating weight to this factor. Old age of the appellants 175 At the time of the appeal, Henry and Judy were 74 and 70 years old respectively. I consider the relevance of this factor when assessing the application of the totality principle at the third stage of the sentencing process inPublic Prosecutor vRaveen Balakrishnan[2018] 5 SLR 799 at [98(c)], further along in the sentencing analysis. It is accordingly unnecessary to take this factor into account when assessing the sentence for the individual charges.",
        "The relevant s 5 and s 6 PCA precedents": "176 During proceedings both below and on appeal, there were no helpful precedents under s 5 of the PCA adduced by either the Defence or by the Prosecution. As correctly noted by the DJ, it was also relevant to consider the custodial sentences meted out for offences under s 6 of the PCA that involved a similar fact pattern. The Prosecution did tender several reported precedents for such offences in proceedings below, includingPublic Prosecutor v Lu Sang[2017] SGDC 199,Public Prosecutor v Lee Seng Kee[2018] SGDC 230, andPublic Prosecutor vToh Hong Huat[2017] SGDC 199. These were all District Court decisions. Post-GohNgak Eng, however, I am minded not to ascribe much weight to these decisions in calibrating the present sentence. Not only didGohNgak Engset out the relevant sentencing framework applicable for prospective s 6 cases, but it also bore more resemblance to the present set of facts than the other cases tendered by the Prosecution. In particular,GohNgak Engalso involved the appellant obtaining corrupt gratification through commissions from suppliers in exchange for arranging with an agent that the suppliers would be awarded jobs from an agent’s principal. This further strengthens my view that the facts of this case made it an appropriate situation to consider the application of theGohNgak Engframework, notwithstanding that the charge was under s 5 of the PCA.",
        "Application of the Goh Ngak Eng framework": "177  I now consider the notional sentence that would be imposed on Henry and Judy had theGohNgak Engframework been applied. 178 Following the first step of the framework inGohNgak Eng,I set out the applicable offence-specific factors that are relevant to the present case in italics: Offence-specific factorsFactors going towards harmFactors going towards culpability(a)Actual loss caused to principal(b)Benefit to giver of gratification(c)Type and extent of loss to third parties(d)Public disquiet(e)Offences committed as part of a group of syndicate(f)Involvement of a transnational element(g)Whether the public service rationale is engaged(h)Presence of public health of safety risks(i)Involvement of a strategic industry(j)Bribery of a foreign public official(a)Amount of gratification given or received(b)Degree of planning and premeditation(c)Level of sophistication(d)Duration of offending(e)Extent of the offender’s abuse of position and breach of trust(f)Offender’s motive in committing the offence(g)Presence of threats, pressure or coercion(h)The role played by the offender in the corrupt transaction 179 Under the factors going toward harm, I accept that there was actual loss caused to the principal Seagate, as elaborated at [161]–[164] above. As noted at [172], it was also significant that there was a transnational element to the offences. 180 I also consider that there was substantial benefit to SLT and Feili, the givers of the gratification. Through the intervention and rigging of Henry, they were able to reap the rewards of tender contracts with Seagate worth RMB42,558,215 (in SLT’s case) and RMB70,794,738 and USD 24,813,114.57 (in Feili’s case). Henry’s influence was decisive in being able to secure these bids, and more specifically, bids at a price point that was as beneficial to SLT and Feili as possible. 181 I agree with the Prosecution that there was a loss of opportunity to participate in the tender process by third party bidders. Not only were they disadvantaged by Feili and SLT’s access to confidential information, but they were also excluded from the 2009 Tender. 182 Under the factors going towards culpability the following were aggravating, for reasons addressed above: (a) the value of the total gratification received; (b) the significant degree of planning and premeditation; (c) the sophistication of the offences; (d) the duration of the offending; and (e) Henry and Judy’s motivation in committing the offence for personal gain. Specific to Henry, it was further aggravating that there was abuse of his position in Seagate, and that he played a key role in the corrupt transaction. 183 Under step two, the Prosecution submits that Henry’s charges should be assessed as falling within the categories of moderate harm and high culpability. I agree with this assessment. InGohNgak Eng, the harm from rigging a tender scheme was similarly assessed to be moderate due to the presence of actual harm to the interests of principal, for reasons that also apply to the present case (GohNgak Engat [113]). The same should apply here. As to the level of culpability, Henry had played a pivotal role in initiating, carrying out, and following up on a sophisticated scheme over an extended duration of time that exploited the trust placed in him as a member of the tender committee of Seagate – all for personal gain. His level of culpability is clearly high. 184 Under step three, the indicative custodial sentences should fall within the sentencing range of two to three years’ imprisonment. I agree with the Prosecution’s submissions that the sentences for the charges with the highest amounts of gratification (ie,the 28th, 34th, 43rd, 46th, 48th and 49th charges involving more than S$90,000) should attract an indicative starting point of 33 months’ imprisonment. I also agree that the first charge involving the smallest amount of gratification of S$3,502.66 should fall within the lowest end of the sentencing range at 24 months’ imprisonment. However, minor downward calibrations are necessary for some of the proposed sentences for the charges involving gratification of between S$10,000 and S$80,000 in order to more accurately reflect the spectrum of the value of gratification involved. 185  Under step four, in taking account of offender-specific factors, the Prosecution also notes that Henry’s indicative custodial sentence should be calibrated slightly upward to account for his antecedents. I agree. Henry was previously convicted on 31 October 2012 on 12 charges under s 6(a) of the PCA related to offences committed between 2004 and 2010 while he was employed at Seagate. The antecedents are for similar offences and reflect a recalcitrance on his part. That his conviction for these charges was based on offending that was in part chronologically prior to the commission of the present set of offences is not a barrier to their relevance:Public Prosecutor v Boon Kiah Kin[1993] 2 SLR(R) 26 at [37]. 186 I agree with the DJ that some mitigating weight should be attributed to the delay in proceedings.186Foot Note 186×GD at [215] (ROP at pp 5143–5144).I accept that the delay was not because of any fault on the Prosecution’s part. However, I accept that this delay resulted in some prejudice to Henry, in that he would have had to live with the uncertainty of outcome over the investigations for a substantial amount of time. The indicative and calibrated sentences for Henry’s charges are set out at Annex C. 187 As for Judy, the Prosecution submits that her charges should fall within the categories of moderate harm and medium culpability. I agree with this in light of her reduced role in the scheme compared to Henry. The indicative sentencing range for this category is one to two years’ imprisonment. I find it appropriate to place the first charge (total gratification S$3502.66) at the lowest end of this range, and to place the charges involving gratification of more than S$90,000 close to the higher end of the range at 22 months’ imprisonment. 188 The Prosecution further submits that no adjustment to the indicative sentence is necessary for Judy after consideration of offender-specific factors. I find that a downward adjustment to the sentence is necessary on account of the delay in proceedings. I set out both the indicative and calibrated sentences for Judy’s charges at Annex D. 189 Finally, under step five, further adjustments can be made to take into account the totality principle. I deal with this after considering the sentence for the CDSA charge.",
        "Assessment of sentence": "190 Given the absence of relevant precedents under s 5 of the PCA, and the fact that most of the offence-specific sentencing considerations in the present case happen to be captured under theGohNgak Engframework, I am inclined to ascribe significant weight to the sentencing indication based on theGohNgak Engframework. In my view, no further modification to the notional sentence under the framework is necessary for Henry before consideration of the totality principle and the global sentence. As for Judy, although theGohNgak Engframework would be of slightly less relevance given that she did not subordinate her loyalty to any principal, I did not consider any further modification of the notional sentence under the framework necessary as: (a) she was fully aware and actively made use of Henry’s abuse of trust in relation to Seagate as part of the scheme, and (b) this would have been taken into account in finding she had a reduced role in the scheme in assessing her culpability. 191 I am also satisfied that the sentences are appropriate having regard to the sentences imposed inGohNgak Engitself. The duration of the offending was longer than inGohNgak Eng, the amount of gratification was four times as much, and the level of sophistication was higher.GohNgak Engwas also a case in which the appellant had pleaded guilty. Additionally, Henry’s role in the scheme is much more aggravated than that of the appellant inGohNgak Eng, involving a breach of trust in relation to his position within Seagate. There is thus good reason for the comparative uplift of sentences in the present case.",
        "The CDSA charge": "192 In relation to the CDSA charges (the 51st charges), the Defence submits that because the predicate PCA offences should attract non-custodial sentences, a custodial term would not be warranted for the CDSA charges either.187Foot Note 187×DFS at para 90–91.I do not accept this. The PCA offences were serious, and the sentence of 18 months’ imprisonment under s 44(1)(a) of the CDSA is not manifestly excessive. I therefore affirm the sentences in respect of Henry’s and Judy’s 51st charges. For completeness, I agree with the DJ that the fact that the predicate offences were not committed in Singapore is not a barrier to adopting the framework inHuang Ying-Chun v Public Prosecutor[2019] 3 SLR 606 to determine the sentence for the CDSA charge.",
        "Whether the global sentence imposed by the DJ was manifestly excessive": "193 I now determine which individual sentences should run consecutively. I agree with the DJ that the sentence for the CDSA charges ought to run consecutively with one or more of the PCA charges as they do not form part of a single transaction.188Foot Note 188×GD at [226] (ROP at p 5151).In the proceedings below, the DJ ordered that the sentences for the 1st, 9th, 28th, 34th, 49th, and 51st charges should run consecutively for Henry, and the sentences for the 1st, 9th, 34th, 49th, and 51st charges should run consecutively for Judy. Accounting for the revised individual sentences, this would give a global total of 128 months’ imprisonment for Henry and 65 months’ imprisonment for Judy. 194 I ascribe some weight to the advanced ages of both appellants. As of the time of the hearing in February 2023, Henry and Judy were 73 and 70 years old respectively. While there is no general principle that the advanced age of an offender is always mitigating (Yap Ah Lai v Public Prosecutor[2014] 3 SLR 180 (“Yap Ah Lai”) at [93];Public Prosecutor v UI[2008] 4 SLR(R) 500 at [78]), the principle of equal impact would come into play where the advanced age of an offender would result in an offender suffering more than others who are similarly situated. InYap Ah Laiat [91], Sundaresh Menon CJ explained this as follows: In relation to the offender’s prospects of his future life expectation, the principle of equal impact explains why some mitigation may be appropriate. The principle is that “when an offender suffers from certain handicaps that would make his punishment significantly more onerous, the sanction should be adjusted in order to avoid its having an undue differential impact on him”: Andrew von Hirsch and Andrew Ashworth,Proportionate Sentencing: Exploring the Principles(Oxford University Press, 2005) (“Proportionate Sentencing”) at p 172. Therefore a sanction may be lightened where it may have an undue or disproportionate impact on the offender:Proportionate Sentencingat p 176. The consideration particularly pertinent in relation to an elderly offender is the prospect that a jail term may mean spending much of the rest of his life in prison. This was indeed the principle to which the Court of Appeal inPP v UI([58] supra) was giving voice in the passage cited above. This is justified not because the court is extending mercy to the offender in view of his advanced age, but because the court is unwilling to make such offenders suffermorethan others who are similarly situated: seeProportionate Sentencingat p 173. [Emphasis in original] 195 Examining the present circumstances, I consider it appropriate to modify the number of sentences to be run consecutively to account for the advanced ages of Henry and Judy. Accordingly, I order the sentences for the 1st, 34th, 49th, and 51st charges for Henry to run consecutively, and for the sentences for the 1st, 34th, 49th, and 51st charges for Judy to run consecutively. This gives an aggregate sentence of 84 and 56 months’ imprisonment for Henry and Judy respectively. In my view, these aggregate sentences are not disproportionate or crushing.",
        "Whether the DJ erred in refusing to enforce the Penalty by way of an attachment order and default imprisonment sentence": "196 Moving on to the issue of the enforcement of the Penalty, I consider whether the DJ erred in refusing to enforce the Penalty by way of an attachment order. To begin, it is undisputed that the DJ erroneously ordered Judy to pay a sum of S$2,320,864.10 under s 13(1) of the PCA when this amount should have been S$2,324,954.45 (see [42] above).189Foot Note 189×GD at [240] (ROP at p 5155).I exercise my revisionary jurisdiction and amend the amount which is the subject of the penalty order from S$2,320,864.10 to S$2,324,954.45. 197 Concerning the measures to enforce the Penalty Order, the Prosecution proposed the Penalty Order to be enforced through an attachment order on property held by Judy under s 319(b)(iii) of the CPC.190Foot Note 190×PFS at para 52.This would be accompanied by multiple default imprisonment terms under s 319(b)(v) of the CPC, where each of the 50 charges under the PCA against the appellants would attract an individual penalty order and hence default sentence for an aggregate term of 312 weeks’ imprisonment.191Foot Note 191×PFS at para 52.This was vigorously objected to by the Defence. 198 Having regard to the updates that both parties provided to the court soon after the hearing on 24 February 2023, I do not deem it necessary to rule on this issue. Having reached an agreement on a method of payment of the Penalty Order after the conclusion of the hearing, both the Prosecution and Judy subsequently informed the court in writing that a cashier’s order dated 21 March 2023 for the sum of S$2,324,954.45 had been made by Judy and handed over to the CPIB on 23 March 2023.192Foot Note 192×Letter from BMS Law LLC to the court dated 23 March 2023 at para 2; Letter from Prosecution to the court dated 24 March 2023 at para 2.This was acknowledged by the CPIB in writing.193Foot Note 193×Letter from BMS Law LLC to the court dated 23 March 2023 at para 3. 199 As the cashier’s order in CPIB’s possession evidenced payment for the full amount of the revised penalty sum from which Judy could not resile, no further order for attachment to enforce the Penalty Order is necessary. In the circumstances, I do not deem it necessary to consider whether the duration of default imprisonment imposed by the DJ was manifestly inadequate.",
        "CM 3": "200 Next, for completeness, I turn to consider CM 3. In CM 3, the Prosecution seeks to adduce further evidence in the form of property title records from the Singapore Land Authority and letters from the United Overseas Bank, Maybank Singapore Ltd, and the Central Provident Fund pertaining to evidence of property held by Judy.194Foot Note 194×Prosecution’s Submissions on Criminal Motion No 3 of 2023 dated 16 February 2023.During the hearing, counsel for Judy, Mr Bachoo Mohan Singh confirmed that they do not object to the admission of the documents in CM 3. This was confirmed in writing following the hearing on 24 February 2023.195Foot Note 195×Letter from BMS Law LLC to the court dated 24 February 2023 at para 3.I accordingly allow CM 3. However, in light of my decision on the enforcement of the penalty order, further inquiry into the assets held by Judy is unnecessary.",
        "Conclusion": "201 For the reasons set out above, I dismiss the appellants’ appeal against their convictions in MA 9011/2021/01 and MA 9012/2021/01. I also dismiss the appellants’ appeal against their sentences in MA 9011/2021/01 and MA 9012/2021/01. I partially allow the Prosecution’s appeal against the appellants’ sentences in MA 9011/2021/02 and MA 9012/2021/02 and set aside the sentence of 50 and 41 months’ imprisonment imposed by the DJ on Henry and Judy respectively. I impose an aggregate sentence of 84 months’ imprisonment for Henry, and an aggregate sentence of 56 months’ imprisonment for Judy. 202 I further revise the quantum of the Penalty Order to S$2,324,954.45, and direct that the Penalty Order be paid with the proceeds of the cashier’s order dated 21 March 2023 handed by Judy to the CPIB on 23 March 2023. The terms of the default imprisonment term are to remain.  Vincent HoongJudge of the High Court Bachoo Mohan Singh and Too Xing Ji (BMS Law LLC) for the appellants in HC/MA 9011/2021/01 and HC/MA 9012/2021/01 and the respondents in HC/MA 9011/2021/02 and HC/MA 9012/2021/02; Jiang Ke-Yue, Grace Lim, Ang Siok Chen, David Menon and Ong Xin Jie (Attorney-General’s Chambers) for the appellant in HC/MA 9011/2021/02 and HC/MA 9012/2021/02 and the respondent in HC/MA 9011/2021/01 and HC/MA 9012/2021/01.       Annex A:196Foot Note 196×GD at [239]–[240], Annex 2 (ROP at pp 5155, 5159–5160). Date of receipt(on or about)PayorAmount(RMB)Amount(S$ equivalent)197Foot Note 197×Calculated based on the average monthly exchange rate of CNY/SGD between April 2007 and Nov 2010 (100 CNY to SGD 20.45); GD at p 93 (ROP at p 5141).6 April 2007SLT17,128.003,502.6612 July 2007SLT45,014.009,205.326 August 2007SLT44,076.009,013.509 October 2007SLT94,425.0019,309.821 November 2007SLT39,153.008,006.756 December 2007SLT58,243.0011,910.633 March 2008SLT66,087.0013,514.7211 March 2008SLT46,792.009,568.927 April 2008SLT119,597.0024,457.4618 June 2008SLT43,002.008,793.8718 July 2008SLT109,732.0022,440.0825 September 2008SLT48,147.009,846.0126 September 2008SLT67,658.0013,835.9910 October 2008SLT41,652.008,517.796 November 2008SLT44,521.009,104.5010 November 2008SLT86,723.0017,734.766 January 2009SLT59,533.0012,174.446 February 2009SLT29,038.005,938.2419 March 2009SLT103,361.0021,137.2224 March 2009SLT127,539.0026,081.6013 May 2009SLT109,117.0022,314.3124 June 2009SLT38,644.007,902.6612 August 2009SLT148,051.0030,276.2817 September 2009SLT147,968.0030,259.3020 October 2009SLT141,934.0029,025.3621 November 2008Feili395,790.0080,938.6521 November 2008Feili348,640.0071,296.5218 December 2008Feili495,180.00101,263.8018 February 2009Feili337,450.0069,008.1820 February 2009Feili313,280.0064,065.446 March 2009Feili398,680.0081,529.6527 March 2009Feili249,040.0050,928.4321 April 2009Feili323,050.0066,063.398 June 2009Feili534,410.00109,286.3027 July 2009Feili308,250.0063,036.8131 August 2009Feili339,960.0069,521.4731 August 2009Feili355,160.0068,539.8828 September 2009Feili253,420.0051,824.1322 October 2009Feili281,370.0057,539.8814 December 2009Feili386,140.0078,965.2430 December 2009Feili290,088.0059,322.703 February 2010Feili337,170.0068,950.922 March 2010Feili455,070.0093,061.3530 March 2010Feili346,640.0070,887.539 July 2010Feili331,100.0067,709.6113 July 2010Feili580,008.53118,611.154 August 2010Feili397,927.2081,375.7131 August 2010Feili477,738.8697,697.1127 September 2010Feili559,123.05114,340.0919 November 2010Feili397,204.8081,227.98Total amount (RMB)11,369.025.442,320,864.11        Annex B:198Foot Note 198×GD at [7], [221] (ROP at pp 5054–5056, 5149). ChargeSum subject of charge (RMB)Henry’s sentence (months)Judy’s sentence (months)117,128.0011245,014.0022344,076.0022494,425.0033539,153.0022658,243.0022766,087.0022846,792.00229119,597.003 (consecutive)3 (consecutive)1043,002.002211109,732.00331248,147.00221367,658.00221441,652.00221544,521.00221686,723.00331759,533.00221829,038.002219103,361.003320127,539.004421109,117.00332238,644.002223148,051.004424147,968.004425141,934.004426395,790.008827348,640.007728495,180.009 (consecutive)929337,450.007730313,280.006631398,680.008832249,040.005533323,050.007734534,410.009 (consecutive)9 (consecutive)35308,250.006636339,960.007737355,160.007738253,420.005539281,370.006640386,140.007741290,088.006642337,170.007743455,070.008844346,640.007745331,100.007746580,008.53101047397,927.208848477,738.869949559,123.0510 (consecutive)10 (consecutive)50397,204.8088   Annex C: ChargeDAC No.Value of gratification(S$)Applicable sentencing rangeIndicative custodial term(months)Calibrated custodial term(months)1st chargeDAC-921493-20173,502.66Two to three years’ imprisonment24162nd chargeDAC-921494-20179,205.3225173rd chargeDAC-921495-20179,013.5025174th chargeDAC-921496-201719,309.8226185th chargeDAC-921497-20178,006.7525176th chargeDAC-921498-201711,910.6326187th chargeDAC-921499-201713,514.7226188th chargeDAC-921500-20179,568.9225179th chargeDAC-921501-201724,457.46271910th chargeDAC-921502-20178,793.87251711th chargeDAC-921503-201722,440.08271912th chargeDAC-921504-20179,846.01251713th chargeDAC-921505-201713,835.99261814th chargeDAC-921506-20178,517.79251715th chargeDAC-921507-20179,104.50251716th chargeDAC-921508-201717,734.76261817th chargeDAC-921509-201712,174.44261818th chargeDAC-921510-20175,938.24251719th chargeDAC-921511-201721,137.22271920th chargeDAC-921512-201726,081.60271921st chargeDAC-921513-201722,314.31271922nd chargeDAC-921514-20177,902.66251723rd chargeDAC-921515-201730,276.28271924th chargeDAC-921516-201730,259.30271925th chargeDAC-921517-201729,025.36271926th chargeDAC-921518-201780,938.65312327th chargeDAC-921519-201771,296.52312328th chargeDAC-921520-2017101,263.80332529th chargeDAC-921521-201769,008.18302230th chargeDAC-921522-201764,065.44302231st chargeDAC-921523-201781,529.65312332nd chargeDAC-921524-201750,928.43292133rd chargeDAC-921525-201766,063.39302234th chargeDAC-921526-2017109,286.30332535th chargeDAC-921527-201763,036.81302236th chargeDAC-921528-201769,521.47302237th chargeDAC-921529-201768,539.88302238th chargeDAC-921530-201751,824.13292139th chargeDAC-921531-201757,539.88292140th chargeDAC-921532-201778,965.24312341st chargeDAC-921533-201759,322.70292142nd chargeDAC-921534-201768,950.92302243rd chargeDAC-921535-201793,061.35332544th chargeDAC-921536-201770,887.53312345th chargeDAC-921537-201767,709.61302246th chargeDAC-921538-2017118,611.15332547th chargeDAC-921539-201781,375.71312348th chargeDAC-921540-201797,697.11332549th chargeDAC-921541-2017114,340.09332550th chargeDAC-921542-201781,227.983123   Annex D: ChargeDAC No.Value of gratification(S$)Applicable sentencing rangeIndicative custodial term(months)Calibrated custodial term(months)1st chargeDAC-921544-20173,502.66One to two years’ imprisonment1262nd chargeDAC-921545-20179,205.321373rd chargeDAC-921546-20179,013.501374th chargeDAC-921547-201719,309.821485th chargeDAC-921548-20178,006.751376th chargeDAC-921549-201711,910.631487th chargeDAC-921550-201713,514.721488th chargeDAC-921551-20179,568.921379th chargeDAC-921552-201724,457.4615910th chargeDAC-921553-20178,793.8713711th chargeDAC-921554-201722,440.0815912th chargeDAC-921555-20179,846.0113713th chargeDAC-921556-201713,835.9914814th chargeDAC-921557-20178,517.7913715th chargeDAC-921558-20179,104.5013716th chargeDAC-921559-201717,734.7614817th chargeDAC-921560-201712,174.4414818th chargeDAC-921561-20175,938.2413719th chargeDAC-921562-201721,137.2215920th chargeDAC-921563-201726,081.6015921st chargeDAC-921564-201722,314.3115922nd chargeDAC-921565-20177,902.6613723rd chargeDAC-921566-201730,276.2815924th chargeDAC-921567-201730,259.3015925th chargeDAC-921568-201729,025.3615926th chargeDAC-921569-201780,938.65211527th chargeDAC-921570-201771,296.52211528th chargeDAC-921571-2017101,263.80221629th chargeDAC-921572-201769,008.18201430th chargeDAC-921573-201764,065.44201431st chargeDAC-921574-201781,529.65211532nd chargeDAC-921575-201750,928.43191333rd chargeDAC-921576-201766,063.39201434th chargeDAC-921577-2017109,286.30221635th chargeDAC-921578-201763,036.81201436th chargeDAC-921579-201769,521.47201437th chargeDAC-921580-201768,539.88201438th chargeDAC-921581-201751,824.13191339th chargeDAC-921582-201757,539.88191340th chargeDAC-921583-201778,965.24211541st chargeDAC-921584-201759,322.70191342nd chargeDAC-921585-201768,950.92201443rd chargeDAC-921586-201793,061.35221644th chargeDAC-921587-201770,887.53211545th chargeDAC-921588-201767,709.61201446th chargeDAC-921589-2017118,611.15221647th chargeDAC-921590-201781,375.71211548th chargeDAC-921591-201797,697.11221649th chargeDAC-921592-2017114,340.09221650th chargeDAC-921593-201781,227.982115"
    }
}