{
    "case_title": "Thong Soon Seng vMagnus Energy Group Ltd",
    "ncitation": "[2023] SGHC 5",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 It is common ground that the plaintiff paid a total of $4m to the defendant in September and October 2016.1Foot Note 1×Statement of Claim (Amendment No. 1) dated 16 September 2021 (“SOC”) at paras 3–8.The plaintiff’s case is that the defendant is obliged to repay the $4m to the plaintiff as the combined result of three loan agreements he entered into with the defendant. The plaintiff therefore seeks to recover the $4m from the defendant in debt, alternatively in unjust enrichment.2Foot Note 2×SOC at pp 12–13. 2 The defendant accepts that it received the $4m from the plaintiff.3Foot Note 3×Defence (Amendment No. 1) dated 30 September 2021 (“Defence”) at paras 12 and 17(b).But the defendant denies that it received the money as a loan. The defendant asserts instead that the plaintiff paid the $4m to the defendant in order to discharge a debt which a third party then owed to a subsidiary of the defendant.4Foot Note 4×Defence at paras 13 and 17(b).The defendant therefore denies any liability to repay the sum of $4m to the plaintiff, whether in debt or in unjust enrichment. 3 Having heard the parties’ evidence and submissions, I have dismissed the plaintiff’s claim. The plaintiff has appealed against my decision. I now set out the grounds for my decision.",
        "The parties’ cases": "",
        "The plaintiff’s case": "4 The plaintiff’s primary case is as follows. 5 The plaintiff concluded three loan agreements orally with the defendant in late 2016 and early 2017. 6 The plaintiff concluded the first loan agreement with the defendant in September 2016. Under this agreement the plaintiff lent $1m to the defendant on terms that the defendant would repay the plaintiff $1.1m within one month.5Foot Note 5×SOC at para 4.Pursuant to the first loan agreement, the plaintiff handed Mr Ho a cheque for $1m drawn in the defendant’s favour.6Foot Note 6×SOC at para 7.The defendant duly deposited the cheque into its account. 7 The plaintiff concluded the second loan agreement with the defendant in October 2016. Under this agreement, the plaintiff lent the defendant $3m on terms that the defendant would pay the plaintiff $4.4m by 31 December 2016.7Foot Note 7×SOC at para 8.This sum of $4.4m comprised the principal sum of $1m advanced under the first loan agreement, a further principal sum of $3m advanced under the second loan agreement and the sum of $400,000 as interest on both principal sums. Pursuant to the second loan agreement, the plaintiff handed Mr Ho a cheque for $2m8Foot Note 8×SOC at para 11.and another cheque for $1m,9Foot Note 9×SOC at para 11.both drawn in the defendant’s favour. The defendant duly deposited both cheques into its account. 8 The plaintiff concluded the third loan agreement with the defendant in January 2017. The plaintiff did not lend the defendant any further funds under this agreement. Instead, this agreement varied the second loan agreement in two ways.10Foot Note 10×SOC at para 13.First, the plaintiff gave the defendant a year,ieuntil January 2018, to repay the principal sum of $4m with interest. Second, the defendant agreed that the interest payable on the principal sum of $4m should be $600,000 instead of $400,000. 9 The plaintiff concluded the three loan agreements with Mr Luke Ho Khee Yong (“Mr Ho”),11Foot Note 11×SOC at paras 3, 4, 7, 8, 10, 11, 13 and 15.the chief executive officer of the defendant at that time.12Foot Note 12×SOC at para 3.Mr Ho was the defendant’s agent and had the defendant’s actual implied authority or ostensible authority to conclude the loan agreements.13Foot Note 13×SOC at paras 6, 9 and 14.The defendant is therefore bound by the agreements and obliged to repay the plaintiff the $4.6m in debt. 10 The defendant has failed to pay the $4.6m or any part of it to the plaintiff, whether in January 2018 or otherwise. The defendant is therefore liable to the plaintiff in the sum of $4.6m.",
        "The defendant’s case": "11 The defendant’s case is that Mr Ho did not have its authority to seek loans from anyone let alone to enter into any loan agreements on its behalf with anyone.14Foot Note 14×Defence at para 11 and 15.The defendant is therefore not bound by any loan agreements which Mr Ho may have purported to enter into with the plaintiff on the defendant’s behalf. 12 In addition to denying Mr Ho’s authority, the defendant addresses directly the plaintiff’s assertion that he paid the $4m to the defendant as a loan. The defendant does so by advancing the following positive case as to the reason for the payment. 13 Between May 2015 and April 2016, the defendant through its wholly owned subsidiary MEG Global Resources Limited (“MGR”) paid a total of $10.9m to a third party, PT Hanjungin (“PTH”), to invest in four of PTH’s projects in Indonesia.15Foot Note 15×Defence at para 9.One of these projects fell through. As a result, PTH came under an obligation to repay to MGR the sum of $4m which MGR had invested in this project.16Foot Note 16×Defence at para 10(b). 14 After receiving several reminders from the defendant, PTH informed the defendant that it would repay the $4m due to MGR not directly, but by an “alternative arrangement”. Then, in September and October 2016, at the request of PTH and for and on behalf of PTH, the plaintiff handed the three cheques totalling $4m to Mr Ho.17Foot Note 17×Defence at paras 10 and 13.The plaintiff’s payment of this $4m was PTH’s foreshadowed “alternative arrangement for repaying the $4m which PTH then owed to MGR”.18Foot Note 18×Defendant’s Written Closing Submissions dated 21 October 2022 (“DCS”) at paras 14–15.Consistently with this, the defendant has recorded this $4m in its books of account as repayments by PTH which the defendant received on behalf of MGR.19Foot Note 19×Defence at paras 15 and 17(b).",
        "The claim in debt": "",
        "Burden of proof": "15 I start my analysis of the plaintiff’s claim in debt by considering the allocation of the burden of proof on that claim. The starting point is 105 of the Evidence Act (Cap 97, 1997 Rev Ed) (“the Act”). Section 105 provides that the “burden of proof as to any particular fact lies on that person who wishes the court to believe in its existence”. 16 In a civil action, it is in the pleadings that each party sets out, whether by way of claim or defence, the facts which it wants the court to believe to be true. Accordingly, a proper consideration of the allocation of the burden of proof begins with a consideration of the pleadings. The plaintiff bears the burden of proving the loans 17 In his statement of claim, the plaintiff pleads the following two principal facts: (a) that the plaintiff entered into three loan agreements with the defendant under which it lent $4m to the defendant;and(b) that Mr Ho had actual express or ostensible authority to conclude the loan agreements on the defendant’s behalf. The plaintiff thereby formally states its wish that the court believes these two facts to be true. Section 105 of the Act therefore operates to place the legal burden of proving both facts on the plaintiff. The plaintiff’s claim in debt will fail if he fails to discharge his burden oneitherfact. 18 In its defence, the defendant pleads a positive case as to the reason for the plaintiff paying $4m to the defendant (see [12]–[14] above). In so far as the defendant wishes the court to believe those facts to be true, s 105 of the Act places the legal burden of proving those facts on the defendant. But persuading the court to believe those facts to be true is not the only means by which the defendant can succeed in its defence to the plaintiff’s claim in debt. Another means by which the defendant can succeed is simply by demonstrating that the plaintiff has failed to discharge his legal burden of provingeitherof the two principal facts he has pleaded. Thus, the defendant can succeed simply by demonstrating that the plaintiff has failed to prove on the balance of probabilities that the plaintiff paid the $4m to the defendantasloans. 19 The same point can be put from the court’s perspective as follows. The court’s task in analysing the plaintiff’s claim in debt is not to decide whether the plaintiff’s positive case as to the true reason for his having paid $4m to the defendant is more likely to be true than the defendant’s positive case on that issue orvice versa. The court’s task is to determine only whether the plaintiff has proven his case on the balance of probabilities (RhesaShipping Company SA v Edmunds (The Popi M)[1985] 1 WLR 948;Clarke Beryl Claire (personal representative of the estate of Eugene Francis Clarke, deceased) and others v SilkAir (Singapore) Pte Ltd[2002] 1 SLR(R) 1136 at [63];Surender Singh s/o Jagdish Singh and another (administrators of the estate ofNarindar Kaur d/o Sarwan Singh, deceased) v Li Man Kay and others[2010] 1 SLR 428 at [121]). No presumption of an obligation to repay 20 An evidential question then arises as to whether an obligation to repay the $4m can be presumed simply by reason of the defendant’s formal admission,ieits admission on the pleadings, that itreceivedthe $4m from the plaintiff. If so, that would suffice to place an evidential burden on the defendant to disprove an obligation to repay the money. 21 It is true that, inSeldon v Davidson[1968] 1 WLR 1083 (“Seldon”), the English Court of Appeal held that a payment of money to a stranger gives riseprima facieto an implied obligation to repay the money. It is also true that, inPower Solar System Co Ltd (in liquidation) vSuntech Power Investment Pte Ltd[2018] SGHC 233 (“Power Solar System”), Mavis Chionh Sze Chyi JC (as she then was) held thatSeldonwas part of Singapore law (at [103(c)]). Chionh JC concluded that, when a plaintiff proves the payment of a sum of money to a defendant in the absence of a plausible explanation for the payment, a presumption of an obligation to repay the sum arises, thereby casting an evidential burden on the defendant on this issue. If the defendant fails to address that evidential burden, the plaintiff will have discharged his legal burden and the court will be entitled to find that the parties intended the sum to be repaid (at [103(d)]). 22 More recently, however, the Court of Appeal inPT Bayan Resources TBK and another v BCBC Singapore Pte Ltd and another[2019] 1 SLR 30 (“PT Bayan”) held that a defendant’s plea admitting only that it hadreceiveda sum of money from a plaintiff was not the same as a plea admitting that the sum was adebt(at [144]). Since the defendant inPT Bayanhad admitted receiving the money but had also gone on to plead that the sum was a gift from the plaintiff, his defence did not admit that he wasindebtedto the plaintiff in that sum. The legal and the evidential burden of proving that the payment was a loan remained on the plaintiff. 23 Even more recently, inTan Chin Hock v Teo Cher Koon and another and another appeal[2022] 2 SLR 314 (“Tan Chin Hock”), the Appellate Division of the High Court (“the AD”) applied thisdictumof the Court of Appeal fromPT Bayan. InTan Chin Hock, the plaintiff alleged that it had paid certain sums to the defendant under a loan agreement. In response, the defendant’s pleading denied ever incurring a debt to the plaintiff (at [66]). The AD held that this pleading left both the legal and the evidential burden on the plaintiff to prove the purpose of the payments,ie, to prove that the payments were loans. 24 These observations apply squarely to the present case. The defendant’s pleading admits receiving the $4m from the plaintiff but denies that it incurred any debt whatsoever to the plaintiff as a result.20Foot Note 20×Defence at paras 12–13 and 17–18.The defendant’s pleading does not permit a presumption that the $4m was to be repaid to arise. On this issue, therefore, there is not even an evidential burden on the defendant. The plaintiff bears both the legal and the evidential burden of proving the debt,ie, that the plaintiff entered into three loan agreements with the defendant under which it lent $4m to the defendant (see [17(a)] above).",
        "The plaintiff has failed to discharge his burden": "25 With this allocation of the burden of proof in mind, I turn to consider whether the plaintiff has discharged his burden of proof on the existence of the loan agreements. In my view, the plaintiff has failed to discharge this burden. 26 I accept all of the points made by the defendant in its written submissions as to why the plaintiff’s payment of $4m to the defendant wasnotlikely to have been loans under three loan agreements. I make in particular the following points. 27 First, the plaintiff is an experienced businessman.21Foot Note 21×Thong Soon Seng’s Affidavit of Evidence-in-Chief dated 14 January 2022 (“P AEIC”) at para 4.But his conduct in extending the alleged loans to the defendant deviated significantly from the conduct which would be expected of an experienced businessman. The most significant deviation is that the plaintiff failed to document the alleged loans. This deviation is particularly significant given the high interest rate which the plaintiff alleges he charged the defendant on the first loan. That interest rate was 10% for the one-month duration of the loan, equivalent to 120% per annum. Risk and reward being directly correlated, an interest rate that high suggests that the plaintiff saw himself as taking on a very high risk by extending the first alleged loan to the defendant. That, in turn, suggests a very high risk of delayed repayment or default and a very high risk of litigation to recover the alleged loan. In any litigation, it would be essential to prove the loan. It is contrary to the inherent probabilities that an experienced businessman lending this quantum of money in these circumstances and on these terms, as the plaintiff alleges he did, would have done so without documenting the loans, even informally by a simple IOU or WhatsApp message. 28 Second, the plaintiff is not just an experienced businessman but also an experienced moneylender. Furthermore, he has substantial experience of actually having to resort to litigation to recover money from his borrowers.22Foot Note 22×P AEIC at para 4; DCS at paras 36–40.The plaintiff’s conduct in allegedly lending this money to the defendant is quite different from his own past conduct in other moneylending transactions. The plaintiff alleges that he lent $4m to the defendant without any documentation. But when the plaintiff lent money to a Singapore listed company called Xpress Holdings Ltd (“Xpress”)23Foot Note 23×Agreed Bundle of Documents Vol 1 (“1AB”) 44–55.and an individual named Fong Kah Kuen @ Foong Kah Kuen (“Mr KK Fong”) in 2014, the plaintiff ensured that the borrowers signed written loan agreements.24Foot Note 24×1AB 38–43; DCS at paras 36–39. 29 The plaintiff alleges that he lent $4m to the defendant without any security or other form of recourse. But when the plaintiff lent money to Mr KK Fong and another man named Chu Sau Ben, he obtained post-dated cheques from both men.25Foot Note 25×DCS at para 39.Further, when he lent money to Mr KK Fong, he sought and obtained a guarantee.26Foot Note 26×1AB 47; DCS at para 37.As against Xpress, he also secured a contractual right to have new shares in Xpress issued to him upon default.27Foot Note 27×1AB 48; DCS at para 39. 30 Third, the plaintiff’s conductafteradvancing the loans also deviates from that which would be expected of an experienced businessman and an experienced moneylender. It is contrary to the inherent probabilities that an experienced businessman and an experienced moneylender would lend a defaulting borrower a multiple of the amount in default. It is equally contrary to the inherent probabilities that an experienced businessman and an experienced moneylender would charge a defaulting borrower a lower effective interest rate after each default. But that is precisely what the plaintiff claims he did. 31 The plaintiff allegedly lent $1m to the defendant under the first loan. The defendant was unable to repay either principal or interest at the end of that time. Despite this, the plaintiff alleges that he agreed to lend the defendant a further $3m by way of the second loan.28Foot Note 28×SOC at para 8.It is inherently unlikely that an experienced moneylender will lend a borrower in default fresh funds equal to three times the amount in default. 32 What may make a further loan like this more likely on the inherent probabilities is if the experienced moneylender’s increased reward for the further loan matches the increased risk he is taking on. But, according to the plaintiff, the effective interest rate for the second loan was allegedly 10% over three months (ie, 40% per annum). This is one-third of the effective interest rate on the first loan, which was 10% over a one-month period (ie, 120% per annum). The decline in the plaintiff’s alleged reward is even more striking under the third loan agreement. Under that agreement, as I have already mentioned, the plaintiff agreed to give the defendant a year to repay the total amount of $4m. But the effective interest rate on the third loan was even lower than that on the second loan: allegedly 15% over 15 months (ie, 12% per annum).29Foot Note 29×SOC at paras 4, 8 and 13.These essential facts are undisputed and indisputable.30Foot Note 30×Transcript, 20 September 2022, p 154 lines 6–15 (on waiver of the original interest); Transcript, 20 September 2022, p 4 line 22 to p 5 line 13, p 122 lines 6–25 (on the lower effective interest rate). 33 Fourth, the plaintiff’s conduct in the run up to this litigation also deviates from that which would be expected of an experienced businessman and an experienced moneylender. The plaintiff failed to send any written demands to the defendant after the defendant allegedly defaulted on repayment in 2016, again in 2017 and again in 2018. The first time the plaintiff made a written demand for payment was when he issued a letter to the defendant in February 2020 demanding repayment of the sum of $5.2m.31Foot Note 31×5AB 2263–2265.This was more than three years after the plaintiff had allegedly lent the $4m to the defendant32Foot Note 32×DCS at para 20.and more than two years after the defendant had first allegedly defaulted on repayment.33Foot Note 33×DCS at para 49.Again, this deviates from the plaintiff’s own conduct in past moneylending transactions. When Xpress defaulted on repaying its loans, the plaintiff sent multiple email demands to Mr KK Fong and to the board of Xpress.34Foot Note 34×DCS at para 42. 34 The plaintiff was unable to explain satisfactorily or at all these deviations, both from the conduct that would be expected of an experienced businessman and an experienced moneylender, and from his own conduct in past moneylending transactions. 35 The plaintiff suggests that one explanation for these deviations is that the defendant allegedly sought the loans and the plaintiff allegedly advanced the loans in circumstances of urgency.35Foot Note 35×Plaintiff’s Reply Closing Submissions dated 7 November 2022 (“PRS”) at para 2.4.6.I do not accept this explanation for three reasons. First, a borrower asking for a loan in circumstances of urgency is an indication of higher than usual risk and therefore of a need to take greater than usual steps to protect the lender’s interests in the event of default and litigation to recover the loan. The alleged circumstances of urgency undermine the plaintiff’s case rather than supporting it. Second, even if the defendant needed the money urgently, there was no commercial reason for the plaintiff to indulge the defendant by acting in haste and thereby increasing the plaintiff’s own risk in the transaction. There is no suggestion, for example, that the plaintiff was for whatever reason desperate to lend the funds. Third, the first alleged loan may have been advanced in circumstances of urgency, but the second and third alleged loans were not. 36 The plaintiff also suggests that one reason for his deviations from his own past practice was because he was advised by lawyers in his past moneylending transactions but was not advised by lawyers in these three alleged loan agreements.36Foot Note 36×PRS at para 2.4.6.I do not accept this explanation. First, the risk factors I have identified would have made it more likely that an experienced businessman and an experienced moneylender would have sought legal advice in relation to these alleged loans. Second, the deviations I have identified are matters of commercial risk analysis and mitigation, not matters of law requiring specialist advice. An experienced businessman and an experienced moneylender such as the plaintiff is well able to perform this commercial risk analysis and mitigation himself, without legal advice. Third, by the time of these three alleged loan agreements, the plaintiff had already advanced sums of money to other borrowers supported by loan documentation drawn up by lawyers. It would have been a simple task for the plaintiff to have undertaken his own risk analysis and adapted those documents or adopted the risk mitigation features in those documents for the purposes of any alleged loans which he might extend to the defendant.",
        "Conclusion on the claim in debt": "37 I therefore hold that the plaintiff has failed to discharge his burden of proving that the sum of $4m which he paid to the defendant in September and October 2016 was paid to the defendant as loans. I therefore have no evidential basis on which to find that the defendant is indebted to the plaintiff. That suffices in itself to cause the plaintiff’s claim to fail. 38 The plaintiff’s failure to discharge his burden of proof on the existence of the loans means that his claim fails without any need for me to consider the defendant’s specific and positive defences. It is therefore not necessary for me to decide whether Mr Ho had any type of authority from the defendant to seek loans or to enter into loan agreements on behalf of the defendant. It is also not necessary – and would indeed be wrong in principle (see [19] above) – for me to undertake the exercise of deciding whether the defendant’s reason for the plaintiff paying $4m to the defendant is more likely to be true than not or is more likely to be true than the plaintiff’s reason for his paying $4m to the defendant.",
        "The claim in unjust enrichment": "39 I now turn to consider the plaintiff’s alternative claim,iethat the defendant is liable to make restitution to the plaintiff of $4m in the law of unjust enrichment. For this alternative claim, the plaintiff relies on two unjust factors: mistake of fact as to Mr Ho’s authority and a total failure of consideration.37Foot Note 37×SOC at paras 21(f)–(g); Plaintiff’s Closing Submissions dated 21 October 2022 (“PCS”) at para 5.1.1. 40 I reject the plaintiff’s alternative case in unjust enrichment on both unjust factors advanced.",
        "Mistake as to Mr Ho’s authority": "41 Insofar as the plaintiff relies for his alternative claim on the unjust factor of mistake, the plaintiff cannot succeed. I say that for two reasons. 42 First, the only mistake the plaintiff has pleaded is that he was mistaken as to Mr Ho’s authority to enter into loan agreements on behalf of the defendant.38Foot Note 38×SOC at para 21(e); PCS at para 5.4.1.I have found as a fact that the plaintiff has failed to discharge his burden of proving the existence of these loan agreements. My analysis must now proceed on the basis that the loan agreements do not exist. The question of whether Mr Ho had authority to enter into loan agreements which the plaintiff has failed to prove the existence of cannot even arise. 43 Second, the plaintiff has pleaded no other mistake of fact,eg, that he was mistaken as to the nature of his agreement with Mr Ho, believing it to be a loan when in fact it was not a loan,egas a result of a fundamental miscommunication between the plaintiff and Mr Ho as to the nature of their transaction. But that is not the plaintiff’s case either as pleaded39Foot Note 39×SOC at para 21(e).or as presented in closing submissions.40Foot Note 40×PCS at para 5.4.1. 44 The plaintiff has therefore neither pleaded nor proved a mistake of fact which would entitle him to restitution of the $4m in the law of unjust enrichment.",
        "Failure of basis": "45 Insofar as the plaintiff relies on the unjust factor of a total failure of consideration, the plaintiff also cannot succeed. 46 “Consideration” in the context of this unjust factor means the basis for the payment. It does not mean consideration in the contractual sense as thequid pro quofor an offer which renders the offer and acceptance legally binding and gives rise to a contract. InBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 (“Benzline”), the Court of Appeal accepted this distinction (at [48]) and stated that in the law of restitution, the term “failure of consideration” is synonymous with “failure of basis” (at [46]). 47 In the law of unjust enrichment, a payer will recover money he has paid to a payee on the unjust factor of a total failure of consideration if the payer can establish that the basis on which the payer paid the money to the payee has completely failed. It is that failure which renders the recipient’s continued retention of the money unjust for the purposes of the law of unjust enrichment. The payee will be ordered to return the money to the payer, unless the payee can make out one of the established defences to a claim in unjust enrichment. 48 To analyse the plaintiff’s case on the unjust factor of a total failure of consideration, therefore, I must determine: (a) the basis for the payment which the plaintiff now seeks to recover; and (b) whether that basis has failed (Benzlineat [46]). 49 It is possible for the basis of a payment to be a contract and for the basis to fail by reason of a vitiating factor rendering the contract void. An example of this is where a party to a putative contract makes a payment to the counterparty while both parties are labouring under a common mistake sufficiently fundamental to render the contract void (see,eg,Ochroid Trading Ltd and another v Chua Siok Kui (trading as VIE Import & Export) and another[2018] 1 SLR 363 at [43(c)], citingAqua Art Pte Ltd v Goodman Development (S) Pte Ltd[2011] 2 SLR 865 at [23]–[28]). The present case is quite unlike those cases. In those cases, the parties believed that they had a contract, and that contract formed the basis for a payment at the time the payment was made. Unknown to the parties, the law rendered their putative contract void. The vitiation of the contract served both to destroy the basis for the payment thereby establishing the total failure of consideration as an unjust factor and, at the same time, to wipe away the contract and the allocation of risks agreed within it as a legal bar to recovery in unjust enrichment. 50 In the present case, I have found that the plaintiff has failed to discharge his burden of proving that he entered into any loan agreements with the defendant. That means the plaintiff has failed to establish that there was ever any contract whatever to form the basis for his payments to the defendant. The question of whether that non-existent basis has failed cannot arise. Therefore, this case does not come within the rubric of a total failure of consideration as an unjust factor. It must fail on this ground. 51 The next question is whether the plaintiff has adequately advanced an alternative case on failure of basis which might cater for the situation in which he now finds himself. But when the plaintiff’s pleadings are read in context, the only failure of basis which he has pleaded is the failure of the loan agreements to bind the defendant in the event the plaintiff is unable to prove that Mr Ho had the defendant’s authority to enter into them. The plaintiff has pleaded no specific or precise basis for the payment on which he relies as an alternative basis for the purposes of this unjust factor. In particular, the plaintiff has pleaded no alternative case as to the basis for the payment to cater for the situation in which he now finds himself,iewhere the plaintiff’s case fails without any need for the court to consider the issue of Mr Ho’s authority. 52 Counsel for the plaintiff did suggest in oral submissions that the basis of the payment was a common understanding with Mr Ho that the defendant would repay the money. The plaintiff attempts to distinguish this basis for the payments from the alleged loan agreements as the basis for the payments by arguing that the common understanding now alleged was only as torepaymentof the $4m and did not extend to the other terms of the alleged loan agreements such as the obligation to pay interest. In other words, the plaintiff invites me to find that – even if he is unable to prove on the balance of probabilities that he entered into the loan agreements on the contractual terms alleged – he is nevertheless able to prove on the balance of probabilities at least a common understanding between him and Mr Ho on behalf of the defendant that the defendant would repay the principal sum of $4m to the plaintiff. 53 The plaintiff cannot rely on this “common understanding” to recover $4m from the defendant in the law of unjust enrichment. I come to that conclusion for five reasons. 54 First, this point was not pleaded. It is true that the plaintiff pleaded a total failure of consideration in general terms.41Foot Note 41×SOC at para 21.But that plea, when read in context in the statement of claim, clearly posits: (a) that the alleged loan agreements were the intended contractual basis for the plaintiff’s payments to the defendant; and (b) that the basis for the plaintiff’s payments was the defendant’s reciprocal obligations under each of those agreements as an indivisible whole. As pleaded, the alleged loan agreements were contracts comprising a package of three broad obligations: (a) to repay the money; (b) to repay the money by a specific date; and (c) to pay interest on the money. The plaintiff did not attempt, in his statement of claim, to separate the loan agreements into their constituent obligations and to suggest that the basis for the payments which failed was just one of those constituent obligations taken alone and recharacterised as a freestanding understanding somehow falling short of a contractual obligation. 55 Second, this specific point was not put to Mr Ho during his cross-examination. The case put to Mr Ho was based on each loan agreement as an indivisible whole,ie, comprehending all three of the broad constituent obligations as a package and not isolating an alleged understanding to repay the money as the sole and freestanding basis for the payments.42Foot Note 42×Transcript, 22 September 2022, p 64 lines 16–22. 56 Third, in any event, even if the point was pleaded in the statement of claim and put to Mr Ho in cross-examination, I would reject it as a ground for restitution. The plaintiff’s failure to persuade me on the balance of probabilities as to the existence of the loan agreements comprehends a failure to persuade me on all of the three constituent obligations in any alleged loan agreement. This includes any obligation – or even understanding falling short of an obligation – that the defendant was to repay the money. To the extent that a separate finding of fact is required on this alleged “common understanding”, I find as a fact that the plaintiff has failed to discharge his burden of proving any such common understanding as to repayment for all of the same reasons I have given for finding that the plaintiff has failed to discharge his burden of proving the existence of the loan agreements (see [25]–[36] above). 57 Fourth, in so far as the plaintiff argues that his payment of money to the defendant gave riseipsofactoto a legal obligation to repay the money, this argument is contrary to the law of unjust enrichment, or the law of quasi-contract as it used to be known. In substance, this argument posits that there is an implied legal obligation under the substantive law to repay sums paid without reason. That is not the law. It rests on the now discredited “implied obligation” theory of the law of restitution (EsbenFinance Ltd and others v Wong Hou-Lianq Neil[2022] 1 SLR 136 at [57]). 58 Finally, even taking the plaintiff’s argument at its highest and assuming that a common understanding to repay the $4m can be implied, and that this common understanding was the basis for the plaintiff’s payment of $4m to the defendant, the plaintiff’s claim to recover the $4m in unjust enrichment for a failure of this alleged basis must fail. On this assumption, the event which is to be characterised as a failure of the basis can only be one of two things: (a) the defendant’s denial of any obligation to repay the money in the correspondence before action; or (b) the defendant’s failure in fact to repay the money in accordance with the alleged common understanding. Accepting that either of these two bases can amount to a total failure of basis warranting restitution in the law of unjust enrichment would amount to using the law of unjust enrichment to undermine the law of contract. It would elevate what is alleged to be merely an understanding (ie, aconsensus ad idemnot amounting to a contract) into a legal obligation (ie, a contract) despite the absence of the consideration necessary to have that effect in the law of contract. 59 Therefore, the plaintiff’s alternative claim in unjust enrichment must fail, whether it is based on a mistake or on a total failure of basis, and however the basis is characterised.",
        "Absence of basis is not an unjust factor": "60 The outcome of my analysis is that the defendant is under no obligation in the law of unjust enrichment to make restitution to the plaintiff of the $4m which it received from the plaintiff. Further, because the plaintiff has failed to establish an unjust factor justifying recovery in the law of unjust enrichment, the question of defences (such as abona fidechange of position) does not even arise. It therefore appears that the defendant is entitled the $4m: (a) even though it readily accepts that the payment was not a gift; (b) even if its positive case on the reason for the payment cannot be proven or is actually false; and (c) without any need for me to consider whether the defendant has changed its positionbona fidefollowing the receipt of the $4m,egby spending the moneybona fide. 61 The outcome of my analysis appears extremely odd. The defendant would be entitled to retain the $4m even if the money was still lying intact and untouched in its bank account. But this odd outcome is the result of a well-known feature of the common law of unjust enrichment. The law of unjust enrichment does not reverse a voluntary payment simply because the payment was made without a basis or without a reason. The law of unjust enrichment reverses only those enrichments which it deems to be unjust. And it deems an enrichment to be unjust only if the person seeking to reverse it is able to plead and prove a recognised unjust factor (WeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“WeeChiaw Sek Anna”) at [129]–[134]). 62 The common law’s “unjust factors” approach to reversing unjust enrichment is to be contrasted with the civil law’s “absence of basis” approach to the same issue. The “absence of basis” approach posits that once a defendant has been enriched at a claimant’s expense, restitution must follow in the “absence of any juristic reason … for the enrichment” (Andrew Burrows,The Law of Restitution(Oxford University Press, 3rd Ed, 2011) at p 96, citingRathwell v Rathwell(1978) 83 DLR (3d) 289, 306). 63 The plaintiff may well have succeeded in recovering the $4m from the defendant if Singapore’s common law had adopted the “absence of basis” approach to reversing unjust enrichment. But as the Court of Appeal observed inWeeChiaw Sek Annaat [129], the “absence of basis” approach has generally not found favour amongst common law scholars and has not taken root in the common law of unjust enrichment. Further, the Court of Appeal inEsbenFinancealso cautioned against an expansion of the common law of unjust enrichment (at [247]). 64 The case ofBig Island Construction (HK) Ltd v Wu Yi Development Co Ltd& Anor[2015] HKCU 1437 (“Big Island Construction”) illustrates my point. There, as in the present case, the plaintiff paid a large sum of money to the defendant for a disputed reason. The plaintiff claimed that it had paid the money as a loan. The defendants claimed that the plaintiff had paid the money to discharge certain obligations it owed the defendants. The trial judge dismissed the plaintiff’s claim, holding that it had “failed miserably to discharge the burden of proving its primary claim” (at [13]) in debt. Although it as unnecessary for his decision, the trial judge also went on to reject the defendant’s case as to the reason for the payment, finding it to be “improbable” (at [14]). 65 In the Hong Kong Court of Final Appeal, the plaintiff contended that the consequence of the trial judge’s rejection of both parties’ reasons for the payment as improbable was that there was an absence of basis for the payment, entitling the plaintiff to recover the money in the law of unjust enrichment (at [66]). The court dismissed the argument, holding that to succeed in unjust enrichment at common law, a plaintiff cannot recover simply by establishing an “absence of basis” for the enrichment (at [67]–[71]). A plaintiff must establish an unjust factor. 66 In the present case, the plaintiff put forward only one reason for the payment (that it was a loan). The plaintiff failed to discharge its burden of proving that reason. That failure leaves the plaintiff’s payment to the defendant evidentially indistinguishable from a voluntary payment made without reason. The plaintiff has failed to plead and prove any alternative basis for his payment which has failed, let alone any other unjust factor entitling him to restitution. The outcome in the present case may be odd, but that oddity is a known feature of the common law of unjust enrichment.",
        "Conclusion": "67 In conclusion, I have found that the plaintiff has failed to prove his pleaded case as to the reason for his payment,ie, that it was a loan of $4m to the defendant. His claim in debt fails. I have also found that the plaintiff has failed to plead and prove an unjust factor. His alternative claim in unjust enrichment therefore also fails. 68 I have therefore dismissed the plaintiff’s action. After hearing oral submissions on costs, I have ordered the plaintiff to pay to the defendant the costs of and incidental to this action, such costs fixed at $132,300.     Vinodh Coomaraswamy Judge of the High Court   Prakash Pillai, Koh Junxiang and Ng Pi Wei (Clasis LLC) for the plaintiff; Koh Choon Guan Daniel, Wong Hui Yi Genevieve and Lim Khoon (Eldan Law LLP) for the defendant."
    }
}