{
    "case_title": "Government of the City of Buenos Aires vHN Singapore Pte Ltd and another",
    "ncitation": "[2023] SGHC 139",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 At the onset of the Covid-19 pandemic, governments across the world went into action to control the spread of the novel coronavirus, minimise morbidity and mortality, as well as keep their public health systems afloat. Testing and detection of the virus were par for the course, and consequently, demand for rapid virus detection test kits surged. Correspondingly, there was much business to be made by manufacturers, middlemen and suppliers. This case concerns a transaction between the Government of the City of Buenos Aires and a Singapore company for the supply of Covid-19 test kits. The plaintiff government sought to acquire test kits for its people and the defendant company sought to make a profit. The subsequent non-delivery of the test kits gave rise to the present dispute.",
        "Facts": "",
        "The parties": "2 The plaintiff is the Government of the City of Buenos Aires, Argentina.1Foot Note 1×Plaintiff’s Statement of Claim (Amendment No. 1) (“SOC”) dd 29 November 2022 at para 1.Buenos Aires is the capital of Argentina and an autonomous city with a population of about 15 million. 3 The first defendant, HN Singapore Pte Ltd (“HN Singapore”), is a company incorporated by Mr Nicholas Eng Teng Cheng (“Mr Eng”) in Singapore on 9 September 2016.2Foot Note 2×SOC dd 29 November 2022 at paras 2–3, particulars (1) of SOC.According to Mr Eng, HN Singapore was incorporated as a vehicle to carry out the business of import and export of goods, and to provide consultancy services.3Foot Note 3×Mr Eng’s AEIC dd 8 November 2022 at paras 6–7.Since its incorporation, HN Singapore had only imported goods, and did not successfully export goods.4Foot Note 4×Transcript (2 December 2022) at p 14 lines14–24. 4 The second defendant is Mr Eng, a Singapore citizen. At all times, Mr Eng has been the sole director and shareholder of HN Singapore.5Foot Note 5×SOC dd 29 November 2022 at para 3; Mr Eng’s AEIC dd 8 November 2022 at para 6.",
        "Background to the dispute": "The Covid-19 epidemic in Argentina 5 In March 2020, a health emergency was declared in Argentina due to the unfolding Covid-19 pandemic. On or about 19 March 2020, a nationwide lockdown was imposed in Argentina. 6 By the end of March 2020, the Ministry of Health of the plaintiff proposed a health strategy to stop the spread of Covid-19 quickly. A key pillar of this strategy was to acquire rapid virus detection test kits. As there was a global shortage of supplies, the plaintiff publicly sourced test kits by informally contacting manufacturers and distributors of these test kits, both nationally and internationally, and requested them to present their proposals for the supply of test kits. This Health Emergency framework was established by Urgent Necessity Decrees under Argentine law and termed the “[p]rocurement of rapid test kits for the identification of antibodies to the new coronavirus (COVID-19)”.6Foot Note 6×SOC dd 29 November 2022 at paras 6–7; Ms Tojo’s AEIC dd 7 November 2022 at paras 4–5 and p 101. Contract formation and the parties’ contractual relationship 7 Parties dispute whether the plaintiff or Mr Eng and/or HN Singapore initiated contact with the other party.7Foot Note 7×SOC dd 29 November 2022 at para 6; Defendant’s Defence and Counterclaim (“DCC”) dd 19 March 2021 at para 10.However, it is undisputed that on 23 March 2020, Mr Borja Seward (“Mr Seward”), a contact of Mr Eng,8Foot Note 8×Mr Eng’s AEIC dd 8 November 2022 at para 8.sent an email to Mr Guido Sirna (“Mr Sirna”). Mr Seward introduced Mr Eng as “working with commodities and supplies (Medicine, is one of them) [sic]”.9Foot Note 9×Mr Eng’s AEIC dd 8 November 2022 at para 8; Ms Tojo’s AEIC dd 7 November 2022 at para 6 and MT-2 p 28.Subsequently, Mr Sirna passed Mr Eng’s contact to Mr Juan Manuel Paleo (“Mr Juan”), an employee of the plaintiff. On 27 March 2020, Mr Juan sent a message to Mr Eng via Whatsapp, expressing the plaintiff’s interest in purchasing 500,000 units of Covid-19 test kits manufactured by Guangzhou Wondfo Biotech Co., Ltd (“Wondfo”), a company in the People’s Republic of China (“China”).10Foot Note 10×Mr Eng’s AEIC dd 8 November 2022 at paras 8–9 and pp 35–40. 8 On 27 March 2020, Mr Eng sent a letter of offer for the sale of Covid-19 test kits to the plaintiff through Mr Juan and Ms Marisa Andrea Tojo (“Ms Tojo”).11Foot Note 11×Mr Eng’s AEIC dd 8 November 2022 at paras 9 and 11; Ms Tojo’s AEIC dd 7 November 2022 at para 6 and MT-3.Ms Tojo is employed by the plaintiff as the General Director of Purchasing and Contracting.12Foot Note 12×Ms Tojo’s AEIC dd 7 November 2022 at para 1. 9 On 29 March 2020, Mr Santiago Costabel, the General Director of the Medical Supplies Office of the plaintiff (“Mr Santiago”), sent an email to Mr Eng requesting a formal offer from HN Singapore in order to carry out the transaction.13Foot Note 13×Mr Eng’s AEIC dd 8 November 2022 at para 12 and pp 78–79.On the same day, Mr Eng sent via email a proposed sale and purchase agreement dated 29 March 2020 to Mr Santiago, containing the same terms as the earlier letter of offer (“the Proposed SPA”).14Foot Note 14×DCC dd 19 March 2021 at para 5; Mr Eng’s AEIC dd 29 September 2022 at para 12 and pp 80–81; Ms Tojo’s AEIC dd 7 November 2022 at para 11 and MT-5.Among other things, the Proposed SPA set out the following terms: (a) 500,000 Covid-19 test kits would be sold. (b) The test kits would be of Chinese origin, from a specific Wondfo factory in China and of the Wondfo brand. (c) The cost per unit of each test kit varied depending on: (i) whether the test kits were “CIF” or “FOB”; and (ii) whether the test kits were in Chinese or English packaging. (d) The delivery time would be 10(+10) days upon payment. 10 On 31 March 2020, the plaintiff signed an administrative act, Administrative Resolution No. RESOL-2020-88-GCABA-SSASS (the “Administrative Act”), to award HN Singapore the contract for the procurement of rapid test kits for Covid-19. This award was pursuant to Law No 2095, Article 28 Section 8 of Argentine law, and its Regulatory Decree No 168-GCABA/19, as amended by Decree No. 207-GCABA/19. The Administrative Act was based on the terms set out in the Proposed SPA.15Foot Note 15×Ms Tojo’s AEIC dd 7 November 2022 at para 12 and MT-6 p 101. 11 On 2 April 2020, the plaintiff informed the defendants by email that HN Singapore was awarded the contract to supply the plaintiff with Covid-19 test kits.16Foot Note 16×Mr Eng’s AEIC dd 8 November 2022 at para 18 and pp 118–119; Ms Tojo’s AEIC dd 7 November 2022 at MT-7 p 105.The plaintiff specified the details of the test kits to be provided:  12 The number of test kits requested was reduced from 500,000 (as stated in the Proposed SPA) to 300,000 because the plaintiff had mistakenly processed an order for 300,000 test kits. However, the parties agreed to move forward with the order for 300,000 test kits and considered making a second order subsequent to this first order.17Foot Note 17×Mr Eng’s AEIC dd 8 November 2022 at para 15 and p 89. 13 That same day, Mr Eng issued a pro forma invoice to the plaintiff (“the Invoice”).18Foot Note 18×DCC dd 19 March 2021 at para 7; Mr Eng’s AEIC dd 8 November 2022 at para 15 and p 104; Ms Tojo’s AEIC dd 7 November 2022 at para 13, MT-7 and MT-8.The Invoice states the following: (a) HN Singapore would deliver 300,000 test kits to the plaintiff in exchange for a total price of US$1,770,000 (“the Purchase Price”). (b) The test kits would be in “Chinese packaging”, with a unit price of US$5.90. (c) The test kits would be of “China” origin and of the Wondfo brand. (d) The “[e]stimated date of arrival in Buenos Aires” would be “15(+5) days upon receiving of [sic] payment”. 14 On 6 April 2020, the plaintiff paid the Purchase Price in full.19Foot Note 19×SOC dd 29 November 2022 at para 9; DCC dd 19 March 2021 at para 13; Mr Eng’s AEIC dd 8 November 2022 at para 18; Ms Tojo’s AEIC dd 7 November 2022 at para 16.This was the first and only transaction between the plaintiff and HN Singapore.20Foot Note 20×Plaintiff’s Closing Submissions (“PCS”) dd 20 January 2023 at para 5. 15 On 9 April 2020, the defendants sent a letter of proposal to the plaintiff to request a variation of the original agreement (“the Letter of Proposal”). The terms and conditions, as varied, were set out in the Letter of Proposal.21Foot Note 21×Ms Tojo’s AEIC dd 7 November 2022 at MT-10.On 12 April 2020, the plaintiff accepted the variation of the original agreement by way of an email. The relevant terms of the varied sale and purchase agreement (“Varied SPA”) are as follows:22Foot Note 22×SOC dd 29 November 2022 at para 10; DCC dd 19 March 2021 at para 14; Mr Eng’s AEIC dd 8 November 2022 at para 21; Ms Tojo’s AEIC dd 7 November 2022 at para 19 and MT-10. (a) HN Singapore would deliver 182,475 test kits (“the Test Kits”) to the plaintiff in exchange for the same Purchase Price of US$1,770,000 (which the plaintiff had already paid). (b) The Test Kits would be of “China” origin, of the Wondfo brand, and from a specific Wondfo factory in China. (c) The Test Kits would be in “English packaging”, with a unit price of US$9.40. (d) The delivery time would be “15(+5) days upon payment”,ie,by 26 April 2020. 16 On 20 April 2020, HN Singapore entered into a sale and purchase agreement with Wondfo for the purchase of the Test Kits at a total price of US$821,137.50. Subsequently, Wondfo issued a pro forma invoice dated 28 April 2020 for the said purchase (“the Wondfo Invoice”).23Foot Note 23×Mr Eng’s AEIC dd 8 November 2022 at para 24 and pp 343–346. 17 It is undisputed that HN Singapore failed to deliver the Test Kits to the plaintiff by the agreed delivery date of 26 April 2020.24Foot Note 24×SOC dd 29 November 2022 at para 11; Defendant’s Closing Submissions (“DCS”) dd 20 January 2023 at para 3. Events after the non-delivery on 26 April 2020 18 After the non-delivery of the Test Kits on 26 April 2020, the parties continued to liaise and correspond with each other for the delivery of the Test Kits. For example, at the request of the defendants, the plaintiff nominated a technician or health professional to be professionally trained to use the Test Kits.25Foot Note 25×Mr Eng’s AEIC dd 8 November 2022 at paras 29–31, 36, 45, 48, 52–53 and 61–63. 19 There was also correspondence where the defendants sought a letter of commitment from the plaintiff, claiming that this was a requirement by the Chinese government for the export of the Test Kits. Eventually, on 12 May 2020, the defendants informed the plaintiff that the letter of commitment was no longer necessary. In the parties’ correspondence, the plaintiff disputed that the letter of commitment was a requirement under Chinese law.26Foot Note 26×Mr Eng’s AEIC dd 8 November 2022 at paras 30, 33, 35–37, 40–42, 44 and p 232. 20 The defendants also provided information to the plaintiff about Chinese regulations concerning the export of the Test Kits (elaborated below at [30]).27Foot Note 27×Mr Eng’s AEIC dd 8 November 2022 at paras 46 and 48. 21 On the defendants’ request, the plaintiff provided information relating to the delivery of the Test Kits, such as the details of the customs broker who would receive the Test Kits at the Buenos Aires airport.28Foot Note 28×Mr Eng’s AEIC dd 8 November 2022 at paras 38 and 39. 22 On 13 May 2020, the plaintiff also reminded the defendants to send the plaintiff a commercial invoice and packing list to move forward with the import customs procedure in Argentina. On the same day, the defendants informed the plaintiff that Wondfo would provide the documents between approximately 15 May 2020 and 19 May 2020.29Foot Note 29×Mr Eng’s AEIC dd 8 November 2022 at paras 55 and 58. 23 Crucially, during this period, the plaintiff repeatedly sought confirmation of the delivery date of the Test Kits. On 27 April 2020, Mr Luis Oscar Ricardo (“Mr Ricardo”), another employee of the plaintiff, asked Mr Eng about the arrival date of the Test Kits. Again, on 28 April 2020, Mr Ricardo asked Mr Eng when the production of the Test Kits would be finalised. On 2 May 2020, Mr Eng informed Mr Ricardo that production of the Test Kits was underway, that the goods were expected to be available on 15 May 2020 and that the defendants were working on freight sourcing. Subsequently, on 5 May 2020, Mr Eng informed Mr Ricardo that the estimated arrival date “should be” between 24 May 2020 and 28 May 2020, barring any unforeseen delays. The next day, on 6 May 2020, Mr Ricardo again asked for an exact delivery date for the Test Kits. On 9 May 2020, Mr Ricardo reiterated that the plaintiff needed to know the arrival date of the Test Kits. On 10 May 2020, Mr Eng informed Mr Ricardo and Ms Tojo that they had received indicative information that the goods would arrive at the airport in Buenos Aires on 22 May 2020 if there were no delays. However, on 15 May 2020, Mr Eng informed the plaintiff that Wondfo had informed them that delivery was delayed due to the implementation of a new policy in China. The estimated delay was up to seven days. On 16 May 2020, the plaintiff responded by expressing that it was very disappointed by the delay and that the plaintiff expected urgent communication of the official delivery date. On the same day, the plaintiff informed the defendants that the “absolutely [sic] top priority (and your contractual obligation) is to deliver the tests in [sic] the date agreed upon” and that the plaintiff expected an urgent response on the matter. Mr Eng responded by stating that the defendants maintained the utmost dedication to seeing the deal through.30Foot Note 30×Mr Eng’s AEIC dd 8 November 2022 at paras 28, 30, 35, 38–39, 47, 49, 59 and 64–66. 24 On 23 May 2020, Mr Eng informed the plaintiff that the Chinese government did not award the new required export approval to Wondfo, and that the Test Kits were, therefore, not cleared for delivery to the plaintiff.31Foot Note 31×Mr Eng’s AEIC dd 8 November 2022 at para 69. 25 On 27 May 2020 (Singapore time), on the basis that the non-delivery on 26 April 2020 constituted a repudiatory breach by HN Singapore of the Varied SPA, the plaintiff terminated the Varied SPA by email.32Foot Note 32×SOC dd 29 November 2022 at para 12; Mr Eng’s AEIC dd 29 September 2022 at para 74; Ms Tojo’s AEIC dd 7 November 2022 at para 23. 26 On the same day, Mr Eng informed the plaintiff that Wondfo had stocks of the test kits (in English packaging) in its warehouse in Chicago, US and stated that they would be able to supply the shipment to the plaintiff from the US in approximately seven working days, including freight.33Foot Note 33×Mr Eng’s AEIC dd 8 November 2022 at para 70. Events after termination of the Varied SPA by the plaintiff 27 Subsequently, the plaintiff requested a refund of the Purchase Price.34Foot Note 34×Mr Eng’s AEIC dd 8 November 2022 at para 76.It is undisputed that on 15 June 2020, 17 June 2020 and 16 July 2020, HN Singapore transferred the sums of US$1,203,600, US$306,780.65 and US$22,000, respectively, to the plaintiff. This aggregated to a sum of US$1,532,380.65, which is approximately 86.6% of the Purchase Price.35Foot Note 35×SOC dd 29 November 2022 at paras 14–15; Mr Eng’s AEIC dd 8 November 2022 at para 76; Ms Tojo’s AEIC dd 7 November 2022 at paras 25–26. 28 The plaintiff later received a letter dated 20 July 2020 from the former solicitors of Mr Eng (“the 20 July Letter”).36Foot Note 36×SOC dd 29 November 2022 at para 14.The 20 July Letter stated that HN Singapore could not refund the balance sum of US$237,619.35 (“the Balance Purchase Price”) to the plaintiff as that had been spent on “non-refundable charges, expenses and fees”.37Foot Note 37×SOC dd 29 November 2022 at para 14; Ms Tojo’s AEIC dd 7 November 2022 at para 24 and MT-12 pp 175–176.According to Mr Eng, the breakdown of charges is as follows:38Foot Note 38×Mr Eng’s AEIC dd 8 November 2022 at paras 77 and 93. (a) A payment of US$1,200 to GuangZhou Nuodong Biotech Co Ltd (“Nuodong”), a Chinese middleman company, on or about 10 April 2020. This was allegedly for the purchase of sample test kits from Wondfo. (b) A payment of US$136,856.25 to Nuodong on or about 8 May 2020 for part-payment of the purchase price. (c) A payment of US$81,552.07 to GuangZhou QG International Shipping Co Ltd on or about 8 May 2020 for shipping and insurance charges. 29 On 22 October 2020, HN Singapore claimed to rescind the Varied SPA. This was on the basis that the plaintiff’s termination of the Varied SPA on 27 May 2020 was “unlawful” and amounted to a “repudiation of its contractual obligations”.39Foot Note 39×Mr Eng’s AEIC dd 8 November 2022 at paras 75 and 98. The Chinese Regulations 30 On 31 March 2020, 25 April 2020 and 13 May 2020, the Chinese government imposed three sets of restrictions on the export requirements for medical equipment (“the Chinese Regulations”):40Foot Note 40×DCC dd 19 March 2021 at para 17; Mr Eng’s AEIC dd 8 November 2022 at paras 81–85 and pp 415, 481–482 and 500–503. (a) On 31 March 2020, the Chinese government issued Announcement No 5 of 2020 on the “Orderly Export of Medical Supplies” (the “31 March Regulations”). This came into effect on 1 April 2020. Companies exporting medical supplies, including test kits, had to “providea… declaration … promising that the exported product has obtained the Chinese medical devices & products registration certificate … and meets the quality standards of the importing country” [emphasis added]. Chinese customs would “inspect and release the products according to the medical device product registration certificate approved by [the Chinese government]”. (b) On 25 April 2020, the Chinese government issued Announcement No 12 of 2020 on “Further Strengthening the Quality Supervision on the Exported Pandemic Prevention Supplies” (the “25 April Regulations”). This came into effect on 26 April 2020. Companies exporting medical supplies (including test kits) “that have obtained foreign quality certification or registration, must submit [a] … statement for customs declaration … to undertake that the products meet the quality standards and safety requirements of the importing country (region) … and the customs shall rely on the list of manufacturers that have obtained foreign standard certification or registration provided by the Ministry of Commerce … for the release of products”. (c) On 13 May 2020, the Chinese government issued a notice on the “Special Rectification Plan for Regulating the Quality of National Pandemic Control Supplies and the Market Order” (the “13 May Regulations”). One aspect of the plan was to “[c]omprehensively strengthen the supervision of pandemic prevention materials for export”. It is not known when the plan came into effect. The performance guarantee 31 On 4 April 2020, Ms Tojo, on behalf of the plaintiff, sent an email to Mr Eng to request that HN Singapore provide a performance guarantee for the performance of the contract, to ensure the fulfilment of the contract between the plaintiff and HN Singapore. Ms Tojo conveyed that the guarantee should cover the Purchase Price and an additional 10% of the Purchase Price.41Foot Note 41×Mr Eng’s AEIC dd 8 November 2022 at para 17; Ms Tojo’s AEIC dd 7 November 2022 at para 16 and MT-9. 32 On 7 April 2020, Mr Eng replied to Ms Tojo’s email, linking her up with the defendants’ lawyer in Argentina to coordinate the provision of the performance guarantee.42Foot Note 42×Mr Eng’s AEIC dd 8 November 2022 at para 17; Ms Tojo’s AEIC dd 7 November 2022 at para 18 and MT-9.On 8 April 2020, Mr Ricardo informed Mr Eng that the plaintiff contacted Mr Eng’s Argentinian lawyer and that the plaintiff would “continue this guarantee procedure with him”.43Foot Note 43×Mr Eng’s AEIC dd 8 November 2022 at p 99. 33 Subsequently, in the Letter of Proposal dated 9 April 2020, Mr Eng included an additional term on insurance, which stated that “[u]pon mutual agreement between the seller and the insurance company, we will provide an insurance policy as guarantee [sic] for the fulfilment of this agreement.” Mr Eng stated that he did so in light of his conversation with Ms Tojo on 4 April 2020 regarding the provision of a guarantee.44Foot Note 44×Ms Tojo’s AEIC dd 7 November 2022 at para 21 and MT-10. 34 No performance guarantee was eventually provided by HN Singapore to the plaintiff.45Foot Note 45×Mr Eng’s AEIC dd 8 November 2022 at para 17; Ms Tojo’s AEIC dd 7 November 2022 at para 18.",
        "Summary of the plaintiff’s claim": "",
        "Governing law of the contract": "35 As a preliminary point, the plaintiff pleads that “[t]he governing law of the [Varied] SPA is the law of the Argentine Republic (Argentina), as the [p]laintiff is a government entity and can only contract under the laws of Argentina”.46Foot Note 46×SOC dd 29 November 2022 at para 4A; PCS dd 20 January 2023 at para 63.In contrast, the defendants submit that the contract was governed by Singapore law.47Foot Note 47×DCS dd 20 January 2023 at paras 17–27. 36 Both parties rely on the three-stage framework set out by the Court of Appeal inPacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”). The plaintiff submits that the form of the documents involved in the transaction and the commercial purpose of the transaction militate towards a finding that the parties intended for Argentine law to apply. Alternatively, Argentine law objectively has the closest connection to the contract.48Foot Note 48×PCS dd 20 January 2023 at paras 76–88.Therefore, Argentine law governs the plaintiff’s right to: (a) terminate the Varied SPA; (b) claim damages; and (c) lift the corporate veil.49Foot Note 49×PCS dd 20 January 2023 at para 88. 37 The defendants submit that Mr Eng could not have intended for HN Singapore to enter into a contract with the plaintiff that is governed by Argentine law, given that he is a layperson with no understanding of Spanish and no prior dealings with Argentine entities. Further, the final contract was prepared solely by Mr Eng without the plaintiff’s input. Additionally, the Administrative Act authorising the plaintiff to contract with HN Singapore affected only the plaintiff’s capacity to enter into the contract and did not alter the character of the contract. Alternatively, the defendants submit that Singapore law has the closest connection with the Varied SPA, as: (a) the contract was prepared in Singapore by a Singapore citizen; (b) the Varied SPA lacked the hallmarks of typical Argentine contracts; and (c) payment was made to a Singapore bank account.50Foot Note 50×DCS dd 20 January 2023 at paras 11–27.",
        "Repudiatory breach of contract": "38 The plaintiff’s first claim is that the failure of HN Singapore and/or Mr Eng to deliver the Test Kits by 26 April 2020 amounted to a repudiatory breach of the Varied SPA. The plaintiff then accepted this breach by way of an email sent on 27 May 2020.51Foot Note 51×SOC dd 29 November 2022 at paras 11–12. 39 In response, the defendants plead that although they failed to deliver the Test Kits by 26 April 2020, the plaintiff “waived the non-delivery, did not treat the non-delivery as a breach or [did not treat the non-delivery as] amounting to a repudiation of the [Varied SPA], and affirmed the [Varied SPA], until 27 May 2020”.52Foot Note 52×DCC dd 19 March 2021 at para 15.The defendants submit that even after the non-delivery of the Test Kits on 26 April 2020, the plaintiff continued to work with HN Singapore for the delivery of the Test Kits. In particular, the plaintiff was kept informed by HN Singapore “of the progress of the production of the Test Kits”, “of fresh regulations in China”, and “of [Wondfo’s] efforts to expedite the export and delivery”. The plaintiff also liaised with HN Singapore for the provision of “a letter of commitment that … [Wondfo] had requested to enable the Test Kits to be exported”, “for the fresh delivery date of the Test Kits”, “on [Wondfo’s] request for the details of one technician/health professional from the [p]laintiff to implement the Test Kits”, “on the logistics of the delivery” and “on providing a guarantee for the fulfilment of the [Varied SPA]”.53Foot Note 53×DCC dd 19 March 2021 at paras 15.1–15.7.Therefore, these actions constituted a waiver by election of the plaintiff’s right to terminate the contract.54Foot Note 54×DCS dd 20 January 2023 at para 36. 40 In the alternative, the defendants submit that the Varied SPA had been frustrated. The defendants plead that the Chinese Regulations “constituted an event of frustration” that made the Varied SPA “impossible to perform without any fault on the part of [HN Singapore]”. Therefore, this “terminated the [Varied SPA] and released both the [p]laintiff and [HN Singapore] from any further performance thereunder”.55Foot Note 55×DCC dd 19 March 2021 at para 17.",
        "Misrepresentation": "41 The plaintiff’s second claim against the defendants is for: (a) misrepresentation under s 2(1) of the Misrepresentation Act (Cap 390, 1994 Rev Ed) (“the MA”); or (b) fraudulent misrepresentation.56Foot Note 56×SOC dd 29 November 2022 at paras 23–24. The alleged representation 42 The plaintiff pleads that HN Singapore and/or Mr Eng, “knowing that time was of the essence to the [p]laintiff for the delivery of the Test Kits, represented to the [p]laintiff that they would be able to deliver the Test Kits within [20] days of receipt of payment from the [p]laintiff” (“the Representation”).57Foot Note 57×SOC dd 29 November 2022 at para 21.The Representation is contained in the letter of offer issued by Mr Eng on 27 March 2020, on behalf of HN Singapore, stating a delivery time of “10(+10) days upon payment”.58Foot Note 58×Mr Eng’s AEIC dd 8 November 2022 at pp 43–44.According to Mr Eng, “10(+10)” means that the Test Kits would be delivered within ten days upon payment, with an additional flexible period of extension of up to another ten days, such that the total time allowed for delivery would be 20 days.59Foot Note 59×Mr Eng’s AEIC dd 8 November 2022 at para 11.I note that the Varied SPA eventually provided for a delivery time of “15(+5) days upon payment”. Regardless, as acknowledged by Mr Eng, the total delivery time remained as 20 days.60Foot Note 60×Mr Eng’s AEIC dd 8 November 2022 at para 14. 43 The defendants plead that they only “represented that the Test Kits would be delivered within anestimatedperiod of 15(+5) days from receipt of payment” [emphasis added].61Foot Note 61×DCC dd 19 March 2021 at para 22.In contrast, the plaintiff avers that “[t]he delivery date … was fixed … at 15(+5) days upon payment”.62Foot Note 62×Reply and Defence to Counterclaim (“RDC”) dd 6 April 2021 at para 5. The plaintiff’s reliance on the Representation 44 The plaintiff avers that in reliance of the Representation, it paid the Purchase Price.63Foot Note 63×SOC dd 29 November 2022 at para 22.However, contrary to the Representation, the defendants failed to deliver the Test Kits by 26 April 2020. 45 The defendants aver that the plaintiff failed to prove that in remitting the Purchase Price to HN Singapore, the plaintiff relied on the alleged Representation.64Foot Note 64×DCS dd 20 January 2023 at para 76.On the other hand, the plaintiff submits that it is clear from the outset that the timing of delivery was a core consideration for the plaintiff when it decided to contract with HN Singapore.65Foot Note 65×Plaintiff’s Reply Submissions (“PRS”) dd 10 February 2023 at paras 41–44. The fraudulence of the Representation 46 The plaintiff avers that the Representation as to the delivery date was made fraudulently. Additionally, the plaintiff argues that Mr Eng has evinced a pattern of fraudulent conduct. This is illustrated by the alleged falsification of the Wondfo Invoice. Mr Eng received the Wondfo Invoice on 28 April 2020. The Wondfo Invoice was dated 20 April 2020, and stated a purchase price of US$821,137.50. However, when the Wondfo Invoice was forwarded to the plaintiff on 29 April 2020, the purchase price, date and other information had been removed. The invoice sent to the plaintiff also contained an endorsement of “HN Singapore Pte Ltd” at the corner of the page. The plaintiff argue that Mr Eng removed the purchase price and date from the Wondfo Invoice to mislead the plaintiff as to HN Singapore’s profit arising from the Varied SPA, as well as to obscure the fact that the invoice was only issued two days after the intended delivery date.66Foot Note 66×PCS dd 20 January 2023 at paras 130–131. 47 The defendants deny having made the representation fraudulently.67Foot Note 67×DCC dd 19 March 2021 at para 24. The defendants had reasonable grounds to believe that their representations were true 48 Further, the defendants plead that “[a]t the time of making the [R]epresentation, the [d]efendants honestly believed that the Test Kits would be delivered within the estimated period of 15(+5) days from the receipt of payment”.68Foot Note 68×DCC dd 19 March 2021 at para 24.In response, the plaintiff argues that the defendants have no basis for asserting that Mr Eng held an honest belief that the delivery date could be met.69Foot Note 69×PCS dd 20 January 2023 at paras 128–130; PRS dd 10 February 2023 at para 40.",
        "Lifting the corporate veil": "49 Additionally, the plaintiff claims the corporate veil should be lifted against Mr Eng. The plaintiff pleads that:70Foot Note 70×SOC dd 29 November 2022 at para 17. [Mr Eng] has employed … [HN Singapore] … to evade his legal obligations and/or to commit fraud, [HN Singapore] was employed as an agent or alter ego of [Mr Eng] as its controller, [HN Singapore] is a sham or a façade and/or the justice of the case otherwise requires the lifting of the corporate veil. 50 The plaintiff relies on the following as evidence: (a) Mr Eng is the sole director and sole shareholder of HN Singapore; (b) HN Singapore has a nominal paid-up capital of S$1; (c) HN Singapore has no employees; (d) HN Singapore’s registered address is the address of a residential property owned by Mr Eng’s mother; (e) HN Singapore had no prior experience providing test kits and no track record in the subject matter of the Varied SPA; (f) the Varied SPA required the Purchase Price to be paid in full before delivery was made (which was an “unusual feature”); and (g) the Letter of Proposal included an “unusual feature” that HN Singapore would provide an insurance policy as a guarantee for the Varied SPA, which was never eventually provided.71Foot Note 71×SOC dd 29 November 2022 at para 17; PCS dd 20 January 2023 at paras 115–119. 51 Alternatively, the plaintiff submits that under Argentine law, HN Singapore was undercapitalised, which would justify lifting the corporate veil. In this respect, the plaintiff relies on the export report prepared by its expert witness, Dr Ezequiel Cassagne (“Dr Cassagne”) (“the Expert Report”).72Foot Note 72×PCS dd 20 January 2023 at para 110; Dr Cassagne’s AEIC dd 8 November 2022 at  EC-1 paras 31–37. 52 Accordingly, the plaintiff pleads that by reason of the lifting of the corporate veil, Mr Eng is liable to the plaintiff for the Balance Purchase Price, arising from HN Singapore’s breach(es) of the Varied SPA.73Foot Note 73×SOC dd 29 November 2022 at para 18. 53 The defendants deny that the corporate veil should be lifted.74Foot Note 74×DCC dd 19 March 2021 at para 20.The defendants argue that the defendants made no attempt to conceal the corporate structure of HN Singapore and that the plaintiff has provided no authority that such a structure is problematic under Singapore law. Additionally, given that the Covid-19 pandemic only began at the start of 2020, HN Singapore’s lack of experience in supplying test kits is expected. Further, the alleged “unusual features” of the Varied SPA were accepted by the plaintiff, and simply amount to “a difference in practice”.75Foot Note 75×Mr Eng’s AEIC dd 8 November 2022 at paras 88–95; DCS dd 20 January 2023 at paras 64–69. 54 Additionally, the defendants submit that Dr Cassagne has not shown the definition of undercapitalisation and authority supporting the proposition that mere undercapitalisation alone would entitle the court to disregard the corporate veil. The defendants also submit that it is unclear whether the Argentine courts have any discretion in deciding whether to lift the corporate veil or if this is an automatic process. Lastly, it is not clear whether the Argentine courts will readily disregard corporate legal personality.76Foot Note 76×DCS dd 20 January 2023 at para 63.",
        "Remedies sought by the plaintiff": "55 Based on the foregoing, the plaintiff seeks the following remedies:77Foot Note 77×SOC dd 29 November 2022 at pp 7–8. (a)  a declaration that the Varied SPA has been validly rescinded; (b) damages against Mr Eng and/or HN Singapore in the sum of US$237,619.35, being the Balance Purchase Price; (c) damages against Mr Eng and/or HN Singapore in the sum of US$177,000 or such other sum as may be determined by the Court; (d) alternatively, damages for misrepresentation pursuant to s 2 of the Misrepresentation Act; (e) interest; (f) costs; and (g) such further or other relief as the Court deems fit. 56 The plaintiff also relies on the Expert Report to argue that, under Argentine law, it is entitled to claim against Mr Eng and/or HN Singapore for:78Foot Note 78×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 para 26. (a) the Balance Purchase Price; (b) additional damages equivalent to 10% of the Purchase Price,ie,US$177,000, arising from the breach of contract; and (c) “the time of the delay in which the seller incurred in to reimburse the monies paid by the buyer for a purchase finally frustrated”. 57 On the assumption that the Varied SPA is governed by Argentine law, the defendants submit that Dr Cassagne “has not shown the basis for his view that [the plaintiff] is entitled … to be reimbursed the [P]urchase [P]rice”.79Foot Note 79×DCS dd 20 January 2023 at paras 98–101.Further, the authorities cited by Dr Cassagne do not support his view that the plaintiff is entitled to recover damages equivalent to 10% of the purchase price.80Foot Note 80×DCS dd 20 January 2023 at paras 103–104.With regard to the third head of compensation, Dr Cassagne failed to explain its nature, and the plaintiff failed to evidence any loss that has resulted from the delay in reimbursement of the Purchase Price.81Foot Note 81×DCS dd 20 January 2023 at para 102. 58 Alternatively, on the assumption that the Varied SPA is governed by Singapore law, the defendants aver that the plaintiff has not adduced evidence of its losses arising from HN Singapore’s failure to deliver the Test Kits on time. Therefore, the plaintiff should be awarded only nominal damages.82Foot Note 82×DCS dd 20 January 2023 at paras 107–108.",
        "Summary of HN Singapore’s counterclaim": "",
        "Unlawful termination": "59  HN Singapore claims that the plaintiff’s termination of the Varied SPA on 27 May 2020 amounted to an unlawful repudiation of the Varied SPA. This is because the plaintiff waived HN Singapore’s breach of failing to deliver the Test Kits by 26 April 2020 (as elaborated above at [39]). Consequently, on 22 October 2020, by way of a letter from HN Singapore’s solicitors to the plaintiff’s solicitors, HN Singapore accepted the plaintiff’s repudiation and terminated the Varied SPA.83Foot Note 83×DCC dd 19 March 2021 at para 27. 60 As a result of the plaintiff’s unlawful termination, HN Singapore claims to have lost a net profit of US$318,685.50 that it would have made on the transaction.84Foot Note 84×Mr Eng’s AEIC dd 8 November 2022 at paras 99–105.As such, HN Singapore claims: (a) damages; (b) interest; (c) legal costs; and (d) such further or other relief as deemed fit by the court.85Foot Note 85×DCC dd 19 March 2023 at p 9.",
        "Issues to be determined": "61 I will consider each of the following issues in turn: (a) whether the governing law of the Varied SPA is Argentine law or Singapore law; (b) whether the plaintiff was entitled to terminate the Varied SPA on 27 May 2020; (i) whether there was a repudiatory breach of the Varied SPA by HN Singapore for non-delivery of the Test Kits on 26 April 2020; and (ii) if so, whether the plaintiff waived HN Singapore’s breach through its conductvis-à-visHN Singapore; or (iii) whether, in any event, the Varied SPA had been frustrated by the Chinese Regulations; (c) whether Mr Eng and/or HN Singapore are liable for misrepresentation; (i) whether the alleged Representation was a false statement of existing or past fact; (ii) whether the plaintiffs relied on the Representation; (iii) whether Mr Eng and/or HN Singapore made the Representation fraudulently; (iv) whether Mr Eng and/or HN Singapore believed and had a reasonable belief that the Representation was true; and (v) whether the defendants had properly pleaded its case for misrepresentation; (d) whether the corporate veil should be lifted such that Mr Eng be made liable for HN Singapore’s breach of contract; (e) whether the plaintiff had unlawfully terminated the Varied SPA on 27 May 2020; and (f) the quantum of damages, if any.",
        "Issue 1: The law governing the Varied SPA": "62 I begin the analysis with the issue of the law governing the Varied SPA. After reviewing the relevant evidence, I find that the governing law of the Varied SPA is Argentine law, as the plaintiff contends.",
        "The applicable law": "Actionable misrepresentation 111 To ascertain whether an operative misrepresentation has been made, there must be a false statement of existing or past fact made by the representor before or at the time of making the contract to the other party, the representee, and the representee must have been induced to enter into the contract (Lim Koon Park and another v YapJin Meng Bryan and another[2013] 4 SLR 150 at [38]). 112 InErnest Ferdinand Perez De La Sala vCompañia de Navegación Palomar, SA and others and other appeals[2018] 1 SLR 894 (“Ernest Ferdinand Perez”) at [172]–[173], the Court of Appeal stated that a representation as to the future is not, in itself, actionable. It can, however,implyan actionable representation. For example, a person who makes a statement as to the future may make an implied representation of an existing fact. Alternatively, a person who states an intention as to the future may also implicitly represent that he, in fact, has that intention at the time of making the statement. 113 Additionally, a representation must be shown to be false at the time it wasacted uponie,when the contract is concluded (The Law of Contract in Singaporeat para 11.059). 114 To establish the element of reliance, the representation must have a real and substantial effect on the representee’s mind such that it can be said to be an inducing cause which led him to act as he did. However, it need not be the inducing cause. Therefore, it only needs to have playedsomecausative part in inducing the contract (The Law of Contract in Singaporeat paras 11.074–11.076;AlwieHandoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 (“Alwie”) at [187]). Fraudulent misrepresentation 115 Where the plaintiff allegesfraudulentmisrepresentation, the plaintiff must prove five elements (PanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at [14], as recently applied inMaHongjin v Sim Eng Tong[2021] SGHC 84 at [19] andYongKhong Yoong Mark and others v Ting Choon Meng and another[2021] SGHC 246 at [90]): (a) a false representation of fact was made by words or conduct by the representor; (b) the representation was made with the intention that it should be acted upon by the representee (or by a class of persons which includes the representee); (c) the representee acted upon the false statement; (d) the representee suffered damage by so doing; and (e) the representation was made with knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. 116 I stress at the outset that the plaintiff must satisfy a relatively high standard of proof before a fraudulent misrepresentation can be established successfully against the representor,ie,Mr Eng and/or HN Singapore, because it imports the idea of dishonesty (Wee Chiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 at [30], affirmed inShanghaiAfute Food and Beverage Management Co Ltd v Tan Swee Meng and others[2023] SGHC 34 at [135]). Whilst the standard of proof is one of a balance of probabilities, the more serious the allegation, the more evidence that might have to be adduced (Liberty Sky Investments Ltd v Goh Seng Heng and another[2020] 3 SLR 335 at [63]). Section 2(1) of the MA 117 Section 2(1) of the MA is premised on the representee entering into a contract with the representor. It reads as follows: Damages for misrepresentation 2.—(1) Where a person has entered into a contract after a misrepresentation has been made to him by another party thereto and as a result thereof he has suffered loss, then, if the person making the misrepresentation would be liable to damages in respect thereof had the misrepresentation been made fraudulently, that person shall be so liable notwithstanding that the misrepresentation was not made fraudulently, unless he proves that he had reasonable ground to believe and did believe up to the time the contract was made that the facts represented were true. 118 Under s 2(1) of the MA, the plaintiff must show that the false representation made by the defendant induced the plaintiff to enter into a contract with the defendant, and the plaintiff suffered a loss as a result thereof (Tan Kian Seng v Venture Corp Ltd[2022] 4 SLR 643 at [101]). If the plaintiff has established that, the defendant then bears the burden of proving that it had reasonable grounds to believe and did believe up to the time the contract was made that its representation was true. If the defendant fails to discharge its burden of proof, the defendant will be liable to pay damages to the plaintiff. 119 For the avoidance of doubt, s 2(1) of the MA is an action in contract and therefore only available to one contracting party against another contracting party (RBC PropertiesPte Ltd v Defu Furniture Pte Ltd[2015] 1 SLR 997 at [66]). Therefore, the plaintiff’s claim in statutory misrepresentation can be brought only against HN Singapore, with whom the plaintiff entered into the contract. I find that it is immaterial that any alleged misrepresentation was made by Mr Eng. This is because Mr Eng is the sole shareholder and director of HN Singapore and any alleged misrepresentation would have been made by Mr Eng, not on behalf of himself, but on behalf of HN Singapore. A party to a contract may be liable for damages under s 2(1) of the MA by the representations of his agent, acting within the scope of his authority and on behalf of the contracting party (The Law of Contractat para 11.217).",
        "The decision": "64 In this case, as there is no express provision in the Varied SPA for a governing law, the first stage is inapplicable. Therefore, I move to the second stage. InPacific Recreationat [37], the Court of Appeal set out a non-exhaustive list of factors from which an inference of the parties’ intention can be drawn. These include the language or terminology used in the contract, the form of the documents involved in the transaction, the currency of the contract, the places of residence or business of the parties and the commercial purpose of the transaction. 65 In my view, a factor of great significance in the present case is the commercial purpose underlying the Varied SPA. The case ofRecovery Vehicle 1 Pte Ltd v IndustriesChimiques Du Senegal and another appeal and another matter[2021] 1 SLR 342 (“Recovery Vehicle 1”) provides some guidance. There, the Court of Appeal decided that six contracts for the sale of sulphur cargo (the “Sulphur Contracts”) were governed by Senegalese law. The Court of Appeal found that the common commercial purpose underpinning the Sulphur Contracts pointed to Senegal. This was because the respondent, a Senegal-incorporated company, had entered into the Sulphur Contracts to use the shipped sulphur for manufacturing fertiliser in Senegal. Further, approximately one-third of the respondent’s shares were held by the State of Senegal, the Government of India and the Indian Farmers Fertilisers Collective. Therefore, the Sulphur Contracts were not mere trading contracts (Recovery Vehicle 1at [9] and [68]). 66 It is imperative to note that the Varied SPA was also not a mere trading contract (Recovery Vehicle 1at [68]). Instead, there was a public dimension to the Varied SPA. HN Singapore contracted with the plaintiff, which was a public entity that had instituted a public procurement tendering process for the supply of Covid-19 test kits intended for the people of Buenos Aires. Through this process, the plaintiff would receive contracting proposals from distributors and manufacturers in and outside of Argentina, and award contracts to entities whose proposals met the necessary economic and technical requirements. These actions were taken by a government seeking to prevent the further spread of Covid-19 for the preservation of public health in its city.86Foot Note 86×Ms Tojo’s AEIC dd 7 November 2022 at p 101.Mr Eng himself was aware of the public dimension to the contract. Over correspondence on Whatsapp with Mr Juan on 27 March 2020, Mr Eng stated that he was “looking forward to helping buenos aires with the covid situation [sic]”.87Foot Note 87×Mr Eng’s AEIC dd 29 September 2022 at paras 99–105.Therefore, it was not that the Varied SPA was intended, at the outset, to be between the plaintiff and HN Singapore. Instead, HN Singapore was awarded the Varied SPA because it simply happened to be the party that conformed to the requirements set by the plaintiff. The plaintiff may well have awarded the Varied SPA to any other tendering company. Thus, in so far as the contract was entered into by an Argentine authority with the intention of curbing the spread of Covid-19 in an Argentine city, and it was by chance that the counterparty was HN Singapore, it is more probable that parties intended for the contract to be governed by Argentine law. 67 I also place weight on the fact that the plaintiff effected an Administrative Act in order to enter into the Varied SPA with HN Singapore. The wording of the Administrative Act makes clear that the legal framework of the procurement exercise was Argentine law:88Foot Note 88×Ms Tojo’s AEIC dd 7 November 2022 at p 101. [t]hat through the aforementioned Electronic File references, the Direct Contract No. 2.034/SIGAF/2020 has been processed within the framework of the Health Emergency established by theUrgent Necessity Decree No. 260-PEN/2020 and Urgent Necessity Decree No. 1-GCABA/2020, under the established regulation of Law No. 2095, Article 28, Clause 8th (text consolidated by Law No. 6017), and Decrees No. 168-GCABA/19 and No. 207-GCABA/19, for the “Procurement of rapid test kits for the identification of antibodies to the new coronavirus (COVID-19)”; … it is appropriate to issue the administrative act to definitively resolve the matter at hand; That the Attorney General of the Autonomous City of Buenos Aires has intervened within its competence in accordance with the provisions ofLaw No. 1.218 (text consolidated by Law No. 6.017). … Article 1.- Direct Contract No. 2.034/SIGAF/2020 is approved under theprovisions of Law No. 2095, Article 28 Section 8 (text consolidated by Law No. 6017), and its Regulatory Decree No. 168-GCABA/19, as amended by Decree No. 207-GCABA/19,for the contracting of the “Procurement of rapid test kits for antibodies identification of the new coronavirus (COVID-19)”. Article 2.- The procurement of the supplies mentioned in Article 1 of this resolution is awarded to the company: HN SINGAPORE PTE LTD – Category No. 1 - Quantity: 300,000 units - Unit Price: USD 5.90 - Total Price: USD 1,770,000.00 – Condition of Sale (INCOTERMS): CIF, equivalent to the total sum of $116,377,500.00 based on the currency exchange, at buyer rate, from Banco Nación at the close of the business day prior to the issuance of this resolution, which complies with the technical and economic requirements, and being the only available offer that meets the technical and economic requirements, underthe provisions of Articles 110 and 111 of Law No. 2095 (text consolidated by Law No. 6017)and itsRegulatory Decree No. 168- GCABA/19, as amended by Decree No. 207- GCABA/19… [emphasis added] 68 I acknowledge that the primary effect of the resolution was to authorise the plaintiff to contract with HN Singapore.89Foot Note 89×Transcript (1 December 2022) at 26:22–25.In other words, the plaintiff effected the resolutionin orderto contract with HN Singapore. But this was a necessary act for the plaintiff to award the contract to HN Singapore. On the other hand, I was not convinced by the defendants’ argument that the fact that “Mr Eng is a layperson with no understanding of Spanish and no prior dealings with Argentine public entities” meant that it would be improbable that he intended for Argentine law to govern the Varied SPA.90Foot Note 90×DCS dd 20 January 2023 at para 11. 69 Another relevant factor is the place of performance. Under the Varied SPA, HN Singapore was obliged to deliver the Test Kits to the plaintiff in Buenos Aires, Argentina. This is another reason why the governing law should be Argentine law. To conclude the analysis, I find that the parties intended for Argentine law to apply to the Varied SPA, chiefly because this was a contract for the benefit of an Argentine city, entered into by an Argentine public authority and to be performed in Argentina. That HN Singapore is a Singapore company is not a relevant consideration to my assessment of the governing law of the contract because it was purely incidental that HN Singapore was a party to the contract. 70 Even if I am wrong on this and the governing law of the contract between the parties must be objectively determined under the third stage of thePacific Recreationanalysis instead, I again find that this points to Argentine law as the governing law. Between the second and third stages, the court generally considers the same factors, but accords differing weight to those factors. At the third stage, “[e]qual weight ought to be placed on all factors, even those which would not, under the second stage, have been strongly inferential of any intention as to the governing law” (Pacific Recreationat [48]). The court “look[s] at all the circumstances and seek[s] to find what just and reasonable persons ought to have intended if they had thought about the matter at the time when they made the contract” (Pacific Recreationat [49]). 71 On an analysis of the factors discussed earlier (at [65]–[69]) above), I find that Argentine law has the closest and most real connection with the Varied SPA. The only relevant factors suggesting a connection to Singapore is that HN Singapore is a Singapore company and the Purchase Price was remitted to Mr Eng’s Singapore bank account. The Test Kits were of Chinese origin, manufactured in a factory in China, and of a Chinese brand. HN Singapore was effectively a middleman for the delivery of Test Kits from China to Buenos Aires. Therefore, if I were to place equal weight on all the factors, I find that the Varied SPA is governed by Argentine law. 72 For completeness, I will briefly comment on some other features of the Varied SPA. The language of the Varied SPA is English, but this is not strongly indicative of any choice of law, as English is thelingua francaof international business (Pacific Recreationat [38]). In the present case, Mr Eng neither spoke nor understood Spanish, so the plaintiff’s employees frequently communicated with him in English. The use of English was a matter of convenience. In the same vein, that the Varied SPA used the currency of the US dollar was a neutral factor, as the “universality of the US dollar undermines any inferential value which one might obtain from it” (Pacific Recreationat [44]). Additionally, the requirement for payment before delivery did not undermine my conclusion that the Varied SPA was governed by Argentine law. Even though the plaintiff’s usual practice was to make full payment after delivery, the plaintiff had received approval to depart from its usual practice and ostensibly did so in light of the emergency Covid-19 situation, where test kits had been in short supply.91Foot Note 91×Transcript (29 November 2022) at 66:1–25 and 67:1–10.",
        "Pleadings": "134 Apart from the Representation, the plaintiff submits that Mr Eng made two other representations: (a) First, Mr Eng represented to Mr Seward that he and/or HN Singapore were in the business of importing and exporting commodities and supplies, including medical supplies (the “Business Representation”). Mr Seward then passed on the Business Representation to the plaintiff. This representation created the expectation that HN Singapore was a reliable or suitable business partner and had relevant experience dealing with similar orders, thereby inducing the plaintiff to contract with HN Singapore. However, under cross-examination, Mr Eng conceded that HN Singapore never successfully exported any goods, and that HN Singapore had no experience dealing with medical supplies prior to the start of the Covid-19 pandemic.117Foot Note 117×PCS dd 20 January 2023 at paras 120–123. (b) Second, Mr Eng made misleading statements that he was a member of the Singapore delegation to the 2018 G20 Leaders’ Summit in Buenos Aires, or that he was part of the summit in some capacity (the “G20 Representation”). This representation induced the plaintiff to contract with HN Singapore, on the basis that the defendants were reputable in Singapore, associated with the Singapore authorities, and would be able to deliver as promised.118Foot Note 118×PCS dd 20 January 2023 at paras 124–125; Ms Tojo’s AEIC dd 7 November 2022 at para 8. 135 Both of these claims were not part of the plaintiff’s pleaded case. Parties must set out in their pleadings the relevant facts, or allegations of fact, and the applicable points of law in support of their respective claims, counterclaims, defences and replies (VNithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 (“VNithia”) at [34]). Having set out its case in the pleadings, a party is generally bound by those pleadings (VNithiaat [38]). If a party seeks to change its case, it must amend its pleadings accordingly to give fair notice to the other parties in the litigation (3N Investments Groups Ltd and another v Lim Boon Chye Victor and others[2023] SGHC 76 at [33]). 136 The plaintiff has not amended its pleadings. In its Statement of Claim, the plaintiff’s pleaded case for the claim of misrepresentation was only that the defendants, knowing that time was of the essence to the plaintiff for the delivery of the Test Kits, represented to the plaintiff that they would be able to deliver the Test Kits within 15(+5) days of receipt of payment from the plaintiff. No reference is made to Mr Eng’s alleged participation in the G20 Leaders’ Summit or the representation that HN Singapore was in the business of exporting medical supplies. The plaintiff should have made its case clearly and unambiguous in its pleadings. 137 In any case, even if the plaintiff had sufficiently pleaded its case, I do not find that the G20 Representation and Business Representation amount to actionable misrepresentations. First, the plaintiff has not proven that Mr Eng made either of the representations. The plaintiff could not point to a specific occasion where Mr Eng made the G20 Representation and Business Representation. The plaintiff relies on the email sent to the plaintiff on 23 March 2020, where Mr Eng is introduced as “from the G20 Chinese/Singaporean delegation” and “working with commodities and supplies (Medicine, is one of them) [sic]”. However, this email was sent by Mr Seward, and Mr Eng was not copied. There is also no evidence that Mr Seward sent the email on behalf of Mr Eng or on Mr Eng’s instructions. The plaintiff also relies on another email sent by Mr Eng on 29 April 2020, but this email post-dates the date that parties entered into contract. Second, the burden of proof is on the plaintiff to show the falsity of the G20 Representation, but the plaintiff has failed to adduce any evidence to show that Mr Eng did not attend the 2018 G20 Leaders’ Summit. 138 Therefore, I dismiss the plaintiff’s claim of misrepresentation.",
        "Issue 2: Termination of the Varied SPA": "",
        "Formation of the contract": "75 As a preliminary point, I set out my findings for the formation of the contractual relationship between HN Singapore and the plaintiff. 76 It is trite that an invitation to tender is, without more, an invitation to treat and not an offer (UOL Development (Novena) Pte Ltd v Commissioner of Stamp Duties[2008] 1 SLR(R) 126 at [11]). Therefore, Mr Santiago’s request on 29 March 2020 for a formal offer from HN Singapore only amounted to an invitation to treat. The Proposed SPA that Mr Eng sent to the plaintiff subsequently on 29 March 2020 constituted an offer to contract. The plaintiff accepted this on 2 April 2020, when the plaintiff informed Mr Eng that HN Singapore had been awarded the procurement contract (The Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2nd Ed, 2022) (“The Law of Contract in Singapore”) at para 03.150). 77 On 2 April 2020, pursuant to the terms of the Proposed SPA, HN Singapore issued the Invoice stipulating the precise terms of the plaintiff’s intended order. This purchase order was then executed by the plaintiff’s payment of the Purchase Price on 6 April 2020. 78 Subsequently, on 12 April 2020, the terms of the agreement were varied. The Varied SPA captures the final terms of the agreement between parties.",
        "Whether the plaintiff was entitled to terminate the Varied SPA under Argentine law": "The applicable principles on proof of foreign law 79 The principles relating to proof of foreign law are well established. In the recent decision ofKuveraResources Pte Ltd v JPMorgan Chase Bank, NA[2022] SGHC 213 (“KuveraResources”), the Honourable Judge of the High Court Vinodh Coomaraswamy J succinctly summarised the relevant principles at [144]|: (a) The content of foreign law is a question of fact which must be proved (seeMalayan BankingBhd v Bakri Navigation Co Ltd and another[2020] 2 SLR 167 at [59]). That is because the court lacks knowledge of foreign law and must be informed of its content by the evidence of witnesses. The court cannot simply take judicial notice of foreign law (seeEFT Holdings, Inc and another vMarinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 at [57]), at least not in the absence of a statutory basis for doing so. (b) The party asserting foreign law bears the burden of proving it as an issue of fact (seeStar Cruise Services Ltd v Overseas Union Bank Ltd[1999] 2 SLR(R) 183 at [77]). (c) Foreign law can be proved either by directly adducing raw sources of foreign law in evidence where permitted by statute (see ss 39(b), 39(c), 40, 59(1)(b), 80(1)(c) and 80(2) of the Evidence Act 1893 (2020 Rev Ed)) or by adducing the opinion of an expert in the foreign law (seePacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”) at [54]). (d) The court is not obliged to accord raw sources of foreign law any evidentiary weight. This is because the content of the raw source, approached on its own, may mislead persons not familiar with that system of law (seePacific Recreationat [60] and [78]). (e) As such, raw sources of foreign law should be accompanied by expert evidence on the foreign law. Expert evidence may be especially helpful where, for instance, the foreign legislation has no equivalent in our own legislation, or where the issue is of great complexity or is the subject of controversy in the foreign jurisdiction (seePacific Recreationat [60]). (f)Where expert evidence of the foreign law is uncontradicted, the court will normally be reluctant to reject it. In any event, the court is not entitled to do so based on its own research. A court will normally accept uncontradicted expert evidence unless it is, for example, obviously false, obscure, extravagant, lacking in obvious objectivity and impartiality or patently absurd(seeRe Gerald Martin Smith Serious Fraud Office and another v Litigation Capital Ltd (a company incorporated in the Marshall Islands) and others[2021] EWHC 1272 (Comm) at [512]). [emphasis added] 80 The defendants chose not to call an expert witness on Argentine law. Therefore, the sole expert witness on Argentine law was the plaintiff’s expert witness, Dr Cassagne. 81 Dr Cassagne is a partner at an Argentine law firm, Cassagne Abogados, where he has practised law for 20 years. He has experience advising Chinese companies. Additionally, Dr Cassagne is a member of the Argentine Chinese Chamber of Commerce and president of the Argentine Association of Friendship with the People of China. He is also a university professor of Administrative Law at the University of Buenos Aires, the Pontifical Catholic University of Argentina, and the National University of Lomas de Zamora.95Foot Note 95×Dr Cassagne’s AEIC dd 8 November 2022 at para 1 and EC-1 paras 3–9. Application of the law 82 Dr Cassagne gave evidence that HN Singapore’s failure to deliver the Test Kits within the time stipulated in the Varied SPA would, if proven in court, entitle the plaintiff to terminate the Varied SPA.96Foot Note 96×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 para 24.According to s 122 of the Government of the City of Buenos Aires’ (“GCBA”) Law 2075 on Government Procurement, “once verified the expiration of the term agreed without having the seller performed its obligations under the contract (in the case of procurement … deliverance of purchased goods at buyer’s domicile) [sic]”, the plaintiff is entitled to terminate the contract without further ado.97Foot Note 97×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 para 25. 83 The substance and content of Dr Cassagne’s expert evidence in relation to the plaintiff’s entitlement to terminate the Varied SPA are uncontradicted and unchallenged. At trial, the defendants elected not to put any questions by way of cross-examination to Dr Cassagne, about the applicability and effect of s 122 of GCBA’s Law 2075 on Government Procurement. The defendants also do not make any submissions on the plaintiff’s entitlement to terminate the Varied SPA under Argentine law. 84 Given that Dr Cassagne’s evidence on this matter is uncontradicted and not obviously false, obscure, extravagant, lacking in obvious objectivity and impartiality or patently absurd (KuveraResourcesat [144(f)]), I accept it and find that the plaintiff was entitled to terminate the Varied SPA under Argentine law. 85 However, in the event that I have erred in deciding that the Varied SPA is governed by Argentine law, I consider whether the plaintiff was entitled to terminate the Varied SPA under the law of Singapore.",
        "Whether HN Singapore was in repudiatory breach of contract under Singapore law": "86 Both parties agree that it was a term of the Varied SPA that HN Singapore was obliged to deliver the Test Kits to the plaintiff within 15(+5) days upon payment,ie,by 26 April 2020. It is also undisputed that HN Singapore failed to deliver the Test Kits to the plaintiff by 26 April 2020. It appears on first glance that HN Singapore breached the Varied SPA for the non-delivery of the Test Kits on 26 April 2020. 87 I note that the defendants did not dispute that the non-delivery of the Test Kits on 26 April 2020 constituted arepudiatorybreach of the Varied SPA.98Foot Note 98×The analytical structure set out by the Court of Appeal inRDC ConcretePte Ltd v Sato Kogyo (S) Pte Ltd and another appeal[2007] 4 SLR(R) 413 (“RDC Concrete”) is instructive. There are three scenarios where an innocent party is entitled to terminate a contract in the absence of an express provision to do so (RDC Concreteat [93], [97] and [99], as summarised iniVentureCard Ltd and others v Big Bus Singapore City Sightseeing Pte Ltd and others[2022] 1 SLR 302 (“iVentureCard”) at [63]): (a) “Scenario 1”: Where the party in breach renounces its contract inasmuch as it clearly conveys to the innocent party that it will not perform its contractual obligations at all. … This amounts to a repudiation of the contract by the party in breach. (b) “Scenario 2”: Where the party in breach breaches a condition of the contract that the parties had contemplated was so important that a breach would give rise to a right of termination … (c) “Scenario 3”: Where the breach in question would deprive the innocent party of substantially the whole benefit it intended to obtain from the contract … This is the approach laid down inHongkong Fir Shipping Co Ltd v Kawasaki Kisen Kaisha Ltd[1962] 2 QB 26 at 70, under which an innocent party will be entitled to terminate the contract if the nature and consequences of the breach are so serious as to “go to the root of the contract” (otherwise termed a fundamental breach of the contract). I note that the terminology used iniVentureCardto describe the scenarios differ from that inRDC Concreteat [113]. To be clear, I will adopt the terminology used iniVentureCard. 88 In this case, there was no renunciation of contract by HN Singapore (ie,Scenario 1). Even after the non-delivery of the Test Kits on 26 April 2020, the defendants submit that HN Singapore continued to work with the plaintiff for the delivery of the Test Kits. Mr Eng even conveyed to the plaintiff that the defendants “maintained utmost dedication to seeing the deal through” and that they “remained committed … to ensure that the goods get … delivered as soon as possible”.99Foot Note 99×Mr Eng’s AEIC dd 8 November 2022 at para 66.A reasonable person would not conclude that HN Singapore no longer intended to be bound by the Varied SPA (San International Pte Ltd (formerly known as San HoHuat Construction Pte Ltd) v Keppel Engineering Pte Ltd[1998] 3 SLR(R) 447 at [20]). 89 I am also of the view that the delivery date of 20 days upon receipt of payment was not a condition of the Varied SPA. For a term in a contract to be a condition, the parties must intend that the term beso importantto the parties that any breach would entitle the innocent party to terminate the contract, irrespective of the consequences of the breach (The Law of Contract in Singaporeat para 17.060;RDC Concreteat [97]). It must be borne in mind that the events in this case took place during a time of great uncertainty and urgency. The plaintiff was well aware of the difficulty faced by local and international markets in providing critical supplies to combat the pandemic. This was precisely why the plaintiff instituted its public procurement tendering process.100Foot Note 100×Ms Tojo’s AEIC dd 7 November 2022 at paras 4–5 and p 101.Therefore, although time was of the essence to the plaintiff for the delivery of the Test Kits, the plaintiff’s primary objective was to secure the Test Kits. It is implausible that the plaintiff would intend to terminate the Varied SPA just because the defendant delivered the Test Kits to the plaintiff one day late. Likewise, I find that HN Singapore did not intend that non-delivery of the Test Kits by 26 April 2020 would entitle the plaintiff to terminate the Varied SPA. Therefore, this was not a case of a Scenario 2 breach. 90 Lastly, I consider whether HN Singapore’s breach of non-delivery was a Scenario 3 breach. The analytical approach comprises two steps. First, I must identify what exactly constituted the benefit that the parties intended the innocent party to derive from the contract. Second, I must examine the actual consequences of the breach that occurred at the time that the innocent party terminated the contract (Sports Connection Pte Ltd vDeuter Sports GmbH[2009] 3 SLR(R) 883 at [62]). 91 In this case, the benefit intended by the parties under the Varied SPA was for the plaintiff to receive delivery of the Test Kits by 26 April 2020, in order for the plaintiff to use the Test Kits to prevent and treat Covid-19. HN Singapore’s breach as of the date of termination, 27 May 2020, caused the plaintiff to not receive any of the Test Kits promised under the Varied SPA. What the plaintiff expected to receive and what it actually received by the time it terminated the contract leads me to conclude that, as of 27 May 2020, the plaintiff was deprived of substantially the whole benefit it intended to obtain from the Varied SPA. In fact, I might say that it was deprived ofallof the benefit it expected to receive under the Varied SPA (seeAero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd[2013] 4 SLR 409 (“Aero-Gate”) at [56]). Therefore, I hold that HN Singapore committed a Scenario 3 breach, which would entitle the plaintiff to terminate the Varied SPA.",
        "Defence 1: Whether the plaintiff waived of its right to terminate the contract": "92 The next issue is whether, even if HN Singapore was in repudiatory breach for non-delivery of the Test Kits on 26 April 2020, the plaintiff subsequently affirmed the Varied SPA and waived its right to terminate the Varied SPA. As elaborated above at [39], the defendants submit that the plaintiff elected to waive its right to terminate the Varied SPA. The applicable law 93 Under Singapore law, waiver by election refers to the abandonment of a right which arises by virtue of a party making an election (Halsbury’s Laws of Singaporevol 7(LexisNexis, 2021 Reissue) at para 80.467). According toAudi Construction Pte Ltd v KianHiap Construction Pte Ltd[2018] 1 SLR 317 at [54]: [waiver by election] concerns a situation where a party has a choice betweentwo inconsistent rights. If he elects not to exercise one of those rights, he will be held to have abandoned that right if he has communicated his election in clear and unequivocal terms to the other party. [emphasis added] 94 In the present case, the repudiatory breach of contract by HN Singapore,ie,the failure by HN Singapore to deliver the Test Kits by 26 April 2020, gives the plaintiff, the innocent party, a right to elect between terminating the contract and affirming it. If the plaintiff elects to affirm the contract, he abandons and thereby waives the right to later terminate the contract on the grounds of the same breach (Aero-Gateat [41]). 95 There are three requirements for the doctrine of waiver by election to operate (Aero-Gateat [42]): (a) First, the innocent party must have acted in a manner consistent only with affirming the contract,ie, treating the contract as still alive. (b) Second, the innocent party must have communicated his election,ie, his choice to affirm the contract, to the party in breach in clear and unequivocal terms. (c) Third, there must be sufficient knowledge on the part of the innocent party. At minimum, the innocent party must be aware of the facts giving rise to his right to terminate the contract. Beyond this, the Court of Appeal has left open the question of the extent of knowledge required (Chai Cher Watt(trading as Chuang Aik Engineering Works) v SDL Technologies Pte Ltd and another apeal[2012] 1 SLR 152 at [34]). The decision 96 With regard to the first requirement, the defendants rely on the fact that parties continued to liaise on matters relating to the Varied SPA between 27 April 2020 and 27 May 2020 to show that the plaintiff continued to treat the Varied SPA as existing (as elaborated above at [39]).101Foot Note 101×DCS dd 20 January 2023 at para 40.Additionally, the defendants submit that between 27 April 2020 and 27 May 2020, the plaintiff failed to reserve its right to terminate the contract.102Foot Note 102×DCS dd 20 January 2023 at paras 41–42. 97 In my view, the evidence supports the defendants’ submission that the plaintiff continued to treat the contract as alive after the delivery deadline had lapsed on 26 April 2020. Ms Tojo admitted that the plaintiff “wanted to keep [the Varied SPA] alive so the person who had the responsibility to deliver those kits actually delivered those kits”.103Foot Note 103×DCS dd 20 January 2023 at para 38; Transcript (30 November 2022) at 23:9–17.The plaintiff also does not deny the defendants’ submission104Foot Note 104×DCS dd 20 January 2023 at para 15.that it continued to liaise with the defendants on matters relating to the Varied SPA between 27 April 2020 and 27 May 2020.105Foot Note 105×PRS dd 10 February 2023 at para 26.In particular, the plaintiff repeatedly asked the defendants for the arrival date of the Test Kits (see above at [23])106Foot Note 106×Mr Eng’s AEIC dd 8 November 2022 at paras 28, 36, 39, 47, 53 and 64–65.. Nonetheless, I find that the plaintiff did not waive HN Singapore’s repudiatory breach. 98 In this regard, the case ofAero-Gateis instructive. The facts ofAero-Gateare as follows: the plaintiff had engaged the defendant to fabricate and deliver containerised diesel generators to the plaintiff under two purchase orders. Under the second purchase order (“PO 2”), the defendant was obliged to deliver four generators by two specific dates. The defendant failed to meet its delivery deadlines under PO2 but continued to work even after the lapse of those deadlines. Subsequently, the defendant delivered two completed generators, but made no further deliveries thereafter. The plaintiff persistently pressured the defendant to carry out its work on the third and fourth units and to fix dates for testing them. Eventually, the plaintiff terminated PO 2. At the time it did so, the defendant was still working on two generators (Aero-Gateat [19]–[20] and [122]). The High Court found that the defendant in that case had committed a Scenario 3 repudiatory breach in failing to meet the delivery deadlines, and that the plaintiff had not waived its right to terminate PO2 in so far as this arose by reason of it having been deprived of substantially the whole benefit of the contract. 99 At [124], the High Court inAero-Gateremarked: … Since determining whether a breach is a repudiatory breach necessitates an assessment of the actual consequences of the breach,parties must be entitled to wait and see what theseconsequencesactually are: seeRDC Concrete…at [100].Hence, it is not at all inconsistent for the innocent party to treat the contract as alive post-breach and then to terminate itsubsequentlywhen it transpires that the consequences of that breach operate to deprive him ofsubstantially the whole benefit of the contract.In this case, the plaintiff’s conduct in treating PO 2 as alive can at best be an election to affirm the contractforthe time being.It cannot be an election to affirmthe contractfor all time, regardless of the consequences of the breach as they became apparent over time. Therefore I hold that, however much the plaintiff’s conduct might amount to a waiver by election of its right to terminate PO 2 for breach of condition, assuming the term breached was indeed a condition,it did not amount to a waiver by election – or any other waiver – of its right to terminate PO 2 for repudiatory breach. [emphasis in original in italics, emphasis added in bold italics] 100 This reasoning is apposite and in accordance with commercial reality. The plaintiff was entitled to treat the Varied SPA as alive to assess whether it had been deprived of substantially the whole benefit it intended to obtain from the Varied SPA. The fact that the plaintiff treated the Varied SPA as alive between 27 April 2020 and 27 May 2020 was, at best, an election to affirm the contract for the time being and not an election to affirm the contract for an indefinite period of time. Subsequently, when HN Singapore repeatedly postponed its estimated deadlines for delivery by a month, and given the climate of uncertainty and urgency, the plaintiff was entitled to terminate the Varied SPA. 101  This analysis is sufficient to dispose of the defendants’ defence of waiver by election.",
        "Defence 2: Whether the Varied SPA was frustrated": "102 The next issue is whether the Varied SPA was frustrated by a supervening event under the common law doctrine of frustration. As no evidence was led by either party to prove the Argentine law on the issue of frustration, it is presumed that Argentine law is the same as Singapore law. The applicable law 103 The law on frustration in Singapore is well-established. Under the doctrine of frustration, both parties are automatically discharged from their contract by operation of law when, without the default of either party, a supervening event that occurred after the formation of the contract renders a contractual obligation radically or fundamentally different from what had been agreed in the contract (Alliance Concrete Singapore Pte Ltd v Sato Kogyo (S) Pte Ltd[2014] 3 SLR 857 (“Alliance Concrete”) at [33];RDC Concreteat [59]). Subsequently, thereto, relief is determined under the Frustrated Contracts Act (Cap 115, 2014 Rev Ed). 104 The Court of Appeal has stressed that the doctrine is only to be applied to discharge parties from their contract in trulyexceptionalcircumstances, such that the courts have been careful to apply the doctrine strictly. In light of this, “the precise factsbecome of the first importance” [emphasis in original] (Alliance Concreteat [39]–[40]). The decision 105 I reject the defendants’ submission that the Chinese Regulations frustrated the Varied SPA. I say this for a number of reasons. 106 Firstly, I do not consider the 31 March Regulations to have occurredafterthe formation of the contract. The parties contracted with each other on 2 April 2020 when the plaintiff informed HN Singapore that it had been awarded the contract to supply the Test Kits. Subsequently, the Varied SPA was entered into on 12 April 2020. On Mr Eng’s own evidence, he proposed to vary the original agreement because he had learnt of the “recent changes of China’s export policy with regard to test kits”,ie,the 31 March Regulations.107Foot Note 107×Mr Eng’s AEIC dd 8 November 2022 at p 147.These policy changes gave him reason to believe that “it might be difficult for Wondfo to export test kits in Chinese packaging”.108Foot Note 108×Mr Eng’s AEIC dd 8 November 2022 at para 21 and p 147.In fact, he communicated to the plaintiff that “[t]he Wondfo kit with Chinese packaging can no longer be exported”.109Foot Note 109×Mr Eng’s AEIC dd 8 November 2022 at p 121.Therefore, to overcome difficulties in delivering the Test Kits to the plaintiff, the Proposed SPA was amended to provide for test kits in English packaging instead, which were “meant for international exports”.110Foot Note 110×Mr Eng’s AEIC dd 8 November 2022 at para 21 and p 147.It is thus clear that the Varied SPA had been entered intoafterthe 31 March Regulations came into effect. In fact, Mr Eng and/or HN Singapore were aware of the 31 March Regulations, and the Varied SPA was intended to accommodate its effects on the delivery of the Test Kits. 107 Secondly, there is insufficient evidence that the Chinese Regulations amounted to supervening events. In support of the defendants’ defence of frustration, Mr Eng exhibited translated copies of Announcement No 5 of 2020 on the “Orderly Export of Medical Supplies”, Announcement No 12 of 2020 on “Further Strengthening the Quality Supervision on the Exported Pandemic Prevention Supplies” and the notice on the “Special Rectification Plan for Regulating the Quality of National Pandemic Control Supplies and the Market Order”, which brought into force each of the Chinese Regulations. 108 The content of these Chinese Regulations is a question of fact which must be proved (KuveraResourcesat [144]) (as was elaborated above at [79]). In this case, the defendants have adduced only the raw sources of Chinese Regulations in evidence. However, the court is not obliged to accord raw sources of foreign law any evidentiary weight, as its content, when approached on its own, may mislead persons unfamiliar with the system of law (Pacific Recreationat [60] and [78]). Therefore, inPacific Recreation, the Court of Appeal opined that raw sources of foreign law should be accompanied by expert evidence on the foreign law. This will allow the court to obtain the expert’s opinion as to the law’s effect (at [78]). For instance, in this case, it is unclear how, pursuant to the 13 May Regulations, the Chinese government would “[c]omprehensively strengthen the supervision of pandemic prevention materials for export”. The defendants have failed to call an expert witness on Chinese law. Aside from the Chinese legislation, the defendants have failed to exhibit any further evidence of how the Chinese Regulations rendered the delivery impossible. The text of the 25 April Regulations suggests that manufacturers must have obtained “foreign standard certification” from the Chinese Ministry of Commerce. Again, no documentation is provided regarding the approval process for Wondfo to acquire the necessary certifications, the actual steps taken by Wondfo to apply for this certification, and the response of the Chinese government to such an application. It is also not known when the 13 May Regulations came into effect. Therefore, I find that the defendants did not sufficiently prove that the Chinese Regulations have made it impossible to perform the Varied SPA and constituted a supervening event. Accordingly, the defendant’s defence of frustration must fail. 109 Furthermore, the plaintiff submits that HN Singapore’s offer to perform the contract by obtaining the Test Kits from Wondfo’s warehouse in Chicago confirms that the performance of the Varied SPA was not rendered impossible by the Chinese Regulations.111Foot Note 111×PCS dd 20 January 2023 at paras 101–102; PRS dd 10 February 2023 at paras 48–49; Mr Eng’s AEIC dd 8 November 2022 at p 269.I agree that this indicates that the contract was not impossible of execution.",
        "Issue 3: Misrepresentation": "110 I hold that the HN Singapore and/or Mr Eng are not liable for misrepresentation.",
        "Whether the defendants made a false representation of fact to the plaintiff": "120 In the letter of offer dated 27 March 2020, HN Singapore stated that the delivery time for the Test Kits would be “10(+10) days upon payment”,ie, HN Singapore would deliver the Test Kits within 20 days of receipt of payment. The Representation is therefore not one of present or past fact because it relates, at the time it was made, to a matter that would occur in the future. 121 The question, then, is whether it is possible to imply a representation of present fact (Ernest Ferdinand Perezat [172]–[173]). InErnest Ferdinand Perez, the Court of Appeal cited the English decisions ofGerhard v Bates(1853) 2 El & Bl 476, where a statement as to the likely output of a mine was found to imply a representation as to the present state and capacity of the mine, as well asMathias vYetts(1882) 46 LT 497 at 503, where a statement that certain costs would be paid out of a particular fund was found to imply a representation that such costs were payable out of that fund (at [172]). 122 In this case, one possible implied representation was that HN Singapore had theabilityto effect the delivery of the Test Kits within 20 days of receipt of payment. The plaintiff has not adduced any positive evidence to show that, at the time that parties contracted with each other,ie,2 April 2020, HN Singapore could not deliver the Test Kits. The plaintiff points to the fact that the Test Kits were ultimately not delivered on 26 April 2020 to show the falsity of the Representation.112Foot Note 112×SOC dated 29 November 2022 at para 23.However, the non-delivery of the Test Kits on 26 April 2020 does not necessarily mean that HN Singapore was unable to deliver the Test Kits as at 2 April 2020. Additionally, the fact that HN Singapore only contracted with Wondfo on 20 April 2020 does not mean that as at 2 April 2020, HN Singapore was unable to procure the Test Kits and deliver them to the plaintiff by 26 April 2020. Therefore, I find that the plaintiff has not proven that Mr Eng and/or HN Singapore made a false representation. 123  However, there is no evidence that Mr Eng and/or HN Singapore lacked such an intention at the material time. Therefore, the defendants’ alleged implied representation as to their intentions was not proven false either. On this basis, I find that there was no actionable misrepresentation. 124 Additionally, I find that the delivery time stated in the letter of offer was a fixed period, and not an estimated period, as contended by the defendants. Nothing in the letter of offer suggests that the “10(+10) days” stated was an estimated period.",
        "Whether the plaintiff relied on the defendants’ Representation": "125 If I am wrong and the defendants did make a false representation of fact to the plaintiff, I am satisfied that the Representation induced the plaintiff to contract with HN Singapore. 126 The defendants sent the Letter of Proposal to Mr Juan and Ms Tojo, who were acting on behalf of the plaintiff, pursuant to a request made by Mr Juan via Whatsapp on the same date, 27 March 2020. The request is as follows:113Foot Note 113×Mr Eng’s AEIC dd 8 November 2022 at p 36. I need a formal offer in .pdf sent to jmpaleo@buenosaires.gob.ar and mtojo@buenosaires.gob.ar detailing: - name of product - brand - factory name and addres [sic] -timeand cost (FOB and CIF) - paying method for 500k individual tests [emphasis added] 127 The background to this request was that Mr Juan had enquired with Mr Eng whether HN Singapore could supply test kits to the plaintiff. After some initial discussion, Mr Juan informed Mr Eng that the plaintiff required a formal offer. This was so that parties could “move forward”.114Foot Note 114×Mr Eng’s AEIC dd 8 November 2022 at p 36.Given that the plaintiff specifically requested for the “time” (which most probably referred to the time of the delivery) to be included in the letter of offer that the plaintiff would consider in deciding whether to contract with HN Singapore, I find that the timing of delivery played a causative role in the plaintiff contracting with HN Singapore. Further, I consider the urgency with which the plaintiff sought to procure Covid-19 test kits. It is clear that a suitable time frame for delivery would be a relevant consideration that would affect the decision to enter into contract.",
        "Fraudulent misrepresentation": "128 In any event, I do not think that the plaintiff has established its claim of fraudulent misrepresentation. I am not satisfied that Mr Eng and/or HN Singapore made the Representation with knowledge that it was false, or at least in the absence of any genuine belief that it was true. The plaintiff has not provided any evidence to show that at the time when the parties entered into the contract, Mr Eng and/or HN Singapore did not genuinely believe that HN Singapore could deliver the Test Kits 20 days upon payment. Additionally, the allegedly fraudulent Wondfo Invoice was sent to the plaintiff on 29 April 2020, long after parties had contracted with each other. Therefore, the plaintiff has failed to discharge the heavy burden of proving fraud or dishonesty, and the defendants are not liable for fraudulent misrepresentation.",
        "The defendants failed to discharge their burden under s 2(1) of the MA": "129 In the event that I erred, and HN Singapore did make an operative misrepresentation, I consider whether HN Singapore discharged its burden of proving that it had reasonable grounds to believe and did believe up to the time that parties entered into contract that its representation was true. 130 I accept as a fact that Mr Eng, on behalf of HN Singapore, did believe up to the time that HN Singapore entered into the contract with the plaintiff that HN Singapore could deliver the Test Kits within 20 days upon payment. 131 The question that remains with regard to s 2(1) of the MA is whether HN Singapore discharged its burden of proving that it had reasonable grounds to believe that its representation was true at the material time. I find that the HN Singapore did not have reasonable grounds for that belief. 132 At the material time, HN Singapore had no confirmation from Wondfo that they could commit to delivering the Test Kits within 20 days upon payment. Mr Eng gave evidence that “[his] belief was based on the available information from Wondfo at that time for the production of the test kits to be completed and shipped from China to Buenos Aires.” He claimed that “[he] did not know of anything on 2 or 9 April 2020 that [would cause him] to doubt that the test kits could not be delivered within the said estimated period.”115Foot Note 115×Mr Eng’s AEIC dd 8 November 2022 at para 97.However, HN Singapore did not adduce this information from Wondfo as evidence. At trial, Mr Eng admitted that such alleged information was, in fact, conveyed to him through a middleman, one Mr Li Chong:116Foot Note 116×Transcript (2 December 2022) at p 79:18–23, 81:1–25, 82:1–7. Q. Okay, a quick question, Mr Eng. As of 27 March, 2020, what communications did you have with Wondfo which gave you the assurance that you could commit to 10 plus 10 days upon payment? A. Not directly to Wondfo but to Louis and Louis to Wondfo. … Q. As far as you are aware, was there any communication from you to Louis or from Louis to Wondfo in respect of this delivery time of 10 plus 10 days upon payment that you were committing to or you were prepared to commit to in this letter of offer at page 43? … A. Yes. Me and Louis, yes. … Q. But it's not in your affidavit? A. No. I think sometimes we also do through call, so might not be able to, like, attach the call. … Q. What was the basis for you to make that representation in the letter of offer? A. When I spoke to Louis, then Louis let me know, Louis is like on the ground. Q. That's your only basis? A. Yes. 133 The correspondence between Mr Eng and Mr Li Chong that allegedly caused Mr Eng to form his belief was not tendered as evidence either. Therefore, I find that HN Singapore had no reasonable belief in the Representation.",
        "Issue 4: Lifting the corporate veil": "139 Having found HN Singapore liable for breach of the Varied SPA, I turn now to consider the plaintiff’s argument that the corporate veil should be lifted so as to hold Mr Eng liable.",
        "The position under Argentine law": "140 On the basis that the Varied SPA is governed by Argentine law, I find that, on the balance of probabilities, the corporate veil should be lifted, and Mr Eng should be liable for HN Singapore’s breach of contract. 141 According to Dr Cassagne, under Argentine law, where a corporation is “being undercapitali[s]ed and the partners [are] not being responsible for social obligations beyond their contribution ”, the “corporation’s limited liability ceases to exist and shareholders shall be subject to joint and unlimited liability for the obligations of the company”, which consists of “piercing the corporate veil”.119Foot Note 119×` Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 paras 32–34.In this case, there was “no ostensible attempt to conceal that HN Singapore is a mere vehicle of Mr Eng’s will” and that HN Singapore is “a shell to minimize [sic] the corporation’s solvency”. The plaintiff submits that “a paid up capital of S$1 in [HN Singapore’s] case is not adequate financing to supply the entity with enough capital for its anticipated business needs”.120Foot Note 120×PRS dd 10 February 2023 at para 73.The underlying principle appears to be that if a company is undercapitalised and the transaction is for a large sum, the plaintiff can have recourse to the shareholders if the defendant is in breach of contract. Given that Mr Eng, the shareholder, has failed to capitalise HN Singapore adequately, in Dr Cassagne’s expert opinion, “Argentine judges shall allow piercing the corporate veil, so as to assure the decision to be rendered being effective against [HN] Singapore or whoever hold shares in said corporation”.121Foot Note 121×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 paras 33. 142 In my judgment, it is significant that the expert opinion of Dr Cassagne was unchallenged by any other expert evidence. As mentioned, the defendants did not elect to call an expert to testify on its behalf. While this does not mean that I am obliged to accept Dr Cassagne’s evidence without more, the Court of Appeal has held that the court should be slow to reject expert evidence which is unopposed (Saeng-Un Udom v Public Prosecutor[2001] 2 SLR(R) 1 at [26] (“Saeng-Un Udom”), affirmed inSudhaNatrajan v The Bank of East Asia Ltd[2017] 1 SLR 141 at [46]). Given that the evidence is based on sound grounds and supported by the basic facts, I accept the evidence given by Dr Cassagne and find that the corporate veil may be lifted under Argentine law.",
        "The position under Singapore law": "143 Having found that the Varied SPA is governed by Argentine law, it is not necessary for me to consider whether HN Singapore’s corporate veil ought to be pierced under Singapore law to hold Mr Eng personally liable. Nevertheless, on the basis that I have erred and the governing law of the Varied SPA is instead Singapore law, I find the corporate veil should not be pierced under Singapore law. 144 The separate legal personality of a company forms the cornerstone of company law (Salomon v Salomon[1897] AC 22). Exceptionally, however, the law will go behind the separate legal personality of a company and pierce the corporate veil (SimgoodPte Ltd v MLC Shipbuilding Sdn Bhd and others[2016] 1 SLR 1129 (“Simgood”) at [196]). 145 In its pleadings (see above at [49]), the plaintiff has relied on various grounds for lifting the corporate veil. However, in its written submissions, the plaintiff failed to cite the relevant case law for the different grounds and did not descend into detail as to how each ground was made out on the facts of this case. Instead, the plaintiff listed various factors to support its unitary proposition that the corporate veil should be lifted. In my analysis, the plaintiff has raised three distinct grounds in its pleadings: (a) HN Singapore was set up with the intention to commit fraud; (b) HN Singapore was a mere sham or façade; and (c) Mr Eng was the alter ego of HN Singapore. It bears noting that the ground of alter ego is distinct from the ground of façade or sham (Alwieat [96]). 146 The plaintiff relies on the following factors in support of these claims: (a) Mr Eng is the sole director and sole shareholder of HN Singapore; (b) HN Singapore has a nominal paid-up capital of S$1; (c) HN Singapore has no employees; (d) HN Singapore’s registered address is the address of a residential property owned by Mr Eng’s mother; (e) HN Singapore had no prior experience providing test kits and no track record in the subject matter of the Varied SPA; (f) the Varied SPA required the Purchase Price to be paid in full before delivery was made (which was an “unusual feature”); and (g) the Letter of Proposal included an “unusual feature” that HN Singapore would provide an insurance policy as a guarantee for the Varied SPA, which was never provided. Alter ego 147 I go first to the ground of “alter ego”. This ground was upheld by the Court of Appeal on the facts ofAlwie. Where the alter ego ground is relied on, the key question that must be asked is “whether the company is carrying on the business of its controller” (Alwieat [96]). 148 In this case, the plaintiff heavily relies on the fact that Mr Eng is the sole director, shareholder, and employee of HN Singapore. However, evidence of sole shareholding and control of a company, without more, would not move the court to intervene and lift the corporate veil (NEC Asia Pte Ltd (now known as NEC Asia Pacific Pte Ltd) v Picket & Rail Asia Pacific Pte Ltd and others[2011] 2 SLR 565 at [36];Tjong VerySumito and others v Chan Sing En and others[2012] SGHC 125 at [76]). As noted by the Honourable Judge of the High Court Judith Prakash J (as she then was) inSittTatt Bhd v Goh Tai Hock[2009] 2 SLR(R) 44 at [79], it is a general proposition of law that parties are entitled to protect themselves by creating companies even if these are effectively one-man companies. The rationale for this is clear – “one-man” companies would otherwise be unfairly prejudiced. As was succinctly stated inMohamedShiyam v Tuff Offshore Engineering Services Pte Ltd[2021] 5 SLR 188 at [71]: … In the case of “one-man” companies, the sole shareholder would almost always be the controlling mind and will of the company. Yet, it cannot be the case that every one-man company would have its corporate veil lifted as it would defeat the point of incorporation for many small, closely held companies. 149 However, this then begs the question – what more is required to lift the corporate veil? InAlwie, the Court of Appeal found several other factualindiciarelevant. First, the appellant in that case incorporated the company for the sole purpose of receiving payment under the relevant agreement. Second, the appellant operated the company’s bank account as if it was his own and admitted this. In particular, the appellant procured payments that were due to the company and directed that the payment of such dues be made to his personal account (Alwieat [97]–[100]). 150 Conversely, similarly probativeindiciaare not present in this case. Firstly, HN Singapore was not incorporated solely to trade with the plaintiff. HN Singapore was incorporated on 9 September 2016, approximately three and a half years before its one transaction with the plaintiff.122Foot Note 122×Defendant’s Reply Submissions dd 10 February 2023 at para 74.Mr Eng stated that HN Singapore had previously imported “bird’s nest and skincare products” and provided “business consulting in respect of expert sourcing”. The plaintiff did not challenge this statement.123Foot Note 123×Mr Eng’s AEIC dd 8 November 2022 at para 7.Secondly, there is no evidence that Mr Eng operated HN Singapore’s bank account as if it was his own or treated its dues as his own. Mr Eng did not deposit any of the Purchase Price into his personal bank account. Instead, Mr Eng gave evidence that on 7 April 2020, one day after the plaintiff made payment, HN Singapore transferred a sum of US$1,525,286 to one Mr Li Chong, for him to handle the payments to Wondfo, Nuodong and the intended shipping company.124Foot Note 124×Mr Eng’s AEIC dd 8 November 2022 at para 93.A sum totalling US$219,608.32 was also paid out of HN Singapore’s bank account for other charges in relation to the transaction (see above at [28]). 151 Further, in my judgment, the other factors raised by the plaintiff are not persuasive either. I agree with the defendants’ submission that the inclusion of the performance guarantee term in the Varied SPA was based on the plaintiff’s request for a performance guarantee and has no bearing on whether Mr Eng was the alter ego of HN Singapore. The same goes for the requirement that advance payment be made for the Varied SPA. It bears repeating that the threshold for veil piercing is a high one which was, in my view, not met. Sham or façade 152 Next, I go to the ground of “sham or façade”. In my earlier decision,Bhoomatidevid/o Kishinchand Chugani Mrs Kavita Gope Mirwani v Nantakumar s/o v Ramachandra and another[2023] SGHC 37 at [69]–[77], I traversed the case law where the “sham or façade” ground was argued as a basis to pierce the corporate veil. In short, a sham refers to acts done or executed by parties to the sham that were intended by them to give to third parties or to the court, an appearance of creating between the parties legal rights and obligations different from the actual rights and obligations which the parties intended to create (Singapore Tourism Board v Children’s Media Ltd and others[2008] 3 SLR(R) 981 at [99] affirmed inChildren’s Media Ltd and others v Singapore Tourism Board[2009] 1 SLR(R) 524 (“Children’s Media (CA decision)”). 153 In this case, the plaintiff failed to substantiate how HN Singapore was a sham or façade. In any event, I do not agree with the plaintiff’s submission. That HN Singapore had a nominal paid-up capital of S$1 was a fact in the public domain (seeWin Line (UK) Ltd vMasterpart (Singapore) Pte Ltd and another[1999] 2 SLR(R) 24 at [41]). The defendants also never deceived the plaintiff as to the corporate structure of HN Singapore,ie,the fact that Mr Eng was the sole director and shareholder of HN Singapore. The plaintiff made no objections to these facts during the purchasing process.125Foot Note 125×DCS dd 20 January 2023 at para 64.Further, the fact that HN Singapore had no prior experience providing test kits did not necessarily mean that the company was a sham. At the beginning of the Covid-19 pandemic, there was a spike in demand for critical supplies, such as surgical masks and test kits. This created business opportunities for manufacturers, middlemen and suppliers. Therefore, it is unsurprising for businessmen to have branched out into supplying test kits as a new revenue source. Fraud 154 The courts in Singapore appear to have established fraud as a ground for lifting the corporate veil (seeJhaveriDarsan Jitendra and others v Salgaocar Anil Vassudeva and others[2018] 5 SLR 689 (“Jhaveri”) at [79];Epoch Minerals Pte Ltd v Raffles Asset Management (S) Pte Ltd and others[2021] SGHC 288 at [20]). In my judgment, there is no evidence to support the plaintiff’s allegation that they were victims of a fraud perpetuated by the defendants. 155 InJhaveri, the Honourable Judge of the High Court Kannan Ramesh J (as he then was) stated that the corporate veil is usually pierced when the purpose of setting up the relevant companies was to perpetrate a fraud. However, there is nothing to suggest that Mr Eng set up HN Singapore to perpetrate a fraud – HN Singapore was set up four years before the transaction with the plaintiff, and as elaborated above, HN Singapore has made other transactions with other parties. 156 The plaintiff submits that the alleged “falsification” of the Wondfo Invoice,ie,the fact that the purchase price date, and other information were removed in the invoice sent to the plaintiffs, “adds to the nature of the fraud and sham perpetuated by the [d]efendants”.126Foot Note 126×PRS dd 10 February 2023 at para 75.To recapitulate, the plaintiff alleges that Mr Eng did this to mislead the plaintiffs regarding HN Singapore’s profit arising from the Varied SPA and to obscure that the invoice was only issued two days after the intended delivery date. Under cross-examination, Mr Eng denied editing the Wondfo Invoice before forwarding it to the plaintiff. He claimed that he “probably received it from [Mr Li Chong] like this”.127Foot Note 127×Transcript (2 December 2022) at p 37 lines 7–19, p 57 lines 18–20.Without more, I make no finding that Mr Eng was the one that removed the information from the Wondfo Invoice. In any event, even if Mr Eng had amended the Wondfo Invoice, I hesitate to describe these redactions as fraudulent. It is understandable that a middleman such as Mr Eng would not want to disclose the price HN Singapore paid for the Test Kits, and, therefore, the markup made on the Test Kits. The plaintiff has not shown that the redaction of the delivery date had any bearing on its actions either. I therefore hold that the plaintiff has not established that the corporate veil should be lifted on the ground of fraud. Evasion of obligations 157 As a final point, I note that the plaintiff has also pleaded that HN Singapore was set up with the intention of allowing Mr Eng to evade his legal obligations. In its closing submissions, the plaintiff submits that the Court of Appeal inChildren’s Media (CA decision)acknowledged that if a person were under an existing legal obligation which he deliberately evaded or the enforcement of which he deliberately frustrated by interposing a company under his control, a court could pierce the corporate veil for this purpose. The plaintiff argues that this can be explained under the “evasion principle”, espoused in the seminal decision ofPrestv Petrodel Resources Ltdand others[2013] 2 AC 415 (“Prest”). 158 InPrest, the UK Supreme Court appeared to approach the corporate veil piercing principle in a more unified manner. Lord Sumption, delivering the leading judgment, held that the “evasion principle” and “concealment principle” were the two bases for the piercing doctrine (at [28]): … The concealment principle is legally banal and does not involve piercing the corporate veil at all. It is that the interposition of a company or perhaps several companies so as to conceal the identity of the real actors will not deter the courts from identifying them, assuming that their identity is legally relevant. In these cases the court is not disregarding the “façade\", but only looking behind it to discover the facts which the corporate structure is concealing. The evasion principle is different. It is that the court may disregard the corporate veil if there is a legal right against the person in control of it which exists independently of the company’s involvement, and a company is interposed so that the separate legal personality of the company will defeat the right or frustrate its enforcement. … According to Lord Sumption, only the evasion principle amounts in the strict sense to the court piercing the corporate veil. 159 Even within the UK Supreme Court, not all members accepted Lord Sumption’s analysis without qualification (seeSimgoodat [201]). In Singapore, as I previously explained inCommodities Intelligence Centre Pte Ltd v Mako InternationalTrd Pte Ltd and others[2022] 5 SLR 837 at [142],Presthas yet to be considered by the Court of Appeal, much less accepted here. Thus, it is unclear whether the piercing doctrine in Singapore should be framed by the “evasion principle” espoused by Lord Sumption, or some other narrower, wider or alternative legal principle. In any event, it is not necessary for me to decide on the merits of Lord Sumption’s approach inPrest, which attempts to limit the doctrine of piercing to cases falling within the evasion principle, given that no arguments were canvassed before me on the authorities I have cited above. 160 Lastly, for the avoidance of doubt, the decision inChildren’s Media (CAdecision)was made on the basis of the “sham or façade ground” (at [4]): The crucial issue in this matter, for our assessment, was the intention of the third appellant when he entered into the Third Agreement (as well as the Side Letter) with the respondent.Was this a sham transaction procured by fraudulent misrepresentation(s) made by him?… [emphasis added] 161 For all the above reasons, I do not find that under Singapore law, HN Singapore’s corporate veil should be lifted to hold Mr Eng personally liable.",
        "Issue 5: Unlawful termination": "162 Having considered the merits of the plaintiff’s claims, I turn now to Mr Eng’s counterclaim. I find that Mr Eng has not established that the plaintiff’s termination of the Varied SPA on 27 May 2020 amounted to an unlawful repudiation. 163 Mr Eng’s case for unlawful termination is premised entirely on the plaintiff’s alleged waiver of the non-delivery of the Test Kits on 26 April 2020.128Foot Note 128×DCC dd 19 March 2021 at para 27.My finding that there was no waiver of the Test Kits consequentially means that there is no unlawful act on which this cause of action rests. Therefore, I dismiss Mr Eng’s counterclaim.",
        "Issue 6: Quantum of damages": "",
        "Quantum of damages under Argentine law": "164 To recapitulate, the plaintiff submits that under Argentine law, it is entitled to claim against Mr Eng and/or HN Singapore for:129Foot Note 129×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 para 26. (a) the Balance Purchase Price; (b) additional damages equivalent to 10% of the Purchase Price (ie,US$177,000), arising from the breach of contract; and (c) “the time of the delay in which the seller incurred in to reimburse the monies paid by the buyer for a purchase finally frustrated”. Compensation for the Balance Purchase Price 165 The plaintiff gave evidence that under Argentine law, the plaintiff is entitled to the price of the Varied SPA. According to the Expert Report, reimbursement of the Purchase Price is ordered within ss 1080 and 1081 of the Argentine Civil and Commercial Code, “applicable to administrative law in Argentina as unanimous[ly] ruled by the Federal Supreme Court”.130Foot Note 130×Dr Cassagne’s AEIC dd 8 November 2022 at EC-1 paras 26–27. 166 The defendants submit that the authority cited by Dr Cassagne to support the proposition that ss 1080 and 1081 of the Argentine Civil and Commercial Code applies to administrative law was not produced with an English translation, and therefore, pursuant to O 19 r 1 Rules of Court (2014 Rev Ed) (\"Rules of Court 2014”), it may not be used in court to support Dr Cassagne’s proposition. As such, Dr Cassagne has not supported his views with the necessary authorities.131Foot Note 131×DCS dd 20 January 2023 at paras 98–101. 167 In my view, on the balance of probabilities, the plaintiff is entitled to the Balance Purchase Price under Argentine law. This is notwithstanding the fact that the plaintiff did not provide an English translation to the authority footnoted to ss 1080 and 1081 of the Argentine Civil and Commercial Code. The authority, which is precluded from being used in court by O 19 r 1 of the Rules of Court 2014, was not material in my decision. In my view, ss 1080 and 1081 support the proposition that HN Singapore should return the Balance Purchase Price to the plaintiff, and the defendants have not shown any evidence to the contrary to show that the Argentine Civil and Commercial Code do not apply to the Varied SPA. Compensation for 10% additional damages 168 According to the Expert Report, breach of the Varied SPA entitles the plaintiff to claim 10% of the Purchase Price as damages arising from the breach of the Varied SPA. Dr Cassagne relied on ss 92.b and 122 of GCBA’s Law 2095 on Government Procurement for this proposition.132Foot Note 132×Dr Cassagne’s AEIC dd 8 November 2022 at of EC-1 paras 26 and 28–29. 169 Section 92.b and s 122, translated in English, state the following: Law 2,095 - Section 92 - CONSTITUTION OF GUARANTEES. To guarantee compliance with all obligations, bidders and successful bidders must constitute the following unlimited guarantees of validity: … b)Performance guarantee: ten percent (10%) of the total value of the contract awarded. … Law 2,095 – Section 122 - TERMINATION DUE TO THE FAULT OF THE CO-CONTRACTOR - BREACH OF THE CONTRACT. Upon expiration of the term of compliance with the contract, its extension or, where appropriate, the rehabilitated contract, without the goods have been delivered or provided the services in accordance,it will be terminated in full right with loss of the corresponding guarantees without the need for judicial or extrajudicial interpellation. The bidding agency must then proceed to issue the formal declaration of termination. [emphasis added] 170 Under cross-examination, Dr Cassagne explained that a guarantee was required under Argentine law. Section 92.b requires the supplier,ie,HN Singapore to acquire and give a performance guarantee amounting to 10% of the total value of the contract awarded on the execution of the contract.133Foot Note 133×Transcript (1 December 2022) at 83:3–8 and 84:15–22.Further, s 122 sets out that upon termination of the contract awarded, the supplier would lose the guarantees, and the state would be automatically entitled to the guarantees, without having to go to court.134Foot Note 134×Transcript (1 December 2022) at 84:23–25 and 84:1–3.According to Dr Cassagne, the effect of both provisions was that if HN Singapore had provided a performance guarantee, the plaintiff would have directly retained the sum amounting to 10% of the Purchase Price. However, because no guarantee was provided, the “plaintiff is forced to claim that penalty, [which is always 10%,] through judicial means”. The fact that there was no performance guarantee “[does not] mean that the sanction of the penalty cannot or will not be applied”.135Foot Note 135×Transcript (1 December 2022) at p 84 lines 1–11. 171 I was not convinced by Dr Cassagne’s evidence on this point. On the face of it, ss 92 and 122, read together, apply to the situation where the contract awardee has procured a performance guarantee –ie,where the supplier provides a guarantee, and the contract is subsequently terminated, the state is entitled to invoke the guarantee and retain a sum amounting to 10% of the value of the contract awarded, without having to prove its losses in court. In this case, it is undisputed that no performance guarantee was procured. However, the statutes are silent about what happens when the supplier fails to procure a performance guarantee. Nothing in the statutes suggests that the supplier should be penalised by a sum amounting to 10% of the total value awarded. 172 When cross-examined further on this point, Dr Cassagne added that s 119 of GCBA’s Law 2095 on Government Procurement also entitled the plaintiff to apply a penalty or sanction on HN Singapore. However, the plaintiff did not exhibit a translated copy of s 119. This again amounts to non-compliance with O 19 r 1 Rules of Court 2014, which requires every document not in the English language to be accompanied by a certified translation before it may be received, filed or used in the court. Therefore, I treat s 119 as not exhibited in court. 173 In the circumstances, I find that the plaintiff has not proven that it is entitled under Argentinian law to additional damages equivalent to 10% of the Purchase Price,ie,US$177,000. Compensation for the time delay 174 In the Expert Report, Dr Cassagne cites ss 92.b and 122 of GCBA’s Law 2075 on Government Procurement (see above at [169]) to support his proposition that the plaintiff is entitled to the costs of delay in reimbursing the Purchase Price. However, neither provision mentions the seller’s entitlement to such costs. Further, there is no evidence of any loss that the plaintiff has suffered arising from the delay in the reimbursement of the Purchase Price.136Foot Note 136×DCS dd 20 January 2023 at para 102.I dismiss this claim for damages, given that it is not based on sound grounds and not supported by the basic facts (Saeng-Un Udomat [26]).",
        "Quantum of damages under Singapore law": "175 In case I am wrong that Argentine law applies, I consider the measure of compensation under Singapore law. 176 Damages are generally intended to be compensatory in nature, which would put the injured party in the same position it would have been in had the wrong not been committed (Main-Line Corporate HoldingsLtdvUnited Overseas Bank Ltd and another[2017] 3 SLR 901 at [63]; James Edelman,McGregor on Damages(Sweet & Maxwell, 21st Ed, 2021) at 2-003, citingLivingstone vRawyards Co(1880) 5 App Cas 25 at 39). It is trite that a plaintiff bears the burden of proving its loss and, in order to do so, must provide cogent evidence of the damages claimed (Turf Club Auto Emporium Pte Ltd and others v YeoBoong Hua and others and another appeal[2019] 1 SLR 214 at [16]). 177 Apart from the Balance Purchase Price, the plaintiff has not proven any other loss arising from the breach of the Varied SPA. Therefore, I find that the plaintiff should be awarded damages amounting to the sum of the Balance Purchase Price,ie,US$237,619.35.",
        "Conclusion": "178 In the circumstances, I find that the plaintiff succeeds in its claim against the first defendant for breach of contract and the first defendant is liable for damages of US$237,619.35. I dismiss its claim in misrepresentation, as well as HN Singapore’s counterclaim in unlawful termination. Having found that the Varied SPA is governed by Argentine law, I order that HN Singapore’s corporate veil be lifted, such that Mr Eng is also liable for the Balance Purchase Price of US$237,619.35 to the plaintiff. I also order the defendants to pay interest on the judgment sum at the rate of 5.33% from the date of the writ until date of payment. 179 Unless there is any reason for a different order for which the parties have liberty to apply, I order the first and second defendants to pay costs to the plaintiff on the standard scale. Lee Seiu KinJudge of the High Court Sean Francois La’Brooy, Luis Inaki Duhart Gonzalez and Faustina Joyce Fernando (Selvam LLC) for the plaintiff; Loo Choon Chiaw, Goh Shu Quan Leon, Chia Foon Yeow, and Lim Jun Wei (Loo & Partners LLP) for the first and second defendant."
    }
}