{
    "case_title": "Carlos Manuel De São VicentevPublic Prosecutor",
    "ncitation": "[2023] SGHC 143",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 The Applicant is, or at least was, a man of considerable means. At the peak of his wealth, he had amassed a fortune of more than a billion US dollars. He was the majority shareholder of the leading co-insurance firm in the oil industry of Angola, the second largest oil producer in Africa.1Foot Note 1×First Affidavit of Irene Alexandra Da Silva Neto filed on 28 September 2022 (“IADSN 1”) at para 7.He was the largest Angolan investor in the country.2Foot Note 2×IADSN 1 at para 9.He owned and controlled multiple companies incorporated in Angola, the United Kingdom, Bermuda, and Portugal. He opened bank accounts across the world, including Singapore and Switzerland. Then, he was arrested. His funds in Switzerland were frozen. He was convicted of tax offences and money laundering by the Angolan courts. His assets in Angola were confiscated, along with those of his family.3Foot Note 3×IADSN 1 at p 621.The Applicant describes this as a politically motivated prosecution. He claims that his family is being targeted because of his wife’s outspoken criticism of alleged corruption in Angola.4Foot Note 4×IADSN 1 at para 21–22.The Angolan courts, however, had made findings of fact concerning the Applicant’s transfers of hundreds of millions of US dollars from companies under his control into his personal bank account.5Foot Note 5×IADSN 1 at p 589.They found that he had unlawfully amassed profit from monopolies over the Angolan oil insurance sector,6Foot Note 6×IADSN 1 at p 588.and had embezzled more than 1.2 billion US dollars from the country.7Foot Note 7×IADSN 1 at p 586.The Applicant has filed an appeal, which is now pending, in the apex court in Angola. 2 The truth behind these transactions is not the subject of these proceedings. What is accepted as true by all parties, however, is that some of the money transferred into the Applicant’s personal bank account in Angola found its way to the Applicant’s Bank of Singapore account (“his BOS account”). On 19 February 2021, the Commercial Affairs Department (“CAD”) seized that account, which contained more than USD$558 million.8Foot Note 8×Affidavit of Lye Jia He (Part 1 of 2) filed on 9 December 2022 (“LJH”) at para 3.The Applicant now seeks the release, under s 35(8)(b)(i) of the Criminal Procedure Code 2010 (“CPC”), of S$2,635,865.55 from his BOS account (the “Seized Funds”). He contends that he presently lacks the funds to pay for his legal expenses in Singapore, Switzerland, and Angola, as well as to pay for representations to various international organisations. He thus seeks the release of the Seized Funds as that is the only way that he claims he will have access to justice.9Foot Note 9×Applicant’s Submissions dated 20 January 2023 (“AS”) at para 3. 3 Having heard and considered both parties’ submissions, I dismiss the application. I set out below the reasons for my decision.  Background facts 4 The Applicant, Carlos Manuel De São Vicente, was employed by Sonangol E.P. (“Sonangol”), an Angolan state-owned oil enterprise, during the early 2000s.10Foot Note 10×IADSN 1 at para 6.During this time, Sonangol incorporated the company AAA Seguros SA (“AAA Seguros”) to implement an insurance risk management strategy in the oil sector and was granted a leading position in handling insurance for the oil industry nationwide in Angola in 2001. This risk management strategy was implemented through not just AAA Seguros, but also through several reinsurance companies controlled by the Applicant. These include AAA Reinsurance Ltd and AAA Risk Solutions Ltd, both based in Bermuda, and AAA Insurance & Reinsurance Broker Ltd, based in the United Kingdom.11Foot Note 11×IADSN 1 at para 6.The Applicant also managed to acquire a majority stake in AAA Seguros.12Foot Note 12×IADSN 1 at para 7.Over time, he acquired, in the words of his wife, Irene Alexandra Da Silva Neto (“Irene”), a “considerable fortune”.13Foot Note 13×IADSN 1 at para 7.",
        "Proceedings in Angola": "5 On 22 September 2020, the Angolan Public Prosecutor (“the Angolan PP”) placed the Applicant in preventative custody in Luanda, Angola and charged him with offences of embezzlement, money laundering, and tax fraud.14Foot Note 14×AS at para 10; IADSN 1 at paras 48 and 51.He was convicted on all charges by the District Court of Luanda on 24 March 2022 and sentenced to nine years’ imprisonment and a fine.15Foot Note 15×IADSN 1 at p 621.In addition, the Applicant was ordered to pay relevant judicial fees and USD$4.5 billion in compensation for damages to the Angolan state.16Foot Note 16×IADSN 1 at p 621.The District Court of Luanda also found that the Applicant had embezzled and accumulated unexplained wealth estimated at USD$3.6 billion belonging to him, his family, and his companies, and ordered that the funds in their respective bank accounts be handed over to the Ministry of Finance in Angola.17Foot Note 17×IADSN 1 at p 618In reaching this conclusion, the District Court of Luanda made,inter alia, the following findings: (a)  The Applicant controlled and was the sole signatory of multiple companies, including AAA Insurance & Reinsurance Brokers Ltd, AAA Servicos Financeiros, and AAA Investors Ltd.18Foot Note 18×IADSN 1 at pp 584–590. (b) The bank accounts of the following companies, held by the Applicant, were to be forfeited: AAA Seguros Sa, AAA Activos Lda, AAA Insurance & Reinsurance Ltd, AAA Insurance & Reinsurance Brokers Limited, AAA International Limited (“AAA International”), Global One Ltd, Global Net Training Solutions, African Reinsurance Corporate, Empresa Ofanda, Okiru Unipessoal Lda, Okuso Unipessoal Lda, Bear Stearns Securities Corp, Companhia Portuguesa De Resseguros, Munica Mauritius Reinsurance, Swiss Reinsurance Company Li, Reinsurance Solutions Brokers and Swiss Re Africa Limited.19Foot Note 19×Second Affidavit of Irene Alexandra Da Silva Neto filed on 11 November 2022 (“IADSN 2”) at p 441. 6 The Applicant was unsuccessful in his appeal before the Court of Appeal of Luanda against this decision.20Foot Note 20×IADSN 1 at para 55.The findings of the District Court of Luanda were also undisturbed.21Foot Note 21×IADSN 2 at p 572.A further appeal to the Supreme Court of Angola is pending. It is the Applicant’s position that such proceedings in Angola are a show trial targeting him, his wife, and their family of three children.22Foot Note 22×AS at para 11.",
        "Proceedings in Switzerland": "7 In September 2018, the Applicant ordered the transfer of USD$400 million from the accounts of AAA Seguros to his personal bank account with Banque Syz SA (“Banque Syz”).23Foot Note 23×IADSN 1 at pp 589–590.At that time, the Applicant’s sole signature was sufficient to authorise the transfer.24Foot Note 24×IADSN 1 at pp 776–777.Banque Syz subsequently addressed a communication to the Money Laundering Reporting Office of Switzerland over suspicions of money laundering in relation to tax offences under the Swiss Penal Code. On 4 and 7 December 2018, the Geneva Public Prosecutor’s Office (“the Geneva PPO”) issued freezing orders on the accounts of the Applicant and AAA International held with Banque Syz.25Foot Note 25×IADSN 1 at para 24 and 27.Freezing orders were also initially issued to accounts held by the Applicant’s family and AAA Reinsurance Ltd with Banque Syz but were subsequently lifted following representations from the Applicant. 8 On 18 April 2019, the freezing order over the Applicant’s personal bank account was also lifted on any amount in excess of USD$855,396,087.28 and €38,493,386.14.26Foot Note 26×IADSN 1 at para 24 and 27; IADSN 1 at pp 694–695.This allowed the Applicant to transfer USD$219,528,652.55 and €18,005,762.19 from his Banque Syz account to his BOS account. Further transfers into the Applicant’s BOS account were also made from the BOS account of AAA International from 28 November 2018 onwards (see [15] below). These transferred funds are part of the subject of the present Motion. 9 The Applicant continued to file multiple appeals in the Geneva Court of Appeal and Swiss Federal Tribunal against the freezing order pertaining to the remaining amount in his Banque Syz account and the freezing orders over AAA International. At the time of this hearing, the Applicant’s appeal is pending the decision of the Swiss Federal Tribunal.27Foot Note 27×IADSN 1 at para 34.In those proceedings, he was represented by Schellenberg Wittmer Ltd, while AAA International Ltd was represented by Reiser Avocats.28Foot Note 28×IADSN 1 at para 36. 10 In addition to proceedings over the freezing orders, the Applicant has also been engaged in legal proceedings in Switzerland related to mutual legal assistance proceedings between Switzerland and Angola, in which he was similarly represented by Schellenberg Wittmer Ltd. Multiple requests for information were exchanged between the respective government prosecutors in both countries between March and June 2020, concerning the assets of the Applicant, his family, and the companies AAA International, AAA Activos LDA and AAA Seguros. The Angolan Public Prosecutor sought for these assets to be blocked.29Foot Note 29×IADSN 1 at para 39.The final decision by the Geneva PPO on 14 October 2021, after considering parties’ submissions, granted the mutual legal assistance sought by Angolan authorities.30Foot Note 30×IADSN 1 at para 42.The Applicant and the three aforementioned companies filed appeals against the decision of the Geneva PPO, which were dismissed by the Swiss Federal Criminal Tribunal on 23 May 2022. The Applicant filed a further appeal to the Swiss Federal Tribunal against the dismissal of the appeal, which is pending as of the time of this hearing.31Foot Note 31×IADSN 1 at para 43. 11 The Applicant had also filed an application to the Geneva Court of Justice to request that the Geneva PPO transmit several questions regarding inconsistencies between Angolan criminal proceedings and a report issued by the Angolan PP on 7 August 2020. This application was dismissed on 10 August 2021.32Foot Note 32×IADSN 1 at para 44.",
        "Representations to international organisations": "12 In relation to his incarceration in Angola, the Applicant, through his counsel, filed a Communication and an Urgent Appeal for release on medical grounds with the United Nations Working Group on Arbitrary Detention.33Foot Note 33×IADSN 1 at para 58He also filed a Communication with the African Commission on Human and Peoples’ Rights.34Foot Note 34×IADSN 1 at para 60.He was represented in both matters by François Zimeray and Jessica Finelle of Zimeray Finelle Avocats (France).",
        "Proceedings in Bermuda and Portugal": "13 In addition to the court proceedings in Angola, Switzerland, and Singapore, the Applicant also faces legal proceedings involving himself and his companies in Bermuda and Portugal. The Applicant had originally sought to claim for legal expenses for these proceedings but has since amended his application otherwise for reasons I will explain below at [24]. In Bermuda, the authorities acted on a mutual legal assistance request from Angola and imposed a freezing order on the bank accounts of AAA International and AAA Risk Solutions.35Foot Note 35×IADSN 1 at para 53.In March 2022, AAA International was able to obtain a variation of the Bermudan freezing order for release of the sum of USD$20,000.00 to pay for the company’s legal costs. 14 The Applicant also has an undisclosed number of companies that he owns or is involved with in Portugal. The Applicant is facing mutual legal assistance proceedings between Portugal and Angola in relation to both himself and these companies, along with other civil, labour, taxation, and insolvency proceedings.36Foot Note 36×IADSN 1 at p 24.The Applicant maintains that both his personal bank account and the bank accounts of all his Portuguese companies have been frozen.37Foot Note 37×IADSN 1 at p 25.Applications to unfreeze them are pending.",
        "Proceedings in Singapore": "15 Following investigations, the CAD found that 18 separate transfers of funds from the BOS bank account of AAA International were made into the Applicant’s BOS bank account from 28 November 2018 to 26 September 2019.38Foot Note 38×LJH at para 36.The value of these transfers total €12,500,000.00 and USD$103,334,155.70, and are in addition to the money transferred from the Applicant’s Banque Syz account. According to the CAD, no reasonable explanation has been given by the Applicant as to why funds held by AAA International were transferred to his personal bank account.39Foot Note 39×LJH at para 37.There has likewise been no explanation given to the court in the current set of proceedings, beyond the assertion that the source of these funds is irrelevant to the present application.40Foot Note 40×Third Affidavit of Irene Alexandra Da Silva Neto filed on 9 January 2023 (“IADSN 3”) at para 19. 16 On 19 February 2021, the following properties connected with the Applicant and his family were seized by the CAD:41Foot Note 41×LJH at para 3. S/NAccount HolderBank NameAccount Balance as of 2 November 20221Carlos Manuel De São VicenteBank of Singapore LimitedUSD$558,389,833.742Irene Alexandra Da Silva NetoBank of Singapore LimitedUSD$5,174,168.233Ivo Emanuel Neto De São Vicente (“Ivo”)Bank of Singapore LimitedUSD$10,501,233.09 17 On 3 March 2021, the Applicant was informed in writing of the above seizures.42Foot Note 42×AS at para 5. 18 Before the seizure of the BOS accounts, the Applicant had made several transfers out of his BOS account. On 30 November 2018, a total of €750,000 was transferred to Portuguese bank accounts belonging to his sons Ivo and Antonino Neto De São Vicente (“Antonino”), his daughter Felicia Neto De São Vicente (“Felicia”), and his wife Irene. On 12 December 2018, a further €4,500,000.00 was transferred to Ivo’s Portuguese bank account. Finally, between July and August 2020, a further €925,174.00 was transferred in total to the Portuguese bank accounts of Ivo, Antonino, Felicia, and Irene.43Foot Note 43×LJH at para 33; LJH-15; LJH-16; LJH-17; LJH-18. 19 On 21 January 2022, the CAD posed several questions to the Applicant through his Singapore law firm, TSMP Law Corporation (“TSMP”). The CAD asserts that the written replies provided on 28 February 2022 were brief and provided very little useful information. For example, when asked about the source of the funds for his bank accounts in Singapore, the response given by the Applicant was merely that they were from “investment”.44Foot Note 44×LJH at para 20.Further questions were posed by the CAD on 10 May 2022, and a further reply was given on 2 June 2022. However, no estimate of the Applicant’s salaried income was provided, nor were there any supporting documents furnished by the Applicant in relation to his investments or the source of the funds in the Singapore bank accounts.45Foot Note 45×LJH at para 21; LJH-6; LJH-7. 20 On 13 July 2021, the CAD was informed by TSMP, acting for Irene and Ivo, that both were willing to extend their full cooperation, although they were unwilling to travel to Singapore.46Foot Note 46×LJH-8.On 23 August 2021, the CAD wrote to Irene and Ivo, through TSMP, proposing an interview with both of them via remote communication technology.47Foot Note 47×LJH-9.This letter went unanswered, and a reminder letter was sent by the CAD on 21 January 2022, but no response was received either.48Foot Note 48×LJH-10.It was only on 30 December 2022, some ten months after the reminder letter, that a reply to the CAD through Irene and Ivo’s Singapore counsel TSMP was finally sent.49Foot Note 49×IADSN 3 at para 12; IADSN-21.",
        "The present proceedings": "21 On 18 February 2022, the CAD filed a report in respect of the frozen BOS accounts as required under s 370 of the CPC. On 26 July 2022 the Magistrate’s Court ordered that the funds in the BOS accounts that were seized by the CAD were to be retained for a further six months until 26 January 2023.50Foot Note 50×LJH at para 24. 22 On 28 September 2022, the Applicant applied under s 35(8)(b)(i) of the CPC for the release of USD$4,900,591.27 from his BOS account that had been frozen by the CAD. 23 In the Notice of Motion, the Applicant stated that the release of these funds was necessary for the payment and/or reimbursement of reasonable professional fees and expenses incurred in connection with the provision of legal services to the Applicant and his companies AAA International, AAA Seguros SA, and AAA Activos Lda (“AAA Activos”), for proceedings in Singapore, Switzerland, Angola, Portugal, and Bermuda, and for legal representations made to various international bodies. This also included the cost of the Applicant’s legal representation in investor-state arbitration proceedings against the state of Angola.51Foot Note 51×IADSN 1 at pp 25–26. 24 The Applicant has since amended his application and has revised the amount of funds sought from USD$4,900,591.27 to S$2,635,865.55. He now states that he will not be seeking the release of funds for legal fees in respect of his companies.52Foot Note 52×AS at para 2.The basis of his application for the release of funds has been revised to only be for expenses for personal legal services rendered toward the Applicant. 25 The legal fees for which Applicant now seeks the release of funds involve expenses for legal representation across multiple jurisdictions, namely, Singapore, Switzerland, and Angola, as well as for making legal representations to international organisations. I summarise the legal proceedings and fees underlying the Applicant’s claims in the present application:53Foot Note 53×AS at para 61. (a) S$219,482.67 to the firm TSMP in respect of mutual legal assistance proceedings in Singapore from 4 October 2021 to 7 November 2022; (b) USD$778,857.10 to the firm FBL Advogados in respect of criminal proceedings against the Applicant in Angola from 1 January 2021 to 30 September 2022; (c) €189,941.44 to Mr Fernando Fario de Bastos of the firm FBL Advaogados in respect of criminal proceedings against the Applicant in Angola from October 2021 to September 2022; (d) €638,522.86 to the firm Queiroz e Marinho in respect of criminal proceedings against the Applicant in Angola from November 2021 to October 2022; (e) CHF$59.062.40 to Schellenberg Wittmer in respect of proceedings in Switzerland related to the freezing of the Applicant’s bank accounts and mutual legal assistance proceedings; (f) CHF$7041.65 to Reiser Avocats in respect of proceedings in Switzerland related to the freezing of the Applicant’s bank accounts and mutual legal assistance proceedings; and (g) €48,600.00 to Zimeray Finelle Avocats in respect of representations made to the United Nations Working Group on Arbitrary Detention and the African Commission on Human People’s Rights.",
        "The applicable law": "26 Section 35(7) of the CPC provides: (7)  A court may — (a) subsequent to an order of a police officer made under subsection (2); and (b) on the application of any person who is prevented from dealing with property, order the release of the property or any part of the property. 27 Section 35(8)(b) of the CPC provides: (8)  The court may only order a release of property under subsection (7) if it is satisfied that — … (b) such release is necessary exclusively for — (i) the payment of reasonable professional fees and the reimbursement of any expenses incurred in connection with the provision of legal services; or (ii) the payment of fees or service charges imposed for the routine holding or maintenance of the property which the person is prevented from dealing in; 28 The law on statutory interpretation is set out inTan Cheng Bock v Attorney-General[2017] 2 SLR 850 (“Tan Cheng Bock”), which outlines a three-step approach. First, the court will ascertain the possible interpretations of the provision, having regard to the text and context of the provision. Second, the court will ascertain the legislative purpose or object of the statute and the provision in question. Third, the court will compare the possible interpretations of the text against the purposes or objects of the statute and choose the interpretation that best advances the statutory object or purpose. The court may in specified circumstances also refer to extraneous materials which do not form part of the written law in which the provision is found, in order to ascertain the meaning of the provision, but primacy is accorded to the text and context of the provision. Where the ordinary meaning of the provision is clear, extraneous material can only be used to confirm the ordinary meaning but not to alter it (Tan Cheng Bockat [54]). 29 I begin by considering the plain wording of s 35(8)(b)(i) of the CPC. From the text, I distil that for a release of property to be ordered by the court under this provision, several conditions must be met. First, there is a requirement of necessity. The release of funds must be necessary for the payment of professional fees or reimbursement of expenses incurred in connection with the provision of legal services. Second, there is a requirement of exclusivity. The released funds must be used exclusively for such fees or reimbursement of expenses. Third, there is a requirement of reasonableness. Where payment for professional fees is sought, such fees must be reasonable. Fourth, there is a requirement that reimbursement of expenses be retrospective rather than prospective. Such expenses must already have been “incurred”. Fifth, the above requirements must be cumulatively shown to the satisfaction of the court as a precondition to the release of property under s 35(7) of the CPC. 30 I pause briefly to note that there is some degree of apparent textual ambiguity as to whether the clauses of “payment of reasonable professional fees” and “reimbursement of any expenses incurred” are to be read disjunctively or conjunctively in relation to the modifier “in connection with the provision of legal services”. That is, it is unclear as to whether only incurred expenses have to be connected with the provision of legal services, or whether both professional fees and expenses have to be so connected. In my view, both clauses should be read as subject to that modifier. Were the modifier not to apply to the first clause, the scope of “professional fees” would be overly ambiguous, since the adjective “professional” can apply to a wide range of different services and skills. This is at odds with the specific nature of the other subsections under s 35(8) of the CPC, which relate to well-delimited areas of expenses such as payment for foodstuff, rent, the discharge of a mortgage, or fees imposed for the routine holding or maintenance of property which the Applicant is prevented from dealing in. It also would be anomalous for reimbursement of expenses to be limited to legal services, but for professional fees to not be subject to such a limitation. Further, as I outline at [42] below, such a reading better accords with the legislative history of the provision. 31 I now consider the legislative intent of the statute. The remarks of the Minister for Law in Parliament during the Second Reading of the Criminal Procedure Code Bill (No. 11 of 2010) are instructive (Singapore Parliamentary Debates, Official Report(18 May 2010), vol 87 at col 412): If property liable to be seized is held with a financial institution, a Police officer of Inspector rank or above may issue a written order to direct the financial institution to either deliver the property to any Police officer, or refrain from dealing in respect of such property within a specified period. At the same time, an absolute power to freeze property in a bank account may be unduly harsh on the affected person. Hence, a person whose bank account has been the subject of a written order may apply to court for the release of such property to meet legitimate expenses. For example, the payment of basic expenses, reasonable professional fees or, in the context of a company, day-to-day running expenses. 32 The legislative purpose of s 35(8) of the CPC, which includes 35(8)(b)(i), is to regulate what would otherwise be an absolute power of the police to freeze bank accounts, and guard against “unduly harsh” consequences for persons affected by police seizure of property. The concern, in contrast to s 370 of the CPC, is not about legal entitlement to the seized property, but merely whether the Applicant can satisfy one of the criteria under s 35(8): seeMustafa Ahunbay v Public Prosecutor[2013] 4 SLR 1049 at [14] (“Mustafa Ahunbay”). 33 Importantly, the above remarks contextualise the criteria under s 35(8)(a)–(e) of the CPC as bearing the common denominator of being “legitimate” expenses. The meaning of “legitimate” expenses is best understood by reference to the qualifiers chosen by the Minister to preface examples of expenses, which include “basic”, “reasonable”, and “day-to-day”. These terms are directly drawn from the wording of the statute, and they point towards the nature of the expenses as being ordinarily recognised as capable of causing hardship should the payee be unable to obtain funds to make payment for them. A consideration of the broader provision of s 35(8) of the CPC reinforces this conclusion. Apart from s 35(8)(c), which covers extraordinary expenses, each of the subsections outlines a category of expenses for which non-payment will result in hardship—whether in the form of an adverse impact on a basic standard of living (s 35(8)(a)), an inability to satisfy a judicial, administrative or arbitral lien or judgment (s 35(8)(c)), or the cessation of a company’s operations (s 35(8)(e)). 34 Having found that the legislative purpose of s 35(8) of the CPC is to prevent undue hardship from arising from police seizure of property, I briefly comment on the overall nature of the assessment under s 35(8) before elaborating on the five requirements of s 35(8)(b)(i) outlined above at [29]. 35 As suggested in the Minister’s remarks above, the release of seized property under s 35(8) is subject to a balancing exercise between the competing concerns of ensuring the efficacy of police investigations, and prejudice to those potentially affected by police seizures. As set out inMustafa Ahunbayat [13]–[14]: 13 It will be readily apparent that both sections have different concerns and procedures. Section 35 of the CPC, which governs the powers of seizure, is more comprehensive and takes into account the needs of those who may be affected by the seizure. A balancing exercise is permitted under ss 35(7)(b) and 35(8) which is not part of the judicial exercise which subsequently takes place in s 370. … 14 The balancing exercise which the Magistrate’s Court may perform pursuant to ss 35(7)(b) and 35(8) is between the exigencies of the investigation or proceedings and the potential hardship to “any person who is prevented from dealing with the property”. This is a broad class of persons which could conceivably include the possessor of the seized property at the time of seizure, or any person with a contingent claim to that property … This person could bring an application to ask for the property seized (or part thereof) to be released, so long as he can satisfy one of the criteria of necessity in s 35(8) of the CPC. There is no need to prove that the Applicant under s 35(7)(b) is legally entitled to the seized property (or to any part of it); that is not the test under s 35(8). 36 This was further elaborated on inVivosant Corp SA v Public Prosecutor(HC/CM 37/2017) (“Vivosant”) at [13]: 13 … The overall enquiry necessitates the balancing exercise of looking into whether an order for release of funds is necessary in the interests of justice – adopting the test inMustafa Ahunbay v PP(at [14]), having regard to the exigencies of the investigation or proceedings, would denying the Applicant access to the funds sought cause undue hardship and injustice? 37 I agree with the remarks as framed inVivosant, whichalign with the general common law principle that the police’s entitlement to retain lawfully seized evidence for as long as is reasonably necessary is subject to regard for the interests of justice (Goldring Timothy Nicholas and others v Public Prosecutor[2013] 3 SLR 487 at [27], citing Keith Tronc, Cliff Crawford and Doug Smith, Search and Seizure in Australia and New Zealand (LBC Information Services, 1996) at p 21). 38 I now consider the requirements that are apparent from the wording of s 35(8)(b)(i). I first consider the requirement of necessity. An applicant under s 35(8) must show that no funds within their possession are otherwise available. Were this not the case, release of seized property would not be necessary. This raises the question as to whether the applicant has any alternative sources of funding, as noted in the unreported case ofOCAP Management Pte. Ltd.v Public Prosecutor(CM 41/2020) (“OCAP”) at [9]. There, the applicant had alleged that it had no sources of funds in seeking the partial release of seized funds to make payments to the Inland Revenue Authority of Singapore and for legal fees. The court dismissed the application. It held,inter alia, that despite the applicant’s assertions to the contrary there was evidence of significant incoming funds on a monthly and quarterly basis from external entities, which would provide a resource for addressing many of the applicant’s alleged expenses:OCAPat [9]. This illustrates the need for the court to be alive to the possibility that alternative sources of funds are available to an applicant, despite apparent assertions to the contrary. The exact level of scrutiny that is appropriate for each case may differ, having regard to the whether there is evidence of the means of the applicant and their circumstances. 39 I next consider the requirement of exclusivity. The basic meaning of this requirement, as the text of the provision provides, is that the release of funds should be used only for the payment of the fees and expenses under s 35(8)(b)(i) or (ii). However, in addition to this basic meaning, the interpretation of exclusivity should be guided by the legislative intention of safeguarding the affected person whose property has been frozen. Accordingly, it follows that any funds released should be used exclusively for legal fees and expensesofthe Applicant. For example, inVivosant, See Kee Oon J declined to release funds from the applicant’s seized bank account to pay for legal expenses incurred for matters that pertained to his company Tacla. He held that the applicant and Tacla were separate legal entities, and that there was no reason why the applicant had to be liable for such payments:Vivosantat [5]. 40 This reading of the requirement of exclusivity is bolstered by a consideration of the legislative history of s 35(8). Subsection 8 was adapted from Order 89A rule 6 of the Rules of Court (Cap 322, 2006 Rev Ed) (“rule 6”) which dealt with matters pertaining to seizures under the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act (Cap 65A, 2000 Rev Ed) (“CDSA”) (seeThe Criminal Procedure Code of Singapore: Annotations and Commentary(Jennifer Marie & Mohamed Faizal Mohamed Abdul Kadir gen eds) (Academy Publishing, 2012) at para 04.163). I reproduce the relevant portion of rule 6 below: Restraint orders and charging orders (O. 89A, r. 6) 6.—(1) A restraint order may be made subject to conditions and exceptions, including — (a) conditions relating to the indemnifying of third parties against expenses incurred in complying with the order; and (b) exceptions relating to living expenses and legal expenses of the defendant, but the Public Prosecutor shall not be required to give an undertaking to abide by any order as to damages sustained by the defendant as a result of the restraint order. [emphasis added] 41 As seen above, for an exception to be made to a restraint order under the CDSA, rule 6(b) required that the legal expenses must be relating to the defendant (that is, the subject of the restraint order). Although the present wording of s 35(8) does not bear such a restriction, I do not see good reasons why a similar understanding of the limitation of the use of such funds in rule 6 should not also apply to any application under that s 35(8). The expenses of a separate legal entity from the Applicant should not ordinarily necessitate the release of funds under s 35(8), particularly where the Applicant is not personally liable for those expenses. This is true even if it may be in the Applicant’s interests that such expenses are paid:Vivosantat [5]. 42 I also note that the wording of rule 6 also supports the interpretation of s 35(8)(b)(i) as being, as a whole, concerned with legal expenses, rather than with a broad range of professional fees. This supports the analysis at [30] above that both the professional fees and expenses mentioned in the subsection should be in connection with the provision of legal services. 43 I next consider the requirement of reasonableness. I start by noting that although this requirement seems to only apply to professional fees based on the wording of s 35(8)(b)(i), there is no reason why this requirement should not also apply to expenses incurred in connection with the provision of legal services. Invoices for expenses incurred in the course of a lawyer’s work are no less amenable to scrutiny than invoices for that lawyer’s professional fees. Such expenses, disbursements, and charges would also normally be considered together with professional fees and remuneration as part of the costs for which a legal practitioner would charge (see for example s 2 of the Legal Profession Act 1966 (2020 Rev Ed) and r 17(7) of the Legal Profession (Professional Conduct) Rules 2015). 44 Two further points on the reasonableness of fees and expenses claimed under s 35(8)(b)(i) should be made. First, given that the court must be satisfied of the reasonableness of the fees, the onus should be on an applicant seeking the release of funds under this provision to adduce sufficient information for the court to undertake an assessment of the reasonableness of the amount claimed. Second, in assessing reasonableness, the court should consider whether the amount claimed is traceable and proportionate to the reason for incurring such expenses. The release of funds under s 35(8)(b)(i) is thus not, as the Applicant claims, an “unfettered right” to, for example, “engage as many lawyers as [the Applicant] requires”, but a decision subject to considerations of the nature and complexity of the proceedings at hand.54Foot Note 54×IADSN 1 at para 74. 45 I now consider the fourth requirement that reimbursement must be of expenses already incurred. Again, there is linguistic ambiguity from the syntax of the statute. It is not clear whether the word “incurred” refers only to expenses, or to both professional fees and expenses. I am of the view that the word should apply to both. For one, there is no immediately appreciable distinction between legal professional fees and expenses incurred in connection with legal services which would suggest that the former should be able to be claimed prospectively while the latter should be restricted to claims for work already done. I also echo the reasoning of See J inVivosantat [7] that effective supervision of the requirement of reasonableness necessitates restricting the release of funds for both professional fees and expenses to those which have been already incurred: 7  Turning to the remaining categories (c) and (e), there may be grounds in principle for the Applicant to rely on s 35(8)(b)(i) if there is indeed a demonstrated need for funds to pay for “reasonable professional fees” or “expenses incurred in connection with the provision of legal services” to the Applicant. The construction of s 35(8)(b)(i) proposed by the respondent relies on the word “incurred” as being operative both for “professional fees” and “expenses”. Adopting the alternative interpretation proposed by the Applicant, s 35(8)(b)(i) can be read more widely to extend beyond work already done and billed, to encompass contingent billings and, by extension, even expenses for work envisaged in the future. With respect, this would entail considerable speculation as to how much might prospectively be billed, and also require a readiness to accept that it will be a “reasonable” expense even when the work remains to be done and the expense has yet to be incurred. Even if counsel were to furnish an undertaking that any funds released must be ring-fenced specifically for payment of reasonable professional fees or expenses, this does not adequately resolve the question of whether the expenses will be objectively reasonable in the first place. Such an approach is fraught with uncertainty and plainly unworkable in practice. This strongly indicates that the Applicant’s interpretation does not accord with statutory intent. I am therefore of the view that the court should concern itself only with fees or expenses in respect of liability for work that has already been done (and either billed or billable). 46 Finally, I reiterate that the above requirements must be cumulatively shown to the satisfaction of the court as a precondition to the release of property under s 35(7) of the CPC. The burden is on the Applicant to adduce sufficient evidence in this regard.",
        "The Singapore proceedings": "47 The expenses claimed in respect of the Singapore proceedings involve TSMP’s representation of the Applicant in liaising with the CAD and Attorney-General’s Chambers, appearing at a hearing to oppose the continued seizure of the funds in the Applicant’s BOS account under s 370 of the CPC, drafting documents for the same, and corresponding with other institutions and law firms.55Foot Note 55×IADSN 2 at pp 192–222.",
        "Necessity": "48 I agree that it is important for the Applicant to have the ability to pay for his legal representation in respect of the proceedings in Singapore. The relevant question is whether he in fact has the funds to do so. If he does, release of the Seized Funds would not be necessary. The Applicant asserts that he has no access to alternative sources of funds besides the funds frozen in Singapore.56Foot Note 56×AS at para 22; IADSN at para 23.The veracity of this assertion must be assessed in the light of the overwhelming evidence that the Applicant controlled and had access to a vast amount of wealth (of more than a billion USD) prior to the proceedings in Angola and Switzerland from 2018 onwards. Given these exceptional circumstances a greater degree of scrutiny of this assertion is apropos. 49 I am satisfied that there are several sources of funds that the Applicant is not capable of drawing from for the purposes of paying legal expenses for the Singapore proceedings. The property and assets of the Applicant in Angola have been seized by the Angolan authorities.57Foot Note 57×AS at para 24; IADSN 2 at para 31.The balance of funds in his Banque Syz account in Switzerland are still subject to a freezing order of the Geneva PPO.58Foot Note 58×AS at para 29; IADSN 2 at para 27.The proceeds from the sale of AAA Reinsurance Limited, which the Applicant previously owned,59Foot Note 59×IADSN 2 at p 553.were deposited into AAA International’s bank account in Bermuda which remains frozen by Bermudan authorities.60Foot Note 60×IADSN 3 at para 21. 50 Beyond these sources, there are other aspects of the Applicant’s evidence in this regard that warrant a second look. I first consider whether there are funds available from the released pool of assets from the Applicant’s Banque Syz account following the partial lifting of the freezing order on 18 April 2019. The Applicant submitted documentation between himself and Banque Syz attesting that he had requested the transfer of USD$1,094,000,000.00 from his Banque Syz account to his BOS account.61Foot Note 61×IADSN 3 at pp 26–32.Despite this, only USD$219,528,852.55 and €18,005,762.19 was in fact received into the BOS account on 18 April 2019.62Foot Note 62×LJH-14; LJH-15.The Prosecution contends that the remaining amount of USD$781 million is unaccounted for.63Foot Note 63×Respondent’s Submissions dated 20 January 2023 (“RS”) at para 10.I do not find that there is sufficient evidence for me to make such a finding. The Luandan Court of Appeal judgment makes reference to the fact that this attempted transaction involved “all the existing monetary values in his bank account” with Banque Syz.64Foot Note 64×IADSN 2 at p 560.On the basis of this finding (the veracity of which is not the subject of this proceeding), the remaining balance in the Banque Syz account of USD$1,131,583,245.00 reported by the Applicant to the Geneva PPO as of 4 June 2019 would more than explain the allegedly unaccounted amount.65Foot Note 65×IADSN 1 at p 735. 51 However, there are other transfers after 18 April 2019 that the Applicant does not seem to have offered any explanation for. For example, on 12 June 2019, €18,005,762.19 was transferred from the Banque Syz account to an account with Barclays Bank PLC in London under the Applicant’s name.66Foot Note 66×IADSN 1 at p 99.No evidence has been led by the Applicant of any freezing orders within the United Kingdom that he is subject to, nor any other reason why the funds transferred to that account would be unavailable to him. 52 Second, even though the Applicant maintains that his accounts in Switzerland, Portugal, and Singapore are frozen at present, there are glaring omissions in the documentation of these accounts. In relation to the Applicant’s undisclosed number of Portuguese bank accounts, counsel conceded during the hearing that they did not have any available documentation for these accounts or for the freezing orders, nor any information on the balance of money in the accounts when they were frozen. Even the identities of his companies in Portugal were not known to counsel for the Applicant, Mr Thio Shen Yi, S.C (“Mr Thio”). 53 Third, some of the Applicant’s claims regarding his ownership of his companies are at odds with the findings of the Luandan District Court and Court of Appeal. Specifically, the Applicant maintains that eight of the companies that are the subject of a forfeiture order from the Luandan District Court judgment are not known to him and may not exist.67Foot Note 67×IADSN 1 at p 621; Letter from the Applicant to the Court dated 13 February 2023.This gives some reason to doubt the veracity of the Applicant’s assertions in this regard. It is important to highlight that this issue only goes towards a finding as to the strength of evidence in favour of the Applicant’s claims, rather than a finding that funds in these alleged companies are actually available for the Applicant’s use – even if they were, I acknowledge that they would be subject to the Angolan confiscation order and would not be amenable to be utilised by the Applicant. 54 I thus note that there is some degree of uncertainty as to whether the Applicant does in fact have other assets which he can access. This is not to say that an applicant under s 35(8) of the CPC must exhaustively produce comprehensive documentation of every financial interest and bank account that he or she owns. I am also cognisant of the Applicant’s circumstances in this specific case and the potential difficulties he faces in obtaining documentation, particularly for his Angolan assets. Yet, this must be balanced against the Applicant’s wealth, the numerous cross-jurisdictional transfers of large amounts of money that the Applicant has instructed between his bank accounts in the past, and the international nature of the Applicant’s assets which make it difficult to survey the true extent of the Applicant’s wealth (as illustrated by the presence of more than €18 million in a personal bank account in the United Kingdom which was not disclosed or explained in any affidavit). In the circumstances, I am unable to find as a fact that the Applicant is unable to access funds which represent less than a fraction of a percentage of his wealth solely based on his bare assertions. Some degree of documentation, or at the very least the ability to identify, for example, the companies that are subject to alleged freezing orders in Portugal for which no documentation exists, would be necessary to sustain a finding that he is indeed unable to obtain alternative sources of funding. 55 The Prosecution also submits that there have been significant outflows from the Applicant’s BOS account to the Portuguese bank accounts of his immediate family members, the sum of which exceeds the sum sought in the present application (see [18] above). The Prosecution argues that these funds should be used to pay for the Applicant’s legal fees.68Foot Note 68×RS at para 12 and 14.The question thus arises as to whether the assets of the Applicant’s family members can be considered part of the pool of assets available to him. 56 The Applicant argues that the funds in the Portuguese bank accounts belong solely to the Applicant’s family members, were legitimately transferred for payment of their living expenses, investment purposes and savings, and in any event are no longer accessible as these accounts have been frozen.69Foot Note 69×AS at para 34 and 36; IADSN 3 at para 14.Relying on the reasoning of See J inVivosantat [5], he argues that in the same way that Tacla and the applicant in that case were separate legal entities such that the applicant could not be liable for Tacla’s legal expenses, the Applicant’s immediate family members are separate legal persons from the Applicant and should not be liable for his legal expenses.70Foot Note 70×AS at para 35. 57 I disagree with the reasoning of the Applicant. The holding inVivosantpertained to theuseof released funds needing to be exclusivelyforthe Applicant (see [39] above). This should be distinguished from the present case, which involves asking whether thesourceof alternative funds has to be exclusivelyfromthe Applicant. This distinction is important. The concept of exclusivity of use of released funds can be readily inferred from the legislative intention behind s 35(8)(b)(i) of the CPC, and from the history of that provision. Conversely, there is no suggestion from the plain wording and context of the provision that assessment of an applicant’s alternative sources of funding must be restricted to assets over which the applicant has legal title. In fact, there are compelling reasons why such an assessment should in some circumstances extend to other external sources of funding. For example, an applicant seeking release of funds for payment of basic expenses for foodstuff and medicine might very well have access to government subsidies or grants. The fact that this source of funding comes from an external party should not be a barrier to the court taking this into account, as long as such subsidies or grants can be accessed without undue hardship to the applicant. It might also be the case that an applicant has insufficient funds in his own bank account to pay for legal services at the time of making an application but may have impending transfers of money from third parties in the near future. It would not be inappropriate for a court to consider that an alternative source of funding could come from lines of credit from a financial institution, if there is evidence that such lines of credit are available, the impending transfers of money are of a sufficient quantum to pay off his liabilities, and no undue hardship would befall the applicant as a result of such an arrangement. I thus find that an assessment of an applicant’s alternative sources of funding can encompass the availability of capital (or credit) from separate legal entities. 58 In my view, it would be appropriate to consider the availability of funding from the Applicant’s family members as a potential alternative source of funds. I reach this conclusion for several reasons. 59 First, there is evidence that the Applicant’s family members have access to large sums of money in other jurisdictions. The Applicant himself notes that his son Antonino possesses more than USD$10 million, transferred from Antonino’s BOS account to an account with Bank Sinarmas, which is not frozen nor subject to any investigations.71Foot Note 71×IADSN 3 at para 23; LJH at para 39; LJH-30.Similarly, Irene states that the reason for the transfers made by the Applicant from his BOS account to Ivo’s Portuguese bank account in 2018 and 2020, totalling approximately €5 million, is that “Ivo required a reinforcement ofadditionalfunds to invest as at that time, Ivo’s own funds were already in investments and he did not have any liquid cash available to make further investments [emphasis added]”.72Foot Note 72×IADSN 3 at para 14.This suggests that even prior to the transfer of €5 million, Ivo already had investments of his own. Moreover, even though the Applicant asserts that his family’s Portuguese bank accounts have been frozen, it is not clear whether the freezing orders would have any actual effect on the family’s ability to access the sum of more than €6 million transferred in total by the Applicant. No information has been provided as to how much money remained in the Portuguese bank accounts at the time they were frozen. No information has been provided as to when the freezing orders were made, which could very well have been a significant amount of time after the original transfers. No information has been provided as to whether the Applicant’s family members have bank accounts in other jurisdictions. Mr Thio was also unable to confirm or deny whether there were any outgoing transactions from the Portuguese bank accounts between the time of these injections and their alleged freezing. There is a considerable possibility that substantial sums had been transferred out of the Portuguese bank accounts prior to the freezing orders being made. Thus, I consider there is sufficient evidence that the Applicant’s family has access to funds which would be more than sufficient to cover the legal expenses that the Applicant is seeking reimbursement for. 60 Second, there is a high likelihood that the assets of the Applicant’s family would be made available to the Applicant should he require access to funds. Given that the source of much of the wealth of the Applicant’s family came from transfers from the Applicant himself for their own investments and savings,73Foot Note 73×AS at para 34; IADSN 3 at para 14.it would be unlikely that they would be unwilling to extend the same charity back to the Applicant in his time of need. This is all the more so given the Applicant and Irene’s view that the proceedings they face around the world are the result of targeted persecution against their family as a whole.74Foot Note 74×IADSN 1 at para 22.In fact, Irene labels these as “proceedings against the São Vicente family” in her affidavit.75Foot Note 75×IADSN 1 at p 9. 61 Third, there is no evidence that the Applicant’s family is unwilling to extend funds to the Applicant to pay for his legal fees. The Applicant merely asserts that they have no legal obligation to do so.76Foot Note 76×AS at para 35.But asserting the absence of a strict legal obligation for someone to pay for a family member’s legal costs is not the same as proving that they are unwilling or unlikely to do so. Here, there is sufficientprima facieevidence that the Applicant’s family are able, and likely willing, to extend funding to him. That they are not legally liable for such expenses is irrelevant to the question of whether they would in fact extend funding to him. 62 In the circumstances, it would not be unreasonable to expect the Applicant to explore the possibility of seeking funds from his family. They have access to sufficient assets to pay his legal fees without undue hardship to themselves. These assets were gifted by the Applicant himself. There is good reason for them to be inclined to extend funding to him. There is no evidence that they are unable or unwilling to do so. I thus find that requesting for funds from his family should be considered one of the alternative sources of funding that the Applicant ought to exhaust before release of the Seized Funds be deemed necessary. There is no evidence that he has exhausted that option. Making such a request would not cause undue hardship to the Applicant. 63 For the reasons above, I find that there is a significant degree of uncertainty as to whether the Applicant has other assets of his own that are available to him for the purposes of funding his legal expenses. Even if he does not, the Applicant has failed to show that alternative sources of funding from his family are unavailable. It is thus unnecessary for the Seized Funds to be released to pay for legal expenses in Singapore to prevent undue hardship to the Applicant.",
        "Exclusivity": "64 My conclusion that the release of the Seized Funds is unnecessary is further strengthened by the fact that the legal fees for which release is sought are not incurred exclusively by the Applicant. A striking feature of the invoices issued by TSMP in respect of the Singapore proceedings is that they were addressed, not to the Applicant personally, but to the Applicant’s family. The invoice was titled “Advice in relation to the bank accounts of Carlos Manuel De Sao Vicente, Irene Alexandra Da Silva Neto, Ivo Emanuel Neto De Sao Vicente, Antonino Neto De Sao Vicente and Felicia Neto De Sao Vicente”.77Foot Note 77×IADSN 1 at pp 923, 926, and 927.That the work done is not exclusive to the Applicant is further shown by statements of the Applicant’s own family and examination of the work done by TSMP. I illustrate by way of two examples: (a) Irene describes the correspondence between TSMP and counsel for BOS as concerning “various issues in respect of the bank accounts held bymy familywith the BOS [emphasis added]”.78Foot Note 78×IADSN 1 at para 62. (b) The timesheets submitted by TSMP include internal discussions and drafting in respect of letters to the CAD for Irene and Ivo on multiple occasions.79Foot Note 79×IADSN 2 at p 202.It is clear that the references to Irene and Ivo extend beyond their assistance in the Applicant’s matter, to matters where they are the client. This is clear from the fact that legal services rendered to Irene and Ivo are billed separately from the Applicant, although these services both involve correspondence with the CAD.80Foot Note 80×IADSN 2 at p 202. 65 Mr Thio quite reasonably conceded during the hearing that reductions in the quantum could be made where work had been done for clients other than the Applicant. He submitted that the larger point was that the bulk of the work was primarily done for the Applicant. Only a small percentage of work had been done for the Applicant’s family, most of which was duplicative of work that had already been done for the Applicant as the nature of proceedings was similar. However, this submission overlooks the distinction between who work was done for, and who would be expected to make payment for that work. The two are not the same, and often may involve different individuals within a familial context. In the absence of any submissions or evidence led as to how the payment was to be divided between the five named individuals on the invoice, the most natural inference would be that the invoice was intended to bill the family as a collective unit, rather than the Applicant specifically. Given my conclusion at [59] that the Applicant’s family has more than sufficient assets for this purpose, this provides a further reason why it would be not be unjust for the funds of the Applicant’s family as a whole to be considered part of the alternative sources of funding available for the Applicant to pay for the legal fees of TSMP.",
        "Conclusion on Singapore proceedings": "66 Having found that the release of funds is unnecessary, it is not necessary for me to further consider the reasonableness of the quantum being claimed in respect of the Singapore proceedings. 67 Having regard to the interests of justice, I am strengthened in this conclusion by the presence of strong reasons as to why the release of the seized funds should not be taken lightly. There has been a determination by the Angolan courts that the Applicant has misappropriated state funds. These funds are traceable in part to the sums currently in his BOS account. He was not forthcoming in his answers to the CAD when explaining the source of his funds, even taking into account his limited access to information while incarcerated.81Foot Note 81×LJH at pp 216–224. 68 I also agree with the Prosecution that Irene and Ivo showed a lack of cooperation with the CAD through their delayed responses. The fact that they have been engaged with litigation in other jurisdictions is insufficient to explain their delay of more than a year to respond to the CAD’s offer to conduct an interview via remote communication technology.82Foot Note 82×RS at para 45; IADSN 3 at para 12.Although the nature of their conduct should not in itself prejudice the assessment of the Applicant’s case, it is nevertheless relevant in pointing towards more time being needed for investigations due to a lack of information. A greater degree of caution would thus be appropriate before a decision to release the seized funds is made. 69 In the round, I am satisfied that denying the Applicant access to the funds sought for legal expenses arising from the Singapore proceedings would not cause undue hardship or injustice.",
        "Proceedings in other jurisdictions": "70 Given my finding that the Applicant has alternative sources of funding which he has failed to exhaust, I find that release of the Seized Funds is unnecessary for payment of legal expenses incurred in the Swiss and Angolan proceedings and in making representations to international organisations. 71 Moreover, there are additional reasons why release of funds for the Swiss and Angolan proceedings in particular would not accord with the interests of justice in this case. For one, an appeal before the Swiss Federal Tribunal over the freezing order by the Geneva PPO is still pending (see [9] above). The decision could be reversed. In the absence of evidence as to why payment for the Swiss legal fees is time-sensitive, there are good reasons for waiting for the result of the pending appeal before allowing an application for release of seized funds. The same applies to the Angolan proceedings, which are also pending appeal.83Foot Note 83×IADSN 1 at para 55. 72 More importantly, this is a case where there are more than sufficient funds that are the subject of the Swiss freezing order to pay for the Applicant’s Swiss legal representation. The decision as to whether funds should be released for this representation would be best made by Swiss courts, who are better placed to make their own determination of the balance between the necessity of the freezing order and prejudice to the Applicant. In fact, the question of whether “irreparable harm would be caused to the holder of the sequestered assets” had already been canvassed before the Swiss courts.84Foot Note 84×IADSN 2 at p 247.The Applicant claims that under Swiss law it is not possible to obtain any partial release of funds seized pursuant to criminal investigations for payment of legal expenses—85Foot Note 85×IADSN 2 at para 28.but this misses the point. Where there are sufficient assets seized in Switzerland for release to be sought for payment of legal expenses, such release ought to be sought from the seized Swiss funds, and the best adjudicator of whether that release can be made would be the Swiss courts. The same is true in Angola, where there are more than sufficient assets under a confiscation order for the issue to be best considered by an Angolan court. 73 Lastly, although rendered irrelevant by my conclusion that release of the Seized Funds is unnecessary, I note for completeness that the scope of s 35(8)(b)(i) of the CPC ought to include legal services rendered for proceedings out of jurisdiction. Observing the plain wording of s 35(8), there does not appear to be any reason for limiting the release of property under s 35(8)(b)(i) to fees or expenses that are incurred in Singapore. Various kinds of expenses listed under s 35(8)(a) are capable of being incurred in multiple jurisdictions, such as where release is sought for payment of taxes or insurance premiums. Extraordinary expenses under s 35(8)(c) similarly do not seem amenable to such a geographical limitation. Even though s 35(8)(e) limits the release of funds for day-to-day operations to companies incorporated in Singapore, this seems to be a particular feature of that specific subsection, as evidenced by the absence of similar wording elsewhere in s 35(8). Moreover, there are plausible reasons for the operations of Singaporean-incorporated companies to be regarded differently from foreign-incorporated companies, as information about these companies is more accessible to local courts, and cessation of their operations is more likely to have adverse effect on local supply chains, businesses, and employees.",
        "Conclusion": "74 I therefore dismiss the application.  Vincent HoongJudge of the High Court    Thio Shen Yi SC, Neo Zhi Wei Eugene and Phoon Wuei (TSMP Law Corporation)for the applicant; Alan Loh, Eric Hu and Daniel Ling(Attorney-General’s Chambers) for the respondent."
    }
}