{
    "case_title": "Bay Lim Piang vLye Cher Kang",
    "ncitation": "[2023] SGHC 13",
    "coram": "Kwek Mean Luck J",
    "sections": {
        "Introduction": "1 In this Suit, the plaintiff, Mr Bay Lim Piang (“Bay”), claimed that the defendant, Mr Lye Cher Kang Alan (“Alan”), had made fraudulent representations to him, which induced him to loan S$2,604,070.60 to Alan. Bay also claimed in the alternative against Alan for: (a) misrepresentation under s 2(1) of the Misrepresentation Act (Cap 390, 1994 Rev Ed) (the “MRA”); (b) negligent misrepresentation; and (c) breach of an agreement dated 27 July 2014.1Foot Note 1×Parties’ Agreed List of Issues dated 11 October 2022. 2 Alan’s main defence was that he had been defrauded by one Mr Don Brendan Robert (“Brendan”), and that he had merely “passed on” Brendan’s representations to Bay. 3 Following the trial, I held that Bay succeeded in his claims in: (a) fraudulent misrepresentation; (b) misrepresentation under s 2(1) of the MRA; and (c) negligent misrepresentation. Bay was consequently entitled to the recission of the loans that he had made to Alan or to damages in the amount of the loans that he had made, of S$2,604,070.60. Alan has appealed against my decision. These are my full grounds of decision.",
        "Background facts": "4 Bay was previously a chartered quantity surveyor and project management surveyor. He is now a retiree.2Foot Note 2×Affidavit of Evidence-in-Chief of Bay Lim Piang (“Bay AEIC”) at para 6.Alan first met Bay in 2001 when Alan’s company, Hoseki International Pte Ltd (“Hoseki”), carried out some aluminium works as a sub-contractor at a property leased by Bay’s company.3Foot Note 3×Affidavit of Evidence-in-Chief of Lye Cher Kang (“Alan AEIC”) at paras 75–76.Sometime in 2011, Hoseki carried out some aluminium works for Bay’s house.4Foot Note 4×Alan AEIC at paras 79–80. 5 Sometime between March 2012 and June 2014, Alan made various representations to Bay. While Alan took the position that the representations were not made by him, but were made by Brendan to Bay through Alan,5Foot Note 5×Defendant’s Closing Submissions (“DCS”) at para 29.the contents of those representations were not disputed. Broadly, Bay was told that Alan had used some of his own money to help Brendan secure the release of Brendan’s inheritance money, which amounted to about US$45m. The Commercial Affairs Department (“CAD”) had purportedly seized that sum of US$45m, together with US$5m of Alan’s money (the “Seized Sum”).6Foot Note 6×Bay AEIC at paras 22, 25 and 29. 6 From around then till around 25 June 2014, Alan made more representations to Bay about further charges and fees that had to be paid to different entities to secure the release of the Seized Sum. Bay claimed that he had extended more than 200 loans to Alan between 2 June 2012 and 25 June 2014, pursuant to such representations from Alan, amounting to a total of around S$2.6m.7Foot Note 7×Plaintiff’s Closing Submissions (“PCS”) at para 21 and Annex A.According to Bay, he had done so in the hope of being hired as a consultant when Alan set up his development company.8Foot Note 8×Bay AEIC at para 35. 7 Brendan pleaded guilty on 17 May 2016 to 25 charges of cheating and was sentenced on 21 July 2016 to 7 years’ imprisonment.9Foot Note 9×Alan AEIC at page 131 (Public Prosecutor v Don Brendan Robert[2016] SGDC 208 at [58]).Brendan is an undischarged bankrupt.10Foot Note 10×Alan AEIC page 110 (Public Prosecutor v Don Brendan Robert[2016] SGDC 208 at [5]).",
        "Fraudulent misrepresentation": "8 Bay claimed against Alan for fraudulent misrepresentation. The elements that need to be established to ground a claim for fraudulent misrepresentation were set out inPanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 (“Panatron”) at [14]. To succeed in a claim for fraudulent misrepresentation, Bay needed to prove that: (a) Alan made a false representation of fact to him;(b) the representation was made with the intention that Bay should act on it;(c) Bay acted in reliance on the misrepresentation;(d) Bay suffered damage by acting on the misrepresentation; and(e) Alan made the false representation knowing that it was false or in the absence of any genuine belief that it was true. 9 At the close of the trial, parties agreed on the list of issues that they would address in their closing written submissions (the “Agreed List of Issues”). The agreed issues arising from the claim in fraudulent misrepresentation were:11Foot Note 11×Parties’ Agreed List of Issues dated 11 October 2022. (a) whether the representations that were made to Bay were adopted by Alan or whether the representations were made by Brendan to Bay through Alan;(b) whether Alan intended for Bay to act upon the representations that were made;(c) whether Bay acted in reliance on the representations;(d) whether Bay suffered damage by acting on the representations; and(e) whether the representations were made by Alan: (a) with the knowledge that they were false, wilfully false or in the absence of any genuine belief that they were true; or (b) recklessly, careless of their truth.",
        "False representation of fact made by words or conduct": "10 The Agreed List of Issues did not identify the questions of whether Alan made the representations to Bay, or whether such representations were false, as issues for submission. In other words, Alan did not dispute that false representations of fact were in fact made. Instead, his defence was that he did not adopt such representations as his own, and that the representations were made by Brendan to Bay, through Alan. 11 For completeness, I will nevertheless deal briefly with the evidence on whether false representations of fact had been made by words. The evidence on this was very clear. Alan himself admitted to making representations to Bay in his Defence (Amendment No 2) (the “Defence”), where he pleaded:12Foot Note 12×Defence (Amendment No 2) (“Defence”) at paras 7 and 7(3). 7. The alleged representations or any representations in the nature of or equivalent to the alleged representations as alleged in the [Statement of Claim], were representations by DBR [ie, Brendan] to the Plaintiff [ie, Bay]. The Defendant [ie, Alan] avers that: … (3) The Defendant was DBR’s mouthpiece who passed on DBR’s representations to the Plaintiff, as informed by DBR, without more. The Defendant did not know that the alleged representations were untrue. The Defendant did not assume responsibility for DBR’s representations. The Plaintiff knew that DBR was the author of the alleged misrepresentations or author of the representations in the nature of or equivalent to the alleged misrepresentations, and that DBR made the same to the Plaintiff through the Defendant. 12 Alan also admitted that he made representations to Bay in his affidavit of evidence-in-chief (“AEIC”):13Foot Note 13×Bay AEIC at paras 106–109. 106. Around May 2012, I told Bay about Brendan. I told Bay that I was helping Brendan make various payments to obtain a release of the frozen funds.  107. Brendan told me to tell Bay that he would pay Bay “tokens” for every sum of money that Bay loaned to Brendan. I followed Brendan’s instructions and told Bay everything that Brendan told me to tell Bay.  108. Brendan also told me to tell Bay that he would allow Bay to manage the inheritance properties left behind by his late father. I followed Brendan’s instructions and told Bay everything that Brendan told me to tell Bay.  109. Brendan told me to tell Bay the various stories, explanations, and reasons for payments that Brendan had to make (the alleged misrepresentations). I followed Brendan’s instructions and told Bay everything that Brendan told me to tell Bay. 13 Bay recounted the representations made by Alan from the third quarter of 2010 to August 2013 in his email dated 27 August 2014 to the CAD (the “42 Page Report”).14Foot Note 14×Agreed Bundle of Documents Volume 1 (“1AB”) at pages 69–111.Bay also recounted the representations made to him by Alan between September 2013 and June 2014 in his emails to his son, Jervis Bay (“Jervis”), from 18 September 2013 to 31 July 2014 (collectively, the “Jervis emails”).15Foot Note 15×Bay AEIC at paras 59 and 60 and pages 273–440. 14 Bay also relied on SMSes sent by Alan to Bay, from around 17 October 2013 to 11 November 2013 (“Alan’s SMSes”).16Foot Note 16×Bay AEIC at para 62; pages 442–456.Some of those SMSes, together with the date and time they were received, are set out below: (a) SMS received on 12 October 2013 at 6.22pm: “Lawyer just passed cashier order to Mr Chua.”17Foot Note 17×Bay AEIC at page 443.(b) SMS received on 17 October 2013 at 8.01am: “Now we r at boon tat street to meet Mr chia. He say Yday UOB got informed that today cash will leave their bank to Cisco but no indicated actual Time.”18Foot Note 18×Bay AEIC at page 443.(c) SMS received on 17 October 2013 at 8.16am: “Mr bay, tis morning 6am I m already out n Brendan also waiting me at new wing Nuh building. We r now confirmed no people following us.”19Foot Note 19×Bay AEIC at page 443.(d) SMS received on 18 October 2013 at 7.22am: “Morning Mr bay. We r now at Dover. Brendan said Yday eve at least Cisco move some fund from Uob n today 10am will continue the balance. Today is Friday. Hopefully Uob don’t delay. AIG come at 11am.”20Foot Note 20×Bay AEIC at page 444.(e) SMS received on 25 October 2013 at 8.15am: “Mr bay, Yday at woodland terrible. We r now meeting lawyer c can help of $7500”21Foot Note 21×Bay AEIC at page 446.(f) SMS received on 1 November 2013 at 4.37am: “I will explain to u. Importantly Is a link from Cisco, Uob n DBS. Our hard cash still withdraw out from Uob to Cisco. Remember still need Uob moved first, follow by DBS,OCBC , HSBC n Citibank.”22Foot Note 22×Bay AEIC at page 446.(g) SMS received on 10 November 2013 at 5.21pm: “Mr Bay, Yday 4pm Mr Chua already informed us will next update will be on Monday 10am. This morning m back home already 3am bcoz met Brendan side Malaysia creditors at woodland .”23Foot Note 23×Bay AEIC at page 447.(h) SMS received on 11 November 2013 at 7.53am: “Morning Mr bay, m now at Nuh waiting for Brendan go to meet lawyer to find out Saturday details at inland revenue.”24Foot Note 24×Bay AEIC at page 448.(i) SMS received on 4 December 2013 at 6.10pm: “Mr bay, u c can help $2500 bank into Uob 371-394-153-9 Mas Temperory acct to stamp office”25Foot Note 25×Bay AEIC at page 449. 15 Alan disputed the authenticity of Alan’s SMSes.26Foot Note 26×DCS at para 155.Bay testified that he paid a vendor to help him export Alan’s SMSes from his phone to his computer. He described this process when he was on the stand.27Foot Note 27×Transcript, 28 September 2022, p 84 ln 7–20.He produced a service invoice dated 8 August 2014 as proof of such a service being provided.28Foot Note 28×Plaintiff’s 2nd Supplemental Bundle of Documents Volume 1 at page 433.Bay’s evidence on this was unchallenged after cross-examination. I accepted that Alan’s SMSes are authentic. 16 Alan also submitted that Alan’s SMSes are unreliable, as they only show Alan’s messages and not Bay’s, and there was therefore no context to the SMSes.29Foot Note 29×DCS at para 155. 17 In response, Bay explained that he was “more like a receiver” of Alan’s SMSes and thus did not reply to Alan unless it was “really necessary”.30Foot Note 30×Transcript, 28 September 2022, p 85 ln 5–9.He testified that his phone was an old model which had limited memory space and that he deleted messages so that his phone could continue to function.31Foot Note 31×Transcript, 28 September 2022, p 85 ln 14 to p 86 ln 8. 18 I found that Alan’s SMSes were reliable, for the purposes submitted by Bay, for the following reasons. (a) The contents of Alan’s SMSes were very similar to the verbal representations made by Alan. (b) While the absence of Bay’s replies could affect the reliability of Alan’s SMSes where context is important, the underlying context behind Alan’s SMSes was not relevant to what Bay was trying to prove using Alan’s SMSes,ie, that Alan had made various representations through those SMSes. In any case, given that the messages were primarily updates from Alan, I accepted Bay’s evidence that he was more of a “receiver” of such messages. Being updates from Alan, they did not require any reply or earlier query from Bay in order to understand the matters on which Alan updated Bay. The absence of context did not detract from Alan’s SMSes pointedly showing that Alan himself made certain representations via SMS, that were similar to the verbal representations made by Alan (see [12] above). For example, the SMS of 17 October 2013 at 8.01am mentions Alan and Brendan meeting someone in order to effect the release of the Seized Sum. The other examples of Alan’s SMSes set out above are self-explanatory – they plainly show that Alan had made representations to Bay. (c) I found Bay’s explanation for why he did not have his own messages in the extracts, namely that his phone was an old model with limited memory space, to be reasonable. While Bay did reply “Yes, whatever” when asked whether the messages he deleted included messages that were adverse to him, the cross-examination that followed did not identify any adverse messages that he may have deleted. Nor did it support the view that Bay had intentionally deleted adverse messages to conceal evidence. Counsel for Alan claimed during the trial that Alan was not able to produce the messages from his handphone to show adverse messages as Alan’s phone was not functioning.32Foot Note 32×Transcript, 28 September 2022, p 89 ln 17–19.However, Alan did not even testify what adverse messages there might have been. Indeed, Alan did not dispute the content of some of the SMSes that Bay relied on and accepted that they were sent by him. For example, he testified that when he sent the SMS to Bay that he was meeting a “Mr Chua”, he did meet a fake “Mr Chua”.33Foot Note 33×Transcript, 30 September 2022, p 155 ln 1–4. 19 Alan’s defence was that the representations made to Bay had not been adopted by him. He was merely Brendan’s mouthpiece, and the representations were made by Brendan through Alan to Bay. Alan submitted that: (a) The Jervis emails show that Bay knew Brendan made the misrepresentations, he was assisting Brendan, and Brendan would repay him. Bay referred in the Jervis emails to the “money owner” and identified the “money owner” as Brendan in his email to Jervis dated 28 September 2013.34Foot Note 34×DCS at paras 34–36. (b) Bay himself said in court that “all information here are all fake given by -- given by Brendan”.35Foot Note 35×DCS at para 32; Transcript, 27 September 2022, p 156 ln 22–23. (c) Bay had received assurances from Brendan. While not explicitly mentioned in the Defendant’s Closing Submissions (“DCS”), counsel for Alan referred during the trial to: (i) Bay’s email to the CAD dated 5 August 2014,36Foot Note 36×Agreed Core Bundle (“ACB”) at page 245.where Bay said that Alan had “specially called Brendan to speak to [Bay]” and to provide Bay with assurance;37Foot Note 37×Transcript, 27 September 2022, p 15 ln 6 to p 16 ln 7.and (ii) the 42 Page Report, where Bay told the CAD that Brendan called Alan who passed the handphone to Bay’s ex-wife, to assure her that he would repay some money.38Foot Note 38×42 Page Report p 8 at para 18; 1AB page 77. (d) The documentary evidence that Alan submitted to the CAD was reliable evidence that could prove and corroborate the above.39Foot Note 39×DCS at para 6. (e) Bay accepted that Brendan scammed Alan and that Alan did not collaborate with Brandon.40Foot Note 40×DCS at para 7.Bay said “Correct” when counsel for Alan asked Bay on the stand: “You say there's no possibility [Alan] collaborated [with Brendan] because you were beside [Alan] all the day, correct?”41Foot Note 41×Transcript, 27 September 2022, p 131 ln 20–24. (f) In an email dated 12 July 2013, Alan forwarded to Bay an email from Brendan, where Brendan informed that all creditors would receive money in their respective bank account by a certain date. This was forwarded without Alan saying anything.42Foot Note 42×1AB at page 836. 20 Alan citedLim Bee Lan v Lee Juan Loong and another[2021] SGHC 234 (“Lim Bee Lan”) in support of his position. In that case, the plaintiff alleged that the defendants made false representations to her, directly and through her daughter (“Pei Wen”). The court found that the defendants made representations to the plaintiff through Pei Wen (Lim Bee Lanat [58]). 21 However, these findings fromLim Bee Lanrelate to the question of whether a representation can be made to the plaintiff through an intermediary or agentof theplaintiff. The issue here was not whether Brendan had made representations to Bay through an intermediary or agentof Bay. Neither party contended that Alan was acting as an intermediaryof Bay.Lim Bee Lanwas hence not applicable to the present case. 22 Instead, the issue was whether Alan made representations to Bay. There was no dispute evidentially that Alan himself conveyed the representations to Bay. The question was whether Alan’s defence, that he was only a mouthpiece or an intermediary, had any merit. 23 I found that the evidence which Alan referred to did not assist him. (a) While the Jervis emails referred to Brendan as the “money owner”, they also referred to Alan. Therefore, the fact that the emails referred to Brendan did not show that Alan had not adopted the representations as his own. A few of those emails and the references to Alan in those emails are reproduced below: (i) Email of 10 January 2014: “Daddy told Alan/Brendan that they had to look for money to pay CISCO and DBS themselves”.43Foot Note 43×ACB at page 149. (ii) Email of 9 February 2014: “If it is really a scam, both Brendan and Alan must be the king of scamer [sic]!” [emphasis in original omitted]44Foot Note 44×ACB at page 122. (iii) Email of 10 July 2014: “I am very regretful to trusted Alan so much and loaned him money over and over again”. [emphasis in original omitted]45Foot Note 45×ACB at page 85. (b) Parties did not dispute that Brendan was the source of the false information. This was what Bay’s statement in court, that “all information here are all fake given by -- given by Brendan” (see [19(b)] above), related to. That statement did not mean Bay accepted that Alan had not adopted the representations as his own. (c) That Brendan provided direct assurance to Bay on a few occasions through phone calls did not, in itself, show that Alan had not adopted the representations. (d) There was no indication that the CAD scrutinised or tested the documents that Alan conveyed to them. They remained Alan’s uncorroborated account of events and were of limited probative value. (e) Bay’s acknowledgement that Alan could not have collaborated with Brendan (see [19(e)] above), was in response to a specific incident where Alan was with him all day. It was not an acknowledgement that Alan could not have collaborated with Brendan for the purposes of the wider and entire transaction. (f) I accepted that Alan forwarded the email dated 12 July 2013 from Brendan to Bay, without saying anything more (see [19(f)] above). There were, however, many other pieces of weighty evidence that indicated that the relevant representations made to Bay had been adopted by Alan, which I set out below. 24 Bay referred toLiuYanzhe and another v Tan Eu Jin and others[2019] SGHC 67 (“LiuYanzhe”). In that case, the court found at [119] that one of the defendants had not made representations on his own behalf, but was simply conveying the position of the other defendants to the plaintiffs. The court further found that that defendant had not adopted the relevant representation or made it his own. The upshot of the court’s findings inLiuYanzheis that where a representor claims to be an intermediary and makes representations on behalf of another, he could nevertheless be liable for the representation if he had “reason to adopt [the] representation as his own”. 25 Bay submitted that Alan had reason to adopt the representations as his own, as he stood to benefit from the transactions. If Brendan’s representations were true, Alan stood to gain from the release of US$5m from the Seized Sum without taking on additional financial risks. Conversely, if Brendan’s representations were untrue, Alan nevertheless stood to benefit from the sum that he borrowed from Bay but had not transferred to Brendan.46Foot Note 46×PCS at paras 3 and 46. 26 I found that on the evidence, Alan had adopted the representations emanating from Brendan as his own, for the following reasons. 27 First, I agreed with Bay that Alan stood to benefit from the representations and would thus have an incentive to adopt the representations as his own. If Alan believed that Brendan’s representations were true, Alan stood to gain in the release of US$5m from the Seized Sum, without taking on the additional financial risks. Even if they were untrue, Alan still stood to benefit from the sum that he borrowed from Bay but had not transferred to Brendan. Bay’s case was that he loaned S$2,604,070.60 to Alan. However, the total amount that Alan could prove was transferred to Brendan (ie, amounts for which he had deposit slips evidencing transfers to Brendan’s accounts) only amounted to S$2,382,786.47Foot Note 47×Alan AEIC at pages 157–175.Taking into account the amount which Alan purportedly extended to Brendan personally, which Alan could evidence with receipts (ie, S$160,440),48Foot Note 48×Alan AEIC at pages 157–158.it would mean that only S$2,222,346 that was transferred to Brendan’s accounts could be attributed to money Alan received from Bay. However, that left S$381,724.60 unaccounted for (S$2,604,070.60 less S$2,222,346). Even by Alan’s account that Bay had only loaned him S$2,575,302.40, that leaves an amount of S$352,956.40 unaccounted for (S$2,575,302.40 less S$2,222,346). 28 Alan relied on the spreadsheet that he sent to the CAD, to show that Brendan received at least S$2,575,302.40. He submitted that if he had provided false information to the CAD, the reasonable inference is that he would have been charged for the provision of false information, but he was not.49Foot Note 49×DCS at paras 80–82.However, there was no evidence from the CAD as to what they did or not do with the information that Alan had provided. The mere fact that Alan had sent the spreadsheet to the CAD did not show that the spreadsheet was accurate, or that Alan did transfer S$2,575.302.40 to Brendan from the loans Alan received from Bay. 29 On the stand, Alan claimed that some money was transferred to Brendan in cash.50Foot Note 50×Transcript, 4 October 2022, p 185 ln 17 to p 186 ln 11.This was not in his affidavit. Nor could Alan produce any documentary evidence to support this claim. 30 Given the evidence, I found it more likely that Alan did not transfer the remainder of the money to Brendan, by cash or otherwise, but kept the money for himself. He thus stood to gain financially from the representations made to Bay. 31 Second, Alan did not just convey Brendan’s representations. Alan also sent his own representations to Bay, through Alan’s SMSes, to show that he himself participated in the alleged transactions to release the Seized Sum. In Alan’s SMSes, he would often refer to himself and Brendan jointly, informing Bay that “we r” (ie, Alan and Brendan are) at a certain location or meeting certain individuals. Given that Bay did not know Brendan personally, demonstration of Alan’s personal involvement would have enhanced Bay’s trust in the process. Alan also undertook to personally explain to Bay, using the phrase “I will explain to u” (see [14(f)] above). 32 Third, Alan signed two documents, on 13 September 2012 (the “13 September 2012 Agreement”)51Foot Note 51×Plaintiff’s Supplemental Bundle of Documents (“PSBD”) at page 28.and on 27 July 2014 (the “27 July 2014 Agreement”),52Foot Note 52×ACB at page 231.where he acknowledged that he made requests for loans from Bay to secure the release of money belonging to Alan which was seized by authorities. 33 The 13 September 2012 Agreement stated: With reference to your recent requests, this is to confirm that to assist you to pay the charges imposed by the banks as well as the relevant authorities such as MAS, IRAS and CAD etc. in order to secure the release of your monies (Approximately US$5,000,000.00) withheld by the Banks under the instructions of CAD previously, I have, at your request, granted you personal/friendly loans … [Signed by Bay]  I, Lye Cher Kang, […] hereby acknowledge receipt of totalS$399,550.00of personal/friendly loans without interest from Bay Lin Pin, […] during the period from 5 June 2012 to 13 September 2012 and further promise to repay the loans in accordance with the terms and conditions as stated hereinabove. [Signed by Alan] [emphasis in original] 34 Notably, the document stated that the loan was to assist Alan to pay the charges and secure the release of Alan’s money amounting to US$5m that had been withheld by the banks under the instructions of the CAD. There was no mention of Brendan in this document. 35 The signatures on the 13 September 2012 Agreement and the 27 July 2014 Agreement purportedly belonging to “Lye Cher Kang” appeared similar. Alan did not dispute that he signed the 27 July 2014 Agreement. It therefore appeared,prima facie, that Alan had also signed the 13 September 2012 Agreement. 36 Alan claimed that the 13 September 2012 Agreement should be disregarded. Alan contended that Bay’s ex-wife had told the police that the document was backdated. He submitted that it is more than likely that Bay’s ex-wife was correct.53Foot Note 53×DCS at para 154.I found Alan’s case on this to be self-contradictory. On the stand, when questioned whether the 13 September 2012 Agreement was backdated, Alan said that he had not seen it before.54Foot Note 54×Transcript, 4 October 2022, p 92 ln 14 to p 93 ln 1. 37 During the trial, counsel for Alan suggested55Foot Note 55×Transcript, 4 October 2022, p 185 ln 3 to p 186 ln 3.that the agreement was made up as it was not mentioned in Bay’s reports to the police dated 25 July 201456Foot Note 56×Bay AEIC at page 496; ACB at page 227.and 26 November 2014.57Foot Note 57×ACB at page 330. 38 I found that the absence of the 13 September 2012 Agreement from these police reports did not assist Alan. The 25 July 2014 report was filed by Bay’s ex-wife, not Bay. His unchallenged testimony was that he was not aware of this report. Bay also explained that he had left the 13 September 2012 Agreement out of his 26 November 2014 police report, because it was superseded by the 27 July 2014 Agreement, which was more up to date and comprehensive. I found this to be a reasonable explanation. 39 In addition to the 13 September 2012 Agreement, there was also the 27 July 2014 Agreement.58Foot Note 58×ACB at pages 231–232.This was signed by Alan and contained his thumb print. In it, Alan acknowledged that he had made very specific representations to Bay, including that: (a) Bay had, at Alan’s request, assisted him to “pay the various charges imposed by the banks such as UOB, OCBC, HSBC, and Citibank, including DBS Bank (as receiving bank) as well as the relevant authorities such as MAS, CAD, IRAS, Official Assignee, Supreme Court, Parliament House and CISCO, etc. in order for [Alan] to retrieve [his] frozen monies withheld by the said Banks under the former instructions of CAD in year 2002.”(b) Alan was “unable to show [Bay] any documentary evidence or to meet [Alan’s and Brendan’s] Lawyers to prove that [his] case with CAD is genuine and not bogus because [Alan, Brendan, and their lawyers from Allen & Gledhill] had signed the non-disclosure agreement with CAD and MAS.”(c) “[T]he monies [Alan] borrowed from [Bay] are for payments to either banks or relevant Government Authorities or Government related Companies through UOB Account … [which was] set up by Allen and Gledhill for payment purposes.”(d) “The reasons for the long delay to retrieve the frozen monies from the banks are not due to [Alan’s or Brendan’s] fault but either banks or the relevant Government Authorities, e.g. the refusals (despite approvals given by Cabinet Secretary and Speaker of Parliament by separate emails) to let [Alan and Brendan] to collect money from the Parliament House since mid-May 2014.” 40 Alan submitted that this was a sham document and that the parties did not intend to create legal relations through it. According to Alan, Alan and Bay only signed this document so that Bay could appease his ex-wife, who was concerned about the loans extended by Bay.59Foot Note 59×DCS at paras 120–122. 41 Alan referred to an email from Bay to Alan dated 5 July 2014 where Bay told Alan that he needed Alan to sign an IOU which Bay could then show his ex-wife.60Foot Note 60×Bay AEIC at page 484.On the stand, Alan said that he signed the 27 July 2014 Agreement so that Bay could calm his ex-wife down so that she would not go the police. He also said that he had signed it so that she would not “make all the noise” or make things difficult, thereby preventing the transaction for the release of Seized Sum from being affected.61Foot Note 61×Transcript, 4 October 2022, p 203 ln 23 to p 206 ln 6. 42 However, even if this was one of the reasons for Alan signing the 27 July 2014 Agreement, that did not mean that the agreement was a sham document. Even on Alan’s explanation, it may nevertheless have been the case that he did not dispute what was stated in the 27 July 2014 Agreement. Alan might have been reluctant to sign the agreement but for the fact that he wanted to calm Bay’s ex-wife down, so that she would not go to the police or affect the transaction. However, that did not mean that whatever is stated in the agreement was untrue. 43 In any event, the Seized Sum did not in fact exist. For the reasons set out below (at [77]–[85]), I found that Alan knew that the representations he made about the Seized Sum were false. It followed that his explanation that he signed the 27 July 2014 Agreement to prevent the release of the Seized Sum from being affected was not credible. 44 Alan also claimed that he did not have the intention to create legal intentions. But he did not deny that he had signed and appended his thumbprint. He had not suggested that he was legally able to avoid the agreement by way of any recognised contractual defence, such as duress. 45 Fundamentally, the agreement had been signed by Alan and contains his thumb print. This was not contested. Alan testified that when he handles contracts as a contractor, he would not sign an agreement he did not agree with.62Foot Note 62×Transcript, 30 September 2022, p 8 ln 18 to p 9 ln 11.He provided no satisfactory explanation why the 27 July 2014 Agreement was any different. I found that Alan did not make out his defences that the 27 July 2014 Agreement was a sham and/or that there was a lack of intention to create legal relations. Further, by his signature and thumbprint, he acknowledged making the representations set out in the 27 July 2014 Agreement to Bay. 46 Moreover, it was undisputed that Bay had never met Brendan and only knew of Brendan through Alan. They only communicated through the phone on a few occasions. Alan was, on his own evidence, close to Brendan and worked with him. In some of the SMSes that Alan sent to Bay, Alan told Bay that he was with Brendan, meeting with bankers or lawyers to handle the release of the Seized Sum or meeting Malaysian creditors. Moreover, Alan informed the police that Brendan was his “money partner” in his handwritten statements to the police.63Foot Note 63×Alan AEIC at page 142 (line 6).He did business with Brendan in Thailand and Malaysia in 2003.64Foot Note 64×Transcript, 30 September 2022, p 26 ln 25 to p 27 ln 3.While Alan denied on the stand that he was Brendan’s “money partner”, he did not provide any explanation why he would have informed the police otherwise. 47 In summary, I found that Alan had made false representations of fact/misrepresentations to Bay both verbally and through his SMSes, and had thereby adopted Brendan’s representations as his own.",
        "Representation made with intention that it should be acted upon": "48 The second element of fraudulent misrepresentation is that the representations must have been made with the intention that it should be acted upon. Bay submitted that Alan’s representations were made with the intention that Bay would act upon them by loaning him money.65Foot Note 65×PCS at paras 72–74.This could be seen from: (a) Alan’s representations that (a) the money that Bay loaned would be deposited into a specific bank account; (b) Mr Rhys Goh from Allen & Gledhill (“A&G”) would be the only individual who could operate the account; and (c) the money would not be used for any purpose other than to secure the release of the Seized Sum;66Foot Note 66×PCS at para 17(a); Bay AEIC at para 29.(b) Alan’s acknowledgement of the loans and their purpose in the 13 September 2012 Agreement; and(c) Alan’s acknowledgement of the loans and their purpose in the 27 July 2014 Agreement. 49 Alan submitted that he had no intention to induce Bay. It was Brendan who had such an intention. Alan did not assume responsibility for Brendan’s misrepresentations. Bay himself acknowledged that when he said, “all information here are all fake … given by Brendan” (see [19(b)] above). 50 While not mentioned in the DCS, counsel for Alan suggested during the trial that Bay was not induced by Alan’s representations, but by Brendan’s representation that Brendan would pay Bay “tokens” (ie, a larger sum than the loan Bay extended to Brendan) (the “token payments”) and that Bay would manage Brendan’s inheritance properties.67Foot Note 67×Transcript, 28 September 2022, p 18 ln 20 to p 19 ln 4; p 30 ln 10 to p 31 ln 12.Alan had provided to the CAD a table, which had Alan’s handwritten notes, stating that Bay invested S$2,575,302.40, and Brendan promised to pay Bay token interest of S$1,044,697.60.68Foot Note 68×1AB at page 1137. 51 Alan did not point to any documentary evidence of the token payments, other than the handwritten notes which he had provided to the CAD. In fact, the 27 July 14 Agreement is explicitly contrary to the purported token payments scheme, since it expressly states that “I [ie, Bay] have not asked for any compensation or charged you [ie, Alan] any interest for the loans given to you”.69Foot Note 69×ACB at pages 231–232.Taking into account the evidence on the whole, I found that Alan had not proven that Bay was induced to provide the loans because of the token payments allegedly promised by Brendan. 52 Bay’s statement on the stand that “all information here are all fake …  given by Brendan” also did not assist Alan. This was a repetition of Alan’s argument that he was merely a mouthpiece, which I have dealt with above (at [23]). As I noted above, Bay’s statement on the stand simply meant that Brendan was the source of the false information, which the parties did not dispute. This did not detract from Bay having acted on Alan’s representations. 53 I found there to be clear evidence, from: (a) the representations on how the loans would be managed for the sole purpose of releasing the Seized Sum; and (b) Alan’s acknowledgements in the 13 September 2012 Agreement and the 27 July 2014 Agreement of the loans extended by Bay and their purpose, that the representations were made by Alan with the intention that they should be acted on by Bay, to provide the loans.",
        "Bay had acted upon the false statement": "54 Bay submitted that he had acted upon Alan’s false statements to provide loans to Alan in the total sum of S$2,604,070.60.70Foot Note 70×Statement of Claim Amendment No 2 (“SOC”) at para 29(a).He submitted that this was evidenced by the following: (a) Bay’s withdrawals that were reflected in his bank account statements.71Foot Note 71×Bay AEIC at pages 215–221 (BLP-4) (Jun 2012–September 2012), pages 248–269 (BLP-7) (October 2012–August 2013) and pages 460-–482 (BLP-12) (September 2013–June 2014). (b) Alan signed and acknowledged the loan amount of S$399,550 in the 13 September 2012 Agreement. This stated that Bay had “at [Alan’s] request, granted [Alan] personal/friendly loans by way of cash drawn from [Bay’s] bank accounts or borrowed from the bank and credit cards’ accounts as and when required/requested by [Alan] amounting toS$399,550.00.” [emphasis in original]72Foot Note 72×Bay AEIC at paras 42–44; PSBD at page 28. (c) Alan signed and placed his thumbprint on the 27 July 2014 Agreement, where he acknowledged that Bay had “at [Alan’s] requests for help from time to time, granted [Alan] personal/friendly loans by way of cash cheques or cash either withdrawn from [Bay’s] bank accounts or borrowed from the banks and credit cards' accounts as and when required/requested by [Alan] amounting to a total ofS$2,575,302.00as at 25 June 2014” [emphasis in original].73Foot Note 73×Bay AEIC para 77(b); ACB page 231. (d) Alan’s admissions in his WhatsApp messages to Bay (“Alan’s WhatsApp messages”), which are set out below:74Foot Note 74×Bay AEIC at para 118; pages 1214–1217 (BLP-25); Agreed Bundle of Documents Volume 2 (“2AB”) at page 2520. (i) In a message sent on 11 August 2014, Alan admitted that the total sum of money Bay transferred to him was S$2,529,656.00 and that he “told [his] wife” that he “must sell the house to return” Bay the money.(ii) In a message sent on 23 June 2020, Alan said he had been “searching a way to find the money” to “return to [Bay and the] creditors”.(iii) In a message sent on 23 June 2020, Alan said he was “struggling hard to confirm the money” to be obtained from a project in Indonesia so that he can “return [Bay] back the money”. 55 Bay submitted that he had made loans to Alan, not Brendan. It was for Alan to then use the loaned money to secure the release of the Seized Sum. Bay did not know Brendan and had never met him. It would have made little sense for Bay to agree to lend money to a stranger. If the money was loaned to Brendan, there would have been no good reason for the money to go through Alan or Alan’s account, instead of being transferred directly to Brendan.75Foot Note 75×PCS at para 70. 56 Alan admitted that Brendan received money from Bay.76Foot Note 76×Alan AEIC at paras 101–103.However, Alan denied that Bay loaned the money to Alan. His defence was that Bay loaned his money to Brendan. 57 Alan relied on the Jervis emails to support his position. He submits that in those emails, Bay mentions “money owner” but not Alan, and that he lent money to Brendan. According to Alan, this showed that Bay was lending money to and helping Brendan, not Alan.77Foot Note 77×DCS at paras 45–48. 58 In addition, Alan submitted that Bay did not act on the representations for the following reasons:78Foot Note 78×DCS at paras 46–62. (a) Bay had formed his own views after doing his own checks. Bay also provided advice directly to Brendan. For example: (i) In Bay’s email of 17 November 2013 to Jervis, Bay said “I suggested to Brendan to check with MAS …”79Foot Note 79×ACB at page 172.(ii) In a text message from Bay to Alan dated 1 November 2013, Bay gave suggestions on certain issues relating to the withdrawal of money from Cisco.80Foot Note 80×2AB at pages 2221–2223.(iii) Bay carried out his own checks by visiting 31 Balmoral Road to survey Brendan’s purported inheritance properties and to take photographs. (b) Bay formed outlandish views that government agencies like the CAD, the Monetary Authority of Singapore (“MAS”) and the Inland Revenue Authority of Singapore (“IRAS”) were unreasonable and were like “mafia”.81Foot Note 81×ACB at page 197–198. 59 In my judgment, the 13 September 2012 Agreement and 27 July 2014 Agreement which Alan signed, constituted concrete evidence that Alan acknowledged that he (and not just Brendan) took loans from Bay. While there was a slight difference in the amount Bay claimed for fraudulent misrepresentation (S$2,604,070.60) and the amount set out in the 27 July 2014 Agreement (S$2,575,302.00), it did not negate Alan’s signed acknowledgement in the 27 July 2014 Agreement that loans had been made by Bay to Alan. 60 While Alan sought to show using the Jervis emails that Bay did not consider Alan to be the recipient of the loans, these emails from Bay to his son were not intended to be a record of Bay’s legal position, in contrast to the 13 September 2012 Agreement and the 27 July 2014 Agreement. Thus, while the Jervis emails would be relevant in testing the consistency of Bay’s position(s), it would not be appropriate to examine them in the same manner and with the same rigor, as a contractual document. In any event, some of the Jervis emails also mentioned Alan together with Brendan (see [23(a)] above). Hence, the fact that Bay mentioned Brendan directly in some of the Jervis emails was, in my view, inconclusive. 61 Furthermore, the fact that the Jervis emails and text messages (described at [58(a)] above) show Bay providing suggestions to Brendan, did not, without more, show that Bay had not acted or relied on Alan’s representations in providing the loans. I accepted Bay’s evidence that when he made the loans, and after he made the loans, he wanted to take steps to protect his own interests,82Foot Note 82×Transcript, 27 September 2022, p 80 ln 5 to p 81 ln 22; p 83 ln 25 to p 86 line 18.ie, by making suggestions to Brendan. That is not incompatible with Bay having acted or relied upon Alan’s representations in advancing loans to Alan. 62 In addition, there were Alan’s WhatsApp messages (see [54(d)] above). Alan said that he had sent those messages not because he owed money to Bay, but because he felt bad that Bay had made the loans to Brendan because of the representations conveyed through Alan.83Foot Note 83×Transcript, 4 October 2022, p 102 ln 10-12.The WhatsApp messages showed Alan saying that he must return Bay the money. It was unlikely that Alan would have felt the need to acknowledge that he would return the money to Bay, if the loans were, as he claimed, advanced from Bay to Brendan. Moreover, even if Alan’s explanation were accepted, implicit in Alan’s explanation was an acknowledgement that Bay had acted on Alan’s representations to provide loans. 63 In summary, taking into consideration Bay’s bank statements showing his withdrawals, the evidence of the amount that Alan transferred to Brendan’s accounts, the 13 September 2012 Agreement, the 27 July 2014 Agreement, the Jervis emails and Alan’s WhatsApp messages, I found that Bay had acted upon Alan’s false statements in providing loans to Alan.",
        "Bay has suffered damage": "64 Bay submitted that he suffered damage in the sum of S$2,604,070.60, being the amount that he loaned to Alan pursuant to the fraudulent misrepresentation and which remains unpaid. He also submitted that as he had to borrow money to make loans to Alan, he had incurred interest expenses in the sum of S$761,243.00 plus S$1,425.28 per month from July 2021.84Foot Note 84×SOC at para 46; PCS at Annex B; Bay AEIC at paras 126–127, BLP-28. 65 Alan’s position was that it was Brendan who had caused the damage, if any, to Bay. The Statement of Facts inPublic Prosecutor v Don Brendan Robert[2016] SGDC 208 (“Brendan’s SOF”) indicates at para 16 that Alan transferred S$2,182,926 of Bay’s money to Brendan.85Foot Note 85×ACB at page 487.In addition, Alan highlighted that the evidence produced by Bay showed that the interest that he had incurred were incurred in respect of both the loans and personal expenses, and Bay had not shown which parts of the interest expenses were only related to the loans.86Foot Note 86×DCS at paras 73 and 85. 66 Bay accepted that his claim for interest expenses included both personal expenses and those relating to the loan. He explained that he did this as it would otherwise be too complicated to break down the interest expenses at a more detailed level.87Foot Note 87×Transcript, 29 September 2022, p 30 ln 13 to p 47 ln 7; see especially p 39 ln 11–14. 67 As I found that the loans were made from Bay (see [59] above), it followed that Bay had suffered damages in the amount of S$2,604,070.60 which he loaned to Alan and which remains unpaid. 68 Bay accepted that the interest expenses he incurred included interest on overdraft drawn for personal expenses, and he was not able to set out with any precision the interest incurred only in relation to the loans he took to lend money to Alan. I therefore found that he could not satisfactorily prove the extent of damages he had suffered arising from the interest expenses he incurred, which could be attributed to Alan’s representations.",
        "Representations made with knowledge that it is false or in absence of genuine belief that it is true": "69 Bay referred toWeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Anna Wee”) which cited at [35] the following observation made inRaiffeisenZentralbank Osterreich AG v Archer Daniels Midland Co[2007] 1 SLR(R) 196 at [40]: “Dishonesty is the touchstone which distinguishes fraudulent misrepresentation from other forms of misrepresentation.” [emphasis in original omitted] Bay also referred toDerry v Peek(1889) 14 App Cas 337 where it was held at 374 that fraud is proved when it is shown that a false representation has been made: (a) knowingly; (b) without belief in its truth; or (c) recklessly, careless whether it be true or false. 70 Bay submitted that Alan had made verbal representations that demonstrated that Alan had personal knowledge of the matters he represented to Bay, or that he was present at the relevant meetings or locations, even though Alan knew that the matters represented were false, and the meetings at which Alan was purportedly present did not take place.88Foot Note 88×PCS at para 68. 71 For example, Alan represented to Bay that A&G had set up an account with United Overseas Bank (“UOB”) into which Bay could deposit money and that Mr Rhys Goh would be the only person who would be able to access the account. This statement was also set out in the 27 July 2014 Agreement.89Foot Note 89×Bay AEIC at page 492.However, this statement turned out to be untrue. In reality, that account belonged to Alan. Alan had also never engaged A&G. 72 Bay submitted that Alan’s SMSes also contained representations that he had personal knowledge of the matters he represented or communicated to Bay, or that he was present at the relevant meetings or locations. The contents of several of Alan’s SMSes are reproduced below: (a) SMS received on 12 October 2013: “Morning Mr bay, mr chua juz called us 3 inspectors already reached Uob n told us to wait for his updated [sic].”90Foot Note 90×Bay AEIC at page 442.(b) SMS received on 17 October 2013: “Now we r at boon tat street to meet Mr chia. He say Yday UOB got informed that today cash will leave their bank to Cisco but no indicated actual Time.”91Foot Note 91×Bay AEIC at page 443.(c) SMS received on 18 October 2013: “Morning Mr bay. We r now at Dover. Brendan said Yday eve at least Cisco move some fund from Uob n today 10am will continue the balance. Today is Friday. Hopefully Uob don’t delay. AIG come at 11am.”92Foot Note 92×Bay AEIC at page 444.(d) SMS received on 25 October 2013: “Mr bay, Yday at woodland terrible. We r now meeting lawyer c can help of $7500”93Foot Note 93×Bay AEIC at page 446.(e) SMS received on 11 November 2013: “Morning Mr bay, m now at Nuh waiting for Brendan go to meet lawyer to find out Saturday details at inland revenue.”94Foot Note 94×Bay AEIC at page 448.(f) SMS received on 27 June 2014: “We r keep scolding. Banks so slow n here government side also the same. All component already standby at Parliament House so reality must action that all.”95Foot Note 95×Bay AEIC at page 455. 73 However, these events or meetings never took place. Alan did not make any attempts to verify the truth of his representations directly with the alleged agencies or banks, even though he could have. Alan had not set out any grounds, details, description, or documents to evidence his genuine belief in the truth of the representations that he made. 74 Bay further highlighted that Alan only had evidence to prove that he deposited S$2,382,786 into Brendan’s account.96Foot Note 96×PCS at Annex D.In this regard, Alan claimed to have loaned Brendan S$205,710,97Foot Note 97×Alan AEIC at para 99.but Bay contended that Alan could only evidence with receipts that he had lent S$160,440 to Brendan personally (see [27] above). Bay claimed that he had lent Alan a total of S$2,604,070.60 while Alan claimed that Bay had loaned him a total of S$2,575,302.40. That meant that even by Alan’s records, he could not account for S$352,956.40. Bay submitted that Alan took the remainder for himself. This would have more than compensated Alan for the sum of S$160,440 that Alan personally loaned to Brendan which can be evidenced by receipts. Even if Alan were to be believed that he had personally lent S$205,710 (rather than S$160,440) to Brendan, that would mean that only S$2,177,076 of the amount transferred to Brendan was attributable to money obtained from Bay. This would leave S$398,226.40 unaccounted for (S$2,575,302.40 less S$2,177,076), which would have more than compensated Alan for the sum of S$205,710 that Alan claimed to have personally loaned to Brendan. Bay submitted that Alan would therefore have been recklessly careless of the truth of the representations that he made, as Alan stood to gain regardless of whether the representations were true.98Foot Note 98×PCS at paras 77. 75 Alan’s position was that he honestly believed that Brendan’s representations were true, and had no knowledge that they were false and/or had reasonable ground to believe that they were untrue. Alan disputed the authenticity and truth of the contents of Alan’s SMSes.99Foot Note 99×DCS at para 155. 76 In contending that he had genuinely believed Brendan’s representations, Alan relied on Brendan’s SOF,100Foot Note 100×DCS at paras 88–98.which Brendan admitted to without qualification. The SOF states at para 14: “Believing that the accused [ie, Brendan] was the beneficiary of an inheritance which had been seized by the Government of Singapore … Alan transferred to UOB account … approximately S$175,060 comprising his own monies and loans from his own friends and relatives between late August to end May 2012.”101Foot Note 101×ACB at pages 486–487. 77 Following a review of the evidence, I found that Alan’s representations had been made in the absence of any genuine belief that they were true. 78 First, I found that Brendan’s SOF had no bearing on the evidence before the court in this suit. Brendan’s SOF related to the charges brought against Brendan for cheating. Moreover, the facts in Brendan’s SOF were not the subject of an eventual inquiry in court, having been admitted to without qualification by Brendan. 79 In any event, Alan’s claim that he was a victim was severely weakened by his inability to show that he had used a substantial amount of his own money in the loan that he allegedly provided to Brendan, as compared to money from his friends and relatives which he said he drew on for his loan to Brendan. 80 Second, the evidence shows that Alan made verbal representations, for which he had no basis for believing. These representations include: (a) Alan’s representation that A&G had set up an account with UOB into which Bay could deposit money, and that Mr Rhys Goh from A&G was the only person who could access that account. As this was Alan’s personal account, he would have known that this was not true. (b) Alan’s claim that he had earned a commission of US$5m from a gold deal and that this commission was seized together with money belonging to Brendan, totalling US$50m. No such money or Seized Sum existed. 81 Third, Alan’s SMSes contained specific representations from him to Bay which he would have known were clearly false. Alan said he was with Brendan meeting with persons who did not exist, for example, senior bankers or lawyers.102Foot Note 102×Bay AEIC at pages 443, 446–447. 82 Fourth, while Alan presented himself as a victim of Brendan, Alan was, on his own evidence, close to Brendan and had a working relationship with Brendan. Alan informed the police that he was Brendan’s “money partner” in his handwritten statements to the police.103Foot Note 103×Alan AEIC at pages 142, 144.He denied on the stand that he was Brendan’s “money partner”,104Foot Note 104×Transcript, 30 September 2022, p 30 ln 17-–21.but he did not provide any explanation for why he informed the police otherwise. 83 Fifth, Alan did not provide any basis for believing the truth of the representations he made to Bay. He made representations about receiving information from or having meetings with representatives of government agencies, banks and law firms. It would have been well within Alan’s ability to verify the truth of these representations. It would have been plain to Alan whether he and Brendan in fact received any information or convened any meetings, as Alan represented in his SMSes. Moreover, on Alan’s own account, some US$5m of his own money were part of the Seized Sum. He would have had an incentive to verify the truth of the information he purportedly received from Brendan. However, despite having both the opportunity and the incentive to verify the truth of his own representations, Alan did not do so. 84 Sixth, as set out above at [74], Alan had not provided any satisfactory explanation for what has happened to the sum of around S$352,956.40 out of the total amount loaned to him by Bay (using the figure Alan set out in his spreadsheet of S$2,575,302.40 as the amount which Bay loaned to Alan). There was no evidence that this sum of S$352,956.40 had been transferred to Brendan’s accounts, and the natural inference was that it remained with Alan. Alan personally benefitted from the loans and thus had every incentive to continue perpetuating the false representations. 85 Seventh, in addition to the above, I found Alan to be an uncredible witness: (a) Alan gave incredible answers on the stand. For example, when confronted with evidence that he had sent messages to Bay indicating that he was meeting people who did not exist, such as one “Mr Chua” or lawyers, he maintained that he did have such meetings, but that he had met a fake Mr Chua, as well as fake lawyers.105Foot Note 105×Transcript, 30 September 2022, p 148 ln 1 to p 150 ln 23.However, Alan did not mention having met fake persons in any of his affidavits. (b) Alan attempted to maintain his positions in an extremely unbelievable manner, when confronted with documentary evidence that contradicted his evidence. I set out one example as illustration. (i) Alan maintained on the stand that he did not know Brendan was an undischarged bankrupt until he was in the custody of the CAD around August 2014 and did not know that Brendan was a bankrupt earlier in July 2013.106Foot Note 106×Transcript, 4 October 2022, p 195 ln 18-20; p 212 ln 19-22. (ii) He testified on the stand that he knew what a bankrupt was and explained it.107Foot Note 107×Transcript, 4 October 2022, p 195 ln 10 to 17. (iii) He also accepted that the table at page 166 of his AEIC was prepared by him.108Foot Note 108×Transcript, 4 October 2022, p 196 ln 15 to p 197 ln 1. (iv) At items serial number 480 and 481 of that table, he wrote in the “Description” column that two loans from Bay on 15 July 2013 and 17 July 2013 were for “Brendan Statutory Bankrupt”.109Foot Note 109×Alan AEIC at page 166. (v) Alan nevertheless maintained on the stand that he did not know at the time of those loans, that Brendan was a bankrupt, despite him writing down in his own table “Brendan Statutory Bankrupt”.110Foot Note 110×Transcript, 4 October 2022, p 197 ln 4 to p 198 ln 1. 86 In the DCS, it was submitted that the above took place because Alan’s ability to understand matters was “constrained”.111Foot Note 111×DCS at paras 23–27.As an example of Alan’s constrained ability to understand matters, reference was made to Alan being slow to understand that he could leave the stand after he gave his evidence. I did not find the two to be even remotely related. The above exchange speaks for itself. I did not accept Alan’s highly contrived explanation that he had written “Brendan Statutory Bankrupt” in his own table without realising that Brendan was a bankrupt because there were “too many things already”.112Foot Note 112×Transcript, 4 October 2022, p 197 ln 22 to ln 25.",
        "Recission or damages payable": "87 Following from the above, I found that Bay was entitled to the recission of the loans that he had made to Alan. He was also alternatively entitled to damages in the amount of the loans that he had made,ie, S$2,604,070.60. As Bay was not able to clarify what portion of his claimed interest expenses of S$761,243.00 plus S$1,425.28 per month from July 2021 were incurred in respect of his personal expenses as opposed to the loan, and no evidential basis upon which I could award him a lower sum for interest expenses was advanced, I did not allow his claim for the interest expenses.",
        "Section 2(1) of the Misrepresentation Act 1967": "88 Bay claimed in the alternative under s 2(1) of the MRA, which provides: Damages for misrepresentation 2.—(1)  Where a person has entered into a contract after a misrepresentation has been made to him by another party thereto and as a result thereof he has suffered loss, then, if the person making the misrepresentation would be liable to damages in respect thereof had the misrepresentation been made fraudulently, that person shall be so liable notwithstanding that the misrepresentation was not made fraudulently, unless he proves that he had reasonable ground to believe and did believe up to the time the contract was made that the facts represented were true. 89 Under s 2(1) of the MRA, Bay needed to prove that: (a) he had entered into a contract after a misrepresentation has been made to him by Alan; (b) he had suffered loss as a result; and (c) Alan did not have reasonable ground to believe that the facts represented were true. 90 Bay citedRBC Properties Pte Ltd vDefu Furniture Pte Ltd[2015] 1 SLR 997 (“RBC”), where the court held at [70] that whether the representor had reasonable grounds for believing that his representations were true must be assessed objectively, and the court must assess the reasonableness of the representor’s alleged belief in the context of both the representation(s) made and the circumstances of the case. The court endorsed the observation made in John Cartwright,Misrepresentation, Mistake and Non-Disclosure(Sweet & Maxwell, 3rd ed, 2012) at para 7-25 that the representor must show he had reasonable grounds to believe that the statement was true and the question was whether a reasonable person, given the circumstances of the case, could have “deduced the truth of the statement from the information available to [him]”. A representor would also be liable if he was wilfully blind to obvious sources of information that would have revealed the truth to him (RBCat [71]). Moreover, where there were “conflicting sources of information” to which the representor had recourse, the touchstone was whether he possessed objectively reasonable reasons to prefer one source over another (RBCat [77]). 91 Alan submitted that s 2(1) of the MRA “refers to a person entering a contract after a misrepresentation has been made and the representor believing up to the time the contract was made that the facts represented were true” [emphasis in original omitted].113Foot Note 113×DCS at para 100.In this case, Bay only pleaded that the 27 July 2014 Agreement was a contract. There were no other contracts pleaded. However, the 27 July 2014 Agreement was created after all the misrepresentations were made and the last loan was extended on 25 June 2014. Accordingly, Alan submitted that Bay did not have a cause of action under s 2(1) of the MRA in respect of the 27 July 2014 Agreement.114Foot Note 114×DCS at paras 100–101. 92 I did not find merit in this submission. While it was true that Bay only sought contractual enforcement of the 27 July 2014 Agreement, that was not the only contract that he pleaded. He had also pleaded and provided evidence in his affidavits of the loans he had made during the material period, including the dates the loans were made and the quantum of the loans. It was not disputed that these loans were advanced pursuant to representations made by Alan. Alan’s defence was that he was just a mouthpiece for Brendan. It was not suggested by Alan that these loans did not constitute contractual agreements. 93 Even if I accepted that Bay did not clearly plead that these loans were contracts, it was clear from the various references to the loans in the Defence, which Alan said were made by Bay to Brendan, that Alan was well aware that Bay treated the loans made as contracts and was claiming for their recission. Therefore, even if Bay did not explicitly plead that the loans were contracts, Brendan was not in any case taken by surprise and did not suffer any prejudice (seeSongJianbo v Sunmax Global Capital Fund 1 Pte Ltd and another[2021] SGHC 217 at [69]). 94 Consequently, I found that the loans specified by Bay were contracts that were entered into pursuant to the misrepresentations conveyed by Alan to Bay, and s 2(1) of the MRA was thus applicable in the present case. For the reasons explained above (at [26]–[47]), I found that the misrepresentations conveyed by Alan to Bay had been adopted by Alan. 95 I have dealt above with the losses suffered by Bay as a result of the misrepresentations (at [64]–[68]). 96 I have also found above that Alan’s representations were made in the absence of any genuine belief that they were true (at [77]–[86]). For the same reasons, I also found that Alan did not have reasonable grounds to believe that the facts represented were true. 97 Pursuant to this, Bay was also entitled to damages pursuant to s 2(1) of the MRA, in the same amount set out above at [87] in respect of his claim for fraudulent misrepresentation.",
        "Negligent misrepresentation": "98 Bay also brought, in the alternative, a claim for negligent misrepresentation. 99 InMaHongjin v Sim Eng Tong[2021] SGHC 84  (“MaHongjin (HC)”) the court observed at [20] that in a claim for negligent misrepresentation, the plaintiff must prove the following: (a) the defendant made a false representation of fact; (b) the representation induced the plaintiff’s actual reliance; (c) the defendant owed the plaintiff a duty to take reasonable care in making the representation; (d) the defendant breached that duty of care; and (e) the breach caused damage to the plaintiff. The elements common to claims in fraudulent misrepresentation and negligent misrepresentation are that there must be a false representation of fact, inducement and actual reliance (MaHongjin (HC)at [21]). 100 The common elements have been dealt with above under my analysis for fraudulent misrepresentation, as has the issue of whether the breach (if there was any) had caused Bay damage. The outstanding issues in relation to Bay’s claim in negligent misrepresentation were whether Alan owed Bay a duty of care and if so, whether Alan breached that duty. 101 InSpandeckEngineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”), the Court of Appeal laid down the test to determine the existence of a duty of care in all claims arising out of negligence regardless of the nature of the damage caused (the “Spandecktest”). This is a two-stage test comprising of, first, proximity and, second, policy considerations, which are together preceded by the threshold question of factual foreseeability (Spandeckat [73] and [115]). 102 Under the first stage of theSpandecktest, there must be sufficient legal proximity between the plaintiff and defendant for a duty of care to arise. The focus is on the closeness of the relationship between the parties, including physical, circumstantial and causal proximity, supported by the twin criteria of voluntary assumption of responsibility and reliance (Spandeckat [77]). At [81], the court held that “[w]here A voluntarily assumes responsibility for his acts or omissions towards B, and B relies on it, it is only fair and just that the law should hold A liable for negligence in causing economic loss or physical damage to B”. 103 Where there is a positive answer to the threshold question of factual foreseeability and the first stage of proximity is satisfied, aprima facieduty of care would arise. Policy considerations should then be applied to the factual matrix to determine whether or not to negate thisprima facieduty. Relevant policy considerations would include, for instance, the presence of a contractual matrix which clearly defines the rights and liabilities of the parties and their relative bargaining positions (Spandeckat [83]).",
        "Whether Alan owed Bay a duty of care and if so if he breached it": "104 Bay submitted that Alan owed Bay a duty of care. In particular, Alan had informed Bay that there was a non-disclosure agreement (the “NDA”) that the CAD and the MAS required Alan and Brendan to sign. Alan further represented that if the NDA was breached, the CAD and the MAS would allegedly cancel the agreement to release the Seized Sum. As Bay did not want to risk breaching the NDA and scuppering the release of the Seized Sum (which he had loaned money to Alan to secure), Bay resorted to obtaining information only from Alan, whom he trusted at that point in time. Alan would have known this. Moreover, Alan told the police he was Brendan’s “money partner”. On the other hand, Bay did not know Brendan and had not met him. Bay only spoke with Brendan on four occasions.115Foot Note 115×Bay AEIC at para 17.As such, Bay could not verify the truth of Alan’s representations with Brendan or other third parties. Alan’s constant SMS updates to Bay about the attempts to secure the release of the Seized Sum show that Alan was aware that Bay was reliant on him for information.116Foot Note 116×PCS at para 99. 105 Bay argued that Alan’s actions showed that Alan had assumed responsibility for his representations to Bay. In Alan’s WhatsApp messages, he took responsibility for the representations he made to Bay. Even in Alan’s AEIC, he said that he “felt bad and morally culpable for getting Bay caught up in Brendan’s scam and [Alan] thought that [he] should make reparations for that”.117Foot Note 117×Alan AEIC at para 227.This, Bay argued, also indicated that Alan had assumed responsibility to take reasonable care in making the oral representations he did to Bay. In the circumstances, Bay submitted that Alan owed a duty of care to Bay.118Foot Note 118×PCS at para 100. 106 Finally, Bay contended that Alan breached the duty of care that he owed to Bay. He did not depose to any attempts to verify the truth of the verbal representations that he had made to Bay, even though he could have done so given that he was supposedly a party to the NDA. This was in spite of the fact that Alan had direct access to the information that Brendan gave him. This was also a step that one would reasonably expect Alan to take given that Alan had purportedly borrowed money from friends and family to loan to Brendan, which remained unpaid.119Foot Note 119×PCS at paras 102–104. 107 Alan’s defence was that it was Brendan who represented to Alan that there was an alleged NDA. He honestly believed it to be true. There was no duty of care between Alan and Bay and even if there was, Alan did not breach it. Alan submitted that it was not foreseeable that Brendan was a scammer and that Alan would be his victim. Bay knew that all the information was given by Brendan, not Alan. In the email dated 12 July 2013 from Brendan that was forwarded by Alan to Bay, Alan did not make assurances to Bay but merely forwarded the email. Bay had spoken to and received assurances from Brendan. Furthermore, Bay had carried out his own checks and formed his own views, but decided to continue lending money to Brendan in the hope of recovering his loans. Finally, Alan submitted that policy considerations militated against holding fellow victims of a scam responsible towards each other.120Foot Note 120×DCS at paras 107–117. 108 I found that Alan owed a duty of care to Bay. I deal first with the threshold requirement of factual foreseeability. InSpandeck, the court rejected at [89] the submission that factual foreseeability was not satisfied because the respondent could not have foreseen thekind of lossessuffered by the appellant. The question was therefore not whether Alan could have foreseen that Brendan was a scammer – the test of factual foreseeability does not require the specifickindof loss to be foreseeable, much less preciselyhowthe loss would materialise. Instead, the question was whether Alan could have foreseen that Bay would suffer loss if Alan did not take reasonable care in ensuring the accuracy of his representations to Bay. I found that it would have been reasonably foreseeable to Alan that if the representations Alan conveyed to Bay were false, Bay may suffer loss because the money which Bay loaned to Alan in reliance on Alan’s representations (which was in turn loaned to Brendan) may be improperly dealt with or misappropriated. 109 There was also sufficient legal proximity for the duty of care to arise. Alan was the one who informed Bay of the non-existent NDA. This resulted in Bay hesitating to check with third parties out of fear that doing so would jeopardise the recovery of the Seized Sum. Bay did not know Brendan personally and had never met him in person. In the circumstances, I found that Alan voluntarily assumed responsibility for the representations he made to Bay. He would have known that Bay would rely on his information. In my view, Alan’s SMS updates to Bay about the alleged attempts to release the Seized Sum showed that Alan was aware of Bay’s reliance on him for information. Alan’s SMSes also showed that he felt responsible for the representations he made to Bay. 110 Alan also submitted that as a matter of policy there should not be a duty of care imposed on fellow victims of scams as it would be unfair and would lead a flood of litigation. However, Alan had not proven in this case that he was a victim of Brendan, in the same manner in which Bay was a victim of Alan’s representations. In any event, I have found above that Alan had opportunities to verify Brendan’s representations but did not, and he adopted Brendan’s representations as his own. He assumed responsibility for them and engendered Bay’s reliance. In these circumstances, it would not be contrary to public policy to expect Alan to take reasonable care when making those representations to Bay. In my view, the imposition of a duty of care in the particular circumstances of this case would not open the floodgates of litigation. 111 As the loss that Bay suffered was factually foreseeable, and both limbs of theSpandecktest are satisfied, I found that Alan owed Bay a duty to take reasonable care in making the various representations which he did to Bay. I also found that Alan breached the duty of care that he owed to Bay. Given that: (1) Alan was purportedly a party to the NDA; (2) Alan was much closer to Brendan than Bay was; and (3) according to Alan’s SMSes, Alan and Brendan allegedly met up on several occasions to attempt to release the Seized Sum, Alan was clearly in a position to verify the truth of the representations that he had made to Bay. However, he did not provide evidence of any attempts to do so. 112 I therefore found that Alan was liable to Bay for negligent misrepresentation.",
        "Breach of 27 July 2014 Agreement": "113 Bay also claimed, in the alternative, that Alan had breached the 27 July 2014 Agreement. 114 The 27 July 2014 Agreement contained,inter alia, the following terms:121Foot Note 121×Bay AEIC at pages 491–492 (BLP-14). (a) An acknowledgement that Bay had granted to Alan “personal/friendly loans by way of cash cheques or cash either withdrawn from [Bay’s] bank accounts or borrowed from the banks and credit cards’ accounts as and when required/requested by [Alan] amounting to a total ofS$2,575,302.00as at 25 June 2014” [emphasis in original]. (b) Alan “promise[s] to repay all the outstanding loans irrespective of whether or not [he has] successfully retrieve/received [his] monies currently being stored in CISCO, HQ and Parliament House or withheld by the Banks under the instructions of CAD previously.” (c) If Alan fails to fully repay all outstanding loans by 2 August 2014, or such other extended date Bay grants as he deems fit at his sole discretion in writing, Alan shall bear “all the legal fees (including Clients and Solicitors fees), debt collector fees and other expenses such as administrative costs and bank charges incurred by Bay”. 115 Bay disagreed with Alan’s submission that the 27 July 2014 Agreement was a sham document. He submitted that this was an afterthought. After Bay’s solicitors issued the letter of demand to Alan dated 18 June 2020, Alan did not deny owing Bay money in Alan’s WhatsApp messages and instead promised to repay Bay. In addition, Bay submitted that the further element of deceit of third parties, which was required to establish that the agreement was a sham document, was missing (citingYeHuishi Rachel v Ng Ke Ming Jerry[2021] SGHC 250).122Foot Note 122×PCS at paras 119–122. 116 Bay further submitted that Alan’s conduct after the signing of the 27 July 2014 Agreement contradicted Alan’s assertion that the agreement was a sham document. In particular, in several of Alan’s WhatsApp messages, Alan admitted to being indebted to Bay and promised to repay Bay. Those messages are reproduced below: (a) In a message sent on 11 August 2014, Alan admitted that the total sum of money Bay transferred to him was S$2,529,656.00, and informed Bay that he “told [his] wife” that he “must sell the house to return” Bay the money.123Foot Note 123×Bay AEIC at page 1215 (BLP-25).(b) In a message sent on 23 June 2020, Alan shared that he had been “searching a way to find the money” to “return to [Bay and the] creditors.124Foot Note 124×2AB at page 2520.(c) In a message sent on 23 June 2020, Alan shared that he was “struggling hard to confirm the money” to be obtained from a project in Indonesia so that he can “return [Bay] back the money”.125Foot Note 125×Bay AEIC at page 1216 (BLP-25). 117 Bay submitted he had provided consideration for the 27 July 2014 Agreement through his forbearance from suing. In particular, he submitted that in exchange for Alan's promise to repay the sum of S$2,575,302 by 2 August 2014, he had agreed not to commence legal proceedings or file any police report against Alan unless Alan failed to repay that amount by the stipulated date. Bay submitted that he had adhered to his promise as he only filed a police report against Alan on 26 November 2014 and only commenced this suit on 17 June 2020.126Foot Note 126×PCS at paras 125–130. 118 Bay further submitted that there was an express request for Bay not to commence legal proceedings or file a police report. This could be seen from Alan agreeing to bear the legal fees, debt collector fees and other expenses. Bay referred to Alan’s own evidence, if it were to be believed, that Alan expected to receive a cashier’s order from Oversea-Chinese Banking Corporation on 1 August 2014 for the sum of S$19.875m.127Foot Note 127×Alan AEIC at para 165, page 391.It was thus reasonable to surmise that Alan would have wanted Bay to hold off on commencing any legal proceedings until after the money had been received, so that Alan could repay the debt he owed. At the least, this should be interpreted as an implied request for Bay to forbear from commencing legal proceedings.128Foot Note 128×PCS at paras 126–127. 119 Alan submitted that the 27 July 2014 Agreement was a sham document created to give Bay’s ex-wife the impression that Bay loaned money to his friend. This was evidenced by Bay’s email to Alan dated 5 July 2014.129Foot Note 129×DCS at paras 120–127.Alan also submitted that the parties had not intended to create legal relations through the 27 July 2014 Agreement.130Foot Note 130×DCS at paras 128–131. 120 Alan also contended that the 27 July 2014 Agreement was not supported by consideration. Any forbearance on Bay’s part did not constitute consideration as such forbearance was not given by Bay at the request of Alan. The court inGay Choon Ing vLoh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332 (“Gay Choon Ing”) held at [66] that “consideration must always move from the promisee to the promisor”. Alan also relied on the Court of Appeal’s holding inGay Choon Ingat [82] (cited inMaHongjin v SCP Holding Pte Ltd[2021] 1 SLR 304 at [48]):131Foot Note 131×DCS at paras 132–136. … [T]he element of request is necessary in order to establish a link between the parties concerned. So, for example, if the promisee chooses, of his or her own volition (and without more), to confer a benefit on the promisor, this will not constitute sufficient consideration in the eyes of the law. … 121 Alan submitted that consideration did not move from Bay to Alan. The purported forbearance to sue or make a police report was not conferred on Alan at his request. Bay did not even inform Alan of the purported forbearance.  There was no express mention in the 27 July 2014 Agreement that Alan’s promise to repay the loans was in exchange for Bay’s forbearance. There was also no evidence of any request on Alan’s part for Bay’s forbearance.132Foot Note 132×DCS at paras 138–147. 122 I have set out above (at [42]–[45]) my findings on Alan’s submissions that (a) the 27 July 2014 Agreement was a sham document; and (b) that Alan did not have an intention to create legal intentions. To briefly recapitulate, I found that Alan had not shown that the 27 July 2014 Agreement was a sham document or that Alan lacked the intention to create legal intentions. 123 In relation to consideration, Alan testified that he signed the 27 July 2014 Agreement to avoid Bay’s ex-wife going to the police or otherwise affecting the transaction,133Foot Note 133×Transcript, 4 October 2022, p 116 ln 23 to p 117 ln 10.and not because he wanted to obtain Bay’s forbearance. There was no evidence to suggest that there was an implied request on Alan’s part for Bay’s forbearance. Bay referred to the clause in the 27 July 2014 Agreement whereby Alan agreed to bear legal fees and other administrative expenses if Alan did not repay the outstanding amount by 2 August 2014. However, all that the clause showed was that Alan would be contractually obliged to indemnify Bay’s legal costs if Alan did not repay Bay by the stipulated date. It did not prevent Bay from commencing legal proceedings or making a police report against Alan. That clause thus did not form a sufficient basis to conclude that there was an implied request from Alan for Bay’s forbearance. 124 I did not find there to be sufficient evidence of an express or implied request from Alan for Bay’s forbearance. Bay referred to Alan’s evidence of an incoming sum of S$19.875m and that Alan would not have wanted this to be affected (see [118] above). While this might have hinted at the possibility that Alan had an incentive for Bay not to sue or make a police report against Alan, it did not translate into evidence of an express, or even an implied, request for forbearance from Alan. 125 In addition, Bay did not suggest in his affidavits that Alan had specifically or impliedly requested him to forbear from commencing legal proceedings or making a police report against Alan.134Foot Note 134×Bay AEIC at paras 72–83.Moreover, while it was put to Alan during cross-examination that there was consideration in the form of forbearance on Bay’s part, it was not put to Alan that Alan had made such a request for forbearance either expressly or impliedly.135Foot Note 135×Transcript, 4 October 2022, p 105 ln 20 to p 116 ln 22. 126 Following from the above, I found that while Alan had signed the 27 July 2014 Agreement and acknowledged the statements therein, Bay was not entitled to enforce the 27 July 2014 Agreement for want of consideration.",
        "Conclusion": "127 For the reasons above, I found that Bay succeeded in his claims in (a) fraudulent misrepresentation; (b) misrepresentation under s 2(1) of the MRA; and (c) negligent misrepresentation. Bay was consequently entitled to the recission of the loans that he had made to Alan or to damages in the amount of the loans that he had made, of S$2,604,070.60. Bay was also entitled to interest on the judgment sum, at the rate of 5.33% per annum pursuant to s 12(1) of the Civil Law Act 1909 (2020 Rev Ed), from the date of service of the writ till the date of judgment. 128 I awarded costs to Bay in the amount of S$165,000 for party-and-party costs, plus disbursements in the amount of S$34,168.25.  Kwek Mean LuckJudge of the High Court Muhammad Imran bin Abdul Rahim, Yap Wei Xuan Mendel and Yuan Jingjie (Eldan Law LLP) for the plaintiff; Kang Kok Boon Favian (Adelphi Law Chambers LLC) for the defendant."
    }
}