{
    "case_title": "Deniyal bin Kamis vMapo Engineering Pte Ltd and others",
    "ncitation": "[2023] SGHC 183",
    "coram": "Philip Jeyaretnam J",
    "sections": {
        "Introduction": "1 Few long-term relationships, such as that between two shareholders working together in a private company, start without a degree of trust or confidence between them. The existence of such a bond does not of itself make the company a quasi-partnership, nor add anything to the principle that the majority in a company must treat the minority with commercial fairness in the light of the commercial agreement between the parties or face potential redress under s 216 of the Companies Act (Cap 50, 2006 Rev Ed) (the “Companies Act”). 2 The relationship between parties is nonetheless relevant to determining both the ambit of the commercial agreement and whether there has been commercial unfairness. This is because the word “commercial” not only signals reference to the standards of fair-minded businessmen, but also extends the field of inquiry beyond formal agreements and constitutional documents to informal agreements and even shared understandings. A close personal relationship is more likely to entail or generate shared informal or even unspoken understandings that constrain the exercise of majority rights. 3 In this action, the plaintiff, Mr Deniyal bin Kamis (“Mr Deniyal”), seeks relief under s 216 of the Companies Act against the third defendant, Mr Niew Bock Leng (“Mr Niew”). Both men are shareholders and directors of the first and second defendants, which are nominal defendants that did not participate in the trial. 4 Mr Niew made Mr Deniyal a director and shareholder because Mr Niew was confident that Mr Deniyal would run operations effectively. Mr Deniyal, for his part, trusted Mr Niew to such a degree that Mr Deniyal did little or nothing to fulfil his own directors’ duty of oversight over the administration of the companies. In a sense, Mr Deniyal chose to be in the dark. It was only much later that he became suspicious and concerned about what Mr Niew was doing. To some extent, Mr Deniyal’s allegations in this action have been stabs in the dark and remain unproven. However, I find that two critical allegations have been made out. One is that Mr Niew on occasion used the machinery of the companies to take the benefit of dividends and directors’ fees that should have been paid to Mr Deniyal. I do not accept Mr Niew’s defence that this was lawfully done by way of set-off against personal loans made by Mr Niew to Mr Deniyal. Secondly, after the men fell out, Mr Niew caused the companies to pay him salary that had previously been borne by companies in which Mr Deniyal had no interest, making this change precisely to prejudice Mr Deniyal. 5 Accordingly, I grant Mr Deniyal the relief of a share buy-out on terms that I will elaborate later, after I have explained how I come to my conclusions.",
        "Facts": "",
        "The parties": "6 The precise nature of the relationship between Mr Deniyal and Mr Niew is the subject of much contention. I therefore start by describing the two corporate defendants. The first and second defendants 7 The first defendant, Mapo Engineering Pte Ltd (“MEPL”), was incorporated on 13 August 2003. MEPL is in the business of ship repair and servicing. Mr Deniyal is a director and 10% shareholder of MEPL. Mr Niew is a director and the majority shareholder of MEPL, currently holding 80% of its shares.1Foot Note 1×Deniyal bin Kamis’ Affidavit of Evidence-in-Chief dated 12 December 2022 (“Deniyal’s AEIC”) at paras 5 and 7; Niew Bock Leng’s Affidavit of Evidence-in-Chief dated 16 December 2022 (“Niew’s AEIC”) at paras 5 and 11.Mr Niew and Mr Deniyal were originally the only two shareholders of MEPL, with Mr Niew holding the remaining 90% of MEPL’s shares. However, Mr Niew transferred a 10% shareholding to his daughter, Ms Celesty Neo Wei Ling (“Ms Celesty”), on 2 April 2021.2Foot Note 2×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 58; Niew’s AEIC at para 5; Deniyal’s AEIC at para 9. 8 The second defendant, Mapo Marine Pte Ltd (“MMPL”), was incorporated on 18 October 2006. MMPL is also in the business of ship repair and servicing.3Foot Note 3×Deniyal’s AEIC at para 8; Niew’s AEIC at para 13.At the time of incorporation, Mr Niew was the sole shareholder and director of MMPL.4Foot Note 4×Deniyal’s AEIC at para 18; Niew’s AEIC at para 31.On 10 August 2007, Mr Deniyal was issued 10% of MMPL’s shares and appointed a director.5Foot Note 5×Deniyal’s AEIC at para 17; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 13.MMPL’s general manager, Mr Ong Chee Koon (“Mr Ong”), was also appointed a director and issued 20% of the shares.6Foot Note 6×Niew’s AEIC at para 33.On 18 October 2011, Mr Ong’s 20% shareholding was transferred to Mr Deniyal. Mr Deniyal was thereafter a director and 30% shareholder of MMPL.7Foot Note 7×Deniyal’s AEIC at paras 5 and 18.Mr Niew currently holds 60% of the shares,8Foot Note 8×Niew’s AEIC at para 6.having transferred a 10% shareholding to Ms Celesty on 2 April 2021. 9 Parties agree that Mr Niew heads and controls MEPL and MMPL.9Foot Note 9×Deniyal’s AEIC at para 21; Niew’s AEIC at para 36.Through Mr Niew, MEPL and MMPL are related to two other companies: Matopo Engineering Pte Ltd (“Matopo”) and Mapo Marine Services Pte Ltd (“MMSPL”). Matopo was incorporated in 2005 and MMSPL was incorporated in 2010. Mr Niew is the sole director and shareholder of Matopo and MMSPL.10Foot Note 10×Deniyal’s AEIC at para 21; Niew’s AEIC at paras 13-14.MEPL, MMPL, Matopo, and MMSPL share the same registered address at 48 Tuas View Square and share the same main office. As Mr Niew incorporated MEPL, MMPL, Matopo, and MMSPL in order to bid for jobs at different shipyards, I shall loosely refer to the four companies as the “Mapo Group”, without intending this as a term of art. 10 I provide some context for the Mapo Group’s business as described by the parties. Shipyard contractors can register as a “Resident Contractor” of a specific shipyard. The workmen of a “Resident Contractor” will only be permitted to work in their specified shipyard. Multiple companies must therefore be incorporated to bid for work in different shipyards.11Foot Note 11×Niew’s AEIC at paras 12-13; NE, 31 January 2023, at 17.In the Mapo Group: (a) MEPL was registered as a “Resident Contractor” of Sembcorp Marine Integrated Yard Pte Ltd (the “Sembcorp Yard”).(b) Matopo was registered as a “Resident Contractor” of Keppel Shipyard Ltd (the “Keppel Yard”).(c) MMSPL was registered as a “Resident Contractor” of Keppel Fels Ltd. MMPL, on the other hand, was a “common contractor” that is not tied to any shipyard.12Foot Note 12×Niew’s AEIC at paras 12 and 15. 11 Another person with a recurring role is Ms Cindy Yu Chwee Hua (“Ms Cindy”), who was for a period the accounts manager of at least MEPL and MMPL.13Foot Note 13×Deniyal’s AEIC at para 11; Niew’s AEIC at para 54.Neither party provides clear evidence of when Ms Cindy assumed this role, or who else served as the accounts manager for the companies. The plaintiff 12 The scope of Mr Deniyal’s role in the Mapo Group is controversial. Parties agree that Mr Deniyal was employed by at least MEPL and Matopo,14Foot Note 14×Niew’s AEIC at paras 19 and 50.that his role was supervisory in nature,15Foot Note 15×Niew’s AEIC at para 18.and that he was primarily situated at Keppel Yard rather than the main office.16Foot Note 16×Niew’s AEIC at para 40; Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 19(b).Mr Deniyal did not contribute to the capital of MEPL or MMPL and did not furnish consideration for his shares.17Foot Note 17×NE, 1 February 2023, at 36, lines 15-17. 13 Mr Deniyal describes himself as a “quasi-partner” in the business, who had “full autonomy to make operational decisions” without needing to consult Mr Niew.18Foot Note 18×Deniyal’s AEIC at paras 15 and 27.Mr Deniyal was appointed as the Senior Operations Manager of MEPL, MMPL, Matopo, and MMSPL, a position he maintained since MEPL’s incorporation in 2003 until his dismissal on 13 February 2020.19Foot Note 19×Deniyal’s AEIC at paras 21, 27, 32.As the Senior Operations Manager, Mr Deniyal was second only to Mr Niew in the business hierarchy.20Foot Note 20×Deniyal’s AEIC at para 27(a).Mr Deniyal was not an ordinary subordinate who had to report to Mr Niew and instead made independent decisions on operational matters. On such matters, Mr Deniyal would take Mr Niew’s views into account but was not beholden to them and Mr Deniyal would disregard instructions he disagreed with.21Foot Note 21×Deniyal’s AEIC at para 27(e).In relation to Keppel Yard,22Foot Note 22×NE, 2 February 2023, at 39, lines 23-24.Mr Deniyal was authorised to advertise the business, attend client meetings, and approve high-level contracts.23Foot Note 23×Deniyal’s AEIC at para 27(b); NE, 2 February 2023, at 39, lines 29-31, to 40, lines 1-10.When Mr Niew travelled overseas, Mr Deniyal would stand in for Mr Niew and make decisions on pressing matters.24Foot Note 24×Deniyal’s AEIC at para 27(d).Mr Deniyal had full operational control over business conducted at Keppel Yard, which Mr Niew rarely visited personally, and was in charge of hiring and supervising employees who were stationed there.25Foot Note 25×Deniyal’s AEIC at para 27(c)-(d).However, in accordance with their differentiated responsibilities, Mr Deniyal would defer to Mr Niew on non-operational matters.26Foot Note 26×Deniyal’s AEIC at para 27(e). 14 Mr Niew downplays Mr Deniyal’s role in the business, referring to him only as an “employee” and then a “supervisor”.27Foot Note 27×Niew’s AEIC at paras 17-18; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 8-12.Mr Deniyal did not participate in management and was only appointed a director for convenience. He was not a business partner, but at best a “favoured and valuable employee”.28Foot Note 28×Niew’s AEIC at paras 37-39.Mr Niew accepts that Mr Deniyal’s duties included supervising employees stationed at Keppel Yard29Foot Note 29×Niew’s AEIC at para 18.and that he was in charge of operations at Keppel Yard.30Foot Note 30×NE, 9 February 2023, at 16, lines 8-10.According to Mr Niew, although Mr Deniyal was employed by MEPL, the Resident Contractor at Sembcorp Yard (see above at [10]), his work was primarily forMatopo, the Resident Contractor at Keppel Yard.31Foot Note 31×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 67-70; Niew’s AEIC at para 19.Mr Niew accepts that Mr Deniyal was in charge of Matopo’s operations.32Foot Note 32×NE, 9 February 2023, at 14, line 28.In contrast, Mr Deniyal did not have the authority to make autonomous decisions in MEPL, and did not play any role in its operations beyond signing cheques and financial statements as well as occasionally conducting internal safety meetings for workers.33Foot Note 33×NE, 9 February 2023, at 13, lines 19-30.Instead, Mr Niew was the sole person running MEPL.34Foot Note 34×Niew’s AEIC at paras 29-30, 36; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 14.MEPL also operated a dormitory which Mr Deniyal admitted he had no involvement in.35Foot Note 35×NE, 31 January 2023, at 57, lines 13-19; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 69.Mr Deniyal also did not hold any responsibilities in MMPL and was not involved in its operations.36Foot Note 36×Niew’s AEIC at paras 35-36.Mr Niew submits that Mr Deniyal could not have been a “quasi-partner” given his lack of involvement in MEPL and MMPL.37Foot Note 37×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 70-76; 3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 33-35. 15 It suffices to say at this juncture that I largely accept Mr Deniyal’s description of his role. Mr Deniyal’s appointment as Senior Operations Manager is supported by documentary evidence and was eventually conceded by Mr Niew.38Foot Note 38×Agreed Bundle of Documents, Volume 1 (“1AB”) at 45-46; Plaintiff’s Bundle of Documents at 5; NE, 14 February 2023, at 87, lines 21-23.Mr Niew testified that Mr Deniyal had been appointed a director because, until 2015, Mr Niew was often overseas and needed Mr Deniyal to oversee operations in his stead.39Foot Note 39×NE, 14 February 2023, at 85, lines 7-14, and 86, lines 10-19.However, I also accept that Mr Deniyal’s responsibilities were largely confined to matters relating to Keppel Yard. Mr Deniyal oversaw day-to-day operations at Keppel Yard and was entitled to a degree of autonomy in carrying out this function. Although Mr Deniyal was not Mr Niew’s equal, the evidence shows that in addition to his aforementioned duties, Mr Deniyal was also held out to third parties as a representative of the Mapo Group and was involved in ensuring that clients paid for work carried out at Keppel Yard.40Foot Note 40×Plaintiff’s Bundle of Documents at 5; NE, 2 February 2023, at 39, lines 29-30; NE, 3 February 2023, at 11; NE, 9 February 2023, at 14, lines 15-20, and 15, lines 1-5.Mr Niew also conceded that, as MMPL was a common contractor, Mr Deniyal would have oversight over MMPL workmen in Keppel Yard.41Foot Note 41×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 68.Mr Niew’s own testimony was that MMPL had at least two projects in Keppel Yard which involved Mr Deniyal.42Foot Note 42×NE, 9 February 2023, at 71, lines 26-32. The third defendant 16 It is undisputed that Mr Niew effectively exercised control over MEPL and MMPL and was the driving force behind the Mapo Group.43Foot Note 43×Deniyal’s AEIC at para 21; Plaintiff’s Reply Submissions dated 12 April 2023 at para 31.Mr Niew had full control over finance and business development.44Foot Note 44×NE, 31 January 2023, at 52, lines 13-17.Mr Niew decided what salaries and bonuses to give45Foot Note 45×NE, 1 February 2023, at 54, lines 10-31.and the companies’ accounts department reported to Mr Niew.46Foot Note 46×NE, 9 February 2023, at 55, line 32, to 56, lines 1-3; NE, 10 February 2023, at 24, lines 4-18.However, Mr Niew conceded that Mr Deniyal’s approval was required before the companies made large purchases or applied for bank loans.47Foot Note 47×NE, 10 February 2023, at 83, lines 19-26.To oversee the companies, Mr Niew would periodically check in on the Mapo Group’s operations at the different shipyards, but mainly worked from the main office.48Foot Note 48×NE, 9 February 2023, at 16, lines 2-7; NE, 14 February 2023, at 83, lines 4-5.According to Mr Niew, he was responsible for contributing the start-up capital of MEPL and MMPL. Both companies remain substantially indebted to him.49Foot Note 49×Niew’s AEIC at para 103-104.",
        "Background to the dispute": "17 Both parties provide completely different accounts of the events leading up to the deterioration in their relationship. Mr Deniyal’s version starts with a long period of blind faith in Mr Niew during which he was largely oblivious to the administration of the Mapo Group, followed by a series of confrontations that culminated in the termination of his employment. Mr Niew’s version portrays a long and tranquil relationship unexpectedly disrupted by the receipt of demand letters from Mr Deniyal’s lawyers in late 2019. 18 Both accounts are by and large supported only by the parties’ respective testimonies. Mr Ong initially refused to give evidence and had to be subpoenaed by Mr Deniyal. I found Mr Ong to be a credible witness and will highlight relevant portions of his testimony. Mapo Marine Services 19 Mr Deniyal and Mr Niew are well acquainted, having met in the early 1980s when both men were involved in other businesses in the maritime industry.50Foot Note 50×Deniyal’s AEIC at para 12; Niew’s AEIC at para 16.In 1986, Mr Niew started a sole proprietorship in the ship repair business, Mapo Marine Services (“MMS”).51Foot Note 51×Niew’s AEIC at para 10.MMS was eventually incorporated in 2010 as MMSPL, one of the companies in the Mapo Group (see above at [9]).52Foot Note 52×Niew’s AEIC at para 13. 20 In 1989, Mr Deniyal joined MMS. In 1999, Mr Deniyal resigned from MMS, but re-joined in 2001.53Foot Note 53×Deniyal’s AEIC at para 12; Niew’s AEIC at para 17. 21 Parties differ on the reason for Mr Deniyal’s departure and the circumstances of his subsequent return. According to Mr Deniyal, he resigned due to a remuneration dispute with Mr Niew. Mr Deniyal was convinced to return only after persistent persuasion and promises by Mr Niew that Mr Deniyal would be “fairly compensated for [his] efforts and hard work”.54Foot Note 54×Deniyal’s AEIC at para 12.Mr Niew had been unable to find a suitable replacement for Mr Deniyal.55Foot Note 55×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 6(d).According to Mr Niew, there was no remuneration dispute and Mr Deniyal left on good terms. The pair kept in touch despite Mr Deniyal’s departure,56Foot Note 56×Niew’s AEIC at para 17.and Mr Niew invited Mr Deniyal to return in 2001 because Mr Deniyal’s employer had encountered financial troubles.57Foot Note 57×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 8(d). Incorporation of MEPL 22 In 2003, MEPL was incorporated to comply with changes to the requirements imposed by the Ministry of Manpower on shipyard contractors and on the employment of foreign manpower.58Foot Note 58×Niew’s AEIC at paras 11, 25; Deniyal’s AEIC at para 14.Upon incorporation, Mr Deniyal was allotted 10% of the shares in MEPL, appointed a director, and was named as a signatory to MEPL’s bank account.59Foot Note 59×Deniyal’s AEIC at para 15; Niew’s AEIC at para 28.When Mr Niew was overseas, Mr Deniyal was authorised to sign cheques and withdraw cash to meet any urgent needs of MEPL or their staff.60Foot Note 60×Niew’s AEIC at para 28.Mr Deniyal did not and was not expected to pay for the shares, which were gifted to him by Mr Niew.61Foot Note 61×Niew’s AEIC at para 26. 23 According to Mr Deniyal, the incorporation of MEPL was an idea conceived by both Mr Deniyal and Mr Niew after joint discussions. Mr Niew gave Mr Deniyal a stake in MEPL because Mr Niew wanted to provide a long-term incentive for Mr Deniyal to continue to work with him.62Foot Note 62×Deniyal’s AEIC at paras 14-15.Prior to MEPL’s incorporation, Mr Deniyal had not expected that he would be made a director or gifted shares and was grateful.63Foot Note 63×NE, 31 January 2023, at 31, lines 24-25, and 33, lines 11-14.This was not inconsistent with the fact that MEPL’s incorporation resulted from joint discussions.64Foot Note 64×Plaintiff’s Closing Submissions dated 29 March 2023 at para 23(c). 24 Mr Niew denies having discussions with Mr Deniyal prior to incorporating MEPL.65Foot Note 65×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 10.Mr Niew explains that he had been advised that two directors were required to incorporate a company. On account of their long association and because Mr Deniyal was one of the only staff able to speak and read English, Mr Niew asked if Mr Deniyal agreed to be appointed a director.66Foot Note 66×Niew’s AEIC at paras 25-26.Mr Niew also gifted Mr Deniyal the 10% shareholding out of goodwill.67Foot Note 67×Niew’s AEIC at para 26. 25 I observe that Mr Deniyal’s pleaded case is that he was issued shares in MEPL and was appointed a director because he hadsuggestedthis course of action to Mr Niew, on the basis that it would improve Mr Deniyal’s professional standing.68Foot Note 68×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 11.However, Mr Deniyal did not confirm this allegation in his affidavit69Foot Note 69×Deniyal’s AEIC at para 15.and subsequently testified that hedid notin fact expressly make this suggestion to Mr Niew.70Foot Note 70×NE, 31 January 2023, at 32, line 11, and 42, lines 25-32; Plaintiff’s Reply Submissions dated 12 April 2023 at para 10. Incorporation of MMPL 26 In 2006, MMPL was incorporated. Mr Niew was initially the sole shareholder and director of MMPL (see above at [8]). Unlike in MEPL, Mr Deniyal was not made a cheque signatory of MMPL.71Foot Note 71×Niew’s AEIC at para 34. 27 According to Mr Deniyal, although Mr Niew was the person who originally suggested the incorporation of MMPL, the process leading up to MMPL’s incorporation was one of active consultation between Mr Niew, Mr Deniyal, and Mr Ong. The three men engaged in long discussions to ensure that MMPL would be commercially viable. In these discussions, Mr Niew expressed his gratitude towards Mr Deniyal and Mr Ong and thanked them for their contributions. Mr Niew stated his intention that the three would become the directors and shareholders of MMPL and work together for its success.72Foot Note 72×Deniyal’s AEIC at para 17.Mr Niew granted Mr Deniyal his stake in MMPL as a reward for his hard work and to provide a further incentive (by way of profit sharing) for him to remain loyal to MMPL.73Foot Note 73×Deniyal’s AEIC at para 18. 28 Mr Niew denies having engaged in any discussions about the incorporation of MMPL, which was his sole initiative. Mr Niew had identified Mr Ong as a capable candidate for the role of general manager and had only sought him out after MMPL was already incorporated. When Mr Ong was made a director and shareholder, Mr Deniyal was also gifted 10% of the shares and appointed a director. According to Mr Niew, this was “a matter of convenience” and because Mr Niew regarded Mr Deniyal as a valuable employee who Mr Niew wanted to reward and retain in the long term. Mr Deniyal was appointed a nominal director on the “understanding” that Mr Deniyal would “continue in his usual role and would not be involved in the management of MMPL”.74Foot Note 74×Niew’s AEIC at paras 32-34; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 12-13. 29 Mr Ong testified that he was already employed as MEPL’s general manager prior to MMPL’s incorporation. Mr Ong also confirmed that Mr Niew had gifted him shares in MMPL as a reward for his contributions to the business.75Foot Note 75×NE, 3 February 2023, at 8-9. Mr Ong’s departure 30 On 18 October 2011, Mr Ong resigned from MMPL.76Foot Note 76×Deniyal’s AEIC at para 20.Thereafter, Mr Ong’s 20% shareholding was transferred to Mr Deniyal. 31 According to Mr Deniyal, Mr Ong left after a serious disagreement with Mr Niew regarding the latter’s handling of MMPL’s accounts. Mr Deniyal had noticed a growing rift between Mr Niew and Mr Ong, and when prompted, Mr Ong shared his concerns regarding Mr Niew’s handling of the accounts prior to leaving MMPL.77Foot Note 77×Deniyal’s AEIC at paras 20, 26-27. 32 Mr Niew denies having had any disagreement with Mr Ong. Instead, Mr Ong had resigned because he received a job offer and was relocating to the People’s Republic of China. It was Mr Ong’s choice to transfer his 20% shareholding in MMPL to Mr Deniyal.78Foot Note 78×Niew’s AEIC at paras 63-64.Mr Niew’s version of events is corroborated by Mr Ong, who made no mention of any disagreements regarding the handling of accounts.79Foot Note 79×NE, 3 February 2023, at 13, lines 13-14. 33 Nevertheless, any possible revelation evidently did not shake Mr Deniyal’s confidence in Mr Niew at this time, as he continued to “place full trust” in Mr Niew and focused only on the operational side of the Mapo Group.80Foot Note 80×Deniyal’s AEIC at para 27. Falling out 34 Mr Deniyal’s interest in the accounts of MEPL and MMPL was only piqued in early 2018 when he noticed that invoices for two Malaysian companies, YR Engineering & Trading and YR Marine Engineering Sdn Bhd (the “Malaysian Companies”), were not reflected in the list of unpaid invoices. When Mr Deniyal asked Ms Cindy, she told him that the money owed under the invoices had been paid to Mr Niew in cash.81Foot Note 81×Deniyal’s AEIC at para 28.It was then that Mr Deniyal formed the view that he ought to have been provided with monthly accounts as a director. However, despite repeated oral requests for the documents being rejected by Mr Niew, Mr Deniyal eventually accepted that obtaining the documents was unnecessary as he was persuaded that Mr Niew could be trusted to maintain proper accounts and manage the companies fairly.82Foot Note 82×Deniyal’s AEIC at para 29.According to Mr Niew, Mr Deniyal did not request any documents and Mr Niew did not make any representations or assurances in relation thereto.83Foot Note 83×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 18 and 20. 35 Mr Deniyal was apparently removed as a cheque signatory for MEPL in 2018.84Foot Note 84×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 18(c). 36 According to Mr Deniyal, the parties fell out in mid-2019 after he confronted Mr Niew about the perceived irregularities in the management of MEPL and MMPL and demanded an explanation for why he was not given his directors’ remuneration. Being dissatisfied with Mr Niew’s response, Mr Deniyal sought legal counsel.85Foot Note 85×Deniyal’s AEIC at para 30.Mr Niew denies that any such confrontation took place.86Foot Note 86×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 22. Demands for disclosure 37 In December 2019, on behalf of Mr Deniyal, Rajah & Tann formally demanded that MEPL and MMPL disclose certain financial documents and information (the “R&T Demand Letter”).87Foot Note 87×Deniyal’s AEIC at para 31; 1AB at 36-39.In January 2020, on behalf of MEPL and MMPL, Tang & Partners requested time to locate the documents.88Foot Note 88×1AB at 42-43.By a letter dated 5 February 2020, Rajah & Tann stipulated a deadline of 12 February 2020, failing which Mr Deniyal would commence legal proceedings.89Foot Note 89×1AB at 44.Documents were eventually disclosed by correspondence from Eldan Law, who currently represent Mr Niew, dated 2 March 2020, 12 June 2020, 26 June 2020, and 30 October 2020.90Foot Note 90×Deniyal’s AEIC at para 31.Mr Deniyal maintains that these disclosures were piecemeal and selective. According to Mr Niew, this was the very first time Mr Deniyal expressed any interest whatsoever in the finances of MEPL and MMPL.91Foot Note 91×Niew’s AEIC at paras 46 and 62.Mr Niew asserts that all documents required to be disclosed under the Companies Act were provided to Mr Deniyal.92Foot Note 92×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 23. Termination of Mr Deniyal 38 After the R&T Demand Letter was issued, Mr Deniyal received notices of termination from MEPL and Matopo dated 13 February 2020. Mr Deniyal claims that this was a calculated move by Mr Niew to deny Mr Deniyal access to the financial documents of the companies.93Foot Note 93×Deniyal’s AEIC at paras 32-33.Mr Deniyal also testified that his phone lines and access cards were all terminated the day after the R&T Demand Letter was sent, denying him access to Keppel Yard. This claim is supported by a contemporaneous letter from Rajah & Tann dated 20 January 2020.94Foot Note 94×NE, 2 February 2023, at 55, lines 11-17; 1AB at 41. 39 Mr Niew explains that Mr Deniyal had been dismissed for good reasons. The notices of termination state that Mr Deniyal had failed to report to work and failed to collect his salary despite repeated reminders.95Foot Note 95×1AB at 45-46.Mr Niew elaborates that business at Keppel Yard declined in 2019. Mr Deniyal was therefore requested to report to the main office on a more regular basis. However, Mr Deniyal did not do so.96Foot Note 96×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 19(b).According to Mr Niew, Mr Deniyal came down sporadically to hand over necessary documents or only when expressly instructed to do so. Mr Deniyal was formally dismissed after he started to entirely neglect reporting to work in November 2019 and became uncontactable.97Foot Note 97×Niew’s AEIC at paras 41-43; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 19.Mr Deniyal initially denied being absent from work or being uncontactable, explaining that although he did not report to the main office as requested, he remained stationed at Keppel Yard.98Foot Note 98×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 19(b).However, Mr Deniyal later admitted that he had refused to report to work sometime in end December 2019 or early January 2020 after an argument with Mr Niew regarding the R&T Demand Letter.99Foot Note 99×NE, 2 February 2023, at 55, lines 30-32. 40 On 2 April 2021, following an extraordinary general meeting, Ms Celesty was appointed a director and made a shareholder of both MEPL and MMPL. Although Mr Deniyal had been given notice of the meetings, he did not attend them as he considered Ms Celesty’s appointment a foregone conclusion due to Mr Niew’s controlling stake. Instead, Mr Deniyal voiced his objections by way of a letter dated 15 March 2021.100Foot Note 100×Deniyal’s AEIC at para 77. 41 Mr Deniyal commenced this action on 9 April 2021. Buy-out offers 42 After proceedings commenced, Mr Niew extended two offers to settle the suit and buy-out Mr Deniyal’s shares on 22 August 2022 and 14 December 2022.101Foot Note 101×1AB at 264-266; Niew’s AEIC at para 143.I will say more about the details and significance of these buy-out offers in due course.",
        "The parties’ cases": "",
        "Plaintiff’s case": "43 Mr Deniyal submits that Mr Niew had been conducting the affairs of MEPL and MMPL in an oppressive manner and in disregard of Mr Deniyal’s interests as a minority shareholder since 2011.102Foot Note 102×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 24; Deniyal’s AEIC at para 34.Mr Niew abused his controlling position to prevent Mr Deniyal from sharing in the profits of MEPL and MMPL.103Foot Note 103×Plaintiff’s Closing Submissions dated 29 March 2023 at para 30. 44 Mr Deniyal characterises his relationship with Mr Niew as one of mutual trust and friendship. Mr Deniyal highlights that they were personal friends over and above their professional relationship.104Foot Note 104×Deniyal’s AEIC at paras 13, 25; Statement of Claim (Amendment No 3) dated 7 February 2023 at para 9.To support this claim, Mr Deniyal refers to various occasions over the course of their long relationship where Mr Deniyal and Mr Niew interacted socially.105Foot Note 105×Deniyal’s AEIC at para 13.But for their friendship, Mr Deniyal would have more closely scrutinised Mr Niew’s conduct.106Foot Note 106×Deniyal’s AEIC at para 25. 45 Mr Deniyal’s case is that the parties reached a “quasi-partnership understanding” where Mr Deniyal would focus on the operational aspects of the business, while Mr Niew would handle finance, marketing, and business development.107Foot Note 107×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 14; Deniyal’s AEIC at para 19.This division of responsibilities was not reduced to writing due to the informal nature of their association.108Foot Note 108×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 7, 22. 46 Mr Deniyal relies upon a host of different allegations to support his claim. In brief, the alleged acts amounting to commercial unfairness are that: (a) Mr Niew did not grant Mr Deniyal unfettered access to the financial documents of MEPL and MMPL;(b) Mr Niew depleted the funds of MEPL and MMPL through fictitious loans extended to Matopo, a company solely controlled by Mr Niew;(c) Mr Niew unilaterally decided to increase his own salary drawn from MEPL and MMPL in a manner that was unfair and contrary to the corporate constitutions of both MEPL and MMPL;(d) Mr Niew misappropriated moneys properly payable to MEPL by the Malaysian Companies;(e) Mr Niew mismanaged MEPL by delaying the collection of trade receivables;(f) Mr Niew loaned $500,000 from either MEPL or MMPL without obtaining the requisite approval under the Companies Act;(g) Mr Niew mismanaged MEPL by inflating its accounts;(h) Mr Niew depleted the funds of MEPL and MMPL through multiple unexplained cash withdrawals;(i) Mr Niew depleted the funds of MMPL by causing it to incur expenditure on behalf of other companies;(j) Mr Niew wrongfully disposed or misappropriated MEPL’s assets as evidenced by certain unaccounted invoices; and(k) Mr Niew did not distribute dividends and directors’ fees to Mr Deniyal or did so in a manner that was unfair to Mr Deniyal.Mr Deniyal submits that Mr Niew breached his legitimate expectations by failing to comply with the corporate constitutions of MEPL and MMPL before increasing his own salary. By failing to distribute dividends and directors’ fees, and by depleting the assets of the companies, Mr Niew also breached Mr Deniyal’s legitimate expectation to be treated fairly and to share in the profits of MEPL and MMPL.109Foot Note 109×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 62; Plaintiff’s Closing Submissions dated 29 March 2023 at paras 23-24. 47 The primary relief sought by Mr Deniyal is an order for Mr Niew to purchase his shares at fair value without discount. The shares of MEPL and MMPL are to be valued as if Mr Niew had not engaged in oppressive conduct. This valuation is to be determined by agreement, or carried out by the court or by independent valuers appointed by the court.110Foot Note 110×Statement of Claim (Amendment No 3) dated 7 February 2023 at 31-33; Plaintiff’s Closing Submissions dated 29 March 2023 at paras 27 and 70-76.Mr Deniyal also seeks an account of any moneys withdrawn from MEPL and/or MMPL without his knowledge or consent and an account of any dividends and directors’ fees not received by him.",
        "Defendant’s case": "48 Mr Niew’s case is that this entire action is baseless and motivated by Mr Deniyal’s desire to obtain an unjustified windfall by forcing the purchase of shares that were originally gifted to him by Mr Niew.111Foot Note 111×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 61; 3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 6-9, 162-163; Niew’s AEIC at para 47. 49 Mr Niew denies the existence of any quasi-partnership on the basis that he alone was responsible for the management of the companies and had the final say in all decisions. Mr Deniyal was his subordinate and not a partner in the business. Mr Deniyal has no evidence to prove he made management decisions or to show that he was second-in-command.112Foot Note 112×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 14; 3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 21, 62, and 75.In any event, Mr Deniyal fails to discharge the burden of proving the alleged “quasi-partnership understanding”.113Foot Note 113×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 57.There is no evidence that the two men engaged in discussions leading up to the incorporation of MEPL, and Mr Deniyal agrees that there was no finalised agreement that Mr Niew would gift the shares prior to MEPL’s incorporation.114Foot Note 114×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 59-60. 50 Mr Niew claims that Mr Deniyal has long been in the habit of taking frequent personal loans from Mr Niew and the companies.115Foot Note 115×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 144; Niew’s AEIC at para 38.These loans were for a variety of expenses including school fees, wedding expenses, travel-related costs, and to pay bills. The largest loan extended by Mr Niew was approximately $60,000 for the purchase of a home, but there were various other smaller loans of $2,000 to $3,000 as well as loans exceeding $10,000.116Foot Note 116×Niew’s AEIC at paras 20-22, 105.Mr Niew claims that in aggregate, the total amount of loans extended to Mr Deniyal exceeds $600,000, with the sum of around $200,000 still outstanding.117Foot Note 117×Niew’s AEIC at para 24.Mr Niew categorically denies that these loans were gifts.118Foot Note 118×Niew’s AEIC at para 22.Mr Niew’s pleaded case is that these loans were extended between the early 2000s to 2009.119Foot Note 119×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 51.Mr Deniyal admits that Mr Niew gave him small amounts of money between 2000 to 2009, but claims that these were gifts owing to their friendship.120Foot Note 120×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 33B. 51 According to Mr Niew, the money owed by Mr Deniyal under these personal loans could be repaid from three different sources. First, the companies would typically declare bonuses of two to three months, which would then be used to repay the loans. Mr Deniyal had “no issues” with this arrangement.121Foot Note 121×Niew’s AEIC at para 23.After MEPL and MMPL were incorporated, dividends and directors’ fees which were declared could also be set-off against the loans and Mr Deniyal approved of all such transfers.122Foot Note 122×Niew’s AEIC at paras 23, 98; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 51; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 146.Mr Deniyal would remain constantly indebted to Mr Niew, as Mr Deniyal would take further loans after prior debts were satisfied.123Foot Note 123×NE, 15 February 2023, at 23, lines 2-14. 52 The main thrust of Mr Niew’s submissions is that Mr Deniyal fails to discharge the burden of proving his various allegations on a balance of probabilities.124Foot Note 124×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 31-37, 81, 86, 104, 109, 110, 118, 120, and 126.Key allegations were not put to Mr Niew during the course of the trial and Mr Deniyal is therefore precluded from submitting on them under the rule inBrowne v Dunn(1893) 6 R 67 (“Browne v Dunn”).125Foot Note 125×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 38-39.In contrast, Mr Niew’s submits that his claims are supported by his explanation of the available financial records of the companies. 53 As for Mr Deniyal’s claim for an account of moneys withdrawn from the companies and an account of unpaid directors’ fees and dividends, Mr Niew submits that this remedy is time-barred under s 6(2) of the Limitation Act 1959 (2020 Rev Ed) (the “Limitation Act”).126Foot Note 126×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 61A-61B. 54 Finally, Mr Niew submits that this action should be dismissed as an abuse of process for two reasons. First, Mr Niew had extended two reasonable buy-out offers. In proceeding with this action, Mr Deniyal is seeking an unjustified windfall in abuse of process.127Foot Note 127×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 159-162.Second, the real injury that Mr Deniyal seeks to vindicate is a contractual claim against MEPL and MMPL for unpaid directors’ fees and dividends, which should not be brought under s 216 of the Companies Act.128Foot Note 128×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 154-155; 3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 93-96.",
        "The evidence": "55 The parties essentially rest their respective cases on the testimonies of Mr Deniyal and Mr Niew. In their closing submissions, each party accused the other of being an unreliable witness. 56 I did not find the testimony of either witness entirely satisfactory. However, many of the matters raised took place several years ago and I accept that both witnesses are at an age where lapses in memory may occur. Both Mr Niew and Mr Deniyal are unskilled in accountancy and I do not place much weight on apparent contradictions in their testimony resulting from a lack of understanding of technical terms. Both men also required the assistance of translators. 57 Further, the available documentary evidence provides only limited assistance. Both parties referred extensively to the general ledgers of MEPL and MMPL, which record debit and credit transactions over the course of a given financial year. However, these ledgers provide only a truncated description of the listed transactions and do not provide a complete picture of what the entries represent. Neither party called Ms Cindy or any other member of MEPL or MMPL’s accounts department to give evidence. Relevant supporting documents were not adduced as Mr Niew asserts that MEPL and MMPL follow a policy of not retaining documents for more than the five years required under s 199(2) of the Companies Act.129Foot Note 129×Niew’s AEIC at para 133.Given Mr Niew’s control over the companies, most of the adduced documents were disclosed by him and I note that he was able to adduce some documents dating as far back as 2006 in support of his contentions. Mr Niew’s explanation for why this was the case was that these documents had been misplaced into “the wrong box” and therefore avoided destruction.130Foot Note 130×NE, 10 February 2023, at 64, lines 11-18, and 72, lines 26-27.",
        "Mr Niew’s evidence": "58 Mr Deniyal submits that Mr Niew provided only selective disclosure of documents or intentionally concealed evidence.131Foot Note 131×Plaintiff’s Closing Submissions dated 29 March 2023 at para 12.Mr Deniyal casts doubt on Mr Niew’s claim that MEPL and MMPL had a policy of only retaining documents for five years before destroying them. 59 First, after receiving the R&T Demand Letter in December 2019 (see above at [37]), the initial replies from Tang & Partners dated 23 January 2020132Foot Note 132×1AB at 42-43.and 20 February 2020133Foot Note 133×1AB at 47.failed to state that the companies had any policy of destroying documents. Instead, Tang & Partners expressly assured Mr Deniyal that accounting records would be properly maintained and that the companies simply needed more time as the matters raised dated back to 2006. The statutory obligation to maintain records for a period of five years was first mentioned in a letter from Eldan Law dated 26 March 2020.134Foot Note 134×1AB at 59.I note that this letterdoes notexpressly state that the companies didin facthave the policy of destroying documents after five years. Instead, the statutory obligation was mentioned in the context of emphasising that prior disclosure was above and beyond the legal obligations of the companies. This prior disclosure had been by way of letter from Eldan Law dated 2 March 2020, which indeed disclosed documents dating as far back as 2006 and makes no mention of any destruction policy.135Foot Note 135×1AB at 55.A letter from Eldan Law dated 30 June 2020 was the first time it was clearly set out that documents dating before 2015 were no longer in the possession of MEPL and MMPL.136Foot Note 136×1AB at 71.Mr Deniyal submits that the alleged destruction policy is an afterthought to provide Mr Niew with an excuse not to disclose incriminating documents, as there is no reason why this policy was not stated in the initial replies from Tang & Partners.137Foot Note 137×Plaintiff’s Closing Submissions dated 29 March 2023 at para 12(a)-(c). 60 Second, Mr Niew admitted during cross-examination that the companies maintained electronic records of documents dating before 2015138Foot Note 138×NE, 14 February 2023, at 15, lines 19-21, and 16, lines 1-24.and made belated disclosure of further documents dating back to 2010 in support of his case at trial. For example, minutes of the annual general meetings of the companies dating back to 2010 were adduced on the sixth day of the trial to support Mr Niew’s case that Mr Deniyal had ratified declarations of directors’ fees.139Foot Note 139×NE, 8 February 2023, at 18-21.After being pressed on his lack of evidence for the personal loans allegedly extended to Mr Deniyal, Mr Niew offered to look for further documents and indeed adduced additional material on the last day of trial.140Foot Note 140×NE, 14 February 2023, at 32, lines 29-31, to 33, lines 1-12, and 43, lines 17-28; NE, 15 February 2023, at 1; Exhibit D10.Mr Deniyal submits that this shows that Mr Niew selectively disclosed documents as and when it suited his case.141Foot Note 141×Plaintiff’s Closing Submissions dated 29 March 2023 at para 12(d). 61 Third, Mr Niew testified that he continued to destroy documents in February 2020.142Foot Note 142×NE, 15 February 2023, at 7, lines 4-31, at 8, lines 1-7, and 10, lines 1-8.As this was after the R&T Demand Letter had already been issued in December 2019, Mr Niew would have been put on notice of the need to preserve documents.143Foot Note 143×Plaintiff’s Closing Submissions dated 29 March 2023 at para 12(e)-(f).In fact, Tang & Partners had assured Mr Deniyal that records would be preserved. 62 Mr Niew rejects the allegation of selective disclosure, highlighting that he has disclosed approximately 650 documents in these proceedings. Mr Niew was cooperative in providing records to Mr Deniyal. Even after the close of the trial, Mr Niew wrote to Standard Chartered Bank to seek further records at Mr Deniyal’s behest.144Foot Note 144×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 19-22. 63 Furthermore, Mr Deniyal submits that Mr Niew was evasive during cross-examination and often took unnecessarily technical positions.145Foot Note 145×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 9-10.Mr Niew denies being evasive, explaining that the relevant matters took place over a decade before the trial.146Foot Note 146×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 13-16. 64 I am troubled by the way Mr Niew carried out his disclosure obligations. Mr Niew did not provide any explanation for why the policy of destroying documents after five years was only belatedly raised half a year after the R&T Demand Letter. No reason is provided for the tardy disclosure of documents. Mr Niew’s explanation for why he continued to destroy documents in February 2020 despite being put on notice was that he had simply listened when his accounts department informed him that the documents could be destroyed.147Foot Note 147×NE, 15 February 2023, at 7, lines 4-31, to 8, lines 1-7.This was clearly contrary to his earlier undertaking that documents would be preserved (see above at [61]) and should not have been done. The timing of this destruction is made more troubling by the fact that this was the same month that Mr Deniyal intimated his willingness to commence legal proceedings to secure access to the documents and the same month his employment was terminated (see above at [37] and [38]). Although I accept that some of the documents were of considerable vintage by the time of this action and Mr Niew might have expended significant effort to search for them, this is simply part of Mr Niew’s obligation to provide discovery of documents. The fact that the documents belatedly disclosed by Mr Niew wereonlyadduced in support of his own case gives me further pause. As the party in control of the companies, Mr Niew enjoys the advantage of an acute informational asymmetry. While this is to be expected in most claims under s 216 of the Companies Act, the one-sided and belated disclosure is a factor I take into consideration in assessing the evidence. 65 As for credibility, I accept Mr Niew’s submission that given the passage of time, he cannot be expected to have perfect recollection. However, I found that Mr Niew was sometimes coy in his testimony. When cross-examined, Mr Niew would often respond with “you can say that” rather than providing a direct answer,148Foot Note 148×NE, 9 February 2023, at 4; NE, 10 February 2023, at 28.and would occasionally outright refuse to answer questions.149Foot Note 149×NE, 9 February 2023, at 89, line 17; NE, 10 February 2023, at 4, line 18.I also found Mr Niew sometimes made pedantic responses in a manner that was evasive. For example, Mr Niew initially refused to admit that he had terminated Mr Deniyal’s employment, stating that it was his Human Resources department.150Foot Note 150×NE, 3 February 2023, at 19, lines 18-19; NE, 9 February 2023, at 17, line 3, and 19, lines 21-27; NE, 14 February 2023, at 8, lines 5-11.Mr Niew resiled from his admission that he had in substance increased his own salary, insisting that he had merely started to draw a salary from MEPL and MMPL.151Foot Note 151×NE, 3 February 2023, at 28, lines 22-31.Mr Niew denied inviting Mr Deniyal to visit his home, because he claimed that he only had a place of residence and did not own a house at that time.152Foot Note 152×NE, 9 February 2023, at 23, lines 7-12.At times, it appeared to me that Mr Niew was trying to pre-empt counsel’s line of questioning.153Foot Note 153×NE, 10 February 2023, at 28-30, at 40, lines 27-29, and 61, lines 12-13.For example, upon realising that counsel was about to focus on the technical distinction between a “loan” and an “advance” during cross-examination, Mr Niew abruptly denied ever extending any loans to Mr Deniyal, explaining that he gave advances instead.154Foot Note 154×NE, 10 February 2023, at 28, lines 26-32, to 29, lines 1-17.Mr Niew subsequently testified that he did not actually know the difference between a loan and an advance. These factors made me treat Mr Niew’s evidence with a degree of circumspection.",
        "Mr Deniyal’s evidence": "66 Mr Niew submits that Mr Deniyal lacks credibility due to his many speculative assertions and contradictory narrative. More importantly, Mr Deniyal had initially informed the court that he would call Ms Cindy and an expert witness on accountancy, Mr Farooq Mann, to give evidence.155Foot Note 155×3rd Defendant’s Bundle of Documents dated 26 January 2023 (“1DBOD”) at Tab 5.However, Mr Deniyal failed to do so.156Foot Note 156×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 42-45. 67 When cross-examined on this, Mr Deniyal testified that he declined to call Mr Farooq Mann as he believed that Mr Farooq Mann’s valuation of the shares was too low and would not be favourable.157Foot Note 157×NE, 1 February 2023, at 66, lines 18-31, to 67, lines 1-3.As for Ms Cindy, Mr Deniyal explained that he did not call Ms Cindy or subpoena her (as he had done with Mr Ong) because she supposedly pleaded with him not to do so.158Foot Note 158×NE, 31 January 2023, at 66, lines 25-31, to 67, lines 1-7.Mr Deniyal also admitted under cross-examination that he was afraid that Ms Cindy would give unfavourable testimony if forced to give evidence, ostensibly because she was “very close” to Mr Niew.159Foot Note 159×NE, 31 January 2023, at 69, lines 16-19, and 73, lines 22-31. 68 Mr Deniyal submits that an accountancy expert is not necessary because the legal issue of whether the transactions were oppressive is a matter for the court’s determination. Any valuation would have failed to account for the effects of oppressive conduct and would consequently be misleading. Furthermore, Mr Farooq Mann cannot determine the factual issue of whether Mr Niew did in fact extend substantial personal loans to Mr Deniyal.160Foot Note 160×Plaintiff’s Reply Submissions dated 12 April 2023 at para 15(a).Mr Deniyal further submits that the onus was on Mr Niew to call Ms Cindy. CitingWee Yue Chew vSu Sh-Hsyu[2008] 3 SLR(R) 212 at [3]–[6], Mr Deniyal submits that because Mr Niew did not dispute that Mr Deniyal was entitled to the directors’ fees and dividends declared and instead made the positive assertion that Mr Deniyal did in fact receive his entitlement, the burden fell on Mr Niew to prove this assertion.161Foot Note 161×Plaintiff’s Reply Submissions dated 12 April 2023 at para 15(b). 69 I agree that Mr Deniyal contradicted his pleaded case on some matters (for example, see above at [25] and [31]–[32]). I found that Mr Deniyal did not hold up well under cross-examination, and his testimony was sometimes confused and incoherent. I accept that Mr Deniyal did not provide an adequate explanation for his failure to call Ms Cindy. While I do not draw an adverse inference as there were aspects ofbothparties’ cases for which that party ought properly to have called Ms Cindy as their witness, Mr Deniyal’s failure to call Ms Cindy certainly impacts his ability to prove his case on the balance of probabilities. Indeed, this failure is fatal to Mr Deniyal’s reliance on statements allegedly made to him by Ms Cindy as, in the absence of her testimony, such statements are hearsay. As for the failure to call Mr Farooq Mann, I will discuss this in relation to the issue of whether this action was an abuse of process.",
        "Accounting evidence": "70 As mentioned, both parties referred extensively to the general ledgers of MEPL and MMPL. Mr Niew in particular makes reference to the ledgers in support of his written submissions and explanations.162Foot Note 162×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 137-142, 146, 151; 3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 24-28, 54-56, 84.However, the ledgers relied upon in Mr Niew’s submissions were prepared by the Mapo Group’s accounts department, who werenotcalled to give evidence.163Foot Note 163×NE, 1 February 2023, at 15, lines 19-21; NE, 10 February 2023, at 32, at 48, lines 9-11, at 67, lines 7-18, at 84, lines 12-23; NE, 14 February 2023, at 20, lines 17-20; NE, 15 February 2023, at 47, lines 3-6.When cross-examined on the transactions recorded in the ledgers, Mr Niew would repeatedly refuse to explain and insisted that his accounts department would be better placed to answer such questions.164Foot Note 164×NE, 10 February 2023, at 65, line 2, at 74, lines 11-25; NE, 14 February 2023, at 17, lines 25-31, at 18, line 13, at 21, lines 20-21, at 39, lines 17-19, at 62, lines 6-7.This was despite having given detailed evidence on the purpose of the transactions in his affidavit of evidence-in-chief.165Foot Note 165×Niew’s AEIC at paras 74-75, 92-102 71 Mr Deniyal’s counsel in turn criticises Mr Niew for not calling Ms Cindy as his witness. I consider Mr Niew’s failure to call Ms Cindy or anyone else from his accounts department as damaging to his case in two ways. First, Mr Niew’s consistent deflection to questions asked – that he simply relied on his accounts department – fundamentally undermines the explanations for the transactions set out in his affidavit of evidence-in-chief. Evidently, these explanations were not factual statements by Mr Niew, but were at best based on information from someone in his accounts department. Second, Mr Niew bears the burden of proving his assertion that he extended substantial personal loans to Mr Deniyal. These were the debts against which Mr Deniyal’s directors’ fees and dividends were said to be subsequently set-off (see above at [50]–[51]). Based on Mr Niew’s evidence, the accounts department could have provided corroboration by giving evidence as to their knowledge that such loans occurred and thus the validity of the set-offs. As with Mr Deniyal, Mr Niew’s failure to call any evidence from the accounts department therefore similarly impacts his ability to discharge his own evidential burden. Mr Niew explained that he discovered that Mr Deniyal was not going to call Ms Cindy to testify only after parties exchanged their affidavits of evidence-in-chief.166Foot Note 166×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 17.However, there is no indication that Mr Niew ever took any steps to call evidence from Ms Cindy or any other member of his accounts department.",
        "Issues to be determined": "72 Having considered the general state of the evidence, I now address the substantive issues. The relevant issues before me are: (a) whether the claim for the remedy of an account is barred by s 6(2) of the Limitation Act;(b) whether Mr Deniyal can prove his various allegations, and if so, whether they amount to commercial unfairness under s 216 of the Companies Act;(c) whether this action is an abuse of process; and(d) what the appropriate relief is, if the claim is made out.",
        "Issue 1: Whether the remedy of an account is barred by limitation": "73 Although Mr Niew’s defence of limitation is raised only in respect of the claim for an account of moneys withdrawn from MEPL and/or MMPL without Mr Deniyal’s knowledge or consent and for an account of any unpaid dividends and directors’ fees, it is convenient to first deal with this threshold issue.",
        "Parties’ submissions": "74 Mr Niew submits that Mr Deniyal’s claim for an account is time-barred under s 6(2) of the Limitation Act as the directors’ fees and dividends were declared over six years before this action was commenced.167Foot Note 167×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 156.CitingLim AhLeh v Heng Fock Lin[2018] SGHC 156 (“Lim AhLeh”) at [171], Mr Niew submits that s 6(2) of the Limitation Act depends not on the cause of action brought, but upon the remedy sought. Thus, the fact that the present action is brought under s 216 of the Companies Act does not prevent Mr Deniyal’s claim for an account from being time-barred.168Foot Note 168×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 157.Mr Niew does not submit that the other reliefs sought by Mr Deniyal are time-barred. 75 Mr Deniyal counters with authorities that expressly hold that s 6 of the Limitation Act does not apply to claims brought under s 216 of the Companies Act. InTan Yong San v Neo Kok Eng and others[2011] SGHC 30 (“Tan Yong San”) at [95], the court held that none of the limbs of s 6 of the Limitation Act were applicable to a statutory action brought under s 216 of the Companies Act. Furthermore, as oppressive conduct might take place over a period of time, it would undermine the effectiveness of the remedy if claimants were barred from referring to earlier acts of oppression that nevertheless form part of the overall course of conduct.Tan Yong Sanwas followed inLim Seng Wah and another v Han Meng Siew and others[2016] SGHC 177 (“Lim Seng Wah”) at [163] andOng HengChuan v Ong Teck Chuan and others[2020] SGHC 161 at [306]. InLim Seng Wah, the claimants sought, amongst other reliefs, an order that the defendants make restitution of or account for moneys paid out of the company in question. The defendants contended that s 6(1)(d) of the Limitation Act applied to bar the remedy sought (a return of moneys paid out) but did not operate to preclude reference to the conduct alleged to be oppressive. The court rejected this contention and held that s 216 of the Companies Act would not fall within any of the limbs of s 6 of the Limitation Act (at [164]). Finally, Mr Deniyal submits thatLim AhLehwas not a case concerning an action brought under s 216 of the Companies Act and s 6(2) of the Limitation Act refers only to a limited type of relief known as an “account of administration” (Lim AhLehat [170]).169Foot Note 169×Plaintiff’s Reply Submissions dated 12 April 2023 at paras 57-58.",
        "How I will deal with the relief sought": "76 It is well established that s 6 of the Limitation Act does not apply to s 216 of the Companies Act. Under s 216(2) of the Companies Act, the court has an “unfettered discretion” to make such order as it thinks appropriate to bring to an end or remedy the matters complained of (Lim Seng Wahat [175]). The most appropriate and practical remedy is ordinarily a buy-out order perhaps with adjustments to take into account conduct of the majority that has impacted the value of the company. Mr Deniyal seeks three heads of relief that ordinarily are founded upon other recognised causes of action and would ordinarily be subject to the Limitation Act (the period of limitation depending on how the cause of action is framed). These are the heads of relief seeking damages, restitution of monies taken or withdrawn by the defendants, and an account of directors’ fees and dividends declared but not received by Mr Deniyal. It may be that in an appropriate case such relief could be granted in order to bring to an end or remedy the matters complained of under the section, but I do not consider such relief to be appropriate or justified in this case. 77 In this case, I consider it more appropriate to consider, if and to the extent that Mr Deniyal establishes either moneys improperly taken by Mr Niew from the companies, or from Mr Deniyal’s share of directors’ fees or dividends, the impact this may have on how any order for a buy-out should be framed, including the proper date for valuation and any adjustments to be made. For this purpose, there is in principle no limitation in time concerning the matters that may be considered. 78 For completeness, I agree that the fact that a shareholder does not immediately initiate litigation for unfair treatment does not preclude them from subsequently asserting a claim on that basis:Over & Over Ltd vBonvests Holdings Ltd and another[2010] 2 SLR 776 (“Over & Over”) at [103].",
        "Issue 2: Whether there was commercial unfairness": "",
        "Applicable law": "79 Section 216 of the Companies Act provides shareholders with a personal remedy in cases where there has been “a visible departure from the standards of fair dealing and a violation of the conditions of fair play which a shareholder is entitled to expect”:Ho Yew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 (“Sakae Holdings”) at [81]. The touchstone is therefore commercial unfairness:Over & Over([78]supra) at [81]. This is a fact-specific inquiry that focuses on therelationshipbetween the specific parties:ThioSyn Kym Wendy and others v Thio Syn Pyn and others and other appeals[2018] 2 SLR 788 at [29]. 80 The key starting point for most claims under s 216 of the Companies Act is the commercial agreement between the parties:Ascend Field Pte Ltd and others v Tee WeeSien and another appeal[2020] 1 SLR 771 (“Ascend Field”) at [29]. This commercial agreement need not be enforceable as a matter of contract law to be worthy of protection under s 216 of the Companies Act. It is an agreement in the broadest sense as it may be found in informal understandings and assumptions attendant to the parties’ personal relationship (Over & Overat [84] and [87]). In assessing commercial fairness, the court is therefore entitled to consider not only the parties’ legal rights, but also their legitimate expectations (Sakae Holdingsat [82]). In this context, the term “legitimate expectation” describes the correlative “right” that the claimant shareholder is entitled to protect, a right that arises from the personal relationship between the parties (Re Saul D Harrison & Sons plc[1995] 1 BCLC 14 at 19–20 andO’Neill v Phillips[1999] 1 WLR 1092 (“O’Neill”) at 1100–1102).",
        "Parties’ relationship": "81 Mr Deniyal submits that the parties shared a relationship of mutual trust and confidence, such that there was a quasi-partnership. Both men were close friends who interacted on an informal basis.170Foot Note 170×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 14-15.In his pleaded case, Mr Niew initially denied being friends with Mr Deniyal.171Foot Note 171×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 9.However, Mr Niew admitted under cross-examination that Mr Deniyal was indeed an old friend, and that Mr Niew was “heartbroken” by Mr Deniyal’s actions in 2019.172Foot Note 172×NE, 9 February 2023, at 20-22; NE, 14 February 2023, at 10, lines 28-32, to 11, lines 1-6.Mr Niew further testified that even though Mr Deniyal had for “many years” contributed “nothing” to the business and was often absent from work, Mr Niew was willing to continue paying Mr Deniyal a salary on account of their long friendship.173Foot Note 173×NE, 14 February 2023, at 87, lines 5-20. 82 Mr Niew therefore fell back in his submissions to the point that trusting and having confidence in another as friends does not equate to a quasi-partnership. Moreover, Mr Niew submits that his dominant position in the Mapo Group’s hierarchy meant there could not have been a quasi-partnership, citingLeong Chee Kin (on behalf of himself and as a minority shareholder of Ideal Design Studio Pte Ltd) v Ideal Design Studio Pte Ltd and others[2018] 4 SLR 331 andLim Kok Wah and others v LimBoh Yong and others and other matters[2015] 5 SLR 307 (“Lim Kok Wah”) in support. The evidence shows that there was no reciprocal trust and confidence between Mr Niew and Mr Deniyal, and Mr Niew had ultimate control over the companies.174Foot Note 174×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 50-53; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 32.Any expectations that Mr Deniyal may have had were entirely subjective.175Foot Note 175×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 48.The mere fact that Mr Niew and Mr Deniyal were personal friends does not prove the existence of a quasi-partnership.176Foot Note 176×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 30-33. 83 Furthermore, Mr Niew also portrays Mr Deniyal’s involvement in the business as being limited toMatopo(see above at [14]). Mr Niew submits that Mr Deniyal therefore could not have been his quasi-partner in MEPL and MMPL.177Foot Note 177×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 70-76; 3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 33-35. Quasi-partnerships 84 Both parties appear to agree that a preliminary issue is whether MEPL and MMPL were quasi-partnerships, and if so, whether Mr Niew departed from legitimate expectations derived from such a status. Mr Niew submits that MEPL and MMPL were not quasi-partnerships, and no equitable considerations bound him. Mr Deniyal may thereforeonlyrely on legitimate expectations contained in the corporate constitutions of MEPL and MMPL.178Foot Note 178×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 54-55.Mr Deniyal on the other hand submits that there was a quasi-partnership and that Mr Niew’s conduct therefore ought to be held to a higher standard.179Foot Note 179×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 3-7.Alternatively, Mr Deniyal submits that legitimate expectations arising from implied or informal understandings may be taken into consideration even absent a finding of quasi-partnership.180Foot Note 180×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 16-24. 85 I do not consider that determining whether a company is in fact a quasi-partnership is always a necessary or necessarily useful step in the analysis. In particular, I do not accept Mr Niew’s contention that Mr Deniyal is limited to only those legitimate expectations contained in the corporate constitutions of MEPL and MMPL absent a finding of quasi-partnership. In my view, the focus should be on discerning thesubstance,parameters, andobjectivesof the parties’ commercial agreement (Over & Overat [87]). 86 It is useful to start with the House of Lords decision ofEbrahimi v Westbourne Galleries Ltd[1973] AC 360 (“Ebrahimi”). AlthoughEbrahimiconcerns the court’s power to grant a “just and equitable” winding-up (see s 125(1)(i) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed)), the principles stated therein remain authoritative in the context of claims under s 216 of the Companies Act (Over & Overat [79]–[80]). InEbrahimi, Lord Wilberforce first rejected the “tendency to create categories or headings under which cases must be brought” before intervention is justified (Ebrahimiat 374). Lord Wilberforce went on to hold (at 379-380): The foundation of it all lies in the words \"just and equitable\" and, if there is any respect in which some of the cases may be open to criticism, it is thatthe courts may sometimes have been too timorous in giving them full force. The words are a recognition of the factthat a limited company is more than a mere legal entity, with a personality in law of its own: that there is room in company law for recognition of the fact thatbehind it, or amongst it, there are individuals, with rights, expectations and obligations inter se which are not necessarily submerged in the company structure. That structure is defined by the Companies Act and by the articles of association by which shareholders agree to be bound. In most companies and in most contexts, this definition is sufficient and exhaustive, equally so whether the company is large or small. The \"just and equitable\" provision does not, as the respondents suggest, entitle one party to disregard the obligation he assumes by entering a company, nor the court to dispense him from it. It does, as equity always does,enable the court to subject the exercise of legal rights to equitable considerations; considerations, that is,of a personal character arising between one individual and another, which may make it unjust, or inequitable, to insist on legal rights, or to exercise them in a particular way. It would beimpossible, and wholly undesirable, to define the circumstances in which these considerations may arise. Certainly the fact that a company is a small one, or a private company, is not enough. There are very many of these where the association is a purely commercial one, of which it can safely be said that the basis of association is adequately and exhaustively laid down in the articles. The superimposition of equitable considerations requires something more, whichtypicallymay include one, or probably more, of the following elements: (i) an association formed or continued on the basis of a personal relationship, involving mutual confidence - this element will often be found where a pre-existing partnership has been converted into a limited company; (ii) an agreement, or understanding, that all, or some (for there may be \"sleeping\" members), of the shareholders shall participate in the conduct of the business; (iii) restriction upon the transfer of the members' interest in the company - so that if confidence is lost, or one member is removed from management, he cannot take out his stake and go elsewhere. It isthese,and analogous, factorswhich may bring into play the just and equitable clause, and they do so directly, through the force of the words themselves.To refer, as so many of the cases do, to \"quasi-partnerships\" or \"in substance partnerships\" may be convenient but may also be confusing. It may be convenient because it is the law of partnership which has developed the conceptions of probity, good faith and mutual confidence, and the remedies where these are absent, which become relevant once such factors as I have mentioned are found to exist: the words \"just and equitable\" sum these up in the law of partnership itself. And in many, but not necessarily all, cases there has been a pre-existing partnership the obligations of which it is reasonable to suppose continue to underlie the new company structure.But the expressions may be confusing if they obscure, or deny, the fact that the parties (possibly former partners) are now co-members in a company, who have accepted, in law, new obligations. A company, however small, however domestic, is a company not a partnership or even a quasi-partnershipand it is through the just and equitable clause that obligations, common to partnership relations, may come in. [emphasis added in italics and bold italics] I have set this out at length to properly contextualise the concept of “quasi-partnerships”. 87 First, it is clear that the equitable considerations that can restrain the exercise of strict legal rights are generated by thepersonal relationshipbetween individuals. In other words, the legitimate expectations to which the court gives effect are those of a personal character and are not derived from thestatusof the corporate entity. What is required is “a personal relationship or personal dealings of some kind between the party seeking to exercise the legal right and the party seeking to restrain such exercise, such as will affect the conscience of the former” (O’Neillat 1101, affirmingInre Astec (B.S.R.) Plc.[1998] 2 BCLC 556 at 588). As Valerie Thean J held inAnita Hatta v LeeSiow Kiang Georgia and others[2020] 5 SLR 304 (“Anita Hatta”), the absence or presence of a “quasi-partnership” does not determine whether legitimate expectations arising from implied or informal understandings may be taken into consideration. Instead, the focus remains on whether the circumstances of the parties’ personal relationship are such as to call for intervention (Anita Hattaat [69], citingFisher v Cadman and others[2006] BCLC 499 (“Fisher”) at [84]). I therefore disagree that there are necessarily any pre-defined set of legitimate expectations that can be “derived” from the status of a company. 88 Second, flowing from this first observation, the label “quasi-partnership” is no more than that: a convenient label (see alsoFisherat [84]). It is apt in the case of a pre-existing partnership that is subsequently incorporated. However, this label cannot be allowed to confuse or obscure the fact that the basis of intervention is s 216 of the Companies Act and not the law of partnership. It is incorrect to insist on the category or heading of “quasi-partnership” as a necessary pre-requisite before legitimate expectations may be taken into account:Lian Hwee Choo Phebe and another vMaxz Universal Development Group Pte Ltd and others and another suit[2010] SGHC 268 (“Phebe”) at [61] andThe Wellness Group Pte Ltd and another v OSIM International Ltd and others and another suit[2016] 3 SLR 729 at [181]. In my view, this label is particularly unhelpful given the great variety of commercial arrangements under which companies may be run. 89 To make finding a “quasi-partnership” a pre-requisite before the court may look into legitimate expectations arising from the parties’ personal relationship is to turn the proper analysis on its head. InOver & Over, the Court of Appealfirstfound as a matter of fact that the parties had associated on an informal basis and had agreed to consult one another on important financial and operational matters (Over & Overat [87]–[92]). The finding of “quasi-partnership” was aconclusionreached preciselybecausethe Court of Appeal found that the informal agreement to consult had been proven on the facts (Over & Overat [97]). 90 Third, Lord Wilberforce was at pains to clarify that the three elements are non-exhaustive illustrations that are not intended to constrain the analysis or delimit the circumstances in which equitable considerations may arise (also observed by the Court of Appeal inSim Yong Kim v Evenstar Investments Pte Ltd[2006] 3 SLR(R) 827 at [30]). A relationship of mutual trust and confidence is therefore neither necessary nor sufficient, but remains relevant to determining what the parties’ commercial agreement was. As Andrew Ang J held inPhebe, the courts should always consider the circumstances of the parties’ relationships and any understanding or expectations between them, regardless of whether or not a quasi-partnership is found (at [61]). For this reason, the personal relationship between parties is important to the court’s task to determine the true extent and content of the commercial agreement between the parties (see above at [80]). 91 I therefore focus on determining the substance of the commercial agreement between Mr Niew and Mr Deniyal as demonstrated by the evidence, keeping in mind the essential context of their personal relationship (seeAnita Hattaat [72]). My findings 92 I accept that the parties operated with a considerable degree of informality. Mr Deniyal’s employment was not governed by any written employment contract181Foot Note 181×NE, 9 February 2023, at 33, lines 17-24, at 34, lines 22-25, at 35, lines 26-29, and 50, lines 6-9.and the men mostly communicated orally.182Foot Note 182×NE, 9 February 2023, at 35, lines 5-31.The men did not negotiate and draft a written shareholders’ agreement.183Foot Note 183×NE, 9 February 2023, at 30, lines 25-32, and 31, line 1.I accept Mr Deniyal’s testimony that there were no formal annual general meetings or board meetings.184Foot Note 184×NE, 2 February 2023, at 56, lines 22-25; NE, 8 February 2023, at 27, lines 16-20.Mr Deniyal’s shares were not acquired as part of an arms-length commercial transaction and Mr Niew had gifted Mr Deniyal his shares at least in part because of their long friendship.185Foot Note 185×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 10(c); Niew’s AEIC at paras 25-26; NE, 9 February 2023, at 56, lines 13-15.Mr Niew even described his system of recording the personal loans allegedly extended to Mr Deniyal as being “very casual”.186Foot Note 186×NE, 15 February 2023, at 17, lines 9-10.I therefore accept that the parties may have shared informal understandings or assumptions that were not reduced to writing or put into formal agreement. 93 Crucially, Mr Niew and Mr Deniyal agree that the reason why Mr Deniyal was gifted shares in MEPL and MMPL was because Mr Niew wanted to reward Mr Deniyal and provide him with an incentive to stay with the Mapo Group in the long term (see above at [23]–[28]).187Foot Note 187×Plaintiff’s Closing Submissions dated 29 March 2023 at para 23; Niew’s AEIC at paras 33-34.Mr Niew repeatedly and consistently testified that this was precisely the reason why he gifted Mr Deniyal shares in both MEPL and MMPL.188Foot Note 188×NE, 9 February 2023, at 10, lines 21-22, at 27, lines 11-12, at 53, lines 21-31, at 58, line 19, at 60, lines 9-10, at 66, line 13, and 68, lines 12-14.In fact, Mr Niew clarified that the intention behind the shares was to ensure that Mr Deniyal would stay within the Mapo Group, not just any one specific company.189Foot Note 189×NE, 9 February 2023, at 66, line 13. 94 In my view, these reasons explaining why Mr Deniyal became a shareholder reveal the basis for the parties’ association as members of MEPL and MMPL. Flowing from these reasons, Mr Deniyal had a legitimate expectation to be treated fairly by Mr Niew in relation to the success of MEPL and MMPL, to which he contributed. Mr Niew was thus bound by equitable considerations of fairness in relation to how, as the majority shareholder, he dealt with profit sharing, whether declared by way of dividends or paid out as directors’ fees. This was not a mere subjective expectation. 95 Mr Niew’s reliance onLim Kok Wahfor the proposition that the presence of an autocratic controller in a company precludes a finding of quasi-partnership is misplaced.Lim Kok Wahconcerned two companies run by members of a family: a father and his sons. In that case, the court held that there was no quasi-partnership and found that the father ran the companies in question as an “autocratic patriarch” who had an “overriding say”. Accordingly, the patriarch’s sons accepted his authority and followed his decisions unquestioningly until his passing. There was therefore no relationship of mutual trust and confidence between thesons. Nevertheless, the court found that it was “undoubtedly true that there existed in each company a bilateral relationship of mutual trust and confidencebetween [the father] and each son” [emphasis added] (at [112]). Contrary to Mr Niew’s submission,Lim Kok Wahtherefore stands for the converse proposition that a relationship of mutual trust and confidence may subsist notwithstanding the dominant power of one shareholder. Furthermore, a quasi-partnership may subsist notwithstanding the fact that the members undertake differentiated responsibilities (Ascend Fieldat [41]), or the fact that one party is treated as a subordinate to the other (Lim Ah Sia v TiongTuang Yeong and others[2014] 4 SLR 140 at [64]). In my view, the fact-specific nature of the inquiry requires focus on the specific context of Mr Niew and Mr Deniyal’s relationship. For example, given the evidence of the nature of their association, I would not have accepted a claim that Mr Deniyal had a legitimate expectation to have a say in the overall business development of the Mapo Group, or a claim that Mr Deniyal had a legitimate expectation to control matters in Sembcorp Yard. It is the actual facets of the relationship between the parties in question that delineates the scope of the commercial agreement, rather than an abstract categorisation of “quasi-partnership”. 96 I found Mr Niew particularly prone to equivocation on the issue of whether he trusted Mr Deniyal. Mr Niew initially denied that Mr Deniyal had been made a shareholder and director of MEPL and MMPL because he trusted Mr Deniyal.190Foot Note 190×NE, 9 February 2023, at 27, lines 1-6.However, the various explanations provided by Mr Niew point inexorably to the contrary conclusion. As already stated, Mr Niew explained that he had wanted to incentivise Mr Deniyal to stay with the Mapo Group in the long term.191Foot Note 191×NE, 9 February 2023, at 27, lines 11-12, and 53, line 27.Mr Niew also testified that he trusted Mr Deniyal professionally and believed that Mr Deniyal would do a good job.192Foot Note 192×NE, 9 February 2023, at 28, line 24, to 30, line 15.I was unimpressed by Mr Niew’s repeated refrain that there are “many types of friends” and “many types of trust”.193Foot Note 193×NE, 9 February 2023, at 29, lines 16-22.This was another example of Mr Niew pre-empting cross-examination (see above at [65]). 97 As for Mr Niew’s submission that Mr Deniyal’s involvement was limited to Matopo (see above at [14]), I do not accept Mr Niew’s reliance on the technical distinction between the entities in the Mapo Group. In the first place, Mr Niew’s pleadings did not take issue with which entity employed Mr Deniyal.194Foot Note 194×NE, 9 February 2023, at 38-42.Instead, Mr Niew’s pleaded defence states that Mr Deniyal was employed by MMS, MEPL, and MMPL.195Foot Note 195×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 8(e), 12(c), 19(c), and 21.When explaining how business declined in Keppel Yard in 2019 (see above at [39]), Mr Niew stated that it was because fewer projects were awarded toMEPL.196Foot Note 196×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 19(c); Plaintiff’s Reply Submissions dated 12 April 2023 at para 26.Under cross-examination, Mr Niew could not give a straight answer when questioned on which entity employed Mr Deniyal.197Foot Note 197×NE, 9 February 2023, at 36.Mr Niew’s attempt to place emphasis on which entity paid Mr Deniyal’s salary was also undermined when Mr Niew testified that he was not particularly concerned about which company in the Mapo Group paid Mr Deniyal’s salary and disagreed that the source of salary payments was indicative of which entity was the employer.198Foot Note 198×NE, 9 February 2023, at 44, lines 14-32, to 45, lines 1-15, and 50, lines 15-21; NE, 9 February 2023, at 48, lines 21-24.After all, Mr Niew’s evidence is that Mr Deniyal was only placed on Matopo’s payroll in November 2018.199Foot Note 199×Niew’s AEIC at para 18; NE, 9 February 2023, at 47-48.The objective evidence is also equivocal. As stated, no formal employment agreement was adduced. The available records show that different entities in the Mapo Group made Central Provident Fund contributions to Mr Deniyal over different years.200Foot Note 200×Agreed Bundle of Documents, Volume 6 at 156-161 and 163-177.Mr Deniyal tendered a business card bearing the title of “Senior Operation Manager”, which was embossed with the names of all four companies in the Mapo Group, not just Matopo or MEPL.201Foot Note 201×Plaintiff’s Bundle of Documents at 5.Mr Niew created this business card.202Foot Note 202×NE, 9 February 2023, at 72, lines 23-24, and 73, lines 1-15.Mr Deniyal’s access pass to Keppel Yard also identified him as a director of Matopo,203Foot Note 203×Plaintiff’s Bundle of Documents at 4.although this was never the case.204Foot Note 204×NE, 1 February 2023, at 5, lines 4-6, and 52, lines 26-29.Mr Ong’s evidence was that Mr Deniyal was involved in the management of operations for both MEPL and MMPL, and that the three men had been the “senior management team” who cooperated on operational matters.205Foot Note 205×NE, 3 February 2023, at 11, lines 14-32.I find that as far as the parties were concerned, Mr Deniyal carried out his duties and contributed his efforts to the Mapo Group as a business. 98 Having set out my findings on the nature of the parties’ relationship, I now turn to address Mr Deniyal’s various allegations.",
        "Obstruction and lack of access to documents": "99 Mr Deniyal complains that, from the outset, he was not given unfettered access to financial accounts and documents of MEPL and MMPL, such as monthly management accounts, balance sheets, and profit and loss accounts.206Foot Note 206×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 18; Deniyal’s AEIC at para 23.Mr Deniyal’s position is that he was entitled to these documents as a director, but Mr Niew refused to grant him access.207Foot Note 207×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 20; Deniyal’s AEIC at para 29.Mr Deniyal had initially acquiesced to this state of affairs because Mr Niew had assured him that the financial aspects of the business would be well handled, which Mr Deniyal accepted on the basis of trust and confidence.208Foot Note 208×Deniyal’s AEIC at para 23.Even after suspicions were raised in 2018, Mr Deniyal did not insist upon being given the documents as he trusted Mr Niew and was persuaded by him.209Foot Note 209×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 20; Deniyal’s AEIC at para 29.When it was put to Mr Deniyal that he could simply have asked Ms Cindy to provide him with documents, Mr Deniyal’s explanation was that Ms Cindy would have first sought Mr Niew’s approval, and Mr Deniyal did not want to risk losing Mr Niew’s trust.210Foot Note 210×NE, 31 January 2023, at 68, lines 13-31, to 69, lines 1-13.After their falling out, Mr Niew’s dismissal of Mr Deniyal on 13 February 2020 was intended to prevent Mr Deniyal from accessing MEPL and MMPL’s documents and uncovering conclusive evidence of Mr Niew’s wrongdoing.211Foot Note 211×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 23; Deniyal’s AEIC at para 33.Mr Niew has therefore obstructed Mr Deniyal’s right to receive monthly management accounts since 2019.212Foot Note 212×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 21. 100 Mr Niew submits that Mr Deniyal was entirely uninterested in the administration of MEPL and MMPL and had never requested access to any documents prior to the formal demands in December 2019. Accordingly, Mr Deniyal was not and could not have been prevented from accessing any documents by Mr Niew. The allegation that Mr Deniyal’s employment had been terminated to obstruct him from uncovering conclusive evidence of wrongdoing is entirely spurious as Mr Deniyal remains to date a director of MEPL and MMPL and has never been denied the right to receive the documents.213Foot Note 213×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 17-18, 21; Niew’s AEIC at paras 50-53.In fact, even after Mr Deniyal’s dismissal, Mr Niew continued to offer Mr Deniyal the opportunity to inspect the documents at the office premises, an offer that Mr Deniyal himself declined to take up.214Foot Note 214×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 79. 101 In my view, the truth is that Mr Deniyal was for the most part uninterested in the financial accounts of the companies. Mr Deniyal admitted under cross-examination that he did not ask for access to the documents as he did not want to lose Mr Niew’s trust.215Foot Note 215×NE, 31 January 2023, at 69, lines 28-29, and 70, lines 1-4; NE, 1 February 2023, at 3, lines 26-28.Mr Deniyal’s own case is that he only realised that he ought to have been provided with monthly accounts sometime in 2018,216Foot Note 216×Deniyal’s AEIC at para 29.and he testified that he only became interested in the documents in recent years.217Foot Note 217×NE, 31 January 2023, at 70, lines 23-24.As Mr Deniyal declined to inspect the documents when invited to do so, it cannot be said that he was denied access. 102 Mr Deniyal’s main gripe appears to be centred around themannerin which he was asked to sign financial documents throughout the years. In essence, Mr Deniyal says that he was made to sign incomplete financial documents on short notice and without adequate time to process their contents. Mr Niew or Ms Cindy would typically request that Mr Deniyal attend at the main office. Upon his arrival, Mr Deniyal would then be handed documents and would be told that they needed to be urgently signed and submitted by the end of the same day. The pages requiring his signature would already be flagged out. He would not be provided documents to review in advance and he was not provided with the complete documents before being asked to sign them. Although Mr Deniyal had difficulties understanding financial documents as he only received formal schooling until the lower secondary level, he nevertheless signed off on them “unquestioningly” because of express assurances by Mr Niew that the accounts were prepared properly.218Foot Note 218×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 18; Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 18(c), 24, 26, and 33; Deniyal’s AEIC at para 24.Mr Deniyal testified that he was given only a few pages of documents rather than a full set of documents and only looked at those pages earmarked for his signature.219Foot Note 219×NE, 1 February 2023, at 11, lines 3-27, and 12, lines 3-8; NE, 2 February 2023, at 46, lines 1-17, and 53, lines 12-26.The fact that Mr Deniyal signed the documents therefore does not mean that he was fully aware of or understood their contents.220Foot Note 220×Plaintiff’s Reply Submissions dated 12 April 2023 at paras 14(c) and 34. 103 Mr Niew does not know whether Mr Deniyal attempted to review the documents and was not informed that Mr Deniyal had any difficulties doing so.221Foot Note 221×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 18.Nevertheless, Mr Niew’s position is that Mr Deniyal was in fact always provided the full financial documents and was given enough time to review them before signing. Mr Niew was able to review the documents despite only being qualified at the primary school level and possessing a lower level of English proficiency. Mr Niew never took any positive steps to physically prevent Mr Deniyal from reviewing the documents. Therefore, it was entirely Mr Deniyal’s own choice not to read the statements.222Foot Note 222×Niew’s AEIC at paras 56-62; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 80.It was his duty to do so, and Mr Niew cannot be blamed for Mr Deniyal’s own failings. 104 The starting point is that the denial of access to information may in some circumstances amount to commercial unfairness:Lim Chee Twang v ChanShuk Kuen Helina and others[2010] 2 SLR 209 (“Lim Chee Twang”) at [132(b)]. This should apply equally to cases where access is so circumscribed as to be unreasonable. However, Mr Deniyal’s evidence is that Ms Cindy was the person who would hand him the documents and instruct him to sign them before the end of the day.223Foot Note 223×NE, 31 January 2023, at 73, lines 6-32, to 74, lines 1-32.Given the two competing accounts, Mr Deniyal should have but failed to call Ms Cindy to buttress his case (see above at [69]). On the other hand, despite Mr Niew’s pleaded position, Mr Niew’s own testimony suggests some truth in Mr Deniyal’s story. It stood out to me that Mr Niew testified that both men only signed two documents a year, and that they had “only signed because accounts asked us to sign”. Mr Niew did not profess to know the nature of these documents.224Foot Note 224×NE, 9 February 2023, at 31, lines 29-30.On the evidence, Mr Deniyal appears for a long time to have been content to take an easy-going and indeed oblivious approach to signing documents. Certainly, Mr Deniyal has failed to discharge his burden of proving this allegation of denial of access and information:Tan Chin Hock v Teo Cher Koon and another and another appeal[2022] 2 SLR 314 (“Tan Chin Hock”) at [31].",
        "Diversion of funds to Matopo": "105 According to Mr Deniyal, Mr Niew caused funds to be diverted from MEPL and/or MMPL to Matopo without Mr Deniyal’s knowledge or approval by way of purported loans that were not repaid to MEPL and/or MMPL. In truth, Mr Niew extracted the funds for his sole benefit by causing Matopo to declare substantial dividends and directors’ fees as its sole shareholder and director.225Foot Note 225×Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 27-30, 33; Plaintiff’s Closing Submissions dated 29 March 2023 at para 32; Deniyal’s AEIC at paras 36, 45. 106 In particular, Mr Deniyal questions two particular transactions. 107 First, MEPL’s general ledger for 2014 records a transaction dated 28 May 2014 in Mr Niew’s directors’ account for a “LOAN TO COMPANY (FOR MATOPO PUR.NO.129)” of $540,000, recorded under the header “CREDIT”.226Foot Note 226×Agreed Bundle of Documents, Volume 2 (“2AB”) at 14.The effect of this transaction was that MEPL thereafter owed a further sum of $540,000 to Mr Niew. Mr Deniyal surmises that this meant that MEPL had purchased something on behalf of Matopo, and Mr Niew loaned money to MEPL to finance that purchase. Mr Deniyal questions why MEPL would make a purchase for Matopo’s benefit, whether incurring such expenses would benefit MEPL, whether the $540,000 even originated from Mr Niew, and why it was necessary for MEPL to be involved in what was essentially a loan from Mr Niew to Matopo. Mr Deniyal submits that there is no good explanation for the transaction, and Mr Niew’s failure to provide any explanation at all is highly suspect.227Foot Note 227×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 33-35. 108 Second, MEPL’s general ledger for 2014 also records a transaction dated 10 July 2014 in Mr Niew’s directors’ account labelled “MATOPO LOAN TO MEPL” for the amount of $450,000, recorded under the header “DEBIT”.228Foot Note 228×2AB at 14.The effect of this transaction was that the total amount owed by MEPL to Mr Niew was reduced by $450,000. Mr Deniyal questions how Mr Niew can legitimately withdraw what appears to be money for a loan from Matopo to MEPL via his own personal directors’ account.229Foot Note 229×Plaintiff’s Closing Submissions dated 29 March 2023 at para 36.Mr Deniyal submits that this records that MEPL incurred liabilities of $450,000 to Matopo.230Foot Note 230×Plaintiff’s Closing Submissions dated 29 March 2023 at para 36(b). 109 Mr Niew denies that directors’ fees declared by Matopo were funded by loans extended by MEPL and/or MMPL. Instead, the ledgers record that MEPL and MMPL are indebted to Matopo. Furthermore, as Mr Deniyal was not involved in the operations of MEPL and MMPL, Mr Niew did not need to inform or seek Mr Deniyal’s approval before loans could be extended to Matopo.231Foot Note 231×Niew’s AEIC at paras 107-109.Mr Deniyal’s claims are pure speculation unsupported by any evidence and these specific transactions were not put to Mr Niew.232Foot Note 232×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 83-88; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 53.For the transaction dated 28 May 2014 concerning the amount of $540,000, Mr Niew submits that it is illogical to assume that MEPL must have made a purchase on Matopo’s behalf. The ledger simply records a loan from Mr Niew to MEPL and the purpose of the transaction is irrelevant.233Foot Note 233×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 54.For the transaction dated 10 July 2014 concerning the amount of $450,000, Mr Niew explains that this clearly relates to a loan from Matopo to MEPL.234Foot Note 234×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 55.Mr Niew submits that the transactions do not support Mr Deniyal’s theory as there was no outflow of moneys from MEPL. 110 While I accept that Mr Deniyal’s allegations are largely conjecture on the purpose of the two transactions, I also note that the ledgers do not clearly or expressly support Mr Niew’s explanations. Neither party called expert evidence or even any member of the companies’ accounts department to explain the transactions. The truncated descriptions in the ledger elude a definitive interpretation. To illustrate, the debit transaction for $450,000 labelled “MATOPO LOAN TO MEPL” could be either a repayment of a prior loan from Matopo to MEPL or the loan capital itself. This does not explain why this transaction is recorded as a debit transaction in Mr Niew’s directors’ account, which has the effect ofreducingMEPL’s debtto Mr Niew. Furthermore, I note that the documents explaining the purpose of the $450,000 debit transaction were destroyed by Mr Niew in February 2020, afterMr Niew had already been put on notice about the need to preserve records and promised to do the same (see above at [61] and [64]).235Foot Note 235×8th Affidavit of Niew Bock Leng dated 4 April 2022 at 10-11. 111 Nevertheless, while some aspects of these transactions remained unclear, Mr Deniyal’s allegations were not proved on the evidence before me.",
        "Unilaterally increasing salary": "112 It is undisputed that until April 2020, Mr Niew drew a monthly salary of $7,000 from both Matopo and MMSPL, receiving an aggregate of $14,000 each month. Mr Niew did not drawanysalary from MEPL or MMPL. From May 2020 onwards, Mr Niew ceased to be on the payrolls of Matopo and MMSPL and instead started to draw a monthly salary of $20,000 from both MEPL and MMPL, receiving an aggregate of $40,000 each month. In May 2021, Mr Niew’s salary from MMPL was increased to $30,000, resulting in an aggregate salary of $50,000 each month.236Foot Note 236×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 36; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 34; 1st & 2nd Defendant’s Defence (Amendment No 1) dated 28 September 2022 at para 18(a); Niew’s AEIC at para 110; NE, 14 February 2023, at 88-89. Mr Deniyal’s submissions 113 Mr Deniyal submits that it is clearly unfair that Mr Niew more than tripled his salary shortly after dismissing Mr Deniyal in February 2020, and that the shift from the payrolls of Matopo and MMSPL to the payrolls of MEPL and MMPL was calculated to diminish the funds of the companies in which Mr Deniyal held a stake. In the time since dismissing Mr Deniyal, Mr Niew has drawn a sum total of approximately $1.85m from MEPL and MMPL, when he previously drew nothing from the companies.237Foot Note 237×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 36; Plaintiff’s Closing Submissions dated 29 March 2023 at paras 40-41.Additionally, Mr Deniyal submits that this contravenes the corporate constitutions of both MEPL and MMPL, which require a board meeting or general meeting to be called before a director’s remuneration may be increased.238Foot Note 238×Plaintiff’s Closing Submissions dated 29 March 2023 at para 42.To buttress his claim, Mr Deniyal draws attention to Mr Niew’s cavalier attitude, as Mr Niew regarded increases of his own salary as a matter of pure discretion.239Foot Note 239×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 38-39. 114 Article 80 of MEPL’s Memorandum and Articles of Association (“MEPL’s Constitution”) provides that:240Foot Note 240×Exhibit P1. The remuneration of the directors shall from time to time be determined by the company in general meeting. The remuneration shall be deemed to accrue from day to day. The director may also be paid all travelling, hotel, and other expenses properly incurred by them in attending and returning from meetings of the directors or any committee of the directors or general meetings of the company or in connection with the business of the company. Article 70 of MMPL’s Memorandum and Articles of Association (“MMPL’s Constitution”) replicates substantially the same terms but adopts the plural form “directors”.241Foot Note 241×Exhibit P2. 115 Alternatively, Mr Deniyal submits that any increases in a director’s salary must be determined by a board meeting, pursuant to s 169 of the Companies Act.242Foot Note 242×Plaintiff’s Reply Submissions dated 12 April 2023 at para 40.Section 169 of the Companies Act provides: Provision and improvement of director’s emoluments 169.—(1)  A company must not at any meeting or otherwise provide emoluments or improve emoluments for a director of a company in respect of his or her office as such unless the provision is approved by a resolution that is not related to other matters and any resolution passed in breach of this section is void. (2)  In this section, “emoluments” in relation to a director includes fees and percentages, any sums paid by way of expenses allowance insofar as those sums are charged to income tax in Singapore, any contribution paid in respect of a director under any pension scheme and any benefits received by him or her otherwise than in cash in respect of his or her services as director. Mr Niew’s submissions 116 Mr Niew takes the position that he is fully entitled to decide his own salary, being the majority shareholder and director of both companies.243Foot Note 243×Niew’s AEIC at para 110.Having dedicated himself over many years to growing the business, a salary increase was well justified.244Foot Note 244×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 90; NE, 15 February 2023, at 33, lines 11-19.Mr Niew submits that Mr Deniyal had conceded during cross-examination that the quantum of compensation was fair for the amount of work undertaken by Mr Niew,245Foot Note 245×NE, 8 February 2023, at 12-13.and it therefore cannot be described as excessive.246Foot Note 246×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 92-94; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 59.The Articles relied upon by Mr Deniyal do not apply tosalaryincreases, but to “directors’ remuneration”.247Foot Note 247×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 60A(b); 3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 98-99.In any event, Mr Niew submits that Mr Deniyal cannot rely upon a breach of legitimate expectations as Mr Deniyal was not aware of the provisions of the corporate constitution of either company prior to the trial and they had never discussed these provisions.248Foot Note 248×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 60A(c); 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 96.It is also undisputed that MEPL and MMPL did not have the practice of requiring a board meeting or general meeting to decide on salary increases.249Foot Note 249×NE, 8 February 2023, at 10, lines 16-28; 3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 91 and 97.As mentioned (above at [60]), Mr Niew adduced written minutes in the midst of trial to show that directors’ remuneration were ratified at general meeting.250Foot Note 250×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 100.Mr Niew submits that this shows that any increases had been properly ratified. Change of payroll amounts to commercial unfairness 117 I find that Mr Niew’s act of drawing a significantly larger salary from MEPL and MMPL shortly after terminating Mr Deniyal’s employment amounts to commercial unfairness. Although Mr Niew was generally entitled to draw a salary commensurate to his efforts and contribution, the unfairness lies in themannerin which Mr Niew carried out this change. I find that the timing of Mr Niew’s decision to place himself on the payrolls of MEPL and MMPL very shortly after terminating Mr Deniyal shows that the two events were linked. Mr Deniyal was not a shareholder of Matopo and MMSPL, only of MEPL and MMPL. Thus, the change in payroll would have the effect of diminishing the funds of only those companies in which Mr Deniyal held a stake. No proper explanation was provided for this change. The change was also effected only after Mr Niew had received the R&T Demand Letter, which included a demand for Mr Deniyal’s unpaid dividends and directors’ fees.251Foot Note 251×1AB at 50.Furthermore, although on the state of the evidence before me I make no finding as to whether Mr Niew’s salary is excessive, it cannot be denied that Mr Niew significantly increased his salary immediately after Mr Deniyal was terminated. Mr Niew denied that this increase was necessary because he took over Mr Deniyal’s duties.252Foot Note 252×NE, 14 February 2023, at 83.In fact, Mr Niew testified that no general meeting had been called and Mr Deniyal was not informed before Mr Niew increased his own salary. Instead, Mr Niew had informed Mr Deniyal of the increase by way of a threat: he told Mr Deniyal to “Settle the things quickly. If you don’t, I will increase my salary”.253Foot Note 253×NE, 3 February 2023, at 28, lines 2-7.Employing corporate mechanisms as a punitive tool may well amount to commercial unfairness (see,eg,ReGee Hoe Chan Trading Co Pte Ltd[1991] 2 SLR(R) 114 (“Gee Hoe Chan”) at [20]). The combination of changing which companies paid his salary as well as his unilateral increase of that salary was commercially unfair to Mr Deniyal. 118 I reject Mr Niew’s claim that the increase in directors’ remuneration had been ratified at general meeting. On the sixth day of trial, Mr Niew adduced minutes of the general meetings of MEPL and MMPL purportedly held in the morning of 13 August 2020.254Foot Note 254×Exhibits D3 and D9.These minutes record that the members of MEPL and MMPL passed resolutions at a general meeting approving and ratifying directors’ remuneration paid to Mr Niew during the period when he started to draw an increased salary from MEPL and MMPL. I note that the quantum of directors’ remuneration approved and ratified far exceeds the amounts recorded for prior years. Both sets of minutes record that Mr Niew and Ms Celesty were present, whereas Mr Deniyal was absent. The corporate constitutions of both companies require a quorum of two members for business to be transacted at a general meeting of the members.255Foot Note 255×Exhibit P1 at 15; Exhibit P2 at 6.But it is undisputed that Ms Celesty only acquired her shareholding on2 April 2021and therefore could not have voted as a member (see above at [7]–[8]). This in turn raises concerns about these minutes, as they incorrectly represent that Ms Celesty voted as a member of MEPL and MMPL on 13 August 2020. 119 I do not consider it relevant that Mr Deniyal was ignorant of the companies’ corporate constitutions until the eve of trial. It is well established that a breach of a company’s constitutional documents can give rise to commercial unfairness (Sakae Holdings([79]supra) at [172]). Legitimate expectations are not confined to actual expectations subjectively held by the claimant. This can hardly describe the full breadth of the conditions of fair play a shareholder is entitled to expect, which remains an objective assessment (Sakae Holdings([79]supra) at [81]). For example, inSakae Holdings, the Court of Appeal held that the claimant in that case would clearly have had a legitimate expectation that funds would not be siphoned away by the defendants, even though the claimants had no knowledge of the misappropriation as the defendants had taken great pains to conceal their fraud (at [126]). In any event, a shareholder would certainly have a legitimate expectation that the corporate constitution would generally be complied with on important matters. 120 As for whether Mr Niew acted in breach of Article 80 of MEPL’s Constitution and Article 70 of MMPL’s Constitution, the Court of Appeal interpreted a very similar provision inHeap Huat Rubber CompanySdn Bhd and Others v Kong Choot Sian and Others[2004] SGCA 12. In that case, it was submitted that directors’ fees are distinct from directors’ salaries, such that only directors’ fees required determination at a general meeting. The Court of Appeal rejected this argument and held that the provision includesbothdirectors’ fees and salaries. The critical distinction is not between “fees” and “salaries”, but thepurposefor which the remuneration was paid (at [47]–[51]). Moreover, conduct can be commercially unfair without being unlawful (Over & Over([78]supra) at [85]). Even if Mr Niew did not breach the corporate constitutions of MEPL and MMPL, this does not mean that what he did was not commercially unfair. I have already found that the unfairness arose from the manner in which Mr Niew placed himself on the payroll of MEPL and MMPL. 121 Mr Niew’s submission that the companies did not have the practice of requiring a board or general meeting before deciding on salary increases reinforces my finding that Mr Niew and Mr Deniyal operated on an informal basis (see above at [92]). I fully agree that there may be informal assent, if unanimous, without the need for a formal resolution (Yong Kheng Leong and another vPanweld Trading Pte Ltd and another[2013] 1 SLR 173 at [25]). However, regardless of whether the salary was paid to Mr Niewquadirector orquaexecutive of MEPL and MMPL, the truth is that the payments were not approved byanyshareholders’ordirectors’ resolution, informal or otherwise. Aside from the defective written resolutions (see above at [118]), the fact remains that Mr Niew increased his salary in May 2020, onlyafterMr Deniyal had already been terminated and their relationship had soured. There is no indication that Mr Deniyal ever assented to this change in which company paid Mr Niew’s salary and in what amount. Mr Niew’s own evidence was that he believed himself fully entitled to increase his own salary without consulting Mr Deniyal. 122 Mr Deniyal had a legitimate expectation to be treated fairly by Mr Niew and to share in the profits of MEPL and MMPL (above at [94]). By placing himself on the payrolls of MEPL and MMPL immediately after terminating Mr Deniyal’s employment, Mr Niew acted in a manner that was commercially unfair. This benefit was reserved for Mr Niew alone, as Mr Deniyal was no longer entitled to draw a salary. Mr Niew carried out this act with a complete disregard for Mr Deniyal’s interest as a shareholder of the companies. Mr Niew neither informed Mr Deniyal of this change nor sought his input whether informally or through a board or general meeting.",
        "Misappropriation of payments from Malaysian Companies": "123 Mr Deniyal tendered evidence of sales from MEPL to the Malaysian Companies in the form of records titled “TRANSACTION LISTING (INVOICE)”. These records are dated between 2009 to 2012 and show invoiced amounts totalling $1,881,251.58.256Foot Note 256×Agreed Bundle of Documents, Volume 4 (“4AB”) at 466-469. 124 Mr Deniyal asserts that Mr Niew misappropriated the sum of $1,881,251.58 from MEPL.257Foot Note 257×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 37.Mr Deniyal’s evidence is that Ms Cindy had told him that this money was paid directly to Mr Niew instead of MEPL.258Foot Note 258×Deniyal’s AEIC at paras 28(b), 49.As Mr Niew correctly points out, this is inadmissible hearsay in so far as Mr Deniyal seeks to rely on this conversation as evidence that the money was in fact paid directly to Mr Niew.259Foot Note 259×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 62.Once again, Mr Deniyal must accept the consequences of his failure to call Ms Cindy (see above at [69]). No doubt appreciating this difficulty, Mr Deniyal also submits that MEPL’s general ledgers for the corresponding period of 2009 to 2012 do not record MEPL receiving any of the invoiced amounts.260Foot Note 260×Plaintiff’s Closing Submissions dated 29 March 2023 at para 43. 125 Mr Niew’s pleaded case is that “MEPL did not sell goods and services to [the Malaysian Companies] amounting to $1,881,251.58”.261Foot Note 261×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 35; 1st & 2nd Defendant’s Defence (Amendment No 1) dated 28 September 2022 at para 18(b).I take this to mean that Mr Niew does not admit to the quantum of sales, as Mr Niew confirmed on affidavit that MEPL did transact with the Malaysian Companies. Mr Niew denies misappropriating the money.262Foot Note 262×Niew’s AEIC at para 114. 126 On 26 January 2023, three working days before the start of the trial, Mr Niew tendered a hardcopy bundle of documents which included what is described as “General Ledger entries for Mapo Engineering Pte Ltd relating to YR Marine & Engineering Sdn Bhd” (the “YR Marine Records”).263Foot Note 263×1DBOD at Tab 3.This is another example of Mr Niew’s belated disclosure of documents (see above at [64]). The YR Marine Records were not disclosed during general discovery264Foot Note 264×Plaintiff’s Closing Submissions dated 29 March 2023 at para 44.and Mr Niew only provided an affidavit verifying the new list of documents which included the YR Marine Records on 30 January 2023.265Foot Note 265×12th Affidavit of Niew Bock Leng dated 30 January 2023.Surprisingly, when cross-examined on the YR Marine Records, Mr Niew testified that he had not seen them before.266Foot Note 266×NE, 14 February 2023, at 61, line 23.When pressed on their contents, Mr Niew replied that counsel for Mr Deniyal would “have to ask the accounts to come here and explain”.267Foot Note 267×NE, 14 February 2023, at 62, lines 6-7.In my view, this was an unsatisfactory response as the YR Marine Records had been tendered by Mr Niew in support of his case. 127 Mr Deniyal suggests that the YR Marine Records are fabricated, pointing out their tardy disclosure and the formatting differences between MEPL’s general ledgers and the YR Marine Records. Mr Deniyal submits that these formatting differences cannot be explained by the fact that Goods & Services Tax is not payable on the exports to the Malaysian Companies, because the general ledgers also do not provide headings for taxes.268Foot Note 268×Plaintiff’s Closing Submissions dated 29 March 2023 at para 45(b).Mr Deniyal submits that the late disclosure of the YR Marine Records proves that Mr Niew has been selectively disclosing documents. Furthermore, the entries show that MEPL received a total of $164,703.60, far short of the $1,881,251.58 owed.269Foot Note 269×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 45-46.Mr Deniyal therefore submits that substantial sums remain unaccounted for. 128 Although Mr Niew denies having fabricated the YR Marine Records,270Foot Note 270×NE, 14 February 2023, at 67, lines 12-24.the provenance of the YR Marine Records remains unknown given that they were allegedly prepared by MEPL’s accounts department rather than by Mr Niew. Nevertheless, Mr Niew submits that Mr Deniyal has not adduced any direct evidence that the money was diverted to Mr Niew and has therefore failed to discharge the burden of proving this allegation. In contrast, the YR Marine Records show that payments were in fact received by MEPL.271Foot Note 271×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 103-104; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 64. 129 Given the circumstances, I do not place any reliance on the YR Marine Records. However, the burden remains on Mr Deniyal to prove his allegation that Mr Niew misappropriated the payments. Having failed to call Ms Cindy, Mr Deniyal has insufficient evidence to support his claim. I decline to make a finding on the available evidence and hold that Mr Deniyal fails to prove this allegation (Tan Chin Hock([104]supra) at [31]).",
        "Failing to collect trade receivables in MEPL without good reason": "130 Mr Deniyal alleges that Mr Niew delayed collecting trade receivables in MEPL during a period from 2005 to 2018 without any good reason. Mr Deniyal complains that most of the trade receivables remained due for over 61 days and that the reported sales receivables fell far short of what was reported as sales income. According to Mr Deniyal, such delay amounts to evidence of fraudulent accounting or endemic mismanagement on the part of Mr Niew.272Foot Note 272×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 38.In his submissions, Mr Deniyal took this allegation a step further by speculating that Mr Niew “could very well have pocketed these monies personally”.273Foot Note 273×Plaintiff’s Closing Submissions dated 29 March 2023 at para 48. 131 Mr Niew denies intentionally delaying the collection of trade receivables. There are a multitude of possible reasons for why counterparties may fail to make timely payment, none of which suggest fraud or mismanagement on Mr Niew’s part. MEPL’s accounts were audited by independent accountants without any issues.274Foot Note 274×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 36; Niew’s AEIC at paras 115-118.There was no fixed period for the collection of trade receivables and no expert evidence to support the allegation of fraudulent accounting. Mr Deniyal also completely fails to explain how this allegation amounts to oppression under s 216 of the Companies Act.275Foot Note 275×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 107-109.The claim that Mr Niew misappropriated the money was not put to Mr Niew.276Foot Note 276×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 66. 132 I am unable to find that these allegations have been made out. The claim that Mr Niew misappropriated the money surfaced only after the end of trial and was never put to Mr Niew. Mr Deniyal has nothing to substantiate his claim of fraudulent accounting. On the contrary, when it was put to him that the failure of a counterparty to make timely payment was simply a business risk, Mr Deniyal completely accepted the force of this explanation.277Foot Note 277×NE, 1 February 2023, at 61-64.",
        "Unauthorised loan of $500,000": "133 Mr Deniyal alleges that in late 2017 to early 2018, Mr Niew orally confessed to taking an undisclosed loan of $500,000 from either MEPL or MMPL to purchase land in Malaysia. Mr Deniyal submits that such an undisclosed loan contravenes the Companies Act as Mr Deniyal’s approval was not sought.278Foot Note 278×Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 40-41; Deniyal’s AEIC at paras 52-53.Mr Niew rejects this as an entirely baseless allegation. In any event, Mr Niew would not have needed to loan money from either MEPL or MMPL as both companies were and are indebted to him.279Foot Note 279×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 110-112; Niew’s AEIC at para 120. 134 This allegation was not put to Mr Niew during cross-examination280Foot Note 280×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 111.and Mr Deniyal concedes that he has no evidence to support this allegation.281Foot Note 281×Plaintiff’s Closing Submissions dated 29 March 2023 at para 49; NE, 1 February 2023, at 69, lines 19-29.I do not accept it.",
        "Inflating MEPL’s accounts": "135 Mr Deniyal accuses Mr Niew of intentionally inflating the accounts of MEPL and MMPL to give a false impression of their operating expenditure.282Foot Note 282×Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 43-50.In particular, Mr Deniyal targets MEPL’s declared expenditure for food provided to foreign workers, as well as “Entertainment and Refreshment” expenses of both MEPL and MMPL. At trial, Mr Deniyal did not seriously pursue the complaint about inflated food expenses and did not put this allegation to Mr Niew. Rather, Mr Deniyal’s main contention is that the “Entertainment and Refreshment” expenses of MEPL were excessive and unusual for a company that provides ship repair services and is therefore proof of Mr Niew’s mismanagement of MEPL’s financial records.283Foot Note 283×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 46.Mr Deniyal’s position is that no expert evidence is required to support this claim as the question of whether accounts have been inflated is a question of fact for my determination.284Foot Note 284×Plaintiff’s Reply Submissions dated 12 April 2023 at para 46. 136 Mr Niew denies that the recorded expenditure is excessive. Mr Niew had full discretion over the expenditure in the absence of any restriction on how much a company may spend on entertainment and refreshment. The money was spent on client entertainment, festive gifts to clients, and to treat employees to meals. Furthermore, Mr Deniyal had signed off on the financial statements for the years covering this expenditure and cannot now claim that they were excessive.285Foot Note 285×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 44; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 116; Niew’s AEIC at paras 127-129.Under cross-examination, Mr Deniyal accepted that he did not have expert evidence to back up this allegation and agreed to withdraw it.286Foot Note 286×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 114. 137 I note that “Entertainment and Refreshment” is not a term found on the face of the documents adduced. During discovery, MEPL and MMPL disclosed several documents described in their supplementary list of documents as “Supplier invoices and payment vouchers in relation to [MEPL] and [MMPL’s] Entertainment and Refreshment Expenses”.287Foot Note 287×5th Affidavit of Celesty Neo Wei Ling dated 26 January 2022 at 3.Mr Deniyal essentially submits that this brief description is inaccurate and misleading because some of the invoices include items that cannot be described as “Entertainment and Refreshment” expenses, such as employees’ parking coupons and diesel costs.288Foot Note 288×Plaintiff’s Closing Submissions dated 29 March 2023 at para 50.However, this description is contained in the supplementary list of documents filed by the defendants and the index prefacing document bundles, rather than the financial accounts or any documents of the companies. 138 This allegation is not made out. 139 Mr Deniyal also takes issue with Mr Niew’s failure to account for alleged discrepancies in moneys withdrawn for red packets distributed for festivities. Payment vouchers record a withdrawal of $50,000 from MMPL in 2016289Foot Note 289×4AB at 48.and another withdrawal of $30,000 from MEPL in 2017.290Foot Note 290×4AB at 170.According to Mr Deniyal, Mr Niew has failed to provide a satisfactory explanation as to how these moneys were distributed.291Foot Note 291×Plaintiff’s Closing Submissions dated 29 March 2023 at para 52.Mr Niew testified that different employees and third parties working in the shipyards would be gifted different sums, but that at the end of the day the money would always be completely distributed.292Foot Note 292×NE, 14 February 2023, at 51-52; NE, 15 February 2023, at 47, lines 21-24, and 48, lines 1-6.Mr Niew submits that Mr Deniyal has not challenged this explanation or provided any other alternative.293Foot Note 293×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 71.I accept Mr Niew’s submission and find that Mr Deniyal has failed to make out this allegation.",
        "Unexplained cash withdrawals": "140 Mr Deniyal complains that Mr Niew withdrew large sums of money from MEPL and MMPL between 2011 to 2018 “for unknown reasons” and that Mr Niew effectively treated their bank accounts as his own. According to Mr Deniyal, Mr Niew did not provide sufficiently detailed explanations for debts allegedly owed to him by the companies in his reply to interrogatories and did not adduce documentary evidence to support these alleged debts.294Foot Note 294×Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 52-53; Plaintiff’s Closing Submissions dated 29 March 2023 at para 53.The fact that Mr Deniyal signed off on the financial statements did not amount to approval as he was not provided with complete documents.295Foot Note 295×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 33A. 141 Mr Niew identifies Mr Deniyal’s lack of understanding of the purpose of the transactions as the true root of this complaint.296Foot Note 296×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 130.Mr Niew explains that he would withdraw money to pay suppliers or employees as and when the need arose. He would also withdraw money as repayment for the debts owed to him by the companies for his capital injections (see above at [16]). Given the age and number of transactions, which took place over a lengthy period, Mr Niew declines to provide a detailed explanation for each and every transaction.297Foot Note 297×Niew’s AEIC at paras 133-136; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 74.Mr Niew submits that Mr Deniyal accepted under cross-examination that the companies were indebted to Mr Niew and Mr Deniyal testified that his suspicions arose simply because he was unable to understand the entries in the ledgers due to the limited descriptions contained therein.298Foot Note 298×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 132; NE, 2 February 2023, at 6-9.Furthermore, Mr Deniyal had signed off on the relevant financial statements. Mr Niew submits that Mr Deniyal must therefore have known about and approved of all transactions contained in the general ledgers.299Foot Note 299×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 50. 142 I do not accept Mr Niew’s submission that Mr Deniyal must have been aware of and approved of the transactions recorded in the general ledgers simply because Mr Deniyal signed off on the relevant financial statements for the corresponding period. Although I make no findings as to whether the financial statements were provided to Mr Deniyal without adequate time to process their contents (see above at [104]), I accept Mr Deniyal’s evidence that he had never seen the general ledgers throughout his tenure at the companies.300Foot Note 300×NE, 1 February 2023, at 15, line 23.The general ledgers were electronic documents prepared by the accounts department (see above at [70]).301Foot Note 301×NE, 14 February 2023, at 16, lines 3-6.Mr Niew himself testified that he could not read or properly understand the general ledgers.302Foot Note 302×NE, 10 February 2023, at 56, lines 6-8, and 67, lines 7-10; NE, 14 February 2023, at 18, lines 4-10, and 20, lines 17-25.I therefore accept that the general ledgers were not provided together with the financial statements. In contrast to the general ledgers, the financial statements provided a summarised overview and contained no details about the individual transactions. Mr Deniyal therefore would not have been aware of the specific transactions. This is especially the case because the transactions in question were recorded under Mr Niew’s directors’ account. 143 However, I accept Mr Niew’s submission that few specific transactions were highlighted and put to Mr Niew.303Foot Note 303×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 133.I agree that Mr Niew cannot be expected to provide an explanation in the absence of any particulars, considering the long period of time encompassed by the allegation. On their face, the general ledgers do show that both companies were indebted to Mr Niew. 144 I pause to highlight that the supporting documents explaining some of the cash withdrawal transactions were destroyed by Mr Niew in February 2020.304Foot Note 304×8th Affidavit of Niew Bock Leng dated 4 April 2022 at 10.I reiterate that Mr Niew destroyed these documents even though he had been put on notice and contrary to his promise to preserve records (see above at [61] and [64]). Nonetheless, I do not draw an adverse inference against Mr Niew, and find that these allegations were not made out.",
        "Causing MMPL to incur expenditure for other companies": "145 Mr Deniyal asserts that MMPL’s general ledgers show that employees of a different company, MCG Tech Engineering Pte Ltd (“MCG”), were placed on MMPL’s payroll. Mr Niew is a 70% shareholder and director of MCG.305Foot Note 305×Deniyal’s AEIC at paras 21 and 71-72; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 16.Furthermore, MMPL allegedly incurred $1.7m in expenses for goods and equipment that were used by other companies in the Mapo Group, without being compensated by the other companies. As there is no reason for MMPL to assume liabilities for the benefit of other companies, Mr Deniyal points to this as evidence of Mr Niew intentionally reducing the profits of MMPL to maximise the profits of companies in which Mr Deniyal is not a shareholder.306Foot Note 306×Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 54-56; Plaintiff’s Closing Submissions dated 29 March 2023 at paras 54-56. 146 Mr Niew denies that employees of MCG were placed on MMPL’s payroll. As shown by the ledgers, any expenditure incurred by MMPL for other companies would be invoiced to the relevant company.307Foot Note 307×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 122; Niew’s AEIC at paras 137-138.These allegations were not put to Mr Niew at trial and cannot be sustained.308Foot Note 308×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 123. 147 I accept Mr Niew’s submission that this was another allegation that was not put to Mr Niew, or properly particularised or substantiated. Mr Deniyal did not provide any particulars of which employees belonged to MCG and did not break down how the figure of $1.7m was derived.309Foot Note 309×NE, 2 February 2023, at 12, lines 8-22.Mr Deniyal further admitted that he did not know what services were provided by MMPL to MCG or whether MCG was invoiced for the same.310Foot Note 310×NE, 2 February 2023, at 14, lines 9-16.",
        "Wrongful disposal of MEPL’s assets": "148 Mr Deniyal submits that Mr Niew has wrongfully disposed or misappropriated MEPL’s assets. This allegation arises from an invoice under MEPL’s letterhead for the sum of $630,000, addressed to YR Marine & Engineering Sdn Bhd and dated 1 October 2015.311Foot Note 311×4AB at 569.Mr Deniyal points out that no such sale of assets or corresponding receipt of sale proceeds is reflected in MEPL’s accounts for the financial years 2015 and 2016. Mr Deniyal speculates that Mr Niew had secretly diverted the funds to himself, or to a company owned by him.312Foot Note 312×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 57. 149 Mr Niew’s evidence is that this document is a “proforma invoice” prepared for the purpose of providing a valuation of certain listed items, which a third-party required to support a loan application that ultimately fell through. There was therefore no actual transaction.313Foot Note 313×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 55; 3rd Defendant’s Reply Submissions dated 12 April 2023 at para 80; Niew’s AEIC at para 140.In any event, it is wholly illogical to conclude that money was misappropriated based only on an invoice.314Foot Note 314×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 126. 150 I do not accept Mr Deniyal’s allegation. Mr Deniyal provides no evidence to support the assertion that Mr Niew wrongfully disposed of MEPL’s assets and misappropriated the proceeds of sale.",
        "Unfair distribution of dividends and directors’ fees": "151 Mr Deniyal submits that a policy of distributing dividends and directors’ fees in a manner that disproportionately benefits some shareholders at the expense of others may amount to commercial unfairness.315Foot Note 315×Plaintiff’s Closing Submissions dated 29 March 2023 at paras 60-64.As Mr Niew’s defence is that the dividends and directors’ fees were in fact credited to Mr Deniyal, but had been set-off against prior personal debts owed by Mr Deniyal to Mr Niew (see above at [51]), the key factual issue is whether Mr Deniyal did in fact owe such debts to Mr Niew. There can be no valid set-offs unless these debts existed. Dividends from MMPL 152 It is undisputed that MMPL declared dividends of $500,000 in 2012 and $300,000 in 2013.316Foot Note 316×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 26; 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 25.MMPL’s ledgers credit Mr Deniyal with a 30% share of these dividends, but also record “loan returns” from Mr Deniyal in favour of Mr Niew immediately thereafter: (a) In 2012, Mr Deniyal’s directors’ account was credited with $150,000 under a transaction labelled “PROVISION FOR DIVIDEND”, but $149,000 was immediately debited thereafter under a transaction labelled “LOAN RETURN TO MR.NIEW”. This sum was credited into Mr Niew’s account as a “LOAN RETURN FROM DENIYAL”.317Foot Note 317×2AB at 630. (b) In 2013, Mr Deniyal’s directors’ account was similarly credited with $90,000 under a transaction labelled “DIRECTOR DIVIDENDS”, but $90,000 was again immediately transferred to Mr Niew’s under a “LOAN RETURN TO MR.NIEW”.318Foot Note 318×2AB at 632. 153 Mr Deniyal claims that these dividends were only declared on paper. He never actually received any dividendsin cash.319Foot Note 319×Plaintiff’s Closing Submissions dated 29 March 2023 at para 62; Statement of Claim (Amendment No 3) dated 7 February 2023 at paras 28 and 53; Deniyal’s AEIC at paras 38 and 67.Mr Deniyal was never informed that dividends had been declared and only fortuitously discovered this fact when he came across unattended financial documents in 2018.320Foot Note 320×Deniyal’s AEIC at para 37.Mr Niew did not actually make loans of $149,000 or $90,000 to Mr Deniyal, and the recorded “loan returns” were in truth Mr Niew extracting funds from MMPL.321Foot Note 321×Deniyal’s AEIC at para 67.Although Mr Deniyal signed off on MMPL’s financial statements for 2012 and 2013, the documents presented to him were incomplete and did not mention any declaration of dividends.322Foot Note 322×Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 24. 154 Mr Niew does not dispute that Mr Deniyal was entitled to any dividends that were declared. Mr Niew’s case is that Mr Deniyal did not receive dividendsin cashas they werecreditedto Mr Deniyal’s account and then immediately used to set-off debts owed to Mr Niew as recorded by these “loan returns”. Mr Deniyal knew about and consented to these set-offs, which were in accordance with their established practice (see above at [51]).323Foot Note 323×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 51; Niew’s AEIC at paras 73-75, 79, 98.Mr Deniyal therefore received his dividends and this is what the credit transactions in the ledgers record.324Foot Note 324×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 137.Mr Deniyal must have been aware that dividends had been declared for any given year as a shareholders’ resolution would have to be passed at a general meeting, which would require the attendance of both Mr Deniyal and Mr Niew.325Foot Note 325×Niew’s AEIC at para 76.For the $500,000 declared in 2012, an extraordinary general meeting was called on 31 December 2012, evidenced by a written directors’ resolution signed by both Mr Deniyal and Mr Niew.326Foot Note 326×Agreed Bundle of Documents, Volume 3 (“3AB”) at 515; Niew’s AEIC at paras 77-78.For the $300,000 declared in 2013, an extraordinary general meeting was called on 31 December 2013, also evidenced by a written directors’ resolution signed by both Mr Deniyal and Mr Niew.327Foot Note 327×3AB at 516; Niew’s AEIC at paras 80-81.The resolutions expressly state that the dividends declared “shall be credited to the accounts of the shareholders” on 31 December 2012 and 31 December 2013 respectively.328Foot Note 328×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 135.Furthermore, Mr Deniyal had signed off on MMPL’s financial statements. Having so signed off, Mr Niew submits that Mr Deniyal must therefore have known and approved of any transactions recorded in MMPL’s ledgers.329Foot Note 329×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 27 and 51; Niew’s AEIC at para 82.Mr Niew submits that Mr Deniyal’s evidence cannot be trusted as Mr Deniyal prevaricated on the extent of his knowledge of the dividends and lied about not receiving loans from Mr Niew.330Foot Note 330×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 85-88. Directors’ fees 155 In 2006 to 2012, MEPL approved an aggregate of $710,000 in directors’ fees for Mr Deniyal, and MMPL approved an aggregate of $353,000 in directors’ fees for Mr Deniyal.331Foot Note 331×Statement of Claim (Amendment No 3) dated 7 February 2023 at para 31; Deniyal’s AEIC at para 41; Niew’s AEIC at para 90.As not all of the relevant general ledgers pertaining to this period were adduced,332Foot Note 332×Niew’s AEIC at para 92.parties focused only on directors’ fees declared in the following years: YearDirectors’ fees declared in favour of Mr Deniyal by MEPLDirectors’ fees declared in favour of Mr Deniyal by MMPL2008$300,000$200,0002009-$60,0002010--2011$80,000$43,0002012$100,000- 156 As with MMPL’s dividends, Mr Deniyal denies receiving any of the approved directors’ fees.333Foot Note 333×Deniyal’s AEIC at para 43.However, official income documents adduced by Mr Deniyal record the directors’ fees declared in his favour. Mr Deniyal claims that Mr Niew had instructed Ms Cindy to prepare Mr Deniyal’s tax declaration, and that Mr Niew had said that the directors’ fees were to be declared in favour of Mr Deniyal on paper to allow the companies to pay lower taxes. No money was actually paid to Mr Deniyal and his income taxes were not paid by him. For his part, Mr Deniyal apparently went along with this scheme.334Foot Note 334×Deniyal’s AEIC at para 44; NE, 1 February 2023, at 38, lines 2-31, at 49, lines 21-31, and 50.I accept Mr Deniyal’s evidence that his tax declarations and income tax payments were done by the Mapo Group’s accounts department as this was eventually corroborated by Mr Niew’s testimony.335Foot Note 335×NE, 14 February 2023, at 59, lines 1-19, and 60, lines 26-32. 157 Mr Niew does not dispute that Mr Deniyal was entitled to the declared directors’ fees.336Foot Note 336×NE, 10 February 2023, at 60, lines 4-14, and 81, line 1.Despite receiving over $1m in directors’ fees, Mr Niew claims that Mr Deniyal continued to take further personal loans.337Foot Note 337×NE, 15 February 2023, at 26, lines 26-32.Unlike the dividends declared by MMPL (see above at [152]), not all of the directors’ fees were recorded by a distinct credit transaction. Mr Niew thus mainly relies on his interpretation of the general ledgers to prove that Mr Deniyal was in fact credited for all declared directors’ fees during this period. (1) MEPL 158 For MEPL, Mr Niew points out that the $300,000 in directors’ fees declared in favour of Mr Deniyal in 2008 is reflected in the opening balance of his directors’ account in MEPL’s ledger for 2010. I observe that the general ledger records that several sums of cash were then withdrawn by two debit transactions labelled “CASH WITHDRAW (DENIYAL)”, two debit transactions labelled “IRAS (DENIYAL INCOME TAX)”, and a significantly largerdebittransaction of $150,000 labelled “Y2008 DIRECTOR FEES”.338Foot Note 338×2AB at 6; Niew’s AEIC at paras 92-93. 159 According to Mr Niew, the $80,000 in directors’ fees declared in favour of Mr Deniyal in 2011 is similarly credited in MEPL’s ledger for 2012, as shown by an increase between Mr Deniyal’s closing balance recorded in the ledger for 2011 and the opening balance in the ledger for 2012. Unlike the dividends declared by MMPL, which were recorded by distinct credit transactions expressly described as dividends (see above at [152]), there is no separate credit transaction explaining this increase in the opening balance or identifying the change as being the result of the crediting of directors’ fees. I observe that this ledger records that Mr Deniyal’s closing balance for 2012 was zero. After some small debit transactions for what appears to be payment of road tax, vehicle insurance, and income tax, as well as a single “CASH ADVANCE”, MEPL still owed $132,810.50 to Mr Deniyal. However, this balance was entirely cleared by a final debit transaction dated 30 September 2012 labelled “TRANSFER TO MR.NIEW A/C”, for the whole amount of $132,810.50. There is a corresponding credit transaction labelled “TRANSFER FROM DENIYAL A/C” under Mr Niew’s directors’ account for the same amount. Mr Niew explains that this was another set-off against debts owed by Mr Deniyal.339Foot Note 339×2AB at 10; Niew’s AEIC at paras 94-95.Unlike in the case of MMPL’s dividends, this transaction makes no mention of any loan. 160 For the $100,000 declared in 2012, this amount is credited to Mr Deniyal in the opening balance of his directors’ account in MEPL’s ledger for 2013. There is again no distinct credit transaction explaining the change. The ledger records multiple debit transactions for what appears to be tax payments, as well as two debit transactions described as “CASH ADVANCE” for $1,000 and $350, resulting in a remaining debt of $84,597.78 owed by MEPL to Mr Deniyal. It is not apparent to me why these two transactions are recorded as “advances” when MEPL remained indebted to Mr Deniyal: a similar debit transaction in Mr Niew’s directors’ account is more appropriately labelled “CASH WITHDRAW”. As was the case in 2012, the last entry in the 2013 ledger records that the balance owed to Mr Deniyal was again entirely cleared by a debit transaction dated 30 September 2013 labelled “LOAN RETURN TO MR.NIEW”, for the whole amount of $84,597.78. There is a corresponding credit transaction labelled “LOAN RETURN FROM DENIYAL” for the same amount under Mr Niew’s directors’ account. Mr Deniyal denies the existence of such a loan.340Foot Note 340×Deniyal’s AEIC at para 65.Mr Niew explains that this was yet another a set-off for prior debts.341Foot Note 341×2AB at 12; Niew’s AEIC at paras 96-97. 161 Mr Niew claims that Mr Deniyal knew about and approved of all set-offs.342Foot Note 342×Niew’s AEIC at para 98. (2) MMPL 162 A similar pattern is seen in the records of MMPL. 163 Mr Niew explains that the $200,000 in directors’ fees declared in favour of Mr Deniyal in 2008 is credited in the opening balance of his directors’ account in MMPL’s ledger for 2009, without any distinct credit transaction.343Foot Note 343×2AB at 622; Niew’s AEIC at para 99. 164 The $60,000 in directors’ fees declared in 2009 is recorded in MMPL’s ledger for 2010 via a distinct credit transaction dated 1 January 2010 labelled “DIRECTOR FEE (Y2009)”. Curiously, the only other entry in Mr Deniyal’s directors’ account for 2010 is a transaction dated 4 March 2010 labelled “DIRECTOR FEE (Y2008)” for the amount of $80,000. Despite the identical naming scheme, this latter entry is adebittransaction, which reduces the amount owed by MMPL to Mr Deniyal.344Foot Note 344×2AB at 625.Mr Niew states in his affidavit of evidence-in-chief that this latter transaction shows that Mr Deniyal withdrew $80,000 in directors’ fees.345Foot Note 345×Niew’s AEIC at para 100.However, Mr Niew resiled from this position during cross-examination, instead claiming that he could not remember whether this was the case.346Foot Note 346×NE, 10 February 2023, at 73, lines 17-20.There is therefore no explanation for the difference between these two transactions and no evidence that Mr Deniyal actually withdrew the $80,000. The general ledgers provide only a limited description and do no more than record paper transactions. Although the general ledger might record a debit transaction under Mr Deniyal’s account, there is no indication that Mr Deniyal himself actually carried out or authorised a withdrawal (see above at [57]). 165 No directors’ fees were declared in favour of Mr Deniyal in 2010. However, I observe that although MMPL’s ledger for 2010 shows a closing balance of $180,000 in favour of Mr Deniyal, the opening balance in Mr Deniyal’s account in MMPL’s ledger for 2011 is zero. The ledger does not record any transaction to explain this change. The 2011 ledger itself contains only a single debit transaction under Mr Deniyal’s directors’ account dated 7 September 2011 for $43,000 that is labelled “CASH ADVANCE”.347Foot Note 347×2AB at 627.MMPL’s ledger for 2011 therefore records a closing balance of $43,000 owed by Mr Deniyal to MMPL. 166 According to Mr Niew, the $43,000 in directors’ fees declared in 2011 is recorded in MMPL’s ledger for 2012 via a distinct credit transaction dated 1 January 2012 labelled “DIRECTOR FEE (YE2011)”.348Foot Note 348×2AB at 630.Mr Niew explains that this amount was set-off against the same amount loaned by Mr Deniyal from MMPL in 2011 under the aforementioned “CASH ADVANCE”.349Foot Note 349×Niew’s AEIC at para 101. 167 As in the case of MMPL’s dividends, Mr Niew submits that Mr Deniyal signed the relevant financial statements of MEPL and MMPL and must therefore have known that directors’ fees were declared.350Foot Note 350×Niew’s AEIC at para 91.In addition, all directors’ fees were approved by written resolutions signed by both Mr Niew and Mr Deniyal.351Foot Note 351×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 60A(a).Mr Niew claims that the general ledgers show that Mr Deniyal did in fact receive his directors’ fees as they were credited to him.352Foot Note 352×Niew’s AEIC at para 102. Whether Mr Deniyal received the dividends and directors’ fees 168 Mr Deniyal submits that Mr Niew shifted his defence over time. In the R&T Demand Letter issued in December 2019 (see above at [37]), Mr Deniyal explicitly set out the allegation that he never received any dividends or directors’ fees from either MEPL or MMPL.353Foot Note 353×1AB at 36.Tang & Partners replied via a letter dated 23 January 2020, responding that:354Foot Note 354×1AB at 42-43. … [Mr Deniyal] knew very well and has agreed that all the monies declared as dividends and as directors’ fees were to beretained in the respective Companies to be used for the Company’s purposessuch as: (i) for the purchase of new machinery and equipment, etc.; (ii) to make gifts to the Company’s suppliers and contractors; and (iii) to offset against advances, drawings by the directors and payments made by the Company to or on behalf of the directors including payment of taxes. We are instructed that [Mr Deniyal] is fully aware and has agreed to this arrangement. In fact, [Mr Deniyal] was personally involved in making and giving out gifts annually to the companies’ suppliers and contractors. In the premises, our clients are very surprised that your client is now making this into an issue after a lapse of over 11 to 14 years with regard to directors’ fees and 8 to 9 years with regard to dividends. [emphasis added] Tang & Partners provided this response under Mr Niew’s instruction.355Foot Note 355×NE, 9 February 2023, at 81, lines 16-17.However, Mr Niew’s pleaded case was that Mr Deniyal had “received” the dividends and directors’ fees declared in his favour.356Foot Note 356×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at paras 27 and 31.According to Mr Deniyal, Mr Niew’s explanation changed yet again in his affidavit of evidence-in-chief, where Mr Niew explained that the dividends and directors’ fees were “set-off” against debts owed by Mr Deniyal. Mr Deniyal submits that this defence based on set-off took him by surprise and represents a departure from Mr Niew’s pleaded case that Mr Deniyal “received” the money.357Foot Note 357×Plaintiff’s Closing Submissions dated 29 March 2023 at para 67; Plaintiff’s Reply Submissions dated 12 April 2023 at para 14(b). 169 I do not accept the distinction Mr Deniyal seeks to draw between moneys “received” and moneys “credited” on the facts of this case. Both constitute a receipt. Although I agree that a policy of distributing dividends and directors’ fees in a manner that disproportionately benefits some shareholders at the expense of others may amount to commercial unfairness (Gee Hoe Chan([117]supra)), this principle is of no application if Mr Deniyal was in fact credited the dividends and directors’ fees declared in his favour. Additionally, Mr Niew’s explanation that the money had been set-off against debts owed by Mr Deniyal to Mr Niew for loans extended prior to 2009 was actually added to the pleaded defence over a year before the trial.358Foot Note 358×3rd Defendant’s Defence (Amendment No 1) dated 19 November 2021 at para 51. 170 However, Mr Niew’s pleaded casewasa material departure from his initial position stated in the letter from Tang & Partners. Mr Niew’s initial position was that both men had agreed that their dividends and directors’ fees would beretained by the companies forthe companies’ use. Mr Niew did not make any mention of personal loans from him to Mr Deniyal or of such loans being set-off against what was due to Mr Deniyal by way of dividends or directors’ fees. Offsetting advances from the companies or payments made by the companies on Mr Deniyal’s behalf is a different point altogether, as these would be debts owed by Mr Deniyal tothe companies. This is a glaring omission given that Mr Niew’s case is premised on the existence of very substantialpersonalloans from him to Mr Deniyal. Mr Niew’s explanation for the discrepancy in his position was that there had apparently been some miscommunication with Tang & Partners. Mr Niew claims that only his own dividends would be retained in the companies, not Mr Deniyal’s.359Foot Note 359×NE, 9 February 2023, at 79, line 25, at 80, lines 17-20, at 81, lines 9-17, and 83, lines 8-10; NE, 15 February 2023, at 46, lines 1-7.I am unable to accept this explanation. Tang & Partners was acting on his instructions and responding directly to an allegation thatMrDeniyaldid not receive dividends and directors’ fees. How Mr Niew used his own dividends and directors’ fees would not have been a relevant response to that allegation. 171 As I have already stated (see above at [71]), Mr Niew’s failure to call any member of the accounts department of MEPL and MMPL undercuts his defence. This is particularly so for the explanations provided in relation to Mr Deniyal’s directors’ fees. Although the foregoing explanations (above at [158]–[166]) were provided by Mr Niew in his affidavit of evidence-in-chief, Mr Niew declined to provide any explanation when cross-examined on the same transactions. Mr Niew instead testified that he could not understand or even read the general ledgers and required his accounts department to explain the transactions to him.360Foot Note 360×NE, 10 February 2023, at 56, lines 6-8, and 67, lines 7-10; NE, 14 February 2023, at 18, lines 4-10, and 20, lines 17-25.For example, when cross-examined on his explanation that the $300,000 in directors’ fees declared in favour of Mr Deniyal in 2008 had been credited to Mr Deniyal’s directors’ account in MEPL’s ledger for 2010 (see above at [158]), Mr Niew refused to stand by his own explanation and instead told counsel for Mr Deniyal to direct the question to the companies’ accounts department.361Foot Note 361×NE, 10 February 2023, at 64, lines 30-32, to 65, lines 1-15.Similarly, when asked whether the $80,000 in directors’ fees declared in favour of Mr Deniyal in 2011 had been credited to Mr Deniyal’s directors’ account and evidenced by the opening balance in MEPL’s ledger for 2012 (see above at [159]), Mr Niew could not immediately confirm his own deposed explanation. Instead, Mr Niew replied that he was “not familiar with accounts” and that counsel for Mr Deniyal would have to “ask accounts”.362Foot Note 362×NE, 10 February 2023, at 67, lines 26-32; NE, 14 February 2023, at 17, lines 18-32, to 18, lines 1-19.Indeed, Mr Niew even directly contradicted his own explanations at times.363Foot Note 363×NE, 10 February 2023, at 73, lines 23-25.It is evident that the explanations for the transactions in the general ledgers set out in Mr Niew’s affidavit of evidence-in-chief were not his own evidence. In the absence of distinct credit transactions recorded in the general ledgers, there is therefore no admissible evidence to show that Mr Deniyal was credited for his directors’ fees for MEPL in any of the three years and for MMPL in 2008. The signed resolutions do not assist as they only state the declaredquantumof directors’ fees and do not show Mr Deniyal’sreceiptof the money. There were no personal loans 172 Regardless of whether the money was credited to Mr Deniyal, I do not accept Mr Niew’s assertion that he had extended substantial personal loans to Mr Deniyal and therefore reject his claim that Mr Deniyal’s dividends and directors’ fees were properly set-off against debts owed to him by Mr Deniyal. I now explain this finding. (1) The parties’ cases 173 Mr Deniyal admits that Mr Niew gave him some money between 2000 to 2009 but claims that these were gifts, not loans.364Foot Note 364×NE, 1 February 2023, at 30, lines 11-13; Reply to 3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 33B.Mr Deniyal testified that the money was proffered voluntarily and Mr Niew neither said that the money had to be returned nor stipulated a timeline for repayment.365Foot Note 365×NE, 1 February 2023, at 20, lines 19-29.Even if the gifts were loans, they were for small ticket items that could not have amounted to hundreds of thousands in debt. Mr Deniyal did not in any event consent to the set-offs. Mr Deniyal submits that Mr Niew has no real evidence supporting the claim that Mr Deniyal was indebted for such large sums.366Foot Note 366×Plaintiff’s Closing Submissions dated 29 March 2023 at para 66.Mr Deniyal points out that the general ledgers record transactions under Mr Niew’s directors’ account that are expressly labelled as “loans” to other named persons, but there are no entries recording loans to Mr Deniyal.367Foot Note 367×Plaintiff’s Closing Submissions dated 29 March 2023 at para 67(c)(iv). 174 Mr Niew’s case is that Mr Deniyal owed him large sums of money from loans extended between the 2000s to 2009 (see above at [50]). Mr Niew’s explanation for the paucity in documentary records of these loans is that they were managed by way of an informal system using “payment vouchers” or “advance vouchers” that recorded the amounts loaned to Mr Deniyal each time a loan was sought. Only one voucher would be created each time, and these would be kept by Mr Niew. These vouchers would then be destroyed or handed over to Mr Deniyal whenever Mr Deniyal repaid a sum corresponding to the amount of debt recorded on the voucher.368Foot Note 368×NE, 10 February 2023, at 30, lines 31-32, to 31; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 145.Therefore, Mr Niew would not have written records of the debts already repaid by Mr Deniyal.369Foot Note 369×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 29; NE, 10 February 2023, at 30, lines 31-32, to 31, lines 1-2, at 34, lines 20-28, and 45, lines 8-10.Nobody else knew about these “payment vouchers” as the companies’ accounts department was not involved.370Foot Note 370×NE, 14 February 2023, at 54, lines 4-6.For convenience, I shall refer to this as Mr Niew’s “Informal Voucher System”. 175 Mr Niew adduced a signed single page document that appears to be a standard form “PAYMENT VOUCHER” under MMPL’s letterhead dated 31 December 2010 (“PV 40/41”).371Foot Note 371×3AB at 834.On its face, PV 40/41 records an entry described as “Debit to Director Deniyal Bin Kamis” for the amount of “180,000.00”, followed by an entry described as “Credit to Director Niew Bock Leng” for the amount of “(180,000.00)”. PV 40/41 also records a cheque number “JR 10/30” but leaves the “Pay To” field empty. At the bottom of the page, Mr Niew signed the “Approved By” field and Mr Deniyal signed the “Received by” field.372Foot Note 372×NE, 10 February 2023, at 52, lines 12-15.Notably, there is no mention of any loan (personal or otherwise) or statement that PV 40/41 concerns a repayment of money. According to Mr Niew, PV 40/41 records Mr Deniyal’s repayment of a loan of $180,000 previously extended by Mr Niew.373Foot Note 373×Niew’s AEIC at para 100.This supposedly explains why Mr Deniyal’s opening balance in his directors’ account in MMPL’s ledger for 2011 is zero (see above at [165]): the $180,000 owed by MMPL to Mr Deniyal had been transferred to Mr Niew.374Foot Note 374×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 84(e).Mr Niew submits that there is no other explanation for the purpose of PV 40/41.375Foot Note 375×3rd Defendant’s Reply Submissions dated 12 April 2023 at para 84(d).. Mr Deniyal considers PV 40/41 to be the only evidence adduced to support Mr Niew’s claim. However, Mr Deniyal submits that PV 40/41 does not actually state that it is for the repayment of a loan and therefore cannot substantiate Mr Niew’s position. Mr Deniyal denies that PV 40/41 was for the repayment of a loan.376Foot Note 376×NE, 1 February 2023, at 46, lines 14-26.His evidence is that Mr Niew had told him that the $180,000 was to be transferred to another member of the Mapo Group.377Foot Note 377×NE, 1 February 2023, at 27, lines 1-5; NE, 2 February 2023, at 59, lines 11-15; Plaintiff’s Closing Submissions dated 29 March 2023 at para 66(e)-(i).For clarity, I shall refer to PV 40/41 as an example of what Mr Niew calls a “loan return document”. According to Mr Niew, despite taking the form of a payment voucher, a loan return document is a document issued by the companies’ accounts department that records therepaymentof a debt, as distinct from the sort of voucher that records thedisbursementof a loan which is issued by Mr Niew under the Informal Voucher System (above at [174]). 176 As proof of substantial debts owed by Mr Deniyal to Mr Niew, Mr Niew also points to a letter of demand issued by Eldan Law dated 17 May 2021 which demanded the return of $192,695.02 (the “Eldan Law Demand Letter”).378Foot Note 378×3rd Defendant’s Supplementary Bundle of Documents dated 31 January 2023 (“2DBOD”) at Tab 10; 3rd Defendant’s Closing Submissions dated 29 March 2023 at para 145.In this letter, Eldan Law stated that it was acting on behalf ofMMSPLand demanded the repayment of loans taken by Mr Deniyalfrom MMSPLbetween the period ofJanuary 2011 to March 2019. Annexed to the letter was a schedule of the alleged loans and copies of payment vouchers supporting the claims. The payment vouchers all take the form of a single page document titled “ADVANCE PAYMENT VOUCHER” under MMSPL’s letterhead. These payment vouchers list Mr Deniyal as the recipient under the “PAY TO” field.379Foot Note 379×2DBOD at 172-230.Some of these payment vouchers were not countersigned by Mr Deniyal.380Foot Note 380×2DBOD at 176, 184, 186, 187, 191, 192, 208, 216, 219, 221, and 222.Mr Niew submits that these payment vouchers were issued under the Informal Voucher System and therefore proved outstanding debts owed by Mr Deniyal.381Foot Note 381×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 145.Mr Niew repeatedly testified that the amount demanded in the Eldan Law Demand Letter was precisely the outstanding amount of approximately $200,000 still owed to him by Mr Deniyal (see above at [50]).382Foot Note 382×NE, 10 February 2023, at 34, line 20, to 35, line 16, at 37, lines 1-14, at 38, lines 26-30, at 39, lines 7-9, and 45, lines 9-10.When it was put to Mr Niew that the debts were owed to MMSPL and not to him personally, Mr Niew explained that these payment vouchers actually recorded his personal loans and that he had simply handed the documents under MMSPL’s letterhead to his lawyers.383Foot Note 383×NE, 10 February 2023, at 28, lines 10-14.Presumably, Mr Niew meant that he neither instructed nor informed Eldan Law that the payment vouchers were for personal loans. I note that Mr Deniyal denied liability in his response letter and highlighted that the demand was made belatedly and only after this action had been commenced.384Foot Note 384×2DBOD at Tab 11.MMSPL is not a party to this action and its accounting records were not adduced. 177 Finally, Mr Niew submits that the practice of repaying loans via dividends and directors’ fees is evidenced by MMPL’s ledger entries for 2011 and 2012 (see above at [166]).385Foot Note 385×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 146.In MMPL’s ledger for 2011, a debit transaction labelled “CASH ADVANCE” in Mr Deniyal’s directors’ account dated 7 September 2011 for $43,000 resulted in a debt of this amount owed by Mr Deniyal to MMPL. The amount of $43,000 was then credited into Mr Deniyal’s directors’ account via a credit transaction dated 1 January 2012 labelled “DIRECTOR FEE (YE2011)”, resulting in a balance of zero.386Foot Note 386×2AB at 627 and 630.Mr Niew submits that this shows that Mr Deniyal’s directors’ fees had been applied towards repaying an earlier cash advance. (2) My findings 178 I reject Mr Niew’s claim that he had extended substantial personal loans to Mr Deniyal. Above and beyond the deficiencies in Mr Niew’s case already highlighted throughout the course of this judgment, I found Mr Niew’s evidence on this issue to be internally inconsistent and contradictory. 179 In the first place, no particulars of these substantial personal loans were provided in Mr Niew’s pleadings. More importantly, Mr Niewneverput the Informal Voucher System to Mr Deniyal. In fact, the Informal Voucher System is mentioned for thevery first timein Mr Niew’s cross-examination, only after Mr Deniyal had completed giving his evidence.387Foot Note 387×NE, 10 February 2023, at 26, lines 2-12.PV 40/41 was shown to Mr Deniyal as proof of repayment of loans, without any mention of the Informal Voucher System.388Foot Note 388×NE, 1 February 2023, at 46.The payment vouchers annexed to the Eldan Law Demand Letter were presented to Mr Deniyal as proof ofadvancestaken from MMSPL, rather than records of personal loans, again without any mention of the Informal Voucher System.389Foot Note 389×NE, 1 February 2023, at 29, lines 4-25.It was vitally important to put this claim to Mr Deniyal as he had pointedly denied taking large personal loans and denied being indebted to Mr Niew,390Foot Note 390×NE, 1 February 2023, at 18.and the alleged loans were entirely based upon the Informal Voucher System. 180 Aside from the Informal Voucher System, Mr Niew’s evidence on the details of the alleged loans is rife with inconsistencies and bereft of explanations. To recapitulate, Mr Niew does not dispute that Mr Deniyal was entitled to the declared dividends and directors’ fees. Mr Niew’s case is that Mr Deniyal did in fact receive these dividends and directors’ fees. However, the money had been taken to set-off against debts owed by Mr Deniyal to Mr Niew under substantial personal loans. Having admitted to taking Mr Deniyal’s entitlement to set-off these debts, the onus falls on Mr Niew to prove the existence of these loans and the validity of the purported set-offs. 181 First, Mr Niew’s pleaded case is that these loans were extended from the early 2000s to 2009 (see above at [50]).391Foot Note 391×3rd Defendant’s Defence (Amendment No 3) dated 8 February 2023 at para 51.Mr Niew stated in his affidavit of evidence-in-chief that the total quantum of these loans was approximately $600,000, with $200,000 still outstanding. Mr Niew testified that this outstanding amount was the $192,695.02 demanded in the Eldan Law Demand Letter (see above at [176]). However, when confronted with the fact that the payment vouchers in the Eldan Law Demand Letter were all dated2011 and onward, Mr Niew refused to correct his evidence or provide any coherent explanation for this inconsistency with his pleaded case.392Foot Note 392×NE, 10 February 2023, at 37, lines 2-6, and 39, lines 7-12.Despite being confronted with this discrepancy, Mr Niew subsequently appeared to reconfirm that the outstanding debts arose from loans extended between 2000 to 2009.393Foot Note 393×NE, 10 February 2023, at 38, line 4.Thereafter, Mr Niew’s evidence shifted yet again, morphing into a claim that the loans had been extended “throughout the years until 2015”.394Foot Note 394×NE, 10 February 2023, at 47, lines 2-3.Notably, the payment vouchers annexed to the Eldan Law Demand Letter were dated as late as2019. A few days later, Mr Niew testified to the effect that he had become unable to make large loans from 2011 onwards, as the companies were in a bad financial state.395Foot Note 395×NE, 14 February 2023, at 27, lines 6-8, at 31, lines 6-8, at 36, lines 26-27, and 72, lines 27-28.Simultaneously, Mr Niew also testified that there were no vouchers for the loans extended during the period of 2001 to 2010 because Mr Deniyal had already fully repaid all the corresponding debts for this period, and the vouchers were thus destroyed or returned to Mr Deniyal.396Foot Note 396×NE, 14 February 2023, at 31, lines 22-32, and 33, lines 21-22.No explanation was provided for this complete departure from his pleaded case. Mr Niew’s evidence on this basic detail of the alleged loans is therefore completely incoherent. 182 Second, although Mr Niew deposed in his affidavit of evidence-in-chief that the total quantum of these loans was approximately $600,000 (see above at [50]), he contradicted this evidence at trial. Mr Niew testified that Mr Deniyal hadrepaid$600,000, with $200,000 outstanding, for a total of approximately $800,000 in loans.397Foot Note 397×NE, 10 February 2023, at 37, lines 23-31, and 47, lines 19-20.When confronted with this obvious shift in evidence, Mr Niew baldly declared that he “did not change at all”.398Foot Note 398×NE, 10 February 2023, at 46, line 30.Mr Niew also testified that although the outstanding amount of approximately $200,000 related to loans extended between 2000 to 2009, the $600,000 that Mr Deniyal had already repaid pertained to loans extended during an unspecifiedearlierperiod.399Foot Note 399×NE, 10 February 2023, at 38, lines 2-9.Upon being confronted with his contradictions, Mr Niew testified that, contrary to his affidavit of evidence-in-chief, hedid not knowhow much had been loaned to Mr Deniyal.400Foot Note 400×NE, 10 February 2023, at 40, line 30, to 41, line 3.Mr Niew claimed that he did not pay any particular attention to the total quantum of loans at any one time, and only relied on the Informal Voucher System.401Foot Note 401×NE, 10 February 2023, at 58, lines 5-9; NE, 14 February 2023, at 37, lines 26-29.Mr Niew also conceded that a number of the demands listed in the Eldan Law Demand Letter were an order of magnitude smaller than the average of $2,000 to $3,000 Mr Niew claimed to have loaned each time (see above at [50]).402Foot Note 402×NE, 14 February 2023, at 27, lines 9-13.Although the absence of any documentary record might be regarded as consistent with my finding that the parties had associated on a very informal basis (see above at [92]), I reject Mr Niew’s evidence. Mr Niew’s testimony was for a significantly increased quantum and was entirely unsupported by any other evidence. 183 Third, Mr Niew’s affidavit of evidence-in-chief states that Mr Deniyal had taken personal loans from both Mr Niew as well as from the companies.403Foot Note 403×Niew’s AEIC at paras 38, 101, and 105.However, Mr Niew was adamant during cross-examination thatallthe loans had been extendedsolelyby him, and thatnoneof the money came from the companies.404Foot Note 404×NE, 10 February 2023, at 26, lines 27-32, at 27, lines 18-23, and 28, lines 16-25.This is incompatible with Mr Niew’s explanation that Mr Deniyal had borrowed $43,000 from MMPL in 2011 (see above at [166]). In my view, Mr Niew’s reliance on the payment vouchers annexed to the Eldan Law Demand Letter as proof of the Informal Voucher System and proof of substantialpersonalloans faces an insurmountable hurdle: the Eldan Law Demand Letter is framed in no uncertain terms as a demand byMMSPL(see above at [176]). I note that one of the annexed vouchers concerning the amount of $20,000 is dated 20 May 2015 and records a cheque number: SCB882376.405Foot Note 405×2DBOD at 215.According to Mr Niew’s testimony, this voucher should be a record of a personal loan. However, there is a debit transaction inMEPL’sgeneral ledger for 2015 that is described as a “CASH ADVANCE”. This transaction is dated 20 May 2015, concerns the amount of $20,000, and references “SCB882376”.406Foot Note 406×2AB at 15.According to Mr Niew’s affidavit evidence (see above at [166]), this debit transaction would represent a loan from MEPL to Mr Deniyal, not a loan from MMSPL or from Mr Niew. 184 I therefore reject Mr Niew’s evidence and find that Mr Niew did not extend substantial personal loans to Mr Deniyal. I disbelieve Mr Niew’s evidence on the purported set-offs. 185 Mr Niew wove conflicting tales about how Mr Deniyal consented to the set-off of his dividends and directors’ fees. In one version, Mr Niew would sit down with Mr Deniyal and inform Mr Deniyal about the total amount of dividends declared, followed by the total amount of outstanding debt. Mr Niew would then ask Mr Deniyal how much money the latter required for the upcoming year and deduct that amount from the declared dividends. This would be a completely private meeting without the presence or involvement of the companies’ accounts department. The remaining balance would thereafter be “transferred directly to [Mr Niew’s] account” by the accounts department under Mr Niew’s instruction.407Foot Note 407×NE, 10 February 2023, at 41, lines 28-32, to 42, lines 1-22; NE, 14 February 2023, at 54, lines 18-31.When cross-examined on how precisely Mr Niew obtained Mr Deniyal’s consent for specific set-offs (set out above at [152], [159], and [160]), Mr Niew gave another version of events. Mr Niew testified that Mr Deniyal’s consent would be obtained by the accounts department, which would get Mr Deniyal to sign a “loan return document” (see above at [175]). It was the companies’ accounts department that would inform Mr Deniyal that his dividends and directors’ fees were being used to repay debts owed to Mr Niew. The accounts department would transfer the money to Mr Niew’s account and thereafter inform Mr Niew that a debt had been repaid.408Foot Note 408×NE, 10 February 2023, at 49, lines 7-31, and 70, lines 2-7.The “loan return document” would thus be proof of Mr Deniyal’s knowledge and consent to the set-offs.409Foot Note 409×NE, 10 February 2023, at 54, line 30, to 55, line 10.Surprisingly, on the last day of trial, Mr Niew instead testified that it would be Mr Deniyal who would approach the companies’ accounts department to inform them of his outstanding debts to Mr Niew. The set-off would then be resolved between Mr Deniyal and the accounts department.410Foot Note 410×NE, 15 February 2023, at 25, lines 19-28. 186 Beyond Mr Niew’s uncertain account, the only proof of Mr Deniyal’s knowledge of and consent to the set-off of his dividends and directors’ fees against the alleged personal debts are these “loan return documents”. None of the signed financial statements or resolutions mention any loans or set-offs, and the few transactions in the general ledgers that are labelled “LOAN RETURN TO MR.NIEW” do not show Mr Deniyal’s knowledge of or consent to the purported set-off. These “loan return documents” were allegedly prepared by the companies’ accounts department.411Foot Note 411×NE, 10 February 2023, at 53, line 7-8; NE, 14 February 2023, at 38, lines 17-23.According to Mr Niew, the accounts department would create these “loan return documents” without requiring any proof of debt and without sight of the vouchers recording the original loan issued under the Informal Voucher System (above at [174]).412Foot Note 412×NE, 14 February 2023, at 57, lines 2-21. 187 The only example of a “loan return document” that Mr Niew adduced is PV 40/41 (see above at [175]).413Foot Note 413×NE, 10 February 2023, at 51-53.PV 40/41 is dated 31 December 2010. Mr Niew’s explanation for why he was able to adduce PV 40/41 in support of his case – notwithstanding the companies’ alleged policy of destroying documents after five years (see above at [57]) – was that it had been “combined with other company documents”.414Foot Note 414×NE, 10 February 2023, at 53, lines 21-28.Other “loan return documents” had been shredded and were no longer available.415Foot Note 415×NE, 10 February 2023, at 55, lines 6-8.Although this was a convenient explanation for why no other “loan return documents” were available, this evidence was fundamentally undermined by Mr Niew’s subsequent concession that PV 40/41 was in truth anelectronically storeddocument.416Foot Note 416×NE, 15 February 2023, at 43, lines 13-21.Mr Niew claimed that “accounts will have the soft copy” of other “loan return documents”, butnoneof these alleged copies of “loan return documents” were eventually adduced aside from PV 40/41. This, alongside Mr Niew’s unsatisfactory disclosure throughout this action, is enough for me to find that no “loan return documents” existed. There is no reason why these “loan return documents” were not adduced. PV 40/41 therefore does not prove that Mr Deniyal repaid sums owed under substantial personal loans extended by Mr Niew and does not prove that Mr Deniyal knew or consented to any purported set-off. 188 Additionally, I found that Mr Niew’s characterisation of PV 40/41 changed during his evidence. For example, when cross-examined on whether he had any proof that Mr Deniyal hadreceivedthe declared dividends, Mr Niew pointed to PV 40/41 an example of a “voucher” recording thedeclaration of dividends.417Foot Note 417×NE, 14 February 2023, at 53, lines 29-31, to 54, lines 1-2.This contradicts his description of PV 40/41 as a “loan return document” recording therepayment of a debtowed to Mr Niew (see above at [175]). 189 I accept Mr Deniyal’s evidence that Mr Niew had said that PV 40/41 was for the transfer of $180,000 to another company in the Mapo Group. Mr Deniyal correctly points out that PV 40/41 makes absolutely no mention of any personal loan or set-off. The only explanation Mr Niew could muster was that both men “understood” that this was the purpose of PV 40/41.418Foot Note 418×NE, 10 February 2023, at 82, lines 23-25.This contradicted his earlier admission that the explanation regarding the nature of PV 40/41 had been provided to him by the companies’ accounts department.419Foot Note 419×NE, 10 February 2023, at 74, lines 11-25. 190 Therefore,even ifMr Niew did extend substantial personal loans to Mr Deniyal, a claim I have already rejected (above at [184]), Mr Niew has no documentary evidence to support his claim that Mr Deniyal knew or consented to any purported set-off. I reject Mr Niew’s submission that the practice of setting-off dividends and directors’ fees is evidenced by MMPL’s ledger entries for 2011 and 2012 (see above at [177]). The explanations provided in Mr Niew’s affidavit of evidence-in-chief for the various transactions in the general ledgers were not Mr Niew’s own evidence (see above at [71] and [171]). In any event, Mr Niew’s explanation was that Mr Deniyal had loaned $43,000from MMPL(see above at [166]). This therefore cannot substantiate Mr Niew’s claim that there was a practice of setting-off dividends and directors’ fees against personal loans. I also note that despite claiming that the practice allegedly started with Mr Deniyal repaying debts using bonus payments (see above at [51]), Mr Niew deserted this claim at trial by denying that Mr Deniyal received any bonuses at all.420Foot Note 420×NE, 14 February 2023, at 36, lines 1-8. 191 Much of Mr Niew’s evidence relied on acts allegedly carried out by or with the involvement of the companies’ accounts department. Although Mr Niew repeatedly asserted that the accounts department would be able to answer questions posed by Mr Deniyal, Mr Niew did not callanymember of the accounts department to testify. Mr Niew claimed that a member of the accounts department would be present during board and general meetings,421Foot Note 421×NE, 9 February 2023, at 86, lines 12-22; NE, 14 February 2023, at 53, lines 1-5, and 78, line 28.but no member was called to give evidence on whether such meetings took place and what transpired during such meetings. The accounts department was not called to give evidence on the transactions recorded in the general ledgers, the existence and alleged practice of preparing and issuing “loan return documents”, or to explain the nature and purpose of PV 40/41, matters in which they were supposedly directly involved. Within Mr Niew’s vacillating accounts of how Mr Deniyal’s consent was obtained for the set-offs, the accounts department would at least have been privy to the existence of the personal loans, or were directly involved in informing Mr Deniyal that his dividends and directors’ fees would be used to set-off debts owed to Mr Niew (see above at [185]). Mr Niew even testified that some of the alleged personal loans were disbursed by way of a cheque prepared by the accounts department.422Foot Note 422×NE, 10 February 2023, at 32, lines 7-9.Mr Niew should have, but failed to call Ms Cindy or a member of the accounts department to give evidence. I must reiterate that the Informal Voucher System and use of “loan return documents” wereneverput to Mr Deniyal. These allegations arose only in the course of Mr Niew’s testimony, after the close of Mr Deniyal’s case. Having failed to call any member of the companies’ accounts department to testify, Mr Niew’s own evidence on this aspect is uncorroborated, implausible and contradictory. I reject it. Mr Deniyal’s knowledge 192 Before concluding on this point, I briefly address Mr Niew’s submission that Mr Deniyal had been aware that dividends and directors’ fees had been declared because Mr Deniyal had signed resolutions and financial statements, and the submission that Mr Deniyal must have known about and approved of transactions in the general ledgers because Mr Deniyal signed off on financial statements (see above at [154] and [167]). 193 It is difficult to accept Mr Deniyal’s claim that he was completely unaware that dividends had been declared at any point of time prior to 2018 (see above at [153]). The financial statements clearly state the total amount of dividends declared, no more than a handful of pages after the page signed by Mr Deniyal.423Foot Note 423×For example, 1AB at 574 and 579.Even if Mr Deniyal completely neglected to read the financial statements before signing them, the two directors’ resolutions signed by Mr Deniyal were eachsinglepage documents that expressly referred to dividends (in bolded text). In fact, thesolepurpose of these directors’ resolutions was to specify the quantum of dividends credited to Mr Niew and Mr Deniyal respectively.424Foot Note 424×3AB at 515 and 516.As for directors’ fees, Mr Deniyal admitted that he knew that they had been declared (above at [156]). 194 However, in my view, of greater significance is the question whether Mr Deniyal knew and agreed that these dividends and directors’ fees would beset-off against the alleged personal debtsowed to Mr Niew. 195 I accept Mr Deniyal’s evidence that he became aware of the “loan return” transactions in the general ledgers onlyafterhe obtained legal counsel.425Foot Note 425×NE, 1 February 2023, at 26, lines 6-9.Mr Deniyal could not have been aware of these purported “loan returns” because the general ledgers were not provided alongside the signed financial statements, which only state the quantum of dividends declared (see above at [142]). Neither the signed financial statements nor the signed resolutions make any mention of personal loans or set-off. Therefore, I reject Mr Niew’s submission that Mr Deniyal knew or approved of the “loan return” transactions in the general ledgers. Taking of dividends and directors’ fees amounts to commercial unfairness 196 In sum, Mr Niew initially relied on an informal agreement between the parties that their dividends and directors’ fees would be retained by the companies for their use and did not claim that Mr Deniyal had received or was credited for his entitlement. Mr Niew only adopted the latter position in his pleaded defence, raising doubt concerning the truth of his deposed claims. Although Mr Niew’s affidavit of evidence-in-chief provided favourable interpretations of the transactions recorded in the general ledgers of the companies, it was revealed during the trial that these interpretations did not originate from Mr Niew. Mr Niew failed to call any member of the companies’ accounts department to support his interpretation of the general ledgers or to buttress his claims. Aside from Mr Niew’s evidential difficulty in proving that Mr Deniyal had in fact been credited his dividends and directors’ fees, Mr Niew also failed to prove that he had extended substantial personal loans to Mr Deniyal in the first place, and that Mr Deniyal’s dividends and directors’ fees had been validly set-off against these debts. Even accounting for the imprecision arising from the parties’ lack of familiarity with accountancy and the meaning of technical terms, I reject Mr Niew’s evidence as it was undermined by fundamental contradictions and internal inconsistencies. Mr Niew also completely failed to put critical allegations to Mr Deniyal. 197 Having failed to make out his claim of substantial personal loans, Mr Niew had no valid reason to take Mr Deniyal’s dividends and directors’ fees. Mr Niew concedes that once declared, Mr Deniyal was entitled to receive these dividends and directors’ fees. Mr Deniyal had a legitimate expectation to be treated fairly by Mr Niew and to share in the profits of MEPL and MMPL (above at [94]). By using the corporate mechanisms of MEPL and MMPL to reroute Mr Deniyal’s entitlement, Mr Niew abused his power as a director and the controlling shareholder of the companies in disregard of Mr Deniyal’s legitimate interests. In short, Mr Niew diverted monies due to Mr Deniyal to himself at source, using his position in the companies. This point distinguishes the facts of this case from wrongs done by one shareholder to another outside the corporate context, which by contrast may well be collateral matters irrelevant to an application under s 216 of the Companies Act.",
        "Conclusion": "215 Mr Niew was the dynamo in the engine that powered the companies; Mr Deniyal, however, was still a trusted cog vital to the companies’ success. Both men started out with the understanding that Mr Deniyal would be rewarded for his service, but, unknown to Mr Deniyal, somewhere along the line, perhaps because he believed he was solely responsible for the companies’ success, Mr Niew took for himself dividends and directors’ fees that rightfully belonged to Mr Deniyal. When Mr Deniyal started to make inquiries, Mr Niew terminated him. Mr Niew then took the unilateral step of substantially increasing his salary and placing himself on the payrolls of MEPL and MMPL. The appropriate remedy is for Mr Niew to buy-out Mr Deniyal’s share in the companies on the basis that I have ordered. 216 Parties have 14 days to file submissions on costs limited to 10 pages each excluding any appendices showing the breakdown of time spent and disbursements incurred. Parties should then seek to agree costs between themselves. Further, parties should seek to agree on the identity of an independent valuer as well as the form of the orders to be extracted. 217 If parties are unable to reach agreement on any of the matters in the preceding paragraph within 28 days, parties should then file written submissions concerning any disagreement limited to a total of 15 pages each. Thereafter, the court will make a decision without any further hearing, unless the court considers a hearing necessary. Philip JeyaretnamJudge of the High Court Walter Ferix Silvester, Alexander Nathanael Walter and Tan Hoe Shuen (Silvester Legal LLC) for the plaintiff; Ong Zhenhui Wayne (Wayne Ong Law Practice) for the first and second defendant; Poonaam Bai d/o Ramakrishnan Gnanasekaran and Yang Yuanhong, Bernard (Eldan Law LLP) for the third defendant.",
        "Issue 3: Whether the action is an abuse of process": "200 Mr Niew submits that this action amounts to an abuse of process because Mr Deniyal failed to accept two reasonable buy-out offers by Mr Niew,426Foot Note 426×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 159-162.and because Mr Deniyal should have brought a contractual claim against MEPL and MMPL for unpaid directors’ fees and dividends.427Foot Note 427×3rd Defendant’s Closing Submissions dated 29 March 2023 at paras 154-155; 3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 93-96.I do not accept Mr Niew’s submissions and find that this action was not an abuse of process.",
        "Buy-out offer": "201 Mr Niew extended two buy-out offers on 22 August 2022 and 14 December 2022 (see above at [42]). 202 The offer on 22 August 2022 provided for a buy-out of Mr Deniyal’s shares at “fair value” as determined by an independent valuer who was to be either jointly appointed by the parties or appointed by the court. The valuation date was to be fixed as the date of the acceptance of the offer. A discount was to be applied for Mr Deniyal’s minority shareholding, but the independent valuer would be tasked with investigating whether Mr Niew either misappropriated any funds or failed to pay any dividends or directors’ fees during the period between 9 April 2015 to the date of valuation. The price would then be adjusted accordingly. The valuer was to be confined to the cause papers and documents disclosed by the parties as of 22 August 2022.428Foot Note 428×2DBOD at 242-247.Mr Deniyal did not accept this offer and issued a counter-offer dated 3 October 2022. The counter-offer proposed to expand the scope of the investigation into whether Mr Niew misappropriated any funds to a period starting in 2005 until the date of valuation. The period of investigation into unpaid dividends and directors’ fees was similarly proposed to be expanded to start from the date of MEPL and MMPL’s incorporation until the date of valuation.429Foot Note 429×2DBOD at 241.Mr Niew evidently did not take up the counter-offer. 203 The offer on 14 December 2022 was on substantially the same terms, but removed the limits on the scope of the valuer’s investigations. Instead, the valuer was to “make appropriate adjustments as he deems fit to the value of the shares based on his review of the companies’ records”, based on the documents disclosed as of 14 December 2022.430Foot Note 430×1AB at 264-266.Mr Deniyal did not accept this offer. 204 Mr Niew submits that maintaining an action under s 216 of the Companies Act in the face of a reasonable offer to buy-out Mr Deniyal’s shares is an abuse of process.431Foot Note 431×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 160.The main remedy Mr Deniyal seeks is a buy-out, precisely what had already been offered by Mr Niew. This action therefore resulted in an unnecessary waste of time and costs.432Foot Note 432×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 89-92.In principle, I agree that sustaining an action under s 216 of the Companies Act in the face of a reasonable buy-out offermayamount to an abuse of process (Lim Swee Khiang and another v Borden Co (Pte) Ltd and others[2005] 4 SLR(R) 141 at [97], citingO’Neill([80]supra) at 1107). 205 Mr Deniyal submits that this action cannot be regarded as an abuse of process and that he is not seeking an unjustified windfall. Mr Deniyal testified that he was unwilling to accept the buy-out offers as no price had been stated.433Foot Note 433×NE, 2 February 2023, at 25, lines 18-20.Any valuation undertaken at that juncture would fail to account for the diminution in value occasioned by Mr Niew’s oppressive conduct, which had the effect of reducing the book value of the shares.434Foot Note 434×NE, 2 February 2023, at 26, lines 1-6.Litigation was therefore necessary to determine the effect of Mr Niew’s oppressive conduct on the value of the shares.435Foot Note 435×Plaintiff’s Reply Submissions dated 12 April 2023 at paras 4-9, 15(a), 59. 206 I accept Mr Deniyal’s submission. I do not agree with Mr Niew that Mr Deniyal’s continuing with his claims following the buy-out offers was unreasonable. The key difficulty with those offers was that they depended on the valuer to carry out an investigation into whether there had been misappropriation or unfair conduct. This is not the role of a valuer and it is hard to see how the valuer could have undertaken this effectively, given that it would involve determining whose account of events was correct. The proposals were therefore unworkable without the assistance of a trial and the directions of the court (Tan Eck Hong vMaxz Universal Development Group Pte Ltd and others[2019] 3 SLR 161 at [217]). I also consider Mr Niew’s unsatisfactory disclosure relevant, given that the valuer would be limited to the documents provided to him (Lim Chee Twang([104]supra) at [138]). This is also why I accept Mr Deniyal’s explanation as to why he declined to call Mr Farooq Mann (see above at [67]–[68]).",
        "Sakae Test": "207 The proper plaintiff rule requires a shareholder who complains about what are essentially corporate wrongs committed against a company to bring a derivative action to vindicate those wrongs, rather than an action under s 216 of the Companies Act. InSakae Holdings([79]supra), the Court of Appeal established the test applicable to determine whether a claim brought under s 216 of the Companies Act which features corporate wrongs is an abuse of process (at [115]–[116]). First, the court must identify the real injury that the claimant seeks to vindicate, and whether this is an injury that is distinct from the injury to the company that amounts to commercial unfairness against the claimant. Second, the court must determine the essential remedy that is being sought. The court must then decide whether that remedy meaningfully vindicates the real injury suffered by the claimant, and whether it is one which can only be obtained under s 216 of the Companies Act (the “Sakaetest”). 208 Mr Niew submits that this action is an abuse of process under theSakaetest.436Foot Note 436×3rd Defendant’s Closing Submissions dated 29 March 2023 at para 155.The real injury suffered by Mr Deniyal is the alleged non-payment of directors’ fees and dividends. This claim is properly a contractual action brought against MEPL and MMPL, and not a claim against Mr Niew under s 216 of the Companies Act. Had Mr Deniyal brought a claim in contract, it would have been time-barred under s 6(1) of the Limitation Act as the directors’ fees and dividends were declared well over six years ago. Therefore, Mr Deniyal cannot be allowed to use s 216 of the Companies Act to circumvent the limitation.437Foot Note 437×3rd Defendant’s Reply Submissions dated 12 April 2023 at paras 93-96. 209 Mr Deniyal submits that this mischaracterises his case, which is that Mr Niew has engaged in a course of conduct that is commercially unfair. Binding authority establishes that an action under s 216 of the Companies Act may be brought on the basis of an unfair distribution or failure to declare dividends.438Foot Note 438×Plaintiff’s Reply Submissions dated 12 April 2023 at para 56. 210 TheSakaetest is concerned with the issue of whether a claimant is the proper party to bring a personal claim under s 216 of the Companies Act based on what appears to be a corporate wrong, rather than the issue of whether that claimant can elect to bring a claim under s 216 of the Companies Act when other causes of action are also available to that claimant. The short answer to Mr Niew’s submission is that the corporate constitution is a statutory contract between the members of a companyinter se, as well as between the members and the company itself (s 39(1) of the Companies Act). It is beyond doubt that this contract is enforceable (Independent State of Papua New Guinea v PNG Sustainable Development Program Ltd[2020] 2 SLR 200 at [41]). It is equally well established that a breach of a company’s constitutional documents can give rise to commercial unfairness (Sakae Holdings([79]supra) at [172]). Mr Niew’s abuse of corporate mechanisms to reroute Mr Deniyal’s dividends and directors’ fees into Mr Niew’s directors’ account is a proper foundation for relief under s 216 of the Companies Act. This case is not ultimately about seeking payment from the companies for declared dividends or resolved directors’ fees that the companies failed to pay. 211 For completeness, even though Mr Niew did not make this submission, it appears that some of the other allegations raised by Mr Deniyal arguably concerned corporate wrongs. I say no more on this issue as the acts that I have found to be commercially unfair were undoubtedly personal wrongs directed against Mr Deniyal by Mr Niew. This action is therefore not an abuse of process by Mr Deniyal.",
        "Issue 4: The appropriate relief": "212 Although Mr Deniyal sought winding up as an alternative remedy, Mr Deniyal is primarily seeking a buy-out of his shares.439Foot Note 439×Plaintiff’s Closing Submissions dated 29 March 2023 at para 27.Having found that Mr Niew acted in a manner amounting to commercial unfairness, I agree that a buy-out order is the most appropriate remedy. 213 I order that Mr Deniyal’s shares be valued as at 31 March 2020, just before Mr Niew placed himself on the payrolls of MEPL and MMPL. The valuation is to be undertaken on a going concern basis andwithoutany discounts, including discounts for the fact that Mr Deniyal holds a minority shareholding, for illiquidity, or non-marketability. 214 The further question is whether it is appropriate to adjust the valuation of the shares to account for Mr Niew’s rerouting of Mr Deniyal’s dividends from MMPL and directors’ fees from MMPL and MEPL, and if it is appropriate, how this should be done. The discretion under s 216(2) of the Companies Act to craft an appropriate relief is undoubtedly wide. In determining the appropriate valuation of the shares, the court is not bound to strict accounting principles. Instead, the goal is to determine what is fair and just in the particular circumstances of the case (WeiFengpin v Raymond Low Tuck Loong and others[2022] 2 SLR 363 at [32]). In my view, it is fair and just in the specific circumstances of this case to add the amount of $636,408.28 to the valuation of Mr Deniyal’s shares in the companies. This represents the total amount of dividends and directors’ fees which Mr Niew admits were rerouted to himself (see above at [154], [159], [160], and [165]). It would not be sufficient to add these amounts to the valuation of the companies as a whole, as Mr Deniyal was solely entitled to these moneys. At all material times, Mr Deniyal and Mr Niew were the only shareholders of the companies, and it was Mr Niew who procured Mr Deniyal’s entitlement for himself."
    }
}