{
    "case_title": "Kotagaralahalli Peddappaiah NagarajavMoussa Salem and others",
    "ncitation": "[2023] SGHC 68",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 The plaintiff commenced this action seeking to vindicate his claim to be the beneficial owner of one share or one-third of the shares in the third defendant under or by reason of a trust declared by the second defendant by deed on 23 July 2015 (“the 2015 Trust Deed”). I delivered my judgment on the merits of this action in January 2023 (seeKotagaralahalliPeddappaiah Nagaraja v Moussa Salem and others[2023] SGHC 6 (“KPN”)). In that judgment, I dismissed the plaintiff’s claim in its entirety. 2 I now set out my judgment on the costs of this action. It should be read together withKPN. All abbreviations in this judgment are to bear the meanings ascribed to them inKPN. All sums of money in this judgment have been converted to Singapore dollars at the rates provided by the parties and rounded off to the nearest dollar. 3 The plaintiff’s statement of claim in this action originally pleaded four claims against four defendants: (a) breach of contract;1Foot Note 1×Statement of Claim dated 23 July 2020 (“SOC”) at paras 23, 32(1), 33 and 38.(b) a conspiracy against him by two or more of the defendants;2Foot Note 2×SOC at paras 34 and 39–41; Certified Transcript 4 December 2020 in HC/SUM 3307/2020, HC/SUM 3780/2020, HC/SUM 3781/2020, HC SUM 4421/2020 and HC/SUM 4422/2020 at pp 13–14, p 17 lines 10–14 and p 28 lines 24–31.(c) minority oppression under s 216 of the Companies Act 1967 (2020 Rev Ed);3Foot Note 3×SOC at paras 48–50.and (d) breach of the express trust constituted by the 2015 Trust Deed.4Foot Note 4×SOC at paras 42–46. 4 In December 2020, I struck out as being plainly and obviously unsustainable all of the plaintiff’s claims except for the last claim: that that there had been a breach of the express trust constituted by the 2015 Trust Deed.5Foot Note 5×HC/ORC 7028/2020 dated 22 December 2020, extracted 29 December 2020.It is that single claim which proceeded to trial and which I adjudicated upon on the merits inKPN. I shall refer to the plaintiff’s claims which I struck out in December 2020 collectively as “the unsustainable claims”. 5 In September 2021, the plaintiff discontinued his claim against one of the defendants, Mr Gluck, paying costs to Mr Gluck in order to do so (KPNat [11]).6Foot Note 6×Certified Transcript 17 September 2021 in HC/SUM 3826/2021 at p 100 lines 3–12.This action therefore proceeded to trial against only the three defendants who are now named in its title. 6 InKPN, I held that the presumption of a resulting trust arose over the Shares in favour of the first defendant because the first defendant: (a) paid the direct consideration for the Shares; and (b) undertook and discharged the contractual obligation which had causative force in vesting the Shares in the second defendant (KPNat [84]–[92] and [122]–[124]). I found further that this presumption stood unrebutted because there was no objective intention that anyone other than the first defendant was to have any part of the beneficial interest in the Shares (KPNat [93]–[118]). 7 As a result, I held that the first defendant was the sole beneficial owner of all of the Shares. The 2015 Trust Deed was nothing more than an imperfect gift which equity would not assist the plaintiff to perfect, the plaintiff being a volunteer (KPNat [118]). I therefore dismissed the plaintiff’s action in its entirety. 8 Each of the defendants now seeks an order that its costs of and incidental to this action be paid by the plaintiff. Having considered the oral and written submissions from the parties on costs, I now make my orders as to costs.",
        "The first defendant": "",
        "The event": "9 I begin by considering the first defendant’s claim for costs against the plaintiff. 10 The starting point in exercising the discretion to award costs is ascertaining the event (Comfort Management Pte Ltd v OGSP Engineering Pte Ltd and another[2022] 5 SLR 525 (“Comfort Management”) at [27]). The event is the outcome of the litigation overall(Comfort Managementat[28]). If a court is minded to make any order for costs at all, its discretion ought ordinarily to be exercised to order that costs follow the event (O 59 r 3(2) of the Rules of Court (Cap 322, 2014 Rev Ed) (“Rules of Court 2014”)). 11 The event in this action is undoubtedly against the plaintiff and undoubtedly in favour of the first defendant (Comfort Managementat [28]–[29]). The first defendant is thereforeprima facieentitled to an order that the plaintiff pay the first defendant’s costs of and incidental to this action (Comfort Managementat [39]). 12 Further, the event in this action is entirely against the plaintiff and entirely in favour of the first defendant. There are therefore no grounds for ordering that the first defendant be deprived of any part of his costs, let alone for ordering the first defendant to pay any part of the plaintiff’s costs. 13 The only two questions to be determined on the first defendant’s claim for his costs are: (a) whether the first defendant’s costs should be assessed on the standard basis or the indemnity basis; and (b) the quantum of those costs.",
        "Standard or indemnity basis": "14 The first defendant submits that his costs should be assessed on the indemnity basis for four reasons. First, the plaintiff commenced this action in bad faith and with an improper purpose.7Foot Note 7×1st Defendant’s Written Submissions dated 30 January 2023 (“D1WS”) at paras 24–33.Second, the plaintiff’s case was constantly evolving.8Foot Note 8×D1WS at paras 34–38.Third, the plaintiff behaved dishonestly, abusively and improperly.9Foot Note 9×D1WS at paras 39–41.Fourth, the plaintiff was an evasive and untruthful witness.10Foot Note 10×D1WS at paras 42–44. 15 I do not accept that the first defendant’s costs should be assessed on the indemnity basis for any of the four reasons he advances. Action commenced in bad faith and with an improper purpose 16 The first reason the first defendant advances for his costs to be assessed on the indemnity basis is that the plaintiff commenced this action in bad faith and with an improper purpose and put forward claims which are fabricated and plainly unsustainable.11Foot Note 11×D1WS at paras 24–33.Although the first defendant does not elaborate on the nature of the improper purpose, I take it as a submission that the plaintiff commenced the action and advanced his claims – including both the unsustainable claims (see [4] above)andthe claim on the 2015 Trust Deed – with no genuine belief that he had a plausible claim on the facts or on the law but for the improper purpose of creating a bargaining chip to secure an advantage in continued negotiations with the first defendant for the compensation the plaintiff was to receive for his contributions to the third defendant’s business. 17 I do not accept the first defendant’s submission. All of the first defendant’s costs of and incidental to this action can be put into one of two categories: (a) the costs of and incidental to the unsustainable claims; and (b) the costs of and incidental to the claim on the 2015 Trust Deed. I do not accept that there is any basis for assessing the first defendant’s costs in either of these two categories on the indemnity basis on the ground that the plaintiff commenced this action in bad faith or for an improper purpose. 18 I take each of these two categories of costs in turn. (1) The costs of the unsustainable claims 19 To the extent that the plaintiff caused the first defendant to incur costs in this action by advancing fabricated or plainly unsustainable claims, the first defendant has already received a deemed indemnity against those costs. When I struck out the plaintiff’s unsustainable claims in December 2020 (see [4] above), I ordered the plaintiff to pay costs of $20,455 to Mr Gluck12Foot Note 12×HC/ORC 7028/2020 dated 22 December 2020, extracted 29 December 2020.and costs of $17,072 to the first defendant.13Foot Note 13×HC/ORC 7029/2020 dated 22 December 2020, extracted 29 December 2020.Those costs were sought and assessed on the standard basis. These costs were a deemed indemnity to the first defendant and Mr Gluck for each of their costs of and incidental to defending the unsustainable claims. InThenKhek Koon and another v Arjun Permanand Samtani and another and other suits[2014] 1 SLR 245 at [197], I explained the indemnity principle which underlies the court’s discretion to award costs and explained, in that context, the concept of a deemed indemnity as opposed to an actual indemnity. 20 Having awarded the first defendant a deemed indemnity for the costs of and incidental to the unsustainable claims, I consider that it would be wrong in principle for me now to enhance the basis of assessment for the first defendant’s deemed indemnity for those costs from the standard basis to the indemnity basis. 21 It is true that I found all of the claims that the plaintiff originally pleaded to be unsustainable, with the exception only of the claim on the 2015 Trust Deed. But when I struck out the unsustainable claims, the first defendant could have then invited me to assess the first defendant’s costs of and incidental to the unsustainable claims on the indemnity basis on the grounds that that those claims weresounsustainable that they warranted the inference that the first defendant now invites me to draw (see [16] above). He did not do so then. I consider it too late for him to do so now. 22 There is, of course, no rule of law which precludes the first defendant from inviting me now to enhance the basis on which I assessed his costs of and incidental to the unsustainable claims. My interlocutory award of costs in favour of the first defendant creates nores judicataor issue estoppel of any sort which now binds the first defendant and the plaintiff, or which now constrains my discretion on costs. But I consider it wrong in principle to revisit this issue, at least in the absence of changed circumstances. And I do not consider the fact that the first defendant has succeeded entirely in this action as a relevant change of circumstances. That is because the outcome of the striking out application was, in and of itself, an event for the purposes of an award of costs. The event in this litigation overall is an entirely separate and independent event. It is a circumstance of no relevance to the event which gave rise to the earlier award of costs. (2) The costs of the claim on the 2015 Trust Deed 23 I now turn to the second category of the first defendant’s costs of this action (see [17] above): the costs of and incidental to the claim on the 2015 Trust Deed. 24 Even if I were to assume, in favour of the first defendant, that the plaintiff advanced the unsustainable claims in bad faith and for an improper purpose, I do not consider that to be a proper basis from which to draw the inference that the plaintiff advanced his claimon the 2015 Trust Deedin bad faith and for an improper purpose. 25 It is certainly true that the abject failure of all but one claim in the plaintiff’s elaborate case to survive a striking out application could justify the inference that the first defendant invites me to draw (see [16] above) about the only claim which did survive. It is also true that that single claim is a fairly narrow and technical claim on the 2015 Trust Deed. But that claim cannot on its face be stigmatised as tenuous or contrived. It is an objectively sustainable claim, both on the facts and on the law. That is the very reason I did not strike it out and allowed it to continue to trial. I do not consider that it would be correct in principle for me to draw – from the nature or the failure of this claim – the inference that the first defendant invites me to draw about the plaintiff’s motive in bringing his claim on the 2015 Trust Deed. 26 Before I leave this point, I should make clear that none of what I have said about the nature of the plaintiff’s unsustainable claims or my decision to strike them out is intended as any criticism of the plaintiff’s solicitors. I am satisfied that they conducted themselves at all times in accordance with their instructions and, more importantly, with their professional duties both under written law and at common law, in advancing his many claims. Case constantly evolving 27 The second reason the first defendant advances for his costs to be assessed on the indemnity basis is that the plaintiff’s case was constantly evolving.14Foot Note 14×D1WS at paras 34–38. 28 It is true that the plaintiff amended his statement of claim four times before trial. But the first and second round of amendments took place before I struck out the unsustainable claims.15Foot Note 15×D1WS at para 36; Statement of Claim (Amendment No. 1) dated 18 September 2020; Statement of Claim (Amendment No. 2) dated 16 November 2020.The third round of amendments took place as a result of my order striking out the unsustainable claimsie, in order give effect to my order by removing these claims from the pleadings and to refocus the plaintiff’s pleading on the 2015 Trust Deed.16Foot Note 16×D1WS at para 36; Statement of Claim (Amendment No. 3) dated 15 January 2021.Therefore, the costs order I made when I struck out the unsustainable claims incorporated a deemed indemnity to the first defendant for his costs of and incidental to three out of the plaintiff’s four rounds of amendments. 29 The plaintiff’s fourth round of amendments took place after I struck out the unsustainable claims and was not necessitated by the striking out.17Foot Note 17×D1WS at para 37; Statement of Claim (Amendment No. 4) dated 24 September 2021.But when I granted the plaintiff leave to make his final round of amendments, I ordered him to pay to Mr Gluck and the first defendant, who were then jointly represented, a single set of costs fixed at $12,000.18Foot Note 18×Certified Transcript 17 September 2021 in HC/SUM 3826/2021 at p 100 lines 15–16.Again, the time for the plaintiff to ask for his costs arising from the plaintiff’s conduct in evolving his case one more time to be assessed on the indemnity basis was when I made that order for costs. The plaintiff did not do so then. I do not consider there to have been any change of circumstances to render it appropriate for him to do so now. 30 Finally, even taking the first defendant’s case at its highest, I do not consider that I can take the fact that the plaintiff’s case was constantly evolving as a basis to draw the inference that the first defendant now invites me to draw (see [16] above) about his claim on the 2015 Trust Deed. It is not uncommon for a party to amend its pleadings before trial. It is also not uncommon for a party to do so multiple times. The fact that the plaintiff made four rounds of amendments is not a factor which is enough, either in itself or taken with the other factors that the plaintiff advances, to warrant an order that the first defendant’s costs of and incidental to this action be assessed on the indemnity basis. Stop notice 31 The third reason the first defendant advances for his costs to be assessed on the indemnity basis is that the plaintiff behaved dishonestly, abusively and improperly when he applied to have the court issue a stop notice to prevent the third defendant from registering any transfer of the Shares and from paying any dividends on the Shares while this action was pending.19Foot Note 19×D1WS at paras 39–41. 32 It is true that the plaintiff did apply for a stop notice to be issued.20Foot Note 20×HC/OS 1287/2020.If he had made that application by way of an interlocutory summons in this action, it might be possible to take that conduct into account as a basis for assessing the first defendant’s costs of the action on the indemnity basis. But that is not what the plaintiff did. He instead made that application by way of a separate originating summons.21Foot Note 21×D1WS at para 39.That originating summons was issued in December 2020, six days after I struck out the unsustainable claims. In January 2021, the first defendant, the third defendant and Mr Gluck applied to have that originating summons struck out as an abuse of the process of the court.22Foot Note 22×HC/SUM 173/2021 in HC/OS 1287/2020.The grounds which they raised then to stigmatise the originating summons as an abuse are the very same grounds that the first defendant now raises to submit that the plaintiff has behaved so dishonestly, abusively or improperly as to warrant an award of costs assessed on the indemnity basis. 33 In March 2021, I declined to strike out the plaintiff’s originating summons. Despite that, I not only deprived the plaintiff of his costs of that striking out application, I ordered the plaintiff to pay the costs of the application to the first defendant, the third defendant and Mr Gluck, such costs fixed at $21,000 (seeComfort Managementat [41]–[88] for the applicable principles).23Foot Note 23×Certified Transcript 24 March 2021 in HC/OS 1287/2020 at p 111 lines 7–12. 34 The originating summons that the first defendant now complains of caused the first defendant to incur an independent set of costs, entirely separate from the costs of this action. The plaintiff’s conduct in taking out that originating summons therefore did not increase the first defendant’s costs of defendingthis action. To the extent that the plaintiff incorrectly or improperly brought the originating summons, I took that into account when I ordered him to pay the costs of the application to strike out the originating summons, even though the event on the striking out application was in his favour. 35 The originating summons is still pending. When it concludes, it remains open to the first defendant, if there is a basis, to seek an order that the plaintiff pay the first defendant’s costs of the originating summons as a whole assessed on the indemnity basis. 36 For all of the foregoing reasons, it would be wrong in principle for me to take into account the plaintiff’s conduct in commencing and prosecuting that originating summons as a ground for assessing the costs ofthis actionon the indemnity basis. 37 The first defendant also relies the plaintiff’s refusal to withdraw the stop notice after I handed down my judgment inKPNin January 2023 as evidence of the plaintiff’s dishonest, abusive or improper behaviour.24Foot Note 24×D1WS at paras 40–41.However, the reason which the plaintiff gave for his refusal was that he was considering his right of appeal against my decision inKPN.25Foot Note 25×D1WS at pp 66–68.It is, of course, true that my decision inKPNbound the plaintiff with immediate effect as soon as it was handed down, and that it did so even if he intended to or actually did file an appeal. He was so bound until and unless my decision was reversed on appeal or was stayed pending appeal. So the plaintiff’s conduct in refusing to withdraw the stop notice undoubtedly amounts to arrogating to himself the benefit of a stay of execution without taking the trouble to apply for one, let alone securing one. But I do not consider it correct to characterise conduct of this type as dishonest, abusive or improper. I would characterise it at worst as being overly optimistic and an overreach. 38 Furthermore, even if the plaintiff’s conduct can correctly be characterised as dishonest, abusive or improper, it remains the case that that conduct has taken place in separate proceedings. The first defendant’s remedy on all matters related to the stop notice – whether on the merits, on costs or otherwise – lies in those proceedings, not in this action. Evasive and untruthful 39 The fourth reason the first defendant advances for his costs to be assessed on the indemnity basis is that the plaintiff was an evasive and untruthful witness at the trial of this action.26Foot Note 26×D1WS at paras 42–44. 40 It is true that I found that the plaintiff’s evidence was, in critical respects, at variance with the contemporaneous documents and the inherent probabilities. It is also true that I found that the plaintiff changed his evidence in critical respects under cross-examination. However, I did not find that the plaintiff was deliberately or knowingly untruthful or evasive, whether in his written or his oral evidence. That is not to say that I found himnotto be deliberately or knowingly untruthful. It was simply unnecessary for my decision on the merits of the plaintiff’s claim or of the first defendant’s defence to make any finding as to the cause of the variance between the plaintiff’s evidence and the contemporaneous documents or the inherent probabilities, one way or the other. It sufficed for me merely to find that there was a variance and that the variance warranted rejecting his evidence. 41 I therefore do not consider that this reason warrants an order that the costs which the plaintiff must pay to the first defendant be assessed on the indemnity basis. Conclusion 42 For all of the foregoing reasons, I hold that the costs which the plaintiff will have to pay to the first defendant should not be assessed on the indemnity basis, but should be assessed in the usual way on the standard basis.",
        "Quantum": "148 The second defendant claims an indemnity in the sum of $140,957 broken down as follows:85Foot Note 85×Letter from Infinitus Law Corporation dated 30 January 2023 at pp 4–7. (a) $47,551 for the pleadings and interlocutory applications for an interim injunction and to strike out the claim. (b) $1,926 for the second defendant’s attendance to matters on behalf of the third defendant in relation to this action and the execution of nine affidavits. (c) $49,156 for pleadings and interlocutory applications for security for costs, an interim injunction and to strike out the claim. (d) $4,841 for pleadings and discovery. (e) $26,403 for discovery and interlocutory applications for specific discovery and amendment. (f) $11,081 for pleadings, discovery, further security for costs and pre-trial work. I do not accept that the figure of $140,957 which the defendant claims is anywhere near a reasonable figure for an award of costs to the second defendant, even on the indemnity basis. 149 I take as my starting point the quantum of $800,000 which the first defendant claims as costs on the indemnity basis in this action.86Foot Note 86×D1WS at para 20.I take that figure as a reasonable proxy for the first defendant’s solicitor and client costs. In my estimation, the legal costs that the second defendant incurred in this action between July 2020 and December 2020 amounts at best to 10% of the legal costs that the first defendant incurred over the full 30 months that this litigation took to conclude, including the 7½ day trial and the oral closing submissions. I also accept the plaintiff’s submission, which counsel for the second defendant herself accepted in oral submissions, that the legal costs incurred by the second defendant after December 2020, including the costs associated with keeping track of the progress of this action and making her submissions on costs, werede minimis. 150 I therefore fix the quantum of costs which the plaintiff must pay to the second defendant assessed on the indemnity basis at $80,000 including disbursements. Against this sum, the second defendant accepts that she must give credit to the plaintiff for $38,010 comprising the following sums awarded against the plaintiff and to the second defendant as fixed costs in interlocutory proceedings:87Foot Note 87×Letter from Infinitus Law Corporation dated 30 January 2023 at p 8. (a) $1,200 for the second defendant’s application for security for costs. (b) $9,270 for the plaintiff’s application for an interim injunction. (c) $18,540 for the second defendant’s application to strike out the statement of claim. (d) $9,000 for the plaintiff’s application to amend his statement of claim. 151 All of these costs were awarded to the second defendant on the standard basis. Part of the $80,000 in costs which I now award to the second defendant on the indemnity basis goes to make up the difference between costs on the standard basis and costs on the indemnity basis for the subject matter of these four costs awards. I do not consider that there is anything which precludes the second defendant from seeking this enhancement. That is because, for the reasons I have given above, I accept that the second defendant has a contractual right to an indemnity for these costs from the plaintiff and the second defendant has undertaken to forgo that right in exchange for an award of these costs on the indemnity basis. 152 Deducting $38,010 for the costs already awarded to the second defendant from the $80,000 which I now award her leaves a net sum of $41,990 which the plaintiff must now pay the second defendant.",
        "The second defendant": "121 I now turn to consider the second defendant’s claim for costs against the plaintiff. 122 The second defendant claims costs in the sum of $140,957 being an indemnity for her costs of this action.75Foot Note 75×Letter from Infinitus Law Corporation dated 30 January 2023 at para 4. 123 The plaintiff denies any liability whatsoever to pay costs to the second defendant. His submission is that she was a nominal defendant in that she was named as a party “only … in order to be bound by the outcome of this case”.76Foot Note 76×PWS at para 4.The plaintiff also points to the fact that the second defendant did not play an active role in the proceedings, not only after I struck out the unsustainable claims in December 2020 but even before I did so.77Foot Note 77×PWS at para 20.",
        "The second defendant is entitled to costs": "124 It is true that the second defendant took little active part in this action both before and after December 2020, leaving it to the first defendant to take the lead. It is also true that the second defendant did not give any discovery or file any affidavits of evidence in chief for the trial of this action. But I do not accept that she was a “nominal” party to this action, either when the plaintiff commenced this action or after I struck out the plaintiff’s unsustainable claims. 125 When the plaintiff commenced this action, it was part of his positive pleaded case that the second defendant had acted in breach of trust by denying that she holds any Shares on trust for the plaintiff and by purporting to declare a second trust over the Shares by the 2016 Trust Deed (KPNat [28]–[29]).78Foot Note 78×SOC at paras 42–44.That is a serious allegation, especially for a professional trustee. Quite reasonably, the second defendant felt compelled to seek legal representation from the outset, to file a defence and to participate in the action. Even after I struck out the unsustainable claims in December 2020, the plaintiff insisted on retaining the paragraph in his statement of claim which pleaded that the second defendant had acted in breach of trust.79Foot Note 79×Statement of Claim (Amendment No. 3) dated 15 January 2021 at para 44; Statement of Claim (Amendment No. 4) dated 24 September 2021 at para 44.It was therefore entirely reasonable for the second defendant to incur legal costs, both before and after I struck out the unsustainable claims. 126 It is true, however, that in no iteration of the plaintiff’s statement of claim ever sought any relief related to the breach of trust alleged against the second defendant. Further, the plaintiff indicated at an early stage that he would not seek a finding that the second defendant was in fact in breach of trust.80Foot Note 80×Certified Transcript 17 September 2021 in HC/SUM 3826/2021 at p 24 lines 1–16 and p 66 lines 8–15.But that does not alter my analysis for three reasons. First, the plaintiff’s approach meant that an allegation that the second defendant had acted in breach of trust remained on the record in the pleadings throughout this action. Second, the second defendant is a professional trustee, against whom this is an especially serious allegation even if it does not or cannot lead to a finding that she acted in breach of trust. Finally, it was open to the plaintiff at any time to withdraw his indication and to invite me to make a finding against the second defendant that she had acted in breach of trust as pleaded. I therefore do not consider it correct to say that the second defendant was a purely nominal party to this action, either when the plaintiff commenced this action or after December 2020. 127 I am therefore satisfied that the second defendant acted reasonably in incurring legal costs of and incidental to defending this action. That is true even though she allowed the first defendant to take the lead in resisting the plaintiff’s claim throughout this litigation. That was a very reasonable and sensible approach on the part of the second defendant and her legal representatives to avoid incurring unnecessary costs. To that extent, and given the outcome of the litigation, the benefit of the second defendant’s reasonable and sensible approach has enured to the plaintiff. 128 The second defendant is entitled to recover the costs which she has reasonably incurred from someone. The question is whom. As in the case of the first defendant, the second defendant’s costs should follow the event (see [10] above). The plaintiff’s claim alleged expressly that the second defendant had acted in breach of trust. The plaintiff has failed entirely in establishing that allegation. Under the general rule, therefore, it is the plaintiff who should pay the second defendant’s costs (Comfort Managementat [39]). There is no basis on which to depart from the general rule.",
        "The award of costs": "129 Two questions arise in awarding the second defendant her costs: (a) whether those costs should be assessed on the standard basis or the indemnity basis; and (b) in what quantum those costs should be assessed. For the reasons which follow (see [130]–[150] below), I find: (a) that the plaintiff is liable to pay costs to the second defendant on the indemnity basis; and (b) that those costs should be assessed in the gross sum of $80,000. Standard basis or indemnity basis 130 To support her claim for costs on the indemnity basis, the second defendant relies on a letter of indemnity issued by the plaintiff and which the second defendant claims she is entitled to enforce against him. The second defendant relies on the letter of indemnity in two ways. The first way is as a contract. She invites me, in effect, to vindicate her contractual right by awarding her a monetary indemnity for the costs she has incurred of and incidental to defending this action. In the alternative, the second defendant invites me to rely on the existence of the indemnity as a factor in the exercise of my discretion to order that her costs be assessed on the indemnity basis. 131 In order to take the letter of indemnity into account as a factor in the exercise of my discretion, I must form a view as to whether the second defendant indeed has a contractual right to recover her costs of and incidental to this action under the letter of indemnity. For the reasons which follow (see [132]–[145] below), I accept: (a) that the plaintiff owes the second defendant a contractual obligation to indemnify her against legal costs she incurs in the course of providing services to the third defendant as a shareholder and as a director of the third defendant; and (b) that the legal costs she has incurred of and incidental to this action come within the scope of the indemnity. I make these findings not for the purpose of adjudicating on the parties’ substantive contractual rights under the letter of indemnity, and therefore binding them by adjudication, but merely to establish that it is legitimate for me to take the letter of indemnity into account in the exercise of my procedural discretion to award costs (Telemedia Pacific Group Ltd v Credit Agricole (Suisse) SA (Yeh Mao-Yuen, third party) [2015] 4 SLR 1019 (“Telemedia Pacific”) at [24]). (1) The plaintiff is obliged to indemnify the second defendant 132 The letter of indemnity on which the second defendant relies is dated 23 July 2015 (KPNat [25]). It is expressly governed by Singapore law. 133 Under the letter of indemnity, the plaintiff undertook an obligation to indemnify the second defendant against claims, including legal fees, which she incurs by reason of accepting appointment as a director and shareholder of the third defendant in the course of her employment by Infinitus Law Corporation. Clause 1 of the indemnity provides as follows:81Foot Note 81×Letter from Infinitus Law Corporation dated 30 January 2023 at p 2. In consideration of ILC performing the above acts, Beneficiaries agrees [sic] to … indemnify … ILC, its officers, directors [and] employees … from and against any and all claims … (including reasonable legal fees) … arising out of the above mentioned acts and things. The indemnity defines the plaintiff as one of the “Beneficiaries” who is giving the indemnity in cl 1. 134 The scope of the obligation in cl 1 of the indemnity extends to indemnifying the second defendant against reasonable legal fees “arising out of the above mentioned acts”.82Foot Note 82×Letter from Infinitus Law Corporation dated 30 January 2023 at p 2.The recitals to the indemnity make clear that the acts in question are the second defendant providing services as a shareholder and director of the third defendant in the course of her employment by Infinitus Law Corporation.83Foot Note 83×Letter from Infinitus Law Corporation dated 30 January 2023 at p 2.There is no dispute that the second defendant provided those services. She was not only a director of the third defendant but also its sole subscribing shareholder (KPNat [9] and [21]). There is equally no dispute that she did these acts in the course of her employment by Infinitus Law Corporation (KPNat [8]). It is common ground that she is and was at all material times an employee of Infinitus Law Corporation. 135 I accept also that the plaintiff’s obligation under cl 1 of the indemnity is one which the second defendant can enforce directly against the plaintiff. I say that for three reasons. 136 First, I accept that the second defendant is a party to the indemnity. It is true that the second defendant is not named as a party to the indemnity. The named parties are “ILC”, the plaintiff, the first defendant and Mr Gluck. But the indemnity expressly defines “ILC” not just as Infinitus Law Corporation but as extending to, among others, Infinitus Law Corporation’s employees.84Foot Note 84×Letter from Infinitus Law Corporation dated 30 January 2023 at p 2.The second defendant is an employee of Infinitus Law Corporation. She is therefore within the extended meaning of “ILC”. As such, she is a party to the indemnity. 137 Second, even if I am wrong on my first reason, I accept that cl 1 of the indemnity “purports to confer a benefit on” the second defendant within the meaning of s 2(1)(b) of the Contract (Rights of Third Parties) Act 2001 (2020 Rev Ed) (“C(RTP)A”) (CLAAS Medical Centre Pte Ltd v Ng Boon Ching[2010] 2 SLR 386 at [28]–[30]). Clause 1 obliges the plaintiff to indemnify the second defendant against legal costs she incurs by reason of accepting appointment as a director and shareholder of the third defendant in the course of her employment by Infinitus Law Corporation. That is an undoubted benefit conferred on the second defendant. On this branch of my analysis, I am assuming that the second defendant is not a party to the indemnity and that the plaintiff therefore owes this contractual obligation only to Infinitus Law Corporation and not to the second defendant. But that is the very situation which the C(RTP)A was enacted to address. Further, there is nothing in the indemnity, on its proper construction, which indicates expressly or impliedly that the parties to the indemnity did not intend cl 1 to be enforceable by an employee of Infinitus Law Corporation within the meaning of s 2(2) of the C(RTP)A. The second defendant therefore has a direct right of action against the plaintiff to enforce cl 1 of the indemnity under the C(RTP)A. 138 Finally, if I am wrong on both my first and second reasons, it appears to me that the indemnity is a unilateral contract under which the plaintiff, together with the first defendant and Mr Gluck, undertook to indemnify, amongst others, employees of Infinitus Law Corporation who provide services as a director and shareholder of the third defendant (AlrichDevelopment Pte Ltd v Rafiq Jumabhoy[1995] 2 SLR(R) 340 at [41]). The second defendant is an employee of Infinitus Law Corporation. She undoubtedly provided those services with the indemnity in mind. The plaintiff is thereby bound to the terms of the indemnity directly as against the second defendant. She has a contract with the plaintiff and can therefore enforce it directly against the plaintiff. 139 The plaintiff submits that the indemnity no longer binds him as a contract because the consideration, or a part of the consideration, for the indemnity was the continuing validity of the 2015 Trust Deed. I decided inKPNthat the 2015 Trust Deed was intended to be merely a stop-gap measure and was therefore not evidence of a donative intent which would rebut the presumption of resulting trust over the Shares arising in favour of the first defendant (at [93]–[112]). I also found that although the 2015 Trust Deed was an express statement in writing that the second defendant intended to hold the Shares on trust for the plaintiff, this amounted to an imperfect gift (KPNat [113]–[118]). Thus, the plaintiff submits that there has either been a failure of consideration or that the letter of indemnity is void for common mistake. 140 I do not accept either of the plaintiff’s submissions. A failure of consideration is not a vitiating factor in the law of contract. It is an unjust factor in the law of unjust enrichment (WeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 at [132]). Common mistake, on the other hand, is a vitiating factor in the law of contract (TQ v TRand another appeal[2009] 2 SLR(R) 961 at [97]). Moreover, the common mistake must be sufficiently important or fundamental for it to vitiate a contract (ChweeKin Keong and others v Digilandmall.com Pte Ltd[2005] 1 SLR(R) 502 at [34]). However, I do not accept that there was any common mistake here sufficiently fundamental to render the letter of indemnity void. Even if the validity of the 2015 Trust Deed was a matter of fundamental importance to the parties, the fact remains it was not the subject-matter of the letter of indemnity. The subject matter of the letter of indemnity was the plaintiff’s obligation to indemnify “ILC” for providing services as a shareholder and director of the third defendant. 141 The fact that the plaintiff is described as one of the “Beneficiaries” giving the second defendant the indemnity does not alter my analysis. There is no reference to the 2015 Trust Deed in cl 1 of the letter of indemnity or indeed in any provision of the letter of indemnity which has contractual effect. The only reference to the 2015 Trust Deed is in the background material set out in the recitals. That is not sufficient for me to conclude on any basis available in law that the letter of indemnity no longer binds the plaintiff. 142 For the foregoing reasons, I am satisfied on the balance of probabilities that the plaintiff does owe the second defendant a contractual obligation under the letter of indemnity to indemnify her against the legal costs she incurs in this litigation. (2) The costs of this action are within the scope of the indemnity 143 I also accept that the legal costs which the second defendant has incurred of and incidental to defending this action are within the scope of the letter of indemnity. The plaintiff named the second defendant as a party in this action because it was his case that she was an express trustee for him under and by reason of the 2015 Trust Deed. She executed the 2015 Trust Deed in the course of her employment by Infinitus Law Corporation and as a consequence of her status as the third defendant’s sole subscribing shareholder (KPNat [8]–[9] and [21]). (3) The second defendant is entitled to indemnity costs 144 For the foregoing reasons, I am satisfied that: (a) the letter of indemnity obliges the plaintiff to indemnify the second defendant for losses she suffers within the scope of the indemnity; and (b) that the second defendant’s costs of this action come within its scope. I therefore accept that the letter of indemnity is a factor that I can legitimately take into account in the exercise of my procedural discretion to award costs to the second defendant (Telemedia Pacificat [24]). 145 Taking this factor into account, and as a matter of discretion and not as a matter of law, I am prepared to assess the second defendant’s costs of and incidental to defending this action on the indemnity basis. Neither the second defendant nor the plaintiff has addressed me on whether the effect of enforcing a contractual right to be indemnified for legal costs yields an outcome which is substantially the same as assessing costs as between party and party on the indemnity basis. There is, in fact, a difference between the two (seeeg,AbaniTrading Pte Ltd v BNP Paribas and another appeal[2014] 3 SLR 909 at [93]). I need not discuss that further, as the second defendant and the plaintiff are content to proceed on the basis that these two measures are equivalent. 146 Nevertheless, it must be the case conceptually that an award of the costs of and incidental to litigation is but a subset of the costs recoverable on a contractual indemnity against claims and costs. Having chosen to seek and secure an award for her costs of this action on the indemnity basis rather than to commence a separate action on the indemnity, I consider it appropriate to condition my decision to assess the second defendant’s costs on the indemnity basis on her accepting this award of costs in full and final discharge of the plaintiff’s obligations to her under the letter of indemnity. 147 I therefore hold that the plaintiff is liable to pay the second defendant’s costs on the indemnity basis if, and only if, the second defendant and Infinitus Law Corporation each give a formal undertaking to the court that both the second defendant and Messrs Infinitus Law Corporation will not seek to recover from the plaintiff any further sums in respect of their respective costs of or incidental to this action in contract under the letter of indemnity. The plaintiff can hardly complain about this. It operates to his advantage in that the award of indemnity costs coupled with this undertaking terminates his potential liability under the letter of indemnity for the second defendant’s costs of and incidental to this action. That liability may well go beyond the quantum of an award of costs in my discretion assessed on the indemnity basis (see [145] above).",
        "The third defendant": "153 I now turn to consider the third defendant’s claim for costs against the plaintiff. 154 The third defendant is a nominal party in this litigation in the true sense of the word. The plaintiff has not made any allegations of wrongdoing against the third defendant in any of the iterations of his statement of claim. Although the third defendant did file a defence in this action, its defence accepted expressly that it was a nominal defendant, joined purely for the purpose of being bound by any order the court may make in so far as it concerned the third defendant.88Foot Note 88×3rd Defendant’s Defence (Amendment No. 2) dated 8 October 2021 at para 2.Consistently with this stand, the third defendant confined its defence to admitting or denying only those matters in the plaintiff’s statement of claim which concerned the third defendant. 155 The third defendant now seeks an order that the plaintiff pay to the third defendant its costs of and incidental to this action.89Foot Note 89×Letter from RevLaw LLC dated 30 January 2023 at para 2.The third defendant does not ask for its costs to be assessed on the indemnity basis. 156 In response, the plaintiff submits that the third defendant should not recover any costs at all, precisely because it was only a nominal defendant.90Foot Note 90×PWS at para 4. 157 I reject the plaintiff’s submissions. There is no principle that debars a nominal defendant from recovering its legal costs on that ground alone. The principle remains that a receiving party is entitled to recover a reasonable amount for costs reasonably incurred of and incidental to the action. Even a nominal defendant who makes every effort to avoid incurring legal costs will nevertheless reasonably incur some legal costs. That is inevitable, simply by virtue of being a party on the record, even if only a nominal party. 158 The third defendant has not been found liable for any wrong yet has reasonably had to incur legal costs. The indemnity principle dictates that the third defendant should recover these costs from the substantive parties to the actionie, either the plaintiff or the first defendant. Given that the event in the action is against the plaintiff, it is the plaintiff who has wrongly caused the third defendant to incur these costs by commencing this action. The substantive party who should pay the third defendant’s cost is therefore the plaintiff. 159 The costs which the third defendant claims are the costs which it incurred by having solicitors attend various pre-trial conferences and interlocutory applications.91Foot Note 91×Letter from RevLaw LLC dated 30 January 2023 at paras 2–3.I accept that the third defendant’s attendance at these hearings was reasonable. 160 For these attendances, the second defendant seeks to recover costs of $4,500 from the plaintiff, including disbursements. I accept that the sum of $4,500 is eminently reasonable in amount. 161 The plaintiff is therefore liable to pay costs to the third defendant assessed on the standard basis at $4,500.",
        "Orders for costs": "162 I now set out my formal orders on costs. 163 The plaintiff shall pay to the first defendant the costs of and incidental to this action on the standard basis, such costs fixed as follows: (a) $255,000 for Section 1 costs. (b) $111,288 for disbursements. (c) The additional sum of $60,867 for disbursements against the formal undertaking which the first defendant has already given to the court that, upon recovering this sum of $60,867 from the plaintiff under this order for costs and if the first defendant has not by that time already done one or the other of the following, the first defendant will either pay the $60,867 to Mr Richard Baldock in settlement of his invoice No. SLI/001 dated 13 July 2022 issued to the third defendant or pay $60,867 to the third defendant for having paid Mr Richard Baldock’s invoice, whichever may be applicable. (d) The additional sum of $3,295 for disbursements against the formal undertaking which the first defendant has already given to the court that, upon recovering this sum of $3,295 from the plaintiff under this order for costs and if the first defendant has not by that time already done one or the other of the following, the first defendant will either pay $3,295 to Feldan Travel Ltd or reimburse MG Sugars Lanka (Private) Limited for having paid $3,295 to Feldan Travel Ltd, whichever may be applicable. (e) The additional sum of $9,944 for disbursements against the formal undertaking which the first defendant has already given to the court that, upon recovering this sum of $9,944 from the plaintiff under this order for costs and if the first defendant has not by that time already done one or the other of the following, the first defendant will either pay $9,944 to TravelDesk or reimburse MG Sugars Lanka (Private) Limited for having paid $9,944 to TravelDesk, whichever may be applicable. 164 The plaintiff shall pay to the second defendant her costs of and incidental to this action, such costs fixed at $80,000 including disbursements; against which the first defendant shall give the plaintiff credit for the sum of $38,010, thereby leaving the plaintiff’s net liability to the second defendant for costs under this order at $41,990. This is subject to the second defendant and Infinitus Law Corporation each giving a formal undertaking to the court that both the second defendant and Messrs Infinitus Law Corporation will not seek to recover any further sums from the plaintiff in respect of their respective costs of or incidental to this action in contract under the letter of indemnity. 165 The plaintiff shall pay to the third defendant its costs of and incidental to this action assessed on the standard basis, such costs fixed at $4,500 including disbursements. 166 This is not part of my order on costs but is intended to govern the first defendant’s undertakings (see [163(c)]–[163(e)] above). The plaintiff and the first defendant shall be at liberty to vary the undertakings or to discharge the first defendant entirely from the undertakings by consent in writing, without need for further application to the court or further order of the court. And to the extent that the plaintiff makes any part payments of the costs awarded to the first defendant under this order, it shall be in the absolute discretion of the first defendant to appropriate the part payments to interest, Section 1 costs or disbursements, and as between the various disbursements, as the first defendant considers fit.",
        "Conclusion": "167 These orders for costs cover all of the costs of this action as against each defendant in so far as those costs have not been the subject of any separate costs order for costs to be paid forthwith. These costs orders therefore incorporate and subsume all orders that may have been made in this action for costs to be in the cause, for costs to be one or other party’s costs in the cause or for costs to be reserved. These costs orders also incorporate and subsume the costs that the parties have incurred in securing the orders for the costs of this action which I have set out at [163]–[165] above. 168 All of these orders for costs shall carry interest in the usual way from the date that this judgment bears. 169 This action is now concluded in all respects.     Vinodh Coomaraswamy Judge of the High Court   Ramesh Kumar s/o Ramasamy, Afzal Ali and Edmond Lim (Allen & Gledhill LLP) for the plaintiff; Koh Swee Yen SC, Lin Chunlong and Chiam Yunxin (WongPartnership LLP) for the first defendant; Leo Cheng Suan and Lee Shu Xian (Infinitus Law Corporation) for the second defendant; Chua Sui Tong and Gan Jhia Huei (Rev Law LLC) for the third defendant."
    }
}