{
    "case_title": "Indian Overseas Bank vSeabulk Inc (formerly known as Seabulk Systems Inc) and others",
    "ncitation": "[2023] SGHC 42",
    "coram": "Philip Jeyaretnam J",
    "sections": {
        "Introduction": "1 The discretion to adjourn an application to set aside the registration of a foreign judgment should be exercised with due regard to the interests of both the judgment creditor and the judgment debtor in the circumstances of the individual case.",
        "Facts": "",
        "The parties": "2 Indian Overseas Bank (“IOB”), the applicant in Originating Summons 1054 of 2019 (“OS 1054”), is a bank incorporated under the laws of the Republic of India. IOB operates branches in the Hong Kong Special Administrative Region (“Hong Kong”) and Singapore. 3  Seabulk Inc. (“Seabulk”), the first respondent in OS 1054, is a Canadian company incorporated in Vancouver, British Columbia. Seabulk is engaged in the manufacturing of port machinery and equipment. Mr Ramesh Vangal (“Mr Vangal”) and Mr Sidney Sridhar (“Mr Sridhar”), the second and third respondents in OS 1054 respectively, were directors of Seabulk at all material times.1Foot Note 1×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [7].Mr Vangal is a Singaporean citizen. Seabulk and Mr Sridhar did not take part in these proceedings.",
        "Brief background and procedural history": "4 In 2007, IOB advanced several credit facilities to Seabulk. As required under the terms of the facilities, Mr Vangal and Mr Sridhar also provided personal guarantees in favour of IOB.2Foot Note 2×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [17].In 2012, IOB commenced an action in the Hong Kong Court of First Instance against Seabulk, Mr Vangal, and Mr Sridhar, under the facilities and personal guarantees respectively (“HCA 846/2012”).3Foot Note 3×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [42].On 29 January 2018, the Hong Kong Court of First Instance entered judgment in favour of IOB (the “HK Judgment”).4Foot Note 4×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [50].The respondents were held to be jointly and severally liable for the sum of CAD$9,665,484.94 and US$137,899.18, with interest.5Foot Note 5×1st Affidavit of Palaniappan Ramanathan dated 20 August 2019 at [17]. 5 On 26 February 2018, the respondents appealed to the Hong Kong Court of Appeal against the decision in HCA 846/2012 (“CACV 48/2018”).6Foot Note 6×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [51].Subsequently, as Seabulk and Mr Sridhar decided against pursuing the appeal,7Foot Note 7×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [54].Mr Vangal instructed his solicitors to take over conduct of CACV 48/2018 on 11 February 2019.8Foot Note 8×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [63]. 6  On 20 August 2019, IOB commenced OS 1054, anexparteapplication to register the HK Judgment under the Reciprocal Enforcement of Foreign Judgments Act (Cap 265, 2001 Rev Ed) (the “REFJA”). On 21 August 2019, the HK Judgment was registered by order HC/ORC 5731/2019 (“ORC 5731”) and a Notice of Registration was issued on 18 May 2021. IOB attempted to serve the Notice of Registration on Mr Vangal sometime in late April or early May 2021.9Foot Note 9×3rd Affidavit of Palaniappan Ramanathan dated 29 June 2021 (filed 30 June 2021) at [23]. 7 On 18 May 2021, Mr Vangal filed an application to stay the execution of the HK Judgment in the Hong Kong Court of First Instance (the “First HK Stay Application”).10Foot Note 10×1st Affidavit of Ramesh Vangal dated 9 June 2021 (filed 11 June 2021) at [104]. SUM 2662 8 On 8 June 2021, Mr Vangal commenced HC/SUM 2662/2021 (“SUM 2662”), an application to set aside ORC 5731. In brief, Mr Vangal pursued three main grounds in support of the setting aside application. 9 First, Mr Vangal contended that IOB had failed to comply with O 67 r 3(4) of the Rules of Court (2014 Rev Ed) (the “ROC 2014”). Under O 67 r 3(4) ROC 2014, an applicant seeking to register a foreign judgment under REFJA is required to provide evidence of the enforceability by execution of the foreign judgment in its country of origin alongside the affidavit supporting the application. IOB had failed to file evidence of the enforceability by execution of the HK Judgment in Hong Kongat the timeORC 5731 was obtained,11Foot Note 11×2nd Respondent’s written submissions dated 6 May 2022 (HC/SUM 2662/2021) at [19].and expert evidence was filed only on 30 June 2021 after SUM 2662 had been commenced.12Foot Note 12×1st Affidavit of Fung Chi Man dated 29 June 2021 (filed 30 June 2021).Even though it subsequently transpired that experts for both IOB and Mr Vangal agreed that the HK Judgment was in fact enforceable in Hong Kong at the time ORC 5731 was obtained,13Foot Note 13×1st Affidavit of Fung Chi Man dated 29 June 2021 (filed 30 June 2021) at [25]-[28]; 1st Affidavit of Tang Min Fay dated 7 March 2022 at 223-224.Mr Vangal took the position that the non-compliance with O 67 r 3(4) ROC 2014 was an incurable defect. 10 Second, Mr Vangal contended that IOB had breached its duty to make full and frank disclosure. IOB did not disclose that it had unsuccessfully sought to enforce the HK Judgment in Singapore by way of serving a statutory demand on 28 September 2018,14Foot Note 14×Applicant’s written submissions dated 6 May 2022 (HC/SUM 2662/2021) at [6].prior to OS 1054. Mr Vangal had succeeded in setting aside the statutory demand because IOB had failed to first register the HK Judgment under REFJA.15Foot Note 15×2nd Respondent’s written submissions dated 6 May 2022 (HC/SUM 2662/2021) at [31]-[34]. The setting aside application was HC/OSB 109/2019. 11 Third, Mr Vangal contended that pursuant to s 6(1) REFJA, ORC 5731 should be set aside or stayed on the basis that there were appeals pending in Hong Kong, namely CACV 48/2018 and the First HK Stay Application. Alternatively, Mr Vangal submitted that SUM 2662 should be adjourned and ORC 5731 stayed pending the determination of CACV 48/2018.16Foot Note 16×2nd Respondent’s written submissions dated 6 May 2022 (HC/SUM 2662/2021) at [43]-[44], [54] and [82].Where an “appeal” is pending against a registered judgment, s 6(1) REFJA gives the registering court the discretion to set aside the registration or to adjourn the setting aside application until the disposal of the “appeal”, subject to such terms the registering court thinks just (Malaysian TrusteesBhd v Tan Hock Keng[2021] SGHC 162 at [19]). Under s 2(1) REFJA, an “appeal” is defined as including applications for a stay of enforcement. 12  On 31 May 2022, the learned Assistant Registrar declined to set aside ORC 5731. The learned Assistant Registrar held that the technical non-compliance with O 67 r 3(4) ROC 2014 was a defect that could be and had been cured as evidence was subsequently filed. Furthermore, none of the facts raised by Mr Vangal were material as they did not impugn the validity of the HK Judgment and instead demonstrated exactly why OS 1054 was necessary. However, the learned Assistant Registrar adjourned SUM 2662 and stayed the execution of ORC 5731 until after the determination of CACV 48/2018 pursuant to the discretion under s 6(1)(b) REFJA.17Foot Note 17×HC/ORC 2864/2022. 13 On 29 July 2022, I heard IOB’s appeal.18Foot Note 18×HC/RA 192/2022.I allowed the appeal to the limited extent of varying the period of the adjournment and stay of execution until after the disposal of the First HK Stay Application, rather than until the determination of CACV 48/2018. If the First HK Stay Application was allowed, I ordered that the adjournment and stay of execution would be extended until after the determination of CACV 48/2018. If the First HK Stay Application was not allowed, I ordered that SUM 2662 would proceed for hearing. I declined to grant Mr Vangal’s request that the adjournment and stay of execution should extend until the disposal of any appeal arising from the First HK Stay Application but granted Mr Vangal liberty to make a fresh application to adjourn SUM 2662 and stay ORC 5731 should the First HK Stay Application be dismissed.19Foot Note 19×HC/ORC 4116/2022. SUM 4456 14 On 8 November 2022, the Hong Kong High Court dismissed the First HK Stay Application,20Foot Note 20×6th Affidavit of Ramesh Vangal dated 15 December 2022 (filed 16 December 2022) at [4].some 18 months after it was first filed on 18 May 2021. Mr Vangal then notified the court that he intended to appeal against this dismissal. Accordingly, on 5 December 2022, Mr Vangal filed a renewed application to stay the execution of the HK Judgment in the Hong Kong Court of Appeal (the “Second HK Stay Application”).21Foot Note 21×6th Affidavit of Ramesh Vangal dated 15 December 2022 (filed 16 December 2022) at [5].On 16 December 2022, Mr Vangal commenced HC/SUM 4456/2022 (“SUM 4456”), a fresh application based on the Second HK Stay Application for an adjournment of SUM 2662 and stay of ORC 5731. 15 On 16 January 2023, I heard and dismissed both SUM 4456 and SUM 2662. As Mr Vangal has appealed, I now give my grounds of decision.",
        "The parties’ cases": "",
        "Respondent’s case": "16  Mr Vangal relied on largely the same grounds in both SUM 4456 and SUM 2662, with slight modifications. In SUM 4456, Mr Vangal invited me to exercise my discretion under s 6(1)(b) REFJA to grant a further adjournment of SUM 2662 and corresponding stay of ORC 5731, on account of the pending Second HK Stay Application. After I dismissed SUM 4456, Mr Vangal reiterated the grounds for setting aside previously raised before the learned Assistant Registrar in SUM 2662. 17 First, Mr Vangal accepted that IOB’s technical non-compliance with O 67 r 3(4) ROC 2014 wouldnotbe fatal to an application to register a foreign judgment under REFJA. Instead, he submitted that IOB’s non-compliance should be regarded as evidence that IOB’s “desire to register was fleeting and perfunctory”. According to him, this meant that ORC 5731 should not have been granted and this therefore supported the application for adjournment in SUM 4456.22Foot Note 22×2nd Respondent’s written submissions dated 10 January 2023 (HC/SUM 4456/2022) at [16]-[17]. 18 Second, Mr Vangal submitted that IOB breached its duty to make full and frank disclosure. Mr Vangal essentially relied upon but recast the same facts that were held to be immaterial by the learned Assistant Registrar. He submitted that IOB did not simply fail to disclose its prior attempt to pursue bankruptcy proceedings by serving a statutory demand, but instead concealed this fact. Furthermore, contrary to IOB’s assertions of urgency, IOB had in fact been dilatory in seeking registration of the HK Judgment. Recast in this way, Mr Vangal suggested that IOB had acted oppressively and in bad faith or had at least been economical with the truth, factors which he submitted pointed in favour of granting the application for adjournment in SUM 4456.23Foot Note 23×2nd Respondent’s written submissions dated 10 January 2023 (HC/SUM 4456/2022) at [25]-[27]. 19 Third, Mr Vangal submitted that to determine whether the discretion under s 6(1) REFJA should be exercised, the court should consider whether the appeal against the foreign judgment isbona fideand whether the appeal is being prosecuted with reasonable diligence. He submitted that the requisite threshold should be low, such that absent bad faith or evidence that the appeal is bound to fail, the court should adjourn a setting aside application for an appropriate time.24Foot Note 24×2nd Respondent’s written submissions dated 10 January 2023 (HC/SUM 4456/2022) at [36]-[49].Mr Vangal averred that he was prosecuting CACV 48/2018 diligently and in good faith, and instead alleged that IOB had been delaying proceedings and the preparation of the appeal bundles in CACV 48/2018.25Foot Note 25×2nd Respondent’s written submissions dated 10 January 2023 (HC/SUM 4456/2022) at [51]-[52]; 7th Affidavit of Ramesh Vangal dated 4 January 2023 at [19]-[25].Mr Vangal thus submitted that SUM 2662 should be adjourned and ORC 5731 stayed until after the determination of CACV 48/2018 or until after the disposal of the Second HK Stay Application.26Foot Note 26×2nd Respondent’s written submissions dated 10 January 2023 (HC/SUM 4456/2022) at [68]. 20 Additionally, in support of SUM 2662, counsel for Mr Vangal briefly submitted at the oral hearing that allowing the registration of the HK Judgment whilst the Second HK Stay Application remained pending would be contrary to international comity. In his view, inconsistency could potentially arise if the Second HK Stay Application was granted.",
        "Applicant’s case": "21 IOB submitted that there was no basis for SUM 4456, given that the grounds that were relied upon by Mr Vangal in SUM 4456 had already been canvassed when the order for the adjournment and stay was first granted and once more when it was varied on appeal.27Foot Note 27×Applicant’s written submissions dated 10 January 2023 at [26]-[27].Accordingly, it had already been determined that any non-compliance with O 67 r 3(4) ROC 2014 had been cured and the facts raised by Mr Vangal were immaterial. Consequently, SUM 2662 should also be dismissed as there was no basis to set aside ORC 5731. 22 Additionally, IOB denied Mr Vangal’s allegations (set out above at [19]) and averred that delaying CACV 48/2018 would instead be contrary to their own interests, as the expeditious determination of CACV 48/2018 would bring about long-awaited finality to the HK Judgment obtained by IOB.28Foot Note 28×5th Affidavit of Palaniappan Ramanathan dated 29 December 2022 at [32]-[34].Given that it remained undisputed that the HK Judgment was enforceable and as the First HK Stay Application had already been dismissed, IOB submitted that enforcement should not be subjected to further delay. IOB averred that it would take upwards of six months for the Second HK Stay Application to be determined.29Foot Note 29×5th Affidavit of Palaniappan Ramanathan dated 29 December 2022 at [40].On the other hand, Mr Vangal’s evidence was that it was unknown when the Second HK Stay Application would be heard.30Foot Note 30×6th Affidavit of Ramesh Vangal dated 15 December 2022 (filed 16 December 2022) at [17].At the hearing, counsel for Mr Vangal accepted that the Second HK Stay Application would take several months, but submitted that it was not immutable that six months would be required. IOB further emphasised that, being a bank with a presence in Hong Kong, no difficulty in repaying Mr Vangal would arise even if CACV 48/2018 was eventually allowed. For his part, Mr Vangal had not offered any security for the HK Judgment either in Hong Kong or in Singapore.31Foot Note 31×Applicant’s written submissions dated 10 January 2023 at [35]-[36] and [45]-[48].",
        "Issues to be determined": "23 Accordingly, two issues arose for my determination: (a) How the discretion under s 6(1) REFJA should be exercised and whether a further adjournment of SUM 2662 and stay of execution of ORC 5731 should be granted; and(b) Whether there were any grounds to set aside ORC 5731.",
        "Issue 1: Discretion under s 6(1) REFJA": "24 Where an appeal is pending in the foreign court, the registering court “if it thinks fit, may, on such terms as it may think just” either set aside the registration or adjourn the application to set aside until the appeal is disposed of (s 6(1) REFJA). 25 In exercising this discretion, the court must have regard to the interests of the judgment creditor in the fruits of their success, as well as the interests of the judgment debtor that the appeal not be rendered nugatory. In view of this, a number of non-exhaustive factors fall to be considered. First, the court should be satisfied, in relation to the appeal, that it is abona fideone that is or will be prosecuted with due diligence. Second, the court should consider any offer by the judgment debtor to provide security for the appeal, as a term of any adjournment sought. Third, the court should consider how readily the judgment debtor will be able to recover the judgment sums paidifthe judgment is enforced and the appeal then subsequently allowed. 26 In this case, Mr Vangal made no offer of security. On the other hand, he would in all likelihood have no difficulty in recovering any judgment sums paid in the event of a successful appeal because IOB is a bank with a presence in Hong Kong. 27 Further, I was mindful that CACV 48/2018 had been outstanding for almost five years, and that Mr Vangal’s First HK Stay Application, pending the outcome of which I had originally allowed adjournment, had been dismissed. Mr Vangal’s Second HK Stay Application may not be heard for quite some time, and his counsel was unable to assure me of any time frame within which it would be dealt with (as above at [22]). 28 In light of the above factors, I declined to exercise my discretion to adjourn the matter further.",
        "Issue 2: Setting aside ORC 5731": "29 I turn now to the other grounds raised for setting aside ORC 5731. I should observe that I do so notwithstanding that the first and second of these grounds failed before the learned Assistant Registrar when he heard the matter on 31 May 2022, and I had not accepted them when I decided IOB’s appeal on 29 July 2022. Nonetheless, I considered their merits again, and rejected them. My reasons follow.",
        "Non-compliance with O 67 r 3(4) ROC 2014": "30 As ultimately accepted by counsel for Mr Vangal, the non-compliance with O 67 r 3(4) ROC 2014 was curable. Indeed, his own expert agreed that the HK Judgment was enforceable by execution. This was what the learned Assistant Registrar found in rejecting this objection. In these circumstances, I agreed that the objection must be rejected.",
        "Non-disclosure of failed bankruptcy proceedings": "31 On this point, I agreed with the analysis of the learned Assistant Registrar, whose reasoning was as follows: I was unable to agree with [Mr Vangal] that there was material non-disclosure which justified setting aside the registration. In short, [Mr Vangal] points to various alleged non-disclosures but none of them in my view amount to undisclosed material facts for the purposes of the ex-parte application for registration. Relying on para 87 ofThe“Vasily Golovnin”,the thrust of [Mr Vangal’s] contention is that [IOB] should have disclosed facts relating to the previous unsuccessful attempt to enforce the Hong Kong Judgment by way of serving a statutory demand and to OSB 109/2019 where the statutory demand was set aside. But in my view, this “unsuccessful prior proceeding” is far removed from the situation inThe“Vasily Golovnin”where in the context of a ship arrest hearing in Singapore, the applicant failed to disclose information pertaining to a contested ship arrest hearing in another jurisdiction which resulted in the ship actually being released from arrest. The crux there was that in considering the application for ship arrest in Singapore, the court’s attention should have been drawn to the fact that another court in another jurisdiction had already determined there was no right of arrest for the ship under the same or similar claims. Whether or not the “unsuccessful prior proceeding” was a material fact which warranted disclosure depends on the degree to which it dealt with substantially the same issue(s) before the court in the present proceedings. By comparison, the outcome in OSB 109 did not impugn upon the validity of the underlying Hong Kong Judgment nor was it the case that the court in OSB 109 had determined that the Hong Kong Judgment could not be registered. To the contrary, the court in OSB 109 had alluded to the point that registration of the Hong Kong Judgment was a necessary prior step. This was then the step that [IOB] eventually took via the registration application. 32 Accordingly, I rejected this point.",
        "Comity": "33 Finally, comity was raised. It was said that respect to the Hong Kong Court of Appeal required an adjournment pending disposal of CACV 48/2018 or at least of the Second HK Stay Application. In my view, however, given the dismissal of the First HK Stay Application, it may be said to the contrary that comity weighed in favour of registration. Even if the appeal succeeds, Mr Vangal will in all likelihood have no difficulty recovering any judgment sums paid (as noted above at [26]).",
        "Conclusion": "34 For these reasons, I dismissed both SUM 4456 and SUM 2662. Philip JeyaretnamJudge of the High Court Chan Cong Yen, Lionel (Chen Congren) and Caleb Tan Jia Chween (Oon & Bazul LLP) for the applicant; Liew Teck Huat and Phang Cunkuang (Niru & Co LLC) for the second respondent; The first and third respondents absent and unrepresented.",
        "": ""
    }
}