{
    "case_title": "Chia June Theo Grace (alias Xie Yunzhen) Mrs Grace Doney and others vSelvakumar Ranjan and another",
    "ncitation": "[2023] SGHC 117",
    "coram": "S Mohan J",
    "sections": {
        "Introduction": "1 The case before me arises out of an unfortunate and tragic road traffic accident between a truck and a cyclist along Nicoll Drive. Four days after the accident, the cyclist succumbed to his injuries and lost his life. 2 His widow and children have now brought a dependency claim against the driver of the truck and his employer. 3 As the trial was bifurcated, only issues of liability arise for my determination. The defendants, quite sensibly, do not contest that the driver was negligent and that his employer is vicariously liable for his negligent conduct. However, they contend that they are not solely to blame for the accident occurring and assert that the deceased cyclist was contributorily negligent. This was the main issue at the trial.",
        "Facts": "4 The victim, Mr Mark Anthony Kirk Doney (“Mr Doney”) was a 55-year old Australian citizen who lived in Singapore with his wife and three children,ie, the plaintiffs in this action. He ran his own business and was the sole breadwinner of the family.1Foot Note 1×AEIC of Grace Chia dated 20 June 2022 at paras 20, 30 (BA at pp 6, 8).Mr Doney was an avid cyclist and had experience cycling both on-road and off-road. His favourite hobby was to go cycling in the early morning on weekends.2Foot Note 2×AEIC of Grace Chia dated 20 June 2022 at paras 18, 22 (BA at pp 5, 6). 5 On Sunday, 10 November 2019, just before 7.00am, Mr Doney embarked on his regular weekend cycle,3Foot Note 3×AEIC of Grace Chia dated 20 June 2022 at para 25 (BA at p 7).setting off from his home in Loyang on a route which took him along the eastbound carriageway of Nicoll Drive. Nicoll Drive is a dual carriageway road with two lanes on either side. The weather that morning was clear, and the traffic along Nicoll Drive was light.4Foot Note 4×AEIC of Christopher Howard Bloch dated 2 March 2022 at para 4 (BA at p 47); AEIC of Selvakumar Ranjan dated 2 March 2022 at para 10 (BA at p 69).The eastbound carriageway forms the landward border of Changi Beach Park, and Mr Doney would have cycled past the entrance and exit points of several car parks on his left, up until the exit of Changi Beach Car Park No. 4 (“Car Park 4”), where the accident occurred. Figure 1 below is a bird’s eye view of the area taken from Google Maps.   Figure 1 6 Parked in Car Park 4 that morning was a truck belonging to the second defendant, NTT Transport Pte Ltd. The truck was driven by the first defendant, Mr Selvakumar Ranjan. He was employed by the second defendant as a truck driver, tasked to transport goods for clients who engaged the second defendant’s services.5Foot Note 5×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 4 (BA at p 68).At around 7.37am, the first defendant proceeded to drive out of Car Park 4 to return the truck to the second defendant’s premises. His intention was to make a right turn at the exit of Car Park 4, which would mean having to cross the eastbound carriageway of Nicoll Drive, in order to turn into and join the westbound carriageway of Nicoll Drive towards Changi Village. 7 The subsequent events were captured partially in video footage recorded from a forward-facing dashboard camera fitted inside the truck on its front windscreen (the “dashcam footage”). The video footage shows the truck appearing to cross the stop line at the exit ramp of Car Park 4 – without stopping – before proceeding to cross the eastbound carriageway of Nicoll Drive. The truck then slows down significantly to allow a motorcycle to pass in front of the truck from right to left at a close distance, but again the truck does not stop. Once the motorcycle passes, the truck accelerates, and about 2 to 2.5 seconds later a loud crash can be heard in the video. The voice of a man shouting for the truck to stop can be heard shortly after, before the first defendant stops the truck at a centre median (made up of painted chevrons) in the middle of Nicoll Drive close to the exit of Car Park 4. 8 The accident was witnessed by two cyclists who testified as eyewitnesses at the trial – Mr Christopher Howard Bloch (“Mr Bloch”) and Mr Roger James Allingham (“Mr Allingham”). Mr Bloch and Mr Allingham are both lawyers. They were cycling together along Nicoll Drive and were about 40–50m behind Mr Doney, whom they did not know.6Foot Note 6×AEIC of Christopher Howard Bloch dated 2 March 2022 at paras 5–6 (BA at p 47).As soon as the collision occurred, they rushed over to help Mr Doney, and shouted at the first defendant to stop the vehicle – it is one of their voices that can be heard in the dashcam footage (see [7]). Mr Bloch removed Mr Doney’s bicycle, which was on top of Mr Doney, and stabilised his neck. Mr Doney was unable to speak and lost consciousness soon after. Mr Allingham called for an ambulance.7Foot Note 7×AEIC of Christopher Howard Bloch dated 2 March 2022 at paras 10–12 (BA at pp 48–49). 9 Mr Doney was taken by ambulance to Changi General Hospital. However, as his prognosis remained negative after four days in the intensive care unit, the decision was made to turn off his life support. Mr Doney passed away at 4.34pm on 14 November 2019.8Foot Note 8×AEIC of Grace Chia dated 20 June 2022 at paras 27–28, Exhibit GD-1 at pp 20, 25 (BA at pp 7–8, 20, 25).His certified cause of death was cervical spine and brainstem injuries.9Foot Note 9×AEIC of Grace Chia dated 20 June 2022, Exhibit GD-1 at p 23 (BA at p 23). 10 The first defendant subsequently pleaded guilty to one charge of driving a motor vehicle without reasonable consideration for other persons using the road under s 65(1)(b) of the Road Traffic Act (Cap 276, 2004 Rev Ed). He was sentenced to nine months’ imprisonment and banned from driving for eight years. After completing his imprisonment term, the first defendant was deported to India.10Foot Note 10×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 21, Exhibit SR-1 at pp 41–43 (BA at pp 106–108). 11 Besides the eyewitness testimony of Mr Bloch and Mr Allingham, the first defendant also gave evidence on the defendants’ behalf. Aside from the eyewitness testimony, the dashcam footage was the key piece of evidence. Both parties called accident reconstruction specialists to testify as expert witnesses in the trial, namely Dr Yu Yonghe from Universal Technology Centre for the plaintiffs and Mr Neil Lawrence Mackay from Envista Forensics Pte Ltd for the defendants. In this judgment, I will refer to Dr Yu and Mr Mackay as the plaintiffs’ expert and defendants’ expert respectively. As will become clear in my analysis of the evidence below, the experts clashed on a great many issues, including on the proper analysis of the dashcam footage.",
        "The parties’ cases": "12 The plaintiffs contend that the first defendant failed to keep a proper lookout and to give way to oncoming traffic on Nicoll Drive. In doing so, he breached his duty of care owed to Mr Doney as a fellow road user. They argue that the second defendant, as the employer of the first defendant, is vicariously liable for the first defendant’s negligent driving.11Foot Note 11×Plaintiffs’ Written Submissions (“PWS”) at para 13. 13 On the issue of contributory negligence, the plaintiffs’ case is that there was no contributory negligence on the part of Mr Doney. Mr Doney had taken all reasonable measures to ensure his own safety, including wearing a helmet, keeping to the left lane of the road, and riding at a normal speed.12Foot Note 12×PWS at para 20.They contend that Mr Doney kept a proper lookout, but by the time the defendants’ truck crossed his path and became an actual hazard requiring evasive action on his part, it was too late to avoid the collision. Consequently, the plaintiffs argue that the defendants should be held 100% liable for the plaintiffs’ loss.13Foot Note 13×PWS at para 17. 14 The defendants do not contest that the first defendant was negligent and that the second defendant is vicariously liable for the first defendant’s negligence.14Foot Note 14×Defendants’ Closing Submissions (“DCS”) at paras 2–6, 92.Instead, their main (indeed, only) contention is that Mr Doney was contributorily negligent. Their case, driven to a large extent by the opinion of their expert, is that the truck became an actual hazard the moment it crossed the stop line at the exit of Car Park 4.15Foot Note 15×DCS at para 45.They argue on this basis that Mr Doney would have had enough time to recognise the truck as an actual hazard and react by applying his brakes. This would have allowed him to stop in time, even after accounting for the time required to come to a complete stop after applying the brakes. As things turned out, Mr Doney did not react in time. Several explanations have been offered for this, either by the defendants or their expert,vizhe was looking down at the road instead of ahead and not keeping a proper lookout,16Foot Note 16×DCS at paras 74–78.or was distracted by a deflated rear tyre,17Foot Note 17×Expert Report of Neil Lawrence Mackay paras 16–22 (BA at pp 196–197).or was affected by sunstrike (ie, his vision being adversely affected due to the sun in his eyes as a result of the angle of the sun at the material time).18Foot Note 18×DCS at para 79; Expert Report of Neil Lawrence Mackay at paras 37–50 (BA at pp 206–210).On this basis, the defendants argue for liability to be apportioned 70/30 in favour of the plaintiffs,ie, for the defendants to bear 70% of the blame and Mr Doney 30%.19Foot Note 19×DCS at para 101.",
        "Issue to be determined": "15 While the sole issue that arises for my determination is whether Mr Doney was contributorily negligent, and if so, to what extent, I nevertheless briefly comment first on the negligence of the first defendant.",
        "Preliminary point – the reliability of the first defendant’s evidence": "16 I will first make a general point about the reliability, or lack thereof, of the first defendant’s evidence. The first defendant tendered an affidavit of evidence-in-chief (“AEIC”) in support of the defendants’ case. Given his direct involvement in the accident, his evidence would have been particularly material. However, the first defendant’s AEIC was replete with holes, contradictions and implausible assertions, especially in light of the objective evidence and the first defendant’s own oral evidence at the trial, with the result that very little (if any) reliance can be placed on it. I set out the material contradictions below. 17 First, the first defendant asserted at para 11 of his AEIC that he had switched on his right indicator before exiting Car Park 4.20Foot Note 20×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 11 (BA at p 70).However, from the dashcam footage, no flashing indicator signal can be heard when the truck is turning. This is in contrast to a point later in the footage when the first defendant stopped the truck shortly after the collision. At that point, the first defendant appears to turn on the truck’s hazard light signals, which can be heard clearly. The defendants’ expert has also confirmed that the dashcam footage does not support the first defendant’s assertion.21Foot Note 21×Expert Report of Neil Lawrence Mackay at para 23 (BA at p 198). 18 Second, at para 13 of his AEIC, the first defendant asserted that at the stop line, he saw Mr Doney on his bicycle near the exit of Changi Beach Car Park No. 3 (“Car Park 3”) (which he estimated to be about 200m away), and that Mr Doney was cycling on the lane divider line between the left and right lanes of the eastbound carriageway of the road.22Foot Note 22×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 13 (BA at p 70).However, given the distance between Car Park 3 and Car Park 4, and the bend in Nicoll Drive between the two, it is physically impossible that the first defendant would have seen Mr Doney from that distance. This is clear enough from Figure 2 below (exhibited in the plaintiffs’ expert’s report) which shows the topography of Nicoll Drive:23Foot Note 23×Expert Report of Yu Yonghe at pp 9, 48 (BA at pp 125, 164).  Figure 2 The defendants’ expert, analysing the impact location of the truck and the position of Mr Doney, also concurred that Mr Doney was not cycling along the lane divider line.24Foot Note 24×Expert Report of Neil Lawrence Mackay at para 64 (BA at p 211).The defendants’ expert’s calculations also show that the first defendant’s estimate of 200m is completely off – for Mr Doney to have traversed 200m in the time it took for the truck to travel from the stop line to the impact location, Mr Doney would have had to be travelling at almost 130km/h – an impossible speed for any cyclist to achieve.25Foot Note 25×Expert Report of Neil Lawrence Mackay at paras 57–58 (BA at p 211). 19 In fact, when the first defendant was asked in cross-examination to estimate how far away Mr Doney was when he first saw him, the first defendant estimated the distance to be that between his position in the witness box and the glass panel of the public gallery in the courtroom – a distance of only about 10m.26Foot Note 26×NE (19 Oct 2022) at p 49, lines 25–29, p 51, lines 1–4; NE (21 Oct 2022) at p 89, line 20 – p 90, line 2. 20 Third, at para 15 of his AEIC, the first defendant stated that hestoppedat the stop line before making the right turn.27Foot Note 27×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 15 (BA at p 71).The dashcam footage shows that this assertion is false – he never stopped at the line.  The defendants’ expert also confirms that the first defendant did not stop at the stop line, or at any time until shortly after the accident had already occurred.28Foot Note 28×Expert Report of Neil Lawrence Mackay at paras 54, 70 (BA at pp 211, 212). 21 Fourth, at para 16 of his AEIC, the first defendant said that he moved off from the stop line, but slowed to a stop asecond timeto allow a motorcyclist to pass in front of him.29Foot Note 29×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 16 (BA at p 71).Based on the dashcam footage, it is clear that this assertion is also false; the first defendant did slow down, but did not stop. As I mentioned above, henever stoppeduntil seconds after the collision. 22 Fifth, at para 17 of his AEIC, the first defendant asserted that after the motorcyclist had passed in front of him, he saw Mr Doney coming towards him and sounded two short blasts of the horn to alert Mr Doney.30Foot Note 30×AEIC of Selvakumar Ranjan dated 2 March 2022 at para 17 (BA at p 71).This is also not true, as confirmed by the defendants’ expert.31Foot Note 31×Expert Report of Neil Lawrence Mackay at para 23 (BA at p 198).The dashcam footage confirms that the first defendant did not sound his horn at all. 23 Given the numerous contradictions on material aspects of the evidence in the first defendant’s AEIC, and the fact that several of the assertions stated therein are demonstrably false, I have given very little weight to the first defendant’s evidence.",
        "Are the defendants liable for negligence?": "24 As mentioned above, the defendants do not contest that they are liable for negligence (see [14] above). Accordingly, I deal with this point swiftly as I feel that something nevertheless needs to be said about the deplorable standard of care displayed by the first defendant on the day in question, which in turn cost Mr Doney his life. The first defendant’s conduct was clearly and inexorably negligent. The undisputable facts are as follows. Firstly, the defendants admit that Mr Doney had the right of way over the first defendant.32Foot Note 32×DCS at para 5.Mr Doney was cycling along the eastbound carriageway of Nicoll Drive in the left lane, whereas the first defendant was making a right turn out of Car Park 4 – across Mr Doney’s path – to join the westbound carriageway. To put matters beyond all doubt, there was a stop sign and stop line at the exit of Car Park 4.33Foot Note 33×Expert Report of Yu Yonghe at p 10 (BA at p 126). 25 Secondly, the first defendant failed to give way to oncoming traffic and failed to maintain a proper lookout. The first defendant’s initial evidence was that he first saw Mr Doney when the latter was about 200m away, between Changi Beach Car Park 3 and Car Park 4. As I mentioned above at [18], this account was incredible.  Given the angle of the road bend, at a distance of 200m, Mr Doney would have been out of the first defendant’s line of sight. In my view, this shows that the first defendant was not paying any proper attention to traffic approaching from the right at all. It is likely that he was instead focusing on any traffic approaching from his left on the westbound carriageway of Nicoll Drive, which he was intending to join after crossing the eastbound carriageway. His poor lookout and situational awareness are clear from the dashcam footage – the first defendant did not stop at the stop line at the Car Park 4 exit, and engaged the brakes to slow the truck down significantly in order to allow the motorcyclist to pass in front of him. 26 Further to this point, the first defendant’s view from the stop line at the exit of Car Park 4 would likely have been obstructed given the trees which lined the side of the eastbound carriageway of Nicoll Drive, as well as the upslope at the exit ramp.34Foot Note 34×Expert Report of Yu Yonghe at pp 10–12 (BA at pp 126–128).This should have prompted the first defendant to first come to a complete stop before the stop line to allow him to check for traffic on both the east and westbound carriageways and, only if necessary, to slowly inch forward to check that the traffic on his right was clear before starting to cross the eastbound carriageway with a view to making the right turn. The dashcam footage shows that the first defendant did none of this. He simply did not stop at any time until seconds after the collision – and quite possibly only because Mr Bloch and/or Mr Allingham shouted at him to stop. This is yet further evidence of the first defendant’s abject lack of awareness and the deplorable state of his lookout. 27 Thirdly, notwithstanding the first defendant’s initial claim that he had sounded his horn twice to alert Mr Doney, it is not in dispute that this is false (see [22]).35Foot Note 35×Expert Report of Yu Yonghe at para 5.1.9 (BA at p 130); Expert Report of Neil Lawrence Mackay para 23 (BA at p 198). 28 Given the above, it is indubitably clear, on a balance of probabilities, that the first defendant was negligent in failing to give way to Mr Doney and failing to maintain a proper lookout. It is not disputed that the first defendant’s negligence caused the accident (and Mr Doney’s eventual death).36Foot Note 36×DCS at para 92.The defendants also do not dispute that the second defendant is vicariously liable for the first defendant’s negligence. 29  Having commented on the first defendant’s negligence, I turn now to deal with the only live issue in contention – whether Mr Doney was contributorily negligent, and if so, to what extent.",
        "The defendants’ ancillary contentions": "30 Before I tackle the critical arguments for the purposes of determining if there was any contributory negligence on Mr Doney’s part, I will first deal with several contentions presented by the defendants and their expert, which in my view are clearly unmeritorious: (a) that the rear tyre of Mr Doney’s bicycle was deflated; (b) that Mr Doney was looking down in the seconds before the collision; and (c) that Mr Doney was affected by sunstrike in the moments leading up to the collision.",
        "Whether Mr Doney had a deflated rear tyre": "31 Firstly, the defendants’ expert contends that the rear tyre of Mr Doney’s bicycle could have been deflating in the lead up to the accident. This could have caused Mr Doney to look down between his legs at the rear tyre rather than looking ahead.37Foot Note 37×Expert Report of Neil Lawrence Mackay paras 19–20 (BA at p 197). 32 The expert’s basis for this is an appraisal report of Mr Doney’s bicycle issued by LKK Auto Consultants Pte Ltd at the request of the Traffic Police (the “LKK Report”). The bicycle was inspected at the Traffic Police vehicle pound on 31 March 2020, more than four months after the accident. The report noted that both tyres were serviceable and no tears, burst marks or punctured holes were detected on either tyre. It was however observed that the rear tyre was deflated.38Foot Note 38×AEIC of Grace Chia dated 20 June 2022 at p 37 (BA at p 37).The defendants’ expert emphasises the fact that the rear tyre was deflated at the time of inspection whereas the front tyre was not, and thus takes the view that the rear tyre could have been a factor causing the accident.39Foot Note 39×Expert Report of Neil Lawrence Mackay paras 17–22 (BA at p 197). 33 While the defendants’ expert raised this as a point for consideration, it appears from the defendants’ closing submissions and reply submissions that the defendants have abandoned any arguments that the rear tyre was deflated. I surmise that this might perhaps be as a result of their realisation that this point, if pressed, would affect a finding on Mr Doney’s speed and consequently detract from the calculations the defendants’ expert put forward in his reconstruction of the accident.  Nonetheless, I do not accept the suggestion that the rear tyre of Mr Doney’s bicycle was deflated to any extent at the material time. 34 Much of the defendants’ expert’s theory rides on a finding that the rear tyre was indeed deflated or deflatingat the time of the accident. However, there is insufficient evidence pointing to such a conclusion. It bears repeating that the inspection of the bicycle was conducted several months after the accident, and there is no evidence of the state in which the bicycle was kept. Nor is there any confirmation that the bicycle was left untouched in this interim period. Furthermore, the LKK Report itself concludes that the rear tyre was in all other respects in good condition. 35 In my view, there is no real basis on the evidence to suspect that there was an issue with rear tyre pressure distracting Mr Doney on the day in question. From the eyewitness testimony of Mr Bloch, Mr Doney was cycling normally and reasonably and not erratically, with no swaying of his body or of the bicycle.40Foot Note 40×AEIC of Christopher Howard Bloch dated 2 March 2022 at para 9 (BA at p 48); NE (18 Oct 2022) at p 60, lines 27–30, p 61, lines 25–31.This indicates that Mr Doney was not facing any problems with a deflating tyre, given the defendants’ expert’s opinion that such a problem (if it was present) would have caused steering issues. Further, no discernible deflation of the rear tyre can be seen from a photograph taken at the accident scene by Mr Allingham.41Foot Note 41×AEIC of Roger James Allingham dated 2 March 2022 at p 9 (BA at pp 62).No indication of this can be found in the police report and accompanying sketch plans following the accident either.42Foot Note 42×AEIC of Selvakumar Ranjan dated 2 March 2022, Exhibit SR-1 at pp 34–35 (BA at pp 99–100).Thus, the contemporaneous evidence does not support a finding that the rear tyre was deflated or in the process of deflating such that it could have distracted Mr Doney. 36 It is significant that the LKK Report concludes that the steering and braking systems of Mr Doney’s bicycle were all in serviceable condition, and that there was no indication of any defects in the bicycle that may have caused or contributed to the accident.43Foot Note 43×AEIC of Grace Chia dated 20 June 2022 at p 45 (BA at p 45).There is no reason why this conclusion and the evidence referred to at [35] should be undermined by a single observation that the rear tyre was deflated at a time several months after the accident. 37 In my judgment, it is more likely than not that Mr Doney would have checked his tyre pressure before setting out on 10 November 2019, given his experience as a cyclist. It was the evidence of Mr Doney’s wife, the first plaintiff in this case, that she typically watched Mr Doney check his bicycle before going out, and that this included a check that both tyres were properly inflated.44Foot Note 44×NE (18 Oct 2022) at p 16, lines 2–9. 38 For the foregoing reasons, I find it improbable that there was a defect or problem with the rear tyre pressure on the day in question, or at the time of the accident. As for the defendants’ expert’s theory that this problem may have caused Mr Doney to look down for an extended period of time, I agree with the plaintiffs’ expert that this theory is speculative and without supporting evidence.45Foot Note 45×Supplementary Report of Yu Yonghe at para 7.2 (SBA at p 92).",
        "Whether Mr Doney was looking down": "39 While the defendants no longer argue that Mr Doney was dealing with a deflated rear tyre, they maintain the contention that Mr Doney was looking down (instead of ahead) while cycling.46Foot Note 46×DCS at para 93.In support of this, they rely on the first defendant’s evidence that Mr Doney was looking down at the road at all times. They also attribute this to his cycling posture at the time – that Mr Doney was using the time trial or “TT” bars of his bicycle. The defendants’ expert opined that a cyclist using TT bars would be in a significantly inclined position (to improve aerodynamism), such that it would be unnatural and uncomfortable to raise his head up to look forward continuously.47Foot Note 47×DCS at paras 75–76; AEIC of Selvakumar Ranjan dated 2 March 2022 at para 13 (BA at p 70); Supplementary Report of Neil Lawrence Mackay at para 58 (SBA at p 47).The defendants’ expert appears to have based his opinion on his own empirical testing (using himself as the test subject) on a road bicycle fitted with TT bars.48Foot Note 48×Expert Report of Neil Lawrence Mackay at para 100 (BA at p 216). 40 In my view, there is insufficient evidence to indicate that Mr Doney was looking down in the moments leading up to the accident. Given my finding on the general unreliability of the first defendant’s evidence, I place very little weight on his statement that Mr Doney was looking down in the moments leading up to the collision. The first defendant’s evidence is also contradicted by Mr Allingham’s testimony that from his perspective cycling behind Mr Doney, Mr Doney’s head was upright in a forward-looking position and did not move in the seconds before the collision.49Foot Note 49×NE (18 Oct 2022) at p 97, line 30 – p 98, line 2.Mr Bloch’s evidence on this was the same.50Foot Note 50×NE (18 Oct 2022) at p 73, lines 21–24. 41 The plaintiffs’ expert also raised some valid concerns about the defendant experts’ empirical testing, which formed the basis for his opinion. Specifically, the defendants’ expert did not mention the height of the handlebars and the height of the seat used in his testing, these being factors that can make a material difference to a cyclist’s positioning on the bicycle.51Foot Note 51×Supplementary Report of Yu Yonghe at para 9.3 (SBA at p 101). 42 Furthermore, there has been no suggestion by the defendants, either in their expert’s reports or their closing submissions, that Mr Doney was sprinting or cycling as if he was on a time trial, where he might have inclined his head down significantly to adopt a more aerodynamic position. 43 Lastly, even if I were to accept that Mr Doney’s head was pointed down, it does not mean that his eyes were also focused downwards instead of on the road ahead. There is no basis, on the available evidence, to make this inference. Taking all the evidence together, in my judgment, the defendants have not proven on a balance of probabilities that Mr Doney was looking down at the road or at his bicycle, instead of looking ahead.",
        "Whether Mr Doney was affected by sunstrike": "44 The defendants and their expert then argue that if Mr Doney was looking up in the seconds before the collision, then his vision was likely to have been affected by sunstrike. This. in turn, could have contributed to Mr Doney not seeing the truck until it was too late. The defendants contend that Mr Doney should have been more alert in looking around him and protecting himself.52Foot Note 52×DCS at para 79. Was Mr Doney wearing his transitional glasses at the time of the accident? 45 A preliminary question raised by the defendants’ expert is whether Mr Doney was wearing sunglasses at the time of the accident. This would have some bearing on whether Mr Doney was affected by sunstrike, a factor which could have delayed his reaction to the truck crossing his path.53Foot Note 53×Expert Report of Neil Lawrence Mackay at paras 40–41 (BA at p 207). 46 The first plaintiff’s testimony was that Mr Doney always wore his prescription transitional glasses in the day (including the day in question); these being glasses which would turn dark under sunlight, affording the wearer the same protection as sunglasses.54Foot Note 54×NE (18 Oct 2022) at p 17, lines 5–28, p 19, lines 6–14.In photographs of the accident scene taken by Mr Allingham, a pair of dark glasses can clearly be seen on the edge of the road, apparently undamaged.55Foot Note 55×AEIC of Roger James Allingham dated 2 March 2022 at p 10 (BA at p 63).In their closing submissions, the defendants accept that it is more likely than not that Mr Doneywaswearing his transitional glasses at the material time.56Foot Note 56×DCS at para 79. 47 On balance, I find that Mr Doney was likely to have been wearing his transitional glasses at the time of the accident. While he did not have the glasses on his person in the aftermath of the collision, this does not necessarily mean that he was not wearing them while cycling. It is undisputed that the point of impact was between Mr Doney’s head and the side of the truck.57Foot Note 57×NE (18 Oct 2022) at p 57, lines 4–7.It could well be that the impact of the collision was such as to knock Mr Doney’s transitional glasses off his face. Mr Doney’s lookout was unlikely to be obscured by sunstrike 48 I move on to the contention of sunstrike itself. The defendants’ expert elaborated on what sunstrike means – that Mr Doney would have had to contend with sunstrike given the low height of the sun above the horizon at the time and its position relative to the particular stretch of Nicoll Drive.58Foot Note 58×Expert Report of Neil Lawrence Mackay at para 39 (BA at p 207).Essentially, the defendants’ expert’s opinion was that because of the height of the sun at the time of the collision, the sun would likely have been in Mr Doney’s eyes, thus possibly affecting his vision of what was ahead of him. 49 On the available evidence, I am not persuaded that Mr Doney was affected by sunstrike. Firstly, in my judgment, any sunstrike would not have been significant given the weather conditions at the time. Based on the dashcam footage and the photographs taken by Mr Allingham after the collision, it appears that the sky was cloudy.59Foot Note 59×AEIC of Roger James Allingham dated 2 March 2022 at pp 9, 11–12 (BA at pp 62, 64–65); Supplementary Report of Yu Yonghe at p 24, Fig 19 (SBA at p 91); Expert Report of Neil Lawrence Mackay at p 17, Fig 12 (BA at p 207) and p 19, Fig 14 (BA at p 209).Mr Allingham also confirmed in his evidence that the sky was overcast at that time.60Foot Note 60×NE (18 Oct 2022), p 117, lines 19–31.This would suggest that it was not a bright and sunny morning with a cloudless sky, but rather one where the sun was intermittently obscured by cloud cover. 50 Secondly, there is no clear evidence that the angle of the sun at the time – estimated to be 11.87° south of the road’s eastbound heading61Foot Note 61×Supplementary Report of Yu Yonghe at para 6.1.2 (SBA at p 87).– would have created discernible sunstrike. The sun would have been in the right field of Mr Doney’s vision (if he was looking forward), as opposed to being dead ahead. Even if I accept that the sun was strong enough at the time of the accident such that Mr Doney would have had to look away from the right, there is no evidence that this would have obstructed his left field of vision, where the truck was coming fromvis-à-visMr Doney. In other words, the sun would not have prevented him from seeing the body of the truck exiting from Car Park 4 on his left. Therefore, sunstrike would not, in my judgment, have had any demonstrable impact on Mr Doney’s ability to see or observe the truck. 51 I would add a further point.  Even if I am wrong and sunstrike did play a part in adversely affecting Mr Doney’s vision, I did not see how this would be Mr Doney’sfault. Sunstrike is a natural phenomenon and if indeed (as the defendants maintain) it did affect Mr Doney’s vision at the material time and make it more difficult for him to see the truck, that would also mean that Mr Doney could reasonably be expected to takemore timeto react to the truck exiting Car Park 4 than a cyclist not affected by sunstrike would. I will come back to this point later when I address the question of hazard perception and reaction time. 52 For the foregoing reasons, there is, in my judgment, insufficient evidence demonstrating that sunstrike played any part in obscuring Mr Doney’s lookout.",
        "Was Mr Doney contributorily negligent?": "53 Having disposed of the defendants’ ancillary contentions, I now deal with the main points of contention on the issue of contributory negligence.",
        "The common ground": "54 I start by summarising the common ground between the parties and their respective experts:62Foot Note 62×Joint List of Issues (Experts) at pp 1, 7 (SBA at pp 54, 60). (a) the first defendant did not sound the horn at any time; (b) the first defendant did not bring the truck to a complete stop at any point before the collision, including at the stop line; (c) Mr Doney’s speed at the time was in the range of 30–35km/h; (d) Mr Doney was cycling at a distance of about 0.3m to 0.5m from the left kerb of the road (ie,close to the left edge of the left lane); and (e) Mr Doney collided with the right side of the truck, in way of the second side panel of the cargo compartment behind the driver cabin. The point of impact is apparent from the very visible indentation damage on that side panel, most likely where Mr Doney’s head hit the truck. Mr Doney’s speed 55 I pause here to expand on the evidential basis for Mr Doney’s speed referred to above at [54(c)]. The range of 30–35km/h is derived from an estimation given by Mr Bloch in his evidence as to his own speed. Mr Allingham also gave a similar range of 30–34km/h.63Foot Note 63×AEIC of Christopher Howard Bloch dated 2 March 2022 at para 5 (BA at p 47); AEIC of Roger James Allingham dated 2 March 2022 at para 5 (BA at p 55).Neither expert found fault with their evidence.64Foot Note 64×Expert Report of Yu Yonghe at para 13.2.3 (BA at p 163); Expert Report of Neil Lawrence Mackay para 74 (BA at p 213).It is worth noting these were the estimates of reasonably experienced cyclists. Moreover, their estimates cohered with the objective evidence. Firstly, Mr Allingham’s bicycle was equipped with an onboard bicycle computer which reflected his own real-time speed.65Foot Note 65×NE (18 Oct 2022) at p 91, line 20–28.This, in my view, lends some credence to Mr Allingham’s estimate. 56 Separately, Mr Bloch exhibited a screenshot of data from his Strava account which he used to track his entire cycling journey on 10 November 2019.  Strava is a software application used by, among others, cyclists to track a variety of data, including location and speed, in real-time. Mr Bloch’s screenshot is reproduced in Figure 3 below:66Foot Note 66×AEIC of Christopher Howard Bloch dated 2 March 2022 at p 8 (BA at p 53).  Figure 3 This screenshot shows Mr Bloch’s personal speed for a particular stretch of his journey (highlighted in blue) to be 37.1km/h. Mr Bloch gave oral evidence that the stretch he had highlighted in blue in the screenshot was the relevant stretch of road on Nicoll Drive where the accident occurred.67Foot Note 67×NE (18 Oct 2022) at pp 79–80.However, upon a closer review of the map in the screenshot, it appears that the highlighted stretch is not Nicoll Drive, but Changi Coastal Road, which is situatedafterthe point of collision. It is likely that Mr Bloch had mistakenly highlighted the incorrect stretch of his route in his evidence. This was unfortunately not picked up by either of the parties or their experts. 57 Clearly, the measurement from Mr Bloch’s Strava account for a different stretch of road cannot be relied on as a gauge of his speed along Nicoll Drive at the material time. In the circumstances, only Mr Bloch’sestimationof his own speed at 30–35km/h may be relied on. This range was in any event not disputed by the parties. In this judgment, I take Mr Bloch’s speed as being at the upper end of this range (ie,35km/h or approximately 9.8m/s) – this is closer to his average speed as extracted from his Strava account. 58 As for Mr Doney’s speed, given Mr Bloch’s evidence that he and Mr Allingham were travelling faster than Mr Doney and were gradually gaining on him, it is in my judgment reasonable to take Mr Doney’s speed at the material time to be the mid-point of the undisputed range of 30–35km/h. Accordingly, I find that Mr Doney’s speed at the material time was 32.5km/h (ie, approximately 8.35m/s). This would mean that Mr Bloch and Mr Allingham would have been closing their distance to Mr Doney by about 1.5m each second. This is consistent with Mr Bloch’s evidence that they were slowly catching up with Mr Doney along Nicoll Drive.68Foot Note 68×AEIC of Christopher Howard Bloch dated 2 March 2022 at para 5 (BA at p 47). 59 I note that there is no suggestion by the defendants in their closing submissions that Mr Doney’s speed was excessive at any material time. While an argument has been raised by the defendants that Mr Doney did not moderate his speed before entering the junction, that argument is tied to the allegation that he kept his speed constantwhile looking down.69Foot Note 69×DCS at para 93.I have already considered and rejected the defendants’ contention that Mr Doney was looking down in the moments leading up to the collision (see [43]). Based on the available evidence, I find that Mr Doney’s speed was not excessive in the circumstances.",
        "What evasive action could Mr Doney have taken?": "60 Next, I turn to what is really an indisputable issue. The defendants have at certain points suggested that there were in fact multiple options which Mr Doney could have taken to avoid a collision. In their Defence, the defendants plead that Mr Doney was negligent in “[f]ailing to stop, slow down,swerve or otherwiseso as to manage or control his bicycle as to avoid the said collision or at all” [emphasis added].70Foot Note 70×Defence at para 7(r).The defendants made a further suggestion in their reply submissions that Mr Doney could have moved to the right to pass in front of the truck, just as the motorcycle before him had done seconds earlier.71Foot Note 71×Defendants’ Reply Submissions (“DRS”) at para 34. 61 However, the defendants’ contentions that there were other options open to Mr Doney are not supported by their own expert. The defendants’ expert’s opinion, with which I agree, was that in light of the way events unfolded at the material time, braking was theonlyevasive action option available to Mr Doney:72Foot Note 72×Expert Report of Neil Lawrence Mackay at para 117 (BA at p 221). 117.The only evasive tactic available to MrDoney to avoid a collision with the truck was to apply emergency braking to bring his pedal cycle to a complete stop.Given that the truck was completely straddling the lane he was travelling in, with the front of the truck having extended across into Lane 2while the rear of the truck wasstill onthe car park side of the stop limit line bya distance of 3 metres, Mr Doney could not have swerved around either the front or back of the truck. [emphasis added] 62 Thus, in the circumstances, the only action Mr Doney could,in theory, take to even attempt to avoid a collision with the truck was to apply emergency braking. Accordingly, my ensuing analysis of the evidence and the reconstructions focuses on that option. Based on the testimony of Mr Bloch and Mr Allingham, it does not appear that Mr Doney had sufficient time to apply the brakes by the time he had recognised the truck to be an actual hazard. With the only available evasive action ruled out, Mr Doney – then out of options – could only throw his hands up at the last moment before impact in an attempt to protect himself from the collision.73Foot Note 73×AEIC of Christopher Howard Bloch dated 2 March 2022 at para 8 (BA at p 48).",
        "The defendants’ expert’s reconstruction": "63 I turn now to the fundamental inquiry in this case – was the collision an inevitability (as the plaintiffs contend) or something that could have been avoided but for negligence on Mr Doney’s part in failing to react by braking sooner (as the defendants contend)? 64 As foreshadowed above at [14], the defendants’ case theory very much rides on the reconstruction of the accident proffered by their expert. The defendants’ expert’s analysis uses several important terms of art which I should address before proceeding further. (1) Actual hazards and potential hazards 65 Firstly, a distinction is made between potential and actual hazards. This distinction is explained by the defendants’ expert as follows:74Foot Note 74×Supplementary Report of Neil Lawrence Mackay at para 21 (SBA at p 41). 21. In order to evaluate whether the cyclist could have stopped short of impact with the truck, the point at which the truck could first be identified as a hazard needs to be identified. Hazards are categorised into potential and actual hazards.An actual hazard necessitates a response to avoid a collision, a potential hazard warrants continual observation of the potential hazard to evaluate whether it will become an actual hazard. [emphasis added in bold italics] 66 I note as an aside that the defendants have suggested in their closing submissions that Mr Doney should be faulted for not taking actionbeforethe truck had even reached the stop line,ieat a point in time when the truck was only a potential hazard.75Foot Note 75×DCS at para 32.This is at odds with their expert’s foundational view that there is no need to positively act when a hazard is only a potential one. Such a hazard only needs to be monitored by maintaining a proper lookout. I therefore disagree with the defendants’ contentions on this point. (2) Point of hazard perception (“PHP”) 67 Putting the concepts of actual and potential hazards into context, a vehicle about to cross a major road can first be a potential hazard, and then beyond a certain point, an actual hazard. As the defendants’ expert has explained (at [65] above), it isonlyat the point when the vehicle becomes anactualhazardthat positive evasive action is necessary. The defendants’ expert refers to this point as the point of hazard perception (“PHP”).76Foot Note 76×Supplementary Report of Neil Lawrence Mackay at p 7 (SBA at p 41).The implications are clear – thelaterthe PHP, thecloserin time it would have been to the collision, and correspondingly thelesserthe amount of time Mr Doney would have had to recognise the danger and apply emergency braking andvice versa. (3)  Braking time and perception response time (“PRT”) 68 Once the PHP is determined, the next inquiry is whether Mr Doney could reasonably have reacted by applying the brakes on his bicycleandstopping in time – cumulatively, PRT and braking time would represent the totaltimeit would take (from PHP) to come to a complete stop; based on what Mr Doney’s speed has been assessed to be, the availabledistancecan also be calculated. It is of course the case before me that Mr Doney was not in fact able to react within this time. Thus, the ensuing analysis is one that engages the counterfactual. In other words, what I am asked to consider is what a reasonable cyclist with Mr Doney’s characteristics and in his position could have done in that time. 69 There are two elements to this analysis. The first is the amount of time needed for a cyclist to decelerate to a complete stop after applying the emergency brakes – I will refer to this as the “braking time”. As will be shown below, this is a question of physics and does not arise as a serious point of contention. The second, as termed by the defendants’ expert, is PRT,iethe time needed for the road user in question torecognisethe actual hazard, and thus trigger his reaction (to apply the emergency brakes).77Foot Note 77×Expert Report of Neil Lawrence Mackay at para 88 (BA at p 214); Supplementary Report of Yu Yonghe at para 4.2.1 (SBA at p 79).In terms of sequence, logically it would be PRT first followed by braking time.  In the rest of this judgment, I will refer to PRT and braking time collectively as “reaction time” or “RT”.",
        "Analysis of the reconstruction": "70 Having clarified the terminology, it is apt to set out the defendants’ expert’s reconstruction in full. The purpose of this reconstruction was to calculate the amount of time Mr Doney had to react and take evasive action after the truck became an actual hazard, and compare it to the RT of a reasonable cyclist. Some brief explanation of the expert’s methodology is necessary. Essentially, the expert analysed the dashcam footage to isolate a particular frame of the footage which he deemed to represent the moment the truck \"assuredly” crossed the stop line. He then measured the time difference between this frame and the time of collision (when the loud impact sound can be heard). This difference would constitute the total time (in seconds) within which Mr Doney had to react and brake to a complete stop without skidding or his bicycle pitching over. The defendants’ expert then deducted, from this figure, (i) a PRT of 2 seconds, as well as (ii) a braking time of 2 seconds on the assumption that Mr Doney was travelling at 35km/h.78Foot Note 78×Expert Report of Neil Lawrence Mackay at para 86 (BA at p 214).He undertook a similar exercise in a second scenario where Mr Doney’s speed was assumed to be 30 km/h, with PRT remaining the same but the braking time lowered to 1.7 seconds (on account of the lower speed). Thus, the defendant’s expert utilised an RT of 3.7 seconds (based on a speed of 30 km/h) and 4 seconds (based on a speed of 35 km/h).79Foot Note 79×Expert Report of Neil Lawrence Mackay at para 89 (BA at p 215).Using the defendants’ expert’s calculation formulae, I have adjusted the braking time to 1.85 seconds based on my finding (at [58] above) that Mr Doney’s speed at the material time was 32.5km/h. 71 A point of some difficulty here is that the defendants’ expert revised (or in his words “refined”) his calculations several times. In his first report, he calculated the total available time for RT to be 5.6 seconds, on the assumption that Frame No 247 of the dashcam footage was the starting point where the truck had crossed the stop line.80Foot Note 80×Expert Report of Neil Lawrence Mackay at para 30 (BA at p 200).In his supplementary report, he changed this starting point to Frame No 248, which did not result in any changes to the 5.6-second estimation.81Foot Note 81×Supplementary Report of Neil Lawrence Mackay at paras 35–36 (SBA at pp 43–44).After taking measurements at the scene during a site visit after the commencement of the trial, he subsequently revised the figure down to 5.3 seconds in his oral evidence, to account for the incline at the exit ramp at Car Park 4 and his estimate of the height at which the dashcam was positioned.82Foot Note 82×NE (20 Oct 2022) at p 69, line 13 – p 70, line 12.He then revised the figure yet again after adjusting his calculations, arriving at a final figure of 5.5 seconds.83Foot Note 83×NE (21 Oct 2022) at p 5, line 29 – p 6, line 2.Given thethreedifferent “refinements”, it calls into question the accuracy of the defendants’ expert’s calculated figures. Nevertheless, I set out each of these revisions in the table below, including the available PRT for Mr Doney (after deducting braking time of 1.85 seconds):  Expert’s revisionTotal available time for reaction and brakingPRT[Total available time less braking time of 1.85 seconds]15.6s3.75s25.3s3.45s35.5s3.65s 72 Therefore, on the assumption that the truck became an actual hazard from the time it had “assuredly” crossed the stop line, the defendants’ expert’s opinion would appear to be that Mr Doney had anywhere from 3.45–3.75 seconds to react. He opined that a reasonable cyclist would have been able to react within 2 seconds.84Foot Note 84×Expert Report of Neil Lawrence Mackay at para 87 (BA at p 214).The expert therefore concluded that Mr Doney was unreasonably slow to react to the truck becoming an actual hazard and was therefore contributorily negligent. 73 It is immediately apparent from the above summary that there are concerns with the accuracy of the defendants’ expert’s calculations. This raises a more general point about reliance on reconstruction evidence. There is no doubt that reconstructions are useful to the court as they offer a scientific analysis of matters which cannot be provided by lay witnesses and counsel, but as was aptly recognised by Andrew Phang Boon Leong JC (as he then was) inKhoo BeeKeong v Ang Chun Hong and Another[2005] SGHC 128 at [80], an accident reconstruction is useful when it is “complemented by a realistic application to the concrete factual matrix itself”. Calculations of reaction time, even those precise to a tenth of a second, cannot simply be accepted at face value as reflecting the absolute truth of the events of the day. More importantly, courts must be wary of reconstructions which hypothesise in the abstract, without regard to the actual conditions on the ground, and without giving any latitude for the characteristics of the individuals involved, as well as actions (or inaction) in the agony of the moment. In this case, putting aside the concerns regarding accuracy of calculation, I find that the defendants’ expert’s reconstruction has at times strayed into the abstract without concern for reality, such that it has tended to obscure rather than assist to determine what actually occurred on the day in question. I elaborate below. The appropriate PHP 74 First, the defendants’ expert’s reconstruction assumes that the PHP is at the point the truck had assuredly crossed the stop line. While I accept that a vehicle proceeding across a stop line wouldordinarilybe taken to no longer be giving way to oncoming traffic, this general assumption cannot in my view be applied to every traffic incident at every junction. Assessing contributory negligence is after all a fact-sensitive inquiry, especially in road traffic accident cases (Ng Li Ning v Ting Jun Heng and another[2021] 2 SLR 1267 at [34]). As the defendants themselves recognise, “[t]here are many different types of junctions and different considerations will apply depending on the type of junction where an accident occurs”.85Foot Note 85×DRS at para 38.Thus, the factual matrix of the accident and the layout of the junction in question are ofcritical importance. Having considered those factors in relation tothisparticular junction, there are in my view good reasons to depart from the general assumption in this case – reasons which the defendants’ expert unfortunately did not account for sufficiently or at all. Let me explain. 75 It is important to bear in mind that we are dealing here with hazardperception. What then does it mean to perceive? In theShorter Oxford English Dictionary(Oxford University Press, 6th ed, 2007) at p 2155, to “perceive” is to “[t]ake in with the mind or senses”. The dictionary offers two further clarifications of this definition which are material here, namelythat it is to “[b]ecome aware or conscious of (a thing); apprehend with the mind” and “[b]ecome aware of (an object) through one of the senses, [especially] sight”. Extrapolating from these meanings, for the truck to have been perceptible to Mr Doney as an actual hazard once it crossed the stop line, Mr Doney must have been able to detect that precise point of crossing with his sensesandapprehend the truck as a danger necessitating evasive action from that point. In my judgment, on the available evidence, neither element would have been clear at the point of the truck crossing the stop line. 76 Tackling first the element of detection with the senses, I find that there are several distinct characteristics of the junction at the exit of Car Park 4 which would have made it difficult (if not impossible) for Mr Doney to perceive that the truck had crossed the stop line. Firstly, the stop line in this case is set back from the edge of the road (delineated by the northern edge of the yellow box) by almost 2m.86Foot Note 86×Supplementary Report of Neil Lawrence Mackay at p 33, Appendix B (SBA at p 63).Secondly, there is a raised kerb at the exit ramp of Car Park 4.87Foot Note 87×Supplementary AEIC of Grace Chia dated 14 October 2022 at p 20, Item 27 (SBA at p 20).Thirdly, Car Park 4 is at a lower elevation than Nicoll Drive, such that the exit ramp is on an upslope of about 8°at the stop line.88Foot Note 88×Expert Report of Yu Yonghe at para 4.2.4, and p 12, Fig 4 (BA at pp 124, 128).Fourthly, the left side of the eastbound carriageway of Nicoll Drive is lined by trees up till after the penultimate lamp post before the exit ramp of Car Park 4, this being a distance of about 47–55m (see [77] below).89Foot Note 89×Supplementary AEIC of Grace Chia dated 14 October 2022 at pp 7, 18, 23, 30 (SBA at pp 7, 18, 23, 30); AEIC of Roger James Allingham dated 2 March 2022 at p 9 (BA at p 62). 77 These features, in combination, would mean that Mr Doney, from his position cycling near the left edge of the road, would have had his view of the Car Park 4 exit (and the stop line) obstructed until he was at a point where the edge of the road was no longer lined by trees. The defendants’ expert himself accepted that Mr Doney could have been partially obscured from the first defendant’s view at the exit ramp.90Foot Note 90×Supplementary Report of Neil Lawrence Mackay at para 69 (SBA at p 48).Logically, this would applyvice versasuch that the truck could also have been obscured from Mr Doney’s view, at least until the point where the line of trees ended, when he was closer to the junction.According to a drawing of the accident site provided by the defendants’ expert, this point was between the last two lamp posts before the Car Park 4 exit, no more than 55m away from the eventual point of impact.91Foot Note 91×Supplementary Report of Neil Lawrence Mackay at p 33, Appendix B (SBA at p 63).Before this point, it would have been difficult for Mr Doney to even see the truck, let alone the stop line. Coincidentally, the defendants’ expert also estimated that Mr Doney was about 47–55m away from the exit when the truck crossed the stop line.92Foot Note 92×Supplementary Report of Neil Lawrence Mackay at para 69 (SBA at p 48).It is therefore quite possible that the truck hadalreadycrossed the stop line at the point it first became visible to Mr Doney. In my view, it would not be reasonable to say that Mr Doney could have,at that very pointin time, observed in a single glance that the truck had “beaten” the stop line. Unlike a road user approaching a junction with an unobstructed view, Mr Doney would not have had the benefit of being able to observe the motion of the truck for any significant amount of time or witness it crossing the stop line (assuming he could even see it). 78 Aside from the features of this particular junction, I find that the nature ofthis particular truckwould also have made it difficult for Mr Doney to see the stop line, let alone perceive when that line had been definitively crossed by the truck. Given the large size of the truck (approximately 2.5m in height and 8.6m in length),93Foot Note 93×Expert Report of Yu Yonghe at p 63 (BA at p 179).the entire driver cabin section and front tyres of the truck would have effectively blocked the stop line from the viewpoint of a motorist on Nicoll Drive. In these circumstances, it is in my view unlikely that a cyclist approaching on the left lane of the road from some distance away would have been able to see the stop lineanddetermine if the truck had in fact crossed it. This further feature of this case, together with the difficulties discussed at [77] above are sufficient, in my mind, to cast doubt on the appropriateness of treating the point at which the truck crossed the stop line as the PHP in this case. I was not persuaded that that would be a point at which a potential hazard exiting from Car Park 4 could be perceived to be an actual hazard by the senses of a cyclist some 45m to 55m away from the exit. 79 Even if the truck’s crossing of the stop line could be perceived, it is not clear to me that this event, in and of itself, would have raised a clear apprehension of danger in the mind of a road user travelling along Nicoll Drive. This element requires some further explanation. Road users must exercise reasonable caution on the road and watch out for potential hazards, including the possibility that other road users may break traffic rules. However, at the same time, such road users are not expected to conduct themselves on the assumption that every other motorist, cyclist or motorcyclistwillbreak the rules. This much was made clear by Kan Ting Chiu J inStafford Rosemary Anne Jane (administratrix of the estate of Stafford Anthony John, deceased) v Goo Tong Sing and another[2006] 3 SLR(R) 277 at [27]: 27 When one travels on the roads, one cannot assume perfect road manners from the other road users. The reasonable road user must act on the basis that there may be negligence and incompetence on the part of others, and he has to make allowance for them. However, this duty cannot be overstated;he is not required to regard other road users as threats to him against whom he must protect himself, and he must be allowed to go about with a degree of calm and confidence necessary for the orderly movement of traffic. … [emphasis added] To raise a simple example, a cyclist crossing a traffic light junction with the traffic lights in his favour would not be expected to brake or swerve at the sight of a vehicle which has stopped slightly beyond a stop line. In fact, that would probably be a dangerous thing to do. Indeed, if road users were expected to be constantly anxious and ready to apply their brakes at the sight of any vehicle even remotely “breaching” a stop line, traffic in Singapore would potentially grind to a halt. To be clear, I am not in any way suggesting that it is acceptable for motorists on Singapore roads to ignore the “stop line” rule. However, in my view, it must be abundantly clear to the road user that the vehicle in question is not giving way to him before that vehicle may no longer be perceived as apotentialhazard and is, instead, anactualhazard requiring positive evasive action to be taken. 80 The defendants’ expert’s reconstruction assumes that the moment the truck crossed the stop line, Mr Doney would be able not only to detect that this had occurred, but also apprehend that the truck was not giving way to him and that he had to immediately apply the brakes on his bicycle to avoid a collision. I find this assumption to be artificial and unrealistic. It does not account for the actual layout of the junction. The stop line here was recessed some distance behind the edge of the road, effectively creating a “buffer zone” between the stop line and the actual boundary of the road in which a vehicle exiting Car Park 4 could be waiting – this “buffer zone” is clearly visible in Figure 1 (see [5]). Indeed, given that a driver at the stop line was likely to have his own view of the road obscured by the line of trees (see [76]–[77]), in order to safely turn out of Car Park 4, a driver may well have to move forward slowly past the stop line (but remaining in the “buffer zone”) to be in a better position to check for oncoming traffic especially from the driver’s right side. An example of a driver stopping in this “buffer zone” to check for traffic was captured in a video recording tendered by the plaintiffs’ expert (see Figure 4 below which is a screenshot taken from the video recording).94Foot Note 94×Exhibit P8.  Figure 4 Putting aside the permissibility of this practice (which is not an issue before me), it would not, in my view, be immediately clear to a motorist or cyclist on Nicoll Drive (perceiving the situation ahead of them) that a vehicle which was in this “buffer zone” wasnotgiving way to them and therefore, an actual hazard requiring evasive action to be taken as opposed to a potentialhazard warranting “continual observation” (see [65]). 81 In my judgment, in so far as the defendants’ expert’s reconstruction designates the crossing of the stop line as the PHP from which the clock would start running on Mr Doney’s RT, I find that designation unrealistic in this case. It is based on an overly theoretical and abstract view of matters, without regard to the actual conditions on site at the junction. The available PRT 82 Assuming that I continue to rely on the defendants’ expert’s reconstruction methodology, any calculation of the total available PRT would have to then account for the fact that the PHP point should be set at alater point. In my view, a more realistic PHP in this case would be the point when the truck started to encroach into the left lane of Nicoll Drive, as delineated by the northern edge of the yellow box at the exit of Car Park 4. This would, in my view, have formed a clear visual reference point for a motorist travelling along Nicoll Drive. Once the truck had started to breach the boundary of the yellow box, it would be clear at this point to any road user on Nicoll Drive that (i) a vehicle was exiting Car Park 4and(ii) was not giving way to oncoming traffic. In other words, it is at this point that the truck would be clearlyperceptibleas an actual hazard. 83 On this basis, the available PRT for Mr Doney would have to be adjusted down from the 3.45–3.75 seconds arrived at on the defendants’ expert’s theory (see [71]–[72]). The defendants’ expert’s own estimate was that the time between the truck crossing into the yellow box and the time of impact would have been approximately 4.8 seconds.95Foot Note 95×NE (20 October 2022) at p 18, lines 4–7.Following the expert’s methodology, this would then produce an available PRT of 2.95 seconds. However, given the concerns I had raised on the defendants’ expert’s estimations (see [71] above), it would not be reasonable to treat this calculation as one of absolute pinpoint accuracy. One would have to account for a margin of error. This is because it cannot, for one, be said with certainty that at either Frame No 247 or Frame No 248 of the dashcam footage the truck’s heading was perpendicular to Nicoll Drive. Given the image distortion apparent from the curved images in the dashcam footage due to the camera view angle (described by the defendants’ expert as “barrel distortion”),96Foot Note 96×Expert Report of Neil Lawrence Mackay at para 26 (BA at p 199).that distortion in turn affects the accuracy of the calculation of where exactly the truck was at either of those frames. Further, the camera view angle was estimated to be 150°; however, there was no evidence adduced of the actual model or specifications of the dashcam.97Foot Note 97×Expert Report of Yu Yonghe at para 5.3.1 (BA at p 130); Supplementary Report of Yu Yonghe at paras 4.1.8–4.1.9 (SBA at p 79).By way of example, and to demonstrate how even a small margin of error could make a significant difference to the outcome, I have set out below a range of possible figures for the available PRT, based on a mere one-second margin of error (ie, 4.8 seconds, plus or minus one second):  ScenarioTime available between crossing yellow box edge and impactAvailable PRT[Time available less braking time of 1.85 seconds]15.8s3.95s25.3s3.45s34.8s2.95s44.3s2.45s53.8s1.95s 84 As the figures in the table demonstrate, even providing a margin of error of just one second could result in a possible scenario (ie, Scenario 5) where a reasonable cyclist with a 2-second PRT (which the defendants’ expert contends is reasonable) would have insufficient time to react or (in Scenario 4) have less than half a second to spare. This is even before one takes into account other factors such as Mr Doney’s age or possible fatigue level (having already cycled for at least 30 minutes before the time of the accident), which could have an impact on his reaction time. 85 I cannot emphasise enough that the calculations presented and discussed thus far (particularly those in the table above at [83]) arenotfindings of fact. Instead, the point to be made here is the artificiality (and potential injustice) in making judgments on the basis of calculations which are undertaken to the nth degree of precision and specificity, but which are ultimately built on theoretical assumptions. This is exactly what the defendants’ expert has done – to utilise precise calculations in an attempt to show that Mr Doney had more than enough time to recognise the truck as an actual hazard and come to a complete stopwell beforethe collision. 86 It is significant to note that despite their defendants’ expert’s calculations and opinion, it isnotthe defendants’ case that they are not liable at all or that Mr Doney is the sole author of the tragedy that befell him. The defendants’ expert postulates that Mr Doney had more than enough time to completely avoidanycollision even occurring.98Foot Note 98×Expert Report of Neil Lawrence Mackay at paras 122–126, 134 (BA at pp 221–222); Supplementary Report of Neil Lawrence Mackay at paras 42–44 (SBA at pp 45–46).In this regard, it is worth reproducing the defendants’ expert’s opinion: 42. Employing the upper PRT of 2 seconds, the cyclist would have travelled 19.4 metres in this 2 seconds [sic] while reacting to the truck encroaching into his lane. At the end of the 2 second PRT, this would leave 30.2 metres in which to bring his bicycle to a stop. Applying the 0.5g deceleration rate utilised in the calculation at Appendix F of my first report, the cyclist could have brought his bicycle to a complete stop in 9.7 metres, taking 1.9 seconds to do so. The total distance travelled while reacting and braking to a stop is 29.1 metres (19.4 + 9.7).Accordinglythe cyclist could have stopped short of impact by just over 20 metres (49.58 - 29.1 = 20.48).The total time taken to stop is 3.98 seconds (2 seconds PRT + 1.98 seconds stopping time). 43.Employing the same criteria, had the cyclist’s approach speed been 30 Km/h as the truck crossed the northern perimeter line of the yellow rectangle,he could have stopped short of impact by 18.8 metres.The total time taken to stop is 3.7 seconds (2 seconds PRT + 1.7 seconds stopping time). 44. Depending on the cyclists [sic] approach speed, his PRT could have [sic] 3.0 to 3.2 seconds to react and he could still have stopped short of impacting the side of the truck [sic] [emphasis added in italics and bold italics] 87 Yet, the defendants ultimately do not dispute that the first defendant was negligent and that his negligence caused the accident. In fact, they accept that the first defendant should still bear the larger proportion of the blame and ask that I find Mr Doney to be contributorily negligent to the extent of 30%.99Foot Note 99×DCS at para 101.The defendants’ stance is, in my view, somewhat inconsistent with their expert’s opinion. But more importantly, it also demonstrates that precision in the defendants’ expert’s calculations do not equate to accuracy or realism. I reiterate my earlier point that reconstructions should not be treated as representing the absolute truth of the actual events in the day on question, not least when there are valid reasons to doubt their accuracy as realistic representations of the events on the ground. The complications 88 I highlight a further flaw with the defendants’ expert’s reconstruction–it assumes a straightforward traffic scenario involving only the truck and Mr Doney. It omits to factor in the involvement of a third party – the motorcycle seen in the dashcam footage. In the footage, it can clearly be seen that the truck perceptibly slows down almost to a complete stop to allow the motorcycle to pass before speeding up again. It is common ground between the experts that between the motorcyclist passing ahead of the truck and the collision, approximately 2–2.5 seconds elapsed.100Foot Note 100×NE (26 Oct 2022) at p 72, lines 6–12, p 73, lines 6–12, and p 121, lines 29–31; Expert Report of Neil Lawrence Mackay at para 30 (BA at p 200); Expert Report of Yu Yonghe at para 5.1.8 (BA at p 129).Given that this slowing down was clearly perceptible from the driver’s viewpoint, as captured by the dashcam footage, it would likely have been perceptible to Mr Doney as well. 89 It is therefore not beyond the realm of plausibility that Mr Doney might have been misled into thinking that the truck, having slowed down perceptibly to give way to the motorcycle, was also intending to give way to him. However, the truck’s acceleration a moment later to continue moving forward and across the eastbound carriageway resulted in a sudden change in the dynamics of the situation unfolding, creating a new dynamic which Mr Doney had to react to. Mr Doney would only have had 2–2.5 seconds within which to react to this new situationandtake effective evasive action. If this point was taken as a new PHP, then Mr Doney’s RT was no more than 2.5 seconds at best. 90 The defendants’ expert’s reconstruction, however, does not consider the scenario above. As I said, the scenario is not an implausible one based on what can be perceived from the dashcam footage. The defendants’ expert’s reconstruction does not take into account the first defendant’s act of slowing down and then accelerating again, how this would have been perceived by Mr Doney, and importantly, the impact of this on PHP, PRT and braking time. The situation is instead analysed simply as one continuous movement by the truck. The defendants’ expert equated the motion of the truck to those of “continuous motion intruders”,ie, vehicles that are in continuous motion as opposed to vehicles starting from a stationary position such as a stop line.101Foot Note 101×Supplementary Report of Neil Lawrence Mackay at paras 18–19 (SBA at p 40).To this extent also, there is again, in my view, a lack of realism in the defendants’ expert’s reconstruction. 91 It is apt to examine again how Mr Doney would have perceived the situation. As a road user travelling on the left lane along Nicoll Drive, observing the truck starting to encroach into the yellow box (thus becoming an actual hazard) and then slowing down almost to a stop to allow a motorcycle in the right lane to pass ahead (after the motorcyclist had overtaken Mr Doney), it would not have been unreasonable for Mr Doney to assume that the truck was slowing down to allowalltraffic on its right (including Mr Doney himself) to pass. In fact, this was the impression Mr Allingham had formed, from some distance behind Mr Doney.102Foot Note 102×NE (18 Oct 2022) at p 86, lines 1–8; AEIC of Selvakumar Ranjan dated 2 March 2022, Exhibit SR-1 at p 38 (BA at p 103).Thus, there is areal possibilitythat Mr Doney himself, as a reasonable cyclist, did at that moment no longer perceive the truck to be an actual hazard, even if only momentarily. When that state of play was then altered a moment later by the truck’s acceleration across the left lane, it could, in my view, have surprised Mr Doney and created confusion as to the truck’s intentions. Faced with new information unfolding in front of him, Mr Doney had a mere 2.5 seconds or less to react to this. This change in dynamic, even if it lasted for just a second or two, would potentially have had momentous consequences in terms of Mr Doney’s hazard perception, and consequently his RT. The plaintiffs’ expert, citing a study by the American Association of State Highway and Transportation Officials, took the view that a reaction time of 2.5 seconds “is considered adequate for conditions that are more complex than the simple conditions used in laboratory and road tests, but it is not adequate for the most complex conditions encountered in actual driving”.103Foot Note 103×Supplementary Report of Yu Yonghe at para 4.2.2 (SBA at p 80); Exhibit P5 at para 3.2.2.1.The situation conceivably faced by Mr Doney as I have described above would, in my view, be an example of such complex conditions. 92 Turning to the table at [83] above, if a PRT of 2.5 seconds is utilised and assuming the total available time remains unchanged, it would result in insufficient time for Mr Doney to avoid a collision in Scenarios 4 and 5 and with less than half a second to spare in Scenario 3. This is even without any consideration being given to how any potential sunstrike could have further affected the PRT in each of those scenarios (as I alluded to above at [51]). Even if PRT was increased by just one second on account of sunstrike (ie, to 3.5 seconds), Mr Doney would have had insufficient time in four of the scenarios at [83] and less than half a second to spare in Scenario 1. 93 I wish to make it very clear that I do not raise the points in the preceding paragraphs for the purposes of making any findings that Mr Doney had in fact been confused by the truck slowing down to give way to the motorcycle. Only Mr Doney would be able to testify to that; but unfortunately, he is not here to relate his side of the events that unfolded on that tragic day. The point I am seeking to make is that based on the perceptible slowing down and acceleration of the truck as is clearly apparent in the dashcam footage, I cannot discount the possibility that this had an impact on Mr Doney’s perception of the situation unfolding in front of him. This, in turn, could have affected his ability to react within the time available. Crucially, the defendants’ expert takesno accountof this possibility at all in his reconstruction. Nor does he allow any margin in Mr Doney’s favour on account of this possibility. This is a further reason why I find the defendants’ expert’s reconstruction to lack realism. 94 For completeness, a further suggestion was made by the defendants’ expert in his report,vizthe collision had only occurred because the first defendant had to apply the brakes and slow down to allow the motorcyclist to pass, and that but for that act of slowing down, the truck would have cleared both eastbound lanes of Nicoll Drive before Mr Doney arrived at the impact location. However, the defendants did not pursue this line of argument in their closing submissions, and I take it therefore that they have abandoned this point.  Consequently, I say no more on it. Conclusion on the defendants’ expert’s reconstruction 95 For the reasons detailed above, I am unable to give the weight the defendants urge me to give to their expert’s reconstruction of events, or his opinion that Mr Doney was unreasonably slow to react to the situation. In my judgment, the defendants’ expert’s reconstruction does not accurately or realistically depict the events as they transpired at the material time on the day in question. 96 The defendants’ case hinges almost entirely on their expert’s opinions.  As I do not accept the defendants’ expert’s case theory, I find that the defendants have failed to establish, on the balance of probabilities, that Mr Doney was contributorily negligent in the accident occurring. Accordingly, I reject the defendants’ defence that there was contributory negligence on the part of Mr Doney.",
        "A general point on the limits of my findings": "97 Before I conclude, I address a more general point made by the defendants in their closing submissions. The defendants submit that this case is of particular importance as Singapore sees a large number of cyclists on its roads today. The defendants suggest that any finding by the court that Mr Doney was not contributorily negligent would “undoubtedly encourage cyclists, vulnerable as they are, to be careless when on the roads”.104Foot Note 104×DRS at para 2.With respect, there is no reason or basis for the defendants to seek to sensationalise this case as one that sets the “standard of care that all cyclists should take when on the roads” or as one that may potentially endorse lax standards of conduct for cyclists on the road in general. I reject any such suggestion. As I have sought to make clear in this judgment, my findings and conclusions, particularly those on PHP, are fact-sensitive and limited to the circumstances of the accident at this particular junction. They are not to be taken as general statements of law or principle applying to all junctions or to all cyclists.",
        "Conclusion": "98 For the reasons set out above, I find and hold that there was no contributory negligence on the part of Mr Doney. Accordingly, I find that the first defendant is 100% liable for the accident occurring and that his negligence caused Mr Doney’s death. I further find and hold that the second defendant is vicariously liable for the first defendant’s negligence. Consequently, judgment is granted in favour of the plaintiffs against the first and second defendants jointly for 100% liability, with damages to be assessed. 99 I will hear the parties separately on the appropriate orders to be made on the questions of interest and costs. S MohanJudge of the High Court Grace Malathy d/o Ponnusamy and Ng Wen Wen (Grace Law LLC) for the plaintiffs; Teo Weng Kie and Shahira bte Mohd Anuar (Securus Legal LLC) for the defendants.",
        "": ""
    }
}