{
    "case_title": "VOW vVOV",
    "ncitation": "[2023] SGHCF 9",
    "coram": "Teh Hwee Hwee JC",
    "sections": {
        "Introduction": "1 This is an appeal against the decision of the learned District Judge (“DJ”) in FC/D 580/2020. The appeal concerns the issue of division of matrimonial assets and maintenance for the two children from the marriage.",
        "Background": "2 The appellant wife (the “Wife”) and the respondent husband (the “Husband”) were married on 3 June 2006 in Singapore.1Foot Note 1×Record of Appeal (“ROA”) Vol 2 at p 10.The Wife was 39 years old when the Statement of Claim for Divorce was filed in 2020; the Husband was 42 years old.2Foot Note 2×ROA Vol 2 at p 10.The Husband was a French citizen and a Singapore permanent resident while the Wife was a Singapore citizen.3Foot Note 3×VOV v VOW[2021] SGFC 10 at [3].Shortly after they were married, the Wife left her previous job as an air stewardess4Foot Note 4×Appellant’s Case (“AC”) at para 59; Respondent’s Case (“RC”) at p 38.and the parties moved to Australia in August 2006 for the Husband’s work as a consultant.5Foot Note 5×RC at para 48 and p 38.In Australia, the Wife managed to find work at a call centre.6Foot Note 6×AC at para 59; RC at p 38.Slightly over a year later, in November 2007, the parties relocated back to Singapore when the Husband found work as a project manager in Singapore.7Foot Note 7×RC at para 48 and p 38.Upon the return to Singapore, the Wife did not work, and instead pursued a degree in Banking and Finance with the University of London, which the Husband asserts was funded by him.8Foot Note 8×ROA Vol 3A at p 103.The Wife returned to the workplace around August 2010 and has been in continuous employment since.9Foot Note 9×ROA Vol 3C at pp 35–39.Both parties have done well professionally. As of 2020, the Husband held a senior position in a company as a solution architect10Foot Note 10×ROA Vol 3A at p 161; ROA Vol 3H at pp 67 and 554; RC at pp 46–47.while the Wife was a sales consultant in an insurance brokerage company.11Foot Note 11×ROA Vol 3A at p 5.Taking into consideration each party’s Notice of Assessment for 2019, 2020 and 2021, the Husband’s average monthly salary was $18,877 and the Wife’s average monthly salary was $15,249.12Foot Note 12×ROA Vol 1 at p 97.The parties’ matrimonial assets were sizable, and comprised, amongst other things, a matrimonial home (a condominium apartment), bank accounts, an investment portfolio largely held in the Wife’s name, insurance policies, and Central Provident Fund (“CPF”) savings.13Foot Note 13×ROA Vol 1 at pp 66–79. 3 The parties have two children from the marriage, born in 2012 and 2014.14Foot Note 14×ROA Vol 2 at p 11.The children attended primary school in Singapore.15Foot Note 15×ROA Vol 4 at p 173.By July 2017, the marriage had started to break down.16Foot Note 16×VOV v VOW[2021] SGFC 10 at [4].The Husband subsequently moved out of the matrimonial home with the children in January 2020,17Foot Note 17×AC at para 72.while the Wife remained in the matrimonial home.18Foot Note 18×RC at paras 18 and 44vi. 4 Interim Judgment (“IJ”) was granted on 3 September 2020.19Foot Note 19×ROA Vol 1 at pp 108–109.On 2 November 2020, the learned DJ ordered the Wife to pay interim maintenance for the two children.20Foot Note 20×ROA Vol 3I at p 256.The divorce proceedings were contentious. On 14 January 2020, the Husband filed an application for a Personal Protection Order (“PPO”) against the Wife for his own benefit and on behalf of the two children, on the ground of family violence.21Foot Note 21×RC at para 3i;VOV v VOW[2021] SGFC 10 at [4]–[5].On 12 October 2020, after a hearing where the Husband withdrew the application for a PPO for himself but continued with his PPO application for the two children, a PPO was granted against the Wife for the protection of the two children.22Foot Note 22×RC at para 3i;VOV v VOW[2021] SGFC 10 at [5].",
        "Decision of the learned DJ": "5 The ancillary matters (“AM”) were heard by the learned DJ on 3 November 2021, 18 January 2022 and 11 February 2022. The learned DJ issued her judgment on 17 March 2022 and ordered that the Wife and Husband have joint custody of the children, with sole care and control to the Husband.23Foot Note 23×ROA Vol 1 at p 105.The learned DJ also granted the Wife access to the children.24Foot Note 24×ROA Vol 1 at p 105. 6 The learned DJ determined the total value of the pool of matrimonial assets to be $2,010,487.47.25Foot Note 25×ROA Vol 1 at p 79.Applying the approach inANJ v ANK[2015] 4 SLR 1043 (“ANJ v ANK”), she found the ratio of the parties’ direct contributions to be 45 (Husband) : 55 (Wife) and the ratio of the parties’ indirect contributions to be 60 (Husband) : 40 (Wife), which gave an average ratio of 52.5 (Husband) : 47.5 (Wife).26Foot Note 26×ROA Vol 1 at pp 85–87.Thereafter, the learned DJ adjusted the average ratio to 55 (Husband) : 45 (Wife) in consideration of the needs of the children and the Wife’s rent-free occupation of the matrimonial home.27Foot Note 27×ROA Vol 1 at p 87. 7 To give effect to the final ratio, the learned DJ ordered the Wife to transfer (other than by way of sale) her share and interest in the matrimonial home to the Husband, in consideration of the Husband paying into her CPF account, as a partial refund, a sum of $57,385. The moneys in the parties’ joint bank account were to be transferred to the Husband and the account closed thereafter. The parties were to retain the assets held in their respective sole names.28Foot Note 28×ROA Vol 1 at pp 87–88. 8 The learned DJ also determined the amount of maintenance for the children, and ordered the parties to contribute in proportion to their earnings.29Foot Note 29×ROA Vol 1 at p 97.The expense attributable to the children for the rental apartment that they shared with the Husband was included in the amount of maintenance payable by the Wife until such time that the matrimonial home was handed over to the Husband.30Foot Note 30×ROA Vol 1 at pp 98 and 106–107.",
        "Issues on appeal": "9 The Wife raises the following issues on appeal:31Foot Note 31×AC at para 14. (a) whether there were double counting or other errors in the computation of the pool of matrimonial assets; (b) whether the learned DJ erred in her division of the matrimonial assets in the ratio of 55 : 45 in favour of the Husband; (c) whether the learned DJ erred in her division of the matrimonial assets in ordering the Husband to retain the matrimonial home after paying $57,385 to the Wife; and (d) whether the amount of maintenance for the children ordered by the learned DJ to be paid by the Wife was reasonable.",
        "Errors in determining and valuing matrimonial assets": "10 The learned DJ used the IJ date as the operative date for determining the assets that fell within the pool of matrimonial assets, and the closest possible date to the AM hearing as the operative date for valuing the assets, except for CPF and bank account moneys, which were valued on the date of the IJ.32Foot Note 32×ROA Vol 1 at p 66.This approach accords with the authorities (ARY v ARX and another appeal[2016] 2 SLR 686 at [31];TND v TNC and another appeal[2017] SGCA 34 at [19]; andUBD v UBE[2017] SGHCF 14 at [12]–[14]) and is not disputed on appeal. In summary, the learned DJ found that the matrimonial pool comprised:33Foot Note 33×ROA Vol 1 at pp 66–79. (a) in joint names: a matrimonial home and a joint bank account; (b) in the Husband’s sole name: Bank accounts, CPF savings, an investment account and insurance policies; and (c) in the Wife’s sole name: Bank accounts, CPF savings, insurance policies and investments in equities and cryptocurrencies. Some of the assets listed above, all of which are in the Wife’s sole name, are in contention in this appeal.",
        "Parties’ cases on appeal": "79 The Wife argues that she should pay maintenance of only $858.61 and $824.44 for the older and younger child respectively, with a total of $1,683.05 for the maintenance of the two children.166Foot Note 166×AC at para 94.She contends that the learned DJ erred in using the parties’ average annual income from 2019 to 2021 in determining maintenance. Instead, she argues that the parties’ basic salaries should be used.167Foot Note 167×AC at para 80.Based on the basic salaries of the parties, the ratio for sharing the children’s expenses should be 33.5 : 66.5, with the Husband to bear the larger share.168Foot Note 168×AC at paras 80–83.Moreover, the Husband has a property in France that could be rented out, and that should be factored in to determine the Husband’s ability to provide for the children.169Foot Note 169×AC at paras 77–79. 80 The Wife also argues that the learned DJ erred when considering certain expenses expected to be incurred by the children. Firstly, the Wife asserts that the learned DJ erred in determining the expenses for the children’s tuition and extracurricular activities (being $412 and $414 per month for the elder and younger child respectively). Instead, she seeks an order that the parties are to discuss and agree on the children’s enrolment in tuition and extracurricular activities, and the parties will bear the expenses in the ordered ratio for the children’s maintenance.170Foot Note 170×AC at paras 85–87.Secondly, the Wife argues that the learned DJ erred in including expenses for medical and life insurance (being $277 and $215 per month for the elder and younger child respectively). She submits that there are no documents to prove that the children have any such insurance and the inclusion of “life insurance” suggested that the beneficiary of the policies is the Husband such that it would not be appropriate to make the Wife contribute to the policies.171Foot Note 171×AC at paras 89–92. 81 The Husband in reply contends that the children’s previous standard of living, prior to the breakdown of the marriage, is relevant in determining maintenance, and such a standard of living would necessitate higher maintenance payments.172Foot Note 172×RC at paras 74 and 81.The expenses to be incurred for the children’s activities, such as tuition and extra-curricular activities, are reasonable and will continue to be incurred for the foreseeable future.173Foot Note 173×RC at para 91.The Husband adds that the Wife had submitted higher figures in relation to the children’s expenses in earlier proceedings when she was still asking for care and control of the children but lower figures after she conceded that the Husband should get care and control of the children.174Foot Note 174×RC at paras 75–77. 82 In relation to the parties’ financial resources, the Husband asserts that he had disclosed ample information about the poor state of his French property, which demonstrated that the Husband was unable to get rental income from the property.175Foot Note 175×RC at para 82.Moreover, the Wife has failed to consider her significant financial resources and income when considering her own ability to contribute in terms of maintenance payments for the children.176Foot Note 176×RC at paras 83–85.The Husband contends that even if the Wife’s bonuses and commissions fluctuate, such income should be taken into account when considering maintenance, and any changes in the Wife’s personal circumstances can be dealt with in an application for variation of maintenance.177Foot Note 177×RC at para 86.",
        "Analysis": "83 I first consider whether the amount of maintenance ordered by the learned DJ is reasonable. Going by what the Wife had asked for the maintenance of the children before the Husband was granted sole care and control, I do not find the learned DJ’s assessment of the maintenance required by the children to be unreasonable. In this regard, I note the following observations made by the learned DJ in her Grounds of Decision:178Foot Note 178×ROA Vol 1 pp 96–97. It is also worth noting that the Defendant's position on the children's expenses varied drastically. In her OSG [Originating Summons (Guardianship of infant)] application where she was contesting the issue of care and control, she had indicated that the children’s reasonable expenses were $4,818 and $4,766 respectively on the assumption that the children were living with her. Now however where she has consented to granting care and control of the children to the Father, she takes a revised position that the children’s expenses including domestic helper but excluding household expenses should only amount to approximately $2,000 each. When questioned about the disparity in positions, the Wife’s response was that this is her assessment of what the children actually need and in the OSG application, that was the position she was taking in pleadings … 84 The Wife contends that her previous claims for maintenance for the children must be understood in the context of her seeking maintenance from the Husband who was consistently earning more than $18,000 per month.179Foot Note 179×AFS at para 14.Someone in her shoes earning less “would naturally request for a higher figure” and that “just because care and control was awarded to the Husband does not mean that the same figure should be applied the other way around”.180Foot Note 180×AFS at para 14.I am unable to agree with the Wife. In determining the maintenance that a child requires, the court will consider the needs of the child and the child’s standard of living. This will be objectively assessed and should not vary simply based on who is paying for the maintenance. I find no reason to disturb the learned DJ’s assessment of the maintenance required by the children. 85 In relation to how much each parent should contribute to the maintenance that has been assessed by the court, the law is clear that each parent is equally responsible for maintaining their child or children, and the court may order one parent to bear more of the maintenance in cases where both parents are unable to contribute equally. I refer to the oft-cited passage inTBC v TBD[2015] 4 SLR 59 (“TBC”) at [27], which provides useful guidance: … Each parent stands in the same parent-child relationship with the child or children and each parent has the duty to maintain the child or children. Against that backdrop, the starting point should be that the parents bear the financial burden equally. One parent’s burden should not be decreased just because the other parent is wealthier, and one parent’s burden should not be increased just because the other parent is less well off. However, this should not be an inflexible rule; if one parent is unable to contribute equally with the other parent, then that parent should contribute what he or she can, and the other parent should make up the shortfall, so that the child will receive the full measure of maintenance. The norm should not be that parents contribute in proportion to their means because that will place unequal burdens on them for no good reason. 86 I turn to consider the ratio in which the learned DJ ordered the parties to bear the children’s expenses with these principles in mind. 87 I first note that the learned DJ did not order the parties to make equal contributions to the maintenance of the children even though both parties are high income earners. She ordered the parties to contribute in the proportion of their average annual income, which was 55 (Husband) : 45 (Wife). The Wife is still dissatisfied because the learned DJ arrived at the proportion of the parties’ earnings using their average annual income as opposed to their average annual basic income, which would yield a ratio of 66.5 (Husband) : 33.5 (Wife). It is clear from the evidence that a significant portion of the Wife’s income accrued from commissions and bonuses. As these commissions and bonuses constitute part of the Wife’s financial resources, they should be considered when determining her ability to contribute to the maintenance for the children. There is no principled reason why commissions and bonuses should not be treated as income. 88 In relation to the Husband’s property in France, I first note that the Husband has provided some evidence showing that the property is “neither marketable nor tenantable”.181Foot Note 181×ROA Vol 3A at pp 136–137; ROA Vol 3C at p 56.The Husband refers to his voluntary discovery and interrogatories affidavit dated 7 April 2021, where, the Husband submits, he had detailed the dire state of disrepair of the property.182Foot Note 182×RC at para 82; Husband’s affidavit dated 7 April 2021 at paras 6–8 and Tabs 27–28.Secondly, and more importantly, having regard to the sum of maintenance ordered and the parties’ significant financial resources, I do not consider that any potential rent from the property in France would have a significant impact on the learned DJ’s decision as to how much of the children’s expenses each party should be expected to bear. Thirdly, the Wife has other assets which may be analogised to the Husband’s French property, and which had not been considered when calibrating the Wife’s ability to pay maintenance. For instance, there is some evidence that the Wife has assets in Malaysia that are not part of the matrimonial pool.183Foot Note 183×ROA Vol 3A at p 23; RC at para 83.The Wife’s personal assets have also increased now as a result of the revisions made earlier in this judgment to exclude some of the Wife’s assets from the matrimonial pool. As a matter of parity, if the Husband’s French property is considered in determining his maintenance contributions, then the Wife’s personal assets should also be factored in. Therefore, even if the Husband’s French property could be rented out, I am not satisfied that this would increase the financial resources of the Husband,relative to the Wife’s, to such an extent that the learned DJ’s decision on maintenance for the children should be disturbed. 89 I will next deal with the specific items disputed by the Wife, namely, the expenses related to the tuition and extracurricular classes, and the insurance coverage. 90 As regards the Wife’s argument on the tuition and extracurricular expenses, I find that she has not shown how the learned DJ has erred. I note that the Wife acknowledges that tuition and extracurricular activities serve the function of “educating and equipping the children to ensure that they are future-ready”.184Foot Note 184×AC at para 86.The expenses for the children’s tuition and extracurricular activities fixed by the learned DJ are not excessive in the circumstances of this case. As for the Wife’s contention that the parties should first agree on specific tuition activities and that she would then contribute 33.5% for the agreed activities, I am not persuaded that the arrangement is practical given the acrimony between the parties. There comes a point when a court-imposed requirement for consultation and agreement on smaller details in day-to-day life may lead to unnecessary friction or even deadlock. There is, in any event, nothing in the learned DJ’s order to stop the Husband and the Wife from discussing the types of tuition and extracurricular activities that the children might be enrolled in as their needs and interests evolve. 91 Finally, in respect of the Wife’s argument on the children’s medical and life insurance policies, I find the insurance coverage for the children to be a reasonable expense and the amounts are also reasonable. The expenses for the children’s insurance coverage as fixed by the learned DJ is also commensurate with the Wife’s own estimates in the affidavits that she filed for the Originating Summons (Guardianship of infant) hearing.185Foot Note 185×Wife’s Affidavit dated 27 February 2020 at pp 44 and 49; Wife’s Affidavit dated 2 July 2020 at pp 283 and 285; ROA Vol 1 at pp 92 and 95.The learned DJ is therefore not wrong to have allowed them. I note that the Husband has since provided details of the children’s medical and life insurance policies to the Wife.186Foot Note 186×Respondent’s Further Written Submissions dated 15 December 2022 at Annex B. 92 For the above reasons, I decline to disturb the learned DJ’s orders on maintenance for the children.",
        "Concessions by the Parties": "25 At the hearing before me on 8 December 2022, both the Wife and the Husband made various concessions in respect of the assets in Table 1. (a) The Husband agreed with the Wife that:75Foot Note 75×Minutes of hearing on 8 December 2022. (i) Item 1 should be excluded from the pool of matrimonial assets, while Item 2 should remain, as there was double-counting, since the moneys in the account in Item 1 were transferred to the account in Item 2. (ii) Items 4 and 5 should be excluded from the pool of matrimonial assets, while Item 3 should remain. In relation to Items 3 and 4, there was double-counting, since a portion of the moneys in the account in Item 3 was used to purchase the investment in Item 4. (b) The Wife withdrew her appeal in respect of Items 9 and 10, as she had made an error in the identification of the relevant date for the valuation of the assets.76Foot Note 76×Minutes of hearing on 8 December 2022.I note that the Wife’s concession was rightly made, as the correct method for valuing insurance policies is to take the surrender value of the insurance policies as at the date of the ancillary matters hearing, or any other date agreed by the parties (UTS v UTT[2019] SGHCF 8 at [19]). 26 The court will step in to correct computational errors in appropriate instances, particularly where both parties are agreed that such errors exist(TOT v TOU and another appeal and another matter[2021] SGHC(A) 9at [3]). Accordingly, I order Items 1, 4 and 5 to be excluded from the pool of matrimonial assets as agreed by the parties, and Items 2, 3, 9 and 10 are to stand as ordered by the learned DJ. 27 I turn to deal with Items 6, 7 and 8, which remain disputed.",
        "Disputed Assets": "28 I first examine the evidence that the Wife relies on before turning to make some observations regarding a party deviating from the position in the Joint Summary. Analysis (1) Item 6: Tokenize Exchange Account 29 For Item 6, the Wife’s Tokenize Exchange Account, the Wife asserts on appeal that: (a) the account did not exist as at the IJ date; and (b) there was double counting in that moneys from the CIMB Fixed Deposit Account (Item 3 in Table 1) were used to fund the Tokenize Exchange Account.77Foot Note 77×AC at para 23 (S/No 6 in table). 30 In relation to the contention that the Tokenize Exchange Account was created after the IJ date, the only piece of evidence the Wife refers to is an e-mail from Tokenize dated 3 December 2020 which states:78Foot Note 78×ROA Vol 3D at p 629. … Your identity verification is successful. Your membership has been updated toNormal. Deposit your funds to buy cryptocurrencies. Here is a guide. … [emphasis in the original] 31 The e-mail only shows that the membership of the account holder had been updated to “Normal”. That appears to suggest that the membership existed before the date of the e-mail and was updated on the date of the e-mail. It is, however, unclear what the status of the account was before the “update” and what it means to have one’s membership updated to “Normal”. More specifically, there is no indication that the account did not exist as at the date of the IJ, as alleged by the Wife. There is also no evidence on the circumstances under which such an email would be sent by Tokenize Exchange and what it means insofar as the status of the membership is concerned. 32 In relation to the contention that the Tokenize Exchange Account was funded using moneys from the CIMB Fixed Deposit Account (Item 3 in Table 1), the Wife asserts that the following transactions took place:79Foot Note 79×AC at para 23 (S/No 3 in table). (a) The fixed deposit in CIMB Fixed Deposit Account amounting to $50,927.53 was redeemed on 2 October 2020. (b) The $50,927.53 was transferred to a CIMB FastSaver Account, then to a CIMB StarSaver Account, and then to a Citibank Step-Up Account. (c) On 16 November 2020, $10,000 was transferred from the Citibank Step-Up Account to the Wife’s DBS MyAccount. (d) From the DBS MyAccount, (i) $5,000 was transferred into the Tokenize Exchange Account on 13 December 2020; and (ii) $5,000 was transferred into the Tokenize Exchange Account on 22 December 2020. 33 After considering the documents presented by the Wife, I find that the Wife did not adduce sufficient evidence necessary to support her assertion that a total of $10,000, traceable from the CIMB Fixed Deposit Account, was transferred into the Tokenize Exchange Account. The Wife has produced a bank statement dated 31 December 2020 for her DBS MyAccount, which shows a $5,000 withdrawal on 13 December 2020 and a $5,000 withdrawal on 22 December 2020 for “Investment & Securities”,80Foot Note 80×ROA Vol 3A at pp 50–51.and has relied on that bank statement as proof of the source of the funds in her Tokenize Exchange Account. There is, however, no document from DBS to show that the funds were transferred to the Tokenize Exchange Account. Given the Wife’s somewhat prolific investment activities, it is unclear whether the moneys from the DBS MyAccount withdrawn for “Investment & Securities” had been used to fund other investments and buy other securities, or the ones in the Tokenize Exchange Account. I am therefore unable to conclude, from the evidence available, that the Wife's Tokenize Exchange Account was funded using moneys from the CIMB Fixed Deposit Account (Item 3 in Table 1). (2) Item 7: Blockfi Account 34 For Item 7, the Wife’s Blockfi Account, the Wife refers to her Blockfi Account statement for January 202181Foot Note 81×ROA Vol 3D at p 630.and what appears to be transaction records.82Foot Note 82×ROA Vol 3D at pp 625–628.According to the Wife, a comparison of the sums in the account statement against those in the transaction records, as well as reference to the transaction dates in the transaction records, gives rise to an inference that the transactions started only shortly before January 2021, and therefore the account was opened after the IJ date, which was 3 September 2020. 35 I find the evidence to be similarly lacking. The transaction records and statement from Blockfi show that there were transactions in January 2021. Nowhere in the Blockfi Account statement for January 2021 does it indicate that the Blockfi Account was opened only in January 2021. Similarly, while the transaction records may indicate that there were transactions involving the Blockfi Account in January 2021, the transaction records do not state that there were no transactions involving the Blockfi Account before January 2021. It is incumbent on the Wife to produce proper evidence, such as a confirmation or statement to prove what seems to be a straightforward matter of when the Blockfi Account was opened. The Wife did not produce such evidence. (3) Item 8: Binance Account 36 For Item 8, the Wife’s Binance Account, the Wife refers to an e-mail dated 20 January 2021 from Binance which states:83Foot Note 83×ROA Vol 3D at p 707. … Your Advanced Verification has been approved. Your Binance account can now: Withdraw cryptocurrency up to a 100 BTC value per day. Buy crypto instantly … To further increase these account limits, you can perform Address Verification by … The Wife also points to what appears to be records of her transactions with Binance.84Foot Note 84×ROA Vol 3D at p 628. 37 I also view these documents as insufficient evidence to prove that the Binance Account did not exist as at the date of the IJ and was not a matrimonial asset. The e-mail from Binance does not indicate that the Binance account did not exist as at the IJ date. All the e-mail shows is that the account holder’s “Advanced Verification” had been approved and that the Binance account had the capabilities listed. In fact, the existence of an “Advanced” verification suggests that there may well be another verification status that had already existed before. As for the transaction records, while they may indicate that there were transactions involving the Binance account in March and April 2021, the transaction records do not state that there were no transactions involving the Binance Account before then. 38 Having examined the available evidence, I find no reason to disturb the learned DJ’s decision in holding that the accounts in Items 6, 7 and 8 in Table 1 were matrimonial assets, with the values attributed to them by the learned DJ. The Joint Summary 39 My evaluation of the evidence in the section above is sufficient for disposing the appeal in respect of the disputed assets, but it is apposite that I make some observations here on the use of the Joint Summary in the determination of ancillary matters. 40 The arguments of the Wife in relation to the Tokenize Exchange Account and Blockfi Account (Items 6 and 7 in Table 1) are not entirely “new points” as such. In her affidavit filed on 9 June 2021 in response to an order for discovery, the Wife stated that these accounts were opened in December 2020.85Foot Note 85×ROA Vol 3D at p 430.The Wife, however, took another position in the third and final Joint Summary that was submitted to the court86Foot Note 86×ROA Vol 3D at pp 173–174.and at the AM hearing before the learned DJ.87Foot Note 87×ROA Vol 1 at pp 44–45.At the AM hearing, the court explicitly asked the Wife’s former counsel to articulate the Wife’s position on the Tokenize Exchange Account and Blockfi Account, and said counsel did not dispute that the Tokenize Exchange Account and Blockfi Account should be included in the pool of matrimonial assets; instead, he explicitly confirmed that they should be valued at $12,168.90 and $69,594.60 respectively.88Foot Note 88×ROA Vol 1 at pp 44–45.In relation to the Binance Account (Item 8 in Table 1), from the third and final Joint Summary89Foot Note 89×ROA Vol 3D at p 174.and the submissions of the Wife’s former counsel at the AM hearing,90Foot Note 90×ROA Vol 1 at p 45.the dispute then was over the quantification of the value of the account, instead of whether the account existed as of the IJ date. 41 It has been noted above, at [22], that the parties acknowledge the Joint Summary to set out their “binding position”. The statement, “[t]he [Plaintiff/Defendant] accepts the Joint Summary to be [his/her] binding position”, was inserted into the Joint Summary form through Amendment No. 2 of 2020 to the Family Justice Courts Practice Directions, which amended the form prescribed by Amendment No. 1 of 2016. The fact that the Joint Summary involves an acceptance by the parties that it represents his or her binding or final position has been acknowledged by the General Division of the High Court (see, for example,VPH v VPI[2021] SGHCF 22 at [14];WAS v WAT[2022] SGHCF 7 at [3]). 42 The Joint Summary facilitates the fair disposal of the disputes between the parties and serves to avoid protracted litigation and unnecessary delays. The parties are put on ample notice by the words on the face of the Joint Summary that the position they take will be relied upon by the court in coming to its decision. Every effort should be made by the parties and their counsel to ensure that the Joint Summary is clear and accurate. This is so that each party will be able to treat the position stated by the other party as the final position and respond to it as such. The court will, in turn, consider the positions taken by the parties and arrive at a decision in reliance on the Joint Summary. This whole process is aimed at helping the parties save costs and time, and at making the best use of scarce judicial resources and public moneys to achieve a fair outcome in every case. In the final analysis, it is in the interests of the parties and their families to put an end to their differences without unnecessary delay and litigation. Therefore, where the parties have stated their binding positions in the Joint Summary and the court has relied on those positions, there is a strong reason to hold the parties to their signed binding positions (as modified or supplemented by any considered positions taken at the AM hearing) in the interests of certainty and finality. While an appellate court, as noted above at [17]–[19], may allow new points to be raised on appeal in an appropriate case, even if the points represent a substantial departure from the position taken below, the party who has been granted leave to raise the new points must still address the issue of why the party should be allowed to deviate from a signed binding position taken in the Joint Summary. Departures from the Joint Summary that lead to re-litigation will otherwise be treated with reservation by the court. 43 In this case, the Wife did not adequately explain why she is taking a different position from that taken in the third and final Joint Summary for Items 6, 7 and 8 in Table 1. My decision to affirm the learned DJ’s decision with respect to those disputed items is therefore further fortified as the Wife did not offer any cogent reason to persuade the court that she should not be held to the binding position signed by her former solicitors. 44 To summarise, the learned DJ’s decision in respect of Items 1 to 10 remains undisturbed, save that Items 1, 4 and 5 are to be taken as personal assets of the Wife and excluded from the pool of matrimonial assets by consent of the parties. The total value of Items 1, 4 and 5, as tabulated in Table 1 and as determined by the learned DJ,91Foot Note 91×ROA Vol 1 at pp 75–76.is $7,918.33 + $9,982.80 + $85,172.99 = $103,074.12. The learned DJ had determined the value of the Wife’s assets that constituted part of the pool of matrimonial assets to be $847,190.90. After deduction of the values of Items 1, 4 and 5, the correct sum for the Wife’s assets that constitute part of the matrimonial pool is $744,116.78.",
        "Ratio for division of the matrimonial assets": "45 I turn to the issue of the division of the matrimonial assets.",
        "Decision below": "78 The learned DJ determined the monthly expenses of the elder child to be $4,450 (including rent) and $3,250 (excluding rent) and that of the younger child to be $4,290 (including rent) and $3,090 (excluding rent).163Foot Note 163×ROA Vol 1 at p 96.The learned DJ determined that parties were to share the expenses in proportion to their earnings, which was 55 (Husband) : 45 (Wife).164Foot Note 164×ROA Vol 1 at p 97.She thus ordered the Wife to pay to the Husband maintenance for the two children as follows: for the elder child, $2,000 prior to handover of the matrimonial home and $1,460 after handover; for the younger child, $1,930 prior to handover of the matrimonial home and $1,390 after handover.165Foot Note 165×ROA Vol 1 at p 107.",
        "Retention of the matrimonial home by the Husband": "64 I turn to the issue of the learned DJ’s order for the Husband to retain the matrimonial home.",
        "Maintenance for the children": "77 I turn finally to the issue of maintenance for the children.",
        "Conclusion and orders made": "93 I summarise my orders as follows: (a) The learned DJ’s decision in respect of Items 1 to 10 in Table 1 remains undisturbed, save that Items 1, 4 and 5 are to be excluded from the pool of matrimonial assets. (b) The final ratio for division of the pool of matrimonial assets remains as 55 : 45 in favour of the Husband. (c) The Husband is to retain the matrimonial home on the terms ordered by the learned DJ in relation to the division of matrimonial assets,187Foot Note 187×FC/ORC 1571/2022.save that – (i) the Wife is to transfer (other than by way of sale) her share and interest in the matrimonial home, free from encumbrances, and deliver vacant possession of the matrimonial home, to the Husband within three months of this judgment; (ii) The Husband is to pay into the Wife’s CPF account a sum of $114,219.04, being part of the CPF refund. (d) The orders of the learned DJ for the maintenance of the children are to stand. 94 I urge the parties to start working together on the issues that they may face to bring closure to this chapter of their lives, including the issue of costs of this appeal. I hope that the parties can come to an amicable resolution but will hear the parties separately on the issue of costs if they are unable to come to an agreement. Teh Hwee HweeJudicial Commissioner Lee Ming Hui Kelvin and Ong Xin Ying Samantha (WNLEX LLC) for the appellant; Poonam Lachman Mirchandani and Chugani Ashok Kan (Mirchandani & Partners) for the respondent.",
        "": ""
    }
}