{
    "case_title": "Hiap Seng Building Construction Pte Ltd vHock Heng Seng Contractor Pte Ltd",
    "ncitation": "[2024] SGHC 50",
    "coram": "Wong Li Kok, Alex JC",
    "sections": {
        "Introduction": "1 This was an application under s 27 of the Building and Construction Industry Security of Payment Act 2004 (2020 Rev Ed) (the “SOPA”) (read with O 36 r 3 of the Rules of Court 2021) to set aside the Adjudication Determination dated 18 October 2023 (the “Determination”) in Adjudication Application No. SOP/AA199 of 2023 (the “Adjudication”), and by extension, the Order of Court (DC/ORC 2721/2023) dated 6 November 2023 made in DC/OA 178/2023 granting the respondent leave to enforce the Determination in the same manner as a judgment or order of the court. 2 The key issue the application sought to address was whether a defective payment response should lead to the setting aside of an adjudication determination under the SOPA. In the same vein, I also had to determine if the party issuing a defective payment response was estopped from relying on its own defective payment response to set aside an adjudication determination.",
        "Facts": "3 The applicant was the main contractor for a project to build a residential apartment (the “Project”).1Foot Note 1×Affidavit of Yuen Ee Siong dated 22 November 2023 (“YES”) at para 6.Pursuant to a sub-contract between the applicant and the respondent (the “Sub-contract”), the respondent was engaged as the sub-contractor for the Project.2Foot Note 2×YES at para 6.For avoidance of doubt, unless indicated otherwise, all references to the “respondent” refers to the party in this setting aside application (as opposed to a respondent in an adjudication under the SOPA). 4 On 5 July 2023, the respondent served its Payment Claim No. 15 (the “Payment Claim”) on the applicant for completed works.3Foot Note 3×YES at para 7.On 27 July 2023, the applicant submitted a document labelled “Progress Payment certificate No. : 02 for claim no. 15” (the “Payment Response”) to the respondent, certifying the total value of works carried out as S$15,758.51 (exclusive of GST) and S$16,861.60 (inclusive of GST).4Foot Note 4×YES at p 165.The respondent then issued to the applicant a tax invoice dated 1 August 2023 for the sum of S$16,861.61 (inclusive of GST) (the “Tax Invoice”).5Foot Note 5×YES at para 9. 5 On 7 August 2023, the applicant issued to the respondent the final accounts for the Sub-contract and the Project.6Foot Note 6×YES at para 10.This confirmed the total value of works carried out as S$15,758.51 (exclusive of GST).7Foot Note 7×YES at p 659.Having not received payment nor any other response from the applicant on the Tax Invoice, on 8 September 2023, the respondent commenced the Adjudication against the applicant pursuant to s 12(1) of the SOPA which provides that a claimant is entitled to make an adjudication application if there is non-payment of the accepted response amount.8Foot Note 8×YES at para 12.In the adjudication application lodged by the respondent for the Adjudication (the “Adjudication Application”), the respondent sought a sum of S$16,861.61 (inclusive of GST) on the basis that the applicant had failed to pay the sum certified in the Payment Response.9Foot Note 9×YES at para 12.The applicant subsequently filed its adjudication response on 18 September 2023 (the “Adjudication Response”).10Foot Note 10×YES at para 13. 6 In the Determination, the Adjudicator ruled in favour of the respondent and determined that the applicant shall pay the sum of S$17,019.19 (inclusive of GST) (the “Adjudicated Amount”) to the respondent.11Foot Note 11×YES at p 35.This consisted of a determined amount of S$15,758.51 and an amount of S$1,260.68 representing 8% GST on the determined amount.12Foot Note 12×YES at p 35.The Adjudicator noted that the Adjudicated Amount differed from the amount of S$16,861.60 in the Payment Response because the latter had computed the GST amount as S$1,103.10, when 8% GST was S$1,260.68.13Foot Note 13×YES at p 35.",
        "The parties’ cases": "",
        "The applicant’s case": "7 The applicant sought to set aside the Determination under s 27(6)(d) of the SOPA (“the adjudication application … was not made in accordance with the provisions of this Act”) and s 27(6)(e) of the same (“the adjudicator failed to comply with the provisions of this Act in making the adjudication determination”). There were two grounds raised by the applicant: (a) First, the Payment Response was not a valid payment response within the meaning of the SOPA.14Foot Note 14×YES at para 5.1. (b) Second, the Adjudicator actedultra viresin awarding the Adjudicated Amount which was greater than what was claimed by the respondent.15Foot Note 15×YES at para 5.2. 8 On the first ground, the applicant contended that there was no express provision in the Sub-contract as to the date or period for the service of a payment claim. That being the case, s 10(3)(b) of the SOPA (read with s 10(2)(a)(ii) of the same and regs 5(1) and 5(3) of the Building and Construction Industry Security of Payment Regulations (2006 Rev Ed) (the “SOPR”)) would deem the Payment Claim served on 5 July 2023 to have been served on the last day of the calendar month in which it was actually served,ie, 31 July 2023.16Foot Note 16×Applicant’s Written Submissions dated 8 December 2023 (“AWS”) at para 6.2. 9 Based on the applicant’s case, it then follows that the Payment Response served by the applicant on 27 July 2023 could not have been a valid payment response under s 11(1)(b) of the SOPA which requires a respondent named in a payment claim to respond to “a payment claim served”, since there cannot be a payment response before a payment claim comes into being.17Foot Note 17×AWS at para 6.3.In the absence of a valid payment response, the respondent’s entitlement to lodge an adjudication application did not arise under s 12(1) of the SOPA.18Foot Note 18×AWS at para 6.4.2.The Adjudication Application could not have been validly made, as required under s 13(3)(a) of the SOPA, within 7 days “after the entitlement … to make an adjudication application [arose] under section 12”.19Foot Note 19×AWS at para 6.4.3.As the Adjudication Application was not made in accordance with the provisions of the SOPA, this engaged s 27(6)(d) of the SOPA.20Foot Note 20×AWS at para 6.4.5.Further, by failing to reject the flawed Adjudication Application under s 16(3) of the SOPA which requires an adjudicator to reject an adjudication application not made in accordance with s 13(3)(a) of the SOPA, the Adjudicator did not comply with the provisions of the SOPA, and this engaged s 27(6)(e) of the SOPA.21Foot Note 21×AWS at para 6.4.6. 10 Relatedly, the applicant argued that the doctrine of estoppel as set out inAudi Construction Pte Ltd v Kian Hiap Construction Pte Ltd[2018] 1 SLR 317 (“AudiConstruction”) did not apply. It was not estopped from arguing the invalidity of the Payment Response because it made no representation as to its position on the defective Payment Response. WhileAudi Constructionnoted that silence may amount to an unequivocal representation where there was a duty to speak, the applicant raised the defect of the Payment Response on the first occasion that it could under the SOPA (ie, in its Adjudication Response). It thus complied with its duty to speak. 11 In relation to the second ground, the applicant relied onRong Shun Engineering & Construction Pte Ltd v CP Ong Construction Pte Ltd[2017] 4 SLR 359 (“Rong Shun”)to argue that the scope of the Adjudicator’s jurisdiction was framed by the response amount stated in the Payment Response and accepted by the respondent in its Adjudication Application.22Foot Note 22×AWS at para 55.Accordingly, the Adjudicator actedultra viresin determining a higher Adjudicated Amount on his own accord.23Foot Note 23×AWS at para 56.",
        "The respondent’s case": "12 Regarding the validity of the Payment Response, the respondent counter-argued that the SOPA does not invalidate a payment response that predates the deemed service date of a payment claim, as s 11(1)(b) of the SOPA serves as adeadlinefor the service of a payment response (as opposed to a start date).24Foot Note 24×Respondent’s Written Submissions dated 7 December 2023 (“RWS”) at para 17.This meant that while the deadline for serving the Payment Response only started running after the deemed date of service of the Payment Claim,25Foot Note 25×RWS at para 19.the Payment Response could be validly served starting from theactualdate of service of the Payment Claim (irrespective of thedeemeddate of service). According to the respondent, this interpretation was consistent with the legislative intent of the SOPA, which is to facilitate cashflow by achieving a quick and efficient resolution to payment disputes in the construction industry.26Foot Note 26×RWS at paras 25-26. 13 On estoppel, the respondent argued that the applicant’s early service of the Payment Response (which the applicant argued is invalid), together with the applicant’s subsequent silence, amounted to an unequivocal representation that the applicant would not exercise its right to serve a payment response until after the Payment Claim was deemed served.27Foot Note 27×RWS at para 32(a)-(b).In other words, the applicant was estopped from relying on its own invalid Payment Response as a ground for setting aside the Determination. The applicant had a duty to speak when it had to serve its Payment Response or when the Tax Invoice was issued, but the applicant continued to stay silent.28Foot Note 28×RWS at paras 32(c).As a result, the respondent missed the opportunity to submit an adjudication application premised upon the lack of a payment response.29Foot Note 29×RWS at paras 32(c).The applicant was thus estopped from invalidating the Determination based on the defective Payment Response. 14 Finally, the respondent contended that the sum stated in the Payment Response, the Tax Invoice and the Adjudication Application was incorrect, as there was a mathematical error in calculating the GST amount.30Foot Note 30×Affidavit of Ng Chee Hock dated 6 December 2023 at para 21.The 8% GST on the certified sum of S$15,758.51 ought to have been reflected as S$1,260.68 and not S$1,103.10. Relying also onRong Shunand additionally on ss 17(4)(c), 17(4)(d) and 17(4)(h) of the SOPA (which provides that an adjudicator may consider, amongst others, the documents filed for the adjudication and any other relevant matter), the respondent argued that it was within the power of the Adjudicator to make arithmetical corrections and award a higher (and correct) sum to the respondent.31Foot Note 31×RWS at paras 36-38.",
        "Issues to be determined": "15 The issues to be determined are as follows: (a) whether the Payment Response was valid;(b) whether the applicant was estopped from challenging the Determination based on the invalidity of the Payment Response; and(c) whether the Adjudicator actedultra viresin awarding the Adjudicated Amount.",
        "Issue 1: The Payment Response was invalid": "16 It was undisputed that the Sub-contract did not prescribe the date of service of a payment claim. In such cases, s 10(2)(a)(ii) of the SOPA provides that a payment claim must be served “not later than … the date prescribed for the purpose of this subsection if the contract does not contain such terms”. The prescribed date for the purposes of s 10(2)(a)(ii) of the SOPA is in regs 5(1) and 5(3) of the SOPR which provide that: 5.—(1)  Where a contract does not contain any provision specifying the time at which a payment claim must be served or by which such time may be determined, then a payment claim made under the contract must be served by the last day of — (a) the month following the month in which the contract is made; or (b) subsequent month. … (3) In this regulation, “month” means a period of time beginning on the first day of each of the 12 calendar months into which a year is divided, and ending on the last day of each of these months. 17 Reading s 10(2)(a)(ii) of the SOPA and regs 5(1) and 5(3) of the SOPR together, a payment claim under the Sub-contract must be served not later than the last day of the calendar month. Section 10(3)(b) of the SOPA states that “a payment claim that is served before the prescribed date mentioned in subsection 2(a)(ii) is deemed to have been served on that date.” The effect of these sections has been explained inAsia Grand Pte Ltd v A I Associates Pte Ltd[2023] SGHC 175 (“AsiaGrand”) at [35]: … Accordingly, the effect of ss 10(2)(a)(ii) and 10(3)(b) is that if the contract does not contain terms that specify, or provide for the determination of, a service date or service period,then any payment claim will be deemed to have been served on the last day of the calendar month in which it was served, regardless of when it was actually served. [emphasis added] 18 That being the case, the Payment Claim which was actually served on 5 July 2023 would be deemed to have been served on 31 July 2023 under the SOPA. This was not disputed by the parties. It was also not in dispute that the Sub-contract does not provide the date of service of a payment response. Section 11(1)(b) of the SOPA sets out the default timeline for the submission of a payment response in such situations: 11.—(1)  A respondent named in a payment claim served in relation to a construction contract must respond to the payment claim by providing, or causing to be provided, a payment response to the claimant — … (b) where the construction contract does not contain such provision,within 14 days after the payment claim is served under section 10.  [emphasis added] 19 The natural reading of s 11(1)(b) of the SOPA is that a payment response must be servedstartingfrom the date “after the payment claim is served under section 10” (which is deemed to be the last day of the calendar month pursuant to s 10(3)(b) of the SOPA) and before theendof 14 days from that deemed service date of a payment claim. The respondent’s proposed interpretation – that s 11(1)(b) of the SOPA only provides a deadline for the submission of a payment response as opposed to a period of time within which a payment response must be served (see above at [12]) – is inconsistent with the ordinary meaning of the word “within”. 20 Where the Parliament intended to only stipulate an end date, this is made clear in the language of the SOPA. For instance, s 11(2) of the SOPA requires any payment response in relation to a supply contract to be served “bythe due date” [emphasis added]. Another example is s 10(2)(a)(ii) of the SOPA (see above at [16]) which uses the phrase “not later than”. The finding that s 11(1)(b) of the SOPA contemplatesboththe start date and the end date for the service of a payment response is supported by the explanation by the then Minister of State for National Development, Mr Zaqy Mohamad, at the Second Reading of the SOPA Amendment Bill on 2 October 2018, and his explanation is helpfully summarised inAsia Grandat [41]: … the respondent’s deadline for the payment response will onlystart running fromthe date stipulated in the contract for service of payment claims or from the last day of the service period … [emphasis added] 21 I disagreed with the respondent that a strained reading of s 11(1)(b) of the SOPA is necessary to uphold the overall intent of the SOPA to promote cashflow efficiency in the construction industry. Strict compliance with the timelines laid out by the SOPA is as much part of the driving force behind the SOPA as promoting cashflow efficiency. This is because adherence to the SOPA timelines is what facilitates the legislative intent of cashflow efficiency. As noted inAsia Grandat [1]: [SOPA] was enacted to introduce a regime for interim payments and a procedure to resolve payment disputes that facilitate cash flow in the construction industry. The legislative purpose is achieved by creating a statutory scheme for payment for work done or materials supplied that iseffected“through an expeditious process that requires strict adherence to timelines”: see the High Court decision ofLibra Building Construction PteLtd v Emergent Engineering Pte Ltd[2016] 1 SLR 481 … [emphasis added] 22 In that regard, the applicant’s interpretation of s 11(1)(b) of the SOPA would better cohere with the purpose of the SOPA to provide consistent and fixed timelines for the service of payment claims and payment responses. The following passage fromAsia Grandis particularly apposite (at [42]): … In the context of a contract like the present one, wherein the parties do not stipulate timelines for the service of payment claims or payment responses, it is reasonable for the respondent's deadline for payment response to be fixed to run only from the last day of the calendar month.This provides certainty for the respondent and helps to facilitate the timely service of payment responses. A payment process that keeps to regular timelines that run from a consistent day in each month keeps the SOPA mechanism running smoothly, prevents the missing of deadlines due to inadvertence, and minimises disputes.As a corollary, this also relieves a respondent from the need to constantly keep track of payment claims that are not served according to any stipulated contractual timelines. [emphasis added] 23 Adopting the applicant’s reading of the SOPA, I agreed that the Payment Response submitted on 27 July 2023 predated the deemed date of service of the Payment Claim and was hence defective within the meaning of s 11(1)(b) of the SOPA. 24 For completeness, I noted the applicant’s argument that the Payment Response was merely a “purported” or draft payment response and should not have been taken by the respondent as a payment response at all.32Foot Note 32×YES at para 8.Looking at the correspondence between the parties during the time the Payment Response was sent and received, there was no indication by the applicant that the Payment Response was merely a draft, even after the issuance of the Tax Invoice.33Foot Note 33×YES at pp 656-658.The Adjudicator also noted that there was no evidence that parties have discussed or wished to discuss further on the Payment Response.34Foot Note 34×YES at p 31.It was immaterial that the Payment Response was unsigned, as there is no requirement under the SOPA for a payment response to be signed.35Foot Note 35×YES at p 30.I agreed with the Adjudicator and found that the Payment Responsewasintended to be a payment response.",
        "Issue 2: The applicant was estopped from challenging the invalid Payment Response": "",
        "The entire Determination was not tainted by the invalid Payment Response and/or the Adjudicator’s flawed ruling on its validity": "25 Before addressing estoppel, two further preliminary points had to be addressed: (a) first, whether the invalid Payment Response invalidated the entire Determination; and (b) second, whether the Adjudicator’s flawed ruling on the validity of the Payment Response tainted the entire Determination. 26 I answered both in the negative, as elaborated below. 27 I concluded that the invalid Payment Response did not taint the entire Adjudication. This defect only interfered with the Adjudicator’s substantive jurisdiction, but not his threshold jurisdiction. The latter would render the Adjudication invalidab initio. As the Adjudicator’s threshold jurisdiction remained intact, the estoppel doctrine was free to operate. 28 As explained by the Court of Appeal inGrouteamPte Ltd v UES Holdings Pte Ltd[2016] 5 SLR 1011 (“Grouteam”) at [49], there are certain procedural defects that are so fundamental that they go towards an adjudicator’s threshold jurisdiction. These render the adjudication determination null and void from the outset: …[A]n adjudicatorwould not have been validly appointedif there was in fact no paymentclaim or no service of a payment claim. In such a case, there would be no basis at all to appoint an adjudicator, and any such appointment would be void and without effect in law. This is a consideration of the adjudicator’s jurisdiction at thethresholdbecausewithout a payment claim or service of such a claim, there is no basis at all for an adjudicator to be appointed in the first place. [emphasis in original in italics; emphasis added in bold italics] 29 Other than a situation where there was no payment claim or no service of a payment claim, an adjudicator may also be found to have no threshold jurisdiction if a payment claim fell outside the purview of the SOPA from the outset (Far East Square Pte Ltd v Yau Lee Construction (Singapore) Pte Ltd[2019] 2 SLR 189 (“FarEast”) at [67]). Examples of such payment claims include those made pursuant to contracts that are excluded from the scope of SOPA under s 4 (Far Eastat [60]). 30 By contrast, where a purported payment claimhasbeen served but is defective by reason of non-compliance with the SOPA, “it would go to the adjudicator’ssubstantivejurisdiction” [emphasis in original] (Grouteamat [49]). However, the appointment of the adjudicator remains valid, and the adjudicator’s threshold jurisdiction remains unaffected. Nonetheless, the adjudication determination may be liable to be set aside if there has been a breach of the SOPA that would warrant the invalidation of the entire adjudication (Grouteamat [50]). 31 In the present case, the invalid Payment Response would fall under the category of cases where only the substantive jurisdiction of the adjudicator is impugned. InFarEastat [57], the Court of Appeal drew a distinction between “(a) an invalid and/or invalidly served payment claim; and (b) a payment claim that is outside the ambit of the SOPA from the outset”. Similarly, the Payment Response which did not satisfy s 11(1)(b) of the SOPA would amount to an invalid payment response, but one which still fell within the scope of the SOPA. This procedural defect would only go towards the Adjudicator’s substantive jurisdiction, with his threshold jurisdiction still intact. That being the case, even though I disagreed with the Adjudicator’s reasoning on the validity of the Payment Response, the estoppel doctrine could still operate to prevent the applicant from making submissions on the defects of the Payment Response. 32 As to the second preliminary issue, I found that the Adjudicator’s erroneous decision on the validity of the Payment Response did not taint the entirety of the Determination. Under s 27(8)(a) of the SOPA, the court in a proceeding to set aside an adjudication determination may set it aside “in whole or in part”. In the present case, the parts of the Determination that address the early service of the Payment Response are confined to specific paragraphs that are isolated from the other issues.36Foot Note 36×YES at pp 31-32 and 34 at paras 42-45, 47(c) and 48-50.Accordingly, those paragraphs can be severed and set aside without affecting the flow and coherence of the rest of the Determination.",
        "The requirements of estoppel were satisfied": "33 I agreed with the respondent that the applicant was estopped from challenging the Determination on the basis of its invalid Payment Response. 34 The elements of an estoppel in the SOPA context are set out inAudi Constructionat [57]: … It requires unequivocal representation by one party that he will not insist upon his legal rights against the other party, and such reliance by the representee as will render it inequitable for the representor to go back upon his representation … 35 Crucially, mere silence or inaction by a party will not normally amount to an unequivocal representation, unless there is a duty to speak (Audi Constructionat [61]). When this duty to speak may arise was explained in some detail inAudi Constructionat [61]–[62]: 61 … [W]hether there is a duty to speak is a question which must be decided having regard to the facts of the case at hand and the legal context in which the case arises. …The expression “duty to speak” does not refer to a legal duty as such, but to circumstances in which a failure to speak would lead a reasonable party to think that the other party has electedbetween two inconsistent rights or will forbear to enforce a particular right in thefuture, as the case may be. We emphasise that this is not the subjective assessment of the other party but an objective assessment made by reference to how a reasonable person apprised of the relevant facts would view the silence in the circumstances, though unsurprisingly, the parties’ relationship and the applicable law which governs it will be a critical focus of the court’s assessment of whether those circumstances exist. 62 … In the context of an adjudication under the Act, a claimant and respondent are parties to a contract, on which the regime of the Act is superimposed. The contract and the Act define the rights the parties have in relation to each other. In our view,these are rights which are in principle capable of being elected and whose exercise is capable of being forborne. [emphasis added] 36 Counsel for the applicant argued that the submission of the Payment Response could not have amounted to an unequivocal representation as to the applicant’s position on the invalid Payment Response. This was based on s 11(4) of the SOPA which provides that a submitted payment response may be varied, provided that the varied payment response is submitted by the date or within the period that a payment response is to be served under s 11(1) of the SOPA, or within the dispute settlement period under s 12(5) of the SOPA. In other words, despite having served the Payment Response, the applicant was still entitled to serve another payment response prior to the stipulated deadline. Hence, contrary to the respondent’s argument, the Payment Response was not an unequivocal representation that the applicant would “forbear to exercise its right not to serve a payment response until after a payment claim was deemed served”.37Foot Note 37×RWS at para 32(a). 37 The applicant further argued that, under the SOPA process, the applicant’s duty to speak did not arise until it was required to provide its Adjudication Response. Having raised its complaint regarding the defective Payment Response at the first available opportunity (ie, in the Adjudication Response), the applicant argued that ithaddischarged its duty to speak. 38 In the explicit context of the SOPA, I agreed with the applicant’s position that the duty of a respondent (in an adjudication) to speak would only arise when an adjudication response is submitted. There is no additional mechanism under the SOPA for the respondent to raise objections following the issuance of a tax invoice by the claimant. However,in the context of the presentfacts, I found that the applicant’s duty to speak arose earlier. I set out below a summary of the chain of correspondence between the parties: (a) Following the submission of the Payment Claim by the respondent, the applicant sent its Payment Response by email, stating “Kindly see attached payment cert for your reference”.38Foot Note 38×YES at p 657. (b) The respondent then sent an email attaching the Tax Invoice and informing the applicant that a hard copy would be sent to the applicant’s headquarters.39Foot Note 39×YES at p 657. (c) The applicant replied with “Kindly see attached Final Account for your endorsement”.40Foot Note 40×YES at p 656. 39 Looking at this exchange, I agreed with the respondent that the applicant’s duty to speak against the invalid Payment Response arose once the actual deadline for the service of a payment response was reached (as provided under s 11(1)(b) of the SOPA), or when the Tax Invoice was issued to the applicant.41Foot Note 41×RWS at para 32(c).The applicant received the Tax Invoice without raising any objection and allowed the time within which it had to properly submit a payment response to lapse. Such silence and inaction amounted to an unequivocal representation by the applicant that it would not insist on its legal right to serve its payment response later (ie, within 14 days after the deemed date of service of the payment claim) and thus would not seek to invalidate any adjudication on the basis of an invalid payment response. 40 The respondent relied on that representation to its detriment, making it inequitable for the applicant to go back on its representation. The following passage fromAudi Constructionat [64] is apposite in illustrating the application of the estoppel doctrine where a party failed to object to an invalid payment claim: The respondent may also communicate his intention to forbear to exercise his right to object to the payment claim’s validity. The claimant, in turn, may in reliance on that communication omit to re-file a payment claim which rectifies the filed payment claim’s defect, if any. If the respondent later attempts to impugn the validity of the filed payment claim, the claimant may by then, to his detriment, have missed the opportunity to re-file a rectified payment claim. Indeed, the claimant may have decided not to re-file because the respondent had acted consistently with the position that the payment claim was valid. In such a case, the respondent may in principle be estopped from raising that objection … 41 By analogy, the above analysis on an invalid payment claim would also apply to the invalid Payment Response. Here, in reliance on the applicant’s representation, the respondent missed the deadline to file an adjudication application on the basis that the applicant “fail[ed] to provide a payment response” (s 12(2)(b) SOPA).42Foot Note 42×RWS at para 32(c).Hence, the respondent could only submit its Adjudication Application on the basis of an accepted response amount that is not fully paid. 42 As the Court of Appeal inAudi Constructionmade clear at [69], parties should not be incentivised to act in a manner that defeats the very purpose of the SOPA.Audi Constructionalso refers to an objective assessment of when a reasonable person should consider that a duty to speak would arise (see above at [35]). The facts of the current case fell exactly within the parameters considered byAudi Constructionas to when such a duty to speak arose. The early and erroneous submission of the Payment Response was of the applicant’s own doing. The applicant had ample opportunity to raise its objection in a timely way. By having chosen not to do so, the applicant should not be able to subsequently raise this issue to invalidate the Determination purely on technical grounds. It was estopped from doing so.",
        "Issue 3: The Adjudicator was actingultra viresin awarding a higher amount than that stated in the Payment Response": "43 I turn to the final issue on jurisdiction. I concluded that the Adjudicator had actedultra viresin awarding the Adjudicated Amount of S$17,019.19, which was higher than the amount of S$16,861.60 stated in the Payment Response. 44 Both parties relied onRong Shunto advance their positions. In that case, the adjudicator was found to have exceeded its jurisdiction in deciding on a retention sum claim which was not included in the applicant’s payment claim (Rong Shunat [103]). The respondent sought to distinguishRongShunon the basis that the present case does not involve a new head of claim, but only an arithmetic correction which the Adjudicator was permitted to do per ss 17(4)(c), 17(4)(d) and 17(4)(h) of the SOPA. To reproduce the relevant parts, s 17(4) of the SOPA provides that an adjudicator “may only have regard to the following matters”: … (c) the payment claim to which the adjudication application relates, the adjudication application, and the accompanying documents thereto; (d) the payment response to which the adjudication application relates (if any), the adjudication response (if any), and the accompanying documents thereto; … (h)  any other matter that the adjudicator reasonably considers to be relevant to the adjudication. 45 I found that the respondent’s reliance on s 17(4) of the SOPA did not assist its case. The respondent had nailed its colours to the mast on the amount of S$16,861.60 on multiple occasions: (a) The respondent’s Tax Invoice issued to the applicant stated the sum of S$16,861.61 as the “Net Amount Due”.43Foot Note 43×YES at p 168.(b) The Notice of Intention to Apply for Adjudication stated that the respondent had “accepted the response amount and issued a Tax Invoice for the sum of $16,861.61”, and that it “intends to apply for adjudication on the response amount of $16,861.61 (inclusive of GST)” as no payment has been made of that amount.44Foot Note 44×YES at p 171.(c) In the respondent’s Adjudication Application, the nature of the dispute was indicated as “Accepted response amount not fully paid”, and the amount claimed was “SGD 16,861.61 (inclusive/exclusiveof GST)”.45Foot Note 45×YES at pp 175–176.(d) In the written submissions for the Adjudication itself46Foot Note 46×YES at pp 535–543.and throughout the Adjudication process, the respondent did not seek to vary or correct its claimed amount. I noted the discrepancy in the stated amount across the parties’ documents. Between S$16,861.60 and S$16,861.61, I adopted the former figure since this was the quantum referred to in the Payment Response and the Determination.47Foot Note 47×YES at pp 24 and 165. 46 The Adjudicated Amount was never sought by the respondent. In fact, as submitted by the applicant, the amount of S$16,861.61 was the respondent’s “accepted response amount” which formed the basis of the Adjudication Application.48Foot Note 48×AWS at para 51.In that regard, I considered the principle of fair notice as explained inRong Shunapplicable to the present case.Rong Shunhighlighted the importance of a payment claim in “fix[ing] the parameters of the substantive content of an adjudication application” (at [101]), the rationale being one of fairness to the respondent in an adjudication (at [102]): … A respondent must be able to ascertain from the payment claim with completeness and certainty – at the time it receives the payment claim – each claim which it will have to address in its payment response if it chooses not to satisfy that claim … 47 Transposing this to the present context, the documents listed above at [45] similarly fixed the parameters of the Adjudication. There was absolutely no notice given to the applicant that it had to meet a claim for a higher amount than S$16,861.61 in the Adjudication. I concluded that the Adjudicator exceeded his jurisdiction in awarding the Adjudicated Amount. 48 However, this did not warrant setting aside the entirety of the Determination, as the court has the power to sever an adjudication determination for jurisdictional errors. In particular, it was noted inRong Shunat [155(e)] that: … the court may modify the text of the adjudicator’s determination in order to achieve severance if the court is satisfied that it is effecting no change in the substantial effect of the adjudication determination after accounting for the jurisdictional error and its necessary editorial consequences. 49 In the present case where only the excess amount of S$157.59 (S$17,019.19 – S$16,861.60) required severance, modification of the Determination would achieve this purpose without affecting the substantive content of the Determination.",
        "Conclusion": "50 In conclusion, the setting aside application was allowed in part with the Adjudicated Amount in the Determination reduced from S$17,019.19 to S$16,861.60. The excess amount of S$157.59 was ordered to be released, from the payment into court, to the applicant.  51 I made no order as to costs. Though the respondent had succeeded in the application in substance, most of the arguments surrounded the issue on the validity of the Payment Response. This issue and the jurisdictional issue arising from the Adjudicated Amount were both raised by the applicant’s counsel in its letter to the respondent’s counsel prior to the filing of this application to set aside the Determination.49Foot Note 49×AWS at para 59.In light of this, the respondent could have conceded on those two issues and focused its case on estoppel. Since the respondent nevertheless chose to argue all the issues, I determined that no order as to costs was a fair outcome. Wong Li Kok, AlexJudicial Commissioner Benny Santoso, Sim Chee Siong (Rajah & Tann Singapore LLP) for the applicant; Gan Guo Bin, Quek Seng Soon Winston (Winston Quek & Company) for the respondent."
    }
}