{
    "case_title": "Envy Asset Management Pte Ltd (in liquidation) and others vCH Biovest Pte Ltd",
    "ncitation": "[2024] SGHC 46",
    "coram": "Goh Yihan J",
    "sections": {
        "Background to the present application": "4 I begin with the background to the present application, which is necessary for a fuller context of the Agreed Facts and the Agreed Issues.",
        "The Envy Companies’ purported business of nickel trading": "5 From around January 2016 to around April 2020, EAM purported to purchase quantities of London Metal Exchange (“LME”) Nickel Grade Metal (“Poseidon Nickel”) from an Australian company, Poseidon Nickel Limited (“Poseidon”). In particular, EAM purported to purchase Poseidon Nickel at a 16% to 25% discount compared to the average of the LME Nickel official daily cash settlement prices for the month prior to the month of scheduled shipment. EAM then purported to sell Poseidon Nickel at a higher price to third party buyers, such as China MinMetals Corporation and BNP Paribas Commodity Futures Limited.2Foot Note 2×Affidavit of Bob Yap Cheng Ghee dated 27 March 2023 (“Yap’s Affidavit”) at paras 2.1.4(a)–(b). 6 In respect of the purchase and sale of Poseidon Nickel, EAM entered into Letters of Agreement (“LOAs”) with its investors. The investors would pay a principal amount to EAM to be used “solely for investment in LME Nickel Grade Metal” or “solely for investment in LME Grade Nickel Concentrates” for a three-month period. In certain cases, investors could commit to multiple, consecutive three-month tranches upfront.3Foot Note 3×Yap’s Affidavit at para 2.1.4(c). 7 Each of the LOAs contemplated investments which were materially similar in the following ways:4Foot Note 4×Yap’s Affidavit at para 2.1.4(d). (a) Investors would pay a principal amount to buy into one of EAM’s purported trades in Poseidon Nickel. (b) When the LOA matured, EAM would pay investors an amount comprising: (i) a percentage of their principal amount; (ii) appreciation on Poseidon Nickel; (iii) less shipping and insurance costs incurred by EAM, and a commission fee retained by EAM. (c) EAM guaranteed that it would return investors approximately 85% of their principal amount upon maturity of the LOA. (d) After the LOA matured, investors had the option of: (i) fully or partially withdrawing their returns; or (ii) “rolling over” any returns that were not withdrawn into a new LOA. 8 From around June 2019 to around February 2020, the defendant entered into LOAs with EAM.5Foot Note 5×Yap’s Affidavit at para 2.1.5.The relevant terms in those LOAs are as follows:6Foot Note 6×Yap’s Affidavit at pp 577–621. (a) Clause 1.2 defines appreciation as “(i) the [Fair Market Value] of each liquid asset of [EAM] at any given time after the [e]ffective [d]ate”; minus “(ii) the [Fair Market Value] of each liquid asset of [EAM] as of the [e]ffective [d]ate (or the date of acquisition of such asset, if after the date hereof) after the deduction of the relevant clearance and bourse fees”. (b) Clause 1.7 defines commission as “a percentage of realised [a]ppreciation in the [p]ortfolio of [EAM] at the end of each calendar month following the [e]ffective [d]ate”,ie, the date when the LOA was entered into. (c) Clause 1.8 defines portfolio as EAM’s “invested asset holdings in 5,000 tonnes of [LME] Nickel Grade Metal purchased from an asset operated by Poseidon”. (d) Clause 2.1 provides that EAM “may use [the principal amount] [solely] for investment in LME Nickel Grade Metal” during the period of the LOAs. (e) Clause 2.4 provides as follows: [EAM] cannot guarantee the future performance of the Investor’s investment, promise any specific level of performance or promise that the investment decisions, strategies or overall management of the account will be successful. The investment decisions that [EAM] will make for the Investor are subject to various market, currency, economic, political and business risks, and will not necessarily be profitable. The Investor acknowledges that he/she is required to seek and obtain independent counsel in relation to the legal, accounting and tax risks associated with this Agreement. Except as may otherwise be provided by law, [EAM] will not be liable to [sic] for any loss that the Investor may suffer as a result of [EAM’s] good faith decisions or actions where [EAM] exercises the degree of care, skill, prudence and diligence under the circumstances that a prudent person acting in a similar capacity would use in the conduct of an enterprise of a similar character and with similar aims. (f) Clause 3 provides that when the LOAs mature, EAM would pay the defendant: (i) the principal amount of $1m in each LOA; (ii) appreciation on Poseidon Nickel; less (iii) shipping and insurance costs incurred by EAM, and a commission fee retained by EAM. The principal amount is defined as “a buy-in into the Portfolio of [EAM]”.7Foot Note 7×Yap’s Affidavit at para 2.1.4(d)(i). 9 In purported discharge of EAM’s obligations under cl 3 of its LOAs, the defendant received sums in excess of the principal sums it invested, which I have referred to as the “Overwithdrawn Sums” (see [2] above).8Foot Note 8×Yap’s Affidavit at para 2.1.5.The breakdown of the Overwithdrawn Sums is as follows:9Foot Note 9×Yap’s Affidavit at para 2.1.5.  10 On 19 March 2020, the Monetary Authority of Singapore (“MAS”) placed EAM on its Investor Alert List. MAS did this to “highlight that EAM may have been wrongly perceived as being licensed by MAS”. According to a statement that MAS released at the material time, it had “received public feedback that EAM had told [investors] that it was in the process of applying for a license from MAS, when in fact no such application had been submitted”.10Foot Note 10×Yap’s Affidavit at para 2.1.6. 11 Following the actions taken by MAS, the Envy Companies were restructured. First, from around April 2020, EAM’s business of purported nickel trading was transferred to EGT. As such, EGT became the main operating entity of the Envy Companies.11Foot Note 11×Yap’s Affidavit at para 2.1.7(a).Second, EMH was incorporated on 18 June 2020 as the holding company of EGT. Most employees and most operation cost obligations were shifted from EAM and/or EGT to EMH.12Foot Note 12×Yap’s Affidavit at para 2.1.7(b). 12 From around April 2020 to around March 2021, EGT continued the business of purported nickel trading. However, instead of LOAs, investors invested by way of Receivables Purchase Agreements (“RPAs”). The RPAs differed in operation from the LOAs in the following ways:13Foot Note 13×Yap’s Affidavit at para 2.1.8. (a) Instead of an investment into EAM’s “Portfolio”, an investor would purchase a proportion of the receivables that EGT was purportedly entitled to receive under a Forward Contract with a third party buyer at a certain “Sale Price”, that is, the sum invested by the investor. (b) In addition to BNP Commodity Futures Limited, EGT held out that BNP Paribas and Raffemet Pte Ltd were also buyers for a number of Forward Contracts. (c) The “Sale Price” would entitle the investor to a proportion of the “Total Receivable” which EGT would be entitled to from the Forward Contract with the third-party buyer.",
        "The winding-up of the Envy Companies": "13 On 22 March 2021, the Commercial Affairs Department announced that it had preferred charges against the key person behind the Envy Companies, Mr Ng Yu Zhi (“NYZ”), for cheating and fraudulent trading. On 15 April 2021, the Envy Companies filed applications to place themselves under judicial management. Interim judicial managers (“IJMs”) were appointed over the Envy Companies on 27 April 2021. The IJMs were tasked with, among other things, preparing a report on the financial position of the Envy Companies, along with their views on the prospects of the objectives of judicial management being achieved.14Foot Note 14×Yap’s Affidavit at paras 2.2.1–2.2.2. 14 On 25 May 2021, the IJMs issued the Interim Judicial Managers’ Report (the “Interim Report”).15Foot Note 15×Yap’s Affidavit at pp 23–112.In the Interim Report, the IJMs found that the Envy Companies’ purported nickel trading were non-existent, and that the documents which had been presented to them in support of the said trading activity were forgeries.16Foot Note 16×Yap’s Affidavit at para 2.2.3 and p 60 para 5.8.1.Instead, investors’ funds that had been invested in EAM and/or EGT had, among others, been: (a) transferred to NYZ without any proper or legitimate basis; (b) paid to NYZ and one Ms Lee Si Ye as directors’ fees without any proper or legitimate basis; (c) paid to employees of the Envy Companies as commissions, profit sharing and/or referral fees without any proper or legitimate basis; and (d) paid to other investors as referral fees and/or fictitious profits in excess of their principal amounts invested, without any proper basis.17Foot Note 17×Yap’s Affidavit at para 2.2.3.The IJMs therefore concluded that “none of the purposes of a judicial management as set out in section 89(1) of the IRDA can be achieved”.18Foot Note 18×Yap’s Affidavit at p 61 para 6.1.1.This was not only because the purported nickel trading was non-existent, but also because the Envy Companies did not partake in any other meaningful business. Moreover, the Envy Companies’ known assets were grossly insufficient to meet the potential claims of the Envy Companies’ creditors.19Foot Note 19×Yap’s Affidavit at para 2.2.4 and p 61 para 6.1.2. 15 On 2 July 2021, the IJMs issued the Update to the Interim Judicial Managers’ Report (the “Update”).20Foot Note 20×Yap’s Affidavit at pp 113–151.In the Update, the IJMs identified claims against certain investors of the Envy Companies (the “Overwithdrawn Investors”) for: (a) the referral fees paid by the Envy Companies; and/or (b) the Overwithdrawn Sums, as potential avenues of recovery for the Envy Companies. The IJMs then applied on the same day to wind up the Envy Companies since there was no meaningful business to rehabilitate. On 16 August 2021, a winding up order was made against each of the Envy Companies.21Foot Note 21×Yap’s Affidavit at paras 2.2.5–2.2.6.",
        "The present application": "16 After the winding up of the Envy Companies, the Liquidators sought several other avenues of recovery that had been identified in the Update. On 22 September 2022, the Liquidators issued several letters of demand against the Overwithdrawn Investors, including but not limited to the defendant, for the Overwithdrawn Sums. The Liquidators and the defendant then engaged in without prejudice correspondence before eventually agreeing on the Agreed Facts, the Agreed Issues, and the prayers for the present application.22Foot Note 22×Yap’s Affidavit at paras 2.3.1–2.3.4. 17 This is thus the background by which the present application has come before me.",
        "The Agreed Facts and the defendant’s elaboration": "18 As I mentioned (see [3] above), the present application has been made more expeditious due to the parties’ Agreed Facts. As a starting point, these are as follows:23Foot Note 23×Yap’s Affidavit at para 3.1.1. (a) The defendant invested in the purported nickel trading and was paid the aggregate sum of $2,319,484 in excess of the principal sum it invested, the details of which are contained in the Annex to the letter of demand to the defendant dated 26 September 2022.24Foot Note 24×Yap’s Affidavit at p 657. (b) The purported nickel trading was non-existent. (c) The Overwithdrawn Sums were paid out of moneys invested by other investors in the Envy Companies, as opposed to any proceeds of the purported nickel trading. 19 Additionally, some of the Agreed Facts are based on various findings contained in the Interim Report and the Update. For example:25Foot Note 25×Yap’s Affidavit at para 3.1.2. (a) Poseidon confirmed by way of: (i) an announcement on the Australian Securities Exchange; and (ii) correspondence with the IJMs, that it had no business relationship with the Envy Companies, NYZ, or any associates. Accordingly, the entire basis of the Envy Companies’ alleged source of physical nickel for the purported nickel trading was false. (b) EAM and/or EGT did not enter into any transaction for the sale of physical nickel to any third party. For instance, BNP Paribas Commodities Futures Limited was no longer authorised to conduct regulated business on 4 February 2019, and closed from 15 March 2019. Accordingly, the entire basis of the Envy Companies’ alleged sale of physical nickel and consequent profits was false. (c) Various documents, such as contracts, trading statements, and shipping documents contained a number of irregularities. (d) Accordingly, the purported nickel trading was non-existent. 20 The defendant makes two clarifications to the Agreed Facts. First, the parties agreed that they may introduce any facts beyond the Agreed Facts to advance their respective cases. Second, the defendant had agreed to the Agreed Facts on the basis of the findings in the Interim Report and the Update. More specifically, the defendant had agreed because it did not see any reason to dispute the facts as set out in the Interim Report and the Update, and not because the defendant had been aware of these facts prior to the Interim Report and the Update being issued. In addition to these clarifications, the defendant also, with the claimants’ consent, introduced supplemental facts to the Agreed Facts.26Foot Note 26×Affidavit of Liew Mei Hong dated 18 April 2023 (“Liew’s Affidavit”) at paras 5–8. 21 In sum, the defendant submits that it is abona fideinvestor who had no knowledge or notice of the non-existence of the purported nickel trading or that the Overwithdrawn Sums were paid out of moneys invested by other investors in the Envy Companies at all material times. Instead, the defendant discovered this for the first time in the first quarter of 2021. This was around the time when the Envy Companies’ scheme unravelled publicly.27Foot Note 27×Liew’s Affidavit at paras 15–16. 22 Given that the purpose of the defendant’s supplemental facts is clear, there is no need to go through those facts in detail. For the present purposes, those facts may be summarised. In January 2019, the defendant’s holding company, Chuan Hup Holdings Limited (the “Holding Company”), announced it was disposing one of its SGX-listed subsidiaries. The Holding Company decided to reinvest part of the resulting sale proceeds. It transferred part of the sale proceeds to the defendant for the defendant to oversee the investment. It was against this background that the defendant decided to invest with EAM.28Foot Note 28×Liew’s Affidavit at para 9. 23 Between June 2019 and February 2020, the defendant invested $5,480,246 with EAM. It received $7,799,730 in return, thus making a profit of $2,319,484,ie, the Overwithdrawn Sums. The defendant therefore agrees that it received $2,319,484 as profits from its investment with EAM. The manner of the defendant’s investment is as described above (see [8]–[9]).29Foot Note 29×Liew’s Affidavit at para 10. 24 The defendant emphasises that it believed that EAM was conducting a legitimate business and had no reason to suspect otherwise. The defendant elaborates that EAM always followed up promptly with the defendant in relation to various written records and documents such as invoices and settlement receipts. The defendant also received monthly email updates from EAM, consisting of the market outlook for the month, nickel daily prices, and an investment report that EAM had prepared for the defendant. Further, the defendant explains that before it could invest in the purported nickel trading with EAM, EAM had undertaken know-your-client checks on the defendant, and had sought various documents from the defendant for the purpose of performing its due diligence checks on the defendant. As such, EAM represented to the defendant that it had robust business practices in place, including anti-money laundering checks. These checks gave the defendant the impression that EAM had established a safe and trustworthy environment for investors to deposit funds.30Foot Note 30×Liew’s Affidavit at para 17. 25 Despite the defendant’s confidence in EAM’s investment portfolio, the defendant says it took measures to manage the risks of its investment with EAM. In this regard, the defendant did not invest a huge one-time lump sum amount with EAM. The defendant also decided to take a step-up investment approach, with the amount of its investment only increasing upon the completion of the first contract. This allowed the defendant to test the waters and evaluate if its investments with EAM were viable before increasing any future investment.31Foot Note 31×Liew’s Affidavit at para 18. 26 The defendant’s investment with EAM concluded around 12 February 2020, which was the start date of the final LOA it had entered into with EAM. The defendant made its final withdrawal of the proceeds from its investment with EAM on 28 May 2020. The defendant decided to withdraw all of the funds it had invested with EAM in May 2020 because the Holding Company and its subsidiaries had found new business investment opportunities elsewhere. It was only a year later that the defendant came to learn of the Envy Companies’ alleged scheme.32Foot Note 32×Liew’s Affidavit at paras 19–20. 27 Upon concluding its investment with EAM, the principal amount that the defendant invested with EAM was used to repay the amount owing to the Holding Company. As for the profits which were paid out (ie, the Overwithdrawn Sums), these were all used by the defendant to repay other amounts owing to the Holding Company, amounting to $2,045,118 in May 2020. The remaining amounts were used to pay the defendant’s operating expenses in 2020 and 2021. As a result, the 2019 to 2020 accounts have all been finalised and audited, including the group accounts of the Holding Company.33Foot Note 33×Liew’s Affidavit at para 22.",
        "The Agreed Issues": "28 From the Agreed Facts as elaborated above, the parties have come to the Agreed Issues, which concern whether, by way of statutory clawback actions or otherwise, the fact that the Envy Companies had no meaningful business means that those investors who profited from the scheme ought to repay the aggregate sum that they have received in excess of their actual principal invested to the Envy Companies. 29 More specifically, the Agreed Issues are encapsulated within the declarations sought (see [2] above) and I set them out again for convenience: (a) a declaration that the Overwithdrawn Sums were paid to the defendant for the purposes of putting assets beyond the reach of the creditors of EAM and/or prejudicing their interests, within the meaning of s 438(4) read with s 439(1)(d) of the IRDA and/or with intent to defraud creditors of EAM within the meaning of s 73B of the CLPA; (b) further and/or in the alternative, a declaration that the payment of the Overwithdrawn Sums to the defendant were transactions at an undervalue within the meaning of s 224(3) of the IRDA; (c) further and/or in the further alternative, a declaration that the defendant was unjustly enriched by the Overwithdrawn Sums, to the detriment of EAM; and (d) taking into account any defences applicable to the issues of law raised at (a)–(c) above, should any of the above declarations at (a)–(c) above be granted, an order that the defendant do hereby pay to the claimants the Overwithdrawn Sums, and interest thereon, or such other amount as the court deems fit.",
        "Appointment of Young Independent Counsel": "30 Because the present application raised several novel issues, I appointed a Young Independent Counsel, Mr Jason Teo (“Mr Teo”), to answer the following questions (the “YIC Questions”): (a) Do such Overwithdrawn Sums constitute trust property, and if so, held on trust for whom, and in what kind of trust? (i) Assuming a trust exists, does it exist over the entirety of the Overwithdrawn Sums, or only the principal, or only the profits? (b) For the purposes of s 224(1) of the IRDA, are purported investment returns paid to an investor considered “transaction[s] with any person at an undervalue”? (i) Assuming s 224(1) applies, does it apply across investors or per transaction? (c) For the purposes of s 224(3) of the IRDA and s 73B(3) of the CLPA, can there be valid “consideration” given by an investor to the perpetrators of a Ponzi scheme in exchange for fictitious profits paid out of the scheme?(d) Does unjust enrichment operate against the investor in relation to such Overwithdrawn Sums in the context of a Ponzi scheme, and if so, how? 31 I express my gratitude at the outset to Mr Teo, as well as counsel for the claimants, Mr David Chan (“Mr Chan”), and counsel for the defendant, Mr Pereira Kenetth Jerald (“Mr Pereira”), including their respective teams, for all their very helpful submissions.",
        "Three preliminary issues": "32 Before I deal with the Agreed Issues and the bulk of the YIC Questions, I turn to address three preliminary issues. First, whether the claimants are entitled to declaratory relief at all. Second, whether the Overwithdrawn Sums are trust property and therefore not the assets of EAM. Third, whether, as the defendant contends, the claimants have made a fundamental error in their choice of the avoidance provisions which they have invoked in this application. I have termed these as preliminary issues because, depending on how they are resolved, it may render it unnecessary for me to consider certain (to even substantial) portions of the claimants’ application in any substantive manner.",
        "Whether the claimants are entitled to declaratory relief": "33 To begin with, the court’s power to grant declaratory relief is statutory. This power is located in s 18 read with para 14 of the First Schedule to the Supreme Court of Judicature Act 1969 (2020 Rev Ed) and O 15 r 16 of the Rules of Court (2014 Rev Ed) (or its equivalent provision in O 4 r 7 of the Rules of Court 2021) (see the Court of Appeal decision ofSalijahbte Ab Latef v Mohd Irwan bin Abdullah Teo[1996] 2 SLR(R) 80 at [51]). 34 However, although the court has the powerto grant declaratory relief, this does not mean that the court should always exercise its discretion to do so. The English position is that the discretion should be exercised “with great care and jealousy” or “with extreme caution” (see the House of Lords decision ofRussian Commercial and Industrial Bank v British Bank for Foreign Trade Ltd[1921] 2 AC 438 at 445, citingAusten v Collins(1886) 54 LT 903 at 905 andFaber vGosworth Urban District Council(1903) 88 LT 549 at 550). 35 In Singapore, declaratory relief must be justified by the circumstances of the case (see the Court of Appeal decision inKaraha Bodas Co LLCv Pertamina Energy Trading Ltd and another appeal[2006]1 SLR(R) 112 (“Karaha Bodas”) at [14(c)]). In this regard, a claimant seeking declaratory relief must satisfy six requirements:(a)the court must have the jurisdiction and power to award the remedy; (b) the matter must be justiciable in the court; (c) as a declaration is a discretionary remedy, it must be justified by the circumstances of the case; (d) the plaintiff must havelocus standito bring the suit and there must be a real controversy for the court to resolve; (e) any person whose interests might be affected by the declaration should be before the court; and (f) there must be some ambiguity or uncertainty about the issue in respect of which the declaration is asked for so that the court’s determination would have the effect of laying such doubts to rest (seeKaraha Bodasat [14]). 36 For the present purposes, it is unnecessary for me to consider all of these requirements in detail. Instead,I only need to focus on thethird requirement of whether the circumstances justify granting the declarations sought.With the above in mind, I am satisfied that it is appropriate to grant the declarations sought, if the claimants convince me that it is correct as a matter of law to do so. Indeed, the defendant has not seriously contended that the claimants are not able to seek the declarations concerned.",
        "Whether the Overwithdrawn Sums are trust property and therefore not the assets of EAM": "The parties’ positions 37 As a preliminary point, the defendant submits that the moneys paid by investors to EAM were held by EAM on aQuistclosetrust and/or an institutional constructive trust for the investors. This means, in the defendant’s submission, that the Overwithdrawn Sums constitute trust property that would not form part of EAM’s assets, and therefore would not be subject to the relevant avoidance provisions in the CLPA and the IRDA34Foot Note 34×Defendant’s Written Submissions dated 12 May 2023 (“DWS”) at para 8.(thoughcfthe English Court of Appeal decision ofInvest Bank PSC v El-Husseini and others[2023] 3 WLR 645). 38 More specifically, the defendant submits that aQuistclosetrust arose over the moneys that EAM received from investors because the moneys were subject to “restrictions on use” and “solely for investment in LME Nickel Grade Metal” as stated in cl 2.1 of the LOAs. Given the specified, exclusive purpose for the moneys, the moneys were not at EAM’s free disposal but held on aQuistclosetrust for the investors.35Foot Note 35×DWS at para 11.In the alternative, the defendant submits that an institutional constructive trust arose over the moneys that EAM received from investors because: (a) EAM fraudulently induced investors to invest into the Ponzi scheme it perpertrated; and (b) when property is acquired by fraud, equity imposes a constructive trust on the fraudulent recipient.36Foot Note 36×DWS at paras 12–13. 39 In response, the claimants submit that the Overwithdrawn Sums are not trust property and therefore form part of EAM’s assets that would be subject to the relevant avoidance provisions in the CLPA and the IRDA. With regard to theQuistclosetrust argument, the claimants submit that such a trust did not arise because: (a) the LOAs did not oblige EAM to apply the moneys to a specific purpose; and (b) there was no common intention between EAM and its investors that the moneys would be segregated from EAM’s general fund.37Foot Note 37×Claimants’ Written Submissions dated 12 May 2023 (“CWS”) at paras 2.1.1–2.1.14.With regard to the institutional constructive trust argument, the claimants submit that such a trust also did not arise, because it requires the fraudster to commit a fraud by relying on the informality of a transaction to deny the claimant’s beneficial interest in the property, which did not occur in the present application.38Foot Note 38×CWS at para 2.2.3. 40 The claimants further submit that even if the Overwithdrawn Sums are trust property, the court should order the disgorgement of the Overwithdrawn Sums.39Foot Note 39×CWS at paras 2.3.1–2.3.7. 41 Mr Teo submits that both aQuistclosetrust and an institutional constructive trust did not arise in the present application. AQuistclosetrust did not arise because the LOAs merely entitled the defendant to “receiv[e] the benefit of a counter-obligation to pay an amount quantified by reference to the supposed Nickel appreciation”. This meant that the defendant was merely a contract debtor, and not the beneficiary of aQuistclosetrustfor which EAM was the trustee.40Foot Note 40×Young Independent Counsel’s Written Submissions dated 11 August 2023 (“YICWS”) at para 23.Also, an institutional constructive trust did not arise because, as a matter of law, it is insufficient that there be property transferred in circumstances involving fraud. Instead, what is required for an institutional constructive trust to arise is “fraudulent taking”,ie, fraud involving the outright taking of a person’s property.41Foot Note 41×YICWS at paras 51–53. My decision: the Overwithdrawn Sums are not subject to aQuistclosetrust (1) The applicable law 42 The parties accept that theQuistclosetrust is part of Singapore law (see generally Alvin See, Yip Man and Goh Yihan,Propertyand Trust Law in Singapore(Kluwer Law International, 2018) (“Trust Lawin Singapore”) at para 1098 and Alvin W-L See, “TheQuistcloseTrust in Singapore” (2014) 20 T&T 362). Indeed, in the High Court decision ofPacific Rim Palm Oil Ltd v PT AsiaticPersada and others[2003] 4 SLR(R) 731 (“Pacific Rim”)(at [16]), Belinda Ang Saw Ean J (as she then was) described the doctrine as follows: … [W]here money is advanced by A to B, with the mutual intention that it should be used exclusively for a specific purpose, there will be implied (in the absence of any contrary intention) a stipulation that if the purpose fails the money will be repaid, and the arrangement will give rise to a relationship of a fiduciary character, or trust. 43 No discussion of theQuistclosetrust will be complete without mentioning the competing judicial accounts of its juridical nature. Starting with the eponymous House of Lords decision ofBarclays Bank Ltd vQuistclose Investments Ltd[1970] AC 567 (at 581–582), Lord Wilberforce suggested there that where one party (A) lends money to another party (B) for the purpose of paying a third party (C), a primary trust would arise in favour of C and, if the purpose or the primary trust should fail, a secondary trust would then arise in favour of A. However, this dual-trusts analysis has generally been rejected, especially after Lord Millett’s account of theQuistclosetrust as a resulting trust in the House of Lords decision ofTwinsectraLtd v Yardleyand others[2002] 2 AC 164 (“Twinsectra”), where the learned judge stated as follows (at [92]): The central thesis of Dr Chambers’s book is that a resulting trust arises whenever there is a transfer of property in circumstances in which the transferor (or more accurately the person at whose expense the property was provided) did not intend to benefit the recipient. It responds to the absence of an intention on the part of the transferor to pass the entire beneficial interest, not to a positive intention to retain it. Insofar as the transfer does not exhaust the entire beneficial interest, the resulting trust is a default trust which fills the gap and leaves no room for any part to be in suspense. An analysis of theQuistclosetrust as a resulting trust for the transferor with a mandate to the transferee to apply the money for the stated purpose sits comfortably with Dr Chambers’ thesis, and it might be thought surprising that he does not adopt it. According to the resulting trust account, theQuistclosetrust arises in response to the absence of the transferor’s intention to benefit the recipient. The trust thus arises from the outset. Since the beneficiary is the transferor himself, this account explains the outcome of theQuistclosetrust without offending the beneficiary principle. 44 Indeed, it has been suggested that Lord Wilberforce’s account would not have been able to fully explain the result inTwinsectraitself, where the loan was extended to perform the abstract purpose of acquiring properties, without also taking the major step of abrogating the beneficiary principle (seeTrust Lawin Singaporeat para 1099). 45 In Singapore, theQuistclosetrust has been traditionally characterised as a resulting trust (seePacific Rimat [19]), though an express trust account has also been approved of by the courts (see Christopher Hare and Vincent Ooi,Singapore Trusts Law(LexisNexis, 2021) at p 484). This is best reflected in the High Court decision ofAttorney-General v Aljunied-Hougang-Punggol East Town Council[2015] 4 SLR 474 (“AHPETC (HC)”) (at [108]), where Quentin Loh J observed that “no Singapore court has, as of yet, definitively pronounced on this issue”, being the issue of which account of theQuistclosetrust is authoritative. Indeed, Loh J noted (at [111]) that “although Lord Millett characterised theQuistclosetrust as a resulting trust for the transferor with a mandate to the transferee to apply the money for a stated purpose”, “there is nothing in principle that prevents the constitution of an express trust that operates in the same manner as a resultingQuistclosetrust”. WhenAHPETC(HC)went on appeal, the Court of Appeal inAttorney-General v Aljunied-Hougang-Punggol East Town Council[2016] 1 SLR 915 (at [123]) declined to consider the claim regarding theQuistclosetrust and did not comment on whether theQuistclosetrust should be rationalised as an express trust or a resulting trust. Indeed, in the subsequent High Court decision ofCCMIndustrial Pte Ltd (in liquidation) v Chan Pui Yee[2016] SGHC 231 (at [48]), Chua Lee Ming JC (as he then was) recognised both accounts of theQuistclosetrust (thoughcfthe High Court decision ofMSP4GEAsia Pte Ltd and another v MSP Global Pte Ltd and others[2019] 3 SLR 1348 at [110]). 46 More practically, as Loh J set out inAHPETC(HC)(at [114]), there are four key principles that govern the doctrine of aQuistclosetrust under Singapore law: (a)  Whenever a donor transfers money to a recipient for a specified purpose, aQuistclosetrust may arise. In aQuistclosetrust, the donor possesses the beneficial interest in the money, but this is subject to a power or duty on the recipient’s part to use the money for the specified purpose. If the recipient is unwilling or unable to use the money for the specified purpose, the money is to be returned to the donor. Such a trust may be either express or resulting. (b)  For aQuistclosetrust to arise, the twin certainties of subject matter and objects must be present. In particular, the purpose must be stated with sufficient clarity for a court to determine if it is still capable of being carried out or if the money has been misapplied. (c)  For an expressQuistclosetrust, the settlor-donor must intend to constitute the recipient as a trustee, and confer a power or duty on the recipient-trustee to apply the money exclusively in accordance with the stated purpose. (d)  For a resultingQuistclosetrust to arise, the donor must have a lack of intention to part with the entire beneficial interest in the transferred money. The recipient must not have free disposal of the money (Twinsectraat [73]) and must be under a power or duty to apply the money exclusively in accordance with the stated purpose (Twinsectraat [74]). In sum, the key ingredient of aQuistclosetrust, whether analysed as an express trust or a resulting trust, is that a donor “transfers money to a recipient for a specified purpose”. Although the donor’s state of mind may result in the characterisation of aQuistclosetrust as an express trust or a resulting trust, that is unlikely to have a practical impact in most cases. 47 In setting out these key principles, I agree with two specific points made by Mr Teo. First, I agree that the Singapore courts have not definitively resolved the issue of the degree of evidential rigour that should be applied when considering whether the ingredients of aQuistclosetrust are satisfied. Thus, in the Appellate Division of the High Court decision ofWei Ho-Hung v Lyu Jun[2022] 2 SLR 1066 (at [52]), Belinda Ang Saw Ean JAD (as she then was) observed that the courts have not applied a consistent degree of evidential rigour even with respect to commercial cases. However, as Mr Teo rightly submits, it is not necessary to determine this issue to resolve the present application.42Foot Note 42×YICWS at para 9.It suffices for me to state that what amounts to sufficient evidence to give rise to aQuistclosetrust will depend on the facts and circumstances of each case. 48 Second, I also agree that because the doctrine of aQuistclosetrust is not rooted in inequity or unconscionability, the courts should not apply a lower standard of evidential rigour in the present application simply because EAM was operating a Ponzi scheme.43Foot Note 43×YICWS at paras 9–10.Thus, a defrauded investor should not be entitled to a greater degree of protection through aQuistclosetrust. It follows that there ought to be no difference in establishing the ingredients of aQuistclosetrust in the context of a Ponzi scheme, as with any ordinary, profit-seeking commercial transaction. (2) The Overwithdrawn Sums are not subject to aQuistclosetrust 49 With these principles in mind, I come to the present application. In my judgment, the Overwithdrawn Sums are not subject to aQuistclosetrust. This is because the material terms of the LOAs do not show an intention to subject the funds received by EAM to the requisite exclusivity of purpose, restriction against free disposal, or segregation, so as to have given rise to aQuistclosetrust. 50 First, I agree with the claimants and Mr Teo that, pursuant to the terms of the LOAs, the moneys that the defendant invested in EAM were not intended to be applied for a special designated purpose. In this regard, cll 1.7 and 3 of the LOAs (see [8] above) contemplated a “buy in” into a specific batch of Poseidon Nickel that hadalreadybeen acquired by EAM. Nothing in the LOAs required EAM to use the principal amount to buymorenickel. Therefore, when the defendant paid the principal amount, it was entitled only to the benefit of EAM’s counter-obligation to pay “profits” (hereafter, “fictitious profits”) based on the appreciation of Poseidon Nickel. Conversely, the LOAs did not amount to payment of the Investment Amount for a specific purpose, simply because EAM was never obliged to actually carry out any specific action with the principal amount. 51 In connection with the above, I disagree with the defendant that cl 2.1 of the LOAs shows the requisite exclusivity of purpose. Clause 2.1 provided that the investment amount provided by the investor was subject to “restrictions on use”, in that EAM may use the amount “solely for investment in LME Nickel Grade Metal”. In my view, cl 2.1 is much too vague to have constituted the basis of a specific and exclusive purpose behind the payment. If at all, as Mr Teo submitted, cl 2.1 was intended to signify a division in EAM’s supposed investment classes as opposed to creating a specific purpose behind the payment of the investment amount under the LOAs.44Foot Note 44×YICWS at para 30. 52 Second, I do not find that EAM and the defendant shared any mutual intention that the defendant’s moneys would be segregated from EAM’s general fund. The defendant paid moneys to EAM to buy into EAM’s portfolio and to acquire the right to be repaid its principal amount and fictitious profits. The LOAs did not oblige EAM to keep the moneys paid by the defendant separate from EAM’s general fund. 53 Third, I do not think that the New South Wales Supreme Court decisions ofRe Courtenay House Capital Trading Group Pty Ltd (inliq)[2018] NSWSC 404 (“Re Courtenay 2018”) andRe Courtenay House Capital Trading Group Pty Ltd (inliq)[2019] NSWSC 1113 (“Re Courtenay 2019”), which the defendant relies on, are of assistance. In these cases, investors invested in funds managed by a Ponzi scheme, with their funds purportedly to be used in foreign exchange trading. InRe Courtenay 2018,the New South Wales Supreme Court held that an express trust arose by operation of the terms of the investment contracts signed by the investors, which explicitly described the investment amounts as being “held in trust”, along with other clauses consistent with segregation of the investment amounts from the general pool of the company’s assets. The court therefore held, in the alternative, that the investment amounts were held on aQuistclosetrust as well. This was based on the very same facts that gave rise to an express trust, in that it was “abundantly clear that the funds were not intended to become part of the general assets of [the company]” (seeRe Courtenay 2018at [29]). This case therefore does not assist the defendant, since in the present application, there was no similar expressed intention for the investment moneys to be held on trust, nor was there any clause in the LOAs requiring segregation of the investment moneys. 54 InRe Courtenay 2019, the New South Wales Supreme Court dealt with a different group of investors whose contracts did not contain the words “held in trust”. The court found that the absence of such words militated against an express trust. However, the court concluded that there was aQuistclosetrust because the investment contracts referred to the funds being used by the company to trade “on behalf of” the investors (seeRe Courtenay 2019at [33]). The use of those words was sufficient to give rise to an inference that the parties intended for the company to segregate the invested funds. In the present case, while there were several clauses in the LOAs that refer to “investment decisions that [EAM] will make for the [i]nvestor” (see cl 2.4 at [8] above), I agree with Mr Teo that, on balance, cl 3 should take precedence over these clauses. In my view, despite other references to EAM making investment decisions “for the [i]nvestor”, cl 3 makes it clear that the LOAs were really more akin to agreements to acquire or subscribe to units or shares, under which the investor obtains a chance of a return on his investment based on the performance of the issuer. As such, this construction of the LOAs militates against the finding of aQuistclosetrust even in the presence of “investment management” clauses. 55 Finally, I also do not think that the defendant can rely on the Singapore International Commercial Court decision ofPerry, Tamar and another v Esculier, Bonnet Servane Michele Thais and another[2022] 4 SLR 243(“Perry Tamar (SICC)”) as authority for the general proposition that aQuistcloseand/or constructive trust arises specifically over funds which were paid into a Ponzi scheme for the benefit of the investors. In my view,Perry Tamar (SICC)can be easily distinguished because the court there found that the relationship between the parties was one of trust “on the assumption that … there was no contractual relationship between [the parties]” (at [139]). It is clear, therefore, that the court’s finding of a trust was premised on theabsenceof a contractual relationship between the parties. In contrast, the parties in the present application shared a contractual relationship through the LOAs. The terms of the LOAs do not suggest that EAM held the investors’ moneys on trust and that suffices to dispose of this argument. 56 For all these reasons, I conclude that the Overwithdrawn Sums are not subject to aQuistclosetrust. 57 In closing, I add that, even if I did find that aQuistclosetrust arose in favour of the investors, it was not entirely clear to me how the existence of such a trust could justify the defendant’s retention of the Overwithdrawn Sums. If aQuistclosetrust did arise, it would have only been over the defendant’s initial investment. As the claimants point out, the Overwithdrawn Sums, being in the nature of putative profits on the defendant’s investment, fall outside the scope of anyQuistclosetrust which would only cover the defendant’s principal.45Foot Note 45×Claimants’ Further Written Submissions dated 7 June 2023 (“CFWS”) at para 2.3.2.Herein lies another reason why I do not thinkRe Courtenay 2018andRe Courtenay 2019assist the defendant. In both these cases, the issue was whether the liquidators of the Ponzi scheme vehicle were entitled to distribute certain funds only amongst certain investors on the basis that these funds were held on trust for these specified investors. The situation in theRe Courtenaycases was thus markedly different from the submission that the defendant has made in the present application. The courts inRe Courtenay 2018andRe Courtenay 2019, in finding that a trust had arisen, said nothing about an individual investor’s ability to retain moneys that had been paid to him out of other investors’ moneys. Rather, all that was said was that the moneys held on trust for one group of investors should not be distributed to investors outside that specified group. Put differently, the courts in theReCourtenaycases only pronounced on the entitlements as between beneficiaries to a trust on the one hand and strangers to the trust on the other; they did not descend into the different issue of the entitlements of the trust beneficiariesinter se. 58 Further, another difficulty that arises is the fact that, on the defendant’s own case, similarQuistclosetrusts would have arisen in favour of every investor that advanced moneys to EAM. The Overwithdrawn Sums would therefore constitute moneys beneficially owned by other investors under individualQuistclosetrusts. In this regard, Mr Teo calls into question whether the defendant, as a stranger to theseQuistclosetrusts in favour of the other investors, has the standing to assert the existence of such trusts.46Foot Note 46×YICWS at para 45(d).I do not propose to resolve that question. However, I do say that, taking a step back, the defendant’s argument is essentially that, while the Overwithdrawn Sums are beneficially owned by neither EAM nor the defendant, the defendant should nevertheless be allowed to retain them simply because EAM is itself not beneficially entitled. Subject to more detailed arguments, that does not seem to be a particularly strong argument. My decision: the Overwithdrawn Sums are not subject to an institutional constructive trust (1) The applicable law 59 Because the defendant has referred to an “institutional constructive trust”,47Foot Note 47×DWS at para 12.it is helpful to begin with the distinction between an institutional constructive trust and a remedial constructive trust. The distinction was helpfully set out by Lord Browne-Wilkinson in the seminal House of Lords decision ofWestdeutscheLandesbank Girozentrale v Islington London Borough Council[1996] AC 669 (“Westdeutsche”) (at 714–715): Under an institutional constructive trust, the trust arises by operation of law as from the date of the circumstances which give rise to it: the function of the court is merely to declare that such trust has arisen in the past. The consequences that flow from such trust having arisen (including the possibly unfair consequences to third parties who in the interim have received the trust property) are also determined by rules of law, not under a discretion. A remedial constructive trust, as I understand it, is different. It is a judicial remedy giving rise to an enforceable equitable obligation: the extent to which it operates retrospectively to the prejudice of third parties lies in the discretion of the court. With that being said, the English courts do not recognise the remedial constructive trust, because of their “avers[ion] to the discretionary adjustment of property rights” (see the UK Supreme Court decision ofAngove’s Pty Ltdv Bailey and another[2016] 1 WLR 3179 at [27]). 60 On the other hand, the Singapore courts have been receptive to the remedial constructive trust. In the Court of Appeal decision ofChing Mun Fong (executrix of the estate of TanGeok Tee, deceased) v Liu Cho Chit[2001] 1 SLR(R) 856 (at [36]), the court held that,assumingthe remedial constructive trust applies in Singapore, no such trust arose on the facts of the case. Implied in this reasoning is that the court was clearly open to the possibility of the remedial constructive trust applying in Singapore. Similarly, the Court of Appeal inWeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Anna Wee”) (at [169]–[185]) discussed the availability of the remedial constructive trust as a remedy for a claim in unjust enrichment, without expressly rejecting the applicability of the doctrine in Singapore. 61 With that being said, while the doctrinal distinction between the two types of trusts is clear, how that line is to be drawn in practice is less clear. Several problems emerge in this regard, including whether new categories of constructive trusts may be recognised solely through the remedial constructive trust framework (see generally, Tang Hang Wu, “The Constructive Trust in Singapore: Five Persistent Puzzles” (2012) 22 SAcLJ 136). For present purposes, it is important to note that an institutional constructive trust only arises in certain species of fraud, and not inanycase where property is transferred in circumstances involving fraud. Thus, the High Court inNational Bank of Oman SAOG Dubai Branch v Bikash Dhamala and others[2021] 3 SLR 943 (at [52]) has observed that: … AlthoughLow Heng Leon Andy[Low Heng Leon Andyv Low Kian Beng Lawrence (administrator of the estate of Tan Ah Kng, deceased)[2011] SGHC 184] refers to “fraud” as one of the facts that can found an ICT, this does not refer to fraudsimpliciter, but to cases where the “defendant fraudulently relies on the informality of a transaction to deny the beneficial interest of the claimant” (seeSnell’s Equity(John McGhee gen ed) (Sweet & Maxwell, 33rd Ed, 2014) at para 26-011). … [emphasis in original] 62 The learned authors ofSnell’s Equity(John McGhee and Steven Elliott QC gen ed) (Sweet & Maxwell, 34th Ed, 2020) (“Snell’s Equity”) explain further thatWestdeutscheis authority for the principle that an institutional constructive trust would only be imposed in circumstances of “fraudulent taking”, which relates to fraud involving the outright taking of a person’s property. This stands in contrast to cases involving a “fraudulently induced transfer” (seeSnell’s Equityat paras 26-012–26-014). (2) The Overwithdrawn Sums are not subject to an institutional constructive trust 63 In the present application, it is clear that the moneys paid by the defendant under the LOAs do not amount to “fraudulent taking” so as to give rise to an institutional constructive trust on the basis ofWestdeutsche. This is because the defendant voluntarily handed over the principal sum to EAM pursuant to the LOAs. It likewise cannot be said that the moneys were received by EAM in circumstances where it relied on the informality of the transaction to deny the beneficial interest of the defendant who paid it in. Therefore, the Overwithdrawn Sums are not subject to an institutional constructive trust.",
        "Whether the claimants have fundamentally erred in their choice of avoidance provisions": "The parties’ positions 64 As a final preliminary issue, the defendant argues that the claimants’ reliance on s 224 of the IRDA “vexes the policy underpinnings of this section”.48Foot Note 48×DWS at para 21.For reasons that I will explain below, I consider that this argument could, in principle, have been raised in relation to the claimants’ action under s 73B of the CLPA due to a conceptual affinity between s 224 of the IRDA and s 73B of the CLPA. I thus deal with this objection both as against s 224 of the IRDA (as the defendant has framed it) as well as against s 73B of the CLPA. 65 As I see it, the defendant’s objection is based on a conceptual distinction between two types of avoidance provisions. The “crucial distinction” lies in the differing “policy objectives” that each category of avoidance provisions serves.49Foot Note 49×DWS at para 23.The first category targets transactions that have the effect of causing a diminution in EAM’s assets. The second category targets transactions that confer an unfair or improper advantage on the defendant (without necessarily causing a diminution in EAM’s assets). According to the defendant, s 224(1) of the IRDA properly falls within the first category.50Foot Note 50×DWS at para 22.Drawing upon this, the defendant argues that the claimants have erred in law by invoking s 224(1) of the IRDA to achieve the purpose of the second category:51Foot Note 51×DWS at para 23. … the manner in which the [claimants] have fashioned their claim shows that the real issue which they are pursuing here is anunevendistribution of assets, and not that there has been adissipation/diminution of assets. Only the latter can be caught by Section 224 of the IRDA. [emphasis in original] 66 At this juncture, I reiterate that the defendant could have raised this same objection in respect of the claim under s 73B of the CLPA. This is because, although the elements of s 73B of the CLPA differ from those of s 224(1) of the IRDA, the former is a provision that would properly fall within the first category of avoidance provision. I draw this conclusion from the Report of the Insolvency Law Review Committee 2013, where it was observed that the “underlying policy rationale” of s 73B of the CLPA was “the preservation of the net asset value of the company for distribution amongst its creditors” (see Singapore, Ministry of Law,Report of the Insolvency Law Review Committee: Final Report(2013) (Chairperson: Lee Eng Beng SC) (the “Report”) at p 185). To use the distinction drawn by the defendant, this statement in the Report makes clear that s 73B of the CLPA, similar to s 224(1) of the IRDA, redressesdiminutionof assets rather than unevendistributionof assets. Thus, if the defendant is correct on its objectionvis-à-visthe claimants’ reliance on s 224(1) of the IRDA, it would necessarily follow that the claimants’ invocation of s 73B of the CLPA must also fail on the same basis. 67 On the other hand, the claimants argue that they have properly invoked s 224(1) of the IRDA (and, for the reason I have just explained, s 73B of the CLPA as well). In sum, the claimants’ submission is that the defendant’s objection would only succeed if the claimants were seeking to claw back not only the Overwithdrawn Sums, but also repayments of the defendant’s initial investment. Since the claimants have limited their claim to the Overwithdrawn Sums, they are seeking to redress a diminution in EAM’s assets rather than an unfair distribution of EAM’s assets to EAM’s creditors (which include the defendant).52Foot Note 52×CFWS at paras 5.1.1–5.1.6.Put simply, the claimants have framed their claim to precisely come outside the scope of the defendant’s objection. My decision: the claimants have not fundamentally erred in their choice of avoidance provisions (1) The applicable law 68 At the outset, I agree with the defendant that the clawback provisions can, as a general matter, be grouped into two categories. The defendant is also correct in its identification of the purpose of each category. However, given the centrality of the distinction between these two categories to the defendant’s submission (as well as the difficulty that it has historically posed), I find it apposite to start by explaining this distinction in greater detail. 69 In this regard, a useful starting point is the leading treatise,Goode on Principles of Corporate Insolvency Law(Kristin van Zwieten gen ed) (Sweet & Maxwell, 5th Ed, 2018), where the relevant distinction is elucidated in the following terms (at para 13-03): All but two of the grounds of avoidance known to insolvency law involve the unjust enrichment of a particular party at the expense of the other creditors … Once this crucial point is grasped, much of the legislative structure falls into place. The unjust enrichment may affect other creditors in one or two ways. It may reduce the company’s net asset value, as where it involves a transfer of the insolvent company’s property to another party, otherwise than as a creditor, at a wholly inadequate price or a purchase of property by the company at an inflated price; or it may, without disturbing the company’s net asset position, involve payment or transfer to a particular creditor in satisfaction or reduction of his debt, with the result that the creditor is put in a better position than if the company had immediately entered insolvency proceedings without the payment or transfer having been made, and the ordinary distributional rules (including, in the case of non-preferential unsecured creditors, the statutory provisions for rateable or pro rata distribution) applied. The avoidance provisions may thus be seen as necessary both to preserve the company’s net asset value and to ensure equality of distribution, at least among classes of creditors. 70 This conceptual distinction between the two categories of avoidance provisions lay at the heart of the Court of Appeal decision inRothstarGroup Ltd v Leow Quek Shiong and other appeals[2022] 2 SLR 158 (“Rothstar”). The issue inRothstarwas whether a grant of security by a debtor in respect of its existing debt could constitute a transaction at an undervalue under s 98(3) of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (the “BA”), which isinpari materiato s 224 of the IRDA (seeRothstarat [23]). The Court of Appeal answered in the negative. In support of this conclusion, Steven Chong JCA focused on the fact that such a transaction had no effect on the debtor’s net asset position. As a result, such a transaction was properly within the purview of the second category of avoidance provisions (addressing unfair preferences) rather than the first category (on undervalue transactions) (seeRothstarat [39]–[40]). 71 The position in relation to a grant of security in respect of a third party’s existing debt provides a useful contrast. In this situation, the Court of Appeal had little difficulty in finding that such a transaction could be impugned as an undervalue transaction, as Chong JCA explained in the following terms (seeRothstarat [43]): … [The position where security is granted in respect of the grantor’s own existing debt] cannot be applied as a blanket rule toallgrants of security for existing debts. In particular, it clearly does not apply where the relevant security is granted in respect of athird party’sexisting debt. In those circumstances, it is clear that the grant of securitywouldreduce the net assets of the grantor as it would impose anewliability which the grantor did not previously have. … [emphasis in original] 72 At this point, I can summarise the import ofRothstaras follows: (a) A grant of security in respect of the grantor’sownexisting debt is a transaction with no effect on the company’s net asset position because the decrease (by the grant of security) in the company’s available assets for distribution to its unsecured creditors would be correspondingly matched by a decrease in its unsecured liabilities on the other side of the balance sheet. The advantage received by the creditor, who is the beneficiary of the grant of security, may be disgorged through the provisions addressing the reversal of unfair preferences (eg, s 225 of the IRDA), subject to the elements of the relevant provision being established. (b) A grant of security in respect of athird party’sexisting debt is a transaction thatdoesadversely affect the company’s net asset position because the decrease (by the grant of security) in the company’s available assets for distribution to its unsecured creditors would not be correspondingly matched by a decrease in its unsecured liabilities on the other side of the balance sheet. The disadvantage engendered on the company’s unsecured creditors through the reduction of the assets available to satisfy their claims may be reversed through the provisions redressing undervalue transactions (eg, s 224 of the IRDA and s 73B of the CLPA), also subject, of course, to the requirements under the relevant provision(s) being established. 73 To put the point across more directly, to the extent that the company can be said to be applying assets towards the discharge of its own existing debt or other liability, such a transaction wouldnotamount to an undervalue transaction but a potential preference. 74 For the avoidance of doubt, I have used a grant of security by an insolvent company in the illustration above simply because that was the relevant transaction on the facts ofRothstar. The same analysis would apply,mutatis mutandis, to any transaction that involves the expenditure of the company’s assets. This would include a payment of money by EAM to the defendant, as in the present case. 75 The question that arises is, of course, how this distinction bears out in the present context of a Ponzi scheme. If the claimants can establish that the payments of the Overwithdrawn Sums cannot be properly characterised as debt repayments or going towards the discharge of liabilities owed by EAM to the defendant, it would follow from the discussion above that their reliance on s 224(1) of the IRDA and s 73B of the CLPA (being provisions that reverse transactions causing a deterioration of the company’s net asset position) is not misplaced. (2) The claimants have not erred in relying on s 224(1) of the IRDA and s 73B of the CLPA 76 Although it was not cited to me by both parties, the UK Supreme Court decision ofStanfordInternational Bank Ltd (in liquidation) v HSBC Bank plc[2023] AC 761 (“SIB v HSBC”)would seem, at first blush, to suggest that payments out of a Ponzi scheme are in the nature of debt repayments such that they ought to be challenged as preferences rather than undervalue transactions (see generally Chua Rui Yuan, “The Aftermath of a Ponzi Scheme” [2023] LMCLQ 218). 77SIB v HSBCarose out of an infamous Ponzi scheme perpetrated by Robert Allen Stanford. The liquidators of Stanford International Bank (“SIB”), the vehicle that had been used to perpetrate the fraud, brought an action against SIB’s bank, HSBC. SIB alleged that, in failing to freeze SIB’s bank accounts by a certain time and continuing to execute payment instructions that had been issued to it, HSBC was in breach of itsQuincecareduty of care (named after the English High Court decision inBarclays Bank plc vQuincecare Ltd[1992] 4 All ER 363). The matter came before the UK Supreme Court in an appeal arising from HSBC’s application to strike out SIB’s claim. HSBC’s argument was that, even if liability for breach of duty were assumed in favour of SIB, SIB’s claim would fail in any event as it had suffered no loss because the payments executed by HSBC went towards the discharge of SIB’s liabilities to its creditors. Given that the question of breach was assumed for the purposes of HSBC’s striking-out application, I do not understand the UK Supreme Court’s subsequent decision inPhilipp v Barclays Bank UK plc[2023] 3 WLR 284 (“Philipp”), where it undertook a root and branch re-examination of the juridical basis of theQuincecareduty, to have the effect of casting any doubt on its decision on the narrowly-framed issue inSIB v HSBC(seeSIB v HSBCat [4];Philippat [52]). 78 Returning toSIB v HSBC, the UK Supreme Court (by a majority of four to one), accepted HSBC’s submission that SIB had suffered no loss. The concurring judgment of Lord Leggatt JSC is particularly relevant to the issues that have arisen in the present application. First, Lord Leggatt summarised HSBC’s submission in the following terms (at [38]): HSBC has applied to strike out this claim. Its short point is that, even if SIB were to succeed at a trial in establishing that HSBC owed such a duty to SIB of which HSBC was in breach, SIB cannot show that the breach caused SIB to suffer any loss. It is agreed that, although SIB did not enter into liquidation until 15 April 2009, at the time when the disputed payments were made the company was heavily insolvent on a balance sheet basis, as its liabilities vastly exceeded its assets. But the payments did not increase SIB’s liabilities any further and thereby make its net asset position any worse. This is because SIB owed the money paid to the investors who received it. The payments of £116m out of SIB’s accounts therefore reduced SIB’s liabilities by an equal amount and left its net asset position unchanged. The learned judge considered “the logic of this argument as unassailable”, as “[t]here is no way of escaping the simple truth that paying a valid debt does not reduce the payer’s wealth” (at [40]). 79 More interestingly, however, is how Lord Leggatt linked this to the avoidance provisions. In particular, the learned judge recognised the distinction between the two categories of avoidance provisions that the defendant has sought the protection of in the present application (at [48]): … insolvency laws typically enable some transactions entered into before the commencement of winding up which have reduced the assets available to distribute in the liquidation to be reversed. Such provisions are of two broad kinds. One kind is aimed at transactions which have reduced the company’s net assets during a specified period prior to the commencement of winding-up – for example, by giving away an asset or selling it for significantly less than it was worth. The other kind of provision is aimed at wrongful preferences: that is, transactions which, although they have not affected the company’s net asset position, have unjustly enriched a particular creditor by putting that creditor in a better position than it would have been if the company had already gone into liquidation. … 80 Lord Leggatt went on to hold that, if the payments made by SIB were to be challenged under an avoidance provision, it would have been properly through a provision dealing with unfair preferences rather than undervalue transactions (at [49]): The disputed payments made out of SIB’s accounts with HSBC were not transactions at an undervalue, as they reduced the company’s liabilities by an equal amount and therefore had no effect on its net asset position. Any attempt by the liquidators to reverse the transactions under insolvency law had therefore to be based on a contention that the payments were unlawful preferences. Nevertheless, this was not possible on the facts because the applicable statutory insolvency regime – namely, Antiguan insolvency law – did not contain provisions allowing for the unwinding of unfair preferences (at [51]). This thus explains the way that SIB had framed its claim inSIB v HSBC: being unable to pursue restitution from the payees (ie, the creditors), SIB instead sought compensation from its bank for its part in making out these payments. 81 On first impression, Lord Leggatt’s reasoning would appear to support a general proposition that payments out of a Ponzi scheme vehicle (as EAM was) cannot be challenged as undervalue transactions, thereby supporting the defendant’s argument that the claimants’ reliance on s 224(1) of the IRDA and s 73B of the CLPA is misplaced. However, on closer inspection, I do not think thatSIB v HSBClays down any such general proposition. Ultimately, in my view, the characterisation of payments out of a Ponzi scheme must be considered on the specific facts of each case. 82 In my judgment, Lord Leggatt’s reasoning inSIB v HSBC, which I have set out above, is distinguishable and does not apply to the present case. Lord Leggatt’s reasoning, and the UK Supreme Court’s decision generally, was premised on the court’s characterisation of the payments by SIB being repayments of SIB’s debts. That being the case, in line with what the Court of Appeal decided inRothstar, it is correct that they could not be impugned as undervalue transactions due to there being no change in the SIB’s net asset position. It follows that, if the payments of the Overwithdrawn Sums cannot similarly be characterised as payments of debts owed by EAM to the defendant, then the present application is distinguishable from the situation inSIB v HSBC. 83 I find that the present application is so distinguishable. For reasons which I will explain later, I find that the Overwithdrawn Sums cannot be characterised as debts owed by EAM to the defendant because, under the terms of the LOAs, EAM never became obliged to pay profits on the value of the Overwithdrawn Sums to the defendant. This is because, as I will explain in detail below, under the terms of the LOAs, EAM would only have been liable to pay profits on the defendant’s investment if Poseidon Nickel purchased by EAM appreciated in value. Since EAM did not, in fact, invest in any Poseidon Nickel, there would never have been any appreciation in value of Poseidon Nickel owned by EAM so that EAM would come under a liability, or incur a debt, to pay profits of the value of the Overwithdrawn Sums to the defendant. Since the payment of the Overwithdrawn Sums to the defendant did not go to the discharge of any liabilities owed by EAM to the defendant, they fall outside the realm of unfair preference. 84 I therefore accept the claimants’ argument that, having limited their claim to only the Overwithdrawn Sums, they have taken themselves outside the scope of the defendant’s objection.",
        "Whether the Overwithdrawn Sums were paid to the defendant with the intent to defraud creditors of EAM within the meaning of s 73B of the CLPA": "85 Having resolved the three preliminary issues above in favour of the claimants, I turn to deal with the substance of the present application, starting with arguments in relation to the CLPA.",
        "The continued applicability of s 73B of the CLPA": "86 I begin with s 73B of the CLPA, which provides as follows: Voluntary conveyances to defraud creditors voidable. 73B.—(1)  Except as provided in this section, every conveyance of property, made whether before or after 12th November 1993, with intent to defraud creditors, shall be voidable, at the instance of any person thereby prejudiced. (2)  This section does not affect the law relating to bankruptcy for the time being in force. (3)  This section does not extend to any estate or interest in property disposed of for valuable consideration and in good faith or upon good consideration and in good faith to any person not having, at the time of the disposition, notice of the intent to defraud creditors. 87 Although s 73B of the CLPA was repealed on 30 July 2020, reg 15 of the Insolvency, Restructuring and Dissolution (Saving and Transitional Provisions) Regulations 2020 provides that s 73B of the CLPA continues to apply to any conveyance of property before 30 July 2020. Further, although s 73B was repealed before the claimants commenced the present application, they can nevertheless rely on s 73B because the provision was in force when the cause of action accrued (see the Court of Appeal decision ofQuah Kay Tee v Ong and Co Pte Ltd[1996] 3 SLR(R) 637 (“Quah Kay Tee”) at [10]). Therefore, because the latest transaction between EAM and the defendant occurred in February 2020, s 73B applies in the present application. 88 I should note that, following the entry into force of the IRDA on 30 July 2020, s 73B of the CLPA appears in a different form in s 438 and s 439 of the IRDA. The latter sections do not apply in the present application because no relevant transaction in relation to the Overwithdrawn Sums occurred after 30 July 2020.",
        "The parties’ positions": "181 I turn finally to the arguments that centre on whether the defendant was unjustly enriched. The claimants submit that the defendant was unjustly enriched by the payment of the Overwithdrawn Sums at the expense of EAM, and that the relevant unjust factor here is failure of consideration or failure of basis. This is because, there being no appreciation of Poseidon Nickel purchased by EAM, the payment of the Overwithdrawn Sums to the defendant lacked consideration. Consequently, the defendant ought to make restitution of the Overwithdrawn Sums to the claimants.74Foot Note 74×CWS at paras 7.2.1–7.2.2. 182 The defendant submits that the claimants may not recover the Overwithdrawn Sums pursuant to the LOAs. This is because, in the defendant’s submission, the claimants cannot establish the unjust factor of total failure of consideration.75Foot Note 75×DWS at para 96.Further, the defendant contends that it may in any event rely on the defence of change of position. Because it acted in good faith in changing its position in reliance of its receipt of the Overwithdrawn Sums, it would be inequitable for the court to order restitutionary recovery against it.76Foot Note 76×DWS at para 97. 183 Mr Teo submits that there is no unjust factor giving rise to a claim for unjust enrichment. In particular, the unjust factor of total failure of consideration or failure of basis does not arise in the present application. This is because total failure of consideration must be distinguished fromabsenceof consideration, and similarly, failure of basis is distinct fromabsenceof basis.77Foot Note 77×YICWS at paras 165–182.",
        "My decision: the Overwithdrawn Sums were paid to the defendant with the intent to defraud creditors of EAM within the meaning of s 73B of the CLPA": "The broadly applicable law 92 Under s 73B of the CLPA, a voluntary conveyance that was entered into with the intention of defrauding creditors can be set aside. The relevant principles are as follows: (a) The claimant bears the burden of proving that: (i) there had been a conveyance of property; (ii) that this conveyance was made with the intent of defrauding creditors; and (iii) that he was a person who was prejudiced by the foregoing conveyance of property. The defendant can defeat the claim by establishing that: (i) he acquired the property for valuable consideration and in good faith or for good consideration and in good faith; and (ii) he did not have notice of the claimant’s intent to defraud his creditors (see the High Court decision ofWong Ser Wan v Ng Bok Eng Holdings Pte Ltd and another[2004] 4 SLR(R) 365 (“Wong Ser Wan”) at [5] and [27]). (b) The intent to defraud creditors may be evidenced by actual fraud or constructive fraud. For constructive fraud, if a person conveys property to his creditors for no consideration or for nominal consideration and that person is then insolvent or becomes insolvent by reason of the conveyance, a fraudulent intent would be “irrebuttably imputed to that person, even if he did not subjectively intend to defraud his creditors” (see the High Court decision ofSim Guan Seng and others v One Organisation Ltd and others[2023] 3 SLR 590 (“Sim Guan Seng”) at [150]). (c) For the issue of good faith in the defence in s 73B(3), the transferee must possess more than merely “a belief that all the steps have been regularly and properly done”. Instead, “the transferee must have no reason to believe that there is anything dubious about the transaction” (seeWong Ser Wanat [58]). The specific meaning of “good consideration” and “valuable consideration” under s 73B(3) 93 At this point, given the centrality of the defence under s 73B(3) to the present application, I pause to make some observations on its scope. I focus specifically on the requirement that the defendant provide “good consideration” or “valuable consideration”. 94 The appropriate starting point is, of course, the plain wording of the statute. In this regard, s 73B(3) of the CLPA excludes dispositions of property made by a person with intent to defraud his creditors where such disposition is “for valuable consideration and in good faith or upon good consideration and in good faith” (along with another requirement of the defendant not having notice of the transferor’s fraudulent intent). In my view, the natural reading of this phrase is that it sets out two distinct ways through which a defendant can satisfy the requirement of providing consideration for the disposition: (a) valuable consideration and in good faith; and (b) good consideration and in good faith. This is for two reasons. The first is that the word “or” suggests, on its face, a disjunctive interpretation. The second is the canon of construction that Parliament shuns tautology and does not legislate in vain, and that a court should therefore endeavour to give significance to every word in an enactment (see the Court of Appeal decision inTan Cheng Bock v Attorney-General[2017] 2 SLR 850 at [38]). I find that this principle operates more than once in the context of s 73B(3) of the CLPA. Indeed, the fact that Parliament has used both “valuable” and “good” separately indicates that the two should not be read as mere synonyms of each other. Further, the fact that “and in good faith” is repeated, being appended at the end of “valuable consideration” and “good consideration” each, suggests that the draftsman’s intention is for “valuable consideration and in good faith” to be one composite and “good consideration and in good faith” to be read as another composite. 95 What then is the significance of there being two disjunctive limbs to the consideration requirement in s 73B(3) of the CLPA? In my view, the significance is that the requirement of “good consideration” does not require an inquiry into the value of the consideration provided by the defendant, such that nominal consideration could suffice to satisfy that requirement. This is because “valuable consideration”, on its face, requires that the consideration provided by the defendant be of adequate value; and, as discussed above, the requirement of “valuable consideration” cannot carry the same meaning as the requirement of “good consideration”. Thus, the defendant may either provide “valuable consideration”, in the sense that it is of adequate value, or “good consideration”, which extends to include nominal consideration. Put differently, “consideration” in s 73B(3) of the CLPA carries the same meaning as under contract law. 96 This interpretation is supported by three reasons. First, by way of analogy, the Court of Appeal inRothstarheld that “consideration” in the context of s 98(3) of the BA “would appear to have the normal meaning ascribed to it by the law of contract” (at [24]). I do not see why the same cannot be said in relation to s 73B(3) of the CLPA. Although it is located in a different statute, I have noted above at [66] that s 73B(3) of the CLPA and s 98(3) of the BA (which isinpari materiato s 224(1) of the IRDA) serve a common purpose of preventing a deterioration in a debtor’s net asset position. It therefore makes sense that “consideration” in s 73B(3) of the CLPA would carry the same meaning as in s 98(3) of the BA. 97 Second, I find that this interpretation of “consideration” is consistent with the structure of s 73B. As mentioned above, the requirement of an intent to defraud under s 73B(1) of the CLPA can be satisfied by proof of an actual intent to defraud or a presumed intent to defraud pursuant to the constructive fraud doctrine. Since the content of the presumption relates only to the transferor’s intent to defraud his creditors, it only relates to the cause of action under s 73B(1) and does not bear on the defence under s 73B(3). As such, where a cause of action under s 73B(1) is established by way of the constructive fraud presumption, it ought to remain possible for the defendant to avail himself of the defence under s 73B(3). An interpretation of s 73B(3) that excludes nominal consideration means that a defendant who has had the constructive fraud presumption successfully invoked against him would automatically be disqualified from the defence under s 73B(3) (because, as one would recall, one requirement for the presumption of constructive fraud to operate is that the conveyance be performed for nominal or no consideration). 98 Further, still on structure, I consider that to exclude nominal consideration from the scope of s 73B(3) would lead to an odd result. Specifically, it would mean that where an intent to defraud on the part of the transferor is actually proven, the claim could nevertheless be defeated by the defence under s 73B(3) of the CLPA. However, if an intent to defraud was not proved but merely presumed through the constructive fraud doctrine, no defence would be available. In my view, it does not make sense for a person who relies on apresumedintent to defraud to be at an advantage – in foreclosing the availability of a defence – relative to another who relies on aprovenintent to defraud. If there were to be any difference, one would have thought the exact converse to be true. 99 Third, the legislative history of s 73B of the CLPA also tends to support my interpretation. As the Court of Appeal noted inQuah Kay Tee, s 73B of the CLPA is a descendant of the Statute of 13 Elizabethan 1571 (c 5) (the “Elizabethan Statute”). On a comparison between s 73B of the CLPA and the Elizabethan Statute, one finds that the Elizabethan Statute only contained a reference to “good consideration” and not “valuable consideration” (see also, Tan Yock Lin, “Fraud on Creditors” [2012] Sing JLS 134 at 138, where the late learned Professor Tan made the same observation). Although the Report of the Review Committee on Insolvency Law and Practice (Cmnd 8556, 1982) – which led to the current Insolvency Act 1986 (c 45) (UK) (the “UK Insolvency Act”) – observed that “it is difficult in the context to give any logical meaning to ‘good’, as distinguished from ‘valuable’, consideration” (at para 1215), I consider the fact that valuable consideration was added in s 73B of the CLPA to lend credence to my interpretation that “valuable consideration” must carry a meaning distinct from “good consideration”, and more generally, that “valuable consideration and in good faith” and “good consideration and in good faith” are intended to be disjunctive limbs. 100 Finally, I am aware of the possibility that my interpretation of s 73B(3) as including nominal consideration may conflict with earlier decisions which have apparently disallowed the defence due to a perceived inadequacy of the consideration provided by the defendant. For example, inWong Ser Wan, the High Court in finding that the defendant could not rely on the defence in s 73B(3) of the CLPA noted that the consideration that had been provided for a property “was clearly inadequate”, while the consideration provided for shares “was an arbitrary figure chosen without regard to value at all” as “no attempt was made to ascertain their correct value” (at [62]). 101 I would observe, however, that my interpretation of the scope of permissible consideration under s 73B(3) is not inconsistent withWong Ser Wan. This is because Judith Prakash J (as she then was) stated that the defence failed because the defendants “ha[d] not been able to establish the elements of good faith and ignorance of the nefarious intention of … the transferor” (at [62]). This suggests that Prakash J considered the inadequacy of consideration for the property not as a failure to satisfy the requirement of “valuable consideration” or “good consideration”, but bearing on the other requirements of the defence under s 73B(3) (namely, good faith and lack of notice of the transferor’s intent to defraud his creditors). This would therefore be consistent with my interpretation that nominal consideration does notper sedisallow a defendant from relying on the defence. Indeed, I respectfully agree with Prakash J that inadequate consideration does bear on the other elements: as a matter of logic, the lower the consideration provided by the defendant, the more convincing it would take for a court to believe that he had acted in good faith or had no notice of the transferor’s improper intention. 102 On the other hand, a case which might not be reconcilable with my interpretation is the High Court decision inWangXiaopu v Koh Mui Lee and others[2023] 5 SLR 717 (“WangXiaopu”). Here, the court specifically stated that an inquiry into whether the property had been sold at an undervalue “would shed light on whether [the defendant] had provided good or valuable consideration for the property” (at [175]). Thus, unlikeWong Ser Wanwhere the court viewed the inadequacy of consideration through the lenses of good faith and/or notice of the transferor’s fraudulent intent, the court inWangXiaopuseems to have taken the view that the inadequacy of the consideration provided by the defendant would lead to a denial of the defence under s 73B(3) based on a failure to meet the requirement of “valuable consideration” or “good consideration”. 103 To the extent that the court inWangXiaopumay have assumed – because, in fairness, the issue was not actually raised or given express consideration – that nominal or inadequate consideration would lead to aper sedenial of the s 73B(3) defence, I would respectfully disagree. For all the reasons above, in particular, that this is the import of the plain wording of s 73B(3) of the CLPA, I hold that “valuable consideration” or “good consideration” are distinct requirements and that the latter includes nominal consideration. However, for the avoidance of doubt, s 73B(3) of the CLPA does not go so far as to provide a defence to a defendant who has provided no consideration at all. The relevant issues 104 Having considered the applicable law and the parties’ submissions, there are several issues I need to deal with in relation to the application of s 73B of the CLPA to the present application: (a) First, whether the claimants’ reliance on s 73B of the CLPA is appropriate having regard to the provision’s historical purpose. (b) Second, whether the payment of the Overwithdrawn Sums falls within the definition of “conveyance” as set out in s 2 of the CLPA. (c) Third, whether the Overwithdrawn Sums were paid with the intent of defrauding creditors. (d) Fourth, whether the defendant provided valuable consideration to come within the defence in s 73B(3) of the CLPA. It will be seen that the last issue requires more consideration. The claimants’ reliance on s 73B of the CLPA is appropriate having regard to the provision’s purpose 105 First, I reject the defendant’s argument that s 73B of the CLPA applies only when: (i) the fraudulent transfer frustrates recovery by “all” of the creditors; and (ii) the debtor transferred the assets to another with the express purpose of reclaiming them subsequently.61Foot Note 61×DWS at para 69. 106 It is relevant to start by considering the historical background to s 73B of the CLPA. (a) To begin with, in 1571, the Elizabethan Statute, otherwise known as the Fraudulent Conveyances Act 1571, provided for the setting aside of fraudulent transactions when there was bankruptcy or insolvency. The relevant provisions were as follows: For the avoiding and abolishing of feigned, covinous and fraudulent feoffments, gifts, grants, alienations, conveyances … which feoffments, gifts, grants, alienations, conveyances … have been and are devised and contrived of malice, fraud, covin, collusion or guile, to the end, purpose and intent, to delay, hinder or defraud creditors and others of their just and lawful actions, suits, debts. … II    Be it therefore … enacted … that all and every feoffment, gift, grant, alienation, bargain and conveyance of lands … had or made to or for any intent or purpose before declared and expressed, shall be from henceforth deemed and taken … to be clearly and utterly void, frustrate, and none effect. … … VI    Provided also … that this Act … shall not extend to any estate or interest in lands, tenements, hereditaments, leases, rents, commons, profits, goods or chattels, had, made, conveyed or assured … which Estate or Interest is or shall be upon good consideration and bona fide lawfully conveyed or assured to any person or persons … not having at the time of such conveyance or assurance to them made, any manner of notice or knowledge or such covin, fraud or collusion as is aforesaid … (b) In 1924, the Law of Property (Amendment) Act 1924 (c 5) (UK) repealed the Elizabethan Statute. This was provided for in para 31 of Part II of the Third Schedule, which stated: 32  The following provisions shall be substituted for statute 13 Elizabeth c. 5:— “(1)  Save as hereinafter provided, every conveyance of property made whether before or after the commencement of this Act, with intent to defraud creditors, is voidable, at the instance of any person thereby prejudiced. (2)   This provision does not— (a)  affect the operation of a disentailing assurance, or the law of bankruptcy for the time being in force; or (b)  extend to any estate or interest in property conveyed for valuable consideration and in good faith, or upon good consideration and in good faith, to any person not having, at the time of the conveyance, notice of the intent to defraud creditors.” (c) In 1925, the above amendment was reproduced in s 172 of the Law of Property Act 1925 (c 20) (UK), with slight stylistic amendments: 172  Voluntary conveyances to defraud creditors voidable. (1)  Save as provided in this section, every conveyance of property, made whether before or after the commencement of this Act, with intent to defraud creditors, shall be voidable, at the instance of any person thereby prejudiced. (2)  This section does not affect the operation of a disentailing assurance, or the law of bankruptcy for the time being in force. (3)  This section does not extend to any estate or interest in property conveyed for valuable consideration and in good faith or upon good consideration and in good faith to any person not having, at the time of the conveyance, notice of the intent to defraud creditors. (d) Due to the entering into force of the Application of English Law Act 1993 (No 35 of 1993) (now, the Application of English Law Act 1993 (2020 Rev Ed)), the then Conveyancing and Law of Property Act (Cap 61, 1985 Rev Ed) was amended to include s 73B, which substantially replicates s 172 of the Law of Property Act 1925 (c 20) (UK). 107 It will be recalled that the defendant’s primary position is that the Elizabethan Statute was intended to apply only to a specific form of transaction. In this regard, the defendant relies on Amy Sepinwall’s academic commentary that the Elizabethan Statute was only intended to deal with the situation where the debtor seeks to frustrate recovery on the part of all of his creditors, by transferring title of his assets to another entity with the express purpose of reclaiming them once the debtor was beyond the reach of his creditors. By this argument, the Elizabethan Statute “did not seek an even distribution among all creditors”, but “merely sought to prevent situations where the debtor attempted to safeguard assets for his own enjoyment” (see Amy J Sepinwall, “Righting Others’ Wrongs: A Critical Look at Clawbacks in Madoff-type Ponzi Schemes and Other Frauds” (2012) 78(1) Brooklyn Law Review 1 at 25–26).62Foot Note 62×Defendant’s Bundle of Authorities dated 12 May 2023 (“DBOA”) Vol 2 at pp 1592–1593.However, in my view, the defendant’s position is inconsistent with the Court of Appeal’s pronouncement inQuah Kay Tee(at [26]) that the purpose of the Elizabethan Statute is to “prevent debtors from dealing with their property in any way to the prejudice of their creditors”. The statute is thus intended to apply widely, and not to a specific form of transaction as contended by the defendant. 108 In any event, regardless of the purpose of the Elizabethan Statute, I do not think that Parliament intended for s 73B of the CLPA to be applied in the restrictive manner that the defendant proposes. 109 To begin with, based on a plain reading of s 73B, all that is required is that: (a) the debtor conveyed property; (b) the debtor intended to defraud creditors; and (c) the creditor seeking relief was prejudiced by the foregoing conveyance of property. The statutory provision does not require the debtor to transfer title of his assets to another with the express purpose of reclaiming them once the debtor was beyond the reach of his creditors. Had Parliament intended for this requirement – which might have been contemplated under the Elizabethan Statute – to apply in Singapore, it would have expressly included such a requirement in s 73B. The absence of this requirement must mean that s 73B does not apply in as restrictive a manner as the defendant seeks to make out. 110 Further, as a matter of policy, if s 73B applies only in the narrow situation when: (a) the fraudulent transfer frustrates recovery by “all” of the creditors; and (b) the debtor transfers the assets to another with the express purpose of reclaiming them subsequently, it is conceivable that debtors can avoid having their transactions set aside under s 73B by simply ensuring that neither requirement is satisfied. Section 73B of the CLPA is a provision that exists for the general protection of a debtor’s creditors. Indeed, unlike the other avoidance provisions, s 73B’s protection is comparatively broader as it is not limited by a requirement of proximity to the debtor’s insolvency (see the Court of Appeal decision inLarsen Oil and Gas Pte Ltd vPetroprod Ltd (in official liquidation in the Cayman Islands and in compulsory liquidation in Singapore)[2011] 3 SLR 414 at [55]). In line with the principle of purposive interpretation, the courts cannot endorse an interpretation that is so narrow that it would render the intended protection illusory. The payment of the Overwithdrawn Sums falls within the definition of “conveyance” in s 2 of the CLPA 111 Second, I am satisfied that the payment of the Overwithdrawn Sums constitutes a conveyance within the definition of s 2 of the CLPA. Section 2 provides that a conveyance “includes assignment, appointment, lease, settlement and other assurance made by deed on a sale, mortgage, demise or settlement of any property, and on any other dealing with or for any property”. Although the present application does not involve real property that one may expect when reading s 2, the statutory provision is broad enough to cover the payment of moneys pursuant to an agreement. Further, “property” is also defined in s 2 to include “real and personal property”. Thus, considering both definitions of “conveyance” and “property” in s 2, it must be the case that the payment of moneys constitutes a conveyance. Indeed, in the High Court decision ofSim Guan Seng(at [139]), the court held that “there can be no doubt” that the bankrupt’s transfer of shares to the second defendant was a conveyance of property. Similarly, there can be no doubt that the transfer of moneys was a conveyance of property for the purposes of s 73B of the CLPA. The Overwithdrawn Sums were paid with the intent to defraud creditors 112 Third, I find that the payment of the Overwithdrawn Sums to the defendant, being payments of fictitious profits under a Ponzi scheme, was made with the intent to defraud creditors. This is because: (a) the main characteristics of a Ponzi scheme give rise to constructive fraud, where fraudulent intent is presumed; and (b) in the alternative, the perpetrator of a Ponzi scheme actually intends to defraud existing and future creditors. 113 As a preliminary point, I begin by analysing the characteristics of a Ponzi scheme. It is apt to start with the Court of Appeal decision ofPerry,Tamar and another v Esculier, Jacques Henri Georges and another[2023] 2 SLR 30 (“PerryTamar (CA)”) (at [1]), where the court provided the following definition of such schemes: The essence of any Ponzi scheme entails the circulation of money among the scheme’s investors. Like in all Ponzi schemes, some investors suffer losses, others make gains depending on when they entered and exited their investment. Typically, later investors in a Ponzi scheme will not benefit because at some stage, the money cycle will run out. … 114 As the definition of a Ponzi scheme has been subject to limited discussion by the Singapore courts (though see the High Court decision ofTradewavesLtd v Standard Chartered Bank and another suit[2017] SGHC 93 at [2]), it is useful to set out the extensive discussion of Ponzi schemes by foreign courts, where succinct descriptions of such schemes have been provided: (a) In the English High Court decision ofBull v Gain Capital Holdings Inc[2014] EWHC 539 (Comm) (at [28]), the court stated that some of the investors will receive an extraordinarily high return, “not from profitable investment … but from money put in by other investors”. Therefore, a Ponzi scheme requires “enough funds [to] keep coming in to enable the fraud to be maintained”, and when this ceases to be the case, “unless a massive speculative gain can be achieved, the scheme is bound to collapse”. (b) The New South Wales Supreme Court inReCourtenay House Capital Trading Group Pty Limited (in liquidation)[2020] NSWSC 780 (at [15]), citing the Queensland Court of Appeal decision inR v Lovell[2012] QCA 43 at [30], defined a Ponzi scheme as follows: “a fraudulent investment operation that pays returns to investors from their own money or money paid into the scheme by subsequent investors rather than from any actual profit earned from money invested”. Because the scheme entices new investors by offering abnormally high and consistent returns, the perpetuation of a Ponzi scheme “requires an ever increasing flow of money from subsequent investors to keep the scheme going”. (c) Miller J in his minority opinion in the New Zealand Court of Appeal decision ofMcIntosh v Fisk[2016] 2 NZLR 783 (“McIntosh(CA)”) (at [107]) stated that the distinctive characteristic of Ponzi schemes is that they “do not generate profits sufficient to yield their promised profits but rather use new investor money to pay ‘profits’ and to repay existing investors, with each such payment exacerbating the scheme’s financial position”. (d) In Canada, the Supreme Court of British Columbia inTerry v Bryson[2014] BCSC 522 (at [2]) described a Ponzi scheme as “one in which the scheme operators do not make genuine investments with the funds provided by the investors”. The returns are fictional because “the initial investors are paid their returns from contributions made by later investors”. (e) In the US Court of Appeals for the Ninth Circuit decision ofReAgricultural Research Technology Group916 F.2d 528 (1990) (at 531), the court highlighted that a Ponzi scheme involves “an enterprise mak[ing] payments to investors from the proceeds of a later investment rather than from profits of the underlying business venture, as the investor expects”. Therefore, a Ponzi scheme is fraudulent because it “giv[es] other investors the impression that a legitimate profit making business opportunity exists, where in fact no such opportunity exists”. Also, the US Securities and Exchange Commission defines a Ponzi scheme as “an investment fraud that pays existing investors from funds collected from new investors”, where “scheme organizers often promise high returns with little or no risk” (see US Securities and Exchange Commission, Ponzi Schemes(accessed on 21 February 2024)). (f) In the Privy Council decision ofFairfield Sentry Ltd(in Liquidation) v Migani and others[2014] UKPC 9 (at [3]), Lord Sumption stated that “[i]t is inherent in a Ponzi scheme that those who withdraw their funds before the scheme collapses escape without loss, and quite possibly with substantial fictitious profits. The loss falls entirely on those investors whose funds are still invested when the money runs out and the scheme fails”. 115 From the foregoing, and despite the many ways in which a Ponzi scheme may be carried out, it is clear that the following characteristics are common to Ponzi schemes generally: (a) there is no genuine investment; (b) earlier investors received the moneys paid by subsequent investors, which the scheme disguises as fictitious profits; (c) to sustain the illusion of a profitable investment, there must be a constant inflow of moneys from investors; and (d) the scheme collapses when the moneys from subsequent investors are insufficient to pay earlier investors. 116 In the present application, based on the Agreed Facts, it is  not disputable that EAM was engaging in a Ponzi scheme, because it is an agreed fact that the purported nickel trading was non-existent (see [18(b)] above). It is also an agreed fact that the Overwithdrawn Sums were paid out of moneys invested by other investors in the Envy Companies, rather than any proceeds of the purported nickel trading (see [18(c)] above). Further, the scheme eventually collapsed in 2021. 117 I turn to explain my finding that the Overwithdrawn Sums were paid with the intent to defraud creditors. 118 To begin with, this is because a Ponzi scheme operator possesses an actual intention to defraud future and existing creditors. A Ponzi scheme operator must have intended to defraud future investors, because he must have known that the scheme will eventually collapse, but nevertheless makes payment to present investors. Therefore, the only reasonable inference is that the operator actually intended to defraud future investors (see the US District Court for the District of Utah decision ofIn Re Independent Clearing House Co77 BR 843 (1987) (“InRe Independent Clearing House Co”) at 860). 119 In this connection, there therefore exists in the US a “Ponzi scheme presumption”, where proof of a Ponzi scheme satisfies the requirement for actual intent, because transfers made in the course of a Ponzi scheme operation are presumed to have been made for no purpose other than to hinder, delay or defraud creditors (seeInre Manhattan Inv Fund Ltd397 BR 1 (NYSD US Bankruptcy Court, 2007) at 8; see also, David R Hague, “Expanding the Ponzi Scheme Presumption” (2015) 64 DePaul L Rev 867 (“Expanding the Ponzi Scheme Presumption”)). While this presumption has not been applied in Singapore, I consider that there are good reasons to adopt this presumption in Singapore. The result of adopting this presumption is that, by virtue of the existence of a Ponzi scheme in the present case, it is presumed that the Overwithdrawn Sums were paid with the actual intent to defraud EAM’s creditors. 120 For completeness, while I find that a Ponzi scheme may satisfy the requirements for constructive fraud, I conclude that they are not established in the present application. To begin with, the classic example of constructive fraud is “a voluntary conveyance made by a man deeply indebted” [emphasis in original omitted] (seeQuah Kay Teeat [23]). In this regard, a Ponzi scheme with no genuine investment and high promised rates of return is constructively fraudulent because it is insolvent from the outset, given that its total liabilities will always exceed its total assets from the moment that it takes in its first “investment” (see the US Bankruptcy Court for the Southern District of Ohio decision ofIn re Taubman160 BR 964 (1993) at 978). However, I note that EAM did notguaranteethat profits would be paid out. To the contrary, it promised only that investors would receive “a minimum equivalent to 85%” of its initial investment sum. As such, it cannot be concluded that there was constructive fraud. Finally, I disagree with the defendant’s submissions that, because EAM paid the Overwithdrawn Sums to keep the Ponzi scheme alive, it did not amount to an intent to hinder, delay, or defraud one’s creditors.63Foot Note 63×DWS at para 58.In this regard, I respectfully disagree with a concurring opinion in the US Court of Appeals for the Second Circuit inBernard, which is a decision the defendant relies on. InBernard, Circuit Judge Steven Menashi held in a concurring opinion (at [203]) that “it is unclear that the statutory phrase ‘intent to hinder, delay, or defraud’ [as was used in the Elizabethan Statute and adopted in § 548 of the US Bankruptcy Code] would by itself include repayments to creditors simply because such repayments are a critical part of the Ponzi scheme”. In my respectful view, the fact that payments of fictitious profits are a critical part of the Ponzi scheme does not mean that they cannot be, at the same time, made with an intent to hinder, delay, or defraud one’s creditors. To the contrary, such payments are a critical part of the Ponzi schemeprecisely becausethey are made with an intent to hinder, delay, or defraud the creditors. An intent to prolong the scheme by paying out fictitious profits is not mutually exclusive with an intent to hinder, delay or defraud the scheme’s creditors. Indeed, I would go so far as to postulate that they are two sides of the same coin, since the longer the scheme is dragged out, the greater the magnitude of the fallout that would ensue when the scheme finally unravels. 121 Accordingly, on the basis of the Agreed Facts, while I do not rely on the constructive fraud doctrine to presume an intent to defraud, I am satisfied that the Overwithdrawn Sums were paid with an actual intent to defraud EAM’s creditors. The defendant has not provided valuable consideration 122 Finally, I do not think that the defendant has provided valuable consideration as required by s 73B(3) of the CLPA. (1) There is no binding local authority on the analysis of valuable consideration in a Ponzi scheme 123 The defendant argues that the local decisions ofPerry Tamar (SICC)andPerry Tamar (CA)suggest that valuable consideration may be provided in a Ponzi scheme.64Foot Note 64×DWS at paras 42 and 78; Defendant’s Further Written Submissions dated 7 June 2023 (“DFWS”) at para 23.I disagree with the defendant’s reliance on these cases. Instead, I agree with the claimants that these cases can be sensibly distinguished. 124 InPerry Tamar (SICC), the court held that “the fact that an investment agreement may turn out to be a sham and the profits fictitious does not, in law, mean that there is no consideration for the payment out of moneys apparently owing” (at [152]). This was upheld inPerry Tamar (CA)(at [54]). As I have mentioned, the defendant claims that this is authority that valuable consideration may be provided by investors of a Ponzi scheme.65Foot Note 65×DWS at para 78.However, these observations were made in the context of whether a party was abona fidepurchaser for value without notice and in the context of applying Hong Kong law. In so far as the issues inPerry Tamar (SICC)andPerry Tamar (CA)are not on all fours with that in the present application, these observations may be of limited value to the present application. (2) There is no valuable consideration on the terms of the LOAs 125 Further, on the facts of the present application, pursuant to the terms of the LOAs, the defendant did not in fact provide any valuable consideration for its receipt of the Overwithdrawn Sums. 126 To begin with, it is well established that consideration for a promise is one of the necessary requirements to establish that a contract has been formed. Traditionally, consideration for a promise can take the form of a benefit or detriment; it is usually “merely the same thing looked at from different points of view”, because a benefit to the seller is usually a detriment to the buyer (seeChitty on Contracts(Sweet & Maxwell, 34th Ed, 2021) (“Chitty on Contracts”) at para 6-003). It is also well established that a contract must be performed precisely as agreed between the contracting parties (seeChitty on Contractsat paras 24-001 to 24-004). Mr Teo relies on this principle to submit that the principal sum can only be consideration for the exact obligations set out in the LOAs, which were not performed.66Foot Note 66×YICWS at para 101.Further, the claimants and Mr Teo submit that pursuant to cll 1.2, 1.8, 2.1, and 3 (see [8] above), the defendant is entitled to the Overwithdrawn Sums only where there is an actual appreciation of the value of the Poseidon Nickel purchased by EAM in accordance with the LOAs.67Foot Note 67×CWS at para 4.5.1; YICWS at paras 100–104.And for there to be an actual appreciation of the value of the Poseidon Nickel, there must have been an underlying investment to begin with. Because there was never any investment to begin with, there could not have been actual appreciation of the value of the Poseidon Nickel, and therefore the defendant could not be said to have provided consideration for the Overwithdrawn Sums that it was never entitled to. 127 I agree with the claimants’ and Mr Teo’s conclusion. In my view, the relevant principle is that consideration must be “referrable” to the promise (see Michael Furmston and G J Tolhurst,Contract Formation: Law and Practice(Oxford University Press, 2nd Ed, 2016) (“Contract Formation”)at 356). As the learned authors ofContract Formationexplain (at 356), “[i]t is a requirement for an enforceable contract that ‘the statement or announcement which is relied on as a promise was really offered as consideration for the doing of the act [or the giving of a counter-promise], and that the act [or counter-promise] was really done in consideration of a potential promise inherent in the statement or announcement’”, citing the High Court of Australia decision ofAustralian Woollen Mills Pty Ltd v Commonwealth(1954) 92 CLR 424 (“Commonwealth”) at 456. Indeed, inCommonwealth, the court provided the following example to explain this requirement of referability (at 456–457): … [T]here must subsist, so to speak the relation of aquid pro quo. One simple example will suffice to illustrate this. A, in Sydney, says to B in Melbourne: “I will pay you £1,000 on your arrival in Sydney”. The next day B goes to Sydney. If these facts alone are proved, it is perfectly clear that no contract binding A to pay £1,000 to B is established. For all that appears there may be no relation whatever between A’s statement and B’s act. It is quite consistent with the facts proved that B intended to go to Sydney anyhow, and that A is merely announcing that, if and when B arrives in Sydney, he will make a gift to him. The necessary relation is not shown to exist between the announcement and the act. Proof of further facts, however, might suffice to establish a contract. For example, it might be proved that A, on the day before the £1,000 was mentioned, had told B that it was a matter of vital importance to him (A) that B should come to Sydney forthwith, and that B objected that to go to Sydney at the moment might involve him in financial loss. These further facts throw a different light on the statement on which B relies as an offer accepted by his going to Sydney. They are not necessarily conclusive but it is now possible to infer (a) that the statement that £1,000 would be paid to B on arrival in Sydney was intended as an offer of a promise, (b) that the promise was offered as the consideration for the doing of an act by B, and (c) that the doing of the act was at once the acceptance of an offer and the providing of an executed consideration for a promise. The necessary connection or relation between the announcement and the act is provided if the inference is drawn that A has requested B to go to Sydney. 128 The learned authors further explain (at 358–360) that the concept of “referability” has two aspects, namely: (a) causation; and (b) intention and the need for there to be a bargain. In terms of causation, the learned authors explain that “there must be evidence that one reason why the counter-promise was made or the relevant act carried out was to purchase the promisor’s promise”. There must, therefore, be alinkbetween the promisee’s act or promise and the promisor’s promise. As the learned authors explain (at 358), this is related to the requirement that there be an intention to contract. If a promisee’s act is not related to the promisor’s promise, then it might be said that the promisee never intended to contract withthatpromisor (see, for example, the High Court of Australia decision ofRv Clark(1927) 40 CLR 227). As for the second aspect of intention and the need for there to be a bargain, it is necessary from the promisor’s perspective that the counter-promise or act is set up as the price for the promisor’s promise such that a bargain results. Thus, as Lindley LJ (as he then was) said in the seminal English Court of Appeal decision ofCarlill v Carbolic Smoke Ball Co[1893] 1 QB 256 (at 264), “[d]oes not the person who acts upon this advertisement and accepts the offer put himself to some inconvenience at the request of the defendants”? 129 All that said, this principle that consideration must be “referrable” to the promise needs to be adapted to fit within s 73B(3) of the CLPA. This is because while a promise can be consideration if referrable to a counter-promise, with no necessity that the counter-promise is eventually performed, s 73B(3) is very specific that the valuable consideration must be in relation to the “estate or interest in property disposed of”. This would therefore preclude any argument that the defendant did provide valuable consideration by way of its promise to pay the initial investment sumfor(and referable to) EAM’s counter-promise to perform its obligation as set out in cl 3 of the LOAs. Instead, for the defendant to come within the defence in s 73B(3) of the CLPA, it must prove that any valuable consideration it gave to EAM, in the form of the initial investment sum, was valuable considerationforthe Overwithdrawn Sums. The requirement of referability necessitates a connection between the defendant’s promise to pay the initial investment sumandits receipt of the Overwithdrawn Sums. 130 This is where the defendant faces an insurmountable difficulty. By cl 3 of the LOAs, the defendant’s payment of the initial investment sum was valuable consideration for EAM’s counter-promise to: (a) repay this sum; and (b) had there been an appreciation of the Poseidon Nickel, to pay the “appreciation” sum, less the relevant costs and commission due to EAM (see [8] above). However, EAM’s eventual payment of the Overwithdrawn Sums has nothing to do with this counter-promise in cl 3 under the LOAs. 131 In this regard, since there can be no investment to speak of in a Ponzi scheme, there could have been no appreciation of the Poseidon Nickel purchased by EAM: as the operator of a Ponzi scheme, EAM did not invest in any Poseidon Nickel. If this is the case, then the defendant could never have obtained, and so did not obtain, any payment that constituted appreciation on its “investment” from EAM. Nevertheless, the defendant received the Overwithdrawn Sums. Yet, the consideration provided by the defendant in the form of its initial investment sum was neverforthe Overwithdrawn Sums. Rather, the defendant’s consideration was provided for EAM’s specific counter-promise under cl 3 of the LOAs to pay the “appreciation” sum. However, because there was no investment to speak of, there could never have been any appreciation of the Poseidon Nickel purchased by EAM, and so EAM could never have performed cl 3 of the LOAs. Accordingly, the payment of the Overwithdrawn Sums could not have been, and so was not, in discharge of EAM’s obligation to pay the “appreciation” sum, less the relevant costs and commission due to EAM, under cl 3 of the LOAs. Therefore, the payment of the Overwithdrawal Sums was an extra-contractual payment. It follows that the defendant could not have provided any valuable considerationforitsreceipt of the Overwithdrawn Sums. By this analysis, the defendant did not provide any consideration, let alone valuable consideration,forthe Overwithdrawn Sumsso as to come within the defence in s 73B(3) of the CLPA. 132 As Mr Teo points out,68Foot Note 68×YICWS at para 103(a).this analysis is consistent with the analysis undertaken by the majority in the New Zealand Supreme Court decision ofMcIntoshv Fisk[2017] 1 NZLR 863 (“McIntosh (SC)”). In that case, Ross Asset Management (“RAM”) perpetrated a Ponzi scheme where RAM would enter into a funds management arrangement with investors. Under this arrangement, investors paid moneys to RAM for the latter to manage their investment portfolio and purchase shares on their behalf. RAM did neither of these. The appellant-investor, Mr McIntosh, was an investor that had fortunately withdrawn his investment before RAM collapsed into insolvent liquidation. Upon his withdrawal, the investor had been paid a sum of NZ$954,047 that comprised his principal investment sum of NZ$500,000 and “profits” of NZ$454,047. Given that RAM was a Ponzi scheme, the “profits” that the investor had been paid were funds that other investors had invested into RAM. They were, therefore, fictitious “profits”. The liquidators of RAM brought an action to claw back the “profits” that had been paid to the investor. The investor resisted this and argued that he was entitled to retain the “profits” as he provided valuable consideration to RAM through various means. 133 Whether the investor was entitled to do so depended on how the provisions in the New Zealand Companies Act 1993 (the “CA (NZ)”) and the New Zealand Property Law Act 2007 (the “PLA (NZ)”), all of which deal with the setting aside of dispositions by an insolvent company, applied to the Ponzi scheme that RAM had operated. In particular, the liquidators sought recovery of the profits by relying on: (a) s 345–s 348 of the PLA (NZ), as payments made with intent to prejudice creditors and without the receipt of reasonably equivalent value in exchange; (b) s 292 and s 294 of the CA (NZ), as payments made when RAM was unable to pay its due debts and enabling the investor to receive more than he would in a liquidation; and (c) s 297 of the CA (NZ), as payments made at an undervalue when RAM was unable to pay its due debts. For present purposes, as MacKenzie J summarised in the New Zealand High Court stage of this case, under s 345 to s 348 of the PLA (NZ), a court “may make an order requiring the recipient to pay reasonable compensation to the applicant, if it is satisfied that the applicant has been prejudiced by a payment made by a debtor who was insolvent at the time, and made with intent to hinder, delay, or defeat a creditor in the exercise of any right of recourse of the creditor in respect of the property, or without receiving reasonably equivalent value in exchange” (see the New Zealand High Court decision ofFisk v McIntosh[2015] NZHC 1403 at [28]). However, s 349(1) of the PLA (NZ) provides a similar defence as s 73B(3) of the CLPA, in the following terms: 349 Protection of persons receiving property under disposition (1) A court must not make an order under section 348 against a person who acquired property in respect of which a court could otherwise make the order and who proves that— (a) the person acquired the property for valuable consideration and in good faith without knowledge of the fact that it had been the subject of a disposition to which this subpart applies; or (b) the person acquired the property through a person who acquired it in the circumstances specified in paragraph (a). 134 The majority of the New Zealand Supreme Court held that the investor had not provided valuable consideration for the fictitious “profits”. Among other arguments, the investor argued that the payment of the full sum NZ$954,047 (comprising both his principal of NZ$500,000 and the fictitious “profits” of NZ$454,047) constituted RAM’s discharge of its contractual obligations to him. The majority dismissed this argument, because the investor’s provision of the initial capital was for RAM’s promise that he would be entitled to the actual returns from the shares RAM purchased on his behalf. Since RAM did no such thing, and the profits he received were all fictitious, the investor could not be said to have provided consideration by the provision of the initial capitalforsuch “profits”. Indeed, the majority found that this argument was “untenable in circumstances where the ‘performance’ is simply the expression of the fraud perpetrated on the investors of the Ponzi scheme” (seeMcIntosh(SC)at [122]). This is therefore similar to the analysis I have undertaken in the present case – by the terms of the LOAs, the defendant’s provision of the initial investment sum cannot be said to be valuable considerationforthe Overwithdrawn Sums. The “performance” of the LOAs by EAM was the perpetration of fraud onto investors, with no real appreciation on the initial investment sum. At best, the defendant is entitled to be returned its initial investment sum, which is the antecedent debt owed to it by EAM, though I note that EAM is not seeking a return of the initial investment sum from the defendant in the present application. 135 It follows from the above that I disagree with Mr Teo’s specific reliance on the proposition that a contract must be performed precisely, as support for his position that the defendant did not provide valuable consideration for the Overwithdrawn Sums. Rather, the correct principle is that consideration must be referrable to the promise. Nevertheless, I consider the underlying substanceof Mr Teo’s argument to be similar to my analysis above. As I understand it, Mr Teo relies on the proposition that a contract must be performed precisely to support the general point that the payment of the Overwithdrawn Sums by EAM did not constitute performance of EAM’s obligations under the LOAs.69Foot Note 69×YICWS at para 101.I agree with this general point (see [131] above). However, speaking for myself, I prefer to avoid the language of performance (which Mr Teo has used) because the point really is that no contractual obligation for the payment of the Overwithdrawn Sums was ever formed in the first place. It must be remembered that while the issue of consideration goes to the formation of a contract, the issue of performance goes to the breach of a contract. 136 Be that as it may, my conclusion remains that the defendant provided no valuable consideration for the Overwithdrawn Sums so as to come within the defence under s 73B(3) of the CLPA. (3) There should not be a general proposition that no valuable consideration can ever be provided in a Ponzi scheme 137 For completeness, I turn to the question of whether there should exist ageneralproposition that no valuable consideration can ever be provided in a Ponzi scheme. The claimants argue that there are a number of foreign decisions stating that no valuable consideration can be provided to Ponzi scheme operators in exchange for the fictitious profits paid out of the Ponzi scheme, because as its name suggests, these profits are wholly fictitious.70Foot Note 70×CWS at para 3.4.1. (A) The foreign decisions do not speak with one voice 138 In considering this question, I turn first to the decisions where the courts have discussed the issue of valuable consideration in Ponzi schemes, be it on the principal sum, or the fictitious profits, or both. Generally, the cases can be divided into two categories: (a) where the courts laid down a general proposition that valuable consideration canneverbe provided in Ponzi schemes; and (b) where the courts did not lay down such a general proposition. (I)The relevant foreign statutory provisions 139 Because of the references I will make to various foreign statutory provisions, it is relevant to first set them out. 140 Starting with the US, Title 11 Bankruptcy Code USC (US) (1982) § 548(a) (the “US Bankruptcy Code”) provides: § 548. Fraudulent transfers and obligations (a)(1)  The trustee may avoid any transfer … of an interest of the debtor in property, or any obligation … incurred by the debtor, that was made or incurred on or within 2 years before the date of the filing of the petition, if the debtor voluntarily or involuntarily — (A)  made such transfer or incurred such obligation with actual intent to hinder, delay, or defraud any entity to which the debtor was or became, on or after the date that such transfer was made or such obligation was incurred, indebted; or (B)(i)  received less than a reasonably equivalent value in exchange for such transfer or obligation; and (ii)(I)  was insolvent on the date that such transfer was made or such obligation was incurred, or became insolvent as a result of such transfer or obligation; (II)  was engaged in business or a transaction, or was about to engage in business or a transaction, for which any property remaining with the debtor was an unreasonably small capital; (III)  intended to incur, or believed that the debtor would incur, debts that would be beyond the debtor’s ability to pay as such debts matured; or … 141 Relatedly, the Uniform Voidable Transactions Act (US) § 3439.04(a) (the “UVTA”) states: (a)  A transfer made or obligation incurred by a debtor is voidable as to a creditor, whether the creditor’s claim arose before or after the transfer was made or the obligation was incurred, if the debtor made the transfer or incurred the obligation as follows: (1)  With actual intent to hinder, delay, or defraud any creditor of the debtor. (2)  Without receiving a reasonably equivalent value in exchange for the transfer or obligation, and the debtor either: (A)  Was engaged or was about to engage in a business or a transaction for which the remaining assets of the debtor were unreasonably small in relation to the business or transaction. (B)  Intended to incur, or believed or reasonably should have believed that the debtor would incur, debts beyond the debtor’s ability to pay as they became due. 142 Next, in New Zealand, s 296(3) of the CA (NZ) provides that: (3)  A court must not order the recovery of property of a company (or its equivalent value) by a liquidator, whether under this Act, any other enactment, or in law or in equity, if the person from whom recovery is sought (A) proves that when A received the property— (a)  A acted in good faith; and (b)  a reasonable person in A’s position would not have suspected, and A did not have reasonable grounds for suspecting, that the company was, or would become, insolvent; and (c)  A gave value for the property or altered A’s position in the reasonably held belief that the transfer of the property to A was valid and would not be set aside. 143 Also in New Zealand, s 349(1)(a) of the PLA (NZ) provides as follows: 349 Protection of persons receiving property under disposition (1)  A court must not make an order under section 348 against a person who acquired property in respect of which a court could otherwise make the order and who proves that— (a)  the person acquired the property for valuable consideration and in good faith without knowledge of the fact that it had been the subject of a disposition to which this subpart applies; or (b)  the person acquired the property through a person who acquired it in the circumstances specified in paragraph (a). (2)  A court may decline to make an order under section 348, or may make an order under section 348 with limited effect or subject to any conditions it thinks fit, against a person who received property in respect of which a court could otherwise make the order and who proves that— (a)  the person received the property in good faith and without knowledge of the fact that it had been the subject of a disposition to which this subpart applies; and (b)  the person’s circumstances have so changed since the receipt of the property that it is unjust to order that the property be restored, or reasonable compensation be paid, in either case in part or in full. (II)Decisions that lay down a general proposition 144 I begin with the US decisions. These decisions have generally held that payments made to investors in a Ponzi scheme are voidable if they exceed the investor’s initial investment. The US courts have done this by recognising that the investor gives value via the amount of the initial investment and is therefore entitled to retain that amount. However, they have consistently held that the investor does not give value for any amount paid out in excess of the initial investment sum. The underlying policy is that an investor should not retain the profits earned from the fraud of the Ponzi scheme operator, as this would unfairly enrich early investors at the expense of later investors. 145 Thus, in the US District Court for the District of Utah decision ofInre Independent Clearing House Co, the court considered whether under § 548(a)(2) of the US Bankruptcy Code, the debtor “received less than a reasonably equivalent value in exchange for such transfer or obligation”. The court concluded that the debtors did not receive value in exchange for the transfers (at 859). Importantly, in reaching this conclusion, the court opined that, as a general proposition, in the context of Ponzi schemes, no value can ever be given (at 859): “Value” must be determined by an objective standard.See Pereira v. Checkmate Communications Co. (In re Checkmate StereoElecs., Ltd.),9 B.R. 585, 591 (Bankr.E.D.N.Y. 1981). If the use of the defendants’ money was of value to the debtors, it was only because it allowed them to defraud more people of more money. Judged from any but the subjective viewpoint of the perpetrators of the scheme, the “value” of using others’ money for such a purpose is negative.See also Lawless v. Anderson (Inre Moore), 39 B.R. 571, 573 (Bankr.M.D.Fla. 1984) (the court “would be hard pressed to determine what would constitute reasonably equivalent value” for transfers in furtherance of a Ponzi scheme).But see Larrimer v. Feeney, 192 A.2d at 354 (implying that transfers were not fraudulent to the extend they did not exceed the legal rate of interest). … … But if all the debtor receives in return for a transfer is the use of the defendant’s money to run a Ponzi scheme, there is nothing in the bankruptcy estate for the creditors to share. In fact, by helping the debtor perpetuate his scheme, the transfers exacerbate the harm to creditors by increasing the amount of claims while diminishing the debtor’s estate. In such a situation, the use of the defendant’s money cannot objectively be called “reasonably equivalent value.”… 146 Similarly, in the US Court of Appeals for the Ninth Circuit decision ofDonell v Kowell533 F.3d 762 (9th Cir, 2008) (“Donell”), the court held that under § 3439.04(a) of the UVTA, which issubstantially similarto § 548(a)(2) of the US Bankruptcy Code, there can never be reasonably equivalent value provided for the fictitious profits in a Ponzi scheme. The starting point is that value cannot be analysed in contractual terms because “the purpose is not to identify binding agreements, but to identify transfers made with no rational purpose except to avoid creditors” (at 777). Based on the economic exchange in a Ponzi scheme, although there may be reasonably equivalent value for the initial investment sum, no such value can ever exist for the fictitious profits (at 777–778): Payment of “profits” made by Ponzi scheme operators are not payments of return on investment from an actual business venture. Rather, they are payments that deplete the assets of the scheme operator for the purpose of creating the appearance of a profitable business venture.Id. at 756-57… Up to the amount that “profit” payments return the innocent investor’s initial outlay, these payments are settlements against the defrauded investor’s restitution claim. Up to this amount, therefore, there is an exchange of “reasonably equivalent value” for the defrauded investor’s outlay. Amounts above this, however, are merely used to keep the fraud going by giving the false impression that the scheme is a profitable, legitimate business. These amounts are not a “reasonably equivalent” exchange for the defrauded investor’s initial outlay. 147 The Canadian courts have adopted a position consistent with the US Courts. For instance, the Ontario Supreme Court inDen Haag Capital,LLC v Margaret Correia2010 ONSC 5339 (“Den Haag Capital”) affirmed the US decisions that ruled that no value may be provided on the fictitious profits in a Ponzi scheme (at [36]): … Generally the courts have held that a debtor does not receive reasonably equivalent value for payments made to its investors which represent distributions in excess of the principal investment. The “good faith and for value” defence, the onus of which is upon the Defendants here, is not available to shield an investor in a Ponzi scheme from having to return sums received in excess of his or her investment, because as a matter of law, one does not provide “value” in exchange for “profit” in a Ponzi scheme. Mr. Goldberg concluded that the profit or net winnings paid by Den Haag to the Defendants would be recoverable under both the actual and constructive fraud provisions of theUniform Fraudulent Transfer Act. 148 Subsequently, the Supreme Court of British Columbia inBoale, Wood & Company Ltd v Whitmore2017 BCSC 1917(“Boale”) affirmedDen Haag Capital(at [70]): … In my view, it cannot be sensibly contended that the defendant provided any consideration, let alone good or valuable consideration, for the receipt by him of the Excess. I agree with the observations of the United States Court of Appeals inDonelland of the Ontario Superior Court of Justice inDen HaagCapitalthat the perpetrator of a Ponzi scheme does not receive “reasonably equivalent value” or “good consideration” for payments made to investors that are in excess of the investors’ capital investment. That is because there is no provision of “value” in exchange for “profit” in a Ponzi scheme. Likewise, the recipient of the fictitious profits provides no consideration. While innocent investors in such schemes invest with the expectation of profit as consideration for them having invested in a legitimate business enterprise, what they receive beyond the money they invest, if anything, is not consideration for their investment but rather the principal invested by others in the scheme. 149 Finally, in New Zealand, Miller J in his dissenting judgment inMcIntosh(CA)held that the investor provided no valuable consideration forboththe initial investment sum and the fictitious profits. The relevant statutory provision was s 296(3) of the CA, which requires that there is “value [given] for the property”, and s 349(1)(a) of the PLA, which requires that the investor “acquired the property for valuable consideration”. Miller J opined that “an investor’s antecedent contribution to a Ponzi scheme is not nearly equivalent to the payment that the scheme makes to the same investor on his timely exit; indeed, it delivers no value at all” (at [99]). This is because the distinct characteristic of a Ponzi scheme is that it does not “generate profits sufficient to yield their promised profits but rather use[s] new investor money to pay ‘profits’ and to repay existing investors, with each such payment exacerbating the scheme’s financial position” (at [107]). Therefore, in Miller J’s view, “the introduction of new money creates no value but merely delays and worsens the inevitable ruin” (at [107]). 150 On appeal to the New Zealand Supreme Court, Glazebrook J in her dissenting judgment inMcIntosh(SC)agreed with the majority that the investor provided no valuable consideration for the fictitious profits (at [244]): Under his contract with RAM, the $500,000 should have been invested on Mr McIntosh’s behalf. He would have been entitled to all the returns on that investment but in fact no investment was made. The $500,000 therefore did not generate any returns for Mr McIntosh and it cannot have provided value for the fictitious returns made. The fact that there was a contractual right to earn management fees or the potential for RAM to use the funds to generate income does not mean value was given either, because the reality was that neither occurred. RAM received no return on the $500,000, either at the time of the initial ‘investment’ or over the subsequent four and a half years, as it was used to perpetuate the fraud. … This, as I have discussed above, is not dissimilar from the approach taken by the majority inMcIntosh(SC). 151 However, Glazebrook J also held that the investor provided no valuable consideration for the payments equal to the initial investment sum of NZ$500,000 (at [282]). Among other reasons, it is interesting to consider the policy reasons considered by Glazebrook J (at [275]–[276]): [275]  The operation of a Ponzi scheme cannot, however, in any way be described as an ordinary commercial transaction. The only purpose of the scheme is to defraud investors. I accept that Mr McIntosh was an innocent investor who had no knowledge of the fraud. However, this was the same for all the investors. In policy terms an accident of timing as to when funds are withdrawn should not favour one defrauded investor over another. This is particularly the case as the very essence of a Ponzi scheme is that investment by new investors is used to pay out those investors who wish to withdraw their funds. As the liquidators submit, the very purpose of the payments made to Mr McIntosh was to defraud other investors. [276]  As a further policy point, knowledge that the consequences of a fraud, at least on the scale of a Ponzi scheme, will rest on investors equally may encourage more diligence on the part of investors. In this case it may have meant investors would have had an incentive to make further inquiry into returns that were, as it turned out, too good to be true. This may have meant that the fraud was discovered earlier and the resultant liability of RAM (and harm to investors) mitigated. 152 In summary, the foregoing decisions from the US, Canada, and New Zealand suggest that where Ponzi schemes are concerned, there can never,as a general matter, be valuable consideration provided for the fictitious profits paid to an investor. Generally, these courts have reasoned that, due to the fraudulent nature of Ponzi schemes, the fictitious profits are not the fruits of genuine investments, but merely the principal sums invested by other investors. As such, the investor’s initial Investment sum can never be valuable consideration for such supposed profits. The New Zealand decisions by the minority judges inMcIntosh(CA)andMcIntosh(SC)go further to suggest that there can never be valuable consideration provided for both the fictitious profitsandthe initial investment sum, because the initial investment sum did not generate any value at all, and instead merely delays the inevitable collapse of the Ponzi scheme (seeMcIntosh(SC)at [270], citingMcIntosh(CA)at [107]). (III)Decisions that do not lay down a general proposition 153 Unlike the foregoing decisions, there have been decisions which do not lay down a general proposition that there can never be valuable consideration in respect of the appreciation proceeds from a Ponzi Scheme. Rather, these decisions decided whether there was such valuable consideration by examining the facts of the case at hand. For example, the Alberta Queen’s Bench (Canada) decision ofReTitan InvestmentsLtd Partnership(2005) 383 AR 323 (QB)took a fact sensitive approach. The court considered that on the facts of the case, the investors achieved average realisations of 242% on their initial investment sum, with some receiving as high as 5,500%. Based on these numbers, the court held that “realizations of between 242% and 5,500% based on units fraudulently valued at more than five times their actual value [did] not constitute fair and reasonable payments relative to the amounts [they] invested” (at [31]). By this reasoning, it is conceivable that had the fictitious profits been of a less extravagant quantum, the court may have concluded that there was fair and reasonable consideration provided by the investors for the fictitious profits. 154 Further, the majority in the New Zealand Supreme Court inMcIntosh(SC)considered that the existence of a Ponzi scheme should not influence the analysis of whether valuable consideration had been given. In finding that valuable consideration was provided on the initial investment sum of NZ$500,000 into a Ponzi scheme, the court held as follows (at [100] and [113]): 110.  … We consider that, in the circumstances of this case, it would be unfair to refuse to recognise that $500,000 as value simply because the legal consequence of the misappropriation of the funds meant that his money became part of the co-mingled trust fund, rather than money available to unsecured creditors. That would effectively put the appellant in the position where the claw back regimes in the Companies Act and Property Law Act apply to him (even though the value he gave did not become money which was available to RAM’s unsecured creditors) but the value defences in both Acts do not (for the very reason that the value he gave did not become money available to unsecured creditors). 113.  … We accept the appellant’s submission that the fact that, after receipt, the recipient acts fraudulently in a way that destroys the value of what has been provided should not undermine the nature of the value given. We do not, therefore, agree with the analysis of Glazebrook J in this Court and Miller J in the Court of Appeal insofar as they would calculate the value given by the creditor on the basis of the value received by the fraudulent receipient. In sum, the court considered two factors. The first is that there is unfairness in not recognising the valuable consideration provided on the initial investment sum that is later returned merely due to the legal consequence of the misappropriation of the funds (at [100]). The second is that the court should not approach the analysis of valuable consideration with the benefit of hindsight and knowledge that the Ponzi scheme is a fraudulent transaction (at [113]). 155 However, with regard to the fictitious profits of NZ$454,047, the majority held that no valuable consideration had been provided. First, as opposed to the initial investment sum that can be seen as discharging an antecedent debt to the creditor, the component of NZ$454,047 did not involve any discharge of an unquantified claim. Instead, the sum of NZ$454,047 was the “product of fictitious entries in reports made to the [creditor] by [the Ponzi scheme operator]”, and therefore was “the method of implementing the fraud perpetuated on the [the creditor] by [the Ponzi scheme operator]” (seeMcIntosh(SC)at [128]). Second, the court rejected the argument that the total sum of NZ$954,047 is real and substantial value for a quantified antecedent debt of NZ$500,000. The court agreed with the lower court that, in the absence of any antecedent debt for the sum of NZ$454,047 or some other consideration, there was no value for that component (at [132]–[133]). In sum, rather than lay down and rely on a general proposition that there can never be valuable consideration provided in a Ponzi scheme, the majority took pains to decide the matter based on the specific facts of the case. This approach is therefore markedly different from that taken by the cases discussed in the previous section. (B) There should not be a general proposition in relation to valuable consideration for Ponzi schemes 156 With the above cases and materials in mind, I respectfully decline to adopt the position set out in many of the foreign decisions that no valuable consideration can ever be provided in a Ponzi scheme. I do so on the basis of precedent, principle, and policy. 157 First, as a matter of precedent, the question of consideration under s 73B(3) of the CLPA must be analysed using the principles of contract law (seeRothstarat [24]). This means that I may not follow the foreign decisions that have laid down a general proposition on the basis ofrejectingthe contractual analysis as undertaken inRothstar. As mentioned above (see [146]), the US Court of Appeals for the Ninth Circuit observed that value cannot be analysed in contractual terms because “the purpose is not to identify binding agreements, but to identify transfers made with no rational purpose except to avoid creditors” (seeDonellat 777). 158 Further, these decisions analyse the issue of valuable consideration with the benefit of hindsight that a Ponzi scheme is involved. Therefore, because an essential characteristic of a Ponzi scheme is that there is no legitimate investment involved, the investors who receive fictitious profits cannot be said to have provided valuable consideration. However, as the Court of Appeal recognised inMercator& Noordstar NV v Velstra Pte Ltd (in liquidation)[2003] 4 SLR(R) 667 at [41], reference to subsequent events may not be made to determine the value of consideration. This means that it would not be appropriate to analyse the issue of valuable consideration with the benefit of hindsight. In this regard, while my present analysis – that the payments were extracontractual sums (see [130]–[131] above) – appears to be with the benefit of hindsight, I emphasise that it is not, with reference to an analogy of an unprofitable business. Suppose an unprofitable business paid out “profits” to investors. If these “profits” were contractually stipulated to be paid outwhenthe business made profits, then payments by an unprofitable business would be extracontractual payments not pursuant to valuable consideration from the investors. This would have been known to the investor at the outset. It is thus clear that the present analysis disregards any notion of whether the business is legitimate or fraudulent, but instead, focuses on whether there was valuable consideration for the payments made. Therefore, with these two reasons in mind, it will be contrary to established precedent to adopt an analysis of s 73B(3) that is unique to Ponzi schemes. 159 Second, even if I were not constrained by precedent, as a matter of principle, I do not think it is correct to adopt an analysis unique to Ponzi schemes in Singapore. To begin with, in so far as the CLPA was intended by Parliament to apply generally to conveyances of property, endorsing an application of s 73B(3) of the CLPA in an idiosyncratic manner specific to Ponzi schemes would be contrary to the legislative intention. More crucially, this assumes that Ponzi schemes are always easy to define with certainty. Although I have endeavoured to describe the main characteristics of a Ponzi scheme, with the passage of time, it is not inconceivable that such schemes may evolve. It is therefore undesirable to lay down a fixed definition of Ponzi schemes, which must necessarily be done should s 73B(3) of the CLPA be applied in a fixed manner specific to Ponzi schemes. In this regard, in New Zealand, it has been recognised that “[i]t will not always be clear whether a debtor was running a Ponzi scheme or engaging in legitimate business activity … a failing company may have the appearance of a Ponzi scheme as the debtor transfers incoming receipts to meet outgoings (see New Zealand Ministry of Business, Innovation and Employment on behalf of the Insolvency Working Group,Report No.2 of the Insolvency Working Group, on voidable transactions, Ponzi schemes and other corporate insolvency matters(May 2017) at para 158). 160 One instance of such difficulty is if a Ponzi scheme is merely partial,ie, there is both legitimate and fraudulent activity. To illustrate, a partial Ponzi scheme may arise if an investor received profits of $100, of which $99 was from legitimate investment activity, but $1 was merely the initial investment sum of another investor. If there were to be a general proposition that no valuable consideration can ever be provided in a Ponzi scheme, the investor’s total profit of $100 may be voidable. This would be unfair because it would disproportionately invalidate even the legitimate part of the transaction, which was in fact the overwhelming majority of the transaction. On the other hand, by not laying down a general proposition, and analysing whether the investor provided valuable consideration for the total profit it received, the result would be that the sum of $1 is voidable because no valuable consideration had been provided for that portion of the profits. 161 Another instance of difficulty is if a Ponzi scheme does not arise during conception,ie, the entirety of the scheme operator’s activity was initially legitimate. Laying down a general proposition that no valuable consideration can ever be provided in a Ponzi scheme would create evidential difficulties of proving when the scheme arose, and whether the scheme operator intended to perpetrate a Ponzi scheme at the time it entered into contracts with investors. Again, to illustrate, suppose that the scheme operator entered into a contract with an investor at a time when all of his business activity was legitimate. When he realises that he cannot afford to pay profits to the investor, he decides to turn his business into a Ponzi scheme. At the time of contracting, there was arguably valuable consideration provided by the investor. Yet, with the application of a general proposition, the investor would be deemed to not have provided valuable consideration. 162 Third, as a matter of policy, it has been suggested by David Hague that, in a situation that is not a classic Ponzi scheme, investors may be able to establish the defence that they received the fictitious profits in good faith and for reasonably equivalent value. Referring to the general proposition approach, the author suggests that “[i]n an area where equity reigns supreme, this should not be the law” (seeExpanding the Ponzi Scheme Presumptionat 906). 163 Indeed, it has been further suggested that investments – whether into legitimate products or Ponzi schemes – are inherently risky. A risk that investors accept when they deposit substantial sums is that the investment might later turn out to be a Ponzi scheme. To illustrate, when A’s house is destroyed by a meteorite and B’s neighbouring house escapes unscathed, B is not obliged to contribute to alleviate A’s loss. In another scenario, if both A and B advance money into an entirely legitimate investment scheme that subsequently goes awry, but A cashes out at the time it was profitable while B does not, upon the company’s liquidation, there is no legal requirement to equalise the losses between A and B. In the context of a Ponzi scheme, it is unclear why the law should be applied differently, in that an investor who receives fictitious profits before the scheme collapses must share the losses of investors who unfortunately do not receive such profits (see Nina Opacic and Trish Keeper, “Losing Sight of Certainty: An Analysis of New Zealand’s Voidable Transaction Regime in Light ofFisk v McIntosh(8 November 2016) at 25). 164 If indeed Parliament desired a blanket approach to be taken in relation to Ponzi schemes, it would have legislated for that approach. In the absence of such targeted legislation, I do not think that the courts can, contrary to the non-specific provisions in the CLPA and the IRDA, lay down a general proposition that would practically mean that an investor in a Ponzi scheme can never recover his supposed profits. This is a question of policy that is for Parliament to decide. Indeed, contrary to the hypothetical situation envisaged in the foregoing paragraph, it has been said by Miriam Cherry and Jarrod Wong that “even though both the winning and the losing investor are equally blameless, the latter will suffer the greater loss in relative terms quite simply because that investor was ‘not so lucky’”. In the authors’ view, “it is precisely this unfairness that justifies the treatment of any payments made to the winning investors representing profit that is avoidable as fraudulent transfers and requires their disgorgement for the benefit of the losing investors” (see Miriam A Cherry and Jarrod Wong, “Clawbacks: Prospective Contract Measures in an Era of Excessive Executive Compensation and Ponzi Schemes” (2009) 94 Minnesota Law Review 368 at 403–404). However, framed this way, it is clear that this is really a matter for Parliament to set down as a matter of policy. 165 Accordingly, although it appears that valuable consideration within the meaning of s 73B(3) of the CLPA is often not provided in a Ponzi scheme, I am hesitant to lay down a general proposition that no valuable consideration can ever be provided in a Ponzi scheme. 166 The result of the discussion above is that I find that the Overwithdrawn Sums were paid to the defendant with the intent to defraud creditors of EAM within the meaning of s 73B of the CLPA. Further, I find that the defendant does not come within the defence under s 73B(3) of the CLPA.",
        "Whether the Overwithdrawn Sums paid to the defendant were transactions at an undervalue within the meaning of s 224(3) of the IRDA": "",
        "My decision: the Overwithdrawn Sums paid to the defendant were transactions at an undervalue within the meaning of s 224(3) of the IRDA": "The applicable law 170 Under s 224 of the IRDA, a transaction that was entered into by a company at an undervalue can be set aside. The relevant principles are as follows: (a) A company enters into a transaction at an undervalue where it makes a gift; the transaction is on terms that provide for the company to receive no consideration; or under the transaction, the company receives consideration the value of which, in money or money’s worth, is significantly less than the value, in money or money’s worth, of the consideration provided by the company (see s 224(3)). In this regard, the comparison of value received and provided must be from the perspective of the insolvent grantor,ie, the company (seeRothstarat [25]). To assess if value was provided, the touchstone is whether there was a bargain of such magnitude that cannot be explained by normal commercial practice (see the High Court decision ofParakouShipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 15 at [94]). (b) The relevant time is three years before the commencement of winding up of the company (see s 226(1)(a)). (c) The company must be unable to pay its debts at that time, or unable to pay its debts in consequence of the transaction (see s 226(2)). (d) If the company entered into the transaction in good faith and for the purpose of carrying on its business, and at that time it had reasonable grounds for believing that the transaction would benefit the company, the transaction will not be set aside (see s 224(4)). 171 Additionally, in the High Court decision ofDDP(in his capacity as the joint and several trustees of the bankruptcy estate of [B]) and another v DDR (a minor) and another[2023] SGHC 285, the court set out the relevant principles for s 438 of the IRDA, which has, as one of its elements, a debtor entering into a transaction with another person at an undervalue (at [28]–[29]): 28 It is relevant to highlight that s 438 was introduced into the IRDA to replace s 73B of the CLPA 1994. The following observations made by the Law Reform Committee in 2013 are instructive (see Singapore, Ministry of Law,Report of the Insolvency Law Review Committee: Final Report(2013) (Chairperson: Lee Eng Beng SC) (the “Report”) at pp 184–185). (a) Section 73B of the CLPA 1994 mirrors the language of s 172 of the Law of Property Act 1925 (c 20) (UK), the latter having since been repealed and replaced with s 423 of the Insolvency Act 1986 (c 45) (UK) (the “UK IA”). (b) There are three main differences between s 73B of the CLPA 1994 and s 423 of the UK IA. First, s 423 focuses on transactions at an undervalue, which is a narrower category than s 73B that applies to “every conveyance of property”. Second, s 423 eschews the requirement of having to prove an “intention to defraud creditors” in favour of a subjective inquiry into the purpose of the transaction. Third, s 423 provides prescriptive remedies, while s 73B simply provides that a successfully impugned transaction is voidable. (c) Given that claims under s 73B of the CLPA 1994 are closely intertwined with insolvency proceedings, s 73B should be shifted to the IRDA and amended to mirror s 423 of the UK IA. This has the advantage of, among others, ensuring that the scope of the provision coincides with its underlying policy rationale,ie, preserving the net asset value of the company for distribution amongst its creditors. 29 In my view, these observations are instructive as to how s 438 of the IRDA is to be interpreted. It is clear from these observations that s 438 of the IRDA is not meant to be an exact replica of s 73B of the CLPA 1994. Therefore, the cases interpreting s 73B may be of limited value in the interpretation of s 438. Conversely, as noted in the Report, the new s 438 of the IRDA is meant to mirror s 423 of the UK IA. This must mean that the cases interpreting s 423 of the UK IA are highly persuasive in the interpretation of s 438 of the IRDA. Of course, s 438 is to be interpreted with its underlying policy rationale in mind, which is to preserve the net asset value of the company concerned so as to maximise the possible distribution to the creditors. I note that there are some differences between s 224 and s 438 of the IRDA. Nevertheless, both deal with transactions at an undervalue, and the principles regarding that in s 438 may be relevant to s 224. The requirements for setting aside the payment of the Overwithdrawn Sums pursuant to s 224 of the IRDA are satisfied 172 With the above in mind, I am satisfied that the claimants’ case under s 224 of the IRDA is made out. First, EAM had paid the Overwithdrawn Sums to the defendant within the relevant time in s 226(1)(a) of the IRDA,ie, three years before the winding-up application against it was made by the IJMs on 2 July 2021.73Foot Note 73×Yap’s Affidavit at para 2.2.6.Indeed, pursuant to cl 3 of the LOAs, the defendant received the Overwithdrawn Sums at the end of each calendar month following the months between June 2019 and February 2020 (see [8]–[9] above). 173 Second, EAM had been unable to pay its debts during the relevant time. As mentioned (see [120] above), a Ponzi scheme is insolvent from the outset. Therefore, when the defendant contracted to receive the Overwithdrawn Sums between June 2019 and February 2020, EAM was already insolvent. Not only is this evident from it being a Ponzi scheme, EAM had also consistently used its moneys to pay, among others: (a) NYZ, other directors, and employees; (b) its overhead costs; and (c) referral fees and fictitious profits to investors who had invested in the scheme before the defendant. 174 Third, I am satisfied that the analysis of consideration in s 224(3)(a) of the IRDA should mirror my earlier analysis of s 73B(3) of the CLPA. There is no meaningful distinction that can be drawn between the two provisions as regards this aspect. Therefore, to recapitulate, since the LOAs provide that the defendant could receive profits only if there had been an appreciation in the value of Poseidon Nickel purchased by EAM, and because there was no investment in Poseidon Nickel and therefore no appreciation to speak of in EAM’s Ponzi scheme, the defendant provided no consideration for its receipt of the Overwithdrawn Sums. 175 I am fortified in this conclusion by the English Court of Appeal decision ofBATIndustries plc and others v Sequana SA[2019] Bus LR 2178 (“Sequana(CA)”). In this case, a company, AWA, paid a dividend to its sole shareholder and parent company, Sequana, at a time when AWA was subject to considerable contingent liabilities relating to clean-up costs and damages claims arising out of river pollution in the United States. The dividend payment was challenged under s 423 of the UK Insolvency Act, which isinpari materiato s 438 of our IRDA, and most material for present purposes, has as one of its elements a requirement that the impugned transaction be a “transaction at an undervalue”. As I have noted at [171] above, this operative phrase is common to both s 438 and s 224 of the IRDA. 176 One of the issues that arose was whether the dividend payment by AWA could constitute a “transaction at an undervalue” for the purposes of s 423 of the UK Insolvency Act. The English Court of Appeal answered in the affirmative, and more specifically, found that the dividend payment was a transaction on terms which provided for AWA to receive no consideration. David Richards LJ (as he then was) explained this conclusion in the following terms (seeSequana(CA)at [50]): Once it is accepted that the payment of a dividend involves the payment of funds beneficially owned by a company to its shareholders, the question under s 423(1) remains whether the terms on which the dividend is declared or paid “provide for [the company] to receive no consideration”. In my judgment, it cannot be said that the company receives consideration for the payment of a dividend. It is not enough to say that the dividend is paid in accordance with the rights attached to the shares, where those rights are quite different from, for example, the right to receive interest payments on loan notes or the right to be considered for bonus declarations on a with-profits fund. If and when a company pays a dividend to shareholders, the terms of the dividend do not provide for the company to receive any consideration nor will it receive any consideration. It might be said that to come within the second limb of s 423(1)(a) the terms must expressly provide for no consideration but in my view that would be too literal a reading of the provision. Parliament can hardly have intended the operation of the section to depend on the vagaries of drafting styles. 177 I find this reasoning to be both instructive and applicable to the present context of EAM’s payment of the Overwithdrawn Sums. In my view, a dividend payment and the payment of the Overwithdrawn Sums by EAM have a common core: both are payments to which the payee had no legal right to call upon, or put differently, both were not payments in discharge of any legal liability or obligation owed by the payee. It is well-established that shareholders of a company generally do not have any legal right to be paid dividends, since a profitable company may either pay dividends to its shareholders or choose to reinvest the profits for some other purpose. As David Richards LJ points out in the passage above, their status as shareholders is a necessary but insufficient condition for them to be paid dividends, since the decision to make distributions is ultimately a matter of discretion on the part of the company. The learned judge thus drew a distinction between a dividend payment and interest payments on a loan, which I respectfully consider to be apposite. Presumably, it is a necessary implication of the English Court of Appeal’s decision that it did not think that the initial investment which a shareholder puts up when buying into the company could constitute consideration for subsequent dividend payments. 178 In the present application, I have noted above (at [131]) that the fact that EAM did not actually invest in any Poseidon Nickel meant that it was impossible for it to ever come under an obligation to pay the Overwithdrawn Sums, which purportedly represented the appreciation on the Poseidon Nickel that it did not invest in. As I see it, there is therefore no material distinction that can be drawn between the dividend payment by AWA inSequana(CA)and the payment of the Overwithdrawn Sums by EAM. It follows that the same conclusion as in the former should follow in the present application. 179 For completeness, I note that while the English Court of Appeal decision inSequana(CA)did go on final appeal to the UK Supreme Court, the UK Supreme Court seminal decision inBTI2014 LLC v Sequana SA and others[2022] 3 WLR 709 (“Sequana(SC)”)only addressed the issue relating to the directors’ duty to have regard to the interests of the company’s creditor when the shadow of insolvency looms over the company. There was no appeal against the English Court of Appeal’s findings on the avoidance action under s 423 of the UK Insolvency Act (seeSequana(SC)at [353]perLady Arden JSC). 180 Fourth and finally, EAM cannot rely on the defence in s 224(4) of the IRDA. Indeed, EAM has not attempted to claim as such. Rather, it is the defendant, who has contended that it is abona fideinvestor and has used the Overwithdrawn Sums for legitimate purposes. However, it must be remembered that the analysis in s 224(4) examines the intention of the company who entered into the transaction, and not the counterparty to the transaction. It is clear that EAM did not enter into the transaction in good faith and for the purpose of carrying on its business. There was no business to speak of. The only business EAM had – loosely put – was defrauding investors.",
        "Whether the defendant was unjustly enriched by the payment of the Overwithdrawn Sums to the detriment of EAM": "",
        "My decision: the defendant was not unjustly enriched by the Overwithdrawn Sums at the expense of EAM": "The applicable law 184 At the outset, although the law of unjust enrichment ranks next to contract and tort as part of the law of obligations (see the Court of Appeal decision ofTurf Club Auto Emporium Pte Ltdand others v Yeo Boon Hua and others and another appeal[2018] 2 SLR 655 at [181]), a claim in unjust enrichment can operate only if there is no valid contract between the parties, save in exceptional cases (see the Court of Appeal decision ofEsben FinanceLtd and others v Wong Hou-Lianq Neil[2022] 1 SLR 136 (“Esben Finance”) at [249]–[250]). The rationale for this is that “the law of restitution should not redistribute the risks which the parties have, by contract, already allocated” (see the High Court decision ofMax MediaFZ LLC v Nimbus Media Pte Ltd[2010] 2 SLR 677 at [24]). The recognised exception is where there is total failure of consideration (see the Appellate Division of the High Court decision ofCarlsbergSouth Asia Pte Ltd v Pawan Kumar Jagetia[2023] SGHC(A) 29 at [83], citing the Court of Appeal decision ofBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 (“Benzline”) at [53]–[54]). 185 With that being said, the parties do not dispute that the requirements for a claim in unjust enrichment are trite. As the Court of Appeal set out inSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another appeal[2011] 3 SLR 540 at [110], these are: (a) whether the defendant received a benefit,ie, whether he was enriched; (b) whether the defendant was enriched at the claimant’s expense; (c) whether it is unjust to allow the defendant to retain the enrichment,ie, whether there is an unjust factor; and (d) whether there are any defences available to the defendant. Crucially, a claim in unjust enrichment is founded on the claimant’s loss, and not the defendant’s fault (seeAnnaWeeat [109]). However, it ought to be clarified that “loss” in the unjust enrichment sense is not the same as “loss” in the compensatory sense. Because the remedy for unjust enrichment is restitutionary in nature, “loss” as used in the context of unjust enrichment connotes the claimant having incurred a loss through “giv[ing] up something of economic value through the provision of [a] benefit” to the defendant (see the UK Supreme Court decision ofInvestment Trust Companies v Revenue and Customs Commissioners[2018] AC 275 at [45]). 186 However, is well established that restitutionary recovery demands more than simply alluding to a subjective evaluation of unfairness or unconscionability (seeAnna Weeat [106], citing the High Court of Australia decision ofFarahConstructions Pty Limited v Say-Dee Pty Limited(2007) 230 CLR 89 at [150]). Instead, restitutionary recovery is premised on establishing an unjust factor. Thus far, the following unjust factors have been applied in Singapore: (a) mistake (see the Court of Appeal decision ofSingapore Swimming Club v Koh Sin Chong Freddie[2016] 3 SLR 845); (b) total failure of consideration, otherwise known as failure of basis (seeBenzline); (c) lack of consent (see the High Court decision ofOng Teck Soon(executor of the estate of Ong Kim Nang, deceased) v Ong Teck Seng and another[2017] 4 SLR 819 andEsben Finance); (d) lack of capacity (see the High Court decision ofLim Heng How v Lim Meu Beo[2020] 4 SLR 1217); and (e) illegality (see the Court of Appeal decision ofOchroid TradingLtd and another v Chua Siok Lui (trading as VIE Import & Export) and another[2018] 1 SLR 363). 187 There have been many more unjust factors catalogued in academic treatises, which have been summarised inAnna Wee(at [132]–[133]): 132  … Burrows [The Law of Restitution(Oxford University Press, 3rd Ed, 2011)], for example, summarised the unjust factors as follows (at p 86): As regards the cause of action of unjust enrichment, the main unjust factors can be listed as follows: mistake, duress, undue influence, exploitation of weakness, human incapacity, failure of consideration, ignorance, legal compulsion, necessity, illegality and public authority ultra vires exaction and payment. 133  Goff & Jones summarised them as follows (at para 1-22): Lack of consent and want of authority; mistake; duress; undue influence; failure of basis; necessity; secondary liability;ultra viresreceipts and payments by public bodies; legal incapacity; illegality; and money paid pursuant to a judgment that is later reversed. 188 Where novel unjust factors are concerned, they ought to be recognised incrementally, having regard to the particular facts and circumstances of each case, and subject to two limits. First, the court would be slow to recognise a novel unjust factor to the extent that such recognition would be redundant, such as where it traverses the same ground as a more established legal principle and would thereby denude the latter of legal significance. Second, there must generally be no legal basis which justifies not reversing the transfer of property or value in question, since an unjust factor must, by definition, describe a state of affairs which is unjust (seeEsben Financeat [240] and [244]–[248]). 189 Also, I note the unresolved debate over whether Singapore law should adopt the unjust factors approach or the absence of basis approach. However, in line with the Court of Appeal inAnna Wee(at [129]), I proceed on the assumption that the unjust factors approach applies instead of the absence of basis approach. Indeed, as shall be seen shortly below, this distinction is integral to my decision on the claimants’ unjust enrichment claim. The defendant was not unjustly enriched by the Overwithdrawn Sums to the detriment of EAM 190 I do not think that the claimants have established a claim in unjust enrichment because there is no unjust factor applicable to the present case. 191 To begin with, because the claimants argue that there has been a total failure of consideration, the present application falls within the recognised exception set out inBenzlinewhere, in principle, the law of contract and the law of restitution can operate concurrently. 192 Turning to the substance of this argument, I first note that, although the claimants refer to total failure of consideration and failure of basis,78Foot Note 78×CWS at paras 7.1.3–7.1.4.the two terms are synonymous (seeBenzlineat [46]). I will refer to the unjust factor as “total failure of consideration”. At its core, the underlying idea is that “the benefit [is] conferred on the joint understanding that the recipient’s right to retain it is conditional. If the condition is not fulfilled, the recipient must return the benefit” (seeBenzlineat [46], citing Charles Mitchell, Paul Mitchell & Stephen Watterson,Goff & Jones: The Law of Unjust Enrichment(Sweet & Maxwell, 9th Ed, 2016) at para 12–01). 193 In my view, the unjust factor of total failure of consideration has not been established in the present application. While there may have been anabsenceof consideration with regard to the payment of the Overwithdrawn Sums, this is not the same as total failure of consideration. Indeed, the High Court inThong Soon Sengv Magnus Energy Group Ltd[2023] SGHC 5 (“Thong Soon Seng”)recently confirmed that absence of consideration is not an unjust factor, because this would be tantamount to adopting the absence of basis approach to unjust enrichment that has not been endorsed in Singapore (at [63], citingAnna Weeat [129]). In this regard, the court held (at [61] and [66]) that although the plaintiff’s payment of a sum of S$4m to the defendant was “evidentially indistinguishable from a voluntary payment made without reason”, and this resulted in an “extremely odd” outcome, the law of unjust enrichment could not assist the plaintiff. Vinodh Coomaraswamy J explained the reason for this strict approach in the following terms (at [61]): … But this odd outcome is the result of a well-known feature of the common law of unjust enrichment. The law of unjust enrichment does not reverse a voluntary payment simply because the payment was made without a basis or without a reason. The law of unjust enrichment reverses only those enrichments which it deems to be unjust. And it deems an enrichment to be unjust only if the person seeking to reverse it is able to plead and prove a recognised unjust factor (WeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 … at [129]–[134]). 194 In the present application, similar toThong Soon Seng, despite the seeming anomaly of the outcome that the defendant provided no valuable consideration for the payment of the Overwithdrawn Sums by the claimants, it is not appropriate for the law of unjust enrichment to intervene. This is because “unjust enrichment is not based on a general notion of unconscionability or unjustness”; there is “no freestanding claim in unjust enrichment on the abstract basis that it is “unjust” for a defendant to retain the benefit”. Instead, “there must be a particular recognised unjust factor or event which gives rise to a claim” (seeAnna Weeat [130] and [134]). Therefore, because the claimants are unable to establish the unjust factor of total failure of consideration, and are unable to establish that there is any other unjust factor applicable to this case, their claim in unjust enrichment fails.",
        "Whether the Overwithdrawn Sums were paid to the defendant for the purposes of putting assets beyond the reach of the creditors of EAM and/or prejudicing their interests, within the meaning of s 438(4) read with s 439(1)(d) ofthe IRDA": "195 For completeness, I find that it is not necessary to set out any views on the applicability of s 438 and s 439 of the IRDA to the present application. Indeed, Mr Chan, who appeared for the claimants, acknowledged that s 438 and s 439 do not apply. This is because the last relevant transaction pursuant to which EAM paid the Overwithdrawn Sums to the defendant was in February 2020, which makes s 73B of the CLPA the applicable statutory provision instead.",
        "Whether the defendant should pay the Overwithdrawn Sums to the claimants": "",
        "The parties’ arguments": "196 The claimants submit that if their application is allowed, they are entitled to not only a repayment of the Overwithdrawn Sums, but also to interest on the Overwithdrawn Sums at 5.33% per annum from 26 September 2022, which is when the claimants first demanded repayment of the Overwithdrawn Sums from the defendant.79Foot Note 79×CWS at para 9.1.1.In particular, based on my findings above that the claimants succeed on s 73B of the CLPA, as well as s 224(3) of the IRDA, the claimants’ arguments are that: (a) the Overwithdrawn Sums should be disgorged pursuant to s 73B once its requirements are satisfied; and (b) the Overwithdrawn Sums should also be ordered to be returned under s 224(3) because it would be “a departure from the wide scope of the norm to refuse relief if all the other requirements of the statutory provision are satisfied” (see the High Court decision ofChristie, Hamish Alexander (as private trustee in bankruptcy of Tan Boon Kian) v Tan Boon Kian and others[2021] 4 SLR 809 (“Christie”) at [89]).80Foot Note 80×CFWS at paras 5.4.1–5.4.3 and 6.2.11. 197 The defendant submits that even if the claimants’ application is allowed, the court should not set aside the payment of the Overwithdrawn Sums, as this would “uphold the principle of commercial certainty”,81Foot Note 81×DWS at para 65.and because the loss ought to lie where it falls.82Foot Note 82×DFWS at para 47.Further, the defendant submits that it genuinely believed that it was earning returns on an investment it had made with EAM.83Foot Note 83×DWS at paras 65–66.In addition, in relation to the claimants’ case on unjust enrichment, the defendant advances the change of position defence, and submits that it would be “inequitable in all the circumstances to require it to make restitution of the Overwithdrawn Sums”.84Foot Note 84×DWS at para 97. 198 I note that Mr Teo did not take a position on this issue, because this was not an issue that the court put before him.",
        "My decision: The defendant is liable to pay the Overwithdrawn Sums and interest thereon to the claimants": "199 In my judgment, the defendant is liable to pay the Overwithdrawn Sums and interest thereon to the claimants, beginning from the date the claimants first demanded repayment of the Overwithdrawn Sums from the defendant. This amounts to $2,319,484 and interest at 5.33% per annum since 26 September 2022 to the date of this judgment. 200 First, as a matter of broad policy, the Supreme Court of British Columbia decision ofBoaleis instructive. The court ordered the net winners in that Ponzi scheme,ie, the investors who had received fictitious profits, to repay the fictitious profits. Importantly, the court held that the trustees of the vehicle used for the Ponzi scheme were “entitled to interest on that amount … from the date of its demand for repayment of the judgment” (at [128]). 201 Second, I am satisfied that this court has the power to effect the broad policy above through s 73B of the CLPA and s 224(3) of the IRDA. In particular, it is clear that the invalidating effect of s 73B is to reverse the transaction concerned so that the claimants are entitled to be, in effect, repaid the Overwithdrawn Sums. Also, in relation to s 224(3), the defendant has not given any good reason why the norm of repayment should not be ordered (seeChristieat [89]). InChristie, the court examined two cases where the court had involved “wholly exceptional” facts (at [82]). For instance, there was no simple way to restore the claimant to the position before the transaction and the limited extent to which the defendant had benefitted (seeChristieat [84], citing the English High Court decision ofTrustee in Bankruptcy of Gordon Robin Claridge vGordon Robin Claridge and another[2011] EWHC 2047 (Ch) at [49]). In the other case, relevant factors include the disproportionate effect a payment order would have on the defendant given the defendant’s limited financial means, that the debt was a fair amount for the work carried out, and that the defendant acted in good faith and had no reason to question the payment at any material time (seeChristieat [87], citing the English High Court decision ofRePeter Herbert Fowlds (a bankrupt) Bucknall and another (as joint trustees in bankruptcy of Peter Herbert Fowlds) v Wilson[2020] EWHC 1200 (Ch) at [79]–[93]). I do not think that the defendant has raised any such relevant factor in the present application. 202 I also do not accept the defendant’s argument that repayment would result in commercial uncertainty, because commercial certainty would almost always be affected when a court reverses a transaction under s 224(3) that the parties had initially thought to be valid. In the same vein, I do not accept the defendant’s argument that the loss ought to lie where it falls, because this would completely undermine the purpose of s 73B of the CLPA and s 224(3) of the IRDA. Also, even if the defendant did not know of EAM’s Ponzi scheme, that cannot justify the refusal of relief because it is not a specific defence provided for in s 224 of the IRDA. 203 For completeness, I do not need to deal with the defendant’s change of position defence in relation to the claimants’ unjust enrichment claim since I have not found in favour of the claimants there. 204 Finally, in an ordinary application, a victorious claimant who had earlier demanded payment and commenced litigation due to the defendant’s non-payment would also be entitled to interest at 5.33% per annum pursuant to s 12(1) of the Civil Law Act 1909 (2020 Rev Ed) (the “CLA”). There is no reason for me to depart from this general position in the present application.",
        "Conclusion": "205 In conclusion, I find that EAM paid the Overwithdrawn Sums to the defendant with the intent to defraud its creditors pursuant to s 73B of the CLPA. I also find that, in the alternative, the Overwithdrawn Sums were paid pursuant to transactions at an undervalue under s 224(3)(a) of the IRDA. However, I dismiss the claim in unjust enrichment as the claimants have not been able to establish an applicable unjust factor. Accordingly, the defendant shall pay to the claimants the sum of $2,319,484 and interest thereon pursuant to s 12(1) of the CLA, calculated at 5.33% per annum from 26 September 2022 to the date of this judgment. 206 Given the length of this judgment, I summarise my findings based on the Agreed Facts as follows: (a) EAM does not hold the Overwithdrawn Sums on aQuistclosetrust and/or an institutional constructive trust for the defendant. The claimants are also correct in their choice of avoidance provisions. The implication of this is that the payments of the Overwithdrawn Sums are liable to be set aside under the avoidance provisions in the IRDA (see [49]–[56], [63], and [76]–[84] above). (b) EAM paid the Overwithdrawn Sums to the defendant with the intent to defraud its creditors pursuant to s 73B of the CLPA, because: (a) there was actual fraud on the part of EAM; and (b) EAM did not receive valuable consideration from the defendant for the Overwithdrawn Sums. There was actual fraud because a Ponzi scheme operator must know that the scheme will eventually collapse, and there is no legitimate purpose in the operation of the scheme other than to defraud investors. With regard to the issue of valuable consideration, I find that the defendant has failed to show that any valuable consideration it provided to EAM – in the form of the initial investment sum – was valuable considerationforthe Overwithdrawn Sums, as required under s 73B(3) of the CLPA. I find that because there was no investment to speak of, the Poseidon Nickel held by EAM could not have appreciated in value. Because EAM was contractually obliged to pay profits to the defendant on the condition that there was appreciation, it did not receive any valuable consideration for its payment. The Overwithdrawn Sums were an extracontractual payment. I stress that my finding is based on the facts of the present application, and I do not endeavour to lay down a general proposition that no valuable consideration can ever be provided in a Ponzi scheme (see [116]–[121], [125]–[136], and [156]–[165] above). (c) EAM’s payment of the Overwithdrawn Sums to the defendant was a transaction at an undervalue pursuant to s 224(3)(a) of the IRDA, because: (a) this was within the relevant time of 3 years before EAM’s winding up; (b) EAM had been unable to pay its debts during that time; (c) the defendant provided no valuable consideration for its receipt of the Overwithdrawn Sums; and (d) EAM did not enter into the transaction in good faith and for the purpose of carrying out its business (see [172]–[180] above). (d) The defendant was not unjustly enriched at the expense of EAM, because EAM has not established the unjust factor of total failure of consideration (see [190]–[194] above). (e) I make no finding as to s 438 and s 439 of the IRDA because it does not apply to the present application, which counsel for the claimants also acknowledged (see [195] above). 207 Unless the parties are able to agree on costs, they are to tender written submissions on the appropriate costs order within 14 days of this judgment, limited to seven pages each. 208 In closing, I once again thank Mr Chan and Mr Pereira for their helpful submissions, and especially Mr Teo for all his able assistance to the court. Goh YihanJudge of the High Court Chan Ming Onn David, Fong Zhiwei Daryl, Lin Ruizi, Abhinav Ratan Mohan, Lai Wei Kang Louis and Tan Wei Sze (Shook Lin & Bok LLP) for the claimants;Pereira Kenetth Jerald, Keerthana Narayanan and Ooi Tsu Chong David (Aldgate Chambers LLC) for the defendant;Chan Michael Karfai (Breakpoint LLC) for Apex Veterinary Medical Pte Ltd, Teo Wei Qiang Nicholas (Zhang Weiqiang) and Tan Toh Leng (watching brief);Ammani Mathivanan (Oon & Bazul LLP) for Tan Chay Guan (Mrs Vath III Chay Guan) (watching brief);Joshua Chow Shao Wei (IRB Law LLP) for Tan Tor Boon Kris (watching brief);Claire Lim and Toh Yong Xiang (WongPartnership LLP) for Lau Lee Sheng, Teo Wei Wen Benjamin, Koh Hong Jie (Xu Hongjie) and Guo Yujia (watching brief);Stuart Andrew Peter (Covenant Chambers LLC) for Shen Xuhuai (watching brief);Teo Jason (Setia Law LLC) as young independent counsel."
    }
}