{
    "case_title": "Goh Tze ChienvTan Teow Chee and another",
    "ncitation": "[2024] SGHC 1",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 The applicant’s father, Mr Goh Swee Boh @ Goh Cheng Kin (“the Father”), died on 3 August 2022. The first respondent, Mr Tan Teow Chee (“Mr Tan”), was the sole executor and trustee of the Father’s estate in Singapore. 2 HC/OA 637/2023 (“OA 637”) was brought by the applicant, Mr Goh Tze Chien (“Mr Goh”), to invalidate a special resolution of Land & Marine Private Limited (“the Company”), a company which was owned by the Father and various family members, that had resolved to wind up the Company and to appoint the second respondent, Mr Teh Kwang Hwee (“Mr Teh”), as liquidator of the Company. Mr Goh also filed HC/SUM 2196/2023 (“SUM 2196”) seeking an order for the assessment of the mental capacity of his mother (“the Mother”) and to prohibit the respondents from using the assets of the estate of the Father (“the Estate”) to fund their defence in these proceedings. 3 I dismissed SUM 2196 and OA 637 on 19 October 2023 and now provide my reasons.",
        "Background": "4 The Father executed a will in respect of his assets in Singapore (“the Will”) dated 18 November 2014. The executors and trustees named were the Mother and Mr Tan, a close friend of the Father.1Foot Note 1×Affidavit of Tan Teow Chee @ Tan Mark dated 14 September 2023 (“MT Affidavit”) at paras 8–12 and p 77. 5 Clause 2 of the Will gave the trustees powers to “call in convert or sell and to postpone such calling in conversion or sale as she shall deem fit”.2Foot Note 2×MT Affidavit at p 77. 6 Clause 3 concerned the Goh family’s residential home, 23 Thomson View, which was wholly owned by the Father. Mr Goh has two sisters (“the Sisters”). Ms Goh Tze Ning (“Ning”) relocated to Penang and Ms Goh Tze Shin (“Shin”) moved overseas. Mr Goh, his wife, and their two daughters lived at 23 Thomson View with the Father and Mother until the third quarter of 2019, when the Father and Mother moved to Penang. Mr Goh’s family thereafter continued to reside at 23 Thomson View. In cl 3 of the Will, the Father directed that his interest in 23 Thomson View was to be divided in the following manner: (a) A 30% share to the Mother; (b) A 20% share each to Mr Goh and the Sisters (“the Goh Siblings”); and (c) A 10% share to his eldest granddaughter Sophie, who was also Mr Goh’s elder daughter. 7 The Company was incorporated by the Father in 1972.3Foot Note 3×Affidavit of Goh Tze Ning dated 3 October 2023 (“GTN Affidavit”) at para 5.At the time of his death, the Father held 36% of the shares of the Company, the Mother held 19%, while the Goh Siblings each held 15%.4Foot Note 4×MT Affidavit at para 69; GTN Affidavit at para 5.The directors of the Company were the Mother, Mr Goh, and Ning.5Foot Note 5×GTN Affidavit at para 5.The Father’s shares in the Company were not dealt with specifically in the Will and formed part of the residuary estate, which was to be distributed in accordance with cl 4 of the Will in the following manner: (a) 40% to the Mother; and (b) A 20% share each to the Goh Siblings. 8 The Father also owned assets in Malaysia. Following the Father’s funeral in Penang, the Goh Siblings first commenced dealing with the Father’s assets in Malaysia and met with Malaysian solicitors on 11 August 2022. It was agreed at that time that Ning, who lived in Penang, would be the sole administrator of the Father’s estate in Malaysia and that the Mother and Goh Siblings would sign the necessary papers. 9 The Will, which dealt with the Estate in Singapore, was read on or about 20 August 2022, after which the Goh Siblings asked Mr Tan to be the sole executor. They considered that it was not practical for the Mother, who was 81 years old at the time, to take on the role of an executor. The Mother renounced her rights to the probate and execution of the Will on 6 September 2022.6Foot Note 6×MT Affidavit at pp 111–112.On or around 23 September 2022, the application for grant of probate to Mr Tan as the sole executor was filed. Probate was extracted on 23 November 2022 and Mr Goh was informed on 30 November 2022. It was envisaged that there were two main assets in Singapore for distribution: (a) 23 Thomson View; and (b) the Father’s 36% shareholding in the Company. 10 Interactions between the respective parties were initially cordial and uneventful. On or around 28 October 2022, however, Mr Goh wrote to the Malaysian solicitors to revoke all the documents he had previously signed in respect of the administration of the Father’s estate in Malaysia. Mr Goh alleged for the first time on 4 November 2022 that the Mother was “unable in her state of mind at the material time to consent to the documents”. At the end of the exchange, the Malaysian solicitors stated that they would withdraw the application for a grant of letters of administration over the Father’s estate in Malaysia. 11 On 30 November 2022, Mr Tan wrote to the Goh Siblings about 23 Thomson View. He asked if any of the Goh Siblings would like to purchase the property, and if not, he would put the property up for sale. Mr Goh responded in two separate emails on 30 November 2022 and 1 December 2022. He contended that the Will did not provide any legal basis for Mr Tan’s proposal, and that it was premature to put the property up for sale while the Mother was still alive. Mr Goh mentioned in this email that the Mother was “medically incapable of giving her legal consent as it is difficult to ascertain whether [she] understands the issues …”. This appeared to be the first time Mr Goh raised an issue regarding the Mother’s mental capacity in the context of the Singapore assets and with Mr Tan. 12 On 23 December 2022, Mr Tan emailed the Goh Siblings, proposing that the Company be voluntarily wound up. This was because, on 29 July 2022, a few days before the Father’s unexpected death from a heart attack, the Father had shared his plan to shut down the Company’s operations with Mr Tan.7Foot Note 7×MT Affidavit at paras 65, 67–68 and pp 161–162.On 27 December 2022, the Sisters informed Mr Tan via email that the Sisters and the Mother agreed that the Company be wound up.8Foot Note 8×GTN Affidavit at paras 54–55.On the same day, Mr Tan again asked for Mr Goh’s consent to wind up the Company. Mr Goh replied on 1 January 2023, alleging, without any specific response to Mr Tan’s query, that Mr Tan had “failed to discharge [his] duty as executor with due care and due diligence”.9Foot Note 9×MT Affidavit at p 165. 13 Eventually, on 2 February 2023, the Mother signed a letter (“the Letter of Appointment”) and a directors’ resolution in writing (“the Director’s Resolution in Writing”), appointing Mr Tan as her alternate director for the Company during her absence.10Foot Note 10×GTN Affidavit at pp 176–177.On 25 April 2023, a board meeting of the Company, chaired by Ning, was held, where Mr Tan attended as the Mother’s alternate director. Mr Goh did not attend. The board resolved,inter alia, to convene an extraordinary general meeting (“EGM”) of the Company on 18 May 2023 to consider its members’ voluntary winding up.11Foot Note 11×MT Affidavit at paras 107–111. 14 Thereafter, a proxy form was signed by the Mother on 9 May 2023 appointing Mr Tan as her proxy to vote during the EGM scheduled on 18 May 2023 (“the Proxy Form”).12Foot Note 12×GTN Affidavit at p 182.The EGM was duly held on 18 May 2023. It was attended by Mr Tan and the Sisters. Mr Goh was absent.13Foot Note 13×MT Affidavit at para 115; GTN Affidavit at para 88.All the members present and voting at the EGM voted in favour of the following resolutions: (i) to appoint Mr Tan as a director of the Company; (ii) to voluntarily wind up the Company pursuant to s 160(1)(b) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed) (“IRDA”); (iii) to appoint Mr Teh as the liquidator of the Company for the purpose of the winding up; and (iv) for Mr Teh to be indemnified by the Estate “against all claims, demands and payments which the Company may in the course of or arising out of [the] winding up become liable”.14Foot Note 14×MT Affidavit at paras 113 and 116, and pp 265–266; GTN Affidavit at paras 86 and 89, and pp 218–219. 15 Mr Goh subsequently filed OA 637 on 22 June 2023 to contend that the resolutions to wind up the Company and appoint Mr Teh were not valid. His main contention at the time was that the Mother did not possess mental capacity when she agreed to wind up the Company and when she appointed Mr Tan as her alternate director by signing (i) the Letter of Appointment and the Directors’ Resolution in Writing on 2 February 2023 and (ii) the Proxy Form on 9 May 2023. SUM 2196, which sought for an order for an examination of the Mother, was filed in support of OA 637. 16 There were several related proceedings at the time I dealt with the matter. These were, in brief, as follows: (a) On 25 April 2023, Mr Goh filed HCF/SUM 123/2023 to HCF/P 525/2022 (“P 525”) seeking to revoke the Grant of Probate obtained under P 525. On 10 July 2023, Mr Goh filed HCF/SUM 192/2023 to P 525 for Mr Tan to pay certain sums into court as executor. However, both applications contained procedural defects, which Mr Goh had not corrected by the fourth case conference. He was also absent at that case conference. Accordingly, on 10 August 2023, both applications were struck out.15Foot Note 15×MT Affidavit at paras 120–124. (b) On 23 June 2023, representing the Estate, Mr Tan filed DC/OA 113/2023 (“OA 113”) to recover possession of 23 Thomson View from Mr Goh. On 26 July 2023, Mr Goh filed DC/SUM 1856/2023 (“SUM 1856”) to OA 113, seeking,inter alia, orders to prohibit Mr Tan from using the assets of the Estate to fund OA 113.16Foot Note 16×MT Affidavit at paras 126–129.On 22 September 2023, default judgment was entered against Mr Goh in OA 113 and his application under SUM 1856.17Foot Note 17×Written Submissions of the 1st Respondent dated 12 October 2023 (“1RWS”) at para 54.On 2 November 2023, Mr Goh applied to set aside the default judgmentvideDC/SUM 2660/2023 (“SUM 2660”).18Foot Note 18×Summons for Setting Aside Judgment / Order filed by Goh Tze Chien on 2 November 2023.SUM 2660 was ongoing when I dealt with OA 637. (c) On 19 September 2023, Mr Goh filed FC/OSM 310/2023 praying,inter alia, for an order compelling the Mother to undergo medical examination and an injunction to stay the powers of Mr Tan as executor of the Estate pending the determination of the Mother’s capacity to properly renounce her rights to the probate and execution of the Will.19Foot Note 19×1RWS at para 55.OSM 310 was ongoing when I dealt with OA 637. (d) On 17 October 2023, Mr Goh filed HCF/OSP 15/2023 seeking orders: to revoke the grant of probate in P 525/2022, to remove Mr Tan as executor of the Will, and for the appointment of a replacement director.20Foot Note 20×Originating Summons filed by Goh Tze Chien dated 17 October 2023.This proceeding was ongoing when I dealt with OA 637.",
        "Issues": "17 OA 637 was Mr Goh’s application to: (a) invalidate the special resolution passed on 18 May 2023 to wind up the Company; (b) invalidate the appointment of Mr Teh as liquidator; and (c) for Mr Tan and Mr Teh to indemnify the Company or the Estate for costs. 18 It was largely not disputed that the relevant statutory provisions and provisions of the Company’s constitution in carrying out the winding up of the Company were complied with, save for certain issues which Mr Goh raised at the hearing, and which I will explain in the course of these grounds. The main issue raised by Mr Goh was that the Mother lacked mental capacity when she signed the Letter of Appointment, the Directors’ Resolution in Writing, and the Proxy Form. These documents had a bearing on Mr Tan’s authority to attend and vote at the board meeting that resolved that the Company be wound up as the alternate of the Mother and Mr Tan’s ability to vote on the special resolution at the EGM as the proxy of the Mother. During the hearing, Mr Goh also alleged fraud on the part of Mr Tan in procuring the special resolution and alleged that Mr Teh was complicit in Mr Tan’s “deceit”. 19 SUM 2196 sought orders for: (a) the assessment of the mental capacity of the Mother; and (b) to prohibit the respondents from using the assets of the Estate to fund their defence in these proceedings. 20 Both OA 637 and SUM 2196 were dismissed. The first prayer in SUM 2196 was related to the Mother’s mental capacity, and will be addressed in that context. The substantive decision in OA 637 had a bearing upon and should be dealt with before the second prayer in SUM 2196. I deal with that issue together with the last prayer in OA 637. These grounds of decision therefore explain my views on the relevant issues in the following sequence: (a) the validity of the resolutions to wind up the company and the appointment of Mr Teh as liquidator; (b) the mental capacity of the Mother; (c) the assertions as to fraud; and (d) indemnity and costs issues.",
        "Validity of the resolutions": "21 Mr Goh asserted at the hearing that he had not signed a board resolution and was not present at the EGM where the disputed resolutions were passed. I deal with his complaints in their legal context.",
        "Requisition notice and board meeting": "22 The EGM was requisitioned by Mr Tan (acting on behalf of the Estate which held the largest shareholding in the Company, being a 36% stake) pursuant to s 176(1) of the Companies Act 1967 (2020 Rev Ed) (“the CA”).21Foot Note 21×MT Affidavit at para 96 and p 211.Articles 46 and 47 of the Company’s constitution provided:22Foot Note 22×MT Affidavit at p 244. 46. Any director may whenever he thinks fit convene an extraordinary general meeting, and extraordinary general meetings shall be convened on such requisition or in default may be convened by such requsitionists as provided by the Act. 47. Subject to provisions of the Act relating to special resolutions and agreements for shorter notice, fourteen days’ notice at the least … specifying the place the day and the hour of meeting and in case of special business the general nature of that business shall be given to such persons as are entitled to receive such notices from the company. 23 Due notice of the requisition was forwarded to each member of the board on 24 March 2023, including Mr Goh.23Foot Note 23×MT Affidavit at para 96.Mr Goh acknowledged that he received the notice.24Foot Note 24×NE, 19 October 2023, at 4, lines 26–27; Affidavit of Goh Tze Chien dated 22 June 2023 (“1GTC Affidavit”) at p 74–75. 24 As mentioned (above at [13]), a board resolution was passed subsequently, on 25 April 2023, to convene the requisitioned EGM to vote on the special resolution for the voluntary winding-up of the Company.25Foot Note 25×MT Affidavit at p 256; 1GTC Affidavit at p 76.This board resolution was not signed by Mr Goh.26Foot Note 26×MT Affidavit at pp 226–227 and 259. 25 At the hearing, Mr Goh contended that the Directors’ Resolution in Writing, which appointed Mr Tan as the Mother’s alternate director, was defective as he did not sign it. The appointment was made pursuant to Art 84 of the constitution, which entitled any director to appoint an alternate “with the approval of the directors” and empowered the alternate to attend and vote at board meetings. The appointment of an alternate required written notice by the director making the appointment, which the Mother duly provided by way of the Letter of Appointment. Mr Goh’s signature was unnecessary as the Directors’ Resolution in Writing was passed pursuant to Art 92 of the Company’s constitution, which provided that “[a] resolution in writing signed by a majority of the Directors of the Company shall be as valid and effectual as if it had been passed at a Meeting of the Directors duly called and constituted”. The Directors’ Resolution in Writing was signed by the Mother and Ning, who together constituted a majority of the directors of the Company. Mr Goh’s signature was therefore unnecessary for the passing of the Directors’ Resolution in Writing, and Mr Tan was therefore validly appointed as the Mother’s alternate. As for the board’s decision to convene an EGM, this decision was reached at the board meeting on 25 April 2023. The quorum required under Art 85 of the Company’s constitution for the transaction of the business of the directors was two.27Foot Note 27×MT Affidavit at p 248.As I have found, Mr Tan had previously been appointed by the Mother as her alternate director pursuant to the Letter of Appointment and Directors’ Resolution in Writing signed on 2 February 2023. Mr Tan (as the Mother’s alternative) and Ning were thus the two directors necessary to form a quorate board meeting. Mr Goh’s attendance at the board meeting was therefore unnecessary. Pursuant to Art 82 of the Company’s constitution, decisions at a board meeting were to be made by a simple majority of votes. Both Mr Tan and Ning voted in favour of the resolution to convene the EGM.",
        "The EGM and special resolution to wind up the Company": "26 The quorum necessary for a general meeting of the Company under Art 49 of the constitution was two. Mr Tan, Ning and Shin attended the EGM on 18 May 2023. For a voluntary winding up, s 160(1)(b) of the IRDA requires a special resolution. Section 184(1) of the CA in turn spells out the procedural requirements for special resolutions: Special resolutions 184.—(1)  A resolution is a special resolution when it has been passed by a majority of not less than three‑fourths of such members as, being entitled to do so, vote in person or, where proxies are allowed, by proxy present at a general meeting of which — (a) in the case of a private company — not less than 14 days’ written notice; or (b) in the case of a public company — not less than 21 days’ written notice, specifying the intention to propose the resolution as a special resolution has been duly given. 27 Section 184(1) of the CA had been satisfied. The members present and voting in favour of the resolution constituted 85% of the shareholders of the Company. That Mr Goh did not attend the EGM28Foot Note 28×MT Affidavit at para 115.was immaterial. 28 Mr Goh queried the Mother’s signing of the Proxy Form dated 9 May 2023, which enabled Mr Tan to vote for her 19% shareholding on her behalf. This form complied with the requirements set out under Art 63 of the Company’s constitution. It was signed well in advance of the scheduled EGM and despatched to K H Teh Consulting,29Foot Note 29×GTN Affidavit at para 67 and pp 181–182.the office of the Company Secretary, in compliance with the notice of the EGM.30Foot Note 30×MT Affidavit at p 266. 29 There was no real dispute, therefore, that the relevant statutory provisions and provisions of the Company’s constitution necessary for carrying out the voluntary winding up of the Company had been complied with. It is in this context that I turn to Mr Goh’s complaint that the Mother lacked the requisite mental capacity to sign the documents which she signed.",
        "The Mother’s mental capacity": "30 Mr Goh’s premise for OA 637 was that the Mother did not possess mental capacity when she signed the Letter of Appointment and the Directors’ Resolution in Writing on 2 February 2023 and the Proxy Form on 9 May 2023.",
        "Legal test for mental capacity": "31 While the present application did not concern an application under the Mental Capacity Act 2008 (2020 Rev Ed) (“MCA”), the statutory principles and legal tests were consistent with the common law definitions and remained relevant. Like the common law definitions, “the underlying philosophy of the MCA emphasises an individual’s autonomy and the right to decide for himself”:Wong Meng Cheong and another v Ling Ai Wah and another[2012] 1 SLR 549 (“Wong Meng Cheong”) at [27]. 32 Sections 4 and 5 of the MCA set out the statutory test for mental capacity. Section 4(1) of the MCA provides: (1) For the purposes of this Act, a person lacks capacity in relation to a matter if at the material time the person is unable to make a decision for himself or herself in relation to the matter because of an impairment of, or a disturbance in the functioning of, the mind or brain. 33 The test for capacity in s 4(1) of the MCA comprises a functional and a clinical component – the functional aspect is that the individual must be unable to make a decision, and the clinical aspect is that this inability must be caused by a mental impairment:Re BKR[2015] 4 SLR 81 at [134]. Section 5 of the MCA in turn sets out the situations where a person is unable to make a decision for himself or herself. 34 Section 4(3) of the MCA explains that: (3) A lack of capacity cannot be established merely by reference to — (a) a person’s age or appearance; or (b) a condition of the person, or an aspect of the person’s behaviour, which might lead others to make unjustified assumptions about the person’s capacity. 35 In this context, the burden of proof was Mr Goh’s as the applicant: seeWong Meng Cheongat [30]. In general, “[a] person must be assumed to have capacity unless it is established that the person lacks capacity”: s 3(2) of the MCA. This presumption was explained by Dr Vivian Balakrishnan, Minister for Community Development, Youth and Sports at the Second Reading of the Mental Capacity Bill (Bill No 13/2008) with specific reference to the tendency of the mental capacity of patients to “wax and wane”. In particular, “[a patient] may be capable of making a decision on this specific topic today, but [the patient] may not be tomorrow, or [he/she] may recover the day after”:Singapore Parliamentary Debates, Official Report(15 September 2008) vol 85 at col 153). 36 In the specific context of dementia, theCode of Practice: Mental Capacity Act 2008(Office of the Public Guardian, 3rd Ed, 2023) (“Code of Practice”) lists some conditions that may cause a lack of capacity, including dementia and mental health problems, but emphasises that “it must not be assumed that a person who suffers from any of these conditions necessarily lacks mental capacity” (at [4.2]). [4.3.2] of theCode of Practicealsostates that “[m]ental capacity must be assessed on a case-by-case basis and cannot be assumed based only on the person suffering from a particular medical condition.”",
        "The prayer in SUM 2196 for a medical examination of the Mother": "37 In aid of his case in OA 637, Mr Goh prayed in SUM 2196 for an order to compel the Mother to undergo a medical assessment to determine her mental capacity: this was misconceived. Section 18 of the Supreme Court of Judicature Act 1969 (2020 Rev Ed) (“SCJA”) provided: Powers of General Division 18.—(1)  The General Division has the powers that are vested in it by any written law for the time being in force in Singapore. (2)  Without limiting subsection (1), the General Division has the powers set out in the First Schedule. In turn, paragraph 19 of the First Schedule of the SCJA provides: Ordering medical examination 19.  Power to order medical examination of a personwho is a party to any proceedingswhere the physical or mental condition of the person is relevant to any matter in question in the proceedings. [emphasis added] This provision makes it clear that the General Division’s power to order a medical examination of a person in a proceeding only arises if that person is a party to the proceedings. 38 The Mother was not a party to these proceedings. The first prayer of SUM 2196 was accordingly dismissed.",
        "Whether the Mother lacked mental capacity": "39 The prayer for an order for the medical examination of the Mother in SUM 2196 having been dismissed, Mr Goh relied on existing medical reports to show that the Mother lacked mental capacity. In particular, Mr Goh contended that the Mother had been under the care of Dr Simon Ting, Consultant Geriatric Neurologist at the National Neuroscience Institute and Singapore General Hospital, since 2013. In Penang, when the Mother and Father moved there in 2019, Ning had arranged for the Mother to be under the care of Dr Irene Looi (“Dr Looi”) and Dr Ch’ng Swee Hock (“Dr Ch’ng”) at Loh Guan Lye Specialist Centre. Dr Looi was a neurologist while Dr Ch’ng was a geriatrician and physician. 40 In so far as Mr Goh relied on his own observations of the Mother’s confusion, s 4(3) of the MCA states that a lack of capacity cannot be established merely by reference to a person’s age or appearance or an aspect of a person’s behaviour. 41 In relation to the documentary evidence, Mr Goh relied on the following: (a) an MRI scan conducted by Dr Dennis Tan, a radiologist, on 23 October 2019; (b) Dr Looi’s Montreal Cognitive Assessment (“MoCA”) test administered on 30 October 2019; (c) Dr Ch’ng’s consultation case note of 11 September 2021 and report of a MOCA test completed on 11 September 2021; and (d) Ms Melissa Yeo’s (“Ms Yeo”) occupational therapy report dated 2 January 2022. 42 The parties did not dispute that the Mother suffered from mixed dementia. Nevertheless, and as highlighted at [34] – [36] above, this was not definitive. A presumption as to mental capacity applied and a lack of capacity could not be established merely by reference to age, appearance or a person’s particular condition. 43 Mr Goh asserted that the Mother’s MoCA scores over the years showed that the Mother’s mental capacity had seriously declined.31Foot Note 31×AWS at paras 32–33.In this respect he relied only on Dr Looi’s and Ms Yeo’s reports. The Mother’s MoCA score was 27/30 in Dr Looi’s report dated 30 October 2019.32Foot Note 32×GTN Affidavit at p 229.By late-2021, the Mother’s MoCA score had fallen to 17/30, according to the test administered by Dr Ch’ng’s on 11 September 2021.33Foot Note 33×GTN Affidavit at p 232.Ms Yeo’s report also notes that another MoCA test was administered on 24 December 2021, in which she scored 15.34Foot Note 34×GTN Affidavit at p 239. 44 However, none of the above reports from Dr Looi, Dr Ch’ng or Ms Yeo demonstrated the impact of the Mother’s dementia on her decision-making or cognitive abilities. Dr Looi did not opine on the Mother’s mental capacity.35Foot Note 35×1GTC Affidavit at para 11.1 and pp 25–26.The case note prepared by Dr Ch’ng concerned the appropriate medication for the management of the Mother’s dementia and did not allude to the Mother’s mental capacity.36Foot Note 36×1GTC Affidavit at p 28.And Ms Yeo, an occupational therapist, would not be the most relevant expert to address the test as to mental capacity. She also noted that the Mother was missing a hearing aid and could have been fatigued from an earlier walk and breakfast. Their MoCA tests were not definitive of the issue, and were also contradicted by a later MoCA test completed by Dr Prem Kumar Chandrasekaran (“Dr Prem”). 45 In a medical report dated 21 March 2023,37Foot Note 37×Affidavit of Goh Tze Chien dated 24 July 2023 (“2GTC Affidavit”) at p 13; GTN Affidavit at p 156.Dr Prem, a neuropsychiatrist who examined the Mother in Penang, assessed that the Mother’s cognitive test scores were in the “normal range”.  Dr Prem conducted another MoCA test, for which the Mother scored 27/30. A Mini-Mental State Examination was conducted in addition, where the Mother scored 28/30. He assessed that the Mother suffered mild cognitive impairment after taking into consideration her three-year history and the brain lesions that were visible from scanning, and stated that her family should put in place “early contingency plans in the event she experiences rapid cognitive decline later”. He concluded:38Foot Note 38×GTN Affidavit at para 99. As it stands, [the Mother] is judged to possess the capacity to instruct her solicitors with regards to her estate, and I confirmed that it is her wish to have her elder daughter (second child) to act on her behalf using a Power of Attorney (POA) as of the last assessment on 16 February 2023. She had also possessed testamentary capacity that was confirmed during the 16 December 2022 assessment. 46 Mr Goh took issue with the fact that Dr Prem had not seen the Mother prior to his examination for the purposes of preparing the report, that no MRI scan was done and that Dr Prem was not a neurologist.39Foot Note 39×2GTC Affidavit at para 18.I disagree. Dr Prem, a consultant neuropsychiatrist, was qualified to opine on matters concerning mental capacity. That his examination of the Mother was completed for the purposes of a report was not a reason to doubt its soundness or his independence as a doctor. Dr Prem’s examination on 16 December 2022 and 16 February 2023 was the nearest in time to the Mother’s signing of the Letter of Appointment, Director’s Resolution in Writing, and Proxy Form. It was clear from his report that he had considered the Mother’s history and either conducted a scan of his own or used previous scans which reflected her brain lesions. There was therefore no reason to doubt the veracity of Dr Prem’s report. 47 Accordingly, the relevant evidence did not support Mr Goh’s assertion that the Mother lacked mental capacity when she signed the relevant documents. The presumption in s 3(2) of the MCA was not displaced. I therefore dismissed this contention.",
        "The assertions of fraud": "48 Mr Goh made several allegations against Mr Tan that were not relevant to the prayer to invalidate the special resolution to wind up the Company. I did not take these into account for the following reasons: (a) First, Mr Goh alleged that Mr Tan lacked the legitimacy to act as the executor of the Estate as he was never close to the Father.40Foot Note 40×Applicant’s Written Submissions dated 12 October 2023 (“AWS”) at paras 38–42 and 47.This was not relevant as the Will named Mr Tan as an executor. (b) Second, Mr Goh alleged that Mr Tan hardly interacted with the Mother over the years and it was thus “disingenuous” of Mr Tan to suggest that the Mother had the requisite mental capacity.41Foot Note 41×AWS at para 43.Again, this was not relevant as Mr Tan’s assertions were premised on the medical evidence adduced. (c) Third, Mr Goh alleged that the Father did not expressly instruct Mr Tan to wind up the Company.42Foot Note 42×AWS at Part E.This was not relevant as the desire to wind up the Company had been expressed by the required three-fourths majority of shareholders. 49 At the hearing, Mr Goh’s view was that Mr Tan had procured the special resolution fraudulently as Mr Tan had represented to Mr Goh and the Mother that the Father wished to wind-up the Company, when this was false.43Foot Note 43×NE, 19 October 2023, at 4.There was no evidence supporting Mr Goh’s assertion that it was untrue that the Father had expressed a wish to wind up the Company. Mr Goh made this oral assertion mainly because Mr Tan had used in his affidavit a WhatsApp message that the Father had sent Mr Goh, which the Father had later forwarded to Mr Tan. Mr Goh’s main point was that this was a private message between the Father and himself. Notwithstanding, it was the Father who had forwarded it to Mr Tan. I did not consider this relevant to an allegation of fraud. A further assertion was made that the Father had a mental condition arising from opioid withdrawal at the material time. There was no evidence of this. When I explained that an originating claim, rather than an originating application was more appropriate for dealing with allegations of fraud, Mr Goh declared that he was “happy to leave the police to deal with fraud. I am not going to spend my time in court on fraud”.44Foot Note 44×NE, 19 October 2023, at 5.In any event, the Father’s wish was not material to the validity of the special resolution, which was passed by the requisite majority vote of the shareholders of the Company. 50 In relation to Mr Teh, Mr Goh alleged that Mr Teh was complicit in Mr Tan’s “deceit” by deliberately excluding Mr Goh from the decision-making process as regards the Company and that Mr Teh had lied that he did not know the Mother had been receiving treatment for dementia since 2013.45Foot Note 45×AWS at paras 81–89. 51 There was nothing to suggest that Mr Teh had colluded with Mr Tan or Ning to “forcibly” wind up the Company despite knowing that the Mother allegedly suffered from a lack of mental capacity. The facts were to the contrary. First, Mr Teh wrote to the Mother’s neuropsychiatrist, Dr Prem, to satisfy himself that the Mother possessed the requisite mental capacity at the material time. Second, after satisfying himself that the Mother had the capacity to sign the Proxy Form, Mr Teh asked Mr Tan to confirm with Mr Tan’s lawyer that the Mother could appoint Mr Tan as her alternate director.46Foot Note 46×MT Affidavit at pp 214–215.Third, in the contemporaneous emails to Mr Tan and Ning, Mr Teh made it clear that his role and that of his firm was to facilitate the relevant meetings and that he did not “wish to be embroiled in the family dispute”.47Foot Note 47×MT Affidavit at p 220. 52 There was therefore no reason to invalidate the special resolution passed on 18 May 2023 to wind up the Company or to invalidate the appointment of Mr Teh as liquidator. These prayers in OA 637 were dismissed.",
        "Indemnity and funding issues": "",
        "Second prayer in SUM 2196": "53 The second prayer in SUM 2196 requested that the respondents be prohibited from using the assets of the Estate to fund their defence in these proceedings. 54 In respect of Mr Tan, a trustee is entitled as of right to full indemnity out of his trust estate against all his costs, charges and expenses in an action respecting the trust estate so long as they were properly incurred:In re Beddoe; Downes v Cottam[1893] 1 Ch 547 at 558. Mr Goh premised his submission on a claim that Mr Tan had breached his statutory duties under s 3A of the Trustees Act (“Trustees Act”). 55 Section 3A of the Trustees Act relates to a trustee’s duty to use reasonable care and skill in respect of the exercise of “any power, carrying out any duty or doing any act referred to in the First Schedule”. The First Schedule of the Trustees Act in turn sets out an exhaustive list of acts in relation to: investment; acquisition of land; agents, nominees and custodians; compounding of liabilities; insurance; and reversionary interests, valuations and audits. It was not clear that Mr Tan’s exercise of his powers in taking steps to cause the Company to be wound up was an act listed in the First Schedule. Notwithstanding this, Mr Tan did not object to the application of s 3A of the Trustees Act. The more important point is that I have found no basis, in my analysis above, for Mr Goh’s assertions that Mr Tan had breached any duties to the Estate. 56 Regarding Mr Teh, the special resolution of 18 May provided that Mr Teh would be indemnified by the Estate as liquidator.  Mr Goh contended that this indemnity should not apply because Mr Teh had breached his fiduciary duties “by the very active part he had played to facilitate [Mr Tan’s] breach of trust in relation to the forcible winding-up of the Company”.48Foot Note 48×2GTC Affidavit at paras 29–33.This assertion was rejected as there was no cogent evidence adduced in support. 57 For completeness, I would mention that Mr Teh argued that he was sued “in his capacity as Auditor and Company Secretary of Land & Marine Private Limited”, and as he was neither, the action against him should be dismissed.49Foot Note 49×Written Submissions of the 2nd Respondent dated 11 October 2023 at paras 1–2.I disagreed with this contention. The error in the title was a technical non-compliance that did not affect the substance of the application or cause Mr Teh any injustice. It could have been cured under O 3 r 2(4)(a) of the Rules of Court 2021, but for the fact that the prayer, as I have concluded above, had no merit as a substantive matter.",
        "Prayer in OA 637 for an indemnity": "58 OA 637 carried a last prayer for Mr Tan and Mr Teh to indemnify the Company or the Estate for costs. As the substance of OA 637 was not meritorious, this prayer necessarily failed.",
        "Conclusion": "59 I therefore dismissed both SUM 2196 and OA 637. 60 Costs follow the event. Mr Tan had largely carried the weight of the submissions for both OA 637 and SUM 2196. For SUM 2196, costs to Mr Tan were fixed at $3,000 inclusive of disbursements; costs payable to Mr Teh were fixed at $1,000 including disbursements. For OA 637, costs awarded to Mr Tan were fixed at $15,000 inclusive of disbursements and costs awarded to Mr Teh were fixed at $5,000 including disbursements. Valerie TheanJudge of the High Court The applicant in person; Marina Chin Li Yuen SC, Lee Pei Hua Rachel, and Teo Su Ning Gillian (Tan Kok Quan Partnership) for the first respondent; Tan Cheng Kiong (CK Tan Law Corporation) for the second respondent.",
        "": ""
    }
}