{
    "case_title": "Re Zipmex Co Ltd and other matters",
    "ncitation": "[2024] SGHC 6",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 These are applications by the Zipmex group of companies (“the Zipmex Group”) for an extension of the moratoria currently operating in their favour under s 64(7) of the Insolvency, Restructuring and Dissolution Act 2018 (2020 Rev Ed) (“the IRDA”). The context of these applications is unusual. The applicants seek an extension despite there being no further prospect of restructuring; rather, the extension is sought to protect a proposed sale of one (or two) of the applicants which may otherwise be jeopardised if insolvency proceedings were to be taken out against the Zipmex Group. 2 This unusual aspect throws up the issue of whether the court has the power to grant an extension of a moratorium where there is no further prospect of a restructuring. This is an issue that does not appear to have been directly addressed in any local authority. 3 Having considered the arguments made in written submissions and at the hearing, I have concluded that granting an extension of moratoria where there is no further prospect of restructuring would be contrary to: (a) the plain wording and structure of the statutory framework under s 64 of the IRDA; (b) the legislative purpose underlying the moratorium; and (c) existing authority. As a result, the applications are dismissed.",
        "Background": "4 The Zipmex Group consists of Zipmex Asia Pte Ltd (“Zipmex Asia”), Zipmex Company Limited (“Zipmex Thailand”), Zipmex Pte Ltd (“Zipmex Singapore”), Zipmex Australia Pty Ltd (“Zipmex Australia”) and PT Zipmex Exchange Indonesia (“Zipmex Indonesia”). The Zipmex Group operates a cryptocurrency exchange platform that enables customers to engage in trading of various cryptocurrencies. 5 By way of background, the Zipmex Group’s applications for moratoria were first made on 22 July 2022. These triggered automatic interim moratoria pending the court’s decision on the applications (ss 64(8) and 64(14) of the IRDA). The applications came before me for hearing on 15 August 2022. I allowed the applications and extended the moratoria until 2 December 2022 (seeRe Zipmex Co Ltdand other matters[2023] 4 SLR 1100). Since then, the Zipmex Group has applied for multiple extensions which the court has granted. 6 The extension currently in force was granted by me at the previous hearing on 29 September 2023. Although this extension was initially due to expire on 8 January 2024, at the hearing of the present applications on 5 January 2024, I granted a short interim extension until 11 January 2024 pending my decision in these applications. 7 At the previous hearing, I also heard two applications by Zipmex Asia and Zipmex Singapore to convene meetings of their creditors in respect of two inter-linked schemes of arrangement that had been proposed (HC/OA 757/2023 and HC/OA 758/2023). I granted leave to convene the meetings. 8 The scheme meetings of Zipmex Asia and Zipmex Singapore were held on 22 November 2023.1Foot Note 1×34th Affidavit of Lim Wei Xiong Marcus dated 19 December 2023 (“ML34”) at para 5.Although Zipmex Asia’s scheme was approved by the requisite statutory majority, Zipmex Singapore’s scheme was not. Since both schemes were inter-linked and inter-conditional, the failure of one of the schemes meant that neither were capable of implementation.2Foot Note 2×ML34 at para 6.Thus, as things currently stand, by the Zipmex Group’s own admission, there is no further prospect of restructuring and the liquidation of its constituent companies is likely to be imminent.3Foot Note 3×ML34 at para 7; Applicants’ Joint Written Submissions (“AJWS”) at para 3.",
        "The present applications": "9 In the present applications, the Zipmex Group seeks a short extension of the moratoria until 7 March 2024.4Foot Note 4×ML34 at para 8; AJWS at para 1.The principal justification that is relied upon is the need to safeguard proposed sales of Zipmex Thailand and Zipmex Indonesia by Zipmex Asia.5Foot Note 5×AJWS at para 5(a).Although progress has stalled in respect of the former and a sale does not appear likely,6Foot Note 6×ML34 at paras 11 to 19; AJWS at para 5(e).the latter has reached the stage of advanced negotiations7Foot Note 7×ML34 at paras 20 to 26.such that it has been possible for draft documentation with the proposed acquirer (“the Zipmex Indonesia Purchaser”) to be placed before the court.8Foot Note 8×1st Affidavit of Charlene Wee Swee Ting dated 4 January 2024 (“CWST”) at pp 18 to 58.The proceeds from these proposed sales are intended to be applied to the partial discharge of a super-priority loan to Zipmex Asia that is currently secured by charges over its shares in Zipmex Thailand and Zipmex Indonesia.9Foot Note 9×ML34 at para 11.This is said to be in the interests of the creditors of Zipmex Asia, which may be potentially insolvent,10Foot Note 10×AJWS at paras 19 and 20.because the shares of Zipmex Indonesia would be realisable at a higher value in the proposed sale as compared to the counterfactual of immediate liquidation, where its shares would likely be worthless. In turn, this increase in Zipmex Asia’s assets would be passed on to its unsecured creditors in the form of improved recoveries.11Foot Note 11×AJWS at paras 33(a) and 33(b). 10 Although the proposed transactions strictly involve only Zipmex Asia, Zipmex Indonesia and (if any progress is made) Zipmex Thailand, the extension of moratoria is sought for the Zipmex Group as a whole due to the inclusion of a group insolvency event of default clause by the Zipmex Indonesia Purchaser’s solicitors in the draft sale and purchase agreement. That clause provides for the sale and purchase agreement to be terminable in the event of “the making of a bankruptcy, liquidation, or other analogous order against [Zipmex Asia] and/or its affiliates”.12Foot Note 12×AJWS at para 25.At the hearing, although there was some brief discussion on the uncertainty as to the scope of the phrase “its affiliates” under Indonesian law (as the governing law of the sale and purchase agreement), the parties were content to assume for the purposes of the present applications that it was a reference to the Zipmex Group. Therefore, for the sale of Zipmex Indonesia to not be scuttled, the entire Zipmex Group would have to be protected.13Foot Note 13×AJWS at para 26.Just a day before this decision was to be handed down, counsel for the Zipmex Group wrote to the court enclosing an opinion by an Indonesian lawyer supporting the Zipmex Group’s interpretation of the phrase; this attempt at further submissions and adducing evidence after the hearing was irregular, and will be addressed briefly below. 11 The Zipmex Group has also cited the secondary aim of allowing the winding-down of Zipmex Singapore’s and Zipmex Australia’s operations to be conducted by their existing management. It is argued that this would also be in the creditors’ interest as the existing management would be able to conduct these matters in a more efficient and cost-effective manner than if they were transferred to a third party liquidator or judicial manager.14Foot Note 14×ML34 at para 34. 12 Save for one exception, these applications have gone unopposed by the Zipmex Group’s creditors. This exception is an objection by one Richard Chua Fen Peng (“the Objecting Creditor”), who opposed the extension of the moratorium in relation to Zipmex Singapore. It is not disputed that he is one of the larger creditors of Zipmex Singapore.15Foot Note 15×4th Non-Party’s Written Submissions (“4NPWS”) at para 6; CWST at p 9, para 22. 13 The Objecting Creditor’s main objection is a point on jurisdiction. He submits that the fact of there being no further prospect of restructuring is fatal to the applications as, in this circumstance, the court simply does not have the power to grant an extension of the moratoria in favour of the Zipmex Group.16Foot Note 16×4NPWS at para 3.",
        "My decision: the applications are dismissed": "14 The main difference between the parties is their position on the jurisdictional objection raised by the Objecting Creditor. The question that arises for determination is thus whether the court can grant an extension of moratoria under s 64(7) of the IRDA where, as in the present case, the applicants have proposed schemes of arrangement that have turned out unsuccessful and there is no further prospect of restructuring. 15 For the reasons that follow, I agree with the Objecting Creditor’s jurisdictional objection and dismiss these applications as they lie outside the statutory framework under s 64 of the IRDA.",
        "The statutory framework for moratoria": "16 Under s 64(1) of the IRDA, where a company proposes, or intends to propose, a scheme of arrangement between itself and its creditors, it may apply to the court for an order imposing a moratorium on proceedings against it. Unless the company has previously made an application under s 64(1) within 12 months prior to the date of the application at hand, the filing of a s 64(1) application itself triggers an automatic moratorium that remains in force until the earlier of (a) 30 days from the date of the application; or (b) the date on which the application is decided by the court (see ss 64(8), 64(9) and 64(14) of the IRDA). 17 Thus, to summarise, under the scheme of the IRDA: (a) Where a company makes an application for a moratorium under s 64(1), an automatic moratorium generally comes into effect under ss 64(8) and 64(14). (b) If the court decides to grant the application, it may extend the automatic moratorium “for such period that [it] thinks fit” (s 64(1) of the IRDA). (c) If the company considers the period ordered under s 64(1) to be insufficient, the court may grant subsequent extensions of the moratorium under s 64(7). 18 On first impression, given the framework that I have outlined above, it seems to me clear beyond peradventure that any extension of moratorium under s 64(7) can only serve the same purpose for which the moratorium was granted, or first extended (where an automatic moratorium had already been in force), under s 64(1). Thus, any moratoria granted under s 64, whether under ss 64(1) or 64(7), must be concerned with the making or proposed making of a scheme of arrangement. 19 I nevertheless go on to consider the matter further. In order for the court to grant an application under s 64(1), there are both procedural and substantive requirements that must be met (seeRe All Measure Technology (S) Pte Ltd[2023] SGHC 148 at [9]). The procedural requirements are set out in ss 64(2), 64(3) and 64(4). I need not set them out in full. However, it is clear on the face of these provisions that their purpose is to confirm that the company is in the midst of, or intends to undertake, a restructuring exercise. I can give two examples: (a) First, under s 64(2)(b), the company is required to make or undertake to make an application to convene a scheme meeting under s 210(1) of the Companies Act 1967 (2020 Rev Ed) or to approve a pre-packaged scheme under s 71(1) of the IRDA. (b) Second, under s 64(4), the company is required to produce evidence of support for a proposed scheme (if one has been proposed) or evidence of support for the moratorium (if no scheme has yet been proposed but the company intends to propose one) (seeRe IM Skaugen SE and other matters[2019] 3 SLR 979 (“Skaugen”)at [50]). 20 On the substantive front, the test is whether, on a broad assessment, there is a reasonable prospect of the proposed or intended scheme working and being acceptable to the general run of creditors (Skaugenat [57]). Again, this makes clear that the moratorium is intended to facilitate ongoing attempts (or intention) to restructure. 21 These requirements are trite in respect of an application under s 64(1). The critical question is whether, as a matter of construction, the court’s power to extend a moratorium under s 64(7) is circumscribed by the same requirements as its power to grant a moratorium in the first place under s 64(1). 22 The Zipmex Group urges the court to answer this in the negative. Their submission is that, given the generality with which s 64(7) is worded, the court’s power to grant an extension under s 64(7) is disconnected from its power to grant the initial moratorium under s 64(1). Thus, the requirement of an existing prospect of restructuring that is integral to an application under s 64(1) does not apply to an application under s 64(7). Instead, they submit that s 64(7) confers on the court a broader discretion that is to be constrained by the following factors which they identify as relevant to their situation:17Foot Note 17×AJWS at para 7. (a) First, the rights and prejudice occasioned to the creditors should the extension be allowed, or conversely, not allowed. (b) Second, whether the application has been broughtbona fide, which is a “multifactorial assessment conducted in the particular context of each case” (Skaugenat [70]). (c) Third, whether there is creditor support for the extension of the moratorium. 23 I do not accept this submission. There is nothing on the face of s 64(7) that suggests with any degree of persuasiveness that the court has a freestanding power to extend a moratorium for a purpose other than that which led to it granting it in the first place under s 64(1). I note that the procedural requirements in ss 64(2), 64(3) and 64(4) contain an express reference to s 64(1) but not s 64(7). However, I am not convinced that this is of any significance. It is clear to my mind that the absence of any reference to s 64(7) in these provisions, as well as the generality of s 64(7)’s wording in not itself specifying any requirements, are both readily explicable by the draftsman’s reasonable expectation that s 64(7) would be read as part of s 64 as a whole. If s 64(7) was really intended to create a freestanding power of extension unconstrained in any way by the rest of s 64, one would expect it to have been hived off into a separate, stand-alone provision. 24 I am buttressed in this conclusion by the fact that the Zipmex Group has not been able to identify any statutory footing for the factors that it has cited as its proposed parameters (at [20] above). They have tried to extract these factors from judicial statements in case law;18Foot Note 18×AJWS at paras 37 to 40.that attempt has not been convincing. In my view, the far more logical inference that is to be drawn in respect of the lack of any restriction or modifier within the wording of s 64(7) itself is that the draftsman did not think it necessary given that the location of s 64(7) as part of s 64 speaks for itself. I cannot glean any intention that an application under s 64(7) is intended to be governed by different principles than one under s 64(1). 25 I also find support for this approach by examining the analogous context of judicial management under the IRDA. A judicial management order, similar to s 64(1), also involves a moratorium restraining proceedings against a company (see s 96(4) of the IRDA). The similarities do not stop there. As is the case with an application under s 64(1), an application for a judicial management order also triggers an automatic interim moratorium pending the court’s decision on the application (see s 95 of the IRDA). Apart from the structural similarities, perhaps the most crucial point of identity is that both regimes are intended to achieve specific purpose(s). Whereas a moratorium under s 64(1) is intended to facilitate a proposed or intended restructuring, a judicial management order is granted to achieve one of the aims of judicial management set out in s 89(1) of the IRDA. The continuation of judicial management is contingent on the continuing pursuit (or possibility of achieving) these prescribed aims, since under s 112(1) of the IRDA, a judicial manager must apply to discharge the company from judicial management if (a) one or more of the purposes under s 89(1) has been achieved; or (b) none of the purposes is capable of achievement. Thus, when an application is made to extend a judicial management order, the court must be satisfied that the extension would be likely to achieve one or more of the purposes for which the order had been made (Re CNA Group Ltd[2019] SGHC 78 at [15]). The judicial management scheme thus stands as an example, within the IRDA itself, of the continued applicability of a regime being dependent on the possibility of achieving its purpose in the particular case at hand. I see no reason why the same should not be the case in respect of the moratorium under s 64 of the IRDA. 26 Applying the three-stage framework to statutory interpretation set out by the Court of Appeal inTan Cheng Bock v Attorney-General[2017] 2 SLR 850, it is clear to me that this is a situation where the ordinary meaning of the provision (ie,s 64(7) of the IRDA), taking into account its context (ie,s 64 of the IRDA and the IRDA as a whole) admits no ambiguity or obscurity in terms of possible competing or alternative interpretations. Thus, extraneous material may only be admitted for the purpose of confirming the ordinary meaning of the provision (at [54]).",
        "The legislative purpose of the moratorium": "27 My conclusion on both the text and context of s 64(7) (ie, that the court’s power to extend a moratorium cannot be exercised other than to facilitate a proposed or intended restructuring) is reinforced by the objectives of the moratorium regime. At the second reading of the Companies (Amendment) Bill 2017, the Senior Minister of State for Finance, Ms Indranee Rajah SC, introduced the moratorium in the following terms (Singapore Parliamentary Debates, Official Report(10 March 2017) vol 94): First, moratorium. The provisions will allow the Court to order a moratorium in favour of a company that is proposing or intends to propose a scheme. The moratorium prevents creditors from taking action against the company, such as commencing legal proceedings or enforcing security rights, and gives the company breathing room to put forward the restructuring proposal. This explanation confirms that the purpose of the moratorium is to facilitate attempts at corporate rescue. It follows that once it is conceded, as the Zipmex Group has, that there is no further prospect of rescue, the justification for the moratoria’s continued operation falls away. 28 Kannan Ramesh J inSkaugenexpressly tied the court’s powers to grant extensions of moratoria to the existence of a continuing prospect of restructuring (at [42]): The legislative purpose was therefore clear. An applicant was allowed a default 30-day breathing space – the Automatic Stay – which could be extended on terms if the s 211B(1) application was allowed,and thereafter for further periods also on terms,in order to either develop and propose a restructuring plan, or if one had been proposed, to refine and mature it based on engagement with the relevant creditor community, with the end objective in both situations being a vote on the plan at a scheme meeting if one was ordered under s 210(1). [emphasis added] With respect, I agree with that linkage.",
        "Earlier authorities": "29 Finally, my interpretation of s 64(7) is also confirmed having regard to the existing authorities, in particular, those where extensions were sought but not granted. The Zipmex Group has sought to downplay the significance and/or weight of earlier authorities dealing with ss 64(1) and 64(7) applications on the basis that they did not involve the specific situation at hand.19Foot Note 19×AJWS at paras 37 to 40. 30 On the other hand, the Objecting Creditor places reliance on my earlier decision inRe AaquaversePte Ltd and other matters[2023] SGHC 29 (“Aaquaverse”).20Foot Note 20×4NPWS at paras 9 and 10Similar to the present case,Aaquaverseconcerned applications by a group of companies for extension of moratoria. I dismissed the applications as I was not satisfied that there was a reasonable prospect of the proposed scheme of arrangement working. Although not cited to me by either party,Re Lemarc Agromond Pte Ltd[2023] SGHC 236 provides another example. In that case, Hri Kumar Nair J dismissed an application for a second extension of moratorium because there was clearly no progress in the applicant’s restructuring efforts or a reasonable prospect of a scheme of arrangement being successfully proposed (at [28]-[39]). 31 In my judgment, if it is settled that the court would decline to grant an extension if it is not satisfied that there is a reasonable prospect of a proposed scheme working, it does not make sense for the position to be different where, as in the present case, a scheme has already been proposed, failed to pass, and it is now conceded that there is no prospect of further restructuring. Indeed, the same conclusion must followa fortiori.",
        "Conclusion": "32 For all the reasons above, I dismiss the present applications. In closing, I make two observations. 33 First, while I appreciate that various other alternatives – ranging from other mechanisms such as the appointment of interim liquidators or judicial managers, to individual injunctions being taken out against creditors seeking to wind up the company – may not be viable in terms of cost and effort, the lack of any alternative does not in itself allow the court to conclude that the applications prayed for should be granted. 34 Second, all things being equal, the court does aim to be facilitative and lean in favour of restructuring and rescue, especially where there is no untoward prejudice to any particular creditor or other stakeholder. However, once again, such facilitation must occur within the parameters of the powers conferred by the legislature on the court. Although lack of prejudice to creditors is certainly a consideration of signal importance, lack of prejudice (or even some averred benefit) to creditors is no substitute to a sound legal justification. Thus, even if the court may have some sympathy to the commercial objectives that the Zipmex Group have articulated in these applications, these do not supply the necessary legal basis for the court to exercise the power that has been invoked. 35 Finally, as regards the post-hearing attempt at further submissions and evidence, I will underline, yet again, that counsel should not send in, without leave, any further submissions or evidence after the hearing has been held, and judgment reserved. The court’s leave should not be presumed; the opportunity was previously given to parties to adduce evidence and present their arguments, and the Court was already weighing those arguments in the course of rendering its decision. The interlude before the pronouncement of the decision was not an invitation to rush out to gather additional materials, and to render the court’s pending deliberation a waste of time. There may be situations in which some justification exists making it necessary for a party to ask for an opportunity to have another go after the hearing; leave should be sought. I will leave it at that in the present case, but future instances in any other case may merit a more substantive response from the court. For completeness, I should note that the contents of the Indonesian law opinion are irrelevant to the outcome here, as is evident from my reasons above. 36 Given my decision to dismiss these applications, the moratoria in favour of the Zipmex Group will not be extended beyond today. Aedit AbdullahJudge of the High Court Daniel Chia Hsiung Wen, Tang Yuan Jonathan and Charlene Wee Swee Ting (Prolegis LLC) for the applicants; Justin Yip Yung Keong, Lam Zhen Yu and Cheang Hui Xuan (Withers KhattarWong LLP) for Richard Chua Fen Peng (non-party) in HC/OA 382/2022."
    }
}