{
    "case_title": "Reliance Infrastructure LtdvShanghai Electric Group Co Ltd",
    "ncitation": "[2024] SGHC(I) 3",
    "coram": "Philip Jeyaretnam J (delivering the judgment of the court)",
    "sections": {
        "Introduction": "1 When a company receives a claim on a contract of which it has no record and where its purported signatory has ceased to be its employee, does it waive any jurisdictional objection to the arbitration based on forgery of the arbitration agreement if it unsuccessfully defends the arbitration without alleging forgery? If it contests the claim on its merits with the defence that the contract was entered into by its employee without authority, but without specifically alleging that the arbitration agreement contained in the contract was itself made without authority, can it after the award is given against it raise a jurisdictional challenge that the arbitration agreement was made without authority? These were the principal questions that arose in this challenge to an arbitration award. 2 The claimant in this application seeks to set aside an award of an arbitral tribunal (“the Tribunal”) dated 8 December 2022 (“the Award”), which awarded damages in favour of the defendant. The Tribunal’s putative jurisdiction was based upon an alleged arbitration agreement between the Parties contained in a letter dated 26 June 2008 (“the Guarantee Letter”) within which the claimant had purportedly guaranteed the sums owed to the defendant in another related contract. The claimant had disputed the legal validity of the Guarantee Letter during the arbitration, but the Tribunal was unconvinced by that submission. 3 Upon challenge of that Award before this court, our task is to determine whether the claimant has waived its rights to adduce the following challenges before us – (1) that the defendant had forged the signatures of its former officer, Mr Rajesh Agrawal, on the Guarantee Letter; and (2) in the alternative, if he did sign it, that Mr Agrawal had no authority to bind the claimant to an agreement to arbitrate with the defendant.",
        "Background": "",
        "Factual background of the dispute": "The parties 4 The claimant seeking to set aside the Award is Reliance Infrastructure Limited (“Reliance Infrastructure”), a company incorporated in the Republic of India, and the defendant, Shanghai Electric Group Co Ltd (“Shanghai Electric”), was incorporated in the People’s Republic of China.1Foot Note 1×Case Management Bundle (“CMB”) Vol II at pp 179–180 (Notice of Arbitration dated 13 December 2019 at paras 2 and 4). 5 Both Parties had been involved in a major construction project for an electricity generating power plant in Sasan Village, India (“the Sasan Project”),2Foot Note 2×CMB Vol I at p 348 (Offshore and Onshore Equipment Supply and Erection, Construction and Services Contract dated 24 June 2008 at p 2).and it is from the Sasan Project that this dispute between the Parties arose. The Supply Contract between Reliance (UK) and Shanghai Electric 6 On 24 June 2008, the owner of the Sasan Project, an Indian company known as Sasan Power Limited (“Sasan Power”), entered into a contract with an English company, Reliance Infra Projects (UK) Limited (“Reliance (UK)”), that is related to Reliance Infrastructure (“the Sasan Project Contract”). Under the Sasan Project Contract, Reliance (UK) was to procure for Sasan Power the supply of equipment and services needed for the Sasan Project.3Foot Note 3×CMB Vol I at pp 346–349 (Offshore and Onshore Equipment Supply and Erection, Construction and Services Contract dated 24 June 2008 at pp 1–3). 7 On 26 June 2008, Reliance (UK) and Shanghai Electric then entered into a contract that provided for Shanghai Electric to supply the requisite equipment and services for the Sasan Project (“the Supply Contract”).4Foot Note 4×CMB Vol I at pp 522–523 (Equipment Supply and Service Contract dated 26 June 2008 at pp 2–3).It was Mr Agrawal, Reliance Infrastructure’s Additional Vice–President at the material time,5Foot Note 5×CMB Vol I at p 43 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 95).who signed the Supply Contract on behalf of Reliance (UK).6Foot Note 6×CMB Vol I at p 527 (Equipment Supply and Service Contract dated 26 June 2008 at p 7). 8 Although Reliance (UK)’s board of directors had provided express authorisation for Mr Agrawal to execute the Supply Contract with Shanghai Electric by passing a board resolution to that effect,7Foot Note 7×CMB Vol I at p 516 (Certified True Copy of Meeting of the Directors of Reliance Infra Projects (UK) Limited held on 27 May 2008 and signed on 9 June 2008).there is no evidence in the record indicating that that board resolution had ever been furnished to Shanghai Electric as the grounds of Mr Agrawal’s authority to do so.8Foot Note 8×Transcript of Hearing in SIC/OA 1/2023 dated 12 January 2024 (“Day 2 Transcript”) at p 182 lines 11–24 and p 183 lines 6–23.The validity of the Supply Contract is not a matter of dispute between the Parties. 9 The final version of the Supply Contract did not contain any ‘parent company guarantee’ clause,9Foot Note 9×CMB Vol VIII at p 497 (Draft Equipment Supply and Service Contract dated 23 May 2008 at p 4).owing to a request from Mr Agrawal to Shanghai Electric on 25 May 2008 seeking the deletion of such a clause.10Foot Note 10×CMB Vol VIII at p 493 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 25 May 2008). 10 It is undisputed that Mr Agrawal had been involved in the negotiations over the Supply Contract, although the nature of his involvement is disputed. While Reliance Infrastructure characterises his role as a purely facilitative one of coordinating the negotiations between the Parties’ senior managements,11Foot Note 11×CMB Vol I at pp 43–47 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at paras 96–97).Shanghai Electric argues instead that he led the negotiations between them and all entities within the wider Reliance Group (including Reliance Infrastructure) in relation to multiple power plant projects they were both involved in, inclusive of the Sasan Project.12Foot Note 12×CMB Vol VIII at pp 28–31 (Witness Statement of Ms Yu Liwen dated 11 May 2023 at paras 46–48). The events surrounding the disputed Guarantee Letter between Reliance Infrastructure and Shanghai Electric 11 Unlike with the Supply Contract, the validity of the Guarantee Letterwasput in issue in the underlying arbitration, and remains a matter of dispute before us. We summarise here the relevant facts that surrounded the execution – or alleged execution – of the Guarantee Letter between the Parties. 12 On 9 February 2007, Reliance Infrastructure, under its previous name: Reliance Energy Limited,13Foot Note 13×CMB Vol I at p 40 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 87).agreed to indemnify Shanghai Electric in relation to claims that the owner of another power plant project in Hisar, India may institute against Shanghai Electric for any matters relating to that project (“the Hisar Indemnity”).14Foot Note 14×CMB Vol VI at pp 454–457 (Indemnity Agreement dated 9 February 2007 at pp 1–4). 13 Paragraph 6(b) of the Hisar Indemnity contained an agreement to arbitrate disputes between the Parties,15Foot Note 15×CMB Vol VI at p 459 (Indemnity Agreement dated 9 February 2007 at para 6(b)).and it was Mr Agrawal who signed the Hisar Indemnity on behalf of Reliance Infrastructure (as Reliance Energy Limited).16Foot Note 16×CMB Vol VI at p 460 (Indemnity Agreement dated 9 February 2007 at p 7). 14 On 20 May 2008, the Parties entered into a Framework Agreement that established that “[t]he Purchaser shall provide suitable guarantee letter from its parent company acceptable to the Contractor”.17Foot Note 17×CMB Vol VIII at p 88 (Framework Agreement for Long–Term Strategic Cooperation for Various Power Generation Projects in India dated 20 May 2008, Supplement Annexure–3 Term Sheet at S/N 1).Ex facie, that “Purchaser” was defined as referring to Reliance Infra Projects International Limited (“RIPIL”), while “Contractor” was defined as a reference to Shanghai Electric. At that time, Reliance (UK) was the wholly–owned subsidiary of RIPIL while Reliance Infrastructure held 10% of the shareholding of RIPIL (with the remaining shares being held by other Reliance Group entities).18Foot Note 18×CMB Vol VI at p 439 (Chart of Corporate Structure of Reliance Group in 2008–2009). 15 While Mr Agrawal did not sign the Framework Agreement for Reliance Infrastructure, he did initial at the bottom of every page thereof.19Foot Note 19×CMB Vol II at pp 578–579 (Witness Statement of Ms Yu Liwen in SIAC ARB No. 448 of 2019 dated 8 June 2021 at para 36).Paragraph 3.7 also contained an agreement to arbitrate disputes between the Parties.20Foot Note 20×CMB Vol VIII at p 77 (Framework Agreement for Long–Term Strategic Cooperation for Various Power Generation Projects in India dated 20 May 2008 at para 3.7). 16 On 23 June 2008, another officer of Reliance Infrastructure sent an email to Shanghai Electric, copying Mr Agrawal, with an attached draft of a guarantee letter dated 25 June 2008.21Foot Note 21×CMB Vol VI at p 441 (Email from Mr Devinder Batta to Shanghai Electric Group Co Ltd dated 23 June 2008).Under that draft guarantee, Reliance Infrastructure would have guaranteed the performance of Reliance (UK)’s obligations owed to Shanghai Electric under another contract,22Foot Note 22×CMB Vol VI at pp 442–443 (Draft Guarantee Letter dated 25 June 2008 at pp 1–2).which related to a different power plant project in India that was owned by the Damodar Valley Corporation (“the DVC Draft Guarantee”).23Foot Note 23×CMB Vol I at p 39 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 85). 17 Paragraph 10 of the DVC Draft Guarantee contained an agreement to arbitrate disputes between the Parties,24Foot Note 24×CMB Vol VI at pp 445–446 (Draft Guarantee Letter dated 25 June 2008 at para 10).but the draft was never executed by the Parties.25Foot Note 25×CMB Vol I at p 39 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 85). 18 On 26 June 2008, the Guarantee Letter was allegedly signed by Mr Agrawal on behalf of Reliance Infrastructure at a signing ceremony in Shanghai, China. According to Ms Yu Liwen, who was Shanghai Electric’s sales and business development manager at the time,26Foot Note 26×CMB Vol VIII at p 10 (Witness Statement of Ms Yu Liwen dated 11 May 2023 at para 2).she printed out the Guarantee Letter, delivered it to Mr Agrawal, and then witnessed him sign it.27Foot Note 27×CMB Vol VIII at pp 24–25 (Witness Statement of Ms Yu Liwen dated 11 May 2023 at paras 35–38). 19 According to Ms Yu, Mr Agrawal attended that ceremony on behalf of the senior management of the Reliance Group,28Foot Note 28×CMB Vol VIII at pp 24–25 (Witness Statement of Ms Yu Liwen dated 11 May 2023 at para 37).as said to be demonstrated by the contents of Mr Agrawal’s speech which he delivered thereat.29Foot Note 29×CMB Vol VIII at pp 103–104 (Contents of the Draft Speech of Mr Rajesh Agrawal enclosed in an email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 26 June 2008). 20 In the Guarantee Letter, Reliance Infrastructure guaranteed (or is alleged to have guaranteed) the performance of Reliance (UK)’s obligations owed to Shanghai Electric in the Supply Contract.30Foot Note 30×CMB Vol II at pp 169–170 (Purported Guarantee Letter dated 26 June 2008 at pp 1–2).Paragraph 10 contained a putative agreement to submit all disputes between the Parties to arbitration, seated in Singapore, and administered by the Singapore International Arbitration Centre (“SIAC”).31Foot Note 31×CMB Vol II at pp 172–173 (Purported Guarantee Letter dated 26 June 2008 at para 10). 21 On 4 July 2008, Mr Agrawal sent an email to Shanghai Electric’s Vice–President, with an enclosed letter relaying various requests made by the Damodar Valley Corporation and proposing a contractual assignment for Shanghai Electric’s acceptance. That letter was signed by Mr Agrawal, who was described therein as an “Authorized Signatory” for Reliance Infrastructure.32Foot Note 32×CMB Vol VI at p 496 (Enclosed Letter from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 4 July 2008). 22 On 26 August 2008, Mr Agrawal sent an email to Shanghai Electric, in which he discussed two other power plant projects in India,viz,the Butibori and Krishnapattnam Projects. In relation to both projects, he wrote, “RIL Guarantee Letter similar to Sasan would be given for Reliance Infra behalf”.33Foot Note 33×CMB Vol VIII at p 99 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 26 August 2008 at p 1).",
        "Procedural background of the dispute": "SIAC arbitration proceedings 23 The underlying SIAC–administered arbitration arose out of outstanding payments alleged by Shanghai Electric to be owed to it by Reliance (UK), that went unpaid and in alleged breach of the Supply Contract.34Foot Note 34×CMB Vol II at pp 185–186 (Notice of Arbitration dated 13 December 2019 at paras 26–29).Shanghai Electric invoked the arbitration agreement in Paragraph 10 of the Guarantee Letter and sought enforcement of Reliance Infrastructure’s guarantee of Reliance (UK)’s liabilities under the Supply Contract.35Foot Note 35×CMB Vol II at pp 180–181 (Notice of Arbitration dated 13 December 2019 at paras 5–6). 24 In response, Reliance Infrastructure pleaded that the Guarantee Letter was invalid, because it was not aware of its existence,36Foot Note 36×CMB Vol II at pp 326–327 (Statement of Defence dated 13 August 2020 at paras 56–58).and Mr Agrawal had no authority to execute it.37Foot Note 37×CMB Vol II at pp 328–330 (Statement of Defence dated 13 August 2020 at paras 62–68).However, Reliance Infrastructure did not expressly put in issue that Mr Agrawal’s signature on the Guarantee Letter was a forgery, nor did it expressly plead that the Tribunal lacked jurisdiction over the dispute. 25 In opening submissions to the Tribunal on 6 September 2021, Reliance Infrastructure made clear that it wasnotalleging that the Guarantee Letter was a forgery.38Foot Note 38×CMB Vol III at p 46 (Transcript of SIAC ARB No. 448 of 2019 Hearing dated 6 September 2021 at TRA.500.001.0043 lines 13–15).Reliance Infrastructure never adduced any witness statements of Mr Agrawal nor any handwriting expert evidence during the arbitration to show that the Guarantee Letter was a forgery.39Foot Note 39×CMB Vol I at pp 135–136 (Award dated 8 December 2022 at [253] and [255]). 26 Then, on the last day of oral closing submissions, 21 January 2022, the Tribunal asked Shanghai Electric if the letterhead of Reliance Infrastructure on the original Guarantee Letter was embossed or computer-–generated.40Foot Note 40×CMB Vol V at pp 435–436 (Transcript of SIAC ARB No. 448 of 2019 Hearing dated 21 January 2022 at TRA.500.012.0049 line 25 to TRA.500.012.0050 line 4).Shanghai Electric’s counsel clarified in an email to the Tribunal dated 30 January 2022 that the original Guarantee Letter, inclusive of the letterhead, had been printed in black–and-–white.41Foot Note 41×CMB Vol X at p 43 (Email from Drew & Napier LLC to Tribunal dated 30 January 2022 at p 1). 27 In light of that development, Reliance Infrastructure’s counsel sent an email to the Tribunal on 4 February 2022 alleging that these fresh facts as to how the Guarantee Letter had been printed meant that it “would prima facie constitute the making of a ‘false instrument’” and “appears to be a nullity (as all forgeries are nullities)”.42Foot Note 42×CMB Vol VI at p 172 (Email from Khaitan & Co LLP to Tribunal dated 4 February 2022 at paras 11–12). 28 In response to the Tribunal’s query as to the “specific findings” Parties wished for the Tribunal to make in respect of the Guarantee Letter,43Foot Note 43×CMB Vol VI at p 187 (Email from Professor Doug Jones AO to Parties dated 16 February 2022 at p 1).Reliance Infrastructure took the position that the newly disclosed facts meant “[t]hat the provenance of the purported Guarantee Letter … is in serious question” and prayed for “a declaration that the purported Guarantee Letter is invalid and unenforceable”.44Foot Note 44×CMB Vol VI at pp 191–192 (Email from Khaitan & Co LLP to Tribunal dated 18 February 2022 at pp 1–2). 29 Reliance Infrastructure’s updated Schedule of Issues did put in issue the general question “[w]hether the purported Guarantee Letter is valid, enforceable and binding”,45Foot Note 45×CMB Vol VI at p 64 (Respondent’s Summary Schedule of Issues dated 21 December 2021 (and updated on 11 February 2022) at S/N 1).but it didnotexpressly put into issue the question whether the signatures on the Guarantee Letter were forgeries, nor did it expressly object to the jurisdiction of the Tribunal or the validity of the arbitration agreement. 30 Hence, the Tribunal held that Reliance Infrastructure did not put in issue whether the Guarantee Letter was a forgery and must be taken to have conceded that the Guarantee Letter existed.46Foot Note 46×CMB Vol I at pp 135–136 (Award dated 8 December 2022 at [252]–[254]). 31 In contrast, Mr Agrawal’s authority to sign the Guarantee Letterwasput in issue, and on this point, the Tribunal found that Mr Agrawal had apparent authority to sign the Guarantee Letter on Reliance Infrastructure’s behalf.47Foot Note 47×CMB Vol I at p 145 (Award dated 8 December 2022 at [303]). 32 Ultimately, the Tribunal’s Award ordered Reliance Infrastructure to pay damages to Shanghai Electric for outstanding payments that were due under the Supply Contract. The Award affirmed some of Reliance Infrastructure’s set–offs against the sums owed to Shanghai Electric while disallowing others.48Foot Note 48×CMB Vol I at pp 76–77 (Award dated 8 December 2022 at [9(d)]–[9(f)]). Setting aside proceedings 33 Now that Reliance Infrastructure is attempting to set aside that Award, it wishes to rely upon fresh evidence which was never put before the Tribunal,viz, the evidence of Mr Agrawal averring that he did not sign the Guarantee Letter,49Foot Note 49×CMB Vol XI at pp 13–14 (Witness Statement of Mr Rajesh Agrawal dated 3 July 2023 at para 30).and the report of a handwriting expert, Mr Manas Mishra, who opines that the initials and signature of Mr Agrawal found on the Guarantee Letter are all forgeries.50Foot Note 50×CMB Vol XI at p 75 (Expert Report of Mr Manas Mishra dated 23 October 2023 at para 56.12). 34 By consent of the Parties, we allowed the following five witnesses to be cross–examined before us on 11–12 January 2024 (see this Court’s order dated 6 October 2023 on SIC/SUM 42/2023) – (a) Mr Neeraj Parakh, Reliance Infrastructure’s Senior Executive Vice–President, who gave evidence on the claimant’s knowledge and its basis for believing the Guarantee Letter to be a forgery; (b) Mr Agrawal, who testified that he never signed the Guarantee Letter; (c) Ms Yu, who gave evidence that she saw Mr Agrawal sign the Guarantee Letter; (d) Mr Manas, who gave his expert opinion that the signatures on the Guarantee Letter were forgeries; and (e) Ms Lee Gek Kwee, who gave her expert opinion to the contrary –ie, that those signatures were genuine. 35 There was initially a sealing order preventing the disclosure of Parties’ identities in this proceeding (see this Court’s order in SIC/ORC 34/2023 dated 16 June 2023), this being the default position for all proceedings under the International Arbitration Act 1994 (“IAA 1994”) (see s 22(1) of IAA andThe Republic of India v Deutsche Telekom AG[2023] 2 SLR 77 (“Deutsche Telekom (Confidentiality of Arbitration)”) at [16]). 36 However, upon considering the Parties’ cases before us, especially Reliance Infrastructure’s serious allegations of forgery that it levelled against Shanghai Electric, we considered that a compelling public interest may be said to exist in respect of the Parties’ identities. In this Court, Reliance Infrastructure has alleged forgery against Shanghai Electric. If true, this is conduct of a kind that the international business community should know about. Conversely, if allegations of forgery are made without proper basis, those too should be known about. In addition, there has been litigation in India that is publicly known: see the proceedings between Parties before the Delhi High Court (Shanghai Electric Group Co Ltd v Reliance Infrastructure Ltdon 19 July 2022, O.M.P. (I) (Comm.) 433 of 2020).  It could be said that the confidentiality of the underlying arbitration has already been lost, potentially rendering our sealing order “an empty exercise to protect confidentiality when there is nothing left to protect” (seeDeutsche Telekom (Confidentiality of Arbitration)at [28]). 37 We expressed our preliminary views to Parties on the second day of the hearing, 12 January 2024, and sought their responses.51Foot Note 51×Day 2 Transcript at p 1 line 8 to p 2 line 25.After consideration, both Parties agreed to this judgment being published unredacted.52Foot Note 52×Day 2 Transcript at p 233 lines 4–14.Accordingly, we lifted our sealing order by consent to this extent (see s 23(3)(a), IAA 1994).",
        "The parties’ cases": "",
        "Reliance Infrastructure’s case": "38 Reliance Infrastructure now seeks the setting aside of the Tribunal’s Award on the grounds that the Tribunal lacked jurisdiction due to the invalidity of the arbitration agreement (Art 34(2)(a)(i), UNCITRAL Model Law on International Commercial Arbitration (adopted on 21 June 1985) (“Model Law”)), that the Award was affected by Shanghai Electric’s fraud (s 24(a), IAA 1994), and being affected by such fraud, the Award is contrary to the public policy of Singapore (Art 34(2)(b)(ii), Model Law).53Foot Note 53×Claimant’s Written Submissions dated 2 January 2024 (“CWS”) at paras 155–156, 188 and 194–196. 39 The factual basis for Reliance Infrastructure’s legal grounds to set aside the Award are its allegations that Shanghai Electric forged the Guarantee Letter or that, if his signature was not forged, Mr Agrawal nonetheless lacked authority to execute it. Non–waiver of Reliance Infrastructure’s jurisdictional objections 40 According to Reliance Infrastructure, it hasnotwaived its objections to the Tribunal’s jurisdiction, on the grounds of forgery and absence of authority, within the meaning of Art 16(2) of the Model Law. It did not waive its right to allege forgery because it lacked actual knowledge of the facts required to plead its case of forgery. It only learnt from Mr Agrawal that he had never signed the Guarantee Letter in early 2023, after the Award had already been published.54Foot Note 54×CMB Vol I at p 57 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 129).Before that point, Reliance Infrastructure could not obtain the co–operation of Mr Agrawal because he was working for its competitor, Adani Group, and he feared that divulging any information would render him in breach of contractual obligations owed to his new employer.55Foot Note 55×CMB Vol I at pp 55–56 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at paras 123–124).After it learnt of the forgery for the first time, it made a timely application to set aside the Award on that ground. 41 Turning to lack of authority, Reliance Infrastructure argues that it didnotwaive its right to object to jurisdiction on the ground of Mr Agrawal’s want of authority, since it did put in issue that Mr Agrawal was never authorised to sign the Guarantee Letter during the arbitration proceeding, and it was not necessary toexpresslyframe that argument as an objection to jurisdiction since its arguments that Mr Agrawal lacked authority to make the Guarantee Letter were co–extensive with its arguments that he lacked authority to make the arbitration agreement which was contained therein.56Foot Note 56×Transcript of Hearing in SIC/OA 1/2023 dated 11 January 2024 (“Day 1 Transcript”) at p 14 lines 3–9. Allegation that the Guarantee Letter was forged 42 To support its allegation of forgery made before this court and not in the arbitration, Reliance Infrastructure relies on two items of fresh evidence. The first is the testimony of Mr Agrawal that he never signed the Guarantee Letter,57Foot Note 57×CWS at paras 39–40.which it regards as credible direct evidence of such forgery from a neutral witness.58Foot Note 58×Day 2 Transcript at p 123 lines 7–19. 43 The second item of fresh evidence is the forensic report of its handwriting expert, Mr Manas. His opinion is that the signature was forged. Reliance Infrastructure characterises it as a detailed report employing a thorough methodology, with clear explanations of how Mr Manas arrived at his expert opinion that the disputed signatures on the Guarantee Letter were forgeries, when compared to his admitted signatures on other documents.59Foot Note 59×Day 2 Transcript at p 134 lines 4–21. 44 In addition, Reliance Infrastructure points to other external circumstances to support its claim of forgery, including non–compliance with internal company procedures, non–compliance with regulatory requirements in Indian law, the absence of contemporaneous documentation, the removal of a ‘parent company guarantee’ clause from the Supply Contract, and the high amount that is at stake in the purported Guarantee Letter.60Foot Note 60×CWS at paras 41–44, 48–51 and 55. Submissions on Mr Agrawal’s want of authority to sign the Guarantee Letter 45 Reliance Infrastructure further submits that Mr Agrawal lacked any authority, be it express, implied, or apparent, to make the Guarantee Letter on its behalf.61Foot Note 61×CWS at para 98. 46 In its view, Mr Agrawal was never ‘held out’ as having any authority to bind Reliance Infrastructure, given his junior role as Additional Vice–President and the fact that his involvement in negotiations was limited to the facilitative role of coordinating discussions between the senior management of Parties.62Foot Note 62×CWS at paras 109–111. 47 Even if Mr Agrawal did play a leading role in the negotiations, Reliance Infrastructure draws a distinction between having the authority to negotiate on behalf of the principal versus having the authority to commit the principal to any binding legal obligation on their behalf.63Foot Note 63×CWS at paras 112–116. 48 Reliance Infrastructure distinguished other instances when Mr Agrawal did sign agreements with Shanghai Electric. He did so either with the express authorisation of a separate legal entity entirely, such as his signing of the Supply Contract on Reliance (UK)’s behalf,64Foot Note 64×CMB Vol I at p 15 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 12).or under entirely different commercial circumstances which did not concern a ‘parent company guarantee’, such as his signing of the Hisar Indemnity by which Reliance Infrastructure (under its previous name) indemnified Shanghai Electric from claims arising out of a joint deed of undertaking made by Parties in favour of the project owner.65Foot Note 65×CMB Vol I at p 40 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 87).Consequently, at no point did it ever represent or ‘hold out’ that Mr Agrawal had any authority to execute ‘parent company guarantees’ on its behalf.",
        "Shanghai Electric’s case": "49 Shanghai Electric broadly agrees on the applicable legal principles relating to a setting aside application under Singapore law, and under Art 34 of the Model Law and s 24 of the IAA 1994 more particularly. However, it argues that Reliance Infrastructure has waived any right to contest jurisdiction and that in any event its claims of forgery and lack of authority are without merit. Reliance Infrastructure’s waiver of its jurisdictional objections 50 First, Reliance Infrastructure has already waived its right to object to the Tribunal’s jurisdiction on the grounds of forgery and want of authority, as it had every opportunity to make these objections in the arbitration itself, and having failed to do so, it is deemed to have waived its rights under Art 16(2) of the Model Law.66Foot Note 66×Defendant’s Written Submissions dated 28 December 2023 (“DWS”) at paras 13–17. 51 On the point of forgery, Reliance Infrastructure had all the information it needed to form its view that the Guarantee Letter was forged. It asserted to the Tribunal that the Guarantee Letter was a “false instrument” in its email of 4 February 2022 and expressed concerns over its authenticity yet never sought a positive finding from the Tribunal that the Guarantee Letter was forged.67Foot Note 67×DWS at paras 17–20. 52 Moreover, Reliance Infrastructure had all of the documents it needed to procure a forensic report of a handwriting expert to ascertain if the signatures on the Guarantee Letter were genuine or forged, but simply chose not to do so.68Foot Note 68×DWS at paras 24, 29 and 32. 53 Likewise, Reliance Infrastructure also waived its right to object to the Tribunal’s jurisdiction on the ground of Mr Agrawal’s want of authority, since it never mounted any objection to the Tribunal’s jurisdiction nor sought a ruling from the Tribunal that it had no jurisdiction over their dispute. The principle of separability means that it was insufficient for Reliance Infrastructure to only put in issue the validity of the Guarantee Letter withoutalsoputting in issue the validity of the arbitration agreement contained therein.69Foot Note 69×DWS at paras 58–59, 61–62 and 65–69. Response to Reliance Infrastructure’s allegation of forgery 54 In any event, even if Reliance Infrastructure had not waived its right to mount its jurisdictional objection based on forgery, Shanghai Electric submits that the external circumstances prove that the Guarantee Letter is genuine, based on the entire course of conduct between the Parties before and after its execution, including, among other things, the terms of the Framework Agreement, Mr Agrawal’s email on 26 August 2008 which acknowledged the existence of the Guarantee Letter and the eye-–witness evidence of Ms Yu.70Foot Note 70×DWS at paras 35 and 38. 55 Moreover, the expert evidence of its handwriting expert, Ms Lee, to the effect that Mr Agrawal’s initials and signature on the Guarantee Letter are all genuine when compared to his admitted signatures on other documents, should be preferred over the contrary evidence of Reliance Infrastructure’s handwriting expert, Mr Manas,71Foot Note 71×DWS at paras 36–37.which it characterises as biased, partisan, and tailored in service of the conclusion that the signatures were forgeries.72Foot Note 72×Day 2 Transcript at p 172 lines 13-–25. Mr Agrawal’s authority to make an arbitration agreement 56 Shanghai Electric argues that, under the separability doctrine, Reliance Infrastructure’s attacks on the authority of Mr Agrawal must fail since they are not directed at his want of authority to bind Reliance Infrastructure into an agreement to arbitratespecifically, as opposed to guarantees generally.73Foot Note 73×DWS at paras 58–62. 57 Hence, it argues that the arbitration clauses contained in the Framework Agreement, Hisar Indemnity, and DVC Draft Guarantee, and the involvement of Mr Agrawal’s in signing or negotiating such documents, meant that Reliance Infrastructure had ‘held out’ Mr Agrawal as having the apparent authority to make arbitration agreements with Shanghai Electric on its behalf.74Foot Note 74×DWS at paras 65–70. 58 Shanghai Electric further contends that Mr Agrawal had apparent authority to bind Reliance Infrastructure and relies on the evidence that supported the Tribunal’s finding of apparent authority.75Foot Note 75×CMB Vol I at pp 139–145 (Award dated 8 December 2022 at [275]–[302]).",
        "Issues to be determined": "59 We observe that Reliance Infrastructure has asserted three grounds to set aside the Award,viz, want of jurisdiction, fraud, and public policy. The success of these grounds all hinge upon showing that Mr Agrawal’s signature on the Guarantee Letter was forged or that he signed without authority. 60 The ground of fraud is not, upon analysis, a distinct ground for setting aside. It is only if Shanghai Electric forged the Guarantee Letter that Shanghai Electric’s officer, Ms Yu, adduced false evidence to the Tribunal by testifying that Mr Agrawal signed the Guarantee Letter. 61 The ground that the Award is contrary to the public policy of thelexfori(i.e., Singapore) in turn depends on showing that the Award was procured by fraud, which is contrary to Singaporean public policy. 62 Thus, the premise of Reliance Infrastructure’s case remains that the arbitration agreement was invalid either because the Guarantee Letter is the product of forgery or that Mr Agrawal had no authority to execute it. 63 Hence, we proceed to consider the following questions: (a) Whether Reliance Infrastructure waived its right to challenge the Award on the grounds of forgery and want of authority; and (b) If not, whether Reliance Infrastructure proved that – (i) the Guarantee Letter was forged; or (ii) Mr Agrawal lacked authority to make agreements to arbitrate with Shanghai Electric.",
        "Issue 1: Whether Reliance Infrastructure is precluded by waiver from raising its grounds to set aside the Award": "64 Our starting point is Art 16(2) of the Model Law – having the force of law in Singapore (as thelex lociarbitri) under s 3(1) of the IAA 1994 – which provides that “[a] plea that the arbitral tribunal does not have jurisdiction shall be raised not later than the submission of the statement of defence”. If raised later in the arbitral process, then the tribunal must be persuaded that the delay in raising the plea was a “justified” one. 65 The fundamental purpose behind Art 16(2) is to require parties to raise objections to the jurisdiction of an arbitral tribunal at the earliest possible time:HunanXiangzhong Mining Group Ltd v Oilive Pte Ltd[2022] 5 SLR 239 (“HunanXiangzhong”) at [42]. A party should be treated as having waived its right to raise a jurisdictional objection in a setting aside proceeding if it had made a decision not to raise it during the arbitration when it ought to have done so at that juncture:BAZ v BBA and others and othermatters[2020] 5 SLR 266 (“BAZ v BBA”) at [64] (see alsoRaknaArakshaka Lanka Ltd v Avant Garde Maritime Services (Pte) Ltd[2019] 2 SLR 131 at [50]–[51] and [61]–[62]). 66 However, a party will only be deemed to have waived its rights if the objection was clear to the party and they knew of the objection:BAZ v BBAat [59]. Crucially, the question is whether the party had knowledge of the “mattersunderlyingthe jurisdictional objection so that itcould have objectedin a timely fashion during the arbitration [emphasis added]” itself: per the Singapore International Commercial Court (“SICC”) decision inDeutsche Telekom AG v The Republic of India[2023] SGHC(I) 7 (“Deutsche Telekom v India”) at [165] (affirmed on appeal by our Court of Appeal inThe Republic of India v Deutsche Telekom AG[2023] SGCA(I) 10). 67 The SICC also considered whether “India hadgood reason forholding back on the three allegations due to lack of evidence and still–ongoing investigations [emphasis added]” and whether its “failure to raise the three illegality allegations in the Arbitration wasjustifiedor excusable[emphasis added]” (Deutsche Telekom v Indiaat [169] and [171]). Thus, once a party subjectivelyknows of facts that ground the jurisdictional objection, failure to raise it is only justified or excused for good reason which is a matter forobjectiveevaluation.",
        "Reliance Infrastructure waived its right to challenge the Award based on forgery": "68 We consider the state of Reliance Infrastructure’s actual knowledge of the facts underlying its right to object to the Tribunal’s jurisdiction, based on the alleged forgery of the Guarantee Letter at two stages. First, when the claim was originally made and it could find no mention or documentation thereof within its internal company records. Secondly, after the hearing when it was told that the original Guarantee Letter was not printed on its original letterhead. 69 First, it is Reliance Infrastructure’s own case that it only learnt of the existence of the Guarantee Letter, for the very first time, when Shanghai Electric raised it in its Notice of Dispute, and that it saw a copy of that document – again, for thefirst time– when Shanghai Electric appended that copy to its Notice of Arbitration. According to Mr Parakh, when Reliance Infrastructure received a copy “for the first time” on or around 13 December 2019, it checked its internal records and could find no “evidence of the existence of the purported Guarantee Letter in its records”.76Foot Note 76×CMB Vol I at p 55 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at paras 121–122).It could not find copies of it, nor any correspondence referring to it, nor any proof that its board ever knew and approved of it nor any recordation of that liability in its financial statements,77Foot Note 77×CWS at paras 48–49, 66 and 175.which, on Reliance Infrastructure’s own evidence, were marked departures from its established internal company processes.78Foot Note 78×CMB Vol I at pp 20–21 and 34–35 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at paras 34, 71 and 73). 70 It is obvious that, when a company receives a claim on a document of which it has no record and that none of its current employees recall, one possible explanation would be that the document was forged. Another is that it was signed without authority. 71 Indeed, Reliance Infrastructure relies upon the absence of records as strong circumstantial evidence that the Guarantee Letter is a forgery. Reliance Infrastructure invoked the fact that “there is not asinglepiece of documentary evidence to prove or even suggest that the parties had negotiated, let alone agreed to the terms of the Guarantee Letter.No drafts of the Guarantee Letter were ever exchanged between the parties. There areno contemporaneous records of discussions between the parties regarding the terms of any such guarantee[emphasis in original]”,79Foot Note 79×CWS at para 49.and describes that “complete dearth of documentation” as “especially astonishing when juxtaposed against” various pieces of correspondence between Parties on the Supply Contract.80Foot Note 80×CWS at para 51.They contend that the “suspicious nature of the circumstances leading up to the alleged execution of the Guarantee Letter is amplified” by the absence of record, that it “defies logic” that there is no “document trail or drafts of the Guarantee Letter” in Parties’ internal records, and “it is scarcely believable that there would not be any evidence that the Guarantee Letter was reviewed by the parties’ in–house or external lawyers”.81Foot Note 81×CWS at para 51. 72 All these matters raised in submissions to argue for the inference that the Guarantee Letter was forged were known to Reliance Infrastructure from the start. Indeed, in its Statement of Defence of 13 August 2020, Reliance Infrastructure asserted back then that it “has no record of issuing such purported Guarantee Letter to the Claimant [ie,Shanghai Electric]”.82Foot Note 82×CMB Vol II at p 327 (Statement of Defence dated 13 August 2020 at para 58).Yet, Reliance Infrastructure argues that it had “no reason … to suspect” and “no basis … to think” that the Guarantee Letter was forged.83Foot Note 83×CWS at para 178. 73 Indeed, when the hearing commenced before the Tribunal the possibility of forgery was sufficiently in the air for Reliance Infrastructure’s counsel to disavow it specifically in opening the defence.84Foot Note 84×CMB Vol III at p 46 (Transcript of SIAC ARB No. 448 of 2019 Hearing dated 6 September 2021 at TRA.500.001.0043 lines 13–15). 74 Reliance Infrastructure contends that it had good reason not to raise any jurisdictional objection because it had contacted Mr Agrawal via his mobile phone and he had in effect declined to say anything, because he felt he was working for a business competitor and should not become involved in a dispute on behalf of his former employer.85Foot Note 85×CMB Vol XI at pp 7–8 (Witness Statement of Mr Rajesh Agrawal dated 3 July 2023 at paras 8–10).He was not asked whether he signed the Guarantee Letter and hence he did not then tell them that he had not signed it.86Foot Note 86×Day 1 Transcript at p 25 lines 2–20. 75 In our view, if there was no record of the Guarantee Letter and Mr Agrawal had not told them that he had signed the letter, it was not reasonable for Reliance Infrastructure to assume that he had signed it, albeit without authority. It would have been a basic step to ask him the question directly. This was not done. 76 In short, subjectively knowing that the absence of record meant that the Guarantee Letter might be forged, Reliance Infrastructure did not have good reason for not raising the jurisdictional objection. It could and should have taken steps such as requesting the original Guarantee Letter from Shanghai Electric so that it could engage an expert to analyse the signature. 77 The position became even clearer in early 2022. The Tribunal had asked for a description of the original at the close of the hearing of 21 January 2022. An inaccurate answer was proffered by Shanghai Electric’s counsel that was corrected soon after by email dated 30 January 2022. This email explained that the letterhead on the Guarantee Letter had been printed in black–and–white (with Mr Agrawal’s signature appearing in blue ink). In response, Reliance Infrastructure’s lawyers sent an email to the Tribunal dated 4 February 2022, arguing that the revelation rendered the Guarantee Letter a “false instrument”. They said that “[i]f this was done by Mr Rajesh Agrawal”, it would constitute forgery, and “[e]ven if Mr Rajesh Agrawal participated in this misadventure, he would be a conspirator”.87Foot Note 87×CMB Vol VI at p 172 (Email from Khaitan & Co LLP to Tribunal dated 4 February 2022 at para 11).It added that the Guarantee Letter “appears to be a nullity (as all forgeries are nullities) … created by the Claimant [Shanghai Electric] (with or withoutthe connivance of Mr Rajesh Agrawal) [emphasis added]”.88Foot Note 88×CMB Vol VI at p 172 (Email from Khaitan & Co LLP to Tribunal dated 4 February 2022 at para 12). 78 Thus, at the time of its email of 4 February 2022, Reliance Infrastructure openly aired the possibility of a forgery. Yet it did not pursue that issue further before the Tribunal. Its own Schedule of Issues, updated on 11 February 2022, didnotinclude as a specific issue whether the Guarantee Letter was a forgery. There was only the general question (in S/N 1) “[w]hether the purported Guarantee Letter is valid, enforceable and binding upon the Respondent [ie, Reliance Infrastructure]”.89Foot Note 89×CMB Vol VI at p 64 (Respondent’s Summary Schedule of Issues dated 21 December 2021 (and updated on 11 February 2022) at S/N 1). 79 Moreover, the Tribunal then asked the Parties to indicate the “specific findings” sought on the issue of the Guarantee Letter. Reliance Infrastructure, in its reply dated 18 February 2022, did not seek any finding that Mr Agrawal had not signed the Guarantee Letter. It only alluded to its “serious concerns” that “the provenance of the purported Guarantee Letter … is in serious question” and sought “a declaration that the purported Guarantee Letter is invalid and unenforceable”.90Foot Note 90×CMB Vol VI at pp 191–192 (Email from Khaitan & Co LLP to Tribunal dated 18 February 2022 at pp 1–2). 80 The picture that emerges from the emails dated 4 February 2022 and 18 February 2022 is that, by that point in time, Reliance Infrastructure subjectively believed that the Guarantee Letter had been forged. At the hearing before us, it became clear that it consciously chose not to raise a jurisdictional objection because it was content to rest on its defences already run in the proceedings. Such was the oral evidence of Mr Parakh. When asked in cross–examination whether Reliance Infrastructure asked Mr Agrawal if he signed the Guarantee Letter after Reliance Infrastructure “learnt of the possibility of forgery”, Mr Parakh’s reply was “I don’t think that was a requirement because it was so clear during the oral submissions before the honourable tribunal. We were … very confident that this would come through in the award, whenever the tribunal gives the award. … It’s only the award which came other way [sic]”.91Foot Note 91×Day 1 Transcript at p 76 line 22 to p 77 line 7. 81 In other words, Reliance Infrastructure had made a conscious choice not to pursue its allegation of forgery because it was very confident that, under the circumstances, its other challenges to the validity of the Guarantee Letter would prevail in any event. It only wishes to revive that argument now because the outcome differed from its expectation. 82 Accordingly, Reliance Infrastructure has waived its right to raise forgery as a jurisdictional objection before us.",
        "Reliance Infrastructure waived its right to challenge the Award based on want of authority": "83 Reliance Infrastructure similarly waived its right to raise its objection to the Tribunal’s jurisdiction, based on Mr Agrawal’s alleged want of authority, when it failed to put in issue the Tribunal’sjurisdiction over the dispute, on the basis of Mr Agrawal’s want of authority to execute anagreement to arbitrate, more specifically, whilst clearly having had actual knowledge of all the relevant facts to mount that objection, at the time of the SIAC arbitral proceedings. 84 That actual knowledge is clear from the fact that Reliance Infrastructuredidput in issue, at the outset of the proceedings, the validity of the Guarantee Letter, based on Mr Agrawal’s lack of authority to execute that agreement.92Foot Note 92×CMB Vol II at pp 328–330 (Statement of Defence dated 13 August 2020 at paras 62–68)Yet it did not at any time seek a ruling from the Tribunal that it had no jurisdiction to rule on the Parties’ dispute, based on Mr Agrawal’s absence of authority to execute anarbitration agreementon its behalf. It now seeks to make before us the latter objection based on substantially the same facts upon which it pleaded the former objection – this it cannot do. Having been “aware of the matters underlying the jurisdictional objection so that it could have objected in a timely fashion during the arbitration” (seeDeustcheTelekom v Indiaat [165]), and failing to do so then, it is precluded by waiver from raising that objection now. 85 Reliance Infrastructure makes several attempts to rebut this argument. First, it suggests that itdidput the validity of the arbitration agreement in issue because it put the validity of the Guarantee Letter in issue, within which that agreement is contained.93Foot Note 93×Day 1 Transcript at p 14 lines 3–9.That submission is squarely against the principle of separability as described, for example, inFiona Trust& Holding Corporation and others v Privalov and others[2007] UKHL 40 (“Fiona Trust”) at [17]–[18]. An agreement to arbitrate is a separate contract that survives the destruction or rescission of the underlying contract in which it is contained. The separability doctrine is also found in Art 16(1) of the Model Law, which has the force of law in thelex lociarbitri(see s 3(1), IAA 1994), which provides that “[a] decision by the arbitral tribunal that the contract is null and void shall not entail ipso jure the invalidity of the arbitration clause”. 86 Accordingly, to put in issue that the Guarantee Letter was invalid does not impliedly put in issue that the arbitration agreement wasalsoinvalid. This is confirmed by the heads of relief sought in the arbitration itself. Reliance Infrastructure never sought a finding from the Tribunal that it lacked jurisdiction to arbitrate the Parties’ dispute. Instead, it sought “[a] declaration that the purported Guarantee Letter is invalid and not enforceable”, as noted by the Tribunal in its Award at [130(a)].94Foot Note 94×CMB Vol I at p 108 (Award dated 8 December 2022 at [130(a)]); CMB Vol VI at p 192 (Email from Khaitan & Co LLP to Tribunal dated 18 February 2022 at p 2). 87 When considered against the fact that Reliance Infrastructure never put in issue the invalidity of the arbitration agreement based on Mr Agrawal’s want of authority, this declaratory relief can only be construed as substantive relief rather than an objection to jurisdiction. It sought the dismissal of Shanghai Electric’s claims on the basis that it was not bound by the substantive contractual obligations found in the Guarantee Letter. It did not attack the validity of the arbitration agreement or the jurisdiction of the Tribunal. 88 Secondly, Reliance Infrastructure argues that if the main contract fails on a set of facts which wouldof themselvesalso entail the failure of any arbitration agreement therein, there is no requirement that a party expressly state that it is attackingboththe main contractandthe arbitration agreement to put both of those challenges in issue.95Foot Note 95×Day 2 Transcript at p 103 line 20 to p 104 line 4. 89 It relies on portions of the reasoning of both the English House of Lords inFiona Trustand our Court of Appeal inFounder Group (Hong Kong) Ltd (inliquidation) v Singapore JHC Co Pte Ltd[2023] SGCA 40 (“Founder Group”) in support of this argument.96Foot Note 96×Day 2 Transcript at p 104 line 25 to p 106 line 12. 90 We do not agree with the interpretation of these authorities that Reliance Infrastructure propounds. Reliance Infrastructure relies on the paragraph inFounder Groupat [58], where it was explained that: The principle of separability cannot guarantee the survival of the arbitration clause in all circumstances. Instead, where a challenge to the validity of the underlying contract is raised, it will be crucial to determine if this is also an attack on the arbitration agreement. This will necessarily be a fact–sensitive exercise, and much will depend on thenatureof the challenge mounted against the underlying contract. … if the allegation is that the entire contract was entered into without authority, this may well be an attack on both the underlying contract and the arbitration agreement, as the implication would be that every clause in the contract including the arbitration agreement was entered into without authority. On the other hand, where the challenge is that the underlying contract is void or voidable for misrepresentation, the arbitration agreement may survive because the parties’ intention to arbitrate may not be affected by the misrepresentation. … [emphasis in original] 91 Indeed, that the whole agreement was entered into without authority “may well be an attack” on the arbitration agreement, but it may not always be. The distinction is important on the facts of this case. Mr Agrawal had previously signed an indemnity on behalf of Reliance Infrastructure in favour of Shanghai Electric: Reliance Infrastructure distinguished this on the basis that it was an indemnity and not a parent company guarantee. But both contained arbitration agreements. This illustrates the point that the person signing an agreement may have authority to enter into arbitration agreements but not to enter into the contract which contains it. 92 Thus, an attack on the main contract remains conceptually separate, in law, from an attack on the arbitration agreement within it. The learned Lord Hoffmann gave the example inFiona Trustat [17] that “if the main agreement and the arbitration agreement are contained in the same document and one of the parties claims that he never agreed to anything in the document and that his signature was forged, that will be an attack on the validity of the arbitration agreement. But the ground of attack is not that the main agreement was invalid. It is that the signature to the arbitration agreement, as a ‘distinct agreement’, was forged. Similarly, if a party alleges that someone who purported to sign as agent on his behalf had no authority whatever to conclude any agreement on his behalf, that is an attack on both the main agreement and the arbitration agreement”. 93 We do not read the decision inFounder Groupas erasing the distinction between an attack on an arbitration agreement and an attack on the main contract in which it is found. While there may be an overlap – if not an outright identity, in some cases – of the facts and evidence used to invalidate both agreements, they remain distinct agreements nevertheless. The question to be asked is whether the ground for invalidation being pleaded would affect the arbitration agreement as a separate agreement. Thus, inFiona Trustat [18], the mere fact that an agent was shown to have exceeded his authority in making the main contract did not automatically mean that he also exceeded his authority in making the arbitration agreement found therein. 94 It is also important to keep in mind that the question we are concerned with is whether Reliance Infrastructure isprecluded by waiverfrom raising the objection now. For the purpose of deciding that issue, the relevant question is whether Reliance Infrastructure did or did not pursue its jurisdictional objection, on the grounds of Mr Agrawal’s want of authorityto make an arbitrationagreement, during the arbitral process itself. It plainly did not do so. Instead, it was content for the question of authority to be decided by the Tribunal. 95 Having failed in its defence of lack of authority on the merits, Reliance Infrastructure cannot now recast its merits defence as a jurisdictional objection for which it seeksde novoreview before us.",
        "Issue 2: Reliance Infrastructure failed to show that the Guarantee Letter was forged": "96 As we find that Reliance Infrastructure has waived its rights to challenge the Award on the basis of forgery and want of authority, its application to set aside the Award must be dismissed. We will not delve in detail into the merits of these challenges, given that Reliance Infrastructure is precluded by waiver from raising them before us now. However, even if those challenges had not been waived, we are not persuaded of their merits in any event. We shall now briefly canvass our reasons for coming to that view on the evidence before us.",
        "The external evidence clearly showed that the Guarantee Letter is genuine": "97 First of all, the objective evidence proved the existence of the executed Guarantee Letter. The most compelling evidence was the email sent by Mr Agrawal to officers of Shanghai Electric on 26 August 2008. In that email, he wrote concerning two other power plant projects in India that for those contemplated projects “RIL Guarantee Letter similar to Sasan would be given for Reliance Infra behalf”. “RIL” is an acronym for Reliance Infrastructure Limited, with “Reliance Infra” being an abbreviation of the same.97Foot Note 97×Day 1 Transcript at p 51 line 23 to p 52 line 3. 98 In our view, the language used must refer to a guarantee letter that isalreadyexecuted and in existencein respect of the Sasan Project. There can only be similarity to something that exists. Moreover, the words are capitalised. 99 Mr Agrawal’s testimony was that he could not remember sending the email,98Foot Note 98×Day 1 Transcript at p 47 lines 19–21 and p 48 lines 14–16.which in his witness statement he referred to as “an email purportedly sent by me”.99Foot Note 99×CMB Vol XI at p 11 (Witness Statement of Mr Rajesh Agrawal dated 3 July 2023 at para 21).Notwithstanding that he could not remember it, he gave evidence that he must have meant a “draft” and not an executed version.100Foot Note 100×Day 1 Transcript at p 57 lines 22–24 and p 59 lines 16–23.He testified that subsequently it was decided not to give such a guarantee. First, if Mr Agrawal could not remember the email, he could not reliably give evidence of what he meant when sending that email. Secondly, his explanation is unconvincing and does not match the words he in fact used, as described above. 100 The inference to be drawn from the 26 August 2008 email is that, by that point in time, the Guarantee Letter had been executed by Mr Agrawal in favour of Shanghai Electric for the Sasan Project. That inference is only further strengthened upon reference to the Term Sheet of the Framework Agreement concluded between the Parties on 20 May 2008. This contained a provision that “[t]he Purchaser shall provide suitable guarantee letter from its parent company acceptable to the Contractor with in [sic] one week of signing of contract”.101Foot Note 101×CMB Vol VIII at p 88 (Framework Agreement for Long–Term Strategic Cooperation for Various Power Generation Projects in India dated 20 May 2008, Annexure–3 Term Sheet at S/N 1).The Purchaser is defined as RIPIL, the sole holding company of Reliance (UK).102Foot Note 102×CMB Vol VI at p 439 (Chart of Corporate Structure of Reliance Group in 2008–2009).The Contractor is also defined therein as Shanghai Electric. As for what “contract” is being referred to, it must be the Supply Contract concluded between Shanghai Electric and Reliance (UK), since the “Owner” is defined in the same section of the Term Sheet as Sasan Power; hence, that “contract” must be a contract with Shanghai Electric involving the Sasan Project. 101 The reasonable inference to be drawn from the Framework Agreement is that, on 20 May 2008, there was a common understanding between the Parties that Shanghai Electric would receive a guarantee letter from a parent company of RIPIL in relation to the Sasan Project. This supports the interpretation that the 26 August 2008 email was referring to a Sasan guarantee letter that was in existence, and not one which might or might not be agreed upon in future. 102 Reliance Infrastructure proffers unconvincing alternative explanations for this term in the Framework Agreement’s Term Sheet. First, its witness Mr Parakh suggested that Reliance Infrastructure could not be the “parent company” referred to in the Framework Agreement since it only held 10% of the shareholding of RIPIL.103Foot Note 103×CMB Vol I at p 38 (Witness Statement of Mr Neeraj Parakh dated 12 March 2023 at para 82).But this merely puts in question which company in the group should eventually give the guarantee, not that there should be a guarantee from the appropriate entity. 103 On that question of the intended guarantor there is ample material indicating that that was Reliance Infrastructure.  First, there is the DVC Draft Guarantee, sent in an email dated 23 June 2008 from an officer of Reliance Infrastructure to the officers of Shanghai Electric (whilst copying Mr Agrawal). Paragraph B of its recitals states that “RELINFRA [ie,Reliance Infrastructure] has assigned the BTG Contract to Reliance Infra Projects UK Limited …whichis a subsidiary ofRELINFRA [emphasis in bold and italics]”.104Foot Note 104×CMB Vol X at p 32 (Draft Guarantee Letter dated 25 June 2008 at p 1).Although that DVC Draft Guarantee may not have been executed in the end, the contents of that draft, which were sent by Reliance Infrastructure to Shanghai Electric, show that, whatever the internal corporate structure of the Reliance Group may have been, as far as Shanghai Electric was aware, the Parties were content to deal with each other on the understanding that Reliance (UK) was, for all intents and purposes, in fact a subsidiary of Reliance Infrastructure. This is reinforced by the Supply Contract, which contains a similar description of Reliance (UK) as “a subsidiary of Reliance Infrastructure Limited for the procurement of equipments [sic]& services from outside India for the projects of the group companies of Reliance Infrastructure Limited” in its recitals.105Foot Note 105×CMB Vol I at p 522 (Equipment Supply and Service Contract dated 26 June 2008 at p 2). 104 It follows that the “parent company” of RIPIL (sole holding company of Reliance (UK)) which was to provide a guarantee letter to Shanghai Electric under the Framework Agreement would have been Reliance Infrastructure. This would make sense as Reliance Infrastructure was also the only member of the Reliance Group that was a party to the Framework Agreement in the first place. 105 However, Reliance Infrastructure also argues that, even if it was agreed in the Framework Agreement that a guarantee letter would be given to Shanghai Electric, that understanding ended when Mr Agrawal sought to amend the Supply Contract to remove a ‘parent company guarantee’ clause on 25 May 2008,106Foot Note 106×CMB Vol VIII at p 497 (Draft Equipment Supply and Service Contract dated 23 May 2008 at p 4).which was acceded to by Shanghai Electric.107Foot Note 107×CWS at para 42. 106 In our view, that does not follow. The effect of the clause was to include an undertaking to provide the guarantee within a week after the signing of the Supply Contract. The clause was no longer needed once it was agreed that the Guarantee Letter was to be provided, as it later was, at the same time or prior to the signing of the Supply Contract. This is consistent with the words used by Mr Agrawal at the time, namely, “we request deletion from here”. The “here” was the Supply Contract. It was not a change of heart over whether the parent company letter would be given.",
        "The evidence of Ms Yu should be preferred over the evidence of Mr Agrawal": "107 The fact that the objective documentary and circumstantial evidence support the inference that the Guarantee Letter is genuine provides independent corroboration of Ms Yu’s evidence that she saw Mr Agrawal sign the Guarantee Letter at the signing ceremony of 26 June 2008, and for the same reason, it undermines the credibility of Mr Agrawal and his evidence that he didnotsign the Guarantee Letter. Separately, we also find Ms Yu’s testimony convincing. It was given matter–of–factly and clearly. Conversely, we do not find Mr Agrawal’s testimony to be reliable. 108 Mr Agrawal’s evidence on the 26 August 2008 email was unconvincing. In his witness statement, he first stated that that it was an email purportedly sent by him and that he had no memory of that email at all.108Foot Note 108×CMB Vol XI at p 11 (Witness Statement of Mr Rajesh Agrawal dated 3 July 2023 at para 21).He did not offer any explanation of the contents of that email – to the contrary, he claimed to have no memory of the “contextin which this email was sent [emphasis added]”. He added that as he never signed the Guarantee Letter “there was no reason why I would have referred to any such Guarantee Letter for the Sasan UMPP”. This stands in stark contrast with his oral evidence, under cross–examination, where for the first time he proffered an explanation of the contents of an email that he maintained he still had no memory of,109Foot Note 109×Day 1 Transcript at p 48 lines 14–16 and p 50 lines 5 and 11–12.as follows: “the intent of my mail, if it appears to be that whatever the decision will happen on Sasan, we will follow the same one for Butibori. That was the intent”.110Foot Note 110×Day 1 Transcript at p 51 lines 16–19. 109 That explanation, that a reference to a Sasan guarantee letter meant only apotentialguarantee letter that was still being discussed between the Parties at the time, contradicts Mr Agrawal’s earlier claim that there was “no reason” he would be referring to a Sasan guarantee letterat allin his 26 August 2008 email. It also cannot be squared with his claim that he has no memory of sending that email or the “context in which” it was sent. In addition to these difficulties with his testimony, the explanation given cannot be squared with the plain language he used within the email itself. The statement that a guarantee letter “similar to Sasanwouldbe given [emphasis added]” is clearly not provisional or conditional on some future event that may or may not materialise, but can only be a reference to a guarantee letter already in existence at that point in time. Indeed, he later said that the “RIL Guarantee Letter” was a reference to a draft in existence.111Foot Note 111×Day 1 Transcript at p 57 lines 22-24.As a result of such internal and external difficulties, we find that Mr Agrawal is not a credible witness and we accord little weight to his evidence. 110 In contrast, we find Ms Yu to be a credible witness, as her testimony that Mr Agrawal had signed the Guarantee Letter coheres with the external evidence pointing to the existence of that Guarantee Letter, including the 26 August 2008 email considered together with the Term Sheet of the Framework Agreement. Her explanation for the removal of the ‘parent company guarantee’ clause from the Supply Contract – that Reliance Infrastructure hadalreadyagreed to provide the guarantee letter at the same time as the Supply Contract would be signed, making such a clause unnecessary – was logical and made commercial sense.112Foot Note 112×Day 1 Transcript at p 106 lines 15–25.There was no need to bind Reliance (UK) under the Supply Contract to obtain a ‘parent company guarantee’ when that very company, Reliance Infrastructure, had already agreed to provide one together with the signing of that Supply Contract. 111 Additionally, the attacks which Reliance Infrastructure level against her credibility strike us as unfair, generally resting on minor immaterial inconsistencies which are readily explained as mere lapses of memory from the long passage of time. 112 For example, much was made of the fact that Ms Yu appeared unsure of where precisely the Guarantee Letter was signed, when she was sure that the Supply Contract was signed in the front of the room as part of the ceremony.113Foot Note 113×Day 1 Transcript at p 124 lines 7–25.The suggestion that this was a conveniently selective loss of memory on her part seems unwarranted to us.114Foot Note 114×Day 1 Transcript at p 124 lines 7–14.It is not unreasonable given the passage of time that Ms Yu may not be able to remember preciselywherethe Guarantee Letter was signed while remembering that it was, in fact, signed at the relevant time. 113 Moreover, the argument that Ms Yu vacillated in her evidence concerning whether the signing of the Guarantee Letter was part of the signing ceremony or not rested on interpretation of what Ms Yu meant by her evidence that the signing of the Guarantee Letter was part of the ceremony.115Foot Note 115×Day 1 Transcript at p 126 lines 3–16.As Ms Yu explained, “[a]t the ceremony, he did not go onto the stage to sign the document, but in my view that’s still an official signing”.116Foot Note 116×Day 1 Transcript at p 124 lines 20–22.When Ms Yu testified that Mr Agrawal signed the Guarantee Letteratthe signing ceremony, as “part of” that ceremony,117Foot Note 117×Day 1 Transcript at p 123 lines 4–6.she was not saying – as Reliance Infrastructure interpreted it to mean – that the Guarantee Letter was signed atpreciselythe same time and location as the Supply Contract, with identical fanfare and formalities for both.118Foot Note 118×Day 1 Transcript at p 127 line 21 to p 128 line 8.It could just as easily mean – as she explained – that the Guarantee Letter was signed on the day ofthe signing ceremony, but not necessarily atexactlythe same time as the Supply Contract. Moreover, her explanation for why the Guarantee Letter was signedbeforethe Supply Contract accords with commercial commonsense,viz, that Shanghai Electric would naturally want that protection in handbeforeit bound itself to a contract with Reliance (UK)withouta guarantee from its parent company being in force at that point in time.119Foot Note 119×Day 1 Transcript at p 125 lines 12–15. 114 Accordingly, we accept Ms Yu’s evidence and reject that of Mr Agrawal.",
        "The expert evidence of Mr Manas failed to show that the signatures on the Guarantee Letter were forgeries": "115 Finally, we briefly canvass our views on the contrary evidence of the handwriting experts, Mr Manas and Ms Lee, whose reports arrived at competing conclusions as to whether the signatures on the Guarantee Letter were forgeries. 116 The two experts employed differing methodologies for their appraisals. Ms Lee did not detect line quality defects in the disputed signatures when comparing them against Mr Agrawal’s admitted signatures under a stereo microscope,120Foot Note 120×CMB Vol XII at pp 395–396 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at paras 4.1–4.2).and identified similar characteristics in terms of pen pressure, line quality, and stroke fluency between the disputed and admitted signatures.121Foot Note 121×CMB Vol XII at pp 400–401 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at paras 5.2(b)-–5.2(d)).She found no signs of tracing in the disputed signatures when examining them under oblique lighting, including the re–touching of strokes, unusual pen lifts, unusual pen pressure or stroke hesitation.122Foot Note 122×CMB Vol XII at pp 399 and 401 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at paras 5.2(a) and 5.2(c)). 117 In contrast, Dr Manas’s methodology involved among other thingssuperimposing the disputed signatures upon the admitted signatures under transmitted light to detect suspicious similarities and indicators of manual tracing,123Foot Note 123×CMB Vol XI at p 50 (Expert Report of Mr Manas Mishra dated 23 October 2023 at para 10.1).using oblique light to detect indentations as a sign of unusually high pen pressure as indicative of slower execution in a forgery,124Foot Note 124×CMB Vol XI at pp 50–51 (Expert Report of Mr Manas Mishra dated 23 October 2023 at para 10.3).and the ‘ruled square’ method of examining the admitted and disputed signatures under a transparent sheet bearing ruled squares of the same scale, to compare them for suspicious similarities.125Foot Note 125×CMB Vol XI at p 50 (Expert Report of Mr Manas Mishra dated 23 October 2023 at para 10.2).Based on these methods, he concluded that all five initials and signatures on the Guarantee Letter were the product of forgery. 118 We do not accept the criticisms of Mr Manas as an expert pressed by counsel for Shanghai Electric.126Foot Note 126×Day 1 Transcript at p 180 line 23 to p 181 line 2 and p 187 lines 8–12.We consider that he attempted a thorough examination of the material before him. He was not biased or partial. However, we are not able to accept his conclusion that the signature and initials were forged. In our view, Mr Manas’s interpretation of the evidence was not sufficiently compelling, especially when Ms Lee’s interpretation was considered. 119 For example, Mr Manas detected the presence and absence of striations in several of the disputed signatures, which he chalked up to the deliberate re–tracing or re–touching of strokes, which is indicative of forgery.127Foot Note 127×CMB Vol XI at pp 58–60 (Expert Report of Mr Manas Mishra dated 23 October 2023 at paras 13–17).In contrast, Ms Lee did not interpret these striations as indicative of forgery, and was of the view that they could be attributable to the uneven ink flow of a ballpoint pen.128Foot Note 128×CMB Vol XII at pp 407–408 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at paras 8.2(c)–8.2(e)). 120 Likewise, Mr Manas detected what he regarded as line quality defects in the disputed signatures, which he interpreted as being indicative of hesitation, slow execution, re–tracing of strokes, and unnatural pen pauses and pen lifts, all signs of forgery in his view.129Foot Note 129×CMB Vol XI at pp 60–62 (Expert Report of Mr Manas Mishra dated 23 October 2023 at paras 16 and 18–25).In contrast, Ms Lee was of the view that they were attributable to striations from a ballpoint pen or an unsteadiness in pen movement also seen in Mr Agrawal’s admitted signatures.130Foot Note 130×CMB Vol XII at p 411 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at paras 8.3(c)–(d)). 121 While Mr Manas had concluded from his superimposition of the signatures under transmitted light that, among other things, the long form signature on the Guarantee Letter had suspicious similarities with one of Mr Agrawal’s admitted signatures, suggesting that the latter was used to trace the former,131Foot Note 131×CMB Vol XI at p 66 (Expert Report of Mr Manas Mishra dated 23 October 2023 at paras 30–32).Ms Lee was of the view that the signatures were not suspiciously similar, and there were marked and significant departures in their sizes, formations, and relative alignments.132Foot Note 132×CMB Vol XII at p 416 (Report on Forensic Examination of Signatures by Ms Lee Gek Kwee dated 24 November 2023 at para 8.5(b)). 122 We do not propose to set out exhaustively the differences between the expert opinions of Ms Lee and Mr Manas. It suffices for us to state that we consider these to be attributable to reasonable differences of interpretation by two handwriting experts. They have both drawn broadly logical inferences from the same set of primary data but reach differing secondary conclusions. Hence, for this reason, taking their evidence on its own, we would not prefer the expert conclusions of Mr Manas over Ms Lee. Thus, even on the conflicting expert evidencealone, Reliance Infrastructure would have failed to discharge its burden of proving forgery of the Guarantee Letter. 123 We do not, however, assess the conflicting expert evidence in isolation. We consider that evidence in conjunction with the totality of the direct evidence of Ms Yu and Mr Agrawal together with the circumstantial evidence concerning the execution of the Guarantee Letter. Such circumstantial evidence, as we have explained, strongly supports the inference that the Guarantee Letter is genuine and was signed by Mr Agrawal. Hence, even if Reliance Infrastructure had not waived its forgery claim, we would have rejected it on its merits, based on the totality of the evidence before us.",
        "Issue 3: Reliance Infrastructure failed to show that Mr Agrawal lacked the apparent authority to commit it to agreements to arbitrate with Shanghai Electric": "124 Finally, we find that Mr Agrawal had the apparent authority to commit Reliance Infrastructure into agreements to arbitrate with Shanghai Electric, and would have dismissed its jurisdictional objection on this ground even if it had not been waived. 125 As a preliminary point, we note for completeness that although Reliance Infrastructure had made submissions on Mr Agrawal’s absence of express actual authority, implied actual authority, and apparent authority,133Foot Note 133×CWS at paras 98–142.while Shanghai Electric submitted on Mr Agrawal’s implied authority and apparent authority,134Foot Note 134×DWS at paras 56–70 and 74–86.the central point in issue is Mr Agrawal’sapparentauthority. If he had apparent authority, the issues of express and implied actual authority are moot. 126 We also note that the Parties’ written submissions were at odds as to the governing law to be applied to the agreement to arbitrate in the Guarantee Letter. Reliance Infrastructure’s position was that the applicable law was Indian law, and in the alternative, Singapore law,135Foot Note 135×CWS at paras 150–153.whereas Shanghai Electric’s view was that the governing law of the arbitration agreement was English law.136Foot Note 136×DWS at paras 46–51.By the time of the second day of the hearing before us, 12 January 2024, however, the Parties indicated that they were prepared to agree that the law which governs the formation of the arbitration agreement (based on Mr Agrawal’s apparent authority) is English law.137Foot Note 137×Day 2 Transcript at p 54 lines 4-–17 and p 175 lines 16–24.This accords with the view of the Tribunal, which held in its Award that the governing law of the arbitration agreement was English law.138Foot Note 138×CMB Vol I at pp 157–161 (Award dated 8 December 2022 at [345]–[366]). 127 Hence, we apply English law to determine whether Mr Agrawal had the apparent authority to conclude an arbitration agreement on behalf of Reliance Infrastructure. Thelocus classicusis the English Court of Appeal decision ofFreeman and Lockyer (a firm) v Buckhurst Park Properties (Mangal) Ltd and another[1964] 2 QB 480 (“Freeman & Lockyer”). This held that the most common means by which a principal may represent or ‘hold out’ that an agent has ostensible authority to contract on its behalf is the conduct of permitting or acquiescing in the agent conducting the business of the principal with third parties, cloaking that agent with apparent authority to make contracts in the ordinary course of such business:Freeman & Lockyerat 505. 128 On that ground, we find that Reliance Infrastructure had ‘held out’ Mr Agrawal as having the apparent authority to make arbitration agreements with Shanghai Electric on its behalf, for the reasons that follow.",
        "Signing the Hisar Indemnity": "129 In our view, the clearest representation that Mr Agrawal had apparent authority to make arbitration agreements with Shanghai Electric on Reliance Infrastructure’s behalf was their having him sign the Hisar Indemnity. This indemnity contained an arbitration agreement in Paragraph 6(b).139Foot Note 139×CMB Vol VI at p 459 (Indemnity Agreement dated 9 February 2007 at para 6(b)).It was signed by Mr Agrawal on behalf of Reliance Energy Limited, the previousname of Reliance Infrastructure.140Foot Note 140×CMB Vol VI at p 460 (Indemnity Agreement dated 9 February 2007 at p 7).That agreement had been executed on 9 February 2007,beforethe signing of the Guarantee Letter on 26 June 2008. Similar to the Guarantee Letter, it concerned a power plant project in India which both Parties were involved in. 130 While there are differences between the arbitral processes provided in Paragraph 6(b) of the Hisar Indemnity and Paragraph 10 of the Guarantee Letter –eg, the former provides for one arbitrator, the latter provides for three; the former selects SIAC arbitration rules as the procedural regime, the latter selects UNCITRAL arbitration rules,etc– these do not affect the salient point that Reliance Infrastructure effectively ‘held out’ Mr Agrawal as having the authority to commit it into agreements to arbitrate disputes with Shanghai Electric. The differences are minor and immaterial to the question of authority to bind Reliance Infrastructure to arbitration agreements. 131 Reliance Infrastructure invokes differences in the commercial context surrounding the two agreements to argue that Mr Agrawal’s authority to execute the Hisar Indemnity did not amount to a representation that he could execute the Guarantee Letter. In particular, it argues that the indemnity in the Hisar Indemnity was for a joint deed of undertaking (JDU) executed by both Parties to the project owner, whereas the Guarantee Letter concerned a ‘parent company guarantee’, which it says Mr Agrawal had no authority to make.141Foot Note 141×Day 2 Transcript at p 60 lines 1–21. 132 That argument is at odds with the principle that agreements to arbitrate are separate and distinct agreements from the underlying contract. Even if it is assumed that Mr Agrawal’s signing of the Hisar Indemnity wouldnotamount to a reasonable representation that he could sign ‘parent company guarantees’ on behalf of Reliance Infrastructure, it wouldnonethelessamount to a representation that he could sign arbitration agreements on their behalf. It is not enough to point to commercial differences between the Guarantee Letter’s and Hisar Indemnity’ssubstantiveterms; instead, “[i]t would have to be shown that whatever the terms of the main agreement or the reasons for which the agent concluded it, he would have had no authority to enter into an arbitration agreement”:Fiona Trustat [18]. 133 Hence, the fact that Reliance Infrastructure permitted or acquiesced in Mr Agrawal signing an arbitration agreement on its behalf within the Hisar Indemnity, thereby committing it to arbitrate its disputes with Shanghai Electric, was a clear representation that he had authority to make arbitration agreements with Shanghai Electric on its behalf. We consider that that representation is even clearer when considered together with two other events – (a) First, while he did not sign the agreement itself, on 20 May 2008, Mr Agrawal initialled at the bottom–left of every page of the Framework Agreement on Reliance Infrastructure’s behalf, including the page for Paragraph 3.7, which also contained an agreement to arbitrate disputes with Shanghai Electric;142Foot Note 142×CMB Vol VIII at p 77 (Framework Agreement for Long–Term Strategic Cooperation for Various Power Generation Projects in India dated 20 May 2008 at para 3.7).and (b) On 23 June 2008, Mr Devinder Batta, who is described by Mr Agrawal as his “junior”,143Foot Note 143×Day 1 Transcript at p 41 lines 17–19 and p 42 lines 23–24.sent an email to Shanghai Electric’s officers, copying Mr Agrawal, proposing a draft of the DVC Draft Guarantee to be reviewed and “finalised in today’s meeting”,144Foot Note 144×CMB Vol VI at p 441 (Email from Mr Devinder Batta to Shanghai Electric Group Co Ltd dated 23 June 2008).Paragraph 10 of which contained an agreement to arbitrate disputes with Shanghai Electric.145Foot Note 145×CMB Vol VI at pp 445–446 (Draft Guarantee Letter dated 25 June 2008 at para 10).This draft was similarly worded to Paragraph 10 of the Guarantee Letter. 134 We find that a reasonable person placed in Shanghai Electric’s shoes, considering the totality of Reliance Infrastructure’s conduct, would conclude that Mr Agrawal had authority to make arbitration agreements with Shanghai Electric on Reliance Infrastructure’s behalf. Thus, the making of the arbitration agreement found in Paragraph 10 of the Guarantee Letter fell squarely within the scope of Mr Agrawal’s ostensible authority. This is regardless of whatever may be said about Mr Agrawal’s apparent authority (or lack thereof) to make ‘parent company guarantees’ or to execute other commercial agreements between the Parties. 135 Indeed, the differences in nature between the Hisar Indemnity and the Guarantee Letter were not so great that his previously signing the Hisar Indemnity on behalf of Reliance Infrastructure would not amount to a representation that he had authority to sign the Guarantee Letter. Both were commercial contracts. An objective observer would not have come to the view that his authority was limited only to indemnities and not to parent company guarantees.",
        "The external circumstances reinforced that Reliance Infrastructure ‘held out’ Mr Agrawal as having the authority to make agreements with Shanghai Electric on its behalf": "136 In any event, our finding that Mr Agrawal had apparent authority is only reinforced when one broadens the scope of analysis beyond Mr Agrawal’s prior making, signing or proposing of arbitration agreements with Shanghai Electric to consider the wider pattern of Mr Agrawal’s involvement in the negotiations between Parties on various power plant projects they were both involved in. 137 That conduct of Mr Agrawal included – (a) Leading the negotiations between the Reliance Group entities and Shanghai Electric, as averred by Reliance Infrastructure’s witness, Mr Parakh, who confirmed that while Mr Agrawal was a ‘liaison’, healsoled the negotiations, while not having decision–making authority;146Foot Note 146×Day 1 Transcript at p 91 lines 21–25. (b) Signing the Hisar Indemnity on Reliance Infrastructure’s behalf (as Reliance Energy Limited) on 9 February 2007;147Foot Note 147×CMB Vol VI at p 460 (Indemnity Agreement dated 9 February 2007 at p 7). (c) Sending an email to the officers of Shanghai Electric on 30 July 2007 conveying that he and two members of Reliance Group’s senior management would like to visit Shanghai Electric’s office “as soon as possible to discuss the frame work and strategy for the Sasan as well as for Shahapur projects”;148Foot Note 148×CMB Vol VI at p 473 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 30 July 2007). (d) Sending other emails to Shanghai Electric relaying relevant draft contractual documents on 8 October 2007,149Foot Note 149×CMB Vol VI at pp 476-–477 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 8 October 2007).arranging for discussions to finalise the signing of contracts on 16 February 2008,150Foot Note 150×CMB Vol VI at pp 479–480 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 16 February 2008).and relaying comments and changes on the terms of draft contractual documents on 29 February 2008,151Foot Note 151×CMB Vol VI at p 482 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 29 February 2008).14 March 2008,152Foot Note 152×CMB Vol VI at p 484 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 14 March 2008).and 9 May 2008;153Foot Note 153×CMB Vol VI at p 486 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 9 May 2008). (e) Initialling at the bottom-–left of every page of the Framework Agreement between the Parties on behalf of Reliance Infrastructure on 20 May 2008;154Foot Note 154×CMB Vol VIII at pp 69–97 (Framework Agreement for Long–Term Strategic Cooperation for Various Power Generation Projects in India dated 20 May 2008). (f) Proposing contractual changes such as in the email dated 25 May 2008 seeking the deletion of the ‘parent company guarantee’ clause from the Supply Contract;155Foot Note 155×CMB Vol VIII at p 497 (Draft Equipment Supply and Service Contract dated 23 May 2008 at p 4). (g) Attending the signing ceremony on 26 June 2008 when members of Reliance Group’s senior management could not be present, delivering a speech which conveyed various sentiments “on behalf of” the Reliance Group;156Foot Note 156×CMB Vol VIII at pp 103–104 (Contents of the Draft Speech of Mr Rajesh Agrawal enclosed in an email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 26 June 2008). (h) Signing the Supply Contract at the signing ceremony on 26 June 2008 on behalf of Reliance (UK),157Foot Note 157×CMB Vol I at p 527 (Equipment Supply and Service Contract dated 26 June 2008 at p 7).subsidiary of Reliance Infrastructure (as described in the Supply Contract and the DVC Draft Guarantee);158Foot Note 158×CMB Vol X at p 32 (Draft Guarantee Letter dated 25 June 2008 at p 1); CMB Vol I at p 522 (Equipment Supply and Service Contract dated 26 June 2008 at p 2). (i) As we regard Ms Yu to be a credible witness and would prefer her evidence over Mr Agrawal’s, we would add to the above list that Mr Agrawal negotiated the terms of the Guarantee Letter with an officer of Shanghai Electric’s legal department on 25 June 2008,159Foot Note 159×Day 1 Transcript at p 114 lines 11–25.and was sent by the Reliance Group to sign both the Supply Contract and Guarantee Letter at the signing ceremony on 26 June 2008;160Foot Note 160×CMB Vol VIII at pp 30–31 (Witness Statement of Ms Yu Liwen dated 11 May 2023 at para 48).and (j) Finally, his conductpost–dating the Guarantee Letter of 26 June 2008 may bear relevance in corroborating the course of conduct between the Partiespriorto that date. Such conduct would include Mr Agrawal sending an email dated 4 July 2008 with a letter to Shanghai Electric’s Vice–President proposing the assignment of a contract to Reliance (UK) for Shanghai Electric’s acceptance, signed by Mr Agrawal, in which he is described as Reliance Infrastructure’s “Authorized Signatory”,161Foot Note 161×CMB Vol VI at p 496 (Enclosed Letter from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 4 July 2008).and him sending an email dated 26 August 2008 communicating to Shanghai Electric that guarantee letters would be furnished for a number of power plant projects on Reliance Infrastructure’s “behalf”.162Foot Note 162×CMB Vol VIII at p 99 (Email from Mr Rajesh Agrawal to Shanghai Electric Group Co Ltd dated 26 August 2008 at p 1). 138 While the representations of the apparent authority of the agent must emanate from the principal and not the agent, and Mr Agrawal’s conductalonecannot cloak himself with ostensible authority to act for Reliance Infrastructure, apparent authority can arise from the principal’s representations byconduct, the most common form of which involves its acquiescence in the agent’s consistent course of dealings with third parties (Freeman & Lockyerat 498). Here, the length of time and frequency of Mr Agrawal’s dealings with Shanghai Electric support the inference that Reliance Infrastructure must have known of and acquiesced in Mr Agrawal dealing with Shanghai Electric on its behalf on matters relating to the power plant projects they were both involved in. Thus, Reliance Infrastructure impliedly represented that he had their authority to do so (Freeman & Lockyerat 498). 139 Of course, if each of the above acts are taken strictly in isolation, various arguments may be made attacking the strength of the individual representations. Distinctions may be drawn between negotiating contracts and concluding contracts or between signing a contract for Reliance (UK) versus Reliance Infrastructure. The critical point, however, is to assess the representationsin the roundand not as discrete acts. Theoverallimpression given by Reliance Infrastructure was that Mr Agrawal was heavily involved in the business dealings between Shanghai Electric and Reliance Group entities and handled many relevant arrangements and negotiations for the conclusion of contracts relating to the power plant projects that the Parties were engaged in, including the Sasan Project. Thus, he was cloaked with apparent authority to enter into any contracts in the ordinary course of such business dealings (Freeman & Lockyerat 505). There was nothing unusual about the Guarantee Letter, and it was conceded by Reliance Infrastructure’s own witness, Mr Agrawal, that it had been contemplated by Parties.163Foot Note 163×Day 1 Transcript at p 50 line 25 to p 51 line 19, p 53 line 23 to p 54 line 7 and p 56 line 18 to p 57 line 11. 140 Looked at in its totality, we find that this consistent course of conduct gave rise to the representation that Mr Agrawal had authority to sign the Guarantee Letter and to make the arbitration agreement.",
        "Conclusion": "141 We conclude that Reliance Infrastructure, having had knowledge of the underlying facts to mount its objections to the jurisdiction of the Tribunal, on the grounds of both forgery and want of authority, and lacking good reason not to do so, must now be deemed to have waived its rights to make those arguments here by its failure to pursue those objections to jurisdiction in the SIAC arbitration. 142 This finding is, of course, fatal to Reliance Infrastructure’s setting aside application; however, for completeness, we find that, in any event, the objections raised were without merit. We would have dismissed them even if Reliance Infrastructure had not waived its right to pursue them. 143 Consequently, we dismiss Reliance Infrastructure’s application to set aside the Award in SIC/OA 1/2023. We also award costs to Shanghai Electric.  If parties are unable to agree on the amount of costs within 14 days of the date of this judgment, they are to file within 7 days thereafter submissions on costs limited to ten pages each, excluding any tables of time spent or work done. Philip JeyaretnamJudge of the High CourtSir Vivian RamseyInternational JudgeAnselmo ReyesInternational Judge Vergis S Abraham SC, Asiyah binte Ahmad Arif, Ngo Wei Shing (Wu Weishen) and Liu Enning (Providence Law Asia LLC), Harish Salve KC (Blackstone Chambers) for the claimant; Cavinder Bull SC, Foo Yuet Min, Tay Hong Zhi, Gerald, Tan Yi Fan and Tan Pei Han (Drew & Napier LLC), Nicholas Emmet Graham Leslie (Fountain Court Chambers), Ketan Gaur and Aayush Mitruka (Trilegal) for the defendant."
    }
}