{
    "case_title": "Public Prosecutor vAdam bin Mohamed Noor",
    "ncitation": "[2024] SGHC 25",
    "coram": "Vincent Hoong J",
    "sections": {
        "Introduction": "1 Mr Adam bin Mohamed Noor (the “Accused”) claimed trial in the court below to a charge under s 15(3A) of the Workplace Safety and Health Act (Cap 354A, 2009 Rev Ed) (the “WSHA”). 2 Briefly, the Accused was employed at the material time by SP PowerGrid Ltd (“SPPG”) as a technical officer. SPPG is a member of the SP Group that provides energy utility services in Singapore. The Accused was tasked with supervising the electrical works relating to the decommissioning of a substation. During those electrical works, one Mr Asogan s/o Suparamaniam (the “Deceased”) was electrocuted while decommissioning an electrical cable (the “Incident Cable”), which resulted in his death. The Accused was charged with doing a negligent act at work (viz,by allowing the Deceased and a few other workers to carry out electrical works unsupervised on the de-energised Incident Cable without ensuring that the Incident Cable remained de-energised). The Prosecution’s case was that the Accused’s negligence resulted in the death of the Deceased and endangered the safety of the other workers who were in close proximity to the Deceased. 3 In the court below, the Prosecution argued that the Accused had tested the Incident Cable to confirm that it was de-energised before allowing the workers, including the Deceased, to start work. The workers thus commenced work, with the Deceased first testing the Incident Cable with a colleague to confirm that the Incident Cable was in fact de-energised. The Deceased then handled the Incident Cable with his bare hands. While the Deceased was handling the Incident Cable, the Incident Cable became re-energised and this resulted in the Deceased’s electrocution. 4 In contrast, the Accused claimed that he had expressly told the workersnotto start work as the Incident Cable was still “live” and that he was going to de-energise the Incident Cable. However, this was ignored by the workers, including the Deceased, who commenced work on the Incident Cable. According to the Accused, the Incident Cable had not been de-energised when the Deceased first handled it. Before the Accused could de-energise the cable, the Deceased had proceeded to pull the ends of the Incident Cable and this led to his electrocution. 5 Following the trial, the District Judge (the “DJ”) acquitted the Accused of the charge under s 15(3A) of the WSHA (the “Charge”). In acquitting the Accused, the DJ found that the Prosecution had not proven beyond a reasonable doubt that the Incident Cable was de-energised in the first place. Further, the DJ found that it was doubtful that the Accused had given the workers the go-ahead to commence work on the Incident Cable. Ultimately, the DJ preferred the Accused’s evidence over the evidence of the Prosecution’s witnesses, finding that the Accused’s version of events was corroborated by one Mr Mohamed Fharouk bin Mohamed Salleh (“Fharouk”). Fharouk was an SPPG employee who assisted the Accused at the material time, and who was summoned to give evidence in the court below on the court’s motion. 6 The Prosecution was dissatisfied and appealed against the DJ’s decision to acquit the Accused. Having considered the parties’ submissions on appeal, I agreed with the Prosecution that the DJ had erred in acquitting the Accused of the Charge. Accordingly, I allowed the Prosecution’s appeal and convicted the Accused of the Charge. 7 The parties were then asked to submit on the appropriate sentence. The Prosecution submitted that a sentence of ten to 12 months’ imprisonment was appropriate. The Accused submitted that a sentence not exceeding eight months’ imprisonment was appropriate. Having considered parties’ submissions, I imposed a sentence of ten months’ imprisonment on the Accused. 8 I now set out the detailed reasons for my decision.",
        "Background facts": "",
        "Background to the incident": "9 The incident occurred in or around a substation at Kranji No 5 (the “Substation”), which was in the process of being decommissioned by Jurong Town Corporation at the material time. For the purposes of these proceedings, the Substation was a ‘workplace’ as defined under s 5(1) of the WSHA. The Substation was managed by SP PowerAssets Ltd (“SPPA”).1Foot Note 1×Record of Appeal (“ROA”) at p 6: Statement of Agreed Facts (“SOAF”) at para 2.SPPG was the Transmission Agent Licensee authorised to transmit electricity for and on behalf of SPPA.2Foot Note 2×ROA at p 7: SOAF at para 6. 10 The decommissioning of the Substation required the diversion of all low-voltage (“LV”) and high-voltage (“HV”) cables, followed by the removal of the cables and other components.3Foot Note 3×ROA at p 6: SOAF at para 2.SPPA’s term contractor, James Contractor Pte Ltd (“James Contractor”) was issued with a Works Order (the “Works Order”) to divert the LV and HV cables.4Foot Note 4×ROA at p 6: SOAF at para 3.James Contractor then engaged Yong Sheng Engineering Construction Pte Ltd (“Yong Sheng”) to carry out the works set out in the Works Order. This was eventually sub-contracted to Global Marine Construction & Engineering Pte Ltd (“Global Marine”), of which the Deceased was the director.5Foot Note 5×ROA at pp 6–7: SOAF at paras 4–5. 11 The Accused was the individual who prepared the Works Order for the decommissioning of the cables.6Foot Note 6×ROA at p 6: SOAF at para 3.The Accused was appointed by SPPG as the authorised person and the officer in-charge of the LV works.7Foot Note 7×ROA at p 7: SOAF at para 6. 12 On 24 September 2017, the Accused was tasked with carrying out the decommissioning of an LV Board (SUB04979D4509T) (the “LV Board”) in the Substation. In particular, there were three cables from the LV Board to be de-energised. The first cable, which was the Incident Cable, was connected to an Overground Box (“OG Box”) 04979D5900 (the “OG Box 5900”).8Foot Note 8×ROA at p 7: SOAF at para 7. 13 The OG Box 5900 comprised five different units (referred to as Units 1 to 5 respectively). Unit 4 of the OG Box 5900 received its electricity supply from Unit 1 of the LV Board through the Incident Cable (ie, the Incident Cable was connected on one end to Unit 1 of the LV Board, and on the other end to Unit 4 of the OG Box 5900). Unit 4 of the OG Box 5900 then re-routed the electricity to Unit 1, Unit 2 and Unit 3 of the OG Box 5900 which supplied electricity to customers. Unit 5 drew electricity from another OG Box and served as a standby unit.9Foot Note 9×ROA at p 7: SOAF at para 8.",
        "Undisputed facts relating to the incident on 24 September 2017": "14 On 24 September 2017, at about 10.15am, the following individuals (referred to as the “Workers”) gathered at the OG Box 5900:10Foot Note 10×ROA at pp 6–8: SOAF at paras 5 and 10. (a) The Deceased; (b) Mr Abdul Malek bin Hassan (“Malek”), who was an employee of Global Marine and a licensed cable jointer; (c) Mr Maiyyan Regasamy Panneerchelvam (“Panneerchelvam”), who was an employee of Global Marine; (d) Mr Veerappan s/o Supramaniam (“Veerappan”), who was an employee of Global Marine; (e) Mr Veerapan Jayaseelan (“Jayaseelan”), who was an employee of Global Marine; and (f) Mr Chinnaiah Dineshkumar (“Dineshkumar”), who was an employee of Yong Sheng. 15 The Accused and Fharouk arrived at the OG Box 5900 at about 10.30am.11Foot Note 11×ROA at p 8: SOAF at para 10.The OG Box 5900 was locked when the Accused and Fharouk arrived.12Foot Note 12×ROA at p 673: Notes of Evidence (“NE”) for 6 July 2022 at p 36, lines 23–29. 16 The Accused then unlocked the OG Box 5900.13Foot Note 13×ROA at p 674: NE for 6 July 2022 at p 37, lines 1–3.At the time, the Accused was the only SPPG officer in possession of the keys to the OG Box 5900.14Foot Note 14×ROA at p 673: NE for 6 July 2022 at p 36, lines 30–32.There was no dispute in the court below that Units 1, 2, 3, and 5 of the OG Box 5900 were energised at the time the Accused unlocked the door to the OG Box 5900.15Foot Note 15×ROA at p 8: SOAF at para 11.Whether Unit 4 was energised at that time was disputed. 17 The Accused then inserted network links into Unit 5 of the OG Box 5900 and removed the network links from Unit 4 of the OG Box 5900.16Foot Note 16×ROA at p 674: NE for 6 July 2022 at p 37, lines 10–27.At some point, while the Accused was present at the OG Box 5900, the Accused allowed the Workers to remove the doors to the OG Box 5900 for safety reasons as the doors were flimsy.17Foot Note 17×ROA at p 647: NE for 6 July 2022 at p 9, line 26 to p 10, line 8. 18 The Accused and Fharouk then left the OG Box 5900 and proceeded to the Substation.18Foot Note 18×ROA at p 8: SOAF at para 11.Given that the doors to the OG Box 5900 had been removed, this also meant that the Accused did not lock the OG Box 5900 before he proceeded to the Substation with Fharouk.19Foot Note 19×ROA at p 677: NE for 6 July 2022 at p 40, lines 3–7.As the Accused and Fharouk left for the Substation, this also meant that: (a) there was no SPPG employee attending to the OG Box 5900 at the material time;20Foot Note 20×ROA at p 677: NE for 6 July 2022 at p 40, lines 11–18.and (b) the live apparatus inside the OG Box 5900 was exposed while the Accused and Fharouk proceeded to the Substation.21Foot Note 21×ROA at p 677: NE for 6 July 2022 at p 40, lines 19–21. 19 The Deceased then commenced the decommissioning works on the Incident Cable. For context, the Incident Cable comprised four smaller cables (or “cable cores”). Three of the four cable cores (ie, the red, yellow, and blue cable cores) were secured to the terminal unit by bolts. The Deceased used a battery-operated impact wrench to remove the bolts securing those three cable cores. After doing that, the Deceased’s bare hands came into contact with the lugs of the blue and yellow cable cores (which were metallic and thus conductive). Shortly after, the Deceased was electrocuted.22Foot Note 22×ROA at p 8: SOAF at para 12. 20 The Accused and Fharouk were at the Substation when this occurred, and they were alerted to the accident by one of the Workers.23Foot Note 23×ROA at p 8: SOAF at para 12.The Deceased was conveyed to the hospital, where he succumbed to his injuries. The Deceased’s autopsy report stated that his cause of death was “electrocution”.24Foot Note 24×ROA at p 8: SOAF at para 13. 21 On 29 June 2021, SPPG pleaded guilty to a charge under s 12(2) read with s 20 and punishable under s 50(b) of the WSHA for failing to take, as far as was reasonably practicable, necessary measures to ensure the safety and health of persons carrying out work at the Substation.25Foot Note 25×ROA at p 9: SOAF at para 9; ROA at pp 981–991: Charge Sheet (DSC-900682-2020) and Statement of Facts which SPPG pleaded guilty to.",
        "The Charge tendered against the Accused": "22 The Charge tendered against the Accused was framed as follows:26Foot Note 26×ROA at p 5: DSC-900690-2020. … are charged that you, on 24 September 2017, being the Technical Officer of SP PowerGrid Limited (UEN: 200306959Z) of 2 Kallang Sector SP Group Building Singapore 349277, the Transmission Agent Licensee carrying out electrical works relating to the decommissioning of a substation at Kranji No. 5, which was a workplace within the meaning of the Workplace Safety and Health Act (Chapter 354A, 2009 Rev Ed) (“the Act”), did without reasonable cause, negligently do an act which endangered the safety of others,to wit; you allowed Asogan S/O Suparamaniam (“Asogan”) and a few other workers to carry out electrical works unsupervised on a de-energised electrical cable within an Overground Box 04979D5900 located along Kranji Loop (the “OG Box”) that was in proximity to the Substation, without ensuring that the electrical cable remained de-energised while they were carrying out works on the electrical cable, and as a result of your negligent act, the electrical cable that Asogan was holding onto with his bare hands became energized and electrocuted him, which endangered the safety of all other workers in proximity to the OG Box and resulted in the death of Asogan, and you have thereby committed an offence under s 15(3A) of the Act.",
        "The parties’ cases in the court below": "",
        "The Prosecution’s case in the court below": "23 At trial, the Prosecution’s case was as follows: (a) After the Accused had unlocked the OG Box 5900, inserted network links into Unit 5 of the OG Box 5900 and removed the network links from Unit 4 of the OG Box 5900, the Accused then instructed Fharouk to proceed to the Substation to remove the fuse in the terminal unit of the LV Board (which was inside the Substation).27Foot Note 27×ROA at p 1089: Prosecution’s Closing Submissions dated 12 September 2022 (“PCS”) at para 22(d). (b) The Accused then proceeded to test whether the Incident Cable was de-energised with a voltage meter. The voltage meter showed a reading of “000” which indicated that the Incident Cable was de-energised.28Foot Note 28×ROA at p 1089: PCS at para 22(d).One of the workers, Malek, then asked the Accused in Malay if the Workers could commence with the decommissioning of the Incident Cable. The Accused replied “yes” and “can” in Malay.29Foot Note 29×ROA at p 1089: PCS at para 22(e). (c) The panels and concrete slab surrounding the OG Box 5900 were removed by the Workers in preparation for the decommissioning work that was to be performed on the Incident Cable.30Foot Note 30×ROA at p 1089: PCS at para 22(e). (d) The Deceased and Malek performed their own checks to verify that the Incident Cable was de-energised. This included the following:31Foot Note 31×ROA at p 1089: PCS at para 22(f). (i) The Deceased used a test lamp that was handed to him by Panneerchelvam. The test lamp did not light up which indicated that the Incident Cable was de-energised. (ii) Malek performed a “flick test”. This involved him flicking the back of his fingers against the conductive cable lugs of the Incident Cable to check if there was an electric current. Malek did not feel an electric current, which indicated that the Incident Cable was de-energised. (e) Sometime before the Deceased was electrocuted, the Accused left the OG Box 5900 for the Substation.32Foot Note 32×ROA at p 1089: PCS at para 22(g). (f) The Deceased then used the battery-operated impact wrench to remove the bolts securing the yellow, red and blue cable cores to the terminal unit. The absence of any reaction when the battery-operated impact wrench came into contact with the bolts indicated that the Incident Cable was de-energised at that point in time.33Foot Note 33×ROA at p 1089: PCS at para 22(h). (g) The Deceased then pulled the blue and yellow cable cores towards him with his bare hands on the metal lugs. The Deceased was wearing safety boots but not safety gloves. It was around this time that the Deceased was electrocuted.34Foot Note 34×ROA at p 1089: PCS at para 22(i). (h) One of the Workers, Dineshkumar, ran towards the Substation to seek assistance. Dineshkumar testified that he saw a person sticking his head out of the Substation.35Foot Note 35×ROA at p 1090: PCS at para 22(j).According to the Prosecution, since the only people who were not at the OG Box 5900 were the Accused and Fharouk, this meant that the person Dineshkumar saw could have only been the Accused or Fharouk. (i) According to the Prosecution, a cable was de-energised by removing a fuse in the terminal unit of the LV Board. A de-energised cable could only be re-energised if the fuse was re-inserted into the terminal unit of the LV Board. The only persons who had access to the LV Board in the Substation were the Accused and Fharouk. Coupled with Dineshkumar’s evidence that he saw someone sticking his head out of the Substation when he proceeded there to seek assistance, this meant that it was either the Accused or Fharouk who had re-energised the Incident Cable.36Foot Note 36×ROA at p 1100: PCS at para 39. 24 In support of its case, the Prosecution also relied on a report by the Energy Market Authority (“EMA”) (the “EMA Report”).37Foot Note 37×ROA at pp 1011–1064: Report on the Fatal Electrical Incident on 24 September 2017 (Report No FE/002/2017) by the Energy Market Authority dated 27 July 2018 (the “EMA Report”).The EMA Report stated, among other things, that: (a) It was likely that the Incident Cable was de-energised at the time the Deceased commenced work on it.38Foot Note 38×ROA at p 1030: EMA Report at para 10.1. (b) The position of the burns on the Deceased’s hands showed that the Deceased had likely held on to the conductive parts of the cable cores with his bare hands while dismantling the cable cores from the terminal unit. This meant that the Incident Cable was already “dead” (ie, de-energised) because it was unlikely that someone with the Deceased’s experience and electrical knowledge would have held on to the conductive parts of a “live” (ie, energised) cable core with his bare hands.39Foot Note 39×ROA at pp 1025 to 1027: EMA Report at paras 7.3 to 7.7. (c) The Incident Cable was likely re-energised by either the Accused or Fharouk. This was because the Incident Cable could only be re-energised by re-inserting the fuse into the terminal unit of the LV Board. The only persons who had access to the LV Board were the Accused and Fharouk.40Foot Note 40×ROA at p 1030: EMA Report at para 10.1. 25 In its closing submissions to the court below, the Prosecution submitted that the Accused should be convicted on an amended charge under s 15(3A) of the WSHA even if the court was minded to accept the Accused’s version of events (see [27] below),ie, that: (a) the Incident Cable was energised before the Workers commenced work on the Incident Cable; and (b) the Accused had issued a verbal instruction to the Workers not to commence work on the Incident Cable. 26 It was the Prosecution’s case that, based on the evidence given by the Accused himself, the Accused had failed to supervise the Workers when he left the OG Box 5900 unattended and proceeded to the Substation. A verbal instruction not to commence work was insufficient in so far as the Accused’s duty was to directly supervise the Workers. He ought to have locked the OG Box 5900 before proceeding to the Substation or have had someone from SPPG guard the OG Box 5900. Therefore, the Prosecution suggested that even if the Accused’s version of events was to be preferred, he ought to be convicted on an amended charge for allowing the Deceased and the other workers to carry out electrical works on the Incident Cable without supervision.41Foot Note 41×ROA at pp 1070 and 1108–1110: PCS at paras 5 and 56–61.",
        "The Accused’s case in the court below": "27 At trial, the Accused’s case was as follows: (a) The Accused claimed that he had not spoken to the Deceased on the day of the incident.42Foot Note 42×ROA at pp 1494–1498: Defence’s Closing Submissions (“DCS”) dated 7 September 2022 at paras 21–27.Further, the Accused asserted that he had not given any instructions to the Workers to commence work relating to the decommissioning of the Incident Cable. Rather, he had expressly told the Workersnotto commence work as the Incident Cable was still “live” (ie, energised)and that he was going to de-energise the Incident Cable. He communicated this instruction directly to Malek and raised his voice to shout in the direction of the other workers. The Accused argued, therefore, that he ought not be held liable for the failure of the Deceased and the other workers to comply with the Accused’s express instruction not to commence work.43Foot Note 43×ROA at pp 1498–1500: DCS at paras 28–35. (b) The Incident Cable was not de-energised at the time the Deceased began working on it.44Foot Note 44×ROA at p 1506: DCS at para 50.Before the Accused could de-energise the Incident Cable, the Deceased had proceeded on his own accord to pull the ends of the Incident Cable and was electrocuted as a result.45Foot Note 45×ROA at p 1499: DCS at para 32. (c) It was impossible for the Incident Cable to have been re-energised in the manner contended by the Prosecution because the Deceased was electrocutedbeforethe Accused and Fharouk had entered the Substation.46Foot Note 46×ROA at pp 1502–1506: DCS at paras 42–50. (d) Finally, the Accused argued that the Deceased ought not to have been at the location of the incident on 24 September 2017. This was because the Deceased did not possess a valid cable jointer licence at the material time, his licence having been suspended. Rather, the individual on-site with a valid cable jointer licence was Malek. In those circumstances, the Accused submitted that he did not owe any duty of care to the Deceased.47Foot Note 47×ROA at pp 1488–1494: DCS at paras 8–20.",
        "The DJ’s decision": "28 The DJ considered that based on the Charge tendered against the Accused, the Prosecution bore the burden of proving the following elements beyond a reasonable doubt:48Foot Note 48×ROA at p 835:Public Prosecutor v Adam Bin Mohamed Noor[2023] SGDC 133 (“GD”) at [21]. (a) first, that the Incident Cable in OG Box 5900 was initially de-energised when the Deceased commenced work on the Incident Cable; (b) second, that the Accused allowed the Deceased and the other workers to carry out the electrical works unsupervised; (c) third, that the Accused failed to ensure that the Incident Cable remained de-energised; and (d) fourth, that the Accused’s negligent act (ie, allowing the electrical works to proceed unsupervised and failing to ensure that the Incident Cable remained de-energised) resulted in the death of the Deceased. 29 Having considered the evidence adduced at trial and the parties’ submissions, the DJ found that the Prosecution had failed to prove its case beyond a reasonable doubt. Accordingly, the DJ acquitted the Accused of the Charge. The DJ provided his grounds of decision inPublic Prosecutor v AdamBin Mohamed Noor[2023] SGDC 133 (the “GD”). I briefly summarise the GD below. 30 First, the DJ found that the Prosecution had not proven beyond a reasonable doubt that the Incident Cable was indeed de-energised when the Deceased commenced work on the Incident Cable.49Foot Note 49×ROA at p 836: GD at [22].Since the Prosecution had failed to prove that the Incident Cable was de-energised in the first place, it therefore followed that the Accused could not have failed to ensure that the Incident Cableremainedde-energised.50Foot Note 50×ROA at p 839: GD at [29].The DJ’s reasons for this finding were as follows: (a) The Prosecution was unable to show exactlywhyandhowthe Incident Cable had come to be de-energised by the time the Deceased commenced work on it. According to the DJ, this was an important element of the Charge.51Foot Note 51×ROA at p 843: GD at [42(a)].The DJ found that there was no evidence that anyone had gone to the Substation to de-energise the Incident Cable.52Foot Note 52×ROA at p 843: GD at [42(b)].Further, Dineshkumar’s evidence that he saw an individual sticking his head out of the Substation was not corroborated and did not, in any case, show whether the Incident Cable was energised (and if it was, how that came to be).53Foot Note 53×ROA at p 844: GD at [44]. (b) The Prosecution based its case on the EMA Report, but the EMA Report was inconclusive on whether the Incident Cable was initially de-energised.54Foot Note 54×ROA at p 836: GD at [23]. (c) Fharouk’s evidence pointed towards the conclusion that the Incident Cable was not initially de-energised. According to Fharouk, the Incident Cable was “live” (ie, energised). The DJ also found that the Prosecution’s contention that Fharouk was an interested witness was baseless and purely speculative.55Foot Note 55×ROA at p 842: GD at [40]. (d) There were serious doubts relating to the workers’ evidence that tests had been done by Malek and the Deceased to confirm that the Incident Cable was initially de-energised.56Foot Note 56×ROA at p 840: GD at [33].The workers’ evidence suggested that the Accused had confirmed that the Incident Cable was de-energised before the Deceased commenced work on it. If the Accused did so, then it would have been unnecessary for the Deceased to use a test lamp or for Malek to perform a “flick test” to verify that the Incident Cable was de-energised. The fact that these tests were performed and that the Deceased did not take proper care in wearing protective gloves – a vital safety measure – suggests that they were eager to proceed with the works despite not receiving any instruction to do so. Further, the ‘flick test’ used by Malek was a highly unreliable method for verifying if a current was passing through a cable.57Foot Note 57×ROA at p 838: GD at [27]. 31 Second, the DJ did not accept that the Accused had allowed the Workers to commence work on the Incident Cable. This was because: (a) The witnesses’ evidence that the Accused allowed the Workers to begin work was unreliable.58Foot Note 58×ROA at p 839: GD at [30]. (b) The assertion that the Accused had checked the Incident Cable and allowed the Workers to commence work was open to grave doubt. The sequence of events presented by the Prosecution was illogical since the Accused could not have confirmed that the Incident Cable was de-energised before he or Fharouk had proceeded to the Substation to remove the fuse in the terminal unit of the LV Board.59Foot Note 59×ROA at p 840: GD at [32]. (c) It was more likely that the Deceased started work on his own accord. The other workers therefore had the impression that the Accused had given his approval to commence work.60Foot Note 60×ROA at pp 840–841: GD at [34]–[37]. 32 As stated at [30(c)] above, the DJ also found that the Accused’s version of events was corroborated by Fharouk who, in his view, was not an interested witness. In finding that Fharouk was not an interested witness, the DJ rejected the Prosecution’s contention that Fharouk had a motive to lie. According to the DJ, the Prosecution had no reasonable basis for making this allegation. The fact that Fharouk may have had a potential motive to lie did not mean that he would or did lie. Further, based on the evidence adduced at trial, it was unclear which of the witnesses might have lied due to impure motives.61Foot Note 61×ROA at p 842: GD at [40]–[41]. 33 In deciding to acquit the Accused, the DJ also bore in mind that the Deceased was not supposed to be at the location of the incident at the material time because his electrical licence had been suspended.62Foot Note 62×ROA at pp 834 and 838: GD at [18] and [28].Given that the Deceased was not supposed to be at the location, and that Malek was the licensed cable jointer present at the location of the incident rather than the Deceased, the DJ found that it made more sense that the Accused would have been liaising with Malek instead of the Deceased. However, the DJ regrettably did not explain how the fact that the Deceased’s electrical licence was suspended necessarily meant that the Accused would have been liaising with Malek. 34 Finally, the DJ rejected the Prosecution’s invitation in its closing submissions to frame an amended charge and to convict the Accused on the same as an alternative to convicting the Accused on the Charge (see [25] above). According to the DJ, the Prosecution’s suggestion to do so would have been highly prejudicial to the Accused, bearing in mind the Court of Appeal’s holding inPublic Prosecutor v WeeTeong Boo and other appeal and another matter[2020] 2 SLR 533(at [88] to [116]).63Foot Note 63×ROA at p 844: GD at [45].",
        "The parties’ cases on appeal": "35 Next, I briefly set out the parties’ cases on appeal.",
        "The Prosecution’s case on appeal": "36 The Prosecution made the following arguments in support of its position that the DJ had erred in acquitting the Accused of the Charge: (a) First, the DJ erred in finding that the Prosecution had not proven beyond a reasonable doubt that the Incident Cable was de-energised when the Deceased started working on it.64Foot Note 64×ROA at p 13: Petition of Appeal (“POA”) at para 2(i).According to the Prosecution, the totality of the evidence made it clear that the Incident Cablewasde-energised at that point in time.65Foot Note 65×Prosecution’s Written Submissions dated 13 October 2023 (“PWS”) at paras 29–45. (b) Second, the DJ erred in finding that the Prosecution’s witnesses had given unreliable evidence on whether the Accused allowed the Workers to commence with the decommissioning of the Incident Cable.66Foot Note 66×ROA at pp 13–14: POA at para 2(ii).According to the Prosecution, the evidence of the Prosecution’s witnesses was internally and externally consistent.67Foot Note 67×PWS at paras 48–54.In contrast, the Accused and Fharouk’s accounts (which the DJ found to be credible) were internally and externally inconsistent.68Foot Note 68×PWS at paras 55–62. (c) Third, the DJ erred in his treatment of the witnesses’ testimonies. In particular, the DJ erred in finding that the workers who gave evidence were more concerned to deflect blame from the Deceased to the Accused than with giving credible testimony.69Foot Note 69×PWS at paras 63–65. (d) Fourth, even if the DJ correctly accepted the Accused’s version of events, the DJ erred in declining to convict the Accused on an amended charge as proposed by the Prosecution. Based on the evidence adduced at trial, the Accused allowed the Deceased and a few of the other workers to perform electrical works on the energised Incident Cable without supervision. This ultimately resulted in the Deceased’s death.70Foot Note 70×ROA at p 14: POA at para 2(vi).There would have been no prejudice caused to the Accused had the Charge been amended and the Accused convicted on an amended charge.71Foot Note 71×PWS at paras 66–73.",
        "The Accused’s case on appeal": "37 On appeal, the Accused submitted that the DJ had made no error in acquitting him. In particular, the Accused contended that the DJ was correct in finding that: (a) the Prosecution was unable to prove beyond a reasonable doubt that the Incident Cable was initially de-energised;72Foot Note 72×Accused’s Written Submissions dated 13 October 2023 (“AWS”) at paras 31–36.(b) the Prosecution’s witnesses had given unreliable evidence on whether the Accused allowed the Workers to commence work;73Foot Note 73×AWS at paras 37–45.(c) the Prosecution’s witnesses were more concerned with deflecting blame from the Deceased to the Accused than with giving credible evidence;74Foot Note 74×AWS at paras 46–49.and(d) the Accused and Fharouk were credible witnesses.75Foot Note 75×AWS at paras 50–51. 38 Further, the Accused submitted that the DJ correctly declined the Prosecution’s invitation to amend the particulars of the Charge and to convict the Accused on the amended charge.76Foot Note 76×AWS at paras 52–62.",
        "Issues which arose for my determination": "39 In view of the parties’ cases on appeal, the following issues arose for my determination: (a) First, whether the DJ erred in finding that the Prosecution had not proven beyond a reasonable doubt that the Incident Cable was de-energised when the Deceased had started working on it. In particular, was the Prosecution’s inability to showexactly when and howthe Incident Cable came to be de-energised fatal to its case that the Incident Cable was, in fact, initially de-energised? (b) Second, whether the DJ erred in his treatment of the witnesses’ evidence. In my view, the key question was whether the DJ erred in preferring the Accused and Fharouk’s accounts (ie, that the Accused had expressly told the Workers not to commence work) over the accounts of the Prosecution’s witnesses (ie, that the Accused had allowed the Workers to commence work on the Incident Cable). (c) Third, if I found on appeal that the Incident Cable was de-energised to begin with, whether the Prosecution had proven beyond a reasonable doubt that the Accused had failed to ensure that the Incident Cable remained de-energised. (d) Fourth, whether the DJ erred in refusing to amend the Charge and to convict the Accused on an amended charge. (e) Fifth, if I allowed the appeal and decided to convict the Accused on the Charge, what the appropriate sentence for the Charge would be.",
        "My decision": "",
        "The DJ erred in finding that the Prosecution had not proven beyond a reasonable doubt that the Incident Cable was initially de-energised": "40 I first considered the Prosecution’s contention that the DJ erred in finding that the Prosecution failed to prove beyond a reasonable doubt that the Incident Cable was initially de-energised. 41 Having considered the DJ’s reasons for reaching this finding and the parties’ submissions on this point, I agreed with the Prosecution. I now set out my reasons for arriving at this conclusion. The DJ erred by placing undue focus on the issue of exactly when and howthe Incident Cablecame to be de-energised 42 In finding that the Prosecution failed to prove beyond a reasonable doubt that the Incident Cable was initially de-energised, the DJ placed significant emphasis on the fact that the Prosecution adduced no definitive evidence onexactlywhenandhowthe Incident Cable came to be de-energised. In the DJ’s view, such evidence was necessary if the Prosecution sought to assert that the Incident Cable was, in fact, de-energised.77Foot Note 77×ROA at p 838: GD at [27]. 43 I disagreed with the DJ’s reasoning on this issue. As a starting point, I accepted the DJ’s conclusion that the Prosecution adduced no direct evidence ofexactlywhenandhowthe Incident Cable came to be de-energised. That much was clear from the record: (a) As the Prosecution acknowledged at the appeal, there was no direct evidence to show that someone had removed the fuse in the terminal unit of the LV Board in the Substation to de-energise the Incident Cable.78Foot Note 78×PWS at para 31.This was because the only two individuals who had access to the Substation were the Accused and Fharouk, both of whom denied entering the Substation at any time before the Deceased was electrocuted. (b) The only evidence that pointed to a possible period when the Incident Cable could have been de-energised was Malek’s claim that he had heard the Accused instructing Fharouk to remove the fuse in the terminal unit of the LV Board in the Substation. According to Malek, this happened after the Accused had inserted the network links into Unit 5 of the OG Box 5900 and removed the network links from Unit 4 of the OG Box 5900.79Foot Note 79×ROA at pp 464 and 467: NE for 30 November 2021 at p 20, lines 20–24 and p 23, lines 7–32.This was, however, refuted by Fharouk at trial.80Foot Note 80×ROA at p 795: NE for 7 February 2023 at p 43, lines 19–25. (c) Additionally, no witness could testify clearly on Fharouk’s whereabouts when the Deceased commenced work on the Incident Cable. In particular, Panneerchelvam did not observe Fharouk’s whereabouts,81Foot Note 81×ROA at p 381: NE for 29 November 2021 at p 74, lines 18–29.and Dineshkumar testified that he did not know where Fharouk was when the Deceased used the battery-operated impact wrench to remove the bolts securing three of the four cable cores to the terminal unit.82Foot Note 82×ROA at p 588: NE for 28 April 2022 at p 10, lines 24–30. 44 In my view, however, the DJ placed undue emphasis on the Prosecution’s inability to showexactly whenandhowthe Incident Cable came to be de-energised: (a) On a plain reading of the particulars of the Charge, the elements of the Charge did not require proof ofexactlywhenandhowthe Incident Cable came to be de-energised. The Prosecution only needed to prove that the Incident Cable was, in fact, de-energised prior to the Deceased commencing work on the Incident Cable. If the Prosecution was able to prove that, its case could not have been undermined by a lack of evidence as to when and how the Incident Cable came to be de-energised. Such evidence may have irrefutably shown that the Incident Cable was de-energised, but the absence of such evidence did not necessarily mean that the Prosecution must fail in proving that the Incident Cable was initially de-energised. (b) By directing his focus on the irrelevant query ofexactlywhenandhowthe Incident Cable came to be de-energised, the DJ had seemingly closed his mind to the overwhelming evidence before him which, in my view, established beyond a reasonable doubt that the Incident Cable wasin factde-energised when the Deceased commenced work on it (see [51]–[75] below). 45 More significantly, it was unrealistic for the DJ to expect the Prosecution to proveexactlywhenandhowthe Incident Cable came to be de-energised given that this was an issue on which only the Accused or Fharouk could provide clarity. This was because the evidence made it clear that the Accused and Fharouk were the only persons who had access to the LV Board in the Substation and were, therefore, the only persons who could have de-energised the Incident Cable.83Foot Note 83×ROA at p 1027: EMA Report at para 7.7. 46 Both the Accused and Fharouk’s position in the court below was that the Incident Cable had not been de-energised when the Deceased commenced work. However, their accounts ought to have been treated with circumspection given that they were clearly interested witnesses. On this point, I disagreed with the DJ’s assessment that there was no reasonable basis for the Prosecution to have asserted that Fharouk was an interested witness: (a) First, the EMA Report and the evidence of the Prosecution’s witnesses showed that the de-energising of the Incident Cable required the removal of the fuse in the terminal unit of the LV Board in the Substation.84Foot Note 84×ROA at pp 62–63: NE for 27 August 2021 at p 25, line 20 to p 26, line 12; ROA at p 199: NE for 1 September 2021 at p 18, lines 10–25; ROA at p 1027: EMA Report at para 7.7.Further, the EMA Report made it clear that: (i) the only way to energise the Incident Cable was by inserting the fuse in the LV Board at the Substation; (ii) there was no automatic re-closing function at the LV Board that could have de-energised the Incident Cable without the fuse being manually inserted; and (iii) there was no possible glitch that could have caused the re-energisation of the Incident Cable.85Foot Note 85×ROA at p 1027: EMA Report at para 7.7.The Accused and Fharouk were the only two SPPG officers present at the material time, and they were the only individuals who had access to the Substation and the LV Board inside. This necessarily meant that the de-energising of the Incident Cable could only have been done by the Accused or Fharouk. This raised some basis for Fharouk and the Accused’s accounts to be treated with circumspection. (b) Second, the evidence of the Prosecution’s witnesses in the court below pointed towards the possible involvement of Fharouk in the Deceased’s electrocution. Notably, Dineshkumar testified that when he ran towards the Substation and shouted “Ah Bang, one man shocked”, he saw someone stick his head out of the Substation. If this was true, it could only have been the Accused or Fharouk because they were the only persons with access to the Substation at the material time. Further, Dineshkumar’s account was corroborated in some way by Panneerchelvam86Foot Note 86×ROA at p 313: NE for 29 November 2021 at p 6, lines 18–25.and Veerappan87Foot Note 87×ROA at p 409: NE for 29 November 2021 at p 102, lines 19–21., both of whom testified in the court below that the Accused was shouting at someonein the Substationshortly after the Deceased was electrocuted. If true, this again strongly suggested that Fharouk was involved in some way in the Deceased’s electrocution. (c) Given the above, there was a clear basis for the DJ to exercise caution in evaluating the Accused and Fharouk’s evidence, both of whom the DJ should have regarded as interested witnesses. 47 For the reasons above, I was of the view that the issue ofexactlywhenandhowthe Incident Cable came to be de-energised was not one that the Prosecution needed to specifically prove in the court below. The DJ erred by placing undue weight on the Prosecution’s inability to do so. In so erring, the DJ unfortunately failed to accord sufficient weight to the overwhelming evidence that the Incident Cable was, in fact, de-energised before the Deceased commenced work on it. The DJ failed to appreciate that the Prosecution’s case was not based solely on the EMA Report 48 I next considered the issue of whether the Prosecution had proven beyond a reasonable doubt that the Incident Cable was de-energised when the Deceased commenced work on the Incident Cable. 49 At the outset, I observed that the DJ took the view that the Prosecution had based its case on the EMA Report.88Foot Note 88×ROA at pp 836–837: GD at [24].The DJ found that the EMA Report was inconclusive on whether the Incident Cable was initially de-energised and subsequently re-energised. On that footing, the DJ felt that it was not open to the Prosecution to rely on the EMA Report to advance its case. 50 I found that the DJ erred in this regard because he had failed to appreciate that the Prosecution’s case was not based solely – or even primarily – on the EMA Report. As the Prosecution submitted on appeal, its case was instead based on the testimonies of its witnesses, which pointed to the conclusion that the Incident Cable was initially de-energised. The EMA Report was only relied on to reinforce the witnesses’ testimonies.89Foot Note 89×PWS at para 39. The totality of the evidence adduced by the Prosecution supported a finding that the Incident Cable was initially de-energised when the Deceased commenced work on it 51 Having considered the record, it was clear that the totality of the evidence adduced by the Prosecution supported a finding that the Incident Cable was initially de-energised when the Deceased commenced work. I set out my reasons below. (1) Malek’s evidence that the Accused had used a voltage meter to test the voltage at Unit 4 of the OG Box 5900 52 At trial, Malek testified that the Accused had used a voltage meter to test whether the Incident Cable was de-energised. According to Malek, the voltage meter showed a reading of “000” which indicated that the Incident Cable was de-energised.90Foot Note 90×ROA at pp 468–470: NE for 30 November 2021 at p 24, line 3 to p 26, line 27.The Accused, for his part, denied doing so.91Foot Note 91×ROA at p 702: NE for 6 July 2022 at p 65, lines 6–9. 53 I noted that the DJ did not consider the evidence relating to the Accused’s use of a voltage meter in the GD. In the course of parties’ oral submissions at the close of the trial, the DJ questioned if the voltage meter had been working properly at the time it was used. The DJ also considered that even if the voltage meter showed that the Incident Cable was de-energised, this did not explain how the Incident Cablebecamede-energised.92Foot Note 92×ROA at pp 721–723: NE for 30 September 2022 at p 8, line 19 to p 10, line 9. 54 In my view, it made little sense for the DJ to reject the evidence relating to the Accused’s use of a voltage meter if only because the use of a voltage meter did not explain how the Incident Cable became de-energised. This was a further illustration of how the DJ erred by placing undue emphasis on the narrow – but ultimately irrelevant – issue of exactly how and when the Incident Cable became de-energised. 55 I took the view that the DJ ought to have considered this aspect of Malek’s evidence in his GD. I recognised that this aspect of the evidenceby itselfwould not have sufficed to justify the conclusion that the Incident Cable was de-energised, given that there was no record of a voltage meter having been recovered from the location of the incident after the Deceased was electrocuted.93Foot Note 93×ROA at p 605: NE for 28 April 2022 at p 27, lines 17–19.Nevertheless, this aspect of Malek’s evidence lent credibility to the conclusion that the Incident Cable was initially de-energised. (2) Panneerchelvam’s evidence that the Deceased used a test lamp to confirm that the Incident Cable was de-energised before commencing work 56 At trial, Panneerchelvam gave evidence that the Deceased had used a test lamp (which was handed to the Deceased by Panneerchelvam) to check that the Incident Cable was de-energised before the Deceased commenced work on it. According to Panneerchelvam, the test lamp was working at the material time.94Foot Note 94×ROA at p 336: NE for 29 November 2021 at p 29, lines 7–17.The test lamp did not light up which indicated that the Incident Cable was de-energised.95Foot Note 95×ROA at p 312: NE for 29 November 2021 at p 5, lines 20–22; ROA at p 325: NE for 29 November 2021 at p 18, lines 5–11.This was corroborated in part by Malek, who stated that he had heard the Deceased ask Panneerchelvam for the test lamp (although Malek himself did not personally observe whether the test lamp lit up).96Foot Note 96×ROA at p 472: NE for 30 November 2021 at p 28, lines 1–4; ROA at 473: NE for 30 November 2021 at p 29, lines 13–18. 57 From the record, I noted Dineshkumar’s evidence that he had observed the test lamp light up on the day of the incident (ie, indicating that the Incident Cable was energised). However, I also noted that his evidence related specifically to whentheAccusedchecked the voltage at Unit 4 of the OG Box 5900, which occurredbeforethe Accused removed the network links from Unit 4 of the OG Box 5900.97Foot Note 97×ROA at p 564: NE for 27 April 2022 at p 39, lines 21–26.Therefore, I was of the view that Dineshkumar’s evidence did not contradict: (a) Panneerchelvam and Malek’s evidence that the Deceased himself had used the test lampafterthe network links from Unit 4 were removed; and (b) Panneerchelvam’s evidence that the test lamp did not light up when the Deceased tested the voltage at Unit 4 of the OG Box 5900. 58 The DJ was cognisant of Pannerchelvam’s evidence on this point but nevertheless concluded that it was doubtful that the Deceased had tested the Incident Cable using a test lamp. According to the DJ, if the Accused had indeed told the Workers that the Incident Cable was de-energised, it would have been unnecessary for the Deceased to take the extra step of using a test lamp. 59 I found that the DJ had erred in rejecting this aspect of Panneerchelvam’s evidence. As the Prosecution contended on appeal, even if the Accused told the Workers that the Incident Cable was de-energised, it was neither implausible nor unreasonable for the Workers to have taken extra steps to ensure that the Incident Cable was de-energised. The Deceased’s unfortunate electrocution made it patently clear that the decommissioning of the Incident Cable was an inherently high-risk activity. With such high-risk activities, it was perfectly sensible for the Workers to want to satisfy themselves that the Incident Cable was de-energised before commencing work (rather than simply taking the Accused’s word for it).98Foot Note 98×PWS at para 36(a).Therefore, the DJ ought not to have simply cast aside Panneerchelvam’s evidence that the Deceased used a test lamp and that the test lamp did not light up. Coupled with the other evidence that had been adduced, it was clear to me beyond a reasonable doubt that the Incident Cable was initially de-energised when the Deceased began working on it. (3) Malek’s evidence that he performed a “flick test” on the Incident Cable 60 At trial, Malek also testified that he had performed a “flick test” on the Incident Cable which involved him flicking the back of his fingers against the conductive cable lugs of the Incident Cable to check if there was an electric current. Malek’s evidence was that he did not feel an electric current which indicated that the Incident Cable was de-energised. 61 Malek’s evidence relating to the “flick test” being performed was corroborated by Panneerchelvam and Dineshkumar.99Foot Note 99×ROA at p 327: NE for 29 November 2021 at p 20, lines 11–23; ROA at p 584: NE for 28 April 2022 at p 6, lines 25–28.In particular, I noted that Dineshkumar was the only employee of Yong Sheng, unlike the other workers who were employees of Global Marine. In my view, this pointed towards Dineshkumar being a disinterested witness. The DJ himself recognised that Dineshkumar had no reason to fabricate evidence or falsify his account.100Foot Note 100×ROA at p 844: GD at [44]. 62 Although the DJ was cognisant of Malek’s evidence in this regard, the DJ gave short shrift to the Prosecution’s reliance on that evidence for the following reasons: (a) First, the DJ stated that the Prosecution’s reliance on Malek’s evidence as to his “flick test” in support of its position that the Incident Cable was initially de-energised was misplaced because the “flick test” was not a reliable method for checking if the Incident Cable was energised.101Foot Note 101×ROA at p 838: GD at [27].According to the DJ, the “flick test” was an improvised test that was neither proper nor safe. Apart from its unreliability, the use of the “flick test” was highly suggestive of the fact that Malek and the Deceased were the ones who were eager to begin work on their own accord.102Foot Note 102×ROA at p 840: GD at [34]. (b) Second, the DJ stated that if the Accused had indeed told the Workers that the Incident Cable was de-energised, it would have been unnecessary for Malek to take the extra step of performing the “flick test”.103Foot Note 103×ROA at p 840: GD at [33]. 63 I was unable to agree with the DJ’s treatment of Malek’s evidence on the “flick test” he performed: (a) While it was undisputed that the “flick test” was unsafe, I did not see how this necessarily meant that it was unreliable. In particular, one of the Prosecution’s witness, Mr Yeo Eng Houw (the Chief Technical Executive of the EMA) (“Yeo”), testified that the “flick test” was a common practice used to ensure that a cable was de-energised. His evidence was that the ‘flick test’ could help someone ensure that a cable was de-energised while also allowing that person to respond quickly if an electric current was felt. Yeo did not in any way assert that the “flick test” was an unreliable method.104Foot Note 104×ROA at pp 118–119: NE for 27 August 2021 at p 81, line 29 to p 82, line 13.Notably, there was no evidence that supported the DJ’s finding that the “flick test” was an unreliable method of confirming that the Incident Cable was de-energised. (b) As stated at [59] above, I was unable to agree with the DJ that it would have been unnecessary for Malek to take the extra step of performing a “flick test” if the Accused had already informed the Workers that the Incident Cable was de-energised. Again, the decommissioning of the Incident Cable was an inherently high-risk activity. Therefore, it was completely understandable for the Workers to want to satisfy themselves that the Incident Cable was de-energised before they commenced work (rather than relying solely on the Accused’s word). As Malek himself had testified, he simply wanted to be “100% sure” that the Incident Cable was de-energised.105Foot Note 105×ROA at pp 472–473: NE for 30 November 2021 at p 28, line 27 to p 29, line 6.This, in my view, was a reasonable position to take. 64 Therefore, the DJ ought not to have simply cast aside Malek’s evidence that he performed a “flick test” on the Incident Cable and felt no electric current. Coupled with the other evidence that had been adduced, it was clear to me beyond a reasonable doubt that the Incident Cable was initially de-energised when the Deceased began working on it. (4) Malek’s evidence that no sparks were observed when the Deceased used a battery-operated impact wrench to remove the bolts that were securing three of the four cable cores to the terminal unit 65 Next, I considered Malek’s evidence that he observed no sparks when the battery-operated impact wrench used by the Deceased came into contact with the bolts securing three of the four cable cores in the Incident Cable (ie, the red, yellow, and blue cable cores).106Foot Note 106×ROA at p 475: NE for 30 November 2021 at p 31, lines 16–20.This was consistent with: (a) the testimony of Mr Low Guan Jie, one of the Prosecution’s witnesses and the EMA investigating officer, who testified in the court below that based on electrical principles, there would have been sparks if a battery-operated impact wrench came into contact with an energised cable;107Foot Note 107×ROA at p 60: NE for 27 August 2021 at p 23, lines 2–16.and(b) the fact that, based on investigations done following the incident, the battery-operated impact wrench (which was seized in the course of investigations into the incident) was later found to be in working condition.108Foot Note 108×ROA at p 605: NE for 28 April 2022 at p 27, lines 24–27. 66 Based on the GD, the DJ did not consider this aspect of Malek’s evidence. In my view, this evidence – when coupled with the other evidence – pointed to the conclusion that the Incident Cable was de-energised when the Deceased commenced work. (5) The workers’ evidence that the Deceased was able to bend the cable cores of the Incident Cable while holding onto the conductive cable lugs without being immediately electrocuted 67 Further, I considered the fact that Panneerchelvam,109Foot Note 109×ROA at p 329: NE for 29 November 2021 at p 22, lines 20–28.Malek110Foot Note 110×ROA at p 477: NE for 30 November 2021 at p 33, lines 15–20.and Dineshkumar111Foot Note 111×ROA at p 595: NE for 28 April 2022 at p 17, lines 7–11.all testified that the Deceased had managed to bend or pull the blue and yellow cable cores of the Incident Cable while holding onto the conductive cable lugs without beingimmediatelyelectrocuted. As the Prosecution contended on appeal, the fact that the Deceased had managed to pull the cable cores towards him for a few moments without being immediately electrocuted was further evidence that he was working on a de-energised Incident Cable.112Foot Note 112×PWS at para 37(b). 68 Regrettably, it appeared from the GD that the DJ did not consider this aspect of the worker’s evidence. In my view, this evidence fortified my conclusion that the Incident Cable was de-energised when the Deceased commenced work. (6) The Deceased’s manner of handling the Incident Cable was irrelevant in determining whether the Incident Cable was de-energised 69 Finally, the Prosecution argued in the appeal that the Deceased’s background (ie, that he was a cable jointer with around 30 years of experience) was consistent with the proposition that the Incident Cable was initially de-energised. 70 In relation to this argument, as the Prosecution itself acknowledged, the manner in which the Deceased handled the Incident Cable only showedhisbeliefthat the Incident Cable was de-energised, and not that the Incident Cable was actually de-energised.113Foot Note 113×PWS at para 49(b). 71 However, I agreed with the Prosecution’s submission that the Deceased’s belief that the Incident Cable was de-energised at the material time (as evidenced by his manner of handling the Incident Cable) would, in all likelihood, have been informed by other contemporaneous indications that the Incident Cable was de-energised. I therefore took the view that the Deceased’s belief was relevant to this limited extent (ie, as evidence that there wereotherindications to the Deceased that the Incident Cable was de-energised). The Accused did not raise a reasonable doubt that the Incident Cable was initially de-energised 72 Having considered the totality of the evidence, including the evidence of the Prosecution’s witnesses and the evidence of the Accused and Fharouk, I concluded that the Accused did not raise a reasonable doubt in relation to the Prosecution’s case that the Incident Cable was initially de-energised. 73 The evidence of the Prosecution’s witnesses was largely consistent and mutually corroborated. It was also worth noting that the evidence of Dineshkumar, a disinterested witness, mostly cohered with the other workers’ testimonies. The inconsistencies between the evidence of each of the Prosecution’s witnesses were, in my view, minor and insufficient to displace my conclusion. 74 In contrast, the Accused’s evidence was only corroborated by Fharouk (who the DJ should have regarded as an interested witness). As I explained at [46] above, there were clear reasons to treat their evidence with caution. Ultimately, their evidence simply did not cohere with the totality of the evidence which showed that the Incident Cable was de-energised when the Deceased commenced work. 75 For the foregoing reasons, I concluded that the DJ had erred in finding that the Prosecution failed to prove beyond a reasonable doubt that the Incident Cable was initially de-energised when the Deceased commenced work.",
        "The DJ erred in his treatment of the witnesses’ evidence on whether the Accused had allowed the Workers to commence work": "76 Having found that the Incident Cable was initially de-energised when the Deceased commenced work, I next considered whether the DJ had erred in his treatment of the evidence on whether the Accused had allowed the Workers to commence work or instead instructed themnotto commence work. 77 Having considered the record and the parties’ submissions, I found that the DJ had erred in preferring the evidence of the Accused and Fharouk over that of the workers. These are my reasons. The workers’ testimonies were consistent on all material issues 78 First, the workers called as Prosecution witnesses gave evidence on whether the Accused allowed them to commence work and I found their testimonies to be consistent on all material issues. 79 The Workers who were present at the material time were Panneerchelvam, Malek, Jayaseelan, and Dineshkumar. The following table summarises their evidence on the Accused’s instructions: WitnessSummary of evidenceMalekMalek’s evidence was that he had asked the Accused if the Workers could commence work. The Accused’s response was “yes” and “can”.114Foot Note 114×ROA at pp 470–471: NE for 30 November 2021 at p 26, line 29 to p 27, line 2.According to Malek, this exchange took place in Malay. Malek understood Malay.115Foot Note 115×ROA at p 489: NE for 30 November 2021 at p 45, lines 7–22.PanneerchelvamPanneerchelvam testified that he had heard Malek asking the Accused “can we start the job or not”. The Accused’s response was “can”.116Foot Note 116×ROA at p 312: NE for 29 November 2021 at p 5, lines 6–9.Panneerchelvam also testified that he had heard Malek asking the Accused “off the current or not”. The Accused’s response was “yes off already”.117Foot Note 117×ROA at p 312: NE for 29 November 2021 at p 5, line 9.According to Panneerchelvam, this exchange took place in Malay. Panneerchelvam was able to understand the exchange as he understood Malay.118Foot Note 118×ROA at p 350: NE for 29 November 2021 at p 43, lines 3–30.JayaseelanJayaseelan testified that he saw the Accused speaking to the Deceased in Malay. However, Jayaseelan was unable to understand what they were talking about as he did not understand Malay.119Foot Note 119×ROA at p 529: NE for 27 April 2022 at p 4, lines 27–32.DineshkumarDineshkumar testified that he saw the Accused speaking to Malek and the Deceased in Malay. However, Dineshkumar was unable to understand what they were talking about as he did not understand Malay.120Foot Note 120×ROA at p 565: NE for 27 April 2022 at p 40, lines 22–24. 80 The DJ took the view that the four workers’ evidence was unreliable given that there was a discrepancy between Malek and Dineshkumar’s evidence on whether the Accused had conversed with Malek only, or with Malekandthe Deceased.121Foot Note 121×ROA at p 839: GD at [30]. 81 For the following reasons, I disagreed with the DJ’s view that this was a serious discrepancy rendering all four witnesses’ testimonies unreliable: (a) As the Prosecution rightly pointed out, the four workers were testifying about an event that took place about four years prior. Moreover, the event took place at a work site, where each of the Workers had their own tasks.122Foot Note 122×PWS at para 51.It was therefore unsurprising that there would be some differences in the workers’ testimonies. (b) Further, I failed to see how the evidence of Malek and Dineshkumar were necessarily contradictory. It was entirely possible that Malek and Dineshkumar were observing completely different points of the conversation between the Accused and Malek. Malek’s evidence was that the Accused had only told him that the Workers could start work. Crucially, however, it was not Malek’s evidence that the Accusedneverspoke with the Deceased at any other point in time. In contrast, Dineshkumar did not understand Malay123Foot Note 123×ROA at p 565: NE for 27 April 2022 at p 40, lines 22–24.and so it was impossible to determine if the verbal exchange Dineshkumar observed was the very same exchange that Malek was referring to (in which Malek allegedly asked the Accused if the Workers could start work and the Accused allegedly responded in the affirmative). 82 Reviewing the evidence of the four workers as a whole, I agreed with the Prosecution that their evidence was materially consistent.124Foot Note 124×PWS at paras 48–54.Therefore, the DJ ought not to have dismissed the four workers’ evidence on this point as unreliable. The workers’ evidence cohered with the objective evidence that the surrounding concrete slab, bottom panels, and doors to the OG Box 5900 had been removed 83 Second, I took the view that the DJ erred in failing to consider the workers’ undisputed evidence that they had removed the concrete slab around the OG Box 5900 as well as the bottom panels and doors to the OG Box 5900. This objective evidence supported the workers’ evidence that the Accused had allowed them to commence work. 84 As was explained by the Prosecution’s witness, Mr Wong Kum Kong Vincent (who was an SPPG employee), the identification of a cable only required the placing of a test lamp’s probe on the cable’s end.125Foot Note 125×ROA at p 192: NE for 1 September 2021 at p 11, lines 4–14.This meant that the Incident Cable could have been identified without removing the doors, bottom panels, and concrete slab. Therefore, and as the Prosecution submitted on appeal, the fact that the surrounding concrete slab, bottom panels and doors to the OGBox 5900 had been removed suggested that, at the material time, the decommissioning works had already progressedbeyondthe identification and isolation of the Incident Cable.126Foot Note 126×PWS at para 49(a).This in turn supported the workers’ evidence that the Accused had allowed them to commence work. The DJ erred in preferring the Accused’s evidence 85 Third, I found that the Accused was not a truthful witness, and that the DJ had therefore erred in preferring the Accused’s evidence over that of the workers. 86 There were at least two clear instances where the Accused was less than candid: (a) The Accused claimed that he did not know who the Deceased was, and that he had not spoken to or even seen the Deceased untilafterthe Deceased was electrocuted.127Foot Note 127×ROA at p 643: NE for 6 July 2022 at p 6, lines 20–26.This was plainly contradicted by the Prosecution’s witnesses, who made it patently clear that the Accused was simply trying to distance himself from the Deceased: (i) Panneerchelvam and Malek both testified that they were at the OG Box 5900 together with the Deceased and the Accused at some point in time.128Foot Note 128×ROA at p 488: NE for 29 November 2021 at p 15, lines 15–16; ROA at p 488: NE for 30 November 2021 at p 44, lines 18–23. (ii) Veerappan testified that the Accused had spoken to the Deceased before the OG Box 5900 was unlocked.129Foot Note 129×ROA at p 402: NE for 29 November 2021 at p 95, lines 16–23. (iii) Jayaseelan testified that the Deceased and the Accused had conversed in Malay.130Foot Note 130×ROA at p 553: NE for 27 April 2022 at p 28, lines 14–19. (iv) Dineshkumar testified that Malek, the Deceased and the Accused were laughing and conversing in Malay.131Foot Note 131×ROA at pp 567–568: NE for 27 April 2022 at p 42, line 31 to p 43, line 3. (b) Second, when the Accused was cross-examined on a yellow caution sticker that was found on the LV Board, his responses were evasive: (i) For context, a yellow caution sticker stating “Do Not Energise” was typically pasted onto an electrical unit after it had been de-energised to warn others from re-energising the unit.132Foot Note 132×ROA at p 202: NE for 1 September 2021 at p 21, lines 27–32.For an electrical unit to be de-energised, however, the cable connected to it had to first be identified. (ii) The cable that was connected on one end to Unit 4 of the LV Board was connected on the other end to a joint pit, where Veerappan stood awaiting instructions from the Accused to identify the cable. At the time of the incident, Veerappan had not received any instructions from the Accused relating to the identification of the cable.133Foot Note 133×PWS at para 41(c). (iii) In the present case, a yellow caution sticker had been pasted onto Unit 4 of the LV Board in the Substation. This was unusual because if the cable connected to Unit 4 of the LV Board had not been identified (as Veerappan testified), de-energisation could not have taken place. There should not, therefore, have been a yellow caution sticker pasted onto Unit 4 of the LV Board. (iv) When the Prosecution questioned the Accused on why there was a yellow caution sticker on Unit 4 of the LV Board even though the cable connected to Unit 4 of the LV Board had not been identified, the Accused claimed he had never heard of such a sticker. (v) When the Accused was shown a SPPG document titled “Rules For The Control And Safe Operation Of High And Low Voltage Apparatus”134Foot Note 134×ROA at pp 889–918.(which covered the use and purpose of a caution sticker), the Accused’s response was that he had not memorised the contents of that document.135Foot Note 135×ROA at p 697: NE for 6 July 2022 at p 60, lines 24–27. (vi) As the Prosecution correctly submitted, it was hard to accept that someone who had been performing electrical works with SPPG for 11 years could be ignorant of the caution stickers.136Foot Note 136×PWS at para 61(d).This was another clear instance where the Accused demonstrated a lack of candour. 87 Given that the Accused had not been a truthful witness on material issues, the DJ erred in simply accepting his evidence on the basis that it cohered with the evidence of Fharouk (whom, as I explained at [46] above, the DJ should have treated as an interested witness). Having regard to the totality of the evidence, the DJ ought to have preferred the clear and consistent evidence of the workers, who testified that the Accused had allowed them to commence work.",
        "The Prosecution proved beyond a reasonable doubt that the Accused had failed to ensure that the Incident Cable remained de-energised": "88 In light of the above, I concluded that the Prosecution did prove beyond a reasonable doubt that: (a) the Incident Cable was initially de-energised when the Deceased commenced work on the Incident Cable; and (b) the Accused had allowed the Workers to commence work. It therefore followed that the next issue I had to consider was whether the Prosecution had proven beyond a reasonable doubt that the Accused had failed to ensure that the Incident Cable remained de-energised. 89 On this issue, Dineshkumar testified that when he ran towards the Substation gate and shouted “Ah Bang, one man shocked” shortly after the Deceased had been electrocuted, he saw someone stick his head out of the Substation.137Foot Note 137×ROA at p 568: NE for 27 April 2022 at p 43, lines 23–26.However, the DJ placed minimal weight on this aspect of Dineshkumar’s evidence on the basis that: (a) it was uncorroborated; and (b) it did not show whether or how the Incident Cable was re-energised. 90 I disagreed with the DJ for the following reasons: (a) The fact that Dineshkumar’s account was uncorroborated was, in all likelihood, because he was the only one who ran towards the Substation to notify the Accused at the Substation of the electrocution. It followed that Dineshkumar would have been the only individual close enough to the Substation to notice someone stick his head out momentarily. Dineshkumar’s evidence on this point could not, therefore, be disregarded simply because it was uncorroborated. (b) Based on the totality of the evidence which I considered at [51]–[75] above, I found that the Incident Cable was de-energised when the Deceased commenced work. It followed that, for the Deceased to have been electrocuted whilst working on the Incident Cable, the Incident Cable must have been re-energisedafterthe Deceased commenced work. In my view, this alone was sufficient for the court to conclude that the Incident Cable had in factbeen re-energised. (c) Dineshkumar’s evidence thus shed some light onhowthe Incident Cable could have been re-energised. For the Incident Cable to have been re-energised, someone had to insert the fuse into the terminal unit of the LV Board in the Substation. Only the Accused or Fharouk could have done so because they were the only persons who could have been in the Substation at the material time. The fact that Dineshkumar saw someone stick his head out of the Substation shortly after the Deceased had been electrocuted lent credibility to the hypothesis that the Accused and Fharoukwerein the Substation at the material time, and that it was one of them who inserted the fuse into the terminal unit of the LV Board after the Deceased commenced work on the Incident Cable. It was important to remember, however, that the Prosecution was under no burden to prove exactly when and how the Incident Cable was re-energised (for the same reasons set out at [42]–[47] above). (d) Ultimately, the Prosecution only needed to prove beyond a reasonable doubt that the Incident Cable had, in fact, been re-energised after the Deceased commenced work on it. In my view, there was ample evidence to conclude that the Prosecution had discharged this burden. By allowing the Workers to commence work on a de-energised Incident Cable which subsequently became re-energised, the Accused had failed to ensure that the Incident Cable remained de-energised. 91 Given that the Prosecution had proven all the elements of the Charge, I was of the view that the DJ had erred in acquitting the Accused of the Charge. Therefore, I allowed the Prosecution’s appeal against acquittal and convicted the Accused on the Charge accordingly.",
        "It was unnecessary to decide if the DJ erred in refusing to amend the Charge and to convict the Accused on an amended charge": "92 In light of my decision to allow the Prosecution’s appeal against the Accused’s acquittal on the Charge, it was unnecessary for me to consider if the DJ had erred in refusing to amend the Charge and to convict the Accused on an amended charge.",
        "The appropriate sentence to be imposed": "93 Having decided to convict the Accused on the Charge, I then invited the parties to submit on the appropriate sentence to be meted out. I summarise the parties’ sentencing submissions below. The Prosecution’s sentencing submissions 94 The Prosecution submitted that a sentence of between ten and 12 months’ imprisonment was appropriate based on the sentencing framework laid down by the High Court for offences under s 15(3A) of the WSHA inMaoXuezhong v Public Prosecutor[2020] 5 SLR 580 (“MaoXuezhong”) (at [64(a)]). 95 According to the Prosecution, the harm caused in the present case was high and the Accused’s culpability should be pegged at the higher end of the moderate category inMaoXuezhong: (a) The Prosecution submitted that the harm caused was high as the Accused’s negligence had led to the Deceased’s death by electrocution.138Foot Note 138×Prosecution’s Sentencing Submissions dated 6 November 2023 (“PSS”) at para 11.Furthermore, there was high potential harm to other persons, given the risk of death or serious injury by electrocution to the other workers present at the material time. The likelihood of this potential harm was high as the Accused had failed to check if any of the Workers were wearing safety gear. Furthermore, the Accused had also failed to ensure that the Incident Cable was de-energised before allowing the Workers to commence work.139Foot Note 139×PSS at para 12. (b) The Accused’s culpability should be pegged at the higher end of the moderate category because his negligence consisted of at least three deviations from SPPG’s standard procedures. First, the Accused failed to supervise the electrical works. Second, he failed to take precautions and to ensure that the Incident Cable remained de-energised during the electrical works. Finally, he failed to ensure that the Workers wore insulated gloves and fire-retardant clothing before starting work.140Foot Note 140×PSS at para 13. 96 The indicative sentencing range provided inMaoXuezhongfor cases involving high harm and moderate culpability was between six and 12 months’ imprisonment. The Prosecution submitted that a sentence of ten to 12 months’ imprisonment was appropriate given its position that the Accused’s culpability was pegged at the higher end of the moderate category. 97 The Prosecution also submitted that there were no mitigating factors which featured in the present case. In the course of the trial, the Accused displayed not an iota of remorse and had instead sought to shift the blame to Malek.141Foot Note 141×PSS at para 16. The Accused’s sentencing submissions 98 The Accused agreed that the sentencing framework inMaoXuezhongapplied in the present case.142Foot Note 142×Defence’s Sentencing Submissions dated 6 November 2023 (“DSS”) at para 6.The Accused also agreed that the level of harm caused was high given that the Deceased had died.143Foot Note 143×DSS at para 9.In terms of culpability, the Accused argued that his culpability ought to be pegged at the moderate level. The Accused maintained that he had informed the Workers not to start work until he had de-energised the Incident Cable. Furthermore, the Accused stated that he did not instruct the Deceased to carry out any work on the Incident Cable, and much less did he give such instructions without first ensuring that the Deceased had donned the requisite safety gear.144Foot Note 144×DSS at para 9. 99 Recognising that the indicative sentencing range provided inMaoXuezhongfor cases involving high harm and moderate culpability was between six and 12 months’ imprisonment, the Accused sought a sentence of not more than eight months’ imprisonment.145Foot Note 145×DSS at para 12. A sentence of ten months’ imprisonment was appropriate 100 I agreed with the parties that the present case was one which clearly fell within the high harm and moderate culpability categories of the applicable sentencing frameworkinMaoXuezhong: (a) As was set out inMaoXuezhong(at [64(a)(i)]), in cases resulting in death, the harm caused would be at the top end of the high range. Beyond the Deceased’s death in the present case, however, I agreed with the Prosecution’s submission that harm could have been caused to the other workers who were in proximity to the Deceased. The potential harm which featured in the present case simply could not be ignored. (b) In terms of culpability, I agreed with the parties that the Accused’s culpability was moderate. However, I could not agree with the Accused’s submission that he had informed the Workersnotto start work until he had de-energised the Incident Cable. This was clearly against the weight of the evidence, as I explained at [78]–[84] above. I preferred the Prosecution’s position that the Accused’s culpability was at the higher end of the moderate range, given his multiple breaches of SPPG’s standard operating procedures. 101 Having regard to the harm caused and the Accused’s culpability, I found that a sentence of ten months’ imprisonment was appropriate and fair in the circumstances. I therefore imposed a sentence of ten months’ imprisonment on the Accused.",
        "Conclusion": "102 To conclude, I found that the DJ had erred in acquitting the Accused of the Charge. I therefore allowed the Prosecution’s appeal against acquittal and convicted the Accused on the Charge under s 15(3A) of the WSHA. Having considered the parties’ submissions on sentence, I imposed a sentence of ten months’ imprisonment on the Accused. Vincent HoongJudge of the High Court Gregory Gan and A M Mohamed Riasudeen (Attorney-General’s Chambers) for the appellant; Mumtaj Banu d/o Abdul Kalam Azad and Yamuna d/o Balakrishnan (Abdul Rahman Law Corporation) for the respondent."
    }
}