{
    "case_title": "Peck Wee Boon Patrick and anothervLim Poh Goon and others",
    "ncitation": "[2024] SGHC 44",
    "coram": "Tan Siong Thye SJ",
    "sections": {
        "Introduction": "1 This is a claim by Peck Wee Boon Patrick (“Mr Peck”) and Ding Siew Peng Angel (“Mdm Ding”) (collectively, the “plaintiffs”) under a written agreement relating to a residential construction project. 2 The essence of the plaintiffs’ claim is that they were promised attractive returns on their financial contribution towards a residential construction project by the first defendant, Lim Poh Goon (“LPG”). This promise was recorded in a written agreement (the “Agreement”) between the plaintiffs and the third defendant, Haixia Crystal Construction Pte. Ltd. (“HXC”). HXC undertook the construction of the project. Unfortunately for the plaintiffs, the alleged promise never materialised, and they were neither repaid their contribution nor given their returns. The plaintiffs claim that this amounted to fraud. 3 One of the main protagonists, LPG, was not called to testify as a witness in these proceedings. However, the plaintiffs have already obtained a default judgment against LPG and HXC and the judgment debt has only been partially fulfilled by way of a garnishee order against HXC. 4 The plaintiffs, therefore, seek to pursue their claim against Haixia Crystal Development Pte. Ltd. (“HXD”), the fourth defendant and the developer of the residential property involved in the project, and Lim Poh Quee (“LPQ”), the second defendant and the director of HXD. The parties agree that the focus of this trial is against LPQ and HXD. The plaintiffs’ claim against LPQ and HXD raises a broader legal issue which is: to what extent can the law hold separate legal entities accountable for the allegedly fraudulent scheme perpetrated by another entity? The plaintiffs allege that the very close association amongst LPG, HXC, LPQ and HXD (collectively, the “defendants”) was of such an extent that LPQ and HXD should be found liable for the alleged fraud perpetrated by LPG and his corporate vehicle, HXC. The plaintiffs have gone as far as to allege that LPQ and HXD were complicit in the alleged fraudulent scheme of LPG and HXC. LPQ and HXD deny their involvement in the alleged scheme. 5 I shall first summarise the background to the dispute before addressing the main issues.",
        "Background to the dispute": "",
        "The parties and companies involved": "6 The plaintiffs are husband and wife. 7 The first defendant is LPG. According to the records of the Accounting and Corporate Regulatory Authority (“ACRA”), at the time of the Agreement, LPG was the company secretary of HXD and a shareholder of HXC. LPG is currently the sole director and shareholder of HXC. 8 The second defendant is LPQ. LPQ and LPG are brothers. At the time of the Agreement, LPQ was the sole director and a shareholder of HXC and also a director of HXD. LPQ is currently the sole director of HXD. 9 The third defendant is HXC, a company incorporated in Singapore. HXC is in the business of general contractors (building construction and significant upgrading works) and general contracts (non-building construction).1Foot Note 1×Agreed Bundle of Documents Vol 7 dated 12 September 2023 (“7AB”) 3.At the time of the Agreement, LPQ was the sole director and a shareholder of HXC, while LPG and LPG’s wife, Luo Hai Xia, were shareholders of HXC. At and around the time of the Agreement, HXC was the main contractor for the redevelopment of the property at 10 Jalan Shaer Singapore 769357 (“Original 10JS”). 10 The fourth defendant is HXD. HXD is a special-purpose vehicle set up to facilitate real estate development.2Foot Note 2×7AB7.At or around the time of the Agreement, HXD owned two properties: the Original 10JS and a property situated at Fidelio Street (“FS”). At the material time, HXD had: (a) nine shareholders; (b) four directors, one of whom was LPQ; and (c) one company secretary, who was LPG. 11 Both HXC and HXD were named after LPG’s wife, Luo Hai Xia. 12 For ease of reference, Annex 1 of this judgment sets out the Table of the Change in Directorships and Shareholding for HXC and HXD from 30 March 2012 to 14 March 2022, as prepared by the plaintiffs.",
        "Involvement of LPQ": "13 In August 2017, LPQ left his previous job and joined HXC. LPG allegedly told him that he would be made a director and shareholder of HXC.3Foot Note 3×Joint Affidavit of Evidence-in-Chief (“AEIC”) of Lim Poh Quee and Haixia Crystal Development Pte Ltd dated 7 August 2023 (“AEIC LPQ”) at para 13.LPG resigned as a director of HXC and LPQ was appointed as the sole director of HXC. LPQ was also made a shareholder of HXC, together with LPG and his wife.",
        "The purchase of the Original 10JS and the incorporation of HXD": "14 In September 2017, an Option to Purchase (“OTP”) for the Original 10JS was issued to “LPG and/or nominee” in consideration for an option fee of $33,800. The purchase price of the Original 10JS was $3.38m.4Foot Note 4×Statement of Agreed Facts dated 12 September 2023 (“SOAF”) at para 12. 15 Shortly thereafter, in October 2017, HXD was incorporated to facilitate the redevelopment of the Original 10JS. On incorporation, LPQ was the sole shareholder and the only director of HXD (see Annex 1).5Foot Note 5×SOAF at para 13.Soon after, LPG was appointed as the company secretary of HXD.6Foot Note 6×SOAF at para 14.On 15 November 2017, three other persons, namely, Yam Tie Chuan (“Mr Yam”), Lee Tian Sher and Er Tian Sion (“Mr Er”), were appointed directors of HXD, in addition to LPQ. At the same time, LPQ was removed as a shareholder of HXD and nine other persons were added as shareholders.7Foot Note 7×SOAF at para 16. 16 On 16 November 2017, LPQ, as a director of HXD, exercised the OTP in respect of the Original 10JS on behalf of HXD.8Foot Note 8×SOAF at para 17. 17 On 23 July 2018, the four directors of HXD (ie, LPQ, Mr Yam, Lee Tian Sher and Mr Er) executed a resolution (the “2018 HXD Resolution”). The 2018 HXD Resolution recorded the names of the nine shareholders in HXD at that time, together with LPQ and HXC, against their respective contributions for the purchase and redevelopment of the Original 10JS. The financial contributions of all 11 parties were referred to as “loans” to HXD.9Foot Note 9×Agreed Bundle of Documents Vol 1 dated 12 September 2023 (“1AB”) 19–20. 18 In the 2018 HXD Resolution, HXC was stated to have invested $1.7m, with the clarification that this sum represented the costs for the redevelopment of the Original 10JS to be underwritten and undertaken by HXC.10Foot Note 10×SOAF at para 20.In other words, HXC’s contribution was not in the form of an upfront financial contribution of $1.7m but instead HXC was to bear the costs of the construction and redevelopment of the Original 10JS.",
        "How the plaintiffs became involved": "19 In early 2018, the plaintiffs engaged LPG and his company to rebuild their house at Lucky Heights. Sometime in July or August 2018, LPG allegedly told the plaintiffs that he could offer them a chance to invest in the redevelopment project of the Original 10JS (the “10JS Project”).11Foot Note 11×AEIC of Ding Siew Ping Angel dated 7 August 2023 (“AEIC Ding”) at para 21. 20 LPG allegedly told the plaintiffs that the Original 10JS was a single plot of land which could be subdivided into two plots of land with a house on each plot. I shall refer to these subdivided properties as “10 JS” and “10A JS” respectively, and as “the redeveloped 10JS properties” collectively. The redeveloped 10JS properties could then be sold to interested buyers.12Foot Note 12×AEIC Ding at para 21.Further, LPG allegedly informed the plaintiffs that he had purchased the Original 10JS at a price of $3.38m and intended to sell the redeveloped 10JS properties for a total of at least $6m. LPG allegedly told the plaintiffs that he was confident that the 10JS Project would be profitable.13Foot Note 13×AEIC Ding at para 22.",
        "The meeting on 18 August 2018 and the Agreement": "21 On 18 August 2018, LPG and the plaintiffs allegedly met for further discussions on the 10JS Project.14Foot Note 14×AEIC Ding at para 23.At this meeting, LPG allegedly assured the plaintiffs that the 10JS Project would be profitable, and that it was popular and heavily subscribed to by investors.15Foot Note 15×AEIC Ding at para 24.LPG allegedly showed the plaintiffs the 2018 HXD Resolution to demonstrate that there were many investors in the 10JS Project and that HXC had a $1.7m stake in the project.16Foot Note 16×Ibid.Further, LPG allegedly told the plaintiffs that the 10JS Project would minimally yield a 20% profit for them,17Foot Note 17×Ibid.and that this would be received by the plaintiffs once the 10JS Project was sold or had obtained its Temporary Occupation Permit (“TOP”).18Foot Note 18×AEIC Ding at paras 26–27. 22 At this meeting, LPG allegedly told the plaintiffs that he was prepared to share 20% of HXC’s $1.7m stake in the 10JS Project if the plaintiffs invested a sum of $340,000 (the “Investment Sum”). LPG also allegedly told the plaintiffs that the money provided by them would be used solely and exclusively for the 10JS Project.19Foot Note 19×AEIC Ding at para 26. 23 As reassurance to the plaintiffs, LPG allegedly told them that he was the owner and controller of HXC and HXD, and that his brother, LPQ, was a sleeping partner who had left everything related to HXC, HXD and the 10JS Project to him. Thus, LPG was able to control all aspects of the 10JS Project to ensure that the plaintiffs’ investment would be safe and profitable.20Foot Note 20×AEIC Ding at para 28. 24 The plaintiffs eventually agreed to make a financial contribution of $340,000.21Foot Note 21×AEIC Ding at para 29.To record this contribution, the plaintiffs and LPG (signing as director of HXC) executed a one-page written document which formed the Agreement. The Agreement was prepared by one of LPG’s staff. The Agreement referred to the contribution of the plaintiffs as a “[loan] to [HXC] for the redevelopment of [the Original 10JS]”. The plaintiffs’ contribution was stated to be 20% of a loan of $1.7m, with the remaining $1.36m, forming 80% of this loan, to come from HXC.22Foot Note 22×AEIC Ding at para 30.Notably, the Agreement did not state the expected returns or interest, or the terms of the financial contribution. 25 On the alleged instruction of LPG, the plaintiffs issued a cheque dated 18 August 2018 for the sum of $340,000 payable to HXD.23Foot Note 23×AEIC Ding at para 32.LPG explained to the plaintiffs that the cheque was made payable to HXD rather than HXC because HXD was the developer of the 10JS Project while HXC was the builder of the project. Hence, payment was to be made to the developer to obtain a stake in the 10JS Project. LPG also assured the plaintiffs that he was in control of HXC and HXD, and that he represented both entities.24Foot Note 24×AIEC Ding at para 33.",
        "The deposit and withdrawal of the plaintiffs’ contribution": "26 The plaintiffs’ Investment Sum was deposited into HXD’s DBS bank account on 20 August 2018.25Foot Note 25×1AB130.Shortly thereafter, the sums of $150,000 and $190,000 were withdrawn via cash cheques on 25 August 2018 and 28 August 2018, respectively.26Foot Note 26×Ibid.These cash cheques were signed by LPQ and another director of HXD, Mr Er, and were handed over to LPG.27Foot Note 27×AEIC LPQ at para 43; Certified Transcript 21 September 2023 at p 6 lines 3–6. 27 On the same day that the above sums were withdrawn, the exact amounts (ie$150,000 and $190,000) were deposited into HXC’s DBS bank account.28Foot Note 28×1AB171–172.",
        "Change in the directorship of HXC": "28 In June 2019, LPQ ceased working for HXC.29Foot Note 29×SOAF at para 26; AEIC of Sheryl Lim Peck Ruan (Lin Binuan) dated 3 August 2023 (“AEIC Sheryl”) at para 5. 29 On 11 October 2019, LPG was re-appointed as the director of HXC and LPQ ceased to be the sole director of HXC.30Foot Note 30×SOAF at para 27.Thereafter, LPG’s and LPQ’s involvement in HXC and HXD was as follows: (a) LPG was the sole director and one of the shareholders of HXC, and the company secretary of HXD; and(b) LPQ was one of the shareholders of HXC, and a director of HXD.",
        "Progress of the 10JS Project": "30 On 23 October 2019, an OTP in respect of 10 JS (which was one part of the Original 10JS) was issued to a third-party purchaser, with the purchase price of $3.4m, in consideration for an option fee of $680,000. This OTP was signed by LPG, on behalf of HXD as an “authorised signatory”. Cheques for the sums of $170,000 and $510,000 (totalling $680,000) were credited into HXD’s DBS bank account on 14 October 2019 and 23 October 2019 respectively.31Foot Note 31×SOAF at para 30. 31 Subsequently, the sums of $170,000 and $510,000 were withdrawn from HXD’s DBS bank account via cash cheques on 15 October 2019 and 24 October 2019 respectively.32Foot Note 32×SOAF at paras 31–32. 32 On 22 January 2020, the OTP for the sale of 10 JS was exercised and the sum of $102,000 was deposited into HXD’s DBS bank account. Subsequently, on 23 January 2020, the sum was withdrawn via cash cheque from HXD’s DBS bank account.33Foot Note 33×SOAF at para 33. 33 On 30 July 2020, an OTP in respect of 10A JS (which was the other part of the Original 10JS) was issued to two third-party purchasers, with the purchase price of $3.55m, in consideration for an option fee of $355,000. This OTP was signed by LPG, on behalf of HXD as an “authorised signatory”. A cheque for the sum of $355,000 was credited to HXD’s DBS bank account on 29 July 2020.34Foot Note 34×SOAF at para 34. 34 On 5 August 2020, a sum of $145,000 was deposited into HXD’s DBS bank account. Later that same day, a sum of $500,000 (ie,the sum total of $355,000 and $145,000) was withdrawn via cash cheque from HXD’s DBS bank account.35Foot Note 35×SOAF at para 35. 35 On 31 December 2020, HXD issued eight cheques for a total sum of $114,759.36Foot Note 36×SOAF at para 36. 36 On 15 March 2021, LPQ and another director of HXD, Mr Yam, signed a letter addressed to HXC stating, among other things, that HXC’s “loan amount” of $1.7m for the 10JS Project with profit would be paid to HXC’s OCBC bank account within three days of receipt of sales payment (the “Confirmation Letter”).37Foot Note 37×SOAF at para 38. 37 On 3 May 2021, LPQ and another director of HXD, Mr Yam, signed a director’s resolution which authorised any of the directors and the company secretary of HXD to sell either one or both of the redeveloped 10JS properties and ratified their actions in doing so. To the same end, the director’s resolution expressly confirmed, ratified and approved any action taken by any director or the company secretary concerning the sale of the same property(s).38Foot Note 38×SOAF at para 39; 1AB95.Accordingly, HXD had, subsequent to the OTPs signed by LPG with the purchasers of 10 JS and 10A JS on 23 October 2019 and 30 July 2020 respectively, confirmed, ratified and approved the sale of the redeveloped 10JS properties that was entered into by LPG. 38 On 6 May 2021, the OTP in respect of 10A JS was exercised.39Foot Note 39×SOAF at para 40.",
        "Change in the directorship of HXD": "39 On 16 December 2020, Mr Er ceased to be a director of HXD,40Foot Note 40×SOAF at para 7(6).leaving HXD with three directors that included LPQ. 40 On 6 May 2021, two of the remaining three directors of HXD resigned, leaving LPQ as the sole director of HXD.41Foot Note 41×SOAF at paras 7(7), 40.",
        "The plaintiffs’ efforts seeking repayment": "41 While Mdm Ding was initially updated by LPG or his representatives about the 10JS Project in 2019 and 2020,42Foot Note 42×AEIC Ding at para 37.these updates allegedly became less frequent.43Foot Note 43×AEIC Ding at para 38.On 11 May 2011, Mdm Ding, wrote an e-mail, on behalf of the plaintiffs, to HXC and addressed to LPG, stating that she understood the redeveloped 10JS properties were sold and therefore wanted to check when LPG could return their investment and profit. A picture of the Agreement was also attached to the e-mail, and Mdm Ding noted a “promised return interests 20-25%” [sic] when referring to the Agreement.44Foot Note 44×AEIC Ding at para 39; Agreed Bundle of Documents Vol 2 dated 12 September 2023 (“2AB”) 227–228. 42 Having received no reply, Mdm Ding sent another e-mail to HXC, addressed to LPG, on 15 September 2021. In this e-mail, Mdm Ding sought confirmation of the status of the 10JS Project and wanted to know when the plaintiffs could get their “investment cost + interests + profits” [sic].45Foot Note 45×AEIC Ding at para 40; 2AB227. 43 On 16 September 2021, the plaintiffs received an e-mail reply from HXC, signed off by LPG, in relation to their earlier e-mails. The e-mail stated that the redeveloped 10JS properties were sold. The e-mail further stated that because the full purchase price could only be collected after obtaining “the TOP & CSC from BCA, Land Title from SLA, and Completion of after TOP works of the property” [sic], the “amount” would be paid by the end of December 2021.46Foot Note 46×AEIC Ding at para 40; 2AB226–227. 44 On 27 December 2021, Mdm Ding sent an e-mail, responding on behalf of the plaintiffs, stating that the plaintiffs were expecting “the sold property amount crediting into our account” [sic] and provided directions to issue a cheque or execute a bank transfer to them.47Foot Note 47×AEIC Ding at para 41; 2AB226. 45 On 30 December 2021, Mr Peck allegedly called LPG to, among other things, seek an update on the progress of the payment to the plaintiffs for the 10JS Project.48Foot Note 48×AIEC of Peck Wee Boon Patrick dated 7 August 2023 (“AEIC Peck”) at para 10.During the call, LPG allegedly informed Mr Peck that the repayment was contingent on the issuance of the Certificate of Statutory Completion or TOP for the redeveloped 10JS properties. This was allegedly estimated by LPG to be within a few months.49Foot Note 49×AIEC Peck at para 11. 46 Shortly after the call, on the same day, Mr Peck sent an e-mail to HXC, addressed to LPG, to record the contents of their conversation, specifically that upon obtaining TOP of the redeveloped 10JS properties, LPG will make the repayment to the plaintiffs.50Foot Note 50×AEIC Peck at para 13; 2AB226. 47 Notwithstanding the e-mails and conversation between the plaintiffs and LPG and HXC, the plaintiffs received no repayment in relation to the 10JS Project. Further attempts to seek payment from LPG were rebuffed. 48 Subsequently, the plaintiffs discovered that another suit in HC/S 8/2022 (“Suit 8”) had been commenced against the defendants by one Ang Xinwei (“Mr Ang”).51Foot Note 51×AEIC Ding at paras 45–46.Based on the cause papers filed in Suit 8 by Mr Ang, who was another investor in the 10JS Project, the plaintiffs concluded that they had been the victims of a fraud engineered by the defendants.52Foot Note 52×Plaintiffs’ Opening Statement dated 12 September 2023 at para 37. 49 On 29 April 2022, the plaintiffs commenced the present action and also filed anexpartesummons in HC/SUM 1668/2022 applying for an injunction prohibiting the disposal of assets in Singapore against the defendants.53Foot Note 53×SOAF at para 48. 50 On 27 May 2022, the plaintiffs obtained a Mareva injunction against LPQ and HXD, with conditions for discharge of the order.54Foot Note 54×SOAF at para 49.On 27 July 2022, a consent order discharging the Mareva injunction was entered based on HXD’s provision of security in the sum of $408,000 which was paid into court.55Foot Note 55×SOAF at para 51. 51 On 10 August 2022, the plaintiffs obtained judgment in default against LPG and HXC, under which LPG and HXC were ordered to pay the plaintiffs, excluding the costs of the action against them, the sum of $497,895.60.56Foot Note 56×SOAF at para 52.On 11 October 2022, a sum of $19,090 was recovered from HXC’s OCBC bank account in partial satisfaction of the judgment debt by way of a garnishee order.57Foot Note 57×SOAF at para 53.",
        "The parties’ cases": "",
        "The plaintiffs’ case": "52 The plaintiffs rely on a number of grounds to claim their Investment Sum paid towards the 10JS Project. As a preliminary point, the plaintiffs aver that their contribution to the 10JS Project was an “investment” as opposed to a “loan”,58Foot Note 58×Plaintiffs’ Closing Submissions dated 20 October 2023 (“PCS”) at para 64(3).notwithstanding that the latter term was expressly used in the Agreement. 53 The reliefs sought by the plaintiffs as disclosed from their Statement of Claim (Amendment No. 2) (“SOC No. 2”) are as follows:59Foot Note 59×Statement of Claim (Amendment No. 2) dated 11 August 2023 (“SOC No. 2”) at p 21. (1) Payment of the sum of $408,000 being the Returns under the Investment Agreement (i.e. $340,000 plus 20% return of $68,000); (2) Further and/or in the alternative, for damages to be assessed for the breach of the Investment Agreement; (2A) A declaration that the Investment Sums are held on trust by HXD, and for an account by HXD of the Investment Sum and proportionate share of the profits arising out of the 10JS Project (i.e., 5.70% of the 10JS Project), and payment of the same by HXD to the Plaintiffs; (2B) Further and/or alternatively, a declaration that LPG and/or LPQ are to account to the Plaintiffs for the sum of $340,000 on the ground of their dishonest assistance in HXD’s breach of trust; (2C) An order that the Plaintiff is entitled to trace all such monies and payments representing the Investment Sums into the hands of the Defendants (as the case may be) and elsewhere as they may be found; (2D) Further and/or in the alternative, equitable compensation to be assessed and paid to the Plaintiff; (3) Further and/or in the alternative, a declaration for the Investment Agreement to be rescinded and for the repayment of $340,000, and/or damages to be assessed; (4) Further and/or in the alternative, restitution for the sum of $340,000; (5) Further and/or in the alternative, equitable compensation to be assessed and paid to the Plaintiff; (6) Interests; (7) Costs; (8) Such further and/or other reliefs as this Court deems fit. Claim against HXC and/or LPG under the Agreement 54 Further, the plaintiffs submit that LPG and/or HXC are liable to pay the sum of $408,000 being the Investment Sum and the promised returns under the Agreement (ie, $340,000 plus minimally 20% returns of $68,000).60Foot Note 60×PCS at para 65(3). 55 Alternatively, the plaintiffs submit that HXC and/or LPG are liable to pay damages to the plaintiffs for the breach and/or repudiation of the Agreement by failing to deliver to the plaintiffs their contribution and returns upon the sale of the redeveloped 10JS properties, or alternatively, by 31 December 2021 as assured by HXC.61Foot Note 61×SOC No. 2 at para 21. Claim in fraudulent misrepresentation 56 The plaintiffs claim that on or around 18 August 2018, the date of the meeting with LPG and the Agreement, LPG had made multiple representations to them about the matters relating to the 10JS Project.62Foot Note 62×SOC No. 2 at paras 9–10.The plaintiffs relied on and was induced by these representations from LPG. They issued a cheque for the sum of $340,000 payable to HXD to invest in the 10JS Project.63Foot Note 63×SOC No. 2 at para 11. 57 The plaintiffs allege that the representations were false and untrue.64Foot Note 64×SOC No. 2 at para 17.The plaintiffs aver that LPG made the representations fraudulently, and either LPG knew that they were false and untrue, or recklessly not caring about their truth with a view to induce the plaintiffs to transfer the Investment Sum so that it could be used for purposes other than for the 10JS Project.65Foot Note 65×SOC No. 2 at para 18. 58 As against LPQ, the plaintiffs allege that he should be held liable for LPG’s fraudulent misrepresentations as he had placed LPG in a position whereby LPG represented that he was in control of HXD. Alternatively, LPG was authorised to act for and on behalf of HXD and/or LPQ in all matters relating to the 10JS Project. Hence, LPQ and/or HXD were bound by the acts, conduct and representations of LPG in connection with the 10JS Project.66Foot Note 66×Reply to the Joint Defence of the 2nd and 4th Defendants dated 6 April 2022 (“PR”) at para 2(d). Claim in constructive and Quistclose trusts 59 The plaintiffs aver that a constructive trust arises in respect of their contribution and that HXD and/or LPQ are liable as constructive trustees.67Foot Note 67×SOC No. 2 at para 19.In relation to HXD and/or LPQ, the plaintiffs assert that HXD and/or LPQ knew or ought to have known about the Investment Sum of the plaintiffs or the receipt of the funds from the plaintiffs into HXD’s DBS bank account.68Foot Note 68×Ibid.Since the plaintiffs’ Investment Sum was subsequently withdrawn for unknown purposes, HXD is thus liable to account to the plaintiffs for the Investment Sum and net profit proportionate to the plaintiffs’ stake in the 10JS Project.69Foot Note 69×SOC No. 2 at para 20. 60 The plaintiffs also claim against HXD under aQuistclosetrust on the basis that the Investment Sum deposited into HXD’s bank account had been used for purposes other than for the 10JS Project.70Foot Note 70×SOC No. 2 at para 26. Claims in dishonest assistance and knowing receipt 61 The plaintiffs submit that LPG, LPQ and/or HXD are liable for dishonestly assisting HXC’s breach of trust or are otherwise liable in knowing receipt of the Investment Sum.71Foot Note 71×SOC No. 2 at para 29.LPG, LPQ and/or HXD were aware that HXC received the Investment Sum from the plaintiffs and that the Investment Sum was held by HXC on trust and for the sole purpose of the plaintiffs’ investment in the 10JS Project.72Foot Note 72×SOC No. 2 at para 28.Notwithstanding their knowledge, LPG, LPQ and/or HXD had diverted or applied the Investment Sum for purposes unrelated to the 10JS Project.73Foot Note 73×Ibid.Accordingly, a constructive trust should be imposed over the Investment Sum and any assets acquired from the usage of this sum.74Foot Note 74×SOC No. 2 at para 29. Claim in unjust enrichment 62 The plaintiffs aver that the defendants have been unjustly enriched at the expense of the plaintiffs and, therefore, they claim restitution.75Foot Note 75×SOC No. 2 at para 23.In the alternative, the plaintiffs aver that HXD had been unjustly enriched at the expense of the plaintiffs either on the ground of total failure of consideration or on the ground of fraudulent misrepresentation.76Foot Note 76×SOC No. 2 at para 24. Claim in conspiracy 63 Lastly, the plaintiffs claim against the defendants for conspiracy to defraud or injure by unlawful means by coming together to defraud or fraudulently misrepresent to the plaintiffs with the intention of causing them to part with their Investment Sum.77Foot Note 77×SOC No. 2 at paras 30–31.",
        "LPG’s and HXC’s case": "64 Having failed to comply with an unless order (HC/ORC 3991/2022) obtained in HC/SUM 2548/2022, the court ordered on 10 August 2022 that the Joint Defence of LPG and HXC dated 23 March 2022 was to be struck out.78Foot Note 78×HC/JUD 339/2022.Accordingly, a default judgment was entered against LPG and HXC for them to pay the plaintiffs the sum of $408,000, with interest thereon at the rate of 5.33% from 18 August 2018 to the date of the default judgment. This being the case, the trial focused on LPQ and HXD as the remaining defendants in this suit.",
        "LPQ’s and HXD’s case": "65 The essence of LPQ’s and HXD’s case is that the plaintiffs should instead look towards LPG and HXC for recovery of the amounts claimed. Any investment arrangement made was between the plaintiffs and LPG and/or HXC.79Foot Note 79×AEIC LPQ at para 81(e); 2nd Supplementary Joint AEIC of Lim Poh Quee and Haixia Crystal Development Pte Ltd dated 25 August 2023 (“2AEIC LPQ”) at para 8.LPQ and HXD had nothing to do with the Agreement. This is because prior to the commencement of the proceedings, LPQ and HXD had no knowledge of the existence of the plaintiffs and/or their dealings with LPG and/or HXC.80Foot Note 80×Joint Defence for the 2nd and 4th Defendants (Amendment No. 2) dated 18 August 2023 (“DD No. 2”) at paras 2, 7–9, 11, 14–16.At all material times, LPG was in control of HXC and made all decisions relating to HXC.81Foot Note 81×DD No. 2 at para 4A(c).Further, LPG is not a “shadow director” or the “true controller” of HXD.82Foot Note 82×DD No. 2 at para 5A(d).LPG had no control over HXD as he was neither a shareholder nor a director of HXD.83Foot Note 83×Ibid.The relationship between HXD and LPG and/or HXC was strictly at arm’s length and commercial in nature between a developer and a contractor.84Foot Note 84×DD No. 2 at para 5C(g). 66 In relation to the claim of fraudulent misrepresentations, LPQ and/or HXD were neither a party to nor privy to the representations allegedly made by LPG to the plaintiffs about the matters relating to the 10JS Project.85Foot Note 85×DD No. 2 at para 10. 67 In relation to HXD’s receipt of and pay-out of the plaintiffs’ Investment Sum, HXD and LPQ aver that LPG had called LPQ to inform LPQ that LPG had mistakenly banked a cheque for the sum of $340,000 into HXD’s DBS bank account.86Foot Note 86×DD No. 2 at para 11A(a).HXD and LPQ claim that they knew nothing about this payment into HXD’s bank account and accepted LPG’s explanation, especially since no incoming funds were expected by HXD and LPQ.87Foot Note 87×DD No. 2 at para 11A(b).Pursuant to LPG’s request, HXD issued two cash cheques for the sums of $150,000 and $190,000, which were handed over to LPG.88Foot Note 88×DD No. 2 at para 11A(c).These amounts were subsequently debited from HXD’s DBS bank account.89Foot Note 89×Ibid.HXD and LPQ maintain that they do not know who the recipient(s) of these cash cheques was, or what the moneys were used for.90Foot Note 90×DD No. 2 at para 11A(d).Instead, it appeared to HXD and LPQ that the cash cheques for the sums of $150,000 and $190,000 were credited into HXC’s bank account on the same day they were debited from HXD’s DBS bank account.91Foot Note 91×DD No. 2 at para 11A(e)-)(f). 68 In relation to the Agreement, HXD and LPQ aver that they are not bound by the Agreement as they were not even parties to the Agreement.92Foot Note 92×DD No. 2 at para 21.The Agreement was entered into between the plaintiffs and LPG and/or HXC.93Foot Note 93×DD No. 2 at para 12.LPQ and HXD had no knowledge of and were not aware of the Agreement.94Foot Note 94×Ibid. 69 In response to the claim for dishonest assistance and/or knowing receipt, LPQ and HXD deny that these have been made out.95Foot Note 95×DD No. 2 at paras 25–25B.Essentially, LPQ and HXD had no knowledge of the interactions and/or dealings between the plaintiffs and LPG and that LPG alone approached the plaintiffs to seek their funding investment for the 10JS Project. LPQ and HXD did not even know of the plaintiffs, had never met the plaintiffs and/or had never engaged in any form of communication whatsoever with the plaintiffs at all the material times.96Foot Note 96×DD No. 2 at para 7. 70 Lastly, LPQ and HXD deny conspiring with LPG and/or HXC to injure the plaintiffs and/or deprive them of their Investment Sum by unlawful means conspiracy.97Foot Note 97×DD No. 2 at paras 25D(e).",
        "Issues to be determined": "71 Based on the substantive claims of the plaintiffs, different heads of claims have been brought in relation to the defendants. For simplicity, the issues to be decided can be divided into eight heads of claim: (a) Whether LPG is liable for fraudulent misrepresentation and whether HXD should also be held liable on the ground that LPG was the actual controller, shadow director, authorised representative, or agent of HXD in respect of the 10JS Project.98Foot Note 98×Plaintiffs’ Lead Counsel Statement dated 10 August 2023 (“PLCS”) at p 2.(b) Whether the Investment Sum is held on constructive trust by LPQ and/or HXD.99Foot Note 99×PLCS at p 3.(c) Whether the Investment Sum is held on aQuistclosetrust by HXD.100Foot Note 100×PLCS at p 4.(d) Whether any of the defendants are liable for breach of trust.(e) Whether any of the defendants are liable for dishonestly assisting in the breach of trust committed by any of the other defendants.101Foot Note 101×Ibid.(f) Whether LPG and/or HXC had committed a breach or repudiatory breach of the Agreement.102Foot Note 102×Ibid.(g) Whether any of the defendants were unjustly enriched on the ground of total failure of consideration or on the ground of fraudulent misrepresentation.103Foot Note 103×Ibid.(h) Whether the defendants are liable for a conspiracy to defraud or injure the plaintiffs by unlawful means.",
        "Claim under the Agreement": "72 I shall first deal with the nature of the Agreement between the plaintiffs and LPG and HXC. Was the Agreement for a loan or an investment?",
        "Whether the Agreement was in substance for a loan or an investment": "73 Before addressing the various claims of the plaintiffs under the Agreement, there was a dispute, in the course of the trial, as to whether the Agreement was for a loan or an investment.104Foot Note 104×Plaintiffs’ Reply Submissions dated 26 October 2023 (“PRS”) at para 4; 2nd & 4th Defendants’ Closing Submissions dated 20 October 2023 (“2&4DCS”) at para 26.In the original Statement of Claim dated 22 February 2022 (“SOC No. 1”) filed by the plaintiffs, the sum advanced by the plaintiffs under the Agreement was described as a loan, which is consistent with its description in the Agreement as a “loan”.105Foot Note 105×Seeeg, Statement of Claim dated 22 February 2022 (“SOC”) at para 9 (“ ... if the Plaintiffs provided a loan to HXC, the Plaintiffs would be able to profit from the gains from the Project once the Properties was sold ...”); para 10(c) (“… and if the Plaintiffs provided a loan to HXC ...”); para 11 (“... LPG and HXC (through LPG) on the other hand entered into an agreement (“Loan Agreement”) to record the Plaintiffs' investment of $340,000 into the 10JS Project on the spot to loan a sum of $340,000 (“Loan Sum”) to HXC for the 10JS Project ...”)However, the plaintiffs have since amended this description in their SOC No. 2, and defines the Agreement as an investment and refers to the sum advanced as an “Investment Sum”. 74 Needless to say, a loan is significantly different from an investment in substance, meaning, implications, outcome, nature and terms. A loan is a transaction where one party lends a specific amount of money to another party with an agreement to repay the principal amount plus (as is usually the case) interest over a predetermined period: seePower Solar System Co Ltd (in liquidation) v Suntech Power Investment Pte Ltd[2018] SGHC 233 at [69]–[73]. An investment involves the injection of capital into a business with the hope of making a gain which is not guaranteed, unless otherwise provided for. An investor has a share in the business and may receive dividends if the business generates profits. However, if the business does badly, the investor may lose his investment sum. In a loan agreement the principal sum and interest are certain and predictable, while in an investment there are risks that the investor may forego his investment sum if the business turns south. 75 During the trial, substantial time was spent on the cross-examination of Mdm Ding on whether the Agreement was for a loan or an investment. According to Mdm Ding, at the time of the Agreement, she had assumed the term “loan” to mean “investment”.106Foot Note 106×Certified Transcript 19 September 2023 at p 16 lines 12–14.As pointed out by counsel for LPQ and HXD, it seemed strange for Mdm Ding to now take the position that the Agreement was for an investment when all along in her earlier affidavit dated 26 April 2022 she had described the Agreement as for a “loan”.107Foot Note 107×Certified Transcript 19 September 2023 at p 23 lines 7–19.Mdm Ding conceded that she did not indicate in her earlier affidavit that the money advanced by the plaintiffs was an “investment”.108Foot Note 108×Certified Transcript 19 September 2023 at p 20 line 25 to p 21 line 17.This change in position was described by counsel for LPQ and HXD to be “inconsistent” and “contradictory”.109Foot Note 109×Certified Transcript 19 September 2023 at p 23 lines 11–14. 76 In answering the question of whether the Agreement was for a loan or an investment, the first port of call must necessarily be the written terms of the Agreement. For ease of reference, I reproduce below the Agreement as exhibited in the Agreed Bundle of Documents with the parties’ identification numbers redacted.110Foot Note 110×1AB27.  77 Two points may be distilled from the wording of the Agreement. First, the parties to the Agreement are expressly stated to be the plaintiffs (ie, Mr Peck and Mdm Ding) and HXC. Second, the term “loan” has been consistently used throughout the document.111Foot Note 111×2&4DCS at para 27.Based on a plain reading of the Agreement, it appears that the parties had entered into a loan agreement as opposed to an investment agreement.112Foot Note 112×2&4DCS at para 28.Could the term “loan” then be interpreted to mean an investment? It is helpful, at this juncture, to set out the approach to contractual interpretation that is applied by our courts. 78 In applying the contextual approach to contractual interpretation, the court will first consider the plain language of the contract and the admissible extrinsic material that is objective evidence of its context: seeZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich”) at [130]. The Court of Appeal has summarised the principles inCIFG Special Assets Capital I Ltd (formerly known as Diamond Kendall Ltd) v Ong Puay Koon and others and another appeal[2018] 1 SLR 170 at [19]: … (a) The starting point is that one looks to the text that the parties have used (seeLucky Realty Co Pte Ltd v HSBC Trustee (Singapore) Ltd[2016] 1 SLR 1069 at [2]). (b) At the same time, it is permissible to have regard to the relevant context as long as the relevant contextual points are clear, obvious and known to both parties (seeZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 at [125], [128] and [129]). (c) The reason the court has regard to the relevant context is that it places the court in “the best possible position to ascertain the parties’ objective intentions by interpreting the expressions used by [them] in their proper context” (seeSembcorp Marine Ltd v PPL Holdings Pte Ltd[2013] 4 SLR 193 at [72]). (d) In general, the meaning ascribed to the terms of the contract must be one which the expressions used by the parties can reasonably bear (see,eg,Yap Son On v Ding Pei Zhen[2017] 1 SLR 219 at [31]). 79 While the plain language of the contract is undoubtedly the first port of call, there may be cases where the plain language of the contract leads to an absurd result based on the objective evidence available. This is a strong indication that the text is probably inconsistent with the relevant context: seeY.E.S. F&B Group Pte Ltd v Soup Restaurant Singapore Pte Ltd (formerly known as Soup Restaurant (Causeway Point) Pte Ltd)[2015] 5 SLR 1187 (“Soup Restaurant”) at [31]. The question then arises as to whether, having had regard to the relevant context, the intention of the parties and their subsequent conduct, the text on a re-examination is in fact as plain and unambiguous as it was originally thought to be. While there may be exceptional cases where the text is so clearly plain and unambiguous that the court is compelled to give effect to the meaning contained therein, notwithstanding that an absurd result would ensue, this would be an “extremely rare situation”, because the law should generally lead to a just and fair result (as opposed to an absurd one): seeSoup Restaurantat [31]. 80 In light of the relevant principles above, I am satisfied that the usage of the term “loan” in the Agreement does not mean that the parties had intended for the transaction to be structured by way of a loan. Rather, the parties intended the Agreement to be for an investment in the 10JS Project. While at first glance the plain meaning of the term “loan” appears to be clear and unambiguous, adopting this interpretation would appear to be completely contrary to the intention of the parties and their conduct and expectations. First and foremost, adopting the plain reading of the term “loan” would lead to the strange result that HXC is loaning toitselfthe sum of $1.36m. Secondly, nowhere in the Agreement is an interest rate stipulated, which is odd had the parties intended the Agreement to operate as a loan. It was highly unlikely, based on the relationship between the plaintiffs and LPG up to that point, that the plaintiffs would have extended an interest-free loan to HXC. After all, the relationship between the plaintiffs and LPG was that of one between a client and a contractor. At that time, LPG had only been engaged by the plaintiffs to carry out the rebuilding of their house at Lucky Heights.113Foot Note 113×AEIC Ding at para 19.There was nothing to indicate that the plaintiffs, LPG and HXC were in a relationship of such closeness as to justify a purported extension of an interest-free loan by the plaintiffs. I accept the evidence of Mdm Ding that LPG had specifically told them that he was prepared to share 20% of HXC’s $1.7m stake in the 10JS Project with the plaintiffs if they had paid a sum of $340,000.114Foot Note 114×AEIC Ding at para 26. 81 On the contrary, it appears that the usage of the term “loan” is not as clear and unambiguous as it would appear at first glance. Indeed, the fact that the Agreement sets out the “percentage of the Loan” as between the plaintiffs and HXC to be in the ratio of 20:80 supports the view that the Agreement ought to be interpreted as one of the plaintiffs purchasing 20% of HXC’s existing stake in the 10JS Project in exchange for the sum of $340,000. This would be in the nature of an investment since the plaintiffs would be acquiring an interest in HXC’s stake in the 10JS Project. Based on the final returns of the 10JS Project, the plaintiffs would thereby receive a 20% share in whatever profit (or loss) that accrue to HXC. 82 I note that the plaintiffs may be right that the Defence filed by LPG and HXC is aligned with the plaintiffs’ case that the parties to the Agreement intended the sum of $340,000 to be an investment, and not a loan.115Foot Note 115×PRS at para 7.As can be seen from the Defence of LPG and HXC, the following points were made which showed that LPG and HXC understood the Agreement to be an investment: (a)  “At that material time, the Plaintiffs had just sold their condominium and they had some spare cash which they were interested ininvesting.” [emphasis added]116Foot Note 116×1st and 3rd Defendants’ Defence dated 23 March 2022 (“1&3DD\") at para 5.3. (b) “The Plaintiffs then approached LPG toinvestthe sum of S$340,000.00 (“Investment Sum”) towards the amount which HXC had alreadyinvestedinto the [10JS Project] (i.e. S$1,700,000.00) with HXD in the manner as explained in paragraph 5.5 of this Defence above. …” [emphasis added]117Foot Note 117×1&3DD at para 5.7. (c)  “As the Plaintiffs, LPG and HXC (the “parties”) did not know ultimately how much the [10JS Project] would be sold for, the parties thenpegged the return for the said Investment Sum at 20% of the net profit of HXC’s share of the[10JS Project] …” [emphasis added].118Foot Note 118×1&3DD at para 5.8. 83 However, these are the parties’ subjective understanding of the meaning of the terms under the Agreement and may not be relevant to the objective approach to contractual interpretation. 84 I note that Mdm Ding had, during the trial, pointed to a series of e-mails where the plaintiffs had corresponded with LPG on the basis that the Agreement was for an investment.119Foot Note 119×Certified Transcript 19 September 2023 at p 20 line 25 to p 21 line 4, p 22 line 23 to p 23 line 1; AEIC Ding at p 141.I agree with Mdm Ding that these e-mails do show that the parties had communicated on the basis that the plaintiffs had invested in the 10JS Project. In an e-mail dated 11 May 2021, the plaintiffs had sent the following to HXC (addressed to LPG):120Foot Note 120×2AB67. On 18 Aug 2018, we have a contract agreement with you to invest S $340,000,00 [in the 10JS Project], promised return interests 20-25% after sold this property. Understand this properties 10 and 10A were sold. So I am here to check the status when can you return us the investment and profits? 85 Annexed to this e-mail was a photograph of what appears to be the hardcopy print-out of the Agreement. In a subsequent follow-up e-mail dated 15 September 2021 from the plaintiffs to HXC (addressed to LPG), the plaintiffs sought a “confirm[ation] [on] the status of [the 10JS Project] and when can we get ourinvestmentcost + interests + profits after you sold the 10 and 10A… jalan shaer [properties]” [sic] [emphasis added].121Foot Note 121×2AB67. 86 By relying on the e-mails set out above, I note the plaintiffs are essentially attempting to admit the subsequent conduct of the parties in aid of their preferred interpretation. This raises the issue of whether subsequent conduct is admissible for the purpose of interpreting a contract. As stated by the Court of Appeal inSimpson Marine (SEA) Pte Ltd vJiacipto Jiaravanon[2019] 1 SLR 696 (“Simpson Marine”) at [78], the admissibility and relevance of subsequent conduct in the interpretation of contracts has yet to receive detailed scrutiny by the Court of Appeal. This was notwithstanding the court’s earlier tentative views inZurichat [132(d)] in that while there is no absolute prohibition against evidence of subsequent conduct in interpreting a contract, the courts should be circumspect in the consideration of subsequent conduct where such evidence does not “elucidate the parties’ objective intentions or relate to a clear and obvious context”: seeSimpson Marineat [78]. It seems that these e-mails do appear toconfirmthe plaintiffs’ case that the Agreement had been structured as an investment. These e-mails satisfy the requirements of being relevant, reasonably available to the parties, and relate to a clear and obvious context of the returns promised by LPG to the plaintiffs. 87  I am satisfied that the following interpretation of the Agreement best gives effect to the objective intention of the parties: HXC was to sell 20% of its stake in the 10JS Project to the plaintiffs in exchange for the latter’s payment of a sum of $340,000. This is in effect an investment by the plaintiffs in the 10JS Project which has the effect of the plaintiffs sharing in 20% of any profit or loss from HXC’s share of the returns in the 10JS Project. I would add that this interpretation accords with Mdm Ding’s evidence in court that she had not given much thought to the distinction between a loan and an investment at the time of signing the Agreement and that she had all along proceeded on the assumption that the term “loan” referred to an investment.122Foot Note 122×Certified Transcript 20 September 2023 at p 58 lines 20–21.On this basis, I am cognisant that the Agreement was not drafted by or with the aid of legally trained persons. The scrutiny of the parties’ usage of the term “loan” should not be subject to legalese interpretation. Indeed, this approach is supported by the following statements of principle by Goh Yihan JC (as he then was) inCompass Consulting Pte Ltdv Lim Siau Hing (alias Lim Kim Hoe) and another[2023] SGHC 17 at [34] regarding the approach to be taken in interpreting contracts drafted by laypersons: ... when the documents being interpreted are not drafted by lawyers, the interpretative exercise must be undertaken in broad strokes and not with minute precision. It is trite that non-legally trained persons cannot “be expected to have expressed themselves with the exactitude that might be expected of experienced legal draftsmen”, and thus, it is appropriate to adopt a “common sense approach” to interpreting the agreement rather than a “technical and legalistic approach” with an excessive focus on structure and language (see the decision of the Court of Appeal inYap Son On v Ding Pei Zhen[2017] 1 SLR 219 at [74]; see also the High Court decision ofSun Electric Pte Ltd and another vMenrva Solutions Pte Ltd and another[2021] 5 SLR 648 at [41]) ... 88 For the above reasons, I am of the view that this is not an “extremely rare situation”, to borrow the words of the Court of Appeal inSoup Restaurant, where the text is so clearly plain and unambiguous that the court is compelled to give effect to the meaning contained therein, notwithstanding that an absurd result would ensue. 89 For completeness, I wish to add that I am conscious that the way the term “loan” had been used in the Agreement is strikingly similar to the director’s resolutions of HXD dated 23 July 2018 in respect of the investment in the projects comprising the 10JS Project (ie, the 2018 HXD Resolution) and the Fidelio Street project (the “FS Project”) by the shareholders of HXD and LPQ. Due to this similarity, it is likely, as the plaintiffs contend,123Foot Note 123×PCS at para 65(3)(a).that these resolutions have been used as a template in the drafting of the Agreement. In these resolutions, notwithstanding the fact that the respective financial contributions of the shareholders of HXD and LPQ had been described as a “loan”, LPQ and Mr Yam have said that it was the understanding of the shareholders in HXD that the term “loan” is to be interpreted as an investment; the shareholders accepted that they would share in any profit or bear the loss from the sale of these projects.124Foot Note 124×Certified Transcript 21 September 2023 at p 34 lines 4–11; AEIC LPQ at paras 34(e)–34(f); AEIC of Yam Tie Chuan dated 10 August 2023 (“AEIC Yam”) at paras 25(d)–18(e).The plaintiffs also said LPG had shown the plaintiffs a copy of the 2018 HXD Resolution setting out the respective financial contributions of the investors in the 10JS Project.125Foot Note 125×AEIC Ding at para 24.",
        "Whether the plaintiffs are contractually entitled to receive a minimum of 20% returns from HXC": "90 Next, the plaintiffs have claimed against the defendants for the payment of the sum of $408,000, which comprises the Investment Sum of $340,000plusan additional 20% returns of $68,000.126Foot Note 126×SOC No. 2 at p 21.Therefore, the question of whether there is any basis for this claim arises for my consideration. The express terms of the Agreement are straightforward: the plaintiffs and HXCare stated expressly to be the contractual parties. Accordingly, the plaintiffs should look towards HXC, and not LPQ or HXD, for their contractual claim under the Agreement. The issue, therefore, is whether the plaintiffs can succeed in their claim for the sum of $408,000, being the Investment Sum and theadditional“promised profits of minimally at least 20%”,127Foot Note 127×PCS at para 65(3).ie, $68,000 against HXC. Indeed, the plaintiffs’ SOC No. 2 under the heading titled “CLAIM AGAINST HXC FOR BREACH OF THE AGREEMENT” shows that they are pleading for the 20% returns of $68,000 as against HXC specifically.128Foot Note 128×SOC No. 2 at para 22. 91 On this issue, it appears that the parties did not intend for the written terms of the Agreement to reflect all the terms of the contract between the plaintiffs and HXC. The evidence shows that the Agreement was hastily prepared by a layperson who was a staff of LPG in around five minutes and appears to be a barebone one-page document.129Foot Note 129×AEIC Ding at paras 30–31; Certified Transcript 19 September 2023 at p 58 lines 23–25.The Agreement merely reflects the Investment Sum to be paid, and that the investment related to 20% of HXC’s $1.7m stake in the 10JS Project (see above at [76]). It is apparent from the face of the Agreement that the terms one would typically find in an investment agreement are absent. For example, there are no provisions regardingwhenor towhompayment of the Investment Sum was to be made. It is the evidence of the plaintiffs that LPG had verbally told them to make payment to HXD, a provision not stated on the face of the Agreement.130Foot Note 130×AEIC Ding at para 33.Accordingly, the contract between the plaintiffs and HXC appears not to be one that is fully captured within a written agreement. Rather, it is one that is partly oral and partly written. 92 The question then is whether there was anoralagreement between the plaintiffs and HXC that the plaintiffs would be guaranteed a 20% returns on the Investment Sum. The burden of proving this agreement lies squarely on the plaintiffs. This is provided for under s 105 of the Evidence Act 1893 (2020 Rev Ed), which states that the “burden of proof as to any particular fact lies on that person who wishes the court to believe in its existence …”. 93 As stated inThong Soon Seng v Magnus Energy Group Ltd[2023] SGHC 5 at [16], “[i]n a civil action, it is in the pleadings that each party sets out, whether by way of claim or defence, the facts which it wants the court to believe to be true”. Accordingly, it is necessary to review the pleadings to discern what exactly have been pleaded by the plaintiffs and for which it is necessary for them to prove. I note that the plaintiffs’ SOC No. 2 curiously describes the 20% returns as an “interest” under the Agreement. There, the plaintiffs state that they are “seek[ing] payment of the principal plus interest under the Agreement (i.e.$340,000 plus 20% ie $68,000).”131Foot Note 131×SOC No. 2 at para 22.The description of the 20% returns as “interest” on the Agreement could perhaps be explained by the manner in which the plaintiffs had pleaded the Agreement in the previous version of their SOC No. 1 where they had proceeded on the basis that the Agreement was made in the nature of a loan (with the interest rate pegged at 20%) rather than an investment.132Foot Note 132×Seeeg, SOC No. 2 at para 25(a) (“payment of the principal plus interest under the Loan Agreement (i.e. $340,000 plus 20%, i,e $68,000)”).Notwithstanding the ambiguity within the plaintiffs’ pleadings, I am prepared to read the plaintiffs’ pleadings charitably to mean that there had been an oral agreement formed between the plaintiffs and LPG for a 20% returns of the Investment Sum upon the maturity of the investment under the Agreement. 94 I am satisfied that the plaintiffs have proven that it was more likely than not that there was an oral agreement between the plaintiffs and LPG that the 10JS Project would minimally yield a 20% profit for the plaintiffs. According to the plaintiffs, they recall LPG telling them that the 10JS Project would minimally yield a 20% profit when the 10JS Project was sold after redevelopment.133Foot Note 133×AEIC Ding at paras 24 and 26; Certified Transcript 19 September 2023 p 64 lines 19–20; Certified Transcript 20 September 2023 p 75 lines 18–22.Furthermore, the plaintiffs would be paid upon obtaining the TOP of the 10JS Project.134Foot Note 134×AEIC Ding at para 27.As LPG was not called as a witness in these proceedings, the only evidence shedding light on the discussions between the plaintiffs and LPG is the one-sided and potentially self-serving evidence from the plaintiffs. Nonetheless, I am prepared to accept that this was, in fact, communicated by LPG and that this had been the subject of an oral agreement between the plaintiffs and HXC. 95 Subsequent e-mails exchanged between LPG and the plaintiffs support my finding that there had been an oral agreement for the plaintiffs to receive at least 20% returns on their Investment Sum. This is essentially an issue concerning the admissibility of subsequent conduct for the purposes of determining the formation of a contract. According toChitty on Contracts(Hugh Beale gen ed) (Sweet & Maxwell, 33rd Ed, 2019) at para 13-136, subsequent conduct may be admissible in the determination of whether a contract has been formed and its terms. However, I note in this regard that the permissibility of admitting subsequent conduct for the purposes of ascertaining the formation of a contract is unsettled in Singapore. The Court of Appeal inSimpson Marinehad observed at [78] that “where the court is ascertaining whether a contract has beenformed, evidence of subsequent conduct has traditionally been regarded as admissible and relevant, although there is some instability in this rule” [emphasis in original]. However, the court there also noted that “[t]he admissibility and relevance of subsequent conduct in the formation and interpretation of contracts has yet to receive detailed scrutiny by this court.” In the decision of the Court of Appeal inThe “Luna”and another appeal[2021] 2 SLR 1054 (“Luna”) at [34], the court appears to have aligned itself in favour of the admissibility of subsequent conduct to aid in the ascertainment of the formation of a contract. The court stated that the distinction in approach to the consideration of subsequent conduct between cases involving the interpretation of contracts and cases involving the formation of contracts is “justified on the basis of principle and authority”. In making this observation, the court cited its earlier observations inSimpson Marineat [78] that evidence of subsequent conduct has traditionally been regarded as admissible and relevant where the court is ascertaining whether a contract has been formed. 96 I am satisfied that the e-mail dated 11 May 2021 which the plaintiffs had sent to HXC seeking the payment of the “promisedreturn interests 20-25%” [emphasis added] isconfirmationof an agreement having been reached for the minimal payment of a 20% returns.135Foot Note 135×2AB68.I note that LPG, in his reply dated 16 September 2021, did not dispute the plaintiffs’ assertion that a promise had indeed been made for a minimum 20% returns.136Foot Note 136×2AB67.Instead, LPG appeared to have accepted that this was in fact the promised returns when he stated that “the amount will be paid by end of December 2021”.137Foot Note 137×Ibid.This is supported by the evidence of Selvaraj Narendran (“Mr Narendran”), who was employed as a junior quantity surveyor in HXC.138Foot Note 138×AEIC of Selvaraj Narendran dated 9 August 2023 (“AEIC Narendran”) at para 5.According to him, after receiving a chaser from the plaintiffs for payment on 27 December 2021, LPG had told Mr Narendran to ignore the plaintiffs’ e-mail as the 10JS Project had yet to obtain TOP so the proceeds of sales could not be distributed and that the plaintiffs’ request for payment was premature.139Foot Note 139×AEIC Narendran at para 36.What is material is that LPG didnotdeny that HXC owed the plaintiffs the claimed sums. 97 For the reasons above, I find that the Agreement is structured in the manner of an investment. Furthermore, the Agreement does not capture the full terms of the contract between the plaintiffs and HXC such that the contract between the plaintiffs and HXC is partly oral and partly written. On this basis, I find that the plaintiffs are entitled under an oral agreement for 20% returns on the Investment Sum paid by the plaintiffs.",
        "Claims for fraudulent misrepresentation": "98 The plaintiffs allege that LPG had made a series of fraudulent misrepresentations to the plaintiffs to induce them to enter into the Agreement to invest in the 10JS Project.140Foot Note 140×SOC No. 2 at paras 10–12, 17–18.Before turning to the specific misrepresentations alleged to have been made, I shall set out the relevant legal principles to establish a claim for fraudulent misrepresentation. 99 The elements to ground a claim for fraudulent misrepresentation were set out inPanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 (“Panatron”) at [14]. The plaintiffs must show that: (a) LPG made a false representation of fact to the plaintiffs;(b) the representation was made with the intention that the plaintiffs would act on it;(c) the plaintiffs acted in reliance on the misrepresentation;(d) the plaintiffs suffered damage on reliance of the misrepresentation; and(e) LPG made the false representation knowing that it was false or in the absence of any genuine belief that it was true. 100 The plaintiffs submit that LPG made his representations fraudulently, and either knowing that they were false and untrue, or recklessly not caring whether they were true or false with a view to induce the plaintiffs to transfer the Investment Sum to HXD.141Foot Note 141×SOC No. 2 at para 18.The plaintiffs aver that LPG’s intention in inducing the plaintiffs to enter into the Agreement was to obtain the Investment Sum and utilise it for purposes other than for the 10JS Project.142Foot Note 142×Ibid. 101 The plaintiffs rely on a long list of misrepresentations which they allege had been communicated by LPG. These are as follows:143Foot Note 143×SOC No. 2 at paras 9–10. (a) the 10JS Project was owned by HXD;(b) LPG was in charge of the FS Project and the 10JS Project, and he was the one who decided when and how much to sell the FS Project and the 10JS Project;(c) LPG was in control of both HXC and HXD;(d) LPQ was his brother, and LPQ was in charge of fund-raising from his friends for HXD, and LPQ had left him (ie, LPG) fully in charge of the FS Project and the 10JS Project;(e) HXD was set up as a vehicle in October 2017 to enable LPG to upscale and become engaged in real estate development (in addition to being a builder);(f) HXC could benefit from the FS Project and the 10JS Project by undertaking the construction works as the main contractor and taking a share in these projects;(g) HXC had invested $1.7m for a stake in the 10JS Project with other investors (the breakdown of which is per the 2018 HXD Resolution that was shown briefly to the plaintiffs);(h) the 10JS Project would be very profitable, and if the plaintiffs invested in the 10JS Project, the plaintiffs would be given a minimum profit of 20-30% once the redeveloped 10JS properties were sold (ie, at least $68,000 to $102,000 in profit for the Investment Sum);(i) the money provided by the plaintiffs would only be utilised solely and exclusively for the 10JS Project; and(j) the 10JS Project would obtain its TOP within two years and the plaintiffs would be paid upon obtaining the TOP. Whether the misrepresentations were in fact made by LPG 102 The only evidence that the alleged misrepresentations were made came from the testimonies of the plaintiffs. I am mindful of the high evidential standard that is applicable to any claim for fraud. The standard of proof for deceit is that of the civil standard, but the fact of fraud is not easily established. As recognised by the Court of Appeal inWeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 at [30]–[31], the allegation of fraud is a serious one and generally speaking, the graver the allegation, the more the party, on whose shoulders the burden of proof falls, may have to do if he hopes to establish his case. There is corroborative evidence in relation to some of the representations, namely those found in [101(g)], [101(h)] and [101(j)], as there is supporting documentary evidence such as the Agreement recording HXC’s contribution of $1.7m.144Foot Note 144×1AB27.There is also subsequent correspondence between the the plaintiffs and LPG showing that payment would be made upon obtaining TOP and that the promised returns ranged from 20 to 25%,145Foot Note 145×2AB67–68.which implies that these representations had been made. Thus, there is sufficient evidence to suggest that the representations were made to the plaintiffs by LPG. 103 Some of the representations, for instance in [101(a)] and [101(g)], do not amount to actionable misrepresentations as they are true events. The 10JS Project was in fact owned by HXD in so far as HXD had been incorporated as an investment holding company for the 10JS Project.146Foot Note 146×AEIC LPQ at para 93(b).It is also true that HXC had invested $1.7m for a stake in the 10JS Project with other investors as can be seen from the 2018 HXD Resolution.147Foot Note 147×1AB20. 104 The representations in [101(f)], [101(i)], [101(h)] and [101(j)] are also not actionable misrepresentations for the following reasons: (a) The representation in [101(f)] is a statement of opinion and it also contains true facts made by LPG that HXCcouldbenefit from the FS Project and the 10JS Project by undertaking the construction works as the main contractor and taking a share in these projects. (b) As for the representation in [101(i)], this is, at best, a statement of intention by LPG that he would utilise the money solely and exclusively for the 10JS Project. Statements of fact must be distinguished from statements as to future intention, predictions, statements of opinion or belief, sales puffs, exaggerations and statements of law, all of which do not give rise to actionable misrepresentation: seeKong Chee Chuiand others v Soh Ghee Hong[2014] SGHC 8 at [4]. Based on the evidence adduced, there is simply nothing to suggest that LPG did not hold this belief at the time when the representations were purportedly made. Moreover, the plaintiffs are unable to adduce evidence directly or indirectly that the Investment Sum was used for purposes other than for the 10JS Project. (c) It is axiomatic that to establish an actionable misrepresentation, there must be a false statement of existing or past fact made by the representor: seeLim Koon Park and another v Yap Jin Meng Bryan and another[2013] 4 SLR 150 at [38]. The representations in [101(h)] and [101(j)] are not statements of a present or past fact. Rather, they are an assessment of future events regarding the plaintiffs’ Investment Sum being given a minimal 20% returns and that the plaintiffs would receive payment when the 10JS Project obtains its TOP, which LPG predicted would occur in two years. 105 The contentious representations are those in [101(b)], [101(c)], [101(d)] and [101(e)]. In assessing whether these representations were false, the key issue is: was LPG in control ofbothHXC and HXD at the material time when the plaintiffs had entered into the Agreement? The plaintiffs allege that LPG’s control over the operations of HXC and HXD was a “significant factor” that the plaintiffs considered when deciding to invest in the 10JS Project.148Foot Note 148×AEIC Ding at para 58(h).Was LPG actually in control of HXC and HXD on 18 August 2018 when the plaintiffs signed the Agreement? I pause to mention that the determination of this issue will be relevant for the analysis in relation to the plaintiffs’ other substantive claims such as dishonest assistance or knowing receipt.",
        "Whether LPG was in control of HXC": "LPQ’s assumption of sole directorship in HXC 106 In respect of the question of whether LPG was in control of HXC, I find that this was more likely the case than not. It appears that on 18 August 2018, the sole director in HXC was LPQ (see Annex 1).149Foot Note 149×SOAF at para 6(5).At that time, LPG was the largest shareholder in HXC with 250,000 shares.150Foot Note 150×SOAF at para 6(6).The other shareholders of HXC were LPQ and Luo Hai Xia (LPG’s wife), who each held 200,000 shares.151Foot Note 151×Ibid.Thus, LPG and his wife held 450,000 shares out of HXC’s total 650,000 issued shares, representing almost a 70% shareholding in HXC. Moreover, based on the evidence of LPQ, it appears that LPG was thede factocontroller of HXC. In particular, LPQ testified that after joining HXC in August 2017, he had been told by LPG that LPG would make LPQ a director and shareholder of HXC.152Foot Note 152×AEIC LPQ at para 13.LPQ had in fact been made a shareholder of HXC holding 200,000 shares on 1 August 2017 and thereafter was made the sole director on 4 August 2017.153Foot Note 153×SOAF at paras 6(3)–(4).LPQ did not pay for his shares in HXC.154Foot Note 154×Certified Transcript 21 September 2023 at p 14 lines 17–23.It is material to note that immediately prior to LPQ’s assumption of his directorship and shareholding, LPG had been thesoledirector of HXC.155Foot Note 155×SOAF at para 6(2).The conclusion to be drawn from this is that at least up to the point that LPQ had assumed both his directorship and shareholding, LPG was in control of HXC. As can be seen from the director’s resolution dated 4 August 2017, it was by the authority of LPG as director that LPQ was appointed a director of HXC and given shares in HXC.156Foot Note 156×1AB3. LPG’s continued control of HXC after LPQ’s assumption of sole directorship 107 The issue is whether LPG hadcontinuedto retain his control over HXC right up to 18 August 2018 when the Agreement was made, notwithstanding that LPQ had since been made HXC’s sole director (as of 4 August 2017) and a shareholder (as of 1 August 2017). The evidence shows that LPG was still in control of HXC and continued to make all decisions relating to HXC. For example, the Agreement had been purportedly made on behalf of HXC by LPG on 18 August 2018. In fact, LPG had held himself out as the “director” of HXC when he signed the Agreement with the plaintiffs.157Foot Note 157×1AB27.This was notwithstanding the fact that LPQ was actually the only director of HXC at that time. According to LPQ, he had no knowledge of the existence of the Agreement.158Foot Note 158×AEIC LPQ at para 81(c).Similarly, the plaintiffs accept that LPQ had never dealt with the plaintiffs prior to the commencement of the present suit, as observed from Mdm Ding’s response during cross-examination:159Foot Note 159×Certified Transcript 19 September 2023 p 52 lines 14–20. Q. No, Ms Ding, my question is very simple. Did you believe, before commencing these proceedings, that LPQ owed you any monies? A. No. Q. And agree that all times, up to the commencement of this suit, you have never dealt with LPQ? A. Yes. 108 The only time when the plaintiffs had a brief encounter with LPQ was at a worksite located along Frankel Drive when one of the workers on-site was injured.160Foot Note 160×Certified Transcript 20 September 2023 at p 55 lines 12–16.Even then, according to Mdm Ding, the plaintiffs did not have the opportunity to speak to LPQ as he was busy conveying the injured worker to the hospital.161Foot Note 161×Certified Transcript 20 September 2023 at p 55 lines 17–23. 109 Furthermore, I note that despite being the sole director of HXC, LPQ was never a bank signatory of HXC’s bank accounts nor granted access to HXC’s bank accounts.162Foot Note 162×AEIC LPQ at para 16.This is corroborated by Mr Narendran who stated that LPG controlled and managed the finances of HXC and was its sole signatory.163Foot Note 163×AEIC Narendran at para 8.Mr Narendran’s testimony in this regard is particularly probative as he said he wrote cheques to suppliers and sub-contractors of HXC for LPG to sign.164Foot Note 164×Ibid.Clearly, LPG was in control of HXC’s bank accounts. After LPQ had handed over two cash cheques totalling a sum of $340,000 (comprising the sums of $150,000 and $190,000) to LPG, these same cash cheques were banked directly into HXC’s bank account on 25 and 28 August 2018, respectively.165Foot Note 165×AEIC LPQ at para 45. 110 Lastly, there is no evidence to show that LPQ had made any decisions in respect of HXCdespitehis status as the sole director of HXC. According to LPQ, notwithstanding the fact that he had been made the sole director of HXC between 4 August 2017 and 11 October 2019, LPG retained the ability to “do what he liked in the name of HXC”.166Foot Note 166×Certified Transcript 21 September 2023 at p 37 lines 1–8.The conclusion to be drawn therefore was that LPG remained in control of HXC. According to LPQ, he did not know that LPG had even resigned as a director of HXC and that LPQ had become the sole director of HXC.167Foot Note 167×AEIC LPQ at para 14.He realised this only much later in early October 2019.168Foot Note 168×Ibid.LPQ testified that this arrangement,ie, for him to assume the sole directorship of HXC, was not what LPG and he had agreed to. Instead, LPQ had agreed to be employed by HXC to assist LPG in supervising HXC’s workers.169Foot Note 169×AEIC LPQ at para 15. 111 From the foregoing analysis, I am satisfied that LPG was in control of HXC and that there was no misrepresentation on this basis. LPG is the alter ego of HXC 112  The plaintiffs’ pleaded case is that LPG is the alter ego of HXC.170Foot Note 170×SOC No. 2 at para 32.I set out the relevant principles on the piercing of the corporate veil on the ground that a defendant is the alter ego of a company. InAlwieHandoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 (“Alwie”) at [96], the Court of Appeal stated that the key question is “whether the company is carrying on the business of its controller”.Alwiewas an appeal from the High Court decision ofTjong VerySumito and others v Chan Sing En and others[2012] 3 SLR 953. In that case, the fifth defendant, Alwie, had absolute control of OAFL, the party to the agreement with the plaintiff. Alwie asserted that he was entitled to the money payable under the agreement, transferred money payable to OAFL to himself, treated OAFL’s bank account (into which other money was paid by the plaintiff) as his personal account, and spoke entirely for OAFL in the proceedings. The trial judge considered that Alwie had used OAFL as an extension of himself. On appeal, this conclusion was upheld by the Court of Appeal. In the Court of Appeal’s view, Alwie “made no distinction between himself and OAFL” in relation to the agreement with the plaintiff: seeAlwieat [99]–[100]. Returning to this case, at the material time of the plaintiffs’ Agreement (ie, 18 August 2018), LPG’s conduct in relation to HXC parallels that of Alwie in relation to OAFL inAlwie. LPG appeared to make no distinction between himself and HXC in his dealings with external parties. Notwithstanding that LPQ was the sole director of HXC at the material time, the only role that LPQ played in HXC was to help LPG supervise the workers of HXC.171Foot Note 171×AEIC LPQ at para 15.In contrast, LPG, at all times, was in control of HXC, a point corroborated by Mr Narendran, an employee of HXC.172Foot Note 172×AEIC Narendran at para 8.For example, he appears to have been in control of HXC’s bank accounts (see above at [109]). Hence, I find that LPG is also the alter ego of HXC. This being the case, references to LPG henceforth should also be taken to refer to HXC. Thus, there is no misrepresentation by LPG that he was in control of HXC.",
        "Whether LPG was in control of HXD": "113  One of the main thrusts of the plaintiffs’ claim in misrepresentation appears to be that the representation by LPG that he was in control of HXD is a false statement of fact. In other words, the plaintiffs are alleging that LPG wasnotin control of HXD, at least for the purposes of their misrepresentation claim. 114 I pause here to note that this position appears to be at odds with the plaintiffs’ allegation in relation to the other substantive claims (eg, the claim in breach of trust) where the plaintiffs take the contrary position that LPG was in control of HXD for purposes of pinning liability on HXD for the actions of LPG.173Foot Note 173×SOC No. 2 at paras 5(b), 12B and 28(f); PCS at para 3.In any case, it is apparent that the answer to the question of whether LPG is in control of HXD, as a matter of fact, will be critical in relation to not just the plaintiffs’ claim in misrepresentation but also their other claims in trust. The plaintiffs’ allegations in support of LPG’s control over HXD 115 In support of the claim that LPG was in control of HXD, the plaintiffs rely on a broad swath of points which include the following:174Foot Note 174×AEIC Ding at para 58. (a) The OTP for the Original 10JS dated 19 September 2017 was granted to “[LPG] and/or his nominees”,175Foot Note 175×1AB7–12.before HXD was even incorporated. LPQ then exercised it on behalf of HXD as LPG’s nominee on 16 November 2017.176Foot Note 176×1AB12. (b) LPG was the signatory of many high-value transactions of HXD. In particular, he was the one who signed the Transfer Instrument that transferred the Original 10JS from the previous owner to HXD.177Foot Note 177×7AB17. (c) In multiple correspondence between the Urban Redevelopment Authority (the “URA”) and Context Architects Pte Ltd, in which the former updated the latter on the status of the Original 10JS’s planning permission, LPG was named as the developer of the 10JS Project.178Foot Note 178×2AB5–12, 83, 93.LPG was also frequently copied in such correspondence. These include: (i) the Grant of Written Permission dated 10 October 2018;179Foot Note 179×2AB7.(ii) the Extension of Written Permission dated 10 November 2021;180Foot Note 180×2AB15.(iii) the Refusal of Written Permission dated 8 October 2021;181Foot Note 181×2AB83.and(iv) the Grant of Written Permission dated 20 December 2021.182Foot Note 182×2AB94. (d) A document accounting for payments made by HXD on behalf of HXC to HXC’s sub-contractors and suppliers for the 10JS Project and the FS Project shows LPG’s liberal use of HXD’s funds to make payments to HXC’s sub-contractors and suppliers.183Foot Note 183×Agreed Bundle of Documents Vol 9 dated 12 September 2023 190–196.This was done despite the existence of directors’ resolutions which expressly provide for how HXC’s costs of redeveloping the properties are to be accounted for by HXD. These resolutions provided for the construction costs incurred in the 10JS Project and the FS Project to be treated as HXC’s loan to HXD.184Foot Note 184×1AB19–21. (e) LPG was also the one who signed, on behalf of HXD, the OTPs for HXD’s sale of 10 JS, 10A JS and FS.185Foot Note 185×1AB45–49; 57–60; 69–74. (f) LPQ and/or HXD’s directors also deferred to LPG’s decisions in respect of the sale of FS, 10 JS and 10A JS. In relation to FS, LPG was allowed to acquire the property on behalf of HXD without passing any resolution.186Foot Note 186×PCS at paras 29–30.In relation to the sale of the redeveloped 10JS properties, despite the fact that LPG conducted the sale of those properties in mid-2019, a director’s resolution was only signed on 3 May 2021 (about two years later) to ratify the sale of the redeveloped 10JS properties .187Foot Note 187×1AB95–96.The plaintiffs submit that this plainly shows that LPG had the authority and power to act as he liked with regard to the affairs of HXD.188Foot Note 188×PCS at paras 45, 47. (g) The audio messages exchanged between LPQ and LPG over WhatsApp on 7 January 2022 (the “WhatsApp Conversation”) show LPG giving instructions to LPQ on how LPQ and HXD should respond to the claims made against them by Mr Ang in Suit 8.189Foot Note 189×PCS at para 61; 2AB231–232. (h) Based on the People’s Action Party (“PAP”) Jurong Group Representation Constituency (“GRC”) Meet-the-People Session’s letter dated 17 December 2020, it can be seen that LPG had held himself out as the “Managing Director” of HXC and HXD when seeking the assistance of Mr Shawn Huang (“Mr Huang”), the Member of Parliament for Jurong GRC.190Foot Note 190×2AB460.This letter was written by the staff of Mr Huang to request the Immigration & Checkpoints Authority, on LPG’s behalf, to reassess the visa application of one Wang Shuming to permit her entry into Singapore to guide and to manage the installation works in respect of a construction project at Jalan Sampurna, a project undertaken by HXC at that point in time.191Foot Note 191×Ibid. (i) LPG was granted full access to HXD’s available funds, as can be seen from a series of transactions in which HXD had allowed LPG to receive and/or retain a total sum of $1.137m.192Foot Note 192×PCS at paras 48–50; PRS at para 15(2). (j) The acceptance of LPG’s request to be the company secretary of HXD by LPQ and the nine shareholders of HXD.193Foot Note 193×AIEC LPQ at para 25; AIEC Yam at para 17. (k) LPQ’s signing of the Letter of Acceptance dated 25 July 2018194Foot Note 194×1AB465–468.to accept HXC’s quotation dated 25 July 2018 for the construction costs of $1.7m without understanding or paying heed to the documents that were given to him to sign.195Foot Note 195×PCS at paras 31–38.In doing so, LPQ simply acted in accordance with LPG’s instructions. (l) LPQ’s signing of the Confirmation Letter addressed to HXC dated 15 March 2021196Foot Note 196×2AB45.which stated, among other things, that HXC’s “loan amount” of $1.7m for the 10JS Project with profit would be paid to HXC’s OCBC bank account within three days of receipt of sales payment. It appears that LPQ had raised no queries as to why such a letter needed to be signed at that point in time.197Foot Note 197×PCS at paras 39–40. 116 Having considered the above points, I am not satisfied that LPG was, on a balance of probabilities, in control of HXD. The implication of this finding is that LPG is liable for misrepresentation in so far as he had represented to the plaintiffs that he was in control of both HXCandHXD, when LPG was actually only in control of HXC and not HXD. I set out my reasons below. (1) LPG’s purported authority to make important transactions on behalf of HXD 117 With regard to the plaintiffs’ various claims in [115], I shall first address [115(a)], [115(b)], [115(c)], [115(e)], [115(f)], [115(h)], [115(j)], [115(k)] and [115(l)] together as they primarily relate to the allegations that LPG had the purported authority to make important transactions on behalf of HXD. LPQ explained that LPG, in his capacity as the company secretary of HXC, was authorised to deal only with paperwork that were administrative in nature.198Foot Note 198×Certified Transcript 22 September 2023 at p 31 lines 16–20.According to LPQ, the documents referred to by the plaintiffs, although they related to the transfer and purchase of HXD’s investment properties, they were purely administrative matters.199Foot Note 199×Certified Transcript 22 September 2023 at p 32 lines 2–14.Since LPG was the only one with experience in the construction and real estate industry, it made sense for LPQ and the other shareholders of HXD to leave matters relating to the transfer of property to LPG. The various transactions relied on by the plaintiffs must be understood in this light. For example, this explains why LPQ had been content to accede to LPG’s request to be the company secretary of HXD, why LPQ had signed the Letter of Acceptance dated 25 July 2018 accepting HXC’s quotation dated 25 July 2018 for the quoted construction costs of $1.7m and the Confirmation Letter addressed to HXC dated 15 March 2021 without much questioning. 118 However, this did not mean that LPQ had leftallmatters in the hands of LPG. The final say in respect of decisions was at all times within the collective purview of the shareholders of HXD and LPQ, not LPG.200Foot Note 200×AEIC Yam at para 21.It is also the evidence of Mr Yam that the shareholders of HXD and LPQ had only agreed to appoint LPG as the company secretary to deal with administrative affairs and paperwork.201Foot Note 201×AEIC Yam at para 17.LPG was also required to inform the shareholders of HXD and LPQ what documents he had signed.202Foot Note 202×Certified Transcript 22 September 2023 at p 32 lines 17–22.In my view, this is highly probative as to the level of control possessed by LPG. Indeed, LPQ’s evidence that HXD was managed by the shareholders of HXD and LPQ collectively, and the point that LPG was not in control of HXD is corroborated by Mr Yam.203Foot Note 203×AEIC Yam at para 41.This is also supported by the fact that HXD had maintained its own separate bank account, and the signatories of the bank account were LPQ and three other directors of HXD.204Foot Note 204×AEIC Yam at para 20.The fact that control was vested in the shareholders of HXD and LPQ, and not LPG, is consistent with Mr Yam’s testimony that after all, it was the investments of the shareholders of HXD and LPQ which were at stake.205Foot Note 205×AEIC Yam at para 21.They were the ones who had invested large sums of money into HXD to purchase the Original 10JS and to undertake the 10JS Project.206Foot Note 206×Ibid. 119 As for how the OTP for the Original 10JS had come to be issued in the name of LPG and/or his nominees, it was LPG who had obtained the OTPbeforehe had even approached LPQ and the other shareholders of HXD regarding the investment opportunity that is the 10JS Project.207Foot Note 207×AEIC LPQ at para 20.The totality of the evidence does point to the conclusion that the incorporation of HXD – as the corporate vehicle through which the 10JS Project was to be undertaken – was the brainchild of LPG.208Foot Note 208×AEIC Yam at paras 8–16.Even on the plaintiffs’ own case, they do not dispute that the idea of setting up HXD and getting investors to fund the redevelopment projects by HXD was LPG’s idea.209Foot Note 209×PCS at para 4.In fact, it was LPG’s proposal for LPQ and the other shareholders of HXD, such as Mr Yam, to set up a company to purchase the Original 10JS for redevelopment.210Foot Note 210×AEIC LPQ at para 21(a).According to Mr Yam, he thought that this was a good idea because the investors’ interests would be protected as the property would be owned and held by HXD.211Foot Note 211×AEIC Yam at para 15(b).Should anything happen to LPG and/or HXC, their investment would be protected as the property (iethe Original 10JS) would still be owned by HXD.212Foot Note 212×Ibid.Furthermore, I note in passing that the fact that the 10JS Project was the brainchild of LPG is consistent with the minor point that HXD, in a similar fashion to HXC, was named after LPG’s wife, Luo Hai Xia. LPQ’s evidence is that LPG’s proposal to incorporate HXD for the purposes of undertaking the 10JS Project was discussed among the shareholders of HXD and LPQ and that it was ultimately their decision to adopt LPG’s proposal.213Foot Note 213×AEIC LPQ at para 22.This was also the evidence given by Mr Yam.214Foot Note 214×AEIC Yam at paras 8–16.Most importantly, this understanding continued throughout LPG’s dealings with LPQ and HXD, with LPG being left to deal with the execution of the collective decisions of HXD’s shareholders and LPQ.215Foot Note 215×AEIC Yam at para 21. 120 I shall now deal with the plaintiffs’ reliance on the various letters from URA providing updates on the status of the Original 10JS’s planning permission. These documents do not show that LPG was in control of HXD. While various letters from URA had stated LPG in the field labelled “Name of Developer”, these letters were addressed to Context Architects Pte Ltd and not LPG.216Foot Note 216×2AB5,15,17,83; Certified Transcript 20 September 2023 at p 15 lines 1–5.LPG had merely beencopiedin these letters. LPG was, on the dates of these letters (ieOctober 2018, October 2021 and December 2021), the company secretary of HXD (See Annex 1). There was nothing suspicious in LPG having been copied in these letters.217Foot Note 217×Certified Transcript 20 September 2023 at p 15 lines 19–21.Furthermore, as I have found (see above at [117]), LPQ and the shareholders of HXD had been content to leave the administrative matters involving paperwork to LPG owing to their lack of experience in the real estate industry. I am satisfied that LPG’s listing of his name as the developer in the letters seeking planning permission from URA for the redevelopment of the Original 10JS would in any event constitute such an administrative matter which LPQ and the shareholders of HXD had left in the hands of LPG. Therefore, this wouldnotbe probative as to the level of control held by LPG in HXD. 121 I shall now deal with the PAP Jurong GRC Meet-the-People Session’s letter where LPG had represented that he was the “Managing Director” of HXC and HXD.218Foot Note 218×2AB460; Certified Transcript 26 September 2023 at p 55 lines 10–15.This letter alone does not indicate that LPQ and/or HXD authorised LPG to mention that he was the “Managing Director” of HXC and HXD. As LPQ explained under cross-examination, this letter was plainly a representation made by LPG himself and did not involve LPQ and/or HXD.219Foot Note 219×Certified Transcript 26 September 2023 at p 55 lines 10–15.In fact, the plaintiffs did not adduce any evidence that LPQ and/or HXD gave such authorisation to LPG. (2) LPG’s purported liberal use of HXD’s funds 122 In relation to [115(d)] and [115(i)], the plaintiffs allege that first, the document accounting for payments made by HXD, on behalf of HXC, to HXC’s sub-contractors and suppliers for the 10JS Project and the FS Project “shows [LPG’s] liberal use of [HXD’s] funds to make payments to [HXC’s] sub-contractors and suppliers”.220Foot Note 220×AEIC Ding at para 58(d).Second, LPG was granted full access to HXD’s available funds, as can be seen through a series of transactions in which HXD had allowed LPG to receive and/or retain a total sum of $1.137m.221Foot Note 221×PCS at paras 48–52I do not agree with the plaintiffs that this is consistent with LPG’s control over HXD.222Foot Note 222×AEIC Ding at para 58(d).Progress in the 10JS Project had slowed due to HXC’s delays in making payments to its subcontractors and suppliers.223Foot Note 223×AEIC LPQ at para 69; Certified Transcript 21 September 2023, p 67, lines 17–18, p 68 lines 7–9.Thus, according to LPQ, at least in relation to the 10JS Project, HXD (through the contributions of LPQ and its shareholders) had to step in on behalf of HXC to make payment to HXC’s subcontractors and suppliers and enable HXC to complete the 10JS project.224Foot Note 224×Certified Transcript 21 September 2023, p 67 lines 12–16.I accept that these payments were actually payments made out of the own pockets of LPQ and at least “another investor”.225Foot Note 225×AEIC LPQ at para 75.LPQ’s explanation is corroborated by Mr Narendran who testified that LPQ and HXD had to step in on behalf of HXC to make payment to HXC’s sub-contractors in order to allow not just the 10JS Project but also the FS Project to continue.226Foot Note 226×AEIC Narendran at para 42.LPQ said that these payments were necessary as work on the 10JS Project (and other projects involving HXC) came to a “near complete stop” in June 2021 because HXC was in financial difficulties.227Foot Note 227×AEIC LPQ paras 73 and 75; 2AEIC LPQ at para 22.LPQ was compelled to deal with HXC’s suppliers and sub-contractors who had been chasing him for their outstanding invoices.228Foot Note 228×AEIC LPQ at para 70.In fact, the pressure on LPQ was a significant factor contributing to his decision to resign from HXC in or around October 2019.229Foot Note 229×AEIC LPQ at para 71.Therefore, I find that the true state of affairs behind the payments made by HXD on behalf of HXC was such that it was LPQ and the other shareholder(s) of HXD making payments on behalf of HXC to ensure the smooth progress of the 10JS Project (and also possibly the FS Project). Accordingly, this meant that it was not a case of LPG making “liberal use” of HXD’s funds, as the plaintiffs alleged, to support their allegation that LPG wielded control over HXD. Rather, LPQ and HXD had only stepped in to protect theirowninterests by ensuring that the redevelopment projects (including the 10JS Project) were completed and delivered.230Foot Note 230×2AEIC LPQ at paras 9(d) and 22–24; 2nd and 4th Defendants’ Reply Submissions dated 26 October 2023 (“2&4DRS”) at para 29. 123 Finally, I would add that I accept LPQ’s evidence that the shareholders of HXD had discussed and allowed LPG and HXC to receive and retain a sum totalling $1.137m to allow HXC to complete the 10JS Project.231Foot Note 231×AEIC LPQ at paras 60, 65–66.Mr Yam’s testimony, that he “was aware” that cheques amounting to the sum of $1.137m were issued to HXC,232Foot Note 232×Certified Transcript 27 September 2023, p 23 lines 3–8.increases the likelihood that the other shareholders of HXD shared the same awareness and that there were discussions amongst them regarding these payments. Again, it bears emphasising that these payments were made to HXC amid HXC’s financial difficulties. It was in the interests of LPQ and the other shareholders of HXD to step in to guard theirowninterests in ensuring that the projects were completed and delivered. (3) The belated signing of a director’s resolution two years later on 3 May 2021 to ratify LPG’s purported decision to sell the redeveloped 10JS properties 124 In relation to [115(f)], the plaintiffs submit that even though LPG conducted the sale of the redeveloped 10JS properties in mid-2019, a director’s resolution was only signed approximately two years later on 3 May 2021 to ratify LPG’s purported decision to sell the redeveloped 10JS properties.233Foot Note 233×PCS at para 47.The plaintiffs allege that this shows that LPG had the authority and control over HXD.234Foot Note 234×Ibid.In my view, this does not necessarily show LPG had the authority or control over HXD as this act must be viewed in its context. Again, it bears repeating that by mid-2019, the shareholders of HXD and LPQ became increasingly concerned about the 10JS Project due to the slow progress in the construction of the 10JS Project. This was largely due to HXC’s delay in making payments to its suppliers and sub-contractors.235Foot Note 235×AEIC LPQ at paras 67–69.According to LPQ, this problem was discussed amongst the shareholders of HXD and himself and they eventually decided to sell the redeveloped 10JS properties as soon as possible.236Foot Note 236×AEIC LPQ at para 51.No actual price was agreed upon.237Foot Note 237×Ibid.I accept that the shareholders of HXD and LPQ agreed to sell the redeveloped 10JS properties as long as they could recover their investments and make some profit.238Foot Note 238×AEIC LPQ at para 51; AEIC Yam at para 41.I accept that the true state of affairs was not, as the plaintiffs claim, that “the [shareholders of HXD and LPQ] were completely under LPG’s influence” and had “accepted [LPG’s] ideas and simply went along with it, without any discussion”.239Foot Note 239×PCS at para 23.Ultimately, LPQ’s testimony as to the discussions amongst HXD’s shareholders and himself is corroborated by Mr Yam, who gave evidence that it was ultimatelyHXD’s shareholders and LPQthemselveswho gave the mandate to sell the redeveloped 10JS properties in mid-2019.240Foot Note 240×AEIC Yam at para 39.The testimonies of LPQ and Mr Yam, being persons involved in these discussions, would be probative as to what was actually discussed amongst HXD’s shareholders and LPQ. 125 Additionally, as I was open to the possibility that such discussions could have been conducted verbally, I was not persuaded by the plaintiffs’ point that LPQ and Mr Yam ought to be disbelieved because “LPQ did not disclose any contemporaneous communications between LPG, the [shareholders of HXD] and him evidencing any sort of discussion or exchange in respect of LPG’s proposed ideas.”241Foot Note 241×PCS at para 23; PRS at para 16. 126 I further accept that the mandate to sell the redeveloped 10JS properties was then communicated to LPG who was tasked with arranging the sale.242Foot Note 242×AEIC LPQ at para 51.Pursuant to this mandate, LPG, acting with the assistance of the father of one of HXD’s shareholders, Ang Leong Hao, managed to sell 10 JS and 10A JS for a small profit on 23 October 2019 and 30 July 2020 respectively.243Foot Note 243×Ibid.The critical factor is that the mandate to sell came fromtheshareholders of HXD and LPQand notLPG. This shows that it was ultimately the HXD’s shareholders and LPQ who had the final say in important matters in HXD even though the execution of these matters (eg, the execution of the relevant paperwork) may have been left in the hands of LPG. 127 In this regard, the plaintiffs rely on the case ofSakae Holdings Ltd v Gryphon Real Estate Investment Corp Pte Ltd and others (FooPeow Yong Douglas, third party) and another suit[2017] SGHC 73 (“Sakae Holdings”) where Judith Prakash JA (as she then was) held that one Ong Siew Kwee (“Andy Ong”) was a shadow director of the defendant company.244Foot Note 244×PCS at para 18.This was based on the fact that Andy Ong was not merely consulted on the company’s affairs but had played a dominant role in its major corporate decisions. Andy Ong was able to, and in fact did, act unilaterally in key areas of corporate decision-making and he had a highly influential role in directing the company’s affairs. The degree of control held by Andy Ong in the company was such that the director of the company relied on Andy Ong’s instructions to the point of “unquestioning deference” (Sakae Holdingsat [42]). In my view, the present case is distinguishable. Quite apart from the dominant role played by Andy Ong inSakae Holdings, the role LPG played was more akin to a consultant in HXD’s affairs. Ultimately, it was the shareholders of HXD and LPQ who had the final say on key matters concerning HXD. I am unable to see how they had displayed the same “unquestioning deference” to LPG as seen inSakae Holdings. (4) LPG’s purported instructions to LPQ via WhatsApp 128 Turning now to [115(g)], this is the plaintiffs’ allegation that LPG’s control over HXD can be observed from the WhatsApp Conversation, where LPG had purportedly given instructions to LPQ as to how LPQ and HXD should behave in response to the claims made against them by Mr Ang in Suit 8. In one of the recordings, LPG told LPQ that “[e]verything involves [himself and HXC] only and does not involve [LPQ and HXD] at all” and his position that LPQ and HXD “are not related to this matter”.245Foot Note 245×2AB232.At most, the WhatsApp Conversation shows that LPQ and HXD had nothing to do with Mr Ang’s or the plaintiffs’ claims against LPG and HXC. This is factually correct in that LPQ and HXD were not involved in the Agreement between the plaintiffs and LPG and HXC. However, the WhatsApp Conversation does not go so far as to provide evidence of LPQ taking instructions from LPG. Instead, having read the transcript of the WhatsApp Conversation in its totality, LPQ explained that he was not seeking “direction[s]” (in the words of counsel for the plaintiffs) from LPG.246Foot Note 246×Certified Transcript 26 September 2023, p 45 lines 1–4.Rather, LPQ was merelyinquiringfrom LPG on how the latter was going to resolve the issues that have been raised at the onset of Suit 8, specifically the Mareva injunction order that was issued against LPQ and HXD.247Foot Note 247×Ibid.Indeed, this coheres with the following exchange between LPG and LPQ in the WhatsApp Conversation:248Foot Note 248×2AB235. [LPQ]:How do you want to resolve this case？ Presently all the bank accounts have been frozen. I… You resolve it quickly. I don’t know how to resolve it. [LPQ]: The situation now, what is the meaning? The situation now, what is the meaning? [LPG]: I said I am driving. [LPG]: I spoke to the lawyer just now. He said in future this will not concern you. Take out the name first. [LPQ]: In this case, can’t TOP on the 10th? Can’t TOP on the 10th? [LPG]: I told him to push everything to me. I will not fight with them. Everybody don’t need to fight. I don’t fight. I suggested to close down everything just now. Closing down is the easiest way but for the sake of TOP, cannot close down. Have to delay a little, delay a little, and then close them all. Then your name and Development name, he will fight to say that this has nothing to do with you. [emphasis added] 129 In the course of the trial, counsel for the plaintiffs had also pointed to an excerpt in the transcript of the WhatsApp Conversation where LPG appears to refer to HXD as “our Development”.249Foot Note 249×Certified Transcript 26 September 2023, p 49 lines 22–25, p 50 lines 1–10.According to the plaintiffs, this was indicative of LPG’s control over HXD. The excerpt of the WhatsApp Conversation is as follows:250Foot Note 250×2AB236. [LPG]: Proceed with TOP as usual. This does not involve TOP. Proceed with TOP and work as usual. It is unrelated to this. TOP can proceed as usual. [LPG]: Because today’s matter is only one-sided matter. Today court will not hear us talk about these matters, only about his matters. …During zoom, we can talk about our matters and raise our requests about what items to proceed as usual, what items are not related to you, etc. We can then talk about these matters. Today, they don’t listen to us speak. [LPQ]: Are you proceeding with number 45 as usual.? Number 45 involves a sum of money so if you don’t proceed as usual, both sides may go bad. [LPG]: Proceed with number 45 as usual. Proceed with everything as usual. When we fight the case, we have to set aside $1 million to fight the case. That’s all. All sums above $1 million can be taken. No problem. If you can prove that you have $1 million, then you can take the remaining sums and you can use all remaining sums. We are fighting for the case that your name and Development are not related to this matter. Because he saw thatour Developmenthas money so he made this move. [LPG]: I asked Buay Sai to ask Yam Shun’s kid to fight. Buay Sai to ask Yam Shun’s kid. Yam Shun’s kid knows this side’s lawyer, he said. [LPQ]: Knowing the lawyer should not matter much. Just now, the lawyer seems quite capable. Didn’t you ask Naren to call Yam Shun’s kid? [emphasis added] 130 Based on the excerpt above, the plaintiffs suggest that this is evidence of LPG’s control over HXD as he appears to have treated HXD as a company belonging to him.251Foot Note 251×Certified Transcript 26 September 2023 at p 49 lines 17–24 and p 50 at lines 2–19.I do not agree that LPG’s passing reference to HXD as “our Development” necessarily proves that LPG possessed control over HXD. If anything, the fact that LPG referred to HXD as “ourDevelopment” [emphasis added] shows at best that control was shared between LPG and LPQ. It does not go so far as to support the plaintiffs’ case that HXD was controlled by LPG. Nothing said by LPQ in the WhatsApp Conversation confirms the plaintiffs’ claim of LPG’s purported ownership over HXD. 131 For the above reasons, I do not agree that LPG had control over HXD. In the course of the trial, counsel for LPQ and HXD had questioned Mr Peck on whether the plaintiffs had conducted the relevant ACRA searches to verify LPG’s claims of ownership and control over HXD.252Foot Note 252×Certified Transcript 20 September 2023 at p 69 lines 21–25.Mr Peck agreed that he did not check and that he simply “took [LPG’s] word for it”.253Foot Note 253×Ibid.Even if this was the case, this would not necessarily defeat the plaintiffs’ claim for fraudulent misrepresentation. Where a false representation has been proven, it is immaterial that the representee was negligent in failing to verify the representation, notwithstanding the availability of materials for verification: seeAxisMegalink Sdn Bhd v Far East Mining Pte Ltd[2023] SGHC 243 at [125], citing the English Court of Appeal decision ofRedgrave v Hurd(1881) 20 Ch D 1. 132 Notwithstanding the above however, I am ultimately of the view that the plaintiffs had failed to prove that there was any fraudulent misrepresentation, which I shall explain below. 133 To recapitulate, the plaintiffs have shown that LPG had represented that he was in control of HXD. I further accept that LPG was not, as a matter of fact, in control of HXD. Therefore, the representation by LPG to this effect would undoubtedly be a false statement of fact. However, a false statement of fact alone is insufficient to establish a claim for fraudulent misrepresentation. Earlier, I referred to the elements inPanatron(see above at [99]) to be fulfilled in a claim for fraudulent misrepresentation. In this case, the plaintiffs must go on further to show that LPG made the false representation knowing that it was false or that he had lacked any genuine belief that it was true. 134 Bearing in mind further that a claim for fraudulent misrepresentation is subject to a high evidential standard, I am not satisfied that LPG is liable for fraudulent misrepresentation because the plaintiffs are unable to show that LPG had made the false representation knowing that it was false or that he had lacked any genuine belief that it was true. Unfortunately, no direct evidence on the state of mind of LPG was available as LPG stopped participating in the early stages of these proceedings. Nonetheless, the picture which emerges from the evidence adduced is that LPG, more likely than not, did genuinelybelievethat he was in control of HXD. This is notwithstanding the true state of affairs which was one where LPQ and the shareholders of HXD were really in control of HXD, albeit LPQ and HXD were content to leave administrative matters in the hands of LPG given LPG’s experience in the real estate industry (see my findings above at [117]). After all, the 10JS Project was LPG’s brainchild. He was also the company secretary of HXD. The shareholders of HXD and LPQ were not experienced in the construction industry and had to tap on LPG’s experience in the construction and real estate industry. To my mind, it seemed likely that LPGbelievedthat he had a strong influence on LPQ and the shareholders of HXD and thus he concluded (wrongly, as it turns out as a matter of law) that he also wielded control over HXD. Accordingly, it appears to me that LPG did not make the false representation that he was in control of HXD knowing that it was false or that he lacked any genuine belief that it was true. At best, LPG may have been negligent in his misrepresentation. However, as the plaintiffs have not pleaded a claim for negligent misrepresentation, I shall say no more on this. Whether LPQ or HXD can be held liable for LPG’s misrepresentation 135 I now turn to address the plaintiffs’ pleading that should this court find that LPG is liable for fraudulent misrepresentation, LPQ and/or HXD should also be held liable for LPG’s fraudulent misrepresentation.254Foot Note 254×PR at para 2(b).In light of my finding above that LPG did not commitanyfraudulent misrepresentation, this is sufficient to dispose of the plaintiffs’ claim for fraudulent misrepresentation against LPQ and/or HXD. I note that the plaintiffs have not proceeded on this line of argumentation against LPQ and/or HXD in their closing submissions. 136 Nonetheless, I shall state my views on why the plaintiffs’ claim against LPQ and/or HXD for LPG’s fraudulent misrepresentations would have failed in any case. (1) LPQ’s liability for LPG’s misrepresentations 137 The plaintiffs’ case against LPQ proceeds on two bases:255Foot Note 255×Ibid. (a) LPQ had placed LPG in a position whereby LPG represented that he was in control of HXC; or (b) alternatively, LPG was authorised to act for and on behalf of LPQ in all matters related to the 10JS Project. 138 According to the plaintiffs, these meant that LPQ was bound by the acts, conduct and representations of LPG in connection with the 10JS Project.256Foot Note 256×Ibid.First and foremost, I note that the plaintiffs have only gone so far as to plead in their Reply to the Joint Defence of the 2nd and 4th Defendants dated 6 April 2022 that LPQ had placed LPG in a position whereby LPG could represent that he was in control ofHXC. I have found above that LPG was in fact in control of HXC. Accordingly, there is no misrepresentation in this regard and the question of LPQ’s liability does not even arise. 139 In any case, I do not agree that LPQ can be held liable foranyof LPG’s misrepresentations, even if these were actionable. I note that in the first place there is no relationship of principal and agent between LPQ and LPG for liability to even arise as against LPQ. Any such relationship could have only existed between LPG and HXD, given that LPG was the company secretary of HXD. Even assuming that there was a relationship of principal and agent between LPQ and LPG, I am unable to see how LPQ had conferred either actual or ostensible authority on LPG to make any of his representations to the plaintiffs.257Foot Note 257×2&4DCS at para 53.More specifically, LPQ had not placed LPG in a position whereby LPG could represent that he was in control of HXC (or HXD). Clearly, there was no actual authority conferred on LPG to make any of the representations that he did. After all, LPQ at the material time was not even aware of the existence of the plaintiffs.258Foot Note 258×AEIC LPQ at para 81(c).In respect of LPG’s ostensible authority, I considered it crucial that at no point in time had the plaintiffs dealt with either LPQ or HXD prior to the commencement of the present suit.259Foot Note 259×Certified Transcript 20 September 2023 at p 55 lines 10–23.There is simply no basis to argue that LPQ (or even HXD) had placed LPG in a position whereby LPG could represent that he was in control or had the requisite authority to act on behalf of HXC. According to the plaintiffs, they had not dealt with LPQ at all. Mdm Ding accepted that she did not even check with LPQ if LPG was indeed an owner or controller of HXC and HXD.260Foot Note 260×Certified Transcript 19 September 2023 at p 51 lines 9–12. (2) HXD’s liability for LPG’s misrepresentations 140 Putting aside the potential liability of LPQ, I turn next to consider whether any potential liability can be placed on HXD. I note that it is unclear from the plaintiffs’ pleadings whether they also allege liability against HXD for LPG’s misrepresentations. Nonetheless, to the extent that the plaintiffs have done so (and to the extent that counsel for LPQ and HXD have dealt with such an argument imputing liability on HXD),261Foot Note 261×2&4DCS at paras 53–54.I would not have found favour with such an argument. 141 I am unable to see how HXD can be found liable for the representations of LPG, who was at the material time, on 18 August 2018, HXD’s company secretary. An unauthorised agent may be able to bind his principal where he may be said to have ostensible authority. Ostensible authority arises where the principal, by his words or conduct, leads another to believe that the agent has the requisite authority to act on the principal’s behalf. Where a third party transacts with the apparently authorised agent on the faith of this belief, the principal may be bound by the acts of the unauthorised agent as though the latter is indeed duly authorised: seeLew, Solomon vKaikhushru Shiavax Nargolwala and others and another appeal[2021] 2 SLR 1 at [50];Freeman & Lockyer vBuckhurst Park Properties (Mangal) Ltd[1964] 2 QB 480 at 503. Given that ostensible authority arises as a result of theprincipal’srepresentation to the third party, it follows that the unauthorised agent’s own representation as to his alleged authority cannot bind the principal. As counsel for LPQ and HXD have pointed out,262Foot Note 262×2&4DCS at para 53.self-authorisation is insufficient to bind a principal: seeOng Han Lingand another v American International Assurance Co Ltd and others[2018] 5 SLR 549 at [143]. The present case is plainly one involving self-authorisation by LPG. All representations had been communicated by LPG and LPG alone. According to Mdm Ding, the extent of her dealing with HXD was only that the plaintiffs had “issued the [cheque], 340,000, to [HXD]”.263Foot Note 263×Certified Transcript 19 September 2023 at p 52 lines 21–24, p 53 lines 5–16.As pointed out by counsel for LPQ and HXD, the request to issue the cheque in HXD’s name had come from LPG himself.264Foot Note 264×Certified Transcript 19 September 2023 at p 52 line 25, p 53 lines 1–4.At no point in time can it be said that the plaintiffs had interacted directly with HXD (or even LPQ) for the latter to give any impression to the plaintiffs that LPG was in control of HXD, let alone HXC. This is seen from the following exchange in the cross-examination of Mdm Ding:265Foot Note 265×Certified Transcript 19 September 2023 at p 52 line 21 to p 53 line 16. Q. Do you agree that at all times, prior to commencing this suit, you never dealt with HXD? A. I deal with HXD because I issued the check, 340,000, to this company. Q. And you did that because LPG asked you to do it; correct? A. Because LPG asked me to pay this 340,000 as an investment to purchase 20 per cent out from HXC stake for this 10 Jalan Shaer project. Q. Ms Ding, my question to you is a bit finer than that. Do you agree at all times, prior to this suit being commenced, you never dealt with HXD at all? A. I issued a cheque to HXD, why never deal? Q. Right. So your sum total of your dealings with HXD is because you issued a cheque to HXD? A. Yes. Q. That's the only time you, in your words, dealt with HXD? A. Because LPG told me that this 340,000 will be banked into HXD because HXD is the development for this project and you are buying HXC 20 per cent of the stake, which is 340,000 into this project investment. 142 The only conduct on the part of HXD which could have possibly implicated it for the representations of LPG is LPG’s designation as “company secretary”. I would preface my analysis here with the observation that it appears, based on Mr Peck’s testimony, that the plaintiffs had not even known of the existence of HXD as a distinct entity from HXC until 18 August 2018, the same day they had signed the Agreement.266Foot Note 266×Certified Transcript 20 September 2023 at p 70 line 24 to p 72 line 3.Accordingly, LPG’s official designation as the “company secretary” of HXD would not even have operated on the minds of the plaintiffs to provide any basis for the plaintiffs to claim that HXD had held out LPG to have any authority to make any decisions on behalf of HXD. This alone would defeat any argument of LPG having ostensible authority to make the representations he did on account of his official designation as company secretary. However, I would go further to state that I would not have been satisfied by any argument that the title of “company secretary” alone would be indicative of any high level of authority possessed by LPG. According to Mdm Ding, even within her own companies, the company secretary is not typically conferred with authority in relation to important matters.267Foot Note 267×Certified Transcript 20 September 2023 at p 22 lines 2–13.In particular, she accepts that “[i]n my company, secretary cannot sign the documents like important OTP, only the director of the company can sign for the documents like that, in my company”.268Foot Note 268×Certified Transcript 20 September 2023 at p 22 lines 2–4.Therefore, I am of the view that the title of “company secretary” is similar to that of “finance manager” inSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another appeal[2011] 3 SLR 540 (“Skandinaviska”), a title which the Court of Appeal found did not connote possession of any specific authority (Skandinaviskaat [51]). HXD cannot be taken to have held out to the plaintiffs by either its actions (of which there was none) or by LPG’s title of “company secretary” that LPG had any authority to make on its behalf the kind of representations made by LPG. 143 Accordingly, I reject the plaintiffs’ submission that either LPQ or HXD had placed LPG in a position whereby LPG could represent that he was in control of HXD. 144 Therefore, I find that the plaintiffs have not discharged their burden of proving that LPG had been authorised carte blanche to act for and on behalf of HXD and/or LPQ inallmatters relating to the 10JS Project. LPG, as the company secretary of HXD, was authorised to deal only with paperwork that were administrative in nature.269Foot Note 269×Certified Transcript 22 September 2023 at p 31 lines 16–20.The documents referred to by the plaintiffs, although concerning the transfer and purchase of HXD’s investment properties, were within the scope of LPG as HXD’s company secretary as he was executing the decisions made by LPQ and the shareholders of HXD.270Foot Note 270×Certified Transcript 22 September 2023 at p 34 lines 16–18.Furthermore, LPG was required to inform LPQ and the shareholders of HXD what documents he had signed.271Foot Note 271×Certified Transcript 22 September 2023 at p 32 lines 17–22.Ultimately, important decisions were made byLPQ and the shareholdersof HXD, notLPG. LPG was only tasked with the handling of the paperwork for matters decided by the shareholders of HXD and LPQ.",
        "Claim in constructive trust": "145 In their SOC No. 2, the plaintiffs seek a declaration that HXD hold the Investment Sum on a constructive trust for the plaintiffs.272Foot Note 272×SOC No. 2 at p 21.As against LPG and/or HXC, the plaintiffs have not made clear how a constructive trust arises as against them. It is unclear how the Agreement between the plaintiffs and HXC (or LPG, on the assumption that LPG is the alter ego of HXC) would, by itself, cause a constructive trust to arise. In any event, as default judgment has been issued against LPG and HXC, it is not necessary for me to say more about the claim against LPG and HXC. 146 As against LPQ and/or HXD, the plaintiffs pleaded that a constructive trust arises over the Investment Sum on the basis that HXD and/or LPQ knew and/or ought to have known of the plaintiffs’ investment.273Foot Note 273×SOC No. 2 at para 19.Further, the plaintiffs allege that there was a constructive trust as the Investment Sum was deposited into HXD's DBS bank account and was later withdrawn in two different sums on 25 August 2018 and on 28 August 2018, and utilised for purposes unknown.274Foot Note 274×Ibid.This argument appears to beseparate and distinctfrom the claim that LPQ be liable as a constructive trustee for dishonestly assisting a purported breach of trust by HXD.275Foot Note 275×SOC No. 2 at para 29. 147  Notwithstanding that a claim in constructive trust appeared to have been pleaded against both LPQ and HXD in their SOC No. 2,276Foot Note 276×SOC No. 2 at para 19.the plaintiffs’ closing submissions have confined their claim in constructive trust against only HXD, and not LPQ.277Foot Note 277×PCS at para 69.Nevertheless, I shall address the plaintiffs’ claim against LPQ and HXD and explain why no constructive trust arises as against them. 148 In determining whether there was a constructive trust arising over the Investment Sum, it is helpful to refer to the decision of Vinodh Coomaraswamy J inZaitonbte Adom v Nafsiah bte Wagiman and another[2023] 3 SLR 533 (“Zaiton”), which sets out the applicable legal principles in relation to institutional constructive trusts. There, the plaintiff submitted (at [103]) that an institutional constructive trust arises in equity whenever a recipient of property behaves unconscionably in the general sense in relation to the said property, citing thedictumof Millett LJ (as he then was) inParagon Finance plc v DBThakerar & Co[1999] 1 All ER 400, cited inGuy Neale and others v Nine Squares Pty Ltd[2015] 1 SLR 1097 (“Guy Neale (CA)”) at [124]–[125]: A constructive trust arises by operation of law whenever the circumstances are such that it would be unconscionable for the owner of property (usually but not necessarily the legal estate) to assert his own beneficial interest in the property and deny the beneficial interest of another. 149 In rejecting the plaintiff’s submission that proof of unconscionability in the general sense is sufficient to establish a constructive trust, Coomaraswamy J stated (Zaitonat [104]): 104 The plaintiff’s foundational proposition is fundamentally misconceived. A constructive trust is not equity’s response to conduct by [the alleged trustee] which is unconscionable only in the general sense of being conduct which is either not right or reasonable or which is contrary to good conscience.Unconscionability in that general sense is a necessary but not a sufficient condition for a constructivetrust to arise.The Court of Appeal made that clear inGuy Neale (CA)(at [124]) by framing Millett LJ’sdictumas merely ageneraldefinition of an institutional constructive trust rather than a comprehensive definition.It is significant that the Court of Appeal went on to situate the facts of Guy Neale (CA) within one of the specific categories and circumstances in which an institutional constructive trust arises,ie, a person making a profit in breach of his fiduciary duty(at [126]). [emphasis in italics in original; emphasis added in bold italics] 150 Accordingly, Coomaraswamy J emphasised that a constructive trust does not arise upon a mere allegation of unconscionability in the general sense. It is necessary to go further to show how the conduct falls into any of the established categories which equity has recognised as being capable of giving rise to an institutional constructive trust (at [107]–[108]): 107 The specific categories of unconscionability which equity recognises as being capable of giving rise to an institutional constructive trust were helpfully enumerated inLow Heng Leon Andy v Low Kian Beng Lawrence (administrator of the estate of Tan AhKng, deceased)[2011] SGHC 184 (at [53], cited with approval inGuy Neale and others v Nine Squares Pty Ltd[2013] SGHC 249 at [141]): (a) fraud; (b) the retention of property acquired as a result of a crime causing death; (c) a profit in breach of a fiduciary duty; (d) the retention of property by a vendor after the vendor had entered into a specifically enforceable contract to sell the property; (e) the changing of a will by the survivor of two persons who had entered into a contract to execute wills in a common form; (f) the acquisition of land expressly subject to the interests of a third party; and (g) the assertion of full entitlement to property after a common intention to share property had been formed (also known as a “common intention constructive trust”). 108 This list of categories is not of course closed. And each category in this list is not of course so rigid as to be incapable of development. But there is a very strong policy imperative, both at common law and in equity, for rights in property to be stable and for the law to allocate and alter those rights only in a manner which is transparent, consistent and predictable. Equity therefore develops each category within this list incrementally, by analogy to existing cases within the category. Equally, it adds categories to this list incrementally, by analogy to the existing categories. And this development and addition is done in the usual way: by accretion of judicial decision. Equity does not develop or add to these categories in an unprincipled and ad hoc way, turning on a particular judge’s subjective opinion in a particular case as to whether [the alleged trustee] has engaged in conduct which is or is not unconscionable in some general sense of the word. 151 The plaintiffs submit that a constructive trust in respect of LPQ and/or HXD arose because their knowledge of the investment would make their conduct unconscionable so as to give rise to a constructive trust.278Foot Note 278×PCS at paras 15(3)(a) and 72.This must be rejected as it is not supported by the evidence. 152 The plaintiffs allege in their closing submissions that a constructive trust arises for two reasons:279Foot Note 279×PCS at paras 72–73. (a) First, the Investment Sum was received by HXD pursuant to the fraudulent misrepresentations of LPG who was the controller or shadow director of HXD. Therefore, HXD’s receipt of the Investment Sum was unconscionable. (b) Second, when HXD issued the two cash cheques for the total sum of $340,000 that were not used for the purposes of the 10JS Project, LPG’s knowledge regarding the specific purpose of receipt is imputed to HXD. Accordingly, it was unconscionable for HXD to have paid out the Investment Sum to LPG. 153 The plaintiffs appear to rely on the type of unconscionability in category (a) as set out inZaitonat [107] (see above at [150]) as the basis for their argument that a constructive trust has arisen against LPQ and HXD by virtue of LPG’s fraud on the plaintiffs. The plaintiffs submit that a constructive trust arose because the Investment Sum had been received by HXD pursuant to the fraudulent misrepresentations of LPG who was the controller or shadow director of HXD.280Foot Note 280×PCS at para 72.In the case of a fraud, a transfer of property procured by fraud gives rise to an institutional constructive trust as against the fraudulent transferee: seeWestdeutscheLandesbank Girozentrale v Islington London Borough Council[1996] AC 669at 716. However, as I have found (see above at [134]), there was no fraud. It had been agreed by the plaintiffs and LPG that the money was to be paid into the DBS bank account of HXD.281Foot Note 281×AEIC Ding at paras 32–33Thus, this category is inapplicable as there is no fraud here. Furthermore, even if LPG had fraudulently misrepresented to the plaintiffs that he was in control of HXD in procuring the plaintiffs’ entry into the Agreement, LPQ and/or HXD cannot in any event be said to have been responsible for LPG’s misrepresentations (see above at [139] and [140]). At all times, the representations in relation to the Agreement had been made by LPG and LPG alone. Neither could it be said that LPQ and/or HXD should be held liable for LPG’s misrepresentations for having placed LPG in a position where he could have made such representations (see above at [143]). Therefore, a constructive trust cannot be imputed on LPQ and HXD. Accordingly, a constructive trust does not arise in relation to LPQ and/or HXD. 154  I shall now deal with the plaintiffs’ allegation that it was unconscionable for LPQ and/or HXD to have paid out the Investment Sum to LPG.282Foot Note 282×Ibid.According to the plaintiffs, this was because LPQ and/or HXD should be imputed with LPG’s knowledge regarding the specific purpose of his receipt of the Investment Sum.283Foot Note 283×Ibid.This submission must be rejected to the extent that the plaintiffs are submitting that unconscionability in the general sense had arisen. As stated inZaitonat [104], a mere allegation of unconscionability in the general sense is insufficient to ground a claim in constructive trust (see above at [149]–[150]). Furthermore, I am unable to conclude that LPG had possessed knowledge that the Investment Sum would not be used for the purposes of the 10JS Project. In the first place, no evidence has been put before me which would show, on a balance of probabilities, that the Investment Sum had not been used for the 10JS Project after it had been returned to HXC’s bank account. While there were insinuations in the course of trial by counsel for the plaintiffs that LPG had been “addicted” to gambling right up to sometime in 2019,284Foot Note 284×Certified Transcript 21 September 2023 at p 65 lines 4–9.any argument that this meant that the Investment Sum deposited into HXC’s bank account was put to purposes other than for the 10JS Project would be purely speculative. The plaintiffs have additionally made the point in their submissions that “there is no documentary record or any evidence that the [Investment Sum] had been used for the [10JS Project]”.285Foot Note 285×PCS at para 65(2).However, this argument does not advance the plaintiffs’ case in any way when I consider that it is ultimately the plaintiffs’ burden to show that the money had been used for purposes other than for the 10JS Project. While the plaintiffs have gone on to submit that the “the withdrawal of the sum of S$340,000 from HXD’s bank account within a few days after the [Investment Sum] had been deposited (on 20 August [2018])” and the “lack of segregation of [the Investment Sum] [from] other [moneys]” provide “clear evidence” that the money had not been used solely and exclusively for the 10JS Project,286Foot Note 286×PCS at para 66(3).I consider these points to be neutral at best. 155 For completeness, I would add that even if an argument had been raised that the types of unconscionability in category (c)or (g) as set out inZaitonat [107] are potentially engaged on the facts (see above at [150]), I would have found that they are inapplicable. (a) Category (c) is inapplicable.This category requires a pre-existing fiduciary relationship between the plaintiffs and LPQ and/or HXD which pre-dates and is independent of the institutional constructive trust which is now said to have arisen:Zaitonat [117]. The plaintiffs do not allege that LPQ and/or HXD owed fiduciary duties to them before 18 August 2018. LPQ and/or HXD had never dealt with the plaintiffs before 18 August 2018; it had been LPG all along with whom the plaintiffs had been dealing (see above at [139]). (b) Category (g) is also inapplicable. This category of institutional constructive trust requires the following conditions to be satisfied: (i) the trustee and beneficiary must share a common intention that the beneficial interest in a property is to be shared; and (ii) the beneficiary relies to his detriment on this common intention:Zaitonat [119]. The common intention may be express or inferred: seeChan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 at [160(b)] and [160(f)]. If these conditions are satisfied, equity will not permit the trustee to exercise her rights in the property in a manner which is inconsistent with the trustee’s and the beneficiary’s common intention:Zaitonat [119]. Again, as I have found (see above at [139]), the plaintiffs had at the material time,ie, 18 August 2018, not dealt with LPQ and/or HXD. A common intention did not therefore arise between the plaintiffs and LPQ and/or HXD. There being no common intention, the issue of detriment also would not arise. 156 Accordingly, no constructive trust arises in relation to LPQ and/or HXD.",
        "Claim inQuistclosetrust": "157 The plaintiffs claim that aQuistclosetrust arises in respect of HXD.287Foot Note 287×SOC No. 2 at para 26.In my view, there is no evidence to indicate that a claim inQuistclosetrust against HXD can be sustained. 158 I shall begin with the relevant legal principles to establishQuistclosetrust. According to Millett LJ (as he then was) inTwinsectraLtd v Yardley and others[2002] 2 AC 164 (“Twinsectra”) at [73]–[74], aQuistclosetrust does not arise merely because money is paid for a particular purpose. Rather, the determinative question is whether the parties intended the money to be at the free disposal of the recipient: AQuistclosetrust does not necessarily arise merely because money is paid for a particular purpose. A lender will often inquire into the purpose for which a loan is sought in order to decide whether he would be justified in making it. He may be said to lend the money for the purpose in question, but this is not enough to create a trust; once lent the money is at the free disposal of the borrower. Similarly payments in advance for goods or services are paid for a particular purpose, but such payments do not ordinarily create a trust. The money is intended to be at the free disposal of the supplier and may be used as part of his cashflow. Commercial life would be impossible if this were not the case. The question In every case is whether the parties intended the money to be at the free disposal of the recipient: InreGoldcorp Exchange Ltd[1995] 1 AC 74, 100 per Lord Mustill. His freedom to dispose of the money is necessarily excluded by an arrangement that the money shall be used exclusively for the stated purpose, for as Lord Wilberforce observed in theQuistclosecase [1970] AC 567, 580: “A necessary consequence from this, by a process simply of interpretation, must be that if, for any reason, [the purpose could not be carried out,] the money was to be returned to [the lender]: the word ‘'only’' or ‘'exclusively’' can have no other meaning or effect.” 159 AQuistclosetrust has not arisen in the present case as against HXD. The case ofTohEng Tiah v Jiang Angelina[2020] SGHC 65 (“TohEng Tiah”) is instructive. There, Andrew Ang SJ found that a loan agreement which expressly stated that “[t]he purpose of the [loan] is for the purchase of [9 Hillcrest Road]” did not prevent the defendant from making free use of the loan (TohEng Tiahat [145]). The decisive factor for Ang SJ was the absence of any agreement that the sum advanced was not to be at the defendant’s free disposal. He noted that there was no express term in the loan agreement and no understanding between parties which restricted the defendant’s right to apply the sum advanced or which provided that the defendant was not to have free disposal of the loan (TohEng Tiahat [145]). According to Ang SJ, for aQuistclosetrust to arise there must not only be a specified purpose for which the property was advanced. There must also be a restriction on the recipient’s disposition of the property (TohEng Tiahat [142]–[144]). 160 The present case is similar to that ofTohEng Tiah. While I am cognisant of the plaintiffs’ submission that the Agreement expressly states that the loan to HXC was “for the redevelopment of [the Original 10 JS]”,288Foot Note 288×PCS at paras 78–79.TohEng Tiahis clear that this alone is insufficient to give rise to aQuistclosetrust. In any event, what is crucial here is that this was an agreement between the plaintiffs andHXC. There is nothing in the Agreement which provides thatHXDis restricted from having free disposition of the sum advanced. Mdm Ding’s own evidence is that it wasLPGwho had told the plaintiffs that the money provided by them would be utilised solely and exclusively for the 10JS Project.289Foot Note 289×AEIC Ding at para 26.This was not communicated by HXD. The present case is unlike that ofTwinsectrawhere it was the borrower himself who gave an express undertaking to use the sum lent “solely for the acquisition of property and for no other purpose”: seeTwinsectraat [75] and [103]. The plaintiffs had not dealt with either LPQ and/or HXD at all material times. Hence, I am unable to see how there could have been any agreement between the plaintiffs and HXD that HXD would utilise any funds received solely and exclusively for the 10JS Project. On the contrary, HXD was not even aware of the existence of the plaintiffs or was even expecting the deposit of the sum of $340,000 into its bank account.290Foot Note 290×AEIC LPQ at para 81(c).At best, it could be said that LPG (or HXC) was holding the money on aQuistclosetrust for the plaintiffs291Foot Note 291×2&4DRS at para 49(b).given that it was LPG who had told the plaintiffs that the money provided by them would be utilised solely and exclusively for the 10JS Project. But the same cannot be said to apply in respect of HXD. 161 While the plaintiffs have sought to argue that LPG’s knowledge that the Investment Sum was to be used for the exclusive purpose of the 10JS Project can be imputed to HXD,292Foot Note 292×PCS at para 78.this argument cannot hold water in light of my finding that LPG was not in control of HXD (see above at [116]) and that LPQ and HXD were unaware of the Agreement at the material time. 162 Finally, it is the plaintiffs’ burden to show that the sum of $340,000 was used other than for the 10JS Project. As stated above (at [154]), there is no evidence that the sum of $340,000 or part thereof was not used for the 10JS Project. 163 Accordingly, I find that a claim inQuistclosetrust cannot be sustained against LPQ and HXD.",
        "Claim in dishonest assistance": "164 According to the Court of Appeal inGeorge Raymond Zage III and another v Ho Chi Kwong and another[2010] 2 SLR 589 (“Zage”) at [20], the elements of a claim in dishonest assistance are: (a) the existence of a trust;(b) a breach of that trust;(c) assistance rendered by the third party towards the breach; and(d) a finding that the assistance rendered by the third party was dishonest. 165 The plaintiffs’ claim in dishonest assistance is launched against the defendants on two alternative assumptions: that it was HXD which had committed a breach of trust,293Foot Note 293×SOC No. 2 at para 29.or, that it was HXC which had committed a breach of trust.294Foot Note 294×SOC No. 2 at para 29.However, given my findings that any claim in trust (either a constructive orQuistclosetrust) against LPQ and/or HXD fails (see above at [156] and [163]), any breach of trust could only have arisen in respect of HXC. This is because HXD is not even a constructive trustee in respect of the Investment Sum. 166 The present case should be more properly analysed under the rubric of knowing receipt as opposed to dishonest assistance. As the Court of Appeal appeared to suggest inZageat [43], a key difference between a claim in knowing receipt and dishonest assistance is that of the level of the participation. In knowing receipt, the level of participation involvedpassivereceipt. In contrast, dishonest assistance involvesactiveassistance. There is no evidence to show that LPQ and HXD were involved in LPG’s scheme. LPQ’s and HXD’s involvements were in the form of passive receipt of the sum of $340,000, rather than active assistance. This is sufficient to dismiss the plaintiffs’ claim against LPQ and HXD for dishonest assistance. 167 In any event, for completeness, I shall consider the plaintiffs’ submission that LPQ and HXD possessed the requisite dishonesty to ground a claim in dishonest assistance. In brief, I am of the view that LPQ and HXD were not dishonest as they were not even involved in the Agreement.295Foot Note 295×AEIC LPQ at para 81(c).There is no evidence to suggest that they had rendered assistance to any purported breach of trust by HXC and/or LPG. 168 I shall set out the applicable legal threshold for dishonesty. For a defendant to be liable for dishonest assistance, he must have such knowledge of the irregular shortcomings of the transaction that ordinary honest people would consider it to be a breach of standards of honest conduct if he failed to adequately query them: seeZageat [22], endorsing the test set out inBarlow Clowes International Ltd (in liquidation) v Eurotrust International Ltd[2006] 1 All ER 377 at [15]. 169 As against LPQ, the plaintiffs submit that LPQ had been dishonest because he was both a shareholder and the sole director of HXC at the material time, thus he was or should have been aware of the Investment Sum being deposited into HXC’s bank account and how it was used.296Foot Note 296×PR at para 2(a).I note that LPQ was indeed the shareholder and director of HXC from 4 August 2017 to 11 October 2019 (see Annex 1),297Foot Note 297×SOAF at para 6.the period within which the plaintiffs had transferred their Investment Sum into HXD’s bank account. But there is no evidence that LPQ had been dishonest. If anything, LPQ could only be said to be imprudent when he had failed to apprise himself of how the sum of $340,000 deposited into HXC’s bank account had been used following its deposit from HXD.298Foot Note 298×Certified Transcript 26 September 2023 at p 36 lines 1–6.I accept that there was no ground or reason for LPQ, at that time, to be suspicious of LPG who told him that the sum of $340,000 was mistakenly deposited into HXD’s bank account.299Foot Note 299×AEIC LPQ at paras 40, 42.LPQ did not expect a sum of $340,000 to be deposited into HXD’s bank account and he was labouring under the impression that this sum did not belong to HXD as he was unaware of the Agreement between the plaintiffs and LPG.300Foot Note 300×AEIC LPQ at para 42.Thus, LPQ held the genuine belief that this sum had to be returned to LPG. This is all the more likely when considered in light of my finding that at no time did LPQ deal with the plaintiffs directly (see above at [107]). 170 The plaintiffs allege that LPQ could have done more. For instance, the plaintiffs suggest that LPQ could have “ascertain[ed] whether LPG and/or HXC was the rightful recipient of the sum of S$340,000”,301Foot Note 301×PCS at paras 10(5) and 91.inquired further as to why “there was need to issue 2 separate cash cheques of different sums with different dates”,302Foot Note 302×Ibid.inquire “where and from whom did the money originated”,303Foot Note 303×PCS at para 89.or “verify with the bank who made the payment of the sum of S$340,000”.304Foot Note 304×PCS at para 10(4).Notwithstanding that these courses of action were not taken by LPQ, I do not consider that these operated against LPQ to mean that he was dishonest. According to the authors ofSingapore Trusts Law(LexisNexis, 1st Ed, 2021) at paras 17–19, there is a difference between dishonesty and negligence or imprudence: seeBanque Nationale de Paris v Hew Keong Chan Garyand others[2000] 3 SLR(R) 686 (“Banque Nationale”) at [142], citingRoyal Brunei AirlinesSdn Bhd v Tan (Phillip Kok Ming)[1995] 2 AC 378 at 389H. In this regard, the words of Lai Kew Chai J inBanque Nationaleat [142] are instructive on how a court should be wary in applying a hindsight analysis to ascribing dishonesty on a person, particularly in a case involving someone who was not motivated by any personal gains: ... It is also in this connection that one must always and punctiliously guard against the illogical flaw of judging any conduct of such tyros with the benefit of hind sight. If a person is imprudently optimistic, especially when he is not motivated by any personal pecuniary gain, directly or indirectly, I do not think that such imprudence is dishonesty. As Lord Nicholls helpfully stated in the context of taking risks at 398H: All investment involves risks. Imprudence is not dishonesty, although imprudence may be carried recklessly to lengths which call into question the honesty of the person making the decision. This is especially so if the transaction serves another purpose in which that person has an interest of his own. His Lordship is there pointing obviously to the motive or motivation which drives or lies behind the acts or omissions of the alleged accessory. If he stands to gain something, the “touchstone” of dishonesty is probably triggered as an ingredient constituting the equitable wrong of a dishonest accessory. On the other hand, if he is driven by ties of kinship, compassion, altruism or an exaggeratedly credulous or trusting nature or disposition, I do not think that such traits or shortcomings, however lamentable, amount to dishonesty in the context of accessory liability. 171 The plaintiffs challenge LPQ’s explanation that he had genuinely believed the payment to be a mistaken payment because it raises the following inconsistencies.305Foot Note 305×PCS at para 95.First, LPQ had stated in his Affidavit of Evidence-in-Chief (“AEIC”) that HXD had issued two cash cheques for the sums of $150,000 and $190,000 on 24 and 25 August 2018 respectively.”306Foot Note 306×AEIC LPQ at para 43.However, under cross-examination, LPQ gave contradicting evidence that both cheques were signed, issued and given to LPG on the same day.307Foot Note 307×PCS at para 95(1); Certified Transcript 26 September 2023, p 5 lines 4–15.Second, contrary to LPQ’s AEIC, the cash cheques were not signed by Mr Yam, but by another director, Mr Er.308Foot Note 308×PCS at para 95(2).LPQ only corrected his evidence in his AEIC on the day he took the stand.309Foot Note 309×Certified Transcript 21 September 2023, p 6 lines 3–6.In my view, these were not material inconsistencies which detracted from the overall consistency of LPQ’s case that he had believed the deposit of the Investment Sum into HXD’s bank account to be a mistake.310Foot Note 310×AEIC LPQ at para 42. 172 Furthermore, I am not persuaded by the plaintiffs’ submission that just because LPQ did not raise any queries with LPG regarding how the Investment Sum came to be mistakenly deposited into HXD’s bank account, this would have undermined his belief that the deposit into HXD’s bank account was a mistake.311Foot Note 311×PCS at paras 88-90.LPQ’s failure to raise any queries is instead consistent with his case that he had believed the deposit to be a mistake and it ought to be returned to LPG. Having returned the sum to whom LPQ believed was the rightful owner, there was no reason why LPQ would have continued to probe further as to how this sum came to be deposited into HXD’s bank account. 173 For completeness, I note that LPQ had been the sole director of HXC at the relevant time when the Investment Sum was deposited into HXD’s bank account and subsequently withdrawn and deposited into HXC’s bank account. However, I do not consider this to lead to the conclusion that LPQ must have been dishonest by virtue of his sole directorship in HXC. It is LPQ’s evidence that he was not even aware that he had been made the sole director of HXC between August 2017 and October 2019.312Foot Note 312×AEIC LPQ at para 14.At all times, the only role that LPQ played in HXC was to help LPG supervise the workers of HXC.313Foot Note 313×AEIC LPQ at para 15.This is corroborated by Mr Narendran who testified that LPQ was not actively involved in HXC’s business despite being a director of HXC.314Foot Note 314×AEIC Narendran at para 9.I find Mr Narendran’s evidence to be particularly probative of the true role played by LPQ in HXC. Mr Narendran reported to LPG, who was the managing director of HXC.315Foot Note 315×AEIC Narendran at para 8.LPG’s role in HXC was such that he controlled not just its day-to-day operations, but also its finances.316Foot Note 316×Ibid.LPG was the sole bank signatory of HXC’s bank accounts.317Foot Note 317×Ibid.Therefore, it was more likely than not that LPQ had indeed been misled by LPG as to the true nature of the role that LPQ was taking on in HXC. As Mr Narendran testified, LPQ rarely visited worksites and only did so once a month for the projects involving HXD (ie, the 10JS Project and the FS Project).318Foot Note 318×AEIC Narendran at para 10.Mr Narendran had never seen LPQ working on the other projects319Foot Note 319×Ibid.despite Mr Narendran’s close involvement in the various projects of HXC as its junior quantity surveyor. 174 As against HXD, the plaintiffs submit that the element of dishonesty is made out by reason of LPG's control over HXD such that LPG’s knowledge that the plaintiffs had invested $340,000 in the 10JS Project ought to be imputed to HXD.320Foot Note 320×SOC No. 2 at para 12B.I recognise that the knowledge of the controlling minds of a company can be imputed to the company: seeAljunied-Hougang Town Counciland another v Lim Swee Sian Sylviaand others and another suit[2019] SGHC 241 at [455]. However, in light of my finding above at [131] that LPG was not in control of HXD, the plaintiffs’ submission on this basis cannot be sustained. 175 Furthermore, as I have found above, LPQ was not dishonest in the receipt of the sum of $340,000. As there was no dishonesty to speak of on the part of LPQ, there is accordingly no dishonesty that can even be imputed to HXD by virtue of LPQ’s directorship.",
        "Claim in knowing receipt": "176 The plaintiffs have pleaded in SOC No. 2 that LPG, LPQ and/or HXD are liable for knowing receipt of the Investment Sum.321Foot Note 321×SOC No. 2 at para 29. 177 The constituents of liability for a claim in knowing receipt have been set out by the Court of Appeal inZageat [23]. There are three requirements: (a) the disposal of the plaintiff’s assets in breach of fiduciary duty;(b) the beneficial receipt by the defendant of assets which are traceable as representing the assets of the plaintiff; and(c) the knowledge on the part of the defendant that the assets received are traceable to a breach of fiduciary duty, such that it is unconscionable for him to retain the assets. 178 As against LPG, I am of the view that a claim in knowing receipt does not pass muster even under the first requirement at [177(a)] above. While the evidence shows that the Investment Sum had been returned by HXD and that the Investment Sum had flowed back into HXC’s bank account (see above at [26]–[27]), this was where the trail ends. There is no evidence to show that the Investment Sum had been used for purposes other than for the 10JS Project (see above at [154]). As the plaintiffs bear the burden of proving that there had been a breach of fiduciary duty by HXC to ground a claim in knowing receipt which is contingent on the said breach, the plaintiffs have not made out their claim in knowing receipt against LPG. 179 As against LPQ and HXD, any claim in knowing receipt fails at the third requirement at [177(c)] above. The critical question under this requirement is whether LPQ’s and HXD’s knowledge that the assets received are traceable to a breach of fiduciary duty are such that it would be unconscionable for them to retain the assets. On this issue, LPQ had no knowledge that the sum of $340,000 deposited into HXD’s bank account even belonged to the plaintiffs or that the Agreement existed.322Foot Note 322×AEIC LPQ at paras 47(e), 81(c)In other words, it cannot be said that LPQ and HXD possessed knowledge that the sum of $340,000 received was traceable to any breach of fiduciary duty. The Agreement was at all times an arrangement between the plaintiffs and HXC, with LPG acting as the latter’s representative. I do not see any evidence that LPG had disclosed to LPQ and the shareholders of HXD the plaintiffs’ Investment Sum. Neither do I see any reason for LPG to have done so since under the Agreement, the plaintiffs would be adopting a 20% stake in HXC’s $1.7m investment in the 10JS Project. Again, this arrangement was one that was strictly between the plaintiffs and HXC. I accept that LPQ and the other shareholders of HXD had operated under the belief that the money had been mistakenly deposited into HXD’s bank account. Contrary to the plaintiffs’ submission,323Foot Note 323×PCS at para 10.there was no reason not to accept LPQ’s explanation of a mistaken deposit. As LPQ explained, HXD’s bank account would usually hold not more than $10,000 on a day-to-day basis.324Foot Note 324×AEIC LPQ at para 30.The shareholders of HXD and LPQ would pump in additional funds as and when required to meet HXD’s expenses.325Foot Note 325×Ibid.LPQ’s evidence on the money flows into HXD’s bank account and how the running balance would usually not exceed $10,000 is consistent with Mr Yam’s evidence326Foot Note 326×AEIC Yam at paras 24 and 30.and is also supported by the following WhatsApp group chat messages exchanged amongst the shareholders of HXD and LPQ:327Foot Note 327×2AB246. [30/12/19 4:48:19pm] Pq: Brothers, the government tax for [the redeveloped 10JS properties] this year is 15,200. I will pay it first, please return me the money afterwards. Thank you [Folded hands Emoji] [30/12/19 4:51:05pm] 184. Chieng Khoy: [Thumbs up emoji] 180 The reason for the above arrangement is, according to Mr Yam, because HXD had no day-to-day operations and was only meant as an investment holding company of the various projects for the shareholders of HXD.328Foot Note 328×AEIC Yam at para 24.Since HXD had no day-to-day operations and its bank account balance did not usually exceed more than $10,000, LPQ’s belief that the sum of $340,000 could not have been intended for HXD was reasonable. This belief is even more reasonable when I consider that it had been LPG himself who contacted LPQ on or around 20 August 2018 to inform the latter about the purportedly mistaken deposit of the sum of $340,000.329Foot Note 329×AIEC LPQ at para 40.It is likely that prior to the call from LPG on or around 20 August 2018, neither LPQ nor HXD knew anything about the deposit of the sum of $340,000 into HXD’s bank account330Foot Note 330×AEIC LPQ at para 47(a).or that the sum even belonged to the plaintiffs.331Foot Note 331×AEIC LPQ at para 47(e);Certified Transcript 26 September 2023 at p 89 lines 1–8.In fact, LPQ had not even known of the plaintiffs until the present suit was commenced.332Foot Note 332×AEIC LPQ at para 81(c); Certified Transcript 26 September 2023 at p 89 lines 9–12. 181 The situation here is quite different from what happened inZage. That case involved a solicitor-trustee, Rasif, who misappropriated the plaintiff’s money to purchase jewellery without authority. Rasif absconded from Singapore. The plaintiff then claimed against Ho and his jewellery company, DeFred (who were the fourth and fifth defendants respectively in the underlying suit) in knowing receipt. The Court of Appeal held that the requirement of unconscionability was satisfied when Ho received the cash cheque and saw that the cheque was from a client’s account. It was then that Ho knew that the words “client account” meant that the money did not belong to Rasif but rather, Rasif’s client. The court considered it material that Ho was a man with substantial business and international experience and should have known that the transaction was not legitimate as Rasif had not informed them that he was purchasing on behalf of his client. Hence, the fact that Ho did not pause to make further inquiries and chose to cash in the cheque meant that the requirement of unconscionability was made out. This unconscionability was attributed to Ho’s company, DeFred, making it unconscionable for DeFred, to retain the benefits of the cheque. 182 The present case is different in at least two significant aspects. First, LPQ had no reason to believe otherwise than that the sum of $340,000 was mistakenly deposited into HXD’s bank account. LPQ’s belief that the deposit was in fact mistakenly made is corroborated by the contemporaneous messages sent by LPQ in the WhatsApp group chat involving himself and the shareholders of HXD where LPQ had updated his fellow investors of the successful withdrawal of the sum of $340,000 (in the form of two cash cheques of the sums of $150,000 and $190,000).333Foot Note 333×AEIC Ding at para 34(b); Agreed Bundle of Documents Vol 7 dated 12 September 2023 116, 188.If LPQ had been in cahoots with LPG as part of their concerted scheme to defraud the plaintiffs, there would have been little reason for LPQ to update his fellow investors. Second, quite unlike Ho inZagewho possessed significant business experience, LPQ cannot be said to have the same level of sophistication. 183 Therefore, LPQ (and HXD) did not possess the requisite knowledge to make out a claim in knowing receipt simply because LPQ did not ask LPG where the money came from or what the money was for. What was crucial was that, from the perspective of LPQ (and also the other shareholders of HXD such as Mr Yam), the Investment Sum was clearly not meant for HXD. LPQ cannot be faulted for accepting LPG’s explanation that the money had been mistakenly deposited into HXD’s bank account.",
        "Claims in unjust enrichment": "184 To succeed in a claim in unjust enrichment, a plaintiff must prove that (seeSkandinaviskaat [110]): (a) the defendant has been enriched;(b) the enrichment was at the plaintiff’s expense;(c) an unjust factor is present which makes it unjust to allow the defendant to retain the enrichment; and(d) the defendant has no defences available to it. 185 I shall consider whether the defendants were unjustly enriched in turn. Based on SOC No. 2, the plaintiffs pleaded that the defendants have been “unjustly enriched at the expense of the plaintiffs”.334Foot Note 334×SOC No. 2 at para 23.In the alternative, HXD “had been unjustly enriched at the expense of the plaintiffs either on the ground of total failure of consideration or on the ground of fraudulent misrepresentation”.335Foot Note 335×SOC No. 2 at para 24.As default judgment has already been entered against LPG and HXC, I shall consider only the claim in unjust enrichment against LPQ and HXD. 186 From the plaintiffs’ closing submissions, it appears that they are no longer pursuing the claim in unjust enrichment. However, for completeness, I shall address the question of whether a claim in unjust enrichment would have been made out against LPQ and HXD. 187 On the requirement of an enrichment, any argument that LPQ had been enriched is a non-starter since the Investment Sum had been deposited into HXD’s bank account, not LPQ’s personal bank account. As against HXD, however, it appears that HXD had been enriched when it unknowingly received the sum of $340,000 in its bank account. Where a defendant receives the plaintiff’s money, the defendant is enriched: see Tang Hang Wu,Principles of theLaw of Restitution in Singapore(Academy Publishing, 1st Ed, 2019) at para 03.006, citingBP Exploration Co (Libya) Ltd vHunt (No. 2)[1979] 1 WLR 783 at 799. 188 The question then is whether the enrichment of HXD had been unjust. The plaintiffs rely on two grounds in their claim on unjust enrichment against HXD.336Foot Note 336×Ibid.First, the ground of total failure of consideration. Second, the ground of fraudulent misrepresentation. I am not satisfied that either ground is made out against HXD rendering it liable to make restitution of the Investment Sum to the plaintiffs. 189 On the ground of total failure of consideration, the concept of failure of basis is summarised in Charles Mitchell, Paul Mitchell & Stephen Watterson,Goff & Joneson Unjust Enrichment(Sweet & Maxwell, 10th Ed, 2022) at para 12-01, as follows: … The core underlying idea of failure of basis is simple: a benefit has been conferred on the joint understanding that the recipient’s right to retain it is conditional. If the condition is not fulfilled, the recipient must return the benefit. … 190 The inquiry as to whether there is a failure of basis proceeds in two parts: first, what was the basis for the transfer in respect of which restitution is sought; and second, whether that basis has failed: seeBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 at [46]. 191 The inquiry as against HXD fails at the first part. There was never any “joint understanding” between the plaintiffs and HXD as to the basis on which HXD was to receive the Investment Sum. It is undisputed by the parties that there had been no communication between the plaintiffs and HXD (whether through LPQ or otherwise as the authorised representative) before and up to the time that the plaintiffs had invested in the 10JS Project through the Agreement. There was no opportunity in which any joint understanding could have arisen. Neither could it be said that HXD could be held responsible for any understanding that could have arisen between the plaintiffs and LPG. As I have found above at [116], LPG was not in control of HXD such that the actions of LPG do not bind HXD. 192 On the ground of fraudulent misrepresentation pleaded by the plaintiffs, I understood this to be a reference to the unjust factor of induced mistake. In light of my finding above at [134] that the plaintiffs’ claim that LPG is liable for fraudulent misrepresentation is not made out, there is accordingly no unjust factor arising on this ground. 193 In any event, HXD is not liable to the plaintiffs for unjust enrichment as HXD can avail itself of the change of position defence. I begin first with the three elements to a change of position defence as stated inManagement Corporation Strata Title Plan No 473 v De Beers Jewellery Pte Ltd[2002] 1 SLR(R) 418 (“De Beers”) at [35]: (a) the person enriched had changed his position;(b) the change wasbona fide; and(c) it would be inequitable to require the person enriched to make restitution or to make restitution in full. 194 On the first element that the payee has changed his position, the payee must demonstrate that there is a causal nexus between the payment received and his change of position in that he would not have changed his position “but for” the payment received: seeSkandinaviskaat [140]. 195 The second element that the payee must have actedbona fideessentially bars the defence to a person who has changed his position in bad faith or who is otherwise a “wrongdoer”: seeSeagate Technology Pte Ltd and another v Goh Han Kim[1994] 3 SLR(R) 836 (“Seagate”) at [31]. 196 As for the third element that it would be inequitable to require the payee to make restitution, the inequity itself must arise from the payee’s change of position, and in this all the circumstances relating to the change of position should be taken into consideration:Seagateat [31]. In addition, it would not be inequitable to require a payee to make restitution if he might have, in any event, incurred the expenditure in the ordinary course of things: seeDe Beersat [36]. 197 HXD can avail itself of a change of position defence. LPQ had made withdrawals in the form of two cash cheques for the sums of $150,000 and $190,000. This was effectively a disposal of the sum of $340,000 that HXD had received, and which forms the change in position by HXD. These sums were credited into HXC’s bank account the same day they were debited from HXD’s DBS bank account. HXD would not have made the withdrawals of the two cash cheques and returned them to LPG but for its belief that the deposit of this large sum had been mistakenly made into HXD’s DBS bank account. On this point, I have found above at [180] that LPQ held the reasonable belief that the sum of $340,000 deposited into HXD’s bank account had been mistakenly deposited. Needless to say, this belief held by LPQ, as a director of HXD, was attributable to HXD. LPQ had no reason to disbelieve LPG’s assurance that this was the case. HXD’s change in position whereby it had made the withdrawals was for this reason,bona fide. Furthermore, it would be inequitable to require HXD to make restitution of the sum of $340,000, a sum which had already been returned to LPG (through HXC). It must be borne in mind that, at all times, the person responsible for the misrepresentation to the plaintiffs was LPG. At no time did the plaintiffs deal with HXD (or LPQ). The picture which emerges from the facts is one where HXD had been unwittingly utilised by LPG as an intermediary funnel through which LPG was to have receipt of the plaintiffs’ money.",
        "Claim in conspiracy to defraud and/or conspiracy to injure by unlawful means": "198 The plaintiffs submit that the defendants are liable for conspiracy to defraud and/or conspiracy to injure by unlawful means.337Foot Note 337×SOC No. 2 at paras 30–31.This conspiracy arises because the defendants had combined together to fraudulently misrepresent to the plaintiffs with the intention of causing the plaintiffs to part with the Investment Sum on the pretext of investing in the 10JS Project.338Foot Note 338×SOC No. 2 at para 30.The defendants had thereafter diverted the Investment Sum for their own purposes other than for the 10JS Project.339Foot Note 339×Ibid.There is simply insufficient evidence to form any conclusion as to whether there was a conspiracy formed amongst the defendants to defraud and/or injure the plaintiffs by unlawful means. As I have found above at [134], there was no fraud perpetrated by LPG against the plaintiffs. There can accordingly be no conspiracy to defraud the plaintiffs. 199 As counsel for LPQ and HXD point out, Mr Peck himself was unsure whether there was even a conspiracy. When queried whether he was unsure that there was a conspiracy, Mr Peck accepted that “[u]nless I’m there, so I can’t be”.340Foot Note 340×Certified Transcript 20 September 2023 at p 84 lines 20–25, p 85 lines 1 –9.At best, the plaintiffs can point to the WhatsApp Conversation (see above at [115(g)]) purportedly showing LPG giving instructions to LPQ on how LPQ and HXD should behave in response to the claims made against them by Mr Ang in Suit 8.341Foot Note 341×2AB235–237.Indeed, this was the basis that Mr Peck identified for his belief that there “might be a conspiracy”.342Foot Note 342×Certified Transcript 20 September 2023 at p 85 lines 5–9.According to the WhatsApp Conversation, LPG had only confirmed that “everything involves [himself and HXC] only and does not involve [LPQ and HXD] at all” and his position that LPQ and HXD “are not related to this matter”.343Foot Note 343×2AB236.However, this alone is not proof of any conspiracy to defraud or to injure the plaintiffs by unlawful means. The WhatsApp Conversation merely shows that LPQ and HXD had nothing to do with Mr Ang’s and/or the plaintiffs’ claims against LPG and HXC, according to LPG. In my view, for the reasons set out above, the lack of involvement on the part of LPQ and HXD is palpable from the evidence tendered at trial. Furthermore, what LPG said in the WhatsApp Conversation could be said to be factually correct,ie, LPQ was not involved as regards the plaintiffs. The WhatsApp Conversation does not even go so far as to provide confirmatory evidence of LPQ taking instructions from LPG.",
        "Conclusion": "200 In summary, I make the following findings: (a)The nature of the plaintiffs’ claim under the Agreement: On an objective interpretation of the Agreement and the intention of the parties, the Agreement is structured as an investment, notwithstanding that the language in the Agreement suggests that it may be a loan (see above at [73]–[89]). The plaintiffs and LPG/HXC entered into a written Agreement with oral terms that the plaintiffs was assured a 20% returns on the Investment Sum (see above at [90]–[96]). (b)LPQ and/or HXD are not liable to the plaintiffs for LPG’s alleged fraudulent misrepresentation: The plaintiffs’ list of alleged representations had, in fact, been made by LPG. However, the alleged representations by LPG were not fraudulent misrepresentations and could not amount toactionablemisrepresentations. It was incorrect for LPG to have represented to the plaintiffs that he was in control of HXD when he was not. LPG is not ultimately liable for fraudulent misrepresentation because he lacked the requisite state of mind to defraud. In my view, the evidence shows that LPG appeared to genuinely believe that he was in control of HXD (see above at [134]). Accordingly, in the absence of any fraudulent misrepresentation, there is no issue of LPQ or HXD being held liable for LPG’s alleged fraudulent misrepresentation. In any event, the representations were made solely by LPG to the plaintiffs. There is not an iota of evidence to suggest that LPQ and/or HXD were aware of the Agreement entered into between the plaintiffs and LPG and/or HXC. Hence, LPQ and HXD cannot be liable even if there had been any fraudulent misrepresentation on the part of LPG (see above at [135]–[144]). (c)There is no constructive trust arising against LPQ and/or HXD: While a transfer of property may give rise to an institutional constructive trust as against the fraudulent transferee, no constructive trust arises on this basis in light of my finding that there is no fraud here. In any event, LPQ and/or HXD are not responsible for LPG’s misrepresentations for a constructive trust to be imputed on them. Furthermore, the plaintiffs have not shown that it was unconscionable for LPQ and/or HXD to have returned the Investment Sum to LPG. There is no evidence that LPG did not use the Investment Sum for the purposes of the 10JS Project (see above at [154]). (d)There is no Quistclose trust arising against HXD: The Agreement was ultimately one between the plaintiffs and HXC, not HXD. There is nothing in the Agreement stipulating thatHXDis restricted from having free disposition of the sums advanced (see above at [160]). (e)LPQ and HXD are not liable for dishonest assistance: The present case ought to be properly analysed as a case of knowing receipt rather than dishonest assistance. In knowing receipt, the level of participation involvespassivereceipt. In contrast, dishonest assistance is concerned with moreactiveforms of assistance. LPQ’s and HXD’s involvement here were, at best, only in the form of passive receipt, not active assistance (see above at [166]). In any event, LPQ and HXD do not possess the requisite dishonesty because they were not even involved in the Agreement (see above at [167] –[175]). (f)LPQ and HXD are not liable for knowing receipt: The claim against LPQ is unsustainable because the plaintiffs are unable to show that there has been a disposal of their assets in breach of fiduciary duty. There is no evidence to show that the Investment Sum had been used for purposes other than for the 10JS Project (see above at [178]). As against LPQ and HXD, they simply did not know that the assets received are traceable to a breach of fiduciary duty, making it unconscionable for them to retain the assets (see above at [179]). (g)LPQ and/or HXD were not unjustly enriched: LPQ cannot be said to have been enriched because the Investment Sum had been deposited into HXD’s bank account, not LPQ’s personal bank account. As for HXD, while it was undoubtedly enriched by the receipt of money into its bank account, albeit for a very short period of time, this enrichment was not unjust. There was no total failure of consideration because there was never any “joint understanding” between the plaintiffs and HXD as to the basis on which HXD was to receive the Investment Sum (see above at [191]). There was also no fraudulent misrepresentation which would have rendered the enrichment unjust based on the factor of induced mistake (see above at [192]). In any event, HXD can avail itself of the change of position defence because HXD had deposited the money into HXC’s bank account. This was donebona fide,and it would be inequitable for HXD to make restitution of the Investment Sum when the person responsible for the deposit was, at all times, LPG (see above at [197]). (h)There is no conspiracy to defraud and/or injure the plaintiffs by unlawful means: The plaintiffs’ submission of a conspiracy amongst the defendants fails because there is no evidence to support this allegation. Mr Peck himself was unsure whether there was even a conspiracy. Furthermore, the best piece of evidence of the plaintiffs was in the form of the WhatsApp Conversation, purportedly showing LPG giving instructions to LPQ on how LPQ and HXD should behave in response to the claims made against them by Mr Ang in Suit 8. The WhatsApp Conversation does not go so far as to confirm the existence of a conspiracy (see above at [199]).  201 For all the reasons stated above, I dismiss the plaintiffs’ claims against LPQ and HXD. I order that costs are to be agreed or taxed. Tan Siong ThyeSenior Judge Foo Maw Shen, Chu Hua Yi and Goh Jia Jie (FC Legal Asia LLC) for the plaintiffs; Singh Ranjit and Teo Jun Wei Andre (Francis Khoo & Lim) for the second and fourth defendants; The first and third defendants absent and unrepresented.",
        "": "",
        "Annex 1: Table of the Change in Directorships and Shareholding for HXC and HXD": ""
    }
}