{
    "case_title": "Baker, Michael A (executor of the estate of Chantal Burnison, deceased) vBCS Business Consulting Services Pte Ltd and others",
    "ncitation": "[2024] SGHC(I) 2",
    "coram": "Andre Maniam J (delivering the judgment of the court)",
    "sections": {
        "Introduction": "1 This is a judgment about the consequences of disobeying an anti-suit injunction (“ASI”). 2 At the hearing on 6 September 2023, we decided that defendants BCS Business Consulting Services Pte Ltd (“BCS”) and Mr Marcus Weber (“Weber”) – BCS’s sole shareholder and sole director – had committed contempt of court by disobeying the ASI issued against them on 19 November 2021. We reserved our decision on the punishment for their contempt. 3 In relation to Mr Hartono Sianto (“Sianto”), who was previously the sole director of BCS, we reserved our decision on whether he had committed contempt, and if so, what punishment would be appropriate. 4 Besides the application for an order of committal in SIC/SUM 9/ 2023 (“SUM 9”), we also had before us an application by SIC/SUM 22/2023 (“SUM 22”) to amend SUM 9 to seek a director disqualification order against Weber under s 154(2)(a) of the Companies Act 1967 (2020 Rev Ed) (the “Companies Act”). We directed the relevant parties to make further submissions on SUM 22, which we have since received and considered.",
        "Background": "",
        "The Dispute": "5 Dr Chantal Burnison (“Chantal”) was the co-inventor of a compound called Ethocyn, a skin product said to make the skin look younger and better toned. Ethocyn was supplied to cosmetic manufacturers such as Nu Skin International (“Nu Skin”). Nu Skin made payments to BCS under a supply and distribution agreement. 6 A dispute arose over the rights to the inventions and patents relating to Ethocyn (the “Ethocyn Rights”). The plaintiff, Mr Michael Baker (“Baker”), as the executor of Chantal’s estate, contended that there was a trust (“the Trust”) whereby Weber held the Ethocyn Rights and any income or proceeds generated from them on trust for Chantal (the “Trust Assets”), less 5% of such income and proceeds going to Weber as a commission – that trust covered 95% of monies paid by Nu Skin to BCS (the “Trust Moneys”). 7 Weber contended that he had purchased the Ethocyn Rights as a personal investment opportunity, and that all moneys earned from them belonged to him and his companies (including BCS and the third defendant, Renslade Holdings Limited (“Renslade (HK)”)).",
        "The Suit 3 Judgment": "8 On 20 November 2017, Baker sued BCS, Weber and Renslade (HK) (collectively, the “Defendants”) in HC/S 1070/2017, which was transferred to the Singapore International Commercial Court (“SICC”) as SIC/S 3/2018 (“Suit 3”). After a trial, on 29 April 2020 the SICC gave Baker judgment1Foot Note 1×Judgment SIC/JUD 5/2020.(inBaker, Michael A (executor of the estate of Chantal Burnison, deceased) v BCS Business Consulting Services Pte Ltd and others[2020] 4 SLR 85 (the “Suit 3 Judgment”)) for the following: (a) a declaration that BCS and/or Renslade (HK) held the Ethocyn Rights and the Trust Assets (including the Trust Moneys) on trust for the estate of Chantal; (b) the Defendants were to provide a detailed account of all the transactions which had taken place in respect of the Trust Assets and Trust Moneys within 14 days from the date of judgment; (c) the Defendants were to account to Baker the Trust Assets and Trust Moneys, and Baker was at liberty to trace and recover the Trust Assets and Trust Moneys, if necessary. The Defendants had to pay Baker all sums due to Baker on the taking of the account of the Trust Assets and Trust Moneys; (d) the parties were at liberty to apply to the court for any orders or directions in relation to the taking of accounts of the Trust Assets and Trust Moneys; (e) Weber was to pay to Baker 9.5m Swiss franc (“CHF”) plus interest at the rate of 3% per annum calculated from the date the sum of CHF9.5m was loaned to Weber to the date of judgment and the post judgment interest rate of 5.33% per annum calculated from after the date of judgment until the said sum of CHF9.5m plus interest was repaid; (f) the sum of US$10,330,658.91, which was paid by Renslade (HK) into court pursuant to SIC/ORC 2/2020 dated 11 January 2020, was to be released to Baker and/or his solicitors; and (g) the Defendants were to pay Baker the costs of the action. 9 By CA/CA 76/2020 (“CA 76”), the Defendants appealed against the Suit 3 Judgment. The appeal was dismissed on 19 January 2021.2Foot Note 2×CA/ORC 5/2021.With reference to the Suit 3 Judgment, the Court of Appeal stated: “We agree with the comprehensive judgment of the court below. In our view, we see no reason to disturb any of the findings made therein, or the orders made.” (seeBaker, Michael A (executor of the estate of Chantal Burnison, deceased) v BCS Business Consulting Services Pte Ltd and others[2022] 3 SLR 103 (the “ASI Judgment”) at [24])",
        "The ASI Judgment and ASI Appeal": "10 After Baker sued the Defendants in Singapore in November 2017, on 8 August 2019, BCS sued Baker and BCS Pharma corporation (“BCS Pharma”) – one of Chantal’s US companies – in California (the “Californian Proceedings”). In the Californian Proceedings, BCS alleged,inter alia, that Baker and BCS Pharma had interfered with the contractual relationship between BCS and Nu Skin (the “Initial Complaint”). By agreement, BCS, Baker, and BCS Pharma thereafter agreed to a stay of the Californian Proceedings pending the outcome of the Defendants’ appeal against the Suit 3 Judgment,ie, CA 76, and the Californian Proceedings were stayed on 30 June 2020. As mentioned, CA 76 was dismissed on 19 January 2021. On 26 March 2021, the stay on the Californian Proceedings was lifted. On 16 June 2021, Baker applied by SIC/SUM 37/2021 (“SUM 37”) for an ASI to restrain the prosecution of the Californian Proceedings. On 19 November 2021, the SICC granted the ASI against the Defendants by way of the ASI Judgment. 11 BCS filed various versions of its Complaint which set out its claim in the Californian Proceedings (the full details of which may be found in the ASI Judgment at [29]–[42] andBCS Business Consulting Services Pte Ltd and others v Baker, Michael A (executor of the estate of Chantal Burnison, deceased)[2023] 1 SLR 1 (the “ASI Appeal”) at [27]–[28]): (a) on 8 August 2019, BCS filed its Initial Complaint; (b) on 27 April 2021, BCS filed a “First Amended Complaint”; (c) on 27 August 2021, BCS filed a “Second Amended Complaint”; and (d) on 7 April 2022 (after the ASI was issued on 19 November 2021), BCS filed a “Third Amended Complaint”. 12 In the ASI Judgment, the SICC found as follows (at [91]): … many of the claims pursued by BCS in the Californian Proceedings amount to an attempt at relitigating matters already decided by this court, and thus vexatious and oppressive and amount to an abuse of process. We also find that BCS’s claims are vexatious and oppressive towards the Estate. Moreover, these claims relitigating the same issues that have been decided by this court amount to a collateral attack of this court’s Judgment … This justifies the issuance of an ASI against BCS, to restrain BCS from relitigating the subject-matter of the Suit against the Estateandthe US Defendants through the Californian Proceedings. 13 The SICC thus issued the ASI, in the following terms: (1) [BCS] is herebyrestrained, whether acting by itself, its officers, its servants or agents or otherwise, from prosecuting or continuing to prosecute proceedingsunder Case No. 2:19-cv-06914-JWH-JPR [ie, the Californian Proceedings], commenced by [BCS] in the United States District Court for the Central District of California in the United States of America on 8 August 2019, against [Baker], both in his individual and personal capacity and as well as his capacity as the Executor of the Estate of Chantal Burnison, deceased, and against [BCS Pharma], Heika Burnison (“Heika”), Birka Burnison (“Birka”), Grey Pacific Labs, LLC (“Grey Pacific Labs”) and Grey Pacific Science, Inc (“Grey Pacific Science”), insofar as such proceedings relate to the existence, validity and/or enforceability of the Trust in the Ethocyn Rights and assets held on behalf of [Chantal] and now, her estate (“Estate”), andany issues relating to the reliance on and/or assertion of the said Trust or any issues litigated before the Singapore Courts in SIC/S 3/2018, the Judgment dated 29 April 2020 and CA/CA 76/2020. (2) [BCS] shall not be restrained in Case No. 2:19-cv-06914-JWH-JPR, commenced by [BCS] in the United States District Court for the Central District of California in the United States of America on 8 August 2019, from pursuing claims against [Baker], BCS Pharma, Heika, Birka, Grey Pacific Labs and Grey Pacific Science for claims against [Baker] for allegedly holding himself out as an officer of [BCS] or for signing of the assignment agreement transferring the trademark rights, and the settlement agreement with Nu Skin, and for claims against Heika, as an officer of Grey Pacific Labs, for allegedly willingly entering into the assignment agreement for the trademark rights knowing that [Baker] is not an officer of [BCS], or for claims related thereto, provided always that they do not relate to the existence, validity and/or enforceability of the Trust in the Ethocyn Rights and assets held on behalf of [Chantal] and now, her Estate, and any issues relating to the reliance on and/or assertion of the said Trust or any issues litigated before the Singapore Courts in SIC/S 3/2018, the Judgment dated 29 April 2020 and CA/CA 76/2020. (3) [BCS] and [Renslade (HK)] are herebyrestrained, whether acting by themselves, their officers, their servants or agents or otherwise, and [Weber] is herebyrestrained, whether acting by himself, his servants or agents or as a director, officer or servant or agent or shareholder of[BCS]and[Renslade (HK)]or otherwise,from prosecuting or continuing to prosecute proceedingsin the United States of America or anywhere else in the world against [Baker], whether in his personal capacity and/or his capacity as the Executor of the Estate, Heika and/or Birka, insofar as any such proceedings relate to the existence, validity and/or enforceability of the Trust in the Ethocyn Rights and assets held on behalf of [Chantal] and now, her Estate, andany issues relating to the reliance on and/or assertion of the said Trust or any issues litigated before the Singapore Courts in SIC/S 3/2018, the Judgment dated 29 April 2020 and CA/CA 76/2020. (4) Costs are awarded to [Baker] to be borne by the Defendants, jointly and severally… (5) There shall be liberty to apply, and generally. [emphasis added] 14 We refer to the claims that BCS, Weber, and Renslade (HK) were injuncted by the ASI from prosecuting or continuing to prosecute in the Californian Proceedings, as the “Injuncted Claims”. 15 By CA/CA 70/2021 (“CA 70”), the Defendants appealed against the ASI Judgment. The appeal was dismissed on 21 September 2022. In its judgment, the Court of Appeal stated (ASI Appeal at [28]) that the claims made under the Second and Third Amended Complaints could essentially be grouped into four categories: (a) the “Intercepted Payment Claims”; (b) the “Trademark Claims”; (c) the claim in judicial estoppel; and (d) the “Wrongful Settlement Claims”. 16 The Court of Appeal found (ASI Appeal at [61] and [63]) that “the claim in judicial estoppel was in substance raised and decided in Suit 3” and that “the claim in judicial estoppel pursued by BCS in the Californian Proceedings amounts to an undermining of the key findings in the Suit 3 Judgment as regards the existence and enforceability of the Trust.” 17 The Court of Appeal stated (ASI Appeal at [87]): We agree with the assessment of the SICC that BCS’s pursuit of the Intercepted Payment Claims as well as part of the Trademark Claims also amounts to a relitigation of the issues as regards the existence and enforceability of the Trust which were determined in Suit 3. It follows that this would also undermine the Suit 3 Judgment on these key findings. 18 As for the Wrongful Settlement Claims, the Court of Appeal agreed with the SICC that those claims were not raised and therefore not strictly decided in Suit 3 (ASI Appeal at [42] and [89]), but commented that “it remains open to [Baker] to assert in the Californian Proceedings that the Wrongful Settlement Claims ultimately relate to the Ethocyn Rights that belong to [Baker] or the Estate” (ASI Appeal at [89]). 19 The Court of Appeal thus upheld the ASI, stating: “[i]n the light of our decision, the [Defendants] are to take steps to withdraw from the Californian Proceedings the claims which are within the ambit of the ASI [ie, the Injuncted Claims].” (ASI Appeal at [94]) 20 BCS, however, did not do so.",
        "Findings": "",
        "Whether BCS and Weber had committed contempt": "21 BCS and Weber did not file any reply affidavits to oppose the contempt application against them, other than an affidavit from a US lawyer representing BCS in the Californian Proceedings seeking to explain why certain statements made by him (BCS’s US lawyer) during the Californian Proceedings did not amount to admissions of breach of the ASI. Nor did BCS and Weber put forward written or oral submissions to dispute that they hadcommittedcontempt. Their submissions are only on the potentialpunishmentfor contempt: they contend that a fine would be appropriate for both BCS and Weber,ie, that Weber should not be punished with imprisonment. 22 BCS and Weber clearly knew of the ASI: they appealed against it. It is also clear that the ASI had been breached in that the Injuncted Claims had not been withdrawn from the Californian Proceedings, but were continuing to be prosecuted there. As the Court of Appeal noted in the ASI Appeal, the ASI was breached in that three Injuncted Claims that were in the Second Amended Complaint of 27 August 2021 (prior to the ASI of 19 November 2021) were retained in the Third Amended Complaint of 7 April 2022 (after the ASI), namely: the “Intercepted Payment Claims”, the part of the “Trademark Claims” within the ASI, and the claim in judicial estoppel. 23 Despite the dismissal of CA 70, the Court of Appeal calling on the Defendants “to take steps to withdraw from the Californian Proceedings the claims which are within the ambit of the ASI” (ASI Appeal at [94]), and Baker’s lawyers’ demand for compliance the next day (22 September 2022), BCS and Weber continued to prosecute the Injuncted Claims in the Californian Proceedings. 24 Instead, BCS proposed to file a Fourth Amended Complaint which would still not withdraw the Injuncted Claims from the Californian Proceedings. In BCS’s motion for leave to file the Fourth Amended Complaint, filed on 25 January 2023, BCS acknowledged that ithad not compliedwith the ASI, and that the proposed Fourth Amended Complaintwould still not complywith the ASI. BCS stated in its Memorandum of Points and Authorities:3Foot Note 3×Baker’s Statement of Committal dated 7 February 2023 at para 51, and pp 399–400 (Annex 16, p 4, line 26, to p5, line 4, of BCS’s Memorandum of Points and Authorities in the Californian Proceedings). Ultimately, however, it became apparent that to amend the pleadings in this case so as to fully comply with the Singapore injunction would be to surrender important rights that [BCS] seeks to vindicate in this case. [BCS’] claims, in significant part, depend on contesting the Singapore orders’ conclusion … that a trust existed. [BCS] is not able to comply fully with the anti-suit injunction while protecting its rights under California and federal law. 25 BCS was saying that ithad notcomplied with the ASI, and that itwould notdo so. Contempt by BCS 26 Under s 4(1)(a) of the Administration of Justice (Protection) Act 2016 (2020 Rev Ed)(the “AJPA”), “[a]ny person who intentionally disobeys or breaches any judgment, decree, direction, order, writ or other process of a court … commits a contempt of court.” 27 We find that BCS committed contempt of court as set out in Baker’s Statement of Committal dated 7 February 2023, in that BCS intentionally disobeyed (or breached) the ASI. Contempt by Weber 28 We find that Weber too had committed contempt of court. He was the owner and controller of BCS, and (as Sianto states in his affidavit) Weber was the one instructing US lawyers on the conduct of the Californian Proceedings.4Foot Note 4×Affidavit of Hartono Sianto dated 6 July 2023 at paras 7–8.Weber was named in the ASI and expressly restrained “whether acting by himself, his servants or agents or as a director, officer or servant or agent or shareholder of BCS and Renslade (HK) or otherwise, from prosecuting or continuing to prosecute proceedings in the United States of America” against Baker and others, in respect of the Injuncted Claims (above at [13]). We find that Weber committed contempt of court as set out in Baker’s Statement of Committal dated 7 February 2023, in that Weber intentionally disobeyed (or breached) the ASI.",
        "Punishment for contempt under the AJPA – BCS and Weber": "29 Under s 12(1)(a) of the AJPA, a person who commits contempt of court shall be liable to be punished with a fine not exceeding $100,000 or with imprisonment for a term not exceeding three years or with both. 30 Baker seeks a fine of at least $70,000 in relation to BCS, and imprisonment for a term of at least 12 months for Weber. BCS and Weber submit that a fine would be appropriate,ie, that Weber should not be punished with imprisonment. Preliminary point – relevance of matters after the Statement of Committal which sets out the alleged contempt 31 We found BCS and Weber to havecommittedcontempt as set out in the Baker’s Statement of Committal dated 7 February 2023. In determiningpunishment, however, Baker says it is relevant to also consider the continuing conduct of BCS and Weber after the date of the Statement of Committal, whereas BCS and Weber contend that the court should not look beyond the Statement of Committal. 32 There are three aspects to BCS’s and Weber’s subsequent conduct that are potentially relevant to a determination of the appropriate punishment: (a) first, the breach of the ASI continues, in that BCS and Weber have not withdrawn the Injuncted Claims but continue to prosecute them in the Californian Proceedings; (b) second, on 14 July 2023, BCS filed an application in the Californian court for an ASI (the “US ASI”) to enjoin Baker from prosecuting this very contempt application or otherwise enforcing the (Singapore) ASI – that US ASI application was heard on 11 August 2023 and dismissed on 5 September 2023; and (c) third, on 24 July 2023, BCS filed anex parteapplication in the Californian court for a temporary restraining order (“TRO”) in the same terms as its US ASI application – that TRO application was dismissed on 26 July 2023. 33 BCS and Weber citeMok Kah Hong v Zheng Zhuan Yao[2016] 3 SLR 1 (“Mok Kah Hong”) at [61] for the proposition that the statement of committal filed pursuant to O 52 r 2(2) of the Rules of Court (Cap 322, 2014 Rev Ed) (the “ROC 2014”), which sets out the grounds for the application for leave to apply for an order of committal, “serves a crucial role in enabling the respondent to know the case that has been put forth against him. It also functions as the boundaries of the applicant’s case, such as to prevent the applicant from relying on grounds that have been omitted from the statement.” In finding that BCS and Weber hadcommittedcontempt, we did not go beyond Baker’s Statement of Committal – it was unnecessary for us to do so. It does not, however, follow that conduct beyond the Statement of Committal is irrelevant to the question ofpunishment: (a) First, the proposition stated inMok Kah Hongat [61] is not an absolute one – in the same paragraph, the Court of Appeal recognised that, pursuant to O 52 r 5(3) of the ROC 2014, the court may give the applicant leave to rely on grounds other than those set out in the statement of committal. (b) Second, as the Court of Appeal held inTay Kar Oon v Tahir[2017] 2 SLR 342 at [44], “[i]t follows from the principle that the court has the power to order committal on its own motion that the court must also have the power to grant an order for committal on matters not within an O 52 r 2(2) statement (or indeed, when there is no O 52 r 2(2) statement).” The court may, on its own motion, pursue an allegation of contempt not contained in an applicant’s contempt statement (O 52 r 4 of the ROC 2014). (c) Third, conduct occurring after a statement of committal is filed may constitute aggravating or mitigating circumstances relevant to the court’s decision onpunishmentfor contempt. InSTX Corp v Jason Surjana Tanuwidjaja[2014] 2 SLR 1261 at [85], the court considered a contemnor’s lack of requisite deference in respect of the court orders binding him, as “demonstrated in the nonchalant manner in which he responded to questioning during cross-examination” during the committal proceedings. InWang Xiaopu v Goh Seng Heng and another[2021] SGHC 282 at [31], the court likewise considered the contemnor’s conduct in the contempt proceedings. InPT Sandipala Arthaputra v STMicroelectronics Asia Pacific Pte Ltd and others[2018] 4 SLR 828 (“Sandipala”) at [83], the court looked at events occurring after the breaches of the relevant court orders, for the purposes of assessing whether the contemnors had taken steps to mitigate and/or purge their contempt, and found that they had not shown any genuine remorse or taken real and substantial steps to address the breaches. See alsoAero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd and another appeal[2020] 2 SLR 822 at [92] where the Court of Appeal recognised that facts not set out in the statement of committal can be considered as part of the background facts for the charges that are made out when it comes to considering the appropriate sentence for those charges. 34 BCS’s and Weber’s subsequent conduct is therefore relevant to the question ofpunishmentfor their contempt. This conduct was squarely put in issue by Baker’s evidence and submissions, and BCS and Weber filed an affidavit from BCS’s US lawyer that addressed the US ASI application and TRO application. BCS and Weber were accorded, and took, the opportunity to address their subsequent conduct. Punishment for contempt under the AJPA - BCS 35 We consider that the circumstances in the present case justify a higher fine than the $70,000 fine imposed inWestBridge Ventures II InvestmentHoldings v Anupam Mittal[2022] SGHC 270 (“WestBridge”). We discuss this in greater detail in the next section. We impose a fine of $80,000 against BCS. Punishment for contempt under the AJPA - Weber 36 For Weber, the key issue is whether he should be punished with imprisonment, or whether a fine would suffice. The court inSembcorp Marine Ltd v Aurol Authony Sabastian[2013] 1 SLR 245 (“Aurol”) framed the issue as follows (Aurolat [67]): The various factors taken into account for a custodial sentence are different ways of answering one question: Is a fine adequate to punish and deter contemptuous behaviour? The nature of that behaviour, the motives for it, and the ameliorative and deterrent effect of a fine are all relevant factors. 37 In the same case, the court listed various (non-exhaustive) considerations (Aurolat [68]), including thenatureof the contemptuous act. In that regard, the court will consider to what extent the contemptuous act was egregious; and in assessing the gravity of the act, the court will consider the purpose of the order breached and the impact of that breach on that purpose. 38 Baker cited the English decision inMobile TelecommunicationsCo KSC v HRH Prince Hussam Bin Abdulaziz Au Saud[2018] EWHC 3749 (Comm) (“Mobile Telecommunications”) where a 12-month term of imprisonment was imposed for breach of an ASI. The court recognised the importance of ASIs; they are, in many ways, just as important as freezing orders, they seek to preserve the rights of claimants who have valid dispute resolution clauses and may have valid awards of judgments, and if ASIs are broken, that is a most serious matter and in many respects just as serious as a breach of a freezing order. 39 In similar vein isDell Emerging Markets (EMEA) Ltd and others v Systems Equipment Telecommunications Services SAL and others[2020] EWHC 1384 (Comm) (“Dell”) where the court stated at [16]: Contemptuous breaches of anti-suit injunctions are to be treated for sentencing purposes as analogous to breaches of freezing injunctions. In both cases a breach of the court's order is a serious attack on the administration … As the Court of Appeal emphasised inMcKendrick[Financial Conduct Authority v McKendrick[2019] 4 WLR 65], the inherent seriousness of a breach of a freezing order is such that it is likely that nothing other than a prison sentence will be sufficient to punish it ... Similar considerations apply in my view to serious breaches of an anti-suit injunction. 40 The gravity of a breach of a freezing order is well accepted in Singapore. InTechnigroup Far EastPte Ltd and another v Jaswinderpal Singh s/o Bachint Singh and others[2018] 3 SLR 1391 (“Technigroup”), the court stated at [110]: Deliberate and substantial breaches of the disclosure provisions of a freezing order tend to be treated as a serious matter because any subsisting non-disclosure increases the risk that assets may be dissipated without accountability, which in turn undermines the very purpose of a freezing order and the other party’s ability to satisfy his claim. For this reason, such a breach normally attracts an immediate custodial sentence (JSC BTA Bank v Solodchenko (No 2)[2012] 1 SLR 350 at [51]). 41 In that case, the court imposed a term of four months’ imprisonment on the first and second defendants, suspended for four weeks to give them a final opportunity to fully comply with their discovery obligations (under the specific discovery orders in that case). 42 InOCM Opportunities Fund II, LP and others v Burhan Uray (alias Wong Ming Kiong) and others[2005] 3 SLR(R) 60, the court imposed imprisonment terms of six months for (among other things) breaches of a freezing order in relation to disclosure of assets and accounting for expenditure. 43 InBTS Tankers Pte Ltd v Energy & CommodityPte Ltd and others[2021] SGHC 58, the court imposed imprisonment terms of seven months and five months, respectively, on the two contemnors, for breach of disclosure obligations under freezing orders, but suspended those for seven days to give them an opportunity to comply. 44 Weber, however, contends that we should not follow the English cases (likeMobile Telecommunications) in drawing an analogy between breaches of an ASI and breaches of a freezing order. Weber submits that in those English cases, imprisonment is viewed as a matter of first resort, whereas it is recognised in Singapore that imprisonment for contempt is usually a matter of last resort (Sandipalaat [68];Technigroupat [104];Mok Kah Hongat [96];WestBridgeat [165]). 45 We reviewed the English cases in the manner stated inMok Kah Hong(at [105]),ie, not for sentencing benchmarks, but for factors taken into consideration by the court in deciding on the appropriate sentence. 46 The English cases could not be distinguished in the way Weber suggested: the English cases were not decided based on imprisonment being a matter of first resort. Thus, inMobile Telecommunications, the court considered whether there was any practical alternative to imprisonment (at [33]), and inDellthe court expressed the sentences of imprisonment imposed as being “necessary” (at [18], [21], and [24]); in both decisions, the court was mindful of imposing the shortest period of imprisonment necessary (Mobile Telecommunicationsat [33];Dellat [18], [21], and [24]). 47 As a matter of principle, we agree with the observations in the English cases that breaches of ASIs are analogous to breaches of freezing orders. An ASI seeks to protect a claimant’s rights to have its dispute decided in the appropriate forum, and to protect the eventual judgment where that has been entered (as it has in the present case). An ASI is similar in purpose to a freezing order, both seek to protect a claimant from being deprived of the fruits of successful litigation. Moreover, the Court of Appeal held in its CA 70 judgment (ASI Appeal at [53] and [54]) that the issuance of the ASI was justified ontwojurisdictional bases: first, to prevent an abuse of the forum court’s process, or the need to protect the processes, jurisdiction or judgments of the forum court; and second, to halt vexatious and oppressive conduct, in that it would also be vexatious and oppressive to Baker for BCS to seek to relitigate in the Californian Proceedings matters which were already decided between them in the Suit 3 Judgment and in CA 76. The fact that a final and unappealable judgment had already been entered, which BCS and Weber continue to seek to undermine in the Californian Proceedings, makes their contempt even more serious. 48 Besides seeking to distinguish the English cases, Weber relies onWestBridge, where the court had considered a fine to be the appropriate punishment for the breach of an ASI in that case (at [169]). 49 The court inWestBridge, however, noted that the appropriate punishment for contempt is fact specific: it “will depend on the facts of theindividual caseand the nature of the contempt” (WestBridgeat [166]). The court agreed with the decision inAurol(at [67]) that “the underlying question is whether a fine would be adequate topunishanddetercontemptuous behaviour” (WestBridgeat [166]). 50 The court’s reasons for not imposing a punishment of imprisonment inWestbridgewere expressed as follows (at [169]): Applying these factors [set out at [167] – [168]], in my judgment, a fine would be appropriate in this case. While I accept that the defendant’s breaches are deliberate and continuing, this feature does not automatically justify or necessitate an imprisonment term (at least in this case). Most of the other grounds for a custodial sentence are not engaged – for instance, the defendant has not previously been found to be in contempt of court, be it for breach of the interim ASI granted in ORC 1463 or otherwise. Neither has the plaintiff shown that a fine would be any less of a deterrent than a term of imprisonment, particularly for a contemnor resident abroad like the defendant. 51 Various differences with the facts inWestbridgemay be noted. 52 First, Weber is not “resident abroad” like the contemnor inWestbridge: in 2002 Weber obtained permission to work in Singapore, and since 2003 he has been a permanent resident of Singapore – as noted in the Suit 3 Judgment (at [2]). 53 Weber did not put forward any evidence or even submit that he was no longer resident in Singapore, albeit holding permanent residency status here. It appears that Weber still has a place of residence here, at which service was attempted. Moreover, Weber recently (on 2 May 2023) took over from Sianto as the sole director of BCS, and s 145(1) of the Companies Act requires every company to have at least one director who is ordinarily resident in Singapore. Weber’s taking office as BCS’s sole director was a representation that he was ordinarily resident in Singapore. 54 To a contemnor like Weber who is ordinarily resident in Singapore, a term of imprisonment can have a greater deterrent value than a fine. 55 Second, the conduct in the present case was more active than that inWestbridge. Although the contemnor inWestbridgedid not withdraw proceedings as required by the ASI, he did not seek to expedite their resolution either, but kept the prohibited proceedings alive by repeatedly adjourning them. Furthermore, by the time the court came to deal with the contempt, the proceedings were still pending (seeWestBridgeat [14] and [59]–[60]). Here, BCS and Weber: (a) amended the Complaint in the Californian proceedingsafterthe ASI had been ordered, in a manner which retained the Injuncted Claims in the earlier Complaint; (b) applied for a US ASI on 14 July 2023 to enjoin Baker from prosecuting this contempt application or otherwise enforcing the (Singapore) ASI – that US ASI application was heard on 11 August 2023 and dismissed on 5 September 2023 (above at [32(b)]); and (c) appliedex parteon 24 July 2023 for a TRO in the same terms as its US ASI application, which TRO application was dismissed on 26 July 2023 (above at [32(c)]). 56 InMok Kah Hongat [110], the Court of Appeal noted that the imposition of a higher sentence would be warranted “in cases where the alleged contemnor acts in contumelious disregard of the judgment or order and makesnoattempt whatsoever to effect compliance, or worse still, takespositive stepsto frustrate the effect of the order of court.” 57 The applications for the US ASI and US TRO struck at the (Singapore) ASI against BCS and Weber, and the present contempt application to enforce it. Moreover, BCS and Weber sought an early decision by the Californian court on those applications in the hope of pre-empting the Singapore contempt hearing. The Californian court did indeed decide those applications before the Singapore contempt hearing, but those applications were decidedagainstBCS and Weber. 58 InWestbridge, the contemnor had earlier sought an anti-enforcement injunction (“AEI”) from the foreign court in relation to aninterimSingapore ASI issued against him. After the Singapore court granted apermanentASI (which was the relevant court order for the contempt proceedings inWestBridge), he then amended the reliefs sought in the injuncted foreign proceedings (including the AEI) to refer to the permanent ASI. This was a contumacious and persistent breach that was orchestrated to undermine or ignore the effect of the Singapore ASI. However, the contemnor did not press those reliefs to a decision by the foreign court prior to being held in contempt in Singapore (seeWestBridgeat [11]–[19], [150]–[153], and [175]). Concomitantly, Baker and the others protected by the ASI have been prejudiced in terms of the time, trouble, and expense of responding to theactivesteps taken by BCS and Weber in the Californian Proceedings, besides having to face the ongoing risk of an adverse outcome in the Californian Proceedings. The ASI was issued on 19 November 2021 (above at [10]), and by the time of the hearing before us on 6 September 2023, some 20 months had elapsed, but BCS and Weber remained recalcitrant and persisted in their disobedience. 59 Third, the ASI inWestbridgeprotectedpending proceedings, but the ASI here was issued when the Singapore proceedings in Suit 3 had already culminated injudgmenton the merits(ie, the Suit 3 Judgment, which had moreover been upheld by the Court of Appeal in CA 76 on 19 January 2021, before the ASI was issued). In the present case, the ASI protects the unappealable substantive determination in the Suit 3 Judgment, but there was no equivalent inWestbridge. 60 Fourth,the contempt proceedings inWestbridgetook place at a time when the ASI there was under appeal (seeWestBridgeat [1] and [59]), whereas here, the contemnors’ appeal against the ASI had already been dismissed in CA 70. InWestbridge, the court’s comment (at [176]) on the pending appeal against the ASI there, was that the contemnor had not evinced that he was opposed to ever complying with the ASI (for example, persisting in disobedience even following an unfavourable outcome in his appeal against the ASI). Here, the contemnors have continued to disobey the ASI despite their appeal against the ASI having failed in CA 70, and despite the Court of Appeal calling on them to comply with the ASI (ASI Appeal at [94]). That is aggravating conduct. Moreover, it is clear from what was said in the motion for leave to file BCS’s Fourth Amended Complaint (see [24]–[25] above) that the contemnors acknowledged that theyhad notcomplied with the ASI, but also said that theywould notdo so. 61 Fifth, Weber procured BCS to breach the ASI. Procuring others to commit the contemptuous act is an aggravating factor (seeAurolat [68(h)]). Not only was Weber the owner and controller of BCS, and the one instructing BCS’s US lawyers, but Weber also replaced Sianto as the sole director of BCS for the purposes of furthering the contempt. On 2 May 2023, Sianto expressed his view to Weber that the Injuncted Claims should be withdrawn from the Californian Proceedings and that BCS’s US lawyers should be instructed to do so as soon as possible. Weber responded by taking Sianto’s place as BCS’s sole director the very next day.5Foot Note 5×1st Affidavit of Hartono Sianto dated 6 July 2023 at para 10 and exhibits HS-1 and HS-3. 62 Having regard to the above, the contempt in the present case is more serious than that inWestbridge. 63 We also had regard to the factors listed by the Court of Appeal inMok Kah Hong(on contempt by disobedience in the matrimonial context) at [105]–[110], which Steven Chong J (as he then was) who delivered the judgment inMok Kah Hongsummarised as follows inTechnigroup(at [106]): “(a) a degree of continuity in the contemptuous conduct, taking into account the past conduct of the contemnor; (b) the impact of the contemptuous conduct on the other party; (c) the nature of the non-compliance, in particular whether it was intentional or fraudulent on the part of the contemnor; and (d) any genuine attempts on the part of the alleged contemnor to comply with the judgment or order.” As Chong J stated (Technigroupat [107]), those factors were equally relevant and instructive in cases of contempt in commercial contexts. 64 In the present case: (a) there is continuity in the contemptuous conduct in that BCS and Weber have persistently disobeyed the ASI – not only have the Injuncted Claims not been withdrawn from the Californian Proceedings, but BCS and Weber also took active steps to seek to undermine the Suit 3 Judgment as well as these contempt proceedings; (b) BCS’s and Weber’s conduct has prejudiced Baker and the other parties protected by the ASI – not only is there an ongoing risk of an outcome in the Californian Proceedings at odds with the Suit 3 Judgment, Baker and others have had to incur time, trouble, and expense in responding to the contemnors’ actions in the Californian Proceedings; (c) the non-compliance was clearly intentional on the part of BCS and Weber, done in the knowledge that they were disobeying the ASI, and motivated by financial gain; and (d) there were no attempts whatsoever by BCS and Weber to comply with the ASI, and indeed their statements to the Californian court were to the effect that theywould not complywith the ASI. 65 Nevertheless, we have decided not to impose a term of imprisonment against Weber, primarily because – for all of BCS’s and Weber’s efforts in breach of the ASI – they have failed to obtain from the Californian court any decision in their favour: the TRO application was dismissed, the US ASI application was dismissed, and the Injuncted Claims are still pending. The Californian court has made no decision against the Suit 3 Judgment, the (Singapore) ASI, or these contempt proceedings. By way of contrast, inMobile Telecommunications, the foreign proceedings that were continued in breach of an ASI had resulted in an adverse foreign judgment (Mobile Telecommunicationsat [9]–[10]), and an imprisonment term was imposed for the contempt. 66 In the circumstances, we impose on Weber the maximum fine of $100,000. 67 For completeness, we considered whether the penalties against BCS and Weber should be suspended, although they did not submit that this should be done, and there was no suggestion that they would comply with the ASI if given “one last chance”. Having regard to BCS’s and Weber’s conduct of cynically disobeying the ASI for a period of some two years, taking active steps in the meantime to attack the ASI and the present contempt proceedings, our decision is that the fines we have imposed should not be suspended.",
        "Whether a director disqualification order was available against Weber": "68 Besides seeking a penalty under the AJPA against Weber, Baker also applied by SUM 22 to amend his contempt application in SUM 9 to seek a director disqualification order against Weber,ie, an order under s 154 of the Companies Act disqualifying Weber from acting as a director, or taking part (whether directly or indirectly) in the management of a company. 69 Section 154 of the Companies Act provides in material part as follows: Disqualification to act as director on conviction of certain offences 154.—(1)  A person is subject to the disqualifications provided in subsection (3) if — (a) the person is convicted of any of the following offences: (i) any offence, whether in Singapore or elsewhere, involving fraud or dishonesty punishable with imprisonment for 3 months or more; (ii) any offence under Part 12 of the Securities and Futures Act 2001, where the conviction was on or after 1 July 2015; or (b) the person is subject to the imposition of a civil penalty under section 232 of the Securities and Futures Act 2001 on or after 1 July 2015. (2)  The court may, in addition to any other sentence imposed, make a disqualification order against any person who is convicted in Singapore of any of the following offences: (a) any offence in connection with the formation or management of a corporation; (b) any offence under section 157 or 396B; (c) any offence under section 237 or 239 of the Insolvency, Restructuring and Dissolution Act 2018. (3)  Subject to any permission which the Court may give pursuant to an application under subsection (6), a person who — (a) is disqualified under subsection (1); or (b) has had a disqualification order made against him or her under subsection (2), must not act as a director, or take part (whether directly or indirectly) in the management of a company, or of a foreign company to which Division 2 of Part 11 applies, during the period of the disqualification or disqualification order. 70 Baker contends that our finding that Weber had committed contempt of court by disobeying the ASI means that Weber has been “convicted [of an] offence in connection with the formation or management of a corporation” under s 154(2)(a); Weber contends to the contrary. 71 At common law, contempt by intentional disobedience of a court order is regarded ascivilcontempt:Tan Beow Hiong v Tan Boon Aik[2010] 4 SLR 870 (“Tan Beow Hiong”) at [23]–[25];Li Shengwu vAttorney-General[2019] 1 SLR 1081 (“Li Shengwu”) at [57] and [61], commenting onMoh Kah Hong. The issue is whether such contempt is an “offence” for the purpose of s 154 of the Companies Act, as that term is used in that section. However, the Companies Act does not itself define the term “offence” as used in that section. 72 Baker relies on the definition of an “offence” under s 2(1) of the Criminal Procedure Code 2010 (2020 Rev Ed) (the “CPC”): “an act or omission punishable by any written law”. As a person found liable for contempt may be punished by imprisonment and/or a fine, Baker submits that Weber has committed an “offence” for the purposes of s 154 of the Companies Act. 73 The CPC does not, however, purport to define “offence” where that term is used inother statutes; the definition of “offence” in s 2(1) of the CPC is, like the other definitions, for the purposes of interpreting phrases used “[i]n this Code, unless the context otherwise requires”. Thus, the definition of “offence” in the CPC is expressly for the purposes of the CPC itself, and even so, that definition only applies “unless the context otherwise requires”. Subjecting contempt cases to the full application of the CPC would go against the Court of Appeal’s decision inLi Shengwuwhich recognised thatcivilprocedure and processes have always been used to establish jurisdiction over any contemnor, whether the contempt complained of was civil contempt or criminal contempt (at [115]–[121]). 74 The AJPA itself only makes limited express provision for the application of the CPC. Specifically, other than in relation to investigations under s 22 of the AJPA, the AJPA does not provide for the application of the CPC. Under ss 23 and 24 of the AJPA: (a) the Attorney-General may authorise a police officer to exercise,for the purposes of investigations unders 22, powers in relation to police investigation under Part 1 of the Schedule to the CPC; (b) for the purposes of any such investigation under s 22, the provisions of Part 2 of the Schedule to the CPC apply “as if the alleged contempt were an arrestable offence”; and (c) statements made to a police officer in the course of any such investigation are admissible as evidence in accordance with ss 258 or 259 of the CPC. Section 22 investigations involve scandalising contempt (under s 3 of the AJPA) or the intentional causation or abetment of contempt by a non-party (under s 4(8) of the AJPA). Civil contempt by disobedience under s 4(1) of the AJPA is not a basis for the application of the CPC under ss 23 and 24 of the AJPA. 75 Moreover, applying the CPC definition of “offence” to that term as used in the Companies Act would mean that where a person is subject to the imposition of a civil penalty under s 232 of the Securities and Futures Act 2001 (2020 Rev Ed) (the “SFA”) (which allows for disqualification under s 154(1)(b) of the Companies Act), that would amount to him being convicted of an offence (which might allow for disqualification under s 154(1)(a), or (2)(a), (b), or (c), as the case may be). However, the Companies Act itself draws a distinction between conviction of any offence under Part 12 of the SFA (governed by s 154(1)(a)(ii) of the Companies Act) and a person being subject to the imposition of a civil penalty under s 232 of the SFA – which is within Part 12 of the SFA (governed by s 154(1)(b) of the Companies Act). Furthermore, if, as Baker contends, “offence” under s 154(1)(a) means “an act or omission punishable by any written law”, that too would cover civil penalty cases under the SFA; and it would have been unnecessary for the legislature to have amended s 154 of the Companies Act to specifically cover such civil penalty cases by way of s 154(1)(b). 76 In the context of s 154 of the Companies Act, we thus do not accept that the imposition of a civil penalty under s 232 of the SFA means there has been a conviction of an offence under the Companies Act – the Companies Act draws a distinction between the two, and indeed so does the SFA. 77 InTan Liang Joo John v Attorney-General[2020] 5 SLR 1314 (“Tan Liang Joo”) the court found thatcriminalcontempt would fall within the concept of “offence” under Art 45(1)(e) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (the “Constitution”), but expressly left open the position regardingcivilcontempt because of its potentially different nature: seeTan Liang Jooat [11] and [29]. Under Art 45(1)(e) of the Constitution, a person shall not be qualified to be a Member of Parliament if they have been convicted of anoffenceby a court in Singapore or Malaysia and sentenced to imprisonment for a term of not less than one year or to a fine of not less than $2,000, and has not received a free pardon. 78 In arriving at its decision, the court inTan Liang Joonoted the use of the word “offence” in another Article of the Constitution, Art 35(8), which states: “[t]he Attorney-General shall have power, exercisable at his discretion, to institute, conduct or discontinue any proceedings for any offence.” The court stated that the term “offence” in Art 35(8) includescriminalcontempt, and noted that there was force in the argument that the same word is to bear the same meaning throughout a particular statute (Tan Liang Jooat [36]). 79 The present case involvescivilcontempt by intentional disobedience of a court order pursuant to s 4(1) of the AJPA. These proceedings have been initiated by Baker, not by the Attorney-General. Under s 30(1) of the AJPA, no proceedings for contempt of court as defined in s 3 (scandalising contempt) or s 4(8) (the intentional causation or abetment of contempt by a non-party) may be instituted except by or with the consent of the Attorney-General, but such consent is not necessary for proceedings for contempt under s 4(1) of the AJPA. This is an indication thatcivilcontempt by disobedience of a court order under s 4(1) of the AJPA is not regarded as an “offence” for the purposes of the AJPA, and should not be so regarded for the purposes of disqualification under the Companies Act. 80 A further indication is found in s 4(4) of the AJPA, which provides that: “[s]ubject to subsections (5), (6) and (7), any contempt of court referred to in subsection (1) or (2) may be waived by the aggrieved party and such waiver relieves from liability the person who commits the contempt”. Section 4(5) gives the court the discretion to disallow such waiver of contempt of court in prescribed circumstances. However, the fact that contempt under s 4(1) can be waived, relieving the erstwhile contemnor of liability, also suggests that s 4(1) contempt is not an “offence” for the purposes of the AJPA, and should not be so regarded for the purposes of the Companies Act. 81 There are also authorities predating the enactment of the AJPA to the effect thatcivilcontempt is not an offence. InTan Beow Hiong, the court stated (at [23]–[24]): … it is fairly clear that breach of a coercive (ie, prohibitory or mandatory) court order or judgment is a civil contempt (see the speech of Lord Oliver inAttorney General v Times Newspapers Ltd[1992] 1 AC 191 at 217), and does not amount to a criminal offence … … the better view is that, asThe Law of Contempt[Nigel Lowe and Brenda Sufrin,Borrie & Lowe: The Law of Contempt(Butterworths, 3rd Ed, 1996)] states at p 662: [C]riminal contempt is, for all its peculiarities, a crime, whereas a civil contempt despite its criminal characteristics is not. 82Tan Beow Hiongwas cited inMaruti Shipping PteLtd v Tay Sien Djim and others[2014] SGHC 227 (“Maruti Shipping”) (at [134]), for the proposition that “[d]espite its quasi-criminal nature, a civil contempt doesnotamount to a criminal offence”. Thus, the court inMaruti Shippingdoubted whether the court had the power, in a case of civil contempt, to exercise any power under Part XVII of the CPC to impose a community sentence, such as a Mandatory Treatment Order or probation. 83 Section 154(2)(a) of the Companies Act requires that the director be “convicted” of an “offence”. The term “convicted” is also found in Art 45(1)(e) of the Constitution, and this was considered inTan Liang Joo(at [33]), where the court said: As for the reference to a conviction in Art 45(1)(e), this could point to a narrow meaning. However, the term “convict” has always been used in relation to criminal contempt, specifically for the offence of contempt by scandalising the court: see,eg,AG v Shadrake Alan[2011] 2 SLR 445 at [137];Au Wai Pang v AG[2016] 1 SLR 992 at [9]. 84 As the present case is concerned with civil contempt, we considered that use of the word “convicted” in s 154(2)(a) does point to a narrow meaning,ie, that a person found to have committedcivilcontempt, in particular contempt by intentionally disobeying a court order, has not thereby been “convicted” of an “offence”. 85 Ultimately, the question before us is whether a finding of civil contempt by intentional disobedience of a court order under s 4(1) of the AJPA is a “conviction” for an “offence” for the purposes of potential disqualification under s 154 of the Companies Act. For the above reasons, our conclusion is that a finding of such civil contempt is not a “conviction” for an “offence” in that context. For avoidance of doubt, we leave open the question of whether other types of contempt – in particular,criminalcontempt – might be regarded differently, as this issue is not before us. 86 Accordingly, we dismiss SUM 22, and we do not make a director disqualification order against Weber.",
        "Whether Sianto had committed contempt": "87 Baker also seeks a finding of contempt and consequent sanctions against Sianto, a former director of BCS. 88 Sianto was a director of BCS from 5 March 2019 to 3 May 2023: (a) from 5 March 2019 to 30 September 2019, Sianto was a director together with Weber; (b) from 30 September 2019 to 21 September 2022, Sianto was a director together with one Chuah Lay San (“Chuah”); (c) from 21 September 2022 to 3 May 2023, Sianto was the sole director; and (d) from 3 May 2023 (after Sianto ceased to be a director) Weber has been the sole director of BCS. 89 When the ASI was issued on 19 November 2021, the directors of BCS were Sianto and Chuah. However, it is undisputed that Weber solely owned and controlled BCS, and it was Weber who instructed BCS’ US lawyers in relation to the Californian Proceedings. 90 On 28 September 2022, Baker’s lawyers wrote to Sianto enclosing a copy of the ASI together with a penal notice informing him that if BCS neglected to obey the ASI, Sianto as a director of BCS would be liable for contempt for the purpose of compelling BCS to obey the ASI. The letter informed Sianto that BCS had not withdrawn the Injuncted Claims from the Californian Proceedings and demanded that Sianto procure BCS’s full compliance with the ASI by noon on 5 October 2022, failing which contempt proceedings might be commenced against him. 91 Sianto says that he forwarded Baker’s lawyers’ letter and enclosures to Weber and BCS’s US lawyers and requested that they look into Baker’s demand. Sianto says that his expectation was that they would consider if there was basis for the demand, and if so, that Weber would have BCS take steps to comply with the demand. Sianto acknowledges, however, that he did not expressly state that expectation to Weber or the lawyers. 92 On 13 March 2023, Baker’s lawyers wrote again to Sianto, this time enclosing the SUM 9 contempt application and related documents. Sianto says that after considering the documents, he informed Weber that he was of the view that BCS should withdraw the claims in the Californian Proceedings that were prohibited by the ASI (above at [61]). Sianto says that he asked Weber for Weber’s urgent confirmation that Weber would be instructing BCS’s US lawyers to carry out the withdrawal of the Injuncted Claims as soon as possible. Sianto says that he told Weber that he would otherwise not be in a position to continue being a director of BCS and that he would resign. Weber asked Sianto to resign as a director and so Sianto did. 93 Sianto exhibited in his affidavit his email of 2 May 2023 to Weber, in which Sianto said: I am of the view that BCS should withdraw the claims in the Californian action that are prohibited under the ASI soonest possible. Can you please confirm urgently that you will be instructing the lawyers to do the withdrawal as soon as possible? Otherwise, I would not be in the position to continue my position as director of BCS and will have no choice but to resign as director of BCS. 94 Weber promptly replied to Sianto the same day to say, “[a]s you know Baker is a [criminal] and has created [with] his lie a big damage to me and BCS. I can not accept that. In any case I understand you and please resign as Director from BCS And replace it [with] me. Sorry if this [legal] case create you any problem.” 95 On 3 May 2023, Sianto resigned as a director of BCS with immediate effect, and he was replaced with Weber as BCS’s sole director. 96 Baker seeks a finding of contempt against Sianto under s 6(2) of the AJPA, on the basis that Sianto was an officer of BCS (a corporation which had committed contempt) who “knew or ought reasonably to have known” that BCS’s contempt was being committed, and had, at the very least, “failed to take all reasonable steps to prevent or stop the commission of that contempt of court” as stipulated in s 6(2)(b)(iii) of the AJPA. 97 Sianto contends that hehadtaken all reasonable steps to prevent or stop BCS’ commission of contempt, but that Weber had nevertheless persisted in maintaining the Injuncted Claims in the Californian Proceedings, a matter which was outside his control. 98 Sianto says he first became aware of Suit 3 sometime in May 2018, and of CA 70 (BCS’s appeal against the ASI Judgment), sometime around December 2021. He says he cannot recall when he first learnt of the Californian Proceedings, but he knew that Weber wanted to pursue legal action against Baker in America. Sianto also says he was aware that BCS had failed in Suit 3, SUM 37 (which resulted in the ASI), CA 76 (against the Suit 3 Judgment), and CA 70 (against the ASI Judgment), and that Weber wanted to continue with the Californian Proceedings. 99 From what Sianto says, we are satisfied that he was aware of the ASI – at least by December 2021 when he became aware of CA 70 which was BCS’s appeal against the ASI Judgment. It does not, however, follow that Sianto was aware that BCShad not compliedwith the ASI, prior to him receiving Baker’s lawyer’s letter of 28 September 2022 informing him of this, together with a copy of the order and a penal notice. Although Sianto says he knew Weber wanted to continue with the Californian Proceedings, the ASI did not require BCS to withdraw the Californian Proceedings, but only the Injuncted Claims. 100 Bearing in mind that the burden is on Baker to establish contempt beyond reasonable doubt, we find it is not proven that Sianto knew, prior to the 28 September 2022 demand letter from Baker’s lawyers, that BCS had disobeyed the ASI. On a related note, under O 45 r 7(4) of the ROC 2014, it is generally a prerequisite for enforcement of an order by contempt proceedings that a copy of the order with a penal notice be served on the person to be committed – Sianto only received that on 28 September 2022. 101 Prior to that date, it was not unreasonable for Sianto and Chuah – as directors of BCS – to let Weber (the owner and controller of BCS) instruct BCS’s US lawyers, and for them as directors to have expected Weber to have procured BCS’s compliance with the ASI. 102 When Sianto received the 28 September 2022 demand letter, he says he forwarded it to Weber and BCS’s US lawyers requesting that they look into the demand, expecting that – if there were basis for the demand – Weber would have BCS comply with the demand. Baker contends that we should not accept Sianto’s evidence on this, because Sianto has not produced the communication by which he forwarded the demand letter to Weber and BCS’s US lawyers. However, Baker issued no notice requiring Sianto to produce that communication (as Baker might have), nor did Baker apply for Sianto to be cross-examined on his affidavit. We accept Sianto’s evidence as to his response to the demand letter. 103 We also accept Sianto’s evidence (in this regard substantiated by documents) as to his response to the letter of 13 March 2023 which was accompanied by the SUM 9 contempt application and other documents – that he expressed his view to Weber that BCS should withdraw the Injuncted Claims from the Californian Proceedings or Sianto would resign; and that Sianto promptly did resign and was replaced by Weber. 104 We find that Baker has not established that Sianto “failed to take all reasonable steps to prevent or stop the commission of [BCS’s] contempt of court” under s 6(2)(b)(iii) of the AJPA. Baker submits that Sianto ought to have done more, such as directly instructing BCS’s US lawyers to withdraw the Injuncted Claims. We do not, however, believe that would have been effective: if Sianto in his capacity as BCS’s director had purported to countermand Weber’s instructions, we expect Weber in his capacity as BCS’s owner would simply have removed Sianto and taken his place as BCS’s sole director, and reiterated his instructions to BCS’s US lawyers to maintain the Injuncted Claims. In essence, that is what happened, save that Sianto resigned rather than was removed. 105 For completeness, on the evidence before us, we do not find that Sianto “consented or connived, or conspired with others, to effect the commission of the contempt of court” under s 6(2)(b)(i) of the AJPA or that he is “in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the contempt of court by the corporation” under s 6(2)(b)(ii). 106 In the circumstances, we find that Baker has not established any of the grounds under s 6(2)(b) of the AJPA for holding Sianto in contempt as a director of BCS, in relation to BCS’s contempt. The contempt application against Sianto is thus not made out.",
        "Conclusion": "107 For the above reasons, our decision is as follows: (a) BCS is in contempt of court and we impose a fine of $80,000; (b) Weber is in contempt of court and we impose a fine of $100,000; (c) SUM 22 is dismissed as our finding of civil contempt against Weber under s 4(1) of the AJPA is not a conviction of an offence for the purposes of s 154 of the Companies Act, such that a director disqualification order could be made against Weber; and (d) we do not find Sianto to be in contempt of court. 108 Unless the parties can agree on costs, they shall file and serve written submissions on the appropriate costs orders to be made (both as to incidence and quantum), limited to ten pages (excluding any schedule of disbursements), within 21 days. Andre ManiamJudge of the High CourtDominique T HascherInternational JudgeChristopher Scott SontchiInternational Judge    Woo Shu Yan, Tay Hong Zhi Gerald, Mok Hin Kyong Jonathan (Mo Xianqiang), and Foo Hsien Li (Drew & Napier LLC) for the plaintiff; Chua Han Yuan Kenneth (Cai Hanyuan) and Ang Kai Le (TSMP Law Corporation) for the first and second defendants; Kam Su Cheun Aurill (Legal Clinic LLC) and Seow Wai Peng Amy (Adroit Law LLC) for the non-party."
    }
}