{
    "case_title": "Jayant Jivan GolanivPublic Prosecutor",
    "ncitation": "[2024] SGHC 12",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 The Appellant, Mr Jayant Jivan Golani, appealed against his sentences imposed by a Principal District Judge (the “PDJ”) upon his plea of guilt to various charges relating to the employment of foreign manpower. I dismissed his appeal against the sentences on 24 November 2023 and now set out the reasons for my decision.",
        "Background": "2 The Appellant was the director of Gamma Services Pte Ltd (the “Company”), with the Company engaged in the principal activity of running restaurants. To obtain employment passes for foreign employees, the Appellant had declared in Declaration Forms submitted to the Ministry of Manpower (“MOM”) that the fixed monthly salary for each foreign employee would be $7,250. However, while the Appellant would credit the declared fixed monthly salary in the foreign employees’ bank accounts every month, the foreign employees were required to withdraw $5,520 to be paid back to the Appellant. The actual salary of each foreign employee was therefore only $1,730 every month, 76.14% lower than the salary declared. 3 The Appellant was eventually investigated and prosecuted for various breaches under the Employment of Foreign Manpower Act (Cap 91A, 2009 Rev Ed) (“EFMA”) and the Employment Act (Cap 91, 2009 Rev Ed) (“EA”). He pleaded guilty to 22 charges which comprise: (a) two charges under s 22(1)(d) of the EFMA for making a statement which he ought reasonably to know was false to the MOM in connection with a work pass declaration (the “False Declaration Charges”); and (b) 20 charges under s 34(1) read with s 32(1) read with s 113A(1)(a) of the EA for failing to pay salary to an employee in accordance with the provisions under the EA (the “Deduction Charges”). 4 The Appellant also admitted and consented to another 44 charges being taken into consideration for the purposes of sentencing (the “TIC Charges”). The TIC Charges comprised nine False Declaration Charges and 35 Deduction Charges. 5 The PDJ sentenced the Appellant to six weeks’ imprisonment for each of the proceeded False Declaration Charges and a fine of $3,000 (in default 10 days’ imprisonment) for each of the proceeded Deduction Charges. The imprisonment terms were ordered to run concurrently. The global sentence was therefore six weeks’ imprisonment and a fine of $60,000 (in default 200 days’ imprisonment). The PDJ’s reasons for his decision are contained inPublic Prosecutor v Jayant Jivan Golani[2023] SGMC 49 (the “GD”). 6 The Appellant appealed against his sentence on the ground that the custodial threshold was not crossed for the False Declaration Charges. There was no appeal against the fines that were imposed. The Appellant submitted that he was merely negligent (and not reckless); accordingly, a high fine would have sufficed rather than a custodial sentence.1Foot Note 1×Appellant’s Written Submissions dated 14 November 2023 (“AWS”) at para 7.",
        "Parties’ cases on appeal": "7 The Appellant relied mainly on four arguments on appeal:2Foot Note 2×AWS at para 8. (a) First, in relation to the False Declaration Charges, the PDJ erred in law in finding that the Appellant was “clearly conscious of his declarations” and had a “high level of consciousness”. The PDJ was not entitled to do so as there were insufficient facts available in the Statement of Facts (“SOF”) for the PDJ to conclude as such.3Foot Note 3×AWS at paras 20–25. (b) Second, and in any event, the PDJ erred in fact in finding that the Appellant had a “high level of consciousness”. The Appellant had no knowledge of the falsity and was therefore merely negligent in making the declarations. (c) Third, if the court finds that the Appellant was negligent when making the declarations, then the sentencing framework inChiew Kok Chai v Public Prosecutor[2019] 5 SLR 7134Foot Note 4×Respondent’s Bundle of Authorities at Tab 6.(“Chiew Kok Chai”) would not apply and the Appellant should be sentenced to a high fine instead of an imprisonment term. (d) Fourth, even if the court is of the opinion that theChiew Kok Chaiframework applies, the PDJ failed to take into account and/or place sufficient weight on the mitigating factors. 8 The Respondent made the following arguments in response: (a) The PDJ rightly found that there was a high level of consciousness on the Appellant’s part vis-à-vis his declarations to the MOM. The approach of a sentencing court when dealing with an offence which prescribes alternativemens rea(as with s 22(1)(d) of the EFMA) is to look at any relevant facts of the case, and any distinction in culpability accorded to someone with actual knowledge as opposed to someone who “ought reasonably to know” is one factor in the round.5Foot Note 5×Respondent’s Written Submissions dated 14 November 2023 (“RWS”) at paras 19–22.The PDJ was correct to find that the SOF disclosed that the Appellant had the requisitemens rea,ie, that he ought reasonably to know that his declarations were false and even showed a high level of consciousness on the part of the Appellant vis-à-vis the nature of his declarations to the MOM.6Foot Note 6×RWS at paras 24–28. (b) The PDJ did not commit an error of fact and the Appellant was not merely negligent.7Foot Note 7×RWS at paras 29–37. (c) The PDJ was correct to apply the sentencing framework set out inChiew Kok Chai. The sentencing framework is not limited to any specific form ofmens reaprescribed within s 22(1)(d) of the EFMA.8Foot Note 8×RWS at paras 38–48. (d) A custodial sentence was correctly imposed for the False Declaration Charges as the PDJ had placed the appropriate weight on the need for general deterrence and the relevant mitigating factors.9Foot Note 9×RWS at paras 49–69.",
        "My decision": "9 I dismissed the appeal primarily for the following reasons: (a) The PDJ did not err in law in finding that the Appellant was “clearly conscious of his declarations” and had a “high level of consciousness”. He was entitled to find as such based on the SOF. (b) The PDJ did not err in fact in finding that the Appellant had a “high level of consciousness” in making the declarations to MOM. (c) The sentencing framework inChiew Kok Chaiapplies regardless of the accused person’smens reaunder s 22(1)(d) of the EFMA. Based onChiew Kok Chai, the PDJ was correct to sentence the Appellant to a custodial sentence. (d) The PDJ had taken into account the relevant sentencing considerations and placed appropriate weight on the relevant mitigating factors.",
        "Mens rea": "",
        "No error of law": "10 The relevant provisions of the EFMA read as follows: 22.—(1)  Any person who — … (d) in connection with any application for or to renew a work pass or for any other purpose under this Act, makes any statement or furnishes any information to the Controller or an authorised officer or employment inspectorwhichhe knows, or ought reasonably to know, is false in any material particular or is misleading by reason of the omission of any material particular; shall be guilty of an offence and shall be liable on conviction — … (ii)  in the case of an offence under paragraph (d), (e) or (f) — to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 2 years or to both; and … [emphasis added] 11 In my view, the PDJ was entitled to conclude that the Appellant was “clearly conscious of his declarations” and had a “high level of consciousness” based on the SOF. The relevant paragraphs of the SOF state as follows:10Foot Note 10×Record of Appeal (“ROA”) s/n 25 at pp 6–7. 14. Part 1 of the Sixth Schedule of the Regulations states that “fixed monthly salary” means the sum of basic monthly salary and fixed monthly allowances, and that the “basic monthly salary” does not include “any allowances however described” or “any form of reimbursements, including for expenses incurred by the foreign employee in the course of his employment”. 15. As such, at the time when the accused declared in the Declaration Forms that the fixed monthly salary of the foreign employees would be as per column E of Table 3, the accused ought reasonably to know that the statements were false since the said salary figure comprised of the $5,250 that the foreign employee would need to pay back to the accused. In the circumstances, the accused ought to have stated the figures in Column G of Table 3 as the “basic monthly salary” under Column F of Table 2. The accused also ought to have stated the sums to be paid by the foreign employees (for cost of accommodation, maintenance of the accommodation, meals and utility bills) under “fixed monthly allowances” under Column G of Table 2 so long as it did not exceed 50% of the total salary payable in one salary period. 12 The Appellant argued that based on the above paragraphs, the SOF does not disclose his state of mind.11Foot Note 11×AWS at para 21.I disagreed with this argument. Not only do these paragraphs state that he “ought reasonably to know that the statements were false”, other paragraphs of the SOF also disclose that the Appellant ought reasonably to have known that his declarations were false. 13 Paragraph 12 of the SOF, for instance, expressly states that “the [Appellant] and the relevant foreign employees had earlier agreed to an arrangement whereby the foreign employees would be credited their declared fixed monthly salary into their respective bank accounts every month”, and that the foreign employees were then required to withdraw “$5,520 (comprising of [sic] the cost of accommodation, maintenance of the accommodation, meals and utility bills) and to pay the said sum back to the [Appellant]”. Paragraph 13 of the SOF also describes how the Appellant declared to have read and understood the conditions for an Employment Pass in the Employment of Foreign Manpower (Work Passes) Regulations. 14 I agreed with the Respondent that the SOF sufficiently demonstrated the nature of the Appellant’s clawback scheme, which was put in place and executed by the Appellant as the “directing mind” of the Company.12Foot Note 12×RWS at para 25.This in turn showed that the Appellant had a high level of consciousness when making the false declarations. Thus, in my view, the PDJ did not err in law when he found that the Appellant had a high level of consciousness when making the false declarations as this was patent from the SOF. 15 Further, I noted that it was not the Appellant’s case whether below or on appeal that he was seeking to qualify or retract his plea of guilt. Rather, the central plank of his argument was that he did not in fact have as high a level of consciousness as the PDJ eventually found, and thus ought to have merited consideration for a non-custodial sentence. I did not see any basis to differ from the PDJ’s reasoning and analysis and I therefore rejected this argument. I elaborate further on this point below.",
        "No error of fact": "16 I did not think the PDJ committed an error of fact when he found that the Appellant was clearly conscious of his false declarations to MOM. The Appellant argued that the Declaration Forms did not provide any link or explanation to MOM’s definitions of “fixed monthly salary”, “basic monthly salary” and “fixed monthly allowance”, and he therefore made the declarations in accordance with his understanding of those terms as a layman.13Foot Note 13×AWS at paras 32–35.This point was considered and dismissed by the PDJ, who rightly held that the responsibility was on the Appellant to check on the necessary and relevant information to be provided to MOM before submitting the declaration (GD at [47]). I agreed with the PDJ’s reasoning. 17 The Appellant also relied on an email he sent to Mr Andrew Lee (“Mr Lee”) of MOM’s Work Pass Division (“WPD”) on 28 July 2017 (the “28 July Email”), where the Appellant informed Mr Lee that the foreign employees were paying the Company for accommodation and other services such as meals.14Foot Note 14×AWS at paras 37–38.According to the Appellant, the 28 July Email shows that the Appellant was at all times upfront with MOM, and did not set out to deceive MOM by making a false declaration.15Foot Note 15×AWS at para 40.The portion of the 28 July Email the Appellant relied on reads as follows:16Foot Note 16×ROA s/n 81 Annex B (ROA at p 382). 5. Staff were provided severely subsidized a. Fully Air-conditioned accommodation b. Restaurant grade food instead of just staff meals, three times a day c. All facilities including Washing Machine, Drying Machine, Full Ironing facilities, TV, DVD Player, Refridgerator [sic], Vac cleaner and  All the furniture required for comfortable, neat and very clean living, etc., etc. Now all this will no longer be provided at subsidized rates. They will be fully charged the actual rates. … 9. The staff accommodation was provided extensive pest control including the very costly bedbug treatments by the company, all of which would have to be borne by them henceforth and therefore recovered from their salary 18 I agreed with the Respondent that the 28 July Email was a red herring.17Foot Note 17×RWS at para 30.The 28 July Email must be read in context: it was a response to WPD’s concern that the Company would be unable to “bear the huge increase in manpower costs” from converting their S Pass workers to Employment Pass holders. In order to assuage WPD’s concerns, the Appellant set out a list of measures the Company would purportedly implement in order to increase its overheads. Moreover, the 28 July Email made no mention of the clawback scheme, which is central to this matter. It was precisely because the Appellant clawed back most of the sum of $7,250 that he declared would be paid to the employees, that he was found to have made a false declaration. To be clear, the Appellant did not dispute that the declaration in question was false. The 28 July Email therefore does not absolve the Appellant from being criminally liable for making a false declaration under s 22(1)(d) of the EFMA. In my view, the contents of the 28 July Email do not assist him. The point is that the Appellantdidperpetrate the clawback scheme, which drastically reduced the salaries of the foreign employees from the $7,250 that was declared in the Declaration Forms to only $1,730. For this reason, the PDJ was entitled to find that the Appellant showed “a high level of consciousness” in making the false declarations. 19 In this connection, the SOF speaks quite plainly for itself. It was manifestly clear from the SOF that the Appellant was not merely negligent or inadvertent in his conduct. As the Respondent rightly submitted, the SOF showed obvious and deliberate behaviour to circumvent the regulatory framework and to frustrate the aims of the EFMA. The Appellant chose to declare a high monthly salary of $7,250 for each foreign employee, and admitted knowing that otherwise the Employment Pass would not have been approved by the MOM. This was certainly not a case of inadvertence or mistake in filling in wrong figures on his part but a blatant attempt to beat the system. The PDJ’s finding of a high level of consciousness was reasonable and appropriate in these circumstances, bearing in mind as well that the Appellant was not a novice to the restaurant business. 20 The Appellant further submitted that midway during the trial, the Respondent applied to amend themens reaelement of the False Declaration Charges from “knows” to “ought reasonably to know”. Upon amendment of the Charge, the Appellant pleaded guilty. The Appellant argued that the Respondent’s application to amend the False Declaration Charges was an implicit acknowledgment that the Appellant did not deliberately intend to deceive the MOM. In my view, this argument was wholly without merit. The mere amendment by the Respondent to a differentmens realimb does not mean that the charge based on themens reaof “ought reasonably to know” is not made out. Neither does it disentitle the PDJ from finding on the facts that the Appellant had a high level of consciousness when he made the false declarations. 21 The Appellant clearly ought reasonably to have known that the declarations were false given the clawback scheme. The PDJ was correct in his assessment that the Appellant’s level of consciousness of the falsehood was high. In my view, there was nothing in the PDJ’s reasoning that warranted appellate intervention.",
        "TheChiew Kok Chaisentencing framework": "22 The PDJ applied the two-stage sentencing framework for work pass offences under s 22(1)(d) of the EFMA as set out inChiew Kok Chai, noting that the predominant sentencing consideration for an offence under s 22(1)(d) of the EFMA is “one of deterrence to prevent the very object of the EFMA from being flagrantly undermined” (GD at [31]). The PDJ also observed that underChiew Kok Chai, a custodial sentence should be the norm for offences under s 22(1)(d) of the EFMA, and that a fine would generally not be sufficient punishment unless substantial mitigating factors are present (GD at [32]). In my view, theChiew Kok Chaiframework was correctly applied in the present case, and there was correspondingly no reason to consider the imposition of a non-custodial sentence. 23 The first stage of theChiew Kok Chaiframework is to consider a non-exhaustive list of offence-specific factors, including, among others, the materiality of the false representation and the consequences of the deception (GD at [34]). Once the gravity of the offence has been ascertained, the court places the offence within the appropriate band as follows (GD at [35]): BandElaborationSentencing Range1Lower end of the spectrum, involving one or very few offence-specific factors, or where offence-specific factors were not present to a significant degreeShort custodial sentence of less than five months’ imprisonment2Middle band of the spectrum, involving higher levels of seriousness or harm, comprising cases falling between Bands 1 and 3Five to 15 months’ imprisonment3Higher end of the spectrum, involving numerous offence-specific factors, or where offence-specific factors were present to a significant degree15 to 24 months’ imprisonment 24 The court also takes into account “offender-specific” mitigation factors at the second stage (GD at [36]). Applying the two-stage sentencing framework, the PDJ held that the present case would fall within the lower to middle band of Band 1 of the sentencing range for a short custodial sentence of less than five months (GD at [37]). 25 The PDJ was correct to observe that “[i]t is trite that an offender’s sentence would not necessarily be lower simply because themens reaof the charge is framed as ‘ought reasonably to have known’ or ‘having reasonable grounds to believe’, especially when there is only a single maximum imprisonment term specified for the offence, and for which the prescribed punishment did not cater to the respectivemens reapossibilities” (GD at [52]). The distinction in culpability between an offender who actually knows and an offender who ought reasonably to know is treated “only as a factor in the round”, and the appropriate sentence depends ultimately on all the facts (GD at [53], citingGoh Chin Soon v Public Prosecutor[2021] 4 SLR 401 at [168]). 26 Importantly,Chiew Kok Chaimade no distinction between the “knows” and “ought reasonably to have known” limb in s 22(1)(d) of the EFMA. I agreed with the Respondent that the framework laid down inChiew Kok Chaiis intended to apply regardless of whichmens realimb the accused person is charged under. In formulating the sentencing framework, Aedit Abdullah J considered the underlying legislative intent of s 22(1)(d) of the EFMA, which is to deter the deception of public institutions, as such deception frustrates the aims of the EFMA (at [34]–[37] and [49]). Whether the deception was due to actual knowledge or constructive knowledge, the point is that public institutions were deceived, and deterrence is thus warranted. To draw a distinction between the two differentmens realimbs would defeat this legislative purpose. Therefore, in my view, the Appellant’s argument that theChiew Kok Chaiframework should not apply to offences under the “ought reasonably to have known” limb in s 22(1)(d) of the EFMA was rightly rejected by the PDJ. 27 The Appellant also argued that custodial sentences should generally not be imposed on negligent offenders,18Foot Note 18×AWS at paras 47.6–54.and relied onAbdul Ghani bin Tahir v Public Prosecutor[2017] 4 SLR 1153 in support of this argument. However, that case concerned an offence under s 47 read with s 59 of the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act (Cap 65A, 2000 Rev Ed), which does not engage the same policy considerations as the EFMA. 28 InChiew Kok Chai, Abdullah J concluded that a custodial sentence should be the norm for offences under s 22(1)(d) of the EFMA because of the nature of offences under s 22(1)(d) of the EFMA, which involve a significant wider interest to be protected and where economic benefits may give rise to incentives to breach the law. In such circumstances, a fine would not generally be enough to deter would-be offenders as “the payment of a financial penalty in the form of a fine may encourage potential offenders to treat contraventions to be mere business costs” (at [50]–[51]). In addition, Abdullah J held that there was an interest in retribution as an independent sentencing principle and further justified imposing a custodial sentence as a starting point, since breaches of s 22(1)(d) frustrate policy goals and have knock-on effects on immigration policy and the employment of foreigners (at [53]). Therefore, it is evident that the sentencing framework inChiew Kok Chaiand its prescription for a custodial sentence as a starting point is aimed at preventing the frustration of such policy goals. 29 As for the case ofPublic Prosecutor v Fan Qiuyun[2012] SGDC 140 where the court imposed a fine for an offence under s 22(1)(d) of the EFMA (raised by the Appellant at paras 55–59 of the AWS), this case has since been superseded byChiew Kok Chai. The court there also did not engage in a comprehensive consideration of the legislative intent behind s 22(1)(d) of the EFMA as the court inChiew Kok Chaidid.",
        "Mitigating factors": "30 Turning to the Appellant’s allegation that the PDJ had not given sufficient weight to the relevant mitigating factors, I was of the view that this argument was also without merit. The PDJ had duly considered the various factors raised by the Appellant, namely the Appellant’s medical conditions and ill health, elderly age, plea of guilt and co-operation. He was unpersuaded that an imprisonment term would have a significant adverse impact on the Appellant’s health (GD at [56]). In any case, his medical conditions and poor health were not so exceptional as to justify a departure from the sentencing norms. Based on the Appellant’s elderly age, plea of guilt and co-operation, the PDJ was justified in holding that a slight sentencing discount and a concurrent sentence would meet the ends of justice (GD at [57]). 31 In my view, the PDJ did not err in his consideration of the mitigating factors that were put forth. The PDJ had given due weight to the relevant sentencing considerations. The sentences of six weeks’ imprisonment for each of the two proceeded False Declaration Charges and a fine of $3,000 (in default 10 days’ imprisonment) for the remaining 20 Deduction Charges were  appropriate and proportionate in the circumstances.",
        "Conclusion": "32 I saw no reason to differ from the PDJ’s reasoning and calibration of the sentences for the respective charges. The sentence in totality was neither manifestly excessive nor disproportionate to the gravity of the offences. For the reasons set out above, I dismissed the appeal. See Kee OonJudge of the High Court Eugene Singarajah Thuraisingam, Suang Wijaya and Ng Clare Sophia (Eugene Thuraisingam LLP) for the appellant; Vala Muthupalaniappan (Attorney-General’s Chambers) for the respondent."
    }
}