{
    "case_title": "Public Prosecutor vCRH",
    "ncitation": "[2024] SGHC 34",
    "coram": "Pang Khang Chau J",
    "sections": {
        "Introduction": "1 The Accused pleaded guilty to two charges ofattemptedaggravated rape of his biological daughter (“the Victim”). The offences were committed in or around 2013 but came to light only in 2021. Between these two dates, certain amendments were made to the provisions of the Penal Code (Cap 224, 2008 Rev Ed) (the “PC”) concerning the punishment for attempts to commit offences. 2 The punishment for aggravated rape under s 375(3)(b) of the PC is imprisonment for a minimum term of eight years and a maximum of 20 years, and caning with a minimum of 12 strokes. In the version of the PC in force at the time of the offences (the “Pre-2019 Amendment PC”), s 511(1) provided that an attempt to commit an offence shall “be punished with such punishment as is provided for the offence”, while the relevant part of s 511(2) provided that the longest imprisonment term that may be imposed shall not exceed “one-half of the longest term provided for the offence”. This meant that the maximum imprisonment term which may be imposed forattemptedaggravated rape was ten years. An issue which arose for decision in this case was whether the minimum sentence of eight years prescribed for aggravated rape also applied in its entirety to the offence ofattemptedaggravated rape, with the result that the sentence which could be imposed forattemptedaggravated rape was confined to the rather narrow range of eight to ten years (“Issue A”). 3 Section 511 of the Pre-2019 Amendment PC had been repealed by the Criminal Law Reform Act 2019 (Act 15 of 2019) (the “CLRA”), which enacted the new ss 511 and 512 in its place. The new s 512(3)(a) now expressly provides that, where a minimum sentence is prescribed for an offence, the court is not bound to impose the said minimum when sentencing for anattemptto commit that offence. A second issue which arose for decision in this case was: whether,assuming Issue A was answered in the affirmative, s 512(3)(a) could be applied retrospectively to the Accused’s benefit such that the court was not bound to impose on the Accused the minimum imprisonment term of eight years prescribed for (completed) aggravated rape (“Issue B”). 4 For the reasons given in these grounds, I answered both Issue A and Issue B in the negative. In the light of my answer to Issue A, I sentenced the Accused to a global sentence of 13 years’ imprisonment and 16 strokes of the cane, comprising six years and six months’ imprisonment and eight strokes of the cane for each of the proceeded charges with the imprisonment terms running consecutively.",
        "The charges": "5 The two charges which the Accused pleaded guilty to (the “First Charge” and the “Third Charge”) each alleged that, sometime in or around 2013, the Accused committed attempted aggravated rape of the Victim, who was then under 14 years of age, by attempting to penetrate the Victim’s vagina with his penis without her consent, thereby committing an offence under s 375(1)(b) read with s 511(1), punishable under s 375(3)(b) read with s 511 of the Pre-2019 Amendment PC. 6 The Accused consented to having three other charges taken into consideration (“TIC”) for the purposes of sentencing. These were: (a) one charge for use of criminal force on the Victim, who was then under 14 years of age, with intent to outrage her modesty sometime in or around 2013, contrary to s 354(1) and punishable under s 354(2) of the PC (the “Second Charge”); and (b) two charges each for intentionally recording an image of the genitals of the Victim, who was then under 14 years of age, without her consent sometime between 7 April 2020 to 1 June 2020 contrary to s 377BB(5) and punishable under s 377BB(8) of the PC (the “Fourth Charge” and the “Fifth Charge”).",
        "The relevant statutory provisions": "7 Section375(1)(b) read with s 375(3)(b) of the Pre-2019 Amendment PC provided: Rape 375.—(1) Any man who penetrates the vagina of a woman with his penis — (a) without her consent; or (b) with or without her consent, when she is under 14 years of age, shall be guilty of an offence. ... (3) Whoever — ... (b) commits an offence under subsection (1) with a woman under 14 years of age without her consent, shall be punished with imprisonment for a term of not less than 8 years and not more than 20 years and shall also be punished with caning with not less than 12 strokes. 8 Section 511 of the Pre-2019 Amendment PC provided: Punishment for attempting to commit offences 511.—(1)  Subject to subsection (2), whoever attempts to commit an offence punishable by this Code or by any other written law with imprisonment or fine or with a combination of such punishments, or attempts to cause such an offence to be committed, and in such attempt does any act towards the commission of the offence, shall, where no express provision is made by this Code or by such other written law, as the case may be, for the punishment of such attempt,be punished with such punishment as is provided for the offence. (2)  Thelongest term of imprisonment that may be imposedunder subsection (1) shall not exceed — (a) 15 years where such attempt is in relation to an offence punishable with imprisonment for life; or (b)one-half of the longest term provided for the offencein any other case. ... [emphasis added] 9 With effect from 1 January 2020, s 167 of the CLRA repealed s 511 of the Pre-2019 Amendment PC, and replaced it with the new ss 511 and 512. In the version of the PC in force from 1 January 2020 (“the Post-2019 Amendment PC\"), s 511 defined the scope and elements of the offence of attempting to commit offences, while s 512 dealt with the punishment for attempting to commit offences. Section 512 of the Post-2019 Amendment PC read: Punishment for attempting to commit offences 512.—(1)  A person who attempts to commit an offence punishable by this Code or by any other written law with death or imprisonment for life, shall, where no express provision is made by this Code or by such other written law for the punishment of such attempt, be punished with imprisonment for a term which may extend to 20 years, and shall also be liable to fine or to caning. […illustration omitted …] (2)  Subject to subsection (3), any person who attempts to commit an offence punishable by this Code or by any other written law (other than an offence mentioned in subsection (1)), shall, where no express provision is made by this Code or by such other written law for the punishment of such attempt, be punished with such punishment as is prescribed for that offence. (3)Despite subsection (2),where the punishment prescribed for an offence mentioned in that subsection is fixed by law, a specified minimum sentence or a mandatory minimum sentence of imprisonment or fine or caning, the court sentencing the person who attempted to commit the offence — (a)shall not be bound to impose such fixed,specified or mandatory minimum sentence; and (b) may sentence the offender to such sentence or combination of sentences as the court thinks fit but not exceeding the maximum punishment prescribed for that offence. [emphasis added]",
        "The parties’ initial sentencing submissions": "10At the first sentencing hearing, the Prosecution sought a sentence of eight and a half  to nine years’ imprisonment and 12 strokes of the cane foreachproceeded charge (ie, of attemptedaggravated rape), with the imprisonment terms to run concurrently, for a global sentence of eight and a half to nine years’ imprisonment and 24 strokes of the cane.1Foot Note 1×Prosecution’s written submissions dated 8 November 2022 at para 3.In arriving at this submission, the Prosecution proceeded on the basis thatthe minimum sentence of eight years prescribed for a (completed) aggravated rape offence applied fully, without any reduction, to an offence ofattemptedaggravated rape. 11 The Defence submitted that a sentence of imprisonment for six and a half years and 12 strokes of the cane foreachproceeded charge would be appropriate, with the sentences to run concurrently, for a global sentence of imprisonment for six and a half years and 24 strokes of the cane.2Foot Note 2×Defence’s written submissions and mitigation plea filed on 8 November 2022 at para 14.In arriving at this submission, the Defence argued that the minimum sentence of eight years prescribed for the (completed) aggravated rape offence should be halved to four years when applied to the offence ofattemptedaggravated rape.",
        "Issues to be determined": "12 Given the dispute between parties over whether a minimum sentence prescribed for a completed offence was imported in its entirety by s 511 of the Pre-2019 Amendment PC to an attempt to commit that offence, I directed parties to file further submissions on the following two issues: (a)Issue A:Whether s 511 of the Pre-2019 Amendment PC operated to apply the mandatory minimum sentence for a completed offence to an attempt to commit the offence. (b)Issue B:If Issue A was answered in the affirmative, whether in any event s 512(3)(a) of the Post-2019 Amendment PC can be applied retrospectively for theAccused’s benefit, such that the Court was not bound to impose the mandatory minimum sentence under s 375(3)(b) of the PC for each of theAccused’s attempted aggravated rape offences. 13 A Young Independent Counsel (“YIC”), Mr Chin Yan Xun, was also appointed to assist the court on these two issues. The parties’ further submissions and the YIC’s submissions on the respective issues are outlined and discussed below.",
        "A note about terminology": "14 The issues arising in this case concerned the punishment for attempts to commit offences. To distinguish an attempted offence (which itself is an offence –eg, the offence ofattemptedaggravated rape in the present case) from the offence being attempted (eg,the offence of aggravated rape), I refer to the latter as either the “primary offence” or the “(completed) offence”, depending on which of these two expressions flow better with the surrounding language of the passage in which they appear. In terms of meaning and substance, the expressions “primary offence” and “(completed) offence” are used interchangeably in these grounds.",
        "Issue A: Whether section 511 of the Pre-2019 Amendment PC operated to apply the mandatory minimum sentence for a completed offence to an attempt to commit the offence": "",
        "The submissions": "137 In summary,the Prosecutionsubmitted that s 512 (including s 512(3)(a)) of the Post-2019 Amendment PCcould not be applied retrospectively, whereas the Defence and the YIC both took the position that s 512(3)(a)could be applied retrospectively for the accused’s benefit. The Defence’s submissions 138 The Defence relied on the two-step framework laid down inABU. At the first step, the Defence submitted that an ambiguity exists, as the text of the CLRA is silent on the temporal application of s 512(3)(a) of the Post-2019 Amendment PC, and the extrinsic material also does not shed light on legislative intent.34Foot Note 34×Defence’s written submissions dated 5 January 2023 at paras 33–35.At the second step, the Defence submitted that the presumption against retrospectivity would not apply in the present case since applying s 512(3)(a) of the Post-2019 Amendment PC retrospectively does not occasion any hardship.35Foot Note 35×Defence’s written submissions dated 5 January 2023 at paras 36–37. 139 The Defence also made an alternative submission based on what the Defence described as the “lexmitiordoctrine”. Referring toDochertyat [44(b)] and [44(d)] (quoted at [133] above), the Defence submitted that: (a) the principle articulated in that passage should be considered by the Singapore courts; and (b) if a less severe maximum sentence available at the time of sentencing (but not at the time of commission of the offence) ought to be applied, then the same should apply in relation to minimum sentences also.36Foot Note 36×Defence’s written submissions dated 5 January 2023 at paras 38–39. Although the Defence described this as a submission based onlexmitior, it is clear from the Defence’s reliance on the passages fromDochertyquoted at [133] above that this is, in fact, a submission based on the English Sentencing Practice. The Prosecution’s submissions 140 The Prosecution also applied theABUframework but did not examine the second step because it submitted that no ambiguity exists at the first step –ie,a purposive interpretation of s 512 of the Post-2019 Amendment PC indicates that it was not to operate retrospectively.37Foot Note 37×Prosecution’s written submissions dated 5 January 2023 at para 74.The key plank of the Prosecution’s submission is the assertion that s 512(3)(a) cannot be taken in isolation from the rest of s 512. Section 512 was intended to be implemented holistically, with both sub-sections (a) and (b) of s 512(3) operating in tandem to achieve the legislative intent of conferring maximal discretion on the sentencing courts.38Foot Note 38×Prosecution’s written submissions dated 24 March 2023 at paras 32–38.Since s 512(1) and s 512(3)(b) cannot be given retrospective effect without contravening Art 11(1) of the Constitution, s 512(3)(a) was similarly not intended to have retrospective effect. (I shall refer to this as the “package” argument.) 141 As for the English Sentencing Practice, the Prosecution submitted that there is no evidence that such sentencing practice is part of the sentencing practice of the Singapore courts. Furthermore, the Prosecution submitted that there isno scopefor the English Sentencing Practice in the Singapore context, where questions pertaining to the retrospective application of legislation turn on a purposive interpretation of the legislative provision, subject to constitutional supremacy.39Foot Note 39×Prosecution’s written submissions dated 5 January 2023 at para 83. The YIC’s submissions 142 The YIC agreed with the Defence that it was unclear either way whether Parliament’s intention was for s 512(3)(a) of the Post-2019 Amendment PC to apply retrospectively. As for the Prosecution’s “package” argument, the YIC contended that it is not uncommon for the court to address its mind to the question of whether aspecificpart of a provision can have retrospective application.40Foot Note 40×YIC’s written submissions dated 10 March 2023 at paras 125–126.The YIC therefore agreed with the Defence that there was ambiguity such that the second step of theABUframework is engaged. Noting that whether or not the presumption against retrospectivity should apply was a question of fairness, the YIC submitted that it was “fair” to not apply the presumption in the present case because the s 512(3)(a) conferred a benefit on the accused,ie, it was ‘beneficial’ legislation. No injustice or prejudice arose out of the retrospective application of such legislation and it would instead be “arbitrary and unfair if an accused did not get the benefit of such ‘beneficial’ legislation”.41Foot Note 41×YIC’s written submissions dated 10 March 2023 at paras 140–143. 143 Lastly, the YIC pointed out that there was nothing which suggested that thelexmitiorprinciple or the English Sentencing Practice could not be considered or adopted in Singapore, pursuant to the framework set out by the Court of Appeal inABU.42Foot Note 42×YIC’s written submissions dated 10 March 2023 at paras 153–155.The YIC further submitted that applying s 512(3)(a) of the Post-2019 Amendment PC retrospectively would be consistent with the purpose behind the provision, which was to allow for greater judicial discretion in sentencing attempts.43Foot Note 43×YIC’s written submissions dated 10 March 2023 at para 165.",
        "Analysis": "144 As the Defence raised two alternative submissions, one based on application of theABUframework and one based on the English Sentencing Practice, I discuss these two submissions in turn. Application of the two-stepABUframework 145 The first step of theABUframework involved the purposive approach to statutory interpretation to determine the temporal application of the legislation. Section 512 of the Post-2019 Amendment PC was introduced by s 167 of the CLRA. The operative part of s 167 of the CLRA simply read: “Section 511 of the Penal Code is repealed and the following sections substituted therefor …”. It did not expressly state whether s 512 or any part of it should or should not apply retrospectively. The transitional provisions of the CLRA were found in s 191. None of the transitional provisions dealt expressly with whether s 512 (or any part of it) should or should not apply retrospectively. 146 Returning to the text of s 512(3)(a), while the text of that provision did not indicate whether it should or should not apply retrospectively, the text of the provision could not be considered in isolation. Regard must be had tothe context of the provisionwithin the written law as a whole. To begin with, the context of s 512(3)(a) within s 512as a whole needed to be considered. As previously noted, the effect of s 512(2) read with s 512(3)(b)was to abolish the statutory one-half limit and align the maximum punishment for an attempt with the maximum prescribed for the primary offence. Given that this amounted to an enhancement of the maximum penalty for attempts to commit offences, it was quite clear that Parliament could not have intended s 512(2) read with s 512(3)(b) to have retrospective effect.It was therefore extremely unlikely that Parliament could have intended for s 512(3)(a) to alone have a different temporal application from the rest of s 512(3) or, for that matter,from the rest of s 512. 147 In fact, s 167 of the CLRA introduced two new provisions in place of the repealed s 511 of the Pre-2019 Amendment PC – a new s 511 and a new s 512. The new s 512 set out the punishment for the offence of attempting to commit an offence. The new s 511 spelled out the elements of the offence in more detail and also clarified the scope of the offence. There is little doubt that, in overhauling the definition of the offence of attempting to commit an offence in this manner, the new s 511 could not be intended by Parliament to have retrospective application. In the circumstance, the new ss 511 and 512 together put in place a new scheme for criminalising and punishing attempts to commit offences, and the pieces of this new scheme were intended to work together. This provided further support for the view that the entire scheme, including s 512(3)(a), was intended to have prospective effect only. This conclusion was not contradicted by anything in the parliamentary debates on the CLRA or anything in the report by the Penal Code Review Committee (“PCRC”), whose proposals gave rise to the amendment contained in s 167 of the CLRA. 148 In this regard, s 512(3)(a) might be contrasted with the examples mentioned at [128] and [130] above (ie, a simple amendment to remove the mandatory minimum sentence for certain offences or the simple reduction of the maximum penalty for an offence), where a reasonably strong argument could be made that there existed some ambiguity at the end of the first step as to whether retrospective application was intended. In contrast, given how s 512(3)(a) was situated within the context of s 512(3) and also within the larger context of ss 511 and 512 taken together, I held that a purposive interpretation of s 512(3)(a) led unambiguously to the conclusion that it was not intended to have retrospective application. As such, there was no need to embark on the second step of theABUframework of considering the various presumptions relating to retrospective application of legislation, including the principle of beneficial legislation referred to in the YIC’s submissions. Reasoning from the English Sentencing Practice 149 The Defence’s submission based on the English Sentencing Practice raised a question concerning the extent to which this English practice represented the position under Singapore law or, alternatively, the extent to which it ought to be adopted in Singapore. 150 There is a dearth of local authorities dealing specifically with the issues raised in the English cases ofShaw,R v H(J), andDocherty. Most of the local cases which touch on changes to the amount of penalty between the time an offence was committed and the time of sentencing concern cases where the penalty had been enhanced. The reason for this could be that, while legislative amendments to enhance prescribed penalties was a common occurrence in Singapore, amendments to reduce the penalty was comparatively rare. The dearth of local authorities is, by itself, no obstacle to the adoption of the sentencing practice illustrated byShaw,R v H(J), andDocherty. It is not uncommon for Singapore courts, when faced with novel issues, to consider the sentencing practice of the English courts and to adopt or adapt those practices where appropriate to local circumstances. 151 That being said, there are a couple of local cases which merit consideration. The first case isKalaiarasid/o Marimuthu Innasimuthu v Public Prosecutor[2012] 2 SLR 774 (“Kalaiarasi”), where the offender pleaded guilty in 2011 to three offences under the Bankruptcy Act (Cap 20, 2009 Rev Ed) which were committed in 2002 and 2003. Between these two dates, ss 335–354 of the Criminal Procedure Code 2010 (Act 15 of 2010) (the “CPC 2010”) introduced certain new sentencing options known as “community-based sentences”. At first instance, the District Judge sentenced the offender to eight week’s imprisonment. On appeal to the High Court, V K Rajah JA set aside the sentence of imprisonment and granted a conditional discharge pursuant to the Probation of Offenders Act (Cap 252, 1985 Rev Ed). In his reasoning Rajah JA extensively discussed whether one of the new community-based sentences should be applied. In the end, he decided that, on the facts, it would not appropriate to do so as rehabilitation was not a particularly strong consideration in the circumstances. Nevertheless, the reasoning in that case demonstrates that Rajah JA proceeded on the basis that community-based sentences were applicable to the offender notwithstanding that her offences were committed before the enactment of community based sentences (although Rajah JA did not give any reasons in his judgment as to why this should be so). 152 The second case wasPublic Prosecutor v Loy Zhong Huan, Dylan[2019] SGDC 139 (“Dylan Loy”), where the offender pleaded guilty in 2019 to an offence of voluntarily causing grievous hurt committed in 2016. Between those two dates, s 88(b) of the Criminal Justice Reform Act 2018 (Act 19 of 2018) and reg 16 of the Criminal Procedure Code (Reformative Training) Regulations 2018 came into force, and reduced the minimum detention period for reformative training from 18 months to six months. At first instance, the district judge sentenced the offender to reformative training with a minimum detention period of six months. This sentence was affirmed on appeal to the High Court (Loy Zhong Huan Dylan v Public Prosecutor[2019] SGHC 283 (“Dylan Loy (HC)”)). Neither the district judge nor the High Court provided any reasons for applying the lower minimum detention period of six months even though the offence was committed before this lower minimum came into force. 153 The Prosecution noted that, despite the absence of relevant explanation in the respective judgments, both of these cases could be explained on the basis of the relevant transitional provisions –ie, s 429 of the CPC 2010 and reg 2 of the Criminal Procedure Code (Transitional Provisions – Further Proceedings and Joint Trials) Regulations 2011 in the case ofKalaiarasiand reg 3 of the Criminal Procedure Code (Reformative Training) Regulations 2018 in the case ofDylan Loy. The Prosecution therefore submitted that the position taken by the courts in these two cases were the result oflegislative design, and not evidence of judicial sentencing practice.44Foot Note 44×Prosecution’s written submissions dated 25 May 2023 at paras 8 and 18.I agree with this submission. In fact, a further example of such legislative design was referred to at [127] above. 154 The existence of these examples of legislative design in our law raised the question whether the substantive principles underlying these legislative examples would provide an impetus for the courts in Singapore to develop or adopt a sentencing practice similar to the English Sentencing Practice. As noted by Lord Diplock inErvenWarnink BV v J Townsend & Sons (Hull) Ltd[1979] AC 731 (at 743): Where over a period of years there can be discerned a steady trend in legislation which reflects the view of successive Parliaments as to what the public interest demands in a particular field of law, development of the common law in that part of the same field which has been left to it ought to proceed upon a parallel rather than a diverging course. The High Court of Australia had similarly observed inEsso Australia Resource Ltd v Federal Commissioner of Taxation(1999) 201 CLR 49 at [19] that: Significant elements of what now is regarded as “common law” had their origin in statute or as glosses on statute or as responses to statute. For example, inPeters vThe Queen, McHugh J explained the derivation of the criminal law of conspiracy from statutes enacted in the thirteenth century. … The Statute of Limitations in its terms does not operate directly upon equitable remedies, but, as Dixon J put it inCohen v Cohen, “such remedies are barred in courts of equity by analogy to statute”. … 155 It was not necessary for me to form a definitive view on the question raised in the previous paragraph or, indeed, on the broader question framed at [149] above. This was because, as explained below, even if I were to accept that the English Sentencing Practice applied in Singapore, I did not think it should apply in the case of s 512(3)(a) of the Post-2019 Amendment PC. 156 The rationale for the English Sentencing Practice was explained by the UK Supreme Court inDochertyat [42] as the courts “abstaining from imposing a sentence now recognised as excessive”. The Defence also cited a case from the State of New York, where a similar sentencing practice applies, which explained the rationale for this sentencing practice in the following terms (ThePeopleof the State of New York v Jerome Walker81 N.Y.2d 661 (1993); 623 N.E.2d 1 (N.Y. 1993) at 5): …where a reduction in the penalty for a crime indicates a legislative judgment that the lesser penalty adequately meets all the legitimate ends of the criminal law, imposing a harsher penalty would be an exercise in vengeance, which the law does not permit … These two formulations of the rationale essentially said the same thing – where a legislative amendment to provide a lighter punishment indicates a legislative judgement that the previous sentence is now recognised as excessive, the court should sentence according to the new, lighter punishment. While this rationale would likely fit the examples referred to at [127], [128], [130], [151] and [152] above, it did not fit s 512(3)(a) easily. 157 Section 512 of the Post-2019 Amendment PC was enacted to give effect to the recommendation of the PCRC that “attempts should generally be punishable with the same prescribed punishments as the primary offence, save where express provision is made by the Penal Code or any other written law” (Penal Code Review Committee Report 2018 (the “PCRC Report”), at 201). In recommending the removal of the statutory one-half limit, the PCRC Report explained (at 202) that “[t]here is no reason in principle why someone who attempts an offence is only half as blameworthy as someone who has completed the offence”. The PCRC Report went on to refer (at 202) to the case ofHuangShiyouin which the accused pleaded guilty and was convicted on five charges including one charge of attempted rape. In that case, the victim’s evidence, in relation to the charge of attempted rape, was that she felt something poking her vagina about ten times before the offender desisted and left (HuangShiyouat [8]). To the PCRC,HuangShiyouillustrated the arbitrariness of the statutory one-half limit because the culpability of the offender in that case was “not, by any measure, half of the culpability of a person who had completed the offence” (at 202). 158 Thus, s 512 of the Post-2019 Amendment PC came about because the PCRC regarded the punishment prescribed in s 511 of the Pre-2019 Amendment PC as inadequate. In the circumstances, the enactment of s 512(3)(a) didnotindicate a legislative judgement that the previous sentence was now recognised as excessive. For this reason, I held that there was no room for applying the English Sentencing Practice (even assuming it represents the legal position in Singapore) to s 512(3)(a). Section 16(1) of the Interpretation Act 159 Section 16(1)(d) and (e) of the Interpretation Act provide: 16.—(1)  Where a written law repeals in whole or in part any other written law, then, unless the contrary intention appears, the repeal does not — … (d) affect any penalty, forfeiture or punishment incurred in respect of any offence committed against any written law so repealed; (e) affect any investigation, legal proceeding or remedy in respect of any such right, privilege, obligation, liability, penalty, forfeiture or punishment as aforesaid; and any such investigation, legal proceeding or remedy may be instituted, continued or enforced, and any such penalty, forfeiture or punishment may be imposed, as if the repealing law had not been passed. At first blush, s 16(1)(d) appears to preclude giving retrospective effect to a new legislative provision which enacts a lighter punishment for an existing offence, and consequently preclude an affirmative answer to Issue B. 160 As the parties’ and the YIC’s written submissions did not refer to s 16(1)(d) of the Interpretation Act, I directed parties and the YIC to submit on the relevance and impact of s 16(1)(d) to the resolution of Issue B at the second sentencing hearing. The Prosecution submitted that the effect of s 16(1)(d) and (e) taken together is that any punishment incurred under a repealed law would still apply unless the contrary legislative intention appears. The exercise of determining whether such contrary intention exists would be no different from the exercise to be carried out under theABUframework. Referring to the Court of Appeal’s citation of s 16(1) of the Interpretation Act inABUat [57], the Prosecution submitted that s 16(1) statutorily enshrines the principle that the court will lean against interpreting statutes as having retrospective application unless clear words are stated to this effect.45Foot Note 45×Transcript of 19 April 2023 at pp 31 to 33.The Defence submitted that s 16(1)(d) did not affect the resolution of Issue B because the word “incurred” in the provision refers to a sentence that had already been imposed. Since the court had not yet imposed any sentence in the present case, s 16(1)(d) of the Interpretation Act had no application in the present case.46Foot Note 46×Transcript of 19 April 2023 at p 72.The YIC submitted that the purpose of s 16(1)(d) is to keep intact liabilities incurred under a repealed provision prior to its repeal. It is therefore a provision dealing with the continued application of a repealed provision, and not so much with the retrospectivity of newly enacted provisions. Section 16(1)(d) therefore had no application to the question of retrospectivity of s 512(3)(a) of the Post-2019 Amendment PC.47Foot Note 47×Transcript of 19 April 2023 at pp 103 to 104. 161 Section 16(1)(d) and (e) of the Interpretation Act were modelled after s 38(2)(d) and (e) of the UK’s Interpretation Act 1889 (c 63) (the “Interpretation Act 1889 (UK)”), which were subsequently repealed and re-enacted as s 16(1)(d) and (e) of the UK’s Interpretation Act 1978 (c 30) (the “Interpretation Act 1978 (UK)”). The mischief sought to be addressed by s 38(2) of the Interpretation Act 1889 (UK) and, by extension s 16(1) of the Interpretation Act 1978 (UK), is explained in the following passage fromCraieson Legislation(Daniel Greenberg gen ed) (Thomson Reuters, 12th Ed, 2020) (at p 814): The effect of a repeal unless savings are made is expressed in the following dicta – “I take the effect of repealing a statute to be to obliterate it as completely from the records of Parliament as if it had never been passed; and it must be considered as a law that never existed except for the purpose of those actions which were commenced, prosecuted and concluded while it was an existing law.” [fn: Tindal CJ inKay v Goodwin(1830) 6 Bing. 576, 582] It has long been established that, when an Act of Parliament is repealed, it must be considered (except as to transactions past and closed) as if it had never existed.” [fn: Lord Tenterden inSurtees v Ellison(1829) 9 B. & C. 750, 752] The result is that an offence committed against a penal Act while it was in force could not be prosecuted after the repeal of the Act. [fn:R vM’Kenzie(1820) Russ. & R. 429] And pending proceedings could not be further continued after the repeal, even to the extent of applying for a certificate for costs. [fn:Morgan v Thorne(1841) 7 M. & W. 400;Butcher v Henderson(1868) L.R. 3 Q.B. 335] The position is altered by the Interpretation Act 1978, [fn: 1978 c.30; and similar provisions were included in the Interpretation Act 1889 c.63] ss. 15 and 16 of which deal with the construction and application of one provision which repeals another. Thus s 16(1)(d) and (e) of the Interpretation Act were enacted to reverse the common law rule that an offence committed against a penal provision while it was still force could not be proceeded with after the repeal of the provision. 162 I begin by observing that the existence of provisions equivalent to s 16(1)(d) and (e) of the Interpretation Act in the Interpretation Act 1978 (UK) has not precluded the English courts from passing sentence according to the punishment provisions prevailing at the time of sentencing, irrespective of when the offence was committed. Although the three cases considered at [130]–]133] above did not discuss the relationship between s 16(1)(d) and (e) of the Interpretation Act 1978 (UK) and the English Sentencing Practice, this issue was discussed in the earlier case ofPotter v Manning[1984] Lexis Citation 2023, (1984) Times, 23 March (“Potter v Manning\"). That case concerned changes to the system for disqualification of repeat traffic offenders made by the Transport Act 1981 (c 56) (the “Transport Act 1981 (UK)”) with effect from 1 November 1982. The change involved replacing what was known as the “toting up” system under s 93(3) and (5) of the Road Traffic Act 1972 (c 20) with a “penalty points” system introduced by s 19 of the Transport Act 1981 (UK). The accused was charged with an offence committed on 23 October 1982 and the question was whether the court should apply the old “toting up” system or the new “penalty points” system. In deciding that the new “penalty points” system applied, Glidewell J held that s 16(1)(d) and (e) of the Interpretation Act 1978 (UK) had “no applicability” to the question at hand, reasoning that: …sub-paragraph (d) relates to any penalty or punishment incurred in respect of any offence committed against that enactment, that is to say, the enactment repealed. Sub-paragraph (e) relates to any such penalty or punishment, which can only mean, reading back, a penalty or punishment of the kind referred to in sub-paragraph (d), that is to say, for an offence committed against a repealed enactment. In this case the enactment with which we are concerned which has been repealed, that is to say, section 93(3) and (5) of the Road Traffic Act 1972, is not an enactment which creates or in any way deals with an offence. That section, as my lord has made clear, was part of a group of sections dealing with a particular penalty which might result for the commission of an offence, the penalty being the disqualification from holding a driving licence for a given period of time. Thus, in my view, this case is not concerned in any way with the matter dealt with in section 16(1)(d) and (e) of the Interpretation Act 1978, that is to say, the repeal of a statutory provision which creates or contains within it an offence. 163 The decision inPotter v Manningis summarised inBennionin the following terms (at p 301): …s 16(1)(d) and (e) do not apply where a penalty-creating provision is repealed, but the offence creating provision is not. They only save a penalty, etc for an offenceagainst the enactment repealed. [emphasis in original] Since s 511 of the Pre-2019 Amendment PC was not just a penalty-creating provision but also an offence creating provision, it would seem from the foregoing that s 16(1)(d) and (e) of the Interpretation Actare applicableto the repeal of s 511 of the Pre-2019 Amendment PC. A further question which might be asked is whether s 16(1)(d) and (e) of the Interpretation Act, assuming they apply to the repeal of s 511 of the Pre-2019 Amendment PC, merely apply to preserve the ability to prosecute an offence committed against the repealed s 511 (without also preserving the prescribed punishment) or preserve both the ability to prosecute and the punishment prescribed under the repealed s 511. 164 It is not necessary for me to reach a definitive view on this further question. This is because in either case, the answer to Issue B would still be in the negative. On the one hand, if s 16(d) and (e) of the Interpretation Act were inapplicable to preserve the continued application of the prescribed punishment under the repealed s 511 of the pre-2019 Amendment PC, the answer to Issue B would fall to be determined without regard to s 16(d) and (e) of the Interpretation Act –ie,the answer would be determined through the analysis undertaken at [145]–[158] above, which analysis would lead to Issue B being answered in the negative. On the other hand, if s 16(d) and (e) of the Interpretation Act were applicable to preserve the continued application of the prescribed punishment under the repealed s 511 of the pre-2019 Amendment PC in the present case, this would point towards a negative answer for Issue B “unless a contrary intention appears”. As submitted by the Prosecution, the determination of whether a contrary intention exists would involve an inquiry similar to that applicable under theABUframework. Alternatively, it might involve an inquiry along the lines pursued at [156]–[158] above. Both lines of inquiry would lead to the conclusion that no contrary intention appears, with the result that the negative answer to Issue B is not displaced by any contrary intention. 165 Before leaving the discussion on s 16(1)(d) and (e) of the Interpretation Act, I should make two observations about the Defence’s and the YIC’s submissions. First, I did not agree with the Defence that the term “incurred” in s 16(1)(d) of the Interpretation Act refers to a punishment that has already been imposed by the court as opposed to a punishment which the accused is merely liable to receive from the court in upcoming or pending proceedings for an offence previously committed. Reading the provision in the way suggested by the Defence would leave little or no scope for s 16(1)(d) to apply and effectively render the provision otiose. Second, while I agreed with the YIC that s 16(1)(d) and (e) of the Interpretation Act are framed as provisions dealing with the continued application of a repealed provision after its repeal and not a provision dealing with the retrospective application of a new provision enacted in place of the repealed provision, I did not think that this distinction was of practical significance in the present case. The question of continued application of the repealed s 511 of the pre-2019 Amendment PC and the question of retrospective effect of s 512(3)(a) of the post-2019 Amendment PC are really two sides of the same coin.",
        "Conclusion on Issue A": "122 For the reasons above, I answered Issue A in the negative, and held that, under s 511 of the Pre-2019 Amendment PC, the mandatory minimum sentence for a completed offence had no application to an attempt to commit the offence.",
        "Issue B: Whether s 512(3)(a) of the Post-2019 Amendment PC can be applied retrospectively for the accused’sbenefit": "123 The question of principle underlying Issue B was: if a person had attempted to commit an offencebefores 512 of the Post-2019 Amendment PC came into force and was convicted and sentenced onlyafterit came into force,and assuming Issue A is answered in the affirmative, whether s 512(3)(a) could be applied retrospectively for that person’s benefit. 124 It was a premise of Issue B that Issue A was assumed to have been answered in the affirmative. If Issue A were answered in the negative, then the law on the point arising under Issue A (whether the court is bound to apply the minimum sentence prescribed for the primary offence when sentencing for an attempt) would be the same both before and after the 2019 amendment. In that event, no purpose would be served by exploring whether s 512(3)(a) could be applied retrospectively. Thus, given my decision to answer Issue A in the negative, it was strictly not necessary for me to consider Issue B. Nevertheless, given the time and effort devoted by the parties and the YIC on Issue B, I dealt with it for completeness. In order for the discussion on Issue B in the rest of these grounds to make sense, the discussion proceeds on thehypotheticalbasis that Issue A had been answered in the affirmative.",
        "Overview of relevant legal principles": "125 At this point, it would be useful to provide, by way of background, an overview of some of the legal principles that might be relevant for the resolution of Issue B, before introducing the parties’ and the YIC’s submissions. 126 The starting point is Art 11(1) of the Constitution of the Republic of Singapore (2020 Rev Ed) (“Constitution”), which provided that: No person shall be punished for an act or omission which was not punishable by law when it was done or made, andno person shall suffer greater punishment for an offence than was prescribed by law at the time it was committed. [emphasis added] The effect of the second limb of Art 11(1) of the Constitution is that, if the prescribed punishment for an offence is enhancedafterthe offence was committed butbeforethe offender is sentenced, it would be unconstitutional for the sentencing court to impose the enhanced punishment. Instead, the sentencing court was required by the Constitution to impose the punishment prescribed by the law in force at the time of commission of the offence. However, the converse was not true. If the prescribed punishment for an offence was reduced or made more lenient after the offence was committed but before the offender was sentenced, Art 11(1) of the Constitution wouldnotprohibit the sentencing court from applying the new punishment provision. 127 Sometimes, Parliament expressly legislates that a reduced punishment should apply retrospectively. For example, when the Penal Code (Amendment) Act 2012 (No 32 of 2012) (“Penal Code (Amendment) Act 2012“) repealed and re-enacted s 302 to reduce the punishment for murder under limbs (b), (c) and (d) of s 300 from mandatory death penalty to discretionary death penalty, the transitional provisions in s 4(1)(b) of the Penal Code (Amendment) Act 2012 expressly provided for the new reduced punishment to apply to an offencecommitted beforethe coming into force of the Penal Code (Amendment) Act 2012. In these situations, there was no doubt that the court may and should apply the new, reduced punishment when sentencing for an offence committed before the law prescribing the reduced punishment had come into force. 128 At other times, Parliament reduces the punishment prescribed without enacting relevant transitional provisions. One example was the Penal Code (Amendment) Act 2007, which removed the mandatory minimum sentences for four offences (ie, the offences under ss 379A, 411, 414 and 454 of the PC). The Penal Code (Amendment) Act 2007 contained no transitional provisions. In these situations, a question would arise as to whether the court may apply the reduced punishment when sentencing for an offence committed before the law prescribing the reduced punishment had come into force. While it appeared that this question had not been considered in any published decisions of the Singapore courts, it is one which the English courts have grappled with and given an answer for. UK sentencing practice where prescribed punishment is reduced after commission of offence but before sentencing 129 The English courts sentence according to thelaw prevailing at the time of sentencing, irrespective of when the offence was committed, subject only to the rule that the sentence should not exceed the maximum prevailing at the time the offence was committed. What this means is that, if the prescribed punishment had been reduced between the time of commission of the offence and the time of sentencing, the court would sentence according to the reduced punishment. The English position may be illustrated by reference to three cases. 130 The first case isR v Shaw[1996] 2 Cr App R (S) 278 (“Shaw”). The offender in that case pleaded guilty to four counts of theft. The maximum penalty for theft was reduced from ten years to seven years with effect from 1 October 1992 by s 26(1) of the Criminal Justice Act 1991 (c 53) (UK) (the “CJA 1991”). It appears from the judgment that some, if not all, of the four offences were committed before 1 October 1992. The sentencing judge, in granting leave to appeal, raised the question whether the reduced maximum sentence of seven years should be applied. The English Court of Appeal answered the question in the affirmative. In deciding to apply s 26(1) of the CJA 1991 to offences committed before its commencement, the English Court of Appeal noted that the transitional provisions of the CJA 1991 provided that s 26(3) and (4), whichenhancedthe penalty for some other offences, shall not apply to offences committed before the commencement of those subsections but those transitional provisions were silent on whether s 26(1) applied to offences committed before its commencement. 131 The second case isR v H (J)(Practice Note)[2012] 1 WLR 1416 (“R v H(J)”), a case concerning appeals against sentences by eight different offenders who were convicted of sexual offences committed many years before the offences were uncovered and prosecuted. During the intervening years, the legislative provisions concerning the punishment of these offences had undergone several changes. After considering the relevant authorities, the English Court of Appeal provided the following guidance (at [47]): 47 (a)Sentence will be imposed at the date of the sentencing hearing,on the basis of the legislative provisions then current, and by measured reference to any definitive sentencing guidelines relevant to the situation revealed by the established facts. (b) Although sentence must be limited to the maximum sentence at the date when the offence was committed, it is wholly unrealistic to attempt an assessment of sentence by seeking to identify in 2011 what the sentence for the individual offence was likely to have been if the offence had come to light at or shortly after the date when it was committed.Similarly, if maximum sentences have been reduced, as in some instances, for example theft, they have, the more severe attitude to the offence in earlier years, even if it could be established, should not apply. … [emphasis added] 132 The third case isR v Docherty(Shaun)[2017] 1 WLR 181 (“Docherty”). In that case, the offender was convicted on 13 November 2012 for two counts of wounding with intent to do grievous bodily harm, contrary to s 18 of the Offences against the Person Act 1861 (c 100) (UK). The maximum sentence for this offence is life imprisonment. At the sentencing hearing on 20 December 2012, the offender was sentenced to an indeterminate sentence of imprisonment for public protection (“IPP”) under the Criminal Justice Act 2003 (c 44) (UK) (the “CJA 2003”). By then, the provisions in the CJA 2003 concerning IPP had already been repealed by s 123 of the Legal Aid, Sentencing and Punishment of Offenders Act 2012 (c 10) (UK) (the “LASPO”) with effect from 3 December 2012. However, the transitional provisions set out in the commencement order for the LASPO expressly provided that the coming into force of s 123 was “of no effect in relation to a person convicted before 3 December 2012”. As the offender was convicted before 3 December 2012, this transitional provision preserved the court’s power to impose an IPP sentence on the offender even after the repeal of the IPP provisions. 133 In his appeal against sentence, the offender argued that the transitional provisions in the commencement order were unlawful. One of the grounds he raised was that, since the LASPO implemented a new sentencing scheme that was less severe than the earlier scheme of IPP, it would be contrary to the international principle oflexmitior, which was binding on the English courts pursuant to the European Convention for the Protection of Human Rights and Fundamental Freedoms (the “ECHR”), for the court to apply the earlier scheme. Given the focus of the offender’s submission, the UK Supreme Court naturally devoted a significant portion of its judgment to discuss thelexmitiorprinciple and how it had been applied under the ECHR, which I will not go into. What is of relevance for present purposes is the passage in the UK Supreme Court’s judgment that summarised the English courts’common lawsentencing practice (at [42] and [44]): 42 … English criminal courtssentence according to the law and practice prevailing at the time of sentence, whenever the offence was committed, subject only to scrupulous observance of the lex gravior principle of article 7 [of the ECHR], namely that no sentence must be imposed which exceeds that to which the defendant was exposed that the time of committing the offence. The Scottish practice is the same. … 44 Thus: (a) if the maximum sentence has been increased by statute since the offence was committed, the English court cannot sentence beyond the maximum which applied at the time of the offence, because that is the sentence to which the defendant was at that time exposed (lex gravior); (b)if the maximum sentence has been reduced by statute since the offence was committed, the English court will sentence within the now current maximum… (c) if sentencing practice as to the assessment of the gravity of an offence has moved downwards since the offence was committed, the court should sentence according to the now current view … (d) if a new sentencing option which is arguably less severe is added by statute or otherwise to the menu of available sentences after the commission of the offence but before the defendant falls to be sentenced, that new option will be available to the court in his case, unless the statute expressly otherwise directs; in the Canadian caseR v Johnson[2003] 2 SCR 357 the menu of sentencing options for those presenting a future risk had had added to it a new, and for some offenders a possibly less severe, option of post custody supervision in the community; this was applied to the defendant although his offence had been committed before the change in the law; if such circumstances were to occur in England the result would be the same. [emphasis added] 134 For brevity, I shall refer to the English courts’ common law sentencing practice outlined in the preceding paragraphs as the “English Sentencing Practice”. Principles governing retrospective effect of legislation 135 InABU v Comptroller of Income Tax[2015] 2 SLR 420 (“ABU”), the Court of Appeal, while affirming the presumption against retrospective application as an established common law principle of statutory interpretation, eschewed the “highly technical and formulaic body of rules” precipitated by case law over the years. Instead, determining whether legislation should have retrospective application entails “a single overarching enquiry as to parliamentary intent” which is to be found in the words of the law, its context, and the relevant extrinsic aids to statutory interpretation (ABUat [76]). Only if ambiguity persists may the court proceed to the second step of considering the various presumptions concerning the retrospective application of legislation (ABUat [76]). In this regard, the Court of Appeal endorsed (at [76]) Lord Mustill’s formulation of the presumption against retrospectivity inL’OfficeChefifien Des Phosphates v Yamashita-Shinnihon Steamship Co Ltd[1994] 1 AC 486 (“Yamashita-Shinnihon Steamship Co Ltd”) at 525–526: whether or not the presumption of retrospectivity should apply is a question offairness. This question, in turn, required an assessment of several factors including the degree of retrospective effect, the purpose of the legislation and the hardship of the result. 136 With the foregoing legal landscape in mind, I turn next to the parties’ and the YIC’s submissions.",
        "Conclusion on Issue B": "166 Irrespective of whether Issue B is analysed through the lens of theABUframework or through the lens of the English sentencing practice, and irrespective of whether s 16(1)(d) and (e) of the Interpretation Act are factored into the analysis, the conclusion is the same – s 512(3)(a) could not be applied retrospectively. Consequently, I answered Issue B in the negative.",
        "The sentence to be imposed": "",
        "Brief facts": "167 According to the Statement of Facts, the offences under the First Charge and the Third Charge took place a few weeks apart in or around 2013, when the Victim was only 4 to 5 years old. Themodus operandifor both offences were similar. When the Victim’s mother was not at home, the Accused asked the Victim to follow him into one of the bedrooms in their flat.48Foot Note 48×Statement of Facts at paras 4 and 9.After removing the Victim’s shorts and panties, the Accused attempted to penetrate her vagina with his penis, but was unable to do so because her vagina was too small.49Foot Note 49×Statement of Facts at paras 5 and 9.In relation to the First Charge, the Statement of Facts recorded that the Victim told the Accused that it was painful when the Accused was trying to put his penis into her vagina.50Foot Note 50×Statement of Facts at para 6.In relation to the Third Charge, the Statement of Facts did not expressly mention pain, but recorded that the Accused “rubbed his penis against the Victim’s vagina, and the Victim cried”.51Foot Note 51×Statement of Facts at para 9.On both occasions, the Accused ejaculated outside the Victim.52Foot Note 52×Statement of Facts at paras 6 and 9. 168 It was also recorded in the Statement of Facts, and therefore undisputed, that there were subsequent occasions, up till the time the Victim was in early primary school, where the Accused committed acts of attempted rape against the Victim, but the Victim was unable to particularise these other incidents due to the passage of time and her young age.53Foot Note 53×Statement of Facts at para 11. 169 It was also pertinent to note that two of the TIC offences, which the accused admitted to, involving the accused taking photographs of the Victim’s genitals without her consent, were committed in 2020, seven years after the events of the First Charge and Third Charge. 170 As a result of these offences, the Victim suffered severe psychological harm. She was diagnosed with Adjustment Disorder with Mixed Anxiety and Depressed Mood.54Foot Note 54×Statement of Facts at para 17.She blamed herself for what the accused did to her. She engaged in self-harm. She had intrusive memories of the incidents and exhibited negative feelings of disgust and discomfort. She suffered from attentional and sleep difficulties. Her mood and daily functioning had been affected.",
        "Parties’ submissions": "171 As noted at [10]–[11] above, the Prosecution sought a sentence of eight and a half to nine years’ imprisonment and 12 strokes of the cane for each proceeded charge, with the imprisonment terms running concurrently, while the Defence’s initial written submissions argued for a sentence of six and a half years’ imprisonment and 12 strokes of the cane for each charge, also running concurrently. However, in its third set of written submissions, the Defence submitted that the sentence should be three and a half years and six strokes of the cane for each charge, by analogy with the sentence imposed inPP v BLV[2020] 3 SLR 166 (“BLV”) for the offence of aggravated outrage of modesty under s 354(2) of the PC.55Foot Note 55×Defence’s written submissions dated 24 March 2023 at paras 7–8 and 12. 172 The Defence reasoned that, since the acts of the Accused in the present case was virtually indistinguishable from that inBLV(where the facts involved the accused rubbing his penis against the vagina and anus of the victim), there should not be a huge uplift in the present case compared to the sentence meted out inBLV.The Defence further clarified that this new sentencing submission was made on the basis of the Second Interpretation. If, however, the court were to favour the Third Interpretation, it would stick with its initial submission for six and a half years’ imprisonment on each charge.56Foot Note 56×Transcript of 19 April 2023 at pp 75 to 77.",
        "Dominant sentencing considerations": "173 Given that the proceeded charges concern sexual offences and given the youth and vulnerability of the Victim, general deterrence was a dominant sentencing consideration in this case. Moreover, given the premeditated nature of the offences and the significant number of TIC charges, specific deterrence was also a relevant consideration. Finally, retribution was also a relevant consideration given the severe psychological harm suffered by the Victim.",
        "Relevant sentencing framework": "174 InNg Kean Meng Terence v Public Prosecutor[2017] 2 SLR 449 (“Terence Ng”), the Court of Appeal laid down a three-band sentencing framework for the offence of rape (the “Terence Ngframework”). In the light of the statutory one-half limit in s 511 of the Pre-2019 Amendment PC, it was decided inPublic Prosecutor vRidhaudin Ridhwan bin Bakri and others[2020] 4 SLR 790 (“Ridhaudin”) that, in the case of attempted rape, the sentence should be determined by adapting theTerence Ngframework through halving the sentencing ranges for each of the three sentencing bands of theTerence Ngframework (at [100] and [102]). I refer to this modifiedTerence Ngframework as the “Ridhaudinframework”. The sentencing bands for attempted rape offences under theRidhaudinframework are summarised below: Band 15 – 6.5 years’ imprisonment and 3 strokes of the caneBand 26.5 – 8.5 years’ imprisonment and 6 strokes of the caneBand 38.5 – 10 years’ imprisonment and 9 strokes of the cane 175 As noted at [171]–[172] ]above, the Defence’s final submission was that the sentence should be three and a half years and 6 strokes of the cane for each charge, by analogy with the sentences for aggravated outrage of modesty. I did not accept this submission. While it may be true that, in certain fact situations, the physical acts involved in an offence of outrage of modesty may be very similar to the physical acts involved in an attempted rape offence, the key difference between the two offences is themensrea. This difference inmensreafundamentally affects the seriousness of the offence and the culpability of the offender, thereby calling for different levels of punishment. Instead, the correct approach is to determine the appropriate sentence by applying theRidhaudinframework. As I have answered Issue A in the negative, I applied theRidhaudinframework without regard to any minimum sentences prescribed for the primary offence of aggravated rape.",
        "Offence-specific aggravating factors": "176 The offence-specific aggravating factors in the present case were: (a) Grave abuse of position and authority: The Accused was the Victim’s father. This parent-child relationship was the ultimate relationship of trust, which the Accused had betrayed and abused. (b) Youth and vulnerability of the victim: The Victim was only four to five years old at the time. She was at an age when she was practically defenceless and could not understand what the Accused was trying to do to her. (c) Premeditation: The Accused committed the offences when the Victim’s mother was not at home, and he isolated the Victim by luring her into the bedroom, and closed and locked the door. In the incident which was the subject of the First Charge, the Accused distracted the Victim by instructing her to watch YouTube videos on his mobile phone while he attempted to penetrate her vagina with his penis.57Foot Note 57×Statement of Facts at paras 4–6. (d) Severe psychological harm: This was explained at [170] above. 177 These offence-specific factors would place both proceeded charges in Band 2 of theRidhaudinframework, with a sentencing range of 6.5 to 8.5 years’ imprisonment and 6 strokes of the cane (see [174] above). As the Court of Appeal noted inTerence Ng(at [53]): Band 2 comprises cases of rape which are properly described as being of a higher level of seriousness. Such cases would usually contain two or more of the offence-specific aggravating factors (such as those listed at [44] above), thus underscoring the seriousness of the offence. A paradigmatic example of a band 2 case would be the rape of a particularly vulnerable victim coupled with evidence of an abuse of position (such as where the rape took place in a familial context, as was the case inPP v NF) ([1]supra). Cases which contain any of the statutory aggravating factors and prosecuted under s 375(3) of the Penal Code will almost invariably fall within this band. At the middle and upper reaches of this Band are offences marked by serious violence and those which take place over an extended period of time and which leave the victims with serious and long-lasting injuries physical or psychological injuries. 178 It was undisputed that the offences committed by the Accused on the Victim took place over an extended period of time (see [169] above) and that the Victim was left with long-lasting psychological injuries. This would place the present case in the “middle and upper reaches” of Band 2. There were two other relevant considerations arising from the fact that we are sentencing forattemptedoffences, the punishment for which was subject to the statutory one-half limit. First, the severity of thepsychologicalharm suffered by the Victim in the present case appeared to be not dissimilar in nature and gravity to those suffered by victims of rape. Therefore, although there was reduced harm by virtue of the inchoate nature of the offences (ie, no actual penetration took place), the psychological harm caused to the Victim was by no means insubstantial. This was relevant for determining the indicative starting sentence. Second, it was also relevant to consider the reasons the attempt did not proceed to completion, and the extent that the attempt had progressed towards completion before it was stopped or called off as that would affect the court’s assessment of the culpability of the offender. In the present case, the attempts had progressed almost to completion and were unsuccessful because the Victim’s vagina was too small. 179 In the circumstances, I considered that an appropriate indicative starting sentence of imprisonment would be eight and a half years for each of the proceeded charges, which was at the top end of Band 2 of theRidhaudinframework. As for the appropriate indicative starting sentence of caning, I noted that theRidhaudinframework halves the sentence for caning as compared to theTerence Ngframework, even though s 511 of the Pre-2019 Amendment PC only halved the maximum imprisonment term and did not halve the maximum number of strokes of the cane. I did not think it was wrong in principle for theRidhaudinframework to halve the number of strokes of the cane in this way, as doing so gave effect to the purpose of not punishing an attempt as severely as the completed offence. Nevertheless, since the maximum number of strokes of the cane had not been halved by s 511, there is scope for a sentencing court to exercise greater flexibility in departing from the indicative starting sentence of caning in theRidhaudinframework in appropriate cases. This would allow the court to more accurately capture the seriousness of the offence and culpability of the offender. It would also enable the court to make use of the full range of the sentence of caning prescribed. In this regard, I considered it appropriate to adopt nine strokes as the indicative starting point for each of the proceeded charges in order to take proper account of the factors highlighted at [178] above and send a strong message that society will not tolerate sexual abuse of a child by someone occupying a position of trust and authority over the child.",
        "Offender-specific factors": "180 The three TIC offences were relevant offender-specific aggravating factors. In this regard, I took the Second Charge into consideration for the sentencing of the First Charge and took the Fourth Charge and Fifth Charge into consideration for the sentencing for the Third Charge. 181 The Prosecution also submitted that the Accused’s paedophilic disorder is a relevant aggravating factor.58Foot Note 58×Prosecution’s written submissions dated 8 November 2022 at para 22.In the absence of psychiatric evidence indicating that the Accused’s condition would lead to a higher risk of re-offending, I did not give much weight to this as an aggravating factor. 182 The Prosecution accepted that the Accused elected to plead guilty at a relatively early stage in the proceedings.59Foot Note 59×Prosecution’s written submissions dated 8 November 2022 at para 23.This ought to be accorded due mitigating weight. 183 Balancing the offender-specific aggravating factors against the offender-specific mitigating factors, I calibrated the sentence for each of the proceeded charges downwards to 8 years’ imprisonment and 8 strokes of the cane (subject to possible subsequent adjustments on account of the totality principle).",
        "Global sentence": "184 As the two proceeded charges concerned offences which took place a few weeks apart, they were considered unrelated offences which were subject to the general rule of consecutive sentences for unrelated offences (Public Prosecutor v Raveen Balakrishnan[2018] 5 SLR 799 (“RaveenBalakrishnan”) at [41]). In its written submissions, the Prosecution proposed that the imprisonment terms of the two proceeded charges should run concurrently on account of the totality principle.60Foot Note 60×Prosecution’s written submissions dated 8 November 2022 at paras 3 and 26.The totality principle is a recognised qualification to the general rule of consecutive sentences for unrelated offences (Raveen Balakrishnanat [58] and [65]). In addition, as the general rule of consecutive sentences for unrelated offences is neither invariable nor mandatory, it is sometimes appropriate for a court to choosenotto run the sentences for unrelated offences consecutively (Raveen Balakrishnanat [66]). 185 At the second sentencing hearing, the Prosecution explained its decision to seek concurrent sentences by pointing out that, if the court were to accept the Prosecution’s submission to impose a sentence of eight and a half  to nine years for each charge, an aggregate sentence of 17 to 18 years arrived at by running the two sentences consecutively would not be consistent with the totality principle.61Foot Note 61×Transcript of 19 April 2023 at p 57 (lines 17 to 20).The Prosecution also submitted that, if the court were to accept the Defence’s submission to impose a sentence of six and a half years on each charge, an aggregate sentence of 13 years would not offend the totality principle, and it would be appropriate to run the two sentences consecutively.62Foot Note 62×Transcript of 19 April 2023 at p 57 (lines 27 to 28) and p 58 (lines 6 to 8).The Defence objected to this latter submission by referring to the Prosecution’s indication to the Defence, before the Accused decided to plead guilty, that the Prosecution would be asking for the sentences to run concurrently.63Foot Note 63×Transcript of 19 April 2023 at p 58 (lines 15 to 25).Although the Prosecution responded by explaining that their representation to the Defence was made on the basis of the Prosecution’s sentencing position of eight and a half to nine years, the Prosecution also indicated to the court that they would not be pursuing the point concerning consecutive sentences.64Foot Note 64×Transcript of 19 April 2023 at p 64 (line 21) to p 65 (line 13). 186 I agreed with the Prosecution that the effect of an aggregate sentence of 17 to 18 years would not be consistent with the totality principle. By the same token, an aggregate sentence of 16 years, by running consecutively the two eight-year sentences I had decided to impose, would similarly not be consistent with the totality principle. I also agreed with the Prosecution that an aggregate sentence of 13 years would be proportionate to the offender’s overall criminality;ieit would not offend the totality principle. I therefore had the option to adjust the individual sentences downwards and run them consecutively so as to arrive at an aggregate sentence of 13 years or thereabouts (seeMohamedShouffee bin Adam v Public Prosecutor[2014] 2 SLR 998 at [59] and [61]). As an aside, this option would not have been available had I answered Issue A in the affirmative, as it would then not be possible for me to adjust the individual sentences below eight years. This probably explained why the Prosecution, having taken the position that Issue A should be answered in the affirmative, was constrained to submit that the sentences should run concurrently. 187 I next considered the significance of the Defence’s indication that the Accused had pleaded guilty on the basis of the Prosecution’s representation that it was not seeking an aggregate sentence higher than nine years, and the Prosecution’s indication to the court that it would not be seeking consecutive sentences even if the individual sentences imposed by the court were lower than eight and a half years each (see [185] above). It was held inJanardanaJayasankarr v Public Prosecutor[2016] 4 SLR 1288 at [12] that, because sentencing is ultimately a matter for the court, the defence’s submissions on sentence is not necessarily the lower limit of the sentence which the court may impose and the Prosecution’s submissions on sentence is not the upper limit of the sentence that may be meted out. Consequently, I considered that I was not obliged to run the sentences concurrently, despite both the Prosecution’s and the Defence’s submissions to the contrary. 188 In the light of the foregoing, I decided that the appropriate course of action was to adjust the individual sentences down to six and a half years each, and run them consecutively to arrive at the aggregate sentence of 13 years, which I considered to be proportionate to the Accused’s overall criminality.",
        "Conclusion": "189 For reasons given above, I sentenced the Accused to: (a) six years and six months’ imprisonment and eight strokes of the cane for the First Charge; and (b) six years and six months’ imprisonment and eight strokes of the cane for the Third Charge. 190 The sentences were to run consecutively. The global sentence was therefore 13 years’ imprisonment and 16 strokes of the cane. The commencement of the imprisonment term was backdated to 27 January 2022, the date of his arrest. 191 It remains for me to record my appreciation to counsel for the Prosecution, counsel for the Accused and the YIC for their able submissions and for the invaluable assistance they have provided to the court. Pang Khang ChauJudge of the High Court Kristy Tan Ruyan SC and Sivanathan Jheevanesh (Attorney-General’s Chambers) for the Prosecution; Akesh Abhilash (Harry Elias Partnership LLP) for the accused; Chin Yan Xun (WongPartnership LLP) as young independent counsel.",
        "": ""
    }
}