{
    "case_title": "Hang Huo Investment Pte LtdvWong Pheng Cheong Martin",
    "ncitation": "[2024] SGHC 32",
    "coram": "Kristy Tan JC",
    "sections": {
        "Introduction": "1 HC/OA 633/2023 (“OA 633”) is an application by Hang Huo Investment Pte Ltd (“Applicant”) under s 78(1)(a) of the Insolvency, Restructuring and Dissolution Act 2018 (“IRDA”) for the court to fix the amount to be paid by way of remuneration to Mr Wong Pheng Cheong Martin (“Respondent”), who was appointed by the Applicant’s lender, DBS Bank Ltd (“DBS”), as receiver and manager of the Applicant’s property on 11 April 2023 and discharged from those appointments on 26 June 2023. 2 By an invoice dated 20 June 2023 issued by the Respondent’s firm FTI Consulting (Singapore) Pte Ltd (“FTI”), the Respondent charged for professional services in the amount of $1,358,142.50 plus other charges for expenses and goods and services tax (“FTI Invoice”).1Foot Note 1×Affidavit of Mr He Dingding (“Mr He”) dated 28 July 2023 and filed on behalf of the Applicant on 31 July 2023 (“Applicant’s Affidavit”) at p 34.The Applicant filed OA 633 on 23 June 2023 without serving the application on the Respondent.2Foot Note 2×Applicant’s Affidavit at para 12; Affidavit of the Respondent dated and filed on 21 August 2023 (“Respondent’s 1st Affidavit”) at paras 12 and 22.On 26 June 2023, as part of a redemption exercise where the Applicant was required to repay all sums due to DBS, the Applicant made full payment of the FTI Invoice.3Foot Note 3×Applicant’s Affidavit at para 13.OA 633 thus includes a prayer for an order that the Respondent account for any amount he was paid in excess of the remuneration fixed by the court. The Applicant served OA 633 on the Respondent on 31 July 2023 after obtaining and being dissatisfied with the breakdown of the FTI Invoice provided by the Respondent.4Foot Note 4×Applicant’s Affidavit at paras 15 to 16. 3 The central issues in OA 633 concern the fixing of the remuneration of privately-appointed receivers / managers; and when they should be ordered to account (after being paid) for any amount in excess of the remuneration fixed.",
        "Background": "",
        "The parties": "4 The Applicant is a company incorporated in Singapore. Its only business is the ownership of a hotel known as Link Hotel Singapore (“Link Hotel”) which is sited at 50 Tiong Bahru Road, Singapore 158794 and 51 Tiong Bahru Road, Singapore 158795 (“50 and 51 Tiong Bahru Road”). The Applicant is the registered and beneficial owner of the properties at, and the link bridge (“Link Bridge”) connecting, 50 and 51 Tiong Bahru Road.5Foot Note 5×Applicant’s Affidavit at para 4.The Applicant is wholly owned by Silverine Pacific Ltd (“Silverine”), a British Virgin Islands company, which is in turn wholly owned by Link Holdings Limited (“Link Holdings”), a Hong Kong-listed company.6Foot Note 6×Affidavit of the Respondent dated and filed on 14 November 2023 (Respondent’s 2nd Affidavit”) at p 3076. 5 The Respondent is a Senior Managing Director of the Corporate Finance and Restructuring department of FTI.7Foot Note 7×Respondent’s 1st Affidavit at para 1.",
        "Appointment of the Respondent": "6 In consideration of DBS granting banking facilities to the Applicant, the Applicant mortgaged its interest in 50 and 51 Tiong Bahru Road and the Link Bridge (“Mortgaged Properties”) to DBS pursuant to two mortgages dated 8 August 20088Foot Note 8×Affidavit of the Respondent dated and filed on 29 November 2023 (“Respondent’s 3rd Affidavit) at pp 4 to 18.and 24 January 20189Foot Note 9×Respondent’s 3rd Affidavit at pp 19 to 32.respectively (“Mortgages”). The Mortgages are in similar terms and incorporate certain provisions of DBS’ Memorandum of Mortgage MM/23.10Foot Note 10×Respondent’s 2nd Affidavit at pp 56 to 62. 7 To secure credit facilities granted to it by DBS, the Applicant and DBS executed a debenture dated 30 September 2005 (“Debenture”)11Foot Note 11×Respondent’s 2nd Affidavit at pp 66 to 109.under which the Applicant charged in favour of DBS all its property (including real property situated in Singapore), assets, undertakings and income (“Charged Property”). Under cl 2(A)(2), the Applicant covenanted to pay “on a full indemnity basis” and “on demand” all costs, charges and expenses incurred by, and remuneration payable to, any receiver appointed by DBS pursuant to the Debenture.12Foot Note 12×Respondent’s 2nd Affidavit at p 71 (Debenture at cl 2(A)(2)). 8 Following the Applicant’s default on the payment of sums due under the facilities granted by DBS, DBS and the Respondent executed two Deeds of Appointment dated 11 April 2023. Under one Deed of Appointment, DBS appointed the Respondent as the receiver (“Receiver”) of the Mortgaged Properties (“DOA (Mortgage)”).13Foot Note 13×Respondent’s 1st Affidavit at pp 51 to 54 (DOA (Mortgage)).Under the other Deed of Appointment, DBS appointed the Respondent as the receiver and manager (“R&M”) of the Charged Property (“DOA (Debenture)”).14Foot Note 14×Respondent’s 1st Affidavit at pp 55 to 58 (DOA (Debenture)). 9 It is undisputed that the Respondent’s main task during his appointment was to organise a sale of 50 and 51 Tiong Bahru Road and the Link Bridge by public tender.15Foot Note 15×Respondent’s written submissions dated 17 October 2023 (“RWS”) at para 45; Applicant’s Affidavit at para 25.It is also undisputed that the Respondent’s appointment didnotentailoperatingLink Hotel.16Foot Note 16×Applicant’s Affidavit at para 30; Notes of Arguments (“NOA”) for hearing on 24 October 2023 (“1st OA 633 hearing”) at p 16 lines 27 to 29.Link Hotel was operated, both before and during the Respondent’s appointment, by Link Hotels International Pte Ltd (“LHI”),17Foot Note 17×Respondent’s 1st Affidavit at para 40.a company separate from (albeit related to) the Applicant.18Foot Note 18×Respondent’s 2nd Affidavit at p 3076.",
        "Filing of OA 633 and payment of the Respondent’s fees by the Applicant": "10 The tender exercise began on or around 26 May 2023.19Foot Note 19×Respondent’s 2nd Affidavit at p 3083.Sometime in early June 2023, the Applicant informed DBS that it intended to make full repayment of all sums due to DBS, thereby redeeming the Mortgaged Properties and discharging the Charged Property.20Foot Note 20×Applicant’s Affidavit at para 6.DBS informed the Applicant that (a) as the tender would close on 16 June 2023 and (b) an indication had been given to bidders that the accepted bid would be announced by 20 June 2023, the latest dates the Applicant could serve its redemption notice and complete the redemption were 16 June 2023 and 27 June 2023 respectively.21Foot Note 21×Applicant’s Affidavit at para 7. 11 On 15 June 2023, the Applicant’s solicitors, Dentons Rodyk & Davidson LLP (“DR”) served the Applicant’s redemption notice dated 15 June 2023 on DBS.22Foot Note 22×Respondent’s 1st Affidavit at p 74; Applicant’s Affidavit at pp 26 to 27. 12 On 20 June 2023, Shook Lin & Bok LLP (“SLB”), who had been appointed as solicitors for both DBS and the Respondent,23Foot Note 23×Applicant’s Affidavit at para 9; Respondent’s 1st Affidavit at p 6 and para 51.provided DBS’ Redemption Statement dated 20 June 202324Foot Note 24×Applicant’s Affidavit at p 28 (Redemption Statement).(“Redemption Statement”) to DR together with copies of the FTI Invoice and SLB’s invoice.25Foot Note 25×Respondent’s 1st Affidavit at p 70.The Redemption Statement set out the amounts due and payable by the Applicant to DBS at the expected date of redemption on 26 June 2023. These amounts included fees due to FTI in the total amount of $1,477,546.80, and fees due to SLB in the amount of $253,592.31. 13 According to the Applicant, it was shocked at the fees imposed by the Respondent / FTI but felt that it had no choice but to make full payment of all the sums set out in the Redemption Statement because the Respondent intended to announce the accepted bid pursuant to the tender exercise imminently, and the latest date the Applicant could complete its redemption was 27 June 2023 (see [10] above).26Foot Note 26×Applicant’s Affidavit at para 10.The Applicant felt compelled not to question the fees at that stage in case doing so jeopardised its redemption.27Foot Note 27×Applicant’s Affidavit at para 11. 14 However, the Applicant decided to file OA 633 on 23 June 2023 before making full payment of the sums stated in the Redemption Statement. The Applicant thought that so long as it filed the application prior to paying the Respondent’s fees, it could subsequently seek an account from the Respondent of any excess moneys paid. In the Applicant’s words: in order to preserve [the Applicant’s] rights under s 78(2)(c) and s 78(3) of the [IRDA] (and in particular, to request that the Court require the Respondent to account for any excess monies which the Applicant would be paying to DBS), the Applicant filed OA 633 on 23 June 2023, prior to making payment on 26 June 2023 to DBS of the sums required under the Redemption Statement.28Foot Note 28×Applicant’s Affidavit at para 12. 15 The Applicant did not file a supporting affidavit, serve the originating application for OA 633 (“Originating Application”) or notify the Respondent of OA 633 at the time. 16 On 26 June 2023, the Applicant made full payment of the sums set out in the Redemption Statement including the FTI Invoice. On the same day, DBS removed and discharged the Respondent from his appointments as Receiver of the Mortgaged Properties and R&M of the Charged Property.29Foot Note 29×Applicant’s Affidavit at para 13 and pp 30 to 31. 17 According to the Applicant, it subsequently reviewed the various documents accompanying the Redemption Statement, including the FTI Invoice, and noticed that the Respondent’s fees for “Total Professional Services” were in the sum of $1,358,142.50. No breakdown of this figure was provided in the FTI Invoice. This led the Applicant to request a breakdown from the Respondent (see [20] below).30Foot Note 30×Applicant’s Affidavit at paras 14 to 15. 18 For completeness, the total bill of $1,477,546.80 in the FTI Invoice comprises charges for: (a) professional services in the amount of $1,358,142.50. It is this amount of remuneration that the Applicant challenges as being “manifestly excessive” and “unreasonable”;31Foot Note 31×Applicant’s written submissions dated 19 October 2023 (“AWS”) at paras 8 and 46. (b) expenses totalling $9,956.39; and (c) goods and services tax (“GST”) of $109,447.91.32Foot Note 32×Applicant’s Affidavit at pp 33 to 34 (FTI Invoice).",
        "Procedural history": "19 OA 633 was first fixed for a case conference on 11 July 2023 before the Registrar. On 30 June 2023, the court re-fixed the case conference to 13 July 2023. 20 On 10 July 2023, DR took two steps. At 1.35 pm, DR sent SLB a letter dated 10 July 2023, requesting an itemised bill from the Respondent by 13 July 2023. DR’s letter explained that the breakdown was necessary to enable the Applicant to make an informed decision on the reasonableness of the Respondent’s fees: 1. … [The FTI Invoice] does not contain sufficient material … as to the nature of the said “Professional services” to enable [the Applicant] to judge the reasonableness of the charges of S$1,358,142.50, which our client notes were incurred in just over two months. 2. In order for [the Applicant] to make an informed decision as [to] whether the professional charges … are reasonable, we are instructed by [the Applicant] to request that the professional charges … be itemised, including a breakdown of the time and costs incurred by each insolvency practitioner on each task, ...33Foot Note 33×Respondent’s 1st Affidavit at pp 124 to 125. 21 At 3.26 pm, DR filed a Request for the case conference to be re-fixed to the week of 24 July 2023. DR’s Request explained that OA 633 had been filed to “preserve the Applicant’s rights under section 78, in particular, sections 78(2)(c) and 78(3) of the [IRDA]”, and that the Originating Application had not been served yet as the Applicant was “liaising with the Respondent on the issue of the Respondent’s professional fees with a view to resolving the issues in [OA 633] amicably”.34Foot Note 34×Respondent’s 1st Affidavit at para 14; AWS at para 21(a). 22 On 10 July 2023, the court replied to DR’s Request, re-fixing the case conference to 27 July 2023 and directing that: “Applicant to write in by 24 July 2023 to provide an update on whether this matter has been resolved amicabl[y]. Solicitor to inform other party of the court’s directions.”35Foot Note 35×Respondent’s 1st Affidavit at para 14. 23 On 13 July 2023, SLB provided DR with a breakdown of the FTI Invoice.36Foot Note 36×Respondent’s 1st Affidavit at p 126; Applicant’s Affidavit at para 16 and pp 38 to 40.This breakdown was less detailed than the spreadsheet later filed by the Respondent in OA 633 (“FTI Spreadsheet”).37Foot Note 37×Respondent’s 1st Affidavit at p 128. 24 On 24 July 2023, DR filed a Request for the case conference to be re-fixed to the week of 28 August 2023. DR explained that the Respondent had provided a breakdown of his fees, with which the Applicant did not agree. The Applicant thus wished to proceed with OA 633. DR indicated that it expected to be able to file the supporting affidavit for the application within a week, and would serve the necessary papers on the Respondent thereafter.38Foot Note 38×Respondent’s 1st Affidavit at para 14. 25 On 24 July 2023, the court replied to DR’s Request, directing that the supporting affidavit was to be filed and served on the Respondent by 31 July 2023 and re-fixing the case conference to 31 August 2023.39Foot Note 39×Respondent’s 1st Affidavit at para 14. 26 On 31 July 2023, DR filed and served the Applicant’s Affidavit, with the Originating Application, on SLB.40Foot Note 40×Respondent’s 1st Affidavit at para 14.",
        "The parties’ cases": "27 I set out the broad strokes of the parties’ cases, to be elaborated at the relevant junctures.",
        "The Applicant’s case": "28 First, the Applicant submitted that it is not required to show special circumstances under s 78(3) of the IRDA for the court to order the Respondent to account for any amount of paid remuneration in excess of that fixed (“excess paid remuneration”). This is because OA 633 was filed before the Applicant made payment of the Respondent’s fees.41Foot Note 41×AWS at paras 27 to 29.In the alternative, if special circumstances must be shown, these are present: (a) the Applicant could not jeopardise the redemption of the Mortgaged Properties by querying or disputing the Respondent’s fees reflected in the Redemption Statement; (b) no breakdown of the Respondent’s fees was provided at the time of payment; and (c) the Respondent’s fees areprima facieexcessive, given that his tenure of receivership and management was only 53 working days.42Foot Note 42×AWS at paras 28 and 30. 29 Second, the Applicant argued that the burden of proof is on the Respondent to satisfy the court that his remuneration is justified.43Foot Note 43×AWS at para 35(a). 30 Third, the Applicant contended that the Respondent’s fees are manifestly excessive and unreasonable because: (a) the receivership was not complex. The Respondent did not operate Link Hotel and undertook standard, straightforward and/or administrative tasks in a receivership. There was no need to staff the matter with ten people;44Foot Note 44×AWS at paras 37 to 40 and 48(a).(b) the hourly rates for the Respondent and his team were arbitrary and/or excessive;45Foot Note 45×AWS at paras 41 to 45.and (c) numerous work items were administrative, secretarial or legal in nature for which no or reduced costs should be allowed.46Foot Note 46×AWS at para 46.The Applicant submitted that, disallowing costs for administrative, secretarial or legal work, a figure of $388,287.25 should be deducted from the Respondent’s fees.47Foot Note 47×AWS at para 46.This leaves $969,855.25, to which an overall 75% discount should be applied, resulting in a proposed final amount of $242,463.82.48Foot Note 48×AWS at para 48.In the alternative, the Applicant proposed specific substitute amounts of fees to be awarded for the work items described in the FTI Spreadsheet in lieu of the amounts charged by the Respondent, which total $287,000.49Foot Note 49×AWS at para 49 and Annex C.The Applicant submitted that, on either approach, the proposed quantum is in line with cited precedent cases involving far greater complexity than the present case.50Foot Note 50×AWS at para 50.",
        "The Respondent’s case": "31 The Respondent raised four preliminary objections. First, the Applicant’s Affidavit should be disregarded by the court as the deponent, Mr He, was allegedly not authorised to make the affidavit on behalf of the Applicant.51Foot Note 51×RWS at paras 23 to 27.Second, the Applicant failed to comply with the requirements of the Rules of Court 2021 (“ROC 2021”) for service of the Originating Application and supporting affidavit.52Foot Note 52×RWS at para 19.Third, OA 633 was filed by the Applicant “maliciously and in bad faith”.53Foot Note 53×RWS at paras 7 to 22.Fourth, the Applicant is estopped from taking issue with the Respondent’s fees “at this belated juncture”.54Foot Note 54×RWS at paras 35 to 39. 32 Next, the Respondent submitted that the Applicant is required to show special circumstances under s 78(3) of the IRDA before the court may order him to account for any excess paid remuneration.55Foot Note 55×RWS at para 30.The “special circumstances” requirement means that there must be “some compelling and exceptional reasons” for the court to exercise its power.56Foot Note 56×RWS at para 31.The requirement is to ensure that a receiver / manager is treated fairly and equitably as an applicant is asking the court to order the receiver / manager to account for fees which have already been paid to the receiver / manager.57Foot Note 57×RWS at para 32.The Applicant has not shown any special circumstances save for bare and unsubstantiated assertions that the Respondent’s fees are excessive.58Foot Note 58×RWS at paras 33 and 40. 33 The Respondent also argued that the burden is not on him to justify his fees since he was neither a court-appointed receiver / manager nor the applicant in the present case.59Foot Note 59×NOA for 1st OA 633 hearing at p 14 lines 28 to 30 and p 15 lines 2 to 14. 34 Finally, the Respondent submitted that his fees were “fair, reasonable and proportionate” to the work carried out given the complexity of the receivership.60Foot Note 60×RWS at para 41.The Respondent explained that $1,358,142.50 was incurred based on 1,881.20 hours spent by a ten-person team from FTI (including himself).61Foot Note 61×Respondent’s 1st Affidavit at para 38.He provided the FTI Spreadsheet showing a breakdown of work items and time spent by each person. The date “03-Jun-23” stated at the bottom of the spreadsheet is a typographical error and should read 3 August 2023 instead.62Foot Note 62×NOA for 1st OA 633 hearing at p 21 lines 30 to 32.A copy of the FTI Spreadsheet, with edits made by me in red font to (a) anonymise the names of the Respondent’s team members and (b) insert row numbers for ease of reference, is placed in an annex (“Annex”) to this judgment. 35 A summary table reflecting the ten persons’ respective designations, years of experience, hourly charge-out rates, time spent,63Foot Note 63×Respondent’s 1st Affidavit at para 38.and fees billed by dollar amount64Foot Note 64×Annex, row 72.and as a percentage of the total fees is set out below:  Personnel, designation and years of experienceHourly charge-out rateHours spent% of total time spentFees billed% of total fees billed1) Respondent, Senior Managing Director, 25 years$1,400330.0017.54%$462,00034.01%2) Ms [A], Managing Director, 17 years$1,050119.006.32%$124,9509.2%3) Ms [B], Senior Director, 11 years$975272.7014.5%$265,882.5019.58%4) Ms [C], Director, 8 years$850124.306.61%$105,6557.78%5) Ms [D], Director, 6 years$55010.300.55%$5,6650.42%6) Mr [E], Senior Consultant I, 4 years$480408.7021.73%$88,6086.52%7) Mr [F], Senior Consultant I, 4 years$107,5687.92%8) Mr [G], Consultant II, 3 years$350417.8022.2%$54,6004.02%9) Ms [H], Consultant II, 4 years$91,6306.75%10) Ms [I], Consultant I, 4 years$260198.4010.55%$51,5843.8%Total-1,881.20100%$1,358,142.50100% 36 As observed by the Respondent, 45% of the total time spent on the matter was spent by the more senior members of the team (Director-level and above) and 55% of the total time was spent by the more junior members.65Foot Note 65×Respondent’s 1st Affidavit at para 39.According to the Respondent, the time was spent across four categories of work: (a) “Administrative and Planning”: 205.30 hours (10.91%); (b) “Legal matters”: 80.20 hours (4.26%); (c) “Realisation of Assets”: 1,572.20 hours (83.58%); and (d) “Trading – Employee Issues”: 23.50 hours (1.25%).66Foot Note 66×Respondent’s 1st Affidavit at para 38; RWS at para 44.",
        "Issues to be determined": "37 The preliminary issues for determination are: (a) whether the Applicant’s Affidavit should be disregarded; (b) whether the Applicant breached procedural rules for service of the Originating Application and the Applicant’s Affidavit; (c) whether OA 633 was brought maliciously or in bad faith; and (d) whether the Applicant is estopped from bringing OA 633. 38 Assuming OA 633 should not be dismissed on any of the above grounds, the further issues for determination are: (a) whether s 78(1)(a) of the IRDA applies to the Respondent’s fees billed under the FTI Invoice; and if so, (b) whether special circumstances under s 78(3) of the IRDA must be shown for the court to order the Respondent to account for any excess paid remuneration; and if so, (c) whether special circumstances under s 78(3) of the IRDA are present; and if so, (d) turning to the fixing of the Respondent’s remuneration: (i) whether the Respondent bears the burden of justifying his fees; and (ii) how the Respondent’s remuneration should be fixed.",
        "Whether the Applicant’s Affidavit should be disregarded": "",
        "The Respondent’s arguments": "114 The Respondent’s counsel argued that the Respondent does not bear the burden of justifying his remuneration because: (a)Linda KaoandRe Econmay be distinguished.In those cases, the insolvency professionals were held to bear the burden of proof as they were appointed by the court. In contrast, the Respondent was privately appointed;117Foot Note 117×NOA for 1st OA 633 hearing at p 15 lines 2 to 21.and (b) the Applicant should bear the burden of proof as an applicant usually would.118Foot Note 118×NOA for 1st OA 633 hearing at p 14 lines 28 to 30.However, when asked who would bear the burden of proof had DBS applied to fix the Respondent’s remuneration, the Respondent’s counsel stated that the Respondent would bear the burden. This was because there was a fiduciary relationship between the appointer and appointee and the situation would be akin to a client applying to tax his lawyer’s fees. The Respondent’s counsel submitted that the Respondent only owed a duty to DBS, not the Applicant, as there was a conflict of interests between DBS and the Applicant.119Foot Note 119×NOA for 1st OA 633 hearing at p 15 line 26 to p 16 line 14.",
        "The Applicant’s arguments": "113 The Applicant submitted that the burden of proof is on the Respondent, as the insolvency practitioner, to satisfy the court that his remuneration is justifiable, citingRe Econ Corp Ltd (in provisional liquidation)[2004] 2 SLR(R) 264 (“Re Econ”) at [49].116Foot Note 116×AWS at para 35(a).",
        "Decision": "115 In my judgment, the Respondent bears the burden of justifying his remuneration in this application. This stems from the Respondent owing a duty to account to the Applicant, which arises from his appointment as agent of the Applicant under cl 12(F) of the Debenture. I elaborate. 116 In curial receivership, receivers act as officers of the court. As office-holders, they are fiduciaries with a duty to account. It is part of their duty to account that receivers must explain and, if necessary, account for any reduction in the value of the subject matter of the appointment. This includes sums paid out to them as remuneration, which will necessarily be taken out of the assets of the company they are managing. The implication, which flows as a corollary of the duty to account, is that the burden of proof falls on the receiver to justify the quantum of his fees and any element of doubt as to propriety of remuneration should be resolved against the receiver:Linda Kaoat [24]–[26] and [30]. 117 Where private receivers are appointed as agents of the company, they owe a similar duty to account to the company.Modern debentures and mortgages almost invariably provide that any receiver appointed by the debenture holder or mortgagee shall be the agent of the company:The Law Relating to Receivers, Managers and Administratorsat p 10; Saheran Suhendran bin Abdullah, Lim Tian Huat & Edwin Chew,Corporate Receivership: The Law and Practice in Malaysia and Singapore(Butterworths Asia, 1997) (“Corporate Receivership”) at pp 100 and 102. This serves to reduce the potential liability of the debenture holder or mortgagee for any damaging consequences of the use of the receivership procedure: Gavin Lightmanet al,Lightman & Moss on the Law of Administrators and Receivers of Companies(Sweet & Maxwell, 6th Ed, 2017) at para 1-002. The receiver’s agency must be qualified by the purpose of his appointment,viz, the realisation of the assets of the company primarily for the benefit of the debenture holder or mortgagee. The duties of the receiver towards the company would thus include all the ordinary duties of an agent save for those that are inconsistent with the purpose of his appointment and his primary duty to the debenture holder or mortgagee:Corporate Receivershipat p 108. The fiduciary duty of an agent to account to the company ought to remain, as such a duty does not derogate from the receiver’s duty to the debenture holder or mortgagee:Corporate Receivershipat p 114. 118 InSmithsLtd v Middleton[1979] 3 All ER 842, a company executed a debenture in favour of a bank. Under the debenture, the bank was given power to appoint a receiver and manager who was deemed the company’s agent. The bank appointed the defendant as receiver. The defendant sent to the company two abstracts of his receipts and payments for the period he was receiver, as required under s 372(2) of the 1948 Act. The company was dissatisfied with the figures supplied in the abstracts and required more information. The defendant refused to elaborate on the figures in the abstracts on the ground that he had done all that was required of him under s 372(2) of the 1948 Act. The company brought proceedings against him claiming,inter alia, an account of how the claim by the defendant for fees in respect of professional services rendered was calculated. The defendant’s remuneration had been stated in the abstract as simply a lump sum of £30,000 odd. The preliminary issue of whether the defendant was an accounting party to the company arose for determination. The court found that the receiver was accountable to the company. One reason was that under both s 109(2) of the 1925 Act (which is materially similar to s 29(2) of the CLPA) andthe terms of the debenture, the receiver was deemed to be the company’s agent, “a peculiar sort of agent of course, but nevertheless an agent, and an agent is prima facie an accountable party” (at 846a–b). 119 Similarly, inExpo International Pty Ltd (inliq) & Anor v Chant & Ors[1979] 4 ACLR 679 at 689, the court held that a receiver appointed under deed as the mortgagor’s agent has certain duties towards the mortgagor, including to account to the mortgagor after the mortgagee’s security has been discharged, not only for the surplus assets but also for his conduct of the receivership. In my view, accounting for conduct of the receivership encompasses accounting for remuneration for work done during the receivership. 120 The Respondent’s counsel pointed to the court’s comment inLinda Kaoat [A.36] that there was “less of a fiduciary character” to the office of privately-appointed insolvency practitioners.120Foot Note 120×NOA for 1st OA 633 hearing at p 15 lines 8 to 11.However, the Respondent’s reliance on this comment is misplaced. The court was explaining why out-of-court appointments of insolvency practitioners fell outside the ambit of the costs schedule regime. The court was not suggesting that a private receiver appointed as an agent of the company owed no duty to account to the company. 121 In the present case, cl 12(F) of the Debenture provides that every receiver appointed by the Lender (ie, DBS) “shall be deemed at all times and for all purposes to be the agent of the Borrower [ie, the Applicant] which shall be solely responsible for … the payment of [the receiver’s] remuneration”.121Foot Note 121×Respondent’s 2nd Affidavit at p 99.The Respondent thus has a duty to account to the Applicant for his remuneration, notwithstanding that the Respondent was appointed by DBS. Such a duty does not conflict with the Respondent’s primary duty to DBS as the debenture holder. The implication of such a duty to account is that the burden is on the Respondent to justify his remuneration in this application and any doubts in this regard would be resolved against him. 122 The above conclusion does not turn on which party is the applicant in OA 633. As the applicant in OA 633, what the Applicant must show is that the applicable requirements under s 78 of the IRDA are satisfied. This is a separate matter from the Respondent having to justify his fees during the fixing of his remuneration. Indeed, the Respondent’s counsel conceded that, if DBS applied to fix the Respondent’s remuneration, the burden would be on the Respondent to justify his fees.122Foot Note 122×NOA for 1st OA 633 hearing at p 15 lines 26 to 31.It is no different here where the Applicant has applied to fix the Respondent’s remuneration because the Respondent is the Applicant’s agent and owes a duty to account to the Applicant.",
        "Whether the Applicant breached the rules for service of documents": "",
        "Whether the Applicant brought OA 633 maliciously or in bad faith": "",
        "Whether the Applicant is estopped from bringing OA 633": "",
        "Whether s 78(1)(a) of the IRDAapplies to the fees in the FTI Invoice": "67 Pursuant to s 78(1)(a) of the IRDA, the court may, on the application of a company, by order fix the amount to be paid by way of remuneration to any person who has been appointed as receiver or manager of the property of the company. Section 78(2)(a) extends this power to retrospectively fixing the remuneration for any period before the making of or the application for the order. Section 73(1)(a) provides that Part 6 of the IRDA (in which s 78 falls) applies to every person whois appointed as receiver or manager of the property of a company. It is undisputed, and rightly so, that s 78(1)(a)of the IRDA applies to privately-appointed receivers and managers. 68 In the present case, the parties also assumed that s 78(1)(a) of the IRDA applies in relation to both the Respondent’s appointments as Receiver of the Mortgaged Properties and R&M of the Charged Property. In this regard, however, the parties did not consider the anterior issue of whether s 78(1)(a) of the IRDA would apply in relation to the Respondent’s remuneration as Receiver of the Mortgaged Properties when his appointment as such was made by DBS pursuant to the statutory power conferred by ss 24(1) and 29(1) of the Conveyancing and Law of Property Act 1886 (“CLPA”). 69 Sections 24(1) and 29(1) of the CLPA confer on mortgagees a statutory power to appoint a receiver of the income of mortgaged property. Where a receiver has been appointed pursuant to such statutory power, s 29(6) pertaining to the receiver’s remuneration applies. Section 29(6) of the CLPA states: The receiver out of any money received by him may retain for his remuneration, and in satisfaction of all costs, charges and expenses incurred by him as receiver, a commission at such rate, not exceeding 5% on the gross amount of all money received, as is specified in his appointment, and if no rate is so specified, then at the rate of 5% on that gross amount. 70 InVedaleaseLtd v Averti Developments Ltd and another[2007] 2 EGLR 125 (“Vedalease”) at [99]–[100], the court held that where a receiver was appointed under the statutory power conferred by the Law of Property Act 1925 (c 20) (UK) (“1925 Act”), only the statutory remuneration under s 109(6) of the 1925 Act (which is reproduced inVedaleaseat [85] and is materially similar to s 29(6) of the CLPA) could be imposed: [99] …there is nothing to suggest that section109(6) is intended to be only part of the remuneration of a receiver appointed solely under the statute, and plenty to suggest that it was the totality. A receiver appointed solely under the statute would know and accept that it did the job on that basis; otherwise, it would not accept the appointment. … [100] … the basis of any obligation on the mortgagor to defray a receiver’s costs, charges and expenses lies in the contract by which the mortgagor authorises the mortgagee to appoint a receiver, that is, to make a contract with the receiver that the mortgagor accepts will bind the mortgagor to pay those costs, charges and expenses.Where there is no such express authorisation to the mortgagee because only the statutory power to appoint a receiver is included, it is only, in my judgment, the statutory rate of remuneration that can be imposed on the assets that are otherwise the subject of a mortgagor’s equity of redemption. … [emphasis added] 71 In my view, where a mortgagee appoints a receiver pursuant to the statutory power under ss 24(1) and 29(1) of the CLPA, the provision in s 29(6) of the CLPA for the receiver’s remuneration applies, and there is no room for the court to separately fix such remuneration (including under s 78(1)(a) of the IRDA) independent of what s 29(6) of the CLPA provides.",
        "The Respondent’s appointment as Receiver of the Mortgaged Properties": "72 In the present case, I find that the Respondent was appointed as Receiver of the Mortgaged Properties pursuant to ss 24(1) and 29(1) of the CLPA: (a) The terms of the Mortgages do not confer any power on DBS to appoint a receiver. Instead cl 10(1) of the Mortgages refers to DBS appointing a receiver “in the exercise of its statutory power”,97Foot Note 97×Respondent’s 3rd Affidavit at pp 8 and 27.which must mean the power under ss 24(1) and 29(1) of the CLPA. (b) Recital 3 of the DOA (Mortgage) cites s 24(1) of the CLPA; Recital 5 cites s 29(1) of the CLPA; and Recital 8 concludes that the power of appointing a receiver conferred by s 24 of the CLPA has become exercisable by DBS and DBS wishes to appoint the Respondent to act as Receiver of the Mortgaged Properties.98Foot Note 98×Respondent’s 1st Affidavit at pp 51 and 52.Clause 1 then states: [DBS]pursuant to the powersand provisions contained in the Mortgages orconferred upon it by statuteor by law or otherwisehereby appoints [the Respondent] to act as the Receiver of the Mortgaged Propertiesupon the terms and subject to the powers and provisions contained in the Mortgages.99Foot Note 99×Respondent’s 1st Affidavit at p 52. [emphasis added] While cl 1 is framed widely and mentions provisions in the Mortgages, there are no provisions in the Mortgages containing a power of appointment of a receiver. The relevant power of appointment referred to in cl 1 must be that under ss 24(1) and 29(1) of the CLPA. 73 The Mortgages and the DOA (Mortgage) are also silent on the remuneration of an appointed receiver. In these circumstances, s 29(6) of the CLPA applies. I therefore find that there is no basis for the court to fix the remuneration of the RespondentquaReceiver of the Mortgaged Properties under s 78(1)(a) of the IRDA.",
        "The Respondent’s appointment as R&M of the Charged Property": "74 However, the court may fix the Respondent’s remunerationquaR&M of the Charged Property under s 78(1)(a) of the IRDA since his appointment as such was made by DBS pursuant to its right of appointment under cl 12(A) of the Debenture.100Foot Note 100×Respondent’s 2nd Affidavit at p 95.Recitals 3 and 7 of the DOA (Debenture) also refer to the power conferred by the terms of the Debenture on DBS to appoint a receiver and manager of the Charged Property.101Foot Note 101×Respondent’s 1st Affidavit at pp 55 and 56.Further and pertinently, cl 12(G) of the Debenture provides for the appointed receiver’s remuneration to be agreed between DBS and the receiver.102Foot Note 102×Respondent’s 2nd Affidavit at p 100.",
        "The singular FTI Invoice": "75 The question then arises whether it would be apposite to fix the Respondent’s remuneration as R&M of the Charged Property having regard to the FTI Invoice since it is a singular invoice that does not split up work done by the RespondentquaReceiver of the Mortgaged Properties andquaR&M of the Charged Property. On balance, I find that there is no impediment to doing so. 76 First, in my view, all of the work performed by the Respondent would have fallen under the scope of his role as R&M, which is arguably wider than that of his role as Receiver. Historically, “receivers” were confined to collecting and securing rents, income and profits, whereas “managers” were empowered to also buy, sell and manage the business as a going concern:Kao Chai-Chau Linda v Fong Wai Lyn Carolyn and others[2016] 1 SLR 21 (“Linda Kao”) at [19]. Although this distinction is not often drawn today (Linda Kaoat [19]), it coheres with the narrower powers of the Receiver under the Mortgages as compared to those of the R&M under the Debenture. For example, cl 12(D)(3) of the Debenture expressly confers power on the R&M to sell the Charged Property (of which the Mortgaged Properties are a subset), whereas cl 10(1) of the Mortgages is silent regarding any power of sale on the part of the Receiver.103Foot Note 103×Respondent’s 2nd Affidavit at p 97; Respondent’s 3rd Affidavit at pp 8 and 27 to 28. 77 Second, in all likelihood, the Respondent did not differentiate in his mind which role he was playing (or he considered that he was playing both roles) when carrying out his tasks. This is evident from how the Respondent held himself out as undertaking his main task of organising the tender sale of 50 and 51 Tiong Bahru Road and the Link Bridge inbothhis capacities as R&M and Receiver. For example, an email from the Respondent’s team member to an interested party dated 21 April 2023 states:104Foot Note 104×Respondent’s 2nd Affidavit pp 4055 to 4056. For your information, Mr Wong Pheng Cheong Martin of FTI Consulting (Singapore) Pte Ltd (the “Receiver and Manager”) has on 11 April 2023 beenappointed by DBS Bank Limited as Receiver and Managerpursuant to the legal mortgages and the Debenture dated 30 September 2005 consisting of a first fixed and floating charge over all property and assets of [the Applicant], including and not limited to the mortgaged properties as follows: - 50 Tiong Bahru Road, Singapore 158794 - 51 Tiong Bahru Road, Singapore 158795 - Link Bridge connecting 50 Tiong Bahru Road and 51 Tiong Bahru Road … As part of the [Expression of Interest] process,the Receiver and Managerwishes to highlight some of the main terms on which the potential sale of the Property will proceed: … [emphasis added] 78 The Information Memorandum dated 26 May 2023 for the proposed sale of 50 and 51 Tiong Bahru Road and the Link Bridge (“IM”), prepared by the Respondent’s team, states:105Foot Note 105×Respondent’s 2nd Affidavit at p 3059.  Mr Wong Pheng Cheong Martin of FTI Consulting (Singapore) Pte Ltd, has on 11 April 2023 beenappointed by DBS Bank Limited as Receiver and Managerpursuant to the legal mortgages and the Debenture dated 30 September 2005 consisting of a first fixed and floating charge over all property and assets of [the Applicant], including and not limited to the mortgaged properties as follows: - 50 Tiong Bahru Road, Singapore 158794 - 51 Tiong Bahru Road, Singapore 158795 - Link Bridge connecting 50 Tiong Bahru Road and 51 Tiong Bahru Road …  …The Receiver and Managershall not be personally liable whatsoever in respect of any information or any matter in connection with this IM and will not be able to facilitate any due diligence on any historical or future financial performance of the Property. [emphasis added] 79 Third, it is obvious that the Respondent has not charged the fees in the FTI Invoice based on s 29(6) of the CLPA, but rather, based on the terms of the Debenture, for the entirety of the work undertaken. There is no evidence of what, if any, money he received as Receiver, much less that he billed based on the rate of 5% of the gross amount of all money received (as stipulated in s 29(6) of the CLPA). 80 I will therefore proceed to consider only the part of the Applicant’s OA 633 application pertaining to the remuneration of the Respondent as R&M of the Charged Property, but with reference to the entirety of the professional fees charged in the FTI Invoice.",
        "Whether special circumstances under s 78(3) of the IRDA must be shown": "81 To frame the discussion that follows, I first set out the relevant provisions in s 78 of the IRDA: Power of Court to fix remuneration of receivers or managers 78.—(1) The Court may, on application of — (a) a company or corporation; (b) the liquidator of a company or a corporation; or (c) the person who appointed the receiver or manager, by order fix the amount to be paid by way of remuneration to any person who has been appointed as receiver or manager of the property of the company or of the property in Singapore of the corporation. (2) The power of the Court, where no previous order has been made with respect to that matter — (a) extends tofixing theremunerationfor any period before the making of the order or the applicationfor theorder; … (c) where the receiver or managerhas beenpaid, or hasretained for the remunerationof the receiver or manager,for any period before the making of the order,any amount in excess of thatfixedfor that period— extends to requiring the receiver or manager, or the personal representatives of the receiver or manager,to account for the excessor such part of the excess as may be specified in the order. (3)The power conferred by subsection (2)(c) must not be exercisedin respect of any period before the making of the applicationfor the order, unless in the opinion of the Court there arespecial circumstancesmaking it proper for the power to be so exercised. [emphasis added in italics, bold italics and underlined italics] 82 The parties join issue on whether, the Applicant having paid the FTI Invoice, the court must find that there are “special circumstances” under s 78(3) of the IRDA before it may order the Respondent to account for any amount of paid remuneration in excess of that which the court may fix,ie, to account for excess paid remuneration. Parties’ submissions on this issue were brief.",
        "Whether special circumstances under s 78(3) of the IRDA are present": "",
        "Whether the Respondent bears the burden of justifying his remuneration": "",
        "How the Respondent’s remuneration should be fixed": "",
        "The court’s approach to fixing remuneration": "123 The principles and approach the court will apply in determining the appropriate level of remuneration of insolvency practitioners have been comprehensively covered in the trilogy of casesRe Econ,Liquidators ofDovechem Holdings Pte Ltd v Dovechem Holdings Pte Ltd (in compulsory liquidation)[2015] 4 SLR 955 (“Dovechem”) andLinda Kao. At this juncture, I emphasise three points: (a) The same principles ought to apply to both court- and privately-appointed insolvency practitioners where the court’s determination of the appropriate level of remuneration is sought:Re Econat [44]. (b) The benchmark in the assessment process is fairness, reasonableness and proportionality:Re Econat [49];Linda Kaoat [31]. In essence, the remuneration awarded must be commensurate with the nature, complexity and extent of work which had to be undertaken:Linda Kaoat [38]. The parties agree that this is the relevant inquiry.123Foot Note 123×RWS at para 41; AWS at para 35(a). (c) The court need not accept what is submitted at face value but will carefully scrutinise the facts placed before it, in deciding what aspect of the remuneration claimed is reasonable or justifiable:Re Econat [49]. The court’s inquiry is not limited only to matters over which queries have been raised:Linda Kaoat [42]. 124 In terms of the approach to assessment, the court inDovechemapplied a two-stage approach to determine the level of remuneration allowed. The liquidators had claimed $1,464,097 for work done for approximately 18 months, and in the course of hearing, voluntarily reduced their fees to $1,213,961. (a) In the first stage, the court deducted or discounted fees for specific work items based on principled objections such as unnecessary work and impermissible charging for work done by administrative and support staff (at [79]–[80]). Where it was not possible to determine a precise figure that could be taxed off, the court took “a somewhat rough and ready approach” in deciding on the discount to apply to reduce the amount charged for a specific work item (at [80]). (b) Following the deductions made in the first stage and the liquidators’ voluntary discount, the bill stood at $1,071,122. In the second stage, the court considered whether this remaining amount of fees was as a whole fair and reasonable having regard to the nature and complexity of the matter and work involved (at [83]). As the figure still seemed too high for the work required to be done, the court used the usual broad brush to further discount the fees and awarded $750,000. The court “was cognisant that the liquidators, and perhaps others, may consider this figure to be arbitrary but, since the law does not provide or support a mathematical formula for the calculation of a liquidator’s fees, any award made would be open to the same criticism” (at [84]). 125 A similar approach was taken inLinda Kao. There, receivers and managers sought approval of professional fees of $2.9m for work done over 12 months. They had offered a discount of 30% on their professional fees, which was not accepted by the respondents. (a) The court noted that the receivers and managers’ bill had derived from a calculation of respective time spent multiplied by charge-out rates. The court observed that there had been a general upward lift in the charge-out rates applied by the practitioners (at [85]). However, it was not the role of the court to prescribe, in intimate detail, the appropriate charge-out rates for each practitioner (at [86]). Thus, the court used the discounted figure of $2m supplied by the receivers and managers as a working figure for analysis (at [86]). The court disallowed a claim for $47,250 for an administrative staff’s time costsin toto(at [87]). (b) This left about $1.95m. The court then considered the impact of its views on issues such as unnecessary use of the receivers and managers’ time on certain lawsuits; concerns of over-management; and the fact that many tasks could and ought to have been performed more cost-efficiently (perhaps by administrative staff instead of insolvency practitioners) (at [87]). In this light, a further adjustment was warranted and the court reduced the quantum of remuneration to $1.8m, such that overall, there was a 40% reduction from the original figure claimed (at [87]–[88]). The court acknowledged that the additional discount “may be viewed as being “arbitrary”” [emphasis in original] (at [4]). 126 In the present case, I will broadly adopt the same approach taken inDovechemandLinda Kao. I will consider whether, as a matter of principle, there are issues with the FTI Invoice. Where there are issues with specific work items and deductions or discounts to the fees charged for those items can reasonably be determined, I will apply such deductions or discounts in the first stage. At the second stage, I will then assess whether the reduced bill is fair, reasonable and proportionate in view of (a) the nature and complexity of the matter and the work undertaken, and (b) any concerns of principle which were not addressed by deductions in the first stage. Based on these considerations, I will determine if a further broad-brush discount is warranted. 127 To avoid doubt, I decline to follow the alternative approach proposed by the Applicant of fixing substitute amounts for all respective work items in the FTI Spreadsheet in lieu of the amounts charged by the Respondent (see [30] above).124Foot Note 124×AWS at para 49 and Annex C.The Applicant did not provide any authoritative basis for deriving the substitute amount proposed per item. Such a root-and-branch approach to fixing remuneration would be tantamount to the court deciding in respect of each and every task undertaken by the Respondent what he or his team should actually have done and should actually have charged. I do not think it would be judicious to do so. It is not compatible with the role of the court in the assessment exercise (see,eg, the caution inLinda Kaoat [41]) and not consistent with the approach taken inDovechemandLinda Kao.",
        "Assessment of the appropriate level of the Respondent’s remuneration": "Nature of the matter and work undertaken 128 I reiterate my findings at [110] above regarding the lack of complexity of the nature of the matter and the work undertaken. I gave the Respondent the opportunity to adduce, if he wished, documents which in his view evidenced the work undertaken by him and his team. The Respondent took this opportunity to submit seven bundles of documents comprising 46 documents or categories of documents.125Foot Note 125×Respondent’s 2nd Affidavit at p 3.However, these documents had the contrary effect of impressing on me the lack of complexity of the matter. Three of the seven bundles consisted almost entirely of the Mortgages, Debenture, public announcements of Link Holdings and annual reports / financial statements of the Applicant, Link Holdings and LHI over the years, from which only very select information was the focus of the Respondent. The Applicant’s counsel pointed out at the second hearing of OA 633 and I noted too that repeated documents (eg, documents in relation to the lease of the Mortgaged Properties from the Singapore Tourism Board (“STB”),126Foot Note 126×Respondent’s 2nd Affidavit at pp 2632 to 2681 and 2693 to 2822,cf, pp 3124 to 3303.insurance policies,127Foot Note 127×Respondent’s 2nd Affidavit at pp 2493 to 2510,cf, pp 2560 to 2577,cf, pp 4059 to 4094.tenancy agreements,128Foot Note 128×Respondent’s 2nd Affidavit at pp 2511 to 2530,cf, pp 2538 to 2557,cf, pp 3469 to 3488.a Collaboration Agreement between the Applicant and LHI,129Foot Note 129×Respondent’s 2nd Affidavit at pp 2597 to 2612,cf, pp 3430 to 3445.an Agreement for Services between LHI and the Singapore Land Authority (“SLA”) to use one block as a quarantine facility,130Foot Note 130×Respondent’s 2nd Affidavit at pp 2835 to 2934,cf, pp 3329 to 3428.and email chains131Foot Note 131×Respondent’s 2nd Affidavit at pp 1896 to 1910,cf, pp 3731 to 3745; pp 4143 to 4274.) accounted for a significant volume of the remaining bundles. Overall, the documents were unremarkable and not financially or otherwise complicated. Charge-out rates 129 The Applicant made two criticisms of the charge-out rates of the Respondent and his team. First, citingRe Econat [53] and [56], the Applicant argued that the Respondent’s hourly rate of $1,400 was “high” and “excessive” as “there is no evidence that the Respondent is in the highest echelon of his profession both in terms of experience and standing” and, even if he could prove this, this was not a “truly exceptional case” that warranted him charging $1,400 per hour. The same criticism applied to the next two most senior members of the Respondent’s team, Ms [A] and Ms [B], whose hourly rates were $1,050 and $975 respectively.132Foot Note 132×AWS at paras 43 to 44.In my view, the larger concern behind these criticisms is that the Respondent charged on a time-costed basis which is not reflective of the value of the service rendered but rather of the cost of rendering it (Re Econat [47]). Remuneration should be fixed so as to reward value, not so as to indemnify against cost (Linda Kaoat [32]). From this perspective, the staffing of the matter with four persons charging above or close to $1,000 per hour – the Respondent of 25 years’ experience at $1,400; Ms [A] of 17 years’ experience at $1,050; Ms [B] of 11 years’ experience at $975; and Ms [C] of eight years’ experience at $850 – together accounting for 70.57% ($958,487.50) of the total professional fees billed (see the table at [35] above) is disproportionate to the nature of the matter and the work involved (see the factors cited at [110] and [128] above). I will bear this consideration in mind when determining whether a broad-brush discount is warranted (and if so, in what amount) in the second stage of my assessment. This would be more productive than attempting to dissect the propriety of specific hourly rates since “the court has no basis for gauging if the charge-out rates represent fair market value since there are no fee guidelines issued by local professional bodies against which the rates charged by individual practitioners may be measured” (Linda Kaoat [50]). 130 Second, the Applicant argued that the charge-out rates were “arbitrary” because the designations held by the junior team members were not consistently based on their years of experience. For example, Mr [E], Mr [F], Ms [H] and Ms [I] all had around four years of experience but Mr [E] and Mr [F] held the designation of Senior Consultant I billing at $480 per hour, while Ms [H] was a Consultant II billing at $350 per hour and Ms [I] was a Consultant I billing at $260 per hour. As another example, Mr [G] was a Consultant II billing at $350 per hour when he had only three years of experience in contrast to Ms [H]’s four years of experience.133Foot Note 133×AWS at para 45.I do not accept this argument. The charge-out rates were consistently applied based on designation. The Applicant’s criticism was that the designations did always depend on the number of years of experience of the person in question. However, it is logical, as the Respondent’s counsel submitted,134Foot Note 134×NOA for 1st OA 633 hearing at p 19 lines 11 to 21.that job grades and progression depend on other factors, such as performance, and not just on the number of years of experience. Performance of administrative tasks 131 The court cannot accept that it is proper to be remunerated at several hundred dollars an hour for the performance of administrative tasks (Linda Kaoat [72]). In this regard, the Respondent’s claims for the following work items were problematic. 132“CorpPass matters”: 2.00 hours ($1,236).135Foot Note 135×Annex, row 3.Based on the Respondent’s documents, this pertained to the application for FTI staff to be registered as the Corppass administrator for the Applicant. The application was straightforward but FTI’s application was twice rejected for not including simple documents.136Foot Note 136×Respondent’s 2nd Affidavit at pp 10 to 28.I assess that FTI’s administrative staff could have made the application with minimal supervision by a junior member of the Respondent’s team. I wouldtax off $1,000and allow only $236 for this item. 133“IT related matters”: 3.10 hours ($2,736).137Foot Note 137×Annex, row 4.The Respondent’s affidavits do not explain what these matters were. I agree with the Applicant’s submission that this is in the nature of administrative work.138Foot Note 138×AWS at p 25.The Respondent’s counsel submitted that the IT matters could not have been done by administrative staff as that was “beyond them”.139Foot Note 139×NOA for 1st OA 633 hearing at p 20 lines 9 to 12.The assertion was not substantiated. I consider that the IT staff of FTI could and should have attended to “IT related matters”. I wouldtax off the entire sum of $2,736for this item. 134“Lodgement of documents with ACRA, such as the Notice of appointment, Deed of Appointment, Change of Registered Address”: 4.60 hours ($2,802);140Foot Note 140×Annex, row 19.and “Discharge of receiverships including the relevant lodgement to ACRA”: 14.00 hours ($4,900).141Foot Note 141×Annex, row 20.I agree with the Applicant’s submission that the lodging of documents with the Accounting and Corporate Regulatory Authority (“ACRA”) is an administrative and routine task.142Foot Note 142×AWS at p 27.It could have been handled by FTI’s administrative staff with minimal oversight by a junior member of the Respondent’s team. It is unclear what else “[d]ischarge of receiverships” may have entailed. I wouldtax off $7,000and allow only $702 for these items. 135“Set up and management of users for Virtual Data Room”: 37.80 hours ($13,806).143Foot Note 143×Annex, row 27.The data available for download from the virtual data room was stated as tender documents, STB lease agreements, the Collaboration Agreement with LHI, the Services Agreement with SLA, tenancy agreements for shop units in Link Hotel, current vendor contracts for operations, current licences for hotel operations, building and floor plans, and property tax bill for 2023.144Foot Note 144×Respondent’s 2nd Affidavit at p 3079.The data does not appear extensive. The Respondent averred that access was granted by “[his] team and the IT team of FTI” to a total of 76 email addresses promptly on receipt of a non-disclosure agreement (“NDA”), on a daily basis.145Foot Note 145×Respondent’s 1st Affidavit at para 83.Work done in relation to NDAs was separately charged.146Foot Note 146×Annex, row 31.Setting up and managing the virtual data room should have been primarily led by FTI’s administrative and IT staff with minimal supervision by junior members of the Respondent’s team. I wouldtax off $12,000and allow only $1,806 for this item. 136“Liaise with interested parties and arranging for logistics of site viewings”: 69.20 hours ($34,864).147Foot Note 147×Annex, row 57.This included 4.40 hours ($6,160) incurred by the Respondent at $1,400 per hour, and 8.20 hours ($7,995) incurred by Ms [B] at $975 per hour. However, scheduling and arranging site visits would have been entirely administrative. To further put the charges for this item in context, a separate work item for “Conducting site visits and viewings with interested parties, liaising with hotel management representative etc” totalling 103.70 hours and $61,282.50 in fees was also charged.148Foot Note 148×Annex, row 58.It is disproportionate that the time spent on (and fees incurred for) arranging site visits was more than half of that in respect of the site visits themselves. Additionally, the latter part of the description “Conducting site visits and viewings with interested parties,liaising with hotel management representative etc” [emphasis added] indicates that this other work itemalsoincluded arrangements for site visits. Given these considerations, I wouldtax off the entire sum of $34,864for this item. Duplication of work 137“Preliminary information gathering through publicly available information”: 17.00 hours ($7,640).149Foot Note 149×Annex, row 6.To substantiate this work item, the Respondent exhibited the Applicant’s financial statements for 2016 to 2021, Link Holdings’ financial reports from 2017 to 2022, LHI’s financial statements from 2016 to 2021, Link Holdings’ announcements on the Hong Kong Exchanges and Clearing Limited and The Stock Exchange of Hong Kong Limited and a Circular issued by Link Holdings Limited dated 12 April 2023 titled “Response Document Relating to Mandatory Conditional Cash Offers by Octal Capital Limited on behalf of Ace Kingdom Enterprises Corporation to Acquire All of the Issued Shares and All of the Convertible Bonds of Link Holdings Limited (other than those already owned by Ace Kingdom Enterprises Corporation and parties acting in concert with it)”. The last is a lengthy document that contains half a paragraph mentioning Link Holdings’ prior disclosure of DBS’ demand for repayment of some $50m.150Foot Note 150×Respondent’s 2nd Affidavit at p 1601.I do not see why it was relevant or necessary for the Respondent’s team to review this document. The Respondent would have already been aware of DBS’ demand since it was precisely the Applicant’s failure to repay the moneys demanded that led to the Respondent’s appointment. Further, there is duplication since Respondent separately billed for the review of “Financials” (as part of another work item taking 37.39 hours),151Foot Note 151×Annex, row 45.“historical performance of LHI” (as part of another work item taking 39.47 hours),152Foot Note 152×Annex, row 46.“Announcements made by Link Hotels on HKEX” (13.05 hours)153Foot Note 153×Annex, row 53.and “audited financial statements” (as part of another work item taking 11.10 hours).154Foot Note 154×Annex, row 43.I wouldtax off the entire sum of $7,640for this item. 138“Compiling and consolidating property-related information and technical specifications”: 14.00 hours ($9,155.50).155Foot Note 155×Annex, row 16.There is likely duplication of work done under the separate work items “Property/plan searches e.g. building plans, title, SLA caveats etc” (9.00 hours),156Foot Note 156×Annex, row 37.reviewing “Lease Agreement with STB” (9.50 hours),157Foot Note 157×Annex, row 47.reviewing “Building, floor and site plans” (4.80 hours)158Foot Note 158×Annex, row 49.and “Preparation of property factsheet, summarising the available information of the property to interested parties” (47.21 hours).159Foot Note 159×Annex, row 30.I wouldtax off the entire sum of $9,155.50for this item. 139“Legal matters”: 80.20 hours ($83,662.50).160Foot Note 160×Annex, rows 22 and 23.SLB rendered its own invoice for $253,592.31.161Foot Note 161×Applicant’s Affidavit at para 9 and p 28.Where legal professionals are instructed in the same matter, the onus is on the insolvency practitioner to justify his involvement and that it did not involve duplication of work (Linda Kaoat [59]). The inquiry is whether he could or would have been able to offer any meaningful contribution to the matters conducted by the lawyers (Linda Kaoat [74]). 140 The Respondent averred that he and his team had to “consider the legal advice rendered by SLB and the various legal options available to [them] and to weigh the costs and benefits of the legal advice given”.162Foot Note 162×Respondent’s 1st Affidavit at para 51.The “various legal issues” that they had to “consider and address” included: (a) the Respondent’s powers and liabilities under the Mortgages and Debenture, including the types of information and documents he could request from the Applicant’s directors; (b) the “legal implications on the Applicant” in respect of the tenancy agreements and various licences issued to LHI; (c) the “legal implications” and amendments to the NDAs to be executed by interested parties; (d) the “legal implications of the tender process including the timelines and documentation in relation to the tender sale of the Mortgaged Properties”; (e) the Applicant’s rights in respect of the ownership of the assets in Link Hotel; (f) advice in respect of a caveat lodged against the Mortgaged Properties and the removal of the same; (g) the issuance of a letter of demand to the Applicant’s directors requiring them to provide a proper Statement of Affairs (“SOA”); (h) the legal implications of LHI’s breach of the Collaboration Agreement and the Respondent’s right to terminate the Collaboration Agreement; (i) the legal implications arising from potential breaches and/or termination of the tenancy agreements; (j) meetings with SLB with regard to the tender process; (k) reviewing the tender documents drafted by SLB; and (l) discussions with SLB on the legal implications of the novation of the Agreement for Services between LHI and SLA.163Foot Note 163×Respondent’s 1st Affidavit at para 52. 141 To provide more context to the above list of issues, the Collaboration Agreement set out the fixed and variable distributions LHI was to pay the Applicant in connection with LHI’s operation of Link Hotel, and together with its Addendum totalled only 18 pages.164Foot Note 164×Respondent’s 2nd Affidavit at pp 3430 to 3447.The Tender Document and the draft Confidentiality Agreement were legal documents which would have been prepared by the legal team and, in any event, were only 29 pages165Foot Note 165×Respondent’s 2nd Affidavit at pp 3086 to 3114.and 6 pages166Foot Note 166×Respondent’s 2nd Affidavit at pp 3117 to 3122.respectively. The Respondent also separately billed for work items relating to “Review of debenture/mortgage and deed of appointment documents” (7.40 hours);167Foot Note 167×Annex, row 5.“Correspondence with tenants/occupiers at property, serving letter of demand, following up for recovery of debts” (5.36 hours)168Foot Note 168×Annex, row 42.and review of “Tenancy Agreements with occupiers at Link Hotel” (15.10 hours);169Foot Note 169×Annex, row 50.“Non-Disclosure Agreements with each individual party, review of proposed changes in NDA” (124.15 hours);170Foot Note 170×Annex, row 31.review of “Fixed asset listings to verify ownership of assets” (4.55 hours);171Foot Note 171×Annex, row 51.“Matters related to SOA (e.g. following up for SOA …” (21.00 hours);172Foot Note 172×Annex, row 18.review of “Collaboration Agreement and Addendum with LHI” (11.20 hours);173Foot Note 173×Annex, row 48.and review of “Services Agreement with SLA” (5.83 hours).174Foot Note 174×Annex, row 52.This demonstrates that the Respondent and his team separately billed for many of the underlying matters in respect of which they had received legal advice from SLB. 142 The Applicant submitted that the list of legal issues falls squarely within SLB’s specialist domain and the Respondent and his team would not have been able to value-add in any way. The Applicant found it “inexplicable” that the Respondent “had to expend so much time to “consider” the legal advice rendered by SLB” since a number of the “legal issues” are typical of receivership,eg, the type of information and documents that can be requested from the Applicant. The Respondent did not explain why all the work done in respect of legal matters had been undertaken by the four most senior members of his team and not delegated to the more junior staff. The Respondent failed to exhibit a detailed breakdown of SLB’s fees showing the work done by them and explaining how the legal work undertaken by the Respondent and his team was distinct from and did not overlap with the work undertaken by SLB.175Foot Note 175×AWS at p 28.The Applicant submitted that the charges for this item should be disallowed entirely for being duplicative of legal work.176Foot Note 176×AWS at para 46 and p 28. 143 The court is well-placed to gauge the complexity of legal matters. In my judgment, none of the “[l]egal matters” indicated by the Respondent were complex. There were no ongoing legal proceedings involving the Applicant or the Respondent. SLB had on its part billed $253,592.31, and there is clear duplication of legal work on the Respondent’s part. While I accept that, realistically, the Respondent had to understand the legal parameters within which he operated and it was for the more senior team members to appreciate the legal context, this does not warrant billing $83,662.50 (approximately one third of SLB’s bill) just to consider SLB’s advice on relatively straightforward matters. I wouldtax off $71,000for this item (ie, a discount of about 85%) and allow only $12,662.50 for this item. Overmanning and overservicing 144 “Overmanning” refers to instances of more time being taken to perform tasks than should have been taken (Dovechemat [76]). “Overservicing” is a compendious concept intended to capture all instances in which work is “unnecessary” in the sense that it ought not to have been incurred, given the size of the company and the benefits which were reaped (Linda Kaoat [53]). Having reviewed the Respondent’s affidavits, I am left with a distinct sense that there was a not insignificant degree of overmanning and/or overservicing in the matter. I elaborate with reference to specific instances. 145“Issuance of notifications to directors, government authorities, banks, employees, secretary, other relevant bodies”: 43.20 hours ($21,283).177Foot Note 177×Annex, row 8.The appointment notifications each contained one to two pages of text and comprised: (a) five notifications to the Applicant’s directors and corporate secretary, in similar terms, requesting for their submission of an SOA;178Foot Note 178×Respondent’s 2nd Affidavit at pp 1723 to 1733.(b) one notification to the General Manager of Link Hotel asking for new purchases and payments on behalf of the Applicant to be halted as these would require the R&M’s authorisation;179Foot Note 179×Respondent’s 2nd Affidavit at p 1734.(c) five notifications to government agencies with slight variations in content depending on the agency;180Foot Note 180×Respondent’s 2nd Affidavit at pp 1735, 1741, 1747, 1753 and 1759.(d) one notification to DBS requesting freezing of payment transactions and termination of existing bank token access to the Applicant’s accounts;181Foot Note 181×Respondent’s 2nd Affidavit at p 1765 to 1766.(e) two notifications to insurers asking for redesignation of the insured entity name of insurance policies;182Foot Note 182×Respondent’s 2nd Affidavit at pp 1777 to 1778 and 1839 to 1840.(f) one notification to the Applicant’s auditor requesting a list of records, audit reports, management accounts, schedules and ledgers;183Foot Note 183×Respondent’s 2nd Affidavit at pp 1789 to 1790.(g) seven notifications to tenants with instructions for remittance of monthly rental payments and requests for outstanding rents;184Foot Note 184×Respondent’s 2nd Affidavit at pp 1796 to 1797, 1802 to 1803, 1808 to 1809, 1814 to 1815, 1820 to 1821, 1826 to 1827 and 1832 to 1833.and (h) seven notifications to related companies requesting payment of intercompany balances based on the SOA filed by the Applicant’s directors.185Foot Note 185×Respondent’s 2nd Affidavit at pp 1845 to 1858.While some of these letters would have required some prior investigation before issuance, such as ascertaining the bank accounts, insurance policies, outstanding rents and intercompany balances of the Applicant, it could not have been difficult to find these out – for example, the request for payment of intercompany balances was based on the directors’ SOA (and work on the SOA was separately and quite heavily billed for). In general, the notifications were similar in format and substantive differences between notifications were not major. The matters underlying certain requests made in the notifications were also separately billed,eg, under work items for reviewing “Insurance policies” (6.30 hours);186Foot Note 186×Annex, row 54.reviewing “Tenancy Agreements with occupiers at Link Hotel” (15.10 hours);187Foot Note 187×Annex, row 50.and “[R]eview of SOA… queries to directors on details of debts” (11.10 hours).188Foot Note 188×Annex, row 43.In my assessment, 43.20 hours spent on the issuance of these notifications is an instance of overmanning. 146“Discussions, meetings and correspondences with interested parties” and “Responding to queries raised by interested parties in relation to the specifications of the property as well as the tender”: 569.95 hours ($595,026.50);189Foot Note 189×Annex, rows 59 and 60.and “Updating and maintaining interested parties tracking list based on the calls received, emails sent, EOIs received, NDA”: 77.80 hours ($31,468).190Foot Note 190×Annex, row 33.The bulk of the 569.95 hours for the first item was incurred by the most senior members of the Respondent’s team: 249.85 hours ($349,790) by the Respondent; 65.80 hours ($69,090) by Ms [A]; 115.90 hours ($113,002.50) by Ms [B]; and 22.70 hours ($19,295) by Ms [C]. The Respondent stated that he and his team received “a high volume of queries from third parties who enquired on, among others, the building plan, restrictions on future use of the land space, the gross plot ratio and the financials / projections and the latest asset listing of Link Hotel”.191Foot Note 191×Respondent’s 1st Affidavit at para 71; RWS at para 46.However, as this information had not been made available to the Respondent and his team by the Applicant’s directors, “considerable time had to be spent to gather the necessary information”, and this included: (a) reviewing the announcements made on the Hong Kong Stock Exchange by the Applicant’s parent company for the background of the Link group; (b) constructing an organisation chart; (c) reviewing the historical financial statements of the Applicant to carry out an analysis on the profitability of the business of Link Hotel; (d) research on the redevelopment potential of the Mortgaged Properties; and (e) research on the industry trends in respect of the hotel business in Singapore.192Foot Note 192×Respondent’s 1st Affidavit at para 72; RWS at para 47.Some of the queries received by the Respondent and his team from potential buyers were also “more complex” and “substantial time and effort” had to be expended in attending to these queries.193Foot Note 193×Respondent’s 1st Affidavit at para 73; RWS at para 48.Enquiries from a total of 109 interested parties were received, and about 72 of these interested parties expressed interest in the tender sale of the Mortgaged Properties.194Foot Note 194×Respondent’s 1st Affidavit at para 75; RWS at para 49.As a result of the “sheer volume of queries”, the Respondent’s team maintained a “comprehensive tracking list” to “detail the work carried out by [his] team, summarise specific queries put forward by interested parties and the responses provided and to document follow up actions to be taken”.195Foot Note 195×Respondent’s 1st Affidavit at para 76.There were also numerous queries relating to the contractual terms in the tender documents.196Foot Note 196×Respondent’s 1st Affidavit at para 85; RWS at para 51.The Respondent gave examples of seven meetings / discussions with interested parties.197Foot Note 197×Respondent’s 1st Affidavit at para 86.He averred that the senior team members attended the meetings.198Foot Note 198×Respondent’s 1st Affidavit at para 87. 147 There are difficulties with this narrative. First, the queries and responses adduced by the Respondent as evidence of the work done do not show that the Respondent and his team were engaged in fielding complex queries. In this regard, I reviewed the “tracking list”199Foot Note 199×Respondent’s 1st Affidavit at pp 181 to 187.as well as a category of documents described by the Respondent as “Third Party Requests in respect of the tender sale of the Mortgaged Properties”.200Foot Note 200×Respondent’s 2nd Affidavit at exh “WPCM-10”, tab 42.The Respondent indicated that only samples of correspondence with interested parties were exhibited and that the “tracking list” should be referred to for an exhaustive summary of correspondence with all third parties.201Foot Note 201×Respondent’s 2nd Affidavit at pp 6 to 7 (s/n 42). 148 The “tracking list” showed that many queries were not complicated, such as queries as to whether there was a guide price and for the property and hotel specifications. FTI’s standard response to many queries was that the party should submit an Expression of Interest (“EOI”) or await the IM. For example: (a) FTI’s record of its response to a query for information relating to revenue, expenses, breakdown of all tangible assets and inventory to be sold with the hotel was: “Provided teaser and asked [the party] to submit EOI”.202Foot Note 202×Respondent’s 1st Affidavit at p 182 (s/n 21). (b) FTI’s record of its response to a query for historical hotel operational data, valuation report and holding structure was again: “Provided teaser and asked [the party] to submit EOI”.203Foot Note 203×Respondent’s 1st Affidavit at p 186 (s/n 83). 149 In respect of certain queries which might be considered less run-of-the-mill, FTI’s responses did not substantively address the queries. For example: (a) FTI’s record of its response to a query about where the plot ratio had been obtained from was: “The asset is being sold on a “as is where is” basis. We make no representation nor undertake to seek to enquire any relevant and competent authorities as to the queries raised in your e-mail [sic]. You may wish to make the necessary effort to seek clarification from the relevant authorities in this regard”.204Foot Note 204×Respondent’s 1st Affidavit at p 181 (s/n 6). (b) FTI’s record of its response to queries about whether topping up of the land tenure was allowed and whether the buildings could be demolished and redeveloped was: “This is for the buyers to find out for themselves” and “Potential buyers will need to perform their own due diligence and evaluate these possibilities. R&M makes no representation whatsoever in connection with queries of this nature”.205Foot Note 205×Respondent’s 1st Affidavit at p 182 (s/n 18). (c) FTI’s record of its response to queries on which company held the public securities, the rough transaction size, whether non-public financials would be disclosed and whether at asset-level or company-wide, and how much revenue the asset generated was: “Questions asked … are irrelevant”.206Foot Note 206×Respondent’s 1st Affidavit at p 186 (s/n 73). (d) FTI’s record of its response to queries on whether Link Hotel was under conservation status and whether refurbishment or changes were allowed for the exterior / façade of Link Hotel was: “refer to the terms of the Tender exercise. The asset is being sold on a “as is where is” basis. We make no representation nor undertake to seek to enquire of any relevant and competent authorities as to the questions raised in your e-mail [sic]. It will as such do you well to make the necessary effort to seek clarification from the relevant authorities”.207Foot Note 207×Respondent’s 1st Affidavit at p 187 (s/n 98). 150 To be clear, I make no comment on the validity of the responses. The short point is simply that the complexion of the responses does not suggest that significant time was spent on the queries. It is also odd that the Respondent chose to highlight that there were queries from third parties on “restrictions on future use of the land space, the gross plot ratio and the financials / projections”208Foot Note 208×Respondent’s 1st Affidavit at para 71; RWS at para 46.(see [146] above) when, based on their own tracking list, they did not provide substantive responses (see [148]–[149] above). The actual correspondence that the Respondent chose to exhibit also reveals that none of the Respondent’s responses to queries from interested parties were lengthy, complicated or materially substantive. There was a standard one-page template email the Respondent’s team would use, that set out basic information such as the R&M’s appointment; documents to be submitted for the EOI; main terms of the potential sale; and that an IM was being put together – this was sent in response to many of the queries raised.209Foot Note 209×Eg, Respondent’s 2nd Affidavit at pp 3982 to 3983, 4016 to 4017, 4024 to 4025, 4028 to 4029, 4032 to 4034, 4040 to 4041, 4050 to 4052 and 4055 to 4056.Other common responses involved reiterating that an IM would be sent;210Foot Note 210×Eg, Respondent’s 2nd Affidavit at pp 3981, 3984 to 3985, 4015 and 4036 to 4037.stating that the queries were not within the scope of the Respondent’s appointment or purview;211Foot Note 211×Eg, Respondent’s 2nd Affidavit at pp 3985 and 3991.stating that the party should do its own due diligence or find out the requested information for themselves;212Foot Note 212×Eg, Respondent’s 2nd Affidavit at pp 3985 and 4039.and stating that they were not providing a guide price.213Foot Note 213×Eg, Respondent’s 2nd Affidavit at p 3987. 151 Second, incurring 77.80 hours ($31,468) just tomaintainthe “tracking list” (ie, apart from and on top of actually responding to queries) is excessive. 152 Third, the information-gathering which the Respondent said had to be undertaken in order to respond to the queries was separately billed for under separate work items,eg, reviewing “Announcements made by Link Hotels on HKEX” (13.05 hours);214Foot Note 214×Annex, row 53.reviewing “Financials including management reports, company’s internal records, bank statements etc” (37.39 hours);215Foot Note 215×Annex, row 45.reviewing “Affairs of the property e.g. historical performance of LHI, historical transactions of [the Applicant] for the past 6 months, analysis” (39.47 hours);216Foot Note 216×Annex, row 46.and “Research for information from publicly available sources” (32.90 hours).217Foot Note 217×Annex, row 26. 153 Fourth, no evidence was given of the total number of meetings with interested parties, their duration and the specific attendees from the Respondent’s team at each meeting. All the foregoing considerations impel the conclusion that these work items were instances of overmanning and overservicing. 154“Preparation of Information Memorandum with FAQs”: 152.85 hours ($65,842.50).218Foot Note 218×Annex, row 29.The IM was a simple document in the style of a presentation brochure of 31 pages.219Foot Note 219×Respondent’s 2nd Affidavit at pp 3055 to 3085.The Frequently Asked Questions (“FAQs”) document comprised 13 FAQs in two pages.220Foot Note 220×Respondent’s 2nd Affidavit at pp 3115 to 3116.The information in the IM comprised: (a) information on Link Hotel’s location and surroundings; (b) three pages on Singapore tourism, with information obtained from open sources including STB; (c) information on Link Hotel’s gross floor areas, leasehold tenure, room details, facilities and tenants; (d) a one-page diagram of the group structure of the companies to which the Applicant belonged. One source of this information was stated as “Link Holdings Limited’s HKEX Announcements”;221Foot Note 221×Respondent’s 2nd Affidavit at p 3076.(e) one page on key terms of the Collaboration Agreement between the Applicant and LHI; (f) one page itemising the information in the virtual data room; (g) three pages of “Financial Highlights” on the room revenue and occupancy rates, and the hotel’s revenue and profit performance from 2017 to 2021. The sources of this information were stated to be the Annual Reports of Link Holdings and Financial Statements of LHI from 2017 to 2021 and Annual Report of the Applicant;222Foot Note 222×Respondent’s 2nd Affidavit at p 3080 to 3082.and (h) the indicative tender timeline. 155 I make three points. First, the IM is a simple document and does not appear difficult to prepare. Second, as previously noted (see,eg, [152] above), work done to review the source documents was separately billed. Third, only selective information was required for the IM, which also calls into question the proportionality of time spent on the separately billed items for review of documents. All this indicates overmanning and overservicing in these respects. 156“Non-Disclosure Agreements with each individual party, review of proposed changes in NDA”: 124.15 hours ($56,893.50).223Foot Note 223×Annex, row 31.The Respondent stated that a “standard template NDA” was used for circulation to interested parties,224Foot Note 224×Respondent’s 1st Affidavit at para 80(2).but avers that “a total of 12 interested parties had proposed substantial changes to the NDA” and “quite a bit of time was spent by [his] team in having to review these proposed changes internally and with [their] solicitors”.225Foot Note 225×Respondent’s 1st Affidavit at para 82.The team would also “follow up” with interested parties who did not respond after receiving comments on their proposed amendments and who may have executed the NDA without providing email addresses for the grant of access to the virtual data room.226Foot Note 226×Respondent’s 2nd Affidavit at para 81. 157 However, first, the Respondent did not exhibit any amendments to or comments on drafts of the NDAs so the claim that “substantial changes” had been proposed is not substantiated. Second, their claim does not cohere with the approach evidenced in an email exchange between the Respondent’s team member and an interested party. In that email exchange adduced by the Respondent, Mr [E] told the interested party that the NDA provided by FTI was “a standard template that is applicable to all interested parties”, and FTI was only “prepared to accept minor proposed changes that retain the nature and purpose of the NDA” and were “not in the position to accept any major alterations/additions of clauses”.227Foot Note 227×Respondent’s 2nd Affidavit at p 4010.Given that was their guiding principle, I do not see why much time would have been required to deal with 12 interested parties’ proposed changes to the NDA. Third, the legal team would have provided guidance on the issue of amendments to the NDAs. Fourth, the “follow up” with interested parties described by the Respondent was, in essence, sending chasers and more administrative in nature. Again, overmanning and overservicing are indicated. 158“Media matters, including corresponding with advertisement vendors”: 25.10 hours ($14,864).228Foot Note 228×Annex, row 28.The Respondent averred that this item involved “having to prepare and review the advertisements for the tender sale and arranging for publication of the same” and “liaising and corresponding with a various journalists [sic] who have reached out to [them] for comments on the tender sale”.229Foot Note 229×Respondent’s 1st Affidavit at para 84.However, the Respondent’s documents show only three pages of emails relating to advertising and five brief advertisements all in similar format.230Foot Note 230×Respondent’s 2nd Affidavit at pp 2170 to 2179.No evidence was provided of the number of queries from journalists or the responses (if any) provided by the Respondent. In my view, this is an instance of overmanning. Lack of justification 159 Several billed items lacked justification notwithstanding the Respondent’s burden to justify his fees. 160“Internal discussions on strategy and workstream”: 40.00 hours ($26,233).231Foot Note 231×Annex, row 10.The Respondent did not explain in his affidavits what these discussions entailed or why this amount of time was spent. In oral submissions, the Respondent’s counsel argued that the discussions could not be taking place in silos and hence the time costs of every team member (save one) were included in this item.232Foot Note 232×NOA for 1st OA 633 hearing at p 20 lines 27 to 28.However, this does not explain what the discussions involved, how many discussions were held, or why such extent of discussions was necessary. I agree with the Applicant’s submission that the court could not “verify the accuracy and efficiency” of the time spent on this item.233Foot Note 233×AWS at p 26. 161“Ancillary administrative work”: 5.60 hours ($3,905).234Foot Note 234×Annex, row 12.The Respondent did not explain what this item was for. The only documents exhibited in this connection were the Applicant’s “GST F5 Return” form for January 2023 to March 2023, correspondence on payments made from the Applicant’s bank account, and the Applicant’s Memorandum of Association.235Foot Note 235×Respondent’s 2nd Affidavit at p 4 and exh “WPCM-10”, tabs 15 to 17.It is unclear to what end the latter document was reviewed. 162“Review EOIs/tender documents submitted by interested parties”: 30.40 hours ($28,040);236Foot Note 236×Annex, row 32.and “Tender administration, including opening of tenders in presence of witnesses, tender collection, returning of unsuccessful tenders”: 41.70 hours ($25,146).237Foot Note 237×Annex, row 34.First, there appears to be some overlap between these items. Second, the Respondent did not provide any sampling of the EOIs (which could have been redacted for confidentiality if necessary) or evidence of the number of tenders collected, the number of unsuccessful tenders and what returning them entailed, so these items are unsubstantiated. Third, the time spent is difficult to reconcile with the Respondent’s counsel’s statements that, after the tender closed on 16 June 2023, not much work was done, because the Applicant had served the Notice of Redemption on 15 June 2023; there was still some work in respect of opening up tender bids, but that was not much work (at [110(b)] above). Further, 16 June 2023 was a Friday. There were only two more working days thereafter (19 and 20 June 2023) before the FTI Invoice was rendered on 20 June 2023. Alleged lack of cooperation from the Applicant’s directors 163 One of the work items was for “Liaising with directors, representatives of [the Applicant], LHI for details on ownership of assets, distributions payable to [the Applicant], documents” (30.30 hours).238Foot Note 238×Annex, row 15.The Respondent explained that this amount of time had to be spent as the Applicant’s director was “not forthcoming” with the provision of requested documents, provided some documents in a piecemeal fashion after repeated chasers, provided some incomplete documents and the complete documents only after chasers; and the Respondent’s team had to seek clarification on the information in documents.239Foot Note 239×Respondent’s 1st Affidavit at paras 42 to 47.To the Applicant’s objection that these requests could have been handled by the more junior team members with a more senior member stepping in only after numerous rounds of chasers,240Foot Note 240×AWS at p 27.the Respondent’s counsel submitted that the junior members could not be left to deal with the Applicant’s “difficult” directors.241Foot Note 241×NOA for 1st OA 633 hearing at p 20 lines 1 to 2.As for the item “Matters related to SOA (e.g. following up for SOA, review of draft SOAs, request for supporting documents/further info[rmation]” (21.00 hours),242Foot Note 242×Annex, row 18.the Respondent explained that they had faced “great difficulties in obtaining a proper and completed SOA, notarised affidavit and supporting documents” from the Applicant’s directors; four drafts of the SOA had to be reviewed before the fifth version was finalised and lodged with ACRA.243Foot Note 243×Respondent’s 1st Affidavit at para 46. 164 In light of the personal allegations made against the Applicant’s directors, I offered the Applicant the opportunity for its directors to file an affidavit in response to these allegations. The Applicant decided not to take up this opportunity. Instead, at the second hearing of OA 633, the Applicant’s counsel pointed to emails showing that one of the Applicant’s directors had provided information and documents in response to requests from the Respondent’s team.244Foot Note 244×Respondent’s 2nd Affidavit at pp 2007 to 2042, 2531, 2613, 2627, 2687, 2823 and 2830.Perusing the communications adduced by the Respondent, I did not get the impression that the Applicant’s directors were deliberately uncooperative, but I noted that the Respondent’s team did have to make several rounds of inquiries of the Applicant’s directors and that the SOA also underwent a few iterations before finalisation. In these circumstances, I have not made adjustments to these amounts. However, these two instances in no way transform the matter into a complex assignment. Decision on amount of remuneration allowed 165 Having dealt with the issues of principle in relation the Respondent’s bill, I now apply the two-stage approach to fix the final amount of remuneration. 166 First, a total of $145,395.50 (see [132]–[138] and [143] above) should be deducted from the Respondent’s fees of $1,358,142.50, leaving $1,212,747. 167 Second, I have not made specific deductions for the items reflecting overmanning and/or overservicing and insufficient justification as I do not think the court is placed to determine the specific amounts which should have been charged for those items. However, taking these concerns as well as my views on the lack of complexity of this matter (see [110] and [128] above) in the round, I would apply a further broad-brush deduction and fix the remuneration awarded at$725,000(ie, a broad-brush discount of about 40% from the balance sum of $1,212,747; and an overall discount of about 46.5% from the original billed fees of $1,358,142.50). I consider this to be a fair, reasonable and proportionate amount of fees in all the circumstances of this matter. 168 For completeness, the Applicant also (separate from its alternative approach which I rejected at [127] above) proposed a two-stage approach in which $388,287.25 would be deducted in the first stage for administrative, secretarial and/or legal work, and then a further 75% discount applied to the reduced figure of $969,855.25, arriving at a final figure of $242,463.82 (see [30] above).245Foot Note 245×AWS at paras 46 and 48.In the exercise of my discretion, I arrive at a different set of figures at the first and second stages. I find, in general, the reductions proposed by the Applicant too drastic. Where criticisms levied by the Applicant were germane, I have taken them on board in my assessment of the appropriate level of the Respondent’s remuneration.",
        "Relevance of precedents": "169 The Applicant referred to the following precedents to support its proposed quantum of fees, arguing that these previous cases involved far greater complexity than the present case: (a)Dovechem, where the court fixed the liquidators’ remuneration at $750,000 for work done over 1.5 years. The quantum billed was $1,464,097.00 for 3,483 hours of work by a team of 14. (b)Linda Kao, where the court fixed a receiver and manager’s remuneration at $1.8m for work done over 12 months. The quantum billed was $3.1m for 5,053.50 hours of work by a team of 14. (c) BC 67/2021, where the court fixed the liquidators’ remuneration at $860,000 for work done over 32 months. The quantum billed was $4,629,654.63 for 7,097 hours of work by a team of about 30.246Foot Note 246×AWS at para 50. 170 In my view, precedents on quantum should not be the first port of call, much less determinative, when deciding on the appropriate level of remuneration in a given case. At best, a precedent affording relevant comparison to the case at hand might provide a sense-check for the court at the end, after the court has stepped through the process of assessing the appropriate level of remuneration based on the facts and circumstances of the case. In the present case, I do not consider the precedents cited by the Applicant to be on point where quantum is concerned. I have not referred to them in that regard for my assessment.",
        "Conclusion": "171 In conclusion, I fix the amount to be paid by way of remuneration by the Applicant to the Respondent in respect of his appointment as R&M from 11 April 2023 to 26 June 2023 at $725,000. I order that the Respondent account to the Applicant for the amount in excess of the remuneration fixed,viz, for the amount of $633,142.50 (being $1,358,142.50 less $725,000), as well as the GST paid on that amount. 172 If parties are unable to agree on the costs of this application, they are to file their written submissions on costs, limited to three pages, within one week from the date of this judgment. Kristy TanJudicial Commissioner of the High Court Audrey Chiang, Alwyn Tan and Santhosh V (Dentons Rodyk & Davidson LLP) for the applicant; Ng Yeow Khoon, Claudia Khoo and Fiona Tham (Shook Lin & Bok LLP) for the respondent",
        "Annex": ""
    }
}